[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiuAFodHRwczovL3d3dy5hcHBsZXZhbGxleW5ld3Nub3cuY29tL25ld3MvbG9jYWwtbmV3cy90cmlkZWMtc3RhdGVzLWNvbmNlcm5zLWFib3V0LXJpcHBsZS1lZmZlY3Qtb2YtcGFzY28tYW1hem9uLXdhcmVob3VzZXMtb24tdHJpLWNpdGllcy9hcnRpY2xlXzBhNmZjNTMwLWIxODEtMTFlZC1hZjYwLWUzMjEwN2FmYTE5Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "TRIDEC states concerns about ripple effect of Pasco Amazon Warehouses on Tri-Cities - AppleValleyNewsNow.com",
        "content": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada\n\nZip Code"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiI2h0dHBzOi8vdm9pLmlkL2VuL3RlY2hub2xvZ3kvMjU2NTQ10gEcaHR0cHM6Ly92b2kuaWQvZW4vYW1wLzI1NjU0NQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 14:08:21 GMT",
        "title": "Fresh Wind Creates A Community XRP, Elon Musk Supports Ripple Against The SEC - VOI English",
        "content": "JAKARTA - The much-awaited Hinman document is expected to be released by the SEC soon, and Ripple believes the document can help their legal case. The document is expected to prove that regulators have behaved unfairly in treating Ripple and XRP.\n\nBrad Garlinghouse, CEO of Ripple, used Twitter to express his disappointment at SEC behavior. However, the comments were backed by Elon Musk, who was trusted by many as an act of support for Ripple.\n\nIn a statement on Twitter, Garlinghouse confirmed that \"when the truth finally comes to light, their embarrassing behavior here will surprise you.\" Ripple believes that the SEC has been second in handling this case.\n\nHinman's document can prove that William Hinman, a former SEC official, officially states that Ethereum is not a security. This will show the injustice of regulators in treating Ripple.\n\nPreviously, the SEC refused to provide the document, claiming the privileges of lawyers. However, after six court orders and 18 months, Hinman's documents were finally released. If the document supports Ripple's claim, then Hinman will be guilty of the false oath in court, and Ripple will probably win this case.\n\nElon Musk's comments are seen as support for Ripple and XRP. Previously, Musk had a lot of problems with the SEC, and currently, he is seeking legal reasons to overturn a decision requiring him to get permission from his lawyer before posting about Tesla on Twitter. The decision is part of a decision following securities fraud allegations against Musk and Tesla in 2018.\n\nMusk's comments also sparked excitement among pro-XRPs. They believe that the comments suggest that Musk agrees with Ripple's opinion and will help win the case. However, there is no certainty about how Musk's comments could help Ripple in this case.\n\nThe Ripple-SEC case has been a heated debate among the blockchain community and finance. Ripple and XRP are important companies in the blockchain industry, and their win in this case could have a significant impact on the industry. Now, all eyes are on Hinman documents and further developments in this case.\n\nThe English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. (system supported by DigitalSiber.id)"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LnNwYWNlLmNvbS9ibGFjay1ob2xlLWNvbGxpc2lvbnMtc3BhY2V0aW1lLXJpbmctbm9uLWxpbmVhci1lZmZlY3Rz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Colliding black holes 'ring' across space-time with gravitational wave ripples - Space.com",
        "content": "When black holes collide and merge to form even more massive black holes, this violent process sends ripples surging through the very fabric of space. A new model indicates how these gravitational waves interact with each other as they spread through space-time, the unification of space and time popularized by Albert Einstein's theory of special relativity.\n\nBy presenting a clearer picture of how black hole collisions set space-time \"ringing,\" the model could indicate how scientists on Earth can learn more about the events that launch them using gravitational wave detectors such as the Laser Interferometer Gravitational-Wave Observatory (LIGO). LIGO made the first detection of gravitational waves from merging black holes in 2015, with the signal going on to be named GW150914.\n\nPreviously when physicists have modeled black hole mergers and the gravitational waves they send through space, they have only done so with linear mathematics, without considering how these waves influence or interact with each other as they propagate outwards. By taking these interactions into account, a team of researchers believes they can model black hole collisions greater in detail, revealing what are known as nonlinear effects and putting general relativity to the test when it comes to black holes.\n\nRelated: Black holes: Everything you need to know\n\nThe key to this new supercomputer model, created by the Simulating eXtreme Spacetimes (SXS) team, is simulating these collisions and gravitational waves in more detail to reveal these non-linear effects.\n\n\"Nonlinear effects are what happens when waves on the beach crest and crash,\" California Institute of Technology (CalTech) graduate student and SXS team member Keefe Mitman said in a statement. \"The waves interact and influence each other rather than ride along by themselves. With something as violent as a black hole merger, we expected these effects but had not seen them in our models until now.\"\n\nMitman continued by adding that the SXS team's new methods for extracting the waveforms from their simulations have made it possible to see the nonlinear effects of gravitational wave propagation.\n\nGet the Space.com Newsletter Breaking space news, the latest updates on rocket launches, skywatching events and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nLinear vs nonlinear gravitational wave models\n\nMitman gave an analogy to describe the difference between linear and nonlinear gravitational wave models.\n\n\"Imagine there are two people on a trampoline. If they jump gently, they shouldn't influence the other person that much. That's what happens when we say a theory is linear,\" explained. \"But if one person starts bouncing with more energy, then the trampoline will distort, and the other person will start to feel their influence.\n\n\"This is what we mean by nonlinear: The two people on the trampoline experience new oscillations because of the presence and influence of the other person.\"\n\nIn the new simulations, the black hole collisions produce new types of waves, with Mitman saying that digging deeper under the larger gravitational waves reveals additional new waves with their own unique frequency.\n\nIllustration of two black holes orbiting each other, emitting gravitational waves. (Image credit: Mark Garlick/Science Photo Library/Getty Images)\n\nThe founder of the SXS team is Saul Teukolsky Robinson Professor of Theoretical Astrophysics at CalTech and Cornell University. He was also the first to grasp how to use the equations of general relativity to model the stage of black hole collision called \"the ringdown\" which happens immediately after the two celestial objects have collided and merged and at which point gravitational waves are at their highest amplitude.\n\n\"Supercomputers are needed to carry out an accurate calculation of the entire signal: The inspiral of the two orbiting black holes, their merger, and the settling down to a single quiescent remnant black hole,\" Teukolsky said. \"The new nonlinear treatment of this phase will allow more accurate modeling of the waves and eventually new tests of whether general relativity is, in fact, the correct theory of gravity for black holes.\"\n\nThe SXS team hopes that the findings will set the stage for the next generation of gravitational wave detections which should deepen our understanding of this phenomenon first predicted in 1915 but only detected 100 years later, and of gravity in general.\n\nThe team's research is documented in a paper on the paper repository ArXiv and published Feb. 21 in the journal Physical Review Letters."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LnN0YWxiZXJ0Z2F6ZXR0ZS5jb20vc3BvdGxpZ2h0L3RoZS1ydXJhbC1tZW50YWwtaGVhbHRoLW5ldHdvcmstZW5jb3VyYWdlcy1yaXBwbGVzLW9mLWxvdmUtaW4tdGhlLWNvbW11bml0eS02NTU0NDI20gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 18:55:07 GMT",
        "title": "The Rural Mental Health Network Encourages Ripples of Love in the Community - St. Albert Gazette",
        "content": "As we round up another Valentines Day, let’s take time to reflect on the many ways we all can send a positive ripple of love out to our community.\n\nSending love, appreciation and warmth forward on so many levels not just for the individual you love, but also for your extended family members, neighbours, coworkers, community members in need and strangers that would feel that warmth from the basics of a smile.\n\nHere within St. Albert, there is always a ripple of kindness that once we begin you will never know how many people the positive energy will touch. Let’s continue to send out warmth and love all year.\n\nAsk yourself what or how you or your family could contribute to a positive pivot today. We are blessed to have many non-profit and community organizations that work together to lift mental wellness for us all. Take a moment to reach out and discover some of our hidden gems and the tools they offer could be just what your mental health toolbox needs.\n\nOur community received a tremendous blessing of $40 000 from the Rural Mental Health Project, a division of the Alberta Mental Health Association, this past year. This grant helps inspire community changes, increase awareness of local supports while sending out up lifting messages for all our community members. Through the collaborative efforts of our St. Albert Rural Mental Health Project Animator, Katrina Breau and Animator Jen Becker along with many volunteer efforts created this ripple which continues throughout our community. Katrina, Jen and others were seen at our past Community Expo, International Children’s Festival, The Mental Health Walk, St. Albert Pride Event, Farmers Market, along with additional events shining the light on the importance of mental health supports.\n\n“We are using the month of February to send out ripples of love in the community, as this is the month people are focused on love due to Valentine’s Day. We are encouraging people to embrace the local supports they need, to check in with themselves, their friends and neighbours.”\n\nBreau continues, “The grant empowered us to spread the message of the 8 domains of mental health through visuals on posters in buses and bus shelters, on signs along major commuter routes and on magnets that will go on school and leisure center lockers.”\n\nThese messages help citizens realize they are not alone and where to access help and encourages locals to look out for each other.\n\nBreau explains, “St. Albert has many programs that support overall well-being. We are a community rich in resources – one does not always have to travel to Edmonton for programs or services. Just some of the programs we have right here in St. Albert include Girls on Fire, Stop Abuse in Families (SAiF), The Family Resource Centre, the St. Albert Seniors Association , St. Albert Food Bank and more.”\n\nResidents are also encouraged to use St. Albert’s many amenities to help maintain their well-being. For example, when feeling stressed, try a walk by the river or take a stroll through our many city parks including our newest addition Grey Nuns White Spruce Park, or our two local Provincial parks, River Lot 56 and Lois Hole Centennial Provincial Park. Being out in nature is very healing. Retreats are also a benefit with an affordable option by staying local at our hidden gem, Star of the North Retreat Centre within our community.\n\nTake action and step out of the feelings of being alone in isolation, try joining a new group that offers exercise, socialization, a connection to nature and mental wellbeing for yourself and the whole family such as the St. Albert Trekkers Walking Group, or the St. Albert Sturgeons Junior Forest Warden’s.\n\nChoose to try a new course or offer some volunteer time for others learning English as a second language through another community gem like Further Education Association and Star Literacy.\n\nVolunteering is also a wonderful way to improve your mental health or support the health of others. Many of St. Albert’s well-being programs are run by volunteers – there is always space for those willing to share their time and talents with others. These are all options to decrease isolation and engage the mind.\n\nChoose to unplug to reduce overwhelming feelings we get from being stretched too thin. This can be a great way to recharge and an amazing gift for yourself this year to put into practice. Spend Quality time with the ones you love, blessing them by speaking words of affirmation.\n\nLet’s all transfer that love you feel for our community into additional blessings by offering to give back through Random Acts of Kindness, financial donations no matter how small can all make an amazing difference in aiding our many organizations within St. Albert.\n\nBreau concludes, “This February, think beyond Valentine’s Day. Think about loving yourself. Self-care is very important. Think about how you can show your care to your friends, neighbors and communities. When we send out ripples of love, we all benefit.”\n\nLearn more about RMHN online and on Facebook. Keep an eye out around town as your local Animators post messaging about mental health and click here if you are interested in Community Animator training."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vd3d3LnN0YXJ0bGFuZG5ld3MuY29tLzIwMjMvMDIvd2VkZXZlbG9wbWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "A new credit union on Prospect aims to be the pebble that causes a ripple effect east of Troost - Startland News",
        "content": "A new credit union on Prospect aims to be the pebble that causes a ripple effect east of Troost\n\n‘Moving individuals out of that payday loan cycle into a banking cycle’\n\nThe recent opening of a new credit union with a mission to serve residents of Kansas City’s east side marks a key milestone along “a long road” to build generational wealth for those historically disadvantaged.\n\nSince 2007, Dee Evans has been part of a team working to create a financial institution that would generate economic growth east of Troost, particularly among Black residents, she said.\n\n“We found the need because we looked at the wealth of the residents here east of Troost and [said], ‘How could we bring money back into the community, help individuals create their own generational wealth, and restore and revitalize this community,’” said Evans, vice chair of the board of directors for WeDevelopment Federal Credit Union (WDFCU).\n\nLed by Evans, CEO Gwendolyn Washington, and founder Ajamu Webster, the WeDevelopment team’s primary goal is to provide a banking alternative to predatory lending techniques that keep folks from achieving financial stability, Evans said.\n\n“Our greatest mission is moving individuals out of that payday loan cycle into a banking cycle, offering them the opportunity to manage their own dollars, helping them rebuild their credit, and creating generational wealth within their families and within the community,” she said.\n\nWeDevelopment is working to secure grant funding to offer payday rescue loans, Washington said, which would be a low-interest alternative to payday lenders, and would allow individuals to establish a relationship with reliable financial advisors who could provide them with financial literacy tools.\n\n“Instead of going to a payday lender, we want people to come to us,” Washington said. “Then if we’re able to make that loan, we turn around and teach them how to start putting money aside so that in the event that they have another critical emergency, they don’t need a payday loan, because they can borrow against their own money. That’s just extremely vital.”\n\n‘Let their money work for them’\n\nUnlike a bank, WDFCU has a geographic field of membership, extending from Troost Avenue east to I-435, and from the Missouri River south to Bannister Road/95th Street.\n\nAny individual who lives, works, worships, or attends school within those boundaries is eligible to join the credit union, which opened in January at 3123 Prospect Avenue.\n\nCredit unions are member-owned and not beholden to stakeholders; that focus on the member improves the customer experience, especially when it comes to financial literacy, Washington said.\n\n“Oftentimes, I think when people make poor choices with their money it’s because they don’t understand the way money works,” Washington said. “We’re dedicated to teaching them how to take their money, let their money work for themselves — like paying yourself back — how to start a savings program, and then take that savings and borrow against that.”\n\nWashington, who joined the WeDevelopment team in 2016 after working in both banks and credit unions, said the educational aspect is often absent in a traditional banking environment.\n\n“A lot of times in banks, they don’t really talk about that, because that’s not what they do,” Washington said. “But credit unions, that’s what we do. We’re always about the members because we’re member-owned.”\n\nIn addition to the plans for payday rescue loans, WeDevelopment offers a unique loan program called the Neighborhood Impact Loan, designed to help community members make minor home repairs, Washington said.\n\nHomeowners can apply for a loan that will be considered by WDFCU’s credit committee, and all approved applicants receive the same interest rate, regardless of their credit score.\n\n“Even if your score is 550 and your score is 700, it doesn’t matter to us,” Washington said. “Our goal is to keep the community healthy and strong, and keep people in their houses, so that they don’t lose their houses.”\n\n‘Oftentimes, when you see blight, that’s the problem that you’ve got,” she continued. “People have been in their homes for 35 years, now they’re on a fixed income, and they can’t afford to get a hot water tank, they can’t afford to replace the furnace, but it’s only $5,000. … That’s where we come in.”\n\nWashington also noted that WDFCU offers auto loans, lines of credit, and personal “signature” loans, which are loans that require no collateral for individuals with qualifying credit.\n\nRestoring wealth\n\nWhile these unique lending solutions are critical components of WeDevelopment’s mission, simple deposits and checking accounts are still what makes it all possible, Washington said.\n\n“When people are depositing money into the credit union, that allows us to make loans back to the community, and that’s what’s important, is giving back to the community,” Washington said.\n\n“Oftentimes, we see those of us in this community who do have bank accounts, they’re generally not in the community, so they have to go farther out,” she added. “They’re putting their money there, and that money is not reinvested in their community — it’s invested in the communities they just left.”\n\nShe encouraged anyone who might qualify for membership to open an account — no matter how small — with no pressure to close any existing accounts at other financial institutions.\n\n“We’re not asking anyone to close any other financial institution accounts,” Washington said. “It doesn’t matter where you bank, but just come to us and start a small deposit with us if you care about this community.”\n\nWeDevelopment hopes to capitalize quickly on its growth potential, according to Washington, who believes the credit union could have three branches within five years, each with its own wealth coach.\n\nClick here if you think you may be qualified to join WDFCU as a wealth coach.\n\nFor now, the credit union is focused on growing its first branch as it works to restore wealth for residents of the east side and reinvest in the community.\n\n“It starts with one small drop in the river,” Washington said. “WeDevelopment, we’re that pebble. We’re in the water, and now we’re creating a ripple effect.”"
    }
]