[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LnRoZXJpbmdlci5jb20vMjAyMy8yLzcvMjM1ODkyNzEvaW50cm9kdWNpbmctdGhlLXJpcHBsZS1lZmZlY3QtZm9vdGJhbGwtYW5hbHlzaXPSAWhodHRwczovL3d3dy50aGVyaW5nZXIuY29tL3BsYXRmb3JtL2FtcC8yMDIzLzIvNy8yMzU4OTI3MS9pbnRyb2R1Y2luZy10aGUtcmlwcGxlLWVmZmVjdC1mb290YmFsbC1hbmFseXNpcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Introducing: The Ripple Effect - The Ringer",
        "content": "\n\nJoin James Allcott, a YouTuber, broadcaster, and football enthusiast, as he takes you on a journey through The Ripple Effect, a captivating football podcast. James and his expert guests delve into the complex and far-reaching consequences of the beautiful game, exploring the impact of both current events and pivotal moments from the past.\n\nFrom the pitch to the lives of those involved, every action in football has the potential to create a ripple effect, shaping the outcome of the game and leaving a lasting impression. James and his guests bring a fresh perspective, analyzing the numerous ramifications of the sport and how they have impacted the game we all love.\n\nTune in every week and immerse yourself in the world of football as James Allcott and his guests navigate The Ripple Effect.\n\nSubscribe: Spotify"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8venljcnlwdG8uY29tL2V4LXJpcHBsZS1jdG9zLWZpcm0tZm9yLWNvbnRlbnQtbWljcm8tdGlwcGluZy1jb2lsLXdpbmRpbmctZG93bi13aGF0LWl0LW1lYW5zLWZvci14cnAtZWNvc3lzdGVtL9IBeWh0dHBzOi8venljcnlwdG8uY29tL2V4LXJpcHBsZS1jdG9zLWZpcm0tZm9yLWNvbnRlbnQtbWljcm8tdGlwcGluZy1jb2lsLXdpbmRpbmctZG93bi13aGF0LWl0LW1lYW5zLWZvci14cnAtZWNvc3lzdGVtLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Ex-Ripple CTO’s Firm For Content Micro-Tipping Coil Winding Down: What It Means For XRP Ecosystem - ZyCrypto",
        "content": "Advertisement\n\nCoil, a content monetization platform founded by Ripple’s former chief technology officer Stefan Thomas, is sunsetting. According to Thomas, the blockchain project which supported XRP micropayments in real-time is only bidding farewell but not goodbye.\n\nCoil Bids Farewell\n\nIn an open letter to the community, which Stefan Thomas shared on Twitter on Feb. 2, he explained why the project is sunsetting.\n\nWhile at Ripple, Thomas co-created Interledger, an interoperability protocol that facilitates payments across different networks. This technology, which is open source, was being used as the basis of Coil.\n\nHe notes that when Coil launched in 2018, Interledger was merely an idea. Over the last five years, however, much work has been put into the technology, and a rich ecosystem has grown around it. But “now it’s time to pass the torch to a neutral body in the form of the Interledger Foundation to steward the future development of Interledger,” Thomas said.\n\nCoil has decided to sunset its products and development efforts as part of this evolution. Coil no longer accepts new customer memberships as of Feb 2, 2023, and the San Francisco-based blogging startup will halt its service on March 15, 2023.\n\nAdvertisement\n\nThomas revealed there would be “full-featured Interledger wallets powering web monetization and many other use cases” in the near future.\n\nThomas To Remain Involved In Interledger Development\n\nThe ex-Ripple CTO further noted that his work on the Interledger protocol would continue as he will stay involved as the Chairperson of the Board at the Interledger Foundation.\n\nCoil supported monetization for content creators across literary writing, journalism, music, photography, and podcasts, charging content consumers a $5 monthly subscription fee to access the platform.\n\nAs ZyCrypto reported in August 2019, Ripple’s investment arm, Xpring, participated in Coil’s $4 million seed round and provided a 1 billion XRP grant to the platform — worth over $260 million.\n\nWhen asked by a Twitter user what happened to the quarter of a billion XRP gift from Ripple’s Xpring initiative, Thomas said, “most of it was in the form of a fund that we could draw from. This money never left Ripple. Now that Coil is winding down, I assume they’ll reallocate those funds toward other projects. The biggest drawdown against the fund was the $100m to @Interledger/GftW.”"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3Lmd1cnUzZC5jb20vcmV2aWV3L2JlcXVpZXQtcHVyZS1wb3dlci0xMi1tLTg1MHctYXR4MzAtcHN1LXJldmlldy9wYWdlLTYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Be Quiet! Pure Power 12 M - 850W ATX 3.0 PSU review (Page 6) - guru3d.com",
        "content": "Load testing the PSU\n\nLoad Testing The PSU\n\nTesting a power supply is challenging, and you need professional load testers to check the PSU’s behavior correctly.\n\nThe first basic test is performed with a simple power supply tester. It doesn’t load the PSU with more than a couple of Watts, but it helps determine if the power supply unit is operational. There’s a self-check indicating if the voltages are at the proper levels. As you can see, there have been no issues with the be quiet! Pure Power 12 M 850W (ATX 3.0) unit.\n\nThe following setup was used for the remainder of the testing:\n\nVoltcraft VC-870 Digital Multimeter - voltage measurement (+ Fluke 97 scope meter)\n\nOscilloscope - GW INSTEK GDS 3154\n\nDC load - original solution\n\nFluke 97 Scope meter (a measurement of voltage and ripple),\n\nVoltcraft SL-451 decibel meter (volume measurement)\n\nACUVIM-IIRF – for measuring active power (input from the socket).\n\nPCE Instruments PCE-DT 50 tachometer – for the measurement of the rotational speed of the fan.\n\nMeasurements are taken only using 230 V input voltage.\n\nEfficiency\n\nIn our power supply reviews, we emulate real-world usage by creating such loads as a power-hungry, multi-GPU setup with a powerful CPU would generate. Older components used to require more power, but there has been some press. In a typical configuration, reaching over 500-600 Watts of power draw is difficult. Checking efficiency is a relatively easy thing to accomplish. Let’s take a look at Seasonic Prime’s efficiency first.\n\nIt does look great even at low loads (e.g., 10%, equaling 100 W), which is quite typical of the idle state in modern PCs.\n\nMaximum load\n\nNext is the maximum wattage this unit can hold before switching off.\n\nMaximum Load Efficiency (in %) 1034 W 88.76%\n\nEfficiency looks excellent, even above 100% load. Watts is a great value, but you wouldn’t want to come close to that for very long.\n\nErP Lot 6 Power Off wattage\n\nWe looked at the powered-off status (ErP/EuP), productivity mode (when we stress the CPU), and gaming. The lower the wattage, the more efficient the PSU. It is that simple.\n\nErP Lot 6 Power Off value in Watts 850 W 0.08\n\nThis is well below the 0.5 W requirement.\n\nRipple testing\n\nFirst up is the ATX12V V2.2 specification for DC output ripple:\n\nATX12V Ver 2.2 Noise/Ripple Tolerance Output Ripple (mV p-p) +3.3 V 50 +5 V 50 +12 V 120\n\nThe be quiet! Pure Power 12 M 850W (ATX 3.0) 850 W achieved the following results:\n\nAC Ripple (mV p-p) +3.3 V +5 V +12 V 85 W (10%) 8 10 8 212,5 W (25%) 10 12 10 425 W (50%) 9 11 17 637,5 W (75%) 12 15 16 850 W (100%) 14 18 21\n\nThe values are very well within tolerance. Even in the worst-case scenario (100% load), it is not even a quarter of the allowed number, so this is not worrying."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LnRlY2hub2xvZ3luZXR3b3Jrcy5jb20vYW5hbHlzaXMvbmV3cy93aHktZG8taWNpY2xlcy1oYXZlLXJpcHBsZXMtMzY5OTU50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "Why Do Icicles Have Ripples? - Technology Networks",
        "content": "Read time: 2 minutes\n\nWinter is coming to an end; the last nights of below zero temperatures are here. In the morning, one still spots the occasional icicle on a gutter or car bumper. When you look at these icicles carefully, you may notice that they show a characteristic pattern of ripples – always around one centimetre wide. What causes these ripples? Using an icicle machine of their own design, physicists and chemists from the University of Amsterdam investigated this question, and discovered that salt plays an important part in the formation process of the ripples.\n\n\n\n\n\nThe research was carried out by PhD student Menno Demmenie and his colleagues of the Institute of Physics and the Van ’t Hoff Institute for Molecular Sciences at the University of Amsterdam. The results were published in the scientific journal Physical Review Applied last week.\n\n\n\n\n\nIcicle machine\n\n\n\n\n\nTo carry out the research, Demmenie and his colleagues built an actual icicle machine. ‘In a large freezer with a window, we spent a few weeks becoming true icicle growth specialists’, Demmenie recalls. ‘The difficult question was how fast water must be added to make a nice icicle. If the water flows too quickly, one loses a relatively large amount of water, turning the floor of the freezer into a sheet of ice. On the other hand, if the flow of water is dialed down too much, the icicle tends to grow upward, like a stalagmite. Eventually we discovered that the optimal rate of growth occurs using an inflow of sixty millilitres per hour, at a temperature of -15 °C. This is comparable to a faucet dripping roughly once every three seconds.’\n\n\n\n\n\nOnce the correct inflow of water was found, the researchers could proceed. Using their machine they made many different icicles, under different circumstances and with different types of water. In the end, the crucial factor in the formation of icicle ripples turned out to be the concentration of salt in the water that was used. The image below shows icicles with different concentrations of salt, from an icicle made of extremely pure water (left) to icicles in relatively salty water (right). With the increase of the concentration of salt, the ripples on the icicles became more clearly visible.\n\nWant more breaking news? Subscribe to Technology Networks’ daily newsletter, delivering breaking science news straight to your inbox every day. Subscribe for FREE\n\n\n\nThe researchers used a clever trick to investigate the role that salt plays in the formation of icicles. When the water forming an icicle freezes, salt molecules get pushed out of the ice as ‘impurities’. As a result, most of the salt is found in a thin layer of liquid water on the outside of the icicle. The scientists added a colouring agent to the water they used, which underwent the same process as the salt molecules. This allowed them to nicely visualize where the liquid salty water was present.\n\n\n\n\n\nRipples explained\n\n\n\n\n\nIn this way, it was discovered that the flow of liquid water caused the ripples to appear. Using pure water, the layer of salty liquid water around the icicle was absent, and the formation process looked more like a dripping candle. When saltier water was used, the icicle was surrounded by a thin film of liquid, salty water, and the flow of that water created the regular ripples. The more salt the water contained, the stronger the process, causing thicker ripples to eventually form.\n\n\n\n\n\nIn nature, water always contains a small concentration of salt. This explains the beautiful structures we find on our gutters and car bumpers in the morning – rippled by a thin layer of slightly salty water that was at work throughout the night.\n\n\n\n\n\nReference: Demmenie M, Reus L, Kolpakov P, Woutersen S, Bonn D, Shahidzadeh N. Growth and Form of Rippled Icicles. Phys Rev Appl. 2023;19(2):024005. doi:10.1103/PhysRevApplied.19.024005\n\n\n\n\n\n\n\n\n\nThis article has been republished from the following materials. Note: material may have been edited for length and content. For further information, please contact the cited source."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3Lmxld2lzc2lsa2luLmNvbS9lbi9pbnNpZ2h0cy90aGUtcmlwcGxlLWVmZmVjdC1ob3ctc3RyaWtlcy1hcmUtYWZmZWN0aW5nLXRoZS13aWRlci13b3JsZC1vZi13b3Jr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Feb 2023 08:00:00 GMT",
        "title": "The ripple effect: how strikes are affecting the wider world of work - Lewis Silkin",
        "content": "After battling through the challenges of the pandemic, employers may feel well prepared for dealing with the disruption that strikes pose to their business operations and staffing arrangements. Yet the issues, both from an employee relations and a legal perspective, are slightly different. From dealing with a closed school to last minute travel cancellations, there are various issues to consider.\n\nPublic Sector Strikes\n\nOn 1 February public sector workers across sectors including teaching, the civil service and further education, took to the picket lines. This was, of course, just part of a wave of strikes that appears only to be expanding in scope, with the fire service now looking to be affected. As the action impacts on the services that are fundamental to our day to day lives, knock on effects to people’s home and working lives are inevitable.\n\nTransport disruption\n\nStrike action by train drivers on 1 and 3 February resulted in the significant service disruption that has already been seen in previous months. In the north of England, these strikes compound existing problems caused by a network in meltdown.\n\nWith commuter trains inevitably impacted, many workers may struggle to get into the office. In the post pandemic world, hybrid working provides an obvious and effective solution. But what about those who cannot work from home, or when their attendance in person that day is imperative?\n\nCommunication and flexibility is likely to be key here. Employers will need to speak to employees about what their expectations are around attending the workplace in the face of strikes and discuss alternative options.\n\nHaving a written policy which directly addresses the employer’s expectations around both expected and unexpected transport delays is helpful. This would encourage consistency of treatment between different teams and help staff to understand what is expected of them. That said, employers should be sensitive to individual needs: significantly extended travel time in the face of strike disruption is likely to be a greater challenge for those with caring responsibilities and rigid commitments outside their normal working day.\n\nSchool closures\n\nParents in England and Wales have now joined those in Scotland in experiencing flashbacks to ‘home schooling’ as thousands of schools closed last week as a result of teachers’ strikes. This time there is no furlough scheme or work from home mandate, so although the arrangement may feel uncomfortably familiar, the legal position is quite different.\n\nThose with young children or those who cannot work from home may well need to take the day off and the statutory entitlements of parents in this scenario are interesting. We have previously written about the extent to which the law enables employees in the UK to take time off when they need in order to accommodate personal and family commitments, and this is a case in point.\n\nEmployees have a statutory right to take a reasonable amount of unpaid time off which is necessary “because of the unexpected disruption or termination of arrangements for the care of a dependant”. How does this apply in the context of industrial action? Employers should be given at least 14 days’ notice of strike action by the unions, begging the question whether such disruption could be considered “unexpected”. But union members do not have to tell their employer whether or not they will be striking, meaning that the impact on individual schools may not be known in advance and notifications to parents might only be made at the last minute.\n\nThis is clearly a grey area, but as statutory time off to care for dependants is unpaid, employees may look to other options in any event. Some employees may prefer to take annual leave and others may benefit from a company policy which offers a number of days’ paid leave in this kind of scenario or flexibility in hours to fit around childcare. Again, a clear policy that is applied consistently, could be important here and employers should check whether their policy is clear as to whether school closures would be within scope.\n\nHealth service strikes\n\nAs with trains, health service strikes must be seen in the context of a service that is already under significant strain. Longer waiting lists and treatment delays were perhaps already being felt in the workplace, with some staff awaiting procedures off work or others working below their potential. Now nursing strikes are also impacting on medical appointments and planned procedures. Employees (whether on sick leave or at work), may experience some non-urgent procedures being cancelled at the last minute. In these circumstances employers will have to be flexible in accommodating these and also carefully assess whether such employees are fit to work whilst they await the procedure being re-arranged.\n\nStrikes in critical services such as ambulances could present a different challenge to some employers. During previous ambulance strikes NHS leaders urged the public to avoid risky activities given the potential delays in receiving emergency care. Clearly a day to avoid a team building adrenaline activity. But more seriously, a shortage of ambulances could be something for employers operating in more inherently dangerous industries to factor into health and safety risk assessments. Or what if an employee is nervous about the higher risk of an accident if commuting compared to if working from home at a time when emergency service cover is threatened?\n\nOn this, the pandemic saw a rise in claims relating to avoiding serious and imminent danger in the workplace, provisions in the Employment Rights Act that were previously only rarely used. All employees have a statutory right not to be subjected to any detriment or to be dismissed for refusing to come to work in circumstances where the employee has a reasonable belief that they or others are in “serious and imminent danger”. This statutory provision was designed for extreme health and safety emergencies where an employee has no reasonable option but to take evasive action, but in recent years the precise boundaries of the right have been questioned.\n\nThankfully a recent Court of Appeal decision, Rodgers v. Leeds Laser Cutting Ltd, has clarified their scope: the perceived danger must arise at the workplace and the employee must believe that they are in danger as a result of being at work. Danger “at large” – such as the journey in – would not be covered by these provisions. It also seems unlikely that this high threshold would be met simply by normal work activities being under the shadow of ambulance delays, but this is something employers should be mindful of from a safety perspective generally. And should employees who may be feeling more vulnerable raise health and safety concerns, employers should be prepared to re-assure the employee about the safety protocols they have in place.\n\nIn this particular context, it should also be noted that s. 240 of the Trade Union and Labour Relations (Consolidation) Act 1992 makes it an offence for someone wilfully and maliciously to break their employment contract knowing or having reasonable cause to believe that the probable consequences of doing so would be for them to endanger human life or cause serious bodily injury. Employers might take comfort from the argument that the current strikes are not leading to “serious and imminent danger” as, if they were, the employer of the strikers could, and almost certainly would, have sought to prevent the strikes from going ahead (as is known to have been contemplated in the NHS before Christmas before being disregarded as an idea).\n\nHome Office and Border Force strikes\n\nEmployers and employees might also feel the impact of strikes on immigration services in both the Home Office and the Border Force on immigration services.\n\nThere could be delays on immigration processing when the Home Office strikes. The impact of the 1 February strike was limited, mainly to a delay in answering queries on the Home Office’s contact centre. However, future strikes could affect general case work, and in particular urgent cases, especially if they run over multiple days.\n\nBorder Force officers were on strike again on 1 February through to 7 am on 2 February, with further action scheduled for 17, 18, 19 and 20 February. The Christmas strike only affected a limited number of ports of entry. The February strikes affected all air and sea entry points, as well as the juxtaposed controls at Calais, Dunkirk and Coquelles. Passengers have been warned to expect delays, however if the experience to-date is repeated, the issue may be more that passengers will not be as robustly screened as usual, due to there only being limited people staffing the entry points who have powers under the Immigration Acts. The strikes planned for later in February affect the ports of Dover, Calais, Coquelles and Dunkirk. The extent of disruption to travellers arising from the future strike days is yet to be known. It is likely to be felt most at the controls in France, both because of the successive days of action, the volume of passengers returning from February half-term break and the fact that these control points cannot be staffed by the military.\n\nOperational impact\n\nThe wider impact of the strike can be seen on businesses across the UK. The ONS reported that one in eight (13%) businesses had been affected by industrial action in October 2022. The biggest impact was seen on wholesale and retail trade as well as on the hospitality industry. The most common effects were that more than a quarter (27%) of those businesses were unable to obtain necessary goods for their businesses, and 24% of businesses were unable to operate fully.\n\nIn industries already facing staff shortages, reduced trade due to the reduction in footfall of office workers and the cost of living crisis mean that the impact of the public sector strike action will come as another blow. Such employers are likely to be looking at reducing business costs, and may first look to the option of redundancies. But this is not always a cheap option and may mean that valuable skills and experience are lost and the morale of retained staff is severely impacted. Employers should also be aware of alternative cost cutting measures that may better suit the needs of their business.\n\nIs there an end in sight?\n\nIn response to the current wave of industrial action, the government has introduced the Strikes (Minimum Service Levels) Bill (the Bill) (which we wrote about here). The Bill has now completed its passage through the House of Commons and is currently awaiting its second reading in the House of Lords on 21 February 2023.\n\nWhilst the detail and scope of such minimum service levels is currently unknown, the Bill would, at least in its current form, enable the government to make regulations to limit trade unions’ powers to cause widescale disruption in six key sectors: (i) health services; (ii) fire and rescue services; (iii) education services; (iv) transport services; (v) nuclear decommissioning; and (vi) border security.\n\nThe immediate impact of the Bill on the current wave of strikes, however, is likely to be minimal. It is likely to take time for the Bill to become law, if it passes at all in its current form despite likely opposition in the House of Lords. Further regulations would then be required, and these will almost certainly be challenged by way of judicial review in light of their potential incompatibility with the European Convention on Human Rights.\n\nThe Bill does not, therefore, provide any immediate comfort for businesses trying to manage the broader impact of the strikes. So, unfortunately, it appears that industrial action in the public sector is likely to remain an issue for all employers until such time as the pressures being caused by the cost of living crises recede or the government backs down from imposing a real terms pay cut on the public sector."
    }
]