[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93ZS1hc2tlZC1jaGF0Z3B0LWhvdy1zb29uLWNhbi1yaXBwbGUteHJwLXJlYWNoLTEv0gFOaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3dlLWFza2VkLWNoYXRncHQtaG93LXNvb24tY2FuLXJpcHBsZS14cnAtcmVhY2gtMS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "We Asked ChatGPT How Soon Can Ripple (XRP) Reach $1? - CryptoPotato",
        "content": "Ripple’s XRP has become one of the most-traded altcoins throughout the past few months, and this has largely to do with the recent ruling in the case between Ripple Labs and the United States Securities and Exchange Commission.\n\nThe presiding judge, Analisa Torres, ruled that secondary XRP sales do not constitute an investment contract. This essentially means that they are not securities and do not fall under the purview of the SEC.\n\nLeading Up to the XRP Price Prediction\n\nThe news had an immediate impact on XRP’s price, which doubled in a day. You can find more about it in our short video here:\n\nIt’s also worth noting that many cryptocurrency exchanges had previously delisted XRP, fearing repercussions, but once the ruling was in, most of them immediately re-listed it.\n\nThis caused a massive surge in trading volume overnight, eventually making XRP the most-traded cryptocurrency amid US-based exchanges.\n\nHow Soon Can It Hit $1?\n\nThat said, we decided to ask ChatGPT how soon XRP can reach the coveted target of $1.\n\nIt had almost reached that price back when the ruling was made but has given up all the gains since then.\n\nChatGPT thinks that regulatory developments are among the crucial considerations that could push the price forward and help it regain $1.\n\nUndoubtedly, the outcome of the case against the US SEC is going to play a critical part in XRP’s price performance, and it’s interesting to see if the Commission will be successful in its appeal of Judge Torres’ decision.\n\nOther important considerations include market sentiment, speculation, adoption, and more.\n\nIndeed, throughout the past week, XRP’s price has been performing relatively well, reclaiming the important psychological level of $0.50. This has given birth to many price predictions, some more realistic than others.\n\nYou can check some of the most recent XRP price predictions here."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vdS50b2RheS93YXMtdml0YWxpay1idXRlcmluLXJlYWxseS1vYnNlc3NlZC13aXRoLXhycC1hbmQtcmlwcGxlLWV0aGVyZXVtLWluc2lkZXItZW5kcy1zcGVjdWxhdGlvbtIBbWh0dHBzOi8vdS50b2RheS93YXMtdml0YWxpay1idXRlcmluLXJlYWxseS1vYnNlc3NlZC13aXRoLXhycC1hbmQtcmlwcGxlLWV0aGVyZXVtLWluc2lkZXItZW5kcy1zcGVjdWxhdGlvbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "Was Vitalik Buterin Really Obsessed With XRP and Ripple? Ethereum Insider Ends Speculation - U.Today",
        "content": "In a recent disclosure, Steven Nerayoff, a former Ethereum advisor known for his insightful statements, has provided some clarity on the speculation surrounding Vitalik Buterin's past interest in Ripple and XRP. The community has long wondered whether Buterin, the co-founder of Ethereum, had a genuine fascination with Ripple.\n\nAdvertisement\n\nThis talk follows earlier comments by Matt Hamilton, the former director of developer relations at Ripple, who revealed that Buterin had sought an internship opportunity at Ripple and had even slept on the couch of the company's CTO, David Schwartz.\n\nNerayoff, who had conversations with Buterin, shared some insights into Buterin's thought process. He mentioned that Buterin had once expressed a desire to implement smart contracts on the Bitcoin network. However, his proposal was met with resistance from developers, which may have led him to explore other blockchain projects.\n\nRegarding Ripple, Nerayoff explained that his discussions with Buterin about the company were based on his encounters with Ripple representatives, whom he himself viewed as exemplars of effective operational practices within the blockchain industry.\n\nNo idea. He told me he wanted to implement smart contracts on Bitcoin but the devs didn’t want it. I spoke to him about Ripple but that was bc I had met the Ripple folks and used them as an example of how a company should be operated in this space. Ripple has been following me… — Steven Nerayoff (@StevenNerayoff) September 23, 2023\n\nNerayoff also recalled an incident from 2015 when he attended a conference where he encountered Chris Larson, a co-founder of Ripple, and another member of the Ripple team. During this event, questions related to XRP were directed to only one specific individual within the organization.\n\nNerayoff's insights have reignited the debate surrounding Vitalik Buterin's true interests and intentions during his interactions with Ripple. The question remains: Did Ethereum founder harbor a genuine interest in Ripple and XRP, or were there more nuanced factors at play behind the scenes?"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vYml0Y29pbmlzdC5jb20vcmlwcGxlLXBhcnR5LXhycC1wcmljZS_SATJodHRwczovL2JpdGNvaW5pc3QuY29tL3JpcHBsZS1wYXJ0eS14cnAtcHJpY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "Will The Upcoming Ripple Party Have A Positive Effect On The XRP Price? | Bitcoinist.com - Bitcoinist",
        "content": "Ripple has been planning a ‘Proper Victory Party’ to celebrate its victory over the United States Securities and Exchange Commission (SEC) for a while now and this could affect the XRP price. This was made public in late August when the company announced the September 29 date. Now, with the Ripple victory party just a few days away, could it have a positive effect on the XRP price?\n\nBackground On The Ripple Party\n\nIn July, Judge Analisa Torres ruled that secondary XRP sales did not count as securities. This judgment came after an almost three-year-long bitter battle between Ripple and the SEC. The lawsuit alleging XRP was a security was first filed in 2020 and has raged on even through a historic bull market.\n\nHowever, Ripple had refused to go the route of settlement like many others and instead decided to fight the regulator in court. This led to millions of dollars in legal fees for the crypto firm, as it fought tooth and nail to prove that XRP did not qualify as a security.\n\nEventually, Ripple was vindicated by Judge Torres’s ruling, leading to widespread celebration among the community. XRP had been re-listed on major crypto exchanges such as Coinbase and Bitstamp which had initially delisted the token over its regulatory problems and the price of the token surged in response.\n\nOn the back of the victory, Ripple announced that it would be holding a community celebratory party to mark the occasion. Replying to this announcement, CEO Brad Garlinghouse chimed in to say; “As promised – it’s time for that proper victory party.” He further added, “The last few years have been quite the journey and I look forward to sharing a celebratory toast on Sept 29 in NYC!”\n\nAs promised – it’s time for that proper victory party. The last few years have been quite the journey and I look forward to sharing a celebratory toast on Sept 29 in NYC! https://t.co/9YDQGnK6Pg — Brad Garlinghouse (@bgarlinghouse) August 28, 2023\n\nXRP bulls looking to retest $0.5 | Source: XRPUSD on Tradingview.com\n\nWill The Celebrations Trigger An XRP Price Rally?\n\nThe XRP price is still struggling after the euphoria from the ruling has worn off. However, as the party draws closer, it could serve as a catalyst to reignite this euphoria once more. It could boost community morale, thereby increasing confidence and interest in the coin.\n\nIn this instance, the XRP price would likely enjoy an uptick in price. This could see the coin recover above $0.5 once more and reclaim it as support for the time being. A boost in network activity would most likely follow this as well.\n\nCommunity members have also come forward to share their thoughts on the upcoming party. One X user explained that the party was not to celebrate XRP’s price but rather to celebrate the victory over the SEC.\n\nThe #Ripple party isn’t to celebrate XRP’s price. In reality people are celebrating the defeat of Gary Gensler and the SEC — XRPcryptowolf (@XRPcryptowolf) September 24, 2023\n\nFor now, the XRP price is seeing 2.49% losses in the last day to trade at $0.496. But it is not all losses for the altcoin which has seen its daily trading volume rise over 90% to rest above $700 million at the time of writing."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJhbmdvcmRhaWx5bmV3cy5jb20vMjAyMy8wOS8yNC9uZXdzL21pZGNvYXN0L2RyYWdvbi1jZW1lbnQtcGxhbnQtY2xvc3VyZS1yaXBwbGUtY29uc3RydWN0aW9uLWpvYW00MHprMHcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "Dragon Cement plant's closure could ripple through Maine' - Bangor Daily News",
        "content": "The idling of production at the Dragon Cement plant in Thomaston may lead to a domino effect of higher prices and more complicated environmental regulations in Maine.\n\nDragon Cement, one of the largest producers of cement in New England, announced its plans earlier this month to idle production in Maine by 2025 and lay off about 65 workers. There are other cement plants in the Northeast and in Canada that can supply the material in Maine, but several businesses here depend on Dragon.\n\nSome in Maine are already worrying that the plant’s loss will ripple through the sector and push costs higher for companies and those that hire them, including the public agencies and institutions that make up two-thirds of construction sales here. The effect on the overall market is uncertain for now, with regional voices saying there are enough suppliers to make up the gap.\n\nMost of the companies that work with Consigli, a Portland-based construction management company that operates down the Eastern Seaboard, use Dragon’s cement in their mix, Matt Tonello, who runs the firm’s Maine operations, said. He’s worried they are going to have to source cement from elsewhere, perhaps Boston or overseas, which could drive up prices.\n\n“Schools, libraries, every building that’s constructed, has got concrete in it, and we’re all going to feel it,” Tonello said.\n\nThere could be a particular effect on the transportation industry, said Eric Ritchie, a vice president of the Orono-based regional construction firm Sargent and the president of the Maine Better Transportation Association. Dragon supplies type 2 cement, which is the foundation of a lot of infrastructure construction, so costs could spike and raise taxes or tolls.\n\nBut Sargent no longer uses Dragon, and Jonathan Kuell of the Northern New England Concrete Association said there are enough cement suppliers through Boston, Canada and overseas to supplement Maine’s industry. He said he doesn’t see the imports increasing any prices.\n\n“From a supply standpoint, I don’t think anyone’s going to be waiting for concrete,” Kuell said.\n\nKuell added that the concrete and cement industry is growing. Expert Market Research projects that the U.S. cement market will continue growing through 2028.\n\nBut Dragon is one of the only producers of type 1L cement in the region, which is more eco-friendly than regular cement, Tonello noted. It uses finely ground limestone to reduce the need for high-temperature furnaces that use up more fuel and produce more carbon. Consigli has clients that are depending on this kind of cement for green purposes.\n\n“We’ve got a couple of environmental goals on some projects which are counting on the type 1L, and we’re going to have to rewrite those or change them,” Tonello said.\n\nBut it will be hard to know how exactly Dragon’s closure could affect the construction industry in Maine until it actually stops production. Tonello said he won’t know for sure how much anything will cost until he receives quotes from suppliers.\n\nIn a statement, the Associated General Contractors of Maine said the industry will have to adjust to ensure cement deliveries and the group is “obviously concerned” about the closure. Last month, Gov. Janet Mills said she hoped to talk with the owners of Dragon Cement and that its output was needed in Maine, a sentiment that Tonello shared.\n\n“I think we have got to find a way to keep the place open,” he said."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9zd2lmdC1pbnRlZ3JhdGlvbi13YXZlLWhvdy1yaXBwbGUtYW5kLXN0ZWxsYXItYXJlLWNoYW5naW5nLWdsb2JhbC10cmFuc2FjdGlvbnMv0gF3aHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3N3aWZ0LWludGVncmF0aW9uLXdhdmUtaG93LXJpcHBsZS1hbmQtc3RlbGxhci1hcmUtY2hhbmdpbmctZ2xvYmFsLXRyYW5zYWN0aW9ucy8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "SWIFT Integration Wave: How Ripple and Stellar Are Changing Global Transactions - Crypto News Flash",
        "content": "The head of Swift Go has disclosed that banks are the first point of call when consumers want to make a cross-border payment.\n\nHowever, factors such as speed, ease of use, and transparency are the reasons for considering alternatives.\n\nCross-border payments have become an interesting section of global transactions as the ecosystem is expected to value around $250 trillion by 2027. In a recent discussion, Tanja Haase, Head of Swift Go explained what consumers and Small and Medium-sized Enterprises (SMEs) expect when sending money across borders.\n\nIn a survey that considered the inputs of 4000 consumers and SMEs across eight key markets, it was observed that banks are still “the first point of call”.The reason is that customers have a lot of faith in their process and security. However, some of the participants agreed to be using alternatives.\n\nAccording to the survey, the main drivers for these consumers and SMEs that consider alternatives are bordered around speed, ease of use, and transparency. Haase further disclosed that Swift has been exploring means to support the community. Swift Go had about 400 banks signed up for the service last year. After a year, over 600 banks have signed up with 400 of them already live.\n\nRecently, Swift announced that its Central Bank Digital Currency (CBDC) interoperability experiment has entered into a new phase as three Central Banks start beta testing the innovative solution. According to Swift, 30 financial institutions are experimenting with the solution.\n\nWe’re committed to developing a beta version of our CBDC connector solution after the first iteration of sandbox testing, with participants recognizing the solution’s ‘clear potential and value’. The beta solution has taken its next step, with three central banks and monetary authorities, including the Hong Kong Monetary Authority (HKMA) and the National Bank of Kazakhstan, integrating the solution with their infrastructure for direct testing.\n\nRipple and Stellar Join the Revolution\n\nAccording to Tom Zschach, chief innovation officer at Swift, the focus is to ensure that CBDCs can coexist with each other including fiat-based currencies and payment systems.\n\nTo push the cause of ensuring that the payment system worldwide is revolutionized, Swift joined hands with Ripple and Stellar. Ripple’s XRP is said to accelerate global transactions and has been the most preferred in terms of speed compared to traditional financial systems. Stellar also focuses on faster and cost-effective transactions. Its official website mentions that its Interoperability is what distinguishes it from the other blockchains.\n\nWhat sets the Stellar network apart from other blockchains is its interoperability. The Stellar network can interoperate with other blockchains and traditional financial infrastructure via regulated financial institutions called anchors. can issue assets and/or provide on/off ramps onto the Stellar network.\n\nRipple recently sealed a strategic partnership agreement with global e-commerce Amazon. This would integrate XRP into Amazon’s payment operations.\n\nRipple’s XRP has been predicted to hit as high as $500 by 2027 with the assumption that it may dominate the cross-border ecosystem. As of press time, XRP was trading at $0.510923 after surging by $1.79 percent in the last seven days. In the last 24 hours, the asset has surged by 0.05 percent. XLM has also fallen by 4.7 percent in the last seven days to trade at $0.113852.\n\nRecommended for you:"
    }
]