[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTA4LTE3L3doYXQtcy1uZXh0LWluLXNlYy12LXJpcHBsZS14cnAtY3J5cHRvLWxhd3N1aXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "What's Next in SEC v Ripple (XRP) Crypto Lawsuit? - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTA4LTE3L3doYXQtcy1uZXh0LWluLXNlYy12LXJpcHBsZS14cnAtY3J5cHRvLWxhd3N1aXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "What's Next in SEC v Ripple (XRP) Crypto Lawsuit? - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTA4LTE3L3doYXQtcy1uZXh0LWluLXNlYy12LXJpcHBsZS14cnAtY3J5cHRvLWxhd3N1aXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "What's Next in SEC v Ripple (XRP) Crypto Lawsuit? - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LnB5bW50cy5jb20vbGVnYWwvMjAyMy9qdWRnZS1hbGxvd3Mtc2VjLXRvLWZpbGUtbW90aW9uLWZvci1hcHBlYWwtaW4tcmlwcGxlLWxhYnMtY2FzZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Judge Allows SEC to File Motion for Appeal in Ripple Labs Case - PYMNTS.com",
        "content": "A U.S. district judge has granted the Securities and Exchange Commission (SEC) permission to file a motion for leave to file an interlocutory appeal in its case against cryptocurrency platform Ripple Labs.\n\nThis decision by Judge Analisa Torres allows the SEC to bring the case to the U.S. Court of Appeals for the Second Circuit, Cointelegraph reported Thursday (Aug. 17). Ripple Labs will also have the opportunity to oppose the motion.\n\nAn interlocutory appeal is when a ruling by a trial court is appealed while other aspects of the case are still ongoing, according to the report. The SEC’s request for an appeal has raised concerns about its potential impact on multiple pending court cases. In a letter to Judge Torres, the SEC acknowledged that her decision could have broader implications.\n\nRipple Labs, on the other hand, has expressed opposition to the potential appeal, the report said.\n\nThe company’s lawyers presented three main arguments against the SEC’s request. They argued that an appeal requires a pure question of law, and the SEC’s request does not raise any new legal issues that need to be reviewed. They also stated that the SEC’s claim of an incorrect court ruling is not sufficient, and an immediate appeal would not advance the termination litigation proceedings.\n\nTorres had previously ruled on July 13 that Ripple’s native XRP token is not a security when distributed in public sales but is considered a security in institutional sales, per the report. This ruling has been a significant development in the ongoing case against Ripple, which began in December 2020 when the SEC sued the company and its two chief executives, Brad Garlinghouse and Chris Larsen, over allegations of offering an unregistered security.\n\nGarlinghouse has expressed his belief that the SEC would face a lengthy appeals process, according to the report. He stated that the law currently recognizes XRP as not being a security, and until the SEC has the opportunity to file an appeal, which could take years, he remains optimistic. Garlinghouse believes that an appeal against the retail sales ruling would only further solidify Judge Torres’ decision.\n\nThe judge’s July 13 ruling will have far-ranging repercussions across the digital asset ecosystem, which has long argued that its tokens do not represent securities contracts."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3Lm1hc3RlcmNhcmQuY29tL25ld3MvcGVyc3BlY3RpdmVzLzIwMjMvY2JkY3MtdHJ1c3QtYW5kLXRoZS1ldm9sdXRpb24tb2YtbW9uZXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 17 Aug 2023 07:00:00 GMT",
        "title": "Central bank digital currencies: CBDC benefits and risks - Mastercard",
        "content": "Central banks have been exploring ways to issue their own digital currencies for years. Yet their efforts haven’t captured the public’s attention — for better or, more recently, for worse — like cryptocurrencies have. But central bank digital currencies, or CBDCs — essentially a digital version of fiat currency backed by a government and therefore far less speculative than crypto — are gaining momentum, with the potential to have an even bigger impact on our everyday lives. Central banks around the world are experimenting with issuing these digital currencies to complement traditional payments, both the physical version in your wallet and the online version in your banking app. In fact, 93% of central banks are engaged in some form of work on CBDCs, and four retail CBDCs are already in full live circulation, according to the Bank for International Settlements. But there are many questions that central banks need to consider, says Jesse McWaters, who leads global regulatory advocacy at Mastercard. This includes the role of the private sector in CBDC issuance, security, privacy and interoperability — such as how a CBDC works with other commonly used payment mechanisms, what specific challenges CBDCs would solve and whether they’re even the right tool for the job.\n\nTo bring a greater understanding of the benefits and limitations of CBDCs and how to implement them in a way that is safe, seamless and useful, Mastercard is convening a group of leading blockchain technology and payment service providers to join its new CBDC Partner Program. It’s designed to foster collaboration with key players in the space so they can drive innovation and efficiencies, says Raj Dhamodharan, head of digital assets and blockchain at Mastercard. The inaugural set of partners includes CBDC platform Ripple, blockchain and Web3 software company Consensys, multi-CBDC and tokenized assets solution provider Fluency, digital identity technology provider Idemia, digital identity consultant Consult Hyperion, security technology group Giesecke+Devrient and digital asset operations platform Fireblocks. Their efforts include Fluency’s work to build interoperability among different CBDCs, Consult Hyperion’s work with central banks and payment processors to define their CBDC requirements and Ripple’s launch of an inaugural government-issued national stablecoin in collaboration with the Republic of Palau, in addition to work on four CBDC pilots. “We believe in payment choice and that interoperability across the different ways of making payments is an essential component of a flourishing economy,” Dhamodharan says. “As we look ahead toward a digitally driven future, it will be essential that the value held as a CBDC is as easy to use as other forms of money.” CBDC program partner Giesecke+Devrient, based in Germany, has a legacy in public currency that dates back 170 years, when it first started printing banknotes. Today the company specializes in safeguarding both physical and digital assets. It works with central banks to roll out digital currencies, offering its CBDC solution called G+D Filia, which can enable secure offline payments. That feature is important both for ensuring as many people as possible can use CBDCs and ensuring you can access your money even amid connectivity problems or power failures. Filia can be used for online and offline payments using a variety of wallet types and IoT devices. “What we’ve seen is that cash is still there, and that won’t change, but there is emerging demand for a public digital currency,” says Sebastian Baierle, manager of strategic partnerships for CBDC at G+D. “And the intentions vary from country to country.” Baierle says the Bank of Ghana — which is partnering with G+D on its CBDC pilot — wants to use CBDCs to bring more of its citizens into the formal financial economy. By contrast, the Swedish central bank might be more concerned that the rapid shift away from cash in that country is reducing consumers’ access to a form of money directly backed by the central bank, something it is committed to preserving, McWaters says.\n\n\"As we look ahead towards a digitally driven future, it will be essential that the value held as a CBDC is as easy to use as other forms of money.” Raj Dhamodharan\n\nAs the technology continues to mature, there’s still plenty for this partnership to study and consider. For one thing, CBDCs have yet to gain wide acceptance. While BIS expects as many as 24 central bank digital currencies to be circulating by decade’s end, more than two-thirds of central banks say they’re unlikely, in the near term, to issue a digital currency people can use for everyday purchases. This stems partly from the complex issues involved, says Varun Paul, who was most recently head of the Bank of England’s fintech hub and now oversees CBDC and market infrastructure for Fireblocks. For example, central banks must determine how to strike the right balance between privacy and transparency, to prevent illicit activities while preserving an individual’s right to privacy. “Privacy is extremely important to users. It’s really the No. 1 topic,” says Jerome Ajdenbaum, who leads the digital currencies business for Idemia, citing a recent European Central Bank survey on the digital euro. It’s vital to demonstrate to the user that their privacy is protected, “not just that we promise” to do so, he adds. Idemia develops cryptographic techniques for offline payments to ensure privacy for individuals, while still maintaining enough oversight to prevent fraud. The company has partnered with the Bank of England on exactly this issue, working to understand the right level of privacy for its CBDC project. Another conundrum is getting people to use the new digital currency. In the few countries that have formally adopted CBDCs, some people have been reluctant to adopt a form of money they’re not familiar with, Fireblocks’ Paul notes. Hesitancy may have increased in the wake of last year’s “crypto winter,” with scandals threatening the trust that the digital ecosystem needs to evolve and thrive. Paul says that recent high-profile collapses actually strengthen the case for CBDCs, which (like regular currency and government bonds) are fully backed by a central bank and government. For CBDCs to succeed in the years ahead will also require central banks to build trust through improved communication. “I’d argue,” Paul says, “that there’s a huge amount to be done to explain to the public what this thing is, why it should be used and when it should be used.” CBDCs shouldn’t be adopted in a vacuum, and the work of the Mastercard CBDC Partner Program will help central banks understand how to develop a CBDC that adds something new and valuable to the economy, McWaters says. “By assembling the strengths, deep expertise and different capabilities of these partners, we can drive innovation in the central banking community and along the CBDC value chain as the space continues to evolve,” Dhamodharan says. Implemented poorly, a CBDC could create disruptions in the established payment system and crowd out private sector investment. Citing U.S. Federal Reserve Board Chairman Jerome Powell on the potential for a digital dollar, McWaters adds, “It’s more important to get it right than to be first.”\n\nTo bring greater understanding of the benefits and limitations of CBDCs and how to implement them in a way that is safe, seamless and useful, Mastercard is convening a group of leading blockchain technology and payment service providers to join its new CBDC Partner Program. Ripple is a leader in enterprise blockchain and crypto solutions, transforming how the world moves, manages and tokenizes value. Ripple’s business solutions are faster, more transparent, and more cost effective — solving inefficiencies that have long defined the status quo. And together with partners and the larger developer community, we identify use cases where crypto technology will inspire new business models and create opportunity for more people. With every solution, we’re realizing a more sustainable global economy and planet — increasing access to inclusive and scalable financial systems while leveraging carbon neutral blockchain technology and a green digital asset, XRP. This is how we deliver on our mission to build crypto solutions for a world without economic borders. Consensys is a leading blockchain and Web3 software company. Since 2014, Consensys has been at the forefront of innovation, pioneering technological developments within the Web3 ecosystem. Through our product suite, including the MetaMask platform, Infura, Linea, Truffle, Diligence, and our NFT platform, we have become the trusted collaborator for users, creators, and developers on their path to build and belong in the world they want to see. Whether building a dapp, an NFT collection, a portfolio, or a better future, the instinct to build is universal. Consensys inspires and champions the builder instinct in everyone by making Web3 universally easy to use and develop on. Consult Hyperion has over 20 years’ experience of delivering innovative secure digital payment and identity services, globally. We have helped organizations build long-term profitable businesses from the opportunities presented by ACH, Open Banking and CBDCs across Europe and North America. We are currently helping Central Banks and payment processors to define their requirements for CBDCs that operate in both face to face and remote retail environments, including when the internet or CBDC service goes down (offline). Fluency is a market leading multi-CBDC and tokenized assets technology provider. It is an appointed member of the world's key CBDC projects for 23 countries including digital euro and digital pound. G+D enables secure payment transactions across all physical, electronic and digital forms. We are a trusted partner for central banks worldwide with solutions for the entire currency cycle and expertise in cash and CBDCs. Idemia is the global leader in identity and payment technologies and is enabling CBDC offline payments with a focus on privacy and financial inclusion. Idemia aims to set the industry standard for secure offline transactions using CBDCs, shaping a future where accessibility meets innovation. Fireblocks is an enterprise-grade platform to manage digital asset operations and build innovative businesses on the blockchain. Fireblocks serves thousands of financial institutions, has secured the transfer of over $4 trillion in digital assets, and has a unique insurance policy that covers assets in storage and transit. Go to slide 1 Go to slide 2 Go to slide 3 Go to slide 4 Go to slide 5 Go to slide 6 Go to slide 7 Go to slide 8"
    }
]