[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTEyL2NyeXB0by1zLXJpcHBsZS1zYXlzLWhhcy1leHBvc3VyZS10by1mYWlsZWQtc2lsaWNvbi12YWxsZXktYmFuay1zdmIteHJw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Crypto's Ripple Says Has Exposure to Failed Silicon Valley Bank - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTEyL2NyeXB0by1zLXJpcHBsZS1zYXlzLWhhcy1leHBvc3VyZS10by1mYWlsZWQtc2lsaWNvbi12YWxsZXktYmFuay1zdmIteHJw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Crypto's Ripple Says Has Exposure to Failed Silicon Valley Bank - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTEyL2NyeXB0by1zLXJpcHBsZS1zYXlzLWhhcy1leHBvc3VyZS10by1mYWlsZWQtc2lsaWNvbi12YWxsZXktYmFuay1zdmIteHJw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Crypto's Ripple Says Has Exposure to Failed Silicon Valley Bank - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzEyL3JpcHBsZS1oYWQtc29tZS1leHBvc3VyZS10by1zaWxpY29uLXZhbGxleS1iYW5rLXNheXMtY2VvL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzEyL3JpcHBsZS1oYWQtc29tZS1leHBvc3VyZS10by1zaWxpY29uLXZhbGxleS1iYW5rLXNheXMtY2VvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Ripple Had ‘Some Exposure’ to Silicon Valley Bank, Says CEO - CoinDesk",
        "content": "Ripple is the latest crypto company to comment on its connections to Silicon Valley Bank, which failed Friday after a run on deposits forced regulators to put the FDIC in control of its remaining assets. Amid fear that large depositors may not be made whole, federal regulators are said to be considering measures that would seek to prevent the second-largest bank failure in U.S. history from kicking off a broader crisis."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5zaWxpY29uaGlsbHNuZXdzLmNvbS8yMDIzLzAzLzEyL3NpbGljb24tdmFsbGV5LWJhbmtzLWZhaWx1cmUtY291bGQtcmlwcGxlLXRocm91Z2gtdGhlLWVjb25vbXktYW5kLWltcGFjdC1hdXN0aW4tdGVjaC1zdGFydHVwcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Mar 2023 08:00:00 GMT",
        "title": "Silicon Valley Bank's Failure Could Ripple Through the Economy and Impact Austin Tech Startups - Silicon Hills News",
        "content": "Silicon Valley Bank’s Failure Could Ripple Through the Economy and Impact Austin Tech Startups\n\nIsabella Casillas Guzman, the U.S. Small Business Administrator, and Mark Cuban, Billionaire Tech Entrepreneur at ZenBusiness SXSW panel Sunday morning\n\nThe Silicon Valley Bank failure can have downstream consequences depending on how the government responds to it, said Mark Cuban, billionaire tech entrepreneur.\n\n“The rich people got wiped out already,” Cuban said at a South by Southwest panel discussion Sunday morning. “What’s at stake is the depositor. If they can’t get their money out come Monday, you ain’t getting paid. If you don’t get paid, others don’t get paid.”\n\nSVB, which had $209 billion in total assets and $175.4 billion in total deposits at the end of 2022, failed on Friday. SVB is where a large share of VC firms and VC-backed startups all across the country held deposits, according to the National Venture Capital Association. It’s the second-largest bank failure in U.S. history behind Washington Mutual in 2008.\n\nThe investors of SVB are out of money, Cuban said. All those people who had deposits over the FDIC insured $250,000, that’s tens of thousands of companies that need access to their money for inventory, payroll, and accounts payable, Cuban said. If they don’t get access to their funds, it could have substantial ripple effects throughout the economy, he said.\n\n“The Feds have to come in and say we’ve got you,” Cuban said. The bank got hit with a liquidity crunch, he said. “The federal government has to say all deposits will be made whole. I know that’s scary, but that’s the reality.”\n\nIsabella Casillas Guzman, the U.S. Small Business Administrator, also participated in the SXSW panel discussion and said U.S. Secretary of the Treasury Janet Yellen was working closely with bank regulators on the collapse. She said that many of SVB’s depositors are small businesses and are critical to the U.S. economy.\n\n“This weekend is critical,” Guzman said. Regulators are working to determine the right actions to ensure the U.S. economy remains strong.\n\nOn Sunday morning’s Face the Nation TV show, Secretary Yellen said SVB’s failure stemmed from a rise in interest rates. And that many of the depositors were small businesses and that the regulators were working on a solution for them, she said. But the Federal government didn’t plan to bail out the investors and owners of the bank.\n\n“The problems of this bank, from reporting about its situation, suggest that because we’re in a higher interest rate environment, assets that it holds, many of which are Treasury assets, or mortgage-backed securities that are guaranteed by the government lose market value, and the problems of the tech sector aren’t at the heart of the problems of this bank,” Yellen said on Face the Nation, according to a show transcript.\n\nSVB’s bank failure is the buzz around SXSW, the annual technology conference held in Austin every Spring.\n\nThe bank backed a lot of startups locally, said Ross Buhrdorf, CEO of Austin-based ZenBusiness.\n\n“We ran our business out of it,” Buhrdorf said. He spoke to Silicon Hills News Sunday morning after an SXSW panel his company moderated.\n\n“We’re scrambling to figure out how to run day to day,” he said. “Like a bunch of us are.”\n\nBuhrdorf, founding Chief Technology Officer of HomeAway, which sold to Expedia and is now known as VRBO, is also an active angel investor in Austin and has backed dozens of companies. All of them used SVB, he said.\n\nZenBusiness is one of Austin’s home-grown Unicorn companies. Founded in 2017, ZenBusiness runs an online platform to help small businesses incorporate and stay compliant with regulators. It raised a $200 million Series C round in late 2021, valuing the company at $1.7 billion.\n\nZenBusiness is not exposed financially, Buhrdorf said. He said it diversified its bank deposits in several banks before the bank failure. But ZenBusiness’ payroll is run out of there, he said.\n\n“You don’t just change that and the next day go to another bank,” he said."
    }
]