[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTAxL3JpcHBsZS1vcHBvc2VzLXNlYy1hcHBlYWwtb2YtcnVsaW5nLXRoYXQtY3J5cHRvLWlzbi10LXNlY3VyaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ripple Opposes SEC Appeal of Ruling That Crypto Isn't a Security - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTAxL3JpcHBsZS1vcHBvc2VzLXNlYy1hcHBlYWwtb2YtcnVsaW5nLXRoYXQtY3J5cHRvLWlzbi10LXNlY3VyaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ripple Opposes SEC Appeal of Ruling That Crypto Isn't a Security - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTAxL3JpcHBsZS1vcHBvc2VzLXNlYy1hcHBlYWwtb2YtcnVsaW5nLXRoYXQtY3J5cHRvLWlzbi10LXNlY3VyaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Ripple Opposes SEC Appeal of Ruling That Crypto Isn't a Security - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8wMS9zZWMtaGFzbnQtbWV0LXJlcXVpcmVtZW50cy10by1hcmd1ZS1mb3ItYW4tYXBwZWFsLXJpcHBsZS1zYXlzL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8wMS9zZWMtaGFzbnQtbWV0LXJlcXVpcmVtZW50cy10by1hcmd1ZS1mb3ItYW4tYXBwZWFsLXJpcHBsZS1zYXlzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "SEC Hasn't Met Requirements to Argue for an Appeal, Ripple Says - CoinDesk",
        "content": "The SEC is seeking a federal judge's approval to appeal her ruling finding that Ripple's programmatic sales of XRP did not violate securities law. If Judge Analisa Torres, of the Southern District of New York, signs off on the bid, the SEC will need to convince the Second Circuit Court of Appeals to take up the case. In its filing Friday, Ripple argued that there are no controlling law questions and that an appeal wouldn't lead to a faster resolution of the overall case."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9ob3ctdGhlLXNlYy1zdGFja3MtdXAtbG9zc2VzLXdpdGgtcmlwcGxlLWdyYXlzY2FsZS1hbmQtdW5pc3dhcC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "The Roundup: Ripple, Grayscale, and Uniswap — SEC losses stack up - DLNews",
        "content": "In this week’s Roundup newsletter we discuss SEC Chair Gary Gensler’s growing list if courtroom setbacks.\n\nHaving already partially lost against Ripple this summer, the regulator was hit with fresh disappointments this week when Grayscale and Uniswap won their cases.\n\nElsewhere, we look at Solana’s post-FTX recovery, Elon Musk’s latest payments push, and the supply of Dai.\n\nA version of this story appeared in our The Roundup newsletter. If you want to read this or our other newsletters before your friends do, don’t hesitate to sign up.\n\nHappy Friday!\n\nAdam Morgan here with a digest of the week’s most important crypto stories.\n\nThe US Securities and Exchange Commission has racked up courtroom losses up and down the Eastern seaboard. Two significant setbacks this week could force the regulator to rethink its approach.\n\nOn Tuesday, the SEC’s rejection of Grayscale’s proposal to convert its flagship Bitcoin trust into a spot Bitcoin exchange-traded fund was unanimously overturned. The loss could pave the way for a spot Bitcoin ETF in the US.\n\n“The denial of Grayscale’s proposal was arbitrary and capricious because the Commission failed to explain its different treatment of similar products,” Judge Neomi Rao wrote in the decision.\n\nUp the road in New York, Judge Katherine Polk Failla of the US District Court in Manhattan dealt the regulator another blow on Tuesday.\n\nShe dismissed a lawsuit brought by Nessa Risley on behalf of other investors, in which Risley claimed she’d suffered “substantial losses” after buying tokens on Uniswap, which is a decentralised crypto exchange.\n\nJoin the community to get our latest stories and updates\n\nJudge Failla rejected the contention that Uniswap was a securities exchange and could be held accountable.\n\nAnother setback for Gary Gensler, and the latest since Ripple partially won its case against the regulator in July. The chair of the SEC has long argued cryptocurrencies should be regulated like stocks and bonds.\n\nThat’s all for this week, have a great weekend,\n\nAdam Morgan McCarthy\n\nLike this newsletter? Sign up for our DeFi newsletter, The Decentralised, and for the regulatory low-down check out The Guidance.Also, have you joined our TG channel yet?Check out our News Feed for the latest breaking stories, community polls, and of course – the memes. https://t.me/dlnewsinfo\n\nSolana is enjoying a \"renaissance\" several months after the collapse of FTX had outside observers wondering whether it would survive. (Rita Fortunato/Rita Fortunato)\n\nSolana enjoys post-FTX ‘renaissance’ on back of network and DeFi upgrades\n\nCrypto in the Solana ecosystem plummeted after the collapse of FTX. The blockchain has defied sceptics in the months since, and has largely recovered. Developers working on Solana say they’re in the midst of a “renaissance.”\n\nDai hits $5b market cap, bucks stablecoin downtrend after 20% supply surge (Rita Fortunato/Rita Fortunato)\n\nHigh yields split MakerDAO community as Dai supply surges 25%\n\nMakerDAO raised the yield for Dai to 8% this month, before bringing it back to 5%, in an effort to create sustainable growth and capital inflows. Some DAO members say the strategy is unsustainable and attracted whales to “bleed the coffers” of the community.\n\nElon Musk Changes Twitter Name And Logo To X - 27 Jul 2023 Mandatory Credit: Photo by David Talukdar/Shutterstock (14024596b) In this photo illustration a person browsing Elon musk X account, formerly Twitter, on an iPhone, on 27 July 2023 in Guwahati, India Elon Musk Changes Twitter Name And Logo To X - 27 Jul 2023 (David Talukdar/Shutterstock/David Talukdar/Shutterstock)\n\nElon Musk scoops up licenses for crypto payments — but experts say don’t hold your breath\n\nX, formerly Twitter, has secured its seventh US state payment licence under Twitter Payments LLC. Elon Musk is reportedly looking to square shoulders with payment giants like PayPal. But it will be some time before these licences can result in any crypto payment service."
    }
]