[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vam9icy9jLXN1aXRlL3NlYXJjaC1mb3ItY2Vvcy1jeG9zLWluLWluZGlhLWlzLWF0LWFuLWFsbC10aW1lLWhpZ2gtY29uc3RhbnRpbmUtYWxleGFuZHJha2lzL2FydGljbGVzaG93Lzk4OTc5MTkyLmNtc9IBkwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vam9icy9jLXN1aXRlL3NlYXJjaC1mb3ItY2Vvcy1jeG9zLWluLWluZGlhLWlzLWF0LWFuLWFsbC10aW1lLWhpZ2gtY29uc3RhbnRpbmUtYWxleGFuZHJha2lzL2FtcF9hcnRpY2xlc2hvdy85ODk3OTE5Mi5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Mar 2023 07:00:00 GMT",
        "title": "Search for CEOs, CXOs in India is at an all-time high: Constantine Alexandrakis - The Economic Times",
        "content": "Modi 3.0 Live Modi Oath Ceremony Live\n\nThere is a very strong demand for leadership advisory services in India in the post-pandemic world and CEO/CXO searches are at an all-time high, said Constantine Alexandrakis, global chief executive officer ofRussell Reynolds Associates.In an exclusive interview with ET, Alexandrakis said though the global macroeconomic uncertainty may have its ripple effect, in India, demand for CXOs remains strong as companies seek to rope in top talent who can navigate the post pandemic business environment and drive them into new business and growth areas.“Though the global macroeconomic uncertainty will have its ripple effect but in India demand still remains high. We have never been as busy with leadership searches as we are now,” he said.India is one of the major beneficiaries from the shift in manufacturing from China. That apart, the Covid-19 pandemic has also accentuated the pace of digitization and technological disruption and there is a tendency among companies to grab the opportunity of technological advancement for which they need senior talent, said Alexandrakis, who has been with the firm for nearly two decades.“There is also a lot of investment going into sectors such as infrastructure and all this we feel is adding to the demand for leadership talent in India despite unpredictability in some other parts of the world.”That apart, there has been an increase in seriousness for CEO succession and there is an urgency with which boards want to plan succession for top leadership positions.According to Alexandrakis, who was on his first visit to India since he became the CEO in January 2022, the recent banking upheaval is causing everyone to ask if it is a contained situation to a small number of banks that will not have ripple effects through the financial services job ecosystem, or if it is a signal of a larger potential crisis that could significantly impact jobs in the sector.“So far, it appears like the former, but it goes back to the new issues CEOs are facing—there are a number of unknowns as to the impact of an inflationary environment on banks that have been operating in a low inflation state for many years. The one thing we can be certain of is that over the long term, the cyclicality but also resilience of financial services and jobs within the sector will no doubt continue,” he added.“The biggest challenge for CEOs in the post pandemic world is combatting the new reality of the unpredictable, which includes inflation, geopolitical shifts, and growth concerns, among others. CEOs never before had to plan for so many variables at the same time. Are we really equipped to deal with a whole set of challenges is a big question for today’s CEOs,” said Alexandrakis, who advises corporate boards and CEOs for public and private companies across industries.Citing a recent survey by Russell Reynolds Associates on corporate governance trends, he said there is an increased awareness among the family-owned businesses in India about the value that independent directors bring to the board. Companies are proactively looking for directors who can be strategic assets for the company.“We also see an increased focus on aspects such as ESG, technology skills and gender diversity in the board. Instead of looking for a like-for-like replacement, companies are looking at a more strategic and forward-looking approach to board composition with focus on creating a more balanced and diverse board."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vaW5kZXBlbmRlbnRhdXN0cmFsaWEubmV0L2xpZmUvYXJ0LWRpc3BsYXkvd2hpdGUtc3RyaXBlcy1kcnVtbWVyLXRyaWdnZXJzLXR3aXR0ZXItZnJlbnp5LDE3MzUy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Mar 2023 07:00:00 GMT",
        "title": "White Stripes drummer triggers Twitter frenzy - Independent Australia",
        "content": "Meg White is best known as the drummer for The White Stripes (Image by Dena Flows | Radio Gráfica)\n\nWhen U.S. journo Lachlan Markay lit up Twitter with an ill-conceived attack on the musical ability of Meg White, former drummer of The White Stripes, he got slammed, quick sticks.\n\nMEG WHITE CRITIC DRUMMED OUT OF TOWN\n\nLoads of fellow musicians rushed to White’s defence, most notably Questlove.\n\nMarkay then removed the offending tweet, apologised and locked down his online presence so he could eat a few healthy servings of humble pie.\n\nI’m not here to pour scorn on Markay — he’s already copped enough of that elsewhere. But rather, this incident does pose a perfect opportunity for me, a fellow drummer, to give the very underrated White such kudos and credit as she deserves for her contribution to popular music.\n\nI try to leave “troll views” alone but this right here is out of line af. Actually what is wrong w music is people choking the life out of music like an Instagram filter—-trying to reach a high of music perfection that doesn’t even serve the song (or music) pic.twitter.com/hCj43qNpcG — Plug 5. (@questlove) March 14, 2023\n\nA lot of drummers forget that our job is not just to hold the beat down and keep the band together but to play in such a way that suits the song, as opposed to playing in a way that satisfies our egos.\n\nMeg White is the master of understatement and execution: every time she committed a drumstick to skin, she did so knowing she was playing the right thing at the right time, and that thing was, more often than not, the perfect sound to fill the space in the song.\n\nShe played expertly and under difficult circumstances, playing without a bass player to follow along with — an environment most other drummers don't experience. She followed her former husband, guitarist Jack White, in whatever he felt like doing and she kept the rhythm tight. That’s a tough thing to do.\n\nThe White Stripes didn’t need a “better” drummer. They already had the best.\n\nIAN HUNTER LIVES ON IN DEFIANCE\n\nRock 'n roll stalwart Ian Hunter, formerly of '70s British rockers Mott The Hoople – whose solo career is almost 50 years deep now – has two albums in the pipeline: Defiance Part 1 (due for release on 21 April 2023) with part two to folllow.\n\nAt 83 years of age, Hunter's vocals have never sounded better and these new songs are some of the best things he’s done in years. He has gathered a cavalcade of guest stars, ranging from the late Jeff Beck and Taylor Hawkins to members of Tom Petty & the Heartbreakers and Stone Temple Pilots.\n\n'Bed Of Roses' is a single from the first part of the album, revisiting Hunter's time playing clubs in Hamburg in the early 1960s — at a similar time to when The Beatles were there. Serendipitously, the track features ex-Beatle Ringo Starr on drums!\n\nLOIS LEVIN SHOULD DEFINITELY STAY\n\nIf you’re going to do a cover of a well-known song, you could do a straight recreation, but I think the onus is on the artist to elevate the source material into something bigger and better.\n\nThere’s a new jazz label based in Liverpool, UK, called Baltic Jazz Recordings. One of its first releases is from Liverpudlian singer-songwriter Lois Levin.\n\nLevin brings a sultry, inviting and soulful vibe to classic 1982 single by The Clash, 'Should I Stay or Should I Go'. As a result, it becomes a stunningly beautiful yet completely different creation.\n\nListen to the song again — for the first time.\n\nRIPPLE EFFECT BAND MAKING WAVES\n\nMy best new discovery this week comes from Maningrida, a coastal community of Arnhem Land in the Northern Territory — a groundbreaking all-female, multi-generational First Nations band called Ripple Effect Band.\n\nWithin the culture of the Kunibidji people of the area, music is almost entirely an activity for men. As such, for women to be claiming this field of artistic endeavour, it's a pretty big deal.\n\nAll the members are multi-instrumentalists, and they regularly swap roles on stage in order to give each member a chance to front the band and sing in their native language.\n\nThis is beautiful reggae-inspired music about the redemptive power of the sea, set to a video of pristine ocean scenery.\n\nWAKE UP TO TASMIN ARCHER'S SLEEPING SATELLITE\n\nLast but not least, a lost classic from the 1990s. British vocalist Tasmin Archer is best remembered for this massive hit, which makes having an existential crisis sound so enchanting.\n\nLyrics like:\n\n'Have we lost what it takes to advance have we peaked too soon…'\n\nThese are delivered with a honeyed vocal that can turn raspy and husky on a dime. Memorable, magnificent and just too good to be relegated to a classic hits playlist.\n\nDo yourself the favour...\n\nDavid Kowalski is a writer, musician, educator, sound engineer and podcaster. His podcasts 'The Sound and the Fury Podcast' and 'Audio Cumulus' can be heard exclusively here. You can follow David on Twitter @sound_fury_pod."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vYml0Y29pbmlzdC5jb20veHJwLXByaWNlLWJyZWFrcy1vdXQtb2YtbXVsdGkteWVhci13ZWRnZS14cnAtcHJpY2UtcHJlZGljdGlvbi1hbmQtYXZvcmFrLXN1bW1hcnkv0gFsaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS94cnAtcHJpY2UtYnJlYWtzLW91dC1vZi1tdWx0aS15ZWFyLXdlZGdlLXhycC1wcmljZS1wcmVkaWN0aW9uLWFuZC1hdm9yYWstc3VtbWFyeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Mar 2023 09:03:17 GMT",
        "title": "XRP Price Breaks Out Of Multi-Year Wedge: XRP Price Prediction And Avorak Summary | Bitcoinist.com - Bitcoinist",
        "content": "Many cryptos appear to be starting bullish runs, with Bitcoin leading the way. Some cryptos are breaking out of very strong price suppression, which usually means the start of very fast upward momentum. XRP is looking that way.\n\nXRP Price\n\nXRP price has made significant headway this month. After sitting in a multi-year downtrend, XRP price has finally broken above the trendline. This is likely to signal a strong reversal to the upside.\n\nXRP Price Prediction\n\nXRP is currently in a battle with the Securities and Exchange Commission (SEC) about defining the XRP coin as a security which therefore means the Ripple company would have sold XRP as an unregistered security.\n\nIf this battle versus the SEC is won by Ripple, $0.90 is a likely target in a very quick timeframe, with this breakout bringing significant attention at a crucial timeframe for the cryptocurrency.\n\nXRP News\n\nAccording to Santiment, XRP whales have been accumulating XRP over the past few weeks, which usually means significant positive price action is on the way.\n\nThe increase in wallets is 50% up for holders in the range of 10m – 100m, which means a potential $380 million influx into XRP across these 55 new holders.\n\nAvorak AI\n\nEven more bullish than this is the significant increase in holders for the Avorak AI ICO.\n\nNow at over 450 holders, blockchain analysts have spotted 15 large buyers in the past week for Avorak from wallets that hold significant amounts of other bullish cryptos. These whales, as can be seen in XRP data, have access to data most don’t, in addition to inside information and sometimes even companies dedicated to scouring the internet for prime investments. With the whales moving into Avorak, on-chain buy signals are triggering for this artificial intelligence project.\n\nWhat does AVRK do?\n\nAs mentioned by well-known YouTube accounts, Avorak is a full set of automated intelligence systems that can facilitate financial and creative tasks. AVRK is the credit used to pay for these services, and users pay with AVRK at an equivalent USD value. This means that the use of the Avorak services directly correlates to the market cap and price of the AVRK token, as the more demand for the services, the more the buying of the AVRK token to use as credits.\n\nThis also benefits holders, as 49% of all revenue, as per the whitepaper, is directed back to the holders as a form of revenue share. This double-use case is incredible and gives considerably more utility than the XRP coin.\n\nAnalysts are bullish on XRP, but with the market cap valuation and long-term product development, AVRK is the number one pick for potential profits over the next two years.\n\nWant to learn more about Avorak AI?\n\nWebsite: https://avorak.ai\n\nWhitepaper: https://avorak-labs-and-technology.gitbook.io/avorak-a.i-technical-whitepaper/\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of Bitcoinist. Bitcoinist does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb29raXNsYW5kc25ld3MuY29tL3VuY2F0ZWdvcmlzZWQvaW50ZXJuYWwvbmF0aW9uYWwvc3BvcnQvZWR1Y2F0aW9uL3N3aW1taW5nL3lvdW5nLXN3aW1tZXJzLWNyZWF0ZS1yaXBwbGVzLWF0LWFubnVhbC1tZWV0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Mar 2023 07:00:00 GMT",
        "title": "Young swimmers create ripples at annual meet - Cook Islands News",
        "content": "Young swimmers create ripples at annual meet Saturday 25 March 2023 | Written by Melina Etches | Published in Education, National, Sports, Swimming Share\n\n\n\n\n\nA good crowd of excited parents cheered their kids on at the second and final day of the Rarotonga Primary Schools Kau Competition yesterday.\n\nYear 3 student Teata Rima from Apii Takitumu went home with several top placings from the junior’s division yesterday.\n\nRima placed first in the heat and final of the freestyle 25 metre event, third in backstroke final 25m and third in the relay mixed 25m event.\n\nApii Te Uki Ou took home the junior champions and overall champions trophies. Cook Islands Aquatics will release the full results next week."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LnJpcHBsZXNuaWdlcmlhLmNvbS9mYWN0LWNoZWNrLWlzLWluZWNzLXJldHVybmluZy1vZmZpY2VyLWluLW5hc2FyYXdhLWRlYWQv0gFaaHR0cHM6Ly93d3cucmlwcGxlc25pZ2VyaWEuY29tL2ZhY3QtY2hlY2staXMtaW5lY3MtcmV0dXJuaW5nLW9mZmljZXItaW4tbmFzYXJhd2EtZGVhZC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Mar 2023 07:00:00 GMT",
        "title": "FACT CHECK: Is INEC’s Returning Officer in Nasarawa dead? - Ripples Nigeria",
        "content": "CLAIM: Viral posts on Twitter and WhatsApp claim that the Returning Officer of the Independent National Electoral Commission in the Nasarawa governorship election died in a car accident.\n\nVERDICT: False!\n\nFULL TEXT\n\nThe March 18 governorship election in the North-Central Nasarawa state is trailed by protest by residents of the state who claimed that they did not vote for the reelection of Governor Abdullahi Sule. The protesters who were mostly women went topless and were seen in videos on social media expressing their anger over the outcome of the election.\n\nThe electoral commission announced that the governor won the election with 347, 209 votes, to secure a second term and defeat his closest rivals – David Ombugadu of the Peoples Democratic Party who scored 283,016 votes and Abdullahi Maidoya of the New Nigeria People’s Party who scored 11,726 votes.\n\nWhile women protested topless on Wednesday against Sule’s reelection, the PDP on Thursday began a 7-days protest against INEC. The PDP claims that it won the election.\n\nRead also:FACT CHECK: Has the Nigerian Police filed criminal charges against Gov Adeleke?\n\nWith protests still rocking the state, a picture of a man is being circulated on social media. It is claimed that he was the Returning Officer in the election, and he died in a ghastly car accident after the topless women cursed him for allegedly rigging the election for the governor.\n\nBelow are some of the posts with this claim:\n\nVERIFICATION\n\nRipples Nigeria found that the Returning Officer in the Nasarawa governorship election is Professor Ishaya Tanko. He is the Vice Chancellor of the University of Jos, Plateau State. He is not the man in the circulated picture.\n\nCONCLUSION\n\nViral claim that the RO in the Nasarawa election is dead is false. The circulated picture is not that of the RO.\n\nBy Oluwatobi Odeyinka\n\nJoin the conversation\n\nOpinions\n\nSupport Ripples Nigeria, hold up solutions journalism\n\nBalanced, fearless journalism driven by data comes at huge financial costs.\n\nAs a media platform, we hold leadership accountable and will not trade the right to press freedom and free speech for a piece of cake.\n\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\n\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development.\n\nDonate Now"
    }
]