[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LnJpcHBsZXNuaWdlcmlhLmNvbS9lZmNjLW9wZXJhdGl2ZXNzdG9ybXMtdGludWJ1cy1wb2xsaW5nLXVuaXQtcGhvdG9zL9IBVWh0dHBzOi8vd3d3LnJpcHBsZXNuaWdlcmlhLmNvbS9lZmNjLW9wZXJhdGl2ZXNzdG9ybXMtdGludWJ1cy1wb2xsaW5nLXVuaXQtcGhvdG9zLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "EFCC operatives storm Tinubu’s polling unit (Photos) - Ripples Nigeria",
        "content": "Officials of the Economic and Financial Crimes Commission (EFCC) on Saturday stormed the polling unit of the presidential candidate of All Progressives Congress (APC) Bola Tinubu at PU 085, Ward 3, Sunday Adigun street, Alausa, Ikeja, Lagos State, for Inspection of the voting process.\n\nIt was gathered that this was in an effort to prevent vote buying and apprehend perpetrators of graft at the polling unit.\n\nTinubu, a former governor of Lagos State and leading candidate in today’s election, votes in the Alausa area of Ikeja.\n\nREAD ALSO:2023: Buhari prays for Tinubu, APC’s success at Lagos mega rally\n\nThe operatives, some in EFCC jackets and complete mufty, came with armed uniformed policemen to the polling units, where Tinubu was already present.\n\nVote buying has been one of the sore point of elections in the recent history of the country, but the EFCC has vowed to nip it in the bud and arrest perpetrators.\n\nRipples Nigeria reports that the anti-graft agency, on Friday, announced the interception of over N34 million in New naira notes meant for vote buying in Lagos.\n\nAlso on Friday, soldiers intercepted another N2 million being ferried to Gombe State for delivery to a politician in the state. The money and suspect were handed over to the Independent Corrupt Practices and Other Related Offences Commission (ICPC).\n\nJoin the conversation\n\nOpinions\n\nSupport Ripples Nigeria, hold up solutions journalism\n\nBalanced, fearless journalism driven by data comes at huge financial costs.\n\nAs a media platform, we hold leadership accountable and will not trade the right to press freedom and free speech for a piece of cake.\n\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\n\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development.\n\nDonate Now"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LnJpcHBsZXNuaWdlcmlhLmNvbS9nb29nbGUtZG9vZGxlLW1hcmtzLW5pZ2VyaWFzLWVsZWN0aW9ucy_SAUpodHRwczovL3d3dy5yaXBwbGVzbmlnZXJpYS5jb20vZ29vZ2xlLWRvb2RsZS1tYXJrcy1uaWdlcmlhcy1lbGVjdGlvbnMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Google doodle marks Nigeria’s elections - Ripples Nigeria",
        "content": "Google’s Doodle transformed on Saturday, portraying the Nigerian flag and a ballot box to indicate the country was having its election today.\n\nThe Doodle typically depicts Google’s logo; however, it temporarily changes to celebrate special occasions in certain countries.\n\nRipples Nigeria understands that the Doodle is limited to region or countries, which means when it transforms, only the people living in the country being celebrated would see it – in some cases, the reach of the Doodle could extend beyond the shores of the nation.\n\nAlthough the Doodle also transforms to persons who have impacted the world through their works. It is also used to create awareness.\n\nEach country has its own Google Doodle, and that of Nigeria is currently depicting the Nigerian flag and a ballot box. Ripples Nigeria confirmed that the reach is restricted to the country, which means individuals in other countries are unaware of it, as they are currently seeing a different image.\n\nREAD ALSO:Google launches AI tool to turn text into music\n\nGoogle Doodle has previously transformed into Nigerian educator, ceramicist, glassworker, and potter, Ladi Kwali and Nigerian playwright, Ola Rotimi.\n\nThe Doodle had also honoured Nigerian filmmaker, Amaka Igwe. It honours Nigeria’s Independence Day yearly and had also transformed to jollof rice as well.\n\nMeanwhile, Nigerians are voting today to elect their President, as Peter Obi, Atiku Abubakar and Bola Tinubu contest for the Aso Rock top job.\n\nThe winner of the election will take over from President Muhammadu Buhari in late May 2023. Buhari was first elected in March 2015. He won re-election in February 2019.\n\nIn Nigeria, Presidents are entitled to a maximum two terms, of four years each, after which he or she hands over to a newly elected President.\n\nJoin the conversation\n\nOpinions\n\nSupport Ripples Nigeria, hold up solutions journalism\n\nBalanced, fearless journalism driven by data comes at huge financial costs.\n\nAs a media platform, we hold leadership accountable and will not trade the right to press freedom and free speech for a piece of cake.\n\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\n\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development.\n\nDonate Now"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LnZnMjQ3LmNvbS9iYXR0bGVmaWVsZC0yMDQyLWRldmVsb3BtZW50LXVwZGF0ZS10ZWxscy15b3UtZXZlcnl0aGluZy1jb21pbmctaW4tc2Vhc29uLTQtZWxldmVudGgtaG91ctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Battlefield 2042 Development Update tells you everything coming in Season 4: Eleventh Hour - VG247",
        "content": "The Battlefield 2042 team has released the latest Development Update with a rundown of everything coming in Season 4: Eleventh Hour, and available free to all players starting on February 28.\n\nHosted by DICE community manager Tom Straatman and associate producer Alexia Christofi, the video provides a deep-dive into the new Flashpoint map, the addition of reconnaissance Specialist Camila Blasco, and a rundown on the new vehicle, weapons, and gadgets. In addition, the episode features gameplay clips of the new content.\n\nThe video also shows off the latest evolved, reworked versions of the game's launch maps, this time featuring Discarded, available later in Season 4. You also get a look at new concept art showing what is coming with Season 5.\n\nIn Season 4: Eleventh Hour, you can expect the new Flashpoint map, the new Specialist: Camila Blasco, the new weapons Super 500, RM68, AC9, and RPT-31, the new vault weapons SVD and Type 88, the CAV-Brawler vehicle, the SPH Explosive gadget, a new Battlepass, and map reworks of Discarded and Hourglass.\n\nThe new Specialist Camila Blasco can move without alerting motion-based technology and uses the X6-Infiltration Device that creates communication dead zones. With Camila's addition, there are now 14 Specialists available for varied gameplay across four Classes. As Season 5 approaches, Blasco will be the last Specialist added to the game.\n\nWith Season 4, the SPH Explosive will be an Assault Class gadget, and it is available for Dozer, Mackay, Sundance, and Zain.\n\nThe rework for Discarded comes with Season 4, and the Hourglass rework in Season 5.\n\nUpdates with Discarded include more importance to the flag in the submarine that has been updated with a new cover to block the line of sight. The flag has been strengthened on the Colossus Ship to allow soldiers on the lookout to keep the beach under control. What was once an open field is now a Salvage Yard designed to host a variety of combat.\n\nFor the Dismantled Hull, a destroyed convoy and rows of military cover have been added to strengthen the frontlines of this flag. A flag is now at the Beach Worksite as part of Conquest and Breakthrough. There are also improved paths leading to it. With Antenna, the team brought the existing flag closer to the Antenna and Flooded Village to better link the north and south parts of the map.\n\nFor Hourglass in Season 5, you can expect a new route under the highway. You can expect improved cover, sightlines, and combat opportunities across the map. More details on the Hourglass rework will be shared closer to the release of Season 5.\n\nFor more information Season 4, head over to the Battlefield blog."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LnZnMjQ3LmNvbS9iYXR0bGVmaWVsZC0yMDQyLWRldmVsb3BtZW50LXVwZGF0ZS10ZWxscy15b3UtZXZlcnl0aGluZy1jb21pbmctaW4tc2Vhc29uLTQtZWxldmVudGgtaG91ctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Battlefield 2042 Development Update tells you everything coming in Season 4: Eleventh Hour - VG247",
        "content": "The Battlefield 2042 team has released the latest Development Update with a rundown of everything coming in Season 4: Eleventh Hour, and available free to all players starting on February 28.\n\nHosted by DICE community manager Tom Straatman and associate producer Alexia Christofi, the video provides a deep-dive into the new Flashpoint map, the addition of reconnaissance Specialist Camila Blasco, and a rundown on the new vehicle, weapons, and gadgets. In addition, the episode features gameplay clips of the new content.\n\nThe video also shows off the latest evolved, reworked versions of the game's launch maps, this time featuring Discarded, available later in Season 4. You also get a look at new concept art showing what is coming with Season 5.\n\nIn Season 4: Eleventh Hour, you can expect the new Flashpoint map, the new Specialist: Camila Blasco, the new weapons Super 500, RM68, AC9, and RPT-31, the new vault weapons SVD and Type 88, the CAV-Brawler vehicle, the SPH Explosive gadget, a new Battlepass, and map reworks of Discarded and Hourglass.\n\nThe new Specialist Camila Blasco can move without alerting motion-based technology and uses the X6-Infiltration Device that creates communication dead zones. With Camila's addition, there are now 14 Specialists available for varied gameplay across four Classes. As Season 5 approaches, Blasco will be the last Specialist added to the game.\n\nWith Season 4, the SPH Explosive will be an Assault Class gadget, and it is available for Dozer, Mackay, Sundance, and Zain.\n\nThe rework for Discarded comes with Season 4, and the Hourglass rework in Season 5.\n\nUpdates with Discarded include more importance to the flag in the submarine that has been updated with a new cover to block the line of sight. The flag has been strengthened on the Colossus Ship to allow soldiers on the lookout to keep the beach under control. What was once an open field is now a Salvage Yard designed to host a variety of combat.\n\nFor the Dismantled Hull, a destroyed convoy and rows of military cover have been added to strengthen the frontlines of this flag. A flag is now at the Beach Worksite as part of Conquest and Breakthrough. There are also improved paths leading to it. With Antenna, the team brought the existing flag closer to the Antenna and Flooded Village to better link the north and south parts of the map.\n\nFor Hourglass in Season 5, you can expect a new route under the highway. You can expect improved cover, sightlines, and combat opportunities across the map. More details on the Hourglass rework will be shared closer to the release of Season 5.\n\nFor more information Season 4, head over to the Battlefield blog."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL290YWt1a2FydC5jb20vNDcwOTI1L3JlYm9ybi10by1tYXN0ZXItdGhlLWJsYWRlLWZyb20taGVyby1raW5nLXRvLWV4dHJhb3JkaW5hcnktc3F1aXJlLWVwaXNvZGUtOC1yZWxlYXNlLWRhdGUtYS1uZXctYXJ0aWZhY3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Reborn to Master the Blade: From Hero-King to Extraordinary Squire Episode 8 Release Date: A New Artifact! - OtakuKart",
        "content": "Ripple’s condition is getting worse as time passes by. After the mysterious assault of magicite beasts during the welcoming party, everyone has finally figured out the reason behind the sudden appearance of magicite beasts. It is speculated that a certain faction of High Landers are trying to use Ripple as a pawn to weaken their forces so that they could put a stop to the technical advancements made by pro-surface Highlanders.\n\nFew days have gone by since the release of Reborn to Master the Blade: From Hero-King to Extraordinary Squire Episode 7 and the plot is getting more exciting. With Ripple arriving at the Knights academy and Inglis prepared for an all out battle, we can expect some intense action to happen in the upcoming episodes. And we are her to help you with it.\n\nIn this article, we are going to tell you all about the release date, time and Streaming guide for Reborn to Master the Blade: From Hero-King to Extraordinary Squire Episode 8. We are also going to provide you a preview of the same and after that let’s have a recap!\n\nReborn to Master the Blade: From Hero-King to Extraordinary Squire Episode 7 The Hyral Menas’s Disease: Recap\n\nInglis, Rafi, Leone and Liselotte are getting prepared to attend the welcoming party of the new Highland Ambassador. Sir Thodore is also Liselotte’s brother and so she insists they dress well for the event. Inglis and her friends visit the marketplace to buy gowns for the party when they suddenly get interrupted by a magicite beast assault.\n\nRipple and Eris arrive at the scene and defeat the beasts. Inglis notices that Ripple looks unwell but Ripple denies it and hands over some money to Rafi for her shopping. Few days pass by and finally the day of the party arrives. Everyone wears gowns to visit the party. Inglis looks extremely beautiful in her red gown but she’s actually really hungry and so is Rafi.\n\nWhen Inglis arrives at the party she gets greeted by Rafael who als praises her outfit but she doesn’t look so happy about it. Liselotte leaves them to meet her brother. Inglis and Rafi’s urge that they first have some food and so Rafael takes them inside. As they are about to start eating, suddenly many magicite beasts appear out of nowhere and Inglis is forced to fight.\n\nRafael leaves to protect the ambassador and leaves the hall to Inglis, Rafi, Leone and Miriela. But Inglis doesn’t require anyone’s help and wipes all beats alone and that too with ease. Liselotte comes rushing to the hall to check on everyone but finds that the fight is already over and so she takes all of them to meet Sir Theodore.\n\nWhen arriving at the cabin of Theodore, Inglis finds Ripple unconscious and covered by a dark magical energy. The defending knights suspect Ripple to be a traiter who summoned all the magicite beasts but Rafi argues that she’ll never do that. Eris calms her by saying that they are only doing their Job. Rafi’s brother Rafael also agrees with her and because of his position, his opinion is taken into consideration.\n\nWayne and Theodore think for a bit and finally come to the conclusion that a anti surface Highlander faction is trying to use Ripple as a pawn to weaken their forces and this has also happened with other menaces in the history too. Wayne declares that he will never put the defenders of the highland in any harm and he trusts Ripple.\n\nMeanwhile Theodore notices that Inglis and Rafi were the one’s who saved his sister Cyrene and he asks them to hand her to him so that he could heal her. Inglis tries to get Cyrene away from her but she refuses and so they let it stay like that for the time being. Meanwhile, Ripple wakes up and demands that she gets executed for the safety of the Kingdom.\n\nWayne gets angey and states that he will never do that. Rafael also says that he will keep her in the best protected resting place. Inglis proposes that Ripple stays in the Knights academy as this way, the Kingdom’s soldiers won’t need to stay away from frontlines to defend Ripple and She will also get to fight many beasts.\n\nRafael disagrees to it at first but Theodore mentions that Miriela’s laboratory is also in the knights academy so if Ripple is transferred there then she’ll recover faster. Rafael is forced to agree to it and Inglis and her friends promise to protect Ripple and keep every citizen of the city safe.\n\nReborn to Master the Blade: From Hero-King to Extraordinary Squire Episode 8: Release Date and Time\n\nChris ❤️ Anime: Reborn to Master the Blade: From Hero-King to Extraordinary Squire ♀ pic.twitter.com/YvWnPVP54P — Anime Everyday (@LoKoKaBoosTeR69) February 6, 2023\n\nBlade: From Hero-King to Extraordinary Squire Episode 8 is scheduled to be released on Tuesday, February 28, 2023 at 20:45 JST. For Release Date and Time according to your respective timezone refer to the list below,\n\nPacific Time: 01:45 PST on Tuesday, 28 February 2023\n\nCentral Time: 03:45 CST on Tuesday, 28 February 2023\n\nEastern Time: 04:45 EST on Tuesday, 28 February 2023\n\nIndia Standard Time: 15:15 IST on Tuesday, 28 February 2023\n\nCentral European Time: 10:45 CET on Tuesday, 28 February 2023\n\nEastern European Time: 15:45 EET on Tuesday, 28 February 2023\n\nNew York, USA: 04:45 EST on Tuesday, 28 February 2023\n\nSingapore: 17:45 SGT on Tuesday, 28 February 2023\n\nAustralia: 21:45 AEST on Tuesday, 28 February 2023\n\nKorean Standard Time: 20:45 KST on Tuesday, 28 February 2023\n\nReborn to Master the Blade: From Hero-King to Extraordinary Squire Episode 8: Streaming Guide\n\nYou can stream Blade: From Hero-King to Extraordinary Squire Episode 8 online on the official anime streaming website Crunchyroll. The anime is also made legally available on youtube by Muse Asia and Muse India channels for free so you can choose between the platforms as per your needs."
    }
]