[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LnB5bW50cy5jb20vY3J5cHRvY3VycmVuY3kvMjAyMy9yaXBwbGUtdGVhbXMtd2l0aC11cGhvbGQtdG8tYm9sc3Rlci1jcm9zcy1ib3JkZXItcGF5bWVudHMtaW5mcmFzdHJ1Y3R1cmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Ripple Teams With Uphold to Bolster Cross-Border Payments Infrastructure - PYMNTS.com",
        "content": "Blockchain company Ripple has launched a partnership with Web3 financial platform Uphold.\n\nWith the partnership, announced Tuesday (Oct. 24), Uphold has agreed to provide Ripple with “enhanced crypto liquidity capabilities” to support and improve its cross-border payments infrastructure, the companies said in a news release provided to PYMNTS.\n\nIn addition, “Uphold’s deep liquidity expertise further underpins Ripple’s ability to offer fast and flexible cross-border payments around the world,” said Pegah Soltani, Ripple’s head of payments product.\n\nThe release says Uphold’s trading architecture makes it easy to move value between fiat and crypto and across networks, while also offering access from a range of crypto liquidity venues globally, thus letting businesses serve customers and deliver payments.\n\n“Ripple provides a tremendously valuable service to businesses making cross-border payments and we are thrilled to be an essential part of it,” said Uphold CEO Simon McLoughlin.\n\n“Our partnership with Ripple illustrates how the unique capabilities of our platform can be used by enterprises to make efficient crypto-to-fiat transfers and bank payouts.”\n\nPYMNTS spoke earlier this month with Pat Thelen, vice president of global account management at Ripple, about the way new blockchain-led innovations are enhancing the capabilities of the payments industry.\n\n“We see the tokenization of real-world assets as about as exciting as anything out there,” Thelen said. “If you apply the technology to industries that have been around forever and are fraught with manual processes and illiquidity and latency, there are some real opportunities where so much cost can be taken out of the equation. You can get pretty clever as these use cases unfold.”\n\nThe news of Ripple and Uphold’s partnership comes five days after Ripple scored a new victory in its 3-year-old battle with the Securities and Exchange Commission (SEC).\n\nThe SEC said in a court filing last week that it would dismiss its claims that Ripple CEO Brad Garlinghouse and Executive Chairman Chris Larsen aided and abetted the company’s alleged securities law violations.\n\nThe SEC took action against Ripple and its executives in 2020, accusing the company of carrying out a $1.3 billion unregistered securities offering tied to its XRP token.\n\nRipple had previously won a court victory when the judge in the SEC case ruled that the company had not broken securities laws when it made XRP available to retail investors. Earlier this month, the SEC lost its appeal of that ruling."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTAvMjQvZm9ydHJlc3MtY2VvLXNjb3R0LXB1cmNlbGwtc3RlcHMtZG93bi1sYXlvZmZzLXJpcHBsZS1hY3F1aXNpdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Fortress CEO Scott Purcell steps down after crypto custodian's sale to Ripple falls through - Fortune",
        "content": "Scott Purcell, the founder and CEO of the embattled crypto custodian Fortress, has stepped down amid broader staffing issues.\n\nThe decision comes on the heels of a hacking incident in early September that saw Fortress lose between $14 million and $15 million of customer funds. Clients were later made whole by Ripple, the blockchain firm behind the popular cryptocurrency XRP.\n\nFortress also laid off at least six employees, the majority in sales, Fortune has learned. When reached for comment, Purcell confirmed his departure, saying Fortress has hired a new CEO—Rich Hauschild, the former COO of the crypto investment firm iTrustCapital, according to an announcement posted to LinkedIn on Monday. Purcell told Fortune he will remain a board member of Fortress’s parent company.\n\nPurcell has a rocky record in the digital asset space. He previously was the CEO of Prime Trust, a different crypto custodial service, or business that holds crypto assets such as Bitcoin on behalf of clients. In July, Prime Trust went into receivership with the Nevada Financial Institutions Division, and it declared bankruptcy in August. Purcell had stepped down as CEO of the company as of 2021.\n\nAccording to the receivership petition filed by the Nevada regulator, Prime Trust discovered it was unable to access some of the wallets storing user cryptocurrency in December 2021, allegedly then using customer funds to satisfy withdrawals.\n\nFortress falling\n\nPurcell founded Fortress in October 2021, with the firm becoming a major player in the custodial space. Its growth was derailed over the summer when hackers stole millions of dollars worth of crypto assets, mostly in Bitcoin. Purcell later told Fortune that the incident affected only six out of the company’s 225,000 customers.\n\nBefore the hack was publicly acknowledged, Ripple had announced its planned acquisition of Fortress, citing the firm’s Nevada trust license as one of the reasons for the purchase. The crypto industry publication The Block reported that Ripple had stepped in to make customers whole as part of the acquisition.\n\nRipple abandoned the acquisition plan in late September. Purcell said a subset of Ripple staff were not interested in diversifying to consumer-focused products. (Fortress’s crypto rails let banks, for example, offer retail customers the ability to buy Bitcoin through their IRAs.) A spokesperson for Ripple told Fortune that the decision to back out of the acquisition was “not due to the hack or how Scott handled it” and said that Ripple will remain an investor in Fortress.\n\nEven though it backed out of the deal, Ripple has not required Fortress to immediately return the money—essentially a loan—it gave the custodial firm to make customers whole. “They’re not stressing out about it,” Purcell said, “and neither am I.”\n\nShortly after news broke of Ripple backing out, Purcell said Fortress had laid off four members of its sales team as well as several other employees. He later said the company had since hired back an equal number.\n\nAs for Purcell’s next venture, according to his LinkedIn, he founded a startup earlier this month that’s in stealth mode."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vdG9kYXkub3JlZ29uc3RhdGUuZWR1L25ld3MvY2xpbWF0ZS1yZXBvcnQtJUUyJTgwJTk4dW5jaGFydGVkLXRlcnJpdG9yeSVFMiU4MCU5OS1pbXBlcmlscy1saWZlLWVhcnRo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Climate report: 'Uncharted territory' imperils life on Earth - Oregon State University",
        "content": "CORVALLIS, Ore. – An international coalition of climate scientists says in a paper published today that the Earth’s vital signs have worsened beyond anything humans have yet seen, to the point that life on the planet is imperiled.\n\nWilliam Ripple, a distinguished professor in the Oregon State University College of Forestry, and former OSU postdoctoral researcher Christopher Wolf are the lead authors of the report, and 10 other U.S. and global scientists are co-authors.\n\n“Without actions that address the root problem of humanity taking more from the Earth than it can safely give, we’re on our way to the potential collapse of natural and socioeconomic systems and a world with unbearable heat and shortages of food and freshwater,” Wolf said.\n\nPublished in BioScience, “The 2023 State of the climate report: Entering uncharted territory” notes that 20 of 35 planetary vital signs the authors use to track climate change are at record extremes.\n\nThe authors share new data illustrating that many climate-related records were broken by “enormous margins” in 2023, particularly those relating to ocean temperatures and sea ice. They also note an extraordinary Canadian wildfire season that produced unprecedented carbon dioxide emissions.\n\nThe report follows by four years the “World Scientists’ Warning of a Climate Emergency” published by Ripple and collaborators in BioScience and co-signed by more than 15,000 scientists in 161 countries.\n\n“Life on our planet is clearly under siege,” Ripple said. “The statistical trends show deeply alarming patterns of climate-related variables and disasters. We also found little progress to report as far as humanity combating climate change.”\n\nAmong the key numbers in the report:\n\nFossil fuel subsidies – actions by governments that artificially lower the cost of energy production, raise the price received by producers or lower the price paid by consumers – roughly doubled between 2021 and 2022, from $531 billion to just over $1 trillion.\n\nAlready this year wildfires in Canada have pumped more than 1 gigaton of carbon dioxide into the atmosphere, greater than Canada’s total 2021 greenhouse gas emissions of 0.67 gigatons.\n\nIn 2023, there have already been 38 days with global average temperatures more than 1.5 degrees Celsius above pre-industrial levels. Until this year, such days were a rarity, the authors note.\n\nThe highest average Earth surface temperature ever recorded came this past July, and there’s reason to believe it was the highest surface temperature the planet has seen in the last 100,000 years.\n\n“As scientists, we are hugely troubled by the sudden increases in the frequency and severity of climate-related disasters,” said Wolf, now a scientist with Corvallis-based Terrestrial Ecosystems Research Associates. “The frequency and severity of those disasters might be outpacing rising temperatures. By the end of the 21st century, many regions may have severe heat, limited food availability and elevated mortality rates.”\n\nThe authors say policies are needed that take aim at the underlying issue of “ecological overshoot.” When human demand on the Earth’s resources is too large, the result in an array of environmental crises, including biodiversity decline. As long as humanity continues to put extreme pressure on the planet, any strategy that focuses only on carbon or climate will simply redistribute the pressure, they note.\n\n“Our goal is to communicate climate facts and make policy recommendations,” Ripple said. “It is a moral duty of scientists and our institutions to alert humanity of any potential existential threat and to show leadership in taking action.”\n\nThe authors urge transitioning to a global economy that prioritizes human well-being and curtails overconsumption and excessive emissions by the rich. Specific recommendations include phasing out fossil fuel subsidies, transitioning toward plant-based diets, scaling up forest protection efforts and adopting international coal elimination and fossil fuel non-proliferation treaties.\n\nThey stress that all climate-related actions must be grounded in equity and social justice, noting that extreme weather and other climate impacts are being disproportionately felt by the poorest people, who have contributed the least to climate change.\n\nCo-authors of the paper include Bev Law of the OSU College of Forestry, Jillian Gregg of Terrestrial Ecosystems Research Associates, Johan Rockström of the Potsdam Institute for Climate Impact Research, Thomas Newsome of the University of Sydney, Luiz Marques of Brazil’s State University of Campinas – Unicamp, Timothy Lenton of the University of Exeter, Chi Xu of Nanjing University, Saleemul Huq of Independent University Bangladesh, Leon Simons of the Club of Rome Netherlands, and Sir David Anthony King of the University of Cambridge.\n\nThe CO2 Foundation and Roger Worthington, an attorney and the owner of Worthy Brewing in Bend, provided partial funding for this research."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnNjaWVudGlmaWNhbWVyaWNhbi5jb20vYXJ0aWNsZS9lYXJ0aHMtbGF0ZXN0LXZpdGFsLXNpZ25zLXNob3ctdGhlLXBsYW5ldC1pcy1pbi1jcmlzaXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "Earth's Latest 'Vital Signs' Show the Planet Is in Crisis - Scientific American",
        "content": "The overall picture of Earth’s health is grim, although there are bright spots: solar and wind power are on the rise, and deforestation has slowed\n\nA new planetary report card confirms that humans are making little progress on confronting the climate crisis.\n\n“Humanity is failing, to put it bluntly,” says Bill Ripple, an Oregon State University ecologist. “Rather than cutting greenhouse gas emissions, we’re increasing them. So we’re not doing well right now.”\n\nRipple is co-author of research published on October 24 in BioScience that offers a snapshot of Earth’s status on 35 “planetary vital signs” with regards to climate. The analysis shows that humans have reached new extremes on 20 of these measurements, including global gross domestic product, fossil fuel subsidies, annual carbon pollution and glacier thinning. Overall, the report considers human activities, such as deforestation and meat consumption, as well as the planet’s responses to those activities, including characteristics such as ice loss and temperature changes.\n\nOn supporting science journalism\n\nIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\n\nRipple also says that in addition to the 35 formal variables, most of which he and his colleagues began to track in late 2019, the team is closely watching global estimates of populations that are experiencing undernourishment. Though undernourishment can have political causes, it is often tied to climate factors such as droughts and floods that damage crops.\n\nWhere possible, the analysis is based on data through the present, although some variables without freshly reported measurements rely on slightly older data. But there’s no denying that the picture is grim. “Many climate-related records have been broken by enormous margins in 2023,” Ripple says. For example, July was the hottest month ever recorded, and September was the most anomalously warm month, both by a significant amount.\n\nThe researchers also noticed a steep increase in global disasters tied to climate, including flooding, wildfires, heat waves and landslides. Ripple and his colleagues identified 14 disasters since October 2022 that were “definitely” or “likely” exacerbated by climate change. For example, a separate analysis found that heat waves that baked parts of North America and Europe this summer would have been “virtually impossible” without climate change. All told, these disasters killed thousands of people and affected millions; several individual events caused more than $1 billion in damage. In fact, the U.S. has already set a record for “billion-dollar disasters” this year, with several months left.\n\n“What we’ve been noticing is that as temperatures are creeping up, climate-related disasters are leaping up,” Ripple says. “We’re getting this big surge in climate disasters.”\n\nEven more concerning, he says, is that many of these disasters are hitting communities that have historically produced very little carbon pollution. Although the U.S. has been hit by extreme heat and wildfires, South America and Southeast Asia have also sweltered, while Libya and northern India have seen extreme floods. “The less wealthy countries that had little to do with creating climate change are having the most vulnerability to the climate disasters,” Ripple says.\n\nBecause of that, the report highlights the importance of confronting the climate crisis with justice in mind—a key aspect of this kind of work, says Joyeeta Gupta, a sustainability scientist at the University of Amsterdam, who was not involved in the new research. “We are repeating ourselves over and over again about the nature of the problem and the impacts,” Gupta says, noting that scientists have known for decades that the climate is changing because of human activity.\n\n“Natural scientists very often don’t include justice issues,” she adds. “I think it’s really important that we bring this justice issue much more centrally to our narrative because otherwise we won’t solve these problems; we’ll just keep telling people that there are problems.”\n\nAlthough many factors Ripple and his colleague studied are complex and difficult to tackle individually, not all are. For example, the team highlights that government subsidies of fossil fuels were at their all-time high in 2022, the most recent year out of the 13 for which data are available. The researchers cite Russia’s invasion of Ukraine in February 2022 as a destabilizing factor that prompted the steep increase that more than doubled subsidies over their previous level. “Governments are subsidizing the fossil fuel industry, which seems a little counterproductive,” Ripple says. “Immediately, we can’t do a lot to stop the disasters, but we do have a lot of control over these subsidies.”\n\nWithout rapidly shifting away from fossil fuels and toward renewables, the concentration of carbon dioxide will continue to rise in the atmosphere, causing sea levels to continue to rise, ice to melt, more heat waves to occur and oceans to become more acidic.\n\nFortunately, Ripple and his colleagues have found that humans have made progress in developing wind and solar power. In another positive note in the report, deforestation globally and in the Amazon—a particularly vital region for climate—has decreased.\n\nRipple’s 35 “vital signs” are just one of several frameworks that scientists use to understand how the planet is changing as the climate crisis unfolds. A separate project announced last month that humans have crossed six of nine planetary boundaries beyond which it becomes difficult to support the societies our species has built. The boundaries include variables, such as biodiversity and nutrient flow, that are not included in the new analysis, as well as some of the vital signs, such as deforestation and ocean acidification.\n\nRipple says he hopes that policymakers and citizens take the analysis seriously. “Life on planet Earth is under siege,” he says. “Whether you look at planetary boundaries or our planetary vital signs, it’s telling a similar story in that this is going to take major attention by humanity and big changes.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY3J5cHRvLm5ld3Mvc2VjLXJpcHBsZS1pc3JhZWwtaGFtYXMtd2FyLWJpdGNvaW4tMzBrLXdlZWtseS1yZWNhcC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Oct 2023 07:00:00 GMT",
        "title": "SEC drops charges against Ripple, crypto exchanges address Israel-Hamas war, Bitcoin crosses $30K | Weekly Recap - crypto.news",
        "content": "This week, U.S. regulators dropped charges against Ripple’s executives; Coinbase addresses Hamas’ use of crypto; Bitcoin crosses $30,000 amid discussions surrounding spot ETFs.\n\nSEC waves the white flag\n\nThis week, the U.S. Securities and Exchange Commission (SEC) dropped its charges against Ripple’s executives Brad Garlinghouse and Chris Larsen. However, court documents confirmed that this dismissal does not signify the conclusion of the SEC’s case against Ripple.\n\nBoth parties are actively engaged in negotiations to address Ripple’s alleged violations related to its Institutional Sales of XRP. They have established a deadline of Nov. 9 to establish a briefing schedule, or they may face court intervention.\n\nXRP responded with a rally. The asset surged 7.6% in an inter-day uptick, conquering the $0.50 and $0.51 price thresholds in one fell sweep.\n\nSeparately, Ripple is seeking a Senior Manager of Shareholder Communications. The move generated significant attention in the crypto community. Speculation was rife that this move might indicate potential initial public offering (IPO) plans from Ripple. The job description outlines responsibilities related to managing major undertakings, including mergers, and acquisitions.\n\nFake news on BTC ETF approval\n\nMeanwhile, as the SEC continues to delay a response on the multiple spot BTC ETF applications on its desk, crypto media outlet Cointelegraph reported Monday that the agency has approved BlackRock’s iShares spot BTC ETF application.\n\nThe report was summarily dismissed by BlackRock and the SEC, with both parties confirming that the agency is still reviewing the application. However, the effects of the fake news were felt in the market. Bitcoin jumped toward the $30,000 mark on the back of the report before dropping quickly.\n\nAs the market reacted to the report with a surge, a large investor placed a remarkable $5.7 billion wager in the Bitcoin Futures market. The market also saw $42 million in short liquidations, as disclosed by CryptoQuant chief Ki Young Ju.\n\nShortly after BlackRock debunked the claims, BlackRock CEO Larry Fink discussed them on Fox Business but neglected to highlight any specifics surrounding the ETF application. He emphasized that the uproar in the market was due to a growing interest in cryptocurrencies among institutional clients.\n\nHowever, industry pundits believe the effects of the fake news could be used by the SEC to reject the Bitcoin ETF applications on the grounds of market susceptibility to manipulation.\n\nMarket analysts, such as Bitfinexed, support this view, presenting a case for market manipulation in potential ETF denials. Nonetheless, Bloomberg experts remain optimistic, predicting that there is a 90% chance of the SEC approving a spot BTC ETF by early 2024.\n\nAnother slew of global regulatory efforts\n\nThis week witnessed another slew of regulatory efforts and enforcement actions. Despite being stretched with its ongoing lawsuits against Ripple, Coinbase and Binance, the SEC still had some time to slap a fine on another crypto entity.\n\nDigital asset firm Thor Technologies and CEO David Chin received a $1.05 million fine from the SEC for allegedly distributing unlicensed securities. They offered project tokens as investment opportunities, which the SEC claims violated securities provisions. They now face a substantial penalty for their actions.\n\nThe crypto scene witnessed one of the effects of the SEC’s continued crackdown on the industry. LBRY announced its closure due to insurmountable debts, including SEC-related and legal obligations. Their court case resulted in a $111,000 settlement as they lost the judgment to the regulator amid debt to other entities.\n\nThe FBI and New York AG come for crypto projects\n\nThe FBI also took center stage this week. The agency fined six individuals in New York for engaging in unlicensed cryptocurrency exchange activities between July 2021 and September 2023.\n\nThey conducted covert crypto-to-cash conversions on the darknet, failing to comply with FinCEN’s licensing requirements. While most face consequences, one was released on conditional terms.\n\nNew York Attorney General Letitia James also jumped on the enforcement party this week. She filed a billion-dollar lawsuit against Gemini Trust, Genesis Capital, and Digital Currency Group, alleging deceptive practices in the crypto space.\n\nThe suit focuses on Gemini’s ‘Gemini Earn’ program, where they allegedly failed to disclose Genesis’ instability. Letitia aims to restrict these companies’ operations in New York’s financial sector, sparking crypto controversy.\n\nCoinbase’s growth moves\n\nAmid the chaos in the industry, Coinbase made two growth-oriented moves this week. The exchange introduced a perpetual futures offering for its Advanced retail users outside the U.S. The offering supports four crypto assets: BTC, ETH, LTC and XRP. Trading began on Oct. 18, the day of the announcement.\n\nCoinbase disclosed plans to extend its foothold in the European market, applying for a new EU license under the upcoming MiCA regulation, slated to take effect in December 2024. The exchange’s expansion plans come amid the regulatory uncertainty in the U.S.\n\nNana Murugesan, Coinbase’s VP of International and Business Development, confirmed their commitment to the European Union. Having first flocked to Ireland in 2018, the company aims to make the country its European base amid its expansion plans.\n\nConcerns surrounding Israel-Palestine conflict\n\nThe Israel-Palestine conflict spilled into this week, with casualties mounting up. As the escalation progressed, market leaders expressed apprehension about Hamas leveraging crypto for donations. Reports suggested that Binance blocked over 100 accounts tied to Hamas at the request of Israel.\n\nThis week, Coinbase echoed the concerns raised by industry leaders. The American exchange expressed its stance against the use of crypto for donations by groups such as Hamas. They noted that they have a team of 400 individuals under their compliance unit. The work of this team is to report any suspicious activity in this regard.\n\nAmid the growing concerns, the U.S. Treasury sanctioned Gaza-based crypto exchange Buy Cash, leveraged by Hamas for crypto donations. Additionally, the Treasury extended these sanctions to ten key members of Hamas and their financial associates in Qatar, Algeria, Turkey, and Sudan.\n\nA favorable week for Bitcoin\n\nDespite the chaos this week, the Bitcoin market saw favorable movements. These bullish metrics started surfacing on Oct. 16, when reports revealed that BTC whales have continued to accumulate more tokens, as the asset held firm above $26,000.\n\nWhile the fake news on the approval of the BTC ETF artificially pumped BTC to $30,000 on Oct. 16, this rally was unsustainable, leading to a crash to $28,500 by the end of the day. BTC faced two days of constant loses following this development, as market participants actively sold off their holdings.\n\nHowever, the asset made a comeback on Oct. 19, increasing by 5.53% from Oct. 19 to Oct. 21. Amid this upsurge, Bitcoin crossed the $30,000 mark, hitting a three-month high of $30,379. Despite a drop from this high, BTC is still up 10.2% from the value it started the week with."
    }
]