[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL3JlZ3VsYXRpb25zL3JpcHBsZS12cy1zZWMtZGViYXRpbmctdGhlLWhvd2V5LXRlc3QtYW5kLWZ1bmdpYmlsaXR5LW9mLXhycC01NDYzMNIBc2h0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL3JlZ3VsYXRpb25zL3JpcHBsZS12cy1zZWMtZGViYXRpbmctdGhlLWhvd2V5LXRlc3QtYW5kLWZ1bmdpYmlsaXR5LW9mLXhycC01NDYzMC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 May 2023 07:00:00 GMT",
        "title": "Ripple vs. SEC: Debating the Howey Test and Fungibility of XRP - The Currency Analytics",
        "content": "The legal battle between Ripple and the U.S. Securities and Exchange Commission (SEC) has reached a critical juncture, with Ripple’s legal team accusing the SEC of distorting the Howey test, a fundamental legal framework for assessing the security status of assets. Additionally, Ripple’s Chief Legal Officer has publicly criticized the SEC’s interpretation of the “common enterprise” aspect. This article delves into the ongoing legal confrontation, providing a comprehensive analysis of Ripple’s arguments and the SEC’s counterclaims.\n\nThe Howey test, originating from a landmark Supreme Court case in 1946, serves as a key benchmark for determining whether an investment qualifies as a security. Ripple’s legal team asserts that the SEC has misinterpreted the test by placing undue emphasis on the concept of a “common enterprise.” Their argument centers on the contention that the SEC is expanding the original intent of the Howey test, which primarily focused on the existence of a “community of interest” rather than rigidly defining a “common enterprise.” Ripple aims to challenge the SEC’s classification of XRP as a security by contesting the SEC’s interpretation.\n\nAccording to Ripple, XRP is not a security but rather a digital asset with inherent utility within the Ripple network. They argue that XRP’s primary function is facilitating fast and cost-effective cross-border transactions, and it does not represent an ownership interest or investment contract in Ripple Labs. Ripple maintains that the SEC’s classification of XRP as a security would stifle innovation and impede the growth of the digital asset industry.\n\nStuart Alderoty, Chief Legal Officer at Ripple, has utilized Twitter as a platform to voice his concerns regarding the SEC’s stance on the “common enterprise” component of the Howey test. Alderoty highlights a discrepancy in the SEC’s argument by pointing out the SEC’s own position in the original Howey case. The ruling in the Howey case indicated that a “common enterprise” was not essential when a “community of interest” existed. By exposing this inconsistency, Ripple aims to undermine the SEC’s case and cast doubt on the SEC’s current position.\n\nAlderoty argues that the SEC’s rigid interpretation of a “common enterprise” fails to acknowledge the decentralized nature of XRP and the widespread ownership among retail investors. He asserts that the SEC’s focus on the term “common enterprise” disregards the broader context of the Howey test and seeks to establish a new standard that deviates from existing legal precedent.\n\nThe SEC has also raised concerns about the fungibility of XRP, drawing a comparison to an ounce of gold that cannot be subdivided. In response, Ripple’s legal team challenges this argument by asserting that XRP is fully fungible and can be divided into smaller units. They argue that the SEC’s analogy to gold is flawed, as XRP’s divisibility enables seamless transactions and interchangeability. Ripple’s defense aims to refute the SEC’s contention regarding the limited fungibility of XRP.\n\nRipple’s legal team emphasizes that XRP’s unique attributes, including its divisibility, interoperability, and broad adoption, contribute to its fungibility. They contend that the SEC’s assertion fails to recognize the practicality and efficiency of XRP as a digital asset in facilitating global financial transactions.\n\nAs the legal battle between Ripple and the SEC intensifies, Ripple’s legal team continues to challenge the SEC’s interpretation of the Howey test and the notion of XRP as a security to preserve the growth and innovation in the digital asset industry. The outcome of this legal dispute will have significant implications for the regulatory landscape surrounding cryptocurrencies and their classification."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTUvY3J5cHRvLWNvbXBhbmllcy1jb2luYmFzZS1yaXBwbGUtYXJlLXBsYXlpbmctcG9rZXItd2l0aC10aGUtc2VjLmh0bWzSAWhodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNS8xNS9jcnlwdG8tY29tcGFuaWVzLWNvaW5iYXNlLXJpcHBsZS1hcmUtcGxheWluZy1wb2tlci13aXRoLXRoZS1zZWMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 May 2023 07:00:00 GMT",
        "title": "Crypto companies are playing poker with the SEC as agency cracks down on the industry - CNBC",
        "content": "Major players are hoping that the SEC and Washington takes, what crypto watchers see as bluffs, seriously and soften the hard line that regulators have taken on the industry. Roman Strelchenko | 500Px Plus | Getty Images\n\nCryptocurrency companies are playing a game of poker with the Securities and Exchange Commission, making bold threats to leave the U.S. as the regulator steps up pressure on the industry to toe the line. Major players are hoping that the SEC and Washington takes, what crypto watchers see as bluffs, seriously and soften the hard line that regulators have taken on the industry. Executives at firms including crypto exchange Coinbase and blockchain services company Ripple have piled on with comments laying into the SEC and signaling plans to shift business overseas, in a bid to rally support and send a message to U.S. politicians concerned that the country may miss out on a key technological innovation. Coinbase CEO Brian Armstrong said last week that the SEC was on a \"lone crusade\" with its tough actions against certain crypto companies. He added that Chair Gary Gensler had taken an \"anti-crypto view,\" despite earlier being a supporter of the industry during his time as an economics professor at the MIT Sloan School of Management. \"The SEC is a bit of an outlier here,\" Armstrong told CNBC's Dan Murphy in an interview in Dubai. \"I don't think [Gensler is] necessarily trying to regulate the industry as much as maybe curtail it. But he's created some lawsuits, and I think it's quite unhelpful for the industry in the U.S. writ large.\" Brad Garlinghouse, CEO of Ripple, also tore into the SEC this week. When asked for his message to Gensler as the company announced an expansion into Dubai, he quipped, \"Who?\" before later saying Ripple will have spent $200 million defending itself against a lawsuit initiated by the regulator by the time it is over. \"I find it as a company that started in the United States and as somebody who is a U.S. citizen, it's sad. I have sadness about this. The U.S. is getting passed not just by a little bit but by a lot,\" Garlinghouse said. \"The tough thing about this is you have a country that I think has put politics ahead of policy and that's not a good decision if you're trying to invest in the economy.\"\n\nwatch now\n\nDubai and Europe have proven to be much more favorable markets with their virtual asset regulatory frameworks, Garlinghouse said, adding: \"The United States is definitely stuck.\" Garlinghouse, Armstrong and other crypto bosses have made threats to leave the U.S., highlighting concern from the industry that the SEC's crackdown is becoming too harsh. The regulator has taken strong enforcement actions against companies including Ripple, Coinbase, Kraken and Paxos, accusing each of flouting securities laws. The SEC's contention is that most tokens in the market may qualify as securities, which would subject them to much stricter requirements around registration and disclosure. Crypto firms, naturally, have denied assets they issue or list on their platforms should be treated as securities.\n\nWill they stay or will they go?\n\nThe question is: could they actually leave? It looks pretty unlikely. \"The U.S. is one of the largest markets for crypto, and hence it is highly unlikely that they will leave,\" Larisa Yarovaya, associate professor of finance at Southampton University, told CNBC via email. \"The biggest fear of crypto companies is that regulation will cause panic among crypto investors and prices will go down. To look confident (even arrogant) is a common tactic of crypto company CEOs. They think this will translate into investors' confidence, overconfidence in some cases, and will encourage further irrational behaviour among investors, e.g. HODL [hold on for dear life] even when markets are falling.\" Ripple's Garlinghouse has been threatening to move his company's headquarters overseas since 2020. In October that year, he said the U.K., Switzerland, Singapore, Japan and the United Arab Emirates were under consideration for Ripple's potential move abroad. That hasn't happened yet. Coinbase's chief, meanwhile, suggested at a London fintech conference in April that the firm would consider options of investing more abroad, including relocating from the U.S. to elsewhere, if the exchange doesn't get regulatory clarity in the U.S. A month later, Armstrong said Coinbase \"is not going to relocate overseas.\"\n\nwatch now\n\n\"We're always going to have a U.S. presence ... But the U.S. is a little bit behind right now,\" he told CNBC. The U.S. is a huge market for the industry, with over 50 million Americans saying they own some crypto, according to a survey conducted by Morning Consult for Coinbase. \"There's a much greater focus on the international markets for those firms. But at the top end of the market, personally I just can't see that ever happening that you leave the United States market completely,\" Jonathan Levin, co-founder of Chainalysis, told CNBC in an interview in London. \"It's more about how much do you invest in new international expansion where maybe that wasn't as high up on the agenda, but now it's let's look at France, let's look at the U.K.\" On top of this, the practicalities of moving these already large companies out of the U.S. would be tough. \"Although these industries are virtual by their nature, they still need people, and people have families, mortgages, and preferences on where they live. Replacing them with local talent in the new place may be easier said than done,\" George Weston, a partner at global offshore law firm Harneys, told CNBC via email.\n\nRegulatory certainty outside the U.S.\n\nCrypto bosses are playing up to some officials' concerns that the U.S. has become shrouded in regulatory uncertainty while other jurisdictions, like the European Union and U.K., have charged forward with proposed regulatory frameworks for digital assets. Hester Peirce, a commissioner at the SEC, said at a Financial Times conference last week that the U.S. was \"shooting ourselves in the foot by not having a regulatory regime in the U.S.\" She praised the EU on its progress with waving through laws for the crypto industry. The EU is expected to bring in the first comprehensive set of regulations for digital assets, known as Markets in Crypto Assets (MiCA), sometime in 2024. \"It's really commendable that Europe was able to get that done so quickly,\" Peirce said, according to Reuters. \"If we built a good regulatory regime, people would come. I think you will see that with MiCA.\" Diego Ballon Ossio, a partner at law firm Clifford Chance, said other jurisdictions including the U.K. and EU are changing their legislative frameworks to create clear regulatory regimes for exchanges.\n\nwatch now"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTUvY3J5cHRvLWNvbXBhbmllcy1jb2luYmFzZS1yaXBwbGUtYXJlLXBsYXlpbmctcG9rZXItd2l0aC10aGUtc2VjLmh0bWzSAWhodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNS8xNS9jcnlwdG8tY29tcGFuaWVzLWNvaW5iYXNlLXJpcHBsZS1hcmUtcGxheWluZy1wb2tlci13aXRoLXRoZS1zZWMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 May 2023 07:00:00 GMT",
        "title": "Crypto companies are playing poker with the SEC as agency cracks down on the industry - CNBC",
        "content": "Major players are hoping that the SEC and Washington takes, what crypto watchers see as bluffs, seriously and soften the hard line that regulators have taken on the industry. Roman Strelchenko | 500Px Plus | Getty Images\n\nCryptocurrency companies are playing a game of poker with the Securities and Exchange Commission, making bold threats to leave the U.S. as the regulator steps up pressure on the industry to toe the line. Major players are hoping that the SEC and Washington takes, what crypto watchers see as bluffs, seriously and soften the hard line that regulators have taken on the industry. Executives at firms including crypto exchange Coinbase and blockchain services company Ripple have piled on with comments laying into the SEC and signaling plans to shift business overseas, in a bid to rally support and send a message to U.S. politicians concerned that the country may miss out on a key technological innovation. Coinbase CEO Brian Armstrong said last week that the SEC was on a \"lone crusade\" with its tough actions against certain crypto companies. He added that Chair Gary Gensler had taken an \"anti-crypto view,\" despite earlier being a supporter of the industry during his time as an economics professor at the MIT Sloan School of Management. \"The SEC is a bit of an outlier here,\" Armstrong told CNBC's Dan Murphy in an interview in Dubai. \"I don't think [Gensler is] necessarily trying to regulate the industry as much as maybe curtail it. But he's created some lawsuits, and I think it's quite unhelpful for the industry in the U.S. writ large.\" Brad Garlinghouse, CEO of Ripple, also tore into the SEC this week. When asked for his message to Gensler as the company announced an expansion into Dubai, he quipped, \"Who?\" before later saying Ripple will have spent $200 million defending itself against a lawsuit initiated by the regulator by the time it is over. \"I find it as a company that started in the United States and as somebody who is a U.S. citizen, it's sad. I have sadness about this. The U.S. is getting passed not just by a little bit but by a lot,\" Garlinghouse said. \"The tough thing about this is you have a country that I think has put politics ahead of policy and that's not a good decision if you're trying to invest in the economy.\"\n\nwatch now\n\nDubai and Europe have proven to be much more favorable markets with their virtual asset regulatory frameworks, Garlinghouse said, adding: \"The United States is definitely stuck.\" Garlinghouse, Armstrong and other crypto bosses have made threats to leave the U.S., highlighting concern from the industry that the SEC's crackdown is becoming too harsh. The regulator has taken strong enforcement actions against companies including Ripple, Coinbase, Kraken and Paxos, accusing each of flouting securities laws. The SEC's contention is that most tokens in the market may qualify as securities, which would subject them to much stricter requirements around registration and disclosure. Crypto firms, naturally, have denied assets they issue or list on their platforms should be treated as securities.\n\nWill they stay or will they go?\n\nThe question is: could they actually leave? It looks pretty unlikely. \"The U.S. is one of the largest markets for crypto, and hence it is highly unlikely that they will leave,\" Larisa Yarovaya, associate professor of finance at Southampton University, told CNBC via email. \"The biggest fear of crypto companies is that regulation will cause panic among crypto investors and prices will go down. To look confident (even arrogant) is a common tactic of crypto company CEOs. They think this will translate into investors' confidence, overconfidence in some cases, and will encourage further irrational behaviour among investors, e.g. HODL [hold on for dear life] even when markets are falling.\" Ripple's Garlinghouse has been threatening to move his company's headquarters overseas since 2020. In October that year, he said the U.K., Switzerland, Singapore, Japan and the United Arab Emirates were under consideration for Ripple's potential move abroad. That hasn't happened yet. Coinbase's chief, meanwhile, suggested at a London fintech conference in April that the firm would consider options of investing more abroad, including relocating from the U.S. to elsewhere, if the exchange doesn't get regulatory clarity in the U.S. A month later, Armstrong said Coinbase \"is not going to relocate overseas.\"\n\nwatch now\n\n\"We're always going to have a U.S. presence ... But the U.S. is a little bit behind right now,\" he told CNBC. The U.S. is a huge market for the industry, with over 50 million Americans saying they own some crypto, according to a survey conducted by Morning Consult for Coinbase. \"There's a much greater focus on the international markets for those firms. But at the top end of the market, personally I just can't see that ever happening that you leave the United States market completely,\" Jonathan Levin, co-founder of Chainalysis, told CNBC in an interview in London. \"It's more about how much do you invest in new international expansion where maybe that wasn't as high up on the agenda, but now it's let's look at France, let's look at the U.K.\" On top of this, the practicalities of moving these already large companies out of the U.S. would be tough. \"Although these industries are virtual by their nature, they still need people, and people have families, mortgages, and preferences on where they live. Replacing them with local talent in the new place may be easier said than done,\" George Weston, a partner at global offshore law firm Harneys, told CNBC via email.\n\nRegulatory certainty outside the U.S.\n\nCrypto bosses are playing up to some officials' concerns that the U.S. has become shrouded in regulatory uncertainty while other jurisdictions, like the European Union and U.K., have charged forward with proposed regulatory frameworks for digital assets. Hester Peirce, a commissioner at the SEC, said at a Financial Times conference last week that the U.S. was \"shooting ourselves in the foot by not having a regulatory regime in the U.S.\" She praised the EU on its progress with waving through laws for the crypto industry. The EU is expected to bring in the first comprehensive set of regulations for digital assets, known as Markets in Crypto Assets (MiCA), sometime in 2024. \"It's really commendable that Europe was able to get that done so quickly,\" Peirce said, according to Reuters. \"If we built a good regulatory regime, people would come. I think you will see that with MiCA.\" Diego Ballon Ossio, a partner at law firm Clifford Chance, said other jurisdictions including the U.K. and EU are changing their legislative frameworks to create clear regulatory regimes for exchanges.\n\nwatch now"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTUvY3J5cHRvLWNvbXBhbmllcy1jb2luYmFzZS1yaXBwbGUtYXJlLXBsYXlpbmctcG9rZXItd2l0aC10aGUtc2VjLmh0bWzSAWhodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNS8xNS9jcnlwdG8tY29tcGFuaWVzLWNvaW5iYXNlLXJpcHBsZS1hcmUtcGxheWluZy1wb2tlci13aXRoLXRoZS1zZWMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 May 2023 07:00:00 GMT",
        "title": "Crypto companies are playing poker with the SEC as agency cracks down on the industry - CNBC",
        "content": "Major players are hoping that the SEC and Washington takes, what crypto watchers see as bluffs, seriously and soften the hard line that regulators have taken on the industry. Roman Strelchenko | 500Px Plus | Getty Images\n\nCryptocurrency companies are playing a game of poker with the Securities and Exchange Commission, making bold threats to leave the U.S. as the regulator steps up pressure on the industry to toe the line. Major players are hoping that the SEC and Washington takes, what crypto watchers see as bluffs, seriously and soften the hard line that regulators have taken on the industry. Executives at firms including crypto exchange Coinbase and blockchain services company Ripple have piled on with comments laying into the SEC and signaling plans to shift business overseas, in a bid to rally support and send a message to U.S. politicians concerned that the country may miss out on a key technological innovation. Coinbase CEO Brian Armstrong said last week that the SEC was on a \"lone crusade\" with its tough actions against certain crypto companies. He added that Chair Gary Gensler had taken an \"anti-crypto view,\" despite earlier being a supporter of the industry during his time as an economics professor at the MIT Sloan School of Management. \"The SEC is a bit of an outlier here,\" Armstrong told CNBC's Dan Murphy in an interview in Dubai. \"I don't think [Gensler is] necessarily trying to regulate the industry as much as maybe curtail it. But he's created some lawsuits, and I think it's quite unhelpful for the industry in the U.S. writ large.\" Brad Garlinghouse, CEO of Ripple, also tore into the SEC this week. When asked for his message to Gensler as the company announced an expansion into Dubai, he quipped, \"Who?\" before later saying Ripple will have spent $200 million defending itself against a lawsuit initiated by the regulator by the time it is over. \"I find it as a company that started in the United States and as somebody who is a U.S. citizen, it's sad. I have sadness about this. The U.S. is getting passed not just by a little bit but by a lot,\" Garlinghouse said. \"The tough thing about this is you have a country that I think has put politics ahead of policy and that's not a good decision if you're trying to invest in the economy.\"\n\nwatch now\n\nDubai and Europe have proven to be much more favorable markets with their virtual asset regulatory frameworks, Garlinghouse said, adding: \"The United States is definitely stuck.\" Garlinghouse, Armstrong and other crypto bosses have made threats to leave the U.S., highlighting concern from the industry that the SEC's crackdown is becoming too harsh. The regulator has taken strong enforcement actions against companies including Ripple, Coinbase, Kraken and Paxos, accusing each of flouting securities laws. The SEC's contention is that most tokens in the market may qualify as securities, which would subject them to much stricter requirements around registration and disclosure. Crypto firms, naturally, have denied assets they issue or list on their platforms should be treated as securities.\n\nWill they stay or will they go?\n\nThe question is: could they actually leave? It looks pretty unlikely. \"The U.S. is one of the largest markets for crypto, and hence it is highly unlikely that they will leave,\" Larisa Yarovaya, associate professor of finance at Southampton University, told CNBC via email. \"The biggest fear of crypto companies is that regulation will cause panic among crypto investors and prices will go down. To look confident (even arrogant) is a common tactic of crypto company CEOs. They think this will translate into investors' confidence, overconfidence in some cases, and will encourage further irrational behaviour among investors, e.g. HODL [hold on for dear life] even when markets are falling.\" Ripple's Garlinghouse has been threatening to move his company's headquarters overseas since 2020. In October that year, he said the U.K., Switzerland, Singapore, Japan and the United Arab Emirates were under consideration for Ripple's potential move abroad. That hasn't happened yet. Coinbase's chief, meanwhile, suggested at a London fintech conference in April that the firm would consider options of investing more abroad, including relocating from the U.S. to elsewhere, if the exchange doesn't get regulatory clarity in the U.S. A month later, Armstrong said Coinbase \"is not going to relocate overseas.\"\n\nwatch now\n\n\"We're always going to have a U.S. presence ... But the U.S. is a little bit behind right now,\" he told CNBC. The U.S. is a huge market for the industry, with over 50 million Americans saying they own some crypto, according to a survey conducted by Morning Consult for Coinbase. \"There's a much greater focus on the international markets for those firms. But at the top end of the market, personally I just can't see that ever happening that you leave the United States market completely,\" Jonathan Levin, co-founder of Chainalysis, told CNBC in an interview in London. \"It's more about how much do you invest in new international expansion where maybe that wasn't as high up on the agenda, but now it's let's look at France, let's look at the U.K.\" On top of this, the practicalities of moving these already large companies out of the U.S. would be tough. \"Although these industries are virtual by their nature, they still need people, and people have families, mortgages, and preferences on where they live. Replacing them with local talent in the new place may be easier said than done,\" George Weston, a partner at global offshore law firm Harneys, told CNBC via email.\n\nRegulatory certainty outside the U.S.\n\nCrypto bosses are playing up to some officials' concerns that the U.S. has become shrouded in regulatory uncertainty while other jurisdictions, like the European Union and U.K., have charged forward with proposed regulatory frameworks for digital assets. Hester Peirce, a commissioner at the SEC, said at a Financial Times conference last week that the U.S. was \"shooting ourselves in the foot by not having a regulatory regime in the U.S.\" She praised the EU on its progress with waving through laws for the crypto industry. The EU is expected to bring in the first comprehensive set of regulations for digital assets, known as Markets in Crypto Assets (MiCA), sometime in 2024. \"It's really commendable that Europe was able to get that done so quickly,\" Peirce said, according to Reuters. \"If we built a good regulatory regime, people would come. I think you will see that with MiCA.\" Diego Ballon Ossio, a partner at law firm Clifford Chance, said other jurisdictions including the U.K. and EU are changing their legislative frameworks to create clear regulatory regimes for exchanges.\n\nwatch now"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmRvd250b2VhcnRoLm9yZy5pbi9uZXdzL2Vudmlyb25tZW50L3RoZS1yaXBwbGUtZWZmZWN0LWEtcmVwb3J0LWZyb20ta29kYWktcy1iZWxvdmVkLWxha2UtODkzMTbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 May 2023 07:00:00 GMT",
        "title": "The ripple effect: A report from Kodai's beloved lake - Down To Earth Magazine",
        "content": "Through community partnership, Kodaikanal’s residents are working with the municipality to find real solutions for the evolving needs of its central water body\n\nThis classic shot of Kodai Lake, viewed from one of the slopes that surround it, is seen from the perspective of the wetland that adjoins it. The lake is the setting for for films such as Jo Jeeta Wohi Sikandar and Penguin, in Hindi and Tamil respectively. Photo: Sids/Shutterstock\n\nIt’s noon on a Friday in February, and a small group of Kodaikanal residents are crowded outside the municipality office, located by the entrance to the town’s commercial centre, which flanks Kodaikanal Lake. We are examining a sample of fibre-reinforced plastic made to look like a picket fence, set up by the town’s municipal engineer, Muthukumar, to show us ahead of our meeting with the commissioner (till last month), T Narayanan. It will replace what appears to be serviceable metal fencing, around the lake. The design for the fence is being shared with residents following questions raised regarding what exactly the planned improvements for the lake mean, and for whom.\n\nLast July, a Rs 24-crore project was begun around Kodai Lake to develop a new municipality boathouse, fix and obtain boats, renovate parks, refurbish the pavement and plant 4,000 flowering plants around the lake. This project went ahead without the establishment of a committee of experts—aside from those consulted by the government at Anna University, at their discretion. This is a requirement in this eco-sensitive hill station and area.\n\nThe lake offers revenue to those who conduct businesses around it, particularly those benefiting from the floating population of eight lakh tourists a month and counting (the figures are as reported by the town’s tourism office). For a long time, the lake has been known to contain untreated sewage, yet these improvements are chiefly cosmetic (as we reported last July in an in-depth examination of water quality and other concerns around the lake).\n\nThe residents, who make up an informal group called Save Kodai Lake, asked for a detailed project report, which was presented as a video last October, by the Anna University specialists. The video showed a 3D-modelled, 3-metre-wide pavement (which would encroach into both the road and the lake, residents noted) and a boathouse with an indoor sports facility. The latter seems like a wild fantasy in a town whose roads are often pitted with potholes, and which struggles to provide even basic amenities such as drinking water and medical facilities to all residents. ‘This might work for Singapore, but in Kodai unique natural beauty is what is appreciated,’ Sunayana Choudhry, convenor of INTACH Kodai, told the commissioner, after viewing these plans, echoing the concerns of many.\n\nMembers of the Palni Hills Conservation Council (PHCC) interact with a reporter from The Hindu (fourth from left in both images) around the lake. According to the PHCC, no local NGO has been consulted to be part of the district-level wetlands management committee under the state of Tamil Nadu. Photos: Azad Reese\n\nWhat has also emerged as a major concern is the classification of the lake, which is listed on page 4 of the Tamil Nadu State Wetlands Authority directory. This establishes that the lake is part of a valuable ecosystem, critical to the larger Kodaikanal region. However, it has not been officially notified as such. Notification is a separate and necessary process, bureaucrats in Chennai remind us.\n\nStill, along with 28 water bodies in Tamil Nadu, Kodai Lake is protected. Last March, the Union government reiterated a 2017 ruling that made it one of 200,000 wetlands across India that are protected from encroachment and development. There is a districtlevel wetlands management committee under the Tamil Nadu State Wetland Authority which requires an NGO to be a committee member. It is believed that this committee is dormant, the Palni Hills Conservation Council (PHCC) told The Kodai Chronicle.\n\nCitizens’ Engagement\n\nAll of this is why these meetings between the citizens of the Save Kodai Lake group and the municipality are taking place. We are a colourful bunch, sporting hats, umbrellas and jholas, ready to voice various citizens’ groups’ concerns in Kodai. Around 30 of us communicate via a group on WhatsApp. Some of us meet every few months, with the authorities and/or on our own, for updates and/ or an understanding of how to use citizen engagement to make progress on environmental and civic issues—more often, if circumstances call for them. A variety of concerns are voiced.\n\nThe commissioner tells us, ‘Everything I do is for you. Tell us how we can work together.’ He conducts long meetings with the group, sometimes running up to two hours, and is eager to share details when the group meets. At the time of writing this piece, he was not available for comment in response to more detailed questions.\n\nDialogues with the municipality, the local government of Kodaikanal, are part of a larger process. Here, concerned residents look on (above) as Kodai’s most recent commissioner, T Narayanan (centre) measures a sample fence for Kodai Lake, this February; and below, (from left to right) the author, Reena Raghavamoorthy, Lathika George, Ramji, Avijit Michael, G Bala and former commissioner T Narayanan (far right) pose, earlier this year. Photos: Save Kodai Lake group\n\nAt one meeting, Mark Antrobus, president of the PHCC, is emphasising that organic methods for cleaning the lake can please all parties. At another, Banu Hameed, a member of the long-standing umbrella group of organisations called the United Citizens Council of Kodaikanal (UCCK), enquires about rumours around plans to build a statue at the centre of the lake—later, it is clarified that it is a fountain that is in the works (it is now in operation). When a reporter from The Hindu comes to town, A Ravikumar, head of the lake’s shopkeepers’ union, joins the press meeting we organise.\n\nSome of the more privileged residents are sometimes speaking for those who may never attend a meeting with the commissioner. ‘There is no place to drive, with so much of the road taken up by the pavement. First, they put tiles on the pavement. Now, they have built it higher. Every month, there is a new project with new funding,’ Anthonydasan, a local taxi driver, told TKC. (The new pavement has, in fact, been built so high that even a visitor who is over 6 feet tall struggled to ascend and descend it, recently.)\n\nA view of the lake in April 2023, from The Carlton hotel, with one of the new fountains which emerged in April. Lit up at its base with colors at night, it is one of several cosmetic developments planned for and around the lake. Photo: Rajni George\n\nResident Lathika George was one of those who walked regularly around the lake for around 22 years till she tripped and fell, which led to a serious injury. This is not unusual. The pavement is constantly in a state of construction or disrepair, and there are many others who have had similar accidents in one of the few recreational and community spaces available to citizens from all walks of life— shopkeepers, contractors, business people, retired folks. ‘To be fair,’ she says, ‘there is an intention to do the right thing on the part of the authorities. However, there seems to be a lack of planning and regard for safety whenever new projects are undertaken. Instead, the focus is more on short-term and short-sighted projects.’\n\nI represent the local press (there is no other publication with a base in Kodai, in Tamil or English). I have been keeping notes along with G Bala, PHCC secretary, a steady presence who often facilitates communication with the authorities in Tamil.\n\nAttending these meetings over the last two years has been part of an education in local reportage, civic processes in small-town India and the vagueness of rural record-keeping. Fact checks are gruelling exercises in collective memory. It is, ironically, easier to find out what is happening in Chennai or New Delhi than it is in our own town. And it takes time to puzzle together the pieces, with so many different perspectives to consider.\n\nThe lake offers inspiration for photographers and artists who frequent its perimeter and capture it for posterity. Like Mohammed Farooq, who walks around it daily and takes popular portraits of the water body (above); or Sumitha Sundaram, an artist who sometimes paints by the lake with her portable easel (below). Photos: Mohammed Farooq, Sumitha Sundaram\n\nThe Lake, on Paper\n\nThe alternative to dialogue—an extension of the privilege of this group but also the right of any citizen—is legal action, of course. This February, the Supreme Court directed the state to respond to an application filed by the UCCK regarding the alleged violation of wetland norms around Kodai Lake. It was requested that developments around the lake—which are not permitted within 200 metres of this water body—be stayed till experts have been consulted and informed plans have been made transparent, available to the public and reworked as necessary. At the time of writing this, the municipality has not filed a response.\n\nShalini Biswajit, an artist who lives in Chennai and has a house by the lake, alerted local acquaintances last July when she saw a boathouse coming up fast by her family’s property. The construction was labelled a temporary construction; as of this April, it still stands. And, a new floating pavement has been observed near the side of the lake by the telephone exchange, with no railings around it. Such projects frequently rear their heads in this hill station, and some attract more attention than others.\n\nVendors by the lake cater to the thousands of tourists who visit Kodai regularly. Photo: Rajni George\n\nCars encroach upon the pavement during a traffic jam around Kodai Lake during ‘season time’, in May 2022. These jams are common around town and the lake, when tourist footfall is high, as has been seen in April through May, this year. Photo: Rajni George\n\nThe star-shaped lake, with a perimeter of 5 kilometres and an area of 64 hectares, is a particular magnet for these initiatives. It is also a rallying point for residents of all socioeconomic backgrounds, who live near it and have a personal stake in its upkeep. Many walk around it daily and see it as the heart of this little town. Like other central water bodies in small settlements, the lake occupies a place in the public imagination that is outsized.\n\nStill, what is yet to be understood is how to classify this water body. Today, it is chiefly a tourist site, intended to generate revenue. It is also a source of water for the lower Palani Hills and surrounding areas. And, it is the tip of the iceberg—the more visible part of a wetland, connected to larger ecosystems that need to be protected. How, then, should it be managed? This is a question people have been trying to answer for decades.\n\nThe Madurai bench of the Madras High Court ruled last year: ‘One goes to Kodaikanal to enjoy the beauty of nature. Before it becomes an eyesore, the situation has to be remedied. Otherwise, Kodaikanal will cease to be what it is. It is time to recognise and adopt the best practices followed by other nations… The District Administration will have to come out with innovative measures and creative solutions.’ These solutions may take many forms.\n\nWhile developments around Kodai Lake may be only the most prominent of the town’s more pressing environmental concerns, they could help us focus on our most urgent needs and offer a model for citizen engagement with local and state-level governance.\n\n\n\nSalvinia molesta (left) is an invasive aquatic species growing in the lake. Ethnobotanist Madhu Ramnath stresses that wetland ecology needs to be prioritised, here. Species such as Acorus calamus, Colocasia sp. (water taros) and Mentha aquatica (water mint) would be more suitable, and are already growing in the Gymkhana marsh, by the lake. Right: Seen this February, a weed harvester at work in the lake. Photos: Vasu Balakrishnan\n\nThe Way Forward\n\n‘We need to request a carrying capacity of the town as well as the lake in particular,’ says environmentalist and resident Madhu Ramnath. He questions why there are no rules regarding vehicles and noise restrictions around the lake, and why we do not know of any studies that the municipality has conducted.\n\n‘What is lacking is the discussion about inlets of water into the lake. We should trace these well beyond the lake, into the surrounding shola forests and their management. This is where we need to push the idea that the lake is not an isolated phenomenon, and that forest management and the dumping of debris in the shola, for example, are part of the concern,’ says Ramnath. Among his concerns for the lake are: the misguided planting of trees on the fringe of the lake, which environmentalists say will only enhance siltation; the ineffective management of blocked silt-traps, which are not mentioned as a focus of future improvements for the lake; and dredging, which can release existing pollutants from the silt lakebed—if untreated, these can be dangerous ‘as, with regards to Kodaikanal, they could also contain mercury’.\n\nThe lake is part of a larger ecosystem in the Palani Hills which is connected to the shola forests, stunted tropical montane forest found in South India. Photo: Salish J Menachery/ Shutterstock\n\nThese are informed opinions on Kodaikanal by a resident expert who is part of a well-established environmental organisation (the PHCC) which is still not allowed an official say. The local Center for Environment and Humanity (CEH) is helping train municipal outreach coordinators in areas like waste management (as outlined in ‘The Good, the Bad and the Ugly’, also in this issue); this could be extended to matters pertaining to the lake. There are others with relevant expertise, and with an eye on the bigger picture.\n\n‘We need to put our minds together, to come up with a long-term, well-thought-out Master Plan to save the lake, working with people living in the lake watershed and the government to rehabilitate our dying lake watershed,’ says C Jeyakaran, a resident organic farmer and PHCC member. He is referring to the land area that channels rainwater to a common outlet—in this case, the lake.\n\nAdditionally, expert advice has been called upon, from further afield. Residents have solicited experts like Mumbai-based Debi Goenka, executive trustee of the Conservation Action Trust, who has successfully protected mangroves, coastal areas of Murud-Janjira and the Sanjay Gandhi National Park, and helped with the notification of many Indian sanctuaries. And, municipal officials have expressed their willingness to work with residents to plan his visit, for a potential consultation on a comprehensive plan.\n\nVolunteers gathered by the lake at a clean-up drive of its surrounds, organised by the Centre for Environment and Humanity (CEH) and The Kodai Chronicle Trust in April 2022. Over 720 kilos of garbage were collected, and then assistant tourism officer M Anandan (third from right) addressed the audience along with solid waste management consultant Dr Rajamanikam Ramamoorthy (second from right). Photo: Rajni George\n\nThis is the direction in which state-level plans are headed, says Deepak Srivastava, Tamil Nadu member of the Wetland Authority. Last year, Srivastava told TKC of his plans to implement a scheme in which citizens and NGOs adopt their local wetlands and work with government officials and committees to preserve them.\n\nMost stakeholders emphasise the need for dialogue and the need to adapt. ‘If the municipality takes a more holistic approach to development and devises a task force of resident experts who can advise them on projects, they share the accountability,’ says one resident, who spoke on the condition of anonymity. ‘Pressure from Chennai and the legal system may be making the authorities more cooperative. But ultimately, environmental challenges here are not only the municipality’s problem—they are ours too.’\n\nRajni George is founding editor and editor-in-chief of The Kodai Chronicle. She has worked at Penguin Random House, Granta and The Caravan. Her work has been published in The New Internationalist, The New York Times, and Mint Lounge. She works remotely in climate change adaptation, and lives between Bangkok and St Mary's Road.\n\nThis article was first published in The Kodai Chronicle and is being reproduced here with due permission"
    }
]