[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmJ1c2luZXNzZ3JlZW4uY29tL2ZlYXR1cmUvNDA4NzM5OS9xdWFsaXR5LW9mZnNldHRpbmctY29tcGFueS1hd2F5LXNlcXVlc3Rlci1jYXJib27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "'High-quality' offsetting: How one company is working to get away from 'I just want to sequester carbon' - BusinessGreen",
        "content": "Despite the nascent voluntary offsets market hitting £1.6bn in value, sifting fools' gold from solid carbon savings is proving a difficult art to master. A wave of recent reports have sparked fresh..."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vaW5keXRvZGF5LjZhbWNpdHkuY29tL2Jyb2FkLXJpcHBsZS1hcnQtZmFpci1pbmRpYW5hcG9saXMtaW7SAU1odHRwczovL2luZHl0b2RheS42YW1jaXR5LmNvbS9icm9hZC1yaXBwbGUtYXJ0LWZhaXItaW5kaWFuYXBvbGlzLWluP19hbXA9dHJ1ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "Broad Ripple Art Fair returns on Saturday, May 20 - INDYtoday",
        "content": "The Indianapolis Art Center will once again gather more than 150 artists selling anything from ceramics to textiles for its 51st annual Broad Ripple Art Fair on May 20-21.\n\nThe outdoor art + music festival will run from 10 a.m. to 5 p.m. with the theme “Better Together.” Because May is Mental Health Awareness Month, the fair will feature a wellness village for the first time. It will offer an opportunity to discuss the benefits of creative wellness and provide resources for environmental, financial, social/emotional, and physical health.\n\nThere will be a special preview party on Friday, May 19 featuring music from the Indianapolis Jazz Collective for those who purchase the VIP Weekend Experience ticket.\n\nGet your tickets."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbmdhcGUuY29tL3hycC1uZXdzLXhycC1kdW1wLWluY29taW5nLXdoYWxlcy1zaGlmdC0xNDAtbWlsbGlvbi14cnAv0gFRaHR0cHM6Ly9jb2luZ2FwZS5jb20veHJwLW5ld3MteHJwLWR1bXAtaW5jb21pbmctd2hhbGVzLXNoaWZ0LTE0MC1taWxsaW9uLXhycC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "XRP Dump Incoming? Whales Shift 140 Million XRP - CoinGape",
        "content": "XRP News: Ripple Labs native crypto, XRP price printed green indexes on Wednesday after incurring heavy selling pressure. However, XRP is still trading under the regulatory pressure enforced by U.S. Securities and Exchange Commission (SEC). In the meantime, crypto whales have been spotted moving millions of XRP tokens over crypto exchanges.\n\nAlso Read: Why Didn’t Ripple Register XRP With US SEC? Brad Garlinghouse Replies\n\nadvertisement\n\nXRP Price Set To Dump?\n\nAs per the data, Around 140 million XRP (approx worth $60 million) have been moved by the crypto whales in multiple transactions over the last 24 hours. However, the biggest transaction recorded by the tracker has been of moving 50 million XRP tokens. A wallet address named Ripple moved $21.4 million worth of XRP to an unknown wallet.\n\nThe tracker caught whales dumping 89 million XRP tokens (approx worth $38 million) in multiple transactions over the past 24 hours. The biggest dump transaction recorded has been of moving 31 million XRP tokens (approx worth $13.1 million) to Bitstamp crypto exchange. However, 59 million XRP tokens (approx worth $25 million) have been moved to the exchange in order dump. Read More XRP News Here…\n\nAlso Read: Is XRP Lawsuit Ruling Key For Coinbase Against US SEC?\n\nThis whale movement suggests that crypto whales are seeking an XRP price surge to sell their holdings to book a profit here. XRP price is on a decline over the past 30 days, registering a decline of 15%.\n\nXRP price is up by around 1.5% in the last 24 hours. It is trading at an average price of $0.431, at the press time. Its 24 hour trading volume is down by 20% to stand at $903 million.\n\nAlso Read: Coinbase May Not Relist XRP Due To This Reason"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9yaXBwbGUteHJwLWNlbnRyYWxpemF0aW9uLWRlYmF0ZS1hLWhlYXRlZC1hcmd1bWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "Ripple (XRP) centralization debate: A heated argument! - Cointribune EN",
        "content": "Wed 10 May 2023 ▪ 4 min of reading ▪ by La Rédaction C.\n\nThere is a heated debate going on in the crypto world about the centralization of Ripple (XRP) between supporters and detractors of this crypto. Justin Bons, founder of CyberCapital, has accused Ripple’s leaders of making false promises of decentralization. But Matt Hamilton and David Schwartz are not backing down, and they vigorously refute these allegations. The debate is raging, and it doesn’t seem to be stopping anytime soon!\n\nIs Ripple’s XRP really decentralized?\n\nThe disputes between Bitcoin supporters and those of other networks are widespread in the crypto world. In fact, this opposition has given birth to the term “maximalist,” referring to fervent defenders of Bitcoin. Some of these maxis are so extreme that they consider any crypto other than BTC as “shitcoin.”\n\nBut let’s put aside the “maxi” and “shitcoin” history. Let’s go back to Justin Bons, founder of CyberCapital. He has described Ripple’s leaders’ statements as a scam, claiming that their blockchain is decentralized and uncensorable.\n\nIn a series of 25 tweets published on May 6th, Bons criticized the fundamentals and architecture of the Ripple protocol. He believes that it is highly centralized and does not meet the required decentralization standards for a blockchain.\n\n“Ripple executives falsely claim that XRP is decentralized & permissionless. This thread finally proves that the Foundation has de facto control over the entire network! Contrary to their claim that XRP is more decentralized than BTC & ETH. The smoking gun has been found.”\n\nAccording to Bons, trust in the consensus of XRP is shaken by unique node lists (UNLs) published by centralized parties, including the XRPL Foundation. If a node is not on this list, it cannot participate in the consensus, which contradicts the fundamental principles of a decentralized network. Moreover, users must receive permission from third-party trust chosen by the XRPL Foundation.\n\n2/25) XRPs consensus is based on UNLs (Unique Node Lists)\n\n\n\nLiteral lists of trusted nodes released by centralized parties, including the foundation…\n\n\n\nNodes not on this list are untrusted & do not participate in consensus\n\n\n\nHowever, users can modify the UNL, choosing who to trust — Justin Bons (@Justin_Bons) May 6, 2023\n\nMatt Hamilton defends the decentralization of XRP\n\nAfter Justin Bons’ accusations of the centralization of XRP, Ripple responded. Matt Hamilton, former head of developer relations at Ripple, defended the XRP blockchain by refuting Bons’ allegations.\n\nAccording to this former Ripple director, “each node is responsible for its own UNL and chooses its contents. There is no central authority, and XRPL Foundation’s UNL is the result of an emergent community desire to use a non-Ripple UNL.”\n\nDavid Schwartz, the CTO of Ripple, also did not remain silent in the face of these accusations. He also defended the decentralization of the network. According to him, “The XRPL does this by agreeing to execute or defer transactions in consensus rounds. Transactions deferred are recovered by all nodes, not just validators.”\n\nDespite the arguments put forth, supporters and detractors of XRP continue to fuel the debate on its centralization. The question of governance and the nature of the Ripple blockchain raises important issues. Thus, it is legitimate to wonder if Ripple is really decentralized. This debate had already surfaced last October when “maximalist” Max Keiser expressed doubts about Ripple’s centralization.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm1hcmtldHBsYWNlLm9yZy9zaG93cy9tYWtlLW1lLXNtYXJ0L3N1ZGFuLWNvbmZsaWN0LWVjb25vbWljLXJpcHBsZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "Episode 921: The economic ripples of conflict in Sudan - Marketplace",
        "content": "Make Me Smart May 10, 2023 Transcript\n\nNote: Marketplace podcasts are meant to be heard, with emphasis, tone and audio elements a transcript can’t capture. Transcripts are generated using a combination of automated software and human transcribers, and may contain errors. Please check the corresponding audio before quoting it.\n\nKai Ryssdal\n\nHey everybody, I’m Kai Ryssdal. Welcome back to make me smart, where we make today make sense.\n\nKimberly Adams\n\nAnd I’m Kimberly Adams. This is what do you want to know Wednesday, the day when you get to bring your questions, and we bring the answers as best we can. If you have a question you’d like us to answer you can leave us a voicemail at 508-UB-SMART or email us atmakemesmart@marketplace.org.\n\nKai Ryssdal\n\nAll right, first question. Here we go. Oops, that was me moving the chair. Charlton hit it.\n\nArt\n\nHi, guys. This is Art calling from Chicago. And I wondered if you could take a look at what’s happening in Sudan and make us smart about what a complete breakdown in their governmental system might mean for the rest of the world economically.\n\nKai Ryssdal\n\nIt’s such a good question.\n\nKimberly Adams\n\nIt’s been so interesting. Watching this play out. Tragic yes, of course, because a lot of people lost their lives, and it’s getting pretty bad over there. But we talked so much when the war in Ukraine first started about how differently that was being covered and the attention given to it compared to conflicts elsewhere in the world, and how much that had to do with sort of the geopolitical implications of one country versus another. And so it’s been really interesting, seeing the lack of attention on Sudan, and everything happening there in light of all of that. But some of it does indeed relate to what the ripple effects are. So first of all, what’s going on in Sudan? The current conflict broke out in mid April, mainly in the country’s capital, which is Khartoum, and the fighting is between the Sudanese military and then this powerful sort of paramilitary group outside of the government, known as the RSF. The leaders of both of these groups think they should be running the government and running the country. And the country has been under military rule since 2019, when a coup led by both the military and the RSF deposed the country’s longtime leader, which was Omar Al Bashir. And so there’s been a military person running stuff over there ever since then. Now, ideally, what was supposed to happen after that coup, was that there were going to be democratic elections, and there would be a reestablishment of civilian rule. Never actually happened. And so that conflict is just flaring up because since there was not ever that civilian handover, it’s kind of been infighting between these two factions over which, you know, sort of military entity is going to be in charge. And this conflict has, you know, killed many, many people there, has lots of people stranded, and stuck in extraordinarily dangerous conditions, hospitals are not able to operate properly, and it’s a pretty dire situation. It also has some other economic consequences. So it’s caused a surge in prices for the people who are still there, shortages of basic goods, collapse in the banking system in the capital city, it’s worsening an already serious regional humanitarian crisis as refugees are leaving Sudan for neighboring countries, if not further afield. I mean, people are still having terrible accidents in the Mediterranean Sea trying to get into Europe. And that violence has also interrupted trade in and out of the country. And so in terms of the economic impacts outside of Sudan, it’s a country that’s located on the Red Sea near the Middle East. So if you’re thinking, if you don’t know where it sits in the world, it’s right below, you know, Egypt. So if you think about Africa, you know, when you’re looking at those sort of upper right hand corner, there’s Egypt and then Sudan, right? Okay. So it’s on the Red Sea and that makes it an important player in global trade routes. Because if you think about maybe going to the Suez Canal, you might need to go past Sudan and the Red Sea. And it’s… so it is an important player in global trade routes. Also, if your countries like the United Arab Emirates, which made a deal to build a port in Sudan last year, lots of folks have a bit at stake here. Also Sudan exports important resources like gold, crude oil and, news you can use, 80% of the world’s gum arabic which is used in food additives, paint and makeup. So a lot of experts are worried that the current conflict could go on a long time and cause this violence to spill over into neighboring countries which could create even more regional instability. But, you know, right now, the humanitarian crisis is pretty much top of mind. But that’s where we are.\n\nKai Ryssdal\n\nTotally, totally. That’s a good little summary. That’s a good little summary. It’s a big deal. Yeah, humanitarian, and otherwise,\n\nKimberly Adams\n\nYeah. Okay, moving on to our next question. Andrew from Long Beach sent us this. “We talk about the Secretary of the Treasury and the Federal Reserve Chair all the time, but I never ever hear anything about the Treasurer of the United States. And yet their signature is right there on every bill, the mint prints, what do they do?” This is a Kai question if I’ve ever heard one\n\nKai Ryssdal\n\nIt is. It is right next to Janet or across the bill, across the portrait, if you will, of the person whose portrait of the dead white guy whose portrait it is. Right next to Janet Yellen’s, which is kind of great. So the treasurer runs Fort Knox where we keep obviously the gold, runs the Mint where coinage comes from, the Bureau of Engraving and Printing where the currency comes from. Also, they kind of work as kind of go between the Treasury and the Federal Reserve sort of at the staff level because obviously Janet Yellen and Jay Powell have each other’s phone numbers. And they give advice to the Treasury Secretary on community development things and public engagement as well. The current incumbent in the Treasurer’s office is Marilynn Malerba. She’s the first Native American to hold their positions. She also, not coincidentally, holds the, heads the Treasury’s Office of Tribal and Native Affairs created when she was appointed. So she talks about department wide Tribal Relations there right? Native relations in that ginormous bureaucracy that is the Treasury Department. And as I said a minute ago, treasures act as ambassadors, if you will, to underserved communities, particularly in Malerba’s case with Native American communities. Here’s why you don’t hear about this job too much. It’s not a policy job. It’s not the treasury secretary. It’s not the head of the Fed. It’s not on the National Economic Council, the council of economic advisers. It is more ceremonial than anything else. It’s it’s mostly been subsumed by the Treasury Department. So that’s why you don’t hear about it a lot. But interesting question. Really good question. All right. Next question. Here we go. Matthew, Matthew, Matthew, Matthew. This is good one too actually. He writes to say he’s disappointed that Netflix is nixing its DVD rental service rather and wants to know, and here’s the quote, “What the heck is Netflix going to do with their enormous inventory of discs?” Great question.\n\nKimberly Adams\n\nIt is a good question. It reminds me, I think the last Netflix DVD I got in the mail was for Lost the TV show. At some point. Yeah, way back when? Anyway, so in case you missed it, after years of dwindling subscribers, Netflix is planning to end its DVD by mail service in September. And since Netflix started renting DVDs in 1998, we know that the company has sent out over 5.2 billion discs. Discs, that’s hard word to say. Discs. But to answer the question, Netflix has declined to say how they’re going to get rid of all that inventory. Some film enthusiast are hoping that Netflix is going to sell the used DVDs. If you want a little piece of Netflix nostalgia. Others were speculating unfortunately, that the whole library is just going to end up in a landfill. For a little while it looks like Redbox, which is this DVD rental company that you may see their big boxes in grocery stores where you can rent DVDs from there, that maybe they might save the collection by purchasing the DVD rental part of Netflix’s business. But Netflix has repeatedly declined that offer. I have to wonder if some of this is tied up in whatever licensing agreements they had with the studios in order to rent those things out in the first place. They probably had some restrictions on you know how they could distribute it, you know, because you were only sending them out one at a time. So effectively each one of those disks would represent probably like one license and so, that Netflix would control and so then if you just send them out into the ether, you know just kind of opens the door for pirating and stuff like that. So. Anyway.\n\nKai Ryssdal\n\nGood question. Love that one.\n\nKimberly Adams\n\nAlright, time for our last question of the day. It’s an email from Mike in Buffalo, New York. And here is what it says. “I was recently at the Dollar Tree, purveyor of all things party supplies and balloons, and they no longer had the ‘out of helium’ sign up. So is the great helium shortage over if we can once again fill balloons?”\n\nKai Ryssdal\n\nGood question. Man today’s questions are good. I really liked these questions. So there is a helium shortage. It’s not as bad as it was, but there is still a helium shortage going on. Started about in 19… Sorry, not in 19. Started give or take in 2021 with a bunch of big helium plants around the planet have had outages or failures, failures which then limited availability and productivity. Matt Levin did a great story actually for us about Party City back a number of months ago. Also, I can’t remember if it was Savannah Maher or Marielle, who did a story for us about helium and like lab work and stuff. It was crazy. Crazy that…\n\nKimberly Adams\n\nI think that was Marielle if I’m not mistaken.\n\nKai Ryssdal\n\nYeah, I don’t remember. Anyway. The reason it’s so important is that helium has lots of really, really critical applications. MRI machines, semiconductor manufacturing, spaceships, and also big balloons. And also, when those balloons start to run out of air, in my house anyway, I’m obliged by my children, or I was when they were younger, to inhale the gas and make my voice sound funny. Which always struck a little terror in me because, you know, my voice is what puts food on the table around here and I was loath to mess with it, but still, I’m okay. So anyway, so here’s the deal.\n\nKimberly Adams\n\nGood dad sacrificing for the entretainment of children. Love it.\n\nKai Ryssdal\n\nThat’s, that’s right. We might wind up with the poorhouse kids, but here’s what your dad sounds like on helium. Anyway. Philip Kornbluth, we called him. Ge’s a guy who runs a helium consulting business, his answer and he’s the trained professional, the shortage has gotten better but it is a concern. It could get bad again, at least in the short term. Here are the specifics. Shortage is kind of minimal. We’re down about 10% of global shortage, global supply. So you know, the sing at your dollar tree has gone away. But Exxon, which not only dabbles in fossil fuels as you know, is closing and helium plant for maintenance in July. One plant maybe not such a big deal, except for this plant contributes and supplies 23% of the world’s helium production. I mean, helium is out there, but this plant, you know, gets it and bottles it and sends it out. So helium prices could go up. Phil did say that after that plant reopens and a new Russian helium plant comes on later in the year, although, you know, air quotes around Russian helium plants, because who the hell knows what’s gonna happen over there. And they are heavily sanctioned, right? So, you know, there is a shortage, not as bad as it was. Could go into 2025 Phil said, or it could end sometime next year. Kind of don’t know. Good question, though. Helium\n\nKimberly Adams\n\nI feel like there’s a helium shortage story that we do every couple of years. Because like, every couple of years, there’s like, a shortage and a crisis and medical device, people are worried and the party industry is worried. And, you know, what are we going to do? And then it just kind of goes away. And then a couple years later, there’s another “oh my gosh, helium shortage.” And I was surprised to find out in one of these rounds of it, that helium is a finite resource. And so it’s almost like, you know, the way that oil production, the prices of a barrel… the price of a barrel of oil goes up or down, not because there’s any more or less oil in the world, but because of various components of getting it out of the ground, you know, processing it and getting it to us is where the price fluctuations and the shortage has happened. And similar with helium, because there’s only so much of it in the ground.\n\nKai Ryssdal\n\nAll about supply chain. Always is. Alright. That’s it for us. A neat and tidy you know, 13-ish minutes, whatever. If you’ve got a question about anything else that we haven’t covered today, because we only did four things. Anything you want to know about the economy or business and technology, let us know. 508-UB-SMART. 508-UB-SMART or email us at makemesmart@marketplace.org and we will hook you up\n\nKimberly Adams\n\nMake Me Smart is produced by Courtney Bergsieker. Ellen Rolfes writes our newsletter. Our intern is Antonio Barreras. Today’s program was engineered by Charlton Thorp.\n\nKai Ryssdal\n\nBen Tolliday and Daniel Ramirez composed our theme music. Our senior producer is Marissa Cabrera. Bridget Bodnar is the director of podcasts. Francesca Levy is the executive director of Digital and On-De- wait for it, -mand\n\nKimberly Adams\n\nNicely done."
    }
]