[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vaW50ZXJlc3RpbmdlbmdpbmVlcmluZy5jb20vaW5ub3ZhdGlvbi9zY2llbnRpc3RzLW1hbmFnZS10by1oYXJ2ZXN0LWVuZXJneS1mcm9tLXJpcHBsZXMtaW4tZ3JhcGhlbmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Scientists manage to harvest energy from ripples in graphene - Interesting Engineering",
        "content": "These ripples behave like tiny waves, moving up and down in response to changes in the surrounding temperature.\n\nThibado and his team designed a unique circuit to extract energy from these ripples. The circuit consists of a junction followed by two diodes wired in opposition with a non-linear resistor. A diode is an electronic component that allows current to flow in only one direction.\n\nThe circuit design was chosen to overcome the condition set by the second law of thermodynamics, which says that useful energy can’t be collected when both the circuit and the ripples are in thermal equilibrium, even if we use a diode.\n\nUsing the unique setup with two diodes, the team found that they could slow down the process.\n\nAs the circuit interacts with the particles in Brownian motion, it temporarily breaks equilibrium, allowing current to flow between the diodes and the charging of storage capacitors. This entire process occurs while adhering to thermodynamics’ first and second laws."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYm9sZC5jb20vcmlwcGxlLXJldmVhbHMtOC1jb3VudHJpZXMtYnVpbGRpbmctY2JkY3Mtb24teHJwLWxlZGdlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ripple reveals 8 countries building CBDCs on XRP Ledger - Finbold - Finance in Bold",
        "content": "Contrary to previous reports by CryptoGeek, our understanding, as of now, suggests no such involvement by Ripple in such projects. Ripple is currently only involved in the development of CBDCs in Hong Kong, Bhutan, Palau, Colombia, and Montenegro. We will promptly update if any verified information emerges regarding Ripple’s association with other CBDC initiatives.\n\n\n\nIn May 2023, Ripple (XRP) announced a new venture in the realm of digital finance: the launch of a Central Bank Digital Currency (CBDC) platform.\n\nThis dynamic platform empowers central banks, governments, and financial institutions to take charge of their digital currency issuance, distribution, and management.\n\nUtilizing Ripple’s advanced technology and building upon their earlier Private Ledger project, this platform harnesses the power of the XRP Ledger (XRPL) to pave the way for a new era of customizable and efficient CBDCs.\n\nImpressively, even though the new ledger was launched just three months ago, over 8 countries are already building CBDCs on XRP Ledger, blockchain news aggregator CryptoGeek revealed on August 19.\n\nThese include Russia, the Republic of Palau, Montenegro, Japan, the United Arab Emirates (UAE), Uruguay, New Zealand, and Hong Kong.\n\nCountries building CBDCs on XRPL. Source: CryptoGeek\n\nOver 15% of all countries may use XRPL as CBDC platform\n\nLast month, James Wallis, the Vice President of Central Bank engagements and CBDCs at Ripple, said the blockchain company is in talks with more than 30 countries to adopt its XRPL-powered CBDC platform.\n\nAt the time, Wallis said Ripple publicly announced partnerships with 5 central banks, while 5 were not disclosed to the public yet. In addition, Ripple was in conversations with 20 more countries to offer them its private or public XRP ledger as a base for developing CBDCs.\n\nGiven that there are a total of 195 countries in the world, this suggests that more than 15% of global nations are considering using Ripple’s technology for building CBDCs.\n\nXRP’s role\n\nWhen Ripple announced a private XRP Ledger for CBDCs in 2021, the tech company said the cryptocurrency could “be leveraged as a neutral bridge asset for frictionless value movement between CBDCs and other currencies.”\n\nHowever, although its private ledger is based on XRPL, it “does not require XRP to operate.” In other words, central banks who opt to build CBDCs on Ripple’s platform do not use or interact with the crypto token."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3hycC1wcmljZS1yZWNvdmVycy1hcy1leHBlcnRzLXByZWRpY3Qtc2VjLXdpbGwtZm9jdXMtb24tcHJvZ3JhbW1hdGljLXNhbGVzLWluLWFwcGVhbC1hZ2FpbnN0LXJpcHBsZS1ydWxpbmctMjAyMzA4MjEwNjE50gGqAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3hycC1wcmljZS1yZWNvdmVycy1hcy1leHBlcnRzLXByZWRpY3Qtc2VjLXdpbGwtZm9jdXMtb24tcHJvZ3JhbW1hdGljLXNhbGVzLWluLWFwcGVhbC1hZ2FpbnN0LXJpcHBsZS1ydWxpbmctMjAyMzA4MjEwNjE5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "XRP price rally to $0.60 fueled with recovery following developments in SEC vs Ripple lawsuit - FXStreet",
        "content": "XRP price recovered over the weekend with no new filings from the regulator or Ripple in the SEC vs Ripple lawsuit.\n\nSEC addressed XRP as a “digital asset security” in its first lawsuit but is now taking a different approach.\n\nThe financial regulator argues digital assets have no inherent value and are nothing but computer code.\n\nThe ongoing SEC vs Ripple saga had no new updates over the weekend, and the XRP community of holders watched and waited as experts analyzed where the financial regulator is headed next. The Securities & Exchange Commission (SEC) said in its recent motion for interlocutory appeal that digital assets do not have an inherent value and are nothing more than computer code.\n\nThe statement made by the financial regulator is in stark contrast to the beginning of the lawsuit where the SEC referred to XRP as a “digital asset security.”\n\nThe shift in the SEC’s stance has fueled hope, of Judge Torres’ ruling on XRP being a “non-security” remaining intact. The regulator appears focused on the programmatic sales of the altcoin by payment giant Ripple.\n\nAlso read: SEC vs Ripple, the legal battle intensifies as XRP holders expect new changes from SEC appeal\n\nSEC appeal likely focused on programmatic sales of XRP, not its security status\n\nExperts in the crypto and XRP community utilized the weekend to analyze the news of SEC’s motion for interlocutory appeal being accepted by the court. As both parties prepare to file new motions and responses by the scheduled deadlines, experts note the shift in the regulator’s stance.\n\nThe SEC had initially maintained that XRP, the native token of XRPLedger, is a “digital asset security,” in its lawsuit against Ripple. The regulator states that digital assets have no inherent value and are nothing more than computer code in its latest filing.\n\nIn its filing, the SEC reveals that the regulator did not argue that the asset underlying the investment contract was necessarily a security and it does not seek an appellate review of any holding relevant to the same in its case against Ripple.\n\nSEC motion for filing of interlocutory appeal\n\nThe interpretation of the SEC’s stance by Fox Business reporter Eleanor Terrett and pro-XRP attorney John Deaton ushers relief in the community of XRP holders.\n\nWith no new filings from the SEC or Ripple over the weekend, XRP price recovered from its decline and climbed past resistance at $0.55. At the time of writing, the altcoin is trading at $0.5291 on Binance. XRP price has rallied 25% from last week’s low of $0.4228 (Aug 17) to by early Monday."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1yaXBwbGVzLWZvcmVjYXN0LWJyaWdodGVucy1hcy1zZWMtYmFja3Mtb2ZmLXNlY3VyaXR5LWRlc2lnbmF0aW9uLTEzNjkzNDfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "XRP News: Ripple's Forecast Brightens as SEC Backs Off Security Designation - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lmpkc3VwcmEuY29tL2xlZ2FsbmV3cy9jb3JydXB0aW9uLWNyaW1lLWFuZC1jb21wbGlhbmNlLW1hdHQtODA2NDgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Corruption, Crime, and Compliance: Matt Stankiewicz on The Ripple Decision and Indictment Against Celsius ... - JD Supra",
        "content": "Matt Stankiewicz is a Managing Counsel at The Volkov Law Group. His expertise includes financial regulation and compliance, with a focus on See more +\n\nAccording to critics, there are a lot of gray areas surrounding compliance and the SEC’s position on cryptocurrency regulations. Such uncertainty poses challenges for legitimate crypto projects and creates room for fraudulent activities to thrive. Such is the case for Ripple and Celsius, two recent controversies making waves in the crypto world.\n\nAccording to critics, there are a lot of gray areas surrounding compliance and the SEC’s position on cryptocurrency regulations. Such uncertainty poses challenges for legitimate crypto projects and creates room for fraudulent activities to thrive. Such is the case for Ripple and Celsius, two recent controversies making waves in the crypto world.\n\nMatt Stankiewicz is a Managing Counsel at The Volkov Law Group. His expertise includes financial regulation and compliance, with a focus on securities, anti-money laundering (AML), and cryptocurrency regulation. Given his professional background and interest in crypto regulations, he is a frequent speaker on legal matters concerning cryptocurrency exchanges and the SEC.\n\nYou’ll hear Michael and Matt discuss:\n\n* The SEC faces criticism for its unclear stance on cryptocurrency regulations. Such uncertainty poses challenges for legitimate crypto projects and creates room for fraudulent activities to thrive.\n\n* The Ripple case offers a complex view into how cryptocurrencies are perceived legally. While some sales of XRP tokens were considered securities, others weren’t, a distinction that has sent ripples through the crypto world. The case’s broader implications, especially with the SEC’s decision being appealed, hold immense importance for other companies in similar situations.\n\n* Bad actors can exploit innovative technologies and make things worse for everyone else. With the CEO and CRO of Celsius charged with fraud and numerous questionable practices coming to light, the importance of stringent regulations and monitoring becomes abundantly clear.\n\n* Strong compliance programs serve as bulwarks against fraudsters and those under sanctions, ultimately safeguarding both the platform and its users. However, regulating an asset as novel and dynamic as cryptocurrency is no easy feat. Critics claim the SEC’s approach leans more toward enforcement than establishing clear rules.\n\n* Matt underscores the importance of erecting a sturdy compliance structure within the cryptocurrency industry. He emphasizes that such programs are not just regulatory measures but critical tools to ward off fraudsters and maintain the industry’s reputation.\n\nKEY QUOTES\n\n“[Crypto] is a brand new asset. It’s virtually impossible to pigeonhole it to any other kind of real-world asset right now.” – Matt Stankiewicz\n\n“Don’t cripple the good projects because there’s some bad people out there.” – Matt Stankiewicz\n\n“The SEC just says, well, ‘You should know. You’ve got to figure it out; we’re not your attorneys.’ Which is fair in some regard, right? But that said, it’s not helpful. The SEC needs to provide some kind of guidance here.” – Matt Stankiewicz See less -"
    }
]