[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTE5L3NlYy1hc2tzLWp1ZGdlLXRvLWRpc21pc3MtY2hhcmdlcy1hZ2FpbnN0LXJpcHBsZS1leGVjdXRpdmVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "SEC Asks Judge to Dismiss Charges Against Ripple Co-Founder, CEO - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTE5L3NlYy1hc2tzLWp1ZGdlLXRvLWRpc21pc3MtY2hhcmdlcy1hZ2FpbnN0LXJpcHBsZS1leGVjdXRpdmVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "SEC Asks Judge to Dismiss Charges Against Ripple Co-Founder, CEO - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8xOS9zZWMtZHJvcHMtY2hhcmdlcy1hZ2FpbnN0LXJpcHBsZS1jZW8tZ2FybGluZ2hvdXNlLWNoYWlybWFuLWxhcnNlbi_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMTAvMTkvc2VjLWRyb3BzLWNoYXJnZXMtYWdhaW5zdC1yaXBwbGUtY2VvLWdhcmxpbmdob3VzZS1jaGFpcm1hbi1sYXJzZW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "SEC Drops Charges Against Ripple CEO Garlinghouse, Chairman Larsen - CoinDesk",
        "content": "The U.S. Securities and Exchange Commission (SEC) will no longer pursue claims that Ripple's CEO Brad Garlinghouse or Executive Chairman Chris Larsen aided and abetted the company in violating federal securities laws in its XRP transactions, canceling a trial scheduled for next year and giving the crypto company another victory in the agency's long-running suit against it while moving the regulator closer to appealing a federal judge's ruling in the case."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTAvMTkvc2VjLWRyb3BzLWNoYXJnZXMtcmlwcGxlLXhycC1nYXJsaW5naG91c2UtbGFyc2VuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "SEC drops charges against Ripple executives Brad Garlinghouse and Chris Larsen in ongoing XRP litigation - Fortune",
        "content": "The Securities and Exchange Commission is no longer pursuing civil charges against Ripple executives Christian Larsen and Brad Garlinghouse, according to a court filing in the Southern District of New York on Thursday.\n\nThe decision is the latest chapter in the prolonged legal battle between the SEC and Ripple, a major crypto firm, over the issuance of its cryptocurrency XRP. The SEC has faced recent defeats in the case, including an unexpected ruling by Judge Analisa Torres in July that found that Ripple’s sale of XRP on exchanges did not constitute an unregistered security, with the SEC’s latest retreat signaling the saga is nearing its end.\n\nSince its founding in 2012, Ripple has been one of the most prominent crypto firms, with its XRP token long occupying one of the top positions in the list of cryptocurrencies by market cap. Ripple’s decision to issue XRP to both institutional and retail investors ran afoul with regulators, however, with the SEC charging the company and its two executives in 2020 with offering unregistered securities.\n\nThe case became a proxy battle between the SEC and the crypto industry. When Gary Gensler took over the SEC in early 2021, he argued that the vast majority of cryptocurrencies represented unregistered securities. Many in the industry hoped that a victory in the Ripple case would undermine the SEC’s position.\n\nDespite the level of scrutiny, Torres’s July decision came as a surprise to onlookers. She found that institutional sales of XRP by Ripple to buyers such as hedge funds did constitute unregistered securities. Programmatic sales, where XRP was offered on the open market, like exchanges, did not. She also rejected the SEC’s motion for a summary judgment on whether Garlinghouse and Larsen had aided and abetted the sale of XRP, pushing the issue to a later jury trial.\n\nEven though the SEC won in part, the broader ruling signaled that the sales of cryptocurrencies on exchanges would not necessarily constitute a security, thus hurting the SEC’s other litigation against companies like Coinbase and Binance. The SEC tried to bid for a quick appeal, which would allow it to challenge the decision even while the unsettled issues went to trial, but Torres rejected the request in early October.\n\nWith Thursday’s filing, the SEC and Ripple agreed to drop the charges against Garlinghouse and Larsen, thus removing the need for a jury trial. According to the document submitted by SEC attorney Jorge Tenreiro, the two sides will meet to decide on the penalties against Ripple for its sale of XRP to institutional investors. Once remedies have been determined, either side can appeal the broader decision.\n\n“We always believed that the case was meritless, and that the SEC compounded its error by personally targeting Brad, who did absolutely nothing wrong,” said Matt Solomon, the lawyer for Garlinghouse, in a statement shared with Fortune. “Faced with the prospect of having to prove its remaining claim against Brad in court, the agency was right to abandon it.”\n\nMartin Flumenbaum, a lawyer for Larsen, said that the SEC’s decision demonstrates that the “claim against the individual defendants should never have been brought in the first place.”\n\nA spokesperson for the SEC declined to comment."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiuwFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTAxOTE2NTg3Ni9lbi9Jbi1MYW5kbWFyay1TRUMtU3VycmVuZGVyLVJpcHBsZS1DRU8tQnJhZC1HYXJsaW5naG91c2UtYW5kLUV4ZWN1dGl2ZS1DaGFpcm1hbi1DaHJpcy1MYXJzZW4tQXJlLUNsZWFyZWQtT2YtQWxsLUJhc2VsZXNzLUFsbGVnYXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 19 Oct 2023 07:00:00 GMT",
        "title": "In Landmark SEC Surrender, Ripple CEO Brad Garlinghouse and Executive Chairman Chris Larsen Are Cleared Of All ... - Business Wire",
        "content": "SAN FRANCISCO--(BUSINESS WIRE)--Ripple, the leader in enterprise blockchain and crypto solutions, announced today that CEO Brad Garlinghouse and Executive Chairman Chris Larsen were cleared of all claims brought against them by the U.S. Securities and Exchange Commission (SEC). The SEC voted to dismiss charges with prejudice - a stunning capitulation by the government.\n\nThis victory is the third consecutive triumph for Garlinghouse, Larsen, and Ripple, coming on the heels of the July 2023 ruling that declared \"XRP is not, in and of itself a security\" and a subsequent October decision to deny the SEC's request for an interlocutory appeal.\n\n\"For nearly three years, Chris and I have been the subject of baseless allegations from a rogue regulator with a political agenda,\" said Ripple CEO Brad Garlinghouse. \"Instead of looking for the criminals stealing customer funds on offshore exchanges that were courting political favor, the SEC went after the good guys - along with our entire company of innovators and entrepreneurs - who are building a regulated business based in the U.S. We look forward to the day this chapter is closed once and for all, now that the SEC has dropped the curtain on their absurd theatrics against Chris and me.\"\n\nOn December 22, 2020, days before Christmas and as the then SEC leadership was walking out the revolving door to take lucrative jobs in the private sector, the SEC filed a civil action against Ripple and two of its executives, alleging that beginning in 2013, distributions of the digital asset XRP should have been registered as a security. There were no allegations of fraud or any misrepresentations. In July 2023, the Court delivered a victory to Ripple, ruling that XRP is not a security. The SEC then tried to appeal the Court’s ruling and that effort failed. And today, in a capitulation, the SEC dismissed with prejudice the claims against Ripple’s CEO and Chairman that were scheduled for trial next year. This resolves all charges against these executives.\n\n\"Today, we are legally vindicated and personally redeemed in our battle against a troubling attempt to abuse the rules in order to advance a political agenda to suffocate crypto in America. It is a travesty that we were forced to defend ourselves from an ill-advised attack that was flawed from the day it was filed,\" said Executive Chairman Chris Larsen. \"While justice ultimately prevailed, the government’s actions that led to this point raise questions about the origin, and motivation of this lawsuit. It is an abuse by the administrative state that politically connected special interests, with clear and proven conflicts of interest, were able to drag our names through the mud in an attempt to ruin us personally and destroy a company so many have worked so hard, for so long to build.”\n\nDue to the regulatory uncertainty and chaos created by the SEC's misguided quest for power, crypto innovation is being driven offshore. Today, nearly 90% of Ripple's business is outside the U.S. and hiring remains focused in major international markets. In Q3 2023, nearly 90% of Ripple hires were not in America - and open roles reflect the same damage to the crypto ecosystem.\n\nDespite the headwinds, Ripple's pursuit of sound crypto regulation in the U.S. is far from concluded. Globally, Ripple continues to pursue active dialogue with policymakers and regulators to drive responsible innovation within the digital assets industry.\n\nAbout Ripple\n\nRipple is the leader in enterprise blockchain and crypto solutions, transforming how the world moves, manages and tokenizes value. Ripple’s business solutions are faster, more transparent, and more cost effective - solving inefficiencies that have long defined the status quo. And together with partners and the larger developer community, we identify use cases where crypto technology will inspire new business models and create opportunity for more people. With every solution, we’re realizing a more sustainable global economy and planet - increasing access to inclusive and scalable financial systems while leveraging carbon neutral blockchain technology and a green digital asset, XRP. This is how we deliver on our mission to build crypto solutions for a world without economic borders."
    }
]