[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJvcmRlcm1haWwuY29tLmF1L3N0b3J5LzgwNjAyMjMvbGl2ZXMtc2hhdHRlcmVkLXdpdGgtYS1zZW5zZWxlc3MtYWN0LW9uZS1wdW5jaC12aWN0aW1zLXBvd2VyZnVsLWFkZHJlc3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Jan 2023 08:00:00 GMT",
        "title": "Luke Merriman's courageous victim impact statement reveals the ripple effect of \"coward act\" - The Border Mail",
        "content": "\"Brendan, I will never know why you did what you did. But there's one thing I do know. My life will never be the same,\" he told Fitzpatrick. \"I don't feel like me anymore. I have trouble getting out of bed in the morning. I've lost confidence in myself and my abilities ... and the sound of my son's voice saying 'I wish this didn't happen to you Daddy' will forever haunt me.\""
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3MvbW9uaWNhLWxvbmctbmFtZWQtbmV3LXByZXNpZGVudC1vZi1yaXBwbGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Jan 2023 08:00:00 GMT",
        "title": "Monica Long Named New President of Ripple - Blockchain.News",
        "content": "After serving as general manager for the company, Monica Long has been promoted to the position of president at Ripple. Long began her career with the company in 2013 as the director of communications. In 2018, she was promoted to the position of general manager of RippleNet, the company's financial network, in addition to her previous role as general manager of RippleX, the blockchain development arm of the business.\n\nUp until this point, the role of president of Ripple has been somewhat of a mystery, with the title having been assigned to both of the company's co-founders, Brad Garlinghouse and Chris Larsen, at different points in time.\n\n\"The role entails maintaining a high level of scalability. We've been through many [crypto] winters, and despite this one, we just had a record-breaking year in terms of both our company and our consumer growth.\n\nShe went on to say that despite this atmosphere, \"We are continuing to increase our workforce.\"\n\nWhen there were just ten people working for the firm, Long joined Ripple. She was the driving force behind the creation of the On-Demand Liquidity solution for the firm, which was released in 2018 and is referred to be \"Ripple's flagship product.\" In the last year, Ripple has launched an additional service that is called LiquidityHub, and according to Long, the business will continue to build on this service. In the previous year, almost sixty percent of RippleNet's payment volume was routed via ODL.\n\nRegarding the RippleX side of things, Long said that an automated market maker specification will be put up for a vote by the validators this year.\n\nDue to the current legal dispute between Ripple and the United States Securities and Exchange Commission, Ripple is often mentioned in the media. Ripple and its co-founders, Garlinghouse and Larsen, have been charged by the Securities and Exchange Commission (SEC) of conducting an unregistered securities offering to the tune of $1.38 billion and selling XRP (XRP) to retail investors in the capacity of an unregistered security.\n\nOn January 18, Garlinghouse said to CNBC that the corporation anticipates receiving a ruling about the issue this year.\n\nImage source: Shutterstock\n\n. . .\n\nTags"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdS50b2RheS9yaXBwbGUtY3RvLWhpbnRzLWF0LXNhdG9zaGktbmFrYW1vdG9zLWlkZW50aXR5LWFuZC1yZWFzb24tZm9yLWVub3Jtb3VzLXdlYWx0aC11bnRvdWNoZWTSAWtodHRwczovL3UudG9kYXkvcmlwcGxlLWN0by1oaW50cy1hdC1zYXRvc2hpLW5ha2Ftb3Rvcy1pZGVudGl0eS1hbmQtcmVhc29uLWZvci1lbm9ybW91cy13ZWFsdGgtdW50b3VjaGVkP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Jan 2023 08:00:00 GMT",
        "title": "Ripple CTO Hints at Satoshi Nakamoto's Identity and Reason for Enormous Wealth Untouched - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nRipple CTO David Schwartz is still of the opinion that Satoshi Nakamoto, the pseudonymous creator of Bitcoin, is more of a collective than an individual.\n\nAdvertisement\n\nThe discussions started when crypto enthusiast Mr. Huber, with the Twitter handle @Leerzeit, tweeted that one thing he would never understand was the 100% certainty that Satoshi Nakamoto was gone. He added that if it was a group, the probability was even higher.\n\nSchwartz chipped in: \"A group of people just decided to forget about a claim worth tens of billions of dollars?\"\n\nIt is believed that Nakamoto holds at least 1 million Bitcoins based on the crypto wallets used by the Bitcoin creator. Thus, it is reasonable to conclude that Nakamoto owns about $23 billion in Bitcoin at the current market price.\n\nSince it was first created, presumably by Nakamoto, not a single Bitcoin has ever been taken out of any of its wallets, except for the initial 10 BTC transferred to Hal Finney in 2009.\n\nThe question of \"Who is Satoshi Nakamoto, and why hasn't he, she, or they stepped forward to claim this fortune?\" arises with the immense wealth.\n\nRipple CTO hints reason for untouched wealth\n\nIn the Twitter discussions, Neil Hartner, senior staff software engineer at Ripple, gave a possible reason for the untouched wealth: \"Maybe they lost the keys and decided to let the mystique live on rather than admit even the smartest people can lose seed phrases.\"\n\nRipple CTO David Schwartz replied, \"That makes sense.\" He continued, \"It could also have been a group of people, and some of them have died, leaving the remainder unable to access the keys.\"\n\nCryptoLaw founder John Deaton responded to Schwartz's comment: \"I believe CSW (Craig \"Satoshi\" Wright) was involved at the beginning. He knew no one else would trademark Whitepaper. Hal is dead. Kleiman is dead.\"\n\nHe then added, \"Someone died, and the private key died with them?\"\n\nOn Jan. 12, 2009, Satoshi Nakamoto sent Hal Finney, a renowned cryptographer and computer scientist, 10 BTC.\n\nThe renowned cryptographer was the first individual to download and install the Bitcoin software and also to put a price on the cryptocurrency.\n\nFinney was rumored to be the creator of Bitcoin, but reports say he consistently denied this. Finney sadly passed away in August 2014."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vcmlwcGxlLXBhcnRuZXItam9pbnMtZm9yY2VzLXdpdGgtdmlzYS10by1jb25xdWVyLWJpbGxpb24tbWFya2V0cy1vZi10aGFpbGFuZC1hbmQtYXVzdHJhbGlhLXJlcG9ydC_SAYoBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3JpcHBsZS1wYXJ0bmVyLWpvaW5zLWZvcmNlcy13aXRoLXZpc2EtdG8tY29ucXVlci1iaWxsaW9uLW1hcmtldHMtb2YtdGhhaWxhbmQtYW5kLWF1c3RyYWxpYS1yZXBvcnQvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Jan 2023 08:00:00 GMT",
        "title": "Ripple partner joins forces with Visa to conquer billion-$-markets of Thailand and Australia – Report - Crypto News Flash",
        "content": "Ripple’s partner DeeMoney joins forces with Visa for global payments in Thailand.\n\nNovatti-owned International Bank of Australia (IBOA) gets approval to launch payment solution in Australia.\n\nRecent reports show that Ripple partner DeeMoney has entered a partnership with Visa. The FinTech giant out of Thailand and a 3-year-old partner with Ripple, has partnered with Visa to fully integrate Visa Direct into its global payment platform.\n\nPer this partnership, users will be able to carry out lighting speed cross-border payments globally. Visa as a global payment solution is present in over 170 countries and enables over 160 currencies. This becomes readily available to DeeMoney users in Thailand and will only need the Visa details of the recipient to send money.\n\n\n\n\n\n\n\n\n\nThe time-saving attribute of this partnership makes it very appealing. Visa claims that 30 minutes is more than enough for recipients to receive funds after the transaction. Unlike the days involved with traditional cross-border payment solutions.\n\nThe chief executive officer of DeeMoney, Aswin Phlaphongphanich, explains the value that Visa offers. He mentioned that Visa’s speed and security make it ideal for real-time payments.\n\nThis partnership allows our customers to send funds directly to their friends’ or family’s debit card accounts in real-time to more than 170 countries in over 160 transaction currencies. It also enables real-time payments 24/7, including weekends and holidays, which are not feasible with traditional bank\n\nDeeMoney’s partnership with Visa rides on the back of its earlier partnership with Ripple. The partnership was intended to provide instant settlement for their customers on affordable cross-border payments in Thailand.\n\nInternational Bank of Australia get RADI License\n\nNovatti’s dedicated banking arm, IBOA, can now fully operate in Australia. The Australian Prudential Regulation Authority (APRA) has granted the International Bank of Australia (IBOA), a Restricted Authorized Deposit-taking Institution (RADI) license until Nov. 2nd, 2024.\n\nThis license allows IBOA to offer banking services to the Australian population. It also gives Novatti access to spread its payment solution for cross-border payments in and out of Australia.\n\n#Ripple partner Novatti (ODL) has built a bank, International Bank of Australia and obstained as Restricted Banking License. “The bank will be able to leverage Novatti’s existing payments ecosystem and global operating base…\"https://t.co/ufjV09tk1G — WrathofKahneman (@WKahneman) January 24, 2023\n\nPeter Cook, the current managing Director of Novatti in a statement said,\n\nBeing granted a restricted banking license is a very significant milestone in the delivery of Novatti’s long term strategy, and is the culmination of several years of investment and development.\n\nAs seen in recent tweets from Australians living outside Australia, this licensing approval brings excitement as it eases their cross-border transactions.\n\n\n\n\n\n\n\n\n\nIn another statement, the acting CEO of IBOA, Guy Carvalho, highlighted that one of IBOA’s major focuses. Citing fintech partnerships as the topmost priority.\n\nThe newly licensed bank is well aware that traditional banks have not been able to match the disruptive tempo of fintech solutions. This is especially true for banks with alternative solutions for local and international payments. Hence, its pre-planned partnership with Novatti to leverage technology to stay ahead."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL215cmVwdWJsaWNhLm5hZ2FyaWtuZXR3b3JrLmNvbS9uZXdzL3JhYmktbGFtaWNoaGFuZS1zLW1ldGVvcmljLXJpc2UtYW5kLWZhbGwtbGlrZWx5LXRvLWhhdmUtcmlwcGxlLWVmZmVjdHMtaW4tY291bnRyeS1zLW5hdGlvbmFsLXBvbGl0aWNzL9IBkAFodHRwOi8vbXlyZXB1YmxpY2EubmFnYXJpa25ldHdvcmsuY29tL2FtcC9yYWJpLWxhbWljaGhhbmUtcy1tZXRlb3JpYy1yaXNlLWFuZC1mYWxsLWxpa2VseS10by1oYXZlLXJpcHBsZS1lZmZlY3RzLWluLWNvdW50cnktcy1uYXRpb25hbC1wb2xpdGljcy8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Jan 2023 08:00:00 GMT",
        "title": "Rabi Lamichhane’s meteoric rise and fall likely to have ripple effects in country’s national politics - Myrepublica",
        "content": "KATHMANDU, Jan 28: The meteoric rise and fall of Rastriya Swatantra Party (RSP) President Rabi Lamichhane is likely to have ripple effects in the course of the country's national politics.\n\nWithin seven months after its formation, the RSP led by Lamichhane rose to become the fourth largest political party in the federal parliament. The party got four ministerial portfolios including Deputy Prime Minister and Home Minister in the Pushpa Kamal Dahal-led cabinet.\n\nBut with the resignation of Lamichhane from the post of deputy prime minister and home minister hours after the Supreme Court dismissed his post of Member of Parliament (MP), the national politics is likely to take a new course, according to insiders within the ruling parties.\n\nThe apex court’s ruling has made CPN (Maoist Center) Chairman and Prime Minister Pushpa Kamal Dahal more powerful while Nepali Congress (NC)—the largest party in parliament— is likely to be a beneficiary of the new political dispensation.\n\nRSP, which has secured 20 members in the House of Representatives (HoR), is one of the main coalition partners in the Dahal-led cabinet. Although RSP will still remain in the government, the party is less likely to get the portfolio of deputy prime minister and home minister in the absence of Lamichhane, who had earned huge popularity as a media person and earned a stature a home minister deserves.\n\nThe denial on the part of Prime Minister Dahal to give RSP the home ministry can create rift among the coalition partners. Whether Prime Minister Dahal wants to retain the current alliance or wants to forge the alliance with NC, CPN (Unified Socialist) and other parties is something that needs to be seen in due course of time.\n\nSources, however, said Prime Minister Dahal has shared within the party that the current coalition with the UML is not ‘comfortable’ to him. While he has not been able to work independently due to K P Oli’s strong influence within the government, Prime Minister Dahal has Rastriya Prajatantra Party and RSP as strange bedfellows in the cabinet.\n\nWhile RPP is deemed as a political force that is against the political changes brought about by the people’s movement in 2006, RSP is often seen as an ‘anti-federalist’ force. Dahal, who claims to be the champion of political change and a true federalist force, has found them as forces that have an agenda hostile to his own party.\n\nPrime Minister Dahal has begun to increasingly see his alliance with the NC and the Unified Socialist with whom he had forged electoral alliance ‘natural one’ in terms of the agenda. It may not be just a coincidence that the Maoist Center on Friday decided to forge ‘national consensus’ to elect a new president.\n\nThe decision taken by the Maoist Center is contrary to the agreement reached earlier with the UML. The Maoist Center had reportedly agreed to help elect UML candidate as new president.\n\nUML Chairman K P Oli has already announced to field its candidate for the presidential election. In case the Maoist Center fails to honor their informal agreement, a section of leaders within the ruling parties see the possibility of breaking down the current alliance between the UML and the Maoist Center after the presidential election. Even if the UML decides to withdraw its support to the government, Dahal will still remain in power as NC and other parties have also voted in favor of his government.\n\nBut this opens up a possibility to form a new alliance comprising the NC, CPN (Unified Socialist) and a few other fringe parties. NC leaders told Republica that NC President Sher Bahadur Deuba has conveyed a message to Prime Minister Dahal that NC is even ready to support Dahal as the prime minister for the whole five years if the NC is given the presidency.\n\n“There is a strong possibility that the country’s politics could now move to that direction,” a senior NC leader told Republica, asking not to be named.\n\nDahal and Oli had earlier reached an understanding to share the post of prime minister for two and half years each. Dahal may choose to accept the NC’s offer if he gets full assurance that he will be allowed to remain as the prime minister for the full term of the parliament. In that case, NC will get the president and chief ministers and ministers in provinces and ministers in the federal government will see some changes in due course of time."
    }
]