[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vdmVnY29ub21pc3QuY29tL3Byb2R1Y3RzLWxhdW5jaGVzL3JpcHBsZS1mb29kcy11bnN3ZWV0ZW5lZC1yaXBwbGUta2lkcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Ripple Foods Launches Unsweetened Version of 'Ripple Kids' in Response to Demand - vegconomist - the vegan business magazine",
        "content": "The new unsweetened version of Ripple Kids Original Milk contains 8 grams of plant-based protein, 50 mg of DHA-Omega-3 and choline, and no added sugar. It was developed in response to consumer demand for an unsweetened version of Ripple Kids, one of the company’s most requested products by parents.\n\nRipple produces a range of nutritious milks, protein shakes, coffee creamer, and frozen desserts using protein-rich yellow peas. The company raised $60 million in a Series E funding round, in 2021, surpassing its original capital goals and reporting a +20% growth rate compared to the overall alt milk industry’s +6% growth. Last year Ripple introduced Oatmilk + Protein, which combines the taste of oat milk with the protein benefits of yellow peas. Explosive growth\n\nSince its launch in 2021, Ripple Kids Original Milk has experienced explosive growth and has been one of the fastest-growing products across all retail channels in the chilled plant-based milk category over the past year, according to the brand.\n\nOther launches in plant-based milks for children include Kiki Milk by Plantbaby and Kiddiwinks, both on the North American market, and of course the publicly traded Else Nutrition which offers several infant nutrition products.\n\n“The feedback we have received from parents about Ripple Kids has been overwhelmingly positive. Parents are looking for an alternative to dairy that offers children great taste and optimal nutrition,” said Laura Flanagan, CEO of Ripple Foods. “Parents also expressed a desire for an alternative with no added sugar, so we felt it was important to bring this to market and give consumers the choices they are looking for.”\n\n\n\nMore information at https://www.ripplefoods.com/kids/\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmZhcm1wcm9ncmVzcy5jb20vY29tbWVudGFyeS90aGUtcmlwcGxlLWVmZmVjdC1vZi1sb3Nz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "The ripple effect of loss - Farm Progress",
        "content": "I don’t do visitations or funerals well. I often stand staring in the distance, wringing my hands and fighting the emotions. I’ve missed many because I couldn’t muster up the courage to pay my respects, but not this time.\n\nPerhaps you’re like me. I feel loss so profoundly. This time it was more than that. I looked down the receiving line and saw the young man whose kids won’t have a grandpa at the softball game or dance recital — and I lost it.\n\nThose emotions come from a place of understanding what lies ahead. I’ve stared into that same young face whose mother never saw him walk down the aisle at his wedding and whose father never saw his kid’s first junior high basketball game.\n\nThe death of my parents left a ripple effect that I’m not sure truly ever stops.\n\nWith every milestone my younger brother or his kids make, I’m reminded just how much my parents would love every moment. How proud they would be of all that they have become. Honestly, just proud of them — period. It hurts.\n\nBut I believe the ripple is not all sadness.\n\nI see the wisdom and knowledge my folks instilled in him. Their legacy of keeping family strong and together. And their faith that resounds through the generations. And in there, I find peace.\n\nSo, while I may not be able to look at the photographs, still fiddle with my hands, and blink obsessively to stop the tears, this time I stand in a line to pay my respects for a man who only knew me as “little Mindy Spoonster” as a child and whose hugs were so tight, full of love and acceptance.\n\nThe adult me he never forgot, sharing how proud he was of what I’d accomplished, telling me how much my folks would be proud and, of course, still hugging with his heart. And it wasn’t just me.\n\nNick Allen was a man whose ripple will continue to reach likely across the ocean, definitely through the ages.\n\nAs for the young man at the end of the receiving line, my heart aches for his loss. Like my brother and so many others who’ve lost parents at such a young age, I feel for his “if only” moments. But I know him and his upbringing. That desire for family and faith will lead him to find peace.\n\nSmall towns and rural communities are full of some of the best humans on the planet. May we all get to know them, share their space, encourage their legacy and expand their ripple effect."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8yNy94cnAtcnVsaW5nLWluLXNlY3MtcmlwcGxlLWxhd3N1aXQtbWVhbnMtY29uZ3Jlc3Npb25hbC1sZWdpc2xhdGlvbi1pcy10aGUtb25seS1zb2x1dGlvbi1zYXlzLXR3by11cy1sYXdtYWtlcnMv0gGSAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzI3L3hycC1ydWxpbmctaW4tc2Vjcy1yaXBwbGUtbGF3c3VpdC1tZWFucy1jb25ncmVzc2lvbmFsLWxlZ2lzbGF0aW9uLWlzLXRoZS1vbmx5LXNvbHV0aW9uLXNheXMtdHdvLXVzLWxhd21ha2Vycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "XRP Ruling in SEC’s Ripple Lawsuit Means Congressional Legislation Is the Only Solution, Says Two US Lawmakers - The Daily Hodl",
        "content": "The recent ruling in the U.S. Securities and Exchange Commission’s (SEC) lawsuit against Ripple indicates Congressional legislation is necessary for the crypto space, according to two American lawmakers.\n\nIn a new op-ed in The Hill, US Representatives Dusty Johnson (R-S.D.) and French Hill (R-Ark.) say Judge Analisa Torres’ decision about XRP “exposes the inadequacies in the current regulatory framework.”\n\nTorres ruled that Ripple’s automated, open-market sales of XRP, referred to as programmatic sales, did not constitute security offerings, contrary to what the SEC alleged. Although, she favored the SEC’s claim that Ripple’s sale of XRP directly to institutional buyers constituted a securities offering.\n\nIn their op-ed, Johnson and Hill criticized SEC Chair Gary Gensler’s previous assertions that every token besides Bitcoin (BTC) is a security.\n\n“[Judge Torres’] holdings directly counter Mr. Gensler’s position that ‘most’ digital assets are inherently securities and lend credence to a growing bipartisan view that the Howey test for determining securities is unclear.\n\nIf other courts adopt Judge Torres’ reasoning and conclude that certain digital assets are not securities and their sale or ‘airdrop’ are not securities offerings, the digital asset market will continue operating outside the SEC’s regulatory framework and leave consumers without the protections they deserve.\n\nWhile the court’s ruling certainly damages Mr. Gensler’s approach, it is by no means a slam dunk. For many, the ruling has elicited even more confusion. Legislation from Congress is the only solution.”\n\nThe Republican lawmakers point to their recent introduction of the Financial Innovation and Technology for the 21st Century Act as an effort to remedy the space’s current legislative blind spots.\n\nHouse Committee on Agriculture Chair Glenn Thompson (R-PA), who introduced the legislation along with Hill and Johnson, says the bill seeks to provide the crypto markets with a “much-needed regulatory framework” that can protect investors and bolster America’s position in the nascent industry.\n\nDemocratic representatives, however, say that the proposed law is taking resources away from issues that should be prioritized by the House Agriculture Committee, arguing the legislation represents “a handout to crypto exchanges, Wall Street, and Silicon Valley venture capitalists at the expense of American consumers and retail investors.”\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMi0QFodHRwczovL3d3dy53dGhyLmNvbS9hcnRpY2xlL25ld3MvbG9jYWwvYWZ0ZXItbW9udGgtb2YtZWFybHktY2xvc2luZ3MtYXQtbGVhc3Qtb25lLWJyb2FkLXJpcHBsZS1idXNpbmVzcy13aWxsLWhhdmUtbG9uZ2VyLWhvdXJzLXRoaXMtd2Vla2VuZC12aWxsYWdlLWdvb2RmZWxsYXMtcGl6emVyaWEvNTMxLTNlMzI5Y2U2LTIwZGItNDYwMC04MWVlLTNkNTI5ODZhOTU0YdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Broad Ripple business plans to resume late-hour operation - WTHR",
        "content": "The pizza shop and other businesses had agreed to a 1 a.m. closing time after a June shooting in Broad Ripple that left three dead.\n\nExample video title will go here for this video\n\nExample video title will go here for this video\n\nINDIANAPOLIS — At least one Broad Ripple business is planning to extend its hours in the village this weekend.\n\nThe decision comes more than a month after restaurants and bars there voluntarily adopted a 1 a.m. curfew. It was an attempt to curb violence in the neighborhood following a June shooting where three people were killed and another was injured.\n\nOn a Wednesday afternoon along Broad Ripple Avenue, the folks inside Goodfellas Pizzeria are making their signature thin-crust dough.\n\nThere's another kind of dough though that's been thin around there this past month — the money kind.\n\n\"Our late-night crew got their hours cut back,\" Goodfellas manager Cole McElroy said. \"It's three hours out of their time, and that's the best time for money for them.\"\n\nThat June incident wasn't the first time shots have rang out in the village in the past year.\n\n\"Pretty much every Saturday or Sunday it happened,\" McElroy said.\n\nThe 1 a.m. closing time was part of a strategy to curtail that and take the focus off the area.\n\n\"I think it's helped somewhat, but it's hard to manage things like that already, but I think it's a step,\" said Sophia Ankney-Anderson, who thinks the early shut-down time has definitely changed Broad Ripple's party vibe on the weekends. \"It just shuts down, you gotta go.\"\n\nThis weekend, though, Goodfellas isn't shutting down early. Their doors will be open until 2:30 a.m.\n\n\"It's a trial run to see if we can go back to later nights,\" McElroy said.\n\nThe Broad Ripple Village Association didn't have a comment about what other businesses would be doing this weekend but provided the following statement:\n\n\"Our businesses are continuing to adapt to situations and put public safety first while balancing that with running a successful business.\"\n\nThe owner of Average Joes, Mine Shaft and Rock Lobster said he couldn't give a definitive answer on what this weekend's hours would be at any of his establishments, but said he would do what seemed best, given whatever the circumstances are, come this Friday and Saturday.\n\nMany of the other businesses didn't want to comment on what their hours would be this weekend. One topic that did come up with several businesses was how the construction on Broad Ripple Avenue had impacted their bottom lines — even before the 1 a.m. closings.\n\n\"We've had months down 20%, down 50%. It just really depends on where it is and what else is going on, but people kind of avoid the area because it's difficult to travel,\" Union Jack's owner Chelsey Wetzel said.\n\nWetzel said the early closing didn't affect Union Jack, because its clientele is usually gone by midnight or earlier. Wetzel said she hopes people will continue to come to Broad Ripple, no matter the businesses hours.\n\n\"We would really love to see everyone's happy faces in our doors,\" Wetzel said."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNpdHlhbmRzdGF0ZW55LmNvbS9wb2xpdGljcy8yMDIzLzA3L3JpcHBsZS1lZmZlY3RzLWtldmluLXRob21hcy1jb25ncmVzc2lvbmFsLXJ1bi8zODg4NzMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jul 2023 07:00:00 GMT",
        "title": "Ripple effects of Kevin Thomas' congressional run - City & State New York",
        "content": "Long Island won’t just be a congressional battleground next year – thanks to those federal races, down-ballot seats may open up as well. State Sen. Kevin Thomas of Nassau County announced on Wednesday that he is running in the 4th Congressional District against fellow Democrats former Hempstead Supervisor Laura Gillen and former figure skater Sarah Hughes, opening up his own influential seat in state government. Among the top potential contenders for his seat is Assembly Member Taylor Darling, whose own run would leave another seat open. Big shake-ups may be coming to Long Island as local lawmakers look to shift into new positions with national attention on the region.\n\nLong Island politicos have floated Darling’s name as one of the front-runners to replace Thomas, and said she would have an interest in the state Senate seat. First elected in 2018, she challenged and defeated former longtime Assembly Member Earlene Hooper in the Democratic primary. Hooper at the time was the deputy Assembly speaker, the fourth-highest position among Assembly leadership.\n\nThe entirety of Darling’s district exists within Thomas’ 6th state Senate District, the only Assembly district that overlaps the seat to that extent. Fellow Democratic Assembly Member Charles Lavine, who represents a portion of the state Senate district, has served in the lower chamber since 2005 and currently chairs the powerful Judiciary Committee. The other two Assembly districts that cover portions of Thomas’ district are both represented by Republicans: Assembly Members Ed Ra and Brian Curran. A spokesperson for Darling did not return a request for comment.\n\nJay Jacobs, chair of both the state Democratic Party and the Nassau County Democratic Party, told City & State that he has heard from multiple people who are interested in Thomas’ seat, but said it is still early and did not offer any specific names. Nassau County Legislators Siela Bynoe and Carrié Solages, both of whom ran for the 4th Congressional District last year, have also been floated as potential contenders for state Senate. But if Darling jumped into the Senate race, those potential candidates could run for her Assembly seat instead. Solages – whose sister is Assembly Member Michaelle Solages – and Bynoe would leave their own county legislative seats open and trigger a special election if one of them won. But unlike Darling, they could run for the state Legislature without giving up their office since county elections happen in odd years.\n\nProgressives may also have an eye on Thomas’ seat. Long Island Democrats, Thomas included, have generally occupied the more moderate wing of the party given the region’s moderate voting base. Progressives have constituted a powerful voting bloc in Albany regardless of who has controlled the chamber, and more recently have allied themselves even more with Hudson Valley suburban Democrats after losses on Long Island last year. In progressive circles, Jeremy Joseph, who only got about 15% of the vote in his unsuccessful challenge to former state Sen. Anna Kaplan last year, has come up as a potential left-wing contender in the state Senate primary."
    }
]