[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMTEvcmlwcGxlLWNlby1zYXlzLXNlYy1oYXMtbG9zdC1zaWdodC1vZi1taXNzaW9uLXRvLXByb3RlY3QtaW52ZXN0b3JzLmh0bWzSAWtodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMS8xMS9yaXBwbGUtY2VvLXNheXMtc2VjLWhhcy1sb3N0LXNpZ2h0LW9mLW1pc3Npb24tdG8tcHJvdGVjdC1pbnZlc3RvcnMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ripple CEO says SEC has lost sight of mission to protect investors - CNBC",
        "content": "The CEO of blockchain company Ripple has some strong words for the U.S. Securities and Exchange Commission.\n\nBrad Garlinghouse told CNBC's Dan Murphy at the company's Ripple Swell conference in Dubai that he thinks the agency has lost sight of one of its key tasks as a regulator.\n\n\"I think the SEC, in my opinion, has lost sight of their mission to protect investors. And the question is, who are they protecting in this journey?\" Garlinghouse said Thursday. The SEC was not immediately available for comment when contacted by CNBC.\n\nThe SEC in 2020 accused Ripple and its executives of conducting a $1.3 billion securities fraud via sales of XRP to retail investors. Ripple, the regulator alleged, failed to register an ongoing offer and sale of billions of XRP tokens to investors, depriving them of adequate disclosures about XRP and Ripple's business.\n\nIn July, Ripple was handed a pivotal victory as a judge ruled that XRP is not in and of itself a security. Following this, the SEC was denied a request for an interlocutory appeal. Then, in October, the SEC dropped its securities law violation charges against Garlinghouse and Ripple executive Chris Larsen.\n\nThe next key step in the case is the remedies discovery process. The SEC has 90 days from Nov. 9 to conduct remedies-related discovery, according to a proposed schedule submitted by the SEC.\n\n\"I think it is a positive step for the industry, not just for Ripple, not just for Chris and Brad, but for the whole industry, that the SEC has been put in check in the United States. And I'm hopeful this will be a thawing of the permafrost in the United States for really seeing an amazing industry that has immense potential thrive in the largest economy in the world,\" Garlinghouse told CNBC."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMTEvcmlwcGxlLWNlby1zYXlzLXNlYy1oYXMtbG9zdC1zaWdodC1vZi1taXNzaW9uLXRvLXByb3RlY3QtaW52ZXN0b3JzLmh0bWzSAWtodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMS8xMS9yaXBwbGUtY2VvLXNheXMtc2VjLWhhcy1sb3N0LXNpZ2h0LW9mLW1pc3Npb24tdG8tcHJvdGVjdC1pbnZlc3RvcnMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ripple CEO says SEC has lost sight of mission to protect investors - CNBC",
        "content": "The CEO of blockchain company Ripple has some strong words for the U.S. Securities and Exchange Commission.\n\nBrad Garlinghouse told CNBC's Dan Murphy at the company's Ripple Swell conference in Dubai that he thinks the agency has lost sight of one of its key tasks as a regulator.\n\n\"I think the SEC, in my opinion, has lost sight of their mission to protect investors. And the question is, who are they protecting in this journey?\" Garlinghouse said Thursday. The SEC was not immediately available for comment when contacted by CNBC.\n\nThe SEC in 2020 accused Ripple and its executives of conducting a $1.3 billion securities fraud via sales of XRP to retail investors. Ripple, the regulator alleged, failed to register an ongoing offer and sale of billions of XRP tokens to investors, depriving them of adequate disclosures about XRP and Ripple's business.\n\nIn July, Ripple was handed a pivotal victory as a judge ruled that XRP is not in and of itself a security. Following this, the SEC was denied a request for an interlocutory appeal. Then, in October, the SEC dropped its securities law violation charges against Garlinghouse and Ripple executive Chris Larsen.\n\nThe next key step in the case is the remedies discovery process. The SEC has 90 days from Nov. 9 to conduct remedies-related discovery, according to a proposed schedule submitted by the SEC.\n\n\"I think it is a positive step for the industry, not just for Ripple, not just for Chris and Brad, but for the whole industry, that the SEC has been put in check in the United States. And I'm hopeful this will be a thawing of the permafrost in the United States for really seeing an amazing industry that has immense potential thrive in the largest economy in the world,\" Garlinghouse told CNBC."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMTEvcmlwcGxlLWNlby1zYXlzLXNlYy1oYXMtbG9zdC1zaWdodC1vZi1taXNzaW9uLXRvLXByb3RlY3QtaW52ZXN0b3JzLmh0bWzSAWtodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMS8xMS9yaXBwbGUtY2VvLXNheXMtc2VjLWhhcy1sb3N0LXNpZ2h0LW9mLW1pc3Npb24tdG8tcHJvdGVjdC1pbnZlc3RvcnMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ripple CEO says SEC has lost sight of mission to protect investors - CNBC",
        "content": "The CEO of blockchain company Ripple has some strong words for the U.S. Securities and Exchange Commission.\n\nBrad Garlinghouse told CNBC's Dan Murphy at the company's Ripple Swell conference in Dubai that he thinks the agency has lost sight of one of its key tasks as a regulator.\n\n\"I think the SEC, in my opinion, has lost sight of their mission to protect investors. And the question is, who are they protecting in this journey?\" Garlinghouse said Thursday. The SEC was not immediately available for comment when contacted by CNBC.\n\nThe SEC in 2020 accused Ripple and its executives of conducting a $1.3 billion securities fraud via sales of XRP to retail investors. Ripple, the regulator alleged, failed to register an ongoing offer and sale of billions of XRP tokens to investors, depriving them of adequate disclosures about XRP and Ripple's business.\n\nIn July, Ripple was handed a pivotal victory as a judge ruled that XRP is not in and of itself a security. Following this, the SEC was denied a request for an interlocutory appeal. Then, in October, the SEC dropped its securities law violation charges against Garlinghouse and Ripple executive Chris Larsen.\n\nThe next key step in the case is the remedies discovery process. The SEC has 90 days from Nov. 9 to conduct remedies-related discovery, according to a proposed schedule submitted by the SEC.\n\n\"I think it is a positive step for the industry, not just for Ripple, not just for Chris and Brad, but for the whole industry, that the SEC has been put in check in the United States. And I'm hopeful this will be a thawing of the permafrost in the United States for really seeing an amazing industry that has immense potential thrive in the largest economy in the world,\" Garlinghouse told CNBC."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3hycC1sYXdzdWl0LXVwZGF0ZS13aHktdGhlLXNlY3MtY2FzZS1hZ2FpbnN0LXJpcHBsZS1jb3VsZC1zZWUtYS1kcmFzdGljLWZpbmUtY3V0L9IBcGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3hycC1sYXdzdWl0LXVwZGF0ZS13aHktdGhlLXNlY3MtY2FzZS1hZ2FpbnN0LXJpcHBsZS1jb3VsZC1zZWUtYS1kcmFzdGljLWZpbmUtY3V0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "XRP Lawsuit Update: Why the SEC’s Case Against Ripple Could See a Drastic Fine Cut - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nAttorney John Deaton, who represents pro-XRP holders in the continuing legal dispute with the U.S. Securities and Exchange Commission (SEC), has argued in favor of Ripple’s probably low disgorgement. In stark contrast to the estimated $770 million, his remarks on @CryptoLawUS indicate that Ripple might need to pay $20 million or less.\n\nReasons Deaton Stated –\n\nFirst, the basis of Deaton’s argument is the Supreme Court’s Morrison decision, which restricts American authority over purchases made outside of the country. He emphasized that XRP is categorized as an exchange or utility token by regulators like the FCA and FSA and is not regarded as a security in several nations, including the U.K., Japan, and Switzerland. The attempt by the SEC to pursue disgorgement for sales that occurred outside of its purview may be significantly impacted by this international classification.\n\nSecondly, Deaton noted that the Ripple case is not structured as a fraud case but rather as an investigation into whether investors were damaged. He pointed out that most institutional XRP sales were to certified investors at prices below the stock’s current market value, suggesting that these investors suffered no losses. Furthermore, he stated that On-Demand Liquidity (ODL) transactions are safe since they happen quickly.\n\nThirdly, Deaton also disclosed that 75,000 owners of XRP have joined the SEC complaint, claiming that the regulatory agency is the real aggressor rather than Ripple. With this backing and the legal points made, Deaton confidently predicted that Ripple would prevail in this high-stakes legal battle by 99.9%.\n\nThe Same Claim By Other Prominent Figures\n\nA few days back, several prominent members of the Ripple community had questioned the basis of SEC’s fine and authority.\n\nDuring a conversation about the platform, Attorney Jeremy Hogan recently offered his opinions on the ongoing legal dispute between Ripple and the Securities and Exchange Commission. Hogan thinks there’s a high chance that the hefty $770 million fine currently looming over Ripple may be significantly reduced. Of course, the business would benefit greatly from this.\n\n\n\nStuart Alderoty, Chief Legal Officer of Ripple, also shared his perspective, referring to the SEC v. Govil case as an important precedent. The 2d Circuit in SEC v Govil held that the SEC couldn’t ask for a crippling disgorgement award w/o first proving that “Investors” suffered actual financial harm.\n\n\n\nIn response, Mobarak argued that since there’s no evidence of harm to investors, the SEC cannot reasonably justify imposing a massive $770 million fine on Ripple for its institutional XRP sales breach. According to Mobarak, it’s clear that the SEC lacks a solid basis for imposing such substantial fines on Ripple when there’s no proof of harm to investors."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9idWxsaXNoLWZvci1yaXBwbGUteHJwLXByaWNlLWtlZXBzLWluY3JlYXNpbmctZGVzcGl0ZS11cHRpY2staW4tY2lyY3VsYXRpbmctc3VwcGx5L9IBcGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9idWxsaXNoLWZvci1yaXBwbGUteHJwLXByaWNlLWtlZXBzLWluY3JlYXNpbmctZGVzcGl0ZS11cHRpY2staW4tY2lyY3VsYXRpbmctc3VwcGx5Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bullish For Ripple (XRP)? Price Keeps Increasing Despite Uptick in Circulating Supply - CryptoPotato",
        "content": "TL;DR\n\nXRP Release by Ripple Labs : In November, Ripple Labs released 1 billion XRP tokens, following their standard practice since 2017, accounting for about 1% of the 100 billion total supply.\n\n: In November, Ripple Labs released 1 billion XRP tokens, following their standard practice since 2017, accounting for about 1% of the 100 billion total supply. Supply Strategy and Circulation : Ripple increases XRP’s circulating supply monthly, with a plan to release the entire supply by April 2027, using re-locking strategies to stabilize the market.\n\n: Ripple increases XRP’s circulating supply monthly, with a plan to release the entire supply by April 2027, using re-locking strategies to stabilize the market. Market Resilience of XRP: Despite the growing supply, demand for XRP remains strong due to Ripple’s partnerships in finance and its legal battle with the SEC, contrasting with other cryptocurrencies that reduce supply to increase value.\n\nRipple Labs released 1 billion XRP into the Ripple ecosystem at the beginning of November. That’s according to a report from blockchain intelligence firm Whale Alert.\n\n1 Billion More XRP Released In November\n\nThe monthly unlocking of a billion XRP tokens amounts to roughly 1% of the eventual total supply. The company released the tokens from an escrow smart contract in three tranches, according to Whale Alert data.\n\nThe first tranche unlocked 300 million tokens. The second one issued 200 million shortly after that. Then, a final release of 500 million completed Ripple’s supply increase for the month.\n\nThis has been the standard new issuance procedure for one of the world’s largest cryptocurrencies by market cap since 2017. In November, just a little over half of all the XRP that will ever be issued are currently in circulation.\n\nDoes Ripple Have A Halving?\n\nBitcoin price is rallying, likely because of an upcoming supply cut in April, amongst other things. New Bitcoins are mined roughly every ten minutes in a fixed amount that declines by half every four years.\n\nDoes Ripple have a “halving” event? In short, no.\n\nRipple Labs has been increasing the circulating supply of XRP each month since 2017. The XRP ledger has a total supply cap of 100 billion tokens since 2012 when it was founded.\n\nIf all goes according to plan, the entire supply will be in circulation after April 2027. As reported by Investing.com at the end of October:\n\n“In the latest development in the cryptocurrency market, Ripple has extended its final escrow deadline to April 2027. The company’s original plan was to release one billion XRP each month for a period of 55 months.”\n\nUsually, the company quickly re-locks a sizable portion of the new supply and rolls it over to the next month. This is to gradually increase circulation and prevent supply shocks from having an undue influence on the price. Ripple then usually moves the remaining tokens onto cryptocurrency exchanges.\n\nRipple Price Backed By Demand\n\nOther blockchain companies like Binance burn tokens and lower supply to add value to their cryptocurrencies. So, it’s a marvel of demand for XPR tokens that the price has so much support even as the supply increases.\n\nRipple’s extensive business partnerships with traditional finance companies are likely a big part of the market’s love for XRP. In addition, Ripple Labs’ so-far very successful fight against the SEC in court earns XRP media coverage and elevates the blue-chip cryptocurrency’s profile and its price."
    }
]