[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vd3d3LmJiYy5jby51ay9uZXdzL3VrLXdhbGVzLTY0NzA0NDgw0gEwaHR0cHM6Ly93d3cuYmJjLmNvLnVrL25ld3MvdWstd2FsZXMtNjQ3MDQ0ODAuYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Swansea: Community helps save West Cross cafe Ripples - BBC",
        "content": "A community has rallied to save a Swansea seafront cafe from demolition.\n\nMore than 1,100 people objected to a proposal to demolish Ripples Cafe in West Cross, and West Cross Garage at the rear and replace them with a house.\n\nPlanning officers said it would result in the loss of a valued ice cream outlet on a key leisure and tourist stretch.\n\nRipples owner Dennis Dwyer said that the community response had been overwhelming.\n\nAccording to the Local Democracy Reporting Service, the cafe is popular with those who walk, cycle and jog along the nearby Mumbles seafront, while the garage also has a loyal customer base.\n\nSwansea council received 1,174 letters of objection to the plans, convincing them to turn down the application."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvcmlwcGxlLXZzLXNlYy1qdWRnZS1uZXRidXJuLXNheXMtc2VjLWRvZXNudC1oYXZlLWEtZmFpdGhmdWwtYWxsZWdpYW5jZS10by1sYXfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Ripple vs. SEC: Judge Netburn Says SEC Doesn't Have a Faithful Allegiance to Law - Watcher Guru",
        "content": "The dispute between the Securities and Exchange Commission and Ripple has progressed through several stages. As the case nears its conclusion, there is much speculation in the cryptocurrency world concerning the outcome.\n\nThe litigation has been ongoing for more than two years, and it appears to be a never-ending battle. The ongoing legal struggle has dampened retail interest in Ripple (XRP), causing its price to fall.\n\nAlso read: Instagram to Start Selling Verification\n\nJohn Deaton, the founder of CryptoLaw.US, recently shared a tweet highlighting the words of Federal Judge Netburn.\n\ncryptocurrency, and on the other hand, that Hinman sought and obtained legal advice from SEC counsel in drafting his Speech, suggests that the SEC is adopting its litigation positions to further its desired goal, and not out of a faithful allegiance to the law.”\n\n\n\n-Judge Netburn — John E Deaton (@JohnEDeaton1) February 20, 2023\n\nAccording to the details shared by Deaton, Judge Netburn slammed lawyers of the SEC that stated the conduct and behavior of the SEC’s lawyers.\n\n“The hypocrisy in arguing to the court, on the one hand, that the speech is not relevant to the market’s understanding of how or whether the SEC will regulate cryptocurrency,” stated Netburn.\n\nAlso read: Bitcoin Surpasses Visa in Terms of Market Cap\n\nThe judge also spoke about Hinman and how he obtained legal advice from the SEC counsel in drafting his speech. He highlighted that it is an indication that the SEC is not playing the game in a legal manner. The judge stated that instead of faithfully upholding the law, the Securities and Exchange Commission (SEC) is allegedly adapting its litigation positions to further its goals."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYml0Y29pbmlzdC5jb20vcmlwcGxlLWV4cGFuZHMtdWFlLXBheW1lbnRzLXByb3ZpZGVyLXVzZS14cnAv0gFIaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9yaXBwbGUtZXhwYW5kcy11YWUtcGF5bWVudHMtcHJvdmlkZXItdXNlLXhycC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Ripple Expands Into UAE, Payments Provider Will Use XRP - Bitcoinist",
        "content": "Just recently, Ripple CEO Brad Garlinghouse drew attention to the global regulatory progress in comparison to the headwinds the industry is facing in the United States. One region where crypto is seen as a promising innovation and where the company has already been able to sign high-profile collaborations is the MENA region (Middle East/North Africa).\n\nAnd today, a new partner seems to have been added by Ripple. Punnoose Mathew, managing director of Dubai based Joyalukkas Exchange, wrote on LinkedIn that he had a meeting with Ripple employees Mark Johnson, William Cooley and Nick Taplin, “the leader in blockchain and crypto solutions for enterprises.” Mathew wrote:\n\nIt was a great discussion on how Ripple could be a great enabler for money transfer entities to scale up for affordable cross-border payments, instant settlement, and continuous liquidity access with their On-Demand Liquidity using the XRP platform. We are excited to collaborate with you.\n\nThis Is The New Partner Of Ripple\n\nAlthough Ripple itself has not yet released an official confirmation of its new partner, Mathew’s wording is quite clear. The company will use the XRP-based technology On-Demand Liquidity (ODL) to optimize its cross-border payments with it.\n\nJoyalukkas Exchange is a part of Joyalukkas Group, a multi-billion dollar global conglomerate and a world-renowned brand in jewelry trading. The payment service provider aims to be one of the leading providers of foreign exchange services in the region.\n\nIn terms of cross-border payments, Joyalukkas Exchange’s website states that they offer a wide range of remittance solutions to every customer and guarantee the best rates. For this, the payment service provider has established several partnerships that allow “quick and easy transfers to any part of the world at the best rates.”\n\nAccording to the website, the instant money transfer service allows money to be transferred within minutes through cash withdrawal at various agencies and also through account withdrawal in selected countries.\n\nMoreover, Joyalukkas Exchange is one of the main agents of Western Union. It allows customers to send and receive money to more than 200,000 agent locations worldwide. The service provider has also partnered with other payment companies, including Transfast, Ezremit and IME.\n\nAs XRP community member Wrathof Kahneman noted, Joyalukkas Exchange and the American fintech company share some of the same existing partners.\n\nAt press time, the XRP price is up 0.3% within the last 24 hours and stood at $0.3945, ranging between $0.3801 and $0.4052.\n\nFeatured image from Ripple, Chart from TradingView.com"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDIvMjAvZGVhdG9uLXJlaXRlcmF0ZXMtanVkZ2Utc2FyYWgtbmV0YnVybnMtY3JpdGljaXNtLW9mLXNlYy1pbi1yaXBwbGUtY2FzZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Deaton Reiterates Judge Sarah Netburn's Criticism of SEC in Ripple Case - The Crypto Basic",
        "content": "The attorney reiterates his belief that the SEC is acting in allegiance to its goals of expanding its control over the emerging market and not in loyalty to the law.\n\nAttorney John E. Deaton recently reiterated Judge Sarah Netburn’s criticism of the United States Securities and Exchange Commission in its case against Ripple.\n\nThe lawyer representing over 75,000 XRP holders in the case as a friend of the court did this in a tweet today, quoting statements from the magistrate in July last year. It came in response to a recent Bloomberg opinion piece dubbed “The SEC Comes for Crypto Custody.”\n\ncryptocurrency, and on the other hand, that Hinman sought and obtained legal advice from SEC counsel in drafting his Speech, suggests that the SEC is adopting its litigation positions to further its desired goal, and not out of a faithful allegiance to the law.” -Judge Netburn — John E Deaton (@JohnEDeaton1) February 20, 2023\n\n- Advertisement -\n\nProminent Bloomberg columnist Matt Levine in the article, suggests that the SEC has managed to flip the script on the crypto industry. Levine asserts that regulators in the traditional finance industry create general public rules to cover all cases only for creative, higher-paid industry lawyers to find and take advantage of loopholes.\n\nHowever, Levine highlights that the reverse currently appears to be the case with the crypto industry. The columnist points out that the SEC is exploiting legal provisions to gradually expand its regulatory powers in the emerging market, with industry participants consistently a step behind.\n\n“Just an unusual situation!” Levine writes.\n\n- Advertisement -\n\nLevine’s piece comes as the SEC has notified centralized staking service providers with its enforcement action against Kraken.\n\nRecall that Judge Netburn, last July, asserted that the SEC was not acting in faithful allegiance to the law but in pursuit of its goals, citing its shifting stance on the controversial Hinman documents.\n\nNotably, the agency initially argued that William Hinman’s controversial speech in 2018, which declared Bitcoin and Ethereum non-securities represented his personal views and not the opinion of the market regulator. However, when the judge requested that the SEC hand over emails and other documents related to the drafting of the speech, the SEC alleged that attorney-client privileges protected these documents as Hinman consulted SEC lawyers in the drafting of the speech.\n\nFor context, Hinman, at the time, served as director of the SEC’s Division of Corporation Finance. Notably, the SEC’s complaint against Ripple took many by surprise, considering Hinman, just two years prior, in what is regarded as the only guidance from the SEC to the emerging markets, had asserted that Bitcoin, Ethereum, and other sufficiently decentralized networks do not represent securities.\n\nConsequently, several crypto industry participants and market observers are curious as to the contents of the hotly contested documents. As highlighted in a recent piece by Dr. Roslyn Layton, a policy researcher and Forbes contributor who recently filed a motion for the court to unseal the document, it could clarify if Ethereum interests influenced Hinman’s speech or if regulators are confused, which could justify confusion amongst industry participants.\n\nNotably, the market regulator wants the documents to remain sealed, arguing that opening them to public scrutiny could affect the openness of future policy deliberation processes.\n\nAs the SEC’s chair, Gary Gensler, continues to assert that traditional securities laws apply to crypto and new rules are unnecessary, the agency has continued to stretch existing laws to launch several enforcement actions against industry participants. Consequently, the market in the U.S. remains shrouded in uncertainty with no clear path to compliance despite statements to the contrary by Gensler."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmludmVyc2UuY29tL3NjaWVuY2UvZWNvbG9naXN0cy1maW5kLXVuZXhwZWN0ZWQtZmVlZGJhY2stbG9vcHMtdGhhdC1jb3VsZC1jb21wbGljYXRlLWZpZ2h0aW5nLWNsaW1hdGUtY2hhbmdl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Ecologists Find Unexpected Feedback Loops Could Complicate Fighting Climate Change - Inverse",
        "content": "It’s hard to escape the reality that the world is not doing well in responding to climate change.\n\nAccording to the most recent United Nations' Intergovernmental Panel on Climate Change report, global surface temperatures will all but inevitably soar past the 1.5 degrees Celsius mark set as a target limit by the Paris Accords, and possibly breach the 2 degrees Celsius mark by the middle of the century. That could lead to all kinds of problems, such as lower crop yields, more wildfires, stronger storms, and more people dying of heat-related issues in the summer.\n\nAnd that’s just the scenario as extrapolated in a more or less linear fashion from current trends in temperature and carbon dioxide emission levels. As described in a new paper published Friday in the journal One Earth, climate change could get a lot weirder due to feedback loops that amplify warming and that scientists can’t fully model.\n\n“Climate models may be underestimating the acceleration in global temperature change because they aren’t fully considering this large and related set of amplifying feedback loops,” Oregon State University postdoctoral researcher and study co-author Christopher Wolf said in a statement.\n\nIn their paper, Wolf and his co-author, Oregon State University professor of ecology William Ripple, led an international team in examining 47 different types of feedback loops that could affect future climate change, some of which increase warming, and some of which create a cooling effect, and some of which have uncertain effects.\n\nThe overall result of these interacting loops is too hard to predict at this point, but Wolf and Ripple worry that warming feedback loops could push the Earth's climate past one or more tipping points that could “result in tragic climate change outside the control of humans,” they write.\n\nBoat in the Arctic ice. Eloi_Omella/E+/Getty Images\n\nWhat’s a climate feedback loop?\n\nRipple and Wolf studied and created a table of 41 climate feedback loops, geophysical and biological processes that are driven by climate and which, in turn, drive climate change in one way or another.\n\nAn example of a physical feedback loop might be Arctic sea ice, where ”warming in the Arctic leads to melting sea ice, which leads to further warming because water has lower albedo (reflectance) than ice,” Ripple and Wolf write in the paper. The pair consider permafrost thawing, which releases carbon dioxide and methane, as a biological feedback loop.\n\nSome of the major positive feedback loops (positive here meaning something that amplifies, not something that has a positive outcome) they examined, loops that increase global warming, are the aforementioned loss of Arctic sea ice, the loss of glaciers, increasing water vapor in the atmosphere —which has a greenhouse effect itself — and sea level rise, which further lowers Earth's albedo. They found 27 positive feedback loops in total.\n\nThere are some negative feedback loops (meaning things that promote stability), primarily the Planck loop, where the more infrared energy escapes Earth into space the warmer the climate becomes. Chemical weathering of rocks occurs when atmospheric carbon dioxide mixes with rainwater, acidifying it and removing atmospheric carbon, and this increases with carbon dioxide levels. Increasing rainfall in places like the Sahara desert, and increasing carbon dioxide levels worldwide, can lead to more plant growth, which in turn sequesters carbon dioxide. They found seven of these negative feedback loops that act to balance climate change.\n\nOther feedback loops are more uncertain in Ripple and Wolfs’ analysis such as how much the ocean can absorb carbon dioxide by acidifying, or the effects of human-created aerosols and mineral dust in the atmosphere. Some other studies suggest aerosols and dust cool the climate, but predicting future dust levels is difficult and humans are reducing levels of industrial aerosols in the air, otherwise known as pollution, because they are unhealthy for us. The researchers found seven of these uncertain feedback loops.\n\nJOSEPH EID/AFP/Getty Images\n\nWhat does it mean?\n\nNearly all the countries on Earth signed on to the Paris Accord agreement, adopted in 2015, which aims to limit global warming by 1.5 to 2 degrees Celsius as compared with pre-industrial global temperatures. But countries “are not even close to being on track” to meet the necessary emission reduction guidelines set forth in the agreement, Ripple and Wolf write in their paper. If you think of how much carbon dioxide can be emitted before reaching 1.5 degrees Celsius of warming as a budget, the “carbon budget” at the start of 2023 is about 260 gigatons of carbon dioxide, an amount they say the world could blow through in less than seven years at current rates.\n\nBut that’s just the projection without considering how feedback loops could complicate things. Because the feedback loops are driven by changes in temperature and carbon levels, and because they interact with one another, they could create “climate cascades,” according to Ripple and Wolf, waves of climate change more powerful than any one loop could produce on its own.\n\nThat could increase the likelihood and speed and which the global climate reaches tipping points beyond which new climate patterns become self-sustaining. At that point, a much warmer planet would be with us for centuries or longer.\n\nWhere do we go from here?\n\nFor Ripple and Wolf, the continued uncertainness around some of the feedback loops they examined, and the broader uncertainty of how these loops could affect the course of climate change going forward, lead to two different conclusions.\n\nFirst, scientists need to get much better at measuring and modeling all of the Earth systems involved in climate change, an effort that will require major changes of approach within the scientific community, according to Ripple.\n\n“We need a rapid transition toward integrated Earth system science because the climate can only be fully understood by considering the functioning and state of all Earth systems together,” he said in a statement. “This will require large-scale collaboration, and the result would provide better information for policymakers.”\n\nSecond, the work needs to get serious about the wide-ranging shifts in land management, agriculture, energy, and transportation necessary to reduce emissions to slow the pace of climate change, particularly since feedback loops could present us with unpleasant surprises.\n\n“It’s too late to fully prevent the pain of climate change, but if we take meaningful steps soon while prioritizing human basic needs and social justice, it could still be possible to limit the harm,” said in a statement."
    }
]