[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LnRoZXJpbmdlci5jb20vMjAyMy8zLzEwLzIzNjMzODY2L3NldmVuLXllYXJzLW9mLWZhcmhhZC1tb3NoaXJpLWF0LWV2ZXJ0b24tYnJhbWxleS1tb29yZS1zdGFkaXVtLXByZW1pZXItbGVhZ3Vl0gGHAWh0dHBzOi8vd3d3LnRoZXJpbmdlci5jb20vcGxhdGZvcm0vYW1wLzIwMjMvMy8xMC8yMzYzMzg2Ni9zZXZlbi15ZWFycy1vZi1mYXJoYWQtbW9zaGlyaS1hdC1ldmVydG9uLWJyYW1sZXktbW9vcmUtc3RhZGl1bS1wcmVtaWVyLWxlYWd1ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Seven Years of Farhad Moshiri at Everton - The Ringer",
        "content": "\n\nJames Allcott is joined by Baz from Toffee TV for a deep dive into Farhad Moshiri’s seven years in charge of Everton. James and Baz look at what the main issues have been over this period and where the real problems are at the club. Looking at the transfers, managerial appointments, and plans for Bramley-Moore stadium, the pair discuss the positive and negative aspects of the Moshiri era.\n\nHost: James Allcott\n\nGuest: Baz from Toffee TV\n\nProducer: Cai Jones\n\nEditor: Finn McSkimming\n\nAdditional Production: Jonathan Fisher\n\nSubscribe: Spotify"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmhvbGx5d29vZHJlcG9ydGVyLmNvbS9idXNpbmVzcy9idXNpbmVzcy1uZXdzL3Jva3Utcm9ibG94LXNpbGljb24tdmFsbGV5LWJhbmstMTIzNTM0ODEzMy_SAWhodHRwczovL3d3dy5ob2xseXdvb2RyZXBvcnRlci5jb20vYnVzaW5lc3MvYnVzaW5lc3MtbmV3cy9yb2t1LXJvYmxveC1zaWxpY29uLXZhbGxleS1iYW5rLTEyMzUzNDgxMzMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Roku Has $487M in Cash at Failed Silicon Valley Bank - Hollywood Reporter",
        "content": "The dramatic failure of Silicon Valley Bank on Friday will have a ripple effect that impacts the entertainment industry.\n\nAccording to multiple securities filings Friday, a number of companies with connections to the entertainment business had accounts at the bank. With the bank now in a receivership with the Federal Deposit Insurance Corp., any deposits above the $250,000 threshold that the FDIC insures are in jeopardy until the FDIC figures out how to distribute the bank’s assets.\n\nThat being said, so far none of the companies involved say that the failure of SVB should have a dramatic effect on their ability to operate.\n\nArguably the most impacted company so far is Roku, which said that it had $487 million at SVB, more than one fourth of its total cash holdings.\n\n“At this time, the Company does not know to what extent the Company will be able to recover its cash on deposit at SVB,” Roku warned investors. That being said, the company said that the cash it is holding at other financial institutions, as well as its cash flow from operations, “will be sufficient to meet its working capital, capital expenditures, and material cash requirements from known contractual obligations for the next twelve months and beyond.”\n\nOther companies impacted include the video production platform Vimeo, which said it had accounts at SVB. However, it said the total value should be covered by the FDIC. “The Company has a well structured and diverse set of banking partners with no bank holding over 25% of its total cash,” the company said.\n\nAnd Roblox said that it had about 5 percent of its cash holdings at SVB, which would total about $150 million. “Regardless of the ultimate outcome and the timing, this situation will have no impact on the day to day operations of the Company,” it added.\n\nAnd FuboTV, the streaming pay-TV operator, filed with the SEC to say that yes, it is aware of SVB’s failure, but that no, it does not have any bank accounts there.\n\nSVB had been America’s 16th-largest bank until it was shuttered on Friday. It specialized in services to startups in and around Silicon Valley."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vcmlwcGxlLmNvbS9pbnNpZ2h0cy9ob3ctY29tcGFuaWVzLWNhbi1tb2Rlcm5pemUtdHJlYXN1cnktbWFuYWdlbWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "How Companies Can Modernize Treasury Management - Ripple",
        "content": "The past few years have been rocky for treasury managers as geopolitical events brought new sanctions, COVID-19 slowed economic growth and raised interest rates, and supply chain frictions wreaked havoc on businesses around the world.\n\nAlthough traditional payment rails are making attempts at modernization, many businesses do not have the time or capital to wait for an antiquated global payments system to evolve into a more equitable playing field. Legacy payment rails disproportionately serve financial players who tend to have long-standing relationships with correspondent banks, as well as ample resources (both human and capital) to expand into new markets and properly manage international treasury flows.\n\nCompounding this, while it’s well known that cross-border payments are messy and fractured, events in recent years have created siloed regional pockets that exacerbate challenges associated with global treasury management. Increased barriers have led to greater friction in cross-border payments, putting pressure on businesses to diversify suppliers and strategically alter trade corridors. This equates to taking on additional FX rates, establishing new banking relationships, and understanding and complying with new tax rules and regulations.\n\nAs the international payments landscape becomes ever more complex, treasury managers deserve a forward-thinking solution tailored to fit their business needs.\n\nStake Your Claim as a Multinational\n\nAlthough crypto can seem unapproachable, our Quick Guide: Streamline Global Treasury Flows helps untangle any preconceived notions by showcasing the real-world value that blockchain and crypto solutions have on businesses across the globe.\n\nFor example, gaining the ability to pay global vendors or suppliers in their local currency reduces one of the many pain points associated with doing business outside of domestic markets. This can strengthen relationships with third parties, improve operational efficiency and further solidify a business’s footprint in a new region.\n\nTreasury managers are also responsible for understanding foreign corridors well enough to accurately predict the necessary flow of funds, moving the right amount of capital at the right time at the most optimized possible price for the business.\n\nBut there are some corridors—like that of Southeast Asia, India, Brazil, and Mexico—that prove particularly challenging to manage the flow of funds, even for major banks. With Ripple’s global payments network, customers gain access to hundreds of new partners and financial institutions worldwide, without having to navigate these complex corridors.\n\nTap into New Opportunity\n\nData shows that emerging market economies average nearly 50% of global GDP. So there is clearly potential for businesses to thrive in these regions, but those that leverage crypto solutions to enter into new markets will be at an advantage, especially in complex corridors.\n\nWith a reduced need to prefund destination accounts and access to Ripple’s global network, businesses can develop regional positions at their own pace and even explore growth opportunities in multiple locations at once at a fraction of the cost compared to legacy payment rails.\n\nCorporate treasury teams can also utilize blockchain and crypto solutions to improve cash flow planning and lower operational overhead, enhance commercial terms and even help suppliers factor their receivables. These technologies present a truly modernized solution that allows treasury managers to meet their business needs and expand into new markets without breaking the bank.\n\nDownload our Guide to learn more about streamlining internal treasury operations and growing your business."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJvc3Rvbmdsb2JlLmNvbS8yMDIzLzAzLzEwL2J1c2luZXNzL3Ryb3VibGVzLXNpbGljb24tdmFsbGV5LWJhbmstcmlwcGxlLWFjcm9zcy1ib3N0b24tdGVjaC1zY2VuZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "'This hit like a ton of bricks': Troubles at Silicon Valley Bank ripple across Boston tech scene - The Boston Globe",
        "content": "“I am getting texts and e-mails from all over. We are getting bombarded,” Adrian Mendoza, founder and general partner of Mendoza Ventures in Boston, said of his firm’s companies that have accounts at SVB. “This is going to be tough on a lot of founders and startups, a lesson to be learned.”\n\nOne of the largest and most influential bankers to the Boston-area startup community, SVB was taken over by the Federal Deposit Insurance Corp. on Friday and all accounts were frozen until Monday at the latest, when withdrawals will be limited to $250,000 per account.\n\nThe abrupt failure of Silicon Valley Bank and its takeover by federal regulators Friday sent a shock wave through the Boston technology and biotech communities, with companies and depositors unable to withdraw funds and facing the prospect of not being able to pay bills or make payroll.\n\nAdvertisement\n\nThe sudden failure, the second-largest in US history after Washington Mutual’s 2008 downfall, was triggered by SVB’s disclosure on Wednesday of growing losses on government bonds due to rising interest rates. The announcement prompted a run on the bank. As depositors withdrew their savings this week, the bank had to sell Treasury bonds it owned at a loss, eroding its capital.\n\nCustomers will get receivership certificates for balances above $250,000 and won’t have immediate access to the funds unless the bank is quickly acquired by a healthy rival.\n\nSilicon Valley Bank referred requests for comment to the FDIC.\n\nAll of this means a potentially large swath of local companies — mostly privately held firms backed by venture capital — could have trouble funding their operations or making payroll.\n\n“This hit like a ton of bricks,” said Michael Benezra, managing partner at Boston VC firm Erez Capital. “The way I describe it is a ‘black swan’ event. . . . I called a friend of mine on the West Coast. . . . People [were] waking up to their accounts basically being frozen and their bank going under.”\n\nBenezra said two of his firm’s seven portfolio companies banked with SVB but were able to switch over to Brex, a San Francisco-based financial company, before the FDIC seizure. He declined to name the two startups, but said they are not located in the Boston area.\n\nAdvertisement\n\nOn Friday, some local firms started disclosing their exposure to the bank.\n\nIn filings with federal regulators, Ginkgo Bioworks said one of its subsidiaries had $74 million, or 6 percent of the company’s total cash and cash equivalents, at the bank. X4 Pharmaceuticals said it had 2.5 percent of its cash with SVB.\n\nCryptocurrency firm Circle Internet Financial told the Globe that SVB was one of six banks it has used to hold the $11 billion of cash reserves for its USDC stablecoin, in addition to $32 billion kept in US Treasuries. On Friday night, the company said in a tweet it tried and failed to move $3.3 billion out of SVB by wire transfer. The tweet prompted a rare drop in the price of USDC, which is designed to maintain a stable price of $1, to a low of 88 cents on Saturday.\n\nOther companies, including Flywire and AirSculpt Technologies, filed disclosures on Friday indicating they have loans from the bank.\n\nSVB has a large office in downtown Boston and often hosts events on behalf of startups and venture capital firms. When the office opened in 2020, SVB said it had more than 250 employees in Boston and Newton working on tech and health care banking and related services. In 2021, SVB acquired Boston Private Bank & Trust, which caters to wealthy individuals and has branches in Boston, Cambridge, Wellesley, and Beverly.\n\nThe bank ranked 11th largest in Massachusetts, with $5.5 billion of deposits as of June 30, according to FDIC data.\n\nMichael Cannon, who identified himself as a business owner from Framingham, checked to see if he could access the ATM at the Wellesley branch of Silicon Valley Bank on March 10, 2023. He was surprised that he could make a withdrawal. Barry Chin/Globe Staff\n\nThe Wellesley branch was closed on Friday, with the FDIC notice of seizure taped to the door. Guy Morris, who lives in Newton, tried to get access to his deposits on Friday afternoon but was thwarted. He said he kept his accounts below the FDIC insurance maximum but was worried about whether he would get access to his money for upcoming bills.\n\nAdvertisement\n\n“If I had known about this, I would have taken all my money out yesterday,” Morris said.\n\nVenture capitalists said they had been reluctantly urging their startups to pare back deposits at SVB in case the bank’s downturn spiraled into a full-blown crisis. The advice came despite the bank’s heavy involvement in supporting startups and after SVB chief executive Greg Becker on Thursday asked customers to remain loyal.\n\n“Startups need to make sure they have backup plans and are planning for the worst-case scenario,” Fady Saad, founder and general partner at Cybernetix Ventures in Boston, said he advised his portfolio companies. “At the same time, we wanted to avoid a domino effect. Silicon Valley Bank has been so supportive of our startups.”\n\nMendoza, for one, lived through prior financial crises and had his firm’s deposits spread among several banks, he said. But other companies were overreliant on SVB.\n\nAs the troubles became more evident at SVB on Thursday, a number of traditional banks began receiving inquiries from business customers about switching their accounts. Among them was Salem Five Bank, according to chief marketing officer Joe Bartolotta, who said his bank heard from a handful of SVB customers.\n\n“They were commercial customers looking for a safe place to store their money,” Bartolotta said.\n\nMany smaller publicly traded banks, including some in the Boston area, got sucked into the downdraft as SVB’s shares plunged amid investor concerns about the sector.\n\nAdvertisement\n\nShares in Eastern Bank fell 9.9 percent from its Wednesday closing price to Friday’s close, while Berkshire Bank shed 7.3 percent and Rockland Trust dropped 6.8 percent. Shares in First Republic Bank, a San Francisco-based bank with a big deposit base in Massachusetts, fell much further, in large part because its business model is more similar to SVB’s than the others. Its shares were down nearly 29 percent over the two days.\n\nThe trouble started this week after SVB said it had lost $1.8 billion on bond investments and was raising a $2.25 billion capital infusion. The bank’s assets ballooned during the previous years’ runup in the tech market as startups raised billions of dollars and deposited it at the bank.\n\nIn addition to making loans, SVB invested much of its money in Treasury bonds that don’t mature for years. With the Federal Reserve raising interest rates, prices of the bonds have fallen. The bank paid about $120 billion for debt securities on its balance sheet, but those securities had a current market value of only $102 billion as of Dec. 31, 2022, the bank revealed in February in a filing with the FDIC.\n\nIf SVB could have held the bonds until maturity, that wouldn’t matter. But the recent downturn in tech had customers withdrawing more funds, forcing the bank to sell its Treasuries at a loss. As fears about the bank’s stability spread, more customers had withdrawn funds, triggering a vicious downward cycle that ended in SVB’s takeover.\n\nNow, the bank’s failure might further accelerate the tech downturn. That’s because SVB not only holds deposits for many startups, but also loans them money and provides services such as helping fund-raise and publishing research on the tech market.\n\nAdvertisement\n\n“It’s obviously ridiculously important to have a banking partner that understands the needs of startups,” said David Chang, a fixture of the Boston tech scene who worked with the bank on his prior startup and is now a general manager at recruiting firm Hunt Club. “They’re going above and beyond the menu of things you pay for to respond to one-off requests startups make. You don’t find that amount of agility at more established banks.”\n\nGet Innovation Beat Boston Globe tech reporters tell the story of the region's technology and innovation industry, highlighting key players, trends, and why they matter. Enter Email Sign Up\n\nAaron Pressman can be reached at aaron.pressman@globe.com. Follow him @ampressman. Jon Chesto can be reached at jon.chesto@globe.com. Follow him @jonchesto."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYWVvbi5jby9lc3NheXMvandzdHMtY29zbWljLXJldmVsYXRpb25zLXdpbGwtY2hhbmdlLW91ci1pbnRlcmlvci1saXZlcy10b2_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "JWST’s cosmic revelations will change our interior lives too - Aeon",
        "content": "Two things fill the mind with ever new and increasing wonder and awe, the more often and steadily we reflect upon them: the starry heavens above me and the moral law within me.\n\n– from Critique of Practical Reason (1788) by Immanuel Kant\n\nEnlightenment philosophers were vexed that their expanding empirical science of the external, material world collided with long-standing religious and moral traditions premised solely on internal, a priori knowledge. But for Immanuel Kant, the ‘sensible world’ of appearances emerged from cognitive faculties of the human mind, constitutive of observations gained through human experience. ‘We can cognize of things a priori only what we ourselves have put into them,’ he wrote. Kant analogised his reframing of metaphysics to Copernicus’s heliocentrism, in which the astronomer’s observations made sense only when he placed the Sun, rather than Earth, at the centre. ‘An object of the senses’ like a new planet observed from a telescope, wrote Kant, ‘conforms to the constitution of our faculty of intuition’, resolving the perceived discrepancy between the observable world and the mind’s contemplation of it.\n\nThe Enlightenment’s radical political philosophy, shifting Europeans’ governance from aristocratic absolutism to freedom gained through reason, dovetailed with Kant’s philosophy of science. Observations of a band of stars that appeared to enring the sky led him to surmise that the solar system was shaped like a disc around the Sun. ‘Matter [is] … bound to certain laws, and when it is freely abandoned to those laws, it must necessarily bring forth beautiful combinations,’ he wrote in 1755. ‘There is a God just because nature even in chaos cannot proceed otherwise than regularly and according to order.’ A reasoned universe and a reasoned mind operated together.\n\nKant’s ‘sensible world’ of the 18th century was Earth, the solar system and the stars in the sky. If Kant’s philosophy holds true, then anticipated astrophysical phenomena of the observable cosmos must continue to be integrated into humans’ self-emplacement in an ever-expanding internal universe as well. Increasingly sophisticated technologies of visual perception – from Galileo’s spyglass to ground- and then space-based telescopes – mediate our entwined expanding astrophysical and moral universes.\n\nData from NASA’s James Webb Space Telescope (JWST) began returning images in July 2022, and is poised to deepen humans’ sensibility of the cosmos and ourselves. Astronomers expect that it will reveal novel astrophysical phenomena both one step beyond the familiar and the presently unimaginable. With its 6.5-metre gold-coated primary mirror and unprecedented sensitivity to long infrared wavelengths, the telescope’s deep field resolves distant star clusters in unparalleled detail. These images could help astronomers model the ‘cosmic spring’ that led to the formation of galaxies through gravitational mechanisms and life itself. The JWST could also pave the way to realise NASA scientists’ long-quested goal to detect extraterrestrial life, expanding beyond microbes on the surface of Mars or in the Venusian atmosphere, which would shore up a generalised theory of biology and evolution. The apprehension of biosignatures – indications of life in exoplanetary atmospheres – would demand a reordering, not only of how humans perceive the Universe, but of ourselves as living, if perhaps not lonely, beings within it.\n\nThousands of galaxies flood this near-infrared image of the galaxy cluster SMACS 0723, captured by JWST, 12 July 2022 (full image). Courtesy NASA, ESA, CSA, STScI\n\nThe cosmos as Kant understood it and cosmos as astronomers today understand it differ. The latter is more anticipated and sensible, but together they are just two points in a series of ruptures in humans’ perception of conjoined physical and philosophical spacetimes.\n\nThese ruptures have unfolded chronologically and spatially in tandem. Each new scalar bound from the Earth – to the Moon, to the local solar system, to alien planets and galaxies, to the very fringes of the Universe – has prompted the reformation of our sense of being. To test how the discovery of nature orders the nature of discovery of ourselves, we time-hop to Renaissance Italy.\n\nGalileo Galilei improved on existing telescopes, and turned his spyglass to the heavens, writing of striking discoveries in his epochal treatise Sidereus Nuncius (1610), or ‘Starry Messenger’. Observing what a contemporary had dubbed the ‘strange spottednesse’ of the Moon, Galileo wrote that its surface was not ‘smooth, uniform, and precisely spherical’ but rather ‘uneven, rough, and full of cavities and prominences, being not unlike the surface of the Earth.’ As the art historian Samuel Y Edgerton, Jr describes it, Galileo, disciplining his eyes and hand through artistic practices flowering in Florence, rendered the Moon in both soft sepia watercolours and dramatic chiaroscuro engravings.\n\nGalileo’s Moon – an imperfect body rife with craggy geologies, pockmarked by ancient collisions – related familiar terrestrial to unfamiliar lunar features, and required a symbolic reordering. Because the Catholic Church’s Moon, upon which the Virgin Mary reigned, referenced the Immaculate Conception, Galileo’s depiction called into question the concept of the Moon – and therefore God’s universe – as perfect and pure. Galileo had corrupted Dante’s ‘eternal pearl’, and the new Moon’s representation came to enter religious frescoes – a tacit if wary acceptance of a morphing moral order.\n\nAll images from Sidereus Nuncius (1610), or ‘Starry Messenger’, by Galileo Galilei\n\nNext, in careful logs over December 1609 and January 1610, Galileo reported curious pricks of light gambolling about the planet, ‘four planets never seen from the beginning of the world.’ Upon observing only two celestial bodies on the 11th night, Galileo ‘mov[ed] from doubt to astonishment’: he realised that the objects were not fixed, independent stars, but instead orbited at ‘marvellous speed around the star of Jupiter’.\n\nGalileo’s findings came to radically disrupt humans’ perception of their world\n\nWe now know these objects as the moons Io, Europa, Ganymede and Calisto, and NASA’s Jet Propulsion Laboratory is planning to send a probe to Europa in 2024 to investigate the possibility of life in its watery oceans. But four centuries ago, Galileo hastened an insuperable fracture of entwined astrophysical and moral beliefs. Further substantiating Copernicus’ model, Galileo fatally destabilised the prevailing geocentrism that the Church had held for centuries.\n\nThis time, the Church met Galileo’s observations with explicit resistance, imperilling his carefully constructed position in nuanced Italian court politics. The historian of science Mario Biagioli describes how Galileo had, initially, ingeniously manipulated the tides of power in the Florentine court, leveraging his astronomical discoveries to fashion himself as a philosopher (not a mere mathematician of lower social grade). By dubbing the moons the ‘Medici planets’, he augmented that family’s supposedly God-given mythology. But in 1633, the Roman Court found Galileo ‘vehemently suspected of heresy, namely for having held and believed a doctrine which is false and contrary to the divine and Holy Scripture: that the Sun is the centre of the world and does not move from east to west, and the Earth moves and is not the centre of the world.’ Galileo was condemned to house arrest for the remainder of his life.\n\nBiagioli attributes the ‘fall of the favourite’ to fickle papal dynamics rather than merely to religious or scientific resistance. In Kant’s parlance, Galileo’s freshly ‘sensible’ moons could not be reconciled with short-sighted power struggles. Nevertheless, Galileo’s findings came to radically disrupt humans’ perception of their world. A half-century later, Sir Isaac Newton reworked Galileo’s findings in his monumental Principia (1687). ‘The motions of the planets, the comets, the Moon, and the sea,’ Newton wrote, ‘are deduced from these forces by propositions that are also mathematical.’ He decisively located gravity as an empirical description of all objects and a fundamental theory even beyond the observable world. The laws of motion governed not only humans’ relationship to objects in their world and their place on Earth, but alien bodies outside of immediate perceptibility.\n\nTime-travel three centuries to the Harvard College Observatory in 1912, when the ‘computer’ Henrietta Swan Leavitt earned 30 cents an hour to determine stellar brightness, positions and movements over time. Although the observatory’s director Edward Pickering ‘chose his staff to work, not to think,’ Leavitt’s tedious labour afforded her intimate familiarity with the photographic plates. Partially deaf, her visual immersion let her track the stars in the Large and Small Magellanic Clouds (objects we now know to be dwarf galaxies, macerated and then regurgitated by the Milky Way). Leavitt formulated the relation between the length of a ‘Cepheid variable star’s’ brightening and dimming to precise time intervals, leading astronomers to calculate not only their distance from Earth but the scale of the galaxy.\n\nBy the 1920s, astronomers debated if the Milky Way galaxy contained the whole of the cosmos or if spiral nebulae were their own separate ‘island universes’ – a distinction that would define the scope of the cosmos. Edwin Hubble used the world’s most powerful telescope at the Mount Wilson Observatory near Los Angeles to study the Andromeda ‘spiral nebula’ in unprecedented resolution. In a now-famous image, Hubble crossed out the ‘N’ and replaced it with ‘VAR!’ as he realised that the ‘nova’ star was actually a ‘variable’ star; calculating its distance from Earth, he realised that Andromeda was too far away to be incorporated into the Milky Way. We might read Hubble’s ‘!’ as a punctuation of surprise as he too ‘mov[ed] from doubt to astonishment’: his galaxy was surely just one of many that populated a vast cosmos.\n\nEdwin Hubble’s photographic plate of Andromeda, 1923. Courtesy of the Carnegie Institution for Science\n\nLeavitt lent Hubble the means to harness a sophisticated telescopic technology to amplify natural ‘sensibility’, but her foundational insight was hard-won. Pickering glossed over Leavitt’s contributions, publishing the results in his name; similarly, the Harvard astronomer Cecilia Payne-Gaposchkin’s work on stellar atmospheres – later hailed as ‘the most brilliant PhD thesis ever written in astronomy’ – was diminished and then co-opted by her advisor Henry Russell. But the astronomical contributions of Leavitt, Payne-Gaposchkin and others eventually led to a progressive social perception: that women could research the cosmos on equal ground with their male colleagues.\n\nHubble returned spectacular ‘baby pictures’ of the Eagle Nebula’s ‘Pillars of Creation’\n\nNASA honoured Hubble decades later with the eponymous telescope that launched into outer space in 1990. Its grand mission was to research black holes, the solar system and, through its unparalleled sensitivity to visible wavelengths, the most distant galaxies in the Universe. But there was an issue: the telescope returned fuzzy images. After five missions to outer space, astronauts repaired the mirror, which NASA described as ‘fix[ing] the flaw much the same way a pair of glasses correct[s] the vision of a near-sighted person.’ In 1995, the now beloved and long-lived telescope returned spectacular ‘baby pictures’ of the Eagle Nebula’s ‘Pillars of Creation’ – billowing columns of gas and dust that are inchoate stars.\n\nThe Pillars of Creation. Photo courtesy NASA, ESA and the Hubble Heritage Team (STScI/AURA)\n\nThe Hubble Deep Field layered 342 separate exposures over 10 days in 1995 to show thousands of young galaxies 12 billion lightyears away. Astronomers confirmed that matter is evenly distributed at very large scales, further evidence of an expanding and cooling post-Big Bang universe. Though scientists had suspected the prevalence of black holes in the Universe, they learned from Hubble images that supermassive black holes cluster at the centre of galaxies.\n\nHubble ultra deep field, 3 June 2014. Courtesy NASA/ESA\n\nThe visual metaphors that NASA and the media used to describe Hubble’s technical attributes (‘needing glasses’, or capturing the Universe’s ‘baby pictures’) extended to material revelations. Astronomers used the data to unveil Pluto’s minuscule moon Styx, to analyse the aurorae around Ganymede and infer its saltwater ocean, and even to fortuitously catch the Refsdal supernova’s overpowering luminescence as the star explodes and dies. The Hubble telescope was also crucial to astronomers’ observations of distant supernovae in 1998 that revealed that the Universe is not only expanding, but accelerating. The mysterious ‘dark energy’ pushes spacetime to the unfathomable sublime, and accounts for about two-thirds of the Universe, forcing physicists to fundamentally rethink cosmological models.\n\nComing out of the 1970s, particle physicists struggled to unify cosmological theories to describe all matter in the Universe. Recalling his days as a graduate student, the physicist Alan Guth at MIT tells me he was driven by the assumption that ‘nature was governed by a strong sense of simplicity.’ But the observable Universe (its density, its composition) wasn’t matching the theoretical models, leading Guth to develop the concept of cosmic inflation: the early Universe had undergone exponential expansion from 10-36 to around 10-32 seconds after the Big Bang, accounting for density fluctuations that led to the large-scale structure of galaxies and, ultimately, the physical conditions for life.\n\nCosmic inflation strongly supported the Big Bang explanation. Data from NASA satellites in the 1990s further confirmed what the physicists Arno Penzias and Robert Wilson had detected in 1964 – the crackle of microwave radiation that is the afterglow of the Big Bang. In 1992, scientists used satellite data from the Cosmic Background Explorer (COBE) to announce that they had evidence of temperature fluctuations in the early Universe that had led to the creation of gravity, allowing matter to clump together and form galaxies, stars and planets. Before, Guth explained, ‘you could choose to believe the thermal spectrum if you wanted to.’ But, he adds, ‘it was pretty easy not to because the data was so scattered.’\n\nThe data made a connection between the beginning of light 13 billion years ago and the origin of matter\n\nGuth remembers that the COBE’s ‘absolutely gorgeous data changed cosmology overnight from being a speculative exercise to a precision science. It really was spectacular.’ David Kaiser, also an MIT physicist who collaborates with Guth, notes how special that moment was back in 1992, when Kaiser was a senior at Dartmouth College and the faculty raised a Champagne toast. ‘It was so unusual – this moment of awe – that these fluctuations had been measured at all, let alone relatively convincingly, let alone in a pattern so consistent with what Alan [Guth] and others had calculated a decade in advance.’ At a lecture at Vassar College in 2016, the Nobel Prize winner John Mather, who led the mission, told the audience (myself included!) that, when the COBE image was revealed, it received a standing ovation, cheers and tears.\n\nMinute fluctuations in the temperature of light in a very young Universe. Courtesy ESA, NASA, JPL-Caltech and the WMAP mission\n\nThe above images display minute fluctuations in the temperature of light from when the Universe was very young. The patterns of slightly hotter (in yellow or orange) and slightly cooler (slightly blue or green) temperatures give evidence to cosmic inflation. The COBE (top left) was just the beginning of cosmology as a ‘precision science’; data from the Wilkinson Microwave Anisotropy Probe (WMAP), launched in 2001 (top right), and the Planck satellite, launched in 2009 (bottom), let astrophysicists describe shape, density, size and rate of expansion of the Universe in ever-increasing detail.\n\nThe profound effects of these data extended beyond the physics community because they helped make a connection between the beginning of light about 13 billion years ago and the origin of matter, the stuff not only of superclusters of galaxies, but of human DNA, a butterfly’s wing, a blue whale. ‘We are in essence formed from little quantum ripples in the sky,’ mused Kaiser. Cosmic inflation links the unfathomably small and swift with the magnificently grand and long-lasting. The bubbling quantum world only a trillionth of a second old scales to the cobwebs of galactic superstructures that developed over billions of years. Reconciling the physical mechanics of two worlds – the quantum and the cosmological – could unlock answers to the future of the Universe and life on worlds beyond Earth.\n\nAs recently as 1992, although Earthlings could see the myriad stars that pricked the night sky and had long dreamed about other worlds beyond Earth, astronomers had not yet confirmed if our Sun was unique in hosting planets. But, as of February 2023, astronomers had detected 5,250 exoplanets, mostly through the Kepler space telescope and the Transiting Exoplanet Survey Satellite (TESS). These telescopes use the transit method, in which an exoplanet crossing the face of its host star causes that star to dim. Astronomers calculate the planet’s diameter, orbital period and temperature – characteristics to evaluate a planet’s Earthliness. As a graduate student in the 1990s, the exoplanet hunter Sara Seager at MIT pioneered a technique to study atmospheres of planets as they transited and were backlit by their star. One goal of JWST is to home in on these atmospheres for potential biosignatures.\n\nThis process is far from straightforward. Even in our own solar system, the methane on Mars is not a biosignature; we haven’t linked ingredients of life to an actual detection of life. This summer, Seager’s team will use the JWST to observe TRAPPIST-1, a system 40 lightyears away. If the astronomers get incredibly lucky, they could speculatively use the JWST’s spectrometer (a device that separates light into distinct wavelengths to determine the atmosphere’s chemicals) to observe the transits, establish the existence of an atmosphere, and infer extant water vapour. ‘That would be a giant milestone: just knowing that there’s one or more rocky planets with water oceans,’ Seager told me. The JWST could offer tantalising hints to life beyond Earth. ‘We might not get there, but we’re the ones who can first really be on the doorstep of actually doing that.’ With the next instrument, scientists might be able to walk through.\n\nThe variety of detections from outer-space telescopes has prompted astronomers to imagine unfamiliar combinations of alien suns and exoplanets where life could be otherwise. The JWST promises to spark at least as many questions about cosmological richness as it attempts to answer. The astrobiologist Sara Walker at Arizona State University told me: ‘We’re realising how little we know about these exoplanets, and how limited our ability to infer, even from very obvious features in atmospheric spectra, other characteristics.’ The JWST will study exoplanetary atmospheres that could be similar in composition to Earth’s (mostly nitrogen and oxygen) but that would be scant evidence for living processes.\n\nThere may be alternative pathways for exoplanets to have developed life, including ones without liquid water\n\nInstead, for Walker, JWST is an instrument that will set the stage for re-perceiving a deeply complex process that results in what we now call life. ‘We’ve had this fixation on looking for the molecules,’ Walker explained, ‘but we need to start looking for a theory of life that is about more than complexity, information or evolution.’ Using Earth as a foil for the extraterrestrial, Walker says: ‘When I characterise our planet as one with life on it, I say that our planet has 4 billion years of acquired memory.’ Successor instruments might go beyond mere spectra to be able to detect causal structures of living processes. ‘We need new ways of seeing,’ she told me, ‘and they may not be the same kinds of technologies of perception we had before.’\n\nPenny Boston, the former director of NASA’s Astrobiology Institute, came to the concept of ‘weird life’ – life as we don’t yet know it – through her work in caves. ‘Caves [often] have a very particular aroma,’ she told me, from microorganisms. Bacteria, archaea, fungi, yeast and ‘other weird things that are perched on borders between these groups’ express the ‘beautiful choreography of an ecosystem … that’s just as perfectly complex as an Amazon rainforest.’ These eclectic ecosystems suggest that there may be alternative pathways for exoplanets to have developed life, including ones without liquid water as a solvent. The JWST data on exoplanetary atmospheres and planet formation, complementary to, or divergent from, Earth’s pathway, could yield a generalised theory of life. ‘Candidate properties can be eventually applied to exoplanets and also other bodies in the solar system.’\n\nThe meaningfulness of JWST data go beyond what new insights might be gained from the images alone. ‘While the images themselves are striking and allow us to look at new things in the Universe, it’s also about the introspective process,’ Walker told me. ‘It’s the fact that we’re part of a physical system, on a tiny planet, that can build a machine that allows us to see so deeply into the Universe that, to me, is the most profound feature of those images.’ Extended external ‘sensibility’ leads to new modes of human self-perception as intelligent, technological, self-conscious Earthlings that are imbricated with, and contributors to, our planet’s ‘acquired memory’.\n\nLeaping from the Moon, our solar system, the Milky Way, to secret pockets of outer space, I have told a story of an expanding universe of knowledge shaded by empirical, social and philosophical reformations. Galileo saw far-flung moons twirling and twinkling around Jupiter, further disrupting ancient cosmologies that placed Earth at the centre of all things. Leavitt’s creation of a cosmic yardstick aided Hubble to evince the vastness of outer space. And astronomers’ use of the Hubble Telescope unveiled unsettling mysteries about the long future of the cosmos.\n\nLast summer, the JWST alighted 1 million miles away from Earth. Astronomers held their breath as NASA engineers sent commands to the telescope to unfurl its tennis court-sized sunshield and puzzle together its aureate, honeycombed-shaped mirrors. Each of the sunshield’s membrane layers are as thin as a human hair. As you read this, photons that have travelled billions of lightyears are streaming onto the JWST’s mirrors, extending the gaze of astronomers to just 100 million years after the Big Bang. They will analyse this ancient light at the edge of time, perhaps to link how black holes might have helped shape galaxies, a question that the Hubble Telescope posed but left unanswered. They tilt the JWST’s mirrors to peer closely at habitable planets, perhaps like Earth – rocky, watery, lively – that extraterrestrial humans might travel to in the future.\n\nAlthough Kant erroneously postulated in the mid-18th century that ‘elevated classes of rational creatures’ inhabited Jupiter and Saturn, his prediction that extraterrestrials exist might not be wrong. By extending, clarifying and amplifying their ability to ‘see’, astronomers have stretched their sensibility to otherworldly objects. Before and after Kant’s writings, detections have shifted humans’ perception of the natures of the Universe and posed further conundrums. We might therefore compare the accumulation of knowledge not to the linear arrow of time moving teleologically but instead to scalar expansion of the Universe; here, like a balloon being filled, each point represents a centre. Each centre point might be lensed by a novel tool of perception, like a spectrometer or prism, to see light differently and illuminate our perception of the cosmos. Such lenses abet ever-changing theories about the stuffs and spacetimes on, and beyond, Earth."
    }
]