[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZpbmV4dHJhLmNvbS9uZXdzYXJ0aWNsZS80Mjk0MS9zYmktZXh0ZW5kcy1yaXBwbGUteHJwLXRvLW5ldy1yZW1pdHRhbmNlLWNvcnJpZG9yc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "SBI extends Ripple XRP to new remittance corridors - Finextra",
        "content": "SBI Remit is using Ripple's XRP for a bank account remittance service to the Philippines, Vietnam and Indonesia.\n\nSBI Remit, part of Asian fintech powerhouse SBI, has been tapping Ripple for its international money transfer service since 2017.\n\n\n\nIn 2021 it began using XRP as a bridge between two fiat currencies to perform cross border remittances from Japan to a digital wallet in the Philippines.\n\n\n\nFrom this month, the effort will be expanded to bank accounts in the Philippines, Vietnam, and Indonesia.\n\n\n\nSBI Remit says that by using XRP as a bridge currency is cuts the cost of pre-funding destination accounts. In addition, the move offers scalability as money can be easily transferred to Ripple’s partners around the world.\n\n\n\n"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMivgFodHRwczovL3d3dy53dGhyLmNvbS9hcnRpY2xlL25ld3MvbG9jYWwvcmlzZW4tcm9sbC1iYWtlcnktY2xvc2luZy1kb3dudG93bi1pbmRpYW5hcG9saXMtYnJvYWQtcmlwcGxlLWxvY2F0aW9ucy1vcGVuaW5nLW5vcmEtcGxhbnMtZm9yLWhhbWlsdG9uLWNvdW50eS81MzEtYzRiMjZhNTktMmRjOS00YjIxLWEwOTItMmQ0MTRmMWJkNjg30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Rise'n Roll Bakery closing downtown Indy and Broad Ripple locations, opening in Nora - WTHR",
        "content": "The bakery said it also plans to open a location in Carmel or Westfield.\n\nExample video title will go here for this video\n\nExample video title will go here for this video\n\nINDIANAPOLIS — Rise'n Roll Bakery is closing two Indianapolis locations, opening one new branch and planning a Hamilton County location as part of a transition announced Thursday.\n\nThe popular Amish-style bakery said it will close its downtown Indianapolis branch, along East New York Street near North Pennsylvania Street, on Saturday, Sept. 16. The location will relocate to the Nora area on Indianapolis' far north side and is scheduled to open by mid-to-late October.\n\n\"The relocation of the downtown store was influenced by the changing landscape of downtown Indianapolis, especially the notable mass departure of office workers from the area,\" the company said in a statement.\n\nWith the move to Nora, Rise'n Roll will also close its Broad Ripple location, citing the close proximity to the new location."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LndydHYuY29tL25ld3MvbG9jYWwtbmV3cy9pbmRpYW5hcG9saXMvZG93bnRvd24vcmlzZS1uLXJvbGwtYmFrZXJ5LXRvLWNsb3NlLWRvd250b3duLWJyb2FkLXJpcHBsZS1sb2NhdGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Rise N' Roll Bakery to close downtown, Broad Ripple locations - WRTV Indianapolis",
        "content": "INDIANAPOLIS — A well-known local bakery will be making some location changes in the coming months that includes the closure of their downtown Indianapolis location and Broad Ripple location.\n\nRise'n Roll Bakery will close its downtown Indy location after service on Saturday.\n\nThe company says the move is part of a strategy that moves them away from what they call a \"changing landscape\" of downtown Indianapolis as there has been a departure of officers workers from the area.\n\nRise'n Roll will also close their Broad Ripple location. That store and the downtown location will be consolidating into a new location in Nora.\n\n\"We recognize the love and support our customers in Broad Ripple and Downtown have shown us over the years. As we shift, our commitment is to ensure that our fans in the northern suburbs continue to have easy access to our award-winning donuts,\" President of franchisee, MCL, Inc. Casey McGaughey said.\n\nWhile consolidating its presence in Nora, Rise'n Roll also plans to venture into Carmel or Westfield. The bakery is actively discussing potential sites in Carmel and Westfield, marking a promising new chapter for the Rise'n Roll brand."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzE0L2JyYWQtZ2FybGluZ2hvdXNlLXNheXMtcmlwcGxlLXdpbGwtZ2V0LTgwLW9mLW5ldy1oaXJlcy1mcm9tLW91dHNpZGUtdGhlLXVuaXRlZC1zdGF0ZXMv0gF7aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDkvMTQvYnJhZC1nYXJsaW5naG91c2Utc2F5cy1yaXBwbGUtd2lsbC1nZXQtODAtb2YtbmV3LWhpcmVzLWZyb20tb3V0c2lkZS10aGUtdW5pdGVkLXN0YXRlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Brad Garlinghouse Says Ripple Will Get 80% of New Hires From Outside the United States - The Daily Hodl",
        "content": "Ripple CEO Brad Garlinghouse says the blockchain-based payments company is seeing more expansive growth outside of the US because of the country’s restrictive stance on crypto.\n\nIn a new interview on Bloomberg Daybreak: Asia, Garlinghouse says the majority of Ripple’s open positions will be filled by people in countries more accommodative to the crypto industry.\n\n“I think it’s super frustrating that you see markets like we have here in Singapore, certainly even what we’re seeing in Hong Kong, the UK and Dubai, where the governments are partnering with the industry and you’re seeing leadership providing clear rules, that you’re seeing growth. That’s why Ripple is hiring there, 80% of our hiring this year is to be outside the United States.”\n\nAs the U.S. Securities and Exchange Commission (SEC) seeks the court’s approval to appeal the groundbreaking ruling that XRP tokens sold to the general public are not securities, Garlinghouse is optimistic that the decision will be favorable to Ripple.\n\n“I said this a long time ago. The facts are on our side and the law is on our side and we’ll continue to prevail in court because of that.”\n\nGarlinghouse says the US may still become the next crypto hub amid the possibility that the regulatory climate in the country will change.\n\n“I wouldn’t say it’s permanently shut. It’s definitely a tough spot. The US is still the largest economy in the world at 22% of global GDP and so we will have a presidential election. There will be a change or maybe there will be a change… I think there’ll be some shift as you see new administrations come in. I think, eventually, Congress will be frankly called to act.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3ZwdWJsaWMub3JnL3NldmVyZS1zaG9ydGFnZS1vZi1za2lsbGVkLXRyYWRlcy1oYXMtcmlwcGxlLWVmZmVjdC1hY3Jvc3MtaG91c2luZy1pbmR1c3RyeS_SAWdodHRwczovL3d2cHVibGljLm9yZy9zZXZlcmUtc2hvcnRhZ2Utb2Ytc2tpbGxlZC10cmFkZXMtaGFzLXJpcHBsZS1lZmZlY3QtYWNyb3NzLWhvdXNpbmctaW5kdXN0cnkvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Severe Shortage Of Skilled Trades Has Ripple Effect Across Housing Industry - West Virginia Public Broadcasting",
        "content": "West Virginians have struggled to find affordable housing for years. The pandemic made things worse as a surge in home sales left builders unprepared. A lack of available housing inventory, and land on which to build, is exacerbated by a severe shortage of laborers and skilled tradesmen to build the houses.\n\nThe shortage of available housing is affecting a disproportionate number of lower income families across the state. But the solution isn’t as simple as building more houses or offering tax incentives for builders.\n\nEd Brady, CEO of the Home Builders Institute – a national nonprofit provider of trade skills training and education for the building industry – said the imbalance of supply and demand has created a confluence of events that are contributing to the problem.\n\n“The need is at crisis levels, we don’t have skilled labor to build the housing, or infrastructure that we need in this country,” Brady said.\n\nEconomic Downturn\n\nDuring the Great Recession, the residential construction industry lost an estimated 1.5 million jobs. Thousands of home builders went out of business. The road to recovery has been a long one. With fewer workers, rising lumber costs and a limited inventory of raw materials, last year took an average of 8 months to build a single-family home. That is the longest since the Census Bureau began collecting data in 1971.\n\nThe Home Builders Institute actively recruits people in the skilled trades through on the job training and no cost pre-apprenticeship training and certification programs. Brady said their partnership with the Home Depot Foundation helps provide programs across the country that began as an outreach to help transitioning military families.\n\n“Now they’re helping us get into high schools,” Brady said. “They’re helping us with organizations like 100 Black Men of America, they’re helping us create academies throughout the country. We need to get industry invested in this movement to get more skilled labor. The opportunity for young people, underserved people is there; we just need the funding to help them find a career path like the rest of the country has.”\n\nThe Home Builders Association of West Virginia has six local associations. They include North Central West Virginia Home Builders Association, Southern West Virginia Home Builders Association, Greater Charleston Home Builders Association, Eastern Panhandle Home Builders Association, Northern Panhandle Home Builders Association and the Mid-Ohio Valley Home Builders Association.\n\nThe association’s president Aaron Dickerson said that the severe labor shortage in skilled residential construction is worse in the state’s rural areas.\n\n“Housing affordability and affordable housing kind of goes hand in hand,” Dickerson said. “And with that, the labor shortage of creating those homes, we’re really trying to draw the manufacturers, the businesses into state but the rural areas where the companies are trying to come to – it is difficult in finding the construction companies and the labor to provide the affordable housing for the individuals who are going to work on those projects and eventually form the skilled labor for those companies.”\n\nAging Workforce\n\nIn 2022, nearly a quarter of skilled tradesmen were 55 or older. For every three tradesmen that retire, there’s just one trained worker waiting to take their position.\n\n“That generation was heavy into the skilled trades and they’re all leaving the workforce, whereas my generation, when I was coming up through school, if you didn’t plan on going to college then you were doing the wrong thing,” Dickerson said. “So you’ve got two generations there that have left the workforce, and it’s created this huge void we are now trying to fill.”\n\nIt’s estimated the U.S. won’t catch up with demand until 2050. By 2030, almost 80 million skilled tradesmen will have retired.\n\nApprenticeships are increasing as manufacturers and other companies associated with the trades partner with organizations like the Home Builders Institute to provide students with the skills, experience and job placement while addressing the industry’s labor shortage.\n\nDickerson said part of the problem is the stigma surrounding manual labor and the emphasis today to earn a college degree.\n\n“We’re trying to get rid of that stigma of walking down the street and parents saying, ‘Well look at that street sweeper, you don’t want to be that person, or look at that plumber, you don’t want to do that,'” Dickerson said. “That stigma of getting your hands dirty isn’t necessarily a bad thing. It’s the old adage that dirty money is a clean money type situation – that you can make a good living wage, and not put yourself in a ton of debt.”\n\nThe Home Builders Association of West Virginia works with tech schools in Marion and Monongalia counties. They also collaborate with the Wood County Vocational Technical Center in Parkersburg. A student chapter through the Mid Ohio Valley Home Builders Association is focused on introducing more young people into the profession.\n\n“Because those students are coming out – that’s the next generation of our workforce – so the more we can be involved with them during the training program, the more we can ensure they are trained in the way we would like to hire somebody.”\n\nHe said national efforts to fill jobs are better funded, but they try to do as much as they can on a local level to make the profession more attractive.\n\nViable Wage\n\n“In the future, your skilled trades are going to be some of your higher paying jobs because less and less people want to do it and that skill just isn’t there like it was handed down generation to generation in the past,” he said. “And that’s where getting rid of that stigma of getting your hands dirty is so important – to let these kids understand that you can go out, get your hands dirty and still provide for your family.”\n\nThe average salary for entry-level sheet metal workers in West Virginia is $56,000. The hourly rate for the men and women who choose to become electricians is $27+ an hour. Carpenters can make up to $31 an hour and up to $64,000 annually.\n\nKent Pauley, state representative to the National Association of Home Builders (NAHB), is a seasoned tradesman and contractor. He said the good news is that today’s skilled laborers are entering the profession at a time of increased job security and better work conditions.\n\n“When I was coming up in the early ’70s, it was very difficult to make a good living, I mean the pay scale,” Pauley said. “I tell the story if I was fired there’d be five people behind me wanting that job. Well, that’s not the case today. We have to pay better, do a better job of taking care of our employees, there’s better insight for job safety than what it used to be.”\n\nImmigration\n\nThe residential construction industry has historically relied on immigrants who make up 30 percent of all positions. This includes Hispanics and people from eastern Europe trained in skills like carpentry, painting, drywall, tile installation, brick masonry and others.\n\nBut with tougher immigration policies, this readily available workforce has shrunk.\n\n“With an immigration policy that restricts the flow of those that are willing to do jobs that sometimes are hard to fill, it causes just another headwind to provide the skilled labor in order to build the housing we need in this country,” Brady said. “Without a good immigration policy, which provides legal free flowing skill to come into the country, we’re going to continue to go in the wrong direction in providing that skilled labor.”\n\nBrady said the industry needs to embrace change.\n\n“We have a huge opportunity to diversify this industry,” Brady said. “It’s traditionally been, quite frankly, white male dominated. You add in the immigrant population, we need to market to women, to people of color and we need to diversify this industry in order to populate the skills that we need.”\n\nAccording to the Home Builders Institute, 723,000 more jobs per year are needed to keep up with demand. That translates to the need for builders to bring on 30 times more new hires than the current pace.\n\nBrady stressed the answer lies in opening the skilled trades to a broader and younger workforce.\n\n“The reason it’s so important to get young people into the industry is we’ve lost a generation or two of giving people the opportunity to explore the industry,” Brady said. “A degree was a mandate out of the high school system. And that hasn’t panned out to be all that productive.”\n\n——\n\nThis story is part of the series, “Help Wanted: Understanding West Virginia’s Labor Force.”"
    }
]