[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9pbXBvcnRhbnQtYmluYW5jZS11cGRhdGUtdGhhdC1jb25jZXJucy1yaXBwbGUteHJwLWhvbGRlcnMv0gFXaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2ltcG9ydGFudC1iaW5hbmNlLXVwZGF0ZS10aGF0LWNvbmNlcm5zLXJpcHBsZS14cnAtaG9sZGVycy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Important Binance Update That Concerns Ripple (XRP) Holders - CryptoPotato",
        "content": "TL;DR\n\nBinance US confirmed the distribution of FLR to eligible XRP holders, with a ratio of 1 XRP = 0.1511 FLR for those holding at least 10 XRP.\n\nDespite the ongoing lawsuit with the SEC, which started three years ago over XRP’s status, Ripple has recently secured three significant partial victories. The final verdict is expected in spring 2024.\n\nThe Japanese cryptocurrency exchange plans to airdrop Flare and Songbird tokens (SGB) to its XRP holders.\n\nThe American subsidiary of the world’s largest cryptocurrency exchange – Binance US – assured that the FlareNetworks airdrop that is supposed to reach eligible XRP holders is “finally here.”\n\nThe marketplace said it has successfully distributed FLR earlier this week to investors with a balance of at least 10 XRP. “If eligible, you should have received FLR tokens at a ratio of 1 XRP = 0.1511 FLR,” it clarified.\n\nThe offering was introduced at the beginning of December, at the same time when the United States Securities and Exchange Commission (SEC) launched a legal battle against Ripple, alleging its sale of XRP was an unregistered securities offering.\n\nThe lawsuit has been ongoing for more than three years as latest developments indicate that the blockchain enterprise has the upper hand. Recall that Ripple has won three major, but yet partial victories, since mid-July and the outcome of the case remains to be resolved in a grand trial scheduled for the spring of 2024.\n\nAnother cryptocurrency exchange that promised a special FLR airdrop to XRP holders is the Japanese GMO Coin. Apart from sending Flare tokens to some of its clients, the company displayed intentions to distribute the yen equivalent of 0.1511 Songbird tokens (SGB) for every 1 XRP held as of December 12, 2020."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9vcGVuLWludGVyZXN0LWZvci1yaXBwbGUteHJwLWNyb3NzZXMtNjAwbS1ob3ctd2lsbC1wcmljZS1yZWFjdC0xMzg0NDkz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Open Interest for Ripple (XRP) Crosses $600M —Will it Move Prices? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3hycC1wcmljZS1wcmVkaWN0aW9uLWJlYXJpc2gtZG93bnR1cm4tcG9zc2libGUtYXMtcmlwcGxlLXdoYWxlcy1zZWxsLTEwMC1taWxsaW9uLXhycC1pbi1hLW1vbnRoLTIwMjMxMDI3MTc1OdIBnwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy94cnAtcHJpY2UtcHJlZGljdGlvbi1iZWFyaXNoLWRvd250dXJuLXBvc3NpYmxlLWFzLXJpcHBsZS13aGFsZXMtc2VsbC0xMDAtbWlsbGlvbi14cnAtaW4tYS1tb250aC0yMDIzMTAyNzE3NTk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Ripple whales selling $55 million worth of XRP in a month could trigger a decline in XRP - FXStreet",
        "content": "XRP price has seen sideways action for the past three days, but indicators suggest the bullishness is waning.\n\nRipple whales have been selling for the past month, dumping nearly $55.2 million worth of XRP.\n\nUS SEC is seeking $770 million to settle the lawsuit against Ripple.\n\nXRP price could see an impact of the move its whales are making, which may not be in the favor of investors. Plus, the altcoin is testing a key support level, and by the look of the indicators, a bearish turnout is not out of the realm of possibility.\n\nDaily Digest Market Movers: Ripple whales move to sell\n\nOver the past month, Ripple whales have been moving their holdings, and between September 26 and October 27, the cohort has managed to reduce their balance by 100 million XRP. The addresses holding between 10 million XRP to 100 million XRP have shed about $55 million worth of XRP, bringing their balance down from 5.36 billion XRP to 5.26 billion XRP.\n\nRipple whale accumulation\n\nXRP price has exhibited a tendency to react according to these addresses' actions in the past – rising when whales accumulate and falling when they sell. Thus, the whales selling their assets hints at potential bearishness wherein the altcoin could decline.\n\nHowever, a lot of the cryptocurrency’s price action is dependent on the outcome of the Securities and Exchange Commission (SEC) vs Ripple lawsuit. According to long-time Ripple proponent John Deaton, there is a chance that the SEC could decide not to take the case to trial after partially losing the ruling in July.\n\nDuring a recent discussion with CryptoLaw, Deaton stated that there is a chance that the SEC could resort to settlement. This was followed by him suggesting that for the same, the regulator could demand about $770 million as the settlement amount.\n\nAlthough this is far from a done deal, a settlement could prevent a decline in XRP price.\n\nTechnical Analysis: XRP price to see red\n\nXRP price is trading at $0.550 at the time of writing after posting sideways candlesticks for the past three days. This was preceded by the altcoin noting a 14.77% increase in the span of seven days.\n\nThe price indicators are now suggesting that this sideways action could lead to a decline in the cryptocurrency. The Moving Average Convergence Divergence (MACD) indicator exhibits waning bullishness on the histogram, although the signal line (red) has yet to cross over the MACD line (blue).\n\nThis occurrence would confirm a bearish crossover, bringing the XRP price to test the support at $0.540, the loss of which would see the altcoin test the 50,100 and 200-day Exponential Moving Averages (EMAs). Falling through them would result in the Ripple token testing $0.505.\n\nXRP/USD 1-day chart\n\nHowever, if the broader market bullish cues persist and XRP price bounces back, given the Relative Strength Index (RSI) is still in the bullish zone, it could begin climbing back up. Reclaiming the resistance at $0.600 would be the next target, and flipping it into support would invalidate the bearish thesis completely."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmRlemVlbi5jb20vMjAyMy8xMC8yNy9lc2tldy1kdW1lei1yaXBwbGUtY29ubmVjdGljdXQtbXVzZXVtLWZsdXRlZC1wcmVjYXN0LXN0b25lLWZhY2FkZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Eskew Dumez Ripple clads museum in fluted precast stone facade - Dezeen",
        "content": "New Orleans-based architecture studio Eskew Dumez Ripple has clad a Connecticut museum with a stone facade reminiscent of local quarries and \"monolithic massing\".\n\nLocated in Greenwich, Connecticut, the Bruce Museum holds a multidisciplinary collection of art, science and natural history exhibits.\n\nEskew Dumez Ripple undertook a comprehensive renovation of the 32,500-square-foot (3,000-square-metre) museum, as well as the addition of a 42,000-square-foot (3,900-square-metre) extension that houses a new public entrance and lobby.\n\nThe extension is affixed directly to the museum's original structure, a Victorian-style home built in 1853 that was publicly deeded to the Town of Greenwich to be a museum by owner Robert Moffat Bruce.\n\nThe rectangular addition more than doubles the size of the existing museum, and besides containing a new welcome centre, will house gallery, exhibition and storage space over three floors.\n\nWith the extension, the studio re-oriented the museum's entrance to face away from nearby 1-95 to neighbouring Bruce Park for a more private experience.\n\nA central courtyard placed between the two buildings was designed to link the spaces them from the interior, as well as to \"extend the park into\n\nthe footprint of the museum\".\n\nThe addition has a fluted stone facade that draws from the surrounding landscape and provides natural daylight.\n\n\"First, the stone quarries that dot the regional landscape became the precept from which to 'carve' the monolithic massing of the building,\" said the team.\n\n\"At night, these cut apertures glow from within, providing a clear beacon to the community of the museum's presence.\"\n\n\"Second, fences built by New England farmers as they cleared their fields of rocks and boulders served as the inspiration for creating voids in the façade to filter light into the interior in a surprising and unexpected way.\"\n\n\"This exterior, animated by the play of light across the façade, dramatically changes appearance as the sun traverses the sky over the course of the day and time of year.\"\n\nThe facade is made of a series of precast pieces hung from a stainless steel frame. According to the team, it creates an airtight and energy-efficient facade capable of reducing the museum's energy demand.\n\nVisitors enter the building through a glazed ribbon of doors and windows. Above the entrance, the facade's stone cladding acts as a screen that covers a central section of glass.\n\nAdditional glazed openings were interspersed throughout the ground floor, with the occasional picture window installed in the building's top-floor gallery spaces.\n\nThe lobby leads to a central wooden staircase that can be traced upwards through double-height spaces and apertures.\n\nGalleries, storage and amenity spaces create wings on either side of the space.\n\nThe museum's top two floors, which contain additional gallery spaces, conference rooms and workshop spaces, connect to the original building through the interior.\n\nOther recently completed projects by Eskew Dumez Ripple include an aquarium and insectarium in New Orleans and a school building in Arkansas informed by surrounding farmland.\n\nThe photography is by Tim Hursley.\n\nProject credits:\n\nArchitecture and interiors: Eskew Dumez Ripple\n\nContractor: Turner Construction\n\nGeotechnical engineer: Melick Tully and Associates\n\nMEPF engineers: Altieri\n\nLandscape: Reed Hilderbrand\n\nLighting: Fisher Marantz Stone\n\nAcoustical engineer: Jaffe Holden\n\nTheatrical/AV: Jaffe Holden\n\nSecurity: Ducibella Venter Santore\n\nFood service: Futch Design Associates\n\nMuseum programming: M. Goodwin Museum Planning\n\nEnvelope: Simpson Gumpertz & Heger\n\nCost estimating: Stuart Lynn\n\nCode consultant: Bruce J. Spiewak, Consulting Architect\n\nOwner’s representative: Stone Harbor Land Company\n\nCommissioning: The Stone House Group"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lm1haW5lcHVibGljLm9yZy8yMDIzLTEwLTI3L3RocmVlLW1hc3Mtc2hvb3RpbmctZGVhdGhzLXJpcHBsZS10aHJvdWdoLXNtYWxsLWxha2VzaWRlLXRvd24tb2Ytd2ludGhyb3DSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Three mass shooting deaths ripple through small lakeside town of Winthrop - Maine Public",
        "content": "School officials have confirmed that three of the victims of Wednesday's mass shootings in Lewiston were connected to the lakeside town of Winthrop, west of Augusta. They include a 14-year-old Winthrop High School student and his father.\n\nThe community is now reeling from the tragedy, and school administrators are working through how to support their students and staff, even as buildings stay closed.\n\nWinthrop Superintendent Jim Hodgkin said the past few days have been devastating for the district. Hodgkin said he first found out that the uncle of a student was killed in Wednesday's shootings, and administrators next learned that 14-year-old Aaron Young, and his father, Bill, were gunned down at Sparetime Recreation.\n\n\"You know, a lot of my administrators, and teachers, that have been on board for a long time, seeing that young man come through the system — very, very well respected, a nice young man,\" Hodgkin said. \"There's that real sad mix of sadness and anger. It's so senseless, what happened. And for all of these innocent victims, to have to experience this and leave our communities dealing, trying to make some sense of it, it's just been really, really hard.\"\n\nAaron's uncle described the high schooler as a \"gentle and thoughtful\" kid who loved bowling and spending time with his dad. Family members said Bill was hardworking, funny, and he and his wife were always the first to lend a hand.\n\nThe chair of the local school board says the killings have \"rocked\" what she describes as a very tight knit community. And Democratic state Rep. Tavis Hasenfus, who grew up in Winthrop, said the ongoing manhunt has made it difficult for residents to find the closure they need.\n\nCourtesy photo via GoFundMe Bill Young (right) and son Aaron (center)\n\n\"Just in my family, our kindergarten daughter asked, 'You know, did they catch them yet?' So I think every family around here knows that there's a crisis going on, and we're all on edge for it,\" Hasenfus said. \"And I think we do need to start the grieving process. And it is hard, when you know that the perpetrator is still at large.\"\n\nSuperintendent Jim Hodgkin said figuring out how to talk through that tragedy with hundreds of students is a huge challenge — particularly as school buildings stay closed.\n\nOn Friday, Winthrop's schools offered \"virtual office hours\" — online meetings for staff, students and parents to talk through their grief with counselors and each other.\n\nAnd Emily Fortin, the district's social worker, said that in recent days, staff have prepared a plan to support students and staff as they return to their classrooms.\n\n\"We realize that right now, we're in a very unique situation, where we've experienced a humongous loss. And yet, we're still dealing with an active crisis. And we know that that brings up a lot of feelings,\" Fortin said.\n\n\"And so our main training so far with staff has been, 'There's no wrong feeling,'\" Fortin adds. \"And that will be our messaging to our students, as well. And that feelings are like waves, and they're going to change constantly. And just to be present and listen to those.\"\n\nOn Monday, the district plans to start classes two hours late in order to give teachers time to meet with crisis teams and discuss how to talk about the killings with their students. Administrators also plan to bring in additional clinicians.\n\n\"I'm not sure there's two hours worth of messaging that we need to provide to them,\" Hodgkin said. \"But I think we, between what we have to say to them, and help them be prepared for students, and just giving them a time to deal with the reality of being with each other, and hugging each other, and just being there, that's going to take the full time.\"\n\nHodgkin said coming to terms with that loss will also take time.\n\n\"Quite a bit of time,\" he said. \"I have no idea how much time. But it will definitely not be, we get back to school, everything will be fine. It won't be that way.\"\n\n"
    }
]