[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMTAvMTcvcmlwcGxlLXZwLXRoZS1wb2xpY3ktY29uc2lkZXJhdGlvbnMtanVzdGlmeWluZy10aGUtaW1wbGVtZW50YXRpb24tb2YtY2JkY3Mv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8xMC8xNy9yaXBwbGUtdnAtdGhlLXBvbGljeS1jb25zaWRlcmF0aW9ucy1qdXN0aWZ5aW5nLXRoZS1pbXBsZW1lbnRhdGlvbi1vZi1jYmRjcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Ripple VP: The Policy Considerations 'Justifying the Implementation of CBDCs' - CoinDesk",
        "content": "When discussing CBDC solutions in theory, one topic that inevitably arises is privacy. But maintaining individuals’ right to privacy will not be as challenging in practice due to the role that commercial banks will play in the CBDC ecosystem. Especially for retail CBDCs, commercial banks will very likely hold users’ wallets — and because those institutions already follow responsible user design through their extensive know-your-customer/anti-money laundering, or KYC/AML, processes, they will be well equipped to help maintain high standards of user privacy while also preventing illicit activity. A trusted third party maintaining custody of retail wallets could also offer additional user confidence, thereby benefiting adoption as well."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvcm9ibG94LXRlYW1zLXVwLXdpdGgtYml0cGF5LXRvLW9mZmVyLXJpcHBsZXMteHJwLWFzLW5ldy1wYXltZW50LW9wdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Roblox Teams Up With BitPay To Offer Ripple's XRP As New Payment Option - Nasdaq",
        "content": "Amid the growing interest in cryptocurrencies in the gaming industry, Roblox (NYSE: RBLX) expanded its in-game purchases payment method to include Ripple’s XRP.\n\nWhat Happened: With more than 200 million active users and 65.5 million daily active users, Roblox will now include Ripple (CRYPTO: XRP) as one of its payment methods for in-game purchases, subscriptions, and transactions. The news was announced by BitPay on its X account.\n\nNews Alert 📰@Xsolla now accepts XRP(@Ripple) with BitPay as a payment method for their games, such as @Smitegame and @Roblox. You can use your favorite cryptocurrency to buy, play, and enjoy gaming like never before.#BitPay #crypto #Smite #Xsolla #Roblox pic.twitter.com/NAg2EyOVGM\n\n— BitPay (@BitPay) October 17, 2023\n\nLearn more about how the gaming industry is opening doors to the crypto sector to expand its horizons. Meet and engage with other transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event: Future of Digital Assets. Tickets are flying: Get yours!\n\nRead Next: How Today's Gaming Industry Intertwines With Blockchain, Crypto, NFTs, Tokenization\n\nLos Angeles-based Xsolla is the platform for managing Roblox’s in-game payments, while BitPay is a cryptocurrency payment processor. Both companies have collaborated to streamline the connection between Roblox and various crypto wallets, Cointelegraph reports.\n\nThe service will be available on Windows, macOS, Android, iOS, Xbox One, and PlayStation 4.\n\nIn September 2023, both companies joined hands to introduce PayPal USD (PYUSD) payments for merchants and consumers. In August 2023, Xsolla teamed up with Crypto.com, a cryptocurrency exchange and payment platform, to integrate the latter’s checkout solution into the former’s Pay Station platform, thereby making it easy for gamers to make payments in crypto, Decrypt reported.\n\nWhy It Matters: Roblox allows users to design and participate in games made by their peers, and it's particularly popular among children and teenagers. The user base of Roblox is 44% under 13 years of age, thereby exposing a younger target audience to cryptocurrency. Notably, In Q1 2023, Roblox users reported around $773 million in its in-game spending.\n\nOn the other hand, Ripple is best known for its fast transaction speeds and low fees, thereby attracting players to leverage the speed and cost-effectiveness of XRP and simultaneously enhance the gaming experience. The token also has a wide global presence and thus will be available to players across regions.\n\nAlso Read: Epic Games, Zynga, EA, Activision, Google Veterans Drive Onchain Gaming With Proof Of Play's $33M Funding\n\nBenzinga's Future of Digital Assets conference is scheduled for Nov. 14. Attend and learn more about the benefits of widening the in-house gaming payments system to crypto. The gathering is seen as pivotal for the digital assets community. The event will spotlight the latest trends, innovations, and challenges in the digital asset realm.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvcm9ibG94LXRlYW1zLXVwLXdpdGgtYml0cGF5LXRvLW9mZmVyLXJpcHBsZXMteHJwLWFzLW5ldy1wYXltZW50LW9wdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Roblox Teams Up With BitPay To Offer Ripple's XRP As New Payment Option - Nasdaq",
        "content": "Amid the growing interest in cryptocurrencies in the gaming industry, Roblox (NYSE: RBLX) expanded its in-game purchases payment method to include Ripple’s XRP.\n\nWhat Happened: With more than 200 million active users and 65.5 million daily active users, Roblox will now include Ripple (CRYPTO: XRP) as one of its payment methods for in-game purchases, subscriptions, and transactions. The news was announced by BitPay on its X account.\n\nNews Alert 📰@Xsolla now accepts XRP(@Ripple) with BitPay as a payment method for their games, such as @Smitegame and @Roblox. You can use your favorite cryptocurrency to buy, play, and enjoy gaming like never before.#BitPay #crypto #Smite #Xsolla #Roblox pic.twitter.com/NAg2EyOVGM\n\n— BitPay (@BitPay) October 17, 2023\n\nLearn more about how the gaming industry is opening doors to the crypto sector to expand its horizons. Meet and engage with other transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event: Future of Digital Assets. Tickets are flying: Get yours!\n\nRead Next: How Today's Gaming Industry Intertwines With Blockchain, Crypto, NFTs, Tokenization\n\nLos Angeles-based Xsolla is the platform for managing Roblox’s in-game payments, while BitPay is a cryptocurrency payment processor. Both companies have collaborated to streamline the connection between Roblox and various crypto wallets, Cointelegraph reports.\n\nThe service will be available on Windows, macOS, Android, iOS, Xbox One, and PlayStation 4.\n\nIn September 2023, both companies joined hands to introduce PayPal USD (PYUSD) payments for merchants and consumers. In August 2023, Xsolla teamed up with Crypto.com, a cryptocurrency exchange and payment platform, to integrate the latter’s checkout solution into the former’s Pay Station platform, thereby making it easy for gamers to make payments in crypto, Decrypt reported.\n\nWhy It Matters: Roblox allows users to design and participate in games made by their peers, and it's particularly popular among children and teenagers. The user base of Roblox is 44% under 13 years of age, thereby exposing a younger target audience to cryptocurrency. Notably, In Q1 2023, Roblox users reported around $773 million in its in-game spending.\n\nOn the other hand, Ripple is best known for its fast transaction speeds and low fees, thereby attracting players to leverage the speed and cost-effectiveness of XRP and simultaneously enhance the gaming experience. The token also has a wide global presence and thus will be available to players across regions.\n\nAlso Read: Epic Games, Zynga, EA, Activision, Google Veterans Drive Onchain Gaming With Proof Of Play's $33M Funding\n\nBenzinga's Future of Digital Assets conference is scheduled for Nov. 14. Attend and learn more about the benefits of widening the in-house gaming payments system to crypto. The gathering is seen as pivotal for the digital assets community. The event will spotlight the latest trends, innovations, and challenges in the digital asset realm.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvcm9ibG94LXRlYW1zLXVwLXdpdGgtYml0cGF5LXRvLW9mZmVyLXJpcHBsZXMteHJwLWFzLW5ldy1wYXltZW50LW9wdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Roblox Teams Up With BitPay To Offer Ripple's XRP As New Payment Option - Nasdaq",
        "content": "Amid the growing interest in cryptocurrencies in the gaming industry, Roblox (NYSE: RBLX) expanded its in-game purchases payment method to include Ripple’s XRP.\n\nWhat Happened: With more than 200 million active users and 65.5 million daily active users, Roblox will now include Ripple (CRYPTO: XRP) as one of its payment methods for in-game purchases, subscriptions, and transactions. The news was announced by BitPay on its X account.\n\nNews Alert 📰@Xsolla now accepts XRP(@Ripple) with BitPay as a payment method for their games, such as @Smitegame and @Roblox. You can use your favorite cryptocurrency to buy, play, and enjoy gaming like never before.#BitPay #crypto #Smite #Xsolla #Roblox pic.twitter.com/NAg2EyOVGM\n\n— BitPay (@BitPay) October 17, 2023\n\nLearn more about how the gaming industry is opening doors to the crypto sector to expand its horizons. Meet and engage with other transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event: Future of Digital Assets. Tickets are flying: Get yours!\n\nRead Next: How Today's Gaming Industry Intertwines With Blockchain, Crypto, NFTs, Tokenization\n\nLos Angeles-based Xsolla is the platform for managing Roblox’s in-game payments, while BitPay is a cryptocurrency payment processor. Both companies have collaborated to streamline the connection between Roblox and various crypto wallets, Cointelegraph reports.\n\nThe service will be available on Windows, macOS, Android, iOS, Xbox One, and PlayStation 4.\n\nIn September 2023, both companies joined hands to introduce PayPal USD (PYUSD) payments for merchants and consumers. In August 2023, Xsolla teamed up with Crypto.com, a cryptocurrency exchange and payment platform, to integrate the latter’s checkout solution into the former’s Pay Station platform, thereby making it easy for gamers to make payments in crypto, Decrypt reported.\n\nWhy It Matters: Roblox allows users to design and participate in games made by their peers, and it's particularly popular among children and teenagers. The user base of Roblox is 44% under 13 years of age, thereby exposing a younger target audience to cryptocurrency. Notably, In Q1 2023, Roblox users reported around $773 million in its in-game spending.\n\nOn the other hand, Ripple is best known for its fast transaction speeds and low fees, thereby attracting players to leverage the speed and cost-effectiveness of XRP and simultaneously enhance the gaming experience. The token also has a wide global presence and thus will be available to players across regions.\n\nAlso Read: Epic Games, Zynga, EA, Activision, Google Veterans Drive Onchain Gaming With Proof Of Play's $33M Funding\n\nBenzinga's Future of Digital Assets conference is scheduled for Nov. 14. Attend and learn more about the benefits of widening the in-house gaming payments system to crypto. The gathering is seen as pivotal for the digital assets community. The event will spotlight the latest trends, innovations, and challenges in the digital asset realm.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnVzY2NiLm9yZy9uZXdzLzIwMjMvcmlwcGxlLWVmZmVjdC1kZWxlZ2F0ZXMtZGlzY3Vzcy1zeW5vZC1pbXBhY3QtYmV5b25kLWNhdGhvbGljaXNt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Ripple effect: Delegates discuss synod impact beyond Catholicism - USCCB",
        "content": "VATICAN CITY (CNS) -- Seated among cardinals, bishops, priests, religious sisters and lay Catholic leaders, 12 representatives from other Christian communities are listening and weighing in on discussions about the future of the Catholic Church.\n\n\"Fraternal delegates,\" as they are called in the Vatican's list of participants in the assembly of the Synod of Bishops, have been present in previous synods, yet at the synod on synodality these representatives from across Christianity are thrust into heart of a global conversation about how a church different from their own can better listen and speak to its members.\n\nCatholic News Service spoke with several of the fraternal delegates during the first two weeks of the Oct. 4-29 Vatican meeting, with many expressing both surprise at the Catholic Church's willingness to experiment with practices more typical of other Christian communities and hope that its impact will extend beyond Rome.\n\n\"I think the Roman Catholic Church is trying to learn from the experience of other Christian churches, and this is I think the point of why they have invited us to participate in this meeting, not only as observers but also as people to whom they are giving the right to speak and share their experiences,\" Orthodox Metropolitan Job of Pisidia, a representative of the Ecumenical Patriarchate of Constantinople, told CNS. Orthodox Metropolitan Job of Pisidia poses for a photo outside the Paul VI Audience Hall at the Vatican after a session of the assembly of the Synod of Bishops Oct. 10, 2023. (CNS photo/Justin McLellan)\n\nThe metropolitan addressed the synod assembly Oct. 9 and explained that the understanding of a synod in the Orthodox Church differs greatly from what Pope Francis is proposing, since an Orthodox synod makes final decisions and \"implies exclusively an assembly of bishops.\" The Catholic Church's synod on synodality, where non-bishops are voting members, is more like the consultative clergy-laity meetings common in the Orthodox Church, conducted before final decisions are taken by a group of bishops, he said.\n\n\"Maybe this responds to a crisis that the bishops do not listen enough to their people, are not representative enough of their church, perhaps they are disconnected,\" Metropolitan Job told CNS. \"We also have the same issue in our churches that some laity want to be more heard, so we are facing more or less the same issues and therefore I think it's very important that we learn from each other.\"\n\nWhile synodality in the Orthodox Church uses as its model the Council of Nicea in 325, the General Synod of the Church of England was instituted in 1970 and does include bishops, clergy and laity.\n\nSimilar to the Orthodox, however, \"in the Church of England, the word 'synod' has much greater emphasis on its legislative as well as its deliberative functions,\" Anglican Bishop Martin Warner of Chichester, England, told CNS. \"That's very different from this much more consultative synodal process,\" in which what is stressed is \"the primacy of the Holy Spirit, the fundamental importance of listening to each other, as opposed to establishing debate about a proposition.\"\n\nThe synod on synodality, he said, \"models a very different approach, and I think a very fruitful one that can be positive for the church as she faces immensely delicate, sensitive questions.\" Members of the assembly of the Synod of Bishops pray before a working session of the assembly of the Synod of Bishops in the Vatican's Paul VI Audience Hall Oct. 17, 2023. (CNS photo/Lola Gomez)\n\nThrough the active participation of fraternal delegates in synod discussions, Bishop Warner said, comes the understanding that \"ecumenical relations are no longer about one church giving another ecclesial body marks out of 10 for its character,\" but rather asking \"can we understand each other? What are the gifts that you have that you give to us? What are the gifts that we have that we can share with you?\"\n\nThe ecumenical significance of the synod assembly was highlighted in the pope's choice to begin the monthlong meeting at the Vatican with a prayer vigil in St. Peter's Square Sept. 30 that brought together the leaders of 12 Christian churches and communities, including Orthodox Ecumenical Patriarch Bartholomew of Constantinople and Anglican Archbishop Justin Welby of Canterbury.\n\nArchbishop Khajag Barsamian, the Armenian Apostolic Church's representative to the Vatican, said that gesture was \"a message that the Catholic Church is open to other denominations in this synodal system.\"\n\n\"Through this synod, the attitude of the Catholic Church, I believe, will change,\" he said. \"Already, there are bishops, including the pope himself, some priests who have been very welcoming toward other denominations, so hopefully this process will also open people, priests, bishops, to welcoming other denominations.\"\n\nYet engaging other denominations does not mean \"boiling everything down to the least common denominator,\" Elizabeth Newman, chairperson of the Baptist World Alliance Commission on Christian Unity, told CNS. Elizabeth Newman, chairperson of the Baptist World Alliance Commission on Christian Unity, poses for a photo outside the Paul VI Audience Hall at the Vatican after a session of the assembly of the Synod of Bishops Oct. 13, 2023. (CNS photo/Justin McLellan)\n\nNewman noted that her invitation to participate in the synod on synodality is a sign that \"most of the leadership of the Catholic Church wants to know ways to engage Baptists and other Protestants in a way that's faithful to the Catholic identity\" on modern issues facing Christianity at large such as declining church attendance in the West. \"You probably would not have had a woman Baptist theologian at Vatican II, so that has shifted,\" she said.\n\nThe Rev. Jong Chun Park, president of the World Methodist Council, said that although the Catholic Church is \"catching up\" to other Christian communities in listening to the laity, \"at the same time it may give us a new path, because primacy and synodality could be well-balanced to give a good model even for Methodists.\"\n\nIn the Methodist discussions, known as holy conferencing, \"we do the decision-making and -taking at the same time,\" he said, whereas in the Catholic Church's synod, discussions are held among all while final decisions are made by the pope. \"That can give you a sense of order, a sense of authority, but in the Methodist tradition and other Protestant denominations, the sense of order and authority is sort of diluted, because the popular voice, the majority, rules,\" said Rev. Park.\n\n\"We need to recover the sense of ecclesial leadership,\" he said. \"The success of this synod on synodality has great implications for the future church, not only for the Petrine Catholic Church but also for us Evangelical Catholic Churches and other forms of ecclesial communities.\""
    }
]