[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmxhdWdoaW5ncGxhY2UuY29tL3cvbmV3cy8yMDIzLzA4LzIwL2pvZmZyZXlzLXdvcmxkLXByaW5jZXNzLXdlZWstcmlwcGxlLWFydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "Joffrey's Coffee at Disney Springs Offering Disney Princess Ripple Art for World Princess Week - LaughingPlace.com - Laughing Place",
        "content": "Joffrey’s Coffee is celebrating World Princess Week with a special selection of Disney Princess ripple art.\n\nWhat’s Happening:\n\nMore World Princess Week:\n\nWorld Princess Week coverage is presented by Entertainment Earth — Get 10% off on in-stock items and Free Shipping on orders $79+ at"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lmd1bHRlLmNvbS9tb3ZpZW5ld3MvMjU1Mzg4L3lvdW5nLWhlcm9pbmVzLWJtdy1jYXItY3JlYXRlcy1yaXBwbGVzLWluLWZpbG0tbmFnYXLSAV9odHRwczovL3d3dy5ndWx0ZS5jb20vbW92aWVuZXdzLzI1NTM4OC95b3VuZy1oZXJvaW5lcy1ibXctY2FyLWNyZWF0ZXMtcmlwcGxlcy1pbi1maWxtLW5hZ2FyL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "Young Heroine’s BMW Car Creates Ripples In Film Nagar - Gulte",
        "content": "Recently a young heroine has scored a blockbuster in the Telugu film industry and became the talk of the town. While her next film details are yet to come out, it is her lifestyle that is currently being discussed everywhere.\n\nApparently, she turned up in a BMW 5-series luxury car the other day, and that led to the opening up of pandoras box regarding her lifestyle.\n\nSome say that she has received terrific advances from the film industry and that is the reason she bought a BMW car first.\n\nHowever, few added that she got close to a big producer, and that producer has actually given the luxury car for daily commuting.\n\nThe heroine hails from a middle-class family and used to commute on a bike before the release of her film. Perhaps this big shift in the vehicle she is using is actually leading to all such discussions.\n\nOn the other hand, film lovers say that when young heroes who just score one success at the box office usually buy Range Rovers and Merc SUVs and none talks big about it. Well, the kind of success this heroine has seen is quite big so definitely she will is worthy of buying such a luxury beast.\n\nTags Heroine\n\nYoutube Shorts ❮ ❯"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzA4LzIwL2Rhbm55LW1leWVyLXJlc3RhdXJhbnRzLWNsb3NpbmctdGhlLWxhdGVzdC1ibG93LWZyb20tbnljLW1pZ3JhbnQtY3Jpc2lzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "Danny Meyer restaurants closing the latest blow from NYC migrant crisis - New York Post",
        "content": "In a warning of bigger trouble ahead for the city, Danny Meyer is closing two of his eateries in a secondary impact from the migrant crisis.\n\nSpecifically, they’re located in the historic Redbury Hotel, which has opted to become a migrant shelter.\n\n“While we admire and respect the Redbury’s decision, the viability of our business relies significantly on hotel-related F&B operations, including event venues and the lobby bar, spaces that are now unavailable for our use,” explained Meyer’s Union Square Hospitality Group.\n\nOops: It had earlier insisted otherwise, but later realized that restaurants still recovering from the pandemic lockdowns need tourists and the kind of vibrant local scene that a shelter discourages.\n\nMeyer says he’s still “fully supportive” of the Redbury serving as a shelter and will keep advocating for “policy change that expedites work permits for asylum seekers.”\n\nBut dozens of restaurant workers are headed to the unemployment line.\n\nThis kind of loss comes on top of the billions that Mayor Eric Adams warns the crisis will cost the city, and beyond any resulting cuts in city services.\n\nDanny Meyer says he’s still “fully supportive” of the Redbury serving as a shelter and will keep advocating for “policy change that expedites work permits for asylum seekers.” Robert Miller\n\nTurning hotels into shelters crowds out tourists; packing ‘hoods full of migrants discourages normal business activity.\n\nA city struggling to bounce back fully from lockdown, with countless workers still at least partly remote and commercial real-estate (and construction) ailing, will suffer more and more of ripple effects as long as the influx continues.\n\nMeyers closed two of his eateries in a secondary impact from the migrant crisis. Patrick McMullan via Getty Image\n\nAnd President Joe Biden isn’t remotely stopping the tide: El Paso is as overwhelmed as ever, The Post’s MaryAnn Martinez reports, while Biden is selling off border-wall supplies to avoid having to make it any harder to sneak in.\n\nEx-Gov. David Paterson has it right: If Biden doesn’t reverse course, he’s courting a nationwide urban revolt."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdGhlcGF0cmlvdC5pbi9saXN0aWNsZS9yaXBwbGVzLW9mLXJlZmxlY3Rpb24tc29sby1hcnQtZXhoaWJpdGlvbi0zOTQxNdIBUmh0dHBzOi8vdGhlcGF0cmlvdC5pbi9saXN0aWNsZS9yaXBwbGVzLW9mLXJlZmxlY3Rpb24tc29sby1hcnQtZXhoaWJpdGlvbi0zOTQxNS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "Ripples of Reflection: Solo art exhibition - The Patriot",
        "content": "Through her brush and a vivid use of colours, Nikita has attempted, to capture the essence of the sacred city, its spirituality and the interplay of light and shadows, the myriad hues and the dynamic aura along the banks of the Ganges.\n\nKolkata-based artist Nikita Agarwal will present her work at the exhibition, ‘Ripples of Reflection’, at Open Palm, India Habitat Centre between September 1-4. The central theme of her paintings is reflection of Varanasi as both an old world charm and the spirit of modernity.\n\nHer work delves into the journey of the human mind through art. Her paintings beautifully portray the abstract paintings of Varanasi.\n\nThrough her brush and a vivid use of colours, Nikita has attempted, to capture the essence of the sacred city, its spirituality and the interplay of light and shadows, the myriad hues and the dynamic aura along the banks of the Ganges.\n\nThe artist has a degree in business management from MATS university and a diploma in Fashion Designing from NIFT dabbles in producing eclectic mixed media art form pieces on canvas. Most of her work has spirited use of colour, including soft and robust shades.\n\n“I start with sketching on paper and once I’m convinced of my vision I move on to the canvas. I enjoy working with different colour palettes to bring the artwork to life. However, creativity is something that can hit you at any point of time and when that happens, I like to follow my artistic instincts and manoeuvre the final output on canvas,” she said.\n\nA hobby that grew up to become a passion. Nikita is a self-trained and self-taught artist who started her journey way back and has not looked back since then. For her, art is a form of expression and a let out for her emotions.When she is not painting, she is engrossed in another of her soul food, Yoga that is.\n\n“It was one of the earliest things about my mother that fascinated me.” She reminisces, “yoga isn’t just a word but an emotion for me. A string that connects me to my fifteen year old self because that’s when I began my journey into its magnificence. Coming to the present, it is both the source of energy and tranquillity that drives my being. Each day, I learn to embrace a better version of myself as I indulge in the mindfulness that comes with yoga.\n\nThis will be her first solo exhibition in the capital.\n\nWhen: 11am – 7pm, September 1 – 4\n\nWhere: Open Palm, India Habitat Centre, Lodhi Road"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5waXF1ZW5ld3NtYWdhemluZS5jb20vb3Bpbmlvbi93aGlzdGxlci10aGUtb3V0c2lkZS1yZW1lbWJlcmluZy1jYW1wYmVsbC1yaXZlci1iYy11bmRlcndhdGVyLW1vdW50YWluLXJpcHBsZS1yb2NrLTc0MjczMzHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "The Outsider: Remembering BC's Ripple Rock - Pique Newsmagazine",
        "content": "Ripple Rock claimed at least 114 lives before the underwater mountain near Campbell River was blown up in 1958\n\nThe closest I've ever been to an explosion was a mining engineering field trip at university. My class piled into a bus bound for a rural Queensland coal mine and spent the day observing the mine’s operations, mostly watching big equipment rolling around from a safe distance. But our professor knew what would give us all a story to take home, so he timed our visit with the day’s blast. We watched from about a kilometre away, and saw the smoke and debris cloud as the ground shock wave reached us. We heard the blast moments later.\n\nMy career could have steered towards blowing up the ground in Australian mines, but I ended up in B.C. instead. And it was while visiting its picturesque coast I learned about one of the largest non-nuclear explosions in Seymour Narrows 65 years ago; the destruction of the underwater mountain known as Ripple Rock.\n\nBefore I get to the very big blast, a bit of history and geographic context is needed. Seymour Narrows is a 5.1-kilometre stretch of Discovery Passage which connects the Strait of Georgia with Johnstone Strait and the northern coast of Vancouver Island. The two peaks of Ripple Rock were just 2.74 metres and 6.4 metres below the surface, respectively (at low tide), allowing strong tidal currents to create large and very dangerous eddies. Captain George Vancouver himself described the Seymour Narrows as “one of the vilest stretches of water in the world,” and he was right.\n\nRipple Rock claimed its first victim in 1875, sinking the sidewheel steamer USS Saranac. Over the next 80 years or so, Ripple Rock would claim at least 114 lives by sinking more than 20 large vessels and at least 100 small vessels. The same stretch now will see several cruise ships a day bound for Alaska without issue. At high tide, of course.\n\nRecommendations by marine commissions called for the rock’s removal as early as 1931, but it wasn’t until 1942 that authorization was finally given to blow the thing up. The removal had its opponents, but not for preservation or cultural reasons. People wanted Ripple Rock to serve as support for a railway bridge to connect Vancouver Island to the mainland. Making passage safer for ships was given a higher priority.\n\nThe initial attempts to remove the rock in the 1940s were unsuccessful. A drilling barge was floated over the rock with 3.8-centimetre- diameter steel cables attached to six concrete anchors totalling 998 tonnes. The plan was to drill into the rock from above and use explosives to smash away at it, bit by bit. Ripple Rock wasn’t having it. The violent waters broke a steel cable an average of once every 48 hours.\n\nA second attempt with the drill barge was to suspend overhead steel cables over Seymour Narrows to hold the barge in place.\n\nThe turbulent waters once again sent the drilling barge on its way with only 149 holes drilled (of the 1,500 or so needed) and the contract was terminated.\n\nA few years later, Canada’s National Research Council gauged the feasibility of tunnelling into Ripple Rock from underneath. This is when the consulting engineers got crafty. They enlisted hard rock miners to dig a vertical shaft on nearby Maude Island (off the western edge of Quadra Island) and about 75 men worked three shifts a day around the clock, the miners advancing an average of 1.8 metres per day to complete the 174-metre- deep shaft. They then slowly and meticulously tunnelled 762 metres under the narrows to reach Ripple Rock from below. Two 91-metre- high tunnels were then dug vertically into the heart of the rock, with a series of “coyote” tunnels shooting out horizontally.\n\nMore than a thousand tonnes of Nitramex 2H (the most advanced TNT explosive at the time) were packed into those tunnels. Rumours had circulated that nearby Campbell River would be flattened in the blast, and the shock wave would cause a tsunami that would damage the Japanese coast. Millions of fish and whales would die, they said. Local residents were instructed by authorities to open all their windows to avoid the shock wave shattering them.\n\nWhen the big red button was finally pushed, on April 5, 1958, the blast hurled 635,040 tonnes of water and rock more than 304 metres into the air, causing a 7.6-metre tsunami that quickly dissipated. The Fisheries Department confirmed that five orcas, a school of porpoises, two sea lions and one fur seal spotted in the area before the explosion were all seen again after the dust had settled.\n\nThe largest non-nuclear blast in the world at the time was one of the first national live coverage events by the CBC. Even a handful of British atomic weapons researchers were sent to observe the explosion. The destruction of Ripple Rock is remembered as one of Canada’s modern engineering marvels.\n\nVince Shuley is fascinated by large, non- violent explosions. For questions, comments or suggestions for The Outsider email vince.shuley@ gmail.com or Instagram @whis_vince."
    }
]