[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdS50b2RheS9yaXBwbGUtY3RvLWRhdmlkLXNjaHdhcnR6LXNoYXJlcy10aW1lbGluZS1mb3ItdG9rZW5pemF0aW9uLW9uLXhycGzSAVZodHRwczovL3UudG9kYXkvcmlwcGxlLWN0by1kYXZpZC1zY2h3YXJ0ei1zaGFyZXMtdGltZWxpbmUtZm9yLXRva2VuaXphdGlvbi1vbi14cnBsP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Ripple CTO David Schwartz Shares Timeline for Tokenization on XRPL - U.Today",
        "content": "Advertisement\n\nXRP Ledger, one of the oldest blockchains and the native platform of the XRP cryptocurrency, is a perfect technical basis for tokenized real-world assets. Ripple CTO indicated its benefits and shared his estimations of the first RWA projects to go live on the XRPL mainnet.\n\n\"Next year, year and half\": Ripple CTO on XRPL tokenization timeline\n\nReal-world asset (RWA) tokenization projects might launch on XRP Ledger in the next year or year and a half. This statement was made by Ripple CTO David Schwartz on a video shared by the Flip The Chain team yesterday, Oct. 13, 2023.\n\n🚨🚨🔥#Ripple #DavidSchwartz - \"Tokenization on #XRPL shall start in year and half in real world\" Hear the claps (Video in the thread)\n\nWhat does that mean for #XRP?\n\n1/2 pic.twitter.com/6X3MmPrQ1O — Flip The Chain (@flipthechain) October 13, 2023\n\nXRP Ledger can be a good platform for tokenization protocols to launch on thanks to low transactional fees and seamless integration with on-chain exchange mechanisms.\n\nWhile interacting with real-world assets, users are particularly interested in being able to buy them, sell, store and transfer without relying on fiat currencies like the U.S. dollar, Schwartz stressed. As such, XRPL DEXes will provide the necessary level of proximity for all market actors.\n\nAs such, first viable RWA protocols on XRP Ledger might kick off as soon as in 2024 or early 2025. Crypto Twitter enthusiasts supposed that Gold and real estate might be the first assets to have their virtual \"avatars\" running on XRP Ledger.\n\nAs covered by U.Today previously, RWAs and the protocols involved in their operations were among the hottest crypto narratives for 2023.\n\nNew DeFi designs coming to XRP Ledger?\n\nMeanwhile, the XRP Ledger community is waiting for validators' verdict on the activation of the XLS-30d \"XRPL AMM\" proposal. If passed, it might add seamless non-custodial exchange functionality to XRP Ledger, making it another DeFi blockchain.\n\nAt the same time, so far, the proposal sees too little support from the community. By printing time, only two validators — Ripple itself and katczynski.net — supported the inclusion of the proposal into the rippled v1.12.0 release.\n\nThis proposal needs 26/33 votes to pass. So far, it has only accomplished 3.03% of the necessary voting power. Another major amendment \"Clawback,\" which is crucial for XRPL to stay regulatory compliant, received 15.5% support, or five \"yays\" from validators."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vcmlwcGxlLXhycC1oZWRlcmEtaGJhci1zdGVsbGFyLXhsbS1hbmQtY2FyZGFuby1hZGEtYXJlLWlzby0yMDAyMi1jb21wbGlhbnQtYW5kLXJlYWR5LXRvLWNvbnF1ZXItdHJpbGxpb24tZG9sbGFyLW1hcmtldC1hbmQtY29vcGVyYXRlLXdpdGgtY2VudHJhbC1iYW5rcy_SAcABaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3JpcHBsZS14cnAtaGVkZXJhLWhiYXItc3RlbGxhci14bG0tYW5kLWNhcmRhbm8tYWRhLWFyZS1pc28tMjAwMjItY29tcGxpYW50LWFuZC1yZWFkeS10by1jb25xdWVyLXRyaWxsaW9uLWRvbGxhci1tYXJrZXQtYW5kLWNvb3BlcmF0ZS13aXRoLWNlbnRyYWwtYmFua3MvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Ripple (XRP), Hedera (HBAR), Stellar (XLM), and Cardano (ADA) Are ISO 20022-Compliant and Ready to Conquer Trillion-Dollar Market and Cooperate with Central Banks - Crypto News Flash",
        "content": "Financial institutions, including banks and crypto companies, are likely to benefit significantly from the adoption of ISO 20022.\n\nISO-compliant cryptocurrencies could gain approval from central banks, potentially facilitating crypto payments and increasing integration with traditional financial systems like Visa and MasterCard.\n\nAs the adoption of cryptocurrencies continues to grow across the world, more and more digital assets are becoming part of the ISO 20022 crypto list. The latest to join this list are some of the top altcoins like Ripple (XRP), Hedera (HBAR), Stellar (XLM), and Cardano (ADA).\n\nThe ISO 20022 crypto-list comprises digital coins and tokens that adhere to the International Organization for Standardization (ISO) standards 20022. Also, these ISO 20022-compliant cryptocurrencies are likely to become part of a new financial system. Furthermore, speculations are that these cryptocurrencies may experience a significant price surge upon the full implementation of this standard.\n\nISO 20022 stands as a globally recognized protocol that offers a secure and standardized means of exchanging financial messages among entities in the payment industry. It aims to replace the aging SWIFT financial messaging system, which has been the backbone for global payments in the banking and financial sector for over half a century.\n\nAlso, this standard effectively addresses the requirement of financial service organizations aiming to establish a universally accepted messaging language. This common language permits them to integrate their business procedures and engage in seamless collaboration with their partners on a unified platform.\n\nFinancial institutions including banks, cryptocurrency companies, and stock brokers will reap substantial benefits from the adoption of ISO 20022.\n\nISO 20022-Compliant Cryptocurrencies\n\nA cryptocurrency that adheres to the ISO 20022 standard stands a chance to gain approval from a central bank, thereby facilitating crypto payments. The adoption of ISO-compliant crypto identifiers will further revolutionize the utilization of cryptocurrencies.\n\nFurthermore, should ISO provide an official code for cryptocurrencies, such as Bitcoin or Ether (ETH), these digital assets will find their place in the databases of leading financial institutions like Visa and MasterCard.Currently, there are nine cryptocurrencies that are ISO 20022-compliant. However, for now, we will be looking at the four mentioned above."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9tYXNzaXZlLXBvdGVudGlhbC1haGVhZC1mb3ItcmlwcGxlLXhycC1hcy1hZG9wdGlvbi1pcy1zdGlsbC1pbi1pdHMtZWFybHktc3RhZ2UtcmVwb3J0L9IBc2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9tYXNzaXZlLXBvdGVudGlhbC1haGVhZC1mb3ItcmlwcGxlLXhycC1hcy1hZG9wdGlvbi1pcy1zdGlsbC1pbi1pdHMtZWFybHktc3RhZ2UtcmVwb3J0Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Massive Potential Ahead for Ripple (XRP) as Adoption is Still in its Early Stage: Report - CryptoPotato",
        "content": "TL;DR\n\n\n\nRecent data suggests XRP adoption is still in early stages, with over 3.6 million wallets holding less than 500 XRP; around 17% of total XRP wallets (4.8 million) were created since the start of 2023, indicating rising interest.\n\nLarge investors, or “whales,” have been accumulating XRP, with their holdings representing 27% of the total circulating supply, up from a previous value of $7.16 billion in October 2022.\n\nAnalysts are optimistic about XRP’s future value, influenced by Ripple’s court wins against the SEC and potential factors like banking collaborations, market trends, and technological advancements.\n\n‘Factor This Into Your Estimates’\n\nAccording to the most recent data, XRP adoption might be still in its early days. The X (Twitter) user FrancisBovineSwift shared the stats, saying there are over 3.6 million wallets holding less than 500 XRP (equaling around $240 at current rates).\n\nThe majority of those addresses hold between 20 and 500 tokens, while the rest own up to 20 coins (less than a mere $10).\n\nNext time you are looking at the https://t.co/6hsVbQITMp site, and wondering where you stand, remember that out of the 4.8 million wallets, over 3.6 million wallets hold less than 500 XRP. Factor this in to your estimates when factoring in the other 8 billion souls walking this… pic.twitter.com/C37QBI6hre — FrancisBovineSwift 🏴‍☠️ 🧸 (@SwiftBovine) October 12, 2023\n\nAs CryptoPotato reported earlier this month, the total XRP wallets stand at over 4.8 million. About 17% of that amount was generated since the beginning of 2023, meaning investors have shown a growing appetite for Ripple’s native token amid the company’s success in its court dispute with the US Securities and Exchange Commission (SEC).\n\nSharks and Whales Have Been Quite Active\n\nWhile most investors have a relatively small exposure to XRP, those holding between 100K and 100M XRP have been on an accumulation spree lately.\n\nSharks and whales currently own almost $7.9 billion worth of the asset, representing almost 27% of the total circulating supply. In comparison, those large investors possessed $7.16 billion worth of XRP in October 2022 (a month before the FTX meltdown).\n\nSeveral analysts have laid out optimistic price predictions for the asset, considering Ripple’s two court victories in a row against the SEC and the possibility of an overall crypto bull run next year. ChatGPT also thinks that the asset might thrive in 2024 should vital elements like new banking collaborations, favorable macroeconomic conditions, market trends, and technological developments be in place.\n\nThose willing to find out how high XRP could go during the next bull run can take a look at our dedicated video below:"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMTAvMTQvaW50ZXJ2aWV3LXJpcHBsZS1kYXZpZC1iY2hpcmkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "The interview with Ripple: David Bchiri - The Cryptonomist",
        "content": "The Cryptonomist interviewed David Bchiri of XRPL Commons during the APEX Developer Summit organized by the Ripple ecosystem in Amsterdam a couple of weeks ago.\n\nWhat’s XRPL Commons role in the Ripple ecosystem?\n\nWe are a foundation incorporated in Paris. We launched 6 months ago, in April with this idea of having a physical space to become a hub for developers and entrepreneurs. We have 3 pillars we focus on: education so spreading the word about the Ripple ecosystem, corporate adoption which is my vision for mainstream adoption and organizing the community. We are a team of eight to run this program from Paris and then the goal is to replicate it in other regions. In education we do it in different ways.\n\nFirst of all we have a free classroom in our HQ so we host training about developing. Every class can also be found online. We also do partnerships with universities. According to a report, in France by 2025 there is gonna be a skill gap in the blockchain space of about 10000 people so there are incentives for universities to train on these skill sets. Our idea is to train teachers so they can teach.\n\nWhat about improving Ripple adoption?\n\nOn the adoption part we have someone in charge of the corporate education department for opening conversations with executives like CEOs, CFOs, CTOs to turn the noise down around NFTs and cryptos and check what they can really expect from the blockchain as a company. Usually they want to use the blockchain to recreate a layer of trust. We have conversations with very different industries from food companies to banks and insurances. We have more plans with hedge funds, etc. Our plan is not to be focused on the financial sector only.\n\nEvery brand that has value in authenticating where a product comes from like champagne, what they are selling is really the fact that it comes from one place, so it’s important for them to track where the product comes from. Or it’s important to track products on the secondary market to understand if the product is original and how to have royalties. These companies have already invested in the blockchain industry with someone internally who educates the company. 80% of their job is to educate before having a product.\n\nHow are you helping the community?\n\nWe are building a community but it already exists. It has a culture, some codes. It’s mainly composed by core developers that are building on the protocol or that see a benefit in using the XRP ledger. We are trying to create a sense of belonging. We have a few projects and we want to address the whole value chain for the developers. There are few supporting programs for developers like the XRPL grant program or the XRPL accelerator.\n\nWe’ve just launched the Aquarium: it’s a program of 12 people for 12 weeks. We host them in our HQ in Paris to help them to turn their ideas into prototypes. Then they can apply for the grant program. One of the programs will be on DeFi for developers to create new dApps on XRPL. Also, the public institution in France that prints passports and IDs is studying blockchain and so I think it’s a good time to be focused also on decentralized ID solutions."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3hycC1wcmljZS1leHRlbmRzLWxvc3Nlcy1hcy1yaXBwbGUtY3RvLWNvdW50ZXJzLWNhcmRhbm8tZm91bmRlci1ieS1jYWxsaW5nLXNlYy1jb3JydXB0LTIwMjMxMDEzMTU0MdIBlgFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy94cnAtcHJpY2UtZXh0ZW5kcy1sb3NzZXMtYXMtcmlwcGxlLWN0by1jb3VudGVycy1jYXJkYW5vLWZvdW5kZXItYnktY2FsbGluZy1zZWMtY29ycnVwdC0yMDIzMTAxMzE1NDE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "XRP stabilizes as Ripple whale accumulation hints at potential recovery initiating soon - FXStreet",
        "content": "XRP price is trading at $0.48, closing in on invalidating the critical support line of $0.47.\n\nRipple CTO stated that SEC did not show favoritism but corruption by clearing Ethereum from being a security.\n\nRipple proponent John Deaton also called out the US House FSC for being ineffective in its oversight of the SEC Chair.\n\nXRP price was in the red over the last couple of days but could be seeing some recovery in the coming days. The reason behind this goes back to not only the positive development in the space concerning Ripple but also XRP whales accumulating tokens.\n\nDaily Digest: Ripple CTO calls SEC corrupt, whales increase holdings\n\nRipple Chief Technology Officer (CTO) David Schwartz took to X, formerly Twitter, to counter the Cardano founder Charles Hoskinson. Earlier this week, during an AMA session on the social media platform, Hoskinson spoke about the conspiracy of ETHgate, according to which Ethereum has been given a free pass by the Securities and Exchange Commission (SEC).\n\nThis conspiracy theory emerged because the SEC maintained its stance that ETH was not security, while has targeted many other tokens, such as XRP, to be considered as such. Many called this corruption, but Charles Hoskinson spoke against the same, saying,\n\n“None of that activity presupposes corruption, just favoritism…this is how the internet works, and it can’t be fixed now\n\nHowever, Schwartz did not seem to agree with this statement as he tweeted,\n\n“I would argue that a government actor showing favoritism aligned with the personal interests of themselves and their friends is corruption.\n\nThus, Ripple enthusiasts and team members do not seem to be in the mood to spare the SEC either directly or indirectly.\n\nMeanwhile, Ripple whale addresses, particularly the cohort holding between 1 million and 10 million XRP, have added over 90 million XRP tokens worth about $43 million over the past two weeks. Their total holding rose from 3.75 billion XRP to 3.84 billion XRP as of today.\n\nWhales have been fairly influential in the price action since December 2022. Their accumulation and selling have resulted in an increase and decrease in XRP price, respectively.\n\nRipple whale accumulation\n\nThis is a bullish sign as it could act as a trigger for the XRP price to initiate recovery since it is in a decline.\n\nRipple Legal Officer on regulation\n\nRipple and its long-standing animosity with the SEC is a story not unknown to anyone in the crypto space; however, throughout the lawsuit, the XRP parent company maintained its stance on the fact that the market needed regulations. The lack of the same is one of the biggest reasons why the SEC continues to practice regulation by enforcement, which is driving away companies to other accepting countries such as Europe.\n\nRipple Chief Legal Officer, Stuart Alderoty, reiterated the need for these regulations and their clarity during the University Blockchain Research Initiative (UBRI) conducted by Ripple this week. He also recognized and complemented the impact UBRI has had on driving academic research related to blockchain and digital assets.\n\nTechnical Analysis: XRP price continues to decline\n\nXRP price trades at $0.48 at the time of writing, hovering just above the crucial support level of $0.47. Down by 11% in the last nine days, the sentiment around the cryptocurrency is heavily bearish.\n\nA fall below this level would completely invalidate the 13.7% gains noted by the altcoin in the second half of September, which took the XRP price up to $0.54.\n\nXRP/USD 1-day chart\n\nNevertheless, if the altcoin bounces off the support line at $0.47 and reclaims the $0.50 resistance line as a support floor, further recovery can be expected. Breaching the 50-day and 200-day Exponential Moving Average (EMA) confluence at $0.52 would invalidate the bearish thesis, setting XRP price up for climbing back to $0.54."
    }
]