[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmJjZy5jb20vdW5pdGVkLXN0YXRlcy93b3JrLWFuZC1jdWx0dXJlL3JpcHBsZS1lZmZlY3Qtd2l0aC1wb3NpdGl2ZS1lbmVyZ3ktYXQtd29ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Creating Ripple Effect with Positive Energy at Work | BCG - BCG",
        "content": "Here’s an excerpt from that conversation, in Al’s words:\n\nI grew up in Northern New Jersey, in South Orange. Both my parents are from Jamaica, and that had a heavy influence on my upbringing. I was one of the first people in my family to graduate college—also one of the first to navigate corporate America. That created a challenge for me in the earlier days because I didn’t have a ton of people at home to ask questions to.\n\nMy mom was a social worker for much of her adult life. She’s an incredibly selfless woman who I'd like to think I took a lot from. And my dad had his own carpet and floor covering business, which was super inspiring because being from Jamaica, with a heavy accent, navigating Northern New Jersey while starting a business must have been challenging for him.\n\nI'm still friends with those that I had in middle school. I'm just that type of person. I was fortunate enough to grow up in a very diverse town, which has had an impact on my life. My friends, my classmates had all different skin tones. In some ways, I think that was the test run I needed for navigating corporate America, because I feel comfortable communicating with whoever, whenever."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmRlbGlzaC5jb20vdWsvZm9vZC1uZXdzL2E0MzEzNjkwNS9yYXNwYmVycnktcmlwcGxlLWNyZWFtLWxpcXVldXItYWxkaS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Aldi Launches Raspberry Ripple Cream Liqueur | Aldi Ballycastle - Delish UK",
        "content": "Long gone are the days when Irish cream liqueurs were just for Christmas. Now, there's a cream liqueur for every occasion - summer cocktails, Valentine's Day celebrations, and spring time sipping.\n\nThis is exactly why we're very excited about 's newest cream liqueur flavour - Raspberry Ripple.\n\nInspired by the classic, nostalgic ice cream flavour, the new drink is made with thick double cream and sweet raspberry and rich vanilla flavours.\n\nRaspberry Ripple martini, anyone?\n\nAldi\n\nThe good news doesn't stop there. A bottle of Ballycastle Raspberry Ripple Irish Cream will set you back just £7.49. That's a whole 56% cheaper than the similar Baileys Eton Mess Irish Cream. Oh Aldi, the saviour of our wallets.\n\nNow, you might be wondering: when can I get my hands on this heavenly new flavour? Well, you'll have to wait a couple of weeks because it's not landing in Aldi stores until 13th March.\n\nIf you simply can't wait that long to try a sumptuously sweet Aldi cream liqueur, you could give their Red Velvet flavour a go.\n\nThe re-launch of the best-selling red velvet cake flavour liqueur came just in time for Valentine's Day, and it was just as much of a bargain as the Raspberry Ripple at just £7.49.\n\nWe wager it would taste excellent in a white hot chocolate, or in a red velvet-themed mudslide, complete with red velvet crumbs around the rim. Indulgence at it's finest!"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LnNvbGFycG93ZXJwb3J0YWwuY28udWsvcmlwcGxlX2VuZXJneV9hbm5vdW5jZXNfdGhlX3Vrc19maXJzdF9jb19vd25lZF9zb2xhcl9wcm9qZWN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Ripple Energy announces UK's first co-owned solar project - Solar Power Portal",
        "content": "With shares starting at £25, co-ownership presents a cost-effective alternative to owning renewable energy assets, such as Ripple’s Graig Fatha wind turbine. Image: Ripple Energy.\n\nAlmost a year after Ripple Energy’s first consumer-owned wind farm went live, the company has announced that its third shared renewable energy project will be a solar park in England.\n\nBefore it was announced as a solar park, Ripple Energy confirmed that its third project had received 16,000 reservations for its seven-day purchase window.\n\nThe co-owned renewable sites allow consumers to buy and co-own a source of renewable energy generation, receiving money off of their energy bills based on the amount of energy produced by their share.\n\nWith shares starting at £25, co-ownership presents a cost-effective alternative to owning domestic solar panels.\n\nRipple predicts that due to the current energy crisis, co-ownership members could save roughly £783 on their electricity bill in 2023 as purchase prices maintain their volatility.\n\n“We’ve been identifying the best possible sites, both in terms of cost and the speed of the build,” said project manager, Jamie Adam.\n\nNima Soufiani, software developer at Ripple Energy added that the company had been optimising its dashboard and website to ensure it is ready for loads of new co-ownership members.\n\n“We’re so excited to have so many of you on board” said CEO and founder, Sarah Merrick, referencing the 16,000 people already signed up to the solar project.\n\n“We’re going to be releasing more details along with the share offer document when we open the share offer later in the year.”\n\nSolar Power Portal will keep updated as more details of the project are announced."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy53Y3BvLmNvbS9uZXdzL2xvY2FsLW5ld3MvY2xlcm1vbnQtY291bnR5L29oaW8tdG93bnNoaXAvZXZlcnlvbmUtaXMtZ29pbmctdG8tYmUtYnVyZGVuZWQtY2hpbGQtZmFtaWx5LXRoZXJhcGlzdC1zYXlzLXRyYXVtYS1mcm9tLW11cmRlci1zdWljaWRlLXdpbGwtcmlwcGxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "Therapist: Trauma from Clermont County murder-suicide will ripple in community - WCPO 9 Cincinnati",
        "content": "OHIO TOWNSHIP, Ohio — Four people are dead after the Clermont County Sheriff's Office said Theresa Cain shot four of her family members before turning the gun on herself. She, her husband, father and son died. Her daughter, Samantha, is currently in critical condition at UC Medical Center.\n\nFriends and neighbors said they couldn't believe the tragedy happened, stating there were \"no telltale signs.\" Flowers were laid outside their home as the community mourns the dead and prays for Samantha.\n\nM.J. Shooner, MA, MFT, a child/family therapist and trauma specialist for First Step Home, said the tragedy will bring a heavy burden to more than just the Cain family.\n\n\"Everyone is going to be burdened, whether they are completely aware of it or not,\" said Shooner. \"You're basically having these circles of trauma rippling out from four generations, so each one of those people have a circle of people that were in their life.\"\n\nSamantha is a New Richmond grad who attended Northern Kentucky University. Her brother, Ethan, was a New Richmond Middle School student. Steven Cain, Theresa's husband, sang in the band Critical Khaos.\n\n\"All of those people are basically qualified for the diagnosis of PTSD because the new criteria includes being a friend or a colleague of someone who was exposed to the trauma,\" Shooner said. \"All of the police that are on this, all of the newscasters that are on this, everyone that's following this, needs to take a breath and find a safe place to share and I think that is one of the things that we are all missing.\"\n\nTherapist explains trauma ripples from murder-suicide near New Richmond\n\nShooner said it is important people do not wait or doubt themselves if they need help.\n\n\"The important thing is we don't feel shame about our children going through things or, for example, if (Theresa) was going through something. ... That whole neighborhood, they're all going to need help,\" said Shooner.\n\nShe said it's important not to assign blame to anyone and that even this tragedy can teach a valuable lesson that it's OK to be vulnerable.\n\n\"It takes a lot of courage to ask for (help),\" said Shooner. \"Are they going to ask for it and who will listen?\"\n\nREAD MORE\n\nSheriff: Mother determined as shooter in murder-suicide near New Richmond\n\nPolice report: Passenger pulled gun in Middletown officer-involved shooting\n\nHoax forces lockdown at two Mt. Healthy schools; Junior/Senior High using calamity day Thursday"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vaW5zaWRlYml0Y29pbnMuY29tL25ld3MveHJwLXByaWNlLXByZWRpY3Rpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Mar 2023 08:00:00 GMT",
        "title": "XRP Price Prediction: Price Drifts Away from $0.4. What is Ripples Next Stop? - Inside Bitcoins",
        "content": "Don’t invest unless prepared to lose all the money you invest. This is a high-risk investment, you shouldn’t expect to be protected if something goes wrong.\n\nJoin Our Telegram channel to stay up to date on breaking news coverage\n\nRipple’s price has remained dominant over the last few days, trading between $0.42 and $0.31. Given a recent rejection at a vital resistance level, a slight decline toward the lower end of the range seems possible. XRP’s price prediction heavily leans towards recent developments in its ecosystem and the current surge in the crypto market. However, is $0.50 a viable target, or is a crash imminent?\n\nRipple Vs. SEC and the Likely Impact on XRP Value\n\nRipple news on the legal proceedings with the Securities and Exchange Commission (SEC) continues to hang in the balance. Crypto investors have been inconvenienced by these proceedings for more than two years. The significant claims by the SEC are that the XRP cryptocurrency is a security and that Ripple gave it to investors without legal registration. As the days go by, it becomes more and more difficult to predict the outcome of the legal proceedings.\n\nBased on speculation, many believe that Ripple’s legal team will likely advocate for a settlement if the SEC accepts that all current and future XRP transactions are not securities. Additionally, it is the confidence of many that Ripple will emerge victorious.\n\nI have no doubt Ripple will win and the current Supreme Court will shut down the @SECGov’s gross overreach. The West Virginia 🆚 EPA case is all you need to read to agree with me. @Ripple’s summary judgment brief is already an extremely well written appellate brief. https://t.co/o3g9zML9S2 — John E Deaton (@JohnEDeaton1) February 20, 2023\n\nRipple Labs, founded in 2012 as OpenCoin, later changed its name and launched the XRP token. At the time, XRP was coming into play as a solution to cross-border remittances. As there were fewer cryptocurrencies at the time, XRP went on to grow massively. However, once the SEC filed the suit in December 2020, the negative sentiments around the coin began.\n\nThe final ruling comes when the market is hit with a series of frauds and scandals, which could have a massive impact on the price. A loss on the case could mean a significant loss, which could negatively impact the project and thus cause a decline. On the other hand, a win could mean that the price will scale positively.\n\nXRP Price Analysis\n\nAt the time of writing, the live XRP price is $0.38056, with a 24-hour trading volume of $942,042,041,789. XRP is up 2.59% in the last 24 hours. Ripple’s price has shown signs of weakness, printing small candles with no particular direction. The most recent attempt was to claim the descending trendline at $0.433, which failed.\n\nAs a result of the rejection, the price fell below an important level, the 200-day moving average. This gave XRP a bearish bias. However, Ripple retested the broken moving average and formed a pullback, confirming that the trend is turning bearish until it reclaims its level.\n\nXRP started a fresh decline from the 0.4050 resistance zone this past week. The price declined below the $0.395 and $0.392 levels, moving into a bearish area. There is the creation of a critical bearish trend line with resistance near $0.3780, which shows that the supply is increasing. As long as the price action stays below this line, we have a bearish trend.\n\nXRP Price Prediction: Technical Analysis\n\nThe XRP/USD struggles under the $0.3850 level while it gains support near $0.33. However, the possibility of the price slipping further seems unlikely since the support zone has been tested severally.\n\nAdditionally, XRP is trading below both the 50-day and 200-day moving averages, which further adds to the bearish sentiment. The current Relative Strength Index remains below the trendline and has been falling. As such, it remains just speculation as to where the market may go.\n\nAs such, the current Ripple outlook is bearish, followed by low volatility in its price. XRP shows a descending triangle, which may be an indication of a downward trend. If the resistance level remains strong, the price will return to its support level at $0.33664. However, if XRP breaks the current resistance level, it will rise to the next resistance level at around $0.42.\n\nAlternative to XRP\n\nIn case you are interested in exploring alternative high-potential crypto projects to XRP, here are some new upcoming ICOs to invest in 2023.\n\nRelated\n\nPlayDoge (PLAY) - Newest ICO On BNB Chain Rating 2D Virtual Doge Pet\n\nPlay To Earn Meme Coin Fusion\n\nStaking & In-Game Token Rewards\n\nSolidProof Audited - playdoge.io Join Presale"
    }
]