[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NvdXRoLWtvcmVhLXJlcG9ydGVkbHktbW9uaXRvcmluZy1yaXBwbGVzLWNhc2UtYWdhaW5zdC1zZWMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Feb 2023 08:00:00 GMT",
        "title": "South Korea reportedly monitoring Ripple's case against SEC - CryptoSlate",
        "content": "South Korea’s Financial Supervisory Service (FSS) is reportedly monitoring the lawsuit between the United States Securities and Exchange (SEC) and crypto firm Ripple (XRP), South Korea’s News1 reported.\n\nThe news outlet reported Feb. 14 that Ripple’s case could strongly impact how crypto assets are classified in the Asian country. It added that while digital assets like Bitcoin and Ethereum are not classified as security tokens, the classification of XRP in the US could broadly impact the classification of other altcoins as securities.\n\nSouth Korea’s financial regulator previously said:\n\n“[We would] revise regulations and formats so that token securities can be issued and distributed in accordance with relevant guidelines, and hold a briefing session for the industry.”\n\nThe report added that the FSS’s Digital Asset Research team was also reviewing other foreign cases related to the crypto industry.\n\nSouth Korea recently published guidelines on the regulation of security tokens and their issuance. Under this guidance, the country will regulate certain digital assets as securities under its Capital Markets Act and allow Security Token Offerings (STOs) under the Electronic Securities Act.\n\nThe US SEC and Ripple have been embroiled in a three-year legal tussle over whether XRP could be classified as a security. The case is at its closing stages, with the court expected to give a summary judgment as early as March.\n\nMentioned in this article"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3RoZWNvbnZlcnNhdGlvbi5jb20vYWwtc2hhYmFhYi1hdHRhY2tzLWluLXNvbWFsaWEtYWZmZWN0LWNvbW11bml0aWVzLWFzLWZhci1hcy05MDBrbS1hd2F5LWFpZC1hZ2VuY2llcy1uZWVkLXRvLXRha2Utbm90ZS0xOTc5MzPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Feb 2023 08:00:00 GMT",
        "title": "Al-Shabaab attacks in Somalia affect communities as far as 900km away – aid agencies need to take note - The Conversation",
        "content": "Policymakers tend to assume that the effects of conflict are felt only where violence occurs. As a result, humanitarian aid, protection efforts or asylum policies largely focus on conflict-hit areas.\n\nThe World Health Organisation, for instance, provides emergency medical supplies in areas directly affected by violence. The UN Refugee Agency ties protection status to residing in areas hit by conflict.\n\nOur recent study finds, however, that conflict negatively affects food security, nutrition, health and education outcomes of families living hundreds of kilometres away from the epicentre of violence.\n\nThis underscores the need to broaden policy responses to conflict and consider its ripple effects.\n\nOur research in Somalia examined how the impact of violent conflict spread to distant locations. We looked specifically at conflict that affected Somalia’s food logistics network, which gets food to far-flung markets.\n\nWe focused on Somalia because of its high number of terror incidents arising from the government’s war with Al-Shabaab, a militant group that has terrorised the country’s southern region for about 15 years.\n\nRead more: Al-Shabaab is just a symptom of Somalia’s tragedy – the causes are still in place\n\nWe used data from the Food and Agricultural Organisation, which tracks food prices. Our results show that terrorist attacks that hit food transportation networks increased food prices in markets located up to 900km away (a 17-hour drive) from where the violence occurs.\n\nIn response to these terrorist attacks and resulting price increases, households in far-flung areas adjusted their eating patterns. They also reduced their non-food spending, primarily on health and education.\n\nYet, the responses to violent incidents by donor and aid agencies, as well as domestic policymakers, hardly take such ripple effects into consideration.\n\nTracking conflict\n\nTo track these ripple effects, we focused on the distribution of maize, a staple food eaten throughout Somalia. We got the geo-coordinates of maize growing areas, tracked how maize was transported by road to markets, and mapped the Al-Shabaab terrorist attacks that occurred along these transport routes.\n\nThis helped us map the impact of conflict on maize prices and the ripple effects on household welfare.\n\nThe Famine Early Warning Systems Network provides maps showing the exact routes taken by Somali drivers who are transporting maize. We drew a corridor of five kilometres around these roads and counted the number of violent incidents occurring each month between 2001 and 2018. The Food and Agricultural Organisation provided us with monthly maize price information for 10 markets across Somalia.\n\nWe combined this data with World Bank surveys that recorded food consumption, eating patterns, and the health and education of Somali families.\n\nOur findings\n\nWe found that conflict along transportation roads increased maize prices substantially, even in markets located hundreds of kilometres away. This finding is in line with studies on the impact of conflict on supply chain networks elsewhere in the world, such as in the Russia-Ukraine war.\n\nRead more: Russia-Ukraine conflict is driving up wheat prices: this could fuel instability in Sudan\n\nDuring the height of the Al-Shabaab insurgency in Somalia (between 2016 and 2018), violent incidents occurring very close to transportation roads alone increased maize prices by around 11% over sustained periods of time.\n\nDuring these times, we found violence en route had around half as large an impact on maize prices as rainfall, which the World Bank has highlighted as one of the most important determinants of food prices.\n\nWe also scrutinised satellite images of nightlights emitted on transportation roads. We found that conflict along transit roads dimmed the light emitted on these roads several hundreds of kilometres away. This decrease in road traffic underscores a reduction in the quantity of maize transported along roads from growing areas to markets.\n\nLooking at family welfare, we found that households reported having to adjust their eating patterns due to food price shocks. Families substituted the more expensive maize with sorghum. Still, we found that lower food security decreased the nourishment available to households.\n\nConsidering child outcomes, we found that far-away conflict along transit routes increased the incidence of diseases, such as gastroenteritis, malaria and typhoid. This is in line with well-known links between malnutrition and infectious diseases.\n\nFinally, we also found a decrease in the school enrolment of children. Violent incidents along maize transportation routes reduced the probability of children joining primary and middle school hundreds of kilometres away. This is likely to be related to the economic effects of food price rises. This makes schooling less affordable and increases the incentives for child labour.\n\nWay forward\n\nOur study has wide-ranging policy implications.\n\nThe ripple effects of violence have important welfare costs. The negative effects of conflict on human capital – particularly nutrition, health and education – are larger than commonly assumed. We estimate that these ripples add around 30% to the cost of locally occurring conflict.\n\nOur findings also have important implications for the regional targeting of policies.\n\nHumanitarian interventions or refugee policies most commonly focus on those locations where conflict occurs. The World Food Programme, for instance, provides nutritional assistance in areas around Mogadishu, in the south-west of Somalia where most conflict is concentrated.\n\nSimilarly, when evaluating asylum eligibility, the UN Refugee Agency highlights the south-west of Somalia as the area where individuals are at risk of serious harm.\n\nBy contrast, our results provide evidence that individuals can be affected by conflict even if it occurs far away. For instance, the city of Galkayo (700km from Mogadishu) is part of the north-eastern Puntland state. It isn’t covered by either the World Food Programme or the UN’s refugee policies. Yet conflict in the south-west increases food prices, decreases food security and erodes human capital in Galkayo.\n\nThis long reach of violence highlights the need to consider extending humanitarian aid, protection efforts or asylum status eligibility to areas further away from conflict epicentres."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0b2N1cnJlbmN5LWFuYWx5dGljcy1pbnNpZ2h0L3hycC12cy1ldGgtd2hhdC1pcy10aGUtYmVzdC1jcnlwdG8tdG8tYnV5LWZvci15b3UtaW4tMjAyM9IBhQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hbXAvc3RvcnkvY3J5cHRvY3VycmVuY3ktYW5hbHl0aWNzLWluc2lnaHQveHJwLXZzLWV0aC13aGF0LWlzLXRoZS1iZXN0LWNyeXB0by10by1idXktZm9yLXlvdS1pbi0yMDIz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Feb 2023 08:00:00 GMT",
        "title": "XRP vs ETH – What Is the Best Crypto to Buy for You in 2023 - Analytics Insight",
        "content": "Disclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NvdXRoLWtvcmVhLXJlcG9ydGVkbHktbW9uaXRvcmluZy1yaXBwbGVzLWNhc2UtYWdhaW5zdC1zZWMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Feb 2023 08:00:00 GMT",
        "title": "South Korea reportedly monitoring Ripple's case against SEC - CryptoSlate",
        "content": "South Korea’s Financial Supervisory Service (FSS) is reportedly monitoring the lawsuit between the United States Securities and Exchange (SEC) and crypto firm Ripple (XRP), South Korea’s News1 reported.\n\nThe news outlet reported Feb. 14 that Ripple’s case could strongly impact how crypto assets are classified in the Asian country. It added that while digital assets like Bitcoin and Ethereum are not classified as security tokens, the classification of XRP in the US could broadly impact the classification of other altcoins as securities.\n\nSouth Korea’s financial regulator previously said:\n\n“[We would] revise regulations and formats so that token securities can be issued and distributed in accordance with relevant guidelines, and hold a briefing session for the industry.”\n\nThe report added that the FSS’s Digital Asset Research team was also reviewing other foreign cases related to the crypto industry.\n\nSouth Korea recently published guidelines on the regulation of security tokens and their issuance. Under this guidance, the country will regulate certain digital assets as securities under its Capital Markets Act and allow Security Token Offerings (STOs) under the Electronic Securities Act.\n\nThe US SEC and Ripple have been embroiled in a three-year legal tussle over whether XRP could be classified as a security. The case is at its closing stages, with the court expected to give a summary judgment as early as March.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0b2N1cnJlbmN5LWFuYWx5dGljcy1pbnNpZ2h0L3hycC12cy1ldGgtd2hhdC1pcy10aGUtYmVzdC1jcnlwdG8tdG8tYnV5LWZvci15b3UtaW4tMjAyM9IBhQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hbXAvc3RvcnkvY3J5cHRvY3VycmVuY3ktYW5hbHl0aWNzLWluc2lnaHQveHJwLXZzLWV0aC13aGF0LWlzLXRoZS1iZXN0LWNyeXB0by10by1idXktZm9yLXlvdS1pbi0yMDIz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Feb 2023 08:00:00 GMT",
        "title": "XRP vs ETH – What Is the Best Crypto to Buy for You in 2023 - Analytics Insight",
        "content": "Disclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    }
]