[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvcmlwcGxlLXhycC1wcmljZS1wcmVkaWN0aW9uLW5ldy15ZWFyLTIwMjTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Ripple XRP Price Prediction: New Year 2024 - Watcher Guru",
        "content": "Ripple’s XRP token has seen a significant rise in its price this year. Since January 2023, the asset has surged by over 80%. However, the popular cryptocurrency remains overshadowed by others, such as Solana (SOL), which grew by over 1000%, and Bitcoin (BTC), which rallied by nearly 160% in the same time frame.\n\nAlso Read: Ripple XRP Forecasted To Surpass its ATH of $3.40, Here is When\n\nXRP saw a massive spike in its price, reaching $0.82 after a US district court ruled that Ripple selling the token to retail clients did not breach securities law. However, the US SEC (Securities and Exchange Commission) has taken the lawsuit to the high court. There is a possibility that the high court will rule similarly to the district court. However, XRP’s price has stagnated over its legal unclarity. The asset has yet to reclaim its July 2023 levels and is since down almost 24%.\n\nRipple XRP price prediction for New Year 2024\n\nSource – The Coin Republic\n\nAccording to Changelly, Ripple’s XRP token could reach a price of $0.73 on Dec. 31, 2023, an increase of about 17.7% from current levels. However, the platform predicts the token’s price to drop to $0.72 on Jan. 1, 2024. Nonetheless, Changelly anticipates XRP to gain momentum in the first week of January, hitting $0.82 on Jan. 7, 2024, a price increase of about 32% from current levels.\n\nAlso Read: Ripple: Here is Why XRP Could Hit an All-Time High in 2024\n\nCoinCodex also paints a bullish picture for XRP on New Year’s Eve. According to the platform, Ripple’s XRP token could hit $0.81 on Dec. 31, 2024, a price increase of about 30% from current levels. However, CoinCodex anticipates XRP’s price to drop in January 2024. The platform predicts the token will fall below $0.70 by the end of January next year."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS94cnAtY29uaXRudWVzLWNvbnNvbGlkYXRpb24tYXMtbWFqb3ItbW92ZS1zZWVtcy1pbW1pbmVudC1idXQtd2hpY2gtd2F5LXJpcHBsZS1wcmljZS1hbmFseXNpcy_SAXpodHRwczovL2NyeXB0b3BvdGF0by5jb20veHJwLWNvbml0bnVlcy1jb25zb2xpZGF0aW9uLWFzLW1ham9yLW1vdmUtc2VlbXMtaW1taW5lbnQtYnV0LXdoaWNoLXdheS1yaXBwbGUtcHJpY2UtYW5hbHlzaXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "XRP Conitnues Consolidation as Major Move Seems Imminent, but Which Way? (Ripple Price Analysis) - CryptoPotato",
        "content": "Ripple continues to navigate its consolidation phase, as observed by the price oscillating within a pivotal range, forming a sideways wedge pattern.\n\nNotably, XRP encounters a robust support zone, identified by the convergence of the 100 and 200-day moving averages, along with the lower boundary of the wedge. This convergence holds the potential to impede any downward movements.\n\nXRP Analysis\n\nBy Shayan\n\nRipple Price Analysis: The Daily Chart\n\nThe ongoing consolidation has expanded around a significant support area. This critical zone encompasses the 100-day and 200-day moving averages, along with the lower support of the wedge at $0.58. This reinforces the notion of substantial demand existing at this crucial juncture.\n\nConsidering the prevailing buying pressure and demand at this pivotal level, Ripple is anticipated to secure support, preventing further downward momentum. In this context, with the price nearing the narrowing end of the wedge, a breakout to the upside could initiate a sustained bullish trend. Conversely, a breach below the crucial support may trigger a cascading effect, targeting lower price thresholds.\n\nThe 4-Hour Chart\n\nA closer examination of the 4-hour chart reveals that the significant support region, spanning from the crucial 0.5 ($0.61) to 0.618 ($0.58) levels of the Fibonacci retracement, continues to serve as a formidable defense against sellers’ attempts to drive the price lower.\n\nImportantly, this vital support area aligns harmoniously with the lower boundary of the wedge, further solidifying its role as a robust barrier against selling pressure.\n\nA potential dip beneath this pivotal support range could signal an impending substantial downturn for XRP, necessitating careful consideration by market participants in anticipation of noteworthy changes under such circumstances. However, considering recent price movements and market sentiment, a breakout above the wedge pattern appears more plausible."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTIvMjYvcmlwcGxlLWNvdWxkLWR1bXAtb3Zlci05Nm0tbGlxdWlkLXhycC1iZWZvcmUtMjAyMy1lbmRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Ripple Could Dump Over 96M Liquid XRP Before 2023 Ends - The Crypto Basic",
        "content": "As 2023 draws to a close, Ripple could sell over 96 million XRP coins currently being held in its main wallet address.\n\nProminent crypto payment company Ripple has been spending a huge chunk of the tokens unlocked from escrow.\n\nRipple Escrow System\n\nFor context, the Ripple escrow system, established in December 2017, was programmed to release 1 billion XRP monthly.\n\n- Advertisement -\n\nAs part of efforts to stabilize the XRP market, Ripple usually re-locks 80% (800M) of the 1B XRP back in escrow. Most of the remaining 20% (200M) XRP coins are sent to the company’s main wallet labeled “Ripple 1.”\n\nInterestingly, the company then distributes the tokens to different unlabeled addresses before they eventually find their way to centralized exchanges, where they are sold via blind bid/ask transactions.\n\nRipple Spends 240M XRP in December\n\nIn a routine procedure, Ripple sent 200M XRP from the 1B coins unlocked in December 2023 from one of its wallet addresses labeled “Ripple 22” to the main account.\n\nFollowing the transaction, the spending wallet had a balance of 336,340,276 (336.34 million) XRP as of December 1. So far, Ripple has spent 240M XRP from the total sum in three tranches.\n\n- Advertisement -\n\nThe first spending occurred on December 6, 2023, with Ripple sending 60M XRP to an unlabeled address. It also sent another 60M XRP to the same unlabeled address six days later.\n\nAdditionally, the company sent 120M XRP to the same address on December 20, bringing “Ripple 1” total spending this month to 240M XRP ($148.8 million).\n\nOver 96M XRP Remains Liquid\n\nWith 240M XRP spent in December, Ripple’s main spending wallet now has a balance of 96,340,276 (96.34 million) XRP. At the current price of $0.62 per coin, the Ripple 1 XRP balance is equivalent to $59.73 million.\n\nRipple can decide to sell the coins before the year ends or keep them in the wallet until next year. Should Ripple choose to dump the 96.34 million XRP, the company is expected to do so without causing a negative impact on the price.\n\n40.7B XRP Still Locked in Escrow\n\nWhile Ripple still has 96.34 million of liquid XRP stashed in its spending address, its escrow account currently holds 40.7 billion XRP.\n\nThe company will continue to unlock hundreds of millions of these coins from escrow until 2027. It is worth noting that the initial plan was to release 1B XRP from the 55B tokens locked in escrow for 55 months.\n\nHowever, with hundreds of millions of XRP re-locked in escrow after each successful unlock, the company extended the deadline to 2027."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LnNjaS5uZXdzL2FzdHJvbm9teS9hbG1hLXNlaXNtaWMtcmlwcGxlcy1kaXNrLWFuY2llbnQtYmFycmVkLXNwaXJhbC1nYWxheHktMTI1NjQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "ALMA Detects Seismic Ripples in Disk of Ancient Barred Spiral Galaxy - Sci.News",
        "content": "Astronomers using the Atacama Large Millimeter/submillimeter Array (ALMA) have observed a disk bending wave in BRI 1335-0417, the oldest known spiral galaxy at over 12 billion years old. This unprecedented observation reveals the galaxy’s dynamic growth patterns, showcasing a vertically oscillating disk movement similar to ripples on a pond. The study marks the first time such phenomena have been detected in an early galaxy.\n\nBar structure plays a crucial role in driving galaxy evolution and shaping disk structure.\n\nIn galaxies an axisymmetric stellar bar exerts gravitational torque on the gas, driving it towards the galactic center and forming a centralized stellar structure such as a bulge and nuclear disk.\n\nThis process may also promote gas accretion onto the black hole observed as active galactic nuclei.\n\nBars can also drive radial migration of gas and stars, which is essential for explaining the observed stellar kinematics in Milky Way-like galaxies.\n\n“A state-of-the-art telescope called ALMA allowed them to look at the ancient galaxy BRI 1335-0417 in much greater detail,” said lead author Dr. Takafumi Tsukui, an astronomer at Australian National University.\n\n“Specifically, we were interested in how gas was moving into and throughout the galaxy.”\n\n“Gas is a key ingredient for forming stars and can give us important clues about how a galaxy is actually fuelling its star formation.”\n\nIn this case, Dr. Tsukui and colleagues were able to not only capture the motion of the gas around BRI 1335-0417, but also reveal a seismic wave forming — a first in this type of early galaxy.\n\nThe galaxy’s disk moves in a way not dissimilar to ripples spreading on a pond after a stone is thrown in.\n\n“The vertically oscillating motion of the disk is due to an external source, either from new gas streaming into the galaxy or by coming into contact with other smaller galaxies,” Dr. Tsukui said.\n\n“Both possibilities would bombard the galaxy with new fuel for star formation.”\n\n“Additionally, our study revealed a bar-like structure in the disk.”\n\n“Galactic bars can disrupt gas and transport it towards the galaxy’s center.”\n\n“The bar discovered in BRI 1335-0417 is the most distant known structure of this kind.”\n\n“Together, these results show the dynamic growth of a young galaxy.”\n\n“Early galaxies have been found to form stars at a much faster rate than modern galaxies,” said co-author Dr. Emily Wisnioski, also from Australian National University.\n\n“This is true for BRI 1335-0417, which, despite having a similar mass to our Milky Way, forms stars at rate a few hundred times faster.”\n\n“We wanted to understand how gas is supplied to keep up with this rapid rate of star formation.”\n\n“Spiral structures are rare in the early Universe, and exactly how they form also remains unknown.”\n\n“This study also gives us crucial information on the most likely scenarios.”\n\n“While it is impossible to observe the galaxy’s evolution directly, as our observations only give us a snapshot, computer simulations can help piece the story together.”\n\nThe findings appear in the Monthly Notices of the Royal Astronomical Society.\n\n_____\n\nTakafumi Tsukui et al. 2024. Detecting a disc bending wave in a barred-spiral galaxy at redshift 4.4. MNRAS 527 (3): 8941-8949; doi: 10.1093/mnras/stad3588"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL25vdGFibGUtMjAyMy1jcnlwdG8tbWVyZ2Vycy1hY3F1aXNpdGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "The year's most significant crypto M&A deals — and how 2024 might shape up - Blockworks",
        "content": "Though crypto mergers and acquisitions slowed in 2023, some industry watchers say such transactions are likely to be more en vogue next year as the space continues to mature.\n\nThere were 203 crypto M&A deals in 2022. Such deal count this year stood at 143 on Dec. 13, according to advisory firm Architect Partners — on pace to decline by 27% year over year.\n\nNearly a third of the 2023 transactions — 42 in all — have come within the investing and trading infrastructure category, the data shows. This comprises non-exchange trading firms, custodians and other companies focused on “infrastructure to the trading lifecycle,” said Architect Partners founder Eric Risley.\n\nWhich deals were among the most notable?\n\nAmong the most notable M&A deals was Ripple’s acquisition of crypto custody firm Metaco for $250 million in May.\n\nRipple is perhaps best known for establishing one of the earliest blockchain-based payment networks. For the company, securely managing digital assets is crucial. Switzerland-based Metaco provides custody infrastructure to banks, fintechs, exchanges and corporations.\n\nRipple CEO Brad Garlinghouse called custody “a key facet of the infrastructure required for enterprise crypto services” at the time. Sagar Shah, Ripple’s head of custody, had told Blockworks the firm spent two years evaluating crypto custodians, highlighting Metaco’s “first-rate bank customers,” and “crypto native team.”\n\nAnother major deal was Coinbase’s acquisition of One River Digital Asset Management in March for roughly $97 million. It was the exchange’s first buy since closing a $275 million deal for derivatives exchange FairX in February 2022.\n\nThe crypto exchange said in a blog post at the time the acquired firm would allow it to offer investment advisory services to institutional clients.\n\nRead more: Three deals ‘emblematic’ of market during record Q1 for crypto M&A\n\nCoinbase’s acquisition came as the company intensified the push to expand its product set and geographical footprint. The firm’s revenue from subscriptions and services, derived from sources like stablecoins, custodial fees, blockchain rewards and interest income, surpassed its earnings from transactions in the third quarter.\n\nAlyssa Choo, crypto equities specialist at Bitwise, previously argued that the exchange’s future is as “a crypto super app” with a variety of revenue streams.\n\n“Coinbase recognizes that crypto asset investors are rapidly shifting from crypto-native speculators to more sophisticated, long-term investors,” Risley said. “Investors demand more sophisticated investment strategies, indexes, investment products and advice.”\n\nIn the mining space, Hut 8 and US Bitcoin Corp. closed what was billed as “a merger of equals” earlier this month. The combined company enjoys more geographic diversity and business lines, segment observers said, helping its standing ahead of the upcoming bitcoin halving.\n\nTokenization efforts show up in 2023 deals\n\nThe Depository Trust and Clearing Corporation (DTCC) bought Securrency, a blockchain-based financial and regulatory technology developer.\n\nDTCC, a financial market infrastructure behemoth that processes trillions of dollars in securities transactions daily, revealed the $50 million deal in October and closed it this month.\n\nIt marks one of the latest examples of traditional finance and crypto converging, a trend that has reared its head in recent months in the form of tokenization.\n\nRead more: TradFi, DeFi convergence continues through tokenizing real-world assets\n\n“In its first acquisition in a decade, DTCC is anticipating and embracing the digitization of traditional assets of all types, the use of blockchain-based transaction settlement, and acting as a regulatory-compliant bridge between traditional securities and emerging digital asset marketplaces,” Risley told Blockworks.\n\nOther tokenization-related deals include Securitize’s buy of Onramp Invest.\n\nThe acquired digital asset wealth platform works with US registered investment advisers (RIAs). The purchase allows Securitize to offer tokenized alternatives — like private equity and private credit — through systems RIAs are accustomed to using, the company said at the time.\n\nDigital asset infrastructure platform Fireblocks also looked to expand its tokenization abilities by acquiring smart contract firm BlockFold.\n\nFireblocks CEO Michael Shaulov said in a statement that BlockFold’s expertise will help it assist big financial institutions to quickly launch tokenization projects.\n\nIn a transaction reflecting the convergence of traditional finance and blockchain more broadly, German capital market giant Deutsche Borse bought digitized fund distribution platform FundsDLT.\n\n“Distribution of financial products is critical for primary issuance and secondary markets, and FundsDLT streamlines and automates processes leading to increased distribution with reduced costs and time,” Risley said. “Similar [distributed ledger technology] infrastructure will be implemented in nearly every financial product.”\n\nWhat to expect in 2024\n\nSamuel Dibble, a partner at Baker Botts, noted that milestone events in 2023 are likely to lead to greater crypto market maturity, which could in turn spur a greater number of mergers in acquisitions next year.\n\nA US federal judge in July partially sided with Ripple Labs in a US Securities and Exchange Commission lawsuit alleging its XRP token constituted an unregistered security offering.\n\nThe SEC sued crypto exchanges Coinbase and Binance earlier this year, accusing each of operating as unregistered securities exchanges. The US Department of Justice last month revealed a series of actions against Binance, including $4.3 billion in fines and forfeitures.\n\nThe two exchanges remain in legal battles with the SEC.\n\nRead more: Binance says the SEC can’t use DOJ plea deals as proof of guilt\n\n“When the regulatory air clears on whether digital assets are securities, commodities or something else outside of existing regulatory regimes, I’d look for the larger, more diversified financial institutions to start acquiring the larger crypto players — or at least their key assets,” Dibble told Blockworks.\n\nAdditionally, the sale of assets belonging to bankrupt exchange FTX — including companies owned or acquired by the company prior to its collapse — was “eye opening,” Dibble added. FTX, for example, agreed in April to sell crypto derivatives platform LedgerX for $50 million, Reuters reported.\n\nThere is still plenty of demand for digital assets, Dibble noted. BlackRock CEO Larry Fink called crypto “flight-to-quality” assets for some investors.\n\nFinancial institutions, eager to serve their existing clients and attract new ones interested in balancing crypto-heavy portfolios with more conventional financial assets, are likely to seek opportunities in providing cryptocurrency services, Dibble told Blockworks.\n\n“For those reasons, I think there will be more deal-making in the headlines in 2024 than there was in 2023,” he said.\n\nMany crypto companies — particularly those tied to trading volumes and crypto prices — have improving fundamentals moving into 2024, Risley said.\n\nBitcoin (BTC) and ether (ETH) are up roughly 155% and 85%, respectively, year to date.\n\nThe Architect Partners founder added: “This thaw likely gradually opens the aperture for management teams to regain comfort with executing on strategic initiatives via mergers and acquisitions.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]