[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGlzLWF1dG9tb2JpbGUtZ2lhbnQtbm93LWFjY2VwdHMtcmlwcGxlLXhycC1hbmQtc2hpYmEtaW51LXNoaWItZm9yLXBheW1lbnRzL9IBamh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGlzLWF1dG9tb2JpbGUtZ2lhbnQtbm93LWFjY2VwdHMtcmlwcGxlLXhycC1hbmQtc2hpYmEtaW51LXNoaWItZm9yLXBheW1lbnRzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Oct 2023 07:00:00 GMT",
        "title": "This Automobile Giant Now Accepts Ripple (XRP) and Shiba Inu (SHIB) for Payments - CryptoPotato",
        "content": "The Japanese automobile manufacturer Honda has jumped into the cryptocurrency bandwagon by embracing several digital assets as payment options.\n\nInterestingly, Ripple’s native token – XRP, and the popular memecoin Shiba Inu (SHIB) are among the supported ones.\n\n‘Drive Into the Future’ With Crypto\n\nThe Tokyo-based manufacturer of automobiles, motorcycles, and power equipment – Honda Motor Co. – partnered with the blockchain payment system FCF Pay to allow clients to lease or purchase company products in digital currencies instead of fiat.\n\nSome of the accepted assets are the two largest by market capitalization – Bitcoin (BTC) and Ether (ETH) – as well as Ripple (XRP), Shiba Inu (SHIB), Binance Coin (BNB), Polkadot (DOT), and many more.\n\nIt is worth mentioning that Honda’s offering also includes some exotic memecoins such as Pepe Coin (PEPE), Floki Inu (FLOKI), Bone ShibaSwap (BONE), Doge Killer (LEASH), and others.\n\nSuch digital assets have emerged as a top trend in the crypto space in the past few years as the first to see the light of day (which actually started as a joke) was Elon Musk’s favorite Dogecoin (DOGE). Despite that, it has turned into one of the leaders in the realm, with a current market cap of over $8.6 billion.\n\nWe have also released a special video explaining what exactly are memecoins and their purpose. Those who are curious to learn more can click on the video below:\n\nWho Else Embraced XRP and SHIB?\n\nShiba Inu (SHIB) made the headlines earlier this week when FCF Pay collaborated with the Texas-based energy company Chariot Energy to enable locals to pay their solar panel bills in the memecoin instead of fiat.\n\nAnother major announcement revealed that eligible clients of the British banking behemoth HSBC can settle their mortgage bills and loans in various cryptocurrencies, including XRP and SHIB."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1zZWNzLWFwcGVhbC10ZW5zaW9ucy1yaXNlLXJpcHBsZS1hbmQtY29pbmJhc2UtY2FzZXMtaW50ZXJzZWN0LTEzNzc5MDHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Oct 2023 07:00:00 GMT",
        "title": "XRP News: SEC's Appeal Tensions Rise, Ripple and Coinbase Cases Intersect - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZGFpbHljb2xsZWdpYW4uY29tLzIwMjMvMTAvdGhlLXJpcHBsZS1lZmZlY3Qtb2YtYmFyYmllL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Oct 2023 07:00:00 GMT",
        "title": "The ripple effect of 'Barbie' – Massachusetts Daily Collegian - The Massachusetts Daily Collegian",
        "content": "By Mary DeCarlo, Collegian Contributor\n\n“Barbie” sold more tickets faster than any other movie in all of Warner Brother’s history. One of the biggest events of the summer was “Barbenheimer” on July 21, when “Oppenheimer” and “Barbie” were released in theaters. While both movies were instant blockbusters, Greta Gerwig’s “Barbie” exceeded all expectations. “Barbie” is now Warner Brother’s highest-grossing global release ever, surpassing “Harry Potter and the Deathly Hallows: Part 2.”\n\nWhile the film’s immense amount of success cannot be debated, is the film industry responding to it properly? “Barbie” is a movie about many complicated themes surrounding womanhood: femininity, aging, motherhood and more. Instead of taking these themes as reasons for the film’s success, the movie industry is responding to it by churning out as many movies about toys as possible.\n\nA movie about the beloved toy “Polly Pocket” starring Lily Collins and directed by Lena Dunham is currently in the works, according to Variety. So is a “Hot Wheels” movie directed by J.J. Abrams. Movies based on “Thomas the Tank Engine,” “Uno,” “Barney” and the “Magic 8 Ball” are all in pre-production, too. A majority of these films were announced after “Barbie’s” smash hit success, as Mattel and other companies sought to profit from this supposed “new” market of movies based on nostalgic toys.\n\nActor Randall Park said it best in an interview with Rolling Stone: “’Barbie’” is this massive blockbuster, and the idea is: Make more movies about toys! No — make more movies by and about women!”\n\nWhile part of “Barbie’s” success certainly came from the nostalgia of the toy from their own childhood’s, movie-goers left contemplating the hypocrisy of womanhood. Greta Gerwig’s interpretation and execution of the most iconic doll of all time is the first woman-directed film to reach $1 billion at the box office, according to CBS news.\n\nBank of America said there was a spike in money spent on entertainment in July 2023 and credits it to the cultural phenomenon, “Barbenheimer.” The release of “Barbie” has made a measurable impact on the economy since its release. On opening weekend, 69 percent of the film’s ticket buyers were women, according to The Hollywood Reporter. So why don’t movie studios realize women are a massive factor in the film’s success?\n\nA movie being successful because of its commentary on womanhood is so far-fetched that top executives probably don’t even consider it as a viable option. People couldn’t possibly like a movie because it points out the hypocrisy women constantly face and how aging is a beautiful process. At least, that is what Hollywood believes.\n\nInstead of giving resources to women in the film industry who want to make movies about womanhood, studios put their resources into making movies about a deck of cards and toy cars. They don’t see the potential of movies with similar themes as “Barbie,” and it will take a lot more than Randall Park calling them out on it to see some actual change.\n\nDoes a movie about “Barney” or “Thomas the Tank Engine” have the potential to garner the same hype that “Barbie” did? “Barbie” was the first movie of its kind to showcase the level of box office success that it did. We can only hope that Hollywood will soon realize its mistake in underestimating “Barbie” and will finally give more movies like it a chance: movies where the main character isn’t reduced to a romantic interest or the cellulite on her thighs.\n\nMary DeCarlo can be reached at [email protected]"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vdGhlY29sbGVnZWludmVzdG9yLmNvbS8yMTA3OS9pbnZlc3QtcmlwcGxlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Oct 2023 07:00:00 GMT",
        "title": "How To Invest In Ripple (XRP) Step-By-Step - The College Investor",
        "content": "Investing in cryptocurrency and crypto assets is high risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong. Investing in cryptocurrency and crypto assets is high risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong.\n\nRipple is currently the sixth most popular cryptocurrency by market-cap. But beyond the financials, the story of Ripple and XRP is a soap opera for both investors and tech connoisseurs. It's important to note that Ripple is the company, and XRP is the coin, but most people simply call it Ripple. Ripple (XRP) is a different than many other popular cryptocurrencies because it was created by a private, for-profit company. This company wanted to enable a frictionless way to send money globally, and its coin Ripple is the way it does it. This company is also the largest holder of Ripple today. The problem is, Ripple isn't the easiest crypto currency to buy, and in 2020, the SEC filed charges against Ripple and two founders in regard to XRP. As a result of the this action, most centralized exchanges (like Coinbase) have suspended trading on XRP. See the SEC action here. However, on July 13, XRP won the lawsuit and the court declared that XRP is not a security. That lead to a huge rally, but we're still waiting on exchanges to re-allow XRP trading. However, even with these headwinds, XRP is still extremely popular. And while it's not as simple to invest in, there are still platforms where you can do it (and we list them below). Here's how to invest in XRP and what you need to know.\n\nWhat Is Ripple? Ripple was originally (and still is) a payment processing platform that allows global transactions using it's coin, XRP. It's global payment network was started in 2012, and has continued to grow as companies have adopted it, and currency speculators have taken interest in Ripple. Ripple uses a blockchain ledger similar to Bitcoin and other crypto-currenies, but it also has come technical differences that claim to make it easier to process transactions, and more importantly, faster while remaining secure. How Ripple Is Different Ripple is different than it's major competitors Bitcoin and Litecoin in that it was created by a private, for-profit company. When it was created, 100 billion XRP were released into the market, with 20 billion being held by the creators and the rest being given to Ripple Labs. Ripple Labs has since placed 55 billion XRP in an escrow account to ensure users stability in the marketplace. It's important to note that Ripple has been called a \"Bitcoin-killer\" since at least 2014, but it's only in the last several years has gained real traction and momentum among crypto-currency enthusiasts. Ripple has had explosive price increases similar to other currencies, but it's still very \"cheap\" in terms of price - roughly $0.30. Right now, the biggest driver of XRP prices seem to be updates in the SEC trial.\n\nHow To Invest In Ripple First, realize that Ripple is subject to an SEC investigation and many exchanges have de-listed the token. These directions are outdated. Where To Invest in XRP In 2022: With the SEC investigation, many exchanges have de-listed XRP. You can still hold your XRP at places like Coinbase, but you can't transact with it. Rumors are that Coinbase will allow XRP trading again shortly, but until then, Uphold, Kraken and Coinmama are a couple of your options. You can also still store your XRP on a hardware wallet like Ledger. If all that sounds foreign, check out this guide on How To Invest In Cryptocurrency. With that said, here's the steps you need to invest in XRP: 1. Create A Uphold Account The first thing you need to do is setup a Uphold account. Uphold is a very popular choice because they have some of the most popular currencies easily available for purchase on their app or website. Read our full Uphold review here. One of these is XRP (Ripple) - which you can easily buy on the app, along with Bitcoin and others. Plus, you can easily transfer US dollars in and out as well.\n\n2. Buy Ripple Once you have your Uphold account opened, and some USD or other crypto in your account at Uphold, you can buy XRP. In your Uphold account, simply click on Ripple (XRP) and place a trade. Once you place your trade, it will show up in your Uphold account. Having everything in your Uphold account makes tracking and following up on your cryptocurrency easy.\n\nMajor Ripple Projects Even though Ripple has been mired in issues with the SEC, it hasn't stopped it from continuing to grow and develop its network. For example, Ripple is the underlying network that powers the Futureverse, which is the company behind FLUF World, Root Network, and more. They have announced huge partnerships with FIFA and are a huge driver for growth in the NFT space."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LmhhY2tzdGVyLmlvL3Njb3R0cG93ZWxsNjkvbGlseWdvLXQtZGVjay1zdXBwb3J0LTQ1ZTdlZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Oct 2023 07:00:00 GMT",
        "title": "LILYGO T-Deck Support - Hackster.io",
        "content": "Introduction\n\nI have done a series of articles on how to make my Ripple LoRa pager. For those that just want to skip to the chase and get a gadget in their hands and start playing, then the T-Deck is for you. And now, I have ported the Ripple firmware to this hardware.\n\nHardwareSetup\n\nThere is only a modest amount of soldering involved, or if you have the right connector, then none at all. This build requires adding a GPS receiver, for which the T-Deck has a 4-pin connector on the side. You just need to observe the pin order (these are labelled on the back of the PCB) and map the wires to the GND, VCC, TX, RX of the GPS. (NOTE: the TX/RX should be swapped, ie. TX -> RX, RX -> TX)\n\nGPS wiring\n\nI opted to solder the GPS directly to the pins exposed on the PCB, rather than using the connector.\n\nConnect a 1-cell (3.7V) Lithium battery to the connector in the lower-left. (NOTE: ensure the polarity is correct or you will fry the board!)\n\nFlashing the Firmware\n\nFirst, download the firmware.\n\nNOTE: some people are reporting this link doesn't work. You may need to enable popups, if you are using things like ad blockers.\n\nTurn on the T-Deck by sliding the power switch on the right-hand side downward.\n\nYou can use any ESP32 flashing tool to flash the firmware. I have a general guide here. NOTE: the T-Deck must first be placed into DFU mode by pressing down the trackball, holding it down the clicking the small reset button on the left-hand side.\n\nSetup/Configuration\n\nYou should see the 'Powered by Ripple' logo appear for a few seconds. The initial screens show some basic help, like how to use the trackball to navigate, and how to access the 'Extras' menus in various screens (Shift+0).\n\nFor a fresh install you will be prompted to press the ENTER key to do a one-time generation of your public/private keypair, which get stored in the device.\n\nSet your ID\n\nYou should be automatically taken the Set ID screen:\n\nYou must assign a unique ID in the range of 2..250 for yourself. You need to collaborate with your group and manage this yourself--there is no central server!\n\nNOTE: for numerical input screens you can either type in the digits with the keyboard (use the 'SYM' key), or you can scroll up/down using the trackball.\n\nPress ENTER to then go the Set Name screen:\n\nAfter entering name, press ENTER. A reboot is then needed. (switch the power off then on, or press the small reset button on the side).\n\nInitial Boot\n\nYou will see the screen below, after the logo:\n\nThe device needs to know the current time, and gets this from the GPS satellites. You can skip this but, I highly recommend just waiting. For brand new GPS modules, this may take around a minute for the satellite almanac data to be downloaded.\n\n(if this takes too long, double-check your wiring of your GPS module)\n\nRadio Configuration\n\nYour group needs to use the same centre LoRa frequency and Spreading Factor (SF). From the Home screen, navigate into the Setup item, then scroll down to Radio:\n\nThe defaults are OK, but you may want to customise these:\n\nThen press ENTER to go to next screen:\n\nA reboot is then needed.\n\nTimezone\n\nThis is optional but I recommend setting your timezone, especially if some people in your group are using the Ripple Messenger Android app with a pager device. These will show GMT times if you don't do the timezone setup. In the Setup screen, select Timezone:\n\nYou can use the trackball up/down to select.\n\nAdding Contacts\n\nThere is a special 'chat room' for exchanging keys with other users. Select Setup, then Exchange. You will be prompted for a 4-digit passcode, which can be anything, but one that you will all use. (NOTE: this is just for this session. You can pick a different passcode each time)\n\nYou will then be shown the Exchange screen menu:\n\nWhen everyone is 'in', select SEND, and everyone will receive your ID/Name and public key. (public key is not displayed as it's way too long to display). When others do SEND, you should see it appear like so:\n\nScroll down to see the 'ADD' action. Press ENTER to add. You should then get this confirmation:\n\nRepeat this for however many other users there are. NOTE: you can do this exchange at ANY time.\n\nNOTE: I recommend rebooting the device after new/updated contacts!\n\nBack at the Home screen you should see the new contact(s):\n\nConversations\n\nJust scroll to the contact, then navigate into (scroll right or press ENTER). The conversation screen will have the name in the title, and to the right is a 'WiFi'-like icon which shows if their device is currently reachable:\n\nIf the other device also has a GPS, and they have their GPS permission set to ALLOW, you will also see a rough bearing and distance to them!\n\nSimply start typing to compose a message to send, pressing ENTER once completed. The text will flash while it is being sent over the mesh. If send failed, the text stops flashing and remains at the bottom (for retry just press ENTER again). If successful, the message goes up into the conversation screen:\n\nIncoming messages can appear at any time, and shown left-aligned:\n\nLong messages will automatically be scrolled horizontally. You can scroll up/down the conversation with the trackball.\n\nYou can access the extras using the Shift+0, for extra actions available for this conversation/contact:\n\nIncoming Messages\n\nWhen the screen is off (or in standby), incoming message previews are shown full-screen:\n\nYou can navigate right (or press ENTER) to jump straight into the conversation, or navigate back to the Home screen. If there are any new/unread messages, you will see counters next to the contact:\n\nHome 'extras'\n\nAt the home screen, the extras menu (Shift+0) has some settings, and menus for other screens. NOTE: Not all of these are supported yet.\n\nThe GPS location [ALLOW/DENY] is to set the permission of whether others should see your location.\n\nGPS Waypoints is for capturing locations and storing them along with a descriptive name. You can later send these waypoints in messages, or you can see a live bearing and distance to them.\n\nNEW: 'Ultra' Firmware Released\n\nI have uploaded the new firmware to the BuyMeACoffee page. The big new feature is Maps! The new version includes a tile-based map renderer! You now can also navigate the UI using the touch screen.\n\nNew 'Ultra' firmware\n\nFuture Direction\n\nI have noticed that the T-Deck is very power hungry :-( This initial port doesn't have any power optimisations. I will have to do a lot of experimentation, and try to find what power savings can be taken advantage of.\n\nAny feedback is welcome. I hope to refine this variant of the QWERTY pager, and take advantage of the colour screen more. For now, the UI code is almost identical to the other builds (for the 128x64 OLEDs), and have just scaled the various X/Y coordinates. For now, it's decent and fairly clean as far as UIs go.\n\nI will be putting all bonus Ripple-related news, downloads, etc on my BuyMeACoffee page. Your support is much needed!\n\nOK, that's it for now. Enjoy.\n\nregards,\n\nScott Powell."
    }
]