[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbmdhcGUuY29tL3hycC1uZXdzLXJpcHBsZS1sYXdzdWl0LXN1bW1hcnktanVkZ2VtZW50LWZlZG5vdy1jcnlwdG8v0gFRaHR0cHM6Ly9jb2luZ2FwZS5jb20veHJwLW5ld3MtcmlwcGxlLWxhd3N1aXQtc3VtbWFyeS1qdWRnZW1lbnQtZmVkbm93LWNyeXB0by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "Why July 1, 2023 Is Important Date For Ripple Lawsuit Judgement? - CoinGape",
        "content": "Crypto Market News: With the U.S. Securities and Exchange Commission (SEC) lawsuit against Ripple Labs taking a new turn with the public release of Hinman Speech related files, the onus is now on Judge Analisa Torres to deliver the much awaited Summary Judgement. In essence, the Hinman documents revealed that the SEC was in favor of Ethereum, compared to other crypto tokens. Hinman emphasized that digital assets offered as securities can eventually change into a non-security asset. However, he chose to name only Ethereum as not a security, while the XRP holders have been affected by the Ripple lawsuit on the same argument.\n\nAlso Read: Mark Cuban Tried To Register Crypto Token With SEC; What Happened?\n\nadvertisement\n\nIn March 2023, Judge Torres ruled on motions filed by both parties to rule out expert testimony. Over 100 days from the March ruling, the Summary Judgement is still awaited. This delay is longer than the Judge’s average time taken from Daubert rulings in previous cases, and hence, the Summary Judgement in Ripple lawsuit is expected to come any time.\n\nRipple XRP Victory Judgement Before July 1, 2023 ?\n\nThe US Federal Reserve had already announced that the FedNow Service will begin operations in July 2023. The service facilitates instant payment services by financial institutions all over the United States, around the clock and throughout the year. Interestingly, among the banks that have been onboarded for the July 1 launch are three Ripple partnered banks: Finastra, Volante Technologies and ACI Worldwide. Hence, the crypto community is wondering whether the Ripple lawsuit judgement has to be delivered before FedNow launch to ensure legal compliance.\n\nAlso Read: Macro Guru Raoul Pal: Gary Gensler “Not Stopping Crypto Entirely”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbmdhcGUuY29tL3hycC1uZXdzLXJpcHBsZS1sYXdzdWl0LXN1bW1hcnktanVkZ2VtZW50LWZlZG5vdy1jcnlwdG8v0gFRaHR0cHM6Ly9jb2luZ2FwZS5jb20veHJwLW5ld3MtcmlwcGxlLWxhd3N1aXQtc3VtbWFyeS1qdWRnZW1lbnQtZmVkbm93LWNyeXB0by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "Why July 1, 2023 Is Important Date For Ripple Lawsuit Judgement? - CoinGape",
        "content": "Crypto Market News: With the U.S. Securities and Exchange Commission (SEC) lawsuit against Ripple Labs taking a new turn with the public release of Hinman Speech related files, the onus is now on Judge Analisa Torres to deliver the much awaited Summary Judgement. In essence, the Hinman documents revealed that the SEC was in favor of Ethereum, compared to other crypto tokens. Hinman emphasized that digital assets offered as securities can eventually change into a non-security asset. However, he chose to name only Ethereum as not a security, while the XRP holders have been affected by the Ripple lawsuit on the same argument.\n\nAlso Read: Mark Cuban Tried To Register Crypto Token With SEC; What Happened?\n\nadvertisement\n\nIn March 2023, Judge Torres ruled on motions filed by both parties to rule out expert testimony. Over 100 days from the March ruling, the Summary Judgement is still awaited. This delay is longer than the Judge’s average time taken from Daubert rulings in previous cases, and hence, the Summary Judgement in Ripple lawsuit is expected to come any time.\n\nRipple XRP Victory Judgement Before July 1, 2023 ?\n\nThe US Federal Reserve had already announced that the FedNow Service will begin operations in July 2023. The service facilitates instant payment services by financial institutions all over the United States, around the clock and throughout the year. Interestingly, among the banks that have been onboarded for the July 1 launch are three Ripple partnered banks: Finastra, Volante Technologies and ACI Worldwide. Hence, the crypto community is wondering whether the Ripple lawsuit judgement has to be delivered before FedNow launch to ensure legal compliance.\n\nAlso Read: Macro Guru Raoul Pal: Gary Gensler “Not Stopping Crypto Entirely”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LnJpcHBsZXNuaWdlcmlhLmNvbS9zb3V0aC1hZnJpY2FuLWJpbGxpb25haXJlLW5vdy1yaWNoZXN0LXBlcnNvbi1pbi1hZnJpY2EtYWZ0ZXItZGFuZ290ZXMtd2VhbHRoLWRyb3BzLWJ5LTItODBibi_SAYABaHR0cHM6Ly93d3cucmlwcGxlc25pZ2VyaWEuY29tL3NvdXRoLWFmcmljYW4tYmlsbGlvbmFpcmUtbm93LXJpY2hlc3QtcGVyc29uLWluLWFmcmljYS1hZnRlci1kYW5nb3Rlcy13ZWFsdGgtZHJvcHMtYnktMi04MGJuLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "South African billionaire now richest person in Africa after Dangote’s wealth drops by $2.80bn - Ripples Nigeria",
        "content": "Aliko Dangote is no longer the richest man in Africa, as South African billionaire, Johann Rupert, displaces him as number one on Africa’s richest list.\n\nAccording to Forbes Billionaire Ranking seen on Sunday, Dangote’s net worth has dropped by 20.7% amid the naira devaluation implemented by the Central Bank of Nigeria (CBN).\n\nRipples Nigeria previously reported that CBN devalued the naira, which caused the value of the Nigerian currency to drop by 40.5% since the devaluation took place last week Wednesday.\n\nThe naira to dollar exchange rate closed Friday’s trading with N663.04/$1, up from N471.67/$1 on Tuesday, as a result of the devaluation.\n\nAmid the decline in the value of the naira, which is the denomination Dangote’s wealth is based on, the Nigerian billionaire fell to the second position on Africa’s richest list, while Rupert took the first spot.\n\nREAD ALSO:Egyptian, SA billionaires overtake Abdulsamad Rabiu on Africa’s richest list after naira devaluation\n\nDangote’s wealth dropped by $2.80 billion to $10.7 billion, from $13.5 billion, costing him the richest man position for the first time since 2008, when he debuted on the Forbes Billionaire Index.\n\nMeanwhile, Rupert became the richest man in Africa after his net worth increased by $1.3 billion from $10.7 billion to $13.5 billion.\n\nAlthough, according to Bloomberg Billionaire Index, Dangote remains the richest man in Africa with $16.8 billion, recording a year-to-date loss of $1.86 billion.\n\nRupert was placed on the second spot with a net worth of $13.6 billion, with a year-to-date gain of $2.67 billion.\n\nNote that Forbes and Bloomberg use different methodologies to arrive at the richest man in the world or Africa list, hence the difference in net worth and position of Dangote and Rupert.\n\nJoin the conversation\n\nOpinions\n\nSupport Ripples Nigeria, hold up solutions journalism\n\nBalanced, fearless journalism driven by data comes at huge financial costs.\n\nAs a media platform, we hold leadership accountable and will not trade the right to press freedom and free speech for a piece of cake.\n\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\n\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development.\n\nDonate Now"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vc3dpZnQtaW50ZWdyYXRpb24tdW5sb2NrZWQtcmlwcGxlcy14cnAtc3RlbGxhcnMteGxtLWFuZC1pb3RhLWxlYWQtdGhlLXdheS1pbi10aGUtYmlsbGlvbi1kb2xsYXItY3J5cHRvLW1hcmtldC_SAZYBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3N3aWZ0LWludGVncmF0aW9uLXVubG9ja2VkLXJpcHBsZXMteHJwLXN0ZWxsYXJzLXhsbS1hbmQtaW90YS1sZWFkLXRoZS13YXktaW4tdGhlLWJpbGxpb24tZG9sbGFyLWNyeXB0by1tYXJrZXQvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "SWIFT Integration Unlocked: Ripple’s XRP, Stellar’s XLM, and IOTA Lead the Way in the Billion-Dollar Crypto Market - Crypto News Flash",
        "content": "Ripple, Stellar, and IOTA are leading in a push that will pave the way for cryptocurrencies to integrate with SWIFT.\n\nTheir ready-to-use technology for payments, regulatory embrace, and involvement with ISO 20022 paves the way for possible integration with SWIFT.\n\nThree cryptocurrencies are leading the way in the billion-dollar crypto market in integrating SWIFT. The traditional financial sector is increasingly looking to merge with the modernized cryptocurrency market whose influence is increasingly growing.\n\nRipple, Stellar, and IOTA have made themselves the favorite for the finance sector to work with because of their ready-to-use technology for payments and their efforts to work within the existing regulatory framework. Stellar and IOTA are working towards ISO 20022 which is an ISO standard for electronic data interchange between financial institutions adopted across the world. Ripple has been a member of the body since 2020.\n\nAs CNF has reported, Ripple, XLM, and IOTA’s involvement with ISO 20022 paves the way for possible integration with SWIFT.\n\nRead More: Breaking Barriers: Ripple’s XRP, Stellar’s XLM, and IOTA Pave the Way with Possible SWIFT Integration, Dominating the Billion-Dollar Crypto Market\n\nAccording to Stephen Lindsay, the business lead for Swift’s strategic platform, the emergence of ISO 20022 has addressed some challenges including inefficiencies and increased costs developed by the old format of payment.\n\nWhen it comes to payments, it’s no different. When money moves across borders, we rarely think about the layers of communication before payment is executed. Over time, formats used for payments messages in different regions have developed idiosyncrasies requiring translation, creating bottlenecks that cause inefficiencies and increased costs.\n\nWhy Ripple, Stellar, and IOTA Lead in SWIFT Integration\n\nThe three crypto heavyweights are not only paving the way for their regulatory compliance and superior technology. The three have also taken a unique approach to solving real-world problems using their respective technologies.\n\nRipple has been pushing to succeed as a foremost blockchain payments firm targeting untapped markets such as in the Middle East, South America, and Africa to offer a real-time settlement of international payments. For the most part, this is achieved through strategic partnerships with local firms. The network is bringing financial inclusion in marginalized regions, promoting international settlements with speed and low fees, and facilitating payments.\n\nStellar on the other hand is looking into similar regions with the aim of banking the unbanked. While Ripple is focused on business-to-business transactions, Stellar solves the primary issues of the unbanked population. Recently, Moneygram executives hailed Stellar as the blockchain for payments.\n\nFinally, IOTA offers a unique solution to the problem of scalability within the industry. Its protocol allows for secure, feeless transactions between devices on the Internet of Things (IoT) paving the way for a new era of machine-to-machine transactions.\n\nRecommended for you:"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vaW5zaWRlYml0Y29pbnMuY29tL25ld3MvcmlwcGxlLXZzLXNlYy1sYXdzdWl0LXZlcmRpY3QtaW1taW5lbnQteHJwLXByaWNlLWNvdWxkLXJlYWNoLTEwLWZvcm1lci1zZWMtZGlyZWN0b3LSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "Ripple vs. SEC Lawsuit Verdict Imminent, XRP Price Could Reach $10, Former SEC Director - Inside Bitcoins",
        "content": "Don’t invest unless prepared to lose all the money you invest. This is a high-risk investment, you shouldn’t expect to be protected if something goes wrong.\n\nJoin Our Telegram channel to stay up to date on breaking news coverage\n\nRipple vs. SEC lawsuit draws closer to a verdict, and market watchers predict a surge in XRP price to $10 if Ripple wins. Adding to the excitement is a former SEC director who supports this expectation.\n\nWill the Ripple-SEC case conclude in days?\n\nRipple’s ongoing battle with the SEC will end soon, says a former SEC regional director and enforcement attorney.\n\nMore than two years in the making, the SEC-Ripple case is about to end.\n\nFormer Regional Director Marc Fagel of the San Francisco Regional Office of the SEC, told me a judge would rule on the XRP lawsuit soon. In response to a tweet, Fagel questioned the judge’s impartiality after the SEC withdrew its lawsuits before summary judgment.\n\nAdditionally, the tweet said delaying the verdict could create further confusion and reinforce the perception that public relations influenced the judge.\n\nFagel said a court decision in the Ripple case may be coming soon, without speculating. Rather than any hidden motives, he thought any further delay would be caused by the complexities of the case.\n\nIn late 2020, the SEC sued Ripple, its CEO Brad Garlinghouse, and chairman Chris Larsen. By selling XRP, unregistered security, they illegally raised over $1.2 billion.\n\nXRP community members were shocked by William Hinman’s recent materials. Legal counsel for Ripple argued that Hinman’s statement in 2018 that Ether, the token of Ethereum, was not a security created confusion and led Ripple and others to believe that XRP was similarly not a security as well.\n\nFagel highlighted the differences between Ripple’s case and other recent actions taken by the SEC. In his opinion, the judge is unlikely to discuss the Hinman documents or the secondary market trading issue. Nevertheless, the emails may be considered when determining the defendant’s liability.\n\nXRP Attorney Highlights Ripple Lawsuit Mistake; Will XRP Surge to $10?\n\nOn Twitter, XRP holders’ lawyer John Deaton reminded everyone that charging individual executives with aiding and abetting in the lawsuit was a bad idea. He says neither Ripple executive would be considered reckless by a fair jury.\n\nIn addition to XRP, the SEC’s intense battle with Ripple has huge implications for the entire cryptocurrency industry. Chairman Gary Gensler has consistently said all cryptocurrencies, except Bitcoin, should be classified as securities.\n\nThe Commission intends to examine and regulate more crypto assets closely. The loss of the case would negatively impact cryptocurrency adoption, empower the SEC to take similar legal action, create instability in the market, and make ambitious crypto startups look elsewhere for better regulatory environments.\n\nEarly this month, Deaton said there was only a 3% chance that District Judge Analisa Torres would rule in the SEC’s favor.\n\nAs a result, Ripple’s win would increase trust and belief in cryptocurrencies, opening doors to new investments. In such a scenario, Deaton thinks Ripple’s XRP could skyrocket to $10 or higher.\n\nThe cryptocurrency market could get a big boost from this for Ripple. XRP would get a huge boost in value as investors flock to it."
    }
]