[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vdS50b2RheS9yaXBwbGUtd2lyZXMtbWlsbGlvbnMtb2YteHJwLWFzLXByaWNlLXNob3dzLXdlZWtseS1zdXJnZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ripple Wires Millions of XRP as Price Shows Weekly Surge - U.Today",
        "content": "Whale Alert crypto tracker spreads the word that slightly over 12 hours ago, Ripple fintech decacorn initiated a transaction that carried a massive 50,000,000 XRP tokens worth $25,657,347.\n\nAdvertisement\n\nThe transaction was made to an unknown wallet, according to the description provided by Whale Alert.\n\nThe destination, according to details provided by the above-mentioned source, turned out to be another Ripple wallet. After receiving the said 50,000,000 XRP, this wallet transferred 130,000,000 million XRP to other wallets in three chunks — 30,000,000 XRP and two transactions carrying 50,000,000 XRP each. Those wallets also belong to Ripple Labs.\n\nEarlier this week, Whale Alert spotted a whopping 120,000,000 XRP withdrawn from major crypto exchange Bithumb located in South Korea. However, it proved to be a transaction between Bithumb's internal blockchain addresses.\n\nWithin the past week, Ripple-affiliated XRP token has demonstrated a price rise of 4.65%, currently changing hands at $0.51286. That weekly price growth includes a 6.87% price surge staged by XRP until Wednesday, Sept. 20, followed by a decline."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnNpYXNhdC5jb20vc2hhcmFkLXBhd2Fycy12aXNpdC10by1nYXV0YW0tYWRhbmlzLXJlc2lkZW5jZS1jcmVhdGVzLXJpcHBsZXMtMjcwNDEwMS_SAWJodHRwczovL3d3dy5zaWFzYXQuY29tL3NoYXJhZC1wYXdhcnMtdmlzaXQtdG8tZ2F1dGFtLWFkYW5pcy1yZXNpZGVuY2UtY3JlYXRlcy1yaXBwbGVzLTI3MDQxMDEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Sharad Pawar’s visit to Gautam Adani’s residence creates ripples - The Siasat Daily",
        "content": "Ahmedabad: Senior Opposition leader and Maratha strongman Sharad Pawar’s meeting with billionaire industrialist Gautam Adani in Ahmedabad is causing ripples in the political circles.\n\nSources said the Nationalist Congress Party (NCP) supremo visited Adani’s office and residence in Ahmedabad on Saturday.\n\nPawar later posted on X: “It was a privilege to inaugurate India’s first Lactoferrin Plant Exympower in Vasna, Chacharwadi, Gujarat, along with Mr. Gautam Adani.”\n\nIt was a privilege to inaugurate India’s first Lactoferrin Plant Exympower in Vasna , Chacharwadi , Gujarat along with Mr. Gautam Adani pic.twitter.com/G5WH9FaO5f — Sharad Pawar (@PawarSpeaks) September 23, 2023\n\nPawar is a prominent member of the Opposition INDIA bloc and his meeting with Adani, who has been targeted repeatedly by the Congress and other Opposition parties with demands of a probe by a Joint Parliamentary Committee (JPC) into the Hindenburg-Adani issue, has raised eyebrows.\n\nPawar and Adani had held meetings in April and June this year, which had also raised the political temperature.\n\nAlso Read Both NCP factions say there is no split, no dispute in party\n\nThe first meeting of INDIA coordination committee was held at Pawar’s residence in New Delhi earlier this month where several issues were discussed.\n\nThe INDIA bloc had announced a 14-member coordination committee featuring prominent Opposition leaders during its third meeting in Mumbai on September 1."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzA5LzIzL2V4cGVydC1zdWdnZXN0cy14cnAtd291bGQtc3BlbmQtNS1tb3JlLXllYXJzLWJlZm9yZS1oaXR0aW5nLW5ldy1hdGgtY2l0ZXMtaGlzdG9yaWNhbC1kYXRhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Expert Suggests XRP Could Spend 5 More Years Before Hitting New ATH, Cites Historical Data - The Crypto Basic",
        "content": "EGRAG, a seasoned analyst, opines that XRP may require an additional five years before it achieves a new all-time high, drawing from comprehensive historical data of the asset’s prior peaks.\n\nEGRAG revealed this in a recent analysis, suggesting that XRP investors might need to exercise patience for an extended duration before witnessing a substantial increase in the value of their XRP holdings.\n\nThe report delves into the prospective scenarios that XRP might confront in the years preceding what some foresee as the impending financial crisis.\n\n- Advertisement -\n\nXRP to Lead the Next Financial Revolution\n\nOne fundamental premise in EGRAG’s analysis is the belief that the forthcoming financial crisis may exceed the scale of the 2008 global economic turmoil. This pivotal event played a role in the creation of Bitcoin (BTC), the firstborn crypto.\n\nNevertheless, in the current era of digital transformation, EGRAG and his associate emphatically assert that XRP emerges as the leading contender to claim the mantle of digital monetary supremacy.\n\nThis conviction stems from XRP’s distinctive characteristics, such as its remarkable speed, efficiency, and cost-effectiveness. Per EGRAG, these traits position XRP as a formidable force in transforming the financial landscape.\n\nAn Elongated Wait Time\n\nAlthough the potential for XRP to revolutionize the financial sector is undeniable, EGRAG’s analysis indicates that the path to achieving this transformation may necessitate more time than originally envisaged.\n\n- Advertisement -\n\nThis revelation stems from a pivotal observation: XRP’s price fluctuations appear to adhere to a pattern corresponding to a factor of 3.16 times the duration of the preceding cycle.\n\nTo offer context, EGRAG compares historical XRP peaks and the intervals separating them. He highlights that the 2013 high aligns with the 2018 peak, while the high of 2014 corresponds with the 2021 peak.\n\nBy applying this 3.16 factor to the ongoing cycle, EGRAG concludes that this current cycle spans 2,632 days from the peak of 2014. He arrived at this by multiplying 3.16 with the 833 days between the 2014 high and the end of that cycle.\n\nIn practical terms, XRP enthusiasts and investors may need to wait longer before a new ATH. EGRAG’s projection suggests that the XRP market could experience a prolonged consolidation phase before embarking on the anticipated rally.\n\nHowever, the analyst failed to provide specific price targets for this rally. Meanwhile, XRP is trading for $0.5121, up 0.71% over the past 24 hours. In the short term, EGRAG previously predicted an XRP rally to $1.4"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS1sYXd5ZXItam9obi1kZWF0b24tZGVuaWVzLWhhdmluZy1hbnktaW5zaWRlci1pbmZvcm1hdGlvbi1vbi1yaXBwbGUtaW5jL9IBbWh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS1sYXd5ZXItam9obi1kZWF0b24tZGVuaWVzLWhhdmluZy1hbnktaW5zaWRlci1pbmZvcm1hdGlvbi1vbi1yaXBwbGUtaW5jL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "XRP Lawyer John Deaton Denies Having Any Insider Information on Ripple Inc. - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights John Deaton denies that he had insider information about Ripple's expansion plans, asserting that he was merely an observer.\n\nRipple's strategy to expand internationally and hire 80% of its workforce outside the United States is highlighted.\n\nDespite a recent court ruling, the SEC persists in its classification of XRP as a security.\n\nA recent misunderstanding in the world of cryptocurrency stirred quite a commotion. A crypto enthusiast on a platform known as “X” misinterpreted a post by John Deaton, leading to widespread belief that Deaton possessed insider information about Ripple Inc.\n\nHowever, John Deaton swiftly addressed this misconception, setting the record straight.\n\nHere’s what happened and why it caused the kind of controversy it did!\n\nA Little About Deaton…\n\nJohn Deaton, a well-known advocate in the crypto sphere, is renowned for his candid expression of opinions. He is often perceived as having a deep understanding of the inner workings of businesses. Recently, he garnered attention by hinting at Ripple Labs expanding its workforce in Dubai, Singapore, and London to solidify its presence in Asia and Europe.\n\nMichael Branch, however, wrongly attributed this information to Deaton, claiming he possessed insider knowledge.\n\nAlso Read: XRP Lawsuit: SEC Can only Settle with Ripple Only in One Condition, Says John Deaton\n\nBashing the False Claims\n\nDeaton explained that he never said anything about having inside knowledge in reaction to the erroneous assertion. He explained that he had no inside information but was simply present as an audience at Mainnet.\n\nDeaton further goes on to state that Ripple’s expansion plan suggests that it will also begin to operate outside of the United States. It had already stated that 80% of its hiring will be outside the States.\n\nThe comments on the misinformer’s X post also sarcastically condemned him. One says, “International companies hire more staff… in international cities.”\n\nRipple CEO Brad Garlinghouse told Bloomberg that “governments are partnering with the industry, and you’re seeing leadership, they’re providing clear rules, and you’re seeing growth in Hong Kong, Singapore, the United Kingdom, and Dubai.”\n\nSEC vs. Ripple: A Long, Exhausting Battle\n\nFor over three years, the Securities and Exchange Commission (SEC) has been embroiled in a legal battle with Ripple, arguing that its XRP coin should be classified as a security. However, a pivotal moment occurred on July 17th when Judge Analisa Torres ruled that XRP is not a security. Nevertheless, the SEC remains steadfast in its stance, challenging the court’s judgment.\n\nRather, the regulator wishes to file an interlocutory appeal in which an appellate court will re-examine Judge Torres’ ruling. The judge has approved the request, and community members are anxiously monitoring the developments.\n\nRecently, XRP’s lawyer accused the SEC of spreading misinformation and frauding people with its anti-legislative views. The result of these new developments still remains to be seen."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LndiZXoub3JnL3BvbGl0aWNzLzIwMjMvMDkvMjMvZ292ZXJubWVudC1zaHV0ZG93bi13b3VsZC1waW5jaC1pbGxpbm9pcy1yZXNpZGVudHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Government shutdown would pinch Illinois residents - WBEZ Chicago",
        "content": "Federal lawmakers from Illinois are calling on their Republican colleagues in the House to push a dozen appropriation bills over the finish line, in hopes of dodging a massive government shutdown. Congress has until Oct. 1 to pass them.\n\nIf Congress doesn’t pass a spending bill by then, hundreds of thousands of federal employees would be forced to work without pay or stop working at all, bringing government services to a halt.\n\nDemocratic Rep. Sean Casten says he and other lawmakers received a list of government employees who would be furloughed in the event of a shutdown, which includes about 244,000 people from the Department of Homeland Security.\n\n“Which means people defending our borders, people working T.S.A. at the airports would just be sent home,” Casten said.\n\nHere in Illinois, the department of revenue gets tax information from the IRS on a regular basis. Director David Harris says if the IRS were to shut down and put government employees out of work for a long time, that could have downstream consequences for the state.\n\n“[The shutdown] clearly then impacts individual tax revenue, because 80% of our individual tax revenue comes from withholdings that people get in their paycheck,” Harris said. “If for some reason, people aren’t working for a period of time while the government is shut down. That lowers tax revenue to the state of Illinois.”\n\nThe Illinois Department of Human Services is also monitoring the situation in Washington, D.C. In a statement, the agency said it plans to conduct business as usual through October. But if the shutdown stretched into November, the agency says it would shift to state funding for a period of time.\n\nThe bills, which have already been passed by the Senate, call for funding several government agencies and services, such as the National Park Service and the Department of Defense.\n\nA small group of far-right House Republicans has been trying to block the 12 spending bills as they move through different committees and threatening to oust Speaker Kevin McCarthy if he brings the bills — which were already agreed upon by leaders from both chambers in June — to the House floor.\n\nThe group, which includes representatives Marjorie Taylor Greene and Matt Gaetz, have been demanding steep budget cuts. This past Thursday, they voted against a defense appropriation bill — which included more than $13 billion in emergency aid for Ukraine — from advancing.\n\nCasten says McCarthy is reluctant to alienate that group, so the speaker has been trying to appease them.\n\n“Rather than saying to the Democrats and to the president, ‘We made a deal, let’s just go get this done and we’ll deal with it later,’ we’re careening into a shutdown,” Casten said.\n\nHe says it’s now up to McCarthy to honor the deal he made with party leadership and President Joe Biden earlier this summer.\n\n“All of us are only as good as our word,” Casten said. “So anything short of honoring the deal that we agreed to in June is unacceptable. A government shutdown would disrupt the lives of 330 million Americans.”\n\nDemocratic Rep. Danny Davis held a press conference in Chicago earlier this week — joined by Democratic state senators Lakesia Collins, Mattie Hunter and state Rep. Yolanda Morris — echoing those sentiments.\n\nPrograms like Medicaid, Medicare and Social Security are financed from other federal spending sources and would therefore not be affected by a shutdown. But Davis said a shutdown would complicate people’s lives.\n\n“They might want to travel and they can’t get a passport processed,” Davis said. “The research that goes on at places like the National Institute of Health could stop. It’s so unfortunate.”\n\nAgencies like the Food and Drug Administration and the Environmental Protection Agency would also have to stop inspections. And the Department of Health and Human Services would no longer be able to award grants for Head Start, a program providing early childhood education to lower-income families.\n\nDavis says a shutdown will also erode the public’s confidence in the federal government to perform basic functions.\n\nThat’s something John Shaw says has already been soured over the years.\n\n“This just reinforces their worst concerns, their worst apprehensions,” said Shaw, the director of the Paul Simon Public Policy Institute, part of Southern Illinois University-Carbondale. “Not only can the government not solve big problems like climate change, but it can’t even do the basics of keeping the government funded.”\n\nThere have been four federal shutdowns over the past 25 years, ranging from two days to nearly a month. Shaw says it’s not unusual for there to be a shutdown for a few days.\n\n“Some of the conservative Republicans who are threatening it now, if this actually were to unfold, I think they would quickly find out that they’re not getting any political credit,” Shaw said. “So they would effectively in a relatively short time pass a temporary spending bill.”\n\nMawa Iqbal covers Illinois state government and politics for WBEZ. Follow her @mawa_iqbal."
    }
]