[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vcmFkaW9pbmsuY29tLzIwMjMvMTIvMTgvYXBtLXBvZGNhc3QtcG9uZGVycy1kZWVwd2F0ZXItaG9yaXpvbnMtcmlwcGxlLWVmZmVjdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "APM Podcast Ponders Deepwater Horizon's Ripple Effect - Radio Ink",
        "content": "APM Studios and Western Sound are launching Ripple, a new investigative podcast, on January 11. Hosted by seasoned podcaster Dan Leone, Ripple delves into the long-term aftermath of the 2010 Deepwater Horizon Oil Spill, the largest oil spill in American history.\n\nLeone, known for his work on shows like Lost Hills, Strangeland, and The Score: Bank Robber Diaries, is joined by senior reporter and producer Betsy Shepherd. Shepherd, whose reporting has been featured on NPR, BBC, and has earned awards like the James Beard and Edward Murrow awards, brings depth and expertise to the narrative.\n\nRipple is a part of APM Studios’ mission to create podcasts reflecting diverse stories across the United States. The podcast especially follows the hidden, enduring impact of the spill on Gulf Coast communities. The first two episodes launch on January 11, with subsequent episodes released weekly through February 22."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy53dGhyLmNvbS9hcnRpY2xlL25ld3MvY3JpbWUvcG9saWNlLWludmVzdGlnYXRpbmctc3RyaW5nLWJyb2FkLXJpcHBsZS1idXJnbGFyaWVzLWluZGlhbmFwb2xpcy1pbmRpYW5hLzUzMS1hYmFlYmZkNS0zYTJlLTQ0NzQtODI1ZC04M2I3Y2NhYjczMTPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Broad Ripple business burglaries surveillance images - WTHR",
        "content": "Caliente Mexican Grill, Thai Café and Shalimar Indian Restaurant were all targeted in recent burglaries.\n\nExample video title will go here for this video\n\nNext up in 5\n\nExample video title will go here for this video\n\nNext up in 5\n\nINDIANAPOLIS — IMPD is investigating after three Broad Ripple businesses were burglarized.\n\nThe string of burglaries happened early Saturday morning in the Broad Ripple Station shopping plaza on Broad Ripple Avenue east of Winthrop Avenue.\n\nCaliente Mexican Grill, Thai Café and Shalimar Indian Restaurant were all targeted.\n\nLuis Scheker, the owner of Caliente Mexican Grill, said the suspect made out with a few hundred dollars in cash and stole a couple of bottles from the bar.\n\nThe owner of Shalimar Indiana Restaurant said the same happened there.\n\nPolice released surveillance photos Monday afternoon, asking for the public’s help to identify the person they believe is a suspect in at least two of the three burglaries."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yaXBwbGUtY29pbmJhc2UtYTE2ei1wbGVkZ2UtNzgtMDYxMTM2MDAwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Ripple, Coinbase, a16z Pledge $78 Million to Support Pro-Crypto Candidates in 2024 US Elections - Yahoo Finance",
        "content": "Ripple, Coinbase, a16z Pledge $78 Million to Support Pro-Crypto Candidates in 2024 US Elections\n\nThe Fairshake political action committee (PAC) announced that major industry firms and individuals, including Coinbase CEO Brian Armstrong, Tyler and Cameron Winklevoss, Circle, Coinbase, Kraken, Messari, and Andreessen Horowitz (a16z), have contributed $78 million to a substantial \"war chest\" to back candidates who advocate for American crypto and blockchain innovation, as well as responsible regulation, in the upcoming 2024 elections.\n\nThis comes as Ripple CEO Brad Garlinghouse took to X to express his disapproval of regulatory overreach in the United States and emphasized that Ripple, along with other industry leaders, will \"lead the charge\" in supporting \"pro-crypto\" candidates during the 2024 United States election season.\n\n\"Regulatory overreach (esp from the SEC) is actively moving the U.S. in the wrong direction, and other countries are taking full advantage of the lack of US leadership. We need to advance leaders who will champion innovation and spearhead paths towards responsible regulation,\" Garlinghouse wrote. The Ripple CEO further stressed the need to promote initiatives that foster \"transparency, innovation, and a compliance-first approach.\"\n\nAndreessen Horowitz (a16z) founder and managing director Chris Dixon also announced the firm's contribution to the Fairshake PAC in 2024. Dixon said:\n\n“There is a battle in Washington about the future of blockchain technologies: Certain policymakers believe it should be banned, while other people think it should have no guardrails. Neither of those options will allow the technology to reach its full potential and realign the future of the Internet away from Big Tech to the people who use it.”\n\nCryptocurrency firms operating in the U.S. have faced challenges in dealing with regulators in recent years. The Securities and Exchange Commission (SEC), in particular, has drawn criticism from industry players for its \"regulate-by-enforcement\" approach.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yaXBwbGUtY29pbmJhc2UtYTE2ei1wbGVkZ2UtNzgtMDYxMTM2MDAwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Ripple, Coinbase, a16z Pledge $78 Million to Support Pro-Crypto Candidates in 2024 US Elections - Yahoo Finance",
        "content": "Ripple, Coinbase, a16z Pledge $78 Million to Support Pro-Crypto Candidates in 2024 US Elections\n\nThe Fairshake political action committee (PAC) announced that major industry firms and individuals, including Coinbase CEO Brian Armstrong, Tyler and Cameron Winklevoss, Circle, Coinbase, Kraken, Messari, and Andreessen Horowitz (a16z), have contributed $78 million to a substantial \"war chest\" to back candidates who advocate for American crypto and blockchain innovation, as well as responsible regulation, in the upcoming 2024 elections.\n\nThis comes as Ripple CEO Brad Garlinghouse took to X to express his disapproval of regulatory overreach in the United States and emphasized that Ripple, along with other industry leaders, will \"lead the charge\" in supporting \"pro-crypto\" candidates during the 2024 United States election season.\n\n\"Regulatory overreach (esp from the SEC) is actively moving the U.S. in the wrong direction, and other countries are taking full advantage of the lack of US leadership. We need to advance leaders who will champion innovation and spearhead paths towards responsible regulation,\" Garlinghouse wrote. The Ripple CEO further stressed the need to promote initiatives that foster \"transparency, innovation, and a compliance-first approach.\"\n\nAndreessen Horowitz (a16z) founder and managing director Chris Dixon also announced the firm's contribution to the Fairshake PAC in 2024. Dixon said:\n\n“There is a battle in Washington about the future of blockchain technologies: Certain policymakers believe it should be banned, while other people think it should have no guardrails. Neither of those options will allow the technology to reach its full potential and realign the future of the Internet away from Big Tech to the people who use it.”\n\nCryptocurrency firms operating in the U.S. have faced challenges in dealing with regulators in recent years. The Securities and Exchange Commission (SEC), in particular, has drawn criticism from industry players for its \"regulate-by-enforcement\" approach.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1kZW1vY3JhdHMtdnMtcmVwdWJsaWNhbnMtdGhlLXVzLWNvdXJ0cy1hbmQtdGhlLXNlYy12cy1yaXBwbGUtMTM5NjYwNdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "XRP News: Democrats vs. Republicans, the US Courts, and the SEC vs. Ripple - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    }
]