[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTQveHJwLXR1bWJsZXMtOC1lcmFzaW5nLXByaWNlLWdhaW5zLWZyb20taGlubWFuLWVtYWlscy1pbi1yaXBwbGUtbGF3c3VpdC_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzE0L3hycC10dW1ibGVzLTgtZXJhc2luZy1wcmljZS1nYWlucy1mcm9tLWhpbm1hbi1lbWFpbHMtaW4tcmlwcGxlLWxhd3N1aXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "XRP Tumbles 8%, Erasing Price Gains from ‘Hinman Emails’ in Ripple Lawsuit - CoinDesk",
        "content": "Speculation about the lawsuit’s end have occasionally spurred enthusiastic XRP price predictions. “Currently, we observe huge speculative narratives around Ripple, which could potentially lead to a significant price increase for XRP in the next three to four months, pushing its value to anywhere between $10 and $30,” crypto hedge fund manager Thomas Kralow said in a note earlier this week."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9sZWFybi93aHktd2lsbGlhbS1oaW5tYW5zLWVtYWlscy1tYXR0ZXItdG8tdGhlLXhycC1hcm15LWFuZC10aGUtY3J5cHRvcy1wcmljZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Why Hinman's Emails Matter to Ripple's SEC Case and XRP's Price - CoinDesk",
        "content": "Ripple Labs allies generally characterize the company as separate from XRP. In particular, they have argued that the XRP blockchain was created by Jed McCaleb and Chris Larsen, working as OpenCoin, before an entity called “Ripple” even existed. But OpenCoin became Ripple Labs and what is today simply called Ripple, and those cofounders “gifted” 80 billion XRP, 80% of the total supply, to Ripple Labs. Over the years, Ripple has made a variety of branding and messaging changes to represent that they are not the creators of XRP. That includes changing the preferred way to discuss the token itself, which for many years was commonly referred to as “Ripple.”"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LndydHYuY29tL25ld3MvbG9jYWwtbmV3cy91c2Etc3dpbW1pbmctaW5keS10by1jZWxlYnJhdGUtb25lLXllYXItbWFyay11bnRpbC0yMDI0LXUtcy1vbHltcGljLXN3aW0tdHJpYWxz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "USA Swimming, Indy to celebrate one year mark until 2024 Olympic Swim Trials - WRTV Indianapolis",
        "content": "INDIANAPOLIS — Thursday, marks one year until the start of the 2024 U.S. Olympic Swimming Trials beginning at Lucas Oil Stadium.\n\nTo celebrate the mark, the City of Indianapolis and USA Swimming have planned numerous activities throughout the city to ramp up excitement.\n\nThe day of events is headlined by a community event at Broad Ripple Park from 4 - 7 p.m.\n\nAt the event, current and former national team athletes Cody Miller, Blake Pieroni and Kaitlin Sandeno will be in attendance for a collection of family friendly activities, music, food and more.\n\nThe community event is highlighted by a swimming relay that includes multiple civic leaders.\n\nThere will also be a youth swimming clinic from 2 - 3 p.m. at Broad Ripple Park.\n\nIndy Parks will provide instruction to youth from Horizons, a tuition-free, six-week summer enrichment program held at St. Richard's. Sandeno will speak, take photos and sign autographs at this event as well.\n\nThe day will begin with a 10 a.m. press conference at Lucas Oil Stadium with Mayor Joe Hogsett, USA Swimming President and CEO Tim Hinchey, CEO of Boys & Girls Clubs of Indianapolis Maggie Lewis, Indiana Sports Corp President Patrick Talty and more.\n\nParking for the events at Broad Ripple Park is free in the large, paved lot off Broad Ripple Park Road, located directly across from the pool."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDYvMTQvcmlwcGxlLXRvLWV4cGFuZC1pbnRvLWV1cm9wZS1vbi1iYWNrLW9mLW1pY2EtYW1pZC11cy1yZWd1bGF0b3J5LXVuY2VydGFpbnR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Ripple to Expand into Europe on Back of MiCA Amid US Regulatory Uncertainty - The Crypto Basic",
        "content": "Ripple sustains global expansion despite the pressure from the U.S. SEC lawsuit, with a view to penetrate deeper into Europe as MiCA becomes law.\n\nRipple continues to push for expansion on a global scale despite facing a multi-year legal tussle with the U.S. SEC. The regulatory uncertainty in the U.S. has catalyzed Ripple’s penchant for global expansion, as the technology company seeks to penetrate deeper into Europe on the back of the MiCA regulation.\n\nSendi Young, Ripple’s Managing Director (MD) for the U.K. and Europe, highlighted these expansion initiatives in a recent interview at the Money20/20 event in Europe this month. Antony Welfare, CBDC Advisor at Ripple, called attention to the interview in a tweet today.\n\nGreat interview with @sendiyoung on @Ripple's future prospects here in Europe and #CBDC: “It's really a number of different currencies and CBDCs. They're all going to be coexisting and that kind of ability to interoperate, to go in and out is going to be very important.” https://t.co/fAzlDmZ7Yn — Antony Welfare (@AntonyWelfare) June 14, 2023\n\n- Advertisement -\n\nRipple’s Digital Currencies Plans\n\nWelfare pointed out Young’s remarks pertaining to Ripple’s extended efforts towards digital currency and CBDC developments. According to Young, Ripple has continued to expand its offerings to accommodate digital assets and Central Bank Digital Currencies (CBDCs).\n\nRecall that, as The Crypto Basic disclosed last month, Ripple rolled out its CBDC platform for central banks and other financial institutions to develop their own digital currencies on May 18. Ripple is also collaborating with Montenegro for the development of the country’s digital currency.\n\n“It’s really a number of different currencies and CBDCs. They’re all going to be coexisting, and that kind of ability to interoperate, to go in and out, is going to be very important,” Young remarked, speaking on Ripple’s CBDC efforts in the latest Money20/20 interview.\n\n- Advertisement -\n\nRipple Intensifies Europe Expansion Plans\n\nBesides the CBDC initiatives, Young also emphasized the importance of the Markets in Crypto Assets (MiCA) regulation in creating a fertile ground for Ripple’s expansion into Europe. Recall that all 27 European Union finance ministers unanimously voted to pass the MiCA regulation last month. The European Parliament president signed the bill into law on May 31.\n\nEven prior to the approval of MiCA, Ripple had been making attempts towards expanding its reach in Europe. The Crypto Basic reported last November that the firm was seeking an operational license in Ireland as part of its efforts to expand into Europe. MiCA has encouraged Ripple to intensify these European expansion plans.\n\nSpeaking on the MiCA regulation and the impact of clear legislation in Europe, Young noted: “I think that’s where we’ve seen much bigger mainstream take up and the real benefits of crypto’s utility being realized. Without clear regulation, that is impossible. I see that as the first step in getting more mainstream adoption.”\n\nThe favorable environment observed in Europe and the U.K. directly contrasts the atmosphere in the U.S. where industry leaders have continued to bemoan the SEC’s aggressive enforcement actions. The agency recently sued Binance and Coinbase for facilitating trades in unregulated securities despite the prevalent regulatory uncertainty in the country."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZXh0ZW5kLWxvc3Nlcy14cnAtZHJvcHMtbW9zdC_SAURodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWV0aGVyLWV4dGVuZC1sb3NzZXMteHJwLWRyb3BzLW1vc3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether extend losses; XRP drops most - Forkast News",
        "content": "Both Bitcoin and Ether fell in Wednesday afternoon trade in Asia, with Ripple’s XRP leading losses among the other top 10 non-stablecoin cryptocurrencies. Other tokens in the top 10 traded mixed, with crypto exchange Binance’s BNB token leading the gains amid its ongoing lawsuit with the U.S. Securities and Exchange Commission (SEC). Investors are looking forward to the U.S. central bank’s decision on interest rates to be announced later on Wednesday, with the Federal Reserve expected to keep rates unchanged at 5%-5.25%.\n\nSee related article: How American courts have become central to crypto law\n\nXRP leads losses, BNB gains\n\nBitcoin fell 0.69% to US$25,894 in the 24 hours to 4 p.m. in Hong Kong, according to CoinMarketCap data. The world’s biggest cryptocurrency by market capitalization has lost 3.40% in the past week following lawsuits brought by U.S. regulators against two of the world’s biggest crypto exchanges, Binance and Coinbase.\n\nEther, the world’s second biggest cryptocurrency, fell 0.42% to US$1,741 over the past 24 hours, bringing its weekly losses to 7.18%.\n\n“Last week and the weekend were tumultuous days for cryptocurrency markets, marked by significant declines in valuations across the board,” Robert Quartly-Janeiro, Chief Strategy Officer of crypto exchange Bitrue, said in an emailed statement.\n\n“The challenges faced by Binance and Coinbase in the United States hold significant weight. Binance, commanding over 60% of the global market, and Coinbase, with 70% market share in the USA, are major participants so what happens to them naturally affects global sentiment,” Quartly-Janeiro added.\n\nBNB, the native token of the world’s largest crypto exchange Binance, gained 4.93% to US$246 over the past 24 hours. That reduced its weekly losses to 10.95%.\n\nThe gains came after a U.S. federal judge on Tuesday denied the SEC’s request to freeze the assets of Binance.US. The decision allows Binance.US to continue operating while it battles a lawsuit filed against it by the regulator last week. The SEC alleges that Binance.US failed to register as a securities exchange while offering and selling unregistered securities.\n\nThe SEC also sued Coinbase, the largest crypto exchange in the U.S., on similar charges.\n\n“Outflows from Coinbase and Binance reached US$4 billion during the week. Crypto traders, spooked by SEC lawsuits, are withdrawing assets from exchanges en masse,” Alex Kuptsikevich, senior market analyst at online brokerage firm FxPro, said in emailed comments.\n\nIn a parallel development involving the SEC and crypto, Ripple’s XRP token was the biggest loser, dropping 5.36% to US$0.5013 in 24 hours and 4.93% on the week. The drop came after the so-called “Hinman documents” were released, named after former SEC corporate finance director William Hinman.\n\nRipple Labs Inc. was sued by the SEC in December 2020, for allegedly selling US$1.3 billion in unregistered securities. The company asked to unseal documents in which Hinman said Bitcoin and Ether should not be categorized as financial securities. The comments are a major point of contention in the legal battle between the SEC and Ripple as Ripple seeks to bolster its fair notice defense.\n\nRipple’s chief legal officer Stuart Alderoty tweeted on Tuesday, “Hinman’s speech should never again be invoked in any serious discussion about whether a token is or is not a security. Unelected bureaucrats must faithfully apply the law within the constraints of their jurisdiction.”\n\n14/ And finally, Hinman’s speech should never again be invoked in any serious discussion about whether a token is or is not a security. Unelected bureaucrats must faithfully apply the law within the constraints of their jurisdiction. They can’t – as Hinman tried – create new law. — Stuart Alderoty (@s_alderoty) June 13, 2023\n\nMarkus Thielen, Head of Research & Strategy at digital asset service platform Matrixport, feels that the crypto crackdown by the U.S. SEC opens up new opportunities for other parts of the world including Asia.\n\n“I think the key difference is that in the U.S., derivatives are not really offered; only the spot market. And the derivatives market is 11 times bigger than the spot market,” Thielen told Bloomberg on June 13.\n\n“So a lot of the trading already happens outside of the U.S. and I think this is why Binance got into trouble because a lot of U.S. institutions appear to be trading on the platform according to the allegations. I think to really offset the pressure from the U.S., I think Hong Kong needs to do more and I think Hong Kong can actually step into this void now,” Thielen added.\n\nEven in the decentralized finance (DeFi) sector, which gained momentum after multiple centralized finance (CeFi) collapses throughout 2022, institutional investors are looking at Asia and the Middle East.\n\n“Growth is returning to DeFi, albeit slower than last year, but interest is coming back as institutions and investors evaluate the landscape,” Robert Alcorn, chief executive and Co-Founder of DeFi credit marketplace Clearpool, said in a statement.\n\n“Indeed, the main obstacle for traditional institutions remains regulatory clarity and compliance. Significant progress has been made in this regard across Asia and the Middle East, which is likely to encourage investor participation, and we expect these regions to become the main crypto lending hubs as confidence builds,” Alcorn added.\n\nIn Asia, Hong Kong’s new rules for the cryptocurrency industry came into effect from June 1, as part of the city’s ambition to become a global hub for digital assets.\n\nThis week, Hong Kong-based Bank of China International Holdings (BOCI) issued US$28 million worth of fully digital structured notes in the form of tokens on Ethereum blockchain. That makes it the first Chinese financial institution to issue a tokenized security in Hong Kong, according to a statement from investment banking firm UBS.\n\nThe product was developed by UBS and is available to its clients in the Asia Pacific region.\n\n“Working together with UBS, we are driving the simplification of digital asset markets and products for customers in Asia Pacific through the development of blockchain-based digital structured products, designed specifically for customers in Asia Pacific,” Ying Wang, deputy chief executive officer at BOCI, said in the statement.\n\n“We are encouraged by the evolution of Hong Kong’s digital economy and are committed to promoting the digital transformation and innovative development of Hong Kong’s financial industry,” Wang added.\n\nThe global crypto market capitalization fell 0.46% to US$1.06 trillion, while total market volume gained 8.59% to US$31.3 billion in the last 24 hours.\n\nNFT markets slump, Snoop Dogg releases collectibles\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 0.63% to 2,942.34 in the 24 hours to 6.45 p.m. in Hong Kong, registering losses of 10.43% over the last seven days.\n\nThe Forkast ETH NFT Composite dropped 1.24% to 1,037.33, down 6.37% on the week.\n\n“The NFT market is finally reacting to the U.S. SEC’s stepped-up attacks against the cryptocurrency industry,” according to Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\n“Either way, it’s pretty clear we’re entering another new phase of the NFT market, and traders are being cautious. How low we can go, nobody knows,” Petscher added.\n\nTotal NFT sales volume on the Ethereum blockchain dropped 3.07% to US$13.09 million in 24 hours. In stark contrast, sales volume gained 95.59% to US$5.41 million on the Bitcoin network, according to CryptoSlam data.\n\nSales of uncategorized Ordinals — Bitcoin NFTs that are not part of an established collection – recorded the highest sales volume in 24 hours, climbing 87.32% to US$3.10 million.\n\nAmong other developments in the sector, entertainment icon Snoop Dogg has launched The Snoop Dogg Passport Series, a digital tour collectible. The passport series includes behind-the-scenes video and images uploaded by the rapper, a public relations spokesperson for the project said in an emailed statement.\n\nThe collection will also include visual works from NFT artists like Coldie, Terrell Jones, and Alien Queen.\n\nAsian equities, U.S. futures mixed; European bourses rise\n\nImage: Envato Elements\n\nAsian equities traded mixed on Wednesday as China is expected to cut its headline policy interest rate on Thursday, due to slower-than-expected economic recovery. Senior Chinese officials are reportedly seeking inputs from economists and business leaders on how to revive the world’s second largest economy after three years of Covid-19 related disruptions.\n\nThe Shanghai Composite dropped 0.14% while the Shenzhen Component Index gained 0.26%. Hong Kong’s Hang Seng Index lost 0.58% but Japan’s Nikkei 225 strengthened 1.47%.\n\nU.S. stock futures were mixed as of 8 p.m. in Hong Kong. The Dow Jones Industrial Average futures dropped 0.26%, and S&P 500 futures gained 0.11%. Nasdaq 100 Futures also rose 0.14%.\n\nThe U.S. central bank is expected to keep interest rates unchanged at its meeting on June 13 and 14. Current interest rates in the U.S. are between 5% and 5.25%, the highest level since 2006, after 10 consecutive raises that started in March last year.\n\n“The market has all but moved on to what happens in the [Fed’s] following meeting in July,” DBS Bank said in a research note on June 12.\n\n“Given the economy’s slow but steady state of affairs, the chance of a hike in that meeting is non-trivial, in our view. In our forecasting horizon, we see both headline and core inflation in the 3-4% range this year and next, which may justify a prolonged pause than a number of additional hikes by the Fed,” DBS said.\n\nTuesday’s U.S. Consumer Price Index (CPI) report, a key inflation indicator, showed that inflation in the world’s biggest economy grew at a 4% annual rate in May, compared to 4.9% in April. The CPI was the lowest yearly inflation rate since March 2021, but is still higher than Fed’s target of 2%.\n\nEuropean bourses strengthened on Wednesday, as investors look forward to the European Central Bank’s decision on interest rates on Thursday. The central bank is expected to announce another 25 basis point rate hike to 3.5%.\n\nThe benchmark STOXX 600 rose 0.57% and Germany’s DAX 40 gained 0.52% during afternoon trading hours in Europe."
    }
]