[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vdS50b2RheS9yaXBwbGUtY2VvLWltbW9ydGFsaXplcy14cnAtd2l0aC1uZXctdGF0dG9v0gE_aHR0cHM6Ly91LnRvZGF5L3JpcHBsZS1jZW8taW1tb3J0YWxpemVzLXhycC13aXRoLW5ldy10YXR0b28_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Sep 2023 07:00:00 GMT",
        "title": "Ripple CEO Immortalizes XRP With New Tattoo - U.Today",
        "content": "In a subdued but significant revelation, Ripple's CEO, Brad Garlinghouse, recently made a personal statement about his allegiance to XRP. The revelation did not occur during a grand event but quietly emerged on social media, following Ripple's celebratory gathering in New York City, known as \"The Proper Party.\"\n\nAdvertisement\n\nWhile the community was anticipating major announcements amid the event, none related to XRP materialized. Instead, Garlinghouse took to social media after the party to share a personal milestone: his new tattoo featuring XRP's logo. In a brief post, he noted, \"Tonight's event is just a celebration...but I will share my recent addition.\"\n\nAnd as for any “announcement” that people are wondering about, tonight’s event is just a celebration…but I will share my recent addition: pic.twitter.com/q4THzsr4Fp — Brad Garlinghouse (@bgarlinghouse) September 29, 2023\n\nThis unassuming act of getting a popular cryptocurrency logo tattooed sent ripples through the XRP community. The simplicity of Garlinghouse's gesture struck a chord, symbolizing a personal commitment to the digital asset.\n\nThe news quickly spread across social media platforms, garnering significant attention and conversation among XRP enthusiasts. Garlinghouse's post garnered an impressive 300,000 impressions, showcasing the impact of this subtle yet powerful declaration.\n\nIn an industry often dominated by market trends and technological advancements, Ripple CEO's gesture serves as a reminder of the human element in the world of crypto. It represents a quiet but firm dedication to the potential of XRP, echoing the sentiments of many enthusiasts within the community."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNyeXB0b2dsb2JlLmNvbS9sYXRlc3QvMjAyMy8wOS9mb3JtZXItb2JhbWEtc3RhZmZlci1sYXVyZW4tYmVsaXZlLWpvaW5zLXJpcHBsZS10by1uYXZpZ2F0ZS11LXMtcmVndWxhdG9yeS13YXRlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Sep 2023 07:00:00 GMT",
        "title": "Ex-Obama Aide Lauren Belive Takes U.S. Policy Helm at Ripple - CryptoGlobe",
        "content": "Recently, Lauren Belive announced her appointment as the new Head of U.S. Public Policy and Government at FinTech firm Ripple, a key player in modernizing international payment systems.\n\nBelive emphasized the importance of active involvement in policy discussions in Washington D.C. and the United States. She aims to not just participate in these dialogues but also steer them in a meaningful direction. As regulations around cryptocurrencies continue to change, she stressed the necessity of pushing for rules that benefit the crypto sector and the numerous businesses and individuals who stand to gain from these technological innovations. Finally, she expressed her enthusiasm and gratitude for the opportunity to collaborate with Robert Grant and the talented team at Ripple.\n\nBelive’s career in public policy and government relations has been both diverse and impactful. She began her professional journey as a Staff Assistant for the House Committee on Oversight and Government Reform in Washington, D.C., from January 2007 to June 2008, under the chairmanship of Henry Waxman.\n\nIn 2008, she joined the Obama for America campaign as a Regional Research Director, based in Chicago, Illinois. After the election, she briefly served as a Legislative Assistant for the Obama Biden Transition Team from November 2008 to January 2009. She then moved on to a role in the White House, working in the Office of Legislative Affairs from January 2009 until April 2012.\n\nFollowing her stint at the White House, Belive served as a Policy Director for the U.S. House Committee on Rules from April 2012 to May 2015. She then transitioned to the private sector, joining Lyft as the Head of Federal Government Relations. She held this position for over five years, from June 2015 to September 2020.\n\nBelive continued her career in the corporate sector as the Head of U.S. Government Relations at Zoom from September 2020 to January 2022. Most recently, before her current role at Ripple, she served as the Director of Government Affairs at SoftBank Group Corp., from January 2022 to January 2023.\n\nThe move comes at a time when cryptocurrency companies are intensifying their lobbying efforts in Washington, D.C., advocating for a regulatory revamp. These firms argue that current regulations are inadequate and risk driving crypto-related activities out of the U.S. to other jurisdictions.\n\nFeatured Image via Pixabay"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1sb25nLXJvYWQtYWhlYWQtc2VjLXYtcmlwcGxlLXNhZ2EtY29udGludWVzLTEzNzc4NjDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Sep 2023 07:00:00 GMT",
        "title": "XRP News: Long Road Ahead, SEC v Ripple Saga Continues! - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYm9sZC5jb20vcmlwcGxlLXRvLXVubG9jay0xLWJpbGxpb24teHJwLXRvbW9ycm93LXdoYXQtdG8tZXhwZWN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Sep 2023 07:00:00 GMT",
        "title": "Ripple to unlock 1 billion XRP tomorrow – what to expect? - Finbold - Finance in Bold",
        "content": "On the first day of every month, Ripple unlocks 1 billion XRP tokens from an escrow system programmed within the XRP Ledger. This is set to happen again on October 1 (Sunday), in three transactions of 100 million, 400 million, and 500 million XRP.\n\nNotably, October 2023’s unlock accrues for 1.87% of the current circulating supply of 53.31 billion XRP, and part of the remaining 46.69 billion XRP tokens owned by Ripple, that are still locked in escrows to be released monthly until February 2027.\n\nThere are three escrows set to be finalized on the last minutes of September 30, held by two known wallet addresses under Ripple’s control:\n\nAddress “Ripple (22)” — for an unlock of 500 million XRP, that was locked on July 01, 2019, with the transaction ID “D0C3E…7568F”.\n\nAddress “Ripple (23)” — for an unlock of 100 million XRP, that was locked on July 01, 2019, with the transaction ID “532CD…1E4D2”.\n\nAddress “Ripple (23)” — for an unlock of 400 million XRP, that was locked on August 01, 2019, with the transaction ID “574D0…25F89”.\n\nThese two addresses still hold 5 billion XRP tokens for monthly escrows that will be finalized in the next five months until February 29, 2024.\n\nWhy did Ripple create this escrow system?\n\nWhen XRP was created in 2012, the XRP ledger capped the total supply at 100 billion XRP. Of this, 20 billion XRP was initially distributed to the creators and core team.\n\nRipple’s treasury controlled the remaining 80 billion XRP and promised to release these coins gradually, rather than all at once. In 2017, Ripple implemented a new system to make the release of XRP more predictable and controlled.\n\nThis system uses escrows — a type of smart contract that locks up XRP, making it impossible to use them unless certain conditions are met. Ripple’s condition was to release one billion XRP on the first day of each month for 55 months, for a total of 55 billion XRP.\n\nHowever, even with a monthly release of one billion XRP, Ripple did not spend or sell all of it. Instead, Ripple is reportedly locking up the remaining tokens each month in new escrows for future releases. This extended the 55-month deadline for all XRP to be put into circulation.\n\nThis is what Ripple did to the 1 billion XRP released in September\n\n1 billion XRP tokens worth $500 million were unlocked, as expected, on September 1. Ripple then immediately relocked 800 million (80%) of the total, to escrows set to be finalized by January and February of 2027.\n\nMonthly escrow Ripple (XRP) | September 2023.\n\nFrom the left 200 million XRP, 100 million tokens were spent on September 11 amid a price crash following news related to FTX’s assets liquidations a day before.\n\nRipple moves 100 million in a possible sell-off on September 11. Source: Finbold (Vini Barbosa).\n\n75 million XRP were spent six days later on September 18 and another 50 million tokens were put into circulation on September 22 — from the left 25 million XRP of September’s escrows, plus another 25 million tokens from past releases."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vcmlwcGxlLXZzLWRvZ2Vjb2luLXdoYXRzLXRoZS1kaWZmZXJlbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Sep 2023 07:00:00 GMT",
        "title": "Ripple Vs. Dogecoin – What’s the Difference? - Securities.io",
        "content": "Learning the differences between Ripple (XRP) and Dogecoin (DOGE) is a vital step toward becoming more informed about the crypto market. Both of these projects have been around for years, have large followings, and are listed on most major exchanges. Read on to learn what makes these projects miles apart in terms of their purpose and niche markets.\n\nWhat is Ripple?\n\nThe first thing to understand when discussing Ripple is that it is not the cryptocurrency XRP. Ripple Labs is the firm that developed the XRP cryptocurrency. XRP functions on the RippleNet which is the global payments network used for currency exchange, remittance, and gross settlement.\n\nRipple is one of the best-known projects in the market. The protocol was unique when it entered the market because it went against the common thinking of crypto programmers at the time. Ripple wasn't trying to create an alternative financial system. It was built to help banks facilitate cross-border transactions in a frictionless manner.\n\nThis focus on the traditional financial sector helped Ripple quickly gain strategic partnerships with some of the largest names in the industry. The digital assets payment system works with Santander, Axis Bank, Yes Bank, Westpac, Union Credit, NBAD, UBS, and many more.\n\nWhat is Dogecoin?\n\nDogecoin represents what happens when you make a joke so good that it takes on a life of its own. Dogecoin was developed by Billy Markus and Jackson Palmer – a pair wanting to create a coin that was similar to Bitcoin but was made to make fun of the seriousness of the original cryptocurrencies.\n\nThe project began with the developer taking Bitcoin's coding and swapping every instance of Bitcoin with Dogecoin. They then made some other alterations such as renaming miners as Diggers. From there, they made some technical changes such as altering the consensus mechanism.\n\nThe token launched on December 6, 2013, and was a major hit. The protocol used a beloved meme of a Shiba Inu as its logo as part of the elaborate joke. The joke would have resounding effects on the market as it ushered in the age of meme coins.\n\nWhat Problems Was Ripple Built to Alleviate?\n\nRipple was designed to help banks send money globally. Sending fiat currency internationally is a slow, cumbersome process that is costly. The average international transaction has around 36 different third parties that must review and approve them.\n\nThese steps include payment processors, banks, vendors, regulators, and the list goes on. The process delays transactions and worst of all, each step adds to the overall cost. Today, it's normal for international money transferrers to pay nearly 7% just by sending their money digitally. While this fee is high for individuals, banks are unable to forfeit that much funding to the system.\n\nRipple improves the system and payment settlement using its network. The system has an average transaction time of 4 seconds and costs less than Bitcoin to transact on. The protocol provides low-commission currency exchange which enables a more seamless international economy.\n\nWhat Problems Was Dogecoin Built to Alleviate?\n\nDogecoin was designed to make you laugh. The coin began as a joke between Redditors and has grown to become a major crypto project that has done actual good. The network has sponsored many humanitarian efforts including a clean water initiative in Kenya, and an autistic children's puppy program. The protocol has even sponsored the Jamaican bobsled team.\n\nToday, Dogecoin is used as it was intended as an electronic payment system. The protocol has also seen support from various celebrities. For example, Snoop Dogg has tweeted in support of the project, while one of the world's richest men, Elon Musk, has endorsed the project, tweeting that he is the “Dogefather.”\n\nHow Does Ripple Work?\n\nRipple enables banks to send fiat currencies, cryptocurrencies, commodities, and more internationally in a frictionless manner. The protocol functions by converting these assets into XRP before sending them. XRP can be sent in a permissionless manner for pennies internationally.\n\nThe RippleNet includes over 100 banks at this time and has some strategic partnerships with remittance firms as well. These groups can send values using the system in seconds. This strategy has already saved these firms millions in fees and delays. The system improves efficiency and security while lower costs making it a win-win for participants.\n\nHow Does Dogecoin Work?\n\nDogecoin operates like Bitcoin in that it utilizes a PoW consensus mechanism. On Dogecoin, however, diggers compete to secure the network. The system has all diggers validate the chain with one receiving a reward randomly. This approach is great because it improves security as more diggers join.\n\nDogecoin users can send their DOGE across the globe using the network. The token serves its purpose as a light-hearted cryptocurrency and it has helped to drive large-scale crypto adoption up due to its high-profile supporters. There has been a push by the Dogecoin community to add more functionality and usability to the coin which could improve its value further.\n\nOne of the cool aspects of Dogecoin is that it uses Scrypt consensus mechanics. The decision to do so was made to prevent mining centralization, as was common on Bitcoin at the time. The decision meant that miners couldn’t use ASIC mining rigs on the Dogecoin blockchain, helping to keep the network decentralized longer.\n\nHow to Buy Ripple (XRP) and Dogecoin (DOGE)\n\nCurrently, Ripple (XRP) and Dogecoin (DOGE) are each available for purchase on the following exchanges.\n\nUphold – This is one of the top exchanges for United States & UK residents that offers a wide range of cryptocurrencies. Germany & Netherlands are prohibited.\n\nUphold Disclaimer: Terms Apply. Cryptoassets are highly volatile. Your capital is at risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong.\n\nKraken – Founded in 2011, Kraken is one of the most trusted names in the industry with over 9,000,000 users, and over $207 billion in quarterly trading volume.\n\nThe Kraken exchange offers trading access to over 190 countries including Australia, Canada, Europe, and is a top exchange for USA residents. (Excluding New York & Washington state).\n\nRipple Vs. Dogecoin- Alternate ends of the Spectrum\n\nWhen you examine Ripple (XRP) vs. Dogecoin (DOGE), it's easy to see that these projects are geared toward different audiences. They may trade on many of the same exchanges, but XRP was designed to serve the banking community, whereas, Dogecoin was created to make you smile. It doesn’t get much further from each other in terms of purpose.\n\nTo learn more, make sure to visit our Investing in Ripple and Investing in Dogecoin guides.\n\n*July 14, 2023 UPDATE*\n\nAfter a multi-year court battle, Judge Torres, who was presiding over the case, announced a split decision surrounding the charges laid against Ripple Labs by the SEC.\n\n“For the foregoing reasons, te SEC's motion for summary judgment is GRANTED as to the Institutional Sales, and otherwise DENIED. Defendants' motion for summary judgment is GRANTED as to the Programmatic Sales, the Other Distributions, and Larsen's and Garlinghouse's sales, and DENIED as to the Institutional Sales.”\n\nSimply put, Ripple was found guilty of selling unregistered securities directly to institutions, as these were clearly viewed as investment contracts. Outside of this point, which is in favor of the SEC, it is widely viewed that Ripple ‘won' the case. It was found that both programmatic sales of XRP and those made by Larsen & Garlinghouse did not constitute the sale of unregistered securities.\n\nThis decision was made due to the following distinction.\n\n“…the vast majority of individuals who purchased XRP from digital asset exchanges did not invest their money in Ripple at all. An Institutional Buer knowingly purchased XRP directly from Ripple pursuant to a contract, but the economic reality is that a Programmatic Buyer stood in the same shoes as a secondary market purchaser who did not know to whom or what it was paying its money…Therefore, having considered the economic reality and totality of circumstances, the Court concludes that Ripple's Programmatic Sales of XRP did not constitute the offer and sale of investment contracts.”\n\nThese rulings are significant, as many of the circumstances of the case and points made echo those of other digital assets on the market. While each and every case is unique, a modest level of clarity has now been provided for the status of altcoins.\n\nWhile the ruling may be challenged by the SEC, digital asset exchanges have already begun relisting the asset now that the fear of regulatory violation has diminished. Moving forward, a trial will decide whether Larson and Garlinghouse knowingly aided in the illegalities that the company did take part in."
    }
]