[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGlzLXdlZWtzLW1vc3QtaW50ZXJlc3RpbmctcmlwcGxlLXhycC1wcmljZS1wcmVkaWN0aW9ucy1xdWljay1yZWNhcC_SAWJodHRwczovL2NyeXB0b3BvdGF0by5jb20vdGhpcy13ZWVrcy1tb3N0LWludGVyZXN0aW5nLXJpcHBsZS14cnAtcHJpY2UtcHJlZGljdGlvbnMtcXVpY2stcmVjYXAvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "This Week’s Most Interesting Ripple (XRP) Price Predictions: Quick Recap - CryptoPotato",
        "content": "TL;DR\n\nXRP’s Price Fluctuation : Ripple’s XRP has seen price fluctuations between $0.61 and $0.70, leading to various expert predictions.\n\n: Ripple’s XRP has seen price fluctuations between $0.61 and $0.70, leading to various expert predictions. Analysts’ Predictions for XRP : Analyst Dark Defender predicts a more than 30% increase in XRP’s price to reach $0.87 by the end of the week, while EGRAG CRYPTO suggests a potential rise to $1.40 by the end of 2023, contingent on overcoming major resistance levels.\n\n: Analyst Dark Defender predicts a more than 30% increase in XRP’s price to reach $0.87 by the end of the week, while EGRAG CRYPTO suggests a potential rise to $1.40 by the end of 2023, contingent on overcoming major resistance levels. “God Candle” Forecast: Analyst Tony “The Bull” speculates that XRP might form a “God candle,” similar to its 900% surge during the 2017 bull run, based on current market dynamics resembling those of the past.\n\nThe Most Recent XRP Bets\n\nRipple’s native token – XRP – has experienced another price turbulence this week. The coin’s valuation has been hovering between $0.61 and $0.70, giving experts the opportunity to lay out interesting predictions.\n\nOne popular analyst using the X (Twitter) handle Dark Defender suggested that XRP could jump by more than 30% by the end of the week, envisioning a $0.87 mark for November 19. To do so, it must overcome the $0.68 mark, which they described as “small resistance.”\n\nThe X user EGRAG CRYPTO has been even more bullish, claiming the asset has a chance to ascend to as high as $1.40 by the end of 2023 should it overcome a major resistance level, described as a “consolidation” zone.\n\nThose willing to find out how XRP might perform in the last quarter of the ongoing year could take a look at our dedicated video below:\n\nA God Candle Approaching?\n\nLast but not least, we will touch upon a forecast according to which XRP might be on the verge of forming a so-called “God candle.” The cryptocurrency analyst Tony “The Bull” observed certain charts and assumed such an event could be in the cards.\n\nThey argued that XRP’s current market dynamics seem similar to the ones from the bull run in 2017. The analyst reminded that back then, the asset experienced a 900% “God candle,” hinting this might be the case in the near future, too."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbmdhcGUuY29tL2RhdmlkLXNjaHdhcnR6LXJldmVhbHMteHJwbHMtbmV3LWZvY3VzLW9uLWFzc2V0LXRva2VuaXphdGlvbi_SAVZodHRwczovL2NvaW5nYXBlLmNvbS9kYXZpZC1zY2h3YXJ0ei1yZXZlYWxzLXhycGxzLW5ldy1mb2N1cy1vbi1hc3NldC10b2tlbml6YXRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "David Schwartz Reveals XRPL’s New Focus on Asset Tokenization - CoinGape",
        "content": "In a significant development for blockchain technology, Ripple’s Chief Technology Officer, David Schwartz, highlighted the XRP Ledger’s (XRPL) strategic move towards tokenizing real-world assets (RWA). This initiative places XRPL in direct competition with major financial institutions like JPMorgan and Bank of America. Schwartz’s recent interview shed light on this evolution, focusing on the technological prowess of XRPL rather than XRP, its native token.\n\nSchwartz Praises XRPL’s Unique Technological Shift\n\nSchwartz expressed satisfaction with the shifting focus from XRP to XRPL’s underlying technology. While acknowledging XRP’s role in transactions and investments, he emphasized the ledger’s more intriguing technological facets. He also pointed out XRPL’s unique position in the blockchain space, being the first layer-1 blockchain not derived from Bitcoin technology, a distinction it has held since its inception in the early 2010s.\n\nadvertisement\n\nMoreover, Schwartz underscored XRPL’s origins, designed with enterprise finance and cross-border payments in mind. The architects, including Schwartz, initially sought to enhance enterprise adoption of technologies like Bitcoin, necessitating bridges and other essential technologies.\n\nRipple Advances in Real Asset Tokenization\n\nThe conversation then shifted toward the promising domain of real-world asset tokenization. Schwartz highlighted this as a significant and growing challenge, with notable interest from mainstream financial giants. This interest aligns with projections estimating the tokenization market could reach $30 trillion by 2030.\n\nRipple’s commitment to this area is evident. Antony Welfare, Ripple’s CBDC Advisor, revealed plans to revolutionize the real estate sector through tokenization. Additionally, Schwartz’s vision for XRPL includes becoming the primary platform for tokenized real-world assets, supported by its attractive features such as low transaction fees.\n\nThe strategic pivot of XRPL towards asset tokenization represents a noteworthy development in the blockchain industry. This move diversifies XRPL’s applications and positions it as a key player in a rapidly expanding market. Ripple’s efforts in this direction could transform various sectors, offering more efficient, secure, and accessible ways to handle real-world assets.\n\nRead Also: Bitcoin ETF: SEC Reportedly in Talks With Exchanges"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTEvMTgvcmlwcGxlLWN0by1zYXlzLXhycGwtcGl2b3RpbmctdG8tcndhLXRva2VuaXphdGlvbi1wdXJzdWVkLWJ5LWZpcm1zLWxpa2UtanBtb3JnYW4tYW5kLWJvYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ripple CTO Says XRPL Pivoting to RWA Tokenization Pursued by Firms Like JPMorgan and BoA - The Crypto Basic",
        "content": "Ripple CTO David Schwartz has revealed that the XRP Ledger (XRPL) is moving towards real world asset (RWA) tokenization, a scene pursued by prominent firms such as JPMorgan and Bank of America (BoA).\n\nSchwartz made these remarks while discussing the journey of the XRPL in a recent interview. He expressed his satisfaction with the fact that the technology behind the XRP Ledger is getting more attention these days, instead of an all-in obsession with XRP, its gas token.\n\nThe Ripple CTO emphasized that XRP remains a token that market participants can buy, hold and transfer. However, he stressed that the token itself is not as interesting as the core technology powering the XRP Ledger.\n\n- Advertisement -\n\nHe further called attention to the XRPL’s unique nature at the early stage of blockchain adoption, noting that the network was the first layer-1 blockchain not built from the Bitcoin technology during the 2011/2012 period.\n\n“So it’s exciting to see more focus on the technology […] You’re right: institutional adoption of the XRP Ledger technology is growing,” David Schwartz declared.\n\nAccording to him, part of the reason behind this growing interest and adoption is the heritage that the network was built around. He confirmed that the original architects, including him, built the XRPL for enterprise finance, applications and cross-border payments.\n\nXRPL for RWA Tokenization\n\nHe noted that in the early days, he and the other architects were looking at ways to bolster enterprise adoption for solutions like Bitcoin. For such adoption to occur, they would need to establish bridges, connections and other pivotal technologies.\n\n- Advertisement -\n\nSchwartz then revealed that he is extremely excited about delving into real-world asset tokenization. He stressed that establishing efficient tokenization of real-world assets has grown to be a real problem. The XRPL is positioned to solve this problem.\n\nIn his words:\n\n“Real-world asset tokenization is something that I’m pretty excited about right now, because that’s a real problem and there’s real interest from mainstream financial giants like JPMorgan and Bank of America, [which] are actively pursuing tokenization of traditional assets.”\n\nProjected to hit $30 trillion by 2030, the tokenization industry has become a hot topic in the crypto scene, with projects such as Floki looking to jump on it. Antony Welfare, Ripple’s CBDC Advisor, revealed in July that Ripple aims to transform the real estate industry through tokenization.\n\nIn a previous interview, David Schwartz expressed his desire to see the XRPL serve as the go-to platform for tokenized real world assets. He noted that the XRPL boasts all the attractive features for this purpose, including low fees."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9iaW5hbmNlLWRlbGlzdHMtMTUtdHJhZGluZy1wYWlycy1yaXBwbGUteHJwLWNhcmRhbm8tYWRhLWFuZC1zb2xhbmEtc29sLWFmZmVjdGVkL9IBbWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9iaW5hbmNlLWRlbGlzdHMtMTUtdHJhZGluZy1wYWlycy1yaXBwbGUteHJwLWNhcmRhbm8tYWRhLWFuZC1zb2xhbmEtc29sLWFmZmVjdGVkLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Binance Delists 15 Trading Pairs: Ripple (XRP), Cardano (ADA), and Solana (SOL) Affected - CryptoPotato",
        "content": "TL;DR\n\nBinance Delists Russian Pairs: Binance will remove 15 Russian ruble trading pairs, including ADA/RUB, SOL/RUB, and XRP/RUB, due to security concerns and low liquidity, aligning with their strategy to exit the Russian market.\n\nBinance will remove 15 Russian ruble trading pairs, including ADA/RUB, SOL/RUB, and XRP/RUB, due to security concerns and low liquidity, aligning with their strategy to exit the Russian market. Strategic Shift: The exchange’s move reflects a compliance-focused strategy, as stated by Chief Compliance Officer Noah Perlman, emphasizing a shift away from Russian operations to focus on other global markets.\n\nThe exchange’s move reflects a compliance-focused strategy, as stated by Chief Compliance Officer Noah Perlman, emphasizing a shift away from Russian operations to focus on other global markets. Cryptocurrency Price Impact: The delisting has affected the prices of XRP, ADA, and SOL, with notable declines. Despite this, experts predict potential future gains for these cryptocurrencies.\n\nProtecting Users or Anti-Russian Move?\n\nThe world’s largest cryptocurrency exchange – Binance – announced that it will remove 15 spot trading pairs on November 20. Some of those include ADA/RUB, SOL/RUB, and XRP/RUB.\n\nThe company explained that the move aims to grant additional security to clients, adding that more trading pairs might get delisted in the future should there be “poor liquidity and trading volume.”\n\nAnother reason behind the initiative could be Binance’s wish to completely cease deposits in Russian ruble. Not long ago, the exchange entered into an agreement to sell the entirety of its Russia business to the crypto platform CommEX.\n\n“As we look toward the future, we recognize that operating in Russia is not compatible with Binance’s compliance strategy. We remain confident in the long-term growth of the Web3 industry around the world and will focus our energy on the 100+ other countries in which we operate,” said Noah Perlman – Binance’s Chief Compliance Officer.\n\nXRP, ADA, and SOL are on a Downhill\n\nThree of the assets affected by Binance’s latest delisting spree – Ripple (XRP), Cardano (ADA), and Solana (SOL) – have registered significant declines in the past 24 hours. XRP’s price has plunged by 5% on a daily basis and around 8% for the last week. ADA has slipped by 6%, whereas SOL has plummeted by 10%.\n\nAccording to numerous experts, though, the ongoing correction should not be a concern for long-term investors since those assets might chart substantial gains in the following months.\n\nXRP was recently projected to soar by 100% by the end of 2023, while the X (Twitter) user Jacob Canfield forecasted that SOL could reach a whopping $1,000 mark.\n\nThose willing to explore the top ADA predictions could take a look at our latest video below:"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmN5Y2xpbmduZXdzLmNvbS9uZXdzL21vLXdpbHNvbnMtZmFtaWx5LWRlc2NyaWJlLXJpcHBsZS1lZmZlY3Qtb2Ytc29ycm93LWluLXZpY3RpbS1pbXBhY3Qtc3RhdGVtZW50L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Mo Wilson's family describe 'ripple effect of sorrow' in victim impact statement - Cyclingnews",
        "content": "The family and friends of Moriah \"Mo\" Wilson said they are ready to put the ordeal of the two-week trial of now-convicted murderer Kaitlin Armstrong behind them, having the final word in the proceedings at the sentencing hearing with their victim impact statements.\n\nArmstrong was found guilty of murdering Wilson on May 11, 2022, on Thursday and was sentenced to 90 years in prison.\n\nCaitlin Cash, who was hosting Wilson in Austin, Texas described having to go back to her apartment and live in the scene of the crime, while Wilson's mother Karen addressed Armstrong to say her actions had caused \"a ripple effect of sorrow upon sorrow upon sorrow\".\n\nWilson's father Eric appeared to place some blame on Armstrong's partner Colin Strickland, who had incited her jealousy by having a brief romantic encounter with Mo Wilson the previous year.\n\nStrickland lied to Armstrong on the day of Wilson's murder, telling her he was 'delivering flowers' when he was in fact taking Wilson for a swim and dinner.\n\nIn a statement outside the court, Eric Wilson said, \"This sad story is a perfect example of why integrity and honesty are crucial in our personal relationships, and how dishonesty can often lead to unintended consequences.\n\n\"Selfish manipulation, jealousy and hatred never lead to positive outcomes. Violence is never a good way to solve personal issues. In fact, violence doesn't solve anything. It only leads to more suffering.\"\n\nGet The Leadout Newsletter The latest race content, interviews, features, reviews and expert buying guides, direct to your inbox! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nEric Wilson finished by stating, \"Our lives have changed forever, but with this challenging ordeal behind us we are ready to move forward and continue our healing. We will do this with Moriah's strong, determined, gentle and kind spirit.\"\n\nThe testimony of Cash and Karen Wilson bared the heartbreak they had been suffering for 555 days.\n\nCash described trying to revive an already dead Wilson as the \"longest 10 minutes of my entire life\", saying she \"assumed that as soon as she was taken to a hospital, that she was going to be OK\".\n\n\"It never actually crossed my mind in the chaos of that night, that she wouldn't be alive. That she would die,\" Cash said. \"Her mom asked me ... if I thought it was quick. And I said yes, I thought it was quick.\n\n\"At no point in my life did I think I would ever have to tell someone's mother that I thought their daughter's death was quick.\n\n\"It has been exhausting showing up every day here in court, listening, watching, reliving every moment from so many different angles. It feels so real all over again. I go home every night to my house after watching video after video of it all day here and there's Mo's ashes sitting on my bedside table waiting for me.\n\n\"I still feel so many things - guilt for not protecting Mo, for not coming home sooner. I'm angry at you, at the utter tragic nature, at the senselessness, at not being able to hear Mo's voice again. Those closest to her knew she had no limits. And it was an honour, a privilege to be in her orbit, even for only a short time.\"\n\nKaren Wilson started her testimony addressing Armstrong by saying, \"I hate what you did to my beautiful daughter. It was very selfish and cowardly. It was cowardly. Because he never chose to face her woman to a woman in a civil conversation. She would have listened. She was an amazing listener. She would have cared about your feelings. She was a caring empathetic person. If you allowed yourself to actually know her. You've never, ever would have wanted to hurt her.\n\n\"When you shot Moriah in the heart, you shot me in my heart. You shot Eric and Matt in the heart.\n\n\"There is no winner in this story. Your actions have caused all sides to suffer. There is a ripple effect of sorrow upon sorrow upon sorrow. Moriah is free of this sorrow, though. She is more alive today than any of us here.\"\n\nBlack Friday is quickly approaching and Cyclingnews is keeping track of all the deals, from equipment, clothing, accessories and technology. Check out the Black Friday deals which are curated and updated throughout each day in the UK, USA and around the world."
    }
]