[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTE4L2tleS1yZXB1YmxpY2FuLWlzLW9wdGltaXN0aWMtYWJvdXQtbmV3LXVzLWNyeXB0by1sYXctYWZ0ZXItcmlwcGxlLXhycC1ydWxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jul 2023 07:00:00 GMT",
        "title": "Republican Glenn Thompson Optimistic About Crypto Bill After Ripple Ruling (XRP) - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTE4L2FpLW1ldGF2ZXJzZS1zdGFydHVwLWZ1dHVyZXZlcnNlLXJhaXNlcy01NC1taWxsaW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jul 2023 07:00:00 GMT",
        "title": "AI Metaverse Startup Futureverse Raises $54 Million - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTE4L2tleS1yZXB1YmxpY2FuLWlzLW9wdGltaXN0aWMtYWJvdXQtbmV3LXVzLWNyeXB0by1sYXctYWZ0ZXItcmlwcGxlLXhycC1ydWxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jul 2023 07:00:00 GMT",
        "title": "Republican Glenn Thompson Optimistic About Crypto Bill After Ripple Ruling (XRP) - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTE4L2FpLW1ldGF2ZXJzZS1zdGFydHVwLWZ1dHVyZXZlcnNlLXJhaXNlcy01NC1taWxsaW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jul 2023 07:00:00 GMT",
        "title": "AI Metaverse Startup Futureverse Raises $54 Million - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5mZW53aWNrLmNvbS9pbnNpZ2h0cy9wdWJsaWNhdGlvbnMvc2VjLXYtcmlwcGxlLWxhYnMtc2VjdXJpdGllcy1sYXctYW5hbHlzaXMtdW5kZXItaG93ZXktYXBwbGllZC1vbi1hLXRyYW5zYWN0aW9uLWJ5LXRyYW5zYWN0aW9uLWJhc2lz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jul 2023 07:00:00 GMT",
        "title": "SEC v. Ripple Labs: Securities Law Analysis Under Howey Applied On A… - Fenwick & West LLP",
        "content": "Key Holdings\n\nIn determining if the digital asset XRP is being offered or sold as an investment contract, the Ripple court applied the Howey test to each type of distribution alleged. Ripple’s sales of XRP to fundraise from sophisticated counterparties pursuant to contracts were found to be unregistered securities transactions. Ripple’s and its executives’ sales of XRP on public exchanges in blind bid/ask transactions were not securities transactions. Distributions of XRP to employees and grantees, who did not pay Ripple for the XRP, were not securities offerings or sales.\n\nIt’s the Transaction, Not the Token.\n\nIssuers cannot offer or sell securities without registering them with the SEC under Section 5 of the Securities Act of 1933 or finding a valid exemption from registration. XRP is the native cryptocurrency of the XRP Ledger, a blockchain on which Ripple Labs builds enterprise cryptocurrency solutions. On December 22, 2020, the SEC sued Ripple and two of its executives in the U.S. District Court for the Southern District of New York, alleging that they violated Section 5 in connection with certain transactions involving XRP. The crux of the SEC’s claim is that Ripple offered and sold XRP without registration and without an exemption from the registration requirements.\n\nIn a landmark summary judgment decision, Judge Analisa Torres effectively rejected the SEC’s position that XRP is itself a security. SEC v. Ripple Labs, Inc., No. 20-CV-10832, --- F. Supp. 3d ----, 2023 WL 4507900 (S.D.N.Y. July 13, 2023). Instead, the Court considered factual circumstances involving the different types of transactions involving XRP to assess their Section 5 implications: (1) “Institutional Sales” – Ripple’s direct sales of XRP to hedge funds, institutional buyers and customers for one of Ripple’s enterprise solutions on the XRP Ledger, pursuant to written contracts; (2) “Programmatic Sales” – public trades of XRP on digital asset exchanges by Ripple and its executives; and (3) “Other Distributions” – transfers of XRP by Ripple to its employees as compensation and to third parties as grants for the development of the XRP ecosystem.\n\nTo each type of transaction, the Court applied the familiar three-prong test from SEC v. W.J. Howey Co. to determine whether there was an “investment contract” such that a violation of Section 5 occurred. 328 U.S. 293 (1946). Under Howey, an investment contract requires [1] an investment of money [2] in a common enterprise [3] with an expectation of profits to come solely from the efforts of others. Id. at 298–99, 301.\n\nThe Devil is in the Details.\n\nAlthough it was not an across-the-board victory for Ripple, the Court ruled that two of the three transaction types are not investment contracts. Sales of XRP by Ripple and its executives on third-party digital asset exchanges through market makers lacked a reasonable expectation of profits from Ripple’s efforts. Ripple, 2023 WL 4507900, at *11. These were “blind bid/ask transactions,” so buyers did not know whom they were buying from. Id. The Court noted Ripple was responsible for fewer than 1% of the global XRP trading volume since 2017 and did not (and could not) make promises or offers to unknown buyers making purchases from unknown sellers. Id. at *11-12. Even if many of these buyers expected to profit from their trades, these expectations stemmed from other factors, including general cryptocurrency market trends, not something done by Ripple. Id. at *12.\n\nThe Court also held that Ripple’s distributions of XRP to its employees and third parties as grants did not satisfy the Howey test because those distributions involved no investment of money. Id. at *13-14. Employees and grantees did not pay Ripple to receive their XRP.\n\nThe only transactions that the Court found to be investment contracts were Ripple’s sales of XRP to institutional purchasers pursuant to written contracts. Id. at *8-11. Those sales involved an investment of money because the buyers paid Ripple for XRP tokens. Id. at *8. They also involved a common enterprise because Ripple used the assets raised from the institutional sales to “promote and increase the value of XRP by developing uses for XRP and protecting the XRP trading market.” Id. at *9. When Ripple succeeded in boosting XRP’s value, “all Institutional Buyers profited in proportion to their XRP holdings.” Id. Finally, the Court found, the institutional purchasers reasonably expected they would derive profits from Ripple’s deployment of its sales proceeds where Ripple pitched XRP as a speculative investment “with potential profits to be derived from Ripple’s entrepreneurial and managerial efforts.” Id. at *11. In particular, the Court found, it was clear the buyers bought XRP as an investment, not to use it as a currency, noting that some buyers agreed to lockup provisions based on XRP’s trading volume and purchased far more than they would need to transact using Ripple’s enterprise solutions. Id.\n\nIn another part of the opinion, the Court rejected Defendants’ notice-based challenges to the SEC’s enforcement strategy. It said Howey, and cases relying on it, put a reasonable person of ordinary intelligence on “constitutionally sufficient” notice of what constitutes an “investment contract.” Id. at *14. It also found the SEC’s approach to enforcement in this case was consistent with prior actions involving sales of digital assets to institutional buyers and rejected Defendants’ arguments focusing “on the SEC's failure to issue guidance on digital assets and its inconsistent statements and approaches to regulating the sale of digital assets as investment contracts.” Id. at *15.\n\nTakeaways\n\nRipple provides critical takeaways for those involved in the offering or sales of digital assets.\n\nRipple undermines the SEC’s position that certain digital assets are “crypto asset securities.”[1] The question was not, as the SEC suggested, whether XRP is a security, but rather whether a particular transaction involving XRP constituted an offering or sale of an investment contract. 2023 WL 4507900 at *8. That gives crypto projects much more flexibility in surviving enforcement challenges, for example, by making institutional sales pursuant to existing securities exemptions or pivoting to blind bid/ask exchange-based transaction strategies that do not implicate the securities laws.\n\nThe decision reinforces that offering tokens to fundraise from sophisticated buyers who purchase with an intent to profit from the enterprise must comply with securities laws by either registering or finding an appropriate exemption from registration. Projects should continue using caution around sales involving token lockup provisions, resale restrictions, indemnification clauses, and statements of purposes, as the Court found these to be indicative of investment contracts.\n\nThe Court found that the first Howey prong (investment of money) could not be met where the recipient did not put capital at risk. As such, Ripple’s distributions of XRP to employees as compensation and grants to incentivize development on the XRP Ledger were not securities transactions. This decision potentially insulates from liability airdrops, free mints, social media giveaways and token claims because they do not implicate payments to the token issuer itself.\n\nThe Ripple decision leaves open several important questions. While the Court determined Ripple should have known its sales to institutional buyers were securities transactions, it did not consider whether the fair notice defense could extend to other transaction types. Specifically, the Court flagged that the SEC’s enforcement theories “as to the other sales in this case are potentially inconsistent with its enforcement in prior digital asset cases.” Id. at *15 n.20. The Court also left open the question of whether Howey requires the existence of a written contract. See id. at *7 n.11 (“[T]he Court does not address the SEC's arguments that Howey does not require the existence of a written contract.”).\n\nThe case now moves forward to trial on the remaining issues, including whether its executives can be liable for aiding and abetting securities violations in connection with the sales to institutional buyers and the appropriate scope of relief, whether injunctive relief or damages. If the SEC decides to appeal the decision, it will have to either seek interlocutory relief or wait until after the trial.\n\nThe Ripple summary judgment decision is an important one at an important time for the nascent cryptocurrency industry. In underscoring the importance of a focus on the nature of each transaction, it is sure to have wide-ranging implications for the application of securities laws to myriad projects in the digital asset space. For additional questions, reach out to your Fenwick team.\n\n\n\n\n\n[1] This approach can be seen in recent enforcement actions against digital asset exchanges. See, e.g., Complaint at 85, SEC v. Binance Holdings Ltd., No. 23-cv-01599 (D.D.C. June 5, 2023) (“Since the Binance Platforms launched, Defendants have made available for trading on them crypto assets that are offered and sold as investment contracts, and thus as securities. This includes, but is not limited to, BNB, BUSD, and the units of each of the crypto asset securities further described below—with trading symbols SOL, ADA, MATIC, FIL, ATOM, SAND, MANA, ALGO, AXS, and COTI (collectively, the ‘Crypto Asset Securities’).”). Prior courts have accepted this framing; for example, in SEC v. Telegram Grp. Inc., where the Court performed the Howey analysis through the lens of the overall “scheme” that consisted of “the full set of contracts, expectations, and understandings centered on the sales and distribution of the [token].” 448 F. Supp. 3d 352, 379 (S.D.N.Y. 2020).\n\n\n\n\n\nSofiya Andreyeva contributed to this alert."
    }
]