[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lmp1YW5jb2xlLmNvbS8yMDIzLzAyL2ZlZWRiYWNrLXRvZ2V0aGVyLWRlYWRsaW5lLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "Do we Have Until 2050 to become Carbon Neutral? What if 27 Climate Feedback Loops are Working together to ... - Informed Comment",
        "content": "Ann Arbor (Informed Comment) – Feedback loops are central notions in science. There are two kinds, negative and positive. Negative feedback loops, despite their name, are actually good if you are looking for stability. So for instance say you are too hot, so you sweat. The sweat evaporates, cooling you off. In fact, it could work too well, causing you cool off so much that you shiver. Shivering, spasms of your muscles, heat you back up. So you end up at a normal temperature after all that.\n\nPositive feedback loops are the ones you have to watch out for. William J. Ripple et al. explain, “For example, warming in the Arctic leads to melting sea ice, which leads to further warming because water has lower albedo (reflectance) than ice.” Here is what they mean: Say the extra carbon dioxide we put into the atmosphere causes the oceans to warm up a bit. The warmer water melts some of the ice at the North Pole. Ice reflects sunlight back out into space, so it cools the earth and its oceans off. When the ice melts, the dark water beneath becomes visible. Dark surfaces absorb sunshine rather than reflecting it. So now the water gets even hotter. And more ice melts. And the dark water absorbs more sunshine and gets even hotter. On and on. A positive feedback loop ratchets things in a single direction so that they get increasingly out of kilter.\n\nArticle continues after bonus IC video\n\nChronicle 5 WCVB; “The science behind ‘feedback loops'”\n\nSo what if the climate emergency is creating not one but 27 positive feedback loops (which, remember, are bad if you are interested in maintaining the status quo)? And what if it is only generating a handful of negative feedback loops, so that these latter cannot hope to offset all the massive changes being provoked by the positive feedback loops? The answer to these “what if?” questions is that we would be well and truly screwed.\n\nThat’s the fear expressed in a new scientific paper in One Earth by William J. Ripple et al.\n\nThey start out with a graphic showing how several of these positive feedback loops in climate change might reinforce one another:\n\nAs noted above, if we want to keep the earth cool, ice is our friend because it is blinding white and reflects the heat of sun rays back out into outer space. So a positive climate feedback loop typically sets in motion the disappearance of more and more ice. For instance, rainfall at the poles melts ice, which causes more global heating because bright surfaces are replaced by dark absorptive ones, and warmer resulting oceans then put more water vapor into the air above them, causing more rainfall, which melts more ice, and so on.\n\nIt is worse. Because when oceans warm and put more water vapor into the air above them, they are in effect emitting a greenhouse gas, since water vapor, like carbon dioxide and methane, helps keep the sun’s heat on earth once it strikes it, rather than letting it radiate out to space.\n\nSo you have two positive feedback loops going on here, with reduced reflectivity because of ice loss, which increases heat, and also increased heat from emission of a greenhouse gas, i.e. water vapor. Both of these effects reinforce one another and make the earth even hotter.\n\nNot only does the ice melting reduce its ability to reflect away the sun rays, but it causes sea level to rise. Sandy beaches are bright and reflect sunlight. But if they are submerged by dark water they can no longer do this. Loss of beaches because of sea level rise thus can raise the earth’s temperature and melt more ice which causes more sea level rise and loss of bright coastal areas. A positive feedback loop, this process can go on at the same time as the ones mentioned above.\n\nSo here’s the bottom line. The authors suggest that if a lot of these positive feedback loops operate at the same time and reinforce one another, as the few examples I chose above do, they could reduce the ability of the ocean to absorb carbon dioxide. For instance, cold water absorbs more CO2 than warm water, so if we heat up the oceans very rapidly we will reduce our carbon budget.\n\nOur carbon budget is the amount of carbon dioxide that the oceans will absorb. Almost all of the massive amounts of CO2 we have put into the atmosphere will go into the oceans. But if we go on producing billions of tons a year of CO2 after 2050, we will outrun the oceans’ absorptive capacity, and then the CO2 will just stay up there, making the earth hot, for thousands or even tens of thousands of years. Since we as a species evolved in relatively cool times, and since our civilization is premised on the stability of a cool climate, we do not know how well we will cope with a very long-term erratic Hot Earth.\n\nThat carbon budget we have between now and 2050, however, may not exist. Maybe we only have until 2035 or 2040 to stop producing CO2, in order to avoid pushing our climate system over into chaos. Chaos means super-hurricanes and massive heatwaves and unexpected flooding, etc.\n\nIf a lot of these positive climate feedback loops work together, they could reduce our carbon budget. So, the scientists say, governments and companies are unwise to set goals of being carbon neutral by 2050. That may be too late if we take into account all the destructive positive feedback loops, and especially if some of them reinforce one another.\n\nTheir message is, in other words, hurry up!"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9lY29ub215L2ZpbmFuY2UvZXQtZ2JzLTIwMjMtZGlnaXRhbC1hc3NldHMtYXJlLWJlY29taW5nLW1haW5zdHJlYW0tcHJvZHVjdHMtc2F5cy1yb3NpZS1yaW9zL2FydGljbGVzaG93Lzk4MDQ3NjYzLmNtc9IBmQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbmV3cy9lY29ub215L2ZpbmFuY2UvZXQtZ2JzLTIwMjMtZGlnaXRhbC1hc3NldHMtYXJlLWJlY29taW5nLW1haW5zdHJlYW0tcHJvZHVjdHMtc2F5cy1yb3NpZS1yaW9zL2FtcF9hcnRpY2xlc2hvdy85ODA0NzY2My5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "ET GBS 2023: Digital assets are becoming mainstream products, says Rosie Rios - The Economic Times",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbmN1bHR1cmUuY29tL2F1L2N1cnJlbmN5L3prc3luYy1yZWJyYW5kcy16a3N5bmMtMi0wLXRvLXprc3luYy1lcmEtc3RhcnRpbmctbmV3LXBoYXNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "Zksync Rebrands zkSync 2.0 To zkSync Era, Starting New Phase - Coin Culture",
        "content": "Ethereum scaling solution zkSync has started its next development phase, “fair onboarding alpha,” enabling some registered projects to deploy on the mainnet. Also, it has rebranded its previous network, zkSync 2.0, to zkSync Era.\n\nZkSync is releasing its version of zkEVM, a ZK-Rollup Layer 2 scaling solution compatible with the Ethereum Virtual Machine (EVM). The project was exclusively introduced in its “baby alpha” phase for internal usage in October.\n\nThe wait is over. All aboard zkSync Era∎ Mainnet! Today, Ethereum’s first zkEVM is: • Opening mainnet to builders 🥳\n\n• Adopting a brand new name 🎈\n\n• Open-sourcing its entire codebase 🎆https://t.co/PoZeliPU8t 1/8 — zkSync∎ (@zksync) February 16, 2023\n\nAfter this phase, the network was reborn in an event known as regenesis. This takes into consideration modifications to the code as a consequence of audits. Now, the project is in its second phase, the fair onboarding alpha.\n\nDuring this alpha phase of onboarding, registered projects can deploy and test their apps on zkSync Era, with token bridging enabled for testing and deployment purposes. However, the mainnet will remain inaccessible to end users.\n\nThe team noted that ongoing investments in audits and bug bounty programs will continue to ensure the platform’s security. The network will be available to all projects and users when this phase ends.\n\nThis comes after zkSync rival Polygon recently announced plans to release its zkEVM network in March.\n\nLayer 2 projects such as Polygon, Starknet, zkSync, and Scroll have been fighting intensely over the last year to build a ZK-based Layer 2 that can natively serve Ethereum applications. Although these projects have yet to launch a product for public consumption, that might change in the coming months, with zkEVMs from Polygon and others like zkSync poised to go online. Also, Matter Labs is anticipated to unveil a new road map shortly."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lmp1YW5jb2xlLmNvbS8yMDIzLzAyL2ZlZWRiYWNrLXRvZ2V0aGVyLWRlYWRsaW5lLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "Do we Have Until 2050 to become Carbon Neutral? What if 27 Climate Feedback Loops are Working together to ... - Informed Comment",
        "content": "Ann Arbor (Informed Comment) – Feedback loops are central notions in science. There are two kinds, negative and positive. Negative feedback loops, despite their name, are actually good if you are looking for stability. So for instance say you are too hot, so you sweat. The sweat evaporates, cooling you off. In fact, it could work too well, causing you cool off so much that you shiver. Shivering, spasms of your muscles, heat you back up. So you end up at a normal temperature after all that.\n\nPositive feedback loops are the ones you have to watch out for. William J. Ripple et al. explain, “For example, warming in the Arctic leads to melting sea ice, which leads to further warming because water has lower albedo (reflectance) than ice.” Here is what they mean: Say the extra carbon dioxide we put into the atmosphere causes the oceans to warm up a bit. The warmer water melts some of the ice at the North Pole. Ice reflects sunlight back out into space, so it cools the earth and its oceans off. When the ice melts, the dark water beneath becomes visible. Dark surfaces absorb sunshine rather than reflecting it. So now the water gets even hotter. And more ice melts. And the dark water absorbs more sunshine and gets even hotter. On and on. A positive feedback loop ratchets things in a single direction so that they get increasingly out of kilter.\n\nArticle continues after bonus IC video\n\nChronicle 5 WCVB; “The science behind ‘feedback loops'”\n\nSo what if the climate emergency is creating not one but 27 positive feedback loops (which, remember, are bad if you are interested in maintaining the status quo)? And what if it is only generating a handful of negative feedback loops, so that these latter cannot hope to offset all the massive changes being provoked by the positive feedback loops? The answer to these “what if?” questions is that we would be well and truly screwed.\n\nThat’s the fear expressed in a new scientific paper in One Earth by William J. Ripple et al.\n\nThey start out with a graphic showing how several of these positive feedback loops in climate change might reinforce one another:\n\nAs noted above, if we want to keep the earth cool, ice is our friend because it is blinding white and reflects the heat of sun rays back out into outer space. So a positive climate feedback loop typically sets in motion the disappearance of more and more ice. For instance, rainfall at the poles melts ice, which causes more global heating because bright surfaces are replaced by dark absorptive ones, and warmer resulting oceans then put more water vapor into the air above them, causing more rainfall, which melts more ice, and so on.\n\nIt is worse. Because when oceans warm and put more water vapor into the air above them, they are in effect emitting a greenhouse gas, since water vapor, like carbon dioxide and methane, helps keep the sun’s heat on earth once it strikes it, rather than letting it radiate out to space.\n\nSo you have two positive feedback loops going on here, with reduced reflectivity because of ice loss, which increases heat, and also increased heat from emission of a greenhouse gas, i.e. water vapor. Both of these effects reinforce one another and make the earth even hotter.\n\nNot only does the ice melting reduce its ability to reflect away the sun rays, but it causes sea level to rise. Sandy beaches are bright and reflect sunlight. But if they are submerged by dark water they can no longer do this. Loss of beaches because of sea level rise thus can raise the earth’s temperature and melt more ice which causes more sea level rise and loss of bright coastal areas. A positive feedback loop, this process can go on at the same time as the ones mentioned above.\n\nSo here’s the bottom line. The authors suggest that if a lot of these positive feedback loops operate at the same time and reinforce one another, as the few examples I chose above do, they could reduce the ability of the ocean to absorb carbon dioxide. For instance, cold water absorbs more CO2 than warm water, so if we heat up the oceans very rapidly we will reduce our carbon budget.\n\nOur carbon budget is the amount of carbon dioxide that the oceans will absorb. Almost all of the massive amounts of CO2 we have put into the atmosphere will go into the oceans. But if we go on producing billions of tons a year of CO2 after 2050, we will outrun the oceans’ absorptive capacity, and then the CO2 will just stay up there, making the earth hot, for thousands or even tens of thousands of years. Since we as a species evolved in relatively cool times, and since our civilization is premised on the stability of a cool climate, we do not know how well we will cope with a very long-term erratic Hot Earth.\n\nThat carbon budget we have between now and 2050, however, may not exist. Maybe we only have until 2035 or 2040 to stop producing CO2, in order to avoid pushing our climate system over into chaos. Chaos means super-hurricanes and massive heatwaves and unexpected flooding, etc.\n\nIf a lot of these positive climate feedback loops work together, they could reduce our carbon budget. So, the scientists say, governments and companies are unwise to set goals of being carbon neutral by 2050. That may be too late if we take into account all the destructive positive feedback loops, and especially if some of them reinforce one another.\n\nTheir message is, in other words, hurry up!"
    }
]