[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LndydHYuY29tL25ld3MvbG9jYWwtbmV3cy9icm9hZC1yaXBwbGUtZHVjay1yYWNlLXJldHVybnMtdG8tcmFpbmJvdy1icmlkZ2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "Broad Ripple Duck Race returns to Rainbow Bridge - WRTV Indianapolis",
        "content": "INDIANAPOLIS — A fun filled day of duck racing returned to the Broad Ripple Rainbow Bridge on Sunday.\n\nWRTV\n\nSince 2012, The Broad Ripple Duck Race hosted by the Broad Ripple Village Association (BRVA) brings the community together while supporting the programs and projects of the BRVA.\n\n\"All the proceeds go right back into the community, whether its beautification efforts or putting up new art murals and things like that,\" BRVA Executive Director Jordan Dillon said.\n\nThis year's race was presented by DAVID Electric.\n\n3000 rubber ducks competed, floating from the Hope Plumbing Start Line, west down the canal to the AudioChuck Finish Line.\n\nWRTV\n\nPrizes were awarded to first, second, and third place finishers. All prizes were gift cards provided by Broad Ripple merchants with the first place prize being valued at over $600.\n\nThe Rainbow Bridge was also filled with tents with vendors from local business and children's activities."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtZ29vZ2xlLWJhcmQtaWYtcmlwcGxlLXdpbGwtd2luLXRoZS1zZWMtY2FzZS1oZXJlcy10aGUtYW5zd2VyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "We asked Google Bard if Ripple will win the SEC case; Here's the answer - Finbold - Finance in Bold",
        "content": "As the summary judgment approaches in the Ripple and Securities Exchange Commission (SEC) case, attention is directed toward the potential outcome. The result remains uncertain, as experts offer projections of a Ripple or SEC victory, while some speculate a settlement may be reached.\n\nNevertheless, a section of the crypto community remains optimistic about a Ripple triumph, citing the company’s previous successes during the hearings. To gain further insight, Finbold sought the opinion of Google’s generative artificial intelligence (AI) platform, Bard, with the question: “Will Ripple emerge victorious in the SEC case?”\n\nThe tool initially acknowledged the difficulty in definitively predicting Ripple’s potential victory despite their successes during the hearings. However, Bard recognized the strength of Ripple’s arguments thus far and acknowledged that a favorable outcome would be significant for the crypto community.\n\n“It is difficult to say with certainty whether Ripple will win the SEC case. However, Ripple has made some strong arguments and has won several important victories so far. If the judge rules in Ripple’s favor, it could be a major victory for the cryptocurrency industry,” Bard said.\n\nAdditionally, Bard highlighted three key factors influencing a potential Ripple win. These include the judge’s interpretation of the Howey Test, which determines whether an investment qualifies as a security, the judge’s assessment of Ripple’s argument that XRP is not a security, and the judge’s response to the SEC’s handling of the case, particularly regarding the use of evidence obtained after Hinman’s speech.\n\nFactors likely to secure Ripple victory\n\nBard specifically identified crucial factors that could secure a Ripple victory in the ongoing case. One key argument put forth by Ripple is that XRP should not be considered a security since it does not meet the criteria of an investment contract under the Howey Test. This test necessitates an investment of money in a common enterprise with an expectation of profits derived from the efforts of others. Ripple contends that XRP fails to satisfy all these conditions.\n\nFurthermore, Ripple has asserted that the SEC’s lawsuit aims to hinder innovation within the cryptocurrency industry. They argue that applying outdated securities laws to a new technological landscape could impede progress and innovation in the crypto sphere.\n\nThe tool added that the company’s victory could depend on its significant successes in the case thus far. The tool cited instances, such as the unsealing of the Hinman speech. In the speech, Hinman stated that cryptocurrencies like Ethereum (ETH) should not be classified as securities. Additionally, the judge ruled that the SEC could not utilize evidence from an internal SEC memo written after Hinman’s speech.\n\nSEC’s possible win\n\nBard also highlighted the potential for Ripple to face a negative outcome in the case, considering certain factors. Notably, the SEC has extensive experience in regulating securities, spanning over 80 years, and has considerable resources.\n\nThe SEC has filed a motion requesting Ripple to produce documents and is determined to pursue the case to its conclusion. Bard noted that the SEC also presents a strong case, arguing that XRP qualifies as a security due to its nature as an investment contract. Furthermore, the SEC alleges Ripple’s actions violated securities laws and emphasizes its readiness to proceed to trial.\n\nTo recap, the SEC filed a lawsuit against Ripple, accusing the firm of selling unregistered securities in the form of XRP tokens and violating regulatory laws. In light of this, Bard acknowledged that the case’s outcome hinges on the judge overseeing the proceedings.\n\nWith the date for the summary judgment still unknown, anticipation is building for a significant moment on June 13 when the documents related to Hinman are set to be unsealed.\n\nLeading up to this event, XRP has responded favorably, experiencing notable price surges in recent days. Within a week, the token has witnessed a substantial inflow of capital, surpassing $2.5 billion in market cap and currently trading at $0.53. As reported by Finbold, Bard had predicted XRP is likely to trade at $0.58 by the end of 2023."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vdGhlbmVyZHN0YXNoLmNvbS9ob3ctdG8tZGVmZWF0LWVsaWFzLWluLWRpYWJsby00L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "How to Defeat Elias in Diablo 4 - The Nerd Stash",
        "content": "So, you are wondering how to defeat Elias in Diablo 4? Elias in Diablo 4 is a pesky boss who appears multiple times throughout the main campaign. This allegedly immortal boss is Lilith’s right hand and was sent to make your mission a bit harder. Once a Lorath’s apprentice, Lilith has taken over Elias and is now serving the dark side. Multiple fights with Elias throughout the campaign happen in Act 3 and Act 5. While Elias doesn’t represent major danger by himself, unlike Ashava World Boss, but he has a few minions that can cause great damage to your character. This guide will show you how to defeat Elias in Diablo 4.\n\nDiablo 4: How to Defeat Elias\n\nHere is a step-by-step guide on how to defeat Elias in Diablo 4, including Act 3 and Act 5.\n\nRelated:\n\nAct 3 – Piercing the Veil: Reach the temple devoted to Lilith. The initial encounter with Elias is brief but sets the stage for future battles. Act 5 – On the Precipice: Uncover Elias’ source of immortality. Prepare for a tougher fight with Oppressors, Pitlords, and deadlier minions. Watch out for Crimson Ripple: Elias periodically casts this devastating spell, enveloping the ground in blood-red vapors. Use defensive spells or Legendary Aspects for temporary immunity. Heal promptly after the attack. Team up with Lorath: Join forces with Lorath to defeat Elias this time. The initial fight may seem easy, but more challenging encounters lie ahead. Interact with the Blood Petals: Trigger the second fight by interacting with the blood petals. Champions of Lilith: Elias summons a massive demon, the Champion of Lilith. Defeat it while evading Elias’ attacks. Another champion emerges once the first is vanquished. Halls of Battle: Progress through the halls for the third encounter. Elias summons a Champion of Lilith and two Crazed Supplicants who create a blood barrier. Eliminate the supplicants to defeat Elias. Open Area Confrontation: In a spacious area, Elias summons Crazed Supplicants to shield himself. The Champion of Lilith is absent. Defeat the supplicants while avoiding Elias’ attacks. Weakened Defenses: When Elias’ health drops to around 25%, he summons five Crazed Supplicants for added protection. Eliminate them swiftly. Beware of Elias’ Attacks: Dodge blood balls, ground pentagrams, and blood-homing missiles. Move away from danger. Disrupt the Blood Barrier: Crazed Supplicants create a barrier. Dispatch them quickly to expose Elias. Sustain Healing: Heal promptly after enduring Crimson Ripple or other attacks. Repeat Steps 5-12: Repeat encounters until Elias summons the final five Crazed Supplicants. The Final Confrontation: All focus on Elias. Exploit his vulnerability to unleash powerful attacks and defeat him.\n\nDiablo 4 releases on June 6."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LndydHYuY29tL25ld3MvbG9jYWwtbmV3cy9icm9hZC1yaXBwbGUtZHVjay1yYWNlLXJldHVybnMtdG8tcmFpbmJvdy1icmlkZ2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "Broad Ripple Duck Race returns to Rainbow Bridge - WRTV Indianapolis",
        "content": "INDIANAPOLIS — A fun filled day of duck racing returned to the Broad Ripple Rainbow Bridge on Sunday.\n\nWRTV\n\nSince 2012, The Broad Ripple Duck Race hosted by the Broad Ripple Village Association (BRVA) brings the community together while supporting the programs and projects of the BRVA.\n\n\"All the proceeds go right back into the community, whether its beautification efforts or putting up new art murals and things like that,\" BRVA Executive Director Jordan Dillon said.\n\nThis year's race was presented by DAVID Electric.\n\n3000 rubber ducks competed, floating from the Hope Plumbing Start Line, west down the canal to the AudioChuck Finish Line.\n\nWRTV\n\nPrizes were awarded to first, second, and third place finishers. All prizes were gift cards provided by Broad Ripple merchants with the first place prize being valued at over $600.\n\nThe Rainbow Bridge was also filled with tents with vendors from local business and children's activities."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtZ29vZ2xlLWJhcmQtaWYtcmlwcGxlLXdpbGwtd2luLXRoZS1zZWMtY2FzZS1oZXJlcy10aGUtYW5zd2VyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "We asked Google Bard if Ripple will win the SEC case; Here's the answer - Finbold - Finance in Bold",
        "content": "As the summary judgment approaches in the Ripple and Securities Exchange Commission (SEC) case, attention is directed toward the potential outcome. The result remains uncertain, as experts offer projections of a Ripple or SEC victory, while some speculate a settlement may be reached.\n\nNevertheless, a section of the crypto community remains optimistic about a Ripple triumph, citing the company’s previous successes during the hearings. To gain further insight, Finbold sought the opinion of Google’s generative artificial intelligence (AI) platform, Bard, with the question: “Will Ripple emerge victorious in the SEC case?”\n\nThe tool initially acknowledged the difficulty in definitively predicting Ripple’s potential victory despite their successes during the hearings. However, Bard recognized the strength of Ripple’s arguments thus far and acknowledged that a favorable outcome would be significant for the crypto community.\n\n“It is difficult to say with certainty whether Ripple will win the SEC case. However, Ripple has made some strong arguments and has won several important victories so far. If the judge rules in Ripple’s favor, it could be a major victory for the cryptocurrency industry,” Bard said.\n\nAdditionally, Bard highlighted three key factors influencing a potential Ripple win. These include the judge’s interpretation of the Howey Test, which determines whether an investment qualifies as a security, the judge’s assessment of Ripple’s argument that XRP is not a security, and the judge’s response to the SEC’s handling of the case, particularly regarding the use of evidence obtained after Hinman’s speech.\n\nFactors likely to secure Ripple victory\n\nBard specifically identified crucial factors that could secure a Ripple victory in the ongoing case. One key argument put forth by Ripple is that XRP should not be considered a security since it does not meet the criteria of an investment contract under the Howey Test. This test necessitates an investment of money in a common enterprise with an expectation of profits derived from the efforts of others. Ripple contends that XRP fails to satisfy all these conditions.\n\nFurthermore, Ripple has asserted that the SEC’s lawsuit aims to hinder innovation within the cryptocurrency industry. They argue that applying outdated securities laws to a new technological landscape could impede progress and innovation in the crypto sphere.\n\nThe tool added that the company’s victory could depend on its significant successes in the case thus far. The tool cited instances, such as the unsealing of the Hinman speech. In the speech, Hinman stated that cryptocurrencies like Ethereum (ETH) should not be classified as securities. Additionally, the judge ruled that the SEC could not utilize evidence from an internal SEC memo written after Hinman’s speech.\n\nSEC’s possible win\n\nBard also highlighted the potential for Ripple to face a negative outcome in the case, considering certain factors. Notably, the SEC has extensive experience in regulating securities, spanning over 80 years, and has considerable resources.\n\nThe SEC has filed a motion requesting Ripple to produce documents and is determined to pursue the case to its conclusion. Bard noted that the SEC also presents a strong case, arguing that XRP qualifies as a security due to its nature as an investment contract. Furthermore, the SEC alleges Ripple’s actions violated securities laws and emphasizes its readiness to proceed to trial.\n\nTo recap, the SEC filed a lawsuit against Ripple, accusing the firm of selling unregistered securities in the form of XRP tokens and violating regulatory laws. In light of this, Bard acknowledged that the case’s outcome hinges on the judge overseeing the proceedings.\n\nWith the date for the summary judgment still unknown, anticipation is building for a significant moment on June 13 when the documents related to Hinman are set to be unsealed.\n\nLeading up to this event, XRP has responded favorably, experiencing notable price surges in recent days. Within a week, the token has witnessed a substantial inflow of capital, surpassing $2.5 billion in market cap and currently trading at $0.53. As reported by Finbold, Bard had predicted XRP is likely to trade at $0.58 by the end of 2023."
    }
]