[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmFkd2Vlay5jb20vcHJvZ3JhbW1hdGljL2JhbmstY29sbGFwc2UtY2F1c2VzLXJpcHBsZS1lZmZlY3RzLWFjcm9zcy10aGUtZGlnaXRhbC1hZHZlcnRpc2luZy1pbmR1c3RyeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Mar 2023 07:00:00 GMT",
        "title": "Bank Collapses Cause Ripple Effects Across the Digital Advertising Industry - Adweek",
        "content": "The collapse of two banks in a matter of days, Silicon Valley Bank and Signature Bank, have destabilized the publishers , ad-tech firms and advertisers intertwined with the tech-focused banks.\n\nIn the days since, unaffected companies have been serving as ballasts, offering relief payments to publishers and paying out existing publisher clients early. Other industry-wide tremors include publishers and tech firms moving money elsewhere and potentially needing to do more due diligence on prospective partners.\n\nSupply-side tech companies Kargo and Adagio are offering to pay their publishers early to help mitigate dislocations, CEOs from both firms told Adweek.\n\nOarex Capital Markets, a company that provides quick liquidity to digital advertising companies by buying accounts receivable, has received new prospective clients, said EVP Nick Carrabbia."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbmdhcGUuY29tL3ByZXNzLXJlbGVhc2VzL2xpdGhvc3BoZXJlLWxpdGhvLWFpLWJsb2NrY2hhaW4tZGV2ZWxvcGVycy1wcmVkaWN0LXJpcHBsZS14cnAtd2lucy10aGUtc2VjLWNhc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Mar 2023 07:00:00 GMT",
        "title": "Lithosphere (LITHO) AI blockchain developers predict Ripple - CoinGape",
        "content": "Lithosphere (LITHO) reiterates its support for Ripple (XRP) in its case against the SEC. The core team building Lithosphere, KaJ Labs, predicts that Ripple will win the legal battle against the U.S. financial regulator.\n\n\n\nThe Lithosphere network aims to address the bottlenecks that hinder the adoption of blockchain technology and Web3 in the mainstream by providing a robust infrastructure for the transfer of distributed value and interoperability across multiple blockchain networks.\n\nThe XRP cryptocurrency was created by Ripple in order to provide a network for fast and low-cost cross-border money transfers. The SEC claims that the sale of XRP constitutes an offering of an unregistered security or an illegal initial public offering. The litigation has now become a bellwether case that clearly demonstrates the lack of clarity in the regulation of cryptocurrencies.\n\nKaJ Labs recognizes the importance of the Ripple vs. SEC case and the implications of its outcome on the broader cryptocurrency space, and believes the outcome will be positive in the near future.\n\nKaJ Labs launched the Lithosphere.network to address several bottlenecks hindering mainstream Web3 adoption but also as a means of addressing deep rooted bias & empowering underrepresented communities globally. This donation reaffirms KaJ Labs’ commitment to social justice and equality, along with Lithosphere’s position and allocation of Litho towards social responsibility causes and philanthropy.\n\nLithosphere’s first distribution of funds to the NAACP and the National Homelessness Law Center is part of its ongoing commitment to social and racial justice causes. The platform will provide donors, volunteers and nonprofits with greater accessibility, more flexibility, and faster transactions to further the missions of social justice and equity.\n\nAbout Lithosphere\n\nLithosphere is the world’s first AI powered, advanced blockchain interoperability platform. The KaJ Labs foundation, the core developers of Lithosphere, introduce; a novel consensus algorithm, a new token standard with a combination of other innovations like Deep Neural Networks(DNNs) to make smart contracts intelligent. The KaJ Labs foundation aims to drive mainstream Web3 adoption.\n\nLithosphere is a platform-level public chain in the digital economy era that as a key infrastructure for value transfer, can connect all kinds of value, provide complete financial functions, communicate diverse communities and tokens, and bridge centralized and decentralized organizations.\n\nLithosphere’s goal is to establish a platform-level public chain in the digital economy era that as a key infrastructure for value transfer, can connect all kinds of value, provide complete financial functions, communicate diverse communities and tokens, and bridge the centralized and decentralized organizations to bring the Internet of Value as early as possible with a combination of AI & Deep Learning.\n\nAbout KaJ Labs\n\nKaJ Labs is a decentralized research organization focusing on AI and blockchain technology. We’re driven to create innovative products that work for the greater good around the globe.\n\nFounded in 2017 by Joel Kasr, the KaJ Labs foundation is the driving force behind the AI blockchain platform, Lithosphere™. The KaJ Labs Foundation is an international non-profit foundation that was formed to support the development of Lithosphere and the ecosystem that will contribute to the Lithosphere Network.\n\nThe Foundation has research laboratories in Seattle, WA and Singapore with other remote employees around the world.\n\nMedia Enquiries\n\nDorothy Marley\n\nKaJ Labs Foundation\n\nWebsite: https://kajlabs.org\n\nWebsite: https://lithosphere.network"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiswFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL25hdGlvbmFsLWFuYWx5c2lzLXJldmVhbHMtZGV2YXN0YXRpbmctcmlwcGxlLWVmZmVjdC1vZi1ndW4tdmlvbGVuY2Utb24tY29tbXVuaXRpZXMtaW4tbmV3LXlvcmstYW5kLWFjcm9zcy10aGUtdW5pdGVkLXN0YXRlcy0zMDE3NzIyOTQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Mar 2023 07:00:00 GMT",
        "title": "National Analysis Reveals Devastating Ripple Effect of Gun Violence on Communities in New York and Across the ... - PR Newswire",
        "content": "Gun Violence in 2021 Alone Will Cost Nation $47 Billion in Lifetime Income Lost, $563 Billion in Quality-Adjusted Life Years Lost\n\nFirearms the Leading Cause of Death for Children in 2020; 30,000 Children Lost a Parent to Gun Violence in 2021\n\nNEW YORK, March 15, 2023 /PRNewswire/ -- An estimated 158,216 people in the United States were killed or injured by guns in 2021—48 victims for every 100,000 people. This firearm violence levied a huge financial burden on the nation: an estimated: $2.2 billion per year in direct medical costs, $47 billion in lifetime income lost, and $563 billion in quality-adjusted life years lost, according to a national analysis released today by United Hospital Fund, produced in a collaboration with Boston Consulting Group.\n\nThe Ripple Effect: gun violence in 2021 alone will cost the U.S. $47 Billion in lifetime income lost Post this Firearm injury rates by state, 2021 Firearm death rates by county, 2018-2021\n\nThe report reaffirms that firearms were the leading cause of death for children in 2020, overtaking motor vehicle accidents, while approximately 30,000 children lost a parent to gun violence in 2021. \"Children are unlikely to reach adulthood without exposure to gun violence,\" the report concludes, and estimates that the costs of counteracting the traumatic psychological and social impacts of gun violence on the nation's children will total an estimated $4 billion over their lifetime.\n\nThe report, The Ripple Effect of Firearms: How Families, Communities, and Society in the U.S. Are Affected by Firearms , analyzed the impact of gun violence in 2021 nationwide, and countyby-county in New York State, broken down by gender, race, and age. Southern states had the highest ratio of gun victims, led by Mississippi with 104.9 shooting victims per 100,000 residents. Although New York State ranked 48th, with 18.1 victims per 100,000, because of its large population more New Yorkers died by firearms than residents of most other states—over 1,000 in 2021 alone.\n\nOther key findings:\n\nMore than half of all firearm deaths are suicides , and 85 percent of suicide attempts by gun are successful, compared with less than three percent of suicide attempts by drug overdose.\n\n, and 85 percent of suicide attempts by gun are successful, compared with less than three percent of suicide attempts by drug overdose. Race, age, gender, and zip code determine how likely you are to die from gun violence. White men over 50 in rural areas are most likely to die by gun suicide, while gun homicide is the leading cause of death for Black men in their early 20s. Nationally, 32 percent of gun homicide victims are Black, though Black people make up only 14 percent of the overall population.\n\nWhite men over 50 in rural areas are most likely to die by gun suicide, while gun homicide is the leading cause of death for Black men in their early 20s. Nationally, 32 percent of gun homicide victims are Black, though Black people make up only 14 percent of the overall population. Black women were nine times as likely to be killed by guns as white women and 4.5 times as likely as Hispanic women. When a gun is involved, domestic violence is five times more likely to result in death.\n\nand 4.5 times as likely as Hispanic women. When a gun is involved, domestic violence is five times more likely to result in death. Federal spending on research into gun violence is only $63 per life lost, compared with median funding of $4,852 per life lost for all leading causes of death. Disparities in federal funding make gun violence the second most neglected cause of death after falls.\n\nWithin New York State, rural Allegany and Delaware Counties had the highest per capita rate of firearm deaths, each recording 14.2 people killed by guns per 100,000 residents. More than 84 percent of firearms deaths in those two counties were the result of suicides.\n\nBrooklyn (Kings County) had the highest number of firearm fatalities in the state—an estimated 444, equal to 4.3 deaths per 100,000. However, only 33 percent of firearm deaths in New York State in 2021 were in New York City, despite it being home to 43 percent of New Yorkers.\n\n\"The prevalence of gun violence is desensitizing many of us to the tremendous toll it is exacting on our communities and our nation,\" said Alexandra Brandes, the report's lead author and director of UHF's Medicaid Institute. \"This report highlights the need to treat gun violence as a public health problem at the national, state, and community levels.\"\n\n\"This data-rich report demonstrates that gun violence must be viewed as a major public health issue that disproportionately harms the most underserved communities,\" said Oxiris Barbot, MD, UHF president and CEO. \"As more children and adults are killed, injured, and traumatized by gun violence, we must focus on prevention and treatment.\"\n\nIn addition to Alexandra Brandes, the report was co-authored by UHF research analyst Giovanna Braganza and Joan Guzik, director, Quality and Efficiency. It can be downloaded for free here .\n\nAbout United Hospital Fund\n\nUnited Hospital Fund works to build an effective and equitable health care system for every New Yorker. An independent, nonprofit organization, we are a force for improvement, analyzing public policy to inform decision-makers, finding common ground among diverse stakeholders, and developing and supporting innovative programs that improve health and health care. We work to dismantle barriers in health policy and health care delivery that prevent equitable opportunities for health. For more on our initiatives and programs please visit our website at www.uhfnyc.org and follow us on Twitter .\n\nSOURCE United Hospital Fund"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vcmlwcGxlLmNvbS9pbnNpZ2h0cy9kaWdpdGFsLWFzc2V0LWRldmVsb3BtZW50cy1pbi1zb3V0aC1rb3JlYS1iYWxhbmNpbmctaW5ub3ZhdGlvbi1hbmQtcmlzay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Mar 2023 07:00:00 GMT",
        "title": "Digital Asset Developments in South Korea: Balancing Innovation and Risk - Ripple",
        "content": "South Korea’s undeniable technological edge has firmly placed the country at the forefront of embracing new technology and innovations – from semiconductors and smartphones, to blockchain and digital assets. In fact, the Korea Financial Intelligence Unit (KoFIU) found that South Korea’s total market size for digital assets grew to USD 45.9 billion at the end of 2021, while the number of active users grew approximately 23% from 5.58 million in end-2021 to 6.9 million in the first half of 2022.\n\nThe growth of the sector has made it more imperative than ever for South Korean regulators and policymakers to establish regulatory clarity for digital assets, in order to ensure consumer protection and risk management requirements are addressed.\n\nSome initial steps have been taken – in March 2020, the South Korean Parliament passed an amendment to the Act on the Reporting and Use of Specific Financial Transaction Information which came into effect a year later, extending licensing requirements to virtual asset service providers (VASPs). While the intent of the policy is sound, its broad scope for implementation has meant that almost all entities offering solutions using digital assets are brought under regulatory scrutiny – even if they are not VASPs. To date, only five entities in South Korea have met the requirements for full licensing, and over 60 entities have had to cease operations altogether. The result seems to be that firms onshore have become more cautious about dealing with digital assets, which has implications on innovation in the sector.\n\nDeveloping a clear taxonomy for digital assets\n\nIn a recent whitepaper, Ripple highlighted the need for regulatory changes and provided policy proposals to support innovation in South Korea’s digital assets sector. The paper detailed an approach for understanding the evolving blockchain and digital assets ecosystem, while recommending a policy framework for blockchain and digital assets in South Korea. An essential part of this policy framework is the need to adopt a clear taxonomy for digital assets aligned with global best practices, thereby providing a clear distinction between payment tokens, utility tokens, and security tokens.\n\nIn a firm step towards providing such regulatory clarity, South Korea’s Financial Services Commission (FSC) recently published guidelines for defining what digital assets would be considered security tokens (STOs), and hence fall under regulations applicable to financial securities. Digital assets will be treated and regulated as securities if they have the corresponding characteristics laid out in the Financial Investment Services and Capital Markets Act.\n\nThe FSC has said that examples of digital assets which are likely to be classified as STOs include those that:\n\nProvide a stake in the operation of a business; Bear the rights to dividends or residual property; Have the issuer attribute profits generated from the business to investors.\n\nThis determination will be made on a case-by-case basis, and issuers and brokers, including VASPs, will be held responsible for making such evaluations in line with these guidelines. The relevant amendments to the Capital Markets Act to recognise STOs are expected to be finalized in the first half of 2023, and could be implemented in 2024 once passed by the South Korean Parliament.\n\nDigital assets outside the definition of STOs, such as payment tokens, will be governed by the upcoming Digital Asset Basic Act that is currently being reviewed by the South Korean National Assembly.\n\nRegulating emerging areas of interest\n\nBesides a token taxonomy, there are also emerging areas of interest in Non-Fungible Tokens (NFTs) and stablecoins that may warrant regulatory attention in South Korea.\n\nFollowing the collapse of Terraform Labs’ algorithmic stablecoin UST in May 2022, stablecoins have gained importance in the global regulatory debate on digital assets. Like many of their global counterparts, South Korean regulators continue to keep a close eye on stablecoin developments. In a report published December 2022, the Bank of Korea (BoK) highlighted that stablecoins – especially if they begin to be widely used for payments – have the potential to undermine monetary sovereignty, and will require a regulatory approach distinct from other crypto assets. In particular, the report discussed the need for minimum capital and reserve assets, as well as fit-for-purpose value stabilization mechanisms and investor protection measures. This echoes the sentiments of other global regulators such as the Monetary Authority of Singapore, the Hong Kong Monetary Authority, and the New York Department of Financial Services.\n\nOn the NFT front, worldwide interest in these unique cryptographic tokens has continued to grow. Based on TRM Labs’ analysis, the number of NFTs minted across three major NFT blockchains has more than doubled over the past year, with the number of NFT transfers also doubling.\n\nWith its thriving esports industry and the global popularity of Korean pop culture, it’s no surprise that South Korea is leading the charge in NFT adoption – with current South Korean President Yoon Suk-yeol even having issued NFTs as part of his presidential campaign. Over the next five years, NFT revenue in South Korea is expected to grow 19% annually to reach USD 181 million by 2027. The South Korean Ministry of Science and ICT has also committed to investing KRW 223.7 billion (USD 173 million) to foster a metaverse ecosystem in the country.\n\nCurrently, NFTs are not regulated in South Korea as they do not fall under the definition of ‘virtual assets’, a view that was reaffirmed by a FSC representative, in line with Financial Action Task Force (FATF) guidelines. However, in making this determination, the FSC appears to have focused on how the FATF considered NFTs to be “unique, rather than interchangeable”, and hence utilized as collector items – instead of as a means of payment. Yet, NFTs can in fact be used for money laundering, as NFT issuers are not required to comply with anti-money laundering (AML) obligations since NFTs are not considered to be virtual assets.\n\nA deeper look at on-chain risks\n\nAside from regulatory levers, South Korean policymakers and law enforcement agencies are also looking to enhance capabilities to detect and combat illicit digital asset-based activities. In January, the Ministry of Justice and the Financial Supervisory Service (FSS) announced plans to implement tools for virtual asset market monitoring, AML, and recovery of criminal proceeds.\n\nThis is particularly pertinent given the significant amount of illicit activity perpetrated by North Korean-linked groups. In a landmark move in February 2023, South Korea issued its first independent sanctions against four individuals and seven groups for North Korea-related crypto theft; several of which were already the subject of United States sanctions. Alongside sanctions, the South Korean government highlighted how money siphoned through crypto heists by North Korea-linked groups were likely used to fund nuclear and missile development efforts. Analysis by TRM Labs found that North Korea was likely responsible for over USD 1 billion of the record-setting USD 3.7 billion in crypto hacks perpetrated in 2022.\n\nThe move to enhance virtual asset monitoring and tracing capabilities is a positive indication that South Korea understands this fundamental truth – the same blockchain technology being exploited by North Korea and other bad actors also holds the power to identify and combat their illicit activity through blockchain intelligence. Enhanced blockchain intelligence capabilities, combined with stronger regulatory oversight, will strengthen South Korea’s position to stimulate innovation of digital assets and disrupt crypto-based crime.\n\nThe road ahead\n\nTo say the least, we can expect South Korean policymakers to continue devoting significant resources to regulating, understanding, and monitoring the digital asset space. Initial policy initiatives have shown thought towards balancing regulatory and consumer protection objectives, while fostering growth and innovation. As South Korea gears up to provide more regulatory clarity to its digital asset ecosystem, the country will only stand to reap the rewards of a more vibrant and inclusive digital economy — and further bolster its already world-renowned technological edge.\n\nLearn more about Ripple’s global public policy perspectives.\n\nThis article was written in collaboration with the TRM Labs policy team."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNic25ld3MuY29tL25ld3Mvc2lsaWNvbi12YWxsZXktYmFuay1zaWduYXR1cmUtYmFuay1jb2xsYXBzZS1qb2UtYmlkZW4tY2JzLW5ld3MtZXhwbGFpbnMv0gFpaHR0cHM6Ly93d3cuY2JzbmV3cy5jb20vYW1wL25ld3Mvc2lsaWNvbi12YWxsZXktYmFuay1zaWduYXR1cmUtYmFuay1jb2xsYXBzZS1qb2UtYmlkZW4tY2JzLW5ld3MtZXhwbGFpbnMv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Mar 2023 07:00:00 GMT",
        "title": "Silicon Valley Bank, Signature Bank failures ripple across the industry - CBS News",
        "content": "Biden says banking system safe after two banks fail in a matter of days\n\nThe startling collapse of Silicon Valley Bank and Signature Bank continued to ripple across the American economy even as the U.S. raced to stabilize the banking system.\n\nIn a bid to contain the risk of contagion, financial regulators announced Sunday that they will guarantee all deposits at the banks, while President Biden said Monday that \"Americans can have confidence that the banking system is safe.\" Here's the latest on the situation.\n\nWhat happened to Silicon Valley Bank?\n\nSilicon Valley Bank (SVB), the 16th-largest U.S. bank with $210 billion in assets, was seized by California regulators on Friday after depositors rushed to withdraw funds over concerns the bank might become insolvent. It is the second-biggest bank failure in U.S. history and the largest since the Federal Deposit Insurance Corporation was forced to take control of Washington Mutual in 2008 during the subprime housing crash.\n\nSVB's collapse spooked customers at other banks, including clients with deposits exceeding the FDIC's $250,000 deposit insurance limit, and raised concerns about possible runs at other financial institutions. Heightening those fears, New York state regulators on Sunday shuttered Signature Bank — the third-biggest failure in U.S. banking history.\n\nAnother bank, Silvergate Capital, also blew up last week, although that preceded SVB's failure and stemmed from losses tied to the struggles of cryptocurrency customers like bankrupt FTX and Genesis. The government did not take control of Silvergate, which chose to liquidate.\n\nWhat is the government doing?\n\nThe FDIC, Federal Reserve and Department of the Treasury said in a joint statement on Sunday that the U.S. will guarantee the deposits of both SVB and Signature.\n\nIt's worth noting that the FDIC is required by law to resolve a failed bank while moving to protect depositors. The government said that SVB customers, most of which are small and midsize technology companies, will be able to tap their funds starting on Monday.\n\nThe Fed and Treasury also launched a program that would advance capital for up to one year to any federally insured bank eligible to borrow from the central bank. The goal is to allow banks to cover deposit outflows without having to absorb losses on depreciated securities, according to Goldman Sachs analysts.\n\nAre the feds bailing out banks — again?\n\nThe Biden administration quickly took the idea of a bailout for SVB off the table, no doubt sensitive to the optics of Washington again riding to the rescue of bankers, as the Obama administration did during the 2008 financial crisis.\n\nMr. Biden and Treasury Secretary Janet Yellen said taxpayers won't be on the hook for any losses related to disposing of SVB, seeking to allay any concerns about Americans having to bear the brunt. Instead, the FDIC will handle the costs using the fees that banks contribute to the agency's deposit insurance fund.\n\nMeanwhile, shareholders at SVB and Signature, along with their unsecured creditors, will lose their money and bank executives will lose their jobs. It is depositors who are being rescued. That is what bank regulators are supposed to do when lenders crash — protect Main Street.\n\nSome Republican lawmakers, including House Financial Services Committee Chairman Patrick McHenry of North Carolina and Senate Banking Committee Ranking Member Tim Scott of South Carolina, were also careful to avoid framing the government's guarantees for SVB and Signature as a bailout.\n\nStill, some analysts think Republicans could look to make political hay out of the crisis, noting that the deep-blue states of California and New York were home to the two banks.\n\nWhy did Silicon Valley Bank fail?\n\nThe short answer is that SVB, although profitable when California regulators took control, was unprepared for the Federal Reserve aggressively pushing up interest rates and the potential impact that would on its investment portfolio.\n\nBy industry standards, a disproportionate share of the company's capital was held in longer-duration investments, including mortgage securities and bonds, according to Bloomberg. As interest rates rose, the value of of SVB's investments fell, raising concerns about its solvency and leading the bank's customers to yank their funds.\n\nLPL Research said SVB appears to have held significantly more short-term marketable securities — or investments that can be sold quickly to raise cash — relative to its total assets or deposits than other banks its size. That suggests the bank was more vulnerable to sudden swings in the market and to pressure on bond prices, said the market research firm, which blamed SVB's downfall in part on what it called \"balance sheet mismanagement.\"\n\nMany of SVB's customers were venture capital-backed tech startups that grew quickly during the pandemic, with significant cash holdings they kept at SVB. As interest rates surged and the economy slowed, many of these players have burned through their cash, driving down the bank's deposits. That forced the bank to dump securities at a loss to raise capital to cover the outflow of deposits, which in turn threatened to wreck the company's balance sheet.\n\nBy contrast, experts say that most regional lenders, as well as the biggest banks, have far more diversified deposit bases.\n\nWhat will happen to Silicon Valley Bank?\n\nThe FDIC scrambled to find a buyer for SVB after taking it over — that effort appears to have failed, although the agency could continue beating the bushes. Yellen told \"Face the Nation\" on Sunday that the FDIC was considering a \"range of available options,\" including an acquisition by a foreign bank.\n\nWhy did Signature Bank fail?\n\nRegulators closed Signature, a $110 billion commercial bank with offices in California, Connecticut, Nevada, New York and North Carolina, on Sunday as customers alarmed by SVB withdrew their funds.\n\nOn paper, Signature was on solid footing, and as recently as March 9 the company was touting its \"strong financial position.\" But its collapse underlined how quickly panic can grip banking customers, who often move their assets to large banks when uncertainty flares.\n\nBarney Frank, the former House Speaker from Massachusetts and a member of Signature's board of directors, told the Wall Street Journal that the company failed because of an \"SVB-generated panic.\"\n\nIs the U.S. banking system safe?\n\nMr. Biden sought to reassure Americans that the nation's banking system remains stable, saying that \"Your deposits will be there when you need them.\"\n\nBank industry analysts also expressed confidence that the banking system as a whole is safe.\n\n\"We believe the events should not have significant broader implications for the economy and are not a sign of systemic risks to the banking sector,\" John Canavan, lead analyst at Oxford Economics, told investors in a report on Monday.\n\nOne reason that view might be right: The failures of Silicon Valley Bank, Signature and Silvergate appear chiefly a result of financial issues specific to each bank — exposure to interest rates at SVB and exposure to crypto industry losses at Signature and Silvergate — not systemic issues with America's banks.\n\nIn other words, these banks collapsed for markedly different reasons than those that slammed Lehman Brothers in 2008 as well as the broader lending industry during the ensuing crisis — issuing risky loans to millions of households and businesses across the country.\n\nAlso, because of SVB's relatively modest size — by comparison, JPMorgan Chase, the nation's largest bank, has more than $3 trillion in assets — the smaller bank was not subject to the Fed's regular stress tests. Bigger banks in the U.S. (along with smaller institutions in Europe and the U.K.) are subject to such reviews of their financial health, reducing the odds of a larger meltdown.\n\nStill, more individual banks, especially small and regional lenders, could be at risk. Trading in shares of at least a dozen regional banks was halted Monday as jittery investors bailed from bank stocks.\n\nSan Francisco-based First Republic Bank, which has $212 billion in assets, lost more than 70% in early trade, while Western Alliance Bancorporation tumbled 81%, PacWest Bancorp plunged 50% and Zions Bancorporation sank 27%. Other well-known financial firms also took a hit, with the shares of Charles Schwab, Comerica and Fifth-Third Bancrop all dropping by double-digits.\n\n\"While the situation remains in flux, there are good reasons to think that [SVB's failure] does not call into question the solvency of the U.S. or wider global financial system in the way that Lehman did,\" analysts with Capital Economics said in a report. \"But it illustrates the extent to which vulnerabilities are lurking in the financial sector and strengthens the case for central banks to exercise caution in raising rates further as the effects of policy tightening so far become apparent.\"\n\nIs the crisis over?\n\nNot yet, although most banking experts and market analysts think the immediate financial crisis will pass.\n\n\"For now, markets are not anticipating a Lehman Brothers-style panic, and based on existing information that is a reasonable response,\" Eric Vanraes, portfolio manager of the Strategic Bond Opportunities Fund at Eric Sturdza Investments, said in an email. \"If we were in a Lehman-style environment, the Fed would have already cut rates.\"\n\nThe political reverberations, however, are likely to persist for some time to come. Expect lawmakers to summon banking regulators and industry executives to Congress to explain what happened and discuss how to guard against future bank runs. Yellen is likely to face questions about the situation when she appears before the Senate Finance Committee on Thursday to discuss the Biden administration's 2024 budget.\n\nOne key question following the SVB debacle is whether bank customers across the U.S. with funds exceeding the FDIC's $250,000 deposit insurance limit can always expect the government to step in when lenders collapse. Although such backstops can help ensure confidence in the financial system, critics say it also creates \"moral hazard.\"\n\nUnder this scenario, if all deposits at big banks are guaranteed by the government, people and businesses are likely to park their money in whichever institutions offer the best interest rates — regardless of their financial condition. That could lead bank executives to take the kind of risks that required taxpayers to ride to the rescue in 2009.\n\nLonger term, financial regulators are likely to face pressure to tighten their oversight of regional banks, especially of lenders like SVB with a large share of uninsured deposits. According to analysts at JPMorgan, uninsured deposit levels at the country's biggest banks average around 43%, but that figure can top 60% for some regional institutions — a risk when lenders wobble.\n\nThat potential risk is considerable: Overall, roughly $7 trillion of deposits in U.S. banks is uninsured — 43% of total domestic deposits, the bank noted.\n\n—The Associated Press contributed to this report."
    }
]