[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8va3VlbnNlbG9ubGluZS5jb20vdGhlLXJpcHBsZS1lZmZlY3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "The ripple effect - Kuensel, Buhutan's National Newspaper",
        "content": "Bhutanese going abroad, sending money home, changing lives of parents and relatives back in Bhutan, securing a future for themselves, settling down or returning home, has been the story so far. It is a happy story, but not all with a happy ending going by the ripple effect.\n\nIn retrospect we have not thought about how far that ripple ripples out. When the trend of going Down Under started, not many expected if it would lead to a brain drain or a mass exodus. Fresh university graduates or freshmen at work leaving was not a problem. It, in fact, eased the burden of creating jobs. When those in critical areas like teachers and health workers, engineers and those at the mid-career level – part of many succession plans – joined the march, it left a huge gap to fill.\n\nThe trend may not be reversing, but we are staring at a saturation point. With many finding it hard to find a job or a house, there is a caution. Getting a visa is only a start if it is self-funded. The problem starts from the airport. There are reports of some Bhutanese reaching the airport without the slightest idea of where to go or live.\n\nRemittance is the latest concern. Whether people send dollars home or not, it was not an issue. Bhutan was never dependent on remittance. Remittance could help ease the burden on dwindling hard currency reserves. But it was not the main source like some of our South Asian neighbours. For those benefitting from a son or a daughter in Australia, the Ngultrum is more than enough.\n\n\n\n\n\n\n\n\n\nWhat is concerning is the young people working and living in foreign land. Bhutanese are not only leaving for Australia where the safety and security network is better. What about the hundreds of young girls in the Middle East and beyond? What about the others who cannot cope up with pressure, study or work, especially when they have to earn to pay for studies, food and shelter?\n\nAlthough not officially confirmed, there are talks of many selling their property at home to invest abroad. Landlords, it is said, are beginning to worry as vacating notices increase. It might help bring down rents, but the ripple effect could hit the economy. No house is built without loans and no landlord would have rented out without calculating their dues to banks.\n\nThere are bigger issues at home than Bhutanese going to Australia, Canada, India or the US. But it cannot be ignored.\n\nWe can surmise that there are about 5,000 Bhutanese in foreign land who are eligible to vote and given the postal ballot facility. Only 676 registered to vote in the National Council elections next month. What is it indicating?"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG8tcmVwb3J0ZXIuY29tL25ld3MvZG9udC1zbGVlcC1vbi1yaXBwbGUteHJwLXNvbGFuYS1zb2wtYW5kLWF2b3Jhay1haS1pbnZlc3QtYmVmb3JlLXRoZS1uZXh0LWJ1bGwtcnVuLXN0YXJ0cy00MzU2OS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Don't Sleep On Ripple (XRP), Solana (SOL), and Avorak AI - Invest Before The Next Bull Run Starts - Crypto Reporter",
        "content": "It can be overwhelming to keep up with all of the changes in the constantly evolving crypto market. However, it’s important to stay informed in order to make smart investment decisions. On that note, Ripple (XRP), Solana (SOL), and Avorak AI (AVRK) are cryptocurrencies worth taking a closer look at. These projects offer innovative solutions and are expected to experience significant price increases in the next bull run.\n\nRipple (XRP)\n\nRipple (XRP) is a digital payment protocol designed to facilitate fast international money transfers at low transaction costs. Several banks and financial institutions currently use Ripple to move currencies between different countries. Despite facing some legal challenges, Ripple has continued to gain popularity among investors and traders alike. Ripple news and XRP Price movements are closely watched by many in the cryptocurrency industry. As we approach the next bull run, investors can consider Ripple due to its potential for growth and the increasing adoption of its technology by major financial institutions in the mainstream.\n\nSolana (SOL)\n\nSolana is a fast and scalable blockchain platform that was launched in 2020. It is designed to support decentralized applications (dApps) and smart contracts at fast transaction speeds. Solana has gained attention in the cryptocurrency industry due to its high throughput, low fees, and ability to handle complex smart contracts. SOL, its native token, is used to settle transaction charges and pay for other services on the platform. SOL’s price has been rising steadily, and Solana news points to a significant increase in the next bull run.\n\nAvorak AI (AVRK)\n\nAvorak AI is an AI crypto project in its ICO phase. The project combines AI and crypto technologies to develop solutions that help simplify and automate tasks. For example, Avorak’s text-generating AI will offer autocorrected and edited texts that are not plagiarized and that fit the exact specifications of the user. This is as seen in Avorak Write alpha below.\n\nThe user input system of the platform is either through text or voice-to-text, which makes it easier for users to access and use the ecosystem’s AI products. Youtube videos by crypto analysts across the world, such as Crypto Epoch, Crypto Bape, and Cilinix Crypto, all talk about Avorak AI and its advantages over other projects.\n\nAvorak’s ICO has seen strong interest from investors due to its generosity towards early buyers by including more benefits to its ICO investors, mainly bonuses. However, the bonuses decrease, and AVRK’s price increases with each phase. This emphasizes the importance of investing early. The project is currently in phase 2, with AVRK going for $0.105. AVRK’s price is already up 75% from its initial price, and the current bonus is 9%, down from the previous 10%. Crypto Labs consider Avorak an AI crypto gem, and its ICO an opportunity to invest in a token that will see significant price increases in the coming bull run and in the future because of its unique solutions and unlimited use cases.\n\nConclusion\n\nRipple (XRP), Solana (SOL), and Avorak AI (AVRK) all offer unique solutions that offer use cases beyond simply storing value. They are expected to have significant price increases in the coming bull run. Investors should therefore consider adding them to their crypto investment portfolios.\n\nFor more information on Avorak AI:\n\nWebsite: https://avorak.ai\n\nWhitepaper: https://avorak-labs-and-technology.gitbook.io/avorak-a.i-technical-whitepaper/\n\nDisclaimer: The statements, views and opinions expressed in this article are solely those of the content provider and do not necessarily represent those of Crypto Reporter. Crypto Reporter is not responsible for the trustworthiness, quality, accuracy of any materials in this article. This article is provided for educational purposes only. Crypto Reporter is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Do your research and invest at your own risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG8tcmVwb3J0ZXIuY29tL25ld3MvZG9udC1zbGVlcC1vbi1yaXBwbGUteHJwLXNvbGFuYS1zb2wtYW5kLWF2b3Jhay1haS1pbnZlc3QtYmVmb3JlLXRoZS1uZXh0LWJ1bGwtcnVuLXN0YXJ0cy00MzU2OS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Don't Sleep On Ripple (XRP), Solana (SOL), and Avorak AI - Invest Before The Next Bull Run Starts - Crypto Reporter",
        "content": "It can be overwhelming to keep up with all of the changes in the constantly evolving crypto market. However, it’s important to stay informed in order to make smart investment decisions. On that note, Ripple (XRP), Solana (SOL), and Avorak AI (AVRK) are cryptocurrencies worth taking a closer look at. These projects offer innovative solutions and are expected to experience significant price increases in the next bull run.\n\nRipple (XRP)\n\nRipple (XRP) is a digital payment protocol designed to facilitate fast international money transfers at low transaction costs. Several banks and financial institutions currently use Ripple to move currencies between different countries. Despite facing some legal challenges, Ripple has continued to gain popularity among investors and traders alike. Ripple news and XRP Price movements are closely watched by many in the cryptocurrency industry. As we approach the next bull run, investors can consider Ripple due to its potential for growth and the increasing adoption of its technology by major financial institutions in the mainstream.\n\nSolana (SOL)\n\nSolana is a fast and scalable blockchain platform that was launched in 2020. It is designed to support decentralized applications (dApps) and smart contracts at fast transaction speeds. Solana has gained attention in the cryptocurrency industry due to its high throughput, low fees, and ability to handle complex smart contracts. SOL, its native token, is used to settle transaction charges and pay for other services on the platform. SOL’s price has been rising steadily, and Solana news points to a significant increase in the next bull run.\n\nAvorak AI (AVRK)\n\nAvorak AI is an AI crypto project in its ICO phase. The project combines AI and crypto technologies to develop solutions that help simplify and automate tasks. For example, Avorak’s text-generating AI will offer autocorrected and edited texts that are not plagiarized and that fit the exact specifications of the user. This is as seen in Avorak Write alpha below.\n\nThe user input system of the platform is either through text or voice-to-text, which makes it easier for users to access and use the ecosystem’s AI products. Youtube videos by crypto analysts across the world, such as Crypto Epoch, Crypto Bape, and Cilinix Crypto, all talk about Avorak AI and its advantages over other projects.\n\nAvorak’s ICO has seen strong interest from investors due to its generosity towards early buyers by including more benefits to its ICO investors, mainly bonuses. However, the bonuses decrease, and AVRK’s price increases with each phase. This emphasizes the importance of investing early. The project is currently in phase 2, with AVRK going for $0.105. AVRK’s price is already up 75% from its initial price, and the current bonus is 9%, down from the previous 10%. Crypto Labs consider Avorak an AI crypto gem, and its ICO an opportunity to invest in a token that will see significant price increases in the coming bull run and in the future because of its unique solutions and unlimited use cases.\n\nConclusion\n\nRipple (XRP), Solana (SOL), and Avorak AI (AVRK) all offer unique solutions that offer use cases beyond simply storing value. They are expected to have significant price increases in the coming bull run. Investors should therefore consider adding them to their crypto investment portfolios.\n\nFor more information on Avorak AI:\n\nWebsite: https://avorak.ai\n\nWhitepaper: https://avorak-labs-and-technology.gitbook.io/avorak-a.i-technical-whitepaper/\n\nDisclaimer: The statements, views and opinions expressed in this article are solely those of the content provider and do not necessarily represent those of Crypto Reporter. Crypto Reporter is not responsible for the trustworthiness, quality, accuracy of any materials in this article. This article is provided for educational purposes only. Crypto Reporter is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Do your research and invest at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdGVjaHJhcHRvci5uZXQvZ2FtaW5nL2d1aWRlcy9kaXNuZXktZHJlYW1saWdodC12YWxsZXktZmlzaGluZy1ndWlkZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Disney Dreamlight Valley Fishing Guide - TechRaptor",
        "content": "Fishing in Disney Dreamlight Valley is pretty simple compared to some of the other games out there. You will acquire a fishing pole from Goofy after you finish his quest where he asks you to find his missing lucky fishing pole. Once you bring it back, he gives you a fishing pole of your very own to use. This is vital to progression in the game, and is an easy way to get ingredients for your meals, make some quick coin, and also gift to the residents around the town!\n\nTip: If you're looking to get started in Disney Dreamlight Valley, our Guides Hub and Starter Guide is a great place to begin. If you're looking for all of the recipes available in Dreamlight Valley, our Cooking Guide has every one! If you're wondering whether you'll like the game, you can also check out our preview.\n\nHow Disney Dreamlight Valley Fishing Works\n\nYou can access the fishing pole by pressing down the number \"4\" on a keyboard, and by hitting the right trigger to bring up the radial menu and select the Fishing Pole from there on a controller. Once you have your fishing pole in hand, you will walk up to one of the pools of water where you see bubbles floating up from a ring in the water.\n\nTo cast your line on a keyboard you will need to hold the spacebar down. On a controller, you will hold down the X button down. Once you have a bite on the line, you will see a large ring form around the fishing ripple. From there, you will be prompted to click the Left Mouse button if you're using PC controls or press X on a controller at the right time (when the large ring slowly shrinks down to the size of the original ripple and turns green) to begin reeling it in. You will need to click or hit X a few times to finally reel that bad boy in, but then it's over and you can rinse and repeat.\n\nYou can find pools of water all around the map, or in the ocean. They are pretty easy to spot, but make sure you pay attention to the color of the ripples and bubbles in the water. There are three different colored fishing ripples you will come across; white, blue, and orange. The color of the ripple determines the rarity of the fish that can be caught there, white being the basic and easy-to-catch fish, blue being slightly rare, and orange being the rarest fish available in that area. The more rare the fish, the harder it is to catch, meaning you will need to pull a few more times before a successful catch.\n\nBest Way to Fish in Disney Dreamlight Valley\n\nOne of the best ways we have found to fish within Disney Dreamlight Valley is to always bring along a companion! If you head over to any of the residents of the town and talk to them, you will see an option that says \"Let's hang out! \". This will make that resident follow you around as you complete tasks, and as they level up from you doing your tasks, such as mining ore, farming, and of course fishing. As you progress, you will be asked to choose a role for each resident of the town, so choose one to take on Fishing. This is now the companion you will want with you whenever you journey to catch fish, as with this trait, they allow you to catch bonus fish.\n\nHow to Automate Fishing with Moana's Boat\n\nIn order to unlock Moana's fishing boat, you will first need to enter the Disney Dream Castle and unlock the door to her world. Once there, she will have a few quests for you to complete to get on the sea that calls to her once again! First, you will find a few materials strewn about the beach, such as Silk and Wood Planks, and bring them back to Moana.\n\nFrom there, you will speak to the Demigod of the Wind and Sea, Maui, who will test you by asking you questions about himself. After that, you go back to Moana again, and complete her quest \"How Far You'll Go\", where you will be given a map of the ocean to take a gander at. From there, you and Moana set sail to find a light to break the mist that covers your path to the greatest fishing spot ever known. After completing her quests and bringing her back to Dreamlight Valley, you will need to head back for Maui who stayed behind on the island. He will ask you to make him a 3-Star meal in order for him to also move to the Valley.\n\nOnce you have progressed the main storyline to Dazzle Beach, and have Moana's friendship level to at least 6, she will give you a quest called \"Fixing the Boat.\" To complete the quest you will need 50 Softwood, 70 Fiber, and 3 Pink Hydrangea. Gather up all the needed materials, bring them back to Moana on Dazzle Beach, and you now have yourself a boat! Moana will then go out on voyages to collect fish for you, and the boat can be upgraded several times in order to increase its efficiency.\n\nWhere to Find Each Fish in Disney Dreamlight Valley\n\nAnglerfish\n\nWhere to Find It: Forgotten Lands\n\nSells For: 1.5k Coins\n\nEnergy Restored: +2000\n\nBass\n\nWhere to Find It: Peaceful Meadow, Forest of Valor, Sunlit Plateau, Frosted Heights\n\nSells For: 25 Coins\n\nEnergy Restored: +150\n\nBream\n\nWhere to Find It: Peaceful Meadow\n\nSells For: 600 Coins\n\nEnergy Restored: +1300\n\nCarp\n\nWhere to Find It: Forest of Valor, Sunlit Plateau\n\nSells For: 400 Coins\n\nEnergy Restored: +800\n\nCatfish\n\nWhere to Find It: Peaceful Meadow\n\nSells For: 550 Coins\n\nEnergy Restored: +1200\n\nCod\n\nWhere to Find It: Dazzle Beach, Forgotten Lands, Glade of Trust\n\nSells For: 35 Coins\n\nEnergy Restored: +150\n\nCrab\n\nWhere to Find It: Frosted Heights\n\nSells For: 600 Coins\n\nEnergy Restored: +1200\n\nFugu\n\nWhere to Find It: Dazzle Beach\n\nSells For: 900 Coins\n\nEnergy Restored: +1700\n\nHerring\n\nWhere to Find It: Dazzle Beach, Glade of Trust\n\nSells For: 65 Coins\n\nEnergy Restored: +250\n\nKingfish\n\nWhere to Find It: Dazzle Beach\n\nSells For: 450 Coins\n\nEnergy Restored: +800\n\nLancetfish\n\nWhere to Find It: Forgotten Lands\n\nSells For: 650 Coins\n\nEnergy Restored: +1300\n\nLobster\n\nWhere to Find It: Glade of Trust\n\nSells For: 950 Coins\n\nEnergy Restored: +1600\n\nPerch\n\nWhere to Find It: Forest of Valor, Sunlit Plateau\n\nSells For: 80 Coins\n\nEnergy Restored: +400\n\nPike\n\nWhere to Find It: Forest of Valor\n\nSells For: 800 Coins\n\nEnergy Restored: +1500\n\nRainbow Trout\n\nWhere to Find It: Peaceful Meadow, Forest of Valor\n\nSells For: 50 Coins\n\nEnergy Restored: +300\n\nSalmon\n\nWhere to Find It: Frosted Heights, Sunlit Plateau\n\nSells For: 150 Coins\n\nEnergy Restored: +500\n\nSeaweed\n\nWhere to Find It: Dazzle Beach, Forgotten Lands, Forest of Valor, Peaceful Meadow, Sunlit Plateau, Frosted Heights, Glade of Trust\n\nSells For: 20 Coins\n\nEnergy Restored: +25\n\nShrimp\n\nWhere to Find It: Dazzle Beach\n\nSells For: 300 Coins\n\nEnergy Restored: +750\n\nSole\n\nWhere to Find It: Forgotten Lands\n\nSells For: 200 Coins\n\nEnergy Restored: +500\n\nSquid\n\nWhere to Find It: Glade of Trust, Forgotten Lands\n\nSells For: 500 Coins\n\nEnergy Restored: +1000\n\nSwordfish\n\nWhere to Find It: Dazzle Beach\n\nSells For: 700 Coins\n\nEnergy Restored: +1500\n\nTilapia\n\nWhere to Find It: Sunlit Plateau, Frosted Heights\n\nSells For: 600 Coins\n\nEnergy Restored: +1150\n\nTuna\n\nWhere to Find It: Forgotten Lands, Glade of Trust\n\nSells For: 95 Coins\n\nEnergy Restored: +350\n\nWalleye\n\nWhere to Find It: Sunlit Plateau\n\nSells For: 1.1k Coins\n\nEnergy Restored: +1700\n\nWhite Sturgeon\n\nWhere to Find It: Frosted Heights\n\nSells For: 1.2k Coins\n\nEnergy Restored: +1800\n\nThat's it for our Disney Dreamlight Valley Fishing Guide! Check out more guides below:"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdGVjaHJhcHRvci5uZXQvZ2FtaW5nL2d1aWRlcy9kaXNuZXktZHJlYW1saWdodC12YWxsZXktZmlzaGluZy1ndWlkZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Disney Dreamlight Valley Fishing Guide - TechRaptor",
        "content": "Fishing in Disney Dreamlight Valley is pretty simple compared to some of the other games out there. You will acquire a fishing pole from Goofy after you finish his quest where he asks you to find his missing lucky fishing pole. Once you bring it back, he gives you a fishing pole of your very own to use. This is vital to progression in the game, and is an easy way to get ingredients for your meals, make some quick coin, and also gift to the residents around the town!\n\nTip: If you're looking to get started in Disney Dreamlight Valley, our Guides Hub and Starter Guide is a great place to begin. If you're looking for all of the recipes available in Dreamlight Valley, our Cooking Guide has every one! If you're wondering whether you'll like the game, you can also check out our preview.\n\nHow Disney Dreamlight Valley Fishing Works\n\nYou can access the fishing pole by pressing down the number \"4\" on a keyboard, and by hitting the right trigger to bring up the radial menu and select the Fishing Pole from there on a controller. Once you have your fishing pole in hand, you will walk up to one of the pools of water where you see bubbles floating up from a ring in the water.\n\nTo cast your line on a keyboard you will need to hold the spacebar down. On a controller, you will hold down the X button down. Once you have a bite on the line, you will see a large ring form around the fishing ripple. From there, you will be prompted to click the Left Mouse button if you're using PC controls or press X on a controller at the right time (when the large ring slowly shrinks down to the size of the original ripple and turns green) to begin reeling it in. You will need to click or hit X a few times to finally reel that bad boy in, but then it's over and you can rinse and repeat.\n\nYou can find pools of water all around the map, or in the ocean. They are pretty easy to spot, but make sure you pay attention to the color of the ripples and bubbles in the water. There are three different colored fishing ripples you will come across; white, blue, and orange. The color of the ripple determines the rarity of the fish that can be caught there, white being the basic and easy-to-catch fish, blue being slightly rare, and orange being the rarest fish available in that area. The more rare the fish, the harder it is to catch, meaning you will need to pull a few more times before a successful catch.\n\nBest Way to Fish in Disney Dreamlight Valley\n\nOne of the best ways we have found to fish within Disney Dreamlight Valley is to always bring along a companion! If you head over to any of the residents of the town and talk to them, you will see an option that says \"Let's hang out! \". This will make that resident follow you around as you complete tasks, and as they level up from you doing your tasks, such as mining ore, farming, and of course fishing. As you progress, you will be asked to choose a role for each resident of the town, so choose one to take on Fishing. This is now the companion you will want with you whenever you journey to catch fish, as with this trait, they allow you to catch bonus fish.\n\nHow to Automate Fishing with Moana's Boat\n\nIn order to unlock Moana's fishing boat, you will first need to enter the Disney Dream Castle and unlock the door to her world. Once there, she will have a few quests for you to complete to get on the sea that calls to her once again! First, you will find a few materials strewn about the beach, such as Silk and Wood Planks, and bring them back to Moana.\n\nFrom there, you will speak to the Demigod of the Wind and Sea, Maui, who will test you by asking you questions about himself. After that, you go back to Moana again, and complete her quest \"How Far You'll Go\", where you will be given a map of the ocean to take a gander at. From there, you and Moana set sail to find a light to break the mist that covers your path to the greatest fishing spot ever known. After completing her quests and bringing her back to Dreamlight Valley, you will need to head back for Maui who stayed behind on the island. He will ask you to make him a 3-Star meal in order for him to also move to the Valley.\n\nOnce you have progressed the main storyline to Dazzle Beach, and have Moana's friendship level to at least 6, she will give you a quest called \"Fixing the Boat.\" To complete the quest you will need 50 Softwood, 70 Fiber, and 3 Pink Hydrangea. Gather up all the needed materials, bring them back to Moana on Dazzle Beach, and you now have yourself a boat! Moana will then go out on voyages to collect fish for you, and the boat can be upgraded several times in order to increase its efficiency.\n\nWhere to Find Each Fish in Disney Dreamlight Valley\n\nAnglerfish\n\nWhere to Find It: Forgotten Lands\n\nSells For: 1.5k Coins\n\nEnergy Restored: +2000\n\nBass\n\nWhere to Find It: Peaceful Meadow, Forest of Valor, Sunlit Plateau, Frosted Heights\n\nSells For: 25 Coins\n\nEnergy Restored: +150\n\nBream\n\nWhere to Find It: Peaceful Meadow\n\nSells For: 600 Coins\n\nEnergy Restored: +1300\n\nCarp\n\nWhere to Find It: Forest of Valor, Sunlit Plateau\n\nSells For: 400 Coins\n\nEnergy Restored: +800\n\nCatfish\n\nWhere to Find It: Peaceful Meadow\n\nSells For: 550 Coins\n\nEnergy Restored: +1200\n\nCod\n\nWhere to Find It: Dazzle Beach, Forgotten Lands, Glade of Trust\n\nSells For: 35 Coins\n\nEnergy Restored: +150\n\nCrab\n\nWhere to Find It: Frosted Heights\n\nSells For: 600 Coins\n\nEnergy Restored: +1200\n\nFugu\n\nWhere to Find It: Dazzle Beach\n\nSells For: 900 Coins\n\nEnergy Restored: +1700\n\nHerring\n\nWhere to Find It: Dazzle Beach, Glade of Trust\n\nSells For: 65 Coins\n\nEnergy Restored: +250\n\nKingfish\n\nWhere to Find It: Dazzle Beach\n\nSells For: 450 Coins\n\nEnergy Restored: +800\n\nLancetfish\n\nWhere to Find It: Forgotten Lands\n\nSells For: 650 Coins\n\nEnergy Restored: +1300\n\nLobster\n\nWhere to Find It: Glade of Trust\n\nSells For: 950 Coins\n\nEnergy Restored: +1600\n\nPerch\n\nWhere to Find It: Forest of Valor, Sunlit Plateau\n\nSells For: 80 Coins\n\nEnergy Restored: +400\n\nPike\n\nWhere to Find It: Forest of Valor\n\nSells For: 800 Coins\n\nEnergy Restored: +1500\n\nRainbow Trout\n\nWhere to Find It: Peaceful Meadow, Forest of Valor\n\nSells For: 50 Coins\n\nEnergy Restored: +300\n\nSalmon\n\nWhere to Find It: Frosted Heights, Sunlit Plateau\n\nSells For: 150 Coins\n\nEnergy Restored: +500\n\nSeaweed\n\nWhere to Find It: Dazzle Beach, Forgotten Lands, Forest of Valor, Peaceful Meadow, Sunlit Plateau, Frosted Heights, Glade of Trust\n\nSells For: 20 Coins\n\nEnergy Restored: +25\n\nShrimp\n\nWhere to Find It: Dazzle Beach\n\nSells For: 300 Coins\n\nEnergy Restored: +750\n\nSole\n\nWhere to Find It: Forgotten Lands\n\nSells For: 200 Coins\n\nEnergy Restored: +500\n\nSquid\n\nWhere to Find It: Glade of Trust, Forgotten Lands\n\nSells For: 500 Coins\n\nEnergy Restored: +1000\n\nSwordfish\n\nWhere to Find It: Dazzle Beach\n\nSells For: 700 Coins\n\nEnergy Restored: +1500\n\nTilapia\n\nWhere to Find It: Sunlit Plateau, Frosted Heights\n\nSells For: 600 Coins\n\nEnergy Restored: +1150\n\nTuna\n\nWhere to Find It: Forgotten Lands, Glade of Trust\n\nSells For: 95 Coins\n\nEnergy Restored: +350\n\nWalleye\n\nWhere to Find It: Sunlit Plateau\n\nSells For: 1.1k Coins\n\nEnergy Restored: +1700\n\nWhite Sturgeon\n\nWhere to Find It: Frosted Heights\n\nSells For: 1.2k Coins\n\nEnergy Restored: +1800\n\nThat's it for our Disney Dreamlight Valley Fishing Guide! Check out more guides below:"
    }
]