[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMTAvMTgvd2F6ZS1mb3VuZGVyLXVyaS1sZXZpbmUtb24taXNyYWVsLWhhbWFzLXdhci1yaXBwbGUtZWZmZWN0cy1hbmQtYnVzaW5lc3Mtb3V0bG9vay5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Waze founder Uri Levine on Israel-Hamas War, ripple effects and business outlook - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nWaze founder Uri Levine on Israel-Hamas War, ripple effects and business outlook\n\nUri Levine, Waze co-founder, joins 'Power Lunch' to discuss President Biden's visit to Tel Aviv, business in Israel, and more."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMTAvMTgvd2F6ZS1mb3VuZGVyLXVyaS1sZXZpbmUtb24taXNyYWVsLWhhbWFzLXdhci1yaXBwbGUtZWZmZWN0cy1hbmQtYnVzaW5lc3Mtb3V0bG9vay5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Waze founder Uri Levine on Israel-Hamas War, ripple effects and business outlook - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nWaze founder Uri Levine on Israel-Hamas War, ripple effects and business outlook\n\nUri Levine, Waze co-founder, joins 'Power Lunch' to discuss President Biden's visit to Tel Aviv, business in Israel, and more."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMTAvMTgvd2F6ZS1mb3VuZGVyLXVyaS1sZXZpbmUtb24taXNyYWVsLWhhbWFzLXdhci1yaXBwbGUtZWZmZWN0cy1hbmQtYnVzaW5lc3Mtb3V0bG9vay5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Waze founder Uri Levine on Israel-Hamas War, ripple effects and business outlook - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nWaze founder Uri Levine on Israel-Hamas War, ripple effects and business outlook\n\nUri Levine, Waze co-founder, joins 'Power Lunch' to discuss President Biden's visit to Tel Aviv, business in Israel, and more."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTAvMTgvYW5hbHlzdC1zaGFyZXMtaW5zaWdodHMtb24tcmlwcGxlLWFsbGVnZWQteHJwLWR1bXAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Analyst Shares Insights on Ripple Alleged XRP “Dump” - The Crypto Basic",
        "content": "Crypto analyst Mason Versluis criticizes Ripple’s revenue model, claiming the firm sells XRP to support its business.\n\nIn a recent discussion about his exit strategy for cryptocurrencies like XRP, prominent crypto analyst Mason Versluis attacked Ripple and other crypto-based payment firms that have a digital asset associated with them.\n\nSpecifically, Versluis argued that payment firms like Ripple lack revenue streams. According to him, they do not generate profits as conventional companies typically do. He also alleged that crypto payment firms rely on associated cryptocurrency to fund their operations.\n\n- Advertisement -\n\nVersluis considers his view “the TRUTH” behind Ripple supposedly dumping XRP on retail investors.\n\nThe TRUTH About Ripple DUMPING $XRP On YOU! ? pic.twitter.com/bH6HD4cPIQ — MASON VERSLUIS (@MasonVersluis) October 17, 2023\n\nFurthermore, the crypto analyst stressed that this situation is the norm in the crypto space. While he acknowledged there could be exceptions, Versluis contended that projects that do not utilize their tokens for growth often struggle to secure funding. In his words:\n\n“Most of these crypto tokens are in that position where they don’t actually have a real business. Their business was launching a token and selling it to you and then dumping it on you.”\n\n- Advertisement -\n\nRipple Uses XRP for Funding\n\nMeanwhile, the analyst went deeper into his attack on Ripple, claiming to understand the firm’s strategy in using XRP for business development. He explained that Ripple’s revenue is closely tied to the performance of XRP, and the token’s value increase is vital for Ripple’s financial success.\n\n“XRP needs to go up for them [Ripple] to make money. They have several different reasons why they would want XRP’s price to go up.”\n\nIn parallel, Versluis detailed the increasing circulating supply of XRP tokens over time. He shared charts from the prominent market tracker Messari to back his claim. The chart suggested a steady growth in XRP’s circulating supply since 2013.\n\nVersluis emphasized the negative implication of the increased supply of a token. He argued the price of XRP cannot see a significant uptick amid the steady increase in supply.\n\nMeanwhile, some crypto experts have disputed the argument of XRP’s supply increasing. Panos Mekras, the author of “Understanding the Crypto Economy,” has argued that all XRP tokens existed from the beginning, with 100% of the supply already in circulation.\n\nMekras believes that locking XRP in escrow, a strategy employed by numerous XRP holders, does not fundamentally alter the fact that the tokens were already circulating."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vcGVubnRvZGF5LnVwZW5uLmVkdS9uZXdzL21lYXN1cmluZy1yaXBwbGUtZWZmZWN0cy1yZWZvcmVzdGF0aW9uLWFuZC1zdXN0YWluYWJsZS1jb2NvYS1jdWx0aXZhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Measuring the ripple effects of reforestation and sustainable cocoa cultivation | Penn Today - Penn Today",
        "content": "Biodiversity, agriculture, and human health are inextricably linked, and all are threatened by climate change. Internationally, many groups are taking measures to conserve natural ecosystems and improve agricultural sustainability. Measuring the impacts of these real-world, real-time experiments can better allocate resources and design future programs.\n\nAs part of a Penn Global Engagement Fund project grant, Heather Huntington is monitoring the impact of a USAID-funded Resilient Ecosystem and Sustainable Transformation of Rural Economies (RESTORE) project, which is carrying out a series of reforestation and sustainable agriculture interventions in Ghana and Côte d’Ivoire from 2023-2027.\n\nThe RESTORE interventions are being implemented by Rainforest Alliance and OFI, a subsidiary of Olam International that supplies cocoa to companies including Mars and Nestlé. As an independent third party, Huntington’s team, in collaboration with Development Alternatives Incorporated and Social Impact, is taking before- and after- measurements to quantify these interventions’ impacts on biodiversity, the livelihoods of farming communities, and human health.\n\n“I work closely with international development programs and donors to evaluate their programs in the field and provide policymakers with information that helps them design better programs,” says Huntington, a professor of practice in the School of Arts & Sciences and associate director of Penn Development Research Lab (PDRI)-DevLab. “By identifying the mechanisms that link ecosystem, wildlife, and human health and rigorously testing practical interventions, this research will identify the most effective types of interventions for improving health in the context of climate change.”\n\nTurning to cocoa agroforestry\n\nCocoa is the main export for both Ghana and Côte d’Ivoire, who are together responsible for more than. 60% of the world’s cocoa. Across these countries, cocoa farming has contributed to extensive deforestation and monoculture plantations, both of which are devastating for wildlife and biodiversity. Cocoa cultivation in West Africa is also commonly done in areas of full sun, but these variants of cocoa trees naturally grow under the canopy of other trees, and require shade to thrive. As a result, unsustainable cocoa farming practices—such as growing cocoa in full sun without shade trees and lack of proper tree pruning techniques—have hamstrung farmers’ crop yields and livelihoods.\n\nAnd now, the detrimental effects of full sun on plant survival and crop yield are only worsening with climate warming. Climate change is also shifting rain patterns across West Africa, which is problematic for cocoa farmers because it can lead to hot, humid conditions that promote the growth of tree fungus.\n\nTo help restore ecosystems and improve cocoa yields, some farms are turning to cocoa agroforestry, a more sustainable method of cultivation that involves growing cocoa trees underneath a canopy of other trees. Compared to cocoa monocultures, agroforestry helps maintain biodiversity, improves soil health, and also allows farmers to diversify their streams of income by growing other fruit trees or crops alongside their cocoa.\n\n“With this model you essentially have a little forest on a farmer’s plot with cocoa trees underneath it, and that actually maximizes the farmers’ yields,” Huntington says.\n\nOne of RESTORE’s main interventions is to help cocoa farmers in Ghana and Côte d’Ivoire transition to cocoa agroforestry. Other aims include helping to strengthen property rights for these farming communities by tracking and registering trees and delineating village boundaries, and helping people in these communities—particularly women—build alternative and supplemental streams of income such as beekeeping and snail farming.\n\nOff-farm, RESTORE will work to restore native woodlands by replanting forests in the highly degraded areas between and near cocoa farming villages.\n\nBecause biodiversity and human health are linked, Huntington’s team is also investigating how a switch to cocoa agroforestry might impact the prevalence of waterborne and zoonotic diseases. Here, Huntington is working with William Pan at Duke University, an expert in zoonotic diseases and global health.\n\n“By integrating these types of indicators, we can see how ecological health intersects with human health,” Huntington says. “For example, if we improve the ecosystem health, that presumably has a lot of flow down into better water quality, and water quality improvements then translate into better outcomes for the people that live in these areas.”\n\nCollecting the data\n\nHuntington envisions three primary periods of data collection: baseline data collection before the interventions take place; an “endline” data collection trip immediately after the interventions have been completed; and a long-term follow-up several years later. Baseline data collection is planned for January-February 2024, during the cocoa farming off-season. “January is after the harvest, and it’s after the holidays, so it’s a good time to find people and take an hour of their time without it being too much of a of a burden for them,” Huntington says.\n\nEach data collection period is a massive undertaking. Huntington estimates that baseline data collection alone will cost close to $1 million and will involve 3,000 to 4,000 interviews with individual cocoa farmers in each country. In addition they will hold community focus group discussions, collect water and forest samples, and establish camera traps to track wildlife. This data collection will be performed by local Ghanaian and Ivorian research firms, whose leaders and trainers will collaborate with the Penn and Duke teams.\n\nAs well as providing a “before” picture of the state of biodiversity, forest cover, and community livelihoods, these baseline measurements also help inform how the interventions are carried out. “Once we’ve analyzed the baseline data, we do a pause and reflect with the implementing partners, and we try to present that in a way so that they can use that information to adapt and adjust any of their programming activities,” Huntington says.\n\nUndergraduate researchers Paavani Arora, a second-year, and Caroline Bach, a third-year, both in the College of Arts and Sciences, will work with the project in collaboration with the Penn Program on Opinion Research and Election Studies (PORES). Huntington has already hired several undergraduates to help analyze the baseline data and is also in discussion with researchers from other Penn schools, including the School of Veterinary Medicine and Perelman School of Medicine, about possible collaborations.\n\n“This project will require an interdisciplinary team with expertise in One Health, climate change, economic development, environment and natural resource governance, forest ecology, biodiversity, and zoonotic disease,” Huntington says. “We hope our multidisciplinary project will create new connections among different schools and departments at Penn, creating fertile grounds for the development of bold new collaborative, impactful projects.”"
    }
]