[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS94cnAtZnJvbS1yaXBwbGUtdG8tcmVhY2gtNTAwMDAtYW5kLWJlY29tZS13b3JsZC1yZXNlcnZlLWN1cnJlbmN5LXRydWUtb3ItZmFrZS1uZXdzL9IBe2h0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS94cnAtZnJvbS1yaXBwbGUtdG8tcmVhY2gtNTAwMDAtYW5kLWJlY29tZS13b3JsZC1yZXNlcnZlLWN1cnJlbmN5LXRydWUtb3ItZmFrZS1uZXdzLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "XRP from Ripple to reach $50,000 and become world reserve currency – True or fake news? - Crypto News Flash",
        "content": "Ripple is rumored to soon become the world reserve currency in the future, and in turn become valued at $50,000.\n\nRipple’s CTO David Schwartz has spoken about the rumors and warned Ripple followers to be wary of certain ploys.\n\nRipple’s XRP token is one of the most valued cryptocurrency in the crypto market. To its title, Ripple XRP can add “the reserve currency for the world.” This is according to a theory that has been put up by Jimmy Vallee. Vallee, the Managing Director of Valhill Capital came up with the “XRP buyback” theory in 2021.\n\n\n\n\n\n\n\nIn the Vallee Buyback Theory, the government is being asked to buy back XRP’s total supply from retail at a whopping $37,500 for a single XRP token. The price is derived from the division of the overall wealth in the global market, by the total supply of XRP.\n\nThe theory is once again being pedaled within the crypto twitter-sphere. This time around, the CTO of Ripple David Schwartz is clearing the air about what it could be.\n\nThe CTO of Ripple quickly shut down the rumors. He claims he hasn’t paid attention to the entire theory, despite it being a major topic among Ripple and XRP followers. He warns of the many dissolutions of companies that took place in 2022. He references the losses that so many investors incurred and warned the market to be aware of low-risk and high-return offers.\n\nI haven’t looked at it very closely. But what I have seen looks an awful lot like a scam to me.\n\nHe wrote in a tweet.\n\nIf we’ve learned anything from 2012 and 2022 it’s that anyone promising high returns with low risk is almost certainly going to rob you.\n\nOther market analysts are debunking the XRP buyback theory\n\nIn the past, a former XRP developer Matt Hamilton has also debunked the rumors as false. In January he made a thread explaining that Valhill Capital’s theory is not one he agrees with.\n\nThere is a small, but very vocal minority of the XRP Community that is promoting a crazy idea of the US government buying back / confiscating XRP from US citizens, yet for some strange reason compensating them 100’s of 1000’s of % above market rate.\n\nAmong other things, he explained that XRP lives on a decentralized blockchain. Unless the government wants to seize the tokens from key holders by use of force, it is impossible to access them.\n\n\n\n\n\n\n\nIn addition, he asserts that instead of buying XRP, the government has a better option of creating its own CBDC. Matt said.\n\nIf the US government wants “all the XRP” to prevent others from using it, that very act kills any value or utility in it. The rest of the participants just decide to ignore them or fork/create XRP 2.0.\n\nRecommended for you:"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtY2hhdGdwdC13aGF0LXdpbGwtYmUteHJwLXByaWNlLWluLTIwMzAtaGVyZXMtd2hhdC1pdC1zYWlkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "We asked ChatGPT what will be XRP price in 2030; Here's what it said - Finbold - Finance in Bold",
        "content": "The launch of the text-based artificial intelligence (AI) platform ChatGPT has reinvigorated the public’s interest in the technology, as it demonstrates utility across various areas, including providing insight into the future price of cryptocurrency assets like XRP.\n\nWith this in mind, Finbold asked ChatGPT to share XRP’s possible price by 2030 based on various metrics, including chart patterns, technical analysis (TA), as well as the outcome of the legal battle that the United States Securities and Exchange Commission (SEC) is waging against blockchain company Ripple.\n\nAs it happens, the AI tool remained insistent that it was difficult to provide a reliable prediction of the price of XRP by 2030, citing regulatory uncertainty, variable market sentiment, technological development, and other factors:\n\n“The future price of cryptocurrencies, including XRP, is highly uncertain and subject to many factors, such as regulatory changes, market trends, and technological advancements, among others. Even with access to various tools for technical analysis, traditional chart patterns, and AI algorithm predictions, it is impossible to accurately predict the future price of cryptocurrencies.”\n\nEffect of Ripple v. SEC\n\nHowever, ChatGPT did acknowledge the impact of the Ripple v. SEC lawsuit, for which it earlier said, “Ripple’s argument that XRP is not a security is likely to be more persuasive,” highlighting the company’s persistent reasoning that XRP “has been used for years as a currency and not as an investment, which further supports its argument that XRP is not a security.”\n\nAccording to the AI:\n\n“Additionally, the outcome of the Ripple v. SEC lawsuit is also likely to have a significant impact on the future price of XRP, but the outcome of the lawsuit is currently unknown.”\n\nFinally, ChatGPT conluced with a piece of advice to “exercise caution when making any investment decisions and to thoroughly research and understand the risks involved.”\n\nXRP price analysis\n\nAs things stand, XRP is recording declines across multiple charts, including dropping 5.42% across the last 24 hours, 9.07% compared to the previous seven days, as well as 5.98% over the past month, as per the latest data retrieved on February 13.\n\nXRP 30-day price analysis. Source: Finbold\n\nMeanwhile, the cryptocurrency community over at CoinMarketCap has bullish expectations for the price of XRP, projecting it would trade at $0.4133 by February 28, slightly lower compared to its earlier predictions reported by Finbold on February 7.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5wcm9ncmVzcy1pbmRleC5jb20vc3RvcnkvbmV3cy9sb2NhbC8yMDIzLzAyLzEzL25lYXJseS1hLXllYXItbGF0ZXItY2xvc2luZy1tb3RlbHMtaGFzLWhhZC1yaXBwbGUtZWZmZWN0LWluLXBldGVyc2J1cmcvNjk4OTk5NzkwMDcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Nearly a year later, closing motels has had ripple effect - Progress Index",
        "content": "PETERSBURG—If you missed our investigative series on the shutdown of several motels in Petersburg and the impact it's had on the people living in them, here's a quick recap:\n\nWhich motels shuttered and why?\n\nTravel Inn, OYO, and California Inn were shut down by the city last May and June. They were shuttered because of multiple safety and health violations such as electrical hazards, unsafe structures, and violations that would be dangerous to one’s health.\n\nAll three motels, and others in Petersburg, show signs of disrepair: cracks in the walls, stains on the carpet, toilets and showers crusted with yellowish-brown limescale, roaches crawling on floors, and rooms that carry the stench of mildew and drugs. These motels were also hotbeds of crime, drug overdoses and prostitution mixed in with families with children, with the OYO and Travel Inn garnering the worst reputation for illegal activities.\n\nPetersburg motels have been in this state for years. Why is something being done now?\n\nIn April, the city brought back its once-inactive code compliance team called the \"ACE\" team that is made up multiple people from the Police Department, Neighborhood Services, Fire Department, Zoning, the Virginia Department of Health, the Commissioner of Revenue, and a social worker.\n\n“ACE” stands for Abatement, Compliance, and Enforcement.\n\nThe Progress-index tried to FOIA for the inspection reports of these three motels to see how many infractions they had and how far back these infractions go. The city told us it would cost $376.32 to provide the latest inspection reports for the California Inn, Travel Inn, and OYO.\n\nWhat other changes are happening to the motels?\n\nAlong with shuttering some motels, the ACE team has also cracked down on motels who were allowing individuals and families to stay there long-term. Petersburg's code only allows for 30-day motel stays.\n\nWith no shelter or other safety nets, many people live in the motels because that's their only option to avoid being on the streets. They don't have enough savings to afford a deposit, and many landlords don't rent to them because prior evictions or tainted records.\n\nWhat has been the impact of these policies?\n\nHomelessness increased and families and individuals have been forced to uproot their lives. Before the ACE team shut down the three motels, they gave the dozens of people one day to vacate and find another place, but some ended up on the streets. Other motels started kicking long-term families out, despite a state law that says owners can only evict through the courts when someone has lived there for more than 90 days. This has disrupted their stability, causing them to bounce from one place to another.\n\nHow did people in the community get involved?\n\nThe P-I's series led to citizens stepping up to become part of the solution. Pat Hines decided to spearhead efforts to open up a men's winter shelter after learning that Petersburg has no dedicated building for those who would be left out in the cold at night. Councilman Marlow Jones donated the building, and the community rallied together to donate beds, blankets, towels, food, money, and more. Others donated their time and service, including Shaundrick White who installed a shower pro-bono.\n\nAfter reading about how April Jones and her three kids were bouncing from motel to motel as a result of the 30-day stay policy and not having enough savings to afford a deposit for a home, a citizen offered to pay both Jones' deposit and first month's rent. Jones was still having trouble landing a place due to having a prior eviction. A landlord who had read the story extended one of his homes for her to rent. Last month, Jones and her children moved into their first home in three years.\n\nRead the full investigative series here. Coming next in this series is how those who work for the motels are equally as trapped as those who live in them, and the problem of overdosing and crime in the motels.\n\nRead Part 1 here:Petersburg motels have dealt with code violations for years. As the city shuts them down, homelessness escalates.\n\nRead Part 2 here:‘A fresh can of nowhere to go’: Health and stability stumble with fewer motel rooms for those on the edge\n\nRead Part 3 here:‘A really nasty storm:’ As city enforces 30-day rule, some who have lived in motels for years have no stability\n\nJoyce Chu, an award-winning investigative journalist, is the Social Justice Watchdog Reporter for The Progress Index. Contact her with comments, concerns, or story-tips at Jchu1@gannett.com or on Twitter @joyce_speaks."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5wcm9ncmVzcy1pbmRleC5jb20vc3RvcnkvbmV3cy9sb2NhbC8yMDIzLzAyLzEzL25lYXJseS1hLXllYXItbGF0ZXItY2xvc2luZy1tb3RlbHMtaGFzLWhhZC1yaXBwbGUtZWZmZWN0LWluLXBldGVyc2J1cmcvNjk4OTk5NzkwMDcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Nearly a year later, closing motels has had ripple effect - Progress Index",
        "content": "PETERSBURG—If you missed our investigative series on the shutdown of several motels in Petersburg and the impact it's had on the people living in them, here's a quick recap:\n\nWhich motels shuttered and why?\n\nTravel Inn, OYO, and California Inn were shut down by the city last May and June. They were shuttered because of multiple safety and health violations such as electrical hazards, unsafe structures, and violations that would be dangerous to one’s health.\n\nAll three motels, and others in Petersburg, show signs of disrepair: cracks in the walls, stains on the carpet, toilets and showers crusted with yellowish-brown limescale, roaches crawling on floors, and rooms that carry the stench of mildew and drugs. These motels were also hotbeds of crime, drug overdoses and prostitution mixed in with families with children, with the OYO and Travel Inn garnering the worst reputation for illegal activities.\n\nPetersburg motels have been in this state for years. Why is something being done now?\n\nIn April, the city brought back its once-inactive code compliance team called the \"ACE\" team that is made up multiple people from the Police Department, Neighborhood Services, Fire Department, Zoning, the Virginia Department of Health, the Commissioner of Revenue, and a social worker.\n\n“ACE” stands for Abatement, Compliance, and Enforcement.\n\nThe Progress-index tried to FOIA for the inspection reports of these three motels to see how many infractions they had and how far back these infractions go. The city told us it would cost $376.32 to provide the latest inspection reports for the California Inn, Travel Inn, and OYO.\n\nWhat other changes are happening to the motels?\n\nAlong with shuttering some motels, the ACE team has also cracked down on motels who were allowing individuals and families to stay there long-term. Petersburg's code only allows for 30-day motel stays.\n\nWith no shelter or other safety nets, many people live in the motels because that's their only option to avoid being on the streets. They don't have enough savings to afford a deposit, and many landlords don't rent to them because prior evictions or tainted records.\n\nWhat has been the impact of these policies?\n\nHomelessness increased and families and individuals have been forced to uproot their lives. Before the ACE team shut down the three motels, they gave the dozens of people one day to vacate and find another place, but some ended up on the streets. Other motels started kicking long-term families out, despite a state law that says owners can only evict through the courts when someone has lived there for more than 90 days. This has disrupted their stability, causing them to bounce from one place to another.\n\nHow did people in the community get involved?\n\nThe P-I's series led to citizens stepping up to become part of the solution. Pat Hines decided to spearhead efforts to open up a men's winter shelter after learning that Petersburg has no dedicated building for those who would be left out in the cold at night. Councilman Marlow Jones donated the building, and the community rallied together to donate beds, blankets, towels, food, money, and more. Others donated their time and service, including Shaundrick White who installed a shower pro-bono.\n\nAfter reading about how April Jones and her three kids were bouncing from motel to motel as a result of the 30-day stay policy and not having enough savings to afford a deposit for a home, a citizen offered to pay both Jones' deposit and first month's rent. Jones was still having trouble landing a place due to having a prior eviction. A landlord who had read the story extended one of his homes for her to rent. Last month, Jones and her children moved into their first home in three years.\n\nRead the full investigative series here. Coming next in this series is how those who work for the motels are equally as trapped as those who live in them, and the problem of overdosing and crime in the motels.\n\nRead Part 1 here:Petersburg motels have dealt with code violations for years. As the city shuts them down, homelessness escalates.\n\nRead Part 2 here:‘A fresh can of nowhere to go’: Health and stability stumble with fewer motel rooms for those on the edge\n\nRead Part 3 here:‘A really nasty storm:’ As city enforces 30-day rule, some who have lived in motels for years have no stability\n\nJoyce Chu, an award-winning investigative journalist, is the Social Justice Watchdog Reporter for The Progress Index. Contact her with comments, concerns, or story-tips at Jchu1@gannett.com or on Twitter @joyce_speaks."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmJhbmtvZmVuZ2xhbmQuY28udWsvcGFwZXIvMjAyMy9yb2FkbWFwLWZvci10aGUtcmVhbC10aW1lLWdyb3NzLXNldHRsZW1lbnQtc2VydmljZS1iZXlvbmQtMjAyNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Roadmap for the Real-Time Gross Settlement service beyond 2024 - Bank of England",
        "content": "Foreword In April 2022, we issued a consultation on the roadmap for the Real-Time Gross Settlement (RTGS) service beyond 2024 (Roadmap). In the light of the rapidly changing payments landscape we were keen to understand the industry’s views on what innovative features they would like the Bank of England to focus on following the introduction of the new core RTGS settlement engine in 2024. The exciting menu of features we consulted on spanned new ways of connecting to RTGS, innovative and more flexible services and enhanced RTGS resilience. RTGS is at the heart the UK payments industry, and through its provision of settlement in central bank money – the ultimate sterling settlement asset – is fundamental to both monetary and financial stability. RTGS now settles over £750 billion on average every working day, and in Autumn 2022 saw record peak days reaching over £1 trillion. Our consultation marked an important milestone in shaping the long-term vision and roadmap for RTGS and realising the significant benefits that the new core settlement engine will provide. In addition to being very resilient, the new settlement engine has been designed to be modular and flexible, which will allow the Bank to introduce enhancements more quickly and easily to meet the changing needs of the industry. Understanding the needs of RTGS users is critical when exploring and designing future RTGS services in a way that provides the desired services, promotes competition, innovation and value for money. I am very grateful to the industry for the active engagement with our work so far – we have received 34 formal responses to the written consultation and additional views through informal industry sessions. Encouragingly, responses supported our general approach to shaping the Roadmap, and early industry engagement. Responses have given us valuable insights into high-level industry priorities – which align with our vision to facilitate safe and efficient settlement in central bank money through continuing to enhance RTGS resilience and supporting innovation and global initiatives. I believe that it is important that close and continuous industry collaboration is at the heart of our continued evolution of RTGS after the new core settlement engine is delivered. Following the publication of this response document, we will initiate a process of industry co-creation to explore business cases for priority features: resilient channels to connect to RTGS, extended RTGS operating hours and synchronisation. These priority features – if delivered in the future – would help not only to enhance domestic payments but would also support achieving the Financial Stability Board’s roadmap for enhancing cross-border payments through making them cheaper, faster and safer globally. Victoria Cleland, Executive Director for Payments\n\nExecutive summary Background to the roadmap for RTGS beyond 2024 In Spring 2022, we consulted the industry on a set of ambitious and innovative features that could be implemented in the renewed Real-Time Gross Settlement (RTGS) system, once the new core settlement engine goes live in 2024. The features include new ways of connecting to RTGS, innovative and more flexible services (such as extended operating hours and synchronisation) and enhanced resilience. In the consultation, we set out a long-term vision for the renewed RTGS service: to act as an open platform for the UK financial services industry to facilitate safe and efficient settlement in central bank money. We received 34 formal responses from the consultation. We received additional views in a series of industry workshops held in Summer 2022. We would like to thank all involved for their active engagement with this work and their considered responses. This document summarises the industry feedback we received and sets out our way forward for leveraging our investment in a modern and flexible RTGS service to meet the evolving needs of the UK payments industry beyond 2024. Our vision In the consultation, we set out a long-term vision for the renewed RTGS service beyond 2024: to act as an open platform for the UK financial services industry and to facilitate safe and efficient settlement in central bank money. The migration to ISO 20022 messaging and delivery of a new core settlement engine will give us the platform to continue to innovate. We intend to enhance the renewed RTGS service further and to introduce changes that could enable participants to offer cheaper, faster and safer payments to their customers. Progressing the priority features set out in this Roadmap will be key to allowing us to offer the highest degree of resilience while facilitating innovation and competition in the fast-changing payments landscape. Key takeaways and next steps Respondents strongly welcomed the opportunity to provide early input in designing the Roadmap. Overall, they agreed that the Bank had considered the right features for RTGS beyond 2024. Respondents acknowledged the benefits that the features could bring to their organisations and the wider industry. The benefits included the potential to reduce costs for users in the long term through new ways to connect to RTGS (such as further development of the RTGS Application Programming Interface – API – platform) and innovative services (such as synchronisation, which could help reduce the current frictions in cross-border payments). The feedback has given us a good sense of industry’s relative priorities, together with high-level views of how the features might be implemented. Next, we will conduct further work to define detailed service propositions and assess business cases before deciding which features to introduce and in what order. Respondents emphasised the need for the Bank to continue to work collaboratively with the industry to create detailed propositions to enhance RTGS. We will respond by launching a phase of industry co-creation: establishing forums to enable stakeholders to input into high-level design of the features and inform our cost-benefit analysis. The forums will also provide input to the potential timing and sequencing of delivering priority features. Over time, these forums will also advise on any additional features that could be added to the Roadmap as we continue to support the evolving payments landscape. Having taken industry’s feedback into account, we have decided to prioritise work on two categories of features. Resilient channels This includes features that respondents prioritised for their resilience benefits: Maintaining a suitable contingency for settlement. Introducing a new channel to send and receive payments via another network or APIs (Payment APIs).\n\nWe will work with the industry to consider high-level design choices, explore business cases and evaluate delivery options.\n\nWe will prioritise work on the detailed design of our centralised RTGS identity service (Public Key Infrastructure – PKI), as its delivery is a precursor to developing certain other features in the Roadmap. Innovation and global initiatives This includes features that respondents prioritised because of their high potential to facilitate innovation and support global initiatives: Synchronisation; Extended RTGS operating hours; and Non-Payment APIs (APIs that support use cases outside of a new channel to send and receive payments).\n\nThese features do not have hard dependencies on each other. However, their benefits often depend on international collaboration or industry developments.\n\nWe will explore business cases of these features with the industry in more detail and will conduct further policy work on potential service propositions. Following the publication of this response document, we will develop and publish a plan for the industry co-creation work on priority features. We plan to start co-creation in 2023 Q2. We acknowledge the extremely busy change agenda in the payments landscape, so we will aim to make the process efficient and focused. We will not actively progress the work on the remaining features listed in the consultation for the time being: more ways to generate intraday liquidity, changes to reconciling data with participants (enhanced reconciliations) and a retail contingency solution (CHAPS as a retail alternative – CARA). Respondents deemed these features lower priority because the business cases were less clear, they were less urgent or depended on introducing other features first. However, we will monitor and review the demand for these features through our ongoing industry dialogue.\n\n1: Consultation themes 1.1: Background to the consultation In April 2022, we issued a consultation on the Roadmap for Real-Time Gross Settlement service beyond 2024 (the Roadmap). The consultation set out an ambitious menu of innovative features that we are considering introducing in RTGS after the new core settlement engine goes live and sought industry views on which features they would like to see developed further. In the consultation, we set out a long-term vision for the renewed RTGS service: to act as an open platform for the UK financial services industry to facilitate innovation and support safe and efficient settlement in central bank money. The renewed RTGS service will accommodate a wide range of participants, diverse means of connecting and will enable new links to other systems. This could in turn enable participants to offer cheaper, faster and safer payments to their customers. The consultation set out three focus areas of the vision for the RTGS service beyond 2024: New ways of connecting to RTGS that are cost-effective, based on open standards and compatible with a wide range of technologies. We proposed: developing a centralised RTGS identity service using PKI to support the new services; creating a new channel to send and receive payments; and/or evolving APIs.\n\nthat are cost-effective, based on open standards and compatible with a wide range of technologies. We proposed: developing a centralised RTGS identity service using PKI to support the new services; creating a new channel to send and receive payments; and/or evolving APIs. Flexible and innovative services to address the changing needs of RTGS users. We sought feedback on proposals to introduce a synchronisation interface; expand RTGS operating hours; and/or create more ways to generate liquidity in RTGS.\n\nto address the changing needs of RTGS users. We sought feedback on proposals to introduce a synchronisation interface; expand RTGS operating hours; and/or create more ways to generate liquidity in RTGS. World-class resilience. We noted the need to leverage new technologies to provide more usable and available back-up and contingency services. In particular, we proposed evolving or replacing our third site contingency solution (currently Market Infrastructure Resiliency Service – MIRS) to support new features, enhanced reconciliations and enabling CHAPS to act as a contingency for retail payments. In the consultation, we asked which of the features within these focus areas the industry would prioritise to be in scope of the Roadmap and why. We also asked whether there were any additional features we should consider. To help shape our business case analysis, we consulted to understand the benefits and costs for the industry and whether organisations would be likely to use the new features. The consultation closed on 30 June 2022. This document summarises the responses we have received (Section 2 and Annex). Building on this feedback, it sets out the plans for further work to shape the Roadmap (Section 3 and Section 4). 1.2: Features we proposed in the consultation New ways of connecting to RTGS A new channel to send and receive payments alongside the SWIFT network. This also included considerations about providing a common contingency messaging channel – a solution available to all participants, including a protocol and an infrastructure for data transfer.\n\nalongside the SWIFT network. This also included considerations about providing a – a solution available to all participants, including a protocol and an infrastructure for data transfer. New centralised RTGS identity service (PKI) to support new types of secure communications. Participants would use Bank-issued credentials to ‘sign’ their communications to prove message origin and integrity.\n\n(PKI) to support new types of secure communications. Participants would use Bank-issued credentials to ‘sign’ their communications to prove message origin and integrity. Evolving APIs. We proposed evolving the API platform to enable participants to automate more data queries and instructions. Innovative and flexible services Synchronisation. We proposed to create a generic interface into RTGS which would allow a wider range of ledgers to connect to RTGS to synchronise transactions. Synchronisation enables ‘atomic settlement’, which means linking the transfer of two assets in a way that one asset moves if and only if the other asset moves.\n\nWe proposed to create a generic interface into RTGS which would allow a wider range of ledgers to connect to RTGS to synchronise transactions. Synchronisation enables ‘atomic settlement’, which means linking the transfer of two assets in a way that one asset moves if and only if the other asset moves. Extended RTGS operating hours. The renewed RTGS will have the capability to move to near 24x7 operation. We noted that we were considering extending operating hours in line with the industry’s demand and public policy considerations.\n\nThe renewed RTGS will have the capability to move to near 24x7 operation. We noted that we were considering extending operating hours in line with the industry’s demand and public policy considerations. More ways to generate intraday liquidity in RTGS : New liquidity bridges with RTGS systems in other currencies (beyond the current euro liquidity bridge) and Generating liquidity in RTGS using securities in CREST as collateral. This considered how to extend the Auto-Collateralised Repo (CREST ACR) mechanism so that intraday liquidity can be used in RTGS beyond what is needed for settlement in CREST.\n\n: World-class resilience Maintaining a suitable contingency for settlement. We proposed reviewing the design of our third site contingency solution in light of the evolution of the RTGS.\n\nWe proposed reviewing the design of our third site contingency solution in light of the evolution of the RTGS. Providing improved tools to reconcile data with participants. We proposed to enhance reconciliations through requiring positive confirmation of reconciliation, more frequent reconciliations and using new functionality to automate the process.\n\nWe proposed to enhance reconciliations through requiring positive confirmation of reconciliation, more frequent reconciliations and using new functionality to automate the process. Enabling CHAPS to act as a contingency for retail payment systems (CHAPS as Retail Alternative – CARA).\n\n2: Key messages from industry feedback We received 34 formal responses from a diverse range of organisations, comprising of large and small financial institutions, service providers, trade associations and consultants (see Chart 1). Responses included organisations who wish to expand their use of RTGS services or to provide services for RTGS in the future. In Summer 2022, we also engaged with the industry through a series of workshops to understand views in greater detail. The summaries of the workshops are published on the Bank’s website. Chart 1: Respondents by type Number and type of respondents to the consultation 2.1: General themes Overall, the feedback acknowledged that the proposed set of features was comprehensive. Generally, respondents welcomed all the features considered and recognised the benefits that the features could bring to individual organisations and the wider industry. Respondents did not identify significant additions to the proposed scope of the Roadmap and welcomed the opportunity to input their views on designing the Roadmap at an early stage. Responses strongly encouraged the Bank to continue close co-operation with the industry moving forward. In the consultation, we asked the industry for their thoughts about key trends that drove the need for further enhancements in RTGS and the main opportunities to improve settlement. The key themes identified are highlighted below, with further detail provided in the Annex. Continuing focus on enhanced operational resilience was seen as important to providing a robust and secure foundation to facilitate innovation with reduced implementation risk. Consultation feedback highlighted the need to expand international collaboration on resilience and support the ‘future-proofing’ of settlement systems due to increasing cyber threats and the dynamic nature of risk. This view was expressed by the majority of respondents and influenced the higher priority that was given to resilience-related Roadmap features. Driving forward innovation in the context of increased competition both in the UK and internationally was identified as a key reason for enhancements to settlement in RTGS. Respondents emphasised that innovative payment technology supports the resilience and security of existing and new payment infrastructures. Cross-border payments were seen as having the highest potential for improvement. Feedback supported leveraging technologies to improve the efficiency of cross-border payments. Respondents generally agreed that extending RTGS operating hours has the potential to bring material benefits for the speed and cost of these payments. Further opportunities to improve settlement included making greater use of ISO 20022 messaging (particularly for enhancing cross-border payments) and further automation of transactions (particularly for mechanisms through which liquidity is provided). Several respondents pointed to the introduction of read-write APIs in order to develop wider interoperability and exploit richer data. While responses were overall positive about the features considered as part of the Roadmap, respondents caveated their feedback: Many respondents noted they needed greater detail on the service propositions to assess business cases. Views on supporting features may change once a comprehensive cost-benefit analysis has been undertaken.\n\nSeveral respondents expressed concern over contention with the current high level of change occurring in the industry and supported an incremental and co-ordinated approach to the Roadmap. Respondents also called for the Roadmap to be adaptable to future changes over the short, medium and long term. This was particularly relevant for mechanisms for liquidity generation due to geopolitical uncertainties and quantitative tightening policies. Respondents strongly supported continued close collaboration between the Bank and the industry in order to develop and shape business cases. Coupled with the detailed feedback received on each individual Roadmap feature, this has provided valuable insights for shaping our prioritisation strategy through a process of co-creation set out in Section 3. 2.2: Overview of priorities The consultation gathered feedback on the relative prioritisation of each Roadmap feature based on the benefit it was expected to bring to organisations. Respondents scored each feature between one and seven, with one representing the lowest benefit, and seven representing the highest. The charts below summarise the respondents’ views on prioritisation. Many respondents’ views were caveated as they noted that their assessment of priority of various features depended on completing a cost and benefit assessment. Chart 2a: Views on feature prioritisation Features providing the most benefit beyond 2024 (ranked by scores of 5 or higher) Consultation question: Out of the features outlined in this consultation, what do you consider as the highest priorities that would bring the most benefit to your organisation beyond 2024? (34 responses scoring all features by selecting a score from 1 as the lowest benefit to 7 as the highest benefit.) Please note figures may not add to 100% due to rounding. Chart 2b: Views on feature prioritisation Net positive responses for features providing the most benefit beyond 2024 Consultation question: Out of the features outlined in this consultation, what do you consider as the highest priorities that would bring the most benefit to your organisation beyond 2024? (34 responses scoring all features by selecting a score between 1 and 7. Chart shows percentage difference between score 5–7 and score 1–3.) 2.2.1: Focus on resilience Resilience-related features were often selected as the highest priorities. A reason for this provided by a large number of respondents was the interlinkages and dependencies that resilience features have with other Roadmap features. Respondents supported a new channel to send and receive payments because it would reduce entry barriers for new players to foster innovation and increase resilience.\n\nbecause it would reduce entry barriers for new players to foster innovation and increase resilience. Some respondents noted that a common contingency messaging channel would not be required if a highly available, efficient alternative channel that can be tested with minimal manual effort is in place.\n\nRespondents agreed with the drivers for maintaining a suitable contingency for settlement and the consideration of settlement contingency models beyond the third site arrangement that we currently operate. The drivers included the opportunity to remove a single point of failure within the system and the need to update settlement contingency to be available over additional payments channels.\n\nand the consideration of settlement contingency models beyond the third site arrangement that we currently operate. The drivers included the opportunity to remove a single point of failure within the system and the need to update settlement contingency to be available over additional payments channels. Responses emphasised that Payment APIs support new services and propositions, including the delivery of a new payments channel in a reliable and efficient way. APIs have a dual benefit as they may also provide effective and efficient interfaces for other features (eg synchronisation). 2.2.2: Focus on innovation and global initiatives Respondents also recognised the benefits that synchronisation, extended RTGS operating hours and liquidity bridges can bring to drive forwards innovation and competition. Feedback highlighted their potential in enhancing interoperability between the UK and other payment infrastructures internationally. There was majority support (59% of respondents agreed or strongly agreed) for extending RTGS operating hours, with respondents acknowledging the benefits of doing so (see Section 3.2.4).\n\n(59% of respondents agreed or strongly agreed) with respondents acknowledging the benefits of doing so (see Section 3.2.4). Some respondents who were less supportive of extended operating hours noted that they did not yet see a clear use case for their clients and highlighted the costs predominately related to the changes required to staff and technology.\n\nHowever, most respondents considered extending RTGS operating hours to be the way forward for the future. Generally, respondents preferred a gradual transition to materially longer hours rather than a single big-bang approach if the Bank were to pursue an extension.\n\nThere was majority support (62% of respondents agreed or strongly agreed) for the introduction of an RTGS interface for synchronised settlement from a wide range of organisations. Synchronisation will allow a wider range of financial market infrastructures to provide innovative payment services backed by the security of settlement in central bank money. Respondents widely acknowledged the benefits of lowering liquidity costs and settlement risks associated with different types of transactions. Various use cases were deemed to be valuable, with cross-border transactions, housing purchases and complex corporate actions being mentioned as the top use cases.\n\n(62% of respondents agreed or strongly agreed) from a wide range of organisations. Synchronisation will allow a wider range of financial market infrastructures to provide innovative payment services backed by the security of settlement in central bank money. Respondents widely acknowledged the benefits of lowering liquidity costs and settlement risks associated with different types of transactions. Various use cases were deemed to be valuable, with cross-border transactions, housing purchases and complex corporate actions being mentioned as the top use cases. There was a strong support for certain API use cases. Three use cases were considered important or very important by more than 60% of respondents: reconciliation, reporting analytics and additional liquidity management features. 40% or more respondents deemed the submission of payment instruction and account management use cases as important. 2.2.3: Lower priorities Features that respondents viewed as lower priority were a retail contingency solution and more ways of generating liquidity in RTGS by using securities in CREST as collateral (CREST ACR extension). Respondents explained lower scores by the lack of clarity on business cases (in the case of retail contingency) and lower urgency (in the case of CREST ACR). Respondents also attributed lower scores to new liquidity bridges with RTGS systems in other currencies. Such arrangements would allow RTGS account holders to use funds in other currencies to generate sterling intraday liquidity in RTGS. While a portion of respondents agreed that more liquidity bridges would be useful, they did not prioritise this feature as highly as the others. They also noted that the demand for liquidity bridges was impacted by the external environment quite significantly and could therefore change in the future. Responses highlighted the importance of ensuring a flexible approach to the Roadmap due to such changes in the future environment. A detailed feedback summary on cross-cutting priorities and each individual feature is provided in the Annex, including a breakdown by organisation type.\n\n3: How we are responding to the feedback We have listened to and incorporated the industry’s feedback when planning our further work. This section sets out our approach for shaping the Roadmap. 3.1: Prioritisation approach Continuing to listen to industry’s feedback is key so that we can deliver the features that the users of RTGS want and will be ready to use. In addition to the industry’s views on benefits, potential costs and complexity, we have considered other factors that affect the priorities for further work. They are summarised in Table A. Table A: Factors considered when assigning priorities to features Interdependencies Some features are better implemented before others. Some features are interlinked by a common strategic goal. Industry benefits Some features entail more benefit to users. Some features have less certain benefit cases. Bank priorities Some features directly support the Bank’s core purposes of monetary and financial stability. Costs and complexity Some features will be more expensive and complex to implement. This will be weighed against other factors in determining value for money. External dependencies The delivery of some features is closely connected to events or initiatives outside of the Bank’s control. In practice, the features in the Roadmap were often prioritised due to combination of multiple aligning factors. 3.2: Approach for further work on the roadmap 3.2.1: Overview of priority features The feedback to the consultation has helped us understand industry’s relative priorities and views on implementing the features as part of the Roadmap. However, we need to undertake further work to define more detailed service propositions and assess business cases before we can decide which features to introduce and in what order. Having considered the industry’s feedback and other factors set out in Section 3.1, we have grouped the features proposed in the consultation in three categories (see Figure 1). The categories will help us structure and prioritise how we conduct further work in shaping the Roadmap. However, they do not necessarily indicate the order of priority or sequencing of how we will deliver new features, as further work and consultation will be required before the Bank can take a decision on delivery. Resilient channels. The first category covers the priority features that help achieve resilience outcomes: PKI, maintaining suitable contingency for settlement and a new channel to send and receive payments (via traditional ‘messaging’ or new payment APIs).\n\nThe first category covers the priority features that help achieve resilience outcomes: PKI, maintaining suitable contingency for settlement and a new channel to send and receive payments (via traditional ‘messaging’ or new payment APIs). Innovation and global initiatives. The second category covers priority innovative services that would be offered to the users of RTGS. It consists of synchronisation (an interface to RTGS which would allow linking RTGS with other asset ledgers and payment systems), extended RTGS operating hours and APIs to improve data transparency (Non-Payment APIs).\n\nThe second category covers priority innovative services that would be offered to the users of RTGS. It consists of synchronisation (an interface to RTGS which would allow linking RTGS with other asset ledgers and payment systems), extended RTGS operating hours and APIs to improve data transparency (Non-Payment APIs). Lower priorities. The third category covers all remaining features that were listed in the consultation. Respondents deemed these features lower priority because the business cases were less clear, less urgent or dependent on introducing other features first. Figure 1: Three categories for shaping further work on the Roadmap From 2023, we will be focusing our assessment work on the first two categories. The decision on which features to introduce and when will be taken at a later stage, subject to developing detailed business cases, assessing costs and benefits, and seeking industry’s views. The features considered as part of the Roadmap are not included in the RTGS/CHAPS tariff recovery approach set out in the RTGS – CHAPS Tariff Consultation Response. The Bank will consider how best to recover from the industry the costs for the proposals taken forward once we agree the scope and timing of delivering the features beyond 2024. At this stage, we do not plan active work on the lower priorities category. However, we will monitor and review the demand for these features as part of our ongoing work with the industry. We also asked whether the industry would like to see any other functionality added to our Roadmap, including functionality that could realise the potential benefits often associated with a wholesale CBDC (see Box A). Responses indicated a general support for prioritising the features we identified in the consultation document. Section 3.2.3, Section 3.2.4 and Section 3.2.5 discuss the three categories in more detail. 3.2.2: Long-term vision for RTGS Progressing the priority features is key to achieving our long-term vision for RTGS to act as an open platform for the UK financial services industry to facilitate innovation and support safe and efficient settlement in central bank money. These features would allow the Bank to offer the highest degree of resilience while facilitating innovation and competition in the payments landscape. In the long term, we envisage that the RTGS service will: Continue to meet the highest standards of resilience in the face of evolving threats.\n\nFacilitate industry innovation through the provision of new flexible services, for example extending operating hours closer to 24x7 and introducing synchronised settlement.\n\nBe interoperable with a range of innovative technologies (eg it would be fully API enabled). Global standardisation (due to the use of ISO 20022 messaging standard) will enable greater interoperability with other payment systems, leading to increased processing efficiency.\n\nEnable access by a wide range of diverse participants and financial market infrastructures and accommodate diverse means of connecting.\n\nAllow smooth and continuous further enhancements over the life of the service. 3.2.3: Resilient channels category The resilient channels category comprises: PKI;\n\nMaintaining suitable contingency for settlement (third site); and\n\nA new channel to send and receive payments (whether based on Payment APIs or a new message network). Benefits The resilient channels category is focused on enabling resilient connectivity to RTGS through alternative channels. The ability to continue to make payments and access settlement is important to financial stability, especially in periods of operational or market disruption. The benefits from improved channels are set out in Table B. Table B: Benefits associated with the resilient channels category Removing a single point of failure for the service and the participants SWIFT messaging services currently represent a single point of failure for settlement as this is the only channel over which participants can submit payments to RTGS. A new channel would remove this single point of failure. Enabling innovation in settlement Connectivity can support new services, such as new settlement models (synchronisation) and new ways of consuming data (APIs). Changing connectivity requirements Participants are increasingly adopting cloud infrastructures and renewing their technology stacks. Making direct participation more economical Connectivity is a cost for new institutions seeking to join RTGS. We want to promote competition and innovation in connectivity so that costs are lowered and participants have more options. Enhancements to the third site Improved connectivity and other enhancements that improve the usability of our contingency for settlement. Based on the prioritisation approach (Section 3.1), there are three drivers for prioritising the features in the resilient channels category for further work. The features are industry priorities. They were identified as high priority for a substantial number of respondents. By some measures, these features had the highest overall levels of support based on expected benefits and costs, and so likely represent best value for money. Resilience is a key priority for the Bank. Safe settlement in central bank money is a key contributor to financial stability, and RTGS plays a key role in the transmission of monetary policy and the Bank’s capability to act as lender of last resort. Delivering the benefits associated with these features does not have external dependencies. The Bank and the industry will be able to set timelines with higher confidence and have higher certainty around benefits and business cases. Further work Detailed design and procurement of our centralised RTGS identity service Within this category, we will prioritise the work on PKI – a centralised RTGS identity service. As set out in the consultation, our PKI will be the foundation of security in the multi-channel RTGS and is required to enable the other features in this category. Consultation responses validated this stance. Therefore, we will work to deliver PKI as the first priority feature in the Roadmap. The work in 2023 will focus on detailed design of the PKI. Co-creation on other features in the resilient channels category The other features in this category are highly interdependent, and we will consider the best sequencing and the best way to realise the associated benefits through the co-creation process with the industry. Section 3.4 sets out our plans for co-creation in more detail. We will prioritise further work on this category, focusing on the best way to achieve resilient channels and designing the associated features. We will consider high-level design choices, explore business cases and evaluate delivery options. 3.2.4: Innovation and global initiatives category This category includes: Additional API functionality (Non-Payment APIs).\n\nExtended RTGS operating hours.\n\nSynchronisation. Based on the prioritisation approach (Section 3.1), there are three drivers for prioritising the features in this category for further work. The features are industry priorities. A number of respondents identified them as high priority given potential benefits for their organisations. The features help support the Bank’s long-term vision for RTGS to facilitate innovation in the payments landscape. If implemented successfully, these features can enhance payments domestically and support achieving the Financial Stability Board’s (FSB’s) roadmap by enhancing cross-border payments globally. The features do not have hard dependencies on each other. However, their benefits depend on external developments and international collaboration, including in the context of the FSB’s roadmap on enhancing cross-border payments. Respondents agreed that these features can be a powerful tool to drive innovation in the UK payments landscape and support the implementation of international initiatives such as to enhance cross-border payments (see Box B). The feedback recognised the benefits of extending RTGS operating hours, introducing synchronisation and additional Non-Payment API functionality (see below). However, given the busy industry change agenda and in some cases operational cost, respondents noted that these features need further analysis on business cases and a cost and benefit assessment. Additional API functionality Those APIs that support use cases outside of a new channel to send and receive payments are included in the Roadmap under the Non-Payment APIs feature. Non-Payment APIs will allow information to be extracted from the RTGS system directly and automatically by the systems of our participants and other stakeholders. The industry’s feedback agreed that Non-Payment APIs have the benefits of facilitating innovation in payments, enabling better use of data and reducing participants’ costs (see Table C). Table C: Benefits associated with Non-Payment APIs Innovation in payments services. Data transparency in RTGS can enable payment services to provide more transparency in turn to their end users.\n\nData transparency in RTGS can enable payment services to provide more transparency in turn to their end users. Improved use of data. Participants and other stakeholders can use data for their own operational, risk management or analytical purposes.\n\nParticipants and other stakeholders can use data for their own operational, risk management or analytical purposes. Reduce participants’ costs. Existing uses of data can be automated, requiring less manual intervention and lowering burdens on operational teams. We expect to deliver Non-Payment APIs on an ongoing basis, and the prioritisation of use cases will reflect the sequencing of the broader roadmap and how external developments shape demand. The Non-Payment API use cases that were most prioritised in the responses to the consultation were: Additional liquidity management features;\n\nReconciliation; and\n\nReporting analytics. Extended RTGS operating hours Benefits from extended RTGS operating hours support public policy objectives. While respondents noted that further business case analysis was required, they generally agreed that extended operating hours would have the benefits of enhancing cross-border payments, improving customer experience and mitigating operational risk (see Table D). Responses also highlighted the challenges for institutions in moving quickly closer to 24/7 operation. Respondents noted they were interested in exploring the potential future business cases though highlighted the preference in any case for a phased approach rather than a big-bang implementation. Table D: Benefits associated with extended RTGS operating hours Opportunity to improve customer experiences , as extending by even a few hours could help smooth liquidity flows and could lead to increased business (flagged by smaller users).\n\n, as extending by even a few hours could help and could lead to increased business (flagged by smaller users). Further flexibility and system interoperability. Extended operating hours could be helpful in times of UK interbank payments outages. It could also play a supporting role in providing further contingency and increased interoperability within domestic payment schemes and RTGS systems.\n\nExtended operating hours could be helpful in times of UK interbank payments outages. It could also play a supporting role in providing further contingency and increased interoperability within domestic payment schemes and RTGS systems. Support international work to enhance cross-border payments. Extended operating hours would reduce settlement delays caused by RTGS system closures and facilitate innovation in cross-border payments services, including through synchronisation (see below). Synchronisation Many respondents agreed that synchronisation would have the benefits of using central bank money to a wider range of assets (see Table E). Table E: Benefits associated with synchronisation Allowing a wider range of financial market infrastructures to provide innovative settlement with risk-free central bank money. A synchronisation interface into RTGS would enable ‘atomic settlement’ between RTGS and other asset ledgers.\n\nwith risk-free central bank money. A synchronisation interface into RTGS would enable ‘atomic settlement’ between RTGS and other asset ledgers. Lower liquidity costs and settlement risks associated with different types of transactions (such as housing or foreign exchange). Dependencies relevant to this category The features in this category can support each other (eg extending RTGS operating hours can increase opportunities for using synchronisation for cross-border payments). However, they do not have hard dependencies on each other so the delivery could be accelerated or pushed back depending on industry’s demand and capacity. The benefits and feasibility of these features depend on several external developments: Maximising benefits for some Non-Payment APIs requires co-ordinating with international payment system operators and standards bodies to achieve harmonisation.\n\nrequires co-ordinating with international payment system operators and standards bodies to achieve harmonisation. The full benefits for extended RTGS operating hours would depend on whether/when operators of RTGS in other major currencies do the same.\n\nwould depend on whether/when operators of RTGS in other major currencies do the same. The successful introduction of synchronisation requires a synchronisation operator to be in place and willing to provide the service. Further work We will prioritise the features in this category. We will explore business cases with the industry in more detail and will conduct further policy work on potential service propositions. More detail is provided in Section 3.4. 3.2.5: Lower priority features This category contains features that we deemed to be lower priority, taking industry’s feedback into account. It was less clear how to realise the associated benefits of these features, they were less urgent or more dependent on introducing other features. We will periodically monitor demand for these features but have no active plans to develop them in the near-term. This group includes common contingency messaging channel, enhanced reconciliations, more ways to generate liquidity in RTGS (new liquidity bridges and CREST ACR) and a retail contingency solution. Common contingency messaging channel The consultation suggested introducing a common contingency messaging solution available to all participants, including a protocol and an infrastructure for data transfer. For instance, this could be a simple file-based protocol with files being transferred securely over the internet. It would be available only in situations where networking is disrupted. While the majority of respondents supported maintaining some form of capability to submit payments in a network outage, they also noted that this contingency would need to be always on and used regularly. Therefore, many respondents indicated that having dual live channels (ie that can be used interchangeably during the course of ordinary operations) would better meet this need. Taking this feedback into account, we will address the need for participants to have an option to connect through two live channels under the resilient channels category as a priority. However, we recognise that this solution will not necessarily be the preferred model for all participants, and so we will then review the residual need for solution that would only be used in contingency scenarios and prioritise or deprioritise accordingly. Reconciling data with participants We have proposed to enhance the functionality and policies of the renewed RTGS to enable improved intraday reconciliation. The respondents generally agreed this was important to support higher resilience. However, they noted that relevant changes would be most helpfully introduced after APIs have been introduced to facilitate rapid and regular exchange of reconciliation information. We will therefore postpone further detailed work on this feature until relevant APIs are implemented. New liquidity bridges This feature received majority support, although was seen as lower priority compared with some other features (see Section 2.2). The Bank already has a euro liquidity bridge arrangement, which allows CHAPS Direct Participants to use their euro liquidity in TARGET2 to generate sterling intraday liquidity for CHAPS payments. Therefore, the general functionality has been built into RTGS, and technical discovery work with the industry on this feature is less relevant at this stage. The introduction of new liquidity bridges requires other central banks and RTGS operators in relevant currencies being willing to enter into such arrangements. This topic has currently been a lower priority at international cross-border work under the Committee on Payments and Market Infrastructures (CPMI) roadmap. For the above reasons, we concluded we can postpone active work on this feature until liquidity bridges are prioritised at international or domestic level. Generating liquidity in RTGS using securities in CREST as collateral (CREST ACR) We consulted on extending the current ACR mechanism so that securities in CREST could be used to generate intraday liquidity in RTGS beyond what is needed for settlement in CREST. Respondents thought this feature could be useful but less urgent compared with other functionality and may more readily be absorbed in the upcoming CREST replacement programme. A retail contingency solution (CARA) We have consulted on using CHAPS as a contingency for critical retail payments. Respondents deprioritised this feature mostly because they deemed the business case uncertain. They noted that the industry would need more clarity about New Payments Architecture’s (NPA’s) operational resilience approaches to assess the usefulness of a retail contingency solution. 3.2.6: Summary of next steps for each Roadmap feature Table F summarises the next steps for each feature covered in the consultation. Table F: Treatment of features considered in the consultation on the Roadmap for RTGS beyond 2024 Category Feature Stage Next steps 2023 Resilient channels PKI First to be delivered within the Roadmap Detailed design New channel to send and receive payments Co-creation Identify the best sequence of the features Payment APIs Settlement contingency Innovation and global initiatives Extended RTGS operating hours Co-creation Business case and feasibility analysis Synchronisation Co-creation Policy and design exploration Non-Payment APIs Continuous evolution from the current RTGS renewal Prioritise use cases Lower priority Common contingency messaging channel Deprioritise No active work but monitor developments on an ongoing basis and review Enhanced reconciliations Retail contingency solution (CARA) Extended CREST ACR New liquidity bridges 3.2.7: How the three categories align with the focus areas of the original consultation Our vision for the Roadmap set out in the consultation had three focus areas: new ways of connecting, innovative and flexible services and world-class resilience. The grouping of Roadmap features into three categories shown in Section 3.2 as a result of the feedback gathered through the consultation are aligned with these original focus areas. Several insights provided by respondents have resulted in some exceptions to this alignment. This is reflected in Figure 2. Figure 2: Comparing categories for further work with three features of the vision in the consultation New ways of connecting were among the most prioritised features by respondents. The main reason for this is the operational resilience benefits these features are likely to bring to organisations and the payment ecosystem. These resilience-related features (PKI, a new channel, and Payment APIs) were noted by respondents to not only be interlinked with each other, but also with maintaining a suitable contingency for settlement. This has resulted in our first grouping of Roadmap features supporting resilient channels. Innovative and flexible services have the potential to drive forward global collaboration. Industry feedback also acknowledged these features as key initiatives to improve cross-border payments, while noting their dependency on international initiatives and work in other jurisdictions to enhance local payments infrastructure. The broad range of use cases for APIs identified by respondents has allowed this feature to be split across two groupings dependent on use: resilient channels and innovation and global initiatives. World-class resilience was strongly supported as a priority by the industry. However, there was a majority view that other Roadmap features provided resiliency benefits ahead of enhanced reconciliations and a retail contingency solution (CARA). While the benefits of these features were acknowledged by respondents, they presented lower urgency and greater uncertainty over the strength of their business cases. In addition, respondents expressed the view that a new channel to send and receive payments in itself offered a form of contingency messaging channel. This has resulted in the grouping of lower priority features. 3.2.8: Harnessing the benefits of richer payments data in CHAPS In parallel to progressing the work on the Roadmap, the Bank is also working to implement ISO 20022 global standard for payments messaging. The stages for this work are detailed on the Bank’s ISO 20022 webpage. The Bank continues to work with CHAPS Direct Participants and the wider payments community on how the UK payments industry will benefit from the greater flexibility of the standard, the wider enhancements to resilience resulting from message interoperability with other infrastructures, and through the structured use of ISO 20022 enhanced data, eg purpose codes and legal entity identifiers. We expect that a consistent approach for using structured enhanced data will enable key benefits, such as faster straight-through processing, greater information and analysis capabilities, and fraud prevention. In order to drive these benefits, from November 2024, the Bank will start mandating the usage of certain enhanced data – please refer to our webpage for more detail. In terms of the end-user experience, the Bank is mandating enhanced data only where it deems the benefits outweigh the challenges posed by delivering such data. The Bank continues to work closely with domestic and international colleagues (including Pay.UK, as operator of the future NPA) on the ISO 20022 implementation, to ensure alignment where appropriate and to define a clear change/maintenance cycle to updates to ISO 20022 messaging. 3.3: Co-creation approach Close collaboration between the Bank and the industry is essential when shaping and delivering the Roadmap features to ensure value for money. We will establish industry co-creation forums to advise the Bank on business cases, speed and sequencing of priority features in the Roadmap. We will consider the views of these forums alongside public policy considerations and other factors set out in Section 3.1 when taking decisions on delivering the Roadmap. 3.3.1: Objectives of co-creation The objectives of the co-creation process are to obtain industry steers on: Strategic shaping of the Roadmap features. This includes providing input on which features should be delivered and how they should be sequenced, taking into account any dependencies, the wider industry change agenda and outcomes of further work on individual features. We will obtain cross-feature steers via a strategic engagement forum, consisting of strategic-level stakeholders from a diverse range of current and future users. The co-creation process will also consider when there is the right time to review the treatment of the features in the lower priorities category (eg to start active work on them or to remove them from the backlog of features to consider).\n\nThis includes providing input on which features should be delivered and how they should be sequenced, taking into account any dependencies, the wider industry change agenda and outcomes of further work on individual features. We will obtain cross-feature steers via a strategic engagement forum, consisting of strategic-level stakeholders from a diverse range of current and future users. The co-creation process will also consider when there is the right time to review the treatment of the features in the lower priorities category (eg to start active work on them or to remove them from the backlog of features to consider). Developing individual features in priority categories. This includes advising on service design options, conducting cost and benefit assessment and helping to shape policy on each priority feature. We will invite engagement on specific features via thematic working groups. Initially, the co-creation process will focus on the priority features: Resilient channels category (maintaining a suitable contingency for settlement and a new channel to send and receive payments, including Payment APIs). The work on centralised RTGS identity service will not be part of co-creation;\n\nExtended RTGS operating hours; and\n\nSynchronisation. Over time, industry co-creation will also invite suggestions on any potential new additions to the Roadmap. Co-creation forums will advise on whether such features are worth considering and if so, how they should be prioritised in the context of the other features we are developing. Section 3.4 describes the approach for priority features in more detail. 3.3.2: Principles for designing the co-creation process We are aware of the potential bandwidth issues for the industry to participate in the co-creation process at a time of rapid change in the payments landscape (including Transition State 3 of the RTGS Renewal Programme and the NPA in addition to global change). We will aim to address this by keeping the co-creation sessions focused. We will also use the sessions to gather more insight about likely implementation resourcing constraints. We recognise that we may need to review timings if other industry milestones change. While the detailed approaches will need to be tailored to the key topics and will take further consideration, we have set out some common principles to obtain effective inputs while minimising the burden to the industry. Focused. We will form carefully targetter working groups to tackle a set of specific priority questions.\n\nWe will form carefully targetter working groups to tackle a set of specific priority questions. Representative. We will seek to ensure diverse representation of a range of current and potential future users of RTGS.\n\nWe will seek to ensure diverse representation of a range of current and potential future users of RTGS. Transparent. We will communicate regularly with a wide group of industry stakeholders (including those who may not directly participate in working groups). We will invite (but not require) wider input on a ‘little and often’ basis.\n\nWe will communicate regularly with a wide group of industry stakeholders (including those who may not directly participate in working groups). We will invite (but not require) wider input on a ‘little and often’ basis. Accountable. We will publish the summary of the analysis and advice developed as part of co-creation working groups. We will invite wider industry scrutiny and views before we take decisions on new features. 3.4: Co-creation work plan on priority features The co-creation efforts from 2023 will initially focus on the two priority categories: resilient channels category and innovation and global initiatives category. 3.4.1: Resilient channels category These features share the common theme of removing a single point of failure from the ecosystem while creating new opportunities for innovation in networking infrastructure (see Figure 3). This will be enabled by changing the way payment messages are transmitted, from the current ‘Y-Copy’ mode, which is optimised for use within the SWIFT network, to ‘V-Shape’ which allows messages to be sent across multiple networks. Figure 3: Benefits of features in resilient channels category We will work with the industry to identify the best sequence of features in this category to deliver the primary strategic outcome of removing the single point of failure in networking. This will require collaboration on developing more detailed assessments of the design choices that can be made in developing a new channel to send and receive payments and maintaining suitable contingency for settlement. Key areas for focus in co-creation Weighing the case for seeking to connect an additional message network for RTGS/CHAPS against the case for the Bank directly providing payments via API functionality. This will include security and resilience considerations, as well as potential benefits to innovation and competition.\n\nAssessing whether maintaining dual channel connectivity would be mandatory, optional or tiered.\n\nAnalysing the business case across all stakeholders (costs/benefits) for changing the high-level architecture for the settlement contingency system, or for making improvements within the existing architecture. This would include assessing the benefits and industry impact of the identified models.\n\nAnalysing the possible delivery sequences for the technical changes that will be required to support the features in this category (‘V-shape’ network topology; changes to settlement contingency; connecting another message network; and enabling payments via APIs).\n\nProviding inputs to the Bank’s assessment of the choices associated with this category from a value-for-money perspective. 3.4.2: Innovation and global initiatives category Non-Payment APIs Responses indicated that a collaborative approach to the implementation of APIs was key to maximising benefits. A key step in this approach will be to harmonise API standards as far as practical both domestically and internationally. The Bank and Pay.UK are working closely with industry through the Standards Advisory Panel to propose a framework for the domestic harmonisation of API technical standards in payments and will consult the industry on a proposal soon. More broadly, the Bank is contributing to the international work to harmonise API protocols for data exchange as part of the G20 Roadmap for enhancing cross-border payments. Key areas for focus in co-creation The Bank is already collaborating closely with industry regarding the implementation of APIs through the RTGS Renewal Programme. This work will continue in the near term with a focus on APIs that will be introduced before the future Roadmap. Once the Renewal Programme has concluded, this collaboration will continue as part of our co-creation process and the focus will be: Monitoring and updating the sequence of further use cases that will receive API support;\n\nIdentifying and working through harmonisation issues; and\n\nShaping our long-term vision for all RTGS interactions to be available through APIs. Extended RTGS operating hours We will work with the industry during 2023 to identify the business cases and feasibility of potential extensions, analyse the preferred end-state operating hours and consider how to address any potential challenges and risks of implementation. A CPMI report published in May 2022 identifies potential future end-states for extending RTGS operating hours alongside the risks, policy considerations and potential mitigating actions for jurisdictions to consider. It encourages central banks to work with stakeholders to review domestic operating hours in a strategic light, considering the long-term impact domestically and internationally for the whole payments ecosystem. By using the CPMI’s framework and continuing to engage with our international partners, we hope to maximise alignment and facilitate the greatest benefits from extending operating hours. Key areas for focus in co-creation Analysing the business case (costs/benefits) across all stakeholders for extended operating hours to different end-states and identifying which is the most suitable in the UK. We will assess three ‘end-states’ considered by the CPMI report: Extend on current operating days; Extend on current non-operating days; and Extend to near 24x7.\n\nInvestigating what changes would be needed by participants and their customers (eg to policies, processes, technology, staffing) to implement a new end-state and defining a path and timeline to getting there.\n\nConsidering whether some elements of extended operating hours could be made optional for participants. Synchronisation As part of the RTGS Renewal Programme, we have engaged widely with stakeholders on synchronisation via a Call for Interest and industry workshops. Building on the work in the previous years, we have been working with BIS Innovation Hub London Centre and a consortium of private sector collaborators to explore synchronisation functionality since Spring 2022. Project Meridian will develop a technology prototype that can suitably co-ordinate transactions across multiple ledgers. It will give us practical insights on what information exchange would look like between settlement parties and earmarking and triggering of funds at RTGS. Project Meridian will complete in Spring 2023. Taking into account the findings from Project Meridian, we will explore further policy and design questions relating to the practical implementation of synchronisation functionality in RTGS. This could take a form of a working level policy sandbox, consisting of different settlement parties including potential operators, RTGS account holders and asset ledgers. Key areas for focus in co-creation Defining in more detail the relationships and responsibilities between the operators, the settlement participants, the asset ledgers and the Bank. This includes the level of control that participants would have over the earmarking of their funds used for settlement in RTGS.\n\nIdentifying earmarking protocols, eg timing and length of earmarking and any potential limits to earmarks.\n\nExploring policy frameworks for synchronisation operators’ access to RTGS, eg what regulatory and supervisory requirements potential operators would need to meet.\n\nAnalysing the business case for potential operators to provide synchronisation services and for industry to use the services. This would include assessing the benefits and industry impact of the identified models. Once we have answered the key questions and if we decide to deliver the synchronisation functionality, we will develop and publish eligibility criteria for becoming a synchronisation operator so that potential operators can prepare and apply to become one. This could be done in parallel with the technical development of the synchronisation interface into RTGS.\n\nBox A: Wholesale central bank digital currency In the consultation we outlined that the objective of modernising the RTGS service is to offer a more accessible, functional and resilient platform for digital settlement in central bank money. The Bank has been actively exploring the case for issuing a new form of money in the form of a retail central bank digital currency (rCBDC) and has issued a consultation paper on the digital pound. Some market participants have called for a wholesale version (wCBDC), which would not be a new form of digital money (at present, the Bank enables digital wholesale settlement through CHAPS and its RTGS service) but instead would represent the application of new technologies to improve wholesale settlement in central bank money by making it faster, safer and more transparent. There are a number of benefits that are commonly cited as motivations for a wCBDC. Transparency : using modern data interfaces and automation to allow financial firms and end users to be informed in real time about the status of payments and reach consensus for transactions to proceed.\n\n: using modern data interfaces and automation to allow financial firms and end users to be informed in real time about the status of payments and reach consensus for transactions to proceed. Availability : providing reliable settlement services on a 24x7 basis.\n\n: providing reliable settlement services on a 24x7 basis. Efficiency : minimising frictions in delivery of wholesale settlement.\n\n: minimising frictions in delivery of wholesale settlement. Atomicity : complex transactions can be made safer and more efficient by co-ordinating movements of assets and funds across different ledgers.\n\n: complex transactions can be made safer and more efficient by co-ordinating movements of assets and funds across different ledgers. Access: expanding the use of central bank money for settlement, both by increasing uptake among already-eligible institutions and by extending eligibility to more types of institutions. The Bank has already engaged in various Proofs of Concept and experiments exploring these ideas. Topics covered by these exercises have included: Distributed Ledger Technology (DLT) Proof of Concept: a project to explore and demonstrate basic functions of wholesale settlement using DLT. We built on this work via a second exercise working with Baton Systems, Clearmatics Technologies Ltd, R3 and Token to ensure our renewed RTGS service could connect with systems based on DLT and other innovative technologies.\n\nWe built on this work via a second exercise working with Baton Systems, Clearmatics Technologies Ltd, R3 and Token to ensure our renewed RTGS service could connect with systems based on DLT and other innovative technologies. Cross-border synchronisation: a joint project with Ripple demonstrating that synchronised FX transactions in two different simulated RTGS systems can be achieved, leading to the incorporation of synchronisation functionality into the roadmap for RTGS renewal. Building upon this collaboration with the industry, the Bank has developed new policies and structures to enable the benefits of innovative technologies to be delivered by new types of private sector firms. Through the RTGS Renewal Programme, the Bank is in a position to realise a number of benefits commonly associated with wCBDC more quickly than it would be possible to launch an entirely new wholesale settlement platform and achieve scale in its usage. These include: In 2021, the Bank launched the Omnibus Account model, which allows a greater range of innovative payment services to benefit from settling in central bank money.\n\nThe Bank will increase the transparency, efficiency and speed of information exchange through adopting the ISO 20022 standard and through the provision of APIs, and plans to expand the range of available APIs over time to meet user needs.\n\nThe Roadmap for RTGS beyond 2024 (this document) sets out proposals around: The creation of new channels to connect to RTGS, lowering barriers to entry for a wider range of market participants. Leveraging the capability of the renewed RTGS to extend to near 24x7 operation. We are exploring which approach to operating hours delivers most value to industry while meeting our public policy objectives. Delivering atomicity by allowing third parties (including those using DLT) to co-ordinate transactions between RTGS and other ledgers. We continue to explore this via Project Meridian, a joint initiative with the BIS Innovation Hub London Centre, which is prototyping and testing the end-to-end flow of synchronised settlement.\n\nWe invited challenge on our view that we should focus on delivering these benefits through the enhancement of our existing infrastructure in the consultation. We did not receive substantive contest on this approach and received broadly positive responses to the innovative RTGS features outlined above. We view the consultation feedback received as endorsing the Bank’s near-term focus on providing enhanced wCBDC functionality via RTGS. However, it does not preclude the Bank from continuing to track the findings of other central banks in exploring the merits of creating a separate wCBDC platform.\n\nBox B: Supporting improved cross-border payments The G20 has made enhancing cross-border payments a priority and agreed ambitious quantitative targets for the speed, cost, accessibility, and transparency of these payments. The targets mostly apply from 2027. To achieve them, central banks, other public authorities and the payments industry need to take decisive action to tackle the frictions in cross-border payments. Some of the features considered for RTGS beyond 2024, such as longer operating hours, could make an important contribution. It is estimated that in 2022 the aggregate value of global cross-border payment market will have exceeded US$150 trillion, and the importance of cross-border payments is expected to grow further. Yet cross-border payments infrastructure and service levels have not kept pace with the changing world and domestic progress. Faster, cheaper, more transparent and more inclusive cross-border payment services would deliver widespread benefits for citizens and economies worldwide, supporting economic growth, international trade, global development and financial inclusion. Since 2020, work on cross-border payments has been organised around an international roadmap comprised of 19 building blocks. The CPMI, FSB and other international bodies have largely completed the stocktaking and analysis stage of this roadmap, and published guidance and recommendations in several areas, including RTGS operating hours. The next stage of the international roadmap will focus on implementation of the guidance and recommendations, through practical projects to enhance cross-border payments. This includes prioritising initiatives that will make the largest contribution to achieving the G20 targets by 2027 and will inform future work in three priority areas: Payment system interoperability and extension including possible extensions to RTGS operating hours as well as expanded access and options for interlinking domestic payment systems;\n\nincluding possible extensions to RTGS operating hours as well as expanded access and options for interlinking domestic payment systems; Legal, regulatory and supervisory framework including options for improving alignment in national requirements for combatting financial crime; and\n\nincluding options for improving alignment in national requirements for combatting financial crime; and Cross-border data exchange and message standards including internationally harmonised adoption of ISO 20022 payment messages and regulatory restrictions on transferring personal payment data across borders. Enhancing cross-border payments requires close public-private collaboration. To this end, the FSB and CPMI intend to establish in 2023 Q1 two new industry taskforces to facilitate regular engagement between public authorities and senior representatives from the payments industry. In parallel, the FSB and CPMI are working with the International Monetary Fund and World Bank to strengthen the technical assistance available to non-G20 jurisdictions as they seek to implement the guidelines and recommendations emerging from the international roadmap. The Bank strongly supports the G20 cross-border payments programme. The approach for the way forward outlined in this response document – in particular through the innovation and global initiatives category – reflects the important interlinkages between international work on cross-border payments and the Roadmap for RTGS beyond 2024. The Bank will continue to (i) feed into and drive international work, including by sharing ideas and lessons from our RTGS Renewal Programme, and (ii) consider and utilise the helpful outputs of the international work to shape domestic initiatives such as the potential transition to longer RTGS operating hours after 2024.\n\n4: Next steps We will work on the centralised RTGS identity service (PKI) as the first priority of the Roadmap, focusing on detailed design and procurement. We anticipate that the earliest we could implement PKI is around six months after the delivery of the core settlement engine in 2024. As per the approach for further work outlined in Section 3.4, we will be setting out a plan for co-creation with the industry. We will look to identify diverse industry representation for co-creation forums reusing existing structures where possible. We intend to start working actively with those industry representatives on co-creation topics from 2023 Q2. We expect this phase of co-creation to run from 2023 Q2 until early 2024. We will then take stock of the findings and, considering costs and benefits of various features, take a decision on moving propositions to delivery at an appropriate time. Depending on the impact and complexity of various features, we will consider delivering features in parallel. After the initial co-creation work, we will be monitoring industry developments and reviewing priorities (as part of the cross-cutting strategic industry forum and a wider industry engagement) on an ongoing basis. In parallel to co-creation, we will continue working on other priorities, such as ISO 20022 and API implementation and further development of our resilience framework."
    }
]