[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vdS50b2RheS9yaXBwbGUtY3RvLWV4cGxhaW5zLXdoeS14cnAtaXMtYS1jb21tb2RpdHnSAT5odHRwczovL3UudG9kYXkvcmlwcGxlLWN0by1leHBsYWlucy13aHkteHJwLWlzLWEtY29tbW9kaXR5P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Ripple CTO Explains Why XRP Is a Commodity - U.Today",
        "content": "Ripple CTO David Schwartz recently took to Twitter to explain why XRP meets the definition of a commodity.\n\nAdvertisement\n\nHe claims that it is a raw good that trades in commerce, with each XRP token being treated as equal to any other token. Moreover, no part of the cryptocurrency's value is derived from another party's legal obligations to XRP holders.\n\nCryptocurrencies have frequently been referred to as securities or commodities, but the actual legal status of digital assets is far from being clear.\n\nTo help determine which type of asset cryptocurrencies are, many turn to the Howey Test which was created by the U.S. Supreme Court in 1946 and defines the criteria for a security instrument. The test consists of three parts: whether there is an investment of money in a common enterprise with a reasonable expectation of profits; whether the profits come from the efforts of a promoter or third party; and if so, whether those efforts constitute an essential element of the scheme.\n\nIf cryptocurrency meets all three criteria outlined by Howey, then it can be categorized as a security. In other words, if someone purchases cryptocurrency with the expectation that their investment will yield profits due to the efforts of another party (such as its issuer), then they are considered to own a security. This could mean that buyers would fall under securities regulations such as registration requirements and fraud prevention measures.\n\nThe U.S. Securities and Exchange Commission took Ripple to court in late 2020. The suit alleges that Ripple and its top two executives, Brad Garlinghouse and Chris Larsen, have been engaged in an \"ongoing unregistered digital asset security offering\" involving XRP since 2013. According to the SEC’s complaint, Ripple, Garlinghouse, and Larsen raised a combined $1.38 billion through unregistered sales of XRP tokens without registering them as securities."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vdGltZXN0YWJsb2lkLmNvbS9yaXBwbGUtY3RvLWRhdmlkLXNjaHdhcnR6LXhycC1maXRzLWludG8tdGhlLWRlZmluaXRpb24tb2YtYS1jb21tb2RpdHktdW5kZXItdXMtZmVkZXJhbC1maW5hbmNlLXJ1bGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Ripple CTO David Schwartz: XRP Fits Into the Definition of a Commodity under US Federal Finance Rules - Times Tabloid",
        "content": "David Schwartz, the chief technology officer at Ripple, has recently stated that the digital token XRP has the feature of a commodity in the market despite the ongoing legal tussle over its status.\n\nAccording to Schwartz in a tweet on the 20th of January, XRP fits into the definition of a commodity under US federal finance rules ahead of the awaiting verdict on whether it was traded as an unregistered security or not.\n\nRead Also: Ripple CEO Restates His Optimism On XRP Lawsuit Ending in First Half of 2023\n\nDavid Schwartz tweeted, “XRP is a raw good that trades in commerce and one XRP is treated as equivalent to every other XRP. That’s pretty much the definition of a ‘commodity.’ No part of XRP’s value comes from anyone else’s legal obligations to XRP holders.”\n\nXRP is a raw good that trades in commerce and one XRP is treated as equivalent to every other XRP. That's pretty much the definition of a \"commodity\". No part of XRP's value comes from anyone else's legal obligations to XRP holders. — David \"JoelKatz\" Schwartz (@JoelKatz) January 20, 2023\n\nRecall that Ripple, a San Francisco-based cross-border payment firm, was sued by the United States Securities and Exchange Commission (SEC) for allegedly selling XRP as an unregistered security for relatively seven years.\n\nRead Also: Ripple CTO David Schwartz: There Is No Remaining FLR Airdrop Balance For XRP Holders Anymore\n\nRipple CTO says that the government has been inconsistent in characterizing digital assets, citing a lawsuit filed against crypto investor Avraham Eisenberg by the U.S. Commodity Futures Trading Commission (CFTC), where it referred to certain cryptocurrencies as commodities.\n\n“The government describes tokens as commodities every time it’s in their interest to do so… Just to be clear, I’m not claiming this means anything other than that it’s reasonable to describe tokens as commodities. One can sell a commodity with an investment contract and that’s an offering of a security.\n\n<\n\n“I agree that there are new risks to consumers created by digital currencies. I think the worst of them are addressed by existing laws such as those prohibiting fraud. You can see lots of CFTC and DOJ actions that don’t rely on securities law. Congress can also pass new laws.”\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MveHJwLW9yLWFkYS13aGljaC1jcnlwdG9jdXJyZW5jeS1taWdodC1yZWFjaC0xLWZpcnN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "XRP or ADA: Which Cryptocurrency Might Reach $1 First? - Watcher Guru",
        "content": "Cardano‘s native token ADA and Ripple‘s native token XRP are among the top 10 most brought cryptocurrencies in the world. Both represent a billion-dollar market cap and possess distinct functionalities that benefit blockchain technology.\n\nBoth the Altcoins have all-time highs of $3+ but they are currently trading near $0.30. Both ADA and XRP communities want their respective investments to breach the $1 mark in 2023 and generate decent returns. But which cryptocurrency among these two might reach $1 first? Let’s go through the pros and cons below!\n\nAlso Read: Ripple: AI Predicts XRP Price For Feb 1, 2023\n\nADA or XRP: Which Could Reach $1 First?\n\nSource: AnalyticsInsight.com\n\nThe Cardano ecosystem is growing but faces several challenges as the network is working towards improving its user experience. Despite being among the ‘Ethereum Killers‘ it lags behind the functionalities of the Ethereum blockchain. However, Cardano’s ecosystem is robust, with a decentralized architecture, and has a strong scaling capability. The latest Vasil Hard Fork in September 2022 is one example of the network updating its features for smooth functioning.\n\nAlso Red: XRP Bulls Are Aiming For $1, Can It Happen?\n\nSource: CoinGecko.com\n\nOn the other hand, Ripple is caught in a legal battle with the SEC since 2020 and the outcome of the case is pending. A handful of twists and turns have come out over the past two years stunting XRP’s growth in the indices.\n\nThe SEC has accused Ripple of selling XRP as an investment without registering it as a security. The SEC claims that Ripple and its top executives unlawfully profited from these sales. You can read more details about it here.\n\nAlso Read: 3 Cryptos to Watch Out for After CPI Data Rally\n\nSource: CoinGecko.com\n\nADA is free from legal shackles and investors have confidence in its growth. However, XRP remains to be tied with the court battle removing investors’ confidence in the token.\n\nTherefore. according to Friday’s standing, Cardano’s ADA might reach $1 first when the bull run begins compared to Ripple’s XRP. ADA is free from legal worries but XRP could face consequences if the ruling comes out in SEC’s favor.\n\nAlso Read: When Will XRP Reach Its All-Time High of $3.40?\n\nAt press time, ADA was trading at $0.33 and is up 1.7% in the 24 hours day trade. XRP is trading at $0.38 and is up 1.2% in the last 24 hours."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTAxLXJpcHBsZXMtZmFicmljLXVuaXZlcnNlLXJldmVhbC5odG1s0gFAaHR0cHM6Ly9waHlzLm9yZy9uZXdzLzIwMjMtMDEtcmlwcGxlcy1mYWJyaWMtdW5pdmVyc2UtcmV2ZWFsLmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Ripples in fabric of universe may reveal start of time - Phys.org",
        "content": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nNumerical simulation of the neutron stars merging to form a black hole, with their accretion disks interacting to produce electromagnetic waves. Credit: L. Rezolla (AEI) & M. Koppitz (AEI & Zuse-Institut Berlin)\n\nScientists have advanced in discovering how to use ripples in space-time known as gravitational waves to peer back to the beginning of everything we know. The researchers say they can better understand the state of the cosmos shortly after the Big Bang by learning how these ripples in the fabric of the universe flow through planets and the gas between the galaxies.\n\n\"We can't see the early universe directly, but maybe we can see it indirectly if we look at how gravitational waves from that time have affected matter and radiation that we can observe today,\" said Deepen Garg, lead author of a paper reporting the results in the Journal of Cosmology and Astroparticle Physics. Garg is a graduate student in the Princeton Program in Plasma Physics, which is based at the U.S. Department of Energy's (DOE) Princeton Plasma Physics Laboratory (PPPL).\n\nGarg and his advisor Ilya Dodin, who is affiliated with both Princeton University and PPPL, adapted this technique from their research into fusion energy, the process powering the sun and stars that scientists are developing to create electricity on Earth without emitting greenhouse gases or producing long-lived radioactive waste. Fusion scientists calculate how electromagnetic waves move through plasma, the soup of electrons and atomic nuclei that fuels fusion facilities known as tokamaks and stellarators.\n\nIt turns out that this process resembles the movement of gravitational waves through matter. \"We basically put plasma wave machinery to work on a gravitational wave problem,\" Garg said.\n\nGravitational waves, first predicted by Albert Einstein in 1916 as a consequence of his theory of relativity, are disturbances in space-time caused by the movement of very dense objects. They travel at the speed of light and were first detected in 2015 by the Laser Interferometer Gravitational Wave Observatory (LIGO) through detectors in Washington State and Louisiana.\n\nGarg and Dodin created formulas that could theoretically lead gravitational waves to reveal hidden properties about celestial bodies, like stars that are many light years away. As the waves flow through matter, they create light whose characteristics depend on the matter's density.\n\nA physicist could analyze that light and discover properties about a star millions of light years away. This technique could also lead to discoveries about the smashing together of neutron stars and black holes, ultra-dense remnants of star deaths. They could even potentially reveal information about what was happening during the Big Bang and the early moments of our universe.\n\nThe research began without any sense of how important it might become. \"I thought this would be a small, six-month project for a graduate student that would involve solving something simple,\" Dodin said. \"But once we started digging deeper into the topic, we realized that very little was understood about the problem and we could do some very basic theory work here.\"\n\nThe scientists now plan to use the technique to analyze data in the near future. \"We have some formulas now, but getting meaningful results will take more work,\" Garg said.\n\nMore information: Deepen Garg et al, Gravitational wave modes in matter, Journal of Cosmology and Astroparticle Physics (2022). DOI: 10.1088/1475-7516/2022/08/017"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmtlbnRvbmxpbmUuY28udWsvZGVhbC9uZXdzL3dlZGRpbmctdmVudWUtdG8tb3Blbi1hdC1jb3VudHJ5LWhvdXNlLWJ1dC1maXJld29ya3Mtd2lsbC0yODA4Mjkv0gFsaHR0cHM6Ly93d3cua2VudG9ubGluZS5jby51ay9kZWFsL25ld3MvYW1wL3dlZGRpbmctdmVudWUtdG8tb3Blbi1hdC1jb3VudHJ5LWhvdXNlLWJ1dC1maXJld29ya3Mtd2lsbC0yODA4Mjkv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Jan 2023 08:00:00 GMT",
        "title": "Wedding venue to open at country house - but fireworks will be banned - Kent Online",
        "content": "Divisive plans for a wedding venue at a country house have been given the green light - but fireworks and Chinese lanterns won't be allowed.\n\nProposals were approved last night (Thursday) to erect a marquee to host up to 30 events a year at the Grade II-listed 18th century Ripple Court, on the outskirts of Deal.\n\nOwners of Ripple Court, near Deal, want to launch a wedding venue in the grounds. Picture: TaylorHare Architects\n\nThe plans are spearheaded by event company Nunc Est Bibendum - Latin for \"now is the time for drinking \" - which was formed in August 2020 by the owners of Ripple Court.\n\nThey bought the property that summer after it was marketed for £2.75m by agents Strutt and Parker, which described it as \"one of east Kent’s most important country houses\".\n\nDocuments submitted to planning authority Dover District Council (DDC) show that the owners plan to keep the main house as a family home, using money generated from the wedding business to fund its upkeep, as well as that of other buildings in the grounds.\n\nThey say the 60ft marquee would be up between May and September and host up to 30 events a year, with no more than 120 guests at each.\n\nMark Batchelor's garden is about 150 yards from where the marquee is proposed to be erected\n\nWeddings would be held between midday and 11.30pm, with music stopping at 10.30pm.\n\nBut the application attracted fears from neighbours, who were concerned the gatherings will generate noise, disturb the tranquillity of the village and harm its wildlife, while others worried about traffic in the narrow country roads surrounding the site in Wingleton Lane, Ripple.\n\nBut others argue the proposals will provide a welcome boost to the local economy.\n\nJonathan Cronk, 74, who has lived nearby for 33 years and is \"completely against\" the plans, previously told KentOnline: \"It will be disruptive and noisy to a way of life for people who have lived here for a long time.\n\n“This is a quiet residential area - it isn’t designed for this kind of activity.\n\n“It will disrupt us at the very time of year we want to enjoy our gardens in the evenings.\"\n\nStephen Coveney, who also lives nearby with his wife Lucy Bagley, has concerns about increased noise and traffic.\n\n\"It will disrupt us at the very time of year we want to enjoy our gardens in the evenings...\"\n\n“A canvas marquee is thin so there will be the sound of discotheques, music and shouting, and people drunk - it is just unbelievable there is a planning application for this in such a small environment.\n\n“People who have objected are also concerned about traffic racing up and down the roads, and drivers unfamiliar with the roads getting lost at night.\"\n\nMark Batchelor said his garden is about 150 yards from where the marquee is proposed to be erected.\n\n“In the evenings in the summer we like to sit out in the garden after work, and at the moment it is nice and quiet,\" the 58-year-old said.\n\n“Can you imagine someone else’s music stopping that?”\n\nOther residents wrote to DDC expressing concerns for their horses which they ride in the area and loud noises spooking them, such as fireworks.\n\nOpponents of the scheme also highlighted that there are already five wedding venues within two miles of Ripple Court, and 25 within 10.\n\nA marquee will be added to the gardens, and host 30 events a year. Picture: TaylorHare Architects\n\nBut those in support say the plans will bring money into the area, with guests likely to stay at accommodation close by.\n\nJakub Gajewski said: \"As a local employee and someone familiar with the beauty of Ripple Court I'm delighted at the opportunity for newlyweds to celebrate their vows at such an amazing place.\n\n\"It's a great idea for additional income required to run and restore this magnificent property, and let's not forget additional jobs and revenue streams for local businesses.\n\n\"This could have been left to rot and decay like many other properties of this grandeur, but due to the vision and drive of owners it will be there to enjoy for many generations.\"\n\nLocal wedding photographer Philip Holyer wrote to the local authority to say he “wholeheartedly supports” the plans.\n\n“There aren't enough wedding venues locally and it would be good to have another,” he added.\n\n\"Weddings do get a bit loud and a bit rowdy. I do think we need to have security...\"\n\nHowever, at DDC's planning meeting last night, Cllr Peter Jull was sceptical of this praise.\n\n“I was surprised that one of the comments in support said there’s a lack of prestigious wedding venues in the area, well we seem to be getting one of these applications every other meeting,” he said.\n\nMr Batchelor attended the meeting to object, accusing the council of “moving the goalposts” by emphasising the economic benefits of the wedding venue.\n\nHe also expressed fears about the behaviour of guests.\n\n“We would really appreciate security after 8pm because a lot of the behaviour that goes on is not expected but does happen at weddings, shouting, squealing, arguments, fighting,” he said.\n\nCllr David Cronk (Lab), agreed that a condition should be imposed on the development requiring security staff.\n\n“Weddings do get a bit loud and a bit rowdy. I do think we need to have security,” he said.\n\nLawyer David Harvey attended the meeting to speak on behalf of the owners.\n\nHe told the committee the plans “would be creating both full and part time employment opportunities, with increased economic and employment benefits not just for the wider local area but across the district as a whole.”\n\nHe also told the committee that the applicants were willing to accept conditions which would ban fireworks, chinese lanterns and other pyrotechnics, and would have no problem with mandatory security after certain hours.\n\nHe assured members and residents that the marquee would be acoustically treated and the dancefloor enclosed within, so as to reduce noise disturbance to neighbours.\n\n“Ripple court is first and foremost the applicants home and will be remaining as such, the applicants are committed to and passionate about creating a high-quality bespoke wedding venue, but in an appropriately sensitive, modest, and discrete way,” he added.\n\nDover District Council’s planning committee approved the plans with the added conditions with eight votes in favour and two against."
    }
]