[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3hycC1yaXBwbGUtc3VwcmVtZS1jb3VydC1mYWlyLW5vdGljZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Mar 2023 13:37:50 GMT",
        "title": "Supreme Court Ruling Backs XRP 'Fair Notice' Defense: Ripple - Blockworks",
        "content": "Ripple Labs’ lengthy battle with the SEC is going down the wire.\n\nBoth sides have been waiting for US District Judge Analisa Torres to rule on whether Ripple’s years-long selling of XRP constituted an unregistered securities offering.\n\nA conclusion could be months away, but the SEC and Ripple can still submit pleas with the court to consider new information. Ripple’s most recent filing points to a recent Supreme Court ruling, which touches on the so-called “fair notice” defense employed by its counsel.\n\nThe Due Process Clause of the US Constitution requires individuals be given fair notice of which actions are prohibited by law. For Ripple, the fair notice notice defense goes like this: It couldn’t have known to register XRP with securities regulators, as the agency had never provided enough clarity on what makes a security within the crypto context.\n\nThe US had made a case against Romanian immigrant Alexandru Bittner, who, with 272 bank accounts, broke the law when he failed to file a relevant report with regulators for each one.\n\nUS authorities demanded he pay a $10,000 Bank Secrecy Act fine for each one, while the Supreme Court recently ruled he only had to pay just one, worth $10,000.\n\n“Bittner did not learn of this reporting obligation until returning to the United States many years later. After he returned, he filed the required reports, but not in time to avoid violations,” wrote law firm Faegre Drinker in a recent blog.\n\nIn Bittner’s case, the Supreme Court found that fair notice hadn’t been given, specifically to the point that it would demand individual fines for each undisclosed bank account.\n\nDrawing supposed parallels between Bittner and Ripple execs, Ripple Labs’ counsel says Bittner’s recent ruling is analogous to its fight against the SEC, and should be taken into consideration.\n\nRipple Labs relied on SEC’s previous statements and actions that led them to understand that XRP was not a security, or so its defense goes. Therefore, the firm had no reason to believe that they were violating securities laws.\n\nWhether Judge Torres feels the same way is another matter. Torres is expected to rule on both sides’ summary judgements sometime this year, which, outside of a settlement, would end the case without a jury.\n\nDavid Canellis contributed reporting.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9ub3J0aC95ZWxsb3drbmlmZS1zdHJpa2Utc3BvcnRzLTEuNjc3MDE1M9IBIGh0dHBzOi8vd3d3LmNiYy5jYS9hbXAvMS42NzcwMTUz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Mar 2023 08:00:00 GMT",
        "title": "'Ripple effects': Yellowknife sporting clubs on time out during labour dispute - CBC.ca",
        "content": "Some sporting clubs in the Northwest Territories capital are on the sidelines as a labour dispute between the city and its unionized employees nears the end of its fourth week.\n\n\"There's been a lot of ripple effects,\" said Bridget White, manager of the Yellowknife Curling Club. \"It doesn't only affect our members and our staff, it really has a wider-reaching effect on families and other clubs.\"\n\nWith the curling centre behind the picket line, White said the club's regular activities have been disrupted, including recreational and competitive league games. It also cancelled its Rock the Rings U12, U15 and U20 bonspiel last week.\n\nThe closure of the facility, which has a six-sheet rink with snack and bar service, has also affected four part-time bartenders and the club's ice maker, who works full time during the curling season, she said.\n\nThe N.W.T. Curling Association announced the U18 junior girls championships scheduled to take place in Yellowknife this week have been postponed while its masters event was relocated to Hay River last month.\n\nUnionized workers with the city have been on strike since Feb. 8 after the parties failed to reach a deal on a new collective agreement. Wages continue to be a sticking point.\n\nAs a result, the city's pool and arena — which are beside the curling centre — along with its library, solid waste facility, multiplex, fieldhouse, and visitor information centre have been closed to the public.\n\nFigure skating assessments on hold\n\nMagnolia Unka-Wool with the Yellowknife Skating Club said as the arena is closed, figure skaters have been unable to prepare for Skate Canada assessments and simulations, which are usually held in March and April. She saw how being unable to compete affected her daughter when the arena was closed due to COVID-19.\n\n\"She was devastated,\" she said.\n\n\"To think that we're going to be going through that again and skaters are going to be put back is a pretty big disappointment for them. Most of the skaters, when they get to that test-streams level, everything they do revolves around skating.\"\n\nUnka-Wool said a skater who recently competed at the Canada Winter Games in Prince Edward Island travelled to Mexico and Edmonton to get in ice time before the competition. Recreational skaters are also affected, she said, and the club will likely have to cancel its upcoming ice show, which it hasn't held since 2019 because of the pandemic.\n\nThe Yellowknife Rec Hockey League and Yellowknife Women's Hockey Association have both ended their seasons early. A post on the latter group's Facebook page indicates its executive is looking into renting ice in Behchoko, an hour's drive away.\n\nThe labour dispute has also affected clubs that use the fieldhouse, which has two indoor multi-sport fields, a climbing wall and play area, indoor track and concession.\n\nSoccer coach Joe Acorn said the Yellowknife Bay Soccer Club has been practising in school gyms, which are smaller than the fieldhouse, but were used before the facility opened in 2010.\n\n\"I hope things get back to normal soon, but if not we'll make do,\" he said. \"We're in a better situation than some of the sports like hockey and speedskating and figure skating. They really have no other option.\"\n\nSuper Soccer on the line\n\nAcorn said he's more concerned Super Soccer championships could be cancelled later next month if the labour dispute continues.\n\nThe tournament, which draws players from across the N.W.T. and Nunavut, hasn't taken place the past three years due to COVID-19, he said. If this year's event is cancelled, he said some Grade 12 students will have gone through all of high school without having the chance to compete.\n\nThe Yellowknife Playgroup Association, a parent-run group that uses the fieldhouse, said it has had to make other arrangements to keep the playgroup going.\n\n\"We are looking forward to the conclusion of the strike/lockout,\" treasurer Rosalie Tarleton wrote in an email.\n\nThe city said in a statement it recognizes how the labour disruption has affected residents.\n\n\"Getting an agreement that is fair, affordable and respects the important role city employees play remains the city's priority,\" it reads.\n\nThe Union of Northern Workers and Public Service Alliance of Canada said in a statement that service reductions are the normal result of labour disputes and their members are also Yellowknife residents who have been affected.\n\n\"Our members are out there on picket lines in freezing temperatures asking for fair wages and to be valued and respected by the employer,\" it wrote.\n\nLate last month, the city asked the union to enter into binding arbitration, where a third-party would make a decision on the dispute. The union declined the request, saying they believe the best way reach an agreement is through negotiations.\n\nThis story was produced with the financial assistance of the Meta and Canadian Press News Fellowship, which is not involved in the editorial process."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vcHJvZ3Jlc3NpdmUub3JnL2xhdGVzdC8lRTIlODAlOTh0aW55LXJpcHBsZXMtb2YtY2hhbmdlJUUyJTgwJTk5LWFuLWludGVydmlldy13aXRoLXRhcmEtaG91c2thLW1hYXMtNjMyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Mar 2023 08:00:00 GMT",
        "title": "'Tiny Ripples of Change': An Interview with Tara Houska - Progressive.org",
        "content": "Through her kitchen window, just outside of Ranier, Minnesota—a tiny town east of International Falls—water protector Tara Houska gazes out at Rainy Lake. Called Gojijiing in Ojibwe, the 360-square-mile lake straddles the border between Minnesota and Ontario, Canada. Among the many islands, capes, and peninsulas around the lake is Bald Rock Point, the site of a sixteen-acre former resort built almost a century ago.\n\nBald Rock Point is also now home to a longtime dream for Houska, a member of Couchiching First Nation. It’s the future location of a “long-term resistance camp” where she intends to raise her infant daughter, host Ojibwe language classes, conduct trainings, hold retreats, and nurture other activists. Houska notes that she made her formal offer on the land on October 10: “What a way to spend Indigenous People’s Day! Land back continues.” She’s planning to save and rehab the old lodge, cabin, and pole buildings on the property; as of February, she’d hired contractors to begin work on them.\n\nFor Houska, a tribal attorney, activist, writer, and new mom, the restorative venture is a welcome next chapter. Her years of work fighting against the Dakota Access Pipeline and Enbridge’s Line 3 cost Houska a lot, including more than one wanted pregnancy. Along with other members of the Giniw Collective—a women- and two-spirit-led movement Houska founded to “protect Mother Earth, defend the sacred, and live in balance”—she was arrested, assaulted, and thrown in a county jail alone, for days.\n\nAll for nonviolent direct action, or, as Houska wrote in an essay in Vogue, “trying to stop the drilling of a drought-stricken river in my grandmother’s treaty territory.” Police were “shooting us with pepper balls, rubber bullets, and mace,” Houska tells The Progressive. In Minnesota, law enforcement and Department of Natural Resources personnel were enlisted and paid by Enbridge to crack down—alongside Enbridge private security—on the protesters. Truthout reported in November that Enbridge paid $8.6 million to state and local law enforcement agencies around Minnesota.\n\n“That’s a horrific precedent that was set, and I think it’s something that’s still not widely known,” Houska adds. “In my assessment, it’s an obvious violation of the public trust: police and conservation officers in riot gear being paid by a private entity. In this case, a foreign private entity. I don’t think people fully grasp the level of repression that was happening.”\n\nExpand Provided Photo A realty photo of Bald Rock Point, where Houska plans to run a “long-term resistance camp“ to hold trainings, retreats, language classes, and more.\n\nOil has been flowing through the Line 3 extension for a year and a half, but aspects of the fight are still playing out, including lawsuits over the excessive use of force. “It takes a long time, through the legal system, to achieve any shape or form of whatever justice the system offers,” Houksa says. Still, she focuses on the good that came out of those battles, and they helped inspire her vision for Bald Rock Point. Donations funded the purchase of the property, and Houska is in the midst of transferring ownership to a nonprofit she founded also called Gojijiing, whose future board of directors will ensure the stewardship and communal ownership of the land. Ultimately, Houska dreams of sharing knowledge and skills, and of offering care and rest to other activists there.\n\nHouska’s daughter, born last summer, helps inspire that vision, too. As deeply as she’d felt her convictions about the urgency to protect the planet, the birth of her child crystallized them even more. “She’s here, and I’m looking at her, and I feel like I’m meeting someone I’ve been fighting for,” Houska says. “It’s like, ‘I hope that I’m able to do the best job I can to keep doing that for you. As hard as I can.’ Even when we’re not winning [a particular battle], I hope that we’re trying to build a better world.”\n\nHouska’s path to law and activism wasn’t linear. She changed her undergraduate major at the University of Minnesota six times, and wound up combining art history, biology/pre-med, and American Indian Studies—which she fell in love with through the Ojibwe language program. “I really did love school; I always have.” Houska planned to apply to med school after taking a year off, but an interim stint with a health-care-related company made her leery of the constraints the U.S. private healthcare system places on providers. Her boyfriend at the time suggested law school instead.\n\nExpand Gingger Shankar Houska organized to bring members of 'the Squad' from the U.S. House of Representatives to the front lines of the Line 3 resistance. From left, Cori Bush of Missouri; Houska; Ayanna Pressley of Massachusetts; and Ilhan Omar of Minnesota.\n\n“I had never even seen Law and Order,” Houska laughs. “The only lawyer I knew was Bob Loblaw from Arrested Development. But I thought I could do that and I took the LSAT.” She began law school at a private university in Minneapolis, transferring to the University of Minnesota the following year. A course on Indian child welfare law lit a spark in Houska—she took as many American Indian studies courses as possible and spent an additional year studying tribal law and governance at Arizona State University.\n\nIn her internship in the White House working on the Council on Environmental Quality, Houska worked on a bill—the Helping Expedite and Advance Responsible Tribal Home Ownership (HEARTH) Act—that eventually became law. The act created a voluntary, alternative land-leasing process for tribes. “I remember [an early meeting] sitting in a room with a lot of people who were talking about tribes in a really paternalistic, ignorant, disrespectful way,” Houska says. “Representation is really important. And it’s also important to develop relationships.”\n\nAfter earning her J.D., Houska got a job working for a law firm that represents tribes across the country. From 2016 to 2019, she served as the campaign director for Honor the Earth, an awareness and advocacy group cofounded by Winona LaDuke. The Dakota Access pipeline fight, which began in spring 2016, called Houska to spend more time engaging on a physical level. Houska said it reaffirmed for her the need to foster healing and solidarity—a big part of why she’s committed to building the resistance camp on Rainy Lake.\n\nHouska takes a long view of the struggle against fossil fuels and for a just, equitable transition to clean energy. “What I observe in these fights is an increasing number of people, from all walks of life, who recognize that we have to do something,” Houska says. While she sees politics and policymaking as key—in fact, Houska served as the Native American Advisor to Senator Bernie Sanders’ 2016 presidential campaign—she believes “they aren’t the end-all, be-all. I don’t really look as much to those top-level solutions.”\n\nShe’s most energized by “seeing the anarchist alongside the biologist, the young person with all the tattoos and multicolored hair next to the middle-aged suburbanite next to the grandparent—all side by side because they recognize that we have one home. That’s the beauty of movements, right? This diversity. And it makes us more powerful.”\n\n“She’s here, and I’m looking at her, and I feel like I’m meeting someone I’ve been fighting for. Even when we’re not winning [a particular battle], I hope that we’re trying to build a better world.”\n\nWith the number of billion-dollar disasters in the United States increasing in recent decades—2022 saw ongoing drought and frequent wildfires out West, historic floods in the Midwest, tornadoes in the South, and the devastation of Hurricane Ian—more Americans are experiencing climate change firsthand. “You can give people statistics and facts and figures,” Houska says. “But the thing that’s really going to open someone’s eyes is the fire in my backyard. We’re seeing these extremes; it’s terrifying.\n\n“You can’t deny what’s right in front of you,” Houska notes. “Is my daughter going to be able to experience ice fishing the way that I did? Is she going to be able to live the way I’ve lived? That really does eat at my heart.”\n\nHouska invests her hopes in the evolving movement she’s helping lead. A coalition that included the Giniw Collective involved more than 1,000 people on the ground in the pipeline fight over last few years. “You create these ripples of change,\" she says, \"and you hope you inspire somebody to see, ‘maybe there’s something I could do’ . . . because the system creates a feeling of powerlessness.” But whether she’s in a water protector camp or talking with bank shareholders at their annual meeting, Houska embraces the very real grassroots power she’s helped to build.\n\n“We’re building a holistic movement, because there’s no one way to win against these oligarchs who are destroying the Earth,” Houska says. “Creating inspiration, showing people that the Earth is a relative, a living being we have to protect.”"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8va25vd2xlZGdlLndoYXJ0b24udXBlbm4uZWR1L3BvZGNhc3QvcmlwcGxlLWVmZmVjdC93b21lbi13b3JrLXdoeS1kb250LXdvbWVuLXByb21vdGUtdGhlbXNlbHZlcy1qdWRkLWtlc3NsZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Mar 2023 08:00:00 GMT",
        "title": "Women & Work: Why Don't Women Promote Themselves? | Judd Kessler - Knowledge@Wharton",
        "content": "Transcript\n\nDan Loney: What led you to study this topic?\n\nJudd Kessler: We were very interested in a question that economists had not really studied that much, which is how do people subjectively describe their performance? It’s one thing to answer a question like: how many units did you sell this year? Or how many new clients did you sign on? But a lot of communication about performance and ability is subjective. There’s no right answer.\n\nYou have to describe something that’s kind of hard to pin down, and economists had not really looked at that. But we think that is something that is quite important in the way that people perceive you, so we wanted to look at that style of question being asked.\n\nLoney: Your research showed that women systematically rate themselves lower than men on work performance even when their work may be viewed objectively as being better. Can you account for the difference?\n\nKessler: This was one of the things that motivated us to subjective questions and the way people answer them. We had this hypothesis that not only is this important and understudied, but it’s something that we might see as a gender gap, where conditional on the same performance, men would describe that performance more favorably.\n\nMy co-author on this work is Christine Exley at Harvard Business School. If you asked us about the same paper, I might say, “Oh, it’s phenomenal!” And she might say, “Oh, it’s pretty good.” That difference, the way that we talk about the work, even though it’s the same project that we’re both a part of, was the dynamic that we thought might be interesting to explore.\n\nLoney: Are there subtle ways that this might show up in the office?\n\nKessler: We were interested not just in the performance reviews that you might get asked once a year where the employer will sit you down and work through a set of questions. We were also interested in the more commonplace and often subtle interactions that you have with your colleagues and your supervisors, where you’re just talking about work and people are getting an impression of how well you do your job and whether you might be able to take on more difficult challenges.\n\nIf men systematically talk about their prior performance and their underlying ability in more positive terms, that might change the way that people perceive them relative to their equally capable female colleagues. That was kind of what pushed us a little bit more towards these more subjective questions and the ways in which people typically communicate with adjectives. We still were economists who wanted to study this, so we still asked quantitative questions. We asked things like, how much would you agree with the statement, “I performed well,” on a zero to a 100 scale? We can still get a quantitative measure, but it’s clearly a subjective question that doesn’t have a correct answer.\n\nLoney: What is the potential impact for women?\n\nKessler: It’s a little tricky because what we don’t want to do is say that women should necessarily self-promote more, that they should necessarily talk more favorably about their own performance. They are in a situation where it’s possible that there will be backlash, and perhaps differential backlash for speaking too positively about their own ability and performance. It’s possible that the gender difference that we observe is a response to social training that people go through, where when they do talk favorably about how well they did, they might be met with harsher responses, so they’ve learned not to push it on those adjectives.\n\nThe study that we did took away the possibility for backlash. There wasn’t anyone who was going to respond in a negative way to what the subjects in our study said. In fact, they didn’t even know if there was anyone responding. They didn’t know the gender of the person. But it doesn’t mean that those same forces weren’t influencing the way that men and women talked about how well they did.\n\nThe advice is not to the women or the men about how they talk about themselves. Any takeaways from the research have to be on how we elicit information about people’s performance and ability, and potentially not relying so much on the way that people talk about themselves.\n\nLoney: Take us through the research and what you were able to decipher.\n\nKessler: This was a project I was really excited to be a part of, and it ended up with a lot of parts. There were about 4,000 study subjects who were recruited from an online labor market platform. The first thing they did was they took a math and science test — 20 questions taken from the Armed Forces Vocational Aptitude Battery Test, which is a test used by folks like me as measure of cognitive ability. But the questions we picked were math and science questions. We asked them, how well do you think you did? Out of 20 questions, tell me the number that you think you got correct. That’s something that economists have looked at for a while. We think of it as confidence, how many questions you got correct.\n\nThen we asked our subjective questions — describe performance on the test with an adjective that ranged from very poor to exceptional. We also asked questions on the zero to 100 scale with statements like, “I performed well on the test.” What we found was that the first line result is that men and women performed equally well on average. In fact, if you look across all of our subjects, women performed maybe half a question better. But the men rated themselves much more favorably on all of these scales. On the zero to 100 scale, men gave themselves ratings that were 25% higher than the ratings women gave themselves.\n\nThe first hypothesis that we had was maybe this is just confidence re-manifesting. So, we looked at that question of, “How many of the 20 questions did you think you got correct?” Sure enough, even though men and women on average each got about 10 questions correct, men said they got 11 correct, and women said they got eight correct. There was clear evidence that men and women had different perceptions of their underlying ability.\n\nWe wondered whether that was what was causing the gender gap in self-promotion. So, after they took the test, we told them exactly how many questions they got correct. Now we’re comparing men and women who each answered 10 questions correctly and have been told that they answered 10 questions correctly. And we asked the same questions about stating agreement with, “I performed well on the test.”\n\nEven with the same performance and knowing they had the same performance, there was still a very large gender gap. The gender gap shrinks a little bit when you give performance information, but it’s still quite big. That told us there’s something beyond not being sure how many questions they got correct. There’s something fundamentally different about the way men and women interpret the same underlying score.\n\nThis was one of the hypotheses that we had, and we wanted to push the result a little bit further. We did a few different things. One thing was we told men and women the average self-evaluations of other people who had scored the same as them. Now the men and women both know they answered 10 questions correctly, and now both were told what the average self-evaluation is of folks who get 10 questions correct. Still, we see the gender gap unchanged.\n\nWe had another hypothesis, which is maybe women just have higher standards than men. Maybe it’s just the case that if you ask a woman how a certain score is, they always think that it’s less good than a man would. To get at this, we did two things I think are informative. We asked them to describe somebody else’s performance. So, now you’ve taken the test, you don’t know that you’ve answered 10 questions correctly, but we’re going to ask men and women to describe the performance of somebody else who answered 10 questions correctly.\n\nIt’s their performance. They don’t know it’s their performance, but now it’s not about themselves, it’s about somebody else. When we do that, we see no gender gap. When describing a third party, men and women use the same adjectives for the same score. It’s only when they’re talking about their own performance that men and women differ.\n\nThere is research from economics and other fields suggesting that gender gaps are related to the stereotypes surrounding the tasks. The unfortunate stereotype around math and science tasks is that men are expected to do better than women, even though in our case of course women do better than men. So, we picked a task that is less male type, that’s kind of more neutral, and if anything, folks think that women might outperform men. And that was a verbal task. Instead of doing a test with 20 math and science questions, the subjects are doing a test with verbal questions. And when we do that, we again see no gender gap in the way that men and women talk about their performance when the performance is equally good.\n\nThe thing that’s happening here is that there’s something unique about this math and science domain, where the stereotype is that men do better. In that domain, only women are saying that they do less well, even knowing that they have a particular performance and that performance is the same as a man who says they did great.\n\nLoney: It brings up the topic of self-promotion and our perception of how we’re doing in comparison to what we believe our colleagues may be doing. I wonder, can there be too much self-promotion for either men or women?\n\nKessler: It’s hard to get at this because maybe women don’t say that they’re phenomenal in math and science because they’re worried that doesn’t fit stereotypes of women, and people will react negatively to them. There is a lot of evidence of backlash for actions that don’t fit stereotypes that could be playing out here as well. More research [is needed] about exactly where the line is for what’s the appropriate amount of positivity to have. How much can you overinflate your own sense of self?\n\nIn much of what I’ve described, the person who is answering the subjective questions about how well they did, we told them that their answer would be given to another study subject who would use only that self-promotion answer to decide whether to hire the person and how much to pay them. That’s where the self-promotion language comes from, because this is an answer to a question that could be used to determine your pay.\n\nLoney: You also have to look at this from the employer’s perspective and how they understand these differences in hiring and promotion.\n\nKessler: Yeah, that’s one of the things that I found interesting about the different versions that we did. When the study subjects knew that the employer would see the self-evaluation, they rated themselves more favorably. They did respond to the fact that there was an incentive to say that they did well. But when we took the employer incentive away, we still saw a big gender gap. To me, this says for the employer perspective it’s not about exactly the way that you incentivize the self-promotion questions that’s going to matter. It’s not like you can say, “We’re asking these questions, but we promise not to use them to determine bonuses.” Removing the incentives to promote is not necessarily going to change the gender gap, which was there even absent the employer. It really is something about the way that people describe their ability and performance even when it’s not being used for anything.\n\nLoney: Can you theorize what might be the way for women to close that gender gap?\n\nKessler: Our takeaway is twofold. One, we think it’s not the responsibility of the women. It shouldn’t be the responsibility of the women to change the way that they act for multiple reasons. One, it’s unfair to put it on them. Two, it’s not clear that we know how to help people change the way they think about their own ability and performance.\n\nOne result that I didn’t tell you that speaks to that is the study on youth. We did a study with 10,000 middle and high school students, where we had them do essentially the same thing except without employers, and we did it with shorter math and science tests. We saw gender gaps in the way that people talked about their ability and performance in every grade that we looked at, from as young as sixth grade all the way up to seniors.\n\nThat was pretty clear evidence to us that this was not something that was coming at a particular point in time. If there is intervention to be done, it might need to happen before sixth grade. That’s the second thing: It’s not clear how we would change the way perceive their own ability and performance.\n\nThird is the thing I’ve mentioned already, which is the potential for backlash. It’s not clear that we want to encourage women to promote more because it could be optimizing given the incentives that they face. What that means is it pushes the fixing the problem back to the employers, who at interview stages, at application stages, at the performance review stages, should rely less on these subjective self-evaluations and more on objective measures to the extent that they exist in assessing ability and performance.\n\nLoney: Where do you want to take this research next?\n\nKessler: We are starting to think more about how the social dynamics of the work place or educational institutions interact with the gender gap. One thing that we started to look at in our research was whether people perceive the gender gaps, whether [they] anticipate that women are going to talk less favorably about their own ability and performance. And it does not look like the study subjects appear to anticipate that the gap is there.\n\nThat doesn’t answer a key question, which is do employers, who are doing the hiring and promotion and deciding on bonuses, learn over time that women talk differently about their performance? It’s possible that good employers have recognized that if they ask this question, they get the gender gap, and maybe they even correct for it to a certain extent. I think that is the next line of work, to figure out is that observation there, and are the corrections actually being made when they need to be?"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8va25vd2xlZGdlLndoYXJ0b24udXBlbm4uZWR1L3BvZGNhc3QvcmlwcGxlLWVmZmVjdC93b21lbi13b3JrLWRvZXMteW91ci1iaW9sb2dpY2FsLWNsb2NrLWhhdmUtYS1wcmljZS1jb3Jpbm5lLWxvdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Mar 2023 08:00:00 GMT",
        "title": "Women & Work: Does Your Biological Clock Have a Price? | Corinne Low - Knowledge@Wharton",
        "content": "Transcript\n\nDan Loney: What was it that had you thinking about studying gender bias in the workplace?\n\nCorinne Low: The main thing that I’m interested in studying is the economics of being a woman and what makes that unique and challenging, and also special. I wanted to study the issues that were facing women with the same seriousness that we apply to the rest of economic science. So, it wasn’t so much starting with the perspective of gender bias but starting with the perspective of economics as the science of maximizing, subject to constraint, subject to scarce resources. What are those unique constraints that women are facing? What does that maximization or optimization problem look like from a woman’s perspective? How can we use the same tools that we use to study how firms make decisions and how consumers make decisions to understand the unique spectrum of decisions that women need to make.\n\nLoney: This issue is being talked about a lot in society in general, so doing research on these areas becomes very important as we look to see where the development lies.\n\nLow: That’s exactly right, and I think one of the things I hope to accomplish with my research is that when we talk about these issues, we can’t talk about them in a separate domain from economics. I wanted to bring together the cutting-edge science of economics with these issues that affect women’s lives, because a lot of what economists do is study how people make decisions. Women are people, and women make decisions, and decisions have big economic consequences.\n\nBy introducing the term reproductive capital, I hope I’m giving some language to the economics of women’s decisions to bring them out of this domain of treating them like a separate set of issues that we address with a separate set of tools, and to bring them back into this domain of economic decision-making and maximization and optimization.\n\nLoney: Can you explain what reproductive capital is?\n\nLow: This is a term that I came up with when I was in grad school. The term capital typically means material things of worth that can be used to create other things of value. We talk about firms making a trade-off between capital and labor, so they’re deciding how much do I want to use workers, and how much do I want to use machines. Economists came up with this term human capital, which is the fact that skills that human beings have can be used to create things of economic value as well. It’s not just that a machine can be a form of capital, but you can have human capital that’s going to produce value. We talk about education as investing in human capital. I realized that, well, something that women bring to the table is producing something of economic value as well, and that’s women’s reproductive capital.\n\nThat women are actually bringing to the table this ability to create other human beings is pretty fantastic, and this is a tremendous source of value in society. People all across the world want to have children, so being able to create children is a really important form of capital in society. I wanted to acknowledge that and coin this term to demonstrate that this was a source of economic value. And I wanted to deliberately create that parallelism with human capital because one of the things about reproductive capital that I highlight in my research is that it’s time-limited. It depreciates like all forms of capital depreciate, but reproductive capital is this very specific and unforgiving schedule, which is that as women age into their late 30s and 40s, they go through a reproductive decline and eventually menopause.\n\nThat time horizon of reproductive capital creates a fundamental trade-off between investments in human capital, which are going to be worthwhile because you can market those skills and get some economic returns, versus investing and using your reproductive capital. Having a family and producing children is not something you’re going to market in general, so it’s not ever going to be assigned this dollars-and-cents value on the traditional market. But it actually is something that’s tremendously economically valuable, and we see that through people’s choices to invest their time and money in children. We see that children are something that people value, and we as economists should be concerned with how they get produced.\n\nLoney: Were you able to determine a value that associates what reproductive capital can mean to a woman as they’re not only trying to have a family, but also trying to build out their career?\n\nLow: Women are facing this trade-off with their biological clock. They value having kids, and this is something that they don’t want to have to give up on. But what I didn’t see is really trying to put an economic value on it. To do that, I turned to a type of market where reproductive capital has value — and that’s the marriage market.\n\nI thought if I can show that this actually affects women’s perceived value on the marriage market, I’m going to be able to put an economic value on this resource of reproductive capital. I used a study where I randomly assigned age and income to dating profiles, and then I had men rate these women’s dating profiles with randomly assigned age and income. What I found is that for each year that a woman ages after age 30, she has to earn an additional $7,000 a year to get the same rating in this experiment.\n\nBecause the age and income are randomly assigned, I can attribute it to just age that’s driving this, whereas if I used data from the world or from a dating site where I saw who was interested in whom, I wouldn’t be able to separate out the fact that somebody who is older has a lot of other things going on in her life. Somebody who is older may be more likely to be divorced, they might have a different photo, they might have a different career. But I was randomly assigning the age, so I’m holding that profile constant. One person is seeing her at 35 and somebody else is seeing her at 36. And then I’m able to value, what does that extra year mean? I found that it was worth the equivalent of $7,000 of annual salary, and that was showing that men really valued reproductive capital from their potential partners.\n\nThe way that I was able to show that this is actually about fertility and reproduction, rather than other dimensions of age, was that I found that there was not this preference for men who already had kids from a previous relationship. And there wasn’t this preference from men who didn’t have good knowledge that there was a fertility decline between ages 30 and 40. And it also showed it was stronger for people who wanted a more serious relationship, who wanted to get married, and who wanted to have kids. Whereas if you thought this was because you wanted somebody who was young and fun and cool to go drinking with, you might think the people who were looking for a more casual relationship would actually have that stronger preference for younger age. But it was actually the people who wanted to get married and wanted to have kids who showed this strong preference.\n\nI attribute this preference to the market value of fertility. It’s not the traditional market where we’re able to put a price on it because it’s going to be sold, but it is a type of market where you’re making these trade-offs between all these possible traits in your partner. And one of the things that makes a woman more attractive on the marriage market is bringing reproductive capital to the table.\n\nOf course, it has personal value — whether or not you’re able to have kids and this trade-off you might be making with your career — but I wanted to show that there was a real economic cost to it as well. For women, let’s say their manager says, “I want to send you on this assignment to Asia, and it’s going to be really good for your career. But you’re going to have to work 80 hours a week and be totally 100% focused on launching this new team.” That’s going to cause her to say, “This is going to delay my timeline for maybe getting married or having a family. It’s going to increase my earnings, so it’s going to be good for my human capital, but there’s going to be a depreciation in my reproductive capital.” She’s facing an economic trade-off, where there’s value that she could be making and money she could be earning, but there’s an economic loss from making it as well. I wanted to put it in those terms to show that this isn’t just a personal decision, this is an economic decision.\n\nLoney: For a lot of women, this is a decision that they have to make in terms of their career and personal life in order to see what they value the most at that particular time.\n\nLow: Yeah, but it’s not just about what they value. It’s about them maximizing this economic question where these are two things that are both valuable, and she has to make a trade-off between them. I think you’re absolutely right that the issue here is that both things are valuable, and in some ways our society is not set up so that you can have it all at once.\n\nThe policy recommendation that I would make is we can make this trade-off easier for women if we make it more possible to do both things at once, and we make there be less of a trade-off between maximizing your human capital and maximizing your reproductive capital.\n\nLoney: How do you think this information impacts the consideration women give when they’re planning their careers or their lives?\n\nLow: I think this is something women think about, and this is something that women inherently know. It’s kind of hard for people who are not women to believe that, because it’s not something that they’ve been faced with all of their lives. I have this paper about Israel making IVF free. From a naive perspective, you might think that’s going to impact women between 35 and early 40s who haven’t had children yet, and now they’re going to be able to use IVF to have children.\n\nBut we actually see a tremendous impact on young women who are looking forward and planning their life. Now they know this technology is going to be available to them later in life, so they make the decision to delay marriage, they make the decision to finish the degree, they make the decision to break off the relationship that was only so-so and maybe play the field a little bit more and wait for somebody else.\n\nWe see them increasing their representation and getting graduate degrees, becoming doctors and lawyers and professors and things that require these long-term investments. We see young women making decisions in anticipation of how this reproductive time horizon is changing based on the introduction of this new technology. So, I think this is something that women know is a real constraint and inherently plan around. They think about it and talk about it with their mentors. They map out their careers relative to this reproductive constraint. As much as my research maybe is depressing in some ways, I hope that it also makes women feel seen because they’ve been making this trade-off, they’ve been facing this fundamental catch-22 of you can’t have it all.\n\nYou know, it can make you crazy to feel like there’s this big issue that I’m dealing with, yet the responsibility is all on my shoulders, and it’s treated as something that’s [my fault]. Because I want a family, because I value this, now I’m the one who’s kind of stuck in this bind. And I wanted to tell and show women, no, this is a real economic constraint you’re facing, and you’re facing it because you uniquely are in possession of something that’s super economically valuable — reproductive capital. You’re trying to figure out how to maximize the value of this depreciating asset that you’re holding, and this other asset that requires your time to invest in it, which is your human capital.\n\nLoney: What do employers and policymakers need to be thinking about around this?\n\nLow: I hope that firms and policymakers don’t just invest in fertility extending technology. I think that is not solving the fundamental problem. Sometimes that’s a solution we see firms reach for. They say, “We’ll pay for our employees to freeze their eggs.” But that’s not solving this trade-off, that’s just kicking the can down the road. And it’s acknowledging that if you’re a firm that’s doing that and not doing other things, you’re saying, “I’m not going to work to make this more sustainable for you to balance career and family, I’m just going to ask you to wait and do it later, after we’ve gotten the value that we want to out of you.”\n\nI think it’s great if firms want to pay for egg freezing, but they can’t stop there. I don’t want to just move it further down the line. They can’t work forever, so women are just going to face that trade-off when the time comes. I think what I would look for instead is that we truly place value as a society on reproductive capital and on caregiving, and acknowledge that the time required for caregiving has not declined over the past 20 years. Yet we have way more women in the labor force, and we have way fewer households that are set up to have just one primary earner and one person who is able to do a lot of the home production and caregiving and focus exclusively on that.\n\nAll employees are looking for more flexibility and more ability to do this caregiving work and have their families and prioritize that in their lives, because the structure of the American household has changed. It’s by and large two earners, and we need to adjust to that. I think that’s one thing that I would say, is just for firms to understand that that time spent on caregiving has not been declining. In fact, it’s been increasing.\n\nThroughout the 20th century, we saw time at home be replaced by machines, like dishwashers and washing machines. So, for a little while it got easier to do the work at home because we had technology. But technology can’t replace our time spent with children. What we’ve seen over the past 25 years is that time is going up. When we look at surveys like the American Time Use Survey, we see people spending more time on caregiving, not less time. That’s not going away, and it’s something that firms fundamentally need to address.\n\nThat’s my first big message to firms: Think about caregiving as work that all of your employees have to do, and figure out how that fits in with the work that they need to do for you. And my second big message for firms, which is I think part of that, is rethinking flexibility to mean not just flexibility during the work day, but flexibility across the life cycle.\n\nWe’ve recognized that Zoom is a great technology that we can use to not require people to be in the office when their kid is home sick. Or breaking up the face time so you don’t need to stay at the office until 8 p.m. and miss family dinner. Maybe you go home at five when your kids get out of day care, you have dinner with your family, and then you log back on after they’re sleep, and you get that last hour or so of work in. That’s flexibility across the work day, and I think that’s something we need to invest in. But the piece that I think is new with this understanding of reproductive capital and its specific schedule of decline is that we need flexibility across the life cycle. We need to ask, why is it that the typical career path is you get your MBA and then immediately jump on the partner track at the consulting firm or investment bank or whatever firm you’re in where you’re expected to put in 75 hours a week when you’re in your 30s? And that’s the time when reproductive capital is declining.\n\nIs there a way to build in flexibility across the life cycle so that women can make some of these investments earlier or later and have more time to maximize the value of their human capital and their reproductive capital? As we see people’s working lives extend into their 70s, there’s no reason why women shouldn’t be able to make some of these big investments in their 40s and be able to have the type of high-powered careers that we see women dropping out of because firms too often force them to choose."
    }
]