[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vdS50b2RheS9yaXBwbGUtc2VsbHMtdGVucy1vZi1taWxsaW9ucy1vZi14cnAtYXQtYS1sb3NzLXByaWNlLWRyb3BzLWFmdGVyLXJlY2VudC1yaXNl0gFgaHR0cHM6Ly91LnRvZGF5L3JpcHBsZS1zZWxscy10ZW5zLW9mLW1pbGxpb25zLW9mLXhycC1hdC1hLWxvc3MtcHJpY2UtZHJvcHMtYWZ0ZXItcmVjZW50LXJpc2U_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ripple Sells Tens of Millions of XRP at a Loss – Price Drops After Recent Rise - U.Today",
        "content": "Advertisement\n\nDespite the XRP price going down slightly, Ripple has transferred several tens of millions of XRP to a major crypto exchange, which seems like a sale, as reported by major blockchain tracker Whale Alert.\n\nPrior to that, a staggering amount of several hundreds of millions of XRP was moved from a crypto exchange to an anonymous wallet.\n\nRipple sells XRP while price goes down\n\nThe above-mentioned crypto tracking service spotted two large transactions, carrying 29,700,000 XRP and 425,322,309 XRP. The first lump was transferred to Bitstamp.\n\nDetails provided by Bithomp, an XRP-oriented data provider, show that the sender of this crypto was San Francisco-based blockchain company Ripple Labs, which transferred almost 30 million XRP to sell it for $15,040,591.\n\nAs for the second XRP lump, it was transacted from Bitvavo digital exchange to a wallet tagged by Whale Alert as \"unknown.\"\n\nSince the start of August, several XRP transactions of similar size were detected and reported by Whale Alert, with one of them made from Bitvavo.\n\nIn the meantime, today, Monday, Sept. 4, the price of fifth place digital currency XRP dropped 1.44% after rising by 4.73% since Friday. The Ripple giant, though, it seems, managed to transfer the coins to Bitstamp before the price decline. However, it is unclear whether the company sold at a profit or at a loss. At the time of this writing, XRP is changing hands at $0.50331.\n\nOn Aug. 30, Ripple also transferred 31,000,000 XRP to sell this crypto.\n\nRipple returns 800 million XRP to escrow\n\nOn Sept. 1, the aforementioned blockchain behemoth conducted a scheduled, programmed monthly release of one billion XRP coins from escrow, something Ripple has been doing on a regular basis since 2018 to support XRP's liquidity on the market and promote the coin.\n\nHowever, soon after these releases began, Ripple started to lock around 80% of the unlocked billion XRP back in escrow, thus injecting into the market only approximately 200 million XRP on average every month."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvcmlwcGxlLXhycC1sb25nLXRlcm0tcHJpY2UtcHJlZGljdGlvbi13aGVuLXdpbGwtaXQtcmVhY2gtMTDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ripple XRP Long-Term Price Prediction: When Will It Reach $10? - Watcher Guru",
        "content": "Ripple’s native token, XRP is trading around the $0.50 mark and has failed to climb above $1 despite registering a win against the SEC. The Judge ruled that XRP is not a security, giving the cryptocurrency markets the much-needed boost they need to thrive and survive. XRP spiked nearly 65% after the win, reaching a high of $0.82, but dipped in price the same week. The cryptocurrency was unable to breach its yearly high, as it failed to carry the bullish momentum forward.\n\nAlso Read: Shiba Inu: You Can Now Become a SHIB Millionaire With Only $8\n\nSo will the coming years change its fortunes, and can it breach its all-time high of $3.40, which it reached in January 2018? In this article, we will highlight a price prediction for when XRP might reach the $10 mark.\n\nRipple: When Will XRP Reach $10?\n\nSource – Outlook India\n\nLeading on-chain metrics and price prediction firm Changelly has painted a bullish picture for Ripple’s native token, XRP. According to the price prediction, XRP might hit the $10 milestone by the end of the decade, in 2023. That’s an uptick and return on investment (ROI) of about 1,900% from its current price of $0.50.\n\nAlso Read: How Much Oil & Commodity Expanded BRICS Control?\n\nAlso, according to the price forecast, XRP might cross the $1 mark in 2024, reaching a maximum high of $1.26. Therefore, XRP could kick-start a bull run in 2024 and reach new highs between 2024 and 2030, according to Changelly.\n\nSource: Changelly\n\nAlso Read: U.S. & Germany React to BRICS Expansion\n\nHowever, the cryptocurrency markets are highly volatile and have more chances of heading south despite bullish predictions. There is no guarantee that XRP could reach $1 in 2024 and climb above the $10 mark in 2030. The markets fluctuate with the financial order and move both ways, causing severe losses to investors. It is advised to do thorough research before taking an entry position in Ripple’s native token, XRP.\n\nAt press time, XRP was trading at $0.50 and was up nearly 1.2% in the 24-hour day trade. However, it is down 85% from its all-time high of $3.40, which it reached in January 2018."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9pbmRlLWFjY2VsZXJlLWVuLWNyeXB0by1yaXBwbGUtZXQteWVzLWJhbmstZW4tdGV0ZS0yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "India steps up in the crypto space: Ripple and Yes Bank lead the way - Cointribune EN",
        "content": "Mon 04 Sep 2023 ▪ 4 min of reading ▪ by Evans S.\n\nIndia, this giant nation of millennia-old traditions, is resolutely embracing the digital future. Fervently embracing technological innovations, it is now positioned at the vanguard of the crypto movement, with major players such as Ripple and Yes Bank sitting at the top. But what does this crypto ascendancy really mean for the country and, more broadly, for the global financial landscape?\n\nYes Bank & Ripple: Pioneers of India’s digital revolution\n\nDespite the market shakeout, crypto has intrigued, fascinated and, at times, frightened people for years.\n\nBut in the heart of Mumbai, Yes Bank, one of India’s largest banking institutions, has chosen to embrace this revolution.\n\nBy becoming interoperable with the Reserve Bank of India’s UPI interface, it has opened the door to thousands of transactions in digital rupees. A major advance that could well change the face of financial exchanges in India.\n\nFor its part, Ripple, the American financial technology giant, is not to be outdone. Collaborating with Yes Bank since 2018, it has played a crucial role in facilitating cross-border remittances.\n\nThe involvement of RippleNet and crypto XRP in the digital rupee remains uncertain. However, Ripple has already demonstrated its effectiveness with other global CBDC products.\n\nThe Digital Rupee: more than just a currency\n\nThe Digital Rupee is more than just a currency; it is the symbol of a modern, innovative India. The pilot campaigns organized in 2022 demonstrated the country’s determination to place this digital currency at the heart of its financial system. And with the introduction of the QR code, digital transactions in India have a bright future ahead of them.\n\nThe unique QR code mechanism introduced by this initiative is revolutionizing transactions. Offering flexibility and universal adaptability, it meets the demands of a constantly evolving economy.\n\nBy integrating CBDC with UPI QR codes, e-rupee not only asserts itself as a rising force, but also harmonizes with a widely adopted UPI system, potentially reaching 150 million merchants.\n\nTowards a crypto future?\n\nIndia, with its vast resources and overflowing population of talent, is destined to play a leading role in the crypto revolution. A recent report suggests that, by the end of the year, the country could become the world leader in terms of crypto users.\n\nAstonishingly, 53% of these users could be Indian, a percentage that far exceeds that of the USA. Indeed, this figure represents more than five times the number of American crypto investors. A remarkable rise that places India at the center of the crypto world.\n\nWith influential players like Ripple and Yes Bank at the helm, the country looks set to redefine the shape of the global financial landscape. But what if this adventure is just the beginning of a much bigger story? One thing is certain: the digital world has yet to stop surprising us. What’s more, the recent alliance between Mastercard and Nexo heralds another unprecedented crypto revolution, reinforcing the idea that the future belongs to crypto.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL3hycC9yaXBwbGUtY29udHJvbC14cnAtcHJpY2Uv0gFCaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMveHJwL3JpcHBsZS1jb250cm9sLXhycC1wcmljZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Can Ripple Control The XRP Price? Crypto Analysts Weigh In - NewsBTC",
        "content": "The XRP token has attracted much attention, especially because of Ripple’s ongoing legal battle with the US Securities and Exchange Commission (SEC). This has led to speculations on whether Ripple is able to control the XRP price or not. So crypto analysts have chimed in to share their opinions.\n\nNo Ripple Effect On XRP?\n\nPro-XRP influencer Crypto Eri stated in a tweet that she doesn’t rely on the “efforts of Ripple” to increase XRP’s value. She suggested that the crypto company hasn’t done much to grow the token as it accounts for a “single digit impact on volume.”\n\nRelated Reading\n\nPro-XRP Legal Expert Takes The Spotlight With Daring Ripple Vs SEC Settlement Theory 9 months ago\n\nUnlike DAI, I don’t rely on the efforts of Ripple to build up the price of XRP. Never have, never will. Especially with accounting for single digit impact on volume. It’s surprising after surviving the SEC attack, anyone would subscribe to this reliance. https://t.co/XG2bA6qsva — 🌸Crypto Eri 🪝Carpe Diem (@sentosumosaba) September 4, 2023\n\nThere is a common belief that token issuers should be able to control and drive up the price of their tokens, whether through their marketing efforts, a deflationary mechanism, or simply increasing the use cases of their tokens to send a bullish signal to the crypto community.\n\nIn Ripple’s case, Eri believes holders shouldn’t rely on the company, especially after “surviving” the SEC attack. While her stance is unclear, many may argue that Ripple’s effort in its case against the SEC shows its commitment to building the ecosystem and promoting mass adoption of its token.\n\nEri’s tweet came in reply to another pro-XRP influencer, Digital Asset Investor, who tweeted about why he was bullish on XRP. In contrast to Eri’s view, this influencer believes that Ripple’s efforts will greatly affect XRP’s value as Ripple promises to disrupt the global financial system, so he is bullish on the token.\n\nSome would think these were things said by influencers to hype XRP. They were actually said by Ripple. This is why I’m here. I believe them.🏆🏆🏆In It To Win It!🏆🏆🏆\n\n-XRP Could Help In A Systemic Risk Situation In another financial crisis\n\n-XRP will be like a supranational… — Digital Asset Investor.XRP (@digitalassetbuy) September 2, 2023\n\nHas Ripple Had Any Effect On XRP?\n\nIt is worth mentioning that the XRP price experienced significant gains on the back of Judge Analisa Torres’ ruling in favor of Ripple. The token surged over 23% within hours of the decision and rose to as high as $0.9 due to the ruling.\n\nFurthermore, XRP became the fourth-largest token by market cap following the decision (although it has dropped to 5th since then). However, there is no denying the potential for Ripple to go head-to-head with the foremost cryptocurrencies such as Bitcoin and Ethereum.\n\nRelated Reading\n\nNew Job Listing Indicates What Ripple Is Focusing On Next 9 months ago\n\nInterestingly, there was a significant increase in daily transactions conducted on the XRP ledger, with more transactions conducted on the blockchain at the beginning of last month than leading blockchains Ethereum and Bitcoin.\n\nRipple has also not rested on its efforts to develop the XRP ecosystem despite the SEC’s lawsuit against it. The crypto company is looking to expand into the tokenized assets industry by enabling trading of these asset classes on the XRP Ledger.\n\nThere are also plans to release an upgrade for the XRP Ledger, with a notable amendment being the introduction of a novel automated market maker (AMM). This update could see XRPL become a major player in the DeFi space and increase XRP’s utility, which could trigger an increase in its value.\n\nToken price stalls at $0.50 | Source: XRPUSD on Tradingview.com\n\nFeatured image from CoinMarketCap, chart from Tradingview.com"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3hycC1sYXdzdWl0LXVwZGF0ZS13aGF0LXRvLWV4cGVjdC1mcm9tLXJpcHBsZXMtcHJvcGVyLXBhcnR5LW9uLXNlcHRlbWJlci0yOXRoL9IBbWh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3hycC1sYXdzdWl0LXVwZGF0ZS13aGF0LXRvLWV4cGVjdC1mcm9tLXJpcHBsZXMtcHJvcGVyLXBhcnR5LW9uLXNlcHRlbWJlci0yOXRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Ripple’s NYC Proper Party: What to Expect on September 29 - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nStory Highlights Ripple is hosting a party in New York City on September 29, 2023 to celebrate its legal victory against the SEC.\n\nThere are rumors that Ripple may go public through an IPO or settle with the SEC.\n\nThe outcome of the party could have a significant impact on the future of Ripple and XRP.\n\nRipple, the driving force behind XRP, is preparing for a major event set to take place in the heart of New York City on September 29, 2023. This grand celebration comes on the heels of a significant legal triumph against the U.S. Securities and Exchange Commission (SEC).\n\nThis lawsuit had cast doubt on XRP’s classification as a security, creating a cloud of uncertainty within the cryptocurrency market. In the midst of all the buzz surrounding the party, let’s delve into what this means for XRP.\n\nSpeculations Galore!\n\nWith the party date drawing near, two substantial rumors have come to the forefront. One whispers about Ripple taking the plunge into the public domain through an Initial Public Offering (IPO). The other hints at a potential settlement with the SEC.\n\nWho’s ready for “The Proper Party”?\n\n\n\nRegistration is now open for the Ripple-hosted community celebration on Sept 29 in NYC – Reserve your spot here: https://t.co/RkkYXI2eEj pic.twitter.com/de7CWP7aBd — Ripple (@Ripple) September 1, 2023\n\nRead More: XRP Lawsuit News: Can Ripple and SEC Finally Settle? A Look at the Path Ahead\n\nWhat does this mean for Ripple?\n\nAt this juncture, an IPO would be a game-changer for Ripple, allowing it to raise significant capital and gain more mainstream acceptance. This could boost Ripple’s overall value. On the other hand, resolving the SEC lawsuit could remove uncertainty surrounding XRP, possibly leading to its price going up.\n\nBut what is the best possible way if Ripple decides to settle looking at the complexities connected with the Coinbase case?\n\nRead More: Ripple Shares May Reach $140,000 After IPO, Predicts Wall Street Analyst\n\nRipple and Coinbase: More than What Meets the Eye?\n\nIt is worth noting that, there’s also a connection between the ongoing SEC case against Coinbase, a major U.S. crypto exchange, and Ripple’s situation. The SEC sued Coinbase, accusing it of acting as an unregistered broker, exchange, and clearing agency. This raised many questions about why the SEC went after Coinbase after approving its IPO. Depending on how the Coinbase case ends, Ripple might use it as a precedent to seek approval for its own IPO.\n\nThe only way @Ripple and the @SECGov settle before the end of the year is if Judge Failla grants the @coinbase MTD (or partially grants it – finding token sales on an exchange in a blind bid/ask transaction do not fall under U.S. securities laws but allows the staking component… https://t.co/0KzGT1l0OI — John E Deaton (@JohnEDeaton1) September 2, 2023\n\nClearing the air, John Deaton, an attorney representing XRP holders, shared his perspective. Even though he has zero insider information, he thinks that the only way Ripple and the SEC could settle before year-end is if Judge Failla overseeing the Coinbase vs. SEC case makes a significant ruling, like dismissing part of the SEC’s case.\n\nI have ZERO insider information. With that said, let me tell you that at the @Ripple Proper Party there won’t be an announcement of a settlement. See why I say that below 👇\n\n\n\nThere won’t be an announcement of an IPO either. Who approves an IPO? That’s right: the @SECGov. The SEC… https://t.co/kBz2WxPfnI — John E Deaton (@JohnEDeaton1) September 3, 2023\n\nDeaton also discussed a possible Ripple IPO, but he’s cautious because the SEC is actively seeking a permanent injunction against Ripple, its CEO, and its Chairman of the Board, especially regarding future institutional sales of XRP.\n\nRead More: “Fight Back if You Can”: John Deaton Applauds Ripple’s Bold Move to Fight SEC\n\nAnticipation is high\n\nAs we approach the Ripple Proper Party, excitement is building in the crypto community. While these rumors are unconfirmed, the event could reshape Ripple’s future and XRP’s market performance. It’s a big deal in the crypto world, and many are watching closely to see what will happen on September 29."
    }
]