[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LnlhaG9vLmNvbS9saWZlc3R5bGUvYWRpZGFzLXN1cGVyc3Rhci1yaXBwbGUtbnNyYy11ay0xNjE2MTE2ODMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Jun 2023 07:00:00 GMT",
        "title": "This New adidas Superstar Ripple NSRC Is for UK '90s Rave Kids - Yahoo Life",
        "content": "This New adidas Superstar Ripple NSRC Is for UK '90s Rave Kids\n\nadidas pays tribute to the influential U.K. rave club scene with its latest release, the adidas Superstar Ripple NSRC. Drawing inspiration from the iconic Superstar silhouette, the sneaker encapsulates the spirit of the underground subculture of the '90s.\n\nThe shoe features timeless Superstar uppers, complete with signature shell toe caps and linear indentations. On the medial sides, sleek pitch-black leather takes center stage, adorned with white flame embroidery that evokes the vibrant graphics of the '90s and 2000s rave culture. The traditional Three Stripes branding is replaced with transparent finishes while striking Trefoil emblems adorn the tongues. Finishing touches include suede heel tabs, circular adidas markings and rippled rubber soles designed for optimal performance on the dancefloor.\n\nStarting from June 29, the adidas Superstar Ripple NSRC will be available for purchase on adidas' official website and at select retailers.\n\nIn case you missed it, COMME des GARÇONS HOMME x Tokyo Design Studio tease New Balance triple-black 610."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vaHlwZWJhZS5jb20vMjAyMy82L2FkaWRhcy1zdXBlcnN0YXItcmlwcGxlLXVrLXJhdmUtY3VsdHVyZS1yZWxlYXNlLWRldGFpbHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Jun 2023 07:00:00 GMT",
        "title": "The New Adidas Superstar Ripple Is Rave-Approved - HYPEBAE",
        "content": "This New adidas Superstar Ripple NSRC Is for UK '90s Rave Kids\n\nThis New adidas Superstar Ripple NSRC Is for UK '90s Rave Kids An icon for the icons.\n\nThis New adidas Superstar Ripple NSRC Is for UK '90s Rave Kids\n\nadidas pays tribute to the influential U.K. rave club scene with its latest release, the adidas Superstar Ripple NSRC. Drawing inspiration from the iconic Superstar silhouette, the sneaker encapsulates the spirit of the underground subculture of the ’90s.\n\nThe shoe features timeless Superstar uppers, complete with signature shell toe caps and linear indentations. On the medial sides, sleek pitch-black leather takes center stage, adorned with white flame embroidery that evokes the vibrant graphics of the ’90s and 2000s rave culture. The traditional Three Stripes branding is replaced with transparent finishes while striking Trefoil emblems adorn the tongues. Finishing touches include suede heel tabs, circular adidas markings and rippled rubber soles designed for optimal performance on the dancefloor.\n\nStarting from June 29, the adidas Superstar Ripple NSRC will be available for purchase on adidas’ official website and at select retailers.\n\nIn case you missed it, COMME des GARÇONS HOMME x Tokyo Design Studio tease New Balance triple-black 610."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy53dGhyLmNvbS9hcnRpY2xlL25ld3MvY3JpbWUvbW90aGVyLW9mLWJyb2FkLXJpcHBsZS1zaG9vdGluZy12aWN0aW0taHVuZ3J5LWZvci1qdXN0aWNlLWluLXNvbnMtZGVhdGgtY2hyaXMtd2lsc29uLzUzMS0zYWQ0MTY0Yy0zYmJjLTQzZjctYWEzZS1lOTkyMDAxNzcyYzLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Jun 2023 07:00:00 GMT",
        "title": "'My son didn't deserve that' | Mom of Broad Ripple shooting victim seeks justice - WTHR",
        "content": "Chris Wilson was one of three people killed in the shooting. His mother tells 13News she wants to see justice served for her son.\n\nExample video title will go here for this video\n\nExample video title will go here for this video\n\nINDIANAPOLIS — Police are still searching for the person who shot four people in Broad Ripple Sunday morning, killing three of them.\n\nChris Wilson was one of those killed in the shooting. His mother tells 13News she wants to see justice served for her son.\n\n\"So if I spend my last breath fighting for justice for him, I will,\" Lyn Hill said. \"He didn't deserve that. He went to Broad Ripple that night to enjoy himself like any 22-year-old male.\"\n\nWilson's family said he was celebrating a cousin's birthday and only arrived about 20 minutes before he was shot.\n\n\"It's devastating. My heart is just so numb right now. I'm so angry, and I keep telling my kids, 'just calm down. I've got you. We're going to figure this out,'\" Hill said.\n\nHill's family is the latest searching for answers to senseless violence across Indianapolis and Broad Ripple.\n\n\"This has to stop. Broad Ripple has to do something first. Unfortunately, it was my son, but there have been several other people that have taken lives in Broad Ripple,\" Hill said.\n\nHill told 13News Wilson was just in the wrong place at the wrong time.\n\n\"I don't think my son would've ever been in Broad Ripple if he wasn't celebrating his cousin's birthday,\" Hill said.\n\nHill's heart is heavy as she remembers Wilson, going through her son's personal belongings.\n\n\"We have to go through all his stuff, and it's just reminding me of who I know my son was,\" Hill said. \"Lebanon High School graduate, football player.\"\n\nShe's devastated after losing her son to gun violence.\n\n\"No parent wants to sleep next to their child on a ventilator, and I had to do that on Sunday,\" Hill said.\n\nShe said she's hungry for justice.\n\n\"Oh, I'm angry as hell. My son didn't deserve that. He didn't deserve that at all,\" Hill said.\n\nShe's also frustrated with Broad Ripple Avenue's current layout during construction.\n\n\"I've seen the setup here, he was actually standing when everything took place, and there was no way that that should've been open like that,\" Hill said. \"It's too congested, and it's become a money thing, like they're just there to collect the money, and nobody's safe when they go there. Nobody is.\"\n\nHill said her family is now getting through this together, the only way they know how."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LndydHYuY29tL25ld3MvbG9jYWwtbmV3cy9jcmltZS9icm9hZC1yaXBwbGUtdmlsbGFnZS1hc3NvY2lhdGlvbi1ndW4tcmVzdHJpY3Rpb25zLXdpbGwtYmUtZm9yLXNwZWNpZmljLWFyZWHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Jun 2023 07:00:00 GMT",
        "title": "Broad Ripple Village Association: Gun restrictions will be for specific area - WRTV Indianapolis",
        "content": "INDIANAPOLIS — The Broad Ripple Village Association held an emergency meeting Tuesday regarding safety plans.\n\nWRTV is told changes will be made this weekend.\n\n\"The problem is the guns,\" said Kip Tew, Broad Ripple Village Association Board Member.\n\nAftert three people were shot and killed in Broad Ripple over the weekend, there has been a rising concern about senseless violence there.\n\nRELATED | 3 killed, 1 injured after Broad Ripple shooting (wrtv.com)\n\n\"It's just crazy. It's crazy at nighttime. It's got to be a solution. There's a better way than this,\" said local resident Dementri Wilson.\n\nKip Tew with the Broad Ripple Village Association says the solution is working with IMPD and the city to finalize a special event permit which will make the area a gun free zone.\n\nHe says the permit will be for a specific area inside Broad Ripple, meaning people will only be able to get in if they go through a metal detector.\n\nIt's the same concept we saw for the Wonder-Road music festival earlier this month.\n\nRELATED | WonderRoad Music Fest enacts “Gun Free Zone” as part of violence reduction plan (wrtv.com)\n\n\"Obviously this weekend was a horrible tragedy and you know, we're not immune, no place is immune. I said it the other day, and I think it's truth. The only place in America that's safe from gun violence right now is behind a magnetometer,\" said Tew. \"We've seen people killed in grocery stores, we've seen people killed in schools, we've seen people killed everywhere, except in stadiums, and airports, because why? Because they have magnetometers and their gun free zones. And we want to enjoy ourselves. And we want people to come to Broad Ripple and enjoy themselves. So we're gonna take the steps we need to try to make that happen.\"\n\nWhere this will be set up and what businesses will be affected are still in the works. The association says it's working on issues like what time will these be in place, who is going to staff it, and more.\n\n\"Really, the conversations have been trying to work through all the issues that might come from special events, insurance issues, liability issues, logistics issues of what do we shut down? What do we secure? How are we going to take care of both our our people who come and patronize and businesses to make sure that there's the least amount of impact? So, all those kinds of questions we've been wrestling with,\" said Tew.\n\nPeople who work and live in Broad Ripple including Bruce Nebergall are all in for any changes to curb gun violence.\n\n\"Personally, I think to everybody who works in the area, I would feel a lot safer. If we knew that people were kind of not carrying weapons and not able to, anything we could do to limit the access. I think most of us who work right here would be really, really happy to see that,\" said Nebergall.\n\nThe changes expected to go in effect this weekend are expected to be officially announced later this week.\n\nThe association says it's had several meetings with IMPD and the city to find solutions to curb gun violence.\n\nIt's also working with metro police to keep the parking lots clear after the businesses have closed.\n\nIMPD says people tailgating after hours has been a problem.\n\n"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS12cy1zZWMtbGF3c3VpdC1zZXQtZm9yLWp1bHktdmVyZGljdC14cnAtcHJpY2UtYXQtY3Jvc3Nyb2Fkcy_SAWJodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9yaXBwbGUtdnMtc2VjLWxhd3N1aXQtc2V0LWZvci1qdWx5LXZlcmRpY3QteHJwLXByaWNlLWF0LWNyb3Nzcm9hZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Jun 2023 07:00:00 GMT",
        "title": "Ripple vs SEC Lawsuit Set for July Verdict, XRP Price at Crossroads - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nStory Highlights July is a critical month for Ripple's legal battle with the SEC, impacting the cryptocurrency market.\n\nRegulatory developments and court decisions will shape the future of the industry.\n\nXRP's price may experience significant growth soon\n\nJuly is anticipated to be a decisive month for Ripple, the cryptocurrency company currently embroiled in a legal battle with the U.S. Securities and Exchange Commission (SEC).\n\nRipple’s CEO, Brad Garlinghouse, and chief legal officer, Stuart Alderoty, remain optimistic about a summary judgment ruling soon in Ripple’s favor, citing the weakening stance of the SEC’s argument. The outcome of this lawsuit, coupled with other significant market events, is poised to have far-reaching implications for the entire cryptocurrency landscape.\n\nRelated: Ripple Vs SEC Lawsuit To See End This Year – Says CEO Brad Garlinghouse\n\nA Historic Change In Stablecoin Legislation\n\nThe U.S. House Financial Service Committee is poised to address regulatory clarity and stablecoin legislation, potentially leading to the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC) having separate jurisdictions over the cryptocurrency market.\n\nA decision of this magnitude showcases just how important this ruling is for every player in this space.\n\nBusy Month Ahead!\n\nAlong with this, several important court decisions involving major players such as Binance, Coinbase, Terraform Labs, and others are anticipated to be announced in July. These rulings shall set precedents for the industry, inevitably impacting market dynamics and investor sentiment.\n\nAlso Read: U.S. Legislation Set to Determine Digital Asset Classification in July\n\nRipple’s Global Ambitions\n\nDespite the ongoing legal battle with the SEC, Ripple continues to expand its global reach.\n\nRecently, Ripple Markets APAC Pte Ltd received in-principle approval for the Major Payments Institution license from the Monetary Authority of Singapore (MAS), Singapore’s central bank. This development indicates Ripple’s commitment to expanding its services and partnerships worldwide and also showcases that their main focus might not only be USA anymore.\n\nXRP Gains Institutional Interest\n\nXRP, Ripple’s native cryptocurrency, is thriving too! It has witnessed renewed interest from institutional investors after a long period of outflows, exchange-traded funds (ETFs) experienced inflows. Moreover, the filing of Bitcoin ETFs and the entry of traditional financial institutions into the crypto industry have contributed to positive sentiment among traders and investors.\n\nWhat Does History Tell Us?\n\nCrypto analyst Ali Martinez recently shared intriguing data on Twitter, unveiling a correlation between XRP’s network activity and its price. Historical analysis reveals that significant increases in the number of active XRP addresses have been followed by substantial price surges. Recent on-chain data from Santiment supports this correlation, highlighting a surge in XRP’s daily active addresses in the past few days, suggesting a potential price increase.\n\nTaking into account the convergence of positive market factors, including regulatory developments, institutional interest, and network activity, XRP holds the potential for significant upward movement in the near future. If XRP follows its historical pattern, a 50% price increase is expected. As one of the leading cryptocurrencies, such a movement could have a ripple effect on the broader crypto market, bolstering investor confidence and potentially driving up the prices of other digital assets.\n\nXRP Price Outlook\n\nSince the beginning of the year, the XRP price has already rallied over 35%, currently trading at $0.48 with a marginal 2% dip in the last 24 hours. The 24-hour low and high are recorded at $0.479 and $0.492, respectively. While speculation abounds among traders and enthusiasts, the possibility of XRP reaching $1 remains a topic of discussion, influenced by the ongoing SEC lawsuit and other market factors."
    }
]