[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY3J5cHRvLm5ld3MvcmVwb3J0LXhycC1wcmljZXMtYW5kLXJldmVudWUtZnJvbS14cnBsLXN1cmdlZC1pbi1xMi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Report: XRP prices and revenue from XRPL surged in Q2 2023 - crypto.news",
        "content": "The recent Q2 2023 On-Chain Report from Messari highlighted advancements in XRP and XRP Ledger (XRPL). XRP, the native to the XRPL and used for fees and wallet reserves, has seen its prices rise by over 50% this year.\n\nMessari reports that this year, 42.5% of XRP’s market value growth was in Q1 2023. Despite a drop in XRP prices in May, the coin recovered in June but did not surpass its March 2023 highs.\n\nThe analytics firm also notes that the ongoing legal dispute between Ripple and the United States Securities and Exchange Commission (SEC), has significantly impacted recent XRP price movements.\n\nYou might also like: Unconfirmed reports say Ripple considering buying back 10 billion XRP, skeptics doubtful\n\nThe surge in revenue in June, which surpassed the daily average by approximately 20 times for three consecutive days, coincided with breaking news about the SEC lawsuit.\n\nXRP revenue grew 167.2% in Q2 2023\n\nThe report features a visual representation demonstrating a remarkable 167.2% increase in XRP’s quarterly revenue during Q2. USD sales for the quarter surged by an impressive 220.3%, reaching $188,376.\n\nWhile XRPL’s metrics experienced a decline in Q2 2023 compared to the previous quarter, similar to other major layer-1 networks, significant advancements were still made within the XRP Ledger in the last quarter.\n\nOne notable development Messari highlighted is the rise in average daily non-fungible token (NFT) transactions, which grew by 1,370.00–equivalent to 12.7%– from 2013 to 2014.\n\nAlmost every category of NFT trade experienced growth from Q1 to Q2, with NFTokenCreateOffer emerging as the dominant NFT trade by a significant margin.\n\nXRPL’s developments\n\nThe report also underscores XRPL’s progress in various areas of development.\n\nCoreum and Root Network, recently launched platforms, have provided XRPL developers with increased programmability options to explore security tokenization and the metaverse.\n\nIn the second quarter of 2023, the sidechain compatible with Ethereum and the XLS-38d bridge were improved. Developers are testing a new consensus mechanism and added features that allow currencies to be converted into ERC-20 tokens. In Q2 2023, the XRPL network was also active.\n\nOn May 28, 2023, the number of transactions sent to approximately 523,000 addresses surpassed the daily average by approximately 11 times, setting a new record for address activity on the XRPL."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmluZHlzdGFyLmNvbS9waWN0dXJlLWdhbGxlcnkvbmV3cy9sb2NhbC8yMDIzLzA3LzA2L2ItbGluay1jYW1lcmFzLWxpbmstaW1wZHMtaW5jaWRlbnQtYW5hbHlzaXMtY2VudGVyLzEyMTgxMTAxMDAyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "B-link cameras link to IMPD's Incident Analysis Center - IndyStar",
        "content": "NEWS\n\nIMPD's b-link cameras help businesses with security\n\nIndianapolis Star\n\nSusan Truitt looks out the front door of her family-owned business, The Bungalow Inc., Wednesday, June 28, 2023 in Broad Ripple. B-link cameras are a new public safety measure that connects cameras to IMPD’s Incident Analysis Center. The Bungalow Inc. is one company that uses the cameras. Indianapolis Star\n\nThe Bungalow Inc. offers a variety of gifts, home goods, clothing, art and more. B-link cameras are a new public safety measure that connects cameras to IMPD’s Incident Analysis Center. The Bungalow Inc., in Broad Ripple, is one company that uses the cameras. Photo taken Wednesday, June 28, 2023. Indianapolis Star\n\nB-link cameras are a new public safety measure that connects cameras to IMPD’s Incident Analysis Center. The Bungalow Inc., in Broad Ripple, is one company that uses the cameras. Signs alert people of the cameras taking video are seen in The Bungalow parking lot Wednesday, June 28, 2023. Indianapolis Star\n\nB-link cameras are a new public safety measure that connects cameras to IMPD’s Incident Analysis Center. The Bungalow Inc., in Broad Ripple, is one company that uses the cameras. Photo taken Wednesday, June 28, 2023. Indianapolis Star\n\nB-link cameras are a new public safety measure that connects cameras to IMPD’s Incident Analysis Center. The Bungalow Inc., in Broad Ripple, is one company that uses the cameras. This is one of the cameras in their parking lot. Photo taken Wednesday, June 28, 2023. Indianapolis Star\n\nSusan Truitt checks out a customer in her family-owned business, The Bungalow Inc., Wednesday, June 28, 2023 in Broad Ripple. B-link cameras are a new public safety measure that connects cameras to IMPD’s Incident Analysis Center. The Bungalow Inc. is one company that uses the cameras. Indianapolis Star\n\nB-link cameras are a new public safety measure that connects cameras to IMPD’s Incident Analysis Center. The Bungalow Inc., in Broad Ripple, is one company that uses the cameras. Signs alert people of the cameras taking video are seen in The Bungalow parking lot Wednesday, June 28, 2023. Indianapolis Star\n\nSusan Truitt and Diesel show their family-owned business, The Bungalow Inc., Wednesday, June 28, 2023 in Broad Ripple. B-link cameras are a new public safety measure that connects cameras to IMPD’s Incident Analysis Center. The Bungalow Inc. is one company that uses the cameras. Indianapolis Star\n\nB-link cameras are a new public safety measure that connects cameras to IMPD’s Incident Analysis Center. The Bungalow Inc., in Broad Ripple, is one company that uses the cameras. Signs alert people of the cameras taking video are seen in The Bungalow parking lot Wednesday, June 28, 2023. Indianapolis Star"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnBlZGlhLm9yZy9yaXBwbGUvcmlwcGxlLXZzLXNlYy1yaXBwbGUtbGF3eWVyLXN1Z2dlc3RzLXVuZXhwZWN0ZWQtdHdpc3QtZm9yLWNsYXNzLWFjdGlvbi1sYXdzdWl0L9IBcGh0dHBzOi8vY29pbnBlZGlhLm9yZy9yaXBwbGUvcmlwcGxlLXZzLXNlYy1yaXBwbGUtbGF3eWVyLXN1Z2dlc3RzLXVuZXhwZWN0ZWQtdHdpc3QtZm9yLWNsYXNzLWFjdGlvbi1sYXdzdWl0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Has Ripple Just Discovered a Massive Legal Loophole Against the SEC? Find Out Here. - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nStory Highlights Ripple Labs discovers loophole that could undermine class-action lawsuit and benefit XRP holders.\n\nLawyers in the case may secretly hope for Ripple's success to redirect penalties away from plaintiffs.\n\nOutcome of SEC case could reshape cryptocurrency classification and regulation.\n\nRipple Labs, in a surprising turn of events, has stumbled upon a potential loophole in its ongoing dispute with the U.S. Securities and Exchange Commission (SEC). This discovery could have significant implications for the outcome of the ongoing class-action lawsuit.\n\nWhat is it and how could this change the trajectory? Read on.\n\nDeaton Reveals an Intriguing Motive\n\nIn a tweet that raised eyebrows, John Deaton hinted that the lawyers representing the class-action plaintiffs might secretly hope for Ripple’s success in the SEC case.\n\nRead More: Ripple vs SEC: Why is the Summary Judgement Stretching On? Deaton Provides Insights\n\nHow? Well, if the SEC wins big, they would be the ones pocketing the fines and penalties, not the plaintiffs. This game-changer could lead to a compensation fund for XRP holders, undermining the class-action lawsuit entirely.\n\nThis class action is the least of Ripple’s worries. In fact, the plaintiffs’ attorney should be hoping the SEC loses and Ripple wins. If the SEC were to get a total victory, the SEC would be the one to collect the money and set up a fund to pay XRP holders thus, gutting this… — John E Deaton (@JohnEDeaton1) July 5, 2023\n\nThe Burning Question\n\nAt the core of both the SEC case and the class-action lawsuits is the vital question of whether XRP should be considered a security.\n\nThis issue has been the focal point of Ripple’s legal battles in recent years, adding an extra layer of intrigue to this unfolding situation.\n\nRelief for XRP Holders\n\nDeaton clarified that the certified classes involved in the class-action suit apply solely to U.S. investors. This clarification should provide relief for international XRP holders, as regulatory bodies in the United Kingdom, Japan, Singapore, and the United Arab Emirates have already declared that XRP is not a security within their respective jurisdictions. Consequently, these international XRP holders remain unaffected by the certification of the class-action lawsuit.\n\nAs Ripple fights on two fronts—the SEC lawsuit and the certified class-action—Deaton’s bombshell revelation suggests that the outcome of the SEC case could be the ultimate game-changer. The stakes have never been higher."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmphY2tzb25sZXdpcy5jb20vaW5zaWdodHMvaW5pdGlhbC1yaXBwbGUtZWZmZWN0cy11cy1zdXByZW1lLWNvdXJ0LWFmZmlybWF0aXZlLWFjdGlvbi1zdHVkZW50LWFkbWlzc2lvbnMtZGVjaXNpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Initial Ripple Effects of U.S. Supreme Court Affirmative Action in Student Admissions Decision - Jackson Lewis",
        "content": "In its decision holding the use of race in university and college admissions is unconstitutional in violation of the Equal Protection Clause of the Fourteenth Amendment, the U.S. Supreme Court noted that “[e]liminating racial discrimination means eliminating all of it.” Students for Fair Admissions, Inc. v. President and Fellows of Harvard College, No. 20-1199, together with Students for Fair Admissions, Inc. v. Univ. of North Carolina, No. 21-707 (June 29, 2023).\n\nTherefore, it should come as no surprise that, on July 3, 2023, the Chica Project, the African Community Economic Development of New England, and the Greater Boston Latino Network filed a federal civil rights complaint against Harvard College, alleging that its practice of giving preferential treatment in the admissions process to applicants with familial ties to wealthy donors and alumni results in systemic preferential treatment of White applicants in violation of Title VI of the Civil Rights Act of 1964 (42 U.S.C. §2000d). Title VI prohibits discrimination on the basis of race, color, and national origin in programs and activities receiving federal financial assistance.\n\nThe Complaint was filed with the U.S. Department of Education’s (DOE) Office for Civil Rights (OCR) by the Lawyers for Civil Rights. As the Complaint outlines:\n\nEach year, Harvard College grants special preference in its admissions process to hundreds of mostly white students – not because of anything they have accomplished, but rather solely because of who their relatives are. Applicants whose relatives are wealthy donors to Harvard, or whose parents are Harvard alumni, are flagged at the outset of Harvard’s admissions process and are granted special solicitude and extra “tips” throughout. The students who receive these special preferences (“Donor and Legacy Preferences”) are significantly more likely to be accepted than other applicants, and constitute up to 15% of Harvard’s admitted students.\n\nThe students who receive this preferential treatment – based solely on familial ties – are overwhelmingly white. Nearly 70% of donor-related applicants are white, and nearly 70% of legacy applicants are also white.\n\nComplaint at p. 1 (internal citations omitted).\n\nThe Complaint further alleges that qualified applicants of color are harmed as a result, as admissions slots are given instead to the overwhelmingly White, wealthy applicants who benefit from Harvard’s legacy and donor preferences. Therefore, the donor and legacy preferences creates a significant, disparate impact on nonwhite applicants that is not justified by any educational necessity, in violation of Title VI, the Complaint alleges.\n\nThe Complaint relies on the facts, statistics, and legal analysis in Students for Fair Admissions, Inc. v. President and Fellows of Harvard College (which was decided based on application of the Equal Protection Clause of the Fourteenth Amendment) to support the allegations that Harvard’s practices violate Title VI.\n\nFurther, like in Students for Fair Admissions, Inc. v. President and Fellows of Harvard College, the plaintiffs here appear to proceed on the grounds of organizational standing. This allows standing if an organization can show that it suffered an injury even in the absence of identifying an actual member who suffered injury. To invoke organizational standing, “an organization must demonstrate that (a) its members would otherwise have standing to sue in their own right; (b) the interests it seeks to protect are germane to the organization’s purpose; and (c) neither the claim asserted nor the relief requested requires the participation of individual members in the lawsuit.”\n\nThe plaintiffs request the DOE launch a federal investigation, under Title VI and its implementing regulations, into Harvard’s practices surrounding legacy and donor preferences. They urge the DOE to declare these practices unlawful and for Harvard to cease legacy and donor preference practices if the university wishes to continue receiving federal funds.\n\nUnder the DOE’s OCR procedures, the Complaint will be evaluated and a determination made as to whether to open or investigate the Complaint. Although OCR aims to resolve cases within 180 days, complaint processing frequently exceeds that mark, and cases involving systemic allegations can take years to resolve. In some instances, OCR will employ mediation as an option to resolve a complaint. Likewise, recipients may elect to enter into and OCR may accept a voluntary resolution agreement to resolve a complaint.\n\nFurther litigation stemming from the Students for Fair Admissions, Inc. decision is expected. Jackson Lewis attorneys will continue to monitor the decision’s impact and will provide updates. If you have questions, please contact the Jackson Lewis attorney with whom you regularly work or a member of the Corporate Diversity Counseling; Environmental, Social, and Governance, or Higher Education practice group to discuss."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vd3d3Lmpwb3N0LmNvbS9vcGluaW9uL2FydGljbGUtNzQ4OTc40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "'Occupation' is making a comeback: The legal overhaul's ripple effect - opinion - The Jerusalem Post",
        "content": "The destructiveness, extremism, and damage caused by this “full right-wing government” have not only brought hundreds of thousands of citizens out to the streets; they have also begun to create a change in the liberal camp’s discourse. No more self-flagellation and drifting along with delegitimization led by right-wing propagandists against concepts, personalities, and organizations.\n\nThere is much more acceptance and recognition of the importance of cooperation between all parts of the liberal camp, although even now – at least in the context of Arab society and understanding the contradiction between democracy and the situation in the occupied territories – there is still much room for progress.\n\nOne of the direct benefits of this change is the return of the word “occupation” to our discourse, a word that over the years has almost turned into a mockery.\n\nThe term is making a comeback\n\nThe term is making a comeback, with the understanding that the occupation is not only harming the Palestinians and the Israeli soldiers sent to enforce it, but that its methods are slowly creeping into Israeli society and its law enforcement mechanisms. Palestinians and pro-Palestinian supporters protest against Israeli attacks on Gaza amid days of conflict between the two sides, in Brooklyn, New York, U.S., May 15, 2021 (credit: REUTERS/Rashid Umar Abbasi)\n\nT-shirts and signs with “No democracy with occupation” have become common at protest events. Members of the “anti-occupation bloc,” once outside the camp, are now attracting more and more activists and demonstrators.\n\nEven the masses who do not connect with the message realize that it is an integral part of the same protest in which they are participating. On the main stage at the Kaplan demonstration last Saturday we finally heard a link between the struggle against the judicial overhaul and the struggle against Jewish supremacy and pogroms perpetrated by Jewish fascists, which had previously gotten yawns from centrists.\n\nAs CEO of J Street Israel, I have had the privilege of experiencing this welcome change, which has had an impact far beyond the circle of protest supporters.\n\nWhen Diaspora Affairs Minister Amichai Chikli appeared on Ayala Hasson’s Kan 11 TV show and called J Street a “hostile organization,” he expected wall-to-wall support, because what could be more popular than bashing leftists, but to his surprise and our delight, the exact opposite happened.\n\nParticipants on the panel, including the interviewer, were quick to prove him wrong, adding that J Street is an important Diaspora organization whose representatives are worthy of meetings. But the greatest contribution of Chikli’s ignorance and his attempt to harm us was that it led many representatives of the political center, politicians, and journalists, to defend our organization and its place as an important pro-Israel organization, even if they do not agree with all of our actions.\n\nSuddenly it became clear that the conditioned reflex of the Israeli center to align itself with right-wing incitement, as it did in the past with respect to Breaking the Silence or the New Israel Fund, has been undermined.\n\nThere is also a paradigm shift among world Jewry. The tendency to align with Israeli governments regardless of the values they represent – though often contrary to those of many Diaspora Jews – is being undermined. More and more people are realizing that it is possible to be a pro-Israel Zionist even when they oppose and criticize the government, just like those Israeli patriots who are fighting a government that is trying to destroy our democracy and the rights of individuals and minorities.\n\nWe must continue to fight against all those attempts on the Right to delegitimize anyone who seeks to talk about the occupation and acts to end it. As the judicial overhaul aggressively attacks the rights of individuals and minorities, the main challenge now facing us is the Education Ministry’s attempt to deny the Israeli-Palestinian Bereaved Families Forum the right to conduct activities in the education system as part of its GEFEN (Hebrew acronym for Flexible Pedagogical Management) programs.\n\nA strong and confident voice must rise up in the face of thugs such as MK Almog Cohen who threatens to “blow up” camps of the Bereaved Families Forum and in the face of Education Minister Yoav Kisch who seeks to get rid of partnership and coexistence content while promoting hateful anti-LGBTQ content and content delegitimizing members of the government and even encouraging pogroms perpetrated by fascist Jews. That voice needs to be heard not just from the Left, but from all elements of opposition and protest.\n\nIt must be a voice that is not afraid of labels or of smear campaigns and delegitimization from the Right and that fights for the right to see the other side as human beings – for the sake of ending the occupation and for the sake of strengthening Israeli democracy that the occupation has seeped into, and that could lead to its loss.\n\nThe writer is CEO in Israel of the American pro-Israeli lobby J Street, a former diplomat in the Israeli missions in Washington and Boston, and political adviser to the Israeli president."
    }
]