[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMitgFodHRwczovL3d3dy55YWtpbWFoZXJhbGQuY29tL25ld3MvbG9jYWwvdG9wcGVuaXNoLW1hdGVybml0eS1jZW50ZXItY2xvc3VyZS1oYXMtcmlwcGxlLWVmZmVjdC1vbi1mYW1pbGllcy1wcm92aWRlcnMtYW5kLXRoZS1jb21tdW5pdHkvYXJ0aWNsZV9jZDBhMGNiOC05NzdkLTExZWQtOTE2Ny0zMzE1YzM5NTI0NTAuaHRtbNIBugFodHRwczovL3d3dy55YWtpbWFoZXJhbGQuY29tL25ld3MvbG9jYWwvdG9wcGVuaXNoLW1hdGVybml0eS1jZW50ZXItY2xvc3VyZS1oYXMtcmlwcGxlLWVmZmVjdC1vbi1mYW1pbGllcy1wcm92aWRlcnMtYW5kLXRoZS1jb21tdW5pdHkvYXJ0aWNsZV9jZDBhMGNiOC05NzdkLTExZWQtOTE2Ny0zMzE1YzM5NTI0NTAuYW1wLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 08:00:00 GMT",
        "title": "Toppenish maternity center closure has ripple effect on families, providers and the community - Yakima Herald-Republic",
        "content": "Santiago Ochoa's reporting for the Yakima Herald-Republic is possible with support from Report for America and community members through the Yakima Valley Community Fund. For information on republishing, email news@yakimaherald.com."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5udXZvLm5ldC9uZXdzL3NvY2lldHlfaW5kaXZpZHVhbC9icm9hZC1yaXBwbGUtZmFtaWx5LWNlbnRlci1pcy1ub3ctb3Blbi9jb2xsZWN0aW9uX2M4ZjA5MDA0LTlhOTEtMTFlZC1hY2I3LThiOWJiNWU0MDg2Yy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 08:00:00 GMT",
        "title": "Broad Ripple Family Center is Now Open | Society & Individual | nuvo.net - NUVO",
        "content": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada\n\nZip Code"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm1hc2hlZC5jb20vMTE3NDkzMi90aGUtYWxkaS1jaGlwcy1yZWRkaXQtcHJlZmVycy1vdmVyLWJha2VkLXJ1ZmZsZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 08:00:00 GMT",
        "title": "The Aldi Chips Reddit Prefers Over Baked Ruffles - Mashed",
        "content": "The Aldi Chips Reddit Prefers Over Baked Ruffles\n\nWe may receive a commission on purchases made from links.\n\nPeople love Aldi. Whether it's for the cheaper prices or variety of goods, plenty of shoppers are turning to the alternative grocer for their everyday shopping needs. With the rapid rise of inflation over the past few years, it's easy to see why Aldi was on track to become the third largest grocer in the United States by the end of 2022, according to Forbes. But, it's not just the prices that are driving people to the international chain of grocery stores. Plenty of their products often surpass expectations, with many people claiming some items — such as Aldi branded ketchup, baked beans, and fig bars — are better than the original brands they're based on.\n\nMany people believe Aldi's products are imported because the chain originated in Germany. However, part of the reason Aldi's products are cost-effective is because it's helping local companies thrive. According to Finance Buzz, 90% of the store's products are Aldi-owned brands, and its fresh produce comes from the U.S. and, where possible, local growers. This means the chain can skip the middle man and Clancy's, Aldi's own chip brand, is able to offer items such as their version of Ruffles at a cheaper price than big-name brands. While Clancy's Ripples have been available for several years, people recently took to Reddit to compare the two chip products."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3NjaXRlY2hkYWlseS5jb20vcmV2ZWFsaW5nLXRoZS1zdGFydC1vZi10aW1lLWl0c2VsZi1yaXBwbGVzLWluLXRoZS1mYWJyaWMtb2YtdGhlLXVuaXZlcnNlLW1heS1wZWVyLWJhY2stdG8tdGhlLWJlZ2lubmluZy1vZi1ldmVyeXRoaW5nLXdlLWtub3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 11:44:58 GMT",
        "title": "Revealing the Start of Time Itself: Ripples in the Fabric of the Universe May Peer Back to the Beginning of Everything ... - SciTechDaily",
        "content": "Scientists have advanced in discovering how to use ripples in space-time known as gravitational waves to peer back to the beginning of everything we know. The researchers say they can better understand the state of the cosmos shortly after the Big Bang by learning how these ripples in the fabric of the universe flow through planets and the gas between the galaxies.\n\n“We can’t see the early universe directly, but maybe we can see it indirectly if we look at how gravitational waves from that time have affected matter and radiation that we can observe today,” said Deepen Garg, lead author of a paper reporting the results in the Journal of Cosmology and Astroparticle Physics. Garg is a graduate student in the Princeton Program in Plasma Physics, which is based at the U.S. Department of Energy’s (DOE) Princeton Plasma Physics Laboratory (PPPL).\n\nGarg and his advisor Ilya Dodin, who is affiliated with both Princeton University and PPPL, adapted this technique from their research into fusion energy, the process powering the sun and stars that scientists are developing to create electricity on Earth without emitting greenhouse gases or producing long-lived radioactive waste. Fusion scientists calculate how electromagnetic waves move through plasma, the soup of electrons and atomic nuclei that fuels fusion facilities known as tokamaks and stellarators.\n\nIt turns out that this process resembles the movement of gravitational waves through matter. “We basically put plasma wave machinery to work on a gravitational wave problem,” Garg said.\n\nGravitational waves, first predicted by Albert Einstein in 1916 as a consequence of his theory of relativity, are disturbances in space-time caused by the movement of very dense objects. They travel at the speed of light and were first detected in 2015 by the Laser Interferometer Gravitational Wave Observatory (LIGO) through detectors in Washington State and Louisiana.\n\nGarg and Dodin created formulas that could theoretically lead gravitational waves to reveal hidden properties about celestial bodies, like stars that are many light years away. As the waves flow through matter, they create light whose characteristics depend on the matter’s density.\n\nA physicist could analyze that light and discover properties of a star millions of light years away. This technique could also lead to discoveries about the smashing together of neutron stars and black holes, ultra-dense remnants of star deaths. They could even potentially reveal information about what was happening during the Big Bang and the early moments of our universe.\n\nThe research began without any sense of how important it might become. “I thought this would be a small, six-month project for a graduate student that would involve solving something simple,” Dodin said. “But once we started digging deeper into the topic, we realized that very little was understood about the problem and we could do some very basic theory work here.”\n\nThe scientists now plan to use the technique to analyze data in the near future. “We have some formulas now, but getting meaningful results will take more work,” Garg said.\n\nReference: “Gravitational wave modes in matter” by Deepen Garg and I.Y. Dodin, 10 August 2022, Journal of Cosmology and Astroparticle Physics.\n\nDOI: 10.1088/1475-7516/2022/08/017\n\nThis research was supported by the U.S. National Science Foundation through Princeton University."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYnJvb2tseW5yYWlsLm9yZy8yMDIyLzEyL2FydHNlZW4vTWF1cmVlbi1TdC1WaW5jZW50LVJpcHBsZS1IaXNz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 08:00:00 GMT",
        "title": "Maureen St. Vincent: Ripple Hiss – The Brooklyn Rail - Brooklyn Rail",
        "content": "Maureen St. Vincent, Price's Daughters, 2022. Soft pastel on paper with artist frame, 37 x 44 x 3/4 inches. Courtesy the artist and HESSE FLATOW, New York. Photo: Chris Grunder.\n\nOn View HESSE FLATOW\n\nNovember 10–December 22, 2022\n\nNew York\n\nMaureen St. Vincent’s six pastel drawings (all 2022) now on view at Hesse Flatow are surreal, grotesque, and seductive. Amoebas squirm and snails slide. In Biancabella and the Snake, a slender onyx serpent winds through a landscape of puffy pink or yellow biomorphs, its body cleaved improbably by an undulating vulva hovering at compositional center. In Price’s Daughters, a braided umbilical cord penetrates a six-fingered shell while its twin’s upper lobe bears a butterfly-shaped hole. Through this puncture an orange-trimmed background spills forth its blue insides, confounding the laws of space. Here, base organisms are pristine: nowhere do we find a slime trail’s glimmer.\n\n\n\nSt. Vincent spins through many such conceptual and formal inversions in these drawings, each of which is crowned by a hand-made, birch-composite frame that the artist designs, has fabricated elsewhere, then paints herself. The frames’ symmetrically curved shapes sometimes echo abstracted bisections of human body parts—heart, throat, butt, penis—or otherwise generically natural forms on scales at once molecular and full-size. St. Vincent wields this mutability of signs to her advantage, pursuing a capacious thematic terrain that the framed drawings forge into a conceptual whole. Look once and we are in Henri Matisse’s Joy of Life (1905–06). Look again to find in its place a weird landscape of reproductive organs. What first seemed an anthropomorphic sponge now reads as an erect slug. The works are willfully slippery, both ontologically and in the things they represent. Try to describe one and see.\n\n\n\nMaureen St. Vincent, Mom's Jewels, 2022. Soft pastel on paper with artist frame, 23 x 22 x 3/4 inches. Courtesy the artist and HESSE FLATOW, New York. Photo: Chris Grunder.\n\nArtist frames have been a hallmark of St. Vincent’s work since 2018, born of experimentation in the studio and a pivotal visit to the Jewish Museum’s 2017 exhibition of paintings by Florine Stettheimer, who was known for highly decorative frames. At up to eight inches wide on a side and painted in flaming orange or saccharine lilac, St. Vincent’s frames are here bolder than ever before. By foregrounding the architecture of her surroundings, the artist probes the nature of her drawings’ space and works through the various visual metaphors suggested by the outlines of the frame’s internal edges. The slightly swollen interior rectangle of Mom’s Jewels recalls a vintage television’s convex screen, for example, while the twinned oval apertures of Price’s Daughters evoke both the doubled reflections of fairytale mirrors and the binocularity of vision itself.\n\n\n\nThis latter trope seems especially apt because it allows St. Vincent to extinguish any expectation that visual scrutiny should result in immutable truths like those gained by looking through a microscope. It allows us to see that her worlds operate according to entirely different laws than those of positivist certainty and accompanying assumptions about bodily normalcy. St. Vincent replaces—and displaces—the authorized point of view with the unpredictability of her shape-shifting things’ next moves. More antiseptic representations of reproductive organs would demythologize female bodies, but here we find characters in a narrative. Tumescent and ripe, they might in a moment fold into decay. Or they might swell, burst, and release a thousand offspring. With this volatility they protect their power, deploying as a particular armor the refusal to disclose the nature of their systems.\n\n\n\nMaureen St. Vincent, Sister Slip, 2022. Soft pastel on paper with artist frame, 45 x 34 x 3/4 inches. Courtesy the artist and HESSE FLATOW, New York. Photo: Chris Grunder.\n\nThus St. Vincent grants her organisms autonomy within the amorphous terrain circumscribed by the dyads they spawn: endearing and gross, inside and out, gendered and not, evil and pure, humorous and serious, rococo and classical. There is a politics to making art that depicts non-sentient beings with self-sufficiency; even more obviously so in substituting snail-infested grapes for ovaries (as in Cleopatra’s Ovaries) in the same year the Supreme Court overturned the right to abortion. Yet it isn’t at all clear that those snails are a menace, which suggests the more significant and more subtle principle upon which St. Vincent’s works turn: they derive potency from operating on that razor thin edge where generalized suggestions become specific and therefore personal to each viewer. This is both the anthropologist’s task of making the strange familiar and a prime lesson of abstraction, which St. Vincent adopts profitably within the language of representation.\n\n\n\nThe drawings at Hesse Flatow are the least anthropomorphic ones she has made, the fluidly looped thighs of Sister Slip the sole indication of her prior works’ more forthrightly human bodies and feminine accoutrements. Keeping so many competing tensions in balance prevents the work from shading into sentimentality and didacticism on the one hand, or decoration on the other. This is no easy feat, and in its achievement the works drip with implication and promise.\n\n"
    }
]