[
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTIxL3NlYy1zaWduYWxzLWFwcGVhbC10by1jcnlwdG8tcmlwcGxlLXJ1bGluZy1pbi10ZXJyYS1yZXNwb25zZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "SEC Signals Appeal to Crypto Ripple Ruling in Response to Terra Case - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTIxL3NlYy1zaWduYWxzLWFwcGVhbC10by1jcnlwdG8tcmlwcGxlLXJ1bGluZy1pbi10ZXJyYS1yZXNwb25zZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "SEC Signals Appeal to Crypto Ripple Ruling in Response to Terra Case - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5sYXcuY29tL2xpdGlnYXRpb25kYWlseS8yMDIzLzA3LzIxL2xpdGlnYXRvcnMtb2YtdGhlLXdlZWstdGhlLWRlZmVuc2UtdGVhbS10aGF0LXNob3dlZC1yaXBwbGVzLXhycC1pc250LWluLWFuZC1vZi1pdHNlbGYtYS1zZWN1cml0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Expert Perspectives on Biggest Court Cases - Law.com",
        "content": "To view this content, please continue to their sites.\n\nLexisNexis® and Bloomberg Law are third party online distributors of the broad collection of current and archived versions of ALM's legal news publications. LexisNexis® and Bloomberg Law customers are able to access and use ALM's content, including content from the National Law Journal, The American Lawyer, Legaltech News, The New York Law Journal, and Corporate Counsel, as well as other sources of legal information.\n\nFor questions call 1-877-256-2472 or contact us at [email protected]"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9yaXBwbGUtc2VuZGkteW91bmctYWltcy1mb3ItdWstZmNhLW5vZC1hZnRlci11cy1jb3VydC13aW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Ripple Europe chief guns for UK licence after 'huge win' in US XRP case - DLNews",
        "content": "Ripple aims to expand in UK and Europe after win in US court.\n\nCompany still sees US as its global hub, and “we are going to continue growing exponentially” in Europe and the UK.\n\nRipple is aiming for a spot on the UK’s register of crypto companies, seizing on the region after a favourable court ruling against the US Securities and Exchange Commission.\n\nSendi Young, the crypto payments giant’s European managing director, told DL News it had “very recently” applied for registration as a crypto asset firm with the UK’s Financial Conduct Authority, and is preparing for a payment institution licence in Ireland.\n\nNOW READ: Ripple judge signals crypto rules won’t mimic those for stocks and bonds: ‘More of a win than I was expecting’\n\nRipple is riding high after a US judge ruled on July 13 that its sales of cryptocurrency XRP do not constitute investment contracts, boosting the token’s value by about 60% in the subsequent week.\n\nInvestors have interpreted the ruling as a sign that crypto may not fall under traditional regulations for trading stocks and bonds.\n\nNOW READ: SEC’s probe of puny BarnBridge DAO augurs deep DeFi crackdown\n\nYoung said the decision was a “huge win” and “positive for [the company’s] growth in the US.”\n\nStill, she added: “We haven’t turned around and said, ‘Let’s stop hiring in the UK.’ Our strategy and growth plans are intact and in place.\n\nJoin the community to get our latest stories and updates\n\n“We are in the process of applying for our crypto asset registration in the UK and our payments licence in Ireland. These are all massive investments with a view that we are going to continue growing exponentially in this region.”\n\nYoung declined to offer a numerical target for Ripple’s growth plans in the UK and Europe, but confirmed that the firm was still increasing its headcount and hiring for more than mission-critical roles.\n\nRipple has increased its UK and European employees by about 75% in the last 18 months, and now has more than 100 of about 900 global employees based in its offices in London, Dublin, and Reykjavik, Iceland.\n\nNOW READ: EU crypto chief vows to ‘strike the right balance’ as officials begin enforcing landmark MiCA law\n\n“I’m very excited to see the momentum ... The UK is starting to make good on its promises to try to be this investment hub for crypto space.”\n\nThe US ruling was not an unqualified success for Ripple, and a trial is to follow.\n\nAnalysing the result for DL News, Stephen Palley, a partner at Brown Rudnick’s Digital Commerce group, said it meant institutional sales were still securities transactions, while programmatic sales and distributions to employees were not.\n\nThat may eventually affect banks’ sales of crypto products, including derivatives. The court “punts” on whether secondary market sales are securities transactions, he added.\n\nRipple CEO Brad Garlinghouse has previously threatened to relocate the business outside of the US, should the SEC lawsuit not settle in the company’s favour.\n\nIn 2020, he suggested the firm could move to the UK.\n\nNOW READ: Meeting Gensler’s demands — how one crypto exchange took the ‘long complicated route’ to register with the SEC\n\nYoung said that Ripple’s position “has not changed” on the US as its global hub, but added that in the roughly two years since the SEC lawsuit was lodged, most of the firm’s expansion “has happened outside the US. I would only expect that the US will pick up and grow a lot more now.\n\n“Having said that, we are global, we have over 15 offices around the world,” she said.\n\n“We have made significant investment even way before the SEC filed a lawsuit because we look at demand, we look at where the opportunities are, and APAC is a very strong market, EMEA is obviously a very strong market. Our growth around the world will continue.”\n\nSpeaking more broadly about a recent crackdown on crypto firms by the SEC, Young said: “We’ve always found that regulation by enforcement is not a very productive and useful approach to encourage innovation or attract investment.”\n\nShe added that other jurisdictions including the UK and EU are “seeing this uncertainty in the US as an opportunity to step up and grab their share of these global companies.”\n\nAn earlier version of this article quoted Young as referring to the SEC’s “enforcement by action.” Ripple clarified and the article has been amended to reflect that Young meant “regulation by enforcement.” Ripple also clarified that it has not yet applied for a licence in Ireland, but that it is preparing to apply."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LnZlbGF3LmNvbS9pbnNpZ2h0cy9hLXN0dW1ibGluZy1ibG9jay1pbi10aGUtc2Vjcy1jcnlwdG8tY3JhY2tkb3duLXNlYy12LXJpcHBsZS1sYWJzLWluYy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "A Stumbling Block in the SEC’s Crypto Crackdown: SEC v. Ripple Labs, Inc. | Insights - Vinson & Elkins LLP",
        "content": "On July 13, 2023, a decision by Federal District Judge Analisa Torres of the Southern District of New York dealt a significant blow to the Securities and Exchange Commission’s enforcement efforts in the crypto space by holding that Ripple Labs, Inc.’s sale of crypto tokens on public exchanges was not a sale of unregistered securities because, in that situation, the tokens themselves were not securities. 1 While the decision is undoubtedly a win for the crypto industry, Judge Torres did side with the SEC on one of the three categories of sales under consideration, holding that Ripple did sell unregistered securities when it sold the same crypto tokens directly to institutional investors. 1 The SEC seems likely to appeal the decision, which will surely not be the last word on the critical question of when cryptocurrency constitutes a “security” subject to regulation under the federal securities laws. And, further, other courts charged with determining similar issues could come to different conclusions.\n\nRipple’s XRP Sales and the Howey Test\n\nIn 2020, the SEC brought an enforcement action against Ripple, alleging that the firm had sold its XRP crypto tokens as unregistered securities in violation of the securities laws. Relying on well-established precedent from SEC v. W.J. Howey Co., 2 the SEC argued that Ripple’s sales of XRP qualified as investment contracts and, thus, as securities subject to the SEC’s registration requirements. In her July 13th decision, Judge Torres rejected a significant portion of the SEC’s argument.\n\nUnder the Howey test, XRP would be sold as investment contracts if a purchaser “(1) invests his money (2) in a common enterprise and (3) is led to expect profits solely from the efforts of the promoter or a third party.” Applying Howey, the Court considered three different categories of Ripple’s XRP sales:\n\nProgrammatic Sales: Ripple sold roughly $757.6 million of XRP through different digital asset exchanges. These sales were typically “blind bid/ask transactions,” where buyers and sellers conducted transactions through trading algorithms that did not identify the buyer or seller of the tokens. Institutional Sales: Ripple sold roughly $728.9 million of XRP directly to institutional investors, such as hedge funds or institutional buyers. Other Distributions: Ripple distributed XRP as a form of payment for third-party services and employee compensation.\n\nThe Court considered each of the three transaction categories under Howey and, ultimately, concluded that the Programmatic Sales and Other Distributions were not investment contracts, while the Institutional Sales were investment contracts. The Court also concluded that XRP sales on digital asset exchanges by Ripple’s Chairman Christian Larsen and CEO Bradley Garlinghouse were not investment contracts.\n\nProgrammatic Sales On Public Exchanges Are Not Investment Contracts\n\nIn a major win for the crypto industry, the Court held that the Programmatic Sales on public exchanges were not investment contracts and thus were not subject to the SEC’s registration requirements. It reasoned that these XRP sales did not pass the third element of the Howey test, in that the programmatic purchasers could not “reasonably expect that Ripple would use the capital it received from its [programmatic] sales to improve the XRP ecosystem and thereby the price of XRP.” Importantly, the Programmatic Sales were “blind bid/ask transactions,” and thus the purchasers would not have known if their money went to Ripple or any other seller of XRP. Ripple’s own sales of XRP accounted for less than 1% of the global trading volume of XRP, so a purchaser could not reasonably predict if its purchase money went to Ripple or any other seller.\n\nWhile the SEC tried to argue that the Programmatic Sales of XRP were an investment contract since Ripple “explicitly targeted speculators,” the Court rejected this argument, holding that a purchaser’s potentially speculative motive was not in and of itself enough to show the existence of an “investment contract” under the securities laws.\n\nFurther, the Court reasoned that the Programmatic Sales were not made pursuant to any contracts restricting the resale or end-use of the crypto tokens. Thus, these purchasers could have been buying XRP for either investment purposes or for consumptive purposes, such as use as a currency. Finally, there was no evidence that Ripple sent broadly to the general public any promotional materials that linked its business efforts to the success of XRP.\n\nLike Ripple’s Programmatic Sales, Larsen’s and Garlinghouse’s XRP sales on various digital asset exchanges, also through blind bid/ask transactions, were programmatic sales. Accordingly, the Court held that these sales were likewise not investment contracts under the third element of the Howey test.\n\nSales To Institutional Investors Are Investment Contracts\n\nOn the other hand, the Court held that the Institutional Sales met every element of the Howey test and therefore the XRP tokens were securities in that context, and thus their sale was an unregistered offer and sale of securities. With respect to the third element, the Court held that institutional investors “would have purchased XRP [from Ripple] with the expectation that they would derive profits from Ripple’s efforts.” In support of this conclusion, the Court cited Ripple’s distribution of marketing materials to potential investors that tied Ripple’s business model to the success of the XRP currency, with one brochure stating that Ripple’s “business model is predicated on a belief that demand for XRP will increase . . . if the Ripple protocol becomes widely adopted.” In addition, the Court noted a Reddit post from one of Ripple’s own senior leaders stating that Ripple’s interests were closely tied to those of XRP holders and that Ripple had a “team of dedicated professionals” that are “develop[ing] an ecosystem around XRP.” Similarly, Garlinghouse had stated that “Ripple is very, very interested in the success and health of the [XRP] ecosystem and will continue to invest in the ecosystem.” Taking all this evidence together, along with other similar statements, the Court held that institutional investors would have clearly understood that Ripple was promoting XRP as a way to generate income it would then invest in the ecosystem of XRP with the goal of increasing its value.\n\nFurther, the Court found that the sales contracts between Ripple and institutional investors demonstrated that institutional investors were purchasing XRP as an investment rather than for consumptive use. These contracts had certain “lockup provisions” and “resale restrictions” that were inconsistent with the use of XRP as a currency or any other consumptive purpose. For example, one contract stated that the institutional investor was purchasing XRP “solely to resell or otherwise distribute” rather than use XRP as an end user.\n\nOther Distributions Are Not Investment Contracts\n\nThe Court held that the Other Distributions were not investment contracts, but for a different reason than the Programmatic Sales. According to Judge Torres, these distributions did not satisfy the first prong of the Howey test (i.e., investment of money) since the XRP recipients did not invest any money or other “tangible and definable consideration” to receive their crypto tokens.\n\nA Dramatic Response and An Uncertain Future\n\nThis first-of-its-kind case is a significant obstacle for the SEC’s recent crackdown on the crypto industry and has so far proven to be a boon for crypto investors. In the immediate wake of the decision, the price of XRP rose substantially, and many crypto exchanges have taken steps to relist XRP for trading in the U.S.\n\nBut the decision’s long-term impact remains to be seen. While the SEC has stated that it is still assessing the Court’s holding as it relates to the Programmatic Sales, it may well seek to appeal the decision. SEC Chair Gary Gensler recently noted that he was disappointed in this aspect of the Court’s ruling, and emphasized that the SEC will continue its enforcement focus in the crypto space. In addition, while influential, the decision is not binding on other judges, and other courts faced with the issue of when crypto tokens are securities within the meaning of the federal securities laws — such as the judges considering the SEC’s recent actions against several crypto trading platforms — could come out a different way. Accordingly, crypto investors and industry participants should continue to proceed with caution and monitor further developments in this quickly evolving area of the law.\n\n1 SEC v. Ripple Labs, Inc., 20 Civ. 10832 (AT), 2023 WL 4507900 (S.D.N.Y. July 13, 2023), available at https://www.nysd.uscourts.gov/sites/default/files/2023-07/SEC%20vs%20Ripple%207-13-23.pdf.\n\n2 SEC v. W.J. Howey Co., 328 U.S. 293 (1946)."
    }
]