[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS1vbi10aGUtdmVyZ2Utb2YtYnVybmluZy1hbGwteHJwLWhlbGQtaW4tZXNjcm93LXdhbGxldHMtc2F5LWZvcm1lci1yaXBwbGUtZGlyZWN0b3Iv0gF4aHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvcmlwcGxlLW9uLXRoZS12ZXJnZS1vZi1idXJuaW5nLWFsbC14cnAtaGVsZC1pbi1lc2Nyb3ctd2FsbGV0cy1zYXktZm9ybWVyLXJpcHBsZS1kaXJlY3Rvci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Ripple On the Verge of Burning All XRP Held in Escrow Wallets Say Former Ripple Director - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nFormer Ripple Director Matt Hamilton dropped a bombshell, stating that Ripple might have the power to burn all the XRP tokens locked away in its escrow wallets. This revelation injects a fresh dose of complexity into Ripple’s ongoing legal tussle with the SEC.\n\nRipple’s Hidden Power to Burn\n\nHamilton, a former Ripple Principal Developer Advocate, shared his insights on the ongoing litigation. He suggested that Ripple, with its technical prowess, could make its future escrow funds practically untouchable by disabling the master key for the accounts set to receive the escrowed tokens.\n\nThis concept of “burning” XRP introduces a novel dynamic, making the tokens essentially unusable, even to Ripple itself.\n\nLegal Ramifications\n\nThe concept of burning XRP tokens took center stage following the SEC’s request to destroy LBRY Credits (LBC) tokens in a recent lawsuit. This sparked a debate within the XRP community, questioning whether Ripple could be compelled to burn the XRP in its escrow.\n\nMeanwhile, Ripple’s CTO, David Schwartz, entered the discussion, noting that while neither the court nor the SEC may have direct authority, consensus among XRPL validators could enforce such action.\n\nPro-XRP lawyer Bill Morgan added insights, emphasizing that a court order wouldn’t automatically bind XRPL validators, requiring a legal hearing for enforcement. This aligns with Ripple CEO Brad Garlinghouse’s prior statement in April 2021, suggesting the consideration of burning XRP tokens in specific scenarios for the benefit of the broader XRP ecosystem.\n\nAs Ripple navigates legal complexities, the potential decision to burn XRP tokens introduces a new dimension to its ongoing saga."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzIxL2NlbnRyYWwtYmFuay1vZi1pcmVsYW5kLWFkZHMtcmlwcGxlLXRvLWxpc3Qtb2YtcmVnaXN0ZXJlZC12aXJ0dWFsLWFzc2V0LXNlcnZpY2UtcHJvdmlkZXJzL9IBf2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzIxL2NlbnRyYWwtYmFuay1vZi1pcmVsYW5kLWFkZHMtcmlwcGxlLXRvLWxpc3Qtb2YtcmVnaXN0ZXJlZC12aXJ0dWFsLWFzc2V0LXNlcnZpY2UtcHJvdmlkZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Central Bank of Ireland Adds Ripple to List of Registered Virtual Asset Service Providers - The Daily Hodl",
        "content": "Blockchain-based payments firm Ripple Labs can now provide certain digital asset services in Ireland.\n\nIn a new statement, the San Francisco-based firm says the Central Bank of Ireland (CBI) has just granted its local subsidiary, Ripple Markets Ireland Limited, the license to operate as a Virtual Asset Service Provider (VASP).\n\nVASPs can carry out transactions involving crypto assets — including exchanges, transfers, wallet custody and crypto-related financial services — on behalf of clients.\n\nSays Ripple vice president of strategic initiatives, Eric van Miltenburg,\n\n“Ireland has positioned itself as a supportive jurisdiction for the virtual assets industry and consequently as a great place for businesses like Ripple’s to operate, reinforcing our decision to select Ireland as our primary base for EU regulation.\n\nBy providing regulatory clarity for the industry, Ireland – and the EU more broadly – are boosting confidence in the digital assets, payments and fintech ecosystem and demonstrating their commitment to the long-term development of these industries.”\n\nThe CBI says it grants the VASP license to firms with satisfactory anti-money laundering and combating the financing of terrorism (AML/CFT) policies and procedures following a risk-based assessment process.\n\nOther firms on the central bank’s VASP register include the crypto exchanges Coinbase and Gemini and the online payments company Paysafe.\n\nRipple says it is now aiming to operate in more jurisdictions in Europe.\n\n“Ripple will seek to provide services to clients across the European Economic Area once the Markets in Crypto Assets Regulation (MiCA) comes into force at the end of 2024, subject to the acquisition of other necessary licenses.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1yaXBwbGUtZXhwYW5kcy1pbnRvLWlyZWxhbmQtd2l0aC1hbi1leWUtb24tZXVyb3BlLTEzOTc0MjjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "XRP News: Ripple Expands into Ireland with an Eye on Europe - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvZGVlcGZha2UtdmlkZW8tZmVhdHVyaW5nLXJpcHBsZS1jZW8tYXNraW5nLWZvci14cnAtY2lyY3VsYXRlcy1vbi15b3V0dWJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 13:14:00 GMT",
        "title": "Deepfake Video Featuring Ripple CEO Asking For XRP Circulates on YouTube - BSC NEWS",
        "content": "WEB3\n\nIn the video, a fabricated Ripple CEO Brad Garlinghouse encourages XRP holders to send their tokens to a designated wallet, promising to return double the amount in what appears to be a deceptive giveaway.\n\nA deepfake video has surfaced on YouTube, raising concerns within the crypto community as it depicts a digital imitation of Brad Garlinghouse, the CEO of Ripple, making an unrealistic request to XRP holders. The video encourages users to send their XRP tokens to a specified digital wallet with the promise of receiving double the amount in return – a tactic commonly used by online scammers.\n\nMembers of Reddit noticed the deepfake video, which shows an AI-generated Garlinghouse and invites viewers to participate in an XRP event. However, the catch is that participants are asked to send their tokens to a \"designated address\" for a supposed giveaway where the character pledges to return double the amount.\n\nReddit commentators first brought attention to this misleading advertisement on YouTube between November 25 and December 3. Despite user flags and reports, the deceptive ad has persisted on the platform. Redditors shared an unlisted link to the deepfake ad on YouTube, cautioning the community to avoid interacting with the video's QR code to prevent potential financial losses.\n\n‍\n\nRipple Executive's Prior Warning\n\nThis incident follows a warning from Ripple’s Chief Technology Officer, David Schwartz, issued on July 14. Following a court ruling in favor of Ripple in its battle with the Securities and Exchange Commission (SEC), Schwartz emphasized that there were no associated airdrops, giveaways, or special offers linked to the judgment. This recent deepfake video mirrors the scam tactics Schwartz cautioned against.\n\nRipple CEO Brad Garlinghouse, no stranger to such deepfake scams, had previously highlighted the growing trend of such videos on YouTube. In the past, scammers overlaid new words onto old video footage from Ripple's events, creating deceptive content. Garlinghouse called out YouTube, questioning if the video-hosting service was \"asleep at the wheel again\" and urged users to be vigilant against circulating messages.\n\nIn light of these events, Garlinghouse emphasized that only approved messages from official Ripple accounts could be considered authentic, underscoring the need for caution and verification in the face of potential scams.\n\nDespite clear evidence of the video's fraudulent nature, a Reddit participant revealed that Google refused to remove the deceptive ad. The feedback from Google's Trust and Safety team suggested that the ad did not violate their protocols."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vcGh5cy5vcmcvbmV3cy8yMDIzLTEyLWFzdHJvbm9tZXJzLXNlaXNtaWMtcmlwcGxlcy1hbmNpZW50LWdhbGFjdGljLmh0bWzSAU5odHRwczovL3BoeXMub3JnL25ld3MvMjAyMy0xMi1hc3Ryb25vbWVycy1zZWlzbWljLXJpcHBsZXMtYW5jaWVudC1nYWxhY3RpYy5hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Astronomers detect seismic ripples in ancient galactic disk - Phys.org",
        "content": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nIllustration of a galaxy disk being disturbed. Credit: Jonathan Bland-Hawthorn and Thorsten Tepper-Garcia/University of Sydney.\n\nA new snapshot of an ancient, far-off galaxy could help scientists understand how it formed and the origins of our own Milky Way. At more than 12 billion years old, BRI 1335-0417 is the oldest and furthest known spiral galaxy in our universe.\n\nLead author Dr. Takafumi Tsukui said the state-of-the-art telescope ALMA allowed them to look at this ancient galaxy in much greater detail.\n\n\"Specifically, we were interested in how gas was moving into and throughout the galaxy,\" Dr. Tsukui said. \"Gas is a key ingredient for forming stars and can give us important clues about how a galaxy is actually fueling its star formation.\"\n\nIn this case, the researchers were able to not only capture the motion of the gas around BRI 1335-0417, but also reveal a seismic wave forming—a first in this type of early galaxy. The study has been published in Monthly Notices of the Royal Astronomical Society.\n\nThe galaxy's disk, a flattened mass of rotating stars, gas and dust, moves in a way not dissimilar to ripples spreading on a pond after a stone is thrown in.\n\n\"The vertically oscillating motion of the disk is due to an external source, either from new gas streaming into the galaxy or by coming into contact with other smaller galaxies,\" Dr. Tsukui said. \"Both possibilities would bombard the galaxy with new fuel for star formation.\n\n\"Additionally, our study revealed a bar-like structure in the disk. Galactic bars can disrupt gas and transport it towards the galaxy's center. The bar discovered in BRI 1335-0417 is the most distant known structure of this kind. Together, these results show the dynamic growth of a young galaxy.\"\n\nBecause BRI 1335-0417 is so far away, its light takes longer to reach Earth. The images seen through a telescope in the present day are a throwback to the galaxy's early days—when the universe was just 10% of its current age.\n\n\"Early galaxies have been found to form stars at a much faster rate than modern galaxies. This is true for BRI 1335-0417, which, despite having a similar mass to our Milky Way, forms stars at rate a few hundred times faster,\" co-author Associate Professor Emily Wisnioski said.\n\n\"We wanted to understand how gas is supplied to keep up with this rapid rate of star formation.\n\n\"Spiral structures are rare in the early universe, and exactly how they form also remains unknown. This study also gives us crucial information on the most likely scenarios.\n\n\"While it is impossible to observe the galaxy's evolution directly, as our observations only give us a snapshot, computer simulations can help piece the story together.\""
    }
]