[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMDEvc29tZS1jcnlwdG8tYXNzZXRzLWFyZS1zZWN1cml0aWVzLWluLWt3b24tbHVuYS1jYXNlLW1hbmhhdHRhbi1qdWRnZS5odG1s0gFsaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDgvMDEvc29tZS1jcnlwdG8tYXNzZXRzLWFyZS1zZWN1cml0aWVzLWluLWt3b24tbHVuYS1jYXNlLW1hbmhhdHRhbi1qdWRnZS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Some crypto assets are securities, Manhattan judge says, complicating Coinbase and Ripple cases - CNBC",
        "content": "Hon Chang-joon, business partner of Do Kwon, the cryptocurrency entrepreneur who created the failed Terra (UST) stablecoin, is taken to court in Podgorica, Montenegro, March 24, 2023.\n\nA Manhattan federal judge said in an opinion that cryptocurrencies are considered securities regardless of how they are sold. It allows the Securities and Exchange Commission to pursue securities charges against Terraform Labs and its founder Do Kwon and has broad ramifications for crypto legislation and litigation.\n\nU.S. District Judge Jed Rakoff's decision Monday complicates SEC's litigation with both Ripple and crypto exchange Coinbase.\n\nThe SEC had alleged that Coinbase engaged in the unregistered offer and sale of securities. Coinbase strongly denies that it has listed any crypto asset securities. Coinbase shares are down about 4,5% in Tuesday trading.\n\nThe opinion contradicts an earlier ruling from the same district court that said ripple , another cryptocurrency, may not be categorized as a security in all circumstances. It will not impact the prior opinion.\n\nThe Ripple ruling was considered a win by the industry because it said a cryptocurrency may or may not be a security depending on who's buying it. The SEC has argued in cases against Binance, Coinbase and Kraken that many cryptocurrencies listed on popular exchanges are securities.\n\n\"The Court declines to draw a distinction between these coins based on their manner of sale, such that coins sold directly to institutional investors are considered securities and those sold through secondary market transactions to retail investors are not,\" Rakoff said of the prior ruling in the Ripple case. \"In doing so, the Court rejects the approach recently adopted by another judge of this district in a similar case.\"\n\nKwon and Terraform Labs are accused of committing a massive fraud upon investors through the unregistered offer and sale of multiple cryptoassets, including luna and a stablecoin called terraUSD.\n\nThe opinion from Rakoff also lends support to arguments from some lawmakers, who have said that crypto legislation is needed to clarify the role of regulators and the courts over crypto markets.\n\nThe SEC has pursued numerous other crypto firms over the alleged unregistered offer and sale of securities, including Coinbase , Gemini and Genesis.\n\n— CNBC's Lora Kolodny contributed to this report."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMDEvc29tZS1jcnlwdG8tYXNzZXRzLWFyZS1zZWN1cml0aWVzLWluLWt3b24tbHVuYS1jYXNlLW1hbmhhdHRhbi1qdWRnZS5odG1s0gFsaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDgvMDEvc29tZS1jcnlwdG8tYXNzZXRzLWFyZS1zZWN1cml0aWVzLWluLWt3b24tbHVuYS1jYXNlLW1hbmhhdHRhbi1qdWRnZS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Some crypto assets are securities, Manhattan judge says, complicating Coinbase and Ripple cases - CNBC",
        "content": "Hon Chang-joon, business partner of Do Kwon, the cryptocurrency entrepreneur who created the failed Terra (UST) stablecoin, is taken to court in Podgorica, Montenegro, March 24, 2023.\n\nA Manhattan federal judge said in an opinion that cryptocurrencies are considered securities regardless of how they are sold. It allows the Securities and Exchange Commission to pursue securities charges against Terraform Labs and its founder Do Kwon and has broad ramifications for crypto legislation and litigation.\n\nU.S. District Judge Jed Rakoff's decision Monday complicates SEC's litigation with both Ripple and crypto exchange Coinbase.\n\nThe SEC had alleged that Coinbase engaged in the unregistered offer and sale of securities. Coinbase strongly denies that it has listed any crypto asset securities. Coinbase shares are down about 4,5% in Tuesday trading.\n\nThe opinion contradicts an earlier ruling from the same district court that said ripple , another cryptocurrency, may not be categorized as a security in all circumstances. It will not impact the prior opinion.\n\nThe Ripple ruling was considered a win by the industry because it said a cryptocurrency may or may not be a security depending on who's buying it. The SEC has argued in cases against Binance, Coinbase and Kraken that many cryptocurrencies listed on popular exchanges are securities.\n\n\"The Court declines to draw a distinction between these coins based on their manner of sale, such that coins sold directly to institutional investors are considered securities and those sold through secondary market transactions to retail investors are not,\" Rakoff said of the prior ruling in the Ripple case. \"In doing so, the Court rejects the approach recently adopted by another judge of this district in a similar case.\"\n\nKwon and Terraform Labs are accused of committing a massive fraud upon investors through the unregistered offer and sale of multiple cryptoassets, including luna and a stablecoin called terraUSD.\n\nThe opinion from Rakoff also lends support to arguments from some lawmakers, who have said that crypto legislation is needed to clarify the role of regulators and the courts over crypto markets.\n\nThe SEC has pursued numerous other crypto firms over the alleged unregistered offer and sale of securities, including Coinbase , Gemini and Genesis.\n\n— CNBC's Lora Kolodny contributed to this report."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNhbnIubXN1LmVkdS9uZXdzL3JpcHBsZS1wYXJ0bmVycy13aXRoLW1vdG9yLWNpdHktYXF1YXJpdW0tc29jaWV0eS10by1ob3N0LWV4b3RpYy1maXNoLXN1cnJlbmRlci1ldmVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "RIPPLE partners with Motor City Aquarium Society to host Exotic Fish Surrender Event - Michigan State University",
        "content": "RIPPLE partners with Motor City Aquarium Society to host Exotic Fish Surrender Event\n\nDo you have aquarium or water garden pets you can no longer care for? Surrender unwanted freshwater fish, crayfish, snails, and plants at the first-ever RIPPLE surrender event August 10 in Warren.\n\nThe Reduce Invasive Pet and Plant Escapes program (RIPPLE) is partnering with the Motor City Aquarium Society to host a free Exotic Fish Surrender Event on August 10, 2023, from 7-9 p.m. The public is welcome to surrender common freshwater aquarium and water garden species including fish, plants, crayfish, and snails for free. No other species will be accepted such as small mammals, reptiles, or amphibians. The event will take place during the aquarium society’s monthly meeting held at 30140 Van Dyke Ave Warren, MI 48093. Surrendered species will be given new homes thanks to Fishy Bizz and Chris’s Pet Shop, two RIPPLE-recognized Fresh Water Protector retailers.\n\nThe goal of the event is to offer a safe and environmentally friendly alternative to releasing aquarium and water garden pets into Michigan’s lakes and streams. Many plants and animals found in aquariums and backyard ponds have been imported from other parts of the world and while they are fun to enjoy, they can be harmful and invasive if they are released into the wild. Popular non-native plants and fish are bred to grow quickly and be environmentally hardy, making them excellent additions to household aquariums and water features but sometimes detrimental if introduced to our native ecosystems. It is never safe to release unwanted water garden or aquarium plants and animals into natural waterways.\n\nMichigan State University Extension has fostered strong partnerships with pet and garden retailers to reach as many aquarium and pond owners as possible with the Reduce Invasive Pet and Plant Escapes (RIPPLE) program. Through RIPPLE, retailers are supplied free products to display in their store and handouts for customers, stressing the importance of not releasing species into the wild.\n\nRIPPLE's education initiatives are coordinated by Michigan State University Extension in partnership with the Michigan Department of Environment, Great Lakes and Energy, Michigan Department of Natural Resources and the Michigan Department of Agriculture and Rural Development. RIPPLE is funded by the Michigan Invasive Species Grant Program.\n\nAdditional details about the event can be found at https://www.canr.msu.edu/events/ripple-exotic-fish-surrender-event. Questions can be directed to Paige Filice at filicepa@msu.edu."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3RlcnJhZm9ybS1sYWJzLW9waW5pb24tcmlwcGxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Terraform Labs opinion rains on Ripple decision parade - Blockworks",
        "content": "The crypto industry has been in high spirits after a federal judge ruled that programmatic sales of Ripple’s XRP token are not classified as securities. A dueling opinion from a different federal judge issued Monday however may burst crypto fans’ bubble.\n\nIn a 50-page opinion denying Terraform Labs’ motion to dismiss the SEC’s complaint, Federal Judge Jed Rakoff strayed from the line of reasoning established in Ripple’s case. All purchasers, regardless of if they were institutional buyers or re-sale purchases, had a reasonable expectation for profit, Rakoff said.\n\nJudge Analisa Torres, who serves the Southern District of New York alongside Judge Rakoff, ruled in the Ripple v. SEC case last month that although Ripple’s initial institutional offering of XRP tokens was a securities offering, the programmatic sales of XRP — for example, sales on an exchange — were not.\n\nTorres’ rationale was that people who bought XRP on exchanges had no way of knowing whether their capital contributions benefited Ripple.\n\n“The vast majority of individuals who purchased XRP from digital asset exchanges did not invest their money in Ripple at all,” Torres wrote in her opinion. “An Institutional Buyer knowingly purchased XRP directly from Ripple pursuant to a contract, but the economic reality is that a Programmatic Buyer stood in the same shoes as a secondary market purchaser who did not know to whom or what it was paying its money.”\n\nRead more: Ripple has cracked the SEC’s exterior — sit back and watch it crumble\n\nTorres notably did not make a ruling on secondary sales as whole, as this was not a question before the court. Her ruling was on the matter of programmatic sales.\n\nRadkoff disagreed, however. He argued in the Terraform Labs case that all sales of tokens, regardless of venue, went toward building the Terraform blockchain and generating profit for all holders.\n\n“These representations would presumably have reached individuals who purchased their crypto assets on secondary markets and indeed motivated those purchases as much as it did institutional investors,” Radkoff wrote.\n\nLegal experts were not shocked that the two judges came to different conclusions, and they warned industry members to be wary of both, as neither sets a precedent.\n\n“Even before the Terraform ruling this week, the enthusiasm in the crypto market following the Ripple rulings was overblown in light of the substance of the rulings themselves,” said Joe Castelluccio, head of fintech and digital assets, blockchain and crypto at Mayer Brown.\n\n“The Terraform ruling underscores that there are many ongoing enforcement actions alleging that the sale or trading of certain digital assets constitutes a violation of the Securities Act and other US laws.”\n\nMark Hiraide, a partner at Mitchell Silberberg & Knupp, agreed, adding that Torres’ unusual take was particularly remarkable.\n\n“We’ve had basically 90 years worth of federal securities jurisprudence,” Hiraide said. “So that was what was so surprising about Judge Torres’ [summary judgment], in my view, it was an unprecedented application of Howey.”\n\nNeither Torres’ nor Radkoff’s opinions set a precedent for future cases. Either case must go to trial and then be appealed to the second circuit court to establish a precedent within the circuit. Courts in different circuits are not obligated to follow the ruling.\n\n“As far as the possibility that other judges all over the country are going to make their own decisions, unfortunately, that’s always the case,” Hiraide added.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbmdlZWsuY29tL2p1ZGdlLWluLXNlYy12LXJpcHBsZS13YXMtd3JvbmctdG8tc2F5LXNlY29uZGFyeS1zYWxlcy1hcmVudC1zZWN1cml0aWVzLWNvdXJ0LXJ1bGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Judge in SEC v Ripple was wrong to say secondary sales aren't securities, court rules - CoinGeek",
        "content": "The judge in charge of the Securities and Exchange Commission’s (SEC) case against Do Kwon and Terraform labs has poured cold water over last month’s ruling in SEC v Ripple, rejecting the court’s approach in that case as being inconsistent with the Howey test and suggesting that secondary sales can amount to illegal securities transactions after all.\n\nDo Kwon and Terraform, who are being sued by the SEC for illegally offering securities, hoped to have the SEC’s case thrown out by relying on the recent ruling in Ripple in which the court found that XRP sold on exchanges via programmatic sales were not securities because the buyer could not know whether their money went to Ripple or any other third party. Due to this, the court ruled that the sales did not meet the third prong of the Howey test—the expectation of profits derived from the efforts of others.\n\nOn Monday, however, the court in the Terraform case explicitly rejected the court’s reasoning in Ripple, saying, “Howey makes no such distinction between purchasers.” As a result, the lawsuit against Do Kwon and Terraform Labs will proceed.\n\nSecondary market sales can still amount to securities offerings, judge rules\n\nThe judge pointed out that Terraform and Do Kwon had embarked on a marketing campaign to encourage all investors to buy their digital assets, advertising that the proceeds from all sales would be fed back into the Terraform blockchain and generate returns for all holders.\n\n“That a purchaser bought the coins directly from the defendants or, instead, in a secondary re-sale transaction has no impact on whether a reasonable individual would objectively view the defendants’ actions and statements as evincing a promise of profits based on their efforts,” the federal judge stated.\n\nThe court’s reasoning would mean that secondary market sales of digital assets can amount to securities offerings. If a digital asset company promotes its tokens on the basis that the money contributed would be used to further develop their network and increase profits for holders, it doesn’t matter whether the ultimate user purchases the tokens directly or via a secondary exchange:\n\n“Simply put, secondary-market purchasers had every bit as good reason to believe that the defendants would take their capital contributions and use it to generate profits on their behalf.”\n\nFair notice defense struck down yet again\n\nThe defendants also tried their luck with a fair notice defense, which has become an indispensable part of the digital asset delinquent’s armory. A fair notice defense is available in some circumstances where a defendant can prove they lacked fair notice that their conduct violated the law. It has predictably been used by companies facing regulatory action over listing digital asset securities. The arguments generally run along these lines: the SEC has previously indicated that digital assets are not securities or, worse, given no indication at all, and therefore bringing an enforcement action over the listing of digital asset securities is without fair notice.\n\nBut of course, the SEC has never said that all digital assets are not securities. Nor does the absence of any catch-all guidance mean that defendants lacked fair notice, given the fact that the ever-flexible Howey test has been applied to new types of asset offerings for decades without incident.\n\n“In short, defendants’ attempt to manufacture a ‘fair notice’ problem here comes down to asserting the SEC’s position in this litigation is inconsistent with a position that the SEC never adopted,” the judge said.\n\nThe judge found that the SEC has consistently expressed the position that some digital assets may fall within the regulatory ambit of federal securities laws, pointing to guidance issued by the SEC in April 2019 which warned against offering digital assets without considering whether they amount to securities.\n\nThe judge further said that even ignoring that, the fact that the SEC has already spent years pursuing digital asset companies for illegally offering securities would have provided ample notice to anyone who might have otherwise been confused by a lack of specific guidance.\n\nWhere does this leave XRP v Ripple?\n\nThe judge overseeing the Ripple case dismissed the prospect that secondary market and programmatic sales could amount to securities offerings. Still, this latest ruling in Terraform comes from a judge of equal authority. This means that until a higher court considers the issue—such as via an appeal—the judicial position concerning secondary and programmatic digital asset sales is murky.\n\nIt does, however, put the gloating by XRP that it had secured a landmark victory against the SEC in a rather humorous light.\n\nShould this latest conception of Howey be adopted by other judges, the exact manner in which a purchaser acquired their digital assets would no longer be a barrier to a finding that the initial issuers were engaging in illegal securities offerings, even with respect to secondary market sales. What matters is what a person would have reasonably understood based on the communications of the offerors. If the person buying a digital asset from a secondary exchange would have reasonably understood that their purchase would flow back to the creators and be used to further develop the network, then that’s all that is required to meet the Howey test.\n\nThis is likely to embolden the SEC in any appeal of the ruling in Ripple. It’s also likely to embolden the SEC in any future actions it takes, where sales of digital assets on the secondary market might still yet be considered illegal digital asset securities offerings.\n\nFollow CoinGeek’s Crypto Crime Cartel series, which delves into the stream of group—from BitMEX to Binance, Bitcoin.com, Blockstream, ShapeShift, Coinbase, Ripple,\n\nEthereum, FTX and Tether—who have co-opted the digital asset revolution and turned the industry into a minefield for naïve (and even experienced) players in the market.\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    }
]