[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmJldmluZHVzdHJ5LmNvbS9hcnRpY2xlcy85NTU0Ni1yaXBwbGVzLWluYy11bnZlaWxzLWNoYW5naW5nLXByaW50LWNvbG9yLWZlYXR1cmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Ripples Inc. unveils changing print color feature - Beverage Industry",
        "content": "A new beverage-top printer was recently released by Ripples. The Ripple Maker II Pro features food technology with naturally changing print colors that quench rising consumer demand for novel drink experiences, the company says. Made with flavorless cabbage extract, the patent-pending Chameleon Plus pods alter to a drink’s pH level, then print a variety of blue- and red-based hues. The color all depends on the beverage acidity or alkalinity. “Gen Y and even more so Gen Z keep food and beverage businesses on their toes by raising expectations for innovation, personalization and sustainability,” Yossi Meshulam, Ripples’ CEO, said in a statement. “The Ripple Maker II Pro was created with these audiences in mind. We wanted to elevate their food and beverage experiences and give them eye-catching reasons to share their moments on social media.” The Ripple Maker II Pro features dual pod holders for printing two colors on one drink, as well as an automated sensor tech that can identify cup dimensions for a perfectly centered print without user intervention. The system was upgraded to ensure fast operational workflow, it says. The full product line at Ripples uses completely plant-based printing pods.\n\nRipples 650 Ten Rod Road, Suite 211, North Kingstown, R.I. 02852; 866/866-8288; www.drinkripples.com\n\n\n\n"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LndpcmVkLmNvbS9zdG9yeS9jYXRjaGluZy1jb3NtaWMtcmF5cy12aXJnby1pbnRlcmZlcm9tZXRlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "How to Measure Ripples in Spacetime - WIRED",
        "content": "Around 1.8 billion years ago, in a distant galaxy, two vast black holes spiraled into each other, and their cataclysmic merger sent ripples through the very fabric of the universe. On August 14, 2017, those ripples in spacetime—called gravitational waves—washed over Earth, where they were detected by a newly upgraded facility in the Italian countryside.\n\nThe Virgo interferometer is an observatory for gravitational waves, set among Tuscany’s rolling hills. Three days later, it captured another ripple, this time from the merger of two neutron stars. With help from LIGO—a pair of similar interferometers in the United States—scientists were able to pinpoint where the merger happened in the sky and point their regular observatories in the right direction to eyeball the event across the electromagnetic spectrum.\n\nIt was the dawn of a new era of “multi-messenger” astronomy, in which it’s now possible to observe powerful cosmic events not just through the light that reaches us from space, but also through other “messengers,” including gravitational waves. “We had spent years making presentations to colleagues saying we will open a new window on the universe, but nobody really believed it,” says Giovanni Losurdo, a physicist who has been involved in Virgo since 1992. “Several times I was discouraged—it seemed too difficult—so when this happened, it was just a fantastic reward.”\n\nGravitational waves begin as a surge that weakens the farther it spreads, like the diminishing ripples made by a stone thrown into a pond. By the time they reach Earth, their signals are minuscule, which means detecting them is a monumental challenge. To meet it, Virgo, LIGO (the Laser Interferometer Gravitational-Wave Observatory), and Japan’s KAGRA (Kamioka Gravitational Wave Detector) all employ the same ingenious technique.\n\nOne of the detection benches suspended in a vacuum chamber, hosting photodetectors that measure Virgo’s output light. Photograph: R. Bonnand/Virgo Collaboration/LAPP\n\nA laser beam is fired at a beam splitter, which sends two identical beams down two identical tunnels, laid out at a right-angle to each other in an L-shape. At the end of each tunnel there’s a mirror that sends the beam right back to the splitter, where the light combines and can be measured by photodetectors."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdS50b2RheS94cnAtcHJpY2UtaW4tZ3JlZW4tYXMtcmlwcGxlLWhlbHBzLXRyYW5zZmVyLWNsb3NlLXRvLTUwMC1taWxsaW9uLXhycNIBWGh0dHBzOi8vdS50b2RheS94cnAtcHJpY2UtaW4tZ3JlZW4tYXMtcmlwcGxlLWhlbHBzLXRyYW5zZmVyLWNsb3NlLXRvLTUwMC1taWxsaW9uLXhycD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "XRP Price in Green as Ripple Helps Transfer Close to 500 Million XRP - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAccording to a recent tweet by prominent blockchain tracker Whale Alert, over the past 13 hours, an astounding amount of Ripple-affiliated XRP tokens has been replaced in pretty large chunks of crypto.\n\nAmong the senders was leading blockchain platform Ripple Labs. In total, nearly half a billion coins have been moved. As for the price of XRP, it has shown a slight rise over the past 24 hours, going up by more than 4%.\n\nTransfer of 480 million XRP spotted, Ripple among senders\n\nThe aforementioned platform that traces large transfers of digital currencies spread the word about nearly half a billion of cumulative XRP transfers detected by it.\n\nThe two biggest chunks out of six here carried a whopping 214,000,000 XRP worth $73,525,151 USD, and 100,000,000 XRP evaluated at $34,004,188 USD. The former was shifted by Binance trading giant between its internal wallets.\n\nThe latter chunk of XRP was moved by fintech behemoth Ripple. The money was sent from a Ripple's internal wallet to another address belonging to Ripple. From that 100 million coins, 33.5 million XRP were sent to yet another Ripple wallet, according to data provided by XRP explorer Bithomp.\n\nThe rest of the 480 million was shifted by wallets that Whale Alert tagged as \"unknown.\" However, it revealed the details that the senders moved chunks of 36,000,000; 30,000,000 and 40,000,000 XRP from Bittrex wallets to addresses linked to the Bitstamp exchange.\n\nRipple's major ODL platform, Bitso crypto unicorn exchange, transferred a total of 59,400,000 coins internally. The total worth of the XRP transfers described above is $164.1 million in fiat.\n\nImage via Twitter\n\nXRP price goes green\n\nThe sixth largest cryptocurrency, XRP, has demonstrated a rise in the past 24 hours. It has grown from $0.33 to the $0.35 level on the Bitstamp exchange. By now, the rise has gone down a little, pushing the coin to $0.34902.\n\nAs reported by U.Today last week, major crypto exchange BitMart listed XRP against USDT stablecoin. This is one of the major rate listings of XRP over the past two years.\n\nIn January and February 2021, multiple crypto exchanges, including such giants as Coinbase and Bitstamp, suspended XRP trading after the SEC initiated a lawsuit against Ripple, accusing it of selling XRP as an unregistered security to institutional investors.\n\nIn the second half of 2022, Bitstamp delisted an XRP/PAX pair, along with several other crypto pairs trading on it."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vdS50b2RheS9pZi1yaXBwbGUtbG9zZXMtc2VjLWNhc2UtaGVyZXMtbGlrZWx5LW91dGNvbWUtZm9yLXhycC1hdHRvcm5leS1qZXJlbXktaG9nYW7SAV9odHRwczovL3UudG9kYXkvaWYtcmlwcGxlLWxvc2VzLXNlYy1jYXNlLWhlcmVzLWxpa2VseS1vdXRjb21lLWZvci14cnAtYXR0b3JuZXktamVyZW15LWhvZ2FuP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "If Ripple Loses SEC Case, Here's Likely Outcome for XRP: Attorney Jeremy Hogan - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAttorney Jeremy Hogan, partner at Hogan & Hogan who closely follows the legal battle between Ripple and the U.S. securities regulator, has taken to Twitter to share his take on what outcome XRP may face for Ripple globally should the case be lost.\n\nHere's what he thinks is the likely consequence.\n\n\"XRP would lose part of its utility\"\n\nHogan's tweet came as a reply to a post by Michelle Nightengale, who is CEO of Global Institute of Wellness Entrepreneurs and author of Boost Business Online. Nightengale tagged several Twitter users, including Hogan, founder of CryptoLaw John Deaton and lawyer James Filan — all of them are following the Ripple case closely, often sharing materials related to it and their comments on them with their subscribers.\n\nMichelle Nightengale decided to pick their brains to find out what damage may actually happen should the judge classify XRP as an unregistered security as claimed by the SEC. She reminded them that when this possibility was discussed with Ripple chief Garlinghouse, he stated that Ripple would move outside the U.S.\n\nHogan has so far been the only one who responded from the list mentioned above. He reckons that in that case, XRP would likely lose 25% of its utility, since the U.S. provides 25% of global economic activity.\n\nThe U.S. accounts for 25% of world economic activity so, as a rough guesstimate, XRP would 25% of its utility. ? — Jeremy Hogan (@attorneyjeremy1) January 9, 2023\n\nWhat else may happen if Ripple loses?\n\nMany in the crypto community believe that Ripple is now fighting for the crypto space. Therefore, if Ripple happens to lose to the SEC, this would impact the crypto industry in the U.S. negatively, not to mention the XRP price, which fell hard after the lawsuit began in late December 2020.\n\nAs reported by U.Today recently, leading journalist at Fox Business Charles Gasparino shared his \"nightmare scenario\" for crypto should the community see Ripple get beaten in court.\n\nHe tweeted that in that case, the regulatory agency might go further to get the crypto space under control and \"will probably target Ethereum for its sales,\" thus destroying \"the two best technologies in crypto.\"\n\nLast year, Ripple's Brad Garlinghouse stated in an interview that he believes the settlement would be reached this year, during the first quarter of it. Many respondents in the Twitter poll run recently by the CryptoLaw founder believe that, as more than half of them voted for this option."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vYmxvY2t6ZWl0LmNvbS9yaXBwbGUtY2VvLW9wdGltaXN0aWMtYWJvdXQtcmVndWxhdG9yeS1jbGFyaXR5LWZvci1jcnlwdG8taW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Jan 2023 08:00:00 GMT",
        "title": "Ripple CEO Optimistic About Regulatory Clarity For Crypto In 2023 - Blockzeit",
        "content": "Ripple’s Chief Executive Officer, Brad Garlinghouse, recently stated in a tweet that he is cautiously “optimistic” for the year 2023 because it may be the year that we finally witness clear crypto regulations.\n\nIn a thread discussion on Twitter, the CEO of Ripple mentioned that today is the opening day of the 118th Congress and that there is a great deal of work to be done. However, support for regulation may be found across the political spectrum and in both houses of Congress. While doing so, he listed the names of some members of Congress who have voiced their support for blockchain technology and acknowledged the need for greater transparency.\n\nToday is the first day of the 118th Congress. While prior efforts at regulatory clarity for crypto in the US have stalled, I am cautiously optimistic that 2023 is the year we will (finally!) see a breakthrough. A thread on why… — Brad Garlinghouse (@bgarlinghouse) January 3, 2023\n\nAccording to Garlinghouse, there is no such thing as a flawless bill, and it is extremely difficult to please everyone. In spite of this, it should not let anything stand in the way of making progress while creating the ideal bill. According to the CEO of Ripple, these recommendations will spark a discourse in Congress.\n\nGarlinghouse added that the United States lags behind Singapore, the EU, Brazil, and Japan in terms of crypto-related legislation and regulations.\n\nRipple vs. SEC Lawsuit\n\nWhile waiting for a final court judgment in its battle with the Securities and Exchange Commission, Ripple CEO Brad Garlinghouse has urged for regulatory clarification in the United States. In 2022, both sides turned in their closing arguments; a ruling is expected to be made sometime in 2023’s first half. It is anticipated that the lawsuit’s resolution will give the cryptocurrency industry certainty.\n\nNotably, attorneys who are closely following the Ripple v. SEC case have noted that the matter is in Judge Torres’ hands and is most likely to end in a ruling rather than a settlement.\n\nA supporter of Ripple named Ben Armstrong, popularly known as BitBoy Crypto, has projected that the litigation will be settled in 2023.\n\n2023: The year the $XRP case ends and the Ripple curse is broken.\n\n\n\nAlso the year @GaryGensler is forced to resign from the @SECGov — Bitboy Crypto (@Bitboy_Crypto) January 1, 2023\n\nNo clarity Gary\n\nUrgent requests for legislation to regulate the digital asset market are being made in Washington as a result of the abrupt collapse of the cryptocurrency empire FTX. However, the chair of the Securities and Exchange Commission, Gary Gensler, is opposing calls for new laws, claiming that existing SEC regulations and Supreme Court rulings are sufficient and that cryptocurrency issuers and exchanges only need to comply.\n\nFinal Thoughts\n\nCrypto regularity clarity can help to protect consumers and investors from fraud and other illegal activities. By establishing clear rules and guidelines for the cryptocurrency industry, regulators can help to ensure that market participants are operating in a transparent and trustworthy manner. Regulation can help to promote the adoption and mainstream use of cryptocurrencies.\n\nWithout clear regulations, it can be difficult for businesses and organizations to know how to properly handle and use cryptocurrencies. This can discourage them from using these assets and limit their potential growth and adoption.\n\nRegulations can help to create stability in the cryptocurrency market. When there are clear rules and guidelines in place, it can help to reduce uncertainty and reduce the risk of sudden shifts or changes in the market. This can make it easier for businesses and individuals to plan for the future and make informed decisions about their use of cryptocurrencies."
    }
]