[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDQvMTIveHJwLWNvbW11bml0eS1yZWFjdHMtdG8tamFtZXMtay1maWxhbnMtY29tbWVudC15b3VyZS1zY3Jld2VkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "XRP Community Reacts To James K. Filan's Comment, “You're Screwed” - The Crypto Basic",
        "content": "Filan tells an XRP fan that she’s “screwed” after he was asked to explain SEC’s latest filings in familiar terms.\n\nSeveral XRP community members have expressed mixed reactions over a recent comment by former United States federal prosecutor attorney James K. Filan.\n\nWhat Happened?\n\nIt all started after the seasoned lawyer shared the latest update on the ongoing Ripple v. SEC lawsuit, as he has always done.\n\n- Advertisement -\n\nIn a tweet yesterday, Filan reported that the Securities and Exchange Commission had filed a supplemental authority letter supporting its pending summary judgment motion against Ripple.\n\nAs usual, the details of the SEC’s recent filings seemed too difficult to comprehend for non-legal practitioners, who called on the seasoned lawyer to provide clarity. A Twitter user and XRP community member who goes by the name “Anniex” asked the former federal prosecutor to explain the contents of the SEC letter in the context of the web-based game Wordle.\n\n“Explain it to me like I am on my last go in Wordle and only have three right letters but in the wrong boxes,” Anniex requested.\n\n- Advertisement -\n\nAnniex talked about the game Wordle, launched in 2018; Wordle is a web-based game that gives players six attempts to guess a five-letter word. Players are given feedback after each guess, which usually comes in the form of colored lines. This feature helps indicate when the letters match the correct position. The New York Times acquired the game last year for an undisclosed seven-figure fee.\n\nResponding to Anniex request, attorney Filan said, “Sorry. You’re screwed.”\n\nSorry. You’re screwed. — James K. Filan ???? (@FilanLaw) April 11, 2023\n\nFilan’s Comment Sparks Reactions\n\nDespite directing his response to Anniex, the tweet has stirred mixed reactions in the XRP community. While some XRP community members understood the comment as a joke, others believe that Filan’s remarks meant trouble for Ripple and the sixth-largest cryptocurrency by market capitalization.\n\n?? — Zork ᴮᴺᵀᴴ  (@Zorkwyd) April 11, 2023\n\nWow, thought you had better tact on how to explain that letter. — Carlos Del Valle (@CryptoX11) April 11, 2023\n\nFilan Clears the Misconception\n\nFilan’s comment continued to stir up reactions, prompting the seasoned lawyer to clarify his earlier response.\n\nReacting to the development, Filan said his response was only directed at Anniex’s Wordle-related comment and not the XRP community.\n\nMy response was only to the @amcunningx4 Wordle-related comment. — James K. Filan ???? (@FilanLaw) April 11, 2023\n\nFilan’s Roles in Ripple v. SEC Case\n\nAlthough some people seemed disappointed with Filan over the comment, it does not remove the fact that the defense lawyer wants the same thing as the rest of the community members- a win for Ripple.\n\nFilan has taken it as a responsibility to share updates related to the ongoing lawsuit. Aside from sharing Ripple v. SEC updates, Filan has also circulated tweets criticizing the SEC from top Ripple executives, especially the company’s general counsel Stuart Alderoty.\n\nRecall that Filan had predicted that Judge Torres would issue a ruling on the case before the end of March 2023. However, his prediction did not pass, leaving many XRP and Ripple supporters disappointed."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vbGVnaW9ubWFnYXppbmUuY29tL3ZhbmNvdXZlcnMtc2hpcC1raWxsZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Vancouver’s ship killer - Legion Magazine",
        "content": ", 1958, and Victor Dolmage was given one monumental task: to press a button.\n\nConsulting engineer for the Ministry of Public Works, Dolmage would do just that at 9:31 a.m. One-fifth of a second later, more than half a million tonnes of rock, water and debris would shoot 300 metres into the air, creating one of the largest non-nuclear explosions ever.\n\nMarking its 65th anniversary, this event was none other than the explosion of Ripple Rock, an underwater twin-peaked mountain in North Vancouver’s Seymour Narrows, which became a notorious ship killer.\n\nThe rock’s location in the middle of a tight waterway, which functioned as the Granville Street of maritime shipping and travel routes, gave captains pause as they planned their journey through.\n\n“Ripple Rock sets up…every form of turbulence known to nautical science.”\n\nFrom 1945-1955 about 150,000 travellers, 2,000 freighters and 7,000 tugs, barges and small craft passed through this watery channel.\n\nRipple Rock’s peaks were never deep, especially at low tide when there would only be about three metres of clearance. The passage was also known for its hazardous waves and whirlpools, which were more likely because of the bi-directional tidal currents. This left ships about 20-40 minutes, twice a day, to pass through the claustrophobic stretch safely.\n\n“Ripple Rock sets up…every form of turbulence known to nautical science,” Maclean’s wrote.\n\nKat Eschner, writing in Smithsonian Magazine, also noted: “Add a large, jagged underwater rock…and you have a recipe for shipwrecks.”\n\nDuring its reign in Seymour Narrows, Ripple Rock damaged or sank more than 120 vessels and took 114 lives.\n\nThe USS Saranac crashed into Ripple Rock in 1875 and the Royal Navy’s Satellite would do the same almost a decade later. Luckily, however, the crews made it out unscathed.\n\n“[We got] caught in the swirling torrent of Seymour Narrows like a chip in a gutter,” midshipman Bertram M. Chambers wrote.\n\nPlans to destroy that stubborn rock soon began to circulate; however, it would take almost half a century before they came to fruition.\n\nIt was only after Vancouver and Victoria went head-to-head over what should be done about the underwater peak during the 1940s that serious political talk about destroying it was made.\n\nWhile Vancouver was ready to say its goodbyes to Ripple Rock, Victoria thought the rock could be used to prop up a railway connection between Vancouver Island and the mainland.\n\nUltimately, the U.S. would end the debate when its navy requested Canada destroy the rock out of concerns for the safety of their ammunition ships heading to Alaska. Soon, the Canadian government put plans in place to purify what George Vancouver deemed the “vilest” stretch of water in the entire world—by destroying Ripple Rock.\n\nBut it would take a couple of attempts before the goal was reached.\n\n“I am disgusted with Ripple Rock…Let somebody else deal with it for a change.”\n\nIn 1943, plans to use floating drill barges and explosives to break up the rock were cut short when their cables continually snapped after 48 hours.\n\nIn 1945, drilling barges were traded in for two 1,097-metre-long steel lines that allowed demolition workers to drill holes into the rock and fill them with explosives.\n\nBut when only 93 out of the 1,500 explosions were effective, the staff commissioned to destroy this hearty rock became fed up, thereby letting a decade pass before they would confront it one last time.\n\n“I am disgusted with Ripple Rock,” Public Works Minister Alphonse Fournier told the House of Commons. “Let somebody else deal with it for a change.”\n\nFinally, from 1955-1958, a 75-man crew built four shafts, one of them 152 metres long from Maud Island and another 722 metres from Ripple Rock’s base.\n\nAfter filling the rock with 1,400 tonnes of explosives, nearly 10 times more than what would have been required if Ripple Rock had been above water, rumours from the surrounding community started to run wild.\n\nWhile some claimed a nearby town would be flattened, others believed the explosion would cause millions of marine life deaths and tidal waves so large they would hit Japan.\n\nSome even went so far as to claim that the explosion would trigger the beginning of the “big one,” an earthquake that would break British Columbia off from the rest of Canada.\n\nThankfully, the explosion’s aftermath was nothing more than a few rumbles and some unlucky fish.\n\nStill, the Ripple Rock blast was a marvel of modern engineering and one of the first events to be broadcast across Canada, marking its own immortality in the nation’s consciousness.\n\n“Like a veteran performer…Old Man Ripple Rock staged a death scene today that was truly memorable,” wrote a reporter for the Victoria Times Colonist.\n\n“Out of the fatal, cataclysmic blow came incredible beauty.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vbGVnaW9ubWFnYXppbmUuY29tL3ZhbmNvdXZlcnMtc2hpcC1raWxsZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Vancouver’s ship killer - Legion Magazine",
        "content": ", 1958, and Victor Dolmage was given one monumental task: to press a button.\n\nConsulting engineer for the Ministry of Public Works, Dolmage would do just that at 9:31 a.m. One-fifth of a second later, more than half a million tonnes of rock, water and debris would shoot 300 metres into the air, creating one of the largest non-nuclear explosions ever.\n\nMarking its 65th anniversary, this event was none other than the explosion of Ripple Rock, an underwater twin-peaked mountain in North Vancouver’s Seymour Narrows, which became a notorious ship killer.\n\nThe rock’s location in the middle of a tight waterway, which functioned as the Granville Street of maritime shipping and travel routes, gave captains pause as they planned their journey through.\n\n“Ripple Rock sets up…every form of turbulence known to nautical science.”\n\nFrom 1945-1955 about 150,000 travellers, 2,000 freighters and 7,000 tugs, barges and small craft passed through this watery channel.\n\nRipple Rock’s peaks were never deep, especially at low tide when there would only be about three metres of clearance. The passage was also known for its hazardous waves and whirlpools, which were more likely because of the bi-directional tidal currents. This left ships about 20-40 minutes, twice a day, to pass through the claustrophobic stretch safely.\n\n“Ripple Rock sets up…every form of turbulence known to nautical science,” Maclean’s wrote.\n\nKat Eschner, writing in Smithsonian Magazine, also noted: “Add a large, jagged underwater rock…and you have a recipe for shipwrecks.”\n\nDuring its reign in Seymour Narrows, Ripple Rock damaged or sank more than 120 vessels and took 114 lives.\n\nThe USS Saranac crashed into Ripple Rock in 1875 and the Royal Navy’s Satellite would do the same almost a decade later. Luckily, however, the crews made it out unscathed.\n\n“[We got] caught in the swirling torrent of Seymour Narrows like a chip in a gutter,” midshipman Bertram M. Chambers wrote.\n\nPlans to destroy that stubborn rock soon began to circulate; however, it would take almost half a century before they came to fruition.\n\nIt was only after Vancouver and Victoria went head-to-head over what should be done about the underwater peak during the 1940s that serious political talk about destroying it was made.\n\nWhile Vancouver was ready to say its goodbyes to Ripple Rock, Victoria thought the rock could be used to prop up a railway connection between Vancouver Island and the mainland.\n\nUltimately, the U.S. would end the debate when its navy requested Canada destroy the rock out of concerns for the safety of their ammunition ships heading to Alaska. Soon, the Canadian government put plans in place to purify what George Vancouver deemed the “vilest” stretch of water in the entire world—by destroying Ripple Rock.\n\nBut it would take a couple of attempts before the goal was reached.\n\n“I am disgusted with Ripple Rock…Let somebody else deal with it for a change.”\n\nIn 1943, plans to use floating drill barges and explosives to break up the rock were cut short when their cables continually snapped after 48 hours.\n\nIn 1945, drilling barges were traded in for two 1,097-metre-long steel lines that allowed demolition workers to drill holes into the rock and fill them with explosives.\n\nBut when only 93 out of the 1,500 explosions were effective, the staff commissioned to destroy this hearty rock became fed up, thereby letting a decade pass before they would confront it one last time.\n\n“I am disgusted with Ripple Rock,” Public Works Minister Alphonse Fournier told the House of Commons. “Let somebody else deal with it for a change.”\n\nFinally, from 1955-1958, a 75-man crew built four shafts, one of them 152 metres long from Maud Island and another 722 metres from Ripple Rock’s base.\n\nAfter filling the rock with 1,400 tonnes of explosives, nearly 10 times more than what would have been required if Ripple Rock had been above water, rumours from the surrounding community started to run wild.\n\nWhile some claimed a nearby town would be flattened, others believed the explosion would cause millions of marine life deaths and tidal waves so large they would hit Japan.\n\nSome even went so far as to claim that the explosion would trigger the beginning of the “big one,” an earthquake that would break British Columbia off from the rest of Canada.\n\nThankfully, the explosion’s aftermath was nothing more than a few rumbles and some unlucky fish.\n\nStill, the Ripple Rock blast was a marvel of modern engineering and one of the first events to be broadcast across Canada, marking its own immortality in the nation’s consciousness.\n\n“Like a veteran performer…Old Man Ripple Rock staged a death scene today that was truly memorable,” wrote a reporter for the Victoria Times Colonist.\n\n“Out of the fatal, cataclysmic blow came incredible beauty.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vY2FwaXRhbC5jb20vcmlwcGxlLXdoby1vd25zLW1vc3QteHJw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Who Owns The Most Ripple? | XRP Holders - Capital.com",
        "content": "Who owns the most XRP? – Photo: Shutterstock, Dusan Zidar\n\nRipple’s XRP cryptocurrency has spent much of the last three years in a kind of limbo after it became the subject of a highly publicised court case.\n\nThe United States Securities and Exchange Commission (SEC) has taken Ripple to court, claiming that XRP is an unregistered security, claims that the crypto’s parent company denies.\n\nWhile the world waits for Judge Analisa Torres of the United States District Court for the Southern District of New York to make her ruling, XRP continues to be traded.\n\nThat said, with the ripple coin still one of the largest cryptos on the market, exactly who owns XRP? More to the point, who owns the most ripple out of all the players in the crypto market? Let’s take a look and see what we can find out.\n\nWhat is Ripple (XRP)?\n\nBefore we do that, though, let’s take a quick look at what XRP does and how XRP works.\n\nRipple Labs was founded to, in effect, speed up international money transfers. There is even a belief in certain quarters that it will end up replacing the current Swift/BIC system of international bank transfers. In terms of the XRP coin itself, it can be used to transfer assets on the Ripple network and it can also be bought, sold and traded on crypto exchanges.\n\nRipple was founded in 2012 by programmer Jed McCaleb and entrepreneur Chris Larsen. Larsen still serves as Ripple Labs executive chairman and the company’s CEO is Brad Westinghouse.\n\nUnlike a lot of other cryptocurrencies, XRP only lets approved users validate transactions. That makes it a bit more centralised than other cryptos, but does allow it to be more secure, at least in theory.\n\nSomething that makes XRP stand out is that there is some debate as to whether it can be described as being based on a blockchain. This is because the Ripple ledger does not involve either mining or staking. Instead, every single one of the 100 billion XRP that will ever exist has been created by Ripple and is held by the company, with a certain amount released onto the open market every month. As of 12 April 2023, there were 51,688,470,797 in circulation. It is worth noting at this stage that there was a total supply of 99,989,014,677, indicating that a little under 11 million XRP had been burned, or destroyed, at one time or another.\n\nAnyway, with that all out of the way, let’s take a look and see if we can find out more about who has the most ripple.\n\nWho owns the most ripple?\n\nRipple price history from launch to present - Credit: CoinMarketCap\n\nOne important thing to remember at this stage is that, because one of the key selling points of cryptocurrency is its anonymity, we cannot say with any certainty exactly who owns the most XRP. That said, there are some potential clues as to who the wallets which hold the largest amount of XRP could be linked to.\n\nAnyway, data supplied by the CoinCarp website said that, as of 12 April 2023, there were 4,559,305 wallets which held XRP. The site suggested that the two top holders of ripple were wallets controlled by Ripple Labs itself. This should probably not come as too much of a surprise, considering that, as we have already explained, XRP is held by Ripple Labs and then released onto the open market. The site’s statistics suggested that the wallet with the most XRP held 1,960,027,012 ripple coins, worth about $983m at the time of writing and comprising 1.96% of the maximum supply of the crypto. Likewise, the wallet with the second most ripple held 1,765,294,075, the equivalent of a little over $885m and about 1.765% of the maximum supply.\n\nMoving down the list, the site said that the third largest amount of XRP was in a wallet linked to the Binance (BNB) crypto exchange. This wallet held around 1.48% of the total amount of XRP, with 1,477,168,712 ripple coins. Perhaps more interestingly, the fourth largest XRP wallet appears to be an individual’s, holding 1,376,176,324 ripple, worth about $697m.\n\nGoing a bit further, the site claimed that the top 10 holders of ripple owned 10.81% of the maximum supply of XRP, with the top 20 accounting for 15.92%, the top 50 26.43% and the top 100 32.86% of the total amount of ripple.\n\nOne thing we should note here is that, according to CoinCarp’s data, there are at least 100 wallets with more than 200 million ripple coins. That means, at least in theory, that there are hundreds of XRP millionaires, but not any confirmed ripple billionaires. Something that we need to mention is that it is always possible that someone has $1bn worth of XRP across several wallets. However, we cannot name the individual who owns the most ripple with any certainty. It is worth noting that, in 2018, Forbes reported that Larsen held 5.19 billion XRP in his personal wallet. It is unclear either whether this report was accurate, or what had happened to Larsen’s holdings.\n\nSo that might help explain, if not precisely who owns the most ripple, then at least where the largest sums of XRP can be found. Remember that that question is, due to the anonymous nature of cryptocurrency, getting a handle as to who precisely owns what can be tricky. Nevertheless, despite the relatively high concentration of large investors in XRP, it is important to remember the following things if you are looking at possibly investing in the ripple cryptocurrency. First, make sure to do your own research. Second, remember that cryptocurrencies can be highly volatile and prices can go down as well as up. Finally, never invest more money than you can afford to lose.\n\nFAQs"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vY2FwaXRhbC5jb20vcmlwcGxlLXdoby1vd25zLW1vc3QteHJw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Who Owns The Most Ripple? | XRP Holders - Capital.com",
        "content": "Who owns the most XRP? – Photo: Shutterstock, Dusan Zidar\n\nRipple’s XRP cryptocurrency has spent much of the last three years in a kind of limbo after it became the subject of a highly publicised court case.\n\nThe United States Securities and Exchange Commission (SEC) has taken Ripple to court, claiming that XRP is an unregistered security, claims that the crypto’s parent company denies.\n\nWhile the world waits for Judge Analisa Torres of the United States District Court for the Southern District of New York to make her ruling, XRP continues to be traded.\n\nThat said, with the ripple coin still one of the largest cryptos on the market, exactly who owns XRP? More to the point, who owns the most ripple out of all the players in the crypto market? Let’s take a look and see what we can find out.\n\nWhat is Ripple (XRP)?\n\nBefore we do that, though, let’s take a quick look at what XRP does and how XRP works.\n\nRipple Labs was founded to, in effect, speed up international money transfers. There is even a belief in certain quarters that it will end up replacing the current Swift/BIC system of international bank transfers. In terms of the XRP coin itself, it can be used to transfer assets on the Ripple network and it can also be bought, sold and traded on crypto exchanges.\n\nRipple was founded in 2012 by programmer Jed McCaleb and entrepreneur Chris Larsen. Larsen still serves as Ripple Labs executive chairman and the company’s CEO is Brad Westinghouse.\n\nUnlike a lot of other cryptocurrencies, XRP only lets approved users validate transactions. That makes it a bit more centralised than other cryptos, but does allow it to be more secure, at least in theory.\n\nSomething that makes XRP stand out is that there is some debate as to whether it can be described as being based on a blockchain. This is because the Ripple ledger does not involve either mining or staking. Instead, every single one of the 100 billion XRP that will ever exist has been created by Ripple and is held by the company, with a certain amount released onto the open market every month. As of 12 April 2023, there were 51,688,470,797 in circulation. It is worth noting at this stage that there was a total supply of 99,989,014,677, indicating that a little under 11 million XRP had been burned, or destroyed, at one time or another.\n\nAnyway, with that all out of the way, let’s take a look and see if we can find out more about who has the most ripple.\n\nWho owns the most ripple?\n\nRipple price history from launch to present - Credit: CoinMarketCap\n\nOne important thing to remember at this stage is that, because one of the key selling points of cryptocurrency is its anonymity, we cannot say with any certainty exactly who owns the most XRP. That said, there are some potential clues as to who the wallets which hold the largest amount of XRP could be linked to.\n\nAnyway, data supplied by the CoinCarp website said that, as of 12 April 2023, there were 4,559,305 wallets which held XRP. The site suggested that the two top holders of ripple were wallets controlled by Ripple Labs itself. This should probably not come as too much of a surprise, considering that, as we have already explained, XRP is held by Ripple Labs and then released onto the open market. The site’s statistics suggested that the wallet with the most XRP held 1,960,027,012 ripple coins, worth about $983m at the time of writing and comprising 1.96% of the maximum supply of the crypto. Likewise, the wallet with the second most ripple held 1,765,294,075, the equivalent of a little over $885m and about 1.765% of the maximum supply.\n\nMoving down the list, the site said that the third largest amount of XRP was in a wallet linked to the Binance (BNB) crypto exchange. This wallet held around 1.48% of the total amount of XRP, with 1,477,168,712 ripple coins. Perhaps more interestingly, the fourth largest XRP wallet appears to be an individual’s, holding 1,376,176,324 ripple, worth about $697m.\n\nGoing a bit further, the site claimed that the top 10 holders of ripple owned 10.81% of the maximum supply of XRP, with the top 20 accounting for 15.92%, the top 50 26.43% and the top 100 32.86% of the total amount of ripple.\n\nOne thing we should note here is that, according to CoinCarp’s data, there are at least 100 wallets with more than 200 million ripple coins. That means, at least in theory, that there are hundreds of XRP millionaires, but not any confirmed ripple billionaires. Something that we need to mention is that it is always possible that someone has $1bn worth of XRP across several wallets. However, we cannot name the individual who owns the most ripple with any certainty. It is worth noting that, in 2018, Forbes reported that Larsen held 5.19 billion XRP in his personal wallet. It is unclear either whether this report was accurate, or what had happened to Larsen’s holdings.\n\nSo that might help explain, if not precisely who owns the most ripple, then at least where the largest sums of XRP can be found. Remember that that question is, due to the anonymous nature of cryptocurrency, getting a handle as to who precisely owns what can be tricky. Nevertheless, despite the relatively high concentration of large investors in XRP, it is important to remember the following things if you are looking at possibly investing in the ripple cryptocurrency. First, make sure to do your own research. Second, remember that cryptocurrencies can be highly volatile and prices can go down as well as up. Finally, never invest more money than you can afford to lose.\n\nFAQs"
    }
]