[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmFtZXJpY2FuYmFua2VyLmNvbS9saXN0L2xhdGVzdC1iYW5raW5nLW5ld3MtamFuLTI3LTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Latest banking news, Jan. 27, 2023 - American Banker",
        "content": "Bloomberg News\n\nThe Dutch Central Bank fined the crypto exchange Coinbase for providing digital-asset services in the country prior to its local registration in September. The central bankThursday it's imposing an administrative fine of €3.33 million ($3.63 million) on Coinbase Europe Ltd. for operating in the country without registering with the monetary authority. Coinbase obtained its registration in the Netherlands on Sept. 22. Companies seeking to provide crypto services in the Netherlands are required to register with the central bank under the Dutch Anti-Money Laundering and Anti-Terrorist Financing Act. The central bank said \"the base amount of the fine was increased due to the severity and degree of culpability of the non-compliance.\" The central bank said Coinbase, which \"has a significant number of customers in the Netherlands,\" was in noncompliance with its rules from November 2020 to August 2022.\" This meant that Coinbase was unable to report unusual transactions to the Financial Intelligence Unit-Netherlands during the period of non-compliance,\" the central bank said. \"A large number of unusual transactions may have gone unnoticed by the investigative authorities during this period.\" A Coinbase spokesperson said the company disagrees with the fine and while it respects the central bank's authority to enforce regulations, it is \"carefully considering the objections and appeals process.\" Coinbase has until March 2 to object to the fine."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2FwdG9zLXN1cmdlLW1pcnJvcnMtcmlwcGxlLWJ1bGwtcnVu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 18:24:51 GMT",
        "title": "Aptos Surge Triggers Flashbacks of Ripple's 2017 Bull Run - Blockworks",
        "content": "Layer-1 Aptos has seen the price of its token, APT, soar by 460% since the start of the year.\n\nPreviously dubbed the ‘Solana Killer,’ proof-of-stake network Aptos promised to create a fast and cheap blockchain that would enable NFTs, DAOs and DeFi activity but fell short when it launched in October last year.\n\nOnly 50 active developers are currently active on Aptos, according to data from TokenTerminal. Its number of daily active users currently sits around 31,000.\n\nDespite these numbers, Aptos’ fully diluted valuation (FDV) is significantly greater than that of other blockchains, including Avalanche, Solana, Polygon, and Optimism, Blockworks Research Senior Analyst Dan Smith said.\n\nAptos’ recent price surge correlated with the deployment of the decentralized exchange (DEX) PancakeSwap on its blockchain two weeks ago — the DEX makes up a total of $33.26 million in TVL on Aptos — almost 60% of the entire Aptos TVL, according to DefiLama.\n\n“The lack of development is obvious in the on-chain liquidity, which mostly resides on a non-native DEX — PancakeSwap — in the form of non-native tokens such as USDC, BUSD, WETH,” Smith said.\n\nProjects often run a series of testnets with developers who are building on their network before mainnet launches. That “creates a community of developers and users before the token launch, which is undeniably a more ethical process,” Smith added. Aptos ran four testnets in 2022 before launching on mainnet.\n\nSo why is the network with few users and developers seeing such a huge increase in its token’s price?\n\nNearly 400 articles about Aptos were published in the weeks leading up to its 460% rally | Chart by David Canellis\n\nThe South Korean market\n\nThe price rally of Aptos parallels the beginning of “Xangle Blockchain Foundation Week” in South Korea, where the project has been heavily promoted.\n\nIn fact, Aptos’ focus on the South Korean market has always been intentional. A Twitter user who goes by the pseudonym DataaRocks noted in a series of tweets that the company had released a Korean language version of its white paper and partnered with local gaming company Npixel in November last year to launch METAPIXEL.\n\nIt is also preparing to launch its world tour hackathon in Seoul, DataaRocks said.\n\nLoading Tweet..\n\nThis momentum, however, is reminiscent of Ripple’s run in 2017, Markus Thielen, head of research and strategy at Matrixport, said in a report.\n\n“This reminds ‘Matrix on Target’ of XRP Ripple, which had 50% of [its] trading volume driven by Korean retail investors during the 2017 peak when the token went 10x in a matter of weeks,” Thielen said in a report.\n\nShort positions\n\nIt is also likely that many traders are looking to short APT, Thielen said, noting that over the past 48 hours, price movements have been driven by two large short squeezes.\n\n“By far, the largest volume comes from ByBit for Aptos, which is estimated to have its web traffic source from Russia [at] 19% and Korea [at] 14%,” he said.\n\nFunding rates for APT perpetual futures have also been trading negatively, indicative of heavy short interest. According to information on Coinalyze, Aptos’ funding rate fell sharply on Jan. 25 and Jan. 26, before leveling out once the price spiked.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LnNjaWVuY2VhbGVydC5jb20vcmlwcGxlcy1pbi1zcGFjZS10aW1lLWNvdWxkLWFjdHVhbGx5LXJldmVhbC13aGVuLXRpbWUtYmVnYW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Ripples in Space-Time Could Actually Reveal When Time Began - ScienceAlert",
        "content": "The propagation of gravitational waves through matter could reveal the ripples in space-time generated by the Big Bang.\n\nTwo plasma physicists used the propagation of electromagnetic waves through plasma as an analogue for gravitational waves, devising a set of equations that describe what to look for as gravitational waves travel through stars and gas in the depths of space.\n\nThese signs could reveal the elusive gravitational waves that travel through space beyond our narrow ability to detect them – the giant, low-frequency waves generated by colliding supermassive black holes, the smaller buzz generated by orbiting white dwarf binaries, and the colossal ringing of the expansion of the Universe, just fractions of a second after the Big Bang.\n\n\"We can't see the early Universe directly, but maybe we can see it indirectly if we look at how gravitational waves from that time have affected matter and radiation that we can observe today,\" says physicist Deepen Garg of Princeton University.\n\nGravitational waves that undulated out from a collision between two stellar-mass black holes were first detected by humans in 2015, across a distance of 1.4 billion light-years. First predicted by Einstein, gravitational waves are kind of like ripples in a pond: space-time itself stretching and contracting from the gravitational disruption caused by a massive event.\n\nThe instrument that detected these waves, therefore, wasn't a telescope, but a precision array of lasers and mirrors that reacts to the warping of space-time, producing a pattern that scientists can decipher to determine characteristics of the gravitational waves' source. But the technology is limited: currently, we are only able to detect gravitational waves in the stellar mass- black hole and neutron star collision regime.\n\nOther sources of gravitational waves are multitudinous, but currently – and possibly only just – out of reach. But Garg and his colleague, physicist Ilya Dodin of the Princeton Plasma Physics Laboratory, realized in the course of their plasma fusion research that there might be another way of seeing these currently hidden waves.\n\nPlasma fusion could one day be an alternative and clean source of energy for powering the world, but it has a long way to go. One thing scientists need is a detailed model describing the way electromagnetic waves travel through plasma. And it turns out that it should be extremely similar to the way gravitational waves move through matter.\n\n\"We basically put plasma wave machinery to work on a gravitational wave problem,\" Garg explains.\n\nAccording to the pair's work, the propagation of gravitational waves through matter should produce a detectable signal – changes, for instance, in the light produced by stars, or vast clouds of gas in the spaces between the stars.\n\nThis could not only reveal gravitational waves that are currently beyond our detection capabilities, but give scientists a new tool for studying the stars, too. For instance, the characteristics of the light signal generated by the gravitational waves in stars could change based on the internal structure and density of the star.\n\nSince the interior shenanigans of stars are pretty difficult to see, gravitational waves could be a powerful new tool in the kit for this field of astronomy. The team's work could also prove useful in the gravitational wave events we can detect: the mergers of stellar mass black holes and neutron stars.\n\nIn other words, the pair seems to have identified what could prove to be a multifunctional and indispensable new way to understand the cosmos. The next step, they say, will be using it to try and analyze some actual data.\n\n\"I thought this would be a small, six-month project for a graduate student that would involve solving something simple,\" Dodin says. \"But once we started digging deeper into the topic, we realized that very little was understood about the problem and we could do some very basic theory work here.\"\n\nThe research has been published in the Journal of Cosmology and Astroparticle Physics."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vcmlwcGxlLmNvbS9pbnNpZ2h0cy9yaXBwbGUtbmFtZXMtbW9uaWNhLWxvbmctYXMtcHJlc2lkZW50L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Ripple Names Monica Long As President - Ripple",
        "content": "Today, we're announcing that SVP and General Manager Monica Long has been promoted to the role of President.\n\nComing off our strongest year yet, Monica Long is one of the driving forces behind why we have been as successful as we are today despite multiple crypto winters and headwinds in the industry. She joined Ripple in 2013 when the company had only 10 employees. At a time when crypto was barely a blip on the radar, she was in the trenches establishing Ripple as a responsible leader in the crypto industry—working with regulators with care and evangelizing the benefits and utility of crypto, as well as earning the trust of financial institutions globally.\n\n“From the moment I first met Monica nearly eight years ago at Ripple, it was clear that she was a force to be reckoned with. Her deep knowledge of crypto paired with her determination, creativity and ability to think out of the box has made her one of the most respected leaders in the industry and certainly at Ripple,” says Brad Garlinghouse, Ripple CEO. “Even in the current challenging crypto environment, Monica has helped guide Ripple to a very unique place of growth and financial strength. She's been an instrumental adviser to me over the years and I'm grateful to have the opportunity to partner with her even more closely as she embarks on her role as President.”\n\nNot too long ago, it was unheard of for enterprises and financial institutions to use crypto in their tech stack. Under Monica’s leadership, and working alongside engineering and product, her team helped launch On-Demand Liquidity (ODL), one of the industry’s first enterprise crypto solutions to use crypto for cross-border transactions and Ripple’s flagship product in 2018. Today, ODL is available in nearly 40 payout markets and last year, approximately 60% of payments over RippleNet were sent through ODL. In other words, over half of payments are now using XRP for cross-border transactions. Ripple has processed $30B worth of volume and 20M transactions since RippleNet was first launched.\n\n“I’m incredibly honored to take on the role of President at Ripple as we expand deeper into crypto-enabled services like liquidity, settlement and custody,” says Monica Long. “Looking back over my tenure, I can say without a doubt that I’ve been lucky enough to be surrounded by some of the smartest, most innovative people in crypto and tech, as we tackled some huge audacious goals-- like being able to send money instantly for fractions of a penny around the world. The Internet of Value is a mission I believed in on day one and continue to find inspiration in for the future.”\n\nMonica’s passion, hard work, care and successful strategic bets resulted in her promotion in August 2020 to General Manager of RippleX where she oversaw product, engineering, partnerships, marketing and developer relations, working together to support an open community of crypto developers innovating across creator economies, payments, identity, foreign exchange, digital media, gaming, central bank digital currencies and more. Under her leadership, the team launched and contributed to –along with the community– the first phase of the EVM sidechain and brought NFTs to the XRP Ledger (XRPL) under the proposed amendment, XLS-20, as well as inked key CBDC partnerships with the countries of Palau and Bhutan. In addition, they led funding for and helped launch 100+ projects through grants, accelerators, bounties, hackathons and the XRPL Zone.\n\nIn June 2022, she took on the RippleNet General Manager role, in addition to RippleX, where she was responsible for the development and growth of ODL and global customer success.\n\n“When I think about the beginning of Ripple and where we are now – so much of that is due to Monica’s leadership and strategic insights. She joined us when crypto was unheard of, and to see her grow over the last ten years into the fantastic leader she is today, is a testament to how far the industry has come,“ said Chris Larsen, Ripple Executive Chairman and co-founder.\n\nMonica has been recognized by San Francisco Business Times as one of the most influential women in business and payments. In addition, she was part of HSBC’s ‘Women on the Rise in FinTech’ initiative, a program aimed at celebrating gender diversity by honoring the industry’s preeminent women."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDEvMjcvY2lyY2xlLXJpcHBsZS14cnAtd2VmLWNyeXB0by1kZWZpLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Circle and Ripple (XRP) at WEF: crypto, blockchain and the integration of DeFi and traditional finance - The Cryptonomist",
        "content": "Circle and Ripple (XRP) moderated their views at the World Economic Forum on crypto and the blockchain world in Davos, given their participation outside the WEF conference in a myriad of cryptocurrency-focused events such as Blockchain Hub Davos and GBBC’s Blockchain Central.\n\nOverall, a handful of cryptocurrency industry players who participated in seminars at the World Economic Forum’s annual meeting paint a picture of greater collaboration within the space in 2023.\n\nIndeed, cryptocurrencies and blockchain technology remained only a small part of the projects and initiatives discussed during the WEF’s annual conference in the Swiss Alps.\n\nHowever, a growing number of industry-focused sessions suggest that the rest of the world is looking for synergies between traditional and decentralized finance.\n\nRipple (XRP) in Davos: now going deeper into crypto\n\nThe Ripple team rented office space in Davos to conduct meetings and business during the WEF conference. There, Ripple’s APAC CEO Brooks Entwistle discussed the company’s involvement at this year’s conference.\n\nEntwistle painted an interesting picture as an individual who has been to previous WEF annual meetings in various roles for different companies and organizations back in 2009.\n\nThe presence of cryptocurrency and blockchain participants has come to the fore in recent years, as Entwistle explained:\n\n“What you notice over time is that the crowd changes, the promenade changes, and certainly with cryptocurrencies in recent years, that has been the case. In May of 2022, you couldn’t walk the boardwalk without being offered a Bitcoin pizza.”\n\nHowever, the prolonged downturn in the conventional and cryptocurrency markets, coupled with seismic events such as the collapse of FTX late last year, has left a noticeable mark on the number of participants in the crypto ecosystem who set up store at the conference in 2023.\n\nThe caliber of FTX, which had a booth at the conference last year, was nowhere to be seen. Instead, blockchain infrastructure providers such as Filecoin and Hedera had a notable presence, along with Circle.\n\nOther companies maintained a presence outside the conference at their own events, such as CV Labs’ Blockchain Hub and, at the Hotel Europe in Davos, GBBC’s Blockchain Central.\n\nHowever, Entwistle drew a silver lining around the reduced number of cryptocurrency stalls along the promenade, suggesting that more fruitful dialogue was possible at the WEF conference:\n\n“It’s definitely quieter now, but we’re actually having a great WEF. With some of the noise and hype gone, the conversations and ability to go deep present more of an opportunity.”\n\nCircle (USDC) and its statements at the WEF: the situation of the unbanked\n\nCory Then, vice president of global policy at Circle, said he has seen many idealistic individuals try to cooperate and organize resources in a way that would benefit the world economy.\n\nIn addition, Then highlighted the importance of exploring the role of blockchain-based payment systems like Circle regarding the future of global finance and payments, stating:\n\n“We’re out there talking to policy makers, we’re talking to traditional companies outside of tech, who are looking to use USDC as a payment solution, we’re talking to tech companies, figuring out how we might integrate with the work that they’re doing. We are talking to humanitarian organizations.”\n\nAccording to Then, Circle has had hundreds of conversations with policymakers in the European Union, the United Kingdom, Japan, Singapore, Mexico and other countries as USDC continues to become more readily available as a stablecoin solution.\n\nKey drivers of adoption focused on how decentralized payment systems can help broad swaths of the unbanked around the world. Then said stablecoins can improve financial systems and inclusion in areas largely not served by banks and financial institutions:\n\n“Do you have a phone. You download a personal wallet to that phone. And the next thing you know, you have access to a payment mechanism that is quite reliable and you can get US dollars or you can get euro coins.”\n\nThus, he finally suggested that the continued utility offered by industry protocols, platforms and institutions and less betting on price fluctuations would lead to further inclusion.\n\nMore statements from Circle: no charges against the SEC for the $9 billion plan\n\nCircle recently denied blaming the SEC for the $9 billion closed plan to go public.\n\nPreviously, a widely shared report from 25 January by the Financial Times, characterized Circle for “blaming” the SEC for its “abandoned” public listing plan.\n\nHowever, a Circle spokesperson clarified that this was not the case and that it is not at fault with the SEC for the termination of its merger agreement, claiming:\n\n“Circle does not and does not blame the SEC for anything related to the mutual termination of our SPAC merger agreement with Concord, and any claims to the contrary are inaccurate.”\n\nIn a nutshell, Circle’s listing on the New York Stock Exchange (NYSE) was linked to the possibility of joining Concord, a company founded by banker Bob Diamond through a Special Purpose Acquisition Company agreement, also known as the SPAC agreement.\n\nHowever, according to the FT, Circle said the merger was not completed because the SEC did not declare the relevant S-4 registration effective on time, which would cause the deal to expire on 10 December.\n\nHowever, Circle’s spokesperson referred to earlier statements made by the company in December, noting that the deal simply ended. On the other hand, Concord had not publicly revealed a reason for the failed business combination.\n\nHowever, it filed a Form 8-K with the SEC on 5 December, the same day the deal was announced as terminated, which revealed that it had been delisted from the NYSE due to abnormally low trading price levels.\n\nIn fact, in a 5 December tweet, Circle co-founder and CEO Jeremy Allaire had nothing but positive words about the SEC and noted that although it was disappointing that they were unable to complete the qualifications in time, they were still planning to become a publicly traded company."
    }
]