[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTA4L3JpcHBsZS1jZW8tZ2FybGluZ2hvdXNlLXdvdWxkLXdlbGNvbWUtc3VwcmVtZS1jb3VydC1jcnlwdG8tZmlnaHQtd2l0aC1zZWPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Supreme Court Crypto Fight With SEC Welcomed by Ripple CEO Garlinghouse - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTA4L2hzYmMtdG8tbGF1bmNoLWRpZ2l0YWwtYXNzZXRzLWN1c3RvZHktZm9yLXRva2VuaXplZC1zZWN1cml0aWVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "HSBC Plans Digital Assets Custody Using Ripple-Owned Metaco Tech - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yaXBwbGUtbGF1bmNoZXMtc2V0dGxlbWVudHMtcGxhdGZvcm0tYW5ub3VuY2VzLTA5MjE1ODAyMC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Ripple Launches New Settlements Platform, Announces New Partnership with African Fintech Firm - Yahoo Finance",
        "content": "Ripple Launches New Settlements Platform, Announces New Partnership with African Fintech Firm\n\nDuring Ripple's annual conference Swell, held in Dubai, the company announced partnerships and initiatives aimed at broadening its cross-border payments solutions.\n\nIn collaboration with African payments fintech Onafriq, Ripple is expanding remittance capabilities in Africa and establishing blockchain-based payments corridors.\n\nThese corridors will connect Onafriq users in Africa with customers of PayAngel in the U.K., Pyypl in the Gulf Cooperation Council (GCC), and Zazi Transfer in Australia.\n\nMonica Long, president at Ripple, said:\n\n“We are excited about this because it also contributes to Ripple payments being able to cover 90% of FX markets.”\n\nFurthermore, Ripple is targeting corporate clients without their own money transmitter licenses with its updated settlements platform, Ripple Payments.\n\nThe platform aims to simplify cross-border crypto payments for corporate clients in the U.S., attracting those without the licenses or extensive knowledge of crypto. Ripple's acquisition of multiple money transmitter licenses, including 30 in the U.S., has enabled the rollout of this new payments solution.\n\nThe XRP token, native to the Ripple blockchain, has made headlines recently following its victory over the SEC. Further, XRP received approval from the Dubai Financial Services Authority.\n\nXRP has gained 100.4% so far this year, and is currently trading at $0.6799, according to CoinMarketCap data."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9oc2JjLXBhcnRuZXJzLXJpcHBsZS1vd25lZC1tZXRhY28tMDUzNDMyNDIxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "HSBC Partners with Ripple-Owned Metaco for Tokenized Securities Custody Platform - HSBC Partners with Ripple ... - Yahoo Finance",
        "content": "HSBC Partners with Ripple-Owned Metaco for Tokenized Securities Custody Platform\n\nHSBC, a major global banking institution, has partnered with Metaco, a Ripple-owned technology startup, to build an institutional custody platform for tokenized assets.\n\nHSBC, which has $5.6 trillion in custody, plans to debut this new service in 2024, alongside its existing digital asset issuance platform, HSBC Orion, and a recently launched gold tokenization solution.\n\nAccording to HSBC's Chief Digital, Data, and Innovation Officer Zhu Kuang Lee, said:\n\n“We’re seeing increasing demand for custody and fund administration of digital assets from asset managers and asset owners, as this market continues to evolve.”\n\nTokenized securities, which are frequently constructed on blockchain technology, allow for the digital representation of physical assets such as stocks, ETFs, or bonds. They can also be used to securitize other assets, including real estate, and to raise funds by selling fractionalized ownership via digital tokens rather than traditional stock issues.\n\nThe relationship between HSBC and Metaco, which was acquired by Ripple in May for $250 million, focuses on Metaco's Harmonize, an institutional platform that ensures secure and uniform digital asset operations. This partnership is part of HSBC's larger investigation into distributed ledger technology (DLT) applications in asset generation and custody.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yaXBwbGUtcGFydG5lcnMtb25hZnJpcS1hZnJpY2FuLWNyb3NzLTEwNTUwNzUxOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Ripple partners with Onafriq for African cross-border payment channels - Yahoo Finance",
        "content": "Ripple Labs, the San Francisco-based payments firm, has partnered with South African fintech company Onafriq to expand remittance payment capabilities in Africa and across its borders with the Gulf Cooperation Council (GCC), the U.K. and Australia.\n\nSee related article: Sam Bankman-Fried found guilty on all charges\n\nFast Facts\n\nThe collaboration will open three new blockchain-based payment channels between Onafriq users in Africa and three of its partner firms, namely U.K.-based fintech firm PayAngel., Abu Dhabi-based digital Wallet Pyypl that serves users in the GCC and Australia-based payments company Zazi Transfer.\n\nThe payment channels will enable users to execute low cost remittance and business payments to recipients in 27 countries across Onafriq’s pan-African network.\n\nThe new payment channels will utilize Ripple Payments, an XRP-enabled payments technology, to eliminate the lengthy transfer times and high costs associated with traditional remittance payments, Ripple said in a press release on Tuesday.\n\n“Connecting our partners PayAngel, Pyppl and Zazi Transfer with Onafriq over Ripple Payments will bring the benefits of faster and more cost-effective cross-border payments to individuals seeking to send money into Africa from around the globe,” said Aaron Sears, senior vice president of global customer success at Ripple.\n\nXRP fell 1.46% in the 24 hours leading up to 5:15 p.m. in Hong Kong, to trade at US$0.68, according to CoinMarketCap.\n\nSee related article: XRP triumphs over SEC, but crypto clarity remains in the shadows"
    }
]