[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vbnltYWcuY29tL3ByZXNzLzIwMjMvMTEvdGhlLXJpcHBsZS1lZmZlY3Qtb2YtdGhlLWlzcmFlbC1oYW1hcy13YXItaW4tbmV3LXlvcmstY2l0eS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "On the Cover: The Ripple Effect of the Israel-Hamas War in New York City - New York Magazine",
        "content": "New York’s November 20–December 3 issue is an expansive package focused on the reverberations in New York in the aftermath of Hamas’s attack on Israel and Israel’s declaration of war. More than a dozen reporters and photographers spoke with people across the city to document the tremendous grief and mourning, as well as the impact of protests and conflicts within institutions, workplaces, friend groups, and families.\n\n“For six weeks, the city has been torn up and torn apart — grieving, protesting, and full of anguish,” says editor-in-chief David Haskell. “The horrors of the war have revealed painful differences within even the tightest friendships, families, and organizations, and we have committed in this project to exploring these fault lines with tenderness and clarity.”\n\nThe package includes an examination of the tensions at the 92nd Street Y, two perspectives on the defacing of posters featuring hostages, fissures within the leftist Jewish literary community, the fallout at Artforum, a meditation on watching the war in Gaza from an Instagram feed, controversy among faculty and students at Columbia, and reflections from a wide range of Palestinian and Jewish Americans including high-school students, rabbis, players in Hollywood, parents, and more.\n\nContributors to the package include Simon van Zuylen-Wood, Zaina Arafat, Mark Harris, Esther Wang, Ryu Spaeth, Rebecca Alter, Rachel Corbett, Anya Kamenetz, Bindu Bansinath, Julia Edelstein, James D. Walsh, Sangeeta Singh-Kurtz, and Danya Issawi."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZXMteHJwLWVtZXJnZXMtYXMtYS10b3AtaW52ZXN0bWVudC1jaG9pY2UtYW1vbmctbWFqb3ItYmFua3Mv0gFgaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvcmlwcGxlcy14cnAtZW1lcmdlcy1hcy1hLXRvcC1pbnZlc3RtZW50LWNob2ljZS1hbW9uZy1tYWpvci1iYW5rcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ripple’s XRP Emerges as a Top Investment Choice Among Major Banks - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nIn a significant development for the cryptocurrency sector, Ripple’s XRP has been identified as a preferred investment choice among the world’s leading banks, according to a new report by the Basel Committee on Banking Supervision (BCBS). The BCBS, the principal global standard-setter for banks’ prudential regulation, has introduced a comprehensive dataset focusing on banks’ engagement with crypto-assets.\n\nThe BCBS Cryptoasset Data Collection Template\n\nThis dataset stems from a cryptoasset data collection template launched by the BCBS in 2018. The template was designed to align with the Committee’s consultative documents from June 2021 and June 2022 on the prudential treatment of crypto asset exposures. It offers detailed insights into banks’ crypto holdings, facilitating an analysis of their exposures. Data for this report was provided by nine banks from the Americas, seven from Europe, and two from other regions.\n\nXRP’s Prominent Position in the Banking Sector\n\nThe findings reveal that XRP, the third-largest altcoin, constitutes a significant portion of the banks’ cryptocurrency engagements. Specifically, XRP accounts for 2% of the total €9.4 billion exposure in the sector, amounting to approximately €188 million ($205 million).\n\nInvestment Perspectives on XRP\n\nAmidst a general anticipation for Bitcoin ETF approvals, Ripple’s XRP has established itself as a solid and attractive investment option. John Deaton, a pro-XRP attorney and founder of CryptoLaw, recently advised against making investment decisions based on a fear of missing out (FOMO). He suggests investing in cryptocurrencies like XRP before such market sentiments take hold, citing examples of XRP’s price movements around key events.\n\nConcurrently, Ali Martinez, a renowned crypto analyst, predicts a bullish trend for XRP. His analysis is based on the TD Sequential indicator and a notable increase in activities by XRP whales, signalling a potential shift in market dynamics."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1ob3Blcy1yaXNlLWFzLXJpcHBsZS1nYWlucy11cHBlci1oYW5kLWluLXNlYy1sYXdzdWl0LTEzODk4NzXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "XRP News: Hopes Rise as Ripple Gains Upper Hand in SEC Lawsuit - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzExLzIwL3JpcHBsZS1leGVjLXNheXMteHJwLWFuZC14bG0tc2V0LXRvLWJlY29tZS10aGUtcGVwc2ktYW5kLWNvY2EtY29sYS1vZi1jZW50cmFsLWJhbmstdXRpbGl0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ripple Exec Says XRP and XLM Set to Become the Pepsi and Coca-Cola of Central Bank Utility - The Crypto Basic",
        "content": "An unnamed Ripple executive believes XRP and XLM, two assets with similar functionalities, could serve as the Pepsi and Coca-Cola of the coming financial revolution in terms of central bank utility.\n\nFrancis Hunt (The Market Sniper), a veteran trader and technical analyst, revealed this while speaking with Versan and Vandell Aljarrah in the latest episode of the Black Swan Capitalist podcast.\n\nXRP and XLM: An Uncanny Similarity\n\n“Do you believe that these two technologies are going to be the foundation of what’s yet to come,” Versan asked Hunt, pointing to the similarities between XRP and Stellar (XLM) in terms of their underlying technologies and their price movements.\n\n- Advertisement -\n\nRecall that Jedd McCaleb, one of the original architects of the XRP Ledger (XRPL), launched the Stellar network in 2014. Before this, McCaleb served as the Chief Technology of Ripple until 2013 when he left. Being one of the original architects of the XRPL, McCaleb’s Stellar blockchain has similarities with the original ledger.\n\nInterestingly, XLM, the native token of the Stellar network, has continued to mirror XRP’s price movements. When XRP rallied to an ATH of $3.3 in January 2018, XLM also surged to an ATH of $1.05. Upon XRP’s collapse the next month, XLM also dropped. XLM also mirrored XRP’s surge in April 2021 and similar surges this year.\n\nXRP and XLM Akin to Pepsi and Coca-Cola?\n\nIn the Black Swan Capitalist episode, Versan called attention to these similar price movements, asking for Hunt’s opinion on the role both assets could play in the coming financial revolution.\n\nIn response, Hunt disclosed that his community has a high-ranking Ripple executive who has insider knowledge on the workings of the company. While he failed to mention who this executive is, Hunt revealed that the individual likens XRP and XLM to the Pepsi and Coca-Cola of the financial scene.\n\n- Advertisement -\n\nThe rationale behind this classification is that XRP and XLM are going to fulfill the “same functions,” according to the unnamed Ripple executive. Notably, both assets would become useful in the upcoming financial revolution in terms of central bank utility. This already happens on a small scale.\n\n“He mentioned that one or two of the Middle Eastern players, some that were committed potentially to the one, automatically said that other of the nation states that are typically a little bit adverse, would go with the other one,” Hunt remarked.\n\nIn essence, while the central banks of different nations would adopt XRP or XLM, both assets would provide similar functionalities. Additionally, the two assets would likely dominate the financial scene much like how Pepsi and Coca-Cola have taken a huge chunk of the soda industry."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9jcnlwdG8tcmlwcGxlLXJldm9sdXRpb25pemVzLXRoZS10b2tlbml6YXRpb24tb2YtcmVhbC1hc3NldHMtd2l0aC14cnAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Crypto: Ripple Redefines Tokenization - Cointribune EN",
        "content": "Mon 20 Nov 2023 ▪ 3 min of reading ▪ by Luc Jose A.\n\nRipple, the crypto platform behind XRP, is committed to the tokenization of multiple assets. Among them, fungible tokens, stablecoins, and Central Bank Digital Currencies (CBDC). As of the latest news, the XRP Ledger (XRPL), the decentralized public blockchain that Ripple uses for issuing XRP, has made progress. It is venturing into the tokenization of real assets, positioning Ripple as a key player in decentralized finance and the blockchain ecosystem.\n\nStrategic Evolution for Ripple’s XRP Ledger\n\nThis Saturday, November 18th, David Schwartz, the Chief Technology Officer at Ripple, revealed in an interview a significant strategic change for the XRP Ledger (XRPL), the blockchain created by Ripple that supports XRP, Ripple’s native asset.\n\nThe executive has announced that the XRPL is expanding with regards to the tokenization of assets. From now on, the blockchain will accommodate the tokenization of real-world assets, in addition to virtual assets such as stablecoins and CBDCs in particular.\n\nThis news resonates as a change in priority. At least, that is what can be inferred from Schwartz’s explanations during the interview. It suggests that there is now a focus on the expanded potential of the XRPL blockchain, despite the popularity of XRP.\n\nThe Ripple executive particularly praised the unique position of the XRPL as the first layer 1 blockchain independent of Bitcoin technology—a distinctive feature that has been maintained since its inception in the early 2010s.\n\nXRPL: David Schwartz Reveals XRPL's New Focus on Asset Tokenization #XRP https://t.co/Q0xZiyXvOZ — MOLT MEDIA (@MoltMoney) November 18, 2023\n\nXRPL, the Market Leader in the Tokenization of Real Assets?\n\nCould the XRPL blockchain position itself and emerge as the leader in the tokenization of real assets? Nothing is less certain at the moment. But in any case, the ambition is certainly there.\n\nIndeed, David Schwartz envisions the XRPL becoming the most important crypto platform dedicated to tokenizing real-world assets. This is due to its attractive features, including low transaction fees. However, it will have to break away from the competition.\n\nBecause with this development, the XRPL is entering into direct competition with behemoths of traditional finance. Specifically, JPMorgan and Bank of America, which are already very active in this area. This marks a notable advancement in the evolving ecosystem of blockchain.\n\nIn any case, the competition in this segment promises to be tough considering the potential represented by the asset tokenization market. According to estimates, it could be worth up to 30 trillion dollars by 2030. It’s easy to see why this crypto segment is booming, attracting considerable interest from the giants of finance.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    }
]