[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA3LTE0L3JpcHBsZS1pcy1hLXNlY3VyaXR5LWFuZC1pdC1pc24tdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Ripple Is a Security and It Isn't - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wNy0xNC9yaXBwbGUtY2VvLWJyYWQtZ2FybGluZ2hvdXNlLWNhbGxzLXRoZS1zZWMtYS1idWxseS1mcmVzaC1vZmYteHJwLXRva2VuLXJ1bGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Ripple CEO Brad Garlinghouse Calls SEC a 'Bully' Fresh Off XRP Token Ruling - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTE0L3doeS10aGUtY3J5cHRvLXByaWNlLXJhbGx5LWFmdGVyLXJpcHBsZS1zZWMtcnVsaW5nLW1heS1iZS1wcmVtYXR1cmUteHJw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Why the Crypto Price Rally After Ripple SEC Ruling May Be Premature (XRP) - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L3VzLWNvdXJ0LXJ1bGVzLWluLWZhdm91ci1vZi1yaXBwbGUtbGFicy1pbi1zZWMtY2FzZS1vdmVyLXhycC1jcnlwdG9jdXJyZW5jeS9hcnRpY2xlc2hvdy8xMDE3NDQ4NzkuY21z0gGVAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS90ZWNoL3RlY2hub2xvZ3kvdXMtY291cnQtcnVsZXMtaW4tZmF2b3VyLW9mLXJpcHBsZS1sYWJzLWluLXNlYy1jYXNlLW92ZXIteHJwLWNyeXB0b2N1cnJlbmN5L2FtcF9hcnRpY2xlc2hvdy8xMDE3NDQ4NzkuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "US court rules in favour of Ripple Labs in SEC case over XRP cryptocurrency - The Economic Times",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDcvMTQvY29pbmJhc2UtYnVveWVkLWluLWNhc2UtYWdhaW5zdC1zZWMtYWZ0ZXItbGFuZG1hcmstcmlwcGxlLXhycC1kZWNpc2lvbi5odG1s0gFvaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDcvMTQvY29pbmJhc2UtYnVveWVkLWluLWNhc2UtYWdhaW5zdC1zZWMtYWZ0ZXItbGFuZG1hcmstcmlwcGxlLXhycC1kZWNpc2lvbi5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "'I think we will win': Coinbase buoyed in case against SEC after landmark Ripple XRP decision - CNBC",
        "content": "Coinbase's arguments in its legal case against the U.S. Securities and Exchange Commission have been strengthened after a key court ruling went partially in favour of cryptocurrency firm Ripple, the U.S. exchange's legal chief told CNBC on Friday.\n\nOn Thursday, a U.S. judge ruled that XRP token purchases via exchanges were not securities transactions. The SEC sued Ripple, the company behind the XRP token, in 2020, alleging that the company broke securities laws.\n\nThe ruling was cheered by the cryptocurrency community and particularly by exchanges, which feel the outcome will help create some more regulatory clarity.\n\nOne such exchange is Coinbase, which was sued in June by the SEC on charges of operating an unregistered exchange and broker.\n\nBut the latest XRP court opinion has given confidence to Coinbase in its case against the SEC.\n\n\"For exchanges, for tokens that are listed on exchanges, for regular investors, there's no question that this ruling strikes a blow to the idea that somehow securities are being traded when people go onto exchanges and trade the assets,\" Paul Grewal, chief legal officer at Coinbase, told CNBC in a TV interview on Friday.\n\n\"I think we will win. Now, I thought we would win before this decision. We think this decision has only further strengthened the case,\" he added.\n\nPart of Coinbase's optimism stems from the decision regarding XRP not being a security. If XRP isn't designated such, there is hope that hundreds of other cryptocurrencies will also not be subject to security laws.\n\n\"I think it would be a mistake to assume that, in every instance, and in every transaction, the securities laws do not apply. That's never been Coinbase's position, I don't think it should be anyone's reasonable position. But if you literally replaced the letters XRP with the letters for any other token, in this decision, the logic still holds,\" Grewal said.\n\nHowever, another part of the judgement actually deemed it a securities transaction to sell XRP specifically to sophisticated investors or institutional clients."
    }
]