[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9yaXBwbGUteHJwLWRvbWluYXRlcy1ldGhlcmV1bS1ldGgtaW4taW50ZXJlc3QtaW4tYWxtb3N0LWV2ZXJ5LXVzLXN0YXRlL9IBZGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9yaXBwbGUteHJwLWRvbWluYXRlcy1ldGhlcmV1bS1ldGgtaW4taW50ZXJlc3QtaW4tYWxtb3N0LWV2ZXJ5LXVzLXN0YXRlLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Ripple (XRP) Dominates Ethereum (ETH) in Interest in Almost Every US State - CryptoPotato",
        "content": "TL;DR\n\nGoogle Trends data shows that XRP is more popular than Ethereum in 47 US states, with the highest interest coming from Delaware, Nevada, Louisiana, Arizona, and Hawaii.\n\nXRP’s price fluctuations throughout 2023 have been influenced by the ongoing lawsuit between Ripple and the US SEC, with Ripple’s partial wins in court contributing to a positive trend.\n\nForecasting the future value of XRP varies greatly among analysts, with estimates ranging from a moderate increase to $0.90 by next summer to an extreme prediction of $500, which would require a market capitalization far exceeding the current total crypto market cap.\n\nAmericans are Interested in Ripple (XRP)\n\nRipple’s native token – XRP – seems to be a highly intriguing topic for many Americans. According to Google Trends data, the residents of 47 states have displayed higher interest in the asset than Ethereum (ETH).\n\nDelaware, Nevada, Louisiana, Arizona, and Hawaii are the regions where XRP is the most popular. On the other hand, Vermont, New York, Oregon, and the District of Columbia are the only areas where Ethereum has surpassed Ripple’s coin.\n\nXRP’s price has gone through numerous ups and downs since the beginning of 2023, experiencing a significant uptrend in the second half of the year. The positive performance could be a result of the developments surrounding the lawsuit between Ripple and the US SEC, specifically the three partial wins that the blockchain enterprise has secured so far.\n\nThe outcome of the legal battle, which has been ongoing since December 2020, is expected to be revealed in the spring of 2024 during a grand trial. Multiple analysts and experts have predicted that a decisive win for Ripple could propel a further jump for XRP.\n\nSome of the XRP Forecasts\n\nThe popular X (Twitter) user CrediBULL argued that the asset’s valuation could rise to approximately $0.90 by the summer of next year.\n\nWhile such a prediction sounds somewhat realistic, other analysts, like Shannon Thorp, have envisioned astronomical increases. She assumed that XRP could explode to $500 in the following years.\n\nIt is worth mentioning that the coin’s market capitalization should spike to over $250 trillion for this to happen. In comparison, the entire market cap of the sector was “just” $3 trillion in 2021 when many digital assets, including Bitcoin (BTC), charted all-time highs.\n\nThose curious to check how high XRP could shoot in the remaining months of the ongoing year could take a look at the video below:"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NyeXB0by1sYXd5ZXItam9obi1kZWF0b24tYmVsaWV2ZXMtcmlwcGxlLWhhcy05MC1jaGFuY2Utb2Ytd2lubmluZy1zZWMtbGF3c3VpdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Crypto lawyer John Deaton believes Ripple has 90% chance of winning SEC lawsuit - CryptoSlate",
        "content": "Well-known crypto attorney John Deaton believes that the SEC only has a 10% chance of winning its dispute with Ripple, with 90% odds in the company’s favor.\n\nDeaton said that a settlement of $20 million or less would represent a significant legal triumph for Ripple, a sentiment echoed by many in the crypto community.\n\nRipple vs. SEC\n\nThe lawsuit, which the SEC initiated against Ripple Labs in December 2020, alleged that the company conducted an unregistered securities offering by selling its native token, XRP.\n\nHowever, the case has evolved significantly in recent months, when Judge Analisa Torres determined that XRP was not a security when traded on the secondary market. Moreover, the charges against Ripple executives were reduced along the way.\n\nDeaton’s recent comments were prompted by a post from Ripple’s Chief Legal Officer Stuart Alderoty, who highlighted that the SEC faced a recent defeat in the case of the SEC versus Govil, where the U.S. Court of Appeals for the Second Circuit ruled that the SEC cannot request a substantial disgorgement award without first demonstrating actual financial harm to investors.\n\nIn essence, the ruling implies that if there’s no harm, there’s no penalty.\n\n90% chance of win\n\nDeaton strongly refuted that the lawsuit’s outcome was an even 50/50 for the SEC, contending that it’s closer to a 90/10 advantage in favor of Ripple. His assessment resonates with the sentiment in the crypto community, which generally views a suggested $20 million settlement as a favorable resolution for Ripple.\n\nThe ongoing legal battles have brought Ripple and the SEC to the forefront of discussions in the crypto space. The uncertainty surrounding the legal status of XRP and other digital currencies has left many in the industry closely following the developments in this case.\n\nIn a related development, Judge Analisa Torres recently approved an order regarding the SEC and Ripple’s joint request to propose a briefing schedule to address institutional sales of XRP. This aspect of the lawsuit pertains to the segment in which Ripple was determined to have breached securities laws.\n\nBoth parties have been instructed to provide a joint briefing schedule no later than Nov. 9, suggesting that further developments in the case are on the horizon.\n\nThe case also serves as a significant reference point for the broader regulatory environment for digital currencies as the industry navigates evolving legal interpretations and regulations.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1yaXBwbGVzLWdsb2JhbC1leHBhbnNpb24tc3BhcmtzLWludmVzdG9yLWZyZW56eS1hbWlkLXNlYy1sYXdzdWl0LTEzODYyNTjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "XRP News: Ripple's Global Expansion Sparks Investor Frenzy Amid SEC Lawsuit - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS94cnAtbGF3eWVyLW91dGxpbmVzLTk5OS13aW4tc2NlbmFyaW8taW4tcmlwcGxlLXNlYy1sYXdzdWl00gFOaHR0cHM6Ly91LnRvZGF5L3hycC1sYXd5ZXItb3V0bGluZXMtOTk5LXdpbi1zY2VuYXJpby1pbi1yaXBwbGUtc2VjLWxhd3N1aXQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "XRP Lawyer Outlines 99.9% Win Scenario in Ripple SEC Lawsuit - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nXRP holders' attorney and CryptoLaw founder, John Deaton, has outlined a scenario that would lead to a 99.9% win for Ripple in the SEC lawsuit.\n\nAdvertisement\n\nIn a tweet, Deaton argues that claims that the SEC got a 50-50 victory in the Ripple case were wrong. He goes on to say that the outcome was more like 90-10 in Ripple's favor, which would amount to a 99.9% legal victory if Ripple ends up paying $20 million or less as penalties.\n\nThe people who’ve argued that the SEC got a 50-50 victory in the @Ripple case are 💯 wrong. It was more like 90-10 in Ripple’s favor. If Ripple ends up paying $20M or less it’s a 99.9% legal victory. https://t.co/Xe6SYBiTCJ — John E Deaton (@JohnEDeaton1) November 4, 2023\n\nDeaton said this in response to Ripple general counsel Stuart Alderoty's tweet highlighting the SEC's loss in the Govil case, in which the 2nd Circuit ruled that the SEC could not seek crippling disgorgement without first establishing that \"investors\" suffered actual financial harm.\n\nLegal attorney and XRP enthusiast Jeremy Hogan pointed out the significance of this argument as the Ripple SEC lawsuit is presently in the \"damages\" phase. Hogan implies that this means that XRP holders would need to have suffered losses for Ripple to be liable.\n\nAs the Ripple SEC lawsuit progresses, the next key date could be Nov. 9, 2023, when the parties are expected to jointly propose a briefing schedule about remedies. The SEC and Ripple are likely to meet before this date to discuss a potential briefing schedule for which remedies are appropriate against Ripple for Section 5 violations related to its institutional sales of XRP.\n\nNo settlement talks, no IPO, John Deaton says\n\nIn a separate tweet, Deaton quells two \"unpopular\" opinions. First, there are no current or ongoing settlement talks between Ripple and the SEC; and second, Ripple has zero plans of issuing an IPO before June 2024.\n\nIt should be recalled that on Oct. 23, an order was signed officially by Judge Torres dismissing the case against Ripple executives Brad Garlinghouse and Chris Larsen.\n\nThe voluntary dismissal obviates the need for the scheduled trial on the claim against the Ripple defendants and thus moots an earlier scheduling order, which included that the SEC and Ripple discuss settlement before the pretrial conference.\n\nAlso, chances of an IPO are slim, as the SEC must approve Ripple's S-1 before going public, which may not happen at the moment due to the ongoing lawsuit."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmhjcGxpdmUuY29tL3ZpZXcvc3VtaXQtc2hhcm1hLW1kLTYtbW9udGgtcmVzdWx0cy1waGFzZS0yLXJpcHBsZS0xLXRyaWFs0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Sumit Sharma, MD: 6-Month Results from Phase 2 RIPPLE-1 Trial - MD Magazine",
        "content": "An intravitreal sustained-release dexamethasone implant, IBE-814 IVT, improved vision and reduced treatment burden among patients with retinal vein occlusion (RVO) or diabetic macular edema (DME), according to new 6-month results from the first-in-human phase 2 RIPPLE-1 trial.\n\nThe 6-month data, presented at the 127th Annual American Academy of Ophthalmology (AAO) Meeting in San Francisco, California, showed all patient cohorts experienced a reduction in central subfield thickness (CST) and improvement or stabilization of best-corrected visual acuity (BCVA).\n\n“The promise for patients is really the reduction in the treatment burden, because one thing they hate the most is how frequently they need to come in for injections,” Sumit Sharma, MD, an assistant professor of ophthalmology, Cole Eye Institute, Cleveland Clinic, told HCPLive. “Anytime we can reduce that with an adjunctive therapy, it’s helpful. I don’t think this would ever be a first-line therapy, but I do think it would be something to consider for patients who’ve had anti-VEGF and still have fluid or require very frequent treatment.”\n\nThe IBE-814 intravitreal implant is performed with a 30-gauge needle with a 6-mm implant, an advantage over a 22g x 6mm commercial dexamethasone implant. The implant has improved durability of 6–9 months and the smaller needle size is less invasive for patients.\n\nThe RIPPLE-1 study was the first-in-human study designed to evaluate the safety and efficacy of the IBE-814 intravitreal implant at 21 clinics across 4 countries. Inclusion criteria included a diagnosis of DME or RVO, age ≥45 years, visual acuity 20/40 to 20/320 (Snellen), and treatment-naive or previously treated.\n\nPatients were randomized to receive either the low-dose (single 70 µg implant) or high-dose (2 x 70 µg implant) implants at baseline. Patients were followed weekly and then monthly, with retreatment eligibility based on prespecified retreatment criteria between months 5 and 12. A safety follow-up was performed for up to 18 months.\n\nThe RVO cohort included 10 patients in the low-dose cohort and 15 patients in the high-dose cohort; the DME cohort included 23 patients in the low-dose group and 12 patients in the high-dose cohort. Subjects were primarily phakic, particularly in the RVO cohort, and there was a mixture of treatment-naive and prior-treated subjects in the RVO and DME cohorts.\n\nAt 6 months, among patients with RVO, the mean change in CST was –148 µm in the high-dose cohort and –188 µm in the low-dose cohort. Changes in BCVA showed an improvement of +6.4 letters in the high-dose cohort and +5.5 letters in the high-dose cohort. A total of 2 patients in the low-dose cohort and 3 patients in the high-dose cohort required rescue.\n\nFor patients with DME, 6-month results showed a mean change in CST of –68µm in the low-dose cohort and –94µm in the high-dose cohort. The corresponding mean change in BCVA showed a difference, with a gain of +8.7 letters in the high-dose cohort and a loss of –1.9 letters in the low-dose cohort. However, Sharma noted that 8 patients in the low-dose cohort required rescue treatment, compared to only 1 in the high-dose cohort.\n\nSafety data were consistent with other intravitreal steroids, with no serious ocular adverse events identified in the 6 months of study. Sharma noted a low rate of cataract formation in the first 6 months and no patient required surgical intervention for intraocular pressure (IOP).\n\nThere were no IOP elevations in the low-dose RVO group and all other subjects with IOP elevations required only eye drops for control, Sharma noted. The treatment burden was additionally reduced with IBE-814 intravitreal treatment.\n\nPatients with RVO in the low-dose and high-dose cohort achieved a reduction in treatment burden of –76% and –88%, respectively. Patients with DME in the low-dose and high-dose cohorts achieved a reduction in treatment burden of –57% and –73%, respectively. Sharma noted approximately 67% to 100% of patients experienced a reduction in the treatment burden and an increase in visual acuity, depending on the dose cohort and disease status.\n\nFor more insight into the analysis, watch the full interview with Dr. Sharma.\n\nReferences\n\nIntravitreal Sustained-Release Dexamethasone Implant for Diabetic Macular Edema and RVO: Six-Month Results From the First-in-Human Phase 2 RIPPLE-1 Trial. Presented at the 2023 American Academy of Ophthalmology Annual Meeting, November 3 – 6, 2023."
    }
]