[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDkvMjAvcmVhbGVzdGF0ZS80MDAwMDAtZG9sbGFyLWhvbWVzLWluZGlhbmEtdmlyZ2luaWEtbmV3LXlvcmsuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "$400000 Homes in Indiana, Virginia and New York - The New York Times",
        "content": "Indianapolis | $399,900\n\nA 1946 Cape Cod-style house with three bedrooms and two bathrooms, on a 0.3-acre lot\n\nThis property is on a tree-lined street abutting Broad Ripple Park; the backyard gate opens into the park, where walking trails offer views of the White River. It is a few blocks from the small businesses, restaurants and big-box retailers on Broad Ripple Avenue, and from a shopping center with a Target and a Lowe’s. A Saturday-morning farmers’ market that operates year-round is about a mile away. Broad Ripple High School is a five-minute drive.\n\nDowntown Indianapolis is about 20 minutes away. Driving to Cincinnati or Louisville, Ky., takes about two hours.\n\nSize: 3,002 square feet\n\nPrice per square foot: $133\n\nIndoors: A paved path leads from the driveway to steps that rise to the entrance.\n\nThe front door opens into a sunroom with windows facing the street and side yard. From there, another door opens into a foyer with hardwood floors that continue into a living room with backyard-facing windows and a fireplace set in a wall of exposed brick."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDkvMjAvcmVhbGVzdGF0ZS80MDAwMDAtZG9sbGFyLWhvbWVzLWluZGlhbmEtdmlyZ2luaWEtbmV3LXlvcmsuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "$400000 Homes in Indiana, Virginia and New York - The New York Times",
        "content": "Indianapolis | $399,900\n\nA 1946 Cape Cod-style house with three bedrooms and two bathrooms, on a 0.3-acre lot\n\nThis property is on a tree-lined street abutting Broad Ripple Park; the backyard gate opens into the park, where walking trails offer views of the White River. It is a few blocks from the small businesses, restaurants and big-box retailers on Broad Ripple Avenue, and from a shopping center with a Target and a Lowe’s. A Saturday-morning farmers’ market that operates year-round is about a mile away. Broad Ripple High School is a five-minute drive.\n\nDowntown Indianapolis is about 20 minutes away. Driving to Cincinnati or Louisville, Ky., takes about two hours.\n\nSize: 3,002 square feet\n\nPrice per square foot: $133\n\nIndoors: A paved path leads from the driveway to steps that rise to the entrance.\n\nThe front door opens into a sunroom with windows facing the street and side yard. From there, another door opens into a foyer with hardwood floors that continue into a living room with backyard-facing windows and a fireplace set in a wall of exposed brick."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDkvMjAvcmVhbGVzdGF0ZS80MDAwMDAtZG9sbGFyLWhvbWVzLWluZGlhbmEtdmlyZ2luaWEtbmV3LXlvcmsuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "$400000 Homes in Indiana, Virginia and New York - The New York Times",
        "content": "Indianapolis | $399,900\n\nA 1946 Cape Cod-style house with three bedrooms and two bathrooms, on a 0.3-acre lot\n\nThis property is on a tree-lined street abutting Broad Ripple Park; the backyard gate opens into the park, where walking trails offer views of the White River. It is a few blocks from the small businesses, restaurants and big-box retailers on Broad Ripple Avenue, and from a shopping center with a Target and a Lowe’s. A Saturday-morning farmers’ market that operates year-round is about a mile away. Broad Ripple High School is a five-minute drive.\n\nDowntown Indianapolis is about 20 minutes away. Driving to Cincinnati or Louisville, Ky., takes about two hours.\n\nSize: 3,002 square feet\n\nPrice per square foot: $133\n\nIndoors: A paved path leads from the driveway to steps that rise to the entrance.\n\nThe front door opens into a sunroom with windows facing the street and side yard. From there, another door opens into a foyer with hardwood floors that continue into a living room with backyard-facing windows and a fireplace set in a wall of exposed brick."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDkvMjAvcmlwcGxlLW5ldy1yZXBvcnQtc2hvd3MtOS1vdXQtb2YtMTAtY2VudHJhbC1iYW5rcy1leHBsb3JpbmctY2JkY3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Ripple New Report Shows 9 Out of 10 Central Banks Exploring CBDCs - The Crypto Basic",
        "content": "A recent report from Ripple suggests that nine out of every ten central banks are researching CBDCs, with some of these central banks turning to Ripple for CBDC partnerships.\n\nCentral Bank Digital Currency (CBDC) is a concept that has been gaining traction in recent years. The COVID pandemic, a decline in cash payments, and the growing adoption of cryptocurrencies have played a part in the growing trend.\n\nRipple has highlighted the growing CBDC trend in its latest report. According to the report, nine out of ten central banks are actively exploring the possibility of launching a CBDC.\n\n- Advertisement -\n\nThe report is based on a study conducted by the Bank for International Settlements. In the 2022 study, 81 central banks were surveyed. BIS reported that 90% of these apex banks are working on different stages of CBDC deployment.\n\nGrowing Global Adoption of CBDCs\n\nThe CBDC tracker of the Atlantic Council confirms the 2022 report from BIS. According to data from June 2023, 130 countries are in different stages of CBDC development. This figure represents 98% of the global GDP.\n\nThe Atlantic Council reports that 19 of the G20 countries are in advanced stages of CBDC development. In addition, 11 countries have fully embraced the CBDC technology.\n\nChina leads the pack, performing over $3.6 billion in monthly transactions with the digital yuan. Juniper Research confirms the growing trend, predicting that CBDC payments will reach $213 billion by 2030.\n\n- Advertisement -\n\nCentral Banks Are Turning To Ripple for CBDCs\n\nRipple’s VP of CBDC, James Wallis, suggested that partnerships with the private and public sectors are essential to drive CBDC growth. According to him, the central banks can control the infrastructure while the private sector introduces the innovation.\n\nIn May, Ripple launched a platform to help central banks issue their CBDCs. Ripple’s CBDC platform allows central banks to mint, distribute, redeem, and burn tokens. In August, Ripple reported that eight central banks were already building on this platform.\n\nThe platforms offer apex banks more customizable and efficient CBDCs. The Ripple CBDC platform is powered by the XRP Ledger (XRPL). However, it is built on an independent private ledger.\n\nRipple explains that countries are increasing their adoption of CBDCs because the technology offers greater efficiency in both domestic and cross-border payments. CBDCs can also help them expand their financial inclusion by offering access to payments and credit products.\n\nThe increasing adoption of CBDCs will also be felt in the private sector. As a result, they have predicted that CBDCs have the potential to reshape the global banking and financial system."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS1uZXdzLWJpZy1iYW5rcy1hcmUtc2hpZnRpbmctdG8teHJwLWNvdWxkLWl0LXJlYWxseS1yaXZhbC1iaXRjb2luL9IBZ2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS1uZXdzLWJpZy1iYW5rcy1hcmUtc2hpZnRpbmctdG8teHJwLWNvdWxkLWl0LXJlYWxseS1yaXZhbC1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Ripple News: Big Banks Are Shifting to XRP; Could It Really Rival Bitcoin? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights Financial giants like BlackRock and Fidelity are making significant investments in crypto.\n\nBanks are also embracing crypto, with Citigroup and ANZ Bank making moves.\n\nRipple's XRP is a strong contender to become the next Bitcoin, given its strong fundamentals, growing adoption, and the backing of major financial players.\n\nWith the rise of crypto and its growing acceptance in the financial world, the question of whether XRP could become the next Bitcoin is one that is on the minds of many. Renowned crypto analyst, George Tung, offers his insights into this intriguing possibility.\n\nThe Wall Street Whales Move In\n\nThe financial sector is increasingly taking notice of crypto, with giants like Van Eyck and BlackRock making significant investments. BlackRock, in particular, has acquired shares in top Bitcoin miners and MicroStrategy, suggesting a strategic approach to the crypto landscape. This is further evidenced by Larry Fink’s vision of a tokenized future, which Tung sees as indicative of a broader shift in focus away from solely Bitcoin.\n\nOther heavyweights, such as Fidelity, are also heavily invested in Bitcoin miners and actively hiring for token research. Together with BlackRock, they are poised to make a significant impact on the digital asset arena.\n\nRead More: Is BlackRock Secretly Influencing Bitcoin Price? Here’s the Truth.\n\nThe Banks Join the Fray\n\nTraditionally cautious banks are also embracing crypto. Citigroup is set to allow affluent clients to use a private blockchain to transfer assets, and ANZ Bank is using Chainlink’s CCIP to achieve cross-chain interoperability. This highlights the growing potential of tokens in the modern financial era.\n\nRipple’s XRP: A Contender?\n\nTung emphasizes that Ripple’s XRP is not lagging behind, with CEO Brad Garlinghouse hinting at its potential role in driving interoperability in the crypto domain.\n\nGlobal Adoption\n\nWith Hong Kong opening its doors to crypto trading for its citizens, it is clear that the world is moving towards broader crypto acceptance. This, coupled with the growing interest from financial institutions, suggests that XRP does have massive potential to become the next Bitcoin.\n\nAlso Read: Top Reasons Why XRP is About to Become Way Bigger Than Everyone Thinks\n\nWhile it is impossible to say for certain whether XRP will indeed become the next Bitcoin, its strong fundamentals, growing adoption, and the backing of major financial players make it a compelling contender."
    }
]