[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDMvMjkvY2FzcGVyLWFzc29jaWF0aW9uLXByb2dyYW0tbWFuYWdlci1oaW50cy1hdC1yaXBwbGUteHJwbC1wYXJ0bmVyc2hpcC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Casper Association Program Manager Hints at Ripple, XRPL Partnership - The Crypto Basic",
        "content": "Casper loves XRP.\n\nRipple is no stranger to partnerships, but it is not very often that the blockchain payments firm partners with native Web3 companies.\n\nPiotr Dziubecki, Casper Association program manager, has hinted at a partnership between Casper and Ripple that would potentially involve the XRP Ledger. The program manager let this slip in an interview with Casper content creator Rekt Wojak at Invest Cuffs 2023 hosted in Poland last week. Notably, both communities already enjoy a strong bond on Twitter.\n\n- Advertisement -\n\nWojack shared the interview on YouTube yesterday. Excerpts from it have since made the rounds on crypto Twitter.\n\nDziubecki said both parties plan to connect their business development teams to see how the Casper blockchain and the XRP Ledger can work together. Notably, the program manager had the opportunity to meet with Ripple representatives at Paris Blockchain Week, where he said both parties had a productive half-hour conversation.\n\n“You know, we have our own strengths,” Dziubecki said. “And I think it would be a waste to not to utilize this in our synergy.”\n\n- Advertisement -\n\nMeanwhile, Ripple and the XRP community are not the only ones the Casper Association is open to working with. The program manager also noted that they were also interested in working with Algorand and Hedera.\n\nCasper is something of a rising star in the crypto industry. Casper Labs launched the proof-of-stake (PoS) enterprise blockchain of the same name in May 2021, less than two years ago.\n\nHowever, with features like upgradable smart contracts, the ability to host permissioned applications, predictable network fees and easy programmability due to WebAssembly (WASM) use, it has appealed to large corporations and government institutions within this short space of time.\n\nConsequently, its list of partners currently includes giants like IBM, Amazon Web Service and Google Cloud. In January, IPwe – an intellectual property management company – tapped it to convert 25 million patents into non-fungible tokens.\n\nIt remains to be seen what a Casper and Ripple partnership would entail. However, the communities are excited by the prospect."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LjNibG1lZGlhLmNvbS9uZXdzL2xpc3Rlbi1jaG9pY2VzLXJpcHBsZS1iZXlvbmQtdXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Listen: The Choices That Ripple Beyond Us - 3BL Media",
        "content": "Listen: The Choices That Ripple Beyond Us\n\nMar 29, 2023 12:25 PM ET\n\nFaced with a growing list of challenges, a young Juan Perez decided to transform his life and find a job that could provide him and his young family a better future. He found that job at Koch. It's a decision that changed him and his family in ways he never imagined.\n\nWhen a young Juan Perez first arrived in the United States from Mexico, he hopped from job to job, never really finding anything that stuck. But he wanted a fulfilling long-term career, and to provide a better life for his family. At the time, he had two young girls with a third on the way. He realized that if he was going to achieve his goals, he'd have to change – and find somewhere that would value his contributions and nurture his career ambitions.\n\nDetermined, he camped outside the Koch headquarters in Wichita, Kansas, to make sure he was the first person to show up to a hiring event at a Koch-Glitsch career fair. The plan worked, and he landed his first role as a forklift driver at the company's manufacturing facility. Unlike his past jobs, this one stuck. Over his next 30 years at Koch, he was able to move into various roles designed to leverage his interests and aptitudes, ranging from equipment programming, the shop floor, to the office before retiring in 2021.\n\nHe didn’t know it when he started at Koch, but that decision to apply for the job and stick with the company would impact him and his entire family for decades to come. The principles that helped him on his own journey to self-actualize – to learn as much as he could, to continuously improve himself and those around him, and to pursue new opportunities – are the same principles benefitting two of his daughters today, who now work at Koch.\n\nLiz Morales, Juan's oldest daughter, has been at Koch for 16 years and currently works as a treasury director. Lisa Loera, Juan's youngest daughter, has been at Koch nine years and is a human resources analyst after working in accounting for six years. They've each experienced their own individualized career journeys at Koch as their interests and skills evolved.\n\nLiz says nobody could have imagined the long-term impact their father's decision to get a job at Koch would have – first on their father, then on them and now on their own children. Liz and Lisa say they're doing their best to teach their own children the same values instilled in them by their father, as the impact of Juan's decision to change his career trajectory continues to ripple outward.\n\nTo hear more of their story, in their own words, listen to the audio story here."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vd3d3Lmpzb25saW5lLmNvbS9vYml0dWFyaWVzL21qczA3NjEyMNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Harold Leo Ripple Obituary - Milwaukee Journal Sentinel",
        "content": "Harold Leo Ripple, age 88, passed away peacefully surrounded by family on Wednesday, March 29, 2023, at Baraga County Memorial Hospital in L’Anse, MI. He was born December 28th, 1934, the youngest of eight children of Mary Markus and Aleck Ripple in Plummer, MN. Harold spent most of his childhood in Minnesota and then moved to Washington State with his family. He completed his undergraduate studies at Gonzaga University and then earned his medical degree at Marquette Medical School in Milwaukee, WI. Harold married Arlene Graap on June 6th, 1960, in Milwaukee, WI. He then served three years in the Navy at Camp Pendleton, CA and then Great Lakes Naval Base, IL. He practiced medicine for over 25 years in Milwaukee, WI where he and Arlene raised their six kids. Later in his career and after retirement, Harold traveled to Honduras and then Africa doing medical mission work. This was a labor of love for Harold and one of the most meaningful parts of his work. After retiring from medicine, he and Arlene embarked on a new adventure in the Upper Peninsula of Michigan buying The Aurora Borealis Resort, where they enjoyed hosting many visitors in their cabins over 30 years. Here in the Skanee/L’Anse/Baraga area they have made close, lifelong friendships. Harold enjoyed serving the community in several capacities including the Arvon Township School Board and Baraga County Memorial Hospital Board of Trustees. A highlight for him was his contribution to the establishment of Ripple Recovery House. In this work, he joined others who are passionate about the mission to help people in recovery from substance use. Perhaps his greatest accomplishment was his commitment and devotion to his family and friends. His legacy is one of service, love, and dedication. He is survived by his wife of 63 years, Arlene, his children Jeff (Mike), Todd (Sharlene), Greg (Holly), Paul (Marianna), Amy (Charles) Petersen, and Katy (Daniel) Christensen. He is also survived by his cherished sister, Helen, and his grandchildren Nicholas and Alexandria Petersen, Remy and Celia Ripple, Grace and Hazel Christensen, his step-grandchildren Christine, Kenny and Mary Gilbert and Michael and McKenzie Dennis as well as numerous nieces and nephews. He was also the most doting great grandfather to the newest addition, Lincoln Petersen. He was preceded in death by his parents, Mary and Aleck and his siblings Juanita, Jack (Patricia), Virginia (William) Hudson, Mary Ann, Lila, and Gordon (Doris). A funeral mass will be held on Monday, April 10th at 11:00 a.m. at Sacred Heart of Jesus Church, 16 6th Street, Lanse, MI 49946, with Fr. Corey Litzner officiating. Visitation will be for one hour prior to the service at the church. A luncheon will follow the mass in the church hall. Burial will be in the spring in the Skanee Cemetery. Jacobson Funeral Home is assisting the family. In lieu of flowers, donations may be made to: Ripple Recovery House, Great Lakes Recovery, Attn: Laura Guichin, 94 South 4th Street, Ishpeming, MI 49849. Friends may sign Harold's guest book or send condolences at www.jacobsonfunerahome.com.\n\nPosted online on March 31, 2023 Published in Journal Sentinel"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3RlY2hwb2ludC5hZnJpY2EvMjAyMy8wMy8yOS9jb2xsYXRlcmFsLW5ldHdvcmstY29sdC1zdXJnZXMtZm9yd2FyZC1hcy1jb25jZXJucy1tb3VudC1hbW9uZy1iaW5hbmNlLWJuYi1hbmQtcmlwcGxlLXhycC1pbnZlc3Rvci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Collateral Network (COLT) Surges Forward as Concerns Mount Among Binance (BNB) and Ripple (XRP) Investor - Techpoint Africa",
        "content": "As concerns mount among investors of major cryptocurrencies such as Binance (BNB) and Ripple (XRP), Collateral Network (COLT)'s innovative approach has sparked interest and attracted a growing number of early investors. In this article, we will explore the features of Collateral Network (COLT) and why it has been gaining traction in the ongoing presale. With the current price of the COLT token at $0.01 this project has a lot of upside potential.\n\n>>BUY COLT TOKENS NOW<<\n\nCollateral Network (COLT)\n\nCollateral Network (COLT) is a revolutionary platform that enables individuals to access funds by using their physical assets as collateral. While traditional lending institutions often require a lengthy and cumbersome application process, Collateral Network (COLT) simplifies borrowing by providing a streamlined and efficient solution that leverages blockchain technology and asset backed NFTs.\n\nThe real USP of Collateral Network (COLT) is the minting of NFTs that represent the physical version of the asset. These NFTs are then fractionalized into smaller segments and can then be used to secure loans from the community against the asset. When the loan is paid back in full the NFTs are burned and the asset is returned to the original borrower.\n\nThe innovative way of bringing off-chain assets on-chain is great for both borrowers and lenders. Borrowers can unlock cash for their assets from anybody in the world without being restricted to a specific location. The cash can be provided as quickly as 24 hours discreetly without impacting their credit file. By providing a facility where multiple people can fund the loans, borrowers on the platform now have access to institutional level liquidity.\n\nLenders on the other hand have the opportunity to be part of the lucrative lending market and earn a passive income by developing their own book of loans and essentially becoming their own bank.\n\nWith its innovative approach to lending, Collateral Network (COLT) could potentially revolutionize the billion-dollar lending industry. The best part is that COLT tokens can be purchased for a discount of only $0.01 during phase 1 of the ongoing presale, representing an attractive opportunity for early investors.\n\nHowever you better be quick as the tokens available at this price are being snapped up quickly.\n\nBinance (BNB)\n\nBinance (BNB) is a unique cryptocurrency exchange that has quickly become a leader in the digital currency industry. Binance (BNB)'s founder, Changpeng Zhao, has been at the forefront of many innovative initiatives, including the creation of Binance Coin (BNB), which is used as the exchange's native cryptocurrency.\n\nBinance (BNB) has also expanded its offerings to include an NFT marketplace, DEX, and stablecoin. This has helped to solidify Binance (BNB)'s position as a leading player in the cryptocurrency industry and has attracted a diverse user base of investors and traders from around the world.\n\nHowever, Binance (BNB) has also faced its share of challenges, including regulatory scrutiny from the US SEC over allegations of selling unregistered securities. While this investigation could impact Binance (BNB)'s future growth in the US market, the exchange remains committed to providing its users with innovative products and services.\n\nBinance (BNB) will survive this legal challenge and continue to be a major player in the industry, but there's no denying that Binance (BNB) investors should be aware of the implications of this investigation.\n\n>>BUY COLT TOKENS NOW<<\n\nRipple (XRP)\n\nRipple (XRP) is a cryptocurrency that was developed in order to facilitate faster, cheaper international payments. Ripple (XRP) has gained widespread attention since its launch in 2012 due to its promise to revolutionize the banking sector.\n\nHowever, Ripple (XRP) is another coin to face scrutiny from the sec, as the regulator has filed a lawsuit against Ripple (XRP)'s parent company, alleging that it violated securities laws in its sale of XRP tokens. This situation has caused some investors to become concerned about their Ripple (XRP) holdings, especially as Ripple (XRP) has not returned to the all-time price of $3.84 in five years.\n\nIt remains to be seen how this situation will pan out, but in the meantime, many investors are looking for other options that offer more stability and security. One such option is Collateral Network (COLT), which has seen a surge of interest from these Ripple (XRP) holders as they look to diversify their portfolios.\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDMvMjkvY3J5cHRvLXRoZS1ncmFwaC1sdW5jLXhycC1yaXBwbGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Mar 2023 07:00:00 GMT",
        "title": "Crypto news: the prices and performance of The Graph (GRT), Terra Classic (LUNC) and Ripple (XRP) - The Cryptonomist",
        "content": "What crypto news is affecting the blockchain sector today? In particular, how are The Graph (GRT), Terra Classic (LUNC) and Ripple (XRP) performing? Below are all the details.\n\nAnalysis of The Graph, LUNC and Ripple (XRP) crypto assets\n\nIt is worth mentioning that The Graph is a decentralized protocol that aims to index data on blockchain. Its operation can be compared to that of a search engine, except that The Graph operates on decentralized networks.\n\nThe LUNC token, on the other hand, is the evolution of a coin and related blockchain that caused a stir both in its rising phase and when it “exploded.” The coin referred to is Luna and its related blockchain, Terra.\n\nFinally, Ripple (XRP) is a real-time funds transfer system, a network for currency exchanges and remittance sending, created in 2012 by Ripple Labs.\n\nPrice action for The Graph: will there be a rise for the crypto? Comparison with LUNC and Ripple (XRP)\n\nBased on the latest data that has emerged, it appears that the recent price action for The Graph (GRT) is positive and could lead to a substantial increase in the coming weeks. The Graph is an indexing protocol used to query data, whose native token is GRT.\n\nThe price of GRT has fallen below a long-term descending resistance line since it reached an all-time high of $0.92 in February 2021. The downward movement led to a low of $0.05 in November 2022.\n\nSince then the price has risen, reaching a new annual high of $0.23 just last month. However, despite the increase, the price was once again rejected by the resistance line.\n\nDespite the rejection, the weekly RSI is still above 50, a factor considered a bullish signal. Hence, if the price of the GRT token breaks out, it could rise to the next resistance at $0.52.\n\nThis would be equivalent to a 244% increase from the current price. However, if the rejection continues, the price of The Graph could revisit its yearly lows near $0.06. These predictions are based on the fact that the crypto GRT suffered a major decline earlier this month.\n\nSpecifically, The Graph’s analysis showed that it was trading in a negative environment, with bears having a strong grip on the market. In fact, GRT was at its lowest with a loss of more than 7.10% not even three weeks ago.\n\nLUNC’s week: about 33 million Terra Classic burned\n\nThe Terra Classic (LUNC) community has not neglected the ongoing initiative, despite a reduction in its social commitments, as several projects and validators have collectively burned nearly 33 million LUNC so far this week.\n\nTotal burns for the week currently total 32,929,066, with four entities accounting for 99.6% of these burns. These include projects such as Cremation Coin and Terra Casino and validators such as LUNC DAO and Luna Station.\n\nSpecifically, the Cremation Coin burn was the largest and most recent of this week’s transactions. In fact, the project burned 18.3 million Terra Classic tokens yesterday alone.\n\nIts burn represents 55.6% of the total burns for this week at the time of reporting. Despite the magnitude of Cremation Coin’s latest burn, it is still the lowest single burn in the project for March, as the last three burns involved 77 million tokens on 21 March, 106 million LUNC on 14 March and 51 million tokens on 7 March.\n\nThis brings its total burns for this month to 252.3 million LUNC. In addition, Terra Casino, the LUNC-based online bookmaker launched last November, has also been quietly burning hundreds of thousands of LUNC tokens every day for the past seven days, as revealed by on-chain data.\n\nThis week alone, the project has burned 1.99 million LUNC tokens in two transactions. At its launch, the betting platform promised to burn LUNC with a portion of its betting volume, and it has since kept that pledge.\n\nIn the past 7 days, Terra Casino has made 7 burning transactions, each equal to at least 990 LUNC tokens. As a result, its cumulative consumption in the last week is 6.9 million Terra Classic.\n\nRipple case: XRP will go up if there is a positive ruling in court\n\nRipple’s defense attorney John E Deaton, who represents XRP investors in the ongoing court dispute between Ripple and the US Securities and Exchange Commission, suggested that the token for cross-border payments could experience a significant price increase if the San Francisco-based company prevails in court.\n\nThus, the upcoming ruling is expected to decide the fate of XRP. Moreover, in a Twitter post dated 27 March, Deaton said the judge’s decision will come in the next few weeks or even as early as this week.\n\nThis comes after Ripple submitted a letter of supplemental notice of authority to further strengthen their defense with fair notice.\n\nThe said notice was based on the “legal scuffle” between Voyager and the SEC, in which the judge overseeing the case, Michael Wiles, denied the regulator’s objections to hinder the sale of the bankrupt cryptocurrency lender to Binance.US.\n\nAccording to Deaton, XRP has the most attractive risk/reward ratio and its price could skyrocket if the judge rules in favor of Ripple. This would mean that the SEC’s claims that Ripple sold XRP as an unregistered security to inexperienced investors were unfounded.\n\nMeanwhile, should the SEC win the case, the US attorney believes Ripple will appeal the decision, thus maintaining the status quo.\n\nXRP is trading at $0.52 at the time of publication, according to CoinGecko data.\n\nThe token has exploded 19.2% in the past seven days, while Bitcoin has posted losses of 4.5% in the same time frame. What’s more, despite the obstacles currently affecting cryptocurrency markets, the XRP Ledger continues to grow significantly.\n\nTotal accounts created on XRP are almost reaching 5 million, a sign of its growing adoption and use cases. Either way, as Ripple continues to add new users to the XRP ledger, any positive or negative developments in the SEC case are bound to have a significant impact on the price of XRP."
    }
]