[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnNuYWNrYW5kYmFrZXJ5LmNvbS9hcnRpY2xlcy8xMDk1ODktcmlwcGxlLXVudmVpbHMtcmlwc3RpY2tzLXRoZS13b3JsZHMtZmlyc3QtdGhjLXBpeHktc3RpeC1mb3ItYWR1bHRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 15 Aug 2023 07:00:00 GMT",
        "title": "Ripple unveils Ripsticks, the world's first THC 'Pixy Stix for adults' - Snack Food & Wholesale Bakery",
        "content": "Ripple, pioneer of clinically proven, fast-acting, water-soluble THC products, is announcing the highly anticipated launch of Ripsticks, the THC world’s first “Pixy Stix for adults.”\n\nDrawing on extensive market research and consumer feedback, Ripsticks represent the next evolution of Ripple’s path-break QuickSticks, launched in 2020. With new formulations, flavors, and packaging, this wholly revamped product line is sure to meet the needs and desires of cannabis enthusiasts and dabbers alike. Ripsticks are the most fun, flavorful, and convenient way for responsible adults to enjoy their cannabis at home or on-the-go.\n\nAs with all Ripple products, Ripsticks embrace the core principles of consistency, reliability, and discretion. Vegan, gluten-free, and containing only one gram of sugar, Ripsticks are suitable for a wide range of dietary needs. And the waterproof packets won’t melt or freeze, making them a perfect adventure companion.\n\n\"Ripsticks mark an exciting chapter in Ripple's journey to redefine the cannabis experience,\" said Keith Woelfel, director of R&D at Ripple. \"By listening to our customers and to the market as a whole, we created a game-changing product that continues to move the cannabis edibles market forward.”\n\nEach package of Ripsticks contains ten powder packets designed to be poured directly onto the tongue, delivering a total of 100mg of THC per container and 10mg THC per packet (MSRP $14). Ripsticks are available in classic flavors that recall simpler times: Blue Raspberry (sativa effect), Watermelon (indica effect), and Live Rosin (small batch, limited edition drops). They can be purchased at more than 100 dispensaries across Colorado—and counting. For more information, visit tryripple.com/ripsticks."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS12cy1zZWMtdGhlLXVzLWlzLWNvbmZ1c2VkLWhvdy10by1tYW5hZ2UtdGhlLXByb2Nlc3Mtc2F5cy1pbmR1c3RyeS1leHBlcnQv0gFvaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvcmlwcGxlLXZzLXNlYy10aGUtdXMtaXMtY29uZnVzZWQtaG93LXRvLW1hbmFnZS10aGUtcHJvY2Vzcy1zYXlzLWluZHVzdHJ5LWV4cGVydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 15 Aug 2023 07:00:00 GMT",
        "title": "Ripple vs. SEC: ‘THE US Is Confused How to Manage the Process,’ Says Industry Expert - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nThe big legal fight between the US Securities and Exchange Commission (SEC) and Ripple Labs, is a really important event in cryptocurrency history. Lately, big changes have been happening in the industry, especially in the US. A notable win in the SEC lawsuit has caused a stir. XRP’s classification as not a security is a key point here, affecting other cryptocurrencies too.\n\nNeil Sheppard, the Head of Derivatives at Gemini exchange, appeared on the Thinking Crypto podcast and said that all of this is a big deal, especially in the United States. According to him, the US is like the leader in this game, but right now, it’s not leading very well. There’s a lot of arguing and confusion between different groups. This confusion is bad for businesses and people who want to use cryptocurrencies safely.\n\nHe added, “I think that this really shows how confused the US is in general around how to manage this process. And I think when you think about regulation, what is regulation really there for? And that is one of my personal sort of complaints about regulation as a general statement.”\n\nHe added that in the end, we need clear and fair rules for cryptocurrencies. It’s like everyone agreeing on the same game rules so that everyone can play happily. If the rules are unclear or unfair, people might leave the game altogether and find a different place to play.\n\nTalking about the XRP lawsuit, he said, imagine you’re playing a game, and someone says you’re cheating, but the judge says you’re not. That’s a bit like what happened with XRP. This ruling is important because it stops regulators from making unfair rules.\n\nIn 2020, the SEC sued Ripple Labs, saying they sold XRP tokens without proper permission, which is like selling stocks or bonds. The argument was whether XRP should be treated as something the SEC regulates."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9yaXBwbGUtYXdzLXJldm9sdXRpb24tc2Fucy1wcmVjZWRlbnQtMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 15 Aug 2023 07:00:00 GMT",
        "title": "Ripple joins forces with AWS for an unprecedented revolution - - Cointribune EN",
        "content": "Tue 15 Aug 2023 ▪ 3 min of reading ▪ by Evans S.\n\nThe sun rises on a new era of financial transactions. As the winds of change blow across the banking sector, Ripple and AWS are poised to launch an unprecedented revolution. The alliance of these two powerhouses heralds a metamorphosis of the monetary landscape, promising to revolutionize the way we send, receive and think about money.\n\nThe RippleNet symphony orchestra\n\nWhile Ripple is going through legal turbulence with the SEC, its determination to expand remains unwavering. This attitude is a testament to its strategic vision. In the face of challenges, its resilience never ceases to impress.\n\nLike a symphony in which each instrument plays a harmonious melody, RippleNet brings together a decentralized network of banks and payment providers. With its distributed financial technology, it offers real-time messaging and clear, rapid transaction settlement.\n\nFlagship products such as xCurrent enable banks to distinguish themselves by offering innovative cross-border payment services. These tools also help to reduce their costs.\n\nImagine a river whose course adapts to the twists and turns of difficult terrain: that’s what xCurrent does, integrating seamlessly into banks’ existing infrastructures.\n\nAs for xRapid, it offers financial institutions a liquidity lifeline. Where emerging markets often require pre-funded accounts in local currency, resulting in high liquidity costs, xRapid, like an alchemist, uses XRP to transform these costs into competitive advantages.\n\nThe promise of a titanic alliance\n\nBeyond RippleNet, it is the association with AWS that promises to breathe new life into global transactions. This partnership evokes the image of a majestic bridge linking two technological continents.\n\nAWS offers power and reach. For its part, Ripple focuses on flexibility and innovation. Together, they could create revolutionary solutions. For example, xVia stands out for its simplicity. It provides businesses with transparent international payments.\n\nOn the horizon, a new dawn is breaking. Over 100 financial institutions have joined RippleNet, from Santander in the USA to Siam Commercial Bank in Thailand. This figure is just the tip of the iceberg. With the support of AWS, Ripple plans to transform financial transactions. Indeed, it also aspires to redefine the norms of the digital age.\n\nAt the crossroads of technology and finance, this alliance between Ripple and AWS opens the door to a bright future, where every transaction becomes a note in a global melody of efficiency and innovation. It remains to be seen what other surprises these two titans have in store for us… The journey has only just begun, and Ripple is already breaking boundaries.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmFkdmFuY2Vkc2NpZW5jZW5ld3MuY29tL3VuZGVyc3RhbmRpbmctZ3Jhdml0YXRpb25hbC13YXZlcy1yaXBwbGVzLWluLXNwYWNldGltZS1leHBsYWluZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 15 Aug 2023 07:00:00 GMT",
        "title": "Understanding gravitational waves: Ripples in spacetime explained - Advanced Science News",
        "content": "The universe is ringing with gravity, but humanity is only just beginning to hear the nuance of this cosmic symphony.\n\nFor over 100 years, scientists have understood that the Universe is humming a symphony of gravitational waves, tiny ripples in spacetime first predicted as part of Albert Einstein’s 1915 theory of general relativity.\n\nHowever, it is only this year that the true nuance of these gravitational waves has begun to emerge, with humanity finally “hearing” the more suitable notes of low-frequency cosmic instruments under the bombast of the most violent events imaginable. Gravitational waves remained purely hypothetical until almost 20 years after the death of Einstein. The first tantalizing hints of the existence of gravitational waves came in 1974 from observations of a binary pulsar — two neutron stars spinning around each other, blasting out radiation.\n\nAstronomers Russell Hulse and Joseph Taylor used the Arecibo Radio Observatory in Puerto Rico to discover that this system was changing in the same that such a binary pulsar would if it were emitting gravitational waves. The discovery would earn the duo the 1993 Nobel Prize in Physics, but it would be another 22 years before the first direct evidence of gravitational waves manifested.\n\nThe first gravitational waves detected by LIGO\n\nOn September 14, 2015, the Laser Interferometer Gravitational-Wave Observatory (LIGO)detected gravitational waves for the first time. The source was colliding black holes located 1.3 billion light years from Earth.\n\nSince then, LIGO, which is located in U.S., Virgo, a gravitational wave detector in Italy, and Japan’s Kamioka Gravitational Wave Detector (KAGRA) have detected gravitational wave signals from other merging black holes, colliding neutron stars, and even “mixed mergers” in which a neutron star and a black hole slam into each other.\n\nYet, by detecting these gravitational wave signals, LIGO and its fellow detectors had only observed a tiny fraction of the gravitational waves that fill the Universe. Think of this as listening to a piece of music and only hearing the crash of symbols.\n\nDetecting background under the noise\n\nIn addition to these high-frequency gravitational waves, the Universe ripples with music from less “extreme” events than the smash-up between black holes. This was exemplified this year on June 28 when the North American Nanohertz Observatory for Gravitational Waves (NANOGrav) revealed the detection of low-frequency gravitational waves likely emerging from binary supermassive black holes in the early Universe.\n\nNANOgrav uses the fact that pulsars as rapidly spinning neutron stars blast out electromagnetic radiation that sweeps over Earth at incredibly regularly intervals of time, which makes them useful for keeping time. Particularly large groups of pulsars can be used to highlight changes in time cause by the squashing and squeezing of spacetime by gravitational waves as they pas over them.\n\nFinally, humanity had heard another player in this cosmic orchestra that uses the very fabric of space and time as its instruments, perhaps the more mellow melody of the string section that underlies the crash of symbols caused by black holes slamming into each other. Yet, there is much more to this celestial music yet unheard, and some members of this orchestra have been playing their instruments since the dawn of time.\n\nWhat are gravitational waves?\n\nIn 1915, Einstein’s theory of general relativity completely changed the picture physicists had of space and time. Ten years earlier, Einstein had used a unified four-dimensional entity of space and time as the foundation of his theory of general relativity, but general relativity would take this concept much further.\n\nAlso called the geometric theory of gravity, general relativity posited that spacetime isn’t simply the stage on which the events of the Universe play out, as Newton had suggested, but is, in fact, a dynamic player in cosmic events.\n\nThis is because an object with mass placed in spacetime causes a “warp” in this cosmic fabric. This effect can be pictured as weights of increasing mass placed on a stretched rubber sheet. The greater the mass, the larger the dent in the sheet the weight creates, and the greater the mass of a cosmic object, the more extreme the warp in spacetime it gives rise to. Gravity arises from this warping and gets stronger as the extent of the warp increases.\n\nAs physicist John Wheeler once said: “Spacetime tells matter how to move; matter tells spacetime how to curve.”\n\nMore than this, general relativity also predicted that when objects with mass accelerate, they should cause ripples that spread through spacetime at the speed of light, called gravitational waves.\n\nThe effect of a gravitational wave emission would be negligible for objects with very little mass, such as a cyclist accelerating here on Earth, but not so for massive bodies, like neutron stars and black holes or for the collapse of stars in supernova explosions. The process of continuous gravitational wave emission from binary objects has actually been an important one in the evolution of the Universe.\n\nTo see why this is, picture two neutron stars — stellar remnants created when massive stars collapse at the end of their lives — orbiting around each other in a binary system. Circular motion represents a constant change in direction, and as direction is a component of velocity, that means constantly changing velocity — acceleration.\n\nAs the stellar remains accelerate around each other, they constantly emit gravitational waves, which we know must carry energy. The energy carried away from the binary neutron stars is supplied by the system’s angular momentum. As a consequence of the loss of angular momentum, the neutron stars move closer together, but the closer they are, the more rapidly they emit continuous gravitational waves, thus speeding up the leeching of angular momentum.\n\nEventually, the neutron stars collide and merge, causing a burst of high-frequency gravitational waves. These are the gravitational wave signals that the LIGO, Virgo, and KAGWA collaboration began collecting in 2015, but as sensitive as these detectors are, they can’t hear every ripple ringing through spacetime.\n\nWhat produces gravitational waves at different frequencies?\n\nGravitational waves are essentially the radiation of gravity, and we are no strangers to the idea of radiation having differing wavelengths and frequencies.\n\nThe form of radiation that we are most aware of is electromagnetic radiation, in which differing frequencies give rise to radio waves, X-rays, gamma-rays, and the visible light spectrum, the latter of which our eyes have evolved to see. Just like electromagnetic radiation, gravitational waves come in a range of frequencies, wavelengths, and energies.\n\nWavelength is the measure between one peak to the next in a wave, while frequency is the time it takes from one peak passing a set point to the next peak passing the same point. That means that wavelength and frequency are inversely proportional — long wavelength waves have low frequencies and low energy too, while short wavelength waves have high-frequencies and high energy.\n\nThe range of wavelengths and frequencies of gravitational waves is truly extraordinary.\n\nAt one end of the scale, shortwave gravitational waves have wavelengths of a few miles and frequencies of just milliseconds. At the opposite end, longwave gravitational waves have wavelengths equivalent to around 110 million light-years, about the width of the Virgo Supercluster — a collection of galaxies that includes the Milky Way — with a frequency that is equivalent to the age of the Universe, around 13.8 billion years.\n\nJust as is the case with electromagnetic radiation, these characteristics of gravitational waves can tell scientists a great deal about their sources.\n\nThe highest frequency shortwave length gravitational waves are created as a burst when massive stars die in supernova explosions emerging from the accelerating collapse of their stellar core that can leave behind a black hole or a neutron star stellar remnant.\n\nSlightly longer wavelength and lower frequency ripples in spacetime are created continuously by tiny bumps on the surface of young neutron stars called pulsars that are spinning as fast as 700 times per second.\n\nBinary systems comprised of neutron stars and black holes that spiral together and merge emit continuous gravitational waves and gravitational wave bursts with wavelengths of a few thousand miles, about the width of Earth, to a few billion miles, equivalent to around the distance between the Sun and Pluto.\n\nSupermassive black holes that exist at the center of galaxies are occasionally accompanied by other supermassive black holes in binary systems on a whole new level that also spiral together and merge. During this process, they give rise to high-frequency gravitational waves, which lose energy and thus become low-frequency and long-wavelength gravitational waves over the billions of years they take to reach Earth and wash over the planet.\n\nBy the time we can “hear” these ripples in spacetime, they have wavelengths equivalent to a few tens of millions of miles, akin to the distance between Earth and the Sun (93 million miles) to a few trillion miles, equivalent to around the distance between the Sun and neighboring star, Alpha Centauri (25 trillion miles).\n\nThe source of gravitational waves with the longest wavelengths and the lowest frequency is the Big Bang, the period of rapid inflation that occurred at the very beginning of time. These are known as primordial gravitational waves or the “Stochastic Background” and result from quantum fluctuations in the hot, dense “soup” that filled the infant Universe, which are amplified by its initial bout of inflation.\n\nHow close are we to hearing the full gravitational wave symphony?\n\nIf you are familiar with astronomy and electromagnetic radiation, you know that it takes different instruments to detect different wavelengths of light. So, for instance, as the James Webb Space Telescope (JWST) observes the cosmos in low-frequency longwave infrared light, NASA’s space-based Chandra X-ray Observatory examines celestial objects via energetic high-frequency, short wave light.\n\nSimilarly, detecting the different gravitational waves requires using different instruments. Current operating gravitational wave detectors LIGO, Virgo, and KAGRA are laser interferometers with two sensitive laser arms that stretch for miles. The laser arms of LIGO, for example, stretch for four kilometers over the ground, and even under it, across the landscape at two locations in southeastern Washington State and rural Livingston, Louisiana.\n\nThe lasers are usually “in phase”, meaning when they come together, they amplify each other via a quantum phenomenon called “constructive interference”. If, however, gravitational waves pass over the arms, the stretching and squeezing of spacetime they cause results in the lasers being knocked out of phase, meaning then they meet the amplification is wiped out. When employed on Earth, this method can detect gravitational waves with frequencies from milliseconds to seconds and wavelengths in the region of thousands of miles from colliding neutrons, stars, and black holes.\n\nThe sensitivity of these interferometers on Earth is limited by interference or “noise” from Earth-based sources of vibration, and to overcome this, astronomers are currently planning to put a gravitational wave-detecting interferometer into space.\n\nThe Laser Interferometer Space Antenna (LISA), currently being developed by NASA and European Space Agency (ESA), will consist of three spacecraft with laser arms stretching for around 1.6 million miles (2.5 million kilometers), forming an equilateral triangle. Free from Earth-based noise, LISA will be able to detect lower-frequency gravitational waves, also from compact binary systems, but from those that are closer together than the neutron star and black hole pairings heard by LIGO.\n\nLISA isn’t won’t be capable of detecting lower-frequency gravitational waves from colliding supermassive black holes in the early Universe, which were detected this year by NANOGrav. The tool used in this case was pulsars, which because of their rapid rotation, can be used by a precise timing mechanism.\n\nVia three radio observatories, the Arecibo Observatory in Puerto Rico, the Green Bank Telescope in West Virginia, and the Very Large Array in New Mexico, NanoGrav turns 68 pulsars within the Milky Way into a huge gravitational wave antenna the size of the entire galaxy called a pulsar timing array. The squashing and squeezing of spacetime as gravitational waves wash over these sources cause tiny disruptions in these pulsars’ periodicity, which can be detected when a large sample of pulsars are considered together.\n\nEven pulsar timing arrays aren’t capable of detecting the lowest frequency, longest wavelength gravitational waves, such as those of the Stochastic Background from the Universe’s earliest moments. It is, however, possible that these primordial gravitational waves could be detected by examining the cosmic microwave background, radiation that represents the first light that shone through the Universe and thus acts as a fossil record of the earliest points in cosmic history.\n\nTo think of how extraordinary humanity “hearing” any of this symphony is consider this: the stretching and squeezing of spacetime they represent is tiny, about one part in a quadrillion (1,000,000,000,000,000). Einstein himself, though arguably the “father” of gravitational waves, never believed that humanity would have the tools needed to detect even the most energetic spacetime ripples.\n\nFortunately, the great physicist was wrong, and by combining the detection of gravitational waves, humanity can both “see” the Universe in electromagnetic radiation and can “hear” it via these ripples in spacetime.\n\nThis has given rise to an entirely new phase in astronomy called multi-messenger astronomy, a hybrid method of investigation which, though still in its infancy, promises to unlock the secrets of the Universe as never before.\n\nReferences:\n\nWhat are Gravitational Waves?, LIGO Caltech, Accessed 01/08/23, https://www.ligo.caltech.edu/page/what-are-gw#:~:text=Though%20Einstein%20predicted%20the%20existence,20%20years%20after%20his%20death\n\nGravitational wave spectrum, Caltech, Accessed 01/08/23, http://www.tapir.caltech.edu/~teviet/Waves/gwave_spectrum.html\n\nLow-Frequency Gravitational Waves, Nanograv, Accessed 01/08/23, https://nanograv.org/science/topics/low-frequency-gravitational-waves\n\nThe spectrum of gravitational waves, ESA, Accessed 01/08/23, https://www.esa.int/ESA_Multimedia/Images/2021/09/The_spectrum_of_gravitational_waves\n\nFeature image credit: Artist’s interpretation of an array of pulsars being affected by gravitational ripples produced by a supermassive black hole binary in a distant galaxy. Credit: Aurore Simonnet for the NANOGrav Collaboration"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2tub3dsZWRnZS53aGFydG9uLnVwZW5uLmVkdS9wb2RjYXN0L3JpcHBsZS1lZmZlY3QvbXVzdC1yZWFkLXdoYXJ0b24tZmFjdWx0eS1hdXRob3JzLWhvdy1zdWNjZXNzZnVsLXBlb3BsZS10aGluay1rYXR5LW1pbGttYW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 15 Aug 2023 07:00:00 GMT",
        "title": "Must-read Wharton Faculty Authors: How Successful People Think | Katy Milkman - Knowledge@Wharton",
        "content": "Transcript\n\nWhat Motivates Positive Change?\n\nDan Loney: Katy Milkman is a Wharton professor of operations, information and decisions. She’s also author of the book How to Change: The Science of Getting from Where You Are to Where You Want to Be. Katy, take us into the book and the genesis of why you wanted to write about this.\n\nKaty Milkman: This has been the focus of all my research, the topic of how do we create positive behavior change. It’s the reason that Angela Duckworth and I co-founded the Behavior Change for Good Initiative at Wharton and Penn. At a certain point, I felt I’d collected enough insights and knowledge that there’s real value to share with the world, if we can put it all together in a digestible format and explain, “Here are the things we’ve learned that can help people make the positive changes they want in their lives and that can help organizations steer their employees and customers towards positive behavior change.”\n\nLoney: We’re talking about behavior changes that can occur at any point in the course of a person’s life, right?\n\nMilkman: Absolutely right. There’s everything from making a change related to my health — maybe I want to get in shape or start eating differently. Maybe I want to quit smoking, or I want to quit drinking. Or changes around my finances. I might want to start investing. I want to set aside something for retirement. I want to cut back on spending. Or changes with your productivity at work, the way that you interact with your family. Every kind of change that you can think of is what we study, and this book is designed to help people achieve it for themselves or help others achieve those kinds of changes.\n\nLoney: One of the ones that you talk about, and a lot of people talk about, is New Year’s resolutions. We maybe we hold them for a couple of days, and then things kind of dissolve. Take us into that mindset.\n\nMilkman: First, let me just say that I am actually a big fan of New Year’s resolutions. I think that makes me unusual, because most people write them off and say, “This is a whim. Most of them don’t succeed. Why would we do this?” I’ve done research with former Wharton PhD student Hengchen Dai, who is now a professor at UCLA’s Anderson School, on what we call “the fresh start effect,” along with Jason Reese, also a Wharton affiliate. What we have shown is that there are moments in our lives, like New Year’s, that give us the sense of a new beginning and a fresh start, and that make us feel separated from our past failures.\n\nOn January 1, you can look at things that you didn’t achieve in the last year that you meant to get around to. “I wanted to learn Spanish,” “I wanted to figure out how to be on time at my meetings,” “I wanted to eat healthier.” And I didn’t. And I failed. But that was the old me, and this is the new me. They create this sense of dissociation, and it’s not just New Year’s. That’s the most famous, but the start of a new week, the start of a new month, following birthdays, following holidays that we associate with fresh starts — so think Labor Day, not Valentine’s Day.\n\nWhat we see in data set after data set is that people at those moments set goals more often. But as you point out, many of those goals fail. For most things, a moment of motivation is not enough to carry us forward, and that’s really what the rest of my book is about.\n\nI think one of the key barriers to successful change is that most of it is, “Oh, I have a goal. I’ll just get there,” as opposed to thinking strategically about what are the obstacles I might face, and let me make a plan that can tackle those obstacles and that’s based on science. The reason I wrote this book is we now have a lot of evidence-based solutions that need to be tailored. If the reason you’re not going to the gym is you find it absolutely miserable, then you need a different solution to get you there than if the reason is your life is too crowded to fit it in. Depending on what the barrier is, you need different solutions. Once people start using the evidence, they can make a lot more progress with those fresh start moments.\n\nExamining How Successful People Think\n\nLoney: How much concern is there that if people try to make a change and don’t succeed, and they give up, that becomes kind of the pattern?\n\nMilkman: It’s a thing that we often worry about. People will commonly say things like, “Oh, you can’t teach an old dog new tricks,” which might suggest that over the course of a lifespan, it becomes harder to make change. Maybe after multiple failures, we give up on ourselves. For what it’s worth, in our research studies, we look at things like an intervention that we developed to try to help people make this positive change. We look at does the effectiveness vary as a function of age? And we very rarely see that it does. We rarely find a lot of what we call moderation, a lot of variables, a lot of features of a person that seem to say, “Oh, shoot. This intervention only works for this type of person.”\n\nSo, I am very optimistic that if people are willing to stand up and try again, they will be able to make progress. The fresh start effect does seem to apply pretty broadly, as opposed to narrowly. It’s not as if it’s only a phenomenon we see in our 20s and 30s, and then once we’ve been fooled by enough New Year’s resolutions that didn’t work out, we stop making them.\n\nLoney: You talk also in the book about the “Mary Poppins approach” to behavior change. What does that mean?\n\nMilkman: One thing that I think is really fascinating and that leads to this name comes out of research by Ayelet Fishbach at the University of Chicago and Kaitlin Woolley at Cornell. What they have found is that most of us, when we pursue change, our intuition is we should just take the most direct approach, the most effective, efficient path to get to where we want to be. Say you want to ace your math test, the first approach you’d take would probably be to say, “I’m just going to sit down and study and block all distractions. I’m going to do nothing else for the rest of the day. That’s how I’ll get there.”\n\nOr if you want to get in shape, you’d say, “Let me find the most painful workout I could do at the gym that will maximally burn calories.” But interestingly, what they’ve shown in the research is this is a mistake. A small subset of people takes a different approach, which is to try to find the most fun way to study for their math test, maybe quizzing themselves with a friend or hopping into a Zumba class. And while it may get you closer to your goal at a slower rate, it actually ends up being better because you persist, because you go back to the gym after a positive experience. You’ll study for the next test after an enjoyable first few minutes studying, or you’ll keep the studying going even late into the night if you’ve found a way that isn’t miserable.\n\nThis persistence is a really important part of success, and we neglect the importance of fun. The Mary Poppins effect is really just a description of what Mary Poppins sings about in her famous verses, “A spoonful of sugar makes the medicine go down.” She understood and communicated this when it comes to children. Adults are wired the same way as kids — maybe it’s a little bit less extreme. We have a little bit more ability to exert self-control. Our prefrontal cortex is more developed. But just like kids, we are present-biased, which means we care more about instant gratification than long-term rewards. Rather than trying to work against that, what we need to do is lean into it and try to find ways that we can make it more enjoyable in the moment to do the things that are going to help us achieve our goals in order to serve the long-term benefit.\n\nIt’s a mistake to constantly be looking for the most efficient path to achieve your goal, because you will quit at a higher rate than if you look for a path that you will find pleasurable. We’ve done research on a topic called temptation bundling, which is when you find a way to link something tempting with a chore that you would otherwise procrastinate on. This is a way of using that Mary Poppins insight: “A spoonful of sugar makes the medicine go down.”\n\nFor instance, you only let yourself exercise while indulging in watching your favorite low-brow TV show on Netflix. That’s an example of temptation bundling. Or you only let yourself listen to your favorite podcast while you’re doing household chores. Or you only get to eat a really unhealthy but delicious meal when spending time with a difficult mentee at work. We’ve found in our research that through temptation bundling, we can help ourselves achieve more.\n\nHow to Break Bad Habits and Form Good Ones\n\nLoney: Talk about this concept of the flake-out and how you can try to go about combating it.\n\nMilkman: Flake-out, I think, is a vastly underestimated problem. A lot of our goals just don’t stay top of mind, and as a result, we flake out on doing things that are really important to us because we haven’t structured our lives properly around them. I’d say it’s very closely related to forgetting. Simply, you meant to vote, but oh my gosh, it slipped off your to-do list. Or you meant to get a vaccine or get your annual check-up or take care of this important issue with an employee who has been struggling at work, but you just flaked out on fitting it into your schedule. Often, it’s one-time but highly impactful decisions that we flake out on, with major consequences. In general, what we find is that people underestimate this as a barrier to follow-through on key goals.\n\nBut we can combat it using pretty simple tools, the most obvious being things like digital reminders and calendaring. But some of the less obvious can get better results. There’s wonderful research by Peter Gollwitzer of NYU on the fact that simply making if/then plans — he calls them “implementation intentions” — dramatically increases the likelihood we follow through. It’s not just saying, “I plan to go to the gym,” or “I plan to schedule this meeting,” but saying, “If it’s 4 p.m. on a Thursday, then I’ll be at the gym.” Or, “Every day after work, I will schedule time for meditation.” By having the if/then component, we end up seeing dramatically higher follow-through. There are some really wonderful research studies that have been done showing that we can use this as a tool to nudge people towards follow-through on important behaviors like voter turnout and vaccination.\n\nI was involved in one effort about a decade ago where we ran a randomized control trial with a company that was trying to encourage people to come to an annual flu shot clinic for free vaccines. And what we found was sending a reminder that let people know the dates and times and location is useful. But we, at no cost, increased the effectiveness of that reminder by adding a simple prompt for people to write the date and time they intended to show up. And that simple prompt to make a concrete plan led to about a 4% increase in vaccinations. These are the kinds of things that I think organizations and individuals tend to think, “I don’t need to write down my plan or prompt someone to think through the date and time. Why would that matter?” And yet, making it more concrete works because that’s the way memories are stored. We need a cue that triggers the memory, so the date and time serve as a cue. It’s also more likely you literally put it in your calendar, and you now get a digital or electronic reminder.\n\nWe even tried things where there were behaviors people would get paid to do. And people said, “No, no, no, I don’t want to be paying for a reminder,” and yet when we automatically signed people up for reminders and charged for them, we see higher earnings and better follow-through than when people have the optionality because they underestimate the value of such tools.\n\nLoney: And then there is the problem of laziness, which I think we all fall into at times.\n\nMilkman: Yes, we all have this issue. I like to say that it’s a pro of the human operating system, rather than a con. My background is in computer science, and computer scientists know that the best algorithms are efficient, lazy algorithms that take shortcuts, rather than searching every possible solution. So, laziness is a good feature for a system to have built in, that you look for the path of least resistance. But when it comes to achieving goals, it can be a problem if we are looking for the fastest route to success or the simplest path.\n\nThere are two ways that laziness comes up in the human operating system, and is important to keep them in mind if you want to build solutions that will help people achieve their goals. The first has to do with a well-studied and pretty well-known phenomenon, which is that we succumb to defaults. We are very susceptible to whatever is automatic. If you get a new computer, it comes with a whole bunch of default settings. Most of us just accept those and move on. And P.S., that means it’s important to set them wisely and in ways that will set people up for success.\n\nOne of my favorite studies showing how important it is to set defaults was done here at the University of Pennsylvania in our medical system. It involved changing the way that drug prescriptions were automatically sent to pharmacies, to prioritize sending generic drugs. There is higher compliance by patients when their drugs are cheaper, and everyone saves money. So, they just made that the default. Instead of the doctor having to remember to prescribe the generic, they remember the brand name, they type in “Lipitor,” but unless they check a box saying, “Not the generic,” the generic was automatically sent to the pharmacy. Overnight, this ensured that Penn Medicine was one of the best hospitals in the area on generic prescriptions. They went from something like 75% of drugs being prescribed as generics to almost 100%. There was one drug where this didn’t work. It was a drug where the generic and the brand name had chemical differences, so you didn’t see this bump.\n\nIt’s a really nice illustration, and it basically says any time you can, set a wise default. That’s really important for setting yourself up for success. It could be something like, “I stock my pantry only with healthy snacks, so that the default snack is something that’s easy.” Or, “I set my default website to be The New York Times, as opposed to Facebook, so I spend less time on social media.” Those are personal defaults. Organizations can have wise defaults that they set to try to support success in the workplace, whether that’s by default we don’t have meetings from 9 a.m. to 10 a.m. You have to override something in order to make that possible.\n\nThe second thing that’s important has to do with habits. We are creatures of habit. We build habits in order to short-circuit having to think deeply about decisions. It’s very helpful not to have to think every morning about shampooing your hair, brushing your teeth, what you’ll eat for breakfast. You’ve formed some habits around that, and as a result, you just have a shortcut. But habits can be harmful if they’re not supporting your goals.\n\nThere is large literature on how we intentionally form good habits. I think there have been some wonderful books that cover this quite nicely, like The Power of Habit by Charles Duhigg; Atomic Habits by James Clear; and Good Habits, Bad Habits by Wendy Wood. The simple story is that, as with animals, when humans repeat a behavior and are rewarded for it, over time it becomes more habituated. This is how you learn the piano. You sit down, you practice, you repeat. We can do the same thing with habits, trying to form a habit around exercise. Research shows that if we pay people to go to the gym eight times in a month, as opposed to just once, and then take payments away, and look what happens after. Now, there’s no reward. We see the people who are paid to go repeatedly habituate and continue to exercise at a higher rate than people who were only rewarded for going once — even though there’s no longer any reason to do it.\n\nThe key idea here is if you have the desire to form a habit, you want to think of it like practicing a new skill. You want to try to repeat it as frequently as possible. Find a way to reward yourself. That might be through temptation bundling, making it fun, or it might be by announcing to friends that you’re doing this, simply tracking your progress. Over the course of that repetition, you’re going to build something that starts to feel more habitual and becomes more natural.\n\nLoney: With all this work you’ve done in your career around behavior change, what still is out there? What is the next hill to climb?\n\nMilkman: Some of the most exciting work in behavior change that we’ve done and that others have done shows the power of our social networks in influencing our behaviors. The people around us show us what’s possible. They show us how to achieve and signal what’s appropriate. For instance, there’s some really wonderful research that has been done by Scott Carrell at the University of California, showing that the randomly assigned college roommate you get affects your grades. If you end up with someone who is a better student, they study on Friday nights, and you do, too. We are really shaped by these random allocations of our compatriots.\n\nWhat I am looking at at the Behavior Change for Good Initiative in collaboration with Angela Duckworth, who is my key partner in crime on this, is how can we use that insight to build better social interventions that help connect people with peers who have shared goals and help facilitate peer interactions that increase success? We’re doing work right now in the space of education around this, to try to see if we can leverage peer effects to improve student outcomes and reduce student dropout from school at the college level. But we’re also interested in workplace peer effect, and generally leveraging this power of groups, as opposed to simply studying individuals and how we can help people in isolation."
    }
]