[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZm9yZWlnbnBvbGljeS5jb20vbGl2ZS9pc3JhZWwtaGFtYXMtd2FyLXRoZS1yZWdpb25hbC1yaXBwbGUtZWZmZWN0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Israel-Hamas War: The Regional Ripple Effects - Foreign Policy",
        "content": "As Israel continues its war on Hamas, and as the number of civilian casualties in Gaza rises, neighboring countries are on edge. From Israel’s north, in Lebanon, the militant Islamist group Hezbollah has already launched a small number of rocket attacks, with “all options” on the table, according to a speech by the group’s leader, Hassan Nasrallah, on Friday. To the east, there’s Iran, which backs Hezbollah and also Hamas, and has been making ominous public statements against Israel. South of Israel, beyond Saudi Arabia, there’s Yemen: Evidence indicates that Houthi rebels there may have been responsible for an intercepted missile attack headed toward Israel. And meanwhile, to Israel’s southwest, there’s Egypt, which is worried about a potential influx of Palestinian refugees.\n\nWill a broader regional war break out? FP’s Ravi Agrawal spoke with two experts on the Middle East: Steven Cook, a columnist at FP, and Kim Ghattas, a Beirut-based journalist."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3hycC1nYWlucy1hcHByb3ZhbC1mcm9tLWR1YmFpLWZpbmFuY2lhbC1zZXJ2aWNlcy1hdXRob3JpdHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "XRP gains approval from Dubai Financial Services Authority - CryptoSlate",
        "content": "Ripple announced on Nov. 2 that the XRP token has been approved under the Dubai Financial Services Authority (DFSA)’s virtual assets regime.\n\nThat approval means that virtual asset firms will be able to make use of XRP if they are licensed within the Dubai International Financial Centre (DIFC) area — a special economic zone and financial hub in the United Arab Emirates’ largest city.\n\nBrad Garlinghouse, the CEO of Ripple, said:\n\n“It’s refreshing to see the DFSA encourage the adoption and use of digital assets such as XRP … Ripple will continue to double down on its presence in Dubai and we look forward to continuing to work closely with regulators to realize crypto’s full potential.”\n\nThe DFSA previously approved Bitcoin (BTC), Ethereum (ETH), and Litecoin (LTC) in November 2022. Toncoin (TON) was approved alongside XRP today.\n\nRipple described its goals of expanding within Dubai earlier this year. Today, it noted that it chose the DIFC as its Middle East and North Africa (MENA) headquarters and said that about 20% of its customers are based in the MENA region.\n\nRipple is working with Georgia on digital lari\n\nIn related news, Ripple also announced the National Bank of Georgia had selected it as the official technology partner for its digital lari pilot project.\n\nThe announcement indicates that Ripple was chosen as a partner from a shortlist of nine candidates. The program will now move to a pilot phase and live testing.\n\nThe project involves a tokenized version of the Georgian lari (GEL) rather than the XRP token. However, the project will make use of Ripple’s CBDC Platform for central bank digital currencies, which is, in turn, powered by the XRP Ledger (XRPL).\n\nThe pilot stage will reportedly experiment with possible applications for the digital lari in the public sector, for business, and for general retail users.\n\nRipple said in its press release that it has previously announced pilot programs with governments in five other regions: Bhutan, Palau, Colombia, Montenegro, and Hong Kong. The firm said that it is currently engaging with more than 20 other countries as well.\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYml0Y29pbmlzdC5jb20vaXMtYS1yaXBwbGUtaXBvLWdvb2Qtb3ItYmFkLWZvci14cnAv0gE_aHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9pcy1hLXJpcHBsZS1pcG8tZ29vZC1vci1iYWQtZm9yLXhycC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Is A Ripple IPO Good Or Bad For XRP? Expert Shares Reasons - Bitcoinist",
        "content": "A number of intriguing developments have emerged, all of which point to cryptocurrency giant Ripple may be in the works of launching an Initial Public Offering (IPO). As expected, concerns have been raised among the XRP community about whether a Ripple IPO could negatively affect the price of XRP in the long run. But crypto expert Panos Mourkas isn’t worried, dismissing concerns about the launch of an IPO negatively impacting the price of XRP.\n\nConcerns Surface Over Ripple’s Planned IPO Hurting XRP\n\nRipple hasn’t announced its going public yet, but crypto analysts have pointed to the company’s recent hiring trends as preparations. Crypto analyst Lewis Jackson pointed out this hiring trend in a YouTube video, signaling reactions from XRP enthusiasts. One concern that came from this video was a comment about an IPO being the death of Ripple. According to the comment, an XRP “might pump off the news,” but then Ripple could “dump and manipulate XRP.” The screenshot of this comment was shared on X by Mason Versluis, sparking another round of debate.\n\nhttps://x.com/MasonVersluis/status/1720530978064789910?s=20\n\nWill the Ripple Stock IPO be the DEATH of $XRP? Very interesting discussion to be had there… I believe it should only increase the interest in XRP and help it. But I can also see the other side… We shall see… pic.twitter.com/mTJYdRNh8c — MASON VERSLUIS (@MasonVersluis) November 3, 2023\n\nHowever, according to Mourkas, Ripple’s IPO will likely increase interest in XRP rather than hurt it. It’s no news that the price of XRP is largely affected by happenings around Ripple. As Ripple’s visibility and credibility rise on Wall Street, more mainstream investors will recognize the potential of its offerings, one of which is XRP. This exposure and validation can attract new buyers to the XRP market, boosting demand and prices.\n\nhttps://x.com/panosmek/status/1720547127703560532?s=20\n\nThere is no other side. Ripple going public means bigger exposure & awareness for the company, their products (some of which use XRP), and XRP itself. And remember: Ripple is one company, while XRP is a universal digital asset with multiple use cases & unlimited potential. https://t.co/giVbWvcmlb — Panos 🔼{X} (@panosmek) November 3, 2023\n\nIt’s also important to note that Ripple and XRP are two separate entities. XRP is an independent digital asset. Therefore, an IPO from Ripple will involve selling shares of Ripple stock, not XRP tokens. Experts have predicted Ripple’s valuation could exceed $100 billion after going public. Even if this valuation were to drop post-IPO, XRP remains independent with more utility beyond Ripple.\n\nXRPUSD currently trading at $0.62757 level today. Chart: TradingView.com\n\nFuture Of Ripple And XRP\n\nRipple is now on its way to putting its ongoing legal tussle with the SEC behind it, and a settlement is now in sight. The company was recently selected by the National Bank of Georgia as an official partner for a pilot of the Georgian Lari currency.\n\nXRP, on the other hand, is starting to grow without restraint after it was deemed not to be a security by a US federal judge. The crypto is up 13.73% in a seven-day timeframe and is looking to establish a strong footing over the $0.62 level. XRP was recently integrated into the Dubai crypto market by the Dubai Financial Services Authority.\n\nIn essence, recent happening point to a further potential upside for XRP when a Ripple IPO is fully established. According to one of Ripple’s co-founders, XRP price will climb to $10,000.\n\nFeatured image from Freepik"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTEwMjE3OTUzMi9lbi9ESUZDLUNoYW1waW9ucy1EdWJhaS1hcy1hLUdsb2JhbC1DcnlwdG8tSHViLXdpdGgtQXBwcm92YWwtb2YtWFJQLVVuZGVyLWl0cy1WaXJ0dWFsLUFzc2V0cy1SZWdpbWXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "DIFC Champions Dubai as a Global Crypto Hub with Approval of XRP Under its Virtual Assets Regime - Business Wire",
        "content": "DUBAI, UAE--(BUSINESS WIRE)--Ripple, the leader in enterprise blockchain and crypto solutions, today announced that the Dubai Financial Services Authority (DFSA) has approved the digital asset XRP for use within the Dubai International Financial Centre (DIFC). Licensed virtual asset firms within the DIFC will now be able to incorporate XRP into their virtual asset services.\n\nSince the DFSA opened up external applications, XRP is the first virtual asset to be approved by the regime. XRP joins BTC, ETH and LTC as the assets previously approved under the DFSA’s virtual assets regime. XRP now stands to benefit from legal and regulatory clarity in the DIFC, and will be available for use by institutions located in the DIFC to accelerate faster, more efficient global value exchange.\n\nThe UAE has fast become one of the most innovative jurisdictions intent on offering regulatory clarity and guidance for licensed firms to offer virtual asset services. With the DFSA’s comprehensive regime for the DIFC, the independent regulator is committed to the long-term development of the crypto, payments and fintech ecosystem within Dubai, as well as providing guidance for companies to set up shop in the free zone. Dubai also has the Virtual Assets Regulatory Authority (VARA) which was established last year to protect investors, maintain high levels of risk assurance, and facilitate innovation.\n\nBrad Garlinghouse, CEO of Ripple, said: “Dubai continues to demonstrate global leadership when it comes to the regulation of virtual assets and nurturing innovation. It’s refreshing to see the DFSA encourage the adoption and use of digital assets such as XRP to position Dubai as a leading financial services hub intent on attracting foreign investment and accelerating economic growth. Ripple will continue to double down on its presence in Dubai and we look forward to continuing to work closely with regulators to realize crypto’s full potential.”\n\nDubai’s listing of XRP has the potential to unlock new regional payments and other virtual asset use cases on the XRP Ledger. As a key builder and user of the XRP Ledger, Ripple chose the DIFC as the location for its MENA headquarters in 2020 due to Dubai’s innovation-forward regulations, expansive network and reputation as a leading global financial centre. Approximately 20% of Ripple’s customers are based in MENA.\n\nThe announcement comes as Ripple Swell, Ripple’s flagship event bringing together influential financial industry and regulatory voices, is set to be hosted in Dubai on November 8-9. It follows previous successful events which saw hundreds of Ripple’s customers and partners come together in major global financial centres including London and Singapore. The DIFC’s Chief Operating Officer Alya Al Zarouni will take the main stage, as will VARA's CEO Hensen Orser, alongside other national and global thought leaders, decision-makers, and policymakers from the worlds of fintech, finance and crypto.\n\nAbout Ripple\n\nRipple is the leader in enterprise blockchain and crypto solutions, transforming how the world moves, manages, tokenizes and stores value. Ripple’s business solutions are faster, more transparent, and more cost effective - solving inefficiencies that have long defined the status quo. And together with partners and the larger developer community, we identify use cases where crypto technology will inspire new business models and create opportunity for more people. With every solution, we’re realizing a more sustainable global economy and planet - increasing access to inclusive and scalable financial systems while leveraging carbon neutral blockchain technology and a green digital asset, XRP. This is how we deliver on our mission to build crypto solutions for a world without economic borders."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmhrbGF3LmNvbS9lbi9pbnNpZ2h0cy9wdWJsaWNhdGlvbnMvMjAyMy8xMS90aGUtbGF0ZXN0LWZyb20tdGhlLXdvcmxkLW9mLXJpcHBsZS1hbmQtaXRzLXJpcHBsZS1lZmZlY3Rz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "The Latest from the World of Ripple and Its (Ripple) Effects | Insights - Holland & Knight",
        "content": "The same day that the U.S. District Court for the Southern District of New York (SDNY) in SEC v. Ripple Labs, Inc. denied the SEC's request for an interlocutory appeal of the bombshell summary judgment ruling in the case, the SEC filed a legal brief in a separate matter providing insight into how it will adjust its legal theories in light of the court's ruling. Not to be lost in the midst of the \"Is it a security?\" battle taking place in this matter and others, the Ripple matter had another noteworthy – and rare – development as the SEC stipulated to dismissing the remaining claims against Ripple's executives. How significant is this setback for the agency? Are there any silver linings for the SEC in Judge Analisa Torres's denial? In today's post, we cover each of these developments and offer some key takeaways.\n\nSEC's Interlocutory Appeal Denied\n\nOn Oct. 3, 2023, Judge Torres thwarted the SEC's attempts to appeal the court's critical summary judgment rulings to the U.S. Court of Appeals for the Second Circuit (Second Circuit). We previously covered the SEC's notice to the court of its intent to file an interlocutory appeal of the summary judgment rulings that found various transactions of Ripple did not involve a \"security\" for which a registration statement would have been required prior to the transaction based on the U.S. Supreme Court's investment contract in SEC v. W.J. Howey Co. (Howey test): 1) algorithmic sales of XRP on digital asset trading platforms (Programmatic Sales), 2) XRP distributions to Ripple employees and third parties (Other Distributions), and 3) sales of XRP by two Ripple executives on various digital asset trading platforms. Judge Torres did find, however, that Ripple's direct sales to institutional investors (Institutional Sales) satisfied the Howey test and thus constituted sales of \"securities\" that should have been registered beforehand.\n\nThe SEC asked Judge Torres to certify for interlocutory appeal to the Second Circuit her rulings that the Programmatic Sales and Other Distributions did not involve a \"security.\" Generally, a district court may certify an order for interlocutory appeal where: 1) the order involves a controlling question of law, 2) there is substantial ground for difference of opinion and 3) an immediate appeal from the order may materially advance the ultimate termination of the litigation.\n\nIn her Oct. 3 decision, Judge Torres rejected the request. She emphasized that her summary judgment rulings were rendered after much consideration of the \"heavily disputed factual record and detailed expert reports\" and that she considered \"the totality of circumstances surrounding Defendants' different transactions and schemes involving the sale and distribution of XRP.\" Judge Torres noted that the SEC does not suggest that the court applied the wrong standard; in fact, the court applied the SEC's standard (the Howey test) and rejected the defendants' standard (the proposed \"essential ingredients\" test). The SEC simply argued that the court misapplied the Howey standard to the facts in the record. But that is not enough to demonstrate an \"issue of pure law\" to satisfy part of the interlocutory appeal standard.\n\nImportantly, Judge Torres went further and rejected the SEC's suggestion that her rulings are \"controlling\" and have \"precedential value for a large number of cases.\" She faulted the SEC for \"misconstru[ing]\" her rulings in so far as they suggested that she held that \"offers and sales on crypto asset trading platforms [can never] create a reasonable expectation of profits based on the efforts of others.\" Judge Torres made clear that her rulings applied only in the Ripple case because they were based on \"the totality of the circumstances …, including an examination of the facts, circumstances, and economic realities of the transactions.\" Judge Torres was clear that \"[t]he Court's holding did not turn on the fact that Ripple's 'offers and sales [were] on crypto asset trading platforms.'\"\n\nAdditionally, Judge Torres rejected the SEC's attempt to put her decisions in Ripple at odds with other decisions, such as the Terraform Labs decision by SDNY's Judge Jed Rakoff.1 Judge Torres noted that the Terraform Labs decision did not \"engage with\" her rulings and that nonetheless, Terraform Labs was decided at the motion to dismiss stage, where a court must accept as true the well-pleaded allegations. Judge Torres also rejected the other cases cited by the SEC and insisted that those cases used the same standard she did (the Howey test), but that they applied it \"to the facts and circumstances of that particular case.\"\n\nFinally, Judge Torres found that the final factor for granting an interlocutory appeal – whether the certification will materially advance the termination of the case – was also not satisfied because even \"if the Second Circuit were to reverse the [rulings] and remand the case, the Court would be in the position of considering many complicated legal and factual issues in the first instance, such as whether Ripple's Programmatic Sales satisfy Howey's second prong that there exists a common enterprise or Defendants' fair notice defenses as to the Programmatic Sales and Other Distributions.\" And those decisions would also be subject to an interlocutory appeal motion regardless.\n\nRare Stipulated Dismissal of Individual Aiding and Abetting Claims\n\nJudge Torres's denial of the SEC's request was not the only setback for the agency. On Oct. 19, 2023, the SEC stipulated and agreed with defendants Bradley Garlinghouse and Christian A. Larsen that the agency would dismiss its claims against them for aiding and abetting Ripple's violations of Section 5 of the Securities Act of 1933 (Securities Act) with respect to Ripple's Institutional Sales.\n\nThe SEC moved for summary judgment against both Garlinghouse and Larsen as part of the cross motions for summary judgment. The court denied the SEC's motion. Using the established framework for aiding and abetting liability – 1) existence of a securities law violation, 2) knowledge of this violation by the alleged aider and abettor, and 3) substantial assistance by the aider and abettor in the primary violation – Judge Torres found Garlinghouse and Larsen raised genuine issues of material fact as to the second element.2\n\nConcerning No. 2 – knowledge of the violation – the SEC was required to show that the defendants \"knew or recklessly disregarded the facts that made Ripple's transactions and schemes illegal under statutory and case law.\" The court found genuine issues of material fact based on, among other things, the defendants' testimony that they did not believe XRP was a security because \"multiple foreign regulators … had determined that XRP was not a security\" and the U.S. Department of Justice (DOJ) and the Financial Crimes Enforcement Network (FinCEN) labeled XRP a \"virtual currency.\" The court also highlighted Larsen's testimony about former SEC Division of Corporation Finance Director Bill Hinman's 2018 speech – one of the subjects of the intense discovery battles between the parties – as a factor in favor of finding a genuine issue of material fact.\n\nNow weeks after Judge Torres's denial of the SEC's interlocutory appeal request, the SEC acknowledged defeat on the remaining claims against the Ripple executives.\n\nSEC Attempts to Pivot and Distinguish\n\nOn the same day as Judge Torres's denial of the SEC's request for an interlocutory appeal, the SEC filed an opposition to a crypto exchange defendant's motion for judgment on the pleadings under Federal Rule of Civil Procedure 12(c) in one of the largest unregistered exchange cases recently filed by the agency. The defendant's motion argued, among other things, that the SEC did not adequately allege the presence of investment contract securities.3 On this point, the defendant argued, among other things, that the SEC does not sufficiently allege that the tokens at issue grant the purchaser a contractual right to the profits, income or assets of a business enterprise.4 The exchange argued that if the crypto asset and the hope for an increase in value of that asset are the only items transferred, there is no investment contract. And, as expected, the defendant pointed the court to Judge Torres's summary judgment ruling, arguing \"[t]he Ripple court found no investment contract based on facts substantially identical to those alleged here.\"\n\nIn response, the SEC argued that under the Howey test, the trading platform engaged in transactions involving investment contracts, which do not require contractual privity. The SEC hit back that the exchange's own internal compliance assessment involved an assessment of the Howey factors and argued that no case had held that contractual privity is necessary to find an investment contract. Moreover – and not surprisingly – the SEC countered the exchange's multiple arguments rooted in Judge Torres's Ripple opinion with several arguments rooted in several favorable crypto decisions for the agency, such as SEC v. Kik Interactive, Inc.,5 SEC v. Telegram Group, Inc.6 and Judge Rakoff's opinion in Terraform Labs.7 The SEC leaned hard into the argument – similar in substance to Judge Rakoff's ruling – that there is nothing in controlling precedent or statute that suggests the nature of the instrument changes based on the medium of the transaction. \"There is, accordingly, no reason to apply anything other than Howey's test to both primary offerings and transactions on the secondary market.\"\n\nWith the defendants having recently filed their reply, we will be closely monitoring the docket for an opinion from the court.\n\nTakeaways\n\nSignificant Defeat for SEC …: Even with the SEC salvaging one aspect of its case against Ripple involving the Institutional Sales, there's little question that this matter is a significant setback for the SEC. A sizable portion of XRP activity involved Programmatic Sales, leaving the agency with a much smaller case (albeit one where the SEC still alleges hundreds of millions of dollars raised in USD equivalent). Furthermore, the SEC was forced to admit defeat in its charges against the executives where it sought liability premised on a heightened mental state (aiding and abetting liability). Following the dismissal of the claims against Garlinghouse and Larsen, Ripple's Chief Legal Officer touted that this is \"surrender by the SEC.\" Of course, the expectation is that the SEC will appeal at the conclusion of the matter, but for the time being it is hard to classify the result as anything other than a big loss for the agency.\n\nEven with the SEC salvaging one aspect of its case against Ripple involving the Institutional Sales, there's little question that this matter is a significant setback for the SEC. A sizable portion of XRP activity involved Programmatic Sales, leaving the agency with a much smaller case (albeit one where the SEC still alleges hundreds of millions of dollars raised in USD equivalent). Furthermore, the SEC was forced to admit defeat in its charges against the executives where it sought liability premised on a heightened mental state (aiding and abetting liability). Following the dismissal of the claims against Garlinghouse and Larsen, Ripple's Chief Legal Officer touted that this is \"surrender by the SEC.\" Of course, the expectation is that the SEC will appeal at the conclusion of the matter, but for the time being it is hard to classify the result as anything other than a big loss for the agency. … but with a Silver Lining?: Although Judge Torres rejected the SEC's request for interlocutory appeal, a closer read of the opinion reveals some footholds for the SEC to leverage going forward. Judge Torres made clear that her decision came from \"a direct application of Howey to the unique facts and circumstances of this case.\" Judge Torres distinguished the other enforcement actions referenced by the SEC, noting they \"involve different digital assets and different companies, which offered and sold those digital assets under different factual circumstances and economic realities.\" Furthermore, she was clear that the court \"did not hold that offers and sales on a digital asset exchange cannot create a reasonable expectation of profits based on the efforts of others. The court held that based on the totality of the circumstances in this case …\" Although they reinforce the court's firm holding in the Ripple matter, the SEC has already used this aspect of the court's holding to minimize the application of the holding to other matters. Although the defeat is a significant one (for now), this language may give the agency an opportunity to limit the damage.\n\nAlthough Judge Torres rejected the SEC's request for interlocutory appeal, a closer read of the opinion reveals some footholds for the SEC to leverage going forward. Judge Torres made clear that her decision came from \"a direct application of Howey to the unique facts and circumstances of this case.\" Judge Torres distinguished the other enforcement actions referenced by the SEC, noting they \"involve different digital assets and different companies, which offered and sold those digital assets under different factual circumstances and economic realities.\" Furthermore, she was clear that the court \"did not hold that offers and sales on a digital asset exchange cannot create a reasonable expectation of profits based on the efforts of others. The court held that based on the totality of the circumstances in this case …\" Although they reinforce the court's firm holding in the Ripple matter, the SEC has already used this aspect of the court's holding to minimize the application of the holding to other matters. Although the defeat is a significant one (for now), this language may give the agency an opportunity to limit the damage. Discovery Rulings Played Significant Role, Particularly for Individual Defendants: Not to be lost in the back-and-forth concerning whether XRP is a security is the basis for the court finding genuine issues of material fact for the aiding and abetting claims against Garlinghouse and Larsen. As detailed above, the court focused in part on materials the defendants were able to obtain from the SEC in discovery. The January 2022 opinion from Magistrate Judge Sarah Netburn comes back into focus here where the court ruled, among other things, that documents peripheral to actual policy formation did not satisfy the deliberative process privilege, certain notes from staff members are not per se protected from disclosure and personal views of agency employees are not protected by privilege unless they bear on the formulation or exercise of policy-oriented judgment. Even though the SEC is now armed with the benefit of the opinion in this matter going forward and the Ripple facts are relatively unique compared to other tokens at issue in SEC investigations and enforcement actions, the defendants' effective use of the discovery process and the court's reliance on at least some of these documents to conclude a genuine issue of material fact likely means other, well-funded defendants will take a similarly aggressive discovery posture going forward.\n\nThe SECond Opinions Blog will continue monitoring this litigation and others in the SEC and crypto enforcement space. If you need additional information on this topic – or any topic related to securities enforcement or investigations – please contact the authors or other members of Holland & Knight's Securities Enforcement Defense Team.\n\nNotes\n\n1 SEC v. Terraform Labs Pte. Ltd., 2023 WL 4858299 (S.D.N.Y. July 31, 2023).\n\n2 As noted above, the court found the Institutional Sales violated Section 5 of the Securities Act, thus satisfying the first element. However, in addition to the genuine issues of material fact concerning the second element detailed above, the court also found that Larsen, Ripple's CEO prior to 2017, also raised a genuine issue of material fact concerning the third element on substantial assistance given he moved away from day-to-day operational duties.\n\n3 The defendant also raised similar arguments advanced by other defendants in SEC crypto enforcement matters, arguing that the Major Questions Doctrine precludes SEC enforcement in this area.\n\n4 Notably, the defendant petitioner sought to distinguish this argument from the one advanced by the Ripple defendants concerning the \"essential ingredients\" test by noting that a contractual right to profits, incomes or assets is a direct prong of Howey.\n\n5 492 F. Supp. 3d 169, 174-76 (S.D.N.Y. 2020).\n\n6 448 F. Supp. 3d 352, 358-59 (S.D.N.Y. 2020).\n\n7 The SEC also heavily leveraged two non-SEC enforcement opinions: Balestra v. ATBCOIN LLC, 380 F. Supp. 3d 340, 347 (S.D.N.Y. Mar. 31, 2019) and United States v. Zaslavskiy, 2018 WL 4346339, at *2 (E.D.N.Y. Sept. 11, 2018)."
    }
]