[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZpbnNtZXMuY29tLzIwMjMvMDMvcmlwcGxlLW1ha2VzLWludmVzdG1lbnQtaW50by1ibG9ja2NoYWluLWZvdW5kZXJzLWZ1bmQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ripple Makes Investment into Blockchain Founders Fund - FinSMEs",
        "content": "Ripple, a leader in enterprise blockchain and crypto solutions, made a strategic investment into Blockchain Founders Fund (BFF), a Singapore-based early-stage Venture Capital Fund that focuses on top-tier Web3 startups globally.\n\nThe investment is part of Ripple’s efforts to accelerate the adoption of blockchain technology globally.\n\nThe funding will be used by BFF to support high-potential early-stage companies that are building the infrastructure and products that will streamline the transition to a decentralized future. Furthermore, the support from Ripple will help BFF’s ability to invest in a wide range of companies with strong founders and compelling growth potential, while continuing to support existing portfolio companies that are already making its mark in the industry such as Splinterlands, Dogami, Krayon, Altered State Machine, Magnaand, LunarCrush.\n\nLed by Aly Madhavji, Managing Partner, Blockchain Founders Fund invests in top-tier Blockchain startups globally with over 100 portfolio companies predominantly focused on the Web3 landscape.\n\nFinSMEs\n\n16/03/2023"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vZm9ya2FzdC5uZXdzL3JpcHBsZS14cnAtc2VjLWxhd3N1aXQv0gEwaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvcmlwcGxlLXhycC1zZWMtbGF3c3VpdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ripple executives say XRP ruling will have little impact on global business operations - Forkast News",
        "content": "The court ruling in a lawsuit brought by the U.S. Securities and Exchange Commission (SEC) against payments processor Ripple Labs Inc. will have minimal impact on the company’s global business expansion, Ripple’s APAC region policy director Rahul Advani said at a press conference in South Korea on Wednesday, according to local media reports.\n\nSee related article: Ripple expects SEC ruling in first half, clearer global regulations for digital assets in 2023\n\nFast facts\n\nAdvani said 90% of Ripple’s business is outside of the U.S., with a large portion in the Asia-Pacific region, local media outlet Bloomingbit reported. Advani said the company has seen the biggest growth during the two years it has been involved in the legal battle with the SEC.\n\nIn December 2020, the SEC filed a lawsuit against Ripple, alleging the US$1.38 billion sale of XRP, the crypto token that powers Ripple’s payment and remittance network, constituted an illegal offering of unregistered securities.\n\nBrooks Entwistle, Ripple’s managing director for the Asia Pacific, Middle East and North Africa, said at the same conference that the future of the cryptocurrency industry in the U.S. itself will be influenced greatly by the ruling in the SEC vs Ripple lawsuit.\n\nAdvani said in an interview with Forkast in January he expects the judge to make a ruling in the case in the first half of this year.\n\nSee related article: MoneyGram seeks to seal parts of its filings in the XRP lawsuit between Ripple, SEC"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LnVyYmFuLmNvbS5hdS9uZXdzL3FsZC9hcGFydG1lbnRzLXN1cHBseS1pbXByb3Zlcy1pbi1wYWxtLWJlYWNoLWFzLWdyYXlhLXNlY3VyZS1hcHByb3ZhbC1mb3ItcmlwcGxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Apartments supply improves in Palm Beach as Graya secure... - Urban",
        "content": "Palm Beach was starved of stock when COVID-19 first hit, with Cabana Palm Beach, The Tally, The Monroe, and Hemingway, among a number to sell out in double-quick time.\n\nApartment supply in Palm Beach, one of the Gold Coast's most in demand areas during the COVID-19 pandemic, is starting to look a little healthier, in the wake of a number of project launches and development approvals.\n\nThe latest to be approved is Ripple Palm Beach, the boutique 19-apartment development by luxury home builder turned multi-res developer GRAYA.\n\nPlus Architecture designed the nine level building, noting in their design statement that they took inspiration from the rhythmic dance of the ocean below, with the facade set to emulate the flow and curves of waves.\n\nA mix of two, three and four-bedroom apartments will be on offer, with each to benefit from their north-easterly orientation, taking advantage of views across the coastline.\n\nRipple will be crowned by two two-level penthouses, both with a rooftop terrace featuring a spa, fire pit, outdoor kitchen and dining area.\n\nA suite of residential amenity will also be on offer across the ground floor, with a sauna, barbecue area and resort-style pool penned for the area.\n\nThey will first be launching Kloud to the market, their 20-apartment project on the dress circle Jefferson Lane. That will have a mix of two, three and four-bedroom apartments across 10 levels.\n\n\n\nA render of Kloud. Image supplied\n\nThey're just waiting for development approval for Kloud before launching later this year.\n\nThere's already been significant interest in the two projects before they've launched, the majority from Brisbane and locals. There's been a number of buyers enquire who have purchased in some of Graya's previous projects in Brisbane.\n\nKloud and Ripple are set to join the luxury ranks alongside STEER's Cote Palm Beach project, which will have 17 half-floor apartments, each with three-bedrooms, three-bathrooms, and two parking spaces.\n\nDKO studio director Kai Chua says the design of each apartment, balances the need for shelter and privacy whilst opening to the ocean and magnificent views. It offers all the wonders of modern coastal living with the warm, intimate embrace of home.\n\nDemolition is currently underway on the Thirteenth Avenue project, with construction expected to start in the coming months.\n\nPalm Beach was starved of stock when COVID-19 first hit, with Cabana Palm Beach, The Tally, The Monroe, and Hemingway, among a number to sell out in double-quick time.\n\nThere's been a large need for more affordable stock, given the forecasted population growth in Palm Beach is expected to boom over the next decade.\n\nThe most recent project launch in Palm Beach is Elevaire, which has prices starting from $715,000. Enquiry has been prominent from both Brisbane and Victoria.\n\nThe approved nine-level tower by local developer Paul Spina has 40 apartments across nine-level, designed by Cottee Parker.There will be a ground floor, wellness-centred recreational space, with hot and cold magnesium pools, an open beach shower, sauna and day beds.There was a swell of owner-occupiers descend on Seaclusion on Twenty First Avenue when that was launched toward the end of 2022, one of the first price-pointed developments to hit the market in around two years.\n\nAll the $695,000 one-bed apartments have been taken. The two-bedroom apartments start from $950,000, and three-bedrooms from $1.495 million.\n\nSeaclusion has been optimised for the coastal lifestyle by BDA, with a range of exclusive residents-only amenities including beach showers and sand washdown areas on the ground floor and a rooftop recreation space complete with a pool, day beds and barbecue area offering panoramic oceanfront views.\n\n"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JpcHBsZS1wYXJ0bmVycy13aXRoLWJsb2NrY2hhaW4tZm91bmRlcnMtZnVuZC10by1hY2NlbGVyYXRlLXdlYjMtYWRvcHRpb24tMzAxNzcxNTU1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ripple Partners with Blockchain Founders Fund to Accelerate Web3 Adoption - PR Newswire",
        "content": "Ripple invests in BFF's Fund II to support Web3 and crypto startups globally\n\nSINGAPORE, March 16, 2023 /PRNewswire/ -- Ripple , a leader in enterprise blockchain and crypto solutions announced today that it has made a strategic investment into Blockchain Founders Fund (BFF), a Singapore-based early-stage Venture Capital Fund that focuses on top-tier Web3 startups globally. The investment is part of Ripple's efforts to accelerate the adoption of blockchain technology globally. The funding will be used by BFF to support high-potential early-stage companies that are building the infrastructure and products that will streamline the transition to a decentralized future.\n\nRipple Partners With Blockchain Founders Fund to Accelerate Web3 Adoption\n\nBlockchain Founders Fund is backed by industry leaders, investors, and family offices, including leading financial institutions. With over 100 portfolio companies predominantly focused on the Web3 landscape, BFF has proven to be an industry-leading venture capital fund with the means and expertise to scale startups.\n\nFurthermore, the support from Ripple will help BFF's ability to invest in a wide range of companies with strong founders and compelling growth potential, while continuing to support existing portfolio companies that are already making its mark in the industry such as Splinterlands , Dogami , Krayon , Altered State Machine , Magna and LunarCrush .\n\nBrooks Entwistle , Senior Vice President and Managing Director at Ripple commented, \"It's clear that blockchain technology can transform industries. We want to see startups unlock the potential of blockchain technology, and are excited to partner with Blockchain Founders Fund to accelerate startups that are creating world-class products with real-world utility for the global market.\"\n\nAly Madhavji , Managing Partner of Blockchain Founders Fund said, \"We are extremely grateful for the support received from one of the most prominent players in the industry. We are at the forefront of this revolution and this partnership with Ripple will further drive the next generation of entrepreneurs and expand their businesses into new markets.\"\n\nThrough its investment in BFF, Ripple is making a significant move towards accelerating the adoption of blockchain technology worldwide. By unlocking the potential of early-stage companies in the Web3 and crypto space, this partnership between Ripple and BFF promises to drive innovation and support web3 entrepreneurs who are shaping the future of decentralized technologies.\n\nAbout Ripple\n\nRipple is a crypto solutions company that transforms how the world moves, manages and tokenizes value. Ripple's business solutions are faster, more transparent, and more cost-effective - solving inefficiencies that have long defined the status quo. And together with partners and the larger developer community, we identify use cases where crypto technology will inspire new business models and create opportunity for more people. With every solution, we're realizing a more sustainable global economy and planet - increasing access to inclusive and scalable financial systems while leveraging carbon-neutral blockchain technology and a green digital asset, XRP. This is how we deliver on our mission to build crypto solutions for a world without economic borders.\n\nAbout Blockchain Founders Fund\n\nBlockchain Founders Fund (BFF) is a Singapore based early-stage Venture Capital Fund which invests in top-tier Blockchain startups globally. Their industry leading go-to-market focused Venture Program aids seasoned and first-time entrepreneurs across key business functions to fast track growth. BFF has scaled many of the leading Blockchain startups and is always looking to connect with exceptional founders across the Web3 and Blockchain ecosystems.\n\nSOURCE Blockchain Founders Fund; Ripple"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnVhbGJlcnRhLmNhL2ZvbGlvLzIwMjMvMDMvcmVzZWFyY2hlci1haW1zLXRvLWFzc2Vzcy1yaXBwbGUtZWZmZWN0cy1vZi1yb2RlbnQtZGlzZWFzZS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Researcher aims to assess ripple effects of rodent disease - University of Alberta",
        "content": "Mice, voles and other rodents are small, but as carriers of disease, they can pack a mighty punch.\n\nThe chronic infections they carry may not only threaten their existence as a food source for larger wildlife, but also pose a health risk to humans.\n\nIt’s a pressing issue that Ivana Schoepf, a new assistant professor at the University of Alberta’s Augustana Campus, plans to address as she launches research into how small mammals cope with the stress of disease, particularly when they are also facing extra strain from changes in their habitats.\n\nThe double challenge can weaken the animals’ resistance even further, “which could lead to diseases spreading faster,” she says.\n\nAppointed to Augustana’s Department of Science this past summer, Schoepf is studying voles and mice through the Augustana Miquelon Lake Research Station.\n\nThe conservation scientist hopes to help reduce disease risk to forest dwellers like hunters, trappers, hikers and tourists, and protect vulnerable wildlife populations.\n\nBoth types of rodents are common carriers of serious conditions that can be transmitted to humans, such as hemorrhagic fever, hantavirus and giardiasis, a diarrheal disease.\n\nKnowing more about the toll the disease takes is important to ultimately finding solutions, says Schoepf.\n\n“As COVID has shown us, human health can be greatly affected by the spread of zoonotic diseases. Only when we’ve gained enough fundamental knowledge about how disease affects individuals and populations can we find ways to tackle its spread.”\n\n“Cascading effects” of disease\n\nSchoepf will also investigate how the chronic infections mice and voles harbour could be affecting their ability to reproduce, grow and survive.\n\nThe tiny creatures are vital to the survival of other animals, Schoepf notes.\n\n“It’s important to know more about these rodents; they are at the base of the food pyramid for many carnivores in Alberta, like coyotes and lynx. If these diseases result in fitness costs to rodents, then we might see cascading effects impacting their predators too.”\n\nStudy findings from Schoepf’s postdoctoral work already indicate that chronic infection does indeed take a toll in at least one species.\n\nThe research showed that when a chronic parasitic infection in female red-winged blackbirds was reduced medically, they laid heavier eggs, incubated them longer and fed the chicks more often.\n\nIn addition, the chicks from medicated mothers were in better condition and had higher survival rates than fledglings from unmedicated females. And male blackbirds territorially responsible for unmedicated mothers had to work harder, feeding those chicks at a higher rate than male counterparts who were helping medicated females.\n\n“It tells us that chronic infection is definitely costly, and these costs affect the entire population, through all stages of the life cycle,” Schoepf says.\n\nThat effect may, in turn, further jeopardize wildlife already on the brink of extinction, she says.\n\n“It could lead to populations crashing.”\n\nHer research at the U of A will continue to expand on those findings, by focusing next on red-winged blackbird chicks at Miquelon Lake, measuring how infection affects their physiology and behaviour.\n\nBecause acute infections typically result in high virulence and mortality in wildlife populations, the animals are seldom available to study, Schoepf notes.\n\n“As a result, our knowledge remains limited, so the hope is that we can build more insight into the costs of infections.”\n\nFertile ground for research\n\nWith its distinct seasons and mix of both developed and agricultural land, Alberta — and the Miquelon Lake area in particular — offer a prime environment for studying how wildlife copes with change, she adds.\n\n“As a small provincial park surrounded by agricultural land, it's a pretty ideal place to study the questions I have.”\n\nDrawn to the U of A by its standing as one of the largest universities in Canada and its wide array of researchers, Schoepf is aiming to expand her work through collaboration with other researchers at the university, particularly in population genetics. She hopes to discover more about gene flow, the transfer of genetic material between different animal populations.\n\n“It’s a field that can potentially give great insights into how certain diseases persist in some populations more than others.”\n\nUltimately, Schoepf is hopeful her future research could help inform conservation of wild animal populations, including those at risk of extinction, she adds.\n\n“By understanding how disease affects wildlife, we can design more robust management plans for the conservation of vulnerable species.”"
    }
]