[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LmxlZGdlcmluc2lnaHRzLmNvbS9zZWMtdG8tYXBwZWFsLXJpcHBsZS1jYXNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "SEC to appeal Ripple case. Damages could be high as Ripple sold $3bn more XRP - Ledger Insights",
        "content": "Yesterday the Securities and Exchange Commission (SEC) sent a letter to Judge Torres stating it plans to file an interlocutory appeal re the summary judgement in the Ripple cryptocurrency case. It also wants to pause further proceedings in the case until the outcome of the appeal.\n\nTorres previously found the manner in which Ripple sold XRP crypto tokens to institutional investors classified it as a security based on the Howey Test. However, indirect programmatic sales via exchanges to retail investors were not securities. Likewise for other XRP distributions.\n\nMany found it odd that the same token might sometimes be treated as a security and sometimes not, depending on how it is sold.\n\nSEC cites contradictory opinion of another judge\n\nAnother judge in the same court has already rejected Judge Torres’ decision. In a lawsuit regarding Terraform Labs – the company that founded the Terra stablecoin that triggered the crypto crash – Judge Rakoff had strong opinions.\n\n“That a purchaser bought the coins directly from the defendants or, instead, in a secondary resale transaction has no impact on whether a reasonable individual would objectively view the defendants’ actions and statements as evincing a promise of profits based on their efforts,” wrote Judge Rakoff.\n\nThe SEC mentioned Rakoff’s views in its letter. It also argued for the need to settle this matter of law as it impacts other pending cases, including the SEC’s actions against Coinbase, Binance and TRON founder Justin Sun.\n\nIt would also result in a single remedies phase.\n\nHow much is Ripple going to need to pay?\n\nOn that point, the SEC also touched on Ripple’s liability for the institutional sales, where Judge Torres ruled in favor of the SEC. Those XRP sales amounted to $1.3 billion before the case was filed. But the SEC estimated there have been an additional $3 billion of XRP sales by Ripple since then, which were all related to its On Demand Liquidity (ODL) offering and hence are institutional sales."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LmNhbnIubXN1LmVkdS9ldmVudHMvcmlwcGxlLWV4b3RpYy1maXNoLXN1cnJlbmRlci1ldmVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "RIPPLE Exotic Fish Surrender Event - Invasive Species - Michigan State University",
        "content": "RIPPLE Exotic Fish Surrender Event\n\nAugust 10, 2023 7:00PM - 9:00PM\n\n30140 Van Dyke Ave Warren, MI 48093\n\nContact:\n\nPhoto credit: Paige Filice\n\nDo you have aquarium or water garden pets you can no longer care for?\n\nIt is never safe to release water garden or aquarium plants and animals into the natural environment, even if they appear to be dead.\n\nAt the RIPPLE Exotic Fish Surrender Event we will be accepting common aquarium and water garden species including freshwater fish, plants, crayfish and snails. No other species will be accepted (dogs, cats, birds, small mammals, reptiles or amphibians). The surrendered plants and animals will be donated.\n\nRIPPLE Exotic Fish Surrender Event\n\nAugust 10, 2023 7:00PM - 9:00PM\n\n30140 Van Dyke Ave Warren, MI 48093\n\nThis event is being hosted by the Reduce Invasive Pet and Plant Escapes (RIPPLE) program in partnership with Motor City Aquarium Society, Fishy Bizz, and Chris's Pet Shop.\n\nMany plants and animals that we use in aquariums and backyard ponds have been imported from other parts of the world. While they are excellent to enjoy, they may be harmful to Michigan's native ecosystems if they are released into the wild. Although Michigan’s winter temperatures stop some exotic species from reproducing in our lakes and streams, this is not always the case. Some species survive and thrive, negatively impacting the environment, decreasing recreational opportunities and causing severe economic consequences.\n\nQuestions about what can be accepted? Contact Paige Filice at filicepa@msu.edu\n\nRIPPLE offers information to aquarium and water gardener professionals, retailers and hobbyists about what to do with unwanted plants and animals so they are not introduced into Michigan's lakes and streams. RIPPLE's education initiatives are coordinated by Michigan State University Extension in partnership with the Michigan Department of Environment, Great Lakes and Energy, Michigan Department of Natural Resources and the Michigan Department of Agriculture and Rural Development. RIPPLE is funded by the Michigan Invasive Species Grant Program.\n\nRelated People"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wOC8xMC9zZWMtYXBwZWFsLWZlZGVyYWwtY291cnQtcnVsaW5nLXhycC1jYXNlLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "SEC bites back, to appeal federal court ruling in XRP case - TechCrunch",
        "content": "In mid-July, a federal court settled a years-long battle between Ripple Labs and the SEC to decide if Ripple’s XRP token was a security or not. Southern District of New York judge Analisa Torres ruled that the XRP token is not a security when sold to the general public, but it could be treated as one with regard to past sales to institutional clients.\n\nThe regulator doesn’t seem to be happy with that partial victory: The SEC said in a court filing on Wednesday that it would file an “interlocutory appeal” for Torres’ ruling.\n\n“Interlocutory review is warranted here,” the SEC said in its new filing. “These two issues involve controlling questions of law on which there is substantial ground for differences of opinion, as reflected by an intra-district split that has already developed.”\n\nBasically, this means the SEC wants a redo on the first half of the case, and to be fair, the somewhat “split” ruling was a bit confusing initially: Torres had said that some of Ripple’s programmatic sales of XRP tokens didn’t violate securities laws because they involved a bidding process, but direct sales to institutions did fall under the ambit of securities laws.\n\nThe SEC’s move this week doesn’t come as a surprise. The regulator had complained after the ruling that the verdict was “wrongly decided” and the court “should not follow them,” and even repeated its statement in legal documents for a separate case against Terraform Labs.\n\nBut Ripple won’t shy away from the SEC’s likely appeal, Stu Alderoty, chief legal officer of Ripple Labs, told me on Chain Reaction in late July. “We think the judge got that right, and we think that was a faithful application of the law. A court of appeals will not only affirm that, but maybe even amplify that to even a greater extent.”\n\nThe SEC’s new filing needs to be approved by the US SDNY for appeal, and then by the court of appeals. Once it jumps those hurdles, the SEC would need permission from the US Court of Appeals for the Second Circuit.\n\nThe SEC and Ripple have been at it in the courts since 2020, when the agency alleged that the crypto firm raised $1.3 billion via sales of XRP, which it claimed was an unregistered security."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdGhlcmVhbGRlYWwuY29tL25hdGlvbmFsLzIwMjMvMDgvMTAvd2V3b3JrLWJhbmtydXB0Y3ktd291bGQtcmlwcGxlLWFjcm9zcy1yZWFsLWVzdGF0ZS1pbmR1c3RyeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "WeWork Bankruptcy Would Ripple Across Real Estate Industry - The Real Deal",
        "content": "WeWork didn’t mince words in its earnings report this week, flatly stating what anyone paying attention to its business and the office market could surmise: There is “substantial doubt” that the company can continue operating.\n\nThat’s obviously bad news for WeWork shareholders and employees, but Chapter 11 or Chapter 7 bankruptcy would also suck WeWork’s landlords, lenders and even the office market as a whole into the wreckage.\n\nIt’s an extremely unappetizing situation for all involved.\n\n\n\nAnthony Sabino, bankruptcy expert\n\nChapter 11 would give WeWork the right to terminate its leases, leaving a lot of office owners with swaths of empty space and a lot of WeWork’s tenants without desks.\n\nBecause WeWork primarily leases older buildings, its demise could accelerate the pandemic-induced plunge in value and revenue for Class B and C offices. WeWork’s lenders wouldn’t fare any better, as it would be unclear how much money — if any — they could recoup.\n\n“It’s an extremely unappetizing situation for all involved,” said Anthony Sabino, a bankruptcy expert at law firm Sabino & Sabino and law professor at St. John’s University’s Tobin College of Business.\n\nThe source of WeWork’s recent troubles isn’t hard to pinpoint: It suffers from the same problems as its landlords. Broad adoption of work-from-home has allowed tenants to shrink or even zero out their office footprints, and the rise in interest rates makes it hard to refinance debt.\n\nBut questions about WeWork’s long-term viability circulated for years, even before the pandemic.\n\n“Our primary concern with WeWork is that while it has been successfully pioneering the shared office concept, the company has yet to post a profit or experience a downturn,” read a Morningstar report from August of 2019.\n\nThat would change — the downturn part, that is — six months later when Covid began spreading across the globe.\n\nOnce valued by its private investors at $47 billion, WeWork, now a public company, was worth just $274 million when the market closed Wednesday. Its stock price, which was $13 at its IPO, is just 13 cents.\n\nAt one time, WeWork was the largest leaseholder in New York City, so the number of landlords the company’s collapse would affect is vast. Crain’s reported that WeWork occupies about 6.4 million square feet across 70 Manhattan offices, with Boston Properties, Rudin Management, RXR Realty and Tishman Speyer among the landlords leasing the most space to the flailing firm.\n\nShould WeWork file for Chapter 11 bankruptcy, which offers companies the chance to reorganize and continue, it could postpone payments on old debt and back rent. However, the company would be on the hook for any bills that come due after that. So if WeWork filed today, it would still have to pay September rent.\n\nLandlords would have the option to force WeWork into liquidation, just as if WeWork filed for Chapter 7. But it’s uncertain how much cash that would actually leave for creditors, given that WeWork’s assets are leases that wouldn’t fetch as much money as they would have before the pandemic.\n\nIt’s an unappetizing choice for WeWork’s landlords: push the company into liquidation for an uncertain payout, or keep negotiating with the firm in hopes that it can stay solvent through bankruptcy.\n\n“I think it’s a potential cluster situation,” said Ed Weil, national co-leader of law firm Dykema’s CMBS practice. “It could have a cascading effect.”"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wOC8xMC9yaXBwbGUtdi1zZWMtY3J5cHRvLWluZHVzdHJ5LW1heS1oYXZlLWNlbGVicmF0ZWQtdG9vLWVhcmx5LXBldGVyLWZveC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "Ripple v. SEC: Why the crypto industry may have celebrated too early - Fortune",
        "content": "Last month’s decision by a court in the U.S. District Court for the Southern District of New York on the SEC’s claims against Ripple Labs has been generally hailed as a victory for the token issuers and exchanges. However, the actual impact of the decision on the future of cryptocurrencies in the U.S. is not so clear.\n\nBy highlighting the principle that the SEC’s jurisdiction over digital assets depends on the nature of the offer or sale of such assets rather than the intrinsic qualities of the asset itself, the decision is indeed a positive development for the industry. But other favorable aspects of the decision for Ripple seem ripe for a reversal on appeal. Ironically, that could strengthen the SEC’s hand going forward.\n\nAn unusual decision\n\nThe SEC’s claims against Ripple hinged on whether Ripple’s distribution of its cryptocurrency, XRP, was a “security” for the purposes of the Securities Act. More specifically, the question was whether these transactions satisfied a three-pronged test for an “investment-contract” security devised by the Supreme Court over seven decades ago in SEC v. W.J. Howey Co.\n\nUnder the Howey test, transactions involving the (1) investment of money in (2) a common enterprise with (3) an expectation of profit from the efforts of others, are securities. If these transactions were securities, Ripple was required to make certain public disclosures (which it concededly did not make), along with observing other compliance obligations.\n\nThe court concluded that certain negotiated sales of large blocks of XRP institutional purchasers satisfied the Howey test (sales the court called “institutional sales”)–but that anonymous sales by Ripple on cryptocurrency exchanges (so-called “programmatic sales”) did not, nor did Ripple’s transfer or XRP to vendors or employees in exchange for services (termed “other distributions”). Thus, the SEC prevailed on its claim as to the institutional sales, but not as to other types of distributions of XRP. The SEC’s related claims against Ripple’s founder, former CEO, and current chairman of the board Christian Larson and the former COO and current CEO, Bradley Garlinghouse over Ripple’s institutional sales will continue to trial. Larson and Garlinghouse deny any wrongdoing.\n\nThe most striking feature of the decision is that the court applied the “expectation” element of the “expectation of profit from the efforts of others” differently to different groups of purchasers.\n\nNormally, courts focus their analysis of this prong of the Howey test on whether a person with knowledge of all public information about the role of the people offering an investment (typically called “promoters”) in the future success of the investment would expect that the promoters’ ongoing efforts are key to profits. Instead, the court focused on the actual information available to different sets of purchasers. The court reasoned that since the institutional purchasers knew they were buying XRP from Ripple, and were provided marketing materials from Ripple, they would expect the value of the XRP to be affected by Ripple’s efforts. By contrast, the programmatic buyers’ assumed relative ignorance of Ripple’s role in developing, marketing, and distributing XRP led the court to conclude that these buyers would not reasonably expect Ripple’s activities to affect XRP.\n\nAs for the other distributions, the court concluded these transfers lacked the necessary “investment of money” to satisfy the Howey test. The ruling is in contrast to the SEC’s longstanding position that nearly any benefit to the promoter has value and can be considered an investment of money.\n\nWhat it means for the industry\n\nThe cryptocurrency industry has long advocated for a more transaction-focused approach to Howey. By distinguishing among groups of XRP purchasers, the Ripple decision delivers one.\n\nAnimating the industry’s goal in this respect is a desire to exclude secondary market transactions from the SEC’s jurisdiction, among other motivations. The question is existential for many market intermediaries, particularly cryptocurrency exchanges, whose subjection to SEC jurisdiction turns on whether they deal, broker, clear, or operate an exchange for trading securities.\n\nHere, the Ripple decision delivers for the industry again. By holding that knowing one’s privity with the promoter is key to the expectation of profit from the efforts of others, the court comes close to carving out secondary market transactions per se, and even (as was the case with the programmatic sales) immunizes anonymized direct sales from promoters like Ripple.\n\nSimilarly, if it stands, the court’s formalistic interpretation of the investment-of-money prong of Howey would seem to open the door to more extensive use of digital assets in employee compensation, developer grants, and promotional giveaways (eg. airdrops, a popular if controversial tool for the distribution of crypto tokens).\n\nHow an appeal could make things worse\n\nBefore the cryptocurrency industry spends too heavily on champagne, it should remember that the Ripple decision is not a precedential opinion, nor is it necessarily the last word on the case. The SEC has the right to appeal–and is expected to use it.\n\nBeyond its novelty, the court’s focus on XRP purchasers’ specific access to information about Ripple yields a perverse result. The sale of XRP to the most sophisticated investors, who by virtue of the bespoke nature of the transaction were privy to the most information about how Ripple’s activities may affect the value of XRP, is a security, subject to the investor protections and restrictions mandated by the securities laws. Whereas, the offer and sale of XRP to retail investors, who dealt with Ripple in anonymous transactions through exchanges and otherwise, is not a security and does not require disclosure or offer those same investor protections. Those people who already have the most information are given a right to more, while those people with the least information go without.\n\nThe court’s ruling on the “other distributions” seems on similarly shaky ground. In addition to running up against precedent that “sales” of securities need not involve the transfer of tangible items of value, this interpretation appears to open loopholes in Howey for various non-traditional forms of financing. Indeed, it is even difficult to square with the established concept of “sweat equity.”\n\nShould the Second Circuit Court of Appeals reverse either or both of the industry‑favorable elements of the Ripple decision, the SEC will be finally armed with precedential case law applying Howey to a cryptocurrency–a weapon of no small importance for its fights with the cryptocurrency exchanges Coinbase and Binance over whether the tokens they listed are securities.\n\nLonger-term effects and benefits\n\nEven if significant pieces of the Ripple decision are reversed on appeal, one aspect of the case is likely to provide lasting benefit to the cryptocurrency industry. The court was almost certainly correct to focus its Howey analysis on the transactions in question, rather than the underlying assets. Courts in the past have occasionally missed this subtle distinction–most likely because other parts of the definition of the term “security” in the Securities Act are tied to financial instruments themselves, such as stocks and bonds. But Howey addresses investment contracts, which is why its test focuses on the parties’ actions and expectations, which are driven by the facts and circumstances surrounding the relevant transactions.\n\nAlthough the court’s distinction between groups of purchasers’ access to information is unlikely to survive appeal as meaningful for Howey test purposes, other purchaser differences might one day be dispositive. Most obviously, courts could draw lines between groups of purchasers over time. As decentralized token projects progress, it is plausible to imagine that the expected effect of the efforts of promoters on profits will change. These efforts might be relevant to profits for an early group of purchasers, but not for a later group after control of the project becomes fully decentralized. Similarly, as such projects mature, the motive for buying a cryptocurrency may change. A reasonable early purchaser might be drawn to financial returns (investment profits) while the primary motive for a later purchaser might be to use the token within a particular network or protocol (consumption).\n\nIf future courts take account of these distinctions between purchasers, defendants may have the Ripple court’s attention to differentiated transactional details to thank.\n\nPeter Fox and Peter Scoolidge are partners at Scoolidge, Peters, Russotti & Fox LLP. Damien Scott is an attorney at Scoolidge, Peters, Russotti & Fox LLP.\n\nThe opinions expressed in Fortune.com commentary pieces are solely the views of their authors and do not necessarily reflect the opinions and beliefs of Fortune."
    }
]