[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnBhcmVudHMuY29tL3JlY2lwZXMvc2Nvb3Atb24tZm9vZC90aGluZ3MtcGFyZW50cy1zaG91bGQta25vdy1hYm91dC1ub24tZGFpcnktbWlsa3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "7 Things Parents Should Know About Non-Dairy Milks - Parents",
        "content": "Non-dairy milks such as rice, soy, and almond milk are trendy right now, especially for those who want to raise vegan children—or who are struggling to find formula. But for many families, it's not about following a fad. Some choose these milks because of an intolerance or allergy to cow's milk. Other families eat a vegan diet that eliminates all animal products. In our house, I actually stock both dairy and non-dairy milks and have even made my own batches of almond and cashew milk.\n\nCan these non-dairy products even be called \"milk\" since they don't come from cows? In 2018, the Food and Drug Administration (FDA) started a journey to answer that question. It took five years, but in February 2023, the FDA issued draft guidance for the labeling of plant-based milks.\n\nOfficials say despite plant-based milks not coming from cows, companies can still call them milk. But the FDA suggests updated labeling that includes a statement comparing the product's nutritional value to regular milk. The language would say something like, \"Contains lower amounts of Vitamin D and calcium than milk.” But that step is completely voluntary at this point.\n\nThe FDA says soy beverages that contain calcium, vitamin A, and vitamin D are the only plant-based milks that can be included in the dairy group as defined by the government's Dietary Guidelines for Americans.\n\n“Getting enough of the nutrients in milk and fortified soy beverages is especially important to help children grow and develop, and parents and caregivers should know that many plant-based alternatives do not have the same nutrients as milk,” says Susan T. Mayne, Ph.D., director of the FDA’s Center for Food Safety and Applied Nutrition in a press release.\n\nNon-dairy milks can certainly be part of a healthy diet for kids. But as a dietitian, I've seen some misinformation out there that concerns me. It's important to be informed so you can be sure your child is getting the nutrition he needs. Here are some facts you need to know about non-dairy milks:\n\nSally Kuzemchak, M.S., R.D. Nut milk, other non-dairy milks, and cow's milk can not replace breast milk or formula for infants. — Sally Kuzemchak, M.S., R.D.\n\n1. Non-Dairy Milk Should Never Be Used as Infant Formula\n\nInfant formulas are specifically designed to meet the unique needs of babies. They're regulated by the FDA and must meet federal nutrient standards. Non-dairy milks are not safe swaps for formula. Never give soy milk in place of a soy-based infant formula and do not feed your baby almond milk. Nut milk, other non-dairy milks, and cow's milk can not replace breast milk or formula for infants. Both cow's milk and non-dairy milks can be part of your child's diet after age 1.\n\n2. Non-Dairy Milks Are Not Nutritionally Similar to Cow’s Milk\n\nNon-dairy milks aren't one-for-one substitutions for regular milk, nutritionally speaking. In fact, calcium-fortified soy milk is the only non-dairy milk that the USDA's MyPlate guidelines consider as equivalent to dairy (because it's the closest in terms of protein). Unlike non-dairy milks, cow's milk is naturally a good source of nutrients like protein, calcium, potassium, and vitamin B12.\n\n3. Homemade Versions of Nut Milks Are Not Good Sources of Calcium or Vitamin D\n\nWhile homemade nut milks are easy to make (and taste much fresher than store-bought), keep in mind that non-dairy milks are typically fortified with calcium and vitamin D. So the homemade kind won't provide those same nutrients.\n\n4. Most Non-Dairy Milks Are Very Low in Protein\n\nI've seen almond milk listed as a good source of protein. But it actually contains very little protein: only about 1 gram per serving compared to 8 grams for cow's milk or 7 grams for soy milk. (Although almonds are a good source of protein, the nut solids are actually strained out when making the milk.) Hemp, cashew, rice, and coconut milk are also low or very low in protein. So unless you're serving soy or pea milk, don't count on non-dairy milk as a good protein source—and be sure your child (who is older than 1) is getting protein in other places.\n\n5. It’s Important To Shake Non-Dairy Milks Before Serving\n\nIn the case of calcium-fortified milks, the calcium solids can settle on the bottom of the carton. So to get the bone-building calcium in your glass, shake the carton well before pouring.\n\n6. Non-Dairy Milks Can Pack a Lot of Sugar\n\nWatch out for flavored non-dairy milks, which can contain multiple teaspoons of sugar in a glass. Case in point: A glass of name-brand vanilla almond milk has four teaspoons of added sugar per serving (that's about half a day's worth for a child ages 4-8!). I'm okay with my kids having some flavored milk, but even varieties marked \"original\" may contain added sugar. Check the ingredient lists for sources of added sugar and look for the word \"unsweetened\" on the front of the package.\n\n7. Non-Dairy Milks Have Unique Flavors\n\nIf you're searching for a non-dairy milk that your kids like, there's a lot to choose from, and they all have different flavors. While almond milk and cashew milk are slightly nutty, rice milk is mildly sweet. Experiment to find what your family likes best. And if they don't like non-dairy milks straight up, they might like them blended into a smoothie!\n\nSally Kuzemchak, MS, RD, is a registered dietitian, educator, and mom of two who blogs at Real Mom Nutrition. She is the author ofThe Snacktivist's Handbook: How to Change the Junk Food Snack Culture at School, in Sports, and at Camp—and Raise Healthier Snackers at Home. She also collaborated with Cooking Light on Dinnertime Survival Guide, a cookbook for busy families. You can follow her on Facebook, Twitter, Pinterest, and Instagram. In her spare time, she loads and unloads the dishwasher. Then loads it again."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5hYmMxNS5jb20vbmV3cy9yZWdpb24tc291dGhlYXN0LXZhbGxleS90ZW1wZS90ZW1wZS10b3duLWxha2UtY2xvc3VyZS1mb3JjZXMtcG9zdHBvbmVtZW50LW9mLWFyaXpvbmEtZHJhZ29uLWJvYXQtZmVzdGl2YWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Tempe Town Lake closure forces postponement of Arizona Dragon Boat Festival - ABC15 Arizona in Phoenix",
        "content": "TEMPE — Though the rain is gone for now, the recent storms and the snow runoff brought a lot of water and flooding to the Valley, causing a ripple effect for events in the community.\n\nThe City of Tempe closed down Tempe Town Lake on Thursday, saying that SRP increased the amount of water being released from the reservoirs upstream and that the lake was unsafe for people to be in it.\n\nBecause of that, the Arizona Dragon Boat Festival had to postpone its event, which was supposed to take place all weekend. The festival brings in thousands of people from all over the country and internationally. Organizers said they had more than 60 teams competing and each team has more than 20 members.\n\nNathan Salazar, the coach of LA County Dragon Boat Club said they received the notice on Thursday that the event was postponed. He planned to bring more than 80 paddlers to Tempe, however, some still came since they couldn’t cancel hotel stays or for other reasons.\n\n“It’s a little heartbreaking, but it is what it is. It’s something we can’t avoid. Mother Nature decided to happen,” he said, adding that he understood why the festival needed to be postponed.\n\nAnne Bennie and her team flew from Canada for day camps and the festival. They arrived on St. Patrick’s Day and have been on the water over the week through a camp. Bennie told ABC15 she did see a difference in the lake in the last few days as storms moved through.\n\n“When we were first here, it wasn’t too bad. I have to say Thursday, there was a lot of debris,” she said.\n\nWhile many wait to see when the Arizona Dragon Boat Festival will be rescheduled, some who came here for it made the most out of their trip and plan to come back when the new dates are announced. Bennie said it wouldn’t happen for her, since she’s out of the country, but she said she’ll come back next year\n\nNathan Rocha, who’s part of the LA County Dragon Boat Club, said he’d be happy to come back, understanding why the festival needed to be postponed.\n\n“I’ll definitely come back or next time we have the race here. It’s fun. Hang out with friends after the race, practice with them before and get to spend more time with them,” Rocha said.\n\nThe City of Tempe says staff continues to check the lake daily to see if it is safe enough to reopen to the public. As of right now, there’s no set date."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5ueWRhaWx5bmV3cy5jb20vMjAyMy8wMy8yNi9mZG55LWNoaWVmcy1kZW1vdGlvbnMtaGF2ZS1yaXBwbGUtZWZmZWN0LW9uLXNleC1oYXJhc3NtZW50LWNhc2UtYWdhaW5zdC1tb3RoZXJsZXNzLWJyb29rbHluLWZpcmUtbWFyc2hhbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "FDNY sexual harassment case delayed over NYC fire chief demotions - New York Daily News",
        "content": "New York Daily News\n\nFront page of the New York Daily News for March 5, 2023: Inside the bitter battle tearing FDNY apart - are lives at risk? Fire Commissioner Laura Kavanagh has overseen a shakeup of the FDNY that has angered a group of her top chiefs."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5ueWRhaWx5bmV3cy5jb20vMjAyMy8wMy8yNi9mZG55LWNoaWVmcy1kZW1vdGlvbnMtaGF2ZS1yaXBwbGUtZWZmZWN0LW9uLXNleC1oYXJhc3NtZW50LWNhc2UtYWdhaW5zdC1tb3RoZXJsZXNzLWJyb29rbHluLWZpcmUtbWFyc2hhbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "FDNY sexual harassment case delayed over NYC fire chief demotions - New York Daily News",
        "content": "New York Daily News\n\nFront page of the New York Daily News for March 5, 2023: Inside the bitter battle tearing FDNY apart - are lives at risk? Fire Commissioner Laura Kavanagh has overseen a shakeup of the FDNY that has angered a group of her top chiefs."
    }
]