[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNoYXNlLmNvbS9wZXJzb25hbC9pbnZlc3RtZW50cy9sZWFybmluZy1hbmQtaW5zaWdodHMvYXJ0aWNsZS90bXQtbWFyY2gtdGhpcnR5LW9uZS10d2VudHktdGhyZWXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "The Ripple Effects Of The Bank Crisis | Chase - Chase News & Stories",
        "content": "Chase's website and/or mobile terms, privacy and security policies don't apply to the site or app you're about to visit. Please review its terms, privacy and security policies to see how they apply to you. Chase isn’t responsible for (and doesn't provide) any products, services or content at this third-party site or app, except for products and services that explicitly carry the Chase name."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3JlbGl4LmNvbS9uZXdzL2RldGFpbC9kYXlnbG8tcmVsaXgtYW5kLWRlZXAtZGl2ZS1wcmVzZW50LXJpcHBsZS1lZmZlY3QtZm91ci1kYXlzLW9mLW11c2ljLWluLWl0aGFjYS1mZWF0dXJpbmctZGotbG9naWMtbWlrYWVsYS1kYXZpcy1hbmQtbW9yZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Dayglo - Relix",
        "content": "Dayglo, Relix and Deep Dive have come together to present the Ripple Effect, a weekend of concerts scheduled to occur at Deep Dive in Ithaca, N.Y. The upcoming series of shows will happen on May 5 through 8–the final date will coincide with Dead & Company’s highly anticipated benefit concert at Barton Hall on Cornell University’s Campus.\n\nThe live music event will begin on Friday, May 5, with an afternoon appearance by GoGone, who will deliver their signature blend of roots, blues and rock. Later that night, Yam Yam are scheduled to take the stage with assistance from Sun Parade.\n\nSaturday, May 6, is billed to include a mid-afternoon set on the deck with the Dirty Gems, who will take the stage at 2 p.m. Later that evening, Consider The Source, with Long Island fixture, MJT band will perform at 8 p.m. An additional performance will arrive on Sunday, May 7, morning, with The Rock and Roll Playhouse’s family-friendly celebration of the Grateful Dead, which will be helmed by Mikaela Davis & Southern Star.\n\nNotably, later on Sunday evening, the Dead-inspired sets will continue into the evening with a tribute to the San Francisco jamband led by the renowned harpist and her band. The final Ripple Effect events will land on Monday, May 8, and include a 5 p.m. frame courtesy of Davis with Richie Stearns, who will be followed by a set billed as DJ Logic and TBA.\n\nIn addition to the events mentioned above, the Jerry Dance Party is scheduled to take place during Dead & Company’s upcoming visit to Barton Hall. Dayglo and Elmthree will present two shows on May 7 and 8 at The Range on the commons in Ithaca, N.Y.\n\nThe Jerry Dance Party will feature state-of-the-art audio combined with a mind-bending light and video experience and will be hosted by DJ Jerrbrother. The events are known for featuring guests in after-shows to celebrate all eras of Garcia’s career, with live cuts by Grateful Dead as well as Old & In The Way, Jerry Garcia Band, Merl Saunders, John Kahn, New Riders of the Purple Sage and many more. Read more.\n\nTickets for Dayglo, Relix and Deep Dive presented Ripple Effect events go on sale Monday, April 3 at 11 a.m. E.S.T."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9yaXBwbGUtY2VvLWNhbGxzLW9uLXVzLWxhd21ha2Vycy10by1sb29rLWludG8tc2VjLWNoYWlyLWdlbnNsZXJzLWNyeXB0by1hc3NlcnRpb25zL9IBcGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9yaXBwbGUtY2VvLWNhbGxzLW9uLXVzLWxhd21ha2Vycy10by1sb29rLWludG8tc2VjLWNoYWlyLWdlbnNsZXJzLWNyeXB0by1hc3NlcnRpb25zLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Ripple CEO Calls on US Lawmakers to Look into SEC Chair Gensler’s Crypto Assertions - CryptoPotato",
        "content": "Brad Garlinghouse, the chief executive officer of Ripple Labs, has called on lawmakers in the United States to look into assertive statements made by Gary Gensler, the chairman of the Securities and Exchange Commission (SEC), about the American crypto industry.\n\nGarlinghouse’s comments come as Gensler told a House Appropriations Committee in a recent hearing that there is no need for additional legislation for crypto assets, as already existing securities laws are sufficient for regulating the sector.\n\nGensler’s Assertions are “Beyond Comprehension”\n\nIn a tweet, the Ripple CEO insisted that the SEC chair’s assertions are beyond comprehension. Urging elected officials to notice Gensler’s actions, Garlinghouse pointed out that the SEC is subject to the legislation as the agency derives its power from there.\n\nGensler’s belief that the SEC can determine which digital assets are securities is seen in his behavior as he has taken enforcement actions against several crypto firms in the past few months.\n\nAt the hearing, the SEC chair noted that although Congress could act to provide clearer legislation for the crypto sector, the agency did not need additional authorities to determine which assets were securities or not. He insisted that the SEC is in charge of defining securities and not legislation.\n\nIn contrast, Garlinghouse believes crypto should be regulated by legislation and not from the SEC’s perspective.\n\n“For the Chair of the SEC to assert that he dictates what is a security – and not the legislation from which his agency derives its power – is beyond comprehension. It’s time for elected officials in the U.S. to take notice,” the Ripple boss stated.\n\nAn “Autocrat” Running a Bloated Agency\n\nGarlinghouse further accused Gensler of behaving like an autocrat. The Ripple CEO insisted that the SEC chairman felt he did not need regulatory clarity because he ran a bloated agency.\n\n“When you behave like an autocrat running a $2.2B bloated agency, why would you ever want to provide clarity about what’s “in or out”? Without clear jurisdiction, ambiguity masquerades as power,” Garlinghouse said.\n\nMeanwhile, the SEC and Ripple have been in a two-year-long legal battle over securities law violations. The agency sued Ripple in 2020 for offering unregistered securities by selling XRP tokens. The court is expected to give its verdict on the case before the end of the year."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vcmlwcGxlLmNvbS9pbnNpZ2h0cy9kcml2aW5nLWJvbGQtaW5ub3ZhdGlvbi1pbi1hcGFjLWZpb25hLW11cnJheS1saXZlcy1pdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Driving Bold Innovation in APAC: Fiona Murray Lives It - Ripple",
        "content": "Fiona Murray’s five year journey at Ripple has truly been something to behold. She began her career at the Ripple London office as a Sales Director building new customer relationships across Europe. As Ripple continued to expand and opened up an office in Singapore, a position as Head of Sales for APAC became available.\n\nWith the reputation she’d developed as an expert in her field, Fiona made the bold choice to pursue the position and was soon packing her bags to move across the world with her family.\n\n“Ripple was super supportive of my ambition. They saw that energy, that excitement and that focus from me, and decided to give me the opportunity to prove it.”\n\nThe crypto industry moves fast, and Fiona hit the ground running once she settled into life in Singapore. While she and her team are excited to be on the cutting edge of innovative new technologies in the APAC region, selling crypto solutions to traditional finance professionals can be somewhat uncharted territory.\n\nFortunately, the team tackled the challenge straight on with direction from Fiona to embrace Ripple’s “Say It” value through an abundance of transparency and constructive feedback. As a global company with customers from a variety of backgrounds, Ripple prioritizes creating a company culture reflective of those diverse communities.\n\nThat’s why Fiona stresses the importance of open communication to her teammates; welcoming diverse perspectives and out-of-the-box ideas is vital to developing the right messaging to potential customers.\n\n“At Ripple, what is the best feeling is that we’re changing the way that people operate and interact with value, and it’s a really bold mission.”\n\nBut Fiona isn’t just helping pioneer the future of finance, she’s also paving the way for other women to lead in male-dominated industries.\n\nWhile Ripple has made it a priority to support career growth and development for all employees, there is still work to be done across the globe. A LinkedIn study found that one in three women in APAC consider gender a barrier to opportunity. Compounding this, almost half of the women surveyed said they struggle to find a balance between work and family.\n\nFiona shared similar concerns when she went on parental leave after her son was born. But through preparation of her own and trust in her team, Fiona was able to enjoy her time with her family without any added stress itching at the corners of her mind.\n\n“In Sales, your pay is commission-based so it can feel frightening if you’re taking yourself out of your territory for a while. Ripple takes a lot of that concern away.”\n\nFiona has since been promoted to VP of APAC Sales and continues to drive bold innovation across the region.\n\nLearn more about building real-world value with teams across the globe."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS1jZW8tc2F5cy1zZWMtY2hhaXItZ2Vuc2xlci1iZWhhdmVzLWxpa2UtYW4tYXV0b2NyYXQv0gFaaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvcmlwcGxlLWNlby1zYXlzLXNlYy1jaGFpci1nZW5zbGVyLWJlaGF2ZXMtbGlrZS1hbi1hdXRvY3JhdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Ripple CEO says SEC Chair Gensler Behaves Like an ‘Autocrat’ - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nIn the midst of the ongoing legal dispute over the XRP token’s nature, brad garlinghouse brad garlinghouse Brad Garlinghouse is one of the world’s largest crypto payments processors; he is an extremely popular name across the global crypto landscape. He has previously served as the CEO of Hightail, a file-sharing service, and is also an active angel investor. He is currently serving as the CEO of financial technology company Ripple Labs. He joined Ripple as COO in April 2015, answering to the CEO and prime supporter, Chris Larsen. He was elevated to CEO in December 2016. Previously, he also worked at AOL and Yahoo! From 2003 to 2008, he filled in as Senior Vice President at Yahoo!, where he ran its Homepage, Flickr, Yahoo! Mail, and Yahoo! Courier divisions. While at Yahoo!, he wrote an inner update known as the \"Peanut Butter Manifesto,\" requiring the organization to zero in on its core business instead of extending itself excessively far, much like peanut butter. EntrepreneurInvestorChief Executive OfficerBoard Member , CEO of Ripple, launched a new attack on the U.S. Securities and Exchange Commission (SEC). gary gensler gary gensler Gary Gensler is an enthusiastic leader and the current chair of the U.S. Securities and Exchange Commission (SEC). He has the extreme experience that spans wall street, government regulation, and an angel teaching about cryptocurrencies and blockchain at MIT. He announced several initiatives to enhance investor protections in the $2 trillion cryptocurrency market. He previously led the Biden-Harris transition’s federal reserve, Banking, and securities regulation agency review team. He was awarded Treasury's highest honor, the Alexander Hamilton Award, and also was a recipient of the 2014 Frankel Fiduciary Prize. He was born on October 18, 1957, into a Jewish family, in Baltimore, Maryland. Graduated from the University of Pennsylvania, earning a Master's degree in Business Administration. Additionally, he is also a professor at the MIT Sloan School of management. He has served in various governmental roles since the 1990s, such as the treasury department, Sarbanes-Oxley, CFTC, Swaps, Enforcement, Libor investigation, Maryland Financial Consumer Protection Commission, Securities, and Exchange Commission. Gary Gensler will probably keep on filling in as seat of the SEC until 2026, accepting his renunciation. He has expressed his desires to present crypto-related approach changes later on that include token commitments, decentralized finance, stablecoins, guardianship, exchange-traded resources, and advancing stages. A few officials as well as his kindred SEC magistrates have scrutinized Gensler for not giving adequate administrative direction on crypto, possibly prompting a standoff between Congress and the association. The SEC, CFTC, and Financial Crimes Enforcement Network handle advanced resource guidelines in the U.S., however, each with various jurisdictional cases, bringing about an interwoven methodology that crypto firms should explore to work legitimately. Whether 2022 will see a more clear way for organizations in the crypto space is questionable, yet the cosmetics of the SEC's initiative will fundamentally change following the takeoff of chief Elad Roisman in the first month of the year. Chief Allison Lee's term is likewise set to terminate in June 2022. Chairman , the head of the Securities and Exchange Commission, told the House Appropriations Committee that the market for cryptocurrencies can be adequately regulated by the existing securities laws.\n\nGarlinghouse Slams SEC\n\nRipple (XRP) CEO Brad Garlinghouse said US Securities and Exchange Commission (SEC) Chair Gary Gensler acts like an “autocrat,” urging elected officials to take notice of the regulator. Garlinghouse responded to a news story in which Gensler claimed that the industry is already covered by current regulations, so no new legislation is required.\n\nTo which Garlinghouse responded, “For the Chair of the SEC to assert that he dictates what is a security – and not the legislation from which his agency derives its power – is beyond comprehension. It’s time for elected officials in the US to take notice.”\n\nAs long as the SEC head acts like an autocrat in charge of a $2.2 billion bloated agency, the authority will never want to be clear about which crypto assets are “in” or “out.” Garlinghouse emphasized that ambiguity can pass for authority in the absence of clear jurisdiction.\n\nAlso Read: David Gokhshtein Predicts XRP Price Surge if Ripple Prevails in SEC Case\n\nGarlinghouse’s Opinions Echo Those of Crypto Stakeholders\n\nThe crypto community has long expressed its concerns about the SEC’s approach to Crypto. The commission recently increased its regulatory efforts against the cryptocurrency industry.\n\nJustin Sun, a cryptocurrency entrepreneur, and his businesses are the targets of a new lawsuit from the Commission. Moreover, for failing to register as a national securities exchange, the financial authority also brought charges against the cryptocurrency platform Beaxy.\n\nThe legal battle between SEC and Ripple is nearing its end with several crypto attorneys predicting a win for the crypto firm. However, it seems like the SEC is not budging on its regulatory approach.\n\n[pollquestion postid=’188837′]"
    }
]