[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8xMC8xNi90aGUtcmlwcGxlLWVmZmVjdHMtb2YtYS1zcG90LW1hcmtldC1iaXRjb2luLWV0Zi_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMTAvMTYvdGhlLXJpcHBsZS1lZmZlY3RzLW9mLWEtc3BvdC1tYXJrZXQtYml0Y29pbi1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Oct 2023 07:00:00 GMT",
        "title": "The Ripple Effects of a Spot Market Bitcoin ETF - CoinDesk",
        "content": "Considering it appears BlackRock’s bitcoin ETF would be backed by actual bitcoin, and would therefore require the asset manager to purchase as much bitcoin as the ETFs it sells, it’s quite clear it will boost the price of the cryptocurrency. On its face, however, institutional interest in bitcoin and crypto isn’t new. After the Winklevoss twins — yes, those Winklevoss twins — filed the first bitcoin ETF in 2013, several major financial institutions like UBS, Citi, Barclays and more showed interest in crypto and blockchain. And all this was before the 2017 bull run."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzEwLzE2L3JpcHBsZS1jdG8teHJwbC10by1iZWNvbWUtZmF2b3JlZC1wbGF0Zm9ybS1mb3ItdG9rZW5pemVkLXJlYWwtd29ybGQtYXNzZXRzLXdpdGhpbi0xOC1tb250aHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Oct 2023 07:00:00 GMT",
        "title": "Ripple CTO: XRPL to Become Favored Platform for Tokenized Real-World Assets Within 18 Months - The Crypto Basic",
        "content": "The Ripple Chief Technology Officer, David Schwartz, has expressed optimism about the XRP Ledger’s potential in real-world asset tokenization projects.\n\nDuring an interview following Schwartz’s presentation at the Apex 2023 developer summit, the Ripple CTO highlighted several key factors that make the XRPL an attractive platform for real-world asset tokenization.\n\nSchwartz noted that XRPL’s low transaction fees and seamless integration with decentralized exchanges make it ideal for launching tokenized real-world assets.\n\n- Advertisement -\n\nIn parallel, he pointed out the importance of accessibility and flexibility when dealing with tokenized assets. Schwartz stated that users want to conveniently buy, sell, hold, and transfer assets without being tied to a specific currency.\n\n“If you tokenize some sort of debt, you don’t want to tie it to US dollars because that limits access to it to people closed to US Dollars,” Schwartz remarked.\n\nIn this context, Schwartz argued that XRPL provides proximity to a wide range of assets, allowing for easy exchange. He added that this easy access and broad applicability is one of the crucial benefits of the XRPL.\n\nTokenization on XRPL To Start within 18 Months\n\nFurthermore, Schwartz predicted that the XRPL would be a favored platform for launching tokenized assets within the next 18 months. The short nature of the timeline, which the Ripple CTO hinted at, sparked enthusiasm among the XRP Army.\n\n- Advertisement -\n\nXRP influencer Amelie took to the X platform to share a snippet of the interview, adding, “The future is for XRP.”\n\nWOW! Check out this video where @JoelKatz says: „Tokenization on XRP-Ledger shall start in year and half in real world!“ THE FUTURE IS FOR #XRP ? pic.twitter.com/qNqFKFY7Oc — ?????? ? (@_Crypto_Barbie) October 15, 2023\n\nMeanwhile, in the interview, Schwartz highlighted the expanding role of tokenization and its impact on reshaping the world of finance. He first noted that people are beginning to recognize the inefficiencies in transferring certain value types.\n\nThe Ripple CTO stressed that tokenization will democratize access to various financial products. According to him, it will particularly favor individuals in countries with limited traditional financial services.\n\nEmphatically, Schwartz believes tokenized assets will offer broader access to quality investment products, including collateralized loans and other financial services."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9yaXBwbGUtdnMtc2VjLWxhd3N1aXQtdXBkYXRlLW9jdG9iZXItMTZ0aC_SAUdodHRwczovL2NyeXB0b3BvdGF0by5jb20vcmlwcGxlLXZzLXNlYy1sYXdzdWl0LXVwZGF0ZS1vY3RvYmVyLTE2dGgvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Oct 2023 07:00:00 GMT",
        "title": "Ripple vs. SEC Lawsuit Update October 16th - CryptoPotato",
        "content": "TL;DR\n\n\n\nRipple faced a lawsuit from the SEC over unregistered XRP sales for nearly four years.\n\nAfter two recent court victories for Ripple, XRP’s price saw a significant boost.\n\nSome analysts predict the SEC might either settle with Ripple or drop all charges.\n\nThe Final Stage of the Battle is Yet to Come\n\nThe lengthy lawsuit between Ripple and the US Securities and Exchange Commission (SEC) has been going on for nearly four years, but it remains a trending topic in the cryptocurrency space. It all started in December 2020 when the regulator sued the blockchain enterprise, alleging it of selling billions of its native token XRP without first registering it as a security.\n\nBoth entities presented their thesis in court over the following years and fired shots at each other. The peak of the battle came in July this year when federal Judge Analisa Torres ruled that Ripple’s XRP sales did not constitute an offer of investment contracts.\n\nThe SEC was unpleased and formally appealed the decision at the beginning of September. However, Judge Torres dismissed the watchdog’s intention earlier this month, granting Ripple a second victory in a row.\n\nThe positive news (for the crypto firm) propelled a significant price increase for XRP and infused overall excitement in the entire digital asset industry. The asset’s valuation spiked above $0.85 in July but failed to keep the momentum and retraced to approximately $0.50 in the following months.\n\nWhile Ripple might seem to have the upper hand in the legal battle, the war is far from over. The final act of the dispute is scheduled for April 23, 2024. It is worth mentioning that Ripple’s management team was recently shaken as its CFO – Kristina Campbell – resigned to join a healthcare company.\n\nIs the SEC Doomed to Lose?\n\nRipple’s court wins have given analysts to predict that a decisive victory is just around the corner. The prominent US attorney Jeremy Hogan recently estimated that the SEC faces a dead end in the lawsuit and would most likely seek to reach a settlement with the crypto company and the individual defendants.\n\nHe assumed there was a 19% probability that the agency would shake hands on a mutual agreement at the end of December 2023.\n\nOthers like Yassin Mobarak – founder of the private equity firm focused on startups in the tech sector Dizer Capital – think the SEC might withdraw all charges against Ripple and its CEO Brad Garlinghouse since it is not in its interest to have a trial where “their corruption can be exposed.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8va2VpYS5vcmcvdGhlLXBlbmluc3VsYS9jaGluYXMtcmVhbC1lc3RhdGUtcmlwcGxlLWVmZmVjdC1rb3JlYXMtYnJhY2UtZm9yLWltcGFjdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Oct 2023 07:00:00 GMT",
        "title": "China's Real Estate Ripple Effect and Korea's Brace for Impact - Korea Economic Institute",
        "content": "China's Real Estate Ripple Effect and Korea's Brace for Impact\n\nThe world is turning its attention to China’s economy and Korea is taking note. The South Korean Ministry of Finance put together an all-government task force to respond to the potential negative effects of the downfall of China’s largest property developer, Evergrande, which recently cancelled the restructuring of more than $19 billion of debt affecting its international bonds. Accompanied by a worrying swath of trade data concerning the Middle Kingdom, it points to uncertainty about China’s financial state and the possibility of a contagion risk from China’s real estate sector, which constitutes up to 25 to 30 percent of its GDP.\n\nBut would it go so far as to affect markets in South Korea? Analysts note that a spillover effect in the event of a crisis is limited. So far, the effects of the Evergrande crisis on Korea remain mostly psychological and would be contained to fluctuations in confidence on the KOSPI index. Korea’s Finance Minister Choo Kyung-ho stated publicly that he expects “no direct impact” on Korea’s economy from the crisis. Evergrande’s debt is denominated in Chinese renminbi, and it is not tied to mortgage-backed securities derivatives the way U.S. mortgages were before the United States’ own 2008 meltdown. The biggest issues so far would be for Korea-China trade as well as the overseas holders of Evergrande bonds and other holders of Evergrande’s $22.7 billion in offshore debt.\n\nKorea’s finance ministry indicated that Korean banks’ exposure to the Chinese real estate crisis is roughly $297 million. A Chinese economic catastrophe would do more harm to the trade relationship. South Korean exports to China are down. China accounts for roughly 23 percent of Korean exports and a reduced appetite from weakened Chinese consumers would hamper the already diminishing trade between the two countries. Korea had until recently benefited from a large trade surplus of trading goods to China, which has in the past year presented as a deficit due in part to a decline in the export of intermediate goods. Sectors where Korea usually benefits from Chinese demand are seeing the effects of this downturn. Memory chip exports to China are falling, as are electronics as a whole. This is mirrored by Taiwan also experiencing the effects of a down Chinese market.\n\nOther sectors are equally gloomy. China has stopped publishing youth unemployment data. In August, real estate sales were down 34 percent year-over-year. But the pièce de résistance remains Evergrande, which defaulted on its debt in 2021 and lost 79 percent of its market value on August 28 after it began trading shares again after an 18 month pause. Kasia, Fantasia, and Shimao Group were other real estate companies in China which defaulted on their debt, and on October 10, developer Country Garden announced it is expecting to miss upcoming payments on overseas debt. All come after crackdowns by China’s government on excessive borrowing.\n\nExcessive borrowing was targeted by the government to rein in the highly indebted real estate sector. China’s “three red lines” policy sought to limit it by placing standards on excess liabilities, net debt, and cash reserves. Local government financing vehicles (LGFVs), which hold debt levels at 42 percent of GDP, filled the role that private property developers had in land auction markets and accordingly were able to shirk the debt limits set in place by the three red lines. Across China, local governments additionally relied on land-sale revenues to finance infrastructure projects and fund their budgets. The tie-in that real estate has with China’s public debt accordingly has risks for local governments in the event of a crisis.\n\nPrior to curbs on debt, developers rushed to cash in on the waves caused by the appetite for real estate. The trend of housing investments replacing the role of traditional financial products went so far as to lead Xi Jinping to declare at the 19th Party Congress that “houses are for living in, not for speculation”, a phrase which has since been removed from the wording in Politburo policy readouts on the property sector.\n\nSome worry of a “Japanification” of China as a result of declining property values and poor economic outlook. Dr. Zoe Liu and Daniel Stemp point out that the ratio between real estate and mortgage loans that constitute Chinese households’ total assets mirror what they were in the United States before its own property crash, or in Japan before the 1980s financial crisis. Chinese household debt as a proportion of disposable income is equally hitting pre-recession U.S. levels at 110 percent. The real estate industry and its associated activities constituting nearly as high as percent of China’s GDP as it did in the United States creates substantial exposure for the Chinese economy in the event of a 2008 level collapse. Economist Kenneth Rogoff goes so far as to argue that China’s property crisis may be part of a broader “debt supercycle” which has been spreading among low and lower-middle income countries since 2008.\n\nA real estate collapse in China may provide validation for the views of “de-couplers” who push for an exit from the Chinese economy. Nonetheless, some are still bullish. There are still investors who will continue to bet on China’s low cost of manufacturing and advantages from a weakening American dollar. And as it stands so far, it appears unlikely that difficulties in China’s real estate sector would drastically affect Korea’s economy.\n\nThe Korean government is right to closely watch the situation unfold. In whatever way it plays out, it will have a ripple effect, if even psychological, for the broader global economy. Even though the Chinese Communist Party may have more levers to pull to stabilize the economy than the United States did in its own financial crisis, it will still have to grapple with restoring the confidence of its investors to return to any form of steady state. Whatever the outcome of the crisis may be, one thing is for certain. The world is watching China for whatever happens next.\n\nTom Ramage is an Economic Policy Analyst at the Korea Economic Institute of America. The views expressed here are the author’s alone.\n\nPhoto from Wikimedia Commons"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vYmV0YWtpdC5jb20vcmlwcGxlLXZlbnR1cmVzLXBsYW50cy1mbGFnLWluLXZhbmNvdXZlci1hcy1maXJtLWVudmlzaW9ucy1jb2FzdC10by1jb2FzdC1mdW5kLWlpaS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Oct 2023 07:00:00 GMT",
        "title": "Ripple Ventures plants flag in Vancouver as firm envisions “coast-to-coast” Fund III - BetaKit - Canadian Startup News",
        "content": "With Fund III backed by RBCx and VCCI, Ripple Ventures plans to hold final close by year's end.\n\nToronto-based early-stage venture firm Ripple Ventures is setting up shop in Vancouver as it eyes the final close of its third venture fund later this year.\n\nDominic Lau, who was promoted from principal to partner at Ripple Ventures last year, will become the firm’s first team member based in Vancouver. Moving from Toronto, Lau will take up a private office in November at Pavilion Cowork in the Mount Pleasant neighbourhood. Lau said the firm may hire additional team members in Vancouver.\n\n“You invest predominantly where you’re located because that’s where you have roots. What we want to do is build that out in Vancouver.”\n\nThe move out west is a strategic one for Ripple Ventures, and comes as the firm is raising its third venture fund, which recently received a $7.5-million investment from the federal government’s renewed Venture Capital Catalyst Initiative (VCCI). Lau said Ripple Ventures is looking to take a more coast-to-coast approach with Fund III, which presumably starts with building out a physical presence in Western Canada.\n\n“You invest predominantly where you’re located because that’s where you have roots. You have the ecosystem, you have the network,” Lau told BetaKit. “What we want to do is build that out in Vancouver.”\n\nWhile Lau remains tight-lipped about Fund III’s target size, Ripple Ventures has recently revealed a few key details about the fund, including that RBCx will be its lead anchor limited partner (LP). In a recent interview with BetaKit, Lau discussed the recent VCCI injection, his plans for Vancouver, and his coast-to-coast vision for Fund III.\n\nSince its founding in 2018 by managing partner Matt Cohen, Ripple Ventures has had a predominantly Eastern Canadian focus, and while it has made a handful of investments in the United States, Lau noted the firm’s focus has mostly been on East Coast cities like New York or Boston. That’s not to say Ripple Ventures has ignored the West Coast—the firm has made investments in companies like Zenhub, and more recently, Artemis and Asepha, but the heavy East Coast presence is something Lau is looking to change with Fund III.\n\nSince 2021, Lau has split more of his time between Toronto and Vancouver. By running various events in Vancouver with organizations like AWS Startups, Boast AI, and BC Jobs, he said Ripple Ventures was looking to validate the local founder network and assess the demand for a more inclusive and active startup community.\n\n“What we wanted to prove out was that: one, there are companies that fit our thesis out on the west coast; two, there’s a big enough founder community; and three, that there are high-quality co-investors and companies that we could work with on the west coast,” Lau said.\n\nIn terms of what Ripple Ventures’ presence in Vancouver will mean for local stakeholders, Lau plans to host a series of events in the city, including weekly founder and investor co-working sessions, networking events, educational workshops for angel investors and family offices, and a weekly tech basketball run.\n\nRELATED: SAAS NORTH producer reveals new Vancouver-based INNOVATEwest tech conference\n\nLau added that the new events don’t signify a huge change of pace for the team, thanks to Ripple’s activity in Toronto. “We have event-running down to a science now,” he added.\n\nProximity to the Bay Area is another strategic reason behind the firm’s West Coast expansion, according to Lau. “We’re able to work with a lot of the other co-investors much deeper, as well as get more exposure to the West Coast deals on that front, and all the corporates that are located in San Francisco that [could be] eventual partners, acquirers, and investors into our portfolio companies,” he said.\n\nAiding Ripple Ventures’ push to a final close of Fund III is a $7.5-million injection from VCCI’s Inclusive Growth stream. Ripple Ventures was among five Canadian venture firms named to receive a collective $25 million from the federal program last week. Lau noted that Ripple’s West Coast expansion was not a requirement for Ripple’s funding eligibility for VCCI and was, rather, a strategic decision on the firm’s part.\n\n“The big gap, especially in Canada, is for that earliest-stage, pre-seed, or angel-stage company.”\n\nLau said the VCCI Inclusive Growth funding will be key in supporting two of Ripple Ventures’ existing initiatives, which Lau described as “core pillars” earmarked under Fund III: the RippleX Fellowship Program, a 12-week, remote program Lau founded that teaches underrepresented students about startup-building and investing fundamentals; and the Fellow Fund, which invests up to $75,000 into student founders and first-time founders.\n\n“I wanted to create a program that was very educational and network- and opportunity-focused, and not just leveraging students as deal sourcing analysts,” Lau said. “We’re focused on empowering founders and aspiring VCs to learn the true tangible skills to get equal access to funding and job opportunities.”\n\nAccording to Ripple Ventures, after 15 cohorts over the last five years, RippleX has helped over 75 underrepresented students access VC employment opportunities and founders raise a combined $60 million in VC funding. Over 2,000 students across 30 countries have enrolled in the program, four of whom have been directly recruited to the Ripple Ventures team.\n\n“[It’s a] very tangible impact that we’ve had from dollars raised, job opportunities created, and also just creating more democratized access to education in this very opaque industry,” he added.\n\nRELATED: Movement51 launches investment readiness education program for women entrepreneurs across Canada\n\nAccording to Ripple Ventures, its Fellow Fund is “poised to back more than 20 companies led by underrepresented founding teams” through Fund III. The firm said the VCCI funding will help broaden the reach of its online course “to every university and college campus across the nation.”\n\nOne of the key supporters of RippleX has been RBCx, the tech investment arm of the Royal Bank of Canada, which Lau said is also Fund III’s lead anchor LP. Lau said the federal government, through VCCI, is Fund III’s second anchor LP.\n\nRipple Ventures has already begun deploying from Fund III. According to Lau, the fund is currently invested in eight startups: Centro Commerce, DataFacade, Sabba Health, Artemis, WaiveTheWait, Scalestack, Asepha, and NetNow.\n\nBeyond Fund III’s coast-to-coast lens, Lau said the investment thesis for Fund III will focus on early-stage companies (including pre-revenue and even pre-product companies) operating in B2B SaaS, developer software, climate software and artificial intelligence (Ripple was the first investor in AI startup VoiceFlow, which recently raised $15 million USD).\n\nWhile the geographical focus of Ripple Ventures may be changing, Lau said Ripple Ventures is still fundamentally committed to bridging the funding gap for early-stage startups from ideation all the way to signing a first customer.\n\n“The big gap, especially in Canada, is for that earliest-stage, pre-seed, or angel-stage company, because investors are too risk-averse to be able to take that on,” Lau said. “What we want to do is fill that gap.”"
    }
]