[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdS50b2RheS94cnAtY2FudC1iZS1jb25maXNjYXRlZC1ieS1nb3Zlcm5tZW50LXNheXMtZXgtcmlwcGxlLWRpcmVjdG9yLWhlcmUtYXJlLTMtcmVhc29ucy13aHnSAWhodHRwczovL3UudG9kYXkveHJwLWNhbnQtYmUtY29uZmlzY2F0ZWQtYnktZ292ZXJubWVudC1zYXlzLWV4LXJpcHBsZS1kaXJlY3Rvci1oZXJlLWFyZS0zLXJlYXNvbnMtd2h5P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Jan 2023 09:12:07 GMT",
        "title": "XRP Can't Be Confiscated by Government, Says Ex-Ripple Director, Here Are 3 Reasons Why - U.Today",
        "content": "Ripple's former director of developer relations, Matt Hamilton, once again addressed the XRP community, clarifying rumors of a possible government buyback of the token from the market. Like last time, he stated that such a course of action would not be possible, the main reason being that the value of digital assets is ascribed by their users.\n\nAdvertisement\n\nThere is a small, but very vocal minority of the XRP Community that is promoting a crazy idea of the US government buying back / confiscating XRP from US citizens, yet for some strange reason compensating them 100's of 1000's of % above market rate. — Matt Hamilton (@HammerToe) January 12, 2023\n\n\"XRP and Bitcoin have no intrinsic value; their value is determined by a set of transactional rules devised by a decentralized group of people,\" the developer argued.\n\nWhat XRP confiscation?\n\nAs well as refuting yet another round of nonsense about XRP being bought back by the government, Hamilton also broke down talk of possible confiscation. This speculation has emerged as an extension of the original conspiracy theory. As a reminder, there are rumors that XRP is to be confiscated from the market by the same government for its own use and so that the technology is not spread anywhere else.\n\nAccording to Hamilton, confiscation of XRP is impossible for at least three reasons. First, the developer notes, XRP is a decentralized cryptocurrency and cannot be seized without forcing key holders. Second, it is easier for the government to create its own digital token if it need it for its own use. Finally, if the U.S. government restricts everyone from using XRP, it would kill any use of the token and it would simply be replaced by a fork."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3JpcHBsZS1jdG8tY2FsbGVkLW91dC1mb3ItbWFya2V0LW1hbmlwdWxhdGlvbi1vZi1mbHItdG9rZW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Jan 2023 08:00:00 GMT",
        "title": "Ripple CTO called out by Twitter for market manipulation of FLR token - CryptoSlate",
        "content": "Ripple CTO David Schwartz has been criticized for alleged market manipulation of Flare (FLR) tokens with his recent comments on the FLR token airdrop.\n\nThe current Flare holding rules for subsequent airdrops leave absolutely no incentive not to sell your Flare now. You lose *nothing* if you sell now. 1/3 — David \"JoelKatz\" Schwartz (@JoelKatz) January 12, 2023\n\nThe Ripple CTO recently spoke in favor of selling FLR from the Flare project citing the token has no value.\n\nSchwartz highlighted Flare’s recent airdrop and targeted the Flare team claiming they had not kept to their commitment and gave 15% of what they promised. Furthermore, the CTO claimed that Flare leveraged the XRP community to grow but undermined its promises.\n\nA few hours after his comments, FLR tanked by 10% to $0.04367.\n\nDespite some Twitter users supporting his views, some accused him of manipulating the community to sell FLR and, one hour later, claiming to have bought a “bunch.”\n\nDid you get a little buy-in liquidity by posting this thread to your 500K XRP community followers? \"You lose *nothing* if you sell now.\"\n\n1 hour later\n\n\"I just bought a bunch.\"\n\n🤔 — Flare Oracle (@flareoracle_io) January 12, 2023\n\nAfter all that, why did you then buy flare? that’s some crazy double speak you have going on there, telling everyone why it’s good to sell, only then to finish by saying you bought flare. Genuine question — crypto skater 🛹 (@crusader_alt) January 12, 2023\n\nWorth noting that Flare Network intends to introduce smart contract capabilities to multiple blockchains, starting with XRP and Litecoin (LTC).\n\nOn January 9, 4.279 billion FLR tokens were distributed to XRP holders based on a snapshot of the XRP Ledger (XRPL) taken in late 2020. With the airdropped token starting to trade on exchanges like Binance, OKX, and Kraken, prices rocketed above $0.076.\n\nHowever, FLR dropped by 87% shortly after token distribution started on January 9. Despite this, the token has rebounded somewhat after the comments of the Ripple CEO, trading at $0.04451 as of press time.\n\nMentioned in this article"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vc29jY2VybmV0Lm5nLzIwMjMvMDEvaXMtcmlwcGxlLWEtZ29vZC1pbnZlc3RtZW50LWFuZC1zaG91bGQtaS1pbnZlc3QtaW4teHJwLmh0bWzSAVxodHRwczovL3NvY2Nlcm5ldC5uZy8yMDIzLzAxL2lzLXJpcHBsZS1hLWdvb2QtaW52ZXN0bWVudC1hbmQtc2hvdWxkLWktaW52ZXN0LWluLXhycC5odG1sL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Jan 2023 15:20:35 GMT",
        "title": "Is Ripple a Good Investment and Should I Invest in XRP? - Soccernet.ng",
        "content": "The cryptocurrency market is cyclic – it depends on many factors such as news background, investor sentiment, global economy, etc., and the main factor that affects it is the supply-demand ratio. When demand drops and investors start to leave the market, prices fall, and vice versa. 2022 was the year of the crypto drop, starting in the spring of 2022 and lasting till now. Many people say crypto is dead, while smart investors are looking for promising assets to invest in the long term. Buying digital assets at the market drop is smart because small investments will multiply and bring a fortune on the next bull trend. In this article, we would like to discuss maybe one of the most discussed assets – Ripple.\n\nWhat is Ripple?\n\nThe Ripple Labs company started its existence long before we first heard about crypto. The project was initially aimed at providing fast and affordable cross-border payments, which would solve all the problems of the current SWIFT system used in banks:\n\nexpensive money conversion;\n\nlong transaction proceeding;\n\nmany intermediaries and bureaucracy.\n\nRipple used the XRP token for speedy money conversion to crypto, delivering it to any point on the globe in a couple of seconds.\n\nOver 100 financial corporations use the Ripple technology, and the project has good future prospects for development.\n\nThe Ripple XRP price now is $0.34. Its all-time high was fixed at $3 in January 2018.\n\nInvesting in Ripple: Yes or No?\n\nMany wonder why the Ripple price XRP is so low. All the matter is in the lawsuit imposed on the company by the SEC. The commission demands Ripple recognise their token as a security. The court case has been lasting for a couple of years, and the parties still cannot reach an agreement. It slows down the project’s development, and the token stays at around the same level.\n\nHowever, it is definitely worth investing in Ripple, for this project has valuable technology and many real use cases, and as soon as issues with the SEC are solved, it will grow and reach the moon.\n\nTo buy Ripple XRP, use reliable and large crypto platforms with a good reputation. Pay attention to the WhiteBIT exchange – officially the biggest crypto trading service in Europe."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmZveHdlYXRoZXIuY29tL3dlYXRoZXItbmV3cy90cmF2ZWwtZmxpZ2h0LWRlbGF5cy1hdGxhbnRhLXNldmVyZS13ZWF0aGVyLWZhYS1ncm91bmQtc3RvcNIBZ2h0dHBzOi8vd3d3LmZveHdlYXRoZXIuY29tL3dlYXRoZXItbmV3cy90cmF2ZWwtZmxpZ2h0LWRlbGF5cy1hdGxhbnRhLXNldmVyZS13ZWF0aGVyLWZhYS1ncm91bmQtc3RvcC5hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Jan 2023 08:00:00 GMT",
        "title": "Flight delays in Atlanta because of severe weather could have ripple effect across US after FAA outage - Fox Weather",
        "content": "ATLANTA – Severe weather could delay and cancel more flights at Hartsfield-Jackson Atlanta International Airport (ATL), the world's busiest airport, on Thursday as airlines continue to recover from a crippling outage at the Federal Aviation Administration that affected more than 10,500 flights on Wednesday.\n\nAnd those delays could have a ripple effect across the country.\n\nFAA GROUND STOP, SEVERE WEATHER THREAT MAY HAVE LASTING RIPPLE EFFECT ON FLIGHTS ACROSS THE US\n\nEarly Wednesday morning, the FAA said there was an outage with the NOTAM (Notice to Air Missions) system, which is an important notice that contains essential information to personnel connected to flight operations.\n\nWhen that critical system went down, the FAA issued its first nationwide ground stop for all departing flights since the terror attacks on Sept. 11, 2001.\n\nAir travel spun into chaos Wednesday morning when the ground stop was initiated, and while the issue was resolved and the NOTAM system was back online by 9 a.m. EST, the damage already had been done.\n\nThousands of flights had been delayed, and that had a ripple effect throughout the day as more than 10,500 flights were impacted.\n\nAnd those delays will likely continue into Thursday as severe thunderstorms move through the Southeast, including the Atlanta metro.\n\nTORNADO WATCHES ISSUED AS SOUTHEAST, INCLUDING ATLANTA, FACES DANGEROUS SEVERE WEATHER THREAT THURSDAY\n\nSoutheast, including Atlanta metro, faces severe weather threat Thursday\n\nSevere weather threat Thursday, Jan. 12, 2023.\n\n(FOX Weather)\n\n\n\nInitial rounds of severe thunderstorms moved through portions of Kentucky, Mississippi and Alabama on Thursday morning. That threat has continued to slide to the east, with Severe Thunderstorm warnings and Tornado warnings also issued in portions of Georgia and Tennessee.\n\nBut according to the FOX Forecast Center, Thursday afternoon and evening will have the greatest risk of severe weather as a cold front sweeps eastward across the Southeast.\n\nCentral and eastern Alabama and central and northern Georgia, including the Atlanta metro area, will face the highest threat of severe thunderstorms. However, the risk of severe weather will also extend into other portions of the Southeast and Tennessee Valley.\n\nSeveral damaging wind gusts are likely, though large hail and a few tornadoes are also possible.\n\nFlight delays could have ripple effect across the US\n\nWhile the severe weather threat is contained to the Southeast, any delays that pop up in Atlanta will likely have a ripple effect across the country.\n\nSo, if you're waiting for a flight at New York's John F. Kennedy International Airport (JFK) and the skies are clear, there's still a chance the FAA could issue a ground stop for severe weather.\n\nHOW THUNDERSTORMS HUNDREDS OF MILES AWAY CAN WREAK HAVOC ON AIR TRAVEL\n\nAn FAA spokesperson said these types of disturbances in air travel are typical, but with the combination of other factors such as a shortage of airline crews, for example, what once was just a normal weather delay can turn into a domino effect, keeping passengers stuck at airports for hours.\n\nBecause of the nation's geography, major cities such as Boston, New York and Miami can have a beautiful sunny day, yet storms hundreds of miles away, like in Atlanta, can block air routes, keeping planes trapped as if they were on an island.\n\nAir travel statistics from FlightAware.com.\n\n(FOX Weather)\n\n\n\n\"We do not put planes through thunderstorms for safety reasons,\" said Ian Gregor, an FAA public affairs specialist. \"The planes have to either fly around them or wait for the weather to clear.\"\n\nWhen an airplane is delayed from taking off, it will have a ripple effect on other flights planned for that same aircraft.\n\nSo if a flight was going from Atlanta to New York and then from New York to Los Angeles, the flight from New York to Los Angeles would also likely be delayed due to the weather situation in Atlanta."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vaW5kaWFuYXBvbGlzcmVjb3JkZXIuY29tL2Zyb20tYnJvYWQtcmlwcGxlLXRvLWJyb2Fkd2F5LWluZGlhbmFwb2xpcy1ob21lZ3Jvd24tc3Rhci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Jan 2023 08:00:00 GMT",
        "title": "From Broad Ripple to Broadway: Indianapolis' homegrown star - Indianapolis Recorder",
        "content": "When Charles Browning was a kid growing up in Broad Ripple, he dreamed of someday making it big. Today that dream has come true.\n\nCharles Browning grew up in Indianapolis and now stars alongside Samuel L. Jackson in the Broadway revival of August Wilson’s “The Piano Lesson.” (Photo provided by Charles Browning)\n\nBorn and raised in Indianapolis, Browning attended Broad Ripple Magnet High School for the Arts & Humanities and was heavily involved in local theater at Clowes Memorial Hall and Indiana Repertory Theatre. As a child actor, Browning acted in plays such as “A Christmas Carol” and “Upon This Rock,” recorded voiceover material for McDonald’s and Indiana Black Expo and even filmed commercials for CVS affiliates.\n\nIt took a few years, a winding road of schooling, training and countless auditions, but Browning now graces the stage of the Ethel Barrymore Theatre on Broadway as Avery in the revival of August Wilson’s “The Piano Lesson.”\n\n“Even as a young person in Indy — as a teen — I was intentional,” Browning told the Recorder during a phone interview on a rainy December evening in New York, where he was understudying a role in Wilson’s play. “It was something I wanted to do, but the pathway in which it would happen was different than what’s happening now.”\n\nHumble beginnings\n\nEarly on in his budding career, Browning split his time and energy between his studies, acting and working. During his senior year of high school, he went for a half day before heading to work at a law firm under an entertainment attorney.\n\nBradford Braxton, a retired teacher and one of Browning’s high school mentors and tutors, told the Recorder Browning was an excellent student who worked hard for everything.\n\n“He was an overachiever, and then he overachieved on top of that,” Braxton said. “He has been just very committed to being a performer ever since I’ve known him.”\n\nBrowning liked to challenge himself, Braxton said, if only to make sure he did things right — both in acting and singing, but also in his schoolwork. Though, he would often tell Braxton all about his dreams and aspirations of being a star one day, he said.\n\nBeyond Indianapolis\n\nFollowing graduation, Browning left Indianapolis to study at DePaul University in Chicago before moving on to complete his master’s at Columbia University in New York.\n\nIt took him a while to figure out where he would call home, as Browning said he returned to Chicago for a year to work at Chicago Shakespeare Theatre and Goodman Theatre. He recalled some less-than-enjoyable times working in Los Angeles, before ultimately returning to New York.\n\n“I never subscribed to the starving artist. … I was intentional about ‘where could I be the happiest with the least?’” he said. “I could have a life and pursue a career and find happiness even in the darkest moment in New York.”\n\nFirm foundations\n\nBut even as Browning began to put down roots and build his career in New York, he remained faithful to his foundations in Indianapolis and the local theater opportunities that eventually led him to Broadway.\n\n“My belief is that all of our foundations are always the root of our growth and our expansion,” he said. “[Indianapolis] gave me the seed as a young person; going to see regional theater made me understand it’s not just Broadway.”\n\nBroadway is “allegedly” the dream, he said jokingly over the phone. Though Browning said he’s always dreamed of being a sufficient actor who’s able to pay the bills, buy houses and take trips — the “diagnostic things” based on a career rather than the fanfare, glitz and glamor some fall into, he said.\n\n“The Piano Lesson”\n\nAs of Jan. 15, Browning will take over the role of Avery — a preacher focused on building his congregation and getting married — in “The Piano Lesson” full time. Directed by Latonya Richardson Jackson, the revival also stars Samuel L. Jackson, John David Washington, Danielle Brookes, Michael Potts, Ray Fisher, April Matthis, Nadia Daniel and Jurnee Swan.\n\nSet in Pittsburg in 1936, the play follows a brother and sister who disagree on what to do with an old piano they’ve inherited, Browning said. The sister, Berniece, wants to keep the piano while the brother, Boy Willie, wants to sell it to increase the value of what the family has by selling it for land, Browning said.\n\n“They’re in a conflict because it has family legacy and the piano has been through generations of slavery, indentured servants … an evolution if you will,” he said.\n\nHaving watched Browning be involved in the church, his community and local theater, Braxton said seeing him star in a show on Broadway is not only a dream come true for him but for everyone back home who supported him.\n\n“I’m excited for him to have this opportunity now,” Braxton said. “It’s been a long time coming but he already saw himself where he is now.”\n\n“The Piano Lesson” is showing now until Jan. 29 at the Ethel Barrymore Theatre in New York City.\n\nContact staff writer Chloe McGowan at 317-762-7848 or chloegm@indyrecorder.com. Follow her on Twitter @chloe_mcgowanxx."
    }
]