[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vdS50b2RheS9yaXBwbGUtdi1zZWMteHJwLWRvbWluYXRlcy1jcnlwdG8tbWFya2V0LXdpdGgtc29hcmluZy12YWx1ZS1hcy12ZXJkaWN0LWxvb21z0gFgaHR0cHM6Ly91LnRvZGF5L3JpcHBsZS12LXNlYy14cnAtZG9taW5hdGVzLWNyeXB0by1tYXJrZXQtd2l0aC1zb2FyaW5nLXZhbHVlLWFzLXZlcmRpY3QtbG9vbXM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jul 2023 07:00:00 GMT",
        "title": "Ripple v. SEC: XRP Dominates Crypto Market With Soaring Value as Verdict Looms - U.Today",
        "content": "The XRP token has asserted its dominance in the crypto market ahead of the highly anticipated ruling in the SEC v. Ripple case, reports Kaiko. According to the latest research from the smart data portal, XRP has skyrocketed to become the third most traded token, trailing only Bitcoin (BTC) and Ethereum (ETH) in terms of volume and liquidity depth.\n\nAdvertisement\n\nInvestors are now eagerly positioning themselves for the expected verdict, which has led to a surge in the trading volume of XRP, especially on Korean exchanges. The once-dismissed token has defied expectations, climbing the ranks and capturing the attention of the whole crypto community.\n\nSpeculation and anticipation have reached fever pitch as the legal battle enters a decisive phase. The protracted timeline, far beyond initial March projections, has only amplified the market's interest. With each passing day, more questions and intricate details surrounding the case emerge, fueling discussion among not only crypto enthusiasts but also legal experts closely following the proceedings.\n\nAll eyes are now firmly fixed on the impending verdict, which is expected to have far-reaching implications for both Ripple, XRP and the crypto industry as a whole.\n\nIn general, despite the legal uncertainty, Kaiko's report highlights the overall stability of global liquidity in the crypto market throughout the second quarter. Apart from the drops observed in tokens involved in the latest SEC lawsuits and a few exchange-specific declines, such as Binance US, liquidity has remained flat."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3Lm15Y2FtcGJlbGxyaXZlcm5vdy5jb20vNjg3NTUvbmV3cy9jaGlsZC1jYXJlLWNvbWluZy10by1zZXZlbi1sb2NhbC1lbGVtZW50YXJ5LXNjaG9vbHMtdGhpcy1zZXB0ZW1iZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jul 2023 07:00:00 GMT",
        "title": "Child care coming to seven local elementary schools this September - My Campbell River Now",
        "content": "When kids return to elementary schools in fall, there will be seven new childcare centres to help out working parents.\n\nSchool District 72 is spending $6 million this summer to build before-and-after-school child care centres at Ocean Grove, Ripple Rock, Cedar, Pinecrest, Sandowne, Georgia Park and Quadra Elementary schools. It’s the largest construction project in the district since Ripple Rock elementary opened in 2005, and will create 210 child care spaces.\n\n“We are thrilled to be able to provide such an important resource for our families,” says Philip Cizmic, interim superintendent for School District 72. “Access to quality childcare is crucial for working families, and we are confident that these new childcare centres will serve as a tremendous resource for years to come.”\n\nOcean Grove, Quadra, Cedar, and Ripple Rock will be built first. Not all projects will be completed by September, but the spaces will be available in temporary locations at the schools.\n\nThe centres will be staffed by educational assistants. Children must attend the school to be considered for a child care space.\n\nThe Ministry of Education and Child Care announced the funding to allow School District 72 to create these 210 new licensed childcare spaces in April of 2022.\n\n“Co-locating childcare on school grounds will make life easier for busy parents in and around Campbell River. Keeping students in one place for the entire day will also make for smooth transitions to and from school and daycare for the children,” said Michele Babchuk, MLA for North Island. “By working with our school district partners, we’re creating childcare where families have told us it’s needed, and building a future where access to affordable, quality, inclusive childcare is a core service families can depend on.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aWxsLXJpcHBsZS14cnAtb3V0cGVyZm9ybS1ldGhlcmV1bS1ldGgtaW4tdGhlLW5leHQtNS15ZWFycy1oZXJlcy13aGF0LWNoYXRncHQtc2F5cy_SAXFodHRwczovL2NyeXB0b3BvdGF0by5jb20vd2lsbC1yaXBwbGUteHJwLW91dHBlcmZvcm0tZXRoZXJldW0tZXRoLWluLXRoZS1uZXh0LTUteWVhcnMtaGVyZXMtd2hhdC1jaGF0Z3B0LXNheXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jul 2023 07:00:00 GMT",
        "title": "Will Ripple (XRP) Outperform Ethereum (ETH) in the Next 5 Years? Here’s What ChatGPT Says - CryptoPotato",
        "content": "Ripple’s XRP has been a topic of massive discussion throughout the past couple of years. It boasts one of the strongest communities, known for its passion for the company, its native cryptocurrency, and the ecosystem.\n\nEthereum, on the other hand, also has one of the largest groups of followers as it spreads across multiple purposes, use cases, and whatnot.\n\nWe decided to pin both against each other in a question to none other than the world’s most popular AI-based chatbot – ChatGPT.\n\nWe asked if Ripple’s XRP will outperform Ethereum’s ETH in the next 5 years.\n\nIt’s Not That Simple\n\nFirst things first, ChatGPT told us that we shouldn’t expect any predictions on his behalf:\n\nAs an artificial intelligence model, I don’t predict future events, including specific financial or investment outcomes. The performance of cryptocurrencies such as Ripple (XRP) and Ethereum (ETH) is influenced by a wide range of factors.\n\nThis was somewhat expected. It’s also worth noting that it seems that ChatGPT’s knowledge cutoff on this subject is in September 2021, which was quite some time ago.\n\nSo what are the factors it had in mind? They include:\n\nTechnological developments\n\nRegulatory decisions\n\nMarket demand\n\nMacroeconomic factors, and others.\n\nThere’s been a lot going on in the cryptocurrency field since September 2021. In Ethereum’s case, most notably, it was the Merge – the event that saw the network’s long-awaited transition to a Proof-of-Stake consensus algorithm.\n\nBut Wait, There’s More!\n\nIn addition to the above, ChatGPT also said that the broader context is also important when assessing the potential of both cryptocurrencies.\n\nFor example, the regulatory environment for cryptocurrencies can greatly influence their adoption and price. It’s also crucial to consider the broader macroeconomic climate, such as trends in institutional investment and the overall health of the global economy.\n\nETH has so far been the more obvious choice for institutional investors, with regular flows from various companies.\n\nIt’s worth noting, though, that there’s a major difference between both cryptocurrencies – the SEC is calling XRP a security in a flat-out lawsuit that’s been dragged on for a few years already. It’s entirely possible that this is stopping many big investors from participating, as they might be waiting to see what the outcome of the lawsuit will be.\n\nIn conclusion, ChatGPT failed to provide a precise answer but based its arguments on important considerations, some of which have yet to unfold."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2hvbmcta29uZy13YXN0ZXdhdGVyLWZ1a3VzaGltYS1zZWFmb29kLWphcGFuLTQyODM5OWQzYjg1NzdiNDBkY2Q2M2NiZDE0MzkzMDMy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jul 2023 07:00:00 GMT",
        "title": "Ripples of Fukushima: Hong Kong will ban more Japanese products if radioactive water is released - The Associated Press",
        "content": "HONG KONG (AP) — Hong Kong will immediately ban the import of aquatic products from Fukushima and other Japanese prefectures if Tokyo discharges treated radioactive wastewater into the sea, a top official in the city said Wednesday.\n\nSecretary for Environment and Ecology Tse Chin-wan said although the wastewater from the damaged Fukushima nuclear plant would be treated before discharging into the Pacific Ocean, any errors in the process would significantly affect ecology and food safety. The concern stems from Japan’s U.N.-endorsed, but controversial, plan to gradually release the treated water.\n\n“Our assessment shows prefectures near Fukushima have higher risks, so we are now taking a responsible way for our residents,” he told reporters at a briefing.\n\nThe 10 affected territories are Tokyo, Fukushima, Chiba, Tochigi, Ibaraki, Gunma, Miyagi, Niigata, Nagano and Saitama, he added.\n\nA massive earthquake and tsunami in March 2011 destroyed the Fukushima Daiichi nuclear plant’s cooling systems, causing three reactors to melt and releasing large amounts of radiation. The tanks storing the water used since the accident to cool the reactor cores will reach their capacity in early 2024.\n\nIn 2021, Japan’s government announced plans to gradually release the treated — but still slightly radioactive — water following its dilution to what it says are safe levels. Japanese officials say the water, currently stored in about a thousand tanks at the plant, needs to be removed to prevent accidental leaks in case of an earthquake and to make room for the plant’s decommissioning.\n\nLast week, the U.N. nuclear agency endorsed the plan, saying it meets international standards and the environmental and health impact would be negligible.\n\nBut the plan has faced fierce protests from local fishing communities concerned about safety and reputational damage. Neighboring countries, including South Korea, China and Pacific Island nations, have also raised safety concerns.\n\nIn Hong Kong, the import of certain products — such as fruits and vegetables — from Fukushima is currently banned. Other products such as meat and poultry from there are allowed in if they come with a radiation certificate.\n\nThe import of many food products from four other Japanese prefectures immediately south of Fukushima — Gunma, Ibaraki, Tochigi and Chiba — will also have to be accompanied with radiation certificate.\n\nFor the planned policies announced Wednesday, Tse said the government will be scientific and review data. If the situation is safe, the government will consider relaxing its restrictions, he said.\n\nEarlier, Naoto Nakahara, deputy consul general at the Japanese Consulate in Hong Kong, told Nikkei that the Hong Kong government was “trying to win brownie points from Beijing.”\n\nIn a response to the reported criticism but without identifying anyone, Tse said officials devised policies in accordance with Hong Kong’s situation.\n\n“Hong Kong has a high degree of autonomy,” he said.\n\nLast year, the major food imports from Japan amounted to about 2% of the total food supply in Hong Kong, official data showed. Although Hong Kong is not highly dependent on Japanese food products in terms of quantity, many residents love Japanese food and there are many Japanese restaurants in the city."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vbmV3c3Jvb20uY2h1cmNob2ZqZXN1c2NocmlzdC5vcmcvYXJ0aWNsZS9wcm9waGV0cy1jb3Vuc2VsLXRvLXlvdW5nLWFkdWx0cy1oYXMtcmlwcGxlLWVmZmVjdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Jul 2023 07:00:00 GMT",
        "title": "Prophet's Counsel to Young Adults Has Ripple Effect - Church Newsroom",
        "content": "Young-Adult-Counsel President Russell M. Nelson, President of The Church of Jesus Christ of Latter-day Saints, speaks during a worldwide devotional for young adults in the Conference Center in Salt Lake City on Sunday, May 15, 2022. Photo from Deseret News archives, courtesy of Church News. Copyright 2023 Deseret News Publishing Company.\n\nThis story appears here courtesy of TheChurchNews.com. It is not for use by other media.\n\nBy Rachel Sterzer Gibson, Church News\n\nOn Sunday, May 15, 2022, President Russell M. Nelson stood at the black walnut pulpit of the Conference Center in downtown Salt Lake City to address young adults of The Church of Jesus Christ of Latter-day Saints.\n\nPresident Nelson’s address was historic for several reasons. For one, it marked the first time the Conference Center was filled since the onset of the COVID-19 pandemic. For another, it was the first time the President of the Church has addressed all young adults in almost 22 years.\n\nSitting among the red upholstered seats in the Conference Center that night were the presidents and leaders of the institutions within the Church Educational System.\n\nYoung-Adult-Counsel Thousands leave the Conference Center in Salt Lake City after a Worldwide Devotional for Young Adults on Sunday, May 15, 2022. Photo from Deseret News archives, courtesy of Church News. Copyright 2023 Deseret News Publishing Company.\n\n“It was an incredible experience,” recalled BYU–Hawaii President John S.K. Kauwe III in a subsequent devotional to BYU–Hawaii students. “There was a spiritual energy and excitement that united us all in anticipation of hearing President Nelson’s message for us — and we were not disappointed,” he said.\n\nTo the 20,000 young adults gathered in the Conference Center, the thousands more clustered in overflows throughout Temple Square and the hundreds of thousands more listening online, President Nelson delivered a powerful message about identity, discipleship and taking charge of one’s eternal destiny and testimony.\n\nSince then, the Prophet’s teachings have continued to ripple and resonate through the messages of leaders in the Church Educational System.\n\n“The Lord has prepared a ‘pattern in all things’ so that we need not be deceived. Part of that pattern is the presence of a ‘prophet in the land’ to teach us truth.” —Elder Clark G. Gilbert \n\nIn speaking to Church educators last January, Elder Clark G. Gilbert, the commissioner of the Church Educational System and a General Authority Seventy, spoke of driving from Salt Lake City to Rexburg, Idaho, and listening again to President Nelson’s devotional.\n\nAs he crested the summit of the Malad Pass, Elder Gilbert pulled his car over to capture the impressions that would eventually lead to his remarks to seminary and institute instructors worldwide.\n\nIn his January 27 remarks, Elder Gilbert highlighted five prophetic themes, which he encouraged educators to utilize in their curriculum and in the way they teach and minister to students.\n\n“We live in perilous times,” Elder Gilbert told instructors. “But the Lord has prepared a ‘pattern in all things’ so that we need not be deceived. Part of that pattern is the presence of a ‘prophet in the land’ to teach us truth. Are we listening, and is it impacting how we teach and minister to our students?”\n\nIn addressing students at the beginning of a new academic year on September 6, 2022, then-BYU President Kevin J Worthen called President Nelson’s message to young adults both “powerful and profound.”\n\nAs President Worthen contemplated what he wanted to share with students “at this key decision-making point” in their lives, his mind kept going back to President Nelson’s talk. Still, it wasn’t until after he had read and studied the talk several times that President Worthen noticed the title: “Choices for Eternity.”\n\n“As I read those three words, the thought forcefully hit me that President Nelson had not only provided prophetic counsel on fundamental truths and inspired direction on individual topics of immediate relevance to young adults, he had also given an overarching sermon — some would call it a meta-narrative — on choices and decisions,” President Worthen said.\n\nPresident Nelson taught that “we get to decide — we get to choose — the most important thing in our existence: our ultimate destiny,” President Worthen said.\n\nThe BYU president invited students to read or reread President Nelson’s devotional talk. “It is inspired revelation given by a Prophet for your benefit in your current situation. Consider how the counsel he gives can help you in making the many decisions you will face in the coming year.”\n\nYoung-Adults-Counsel BYU President Kevin J Worthen addresses students during the opening devotional for fall semester in the Marriott Center in Provo, Utah, on Tuesday, September 6, 2022. Photo by Brooklynn Jarvis Kelson, courtesy of Church News. All rights reserved.\n\nDuring his address, President Nelson taught young adults that they are first and foremost a child of God. Then, as a member of His Church, they are a child of the covenant. And third, they are a disciple of Jesus Christ. He then warned that no other label or identifier should replace, displace or take priority over those three paramount, unchanging identifiers.\n\nIn a commencement address in June 2022 and again in a devotional in January of this year, President Kauwe spoke of how President Nelson’s words caused him to reflect on how he labels himself and the priority he gives to each of those labels.\n\n“I realized that my social media profile was a place where I, and perhaps many of you, have directly and indirectly specified and influenced those labels,” President Kauwe said.\n\nAfter President Nelson’s devotional, President Kauwe updated his Instagram profile to say, “Child of God, member of The Church of Jesus Christ of Latter-day Saints, husband, father, president of BYU–Hawaii, scientist, kānaka maoli, waterman.”\n\nPresident Kauwe then asked students: “If you have decided to use social media, what does it say to others about your identity? Could you revisit what it says? Could you revisit what you post to clearly and intentionally define who you are? As you do so, are your primary identities clear? Are the other identities you embrace being represented in ways that are appropriate? Think about those things and the influence they could have on your life, the way others view you and the way you view others.”\n\nYoung-Adult-Counsel BYU–Hawaii President John S.K. Kauwe III and his wife, Sister Monica Kauwe, pose for a photo prior to speaking in the opening devotional of the year in Laie, Hawaii, on January 10, 2023. Photo by Monique Saenz, courtesy of Church News. All rights reserved.\n\nBYU–Pathway Worldwide President Brian K. Ashton and his wife, Sister Melinda Ashton, also based their remarks this past January on President Nelson’s teachings about divine identity.\n\n“If understanding your true identity is so important, what can you do to come to believe that you are literally a child of God, and that being a child of the covenant and a disciple of Jesus Christ will lead to having God’s power in your life and to your obtaining eternal life?” President Ashton asked.\n\nOne answer, Sister Ashton said, is to accept the invitation of Sister Wendy W. Nelson, who also spoke at the May Worldwide Devotional for Young Adults. Sister Nelson, wife of President Nelson, encouraged young adults to ask themselves, “What would a holy young adult do [in this situation]?”\n\nIn accepting that invitation, Sister Ashton said, she found herself taking the time to listen to and be directed by the Holy Ghost. As a result, “I feel more peace and joy,” Sister Ashton said. “I also am more aware of my true identity. You can have these same blessings in your life,” she promised.\n\nYoung-Adults-Counsel Thousands of attendees are pictured during a worldwide devotional for young adults in the Conference Center in Salt Lake City on Sunday, May 15, 2022. Photo from Deseret News archives, courtesy of Church News. Copyright 2023 Deseret News Publishing Company.\n\nPresident Ashton said his testimony of his divine identity has been strengthened by studying his scriptures daily, praying each morning and night, attending church, attending the house of the Lord and keeping his covenants even during times of difficulty and trouble.\n\nIn conclusion, President and Sister Ashton shared a video of President Nelson from the May 2022 devotional.\n\n“My dear young friends,” President Nelson said. “I love you. I thank you. I believe in you. As the Lord’s Prophet, I bless you to know the truth about who you are and to treasure the truth about what your glorious potential really is. I bless you to take charge of your own testimony. And I bless you to have the desire and strength to keep your covenants.\n\n“As you do, I promise that you will experience spiritual growth, freedom from fear, and a confidence that you can scarcely imagine now. You will have the strength to have a positive influence far beyond your natural capacity. And I promise that your future will be more exhilarating than anything you can presently believe.”\n\nYoung-Adult-Counsel BYU–Pathway Worldwide President Brian J. Ashton and his wife, Sister Melinda Ashton, speak during a devotional broadcast on Tuesday, January 10, 2023. Screenshot from byupathway.org, courtesy of Church News. All rights reserved.\n\nIn a devotional also at the onset of this year, Ensign College President Bruce C. Kusch showed students and faculty pictures of what he did over the Christmas break, such as being king for a day in a Latin American country and almost scoring a winning goal in the World Cup. Then he confessed that the pictures were fake and “every identity was a fabrication.”\n\nThe most accurate, important label, he said, is “our identity as children of God.”\n\n“When [President Nelson] speaks, he speaks for the Savior, and we should listen and hearken to every word as if they have come from the Savior Himself.” —President Bruce C. Kusch, Ensign College \n\nDuring the devotional, President Kusch asked four volunteers to each answer a question about identity. Before each question, he quoted parts of the Prophet’s teachings from the Worldwide Devotional for Young Adults.\n\nThe questions he asked listeners were “How might we avoid adopting or accepting a label that could affect our eternal progression?” “How can each of us avoid being judgmental or displaying animosity toward another?” and “How can we keep the knowledge of our true identity as children of God first and foremost in our minds?”\n\nPresident Kusch concluded his remarks by testifying that all are children of God and that President Nelson is God’s Prophet on the earth today. “He holds the keys and authority necessary making it possible for him to preside on the earth in the Savior’s Church. When he speaks, he speaks for the Savior, and we should listen and hearken to every word as if they have come from the Savior Himself.”\n\nYoung-Adult-Counsel Ensign College President Bruce C. Kusch speaks Tuesday, January 10, 2023, at Ensign College’s first devotional of winter semester, in the Assembly Hall in Salt Lake City. Photo by Larissa Gasparini da Cruz, courtesy of Church News. All rights reserved.\n\nRELATED STORY\n\nCopyright 2023 Deseret News Publishing Company."
    }
]