[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LndyZmFscC5jb20vZnJlZS1zY3JlZW5pbmctb2Ytc3VpY2lkZS10aGUtcmlwcGxlLWVmZmVjdC1hdC1qY2MtdG9uaWdodC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Free Screening of 'Suicide: The Ripple Effect' at JCC Tonight - WRFA Jamestown",
        "content": "A screening of “Suicide: The Ripple Effect” will be shown at Jamestown Community College tonight as part of National Suicide Prevention Month.\n\nThe Suicide Prevention Alliance of Chautauqua County is collaborating with The Resource Center, Chautauqua Tapestry, Chautauqua County Department of Mental Hygiene, and JCC to show the documentary by Kevin Hines.\n\n“Suicide: The Ripple Effect” is an emotionally charged and inspirational documentary that delves into Kevin Hines’ journey through mental health challenges, a suicide attempt, and his path to recovery. Hines’ story is described as a beacon of hope, demonstrating the transformative power of seeking help and the importance of fostering open conversations about mental health.\n\nThe free screening will take place at 6:00 p.m. tonight at the Robert Lee Scharmann Theatre on JCC’s Jamestown campus.\n\nSeptember is National Suicide Prevention Month, where mental health advocates, prevention organizations, survivors, allies, and community members unite to promote suicide prevention awareness.\n\nFor more information about the screening or to learn more about the Suicide Prevention Alliance of Chautauqua County, visit preventsuicidechq.com or contact Carri Raynor at (716) 753-4522 or raynorc@chqgov.com."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5kYXl0b25kYWlseW5ld3MuY29tL2xvY2FsL2NvbXBhbnktd2FudHMtdG8tYnVpbGQtbW9yZS10aGFuLTEwMC1uZXctaG9tZXMtaW4tYmVhdmVyY3JlZWstbmVhci1pbmRpYW4tcmlwcGxlLXJvYWQvWUNGTElNUjNQWkRVTEJPN1NNWFUyTVZKN0Ev0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Company wants to build more than 100 new homes in Beavercreek near Indian Ripple Road - Dayton Daily News",
        "content": "Council will vote on the rezoning request from agricultural to low-density residential at a Oct. 9 meeting.\n\nTentatively named Bridle Wood. according to city documents, the development would contain 117 new single-family homes.\n\nResidents who spoke at Monday’s city council meeting raised concerns about the “conservation easement” in Oberer’s initial plans for the neighborhood, and the additional traffic the new high school is going to bring to the area on South Alpha Bellbrook Road.\n\n“Our neighborhood has tons of walkers,” said Denise Hurley, whose property abuts the proposed development. “When the new high school goes in the corner, people are going to cut through that neighborhood to cut through our neighborhood to go out to the other venues.”\n\nResident Theresa McGeady also expressed concerns to city council about the city’s $250 million infrastructure backlog, adding that the backlog is ongoing while there are four planned or under construction developments within a mile of her Beavercreek home.\n\n“As growth and development are coming into the city, I have concerns about this existing backlog and how the city plans to increase the number of people in these homes, and continues to serve these people while catching up in maintaining and sustaining its existing infrastructure,” she said.\n\nOberer is in phase one of two, City Planner Randy Burkett told council Monday, and must submit a specific site plan to the city before the development would be greenlit."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3JpcHBsZS1sZWdhbC1jaGllZi1mbGFncy1taXNsZWFkaW5nLXN0YXRlbWVudHMtaW4tc2VjLWNoYWlyLXNlbmF0ZS1jb21taXR0ZWUtcmVtYXJrcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Ripple legal chief flags misleading statements in SEC chair Senate committee remarks - CryptoSlate",
        "content": "Ripple’s (XRP) chief legal officer, Stuart Alderoty, asserted that Gary Gensler, the U.S. Securities and Exchange Commission (SEC) Chairman, is set to make statements that may be misleading during his appearance before the Senate Committee on Financial Services.\n\nIn a Sept. 27 post on his X(formerly Twitter) account, Alderoty contended that Gensler might assert the existence of a ‘crypto asset securities market’ and suggest that tokens inherently qualify as investment contracts.\n\nAccording to Alderoty, this statement is false, considering Judge Analisa Torres’ landmark ruling in Ripple’s case against the financial watchdog. He said:\n\n“Perhaps just one representative will read this line from the Court’s 7/13/23 decision in the Ripple case: “XRP, as a digital token, is not in and of itself a “contract, transaction[,], or scheme” that embodies the Howey requirements of an investment contract.”\n\nWhat Gensler plans to say\n\nSEC Chair Gensler is set to double down on his views that the crypto industry falls under the purview of the Commission, according to his written testimony for the Senate Committee on Financial Services.\n\nGensler reiterated his opinion that “most crypto tokens are subject to the securities laws,” adding that the crypto industry was rife with non-compliance with existing laws. Per his statement, crypto intermediaries, like exchanges, must also comply with securities laws.\n\nThe SEC Chair further touted some of the rule-making efforts of the Commission, saying:\n\n“The SEC also has addressed the crypto security markets through rulemaking. We issued a reopening release that reiterated the applicability of existing rules to platforms that trade crypto asset securities, including so-called “DeFi” systems. This release also provided supplemental information for systems that would be included in a new, proposed exchange definition.”\n\nHe concluded that the SEC has brought enforcement actions against wrongdoers to promote investor protection.\n\nGensler’s strict regulatory approach towards the crypto industry has drawn criticism from stakeholders who have highlighted how the SEC was stretching decades-old securities laws to emerging crypto finance models like decentralized autonomous organizations (DAOs) and decentralized finance (DeFi) protocols.\n\nMentioned in this article"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS8zLXRoaW5ncy10aGF0LWNvdWxkLWNhdXNlLXJpcHBsZS14cnAtdG8tZXhwbG9kZS10aGlzLXllYXIv0gFXaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tLzMtdGhpbmdzLXRoYXQtY291bGQtY2F1c2UtcmlwcGxlLXhycC10by1leHBsb2RlLXRoaXMteWVhci8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "3 Things That Could Cause Ripple (XRP) to Explode This Year - CryptoPotato",
        "content": "Ripple has been caught in an ongoing legal battle against the SEC for almost three years now, and it seems Chris Larsen and Brad Garlinghouse are fully committed to fighting the regulatory agency until they get a decisive victory.\n\nWhile the XRP community is eager to see the latest developments in the case, here are three things that could cause Ripple (XRP) to explode in 2023.\n\nRipple Wins: Judge Torres Denies SEC Appeal\n\nIf Judge Analisa Torres denies the SEC appeal against Ripple, not only could it possibly bring price appreciation for XRP but also push regulators and lawmakers across different jurisdictions in the US to work on a clear and thorough regulatory framework for cryptocurrency assets.\n\nBack in July, XRP surged over 70% after Judge Torres stated that XRP is not a security. The SEC immediately moved forward to appeal the ruling, stating that this decision could affect other cryptocurrency-related cases.\n\nHowever, these cases are nowhere similar to Ripple’s, considering how different XRP’s underlying infrastructure is from most DeFi tokens. That just means the SEC is putting all their eggs in a single basket.\n\nUS Institutions Integrating ODL\n\nA major issue with today’s payment infrastructure is poor data flow between intermediaries, causing delays and added expenses to payments. This is where ODL, On-Demand Liquidity, can trigger a massive uptick for XRP.\n\nODL is RippleNet’s liquidity management solution, a product that customers, such as financial institutions, can leverage to execute cross-border payments instantly and seamlessly without intermediaries.\n\nThe gist of ODL is that liquidity is sourced from a pool filled with XRP, and the cost of sourcing this liquidity is low because it only occurs when there’s demand — hence the name.\n\nFollowing July’s partial victory, Ripple representatives expect several American financial institutions will move forward with implementing ODL to their platforms or at least feel more comfortable talking about the problems they experience with their business when it comes to payment rails and cross-border transactions.\n\nSettlement Between Ripple and the SEC\n\nWhat effects a theoretical (but probable) settlement between Ripple and the SEC would have on XRP’s price depends heavily on the terms and conditions in that agreement.\n\nBut, to be fair, most crypto projects that had battled against the SEC have agreed to a settlement; they pay a specified amount to the SEC, and the case is dropped.\n\nDue to the negative implications, a settlement wouldn’t be the best news for XRP, which is already down 70% from its previous highs in July, back to $0.50 at the time of writing.\n\nWhile it can allow founders to go back to focus on Ripple instead of legal battles with the SEC, its founders have expressed they have no intentions for a settlement and instead want to fight the SEC all the way through."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZHVvLmNvbS9kZWNpcGhlci9jb21wYW5pZXMtc3RpbGwtc2VlaW5nLW1vdmVpdC1idWctcy1yaXBwbGUtZWZmZWN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "MOVEit Bug's Ripple Effect Still Unfolding | Decipher - Duo Security",
        "content": "“Unfortunately, not all organizations might even be aware that they have this vulnerable software as a part of their (indirect) tech stack from another supplier upstream.\"\n\nWhile zero-day vulnerabilities typically make headlines when they are first disclosed, they have lasting long-term impacts in the ensuing weeks, months and years, as threat actors continue to target unpatched instances. In fact, an August report from the U.S. Cybersecurity and Infrastructure Security Agency (CISA) found that the majority of the flaws that attackers routinely exploited over the last year were disclosed in 2021 or earlier, including the Log4Shell flaw from 2021, the ProxyShell bugs in Exchange from 2021 and a Fortinet SSL VPN bug from 2018.\n\nFor MOVEit, many of the attacks occurred during an initial rampage on vulnerable MOVEit Transfer servers by the threat actors linked to the Clop ransomware. Some researchers said that they first saw this exploit activity on May 27, while others saw scanning for the MOVEit Transfer logging page as early as March 3 (months before the bug became public on May 31). While victim disclosures are still steadily continuing, many disclosures are stemming from this initial surge. For instance, though it only recently disclosed details on the impact of its breach, National Student Clearinghouse first learned on June 20 that the unauthorized actor had accessed files on May 30.\n\n“It’s still very successful [for threat actors] as far as we know, it’s having a continued impact on a variety of industries and we’re nowhere near to seeing the total impact of that,” said Glenn Thorpe, senior director of Security Research and Detection Engineering with GreyNoise. “We know MOVEit is not over yet - actors haven’t moved away from it and it hasn’t stopped being fruitful for them.”\n\nThe obvious lesson here, both with the MOVEit Transfer bug and with other actively exploited flaws, is to patch vulnerabilities that are serious or under active exploitation as soon as possible. In a new survey looking at top exploited vulnerabilities of this year, Qualys researchers calculated that the flaw had a mean time to response/remediate (MTTR) of seven days. This data point, which shows the average time taken to address the vulnerability after detection, is low in comparison to other vulnerabilities like the PaperCut NG/MF bug (CVE-2023-27350), which had an MTTR of 23 days, and the Fortra GoAnywhere MFT remote code execution flaw (CVE-2023-0669) that had one of 31 days. However, Qualys researchers found that the flaw had a patch rate of just over 51 percent, showing that many systems are still exposed.\n\nBeyond patching, however, part of the complexity of the MOVEit bug is that many of the impacted organizations don’t use the software themselves, but instead are part of this “trickle-down” data breach effect. These impacted organizations and individuals should be on alert for phishing emails that may use their stolen data or fraud-related attacks.\n\n“During the early days of June, while our industry was first chasing indicators of compromise and looking for signs of exploitation, this certainly widened the pool of potential victims,” said Hammond. “Unfortunately, not all organizations might even be aware that they have this vulnerable software as a part of their (indirect) tech stack from another supplier upstream.”\n\nOverall, flaws like the ones in MOVEIt Transfer highlight a need for better security practices from manufacturers themselves, particularly for those behind file transfer services that handle a rich bank of data that’s attractive to cybercriminals. The MOVEit bug has left questions about software liability in its wake, and several lawsuits have cropped up over the past months - including ones against Progress Software itself, but also several against companies using the MOVEit Transfer platform.\n\n“The CVE-2023-34362 flaw in MOVEit Transfer signals potential long-term shifts in cybersecurity,” Saeed Abbasi, manager of vulnerability and threat research at Qualys. “Much like the repercussions from Heartbleed on open-source security, this vulnerability highlights the imperative for strengthened secure development practices. It's a definite call for organizations to intensify their vulnerability assessments, engage in rigorous penetration testing, transition towards zero-trust models, and accelerate a surge in cybersecurity investment. Such high-profile vulnerabilities can spur re-evaluations of vendor trust and catalyze stricter regulatory oversight.”"
    }
]