[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtYmVhcnMtZXllLXN1Yi0wLTM3LW9uLXNlYy12LXJpcHBsZS1zaWxlbmNlLWFuZC1yZWd1bGF0b3J5LWppdHRlcnMtMTI5NTMwMdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "XRP Bears Eye Sub-$0.37 on SEC v Ripple Silence and Regulatory Jitters - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vd2lsbC14cnAtYmUtdGhlLXdvcmxkLXJlc2VydmUtY3VycmVuY3ktYW5kLWJhY2tlZC1ieS1nb2xkLWZvci1hLXN0YWJsZS1wcml6ZS1yaXBwbGUtZGlyZWN0b3JzLXRha2UtYW5kLWxhd3N1aXQtdXBkYXRlL9IBngFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vd2lsbC14cnAtYmUtdGhlLXdvcmxkLXJlc2VydmUtY3VycmVuY3ktYW5kLWJhY2tlZC1ieS1nb2xkLWZvci1hLXN0YWJsZS1wcml6ZS1yaXBwbGUtZGlyZWN0b3JzLXRha2UtYW5kLWxhd3N1aXQtdXBkYXRlLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Will XRP be the world reserve currency and backed by Gold for a stable prize? Ripple director’s take and lawsuit update - Crypto News Flash",
        "content": "The only possible contact between gold and XRP will be through the yellow metal’s tokenization on the XRP ledger.\n\nThe Ripple lawsuit takes new turns as California plaintiffs hit back at attorney Jon E. Deaton in court.\n\nThere’s a new chatter all over the crypto town that Ripple’s native crypto XRP could be backed by gold. These speculations have recently caught fire noting that the world’s leading banks and financial institutions could be accepting XRP for international settlements and will have the backing of gold for its fair value.\n\n\n\n\n\n\n\nHowever, Ripple’s former director of developer relations, Matt Hamilton has dispelled this misconception noting that such an outcome is impossible. Hamilton explained that XRP is a decentralized cryptocurrency with a finite supply and trades on the open market. He further added that XRP has no issue holding back for gold.\n\nHamilton adds that it’s not possible to inflate XRP to have a peg with another asset. The only possible contact between gold and XRP will be through the yellow metal’s tokenization on the XRP ledger. “You can track gold by tokenising it on the XRP Ledger and creating a token such as XAU like companies have been doing for the past decade. But you can’t back XRP itself with gold,” he added. For those not believing this, Hamilton offered to exchange one XRP for one ounce of gold.\n\nCalifornia plaintiffs on Ripple lawsuit\n\nRecently, attorney John E. Deaton filed a motion to allow seven non-parties to submit an amicus curie brief supporting the defendant’s opposition to the lead plaintiff’s motion for class certification. The California plaintiffs have hit back arguing that Deaton’s proposed brief was procedurally and substantively improper.\n\nThe proposed amici included Deaton’s family members and other employees. Thus, the plaintiffs added that they had nothing unique to offer except for rehashing the arguments made by the defendants. Besides, the plaintiffs also added that Deaton’s claims of representing a putative class of 75,890 XRP holders are allegedly false.\n\nThey further added:\n\nThe amici are no friends of the Court. Instead, they are friends and family members of amici’s counsel John E. Deatonᅳa self-proclaimed XRP enthusiast and public personality on social media.\n\nRipple will not win against the SEC\n\nGene Hoffman, president of the Chia Network, recently stated that Ripple would definitely lose against the U.S. Securities and Exchange Commission in their ongoing battle. His comments came after a recent rift with Matt Hamilton, Ripple’s former director of developer relations.\n\nA Twitter user recently asked Hoffman whether Chia’s native token XCH is a security and whether the company plans. Hoffman responded by adding that Chia’s XCH is not a security and that the company is planning to register a Chia equity. He said that this was the obvious way to be legal.\n\n\n\n\n\n\n\nBut Ripple’s Matt Hamilton pointed out that registering equity also did not stop the SEC from going after Ripple. However, Hoffmann hit back stating that Ripple made a mistake by selling XRP even before registering the Ripple stock. He said that Chia Network own XCH but never sold its tokens, thus, it didn’t constitute a security."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vd2lsbC14cnAtYmUtdGhlLXdvcmxkLXJlc2VydmUtY3VycmVuY3ktYW5kLWJhY2tlZC1ieS1nb2xkLWZvci1hLXN0YWJsZS1wcml6ZS1yaXBwbGUtZGlyZWN0b3JzLXRha2UtYW5kLWxhd3N1aXQtdXBkYXRlL9IBngFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vd2lsbC14cnAtYmUtdGhlLXdvcmxkLXJlc2VydmUtY3VycmVuY3ktYW5kLWJhY2tlZC1ieS1nb2xkLWZvci1hLXN0YWJsZS1wcml6ZS1yaXBwbGUtZGlyZWN0b3JzLXRha2UtYW5kLWxhd3N1aXQtdXBkYXRlLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Will XRP be the world reserve currency and backed by Gold for a stable prize? Ripple director’s take and lawsuit update - Crypto News Flash",
        "content": "The only possible contact between gold and XRP will be through the yellow metal’s tokenization on the XRP ledger.\n\nThe Ripple lawsuit takes new turns as California plaintiffs hit back at attorney Jon E. Deaton in court.\n\nThere’s a new chatter all over the crypto town that Ripple’s native crypto XRP could be backed by gold. These speculations have recently caught fire noting that the world’s leading banks and financial institutions could be accepting XRP for international settlements and will have the backing of gold for its fair value.\n\n\n\n\n\n\n\nHowever, Ripple’s former director of developer relations, Matt Hamilton has dispelled this misconception noting that such an outcome is impossible. Hamilton explained that XRP is a decentralized cryptocurrency with a finite supply and trades on the open market. He further added that XRP has no issue holding back for gold.\n\nHamilton adds that it’s not possible to inflate XRP to have a peg with another asset. The only possible contact between gold and XRP will be through the yellow metal’s tokenization on the XRP ledger. “You can track gold by tokenising it on the XRP Ledger and creating a token such as XAU like companies have been doing for the past decade. But you can’t back XRP itself with gold,” he added. For those not believing this, Hamilton offered to exchange one XRP for one ounce of gold.\n\nCalifornia plaintiffs on Ripple lawsuit\n\nRecently, attorney John E. Deaton filed a motion to allow seven non-parties to submit an amicus curie brief supporting the defendant’s opposition to the lead plaintiff’s motion for class certification. The California plaintiffs have hit back arguing that Deaton’s proposed brief was procedurally and substantively improper.\n\nThe proposed amici included Deaton’s family members and other employees. Thus, the plaintiffs added that they had nothing unique to offer except for rehashing the arguments made by the defendants. Besides, the plaintiffs also added that Deaton’s claims of representing a putative class of 75,890 XRP holders are allegedly false.\n\nThey further added:\n\nThe amici are no friends of the Court. Instead, they are friends and family members of amici’s counsel John E. Deatonᅳa self-proclaimed XRP enthusiast and public personality on social media.\n\nRipple will not win against the SEC\n\nGene Hoffman, president of the Chia Network, recently stated that Ripple would definitely lose against the U.S. Securities and Exchange Commission in their ongoing battle. His comments came after a recent rift with Matt Hamilton, Ripple’s former director of developer relations.\n\nA Twitter user recently asked Hoffman whether Chia’s native token XCH is a security and whether the company plans. Hoffman responded by adding that Chia’s XCH is not a security and that the company is planning to register a Chia equity. He said that this was the obvious way to be legal.\n\n\n\n\n\n\n\nBut Ripple’s Matt Hamilton pointed out that registering equity also did not stop the SEC from going after Ripple. However, Hoffmann hit back stating that Ripple made a mistake by selling XRP even before registering the Ripple stock. He said that Chia Network own XCH but never sold its tokens, thus, it didn’t constitute a security."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vbGF5b2Zmcy1xdWl0dGluZy1yZW1haW5pbmctY293b3JrZXItcmVzaWduLXR1cm5vdmVyLWxlZnQtYmVoaW5kLWNvbnRhZ2lvbi1yZXNlYXJjaC0yMDIzLTHSAX1odHRwczovL3d3dy5idXNpbmVzc2luc2lkZXIuY29tL2xheW9mZnMtcXVpdHRpbmctcmVtYWluaW5nLWNvd29ya2VyLXJlc2lnbi10dXJub3Zlci1sZWZ0LWJlaGluZC1jb250YWdpb24tcmVzZWFyY2gtMjAyMy0xP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Layoffs can trigger quitting and turnover contagion, research shows - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nResearchers have known for some time that quitting is contagious.\n\nWhen one employee leaves, the departure can have a ripple effect on others on the same team; suddenly those remaining workers, too, are more likely to head for the exit. It's a phenomenon that might help explain the staying power of the Great Resignation, a period in which workers have been quitting — and changing jobs — at record levels.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nNow new research suggests layoffs are correlated with the same behavior. Visier, a human-resources analytics company, found that when employees were laid off or terminated, the likelihood that their direct colleagues would quit was 7.7% higher than if those employees had remained. Visier published a study about turnover contagion following resignations and later detailed its finding related to layoffs in a LinkedIn post.\n\nLayoffs are piling up in corners of corporate America — Twitter is said to have let go of 200 employees over the weekend in addition to the 7,500 that the social media giant axed last year; meanwhile, other tech giants including Google and Microsoft have also shed workers this year, as have Goldman Sachs and Disney. The findings have implications for firms that have recently let go of large numbers of employees or are considering it: The layoffs might push other workers out the door.\n\nRelated Video\n\n'A layoff can be an information signal'\n\nSo should companies that have recently conducted mass layoffs — looking at you, Amazon, Salesforce, Compass — expect a raft of resignations?\n\n\"Our recommendation is: Beware,\" Andrea Derler, a principal researcher at Visier, told Insider. \"If you're doing layoffs, you might as well add 7% to 8% to your count who are likely to leave as well.\"\n\nWhen employees are laid off or terminated, it can have a domino effect and mean team members are more likely to quit. Martin Barraud/Getty Images\n\nUsing Visier's database of 17 million anonymized employee records around the world, researchers found that when employees were let go, their team members were more likely to follow suit. The increased likelihood began on day one of the peer's layoff or firing and increased sharply 45 to 105 days after the other worker's termination, with a peak at around 75 days. The research pool involved cuts that happened between February 2019 and June 2022.\n\nThere are, of course, many reasons people might choose to quit their job: They might get assigned a new manager they don't care for, or they're offered an exciting opportunity, or they have a change in their family's circumstances that require a move.\n\nAdvertisement\n\nIt's also understandable why employees who survived a layoff might also quickly decide to leave of their own volition. Layoffs are deeply unsettling. If somebody on your team is cut, for instance, it's only natural to worry that you might be next. Quitting, in that case, might be an act of self-preservation.\n\nRelated stories\n\n\"A layoff can be an information signal,\" Elena Obukhova, an associate professor of strategy and organization at McGill University, told Insider. \"It's a sign of your company's solvency or future direction.\"\n\nWhat's more, if your team's headcount decreases, that could mean your workload increases. That also might make you inclined to tender your resignation letter.\n\nSocial ties might also be a factor. You might feel guilty that you were spared or miss your newly departed colleague so you decide to look at other options.\n\nAdvertisement\n\n\"People have wondered whether the pandemic has made social ties less important — there's a thought that since we've moved to a more digital world, we don't need the water-cooler chat or the office gossip,\" said Obukhova, an economic sociologist whose research explores how culture and social relationships shape markets.\n\n\"But even post-COVID, people still need that social embeddedness and social support.\"\n\nHow managers can stem domino departures\n\nGallup has estimated that voluntary turnover costs American businesses $1 trillion a year. And in a still-tight labor market like this one, it's especially hard and expensive to hire. (That alone might prompt executives who are mulling layoffs to reconsider.)\n\nBut for companies that have already cut staff, leaders must be mindful of the consequences and take action to decrease the possibility of further resignations, Obukhova said. \"Make sure that the layoffs do not completely destroy people's sense of belonging and community.\"\n\nAdvertisement\n\nAfter all, managers might not be fully aware of their team member's social ties, particularly if employees work remotely or have a hybrid setup. Bosses might be on team Zoom calls, but they don't see, for instance, that their team members regularly text each other on and off the clock.\n\nDerler suggested managers talk to their remaining employees. \"Managers might avoid this because it's hard to have those kinds of tricky conversations. But they need to think about their team member's salary, growth, and market value.\n\n\"Ask them: 'How do you feel?'\"\n\nAn earlier version of this story appeared on January 19, 2023.\n\n\n\nWere you laid off? How'd it affect your life? And what did you do next? We'd love to hear your story — send us an email at mylayoffstory@businessinsider.com.\n\n"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmFtZXJpY2FudGhlYXRyZS5vcmcvMjAyMy8wMi8yNy9jaHJpc3RpbmEtYW5kZXJzb24td2FkZXMtaW50by10aGUtaGlzdG9yeS1vZi1zd2ltbWluZy1wb29sLXNlZ3JlZ2F0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Feb 2023 08:00:00 GMT",
        "title": "Christina Anderson Wades Into the History of Swimming Pool Segregation - American Theatre",
        "content": "Don Kenneth Mason and Laura Steele in \"the ripple, the wave that carried me home\" at Portland Center Stage. (Photo by Shawnte Sims)\n\nIn ‘the ripple, the wave that carried me home,’ next playing at Kansas City Rep and Yale Rep, this busy playwright pens another piece inspired by history.\n\nPlaywright Christina Anderson has a penchant for historical fiction. In the Tony-nominated musical Paradise Square, the book of which she co-wrote with Larry Kirwan and Craig Lucas, African Americans and Irish immigrants in New York find their favorite watering hole, not to mention the entire nation, disrupted by the Civil War. In How to Catch Creation, four feminist artists in San Francisco see their lives intersecting with that of a queer artist from the 1960s. And pen/man/ship follows a group of African Americans on a voyage to Africa in 1896 as Jim Crow took hold in the South.\n\nChristina Anderson.\n\nAfter reading the 2007 book Contested Waters by Jeff Wiltse, Anderson found another way to dive into America’s murkiest water: race. In specific, Anderson looks at the history of the desegregation of public pools. There are currently more than 300,000 such pools in the U.S., but African Americans have only been able to fully access them for the last 50 years. The fight to give Black people access to water, and the toll of that activism, are the basis for her newest play, the ripple, the wave that carried me home, commissioned by Berkeley Rep in 2014 and produced there last year, as well as at Portland Center Stage. The play is continuing its victory lap this year at Goodman Theatre, where it ran Jan. 12-Feb. 13, and will next run at Kansas City Rep, near Anderson’s hometown, March 14-April 2, and at Yale Rep April 28-May 20.\n\nIn the ripple, a woman named Janice learns from a character called Young Chipper Ambitious Black Woman that her father, Edwin, is being honored for integrating public pools in her hometown, which brings up bad memories for her. She recalls her father’s obsession over his lawsuit and a devastating incident with her mother, Helen, both of them factors that have kept her away from the water for decades. The story that unfolds addresses the unhealed wounds that racism, sexism, and segregation left on her family, and the ways that water may be able to cleanse them.\n\nI spoke to Anderson recently about crafting new plays, activism, political efforts to ban theatre, and more.\n\nKELUNDRA SMITH: Your plays often deal with excavating the past, specifically a Black past, for connections to today’s issues. What do you think the past can teach us about the present?\n\nCHRISTINA ANDERSON: I have always been interested in things before my time. Even when I was a preteen and teenager, I was obsessed with movie musicals starring Doris Day, Judy Garland, and Barbra Steisand. I read Nikki Giovanni and Sonia Sanchez’s early work. As my research skills progressed, and I had access to [the JSTOR research database] in college, I would spend hours in the library. Reading made me realize how repetitive we are as human beings, particularly [pertaining to racism] in America. I was greatly affected intellectually, emotionally, and spiritually by what I was learning, and plays felt like an effective way to ask, How are these things stirring emotions in me?\n\nWhat inspired you to write the ripple?\n\nI knew I wanted to write about water as an element, but I didn’t know what I wanted to write about specifically. Then I was researching environmental injustice and I found Contested Waters, and I was completely floored. I can’t swim, my mother can’t swim, a lot of people in my family can’t swim, and it never occurred to me that a public policy could determine my access to water. That forced denial can turn things and make people believe that they’re only for white folks, so as a kid I never felt like it was a thing I was missing.\n\nI’ve also been interested in the children of activists and the toll [that activism] takes on the family, so I wanted to make it a family drama. When I was figuring out the structure, I read Ohio State Murders and The Alexander Plays by Adrienne Kennedy, and Wallace Shawn’s plays, particularly his direct-address and solo pieces. I knew it was going to be a [play that utilizes] direct address and it was going to be about swimming.\n\nAneisa J. Hicks, Christiana Clark, and Brianna Buckley in “the ripple, the wave that carried me home” at the Goodman Theatre. (Photo by Liz Lauren)\n\nLet’s talk about naming for a moment. In your plays, your characters’ names often indicate what they represent rather than simply being a name. Why?\n\nI still like to have these moments in my plays that remind people we’re experiencing a theatrical piece. I don’t want anyone watching the piece to assume they know what this world is or that they know who these people are. They can see themselves in the people onstage, but I’m interested in having something be familiar, but also distanced and playful. In ripple, I knew Young Chipper would be from an upper-class Black family, and I wanted to capture culturally how that lives. But one thing that I tell directors working on this piece is that Young Chipper is absolutely a three-dimensional person in this world; she shouldn’t be an abstract figure. She’s chosen how she wants to commemorate her community, and I hope the audience laughs with her.\n\nIn the script, Helen is the one who has the idea to restore the public pool, but Edwin is painted as the hero. What are you saying about the erasure of Black women from the story of the Civil Rights Movement?\n\nI was really thinking about the types of activism. You can have those activists, who are what I like to call disruptors, who will physically put themselves forward to protest an injustice. Then you have these people in the back rooms. I remember in college finding out about how Martin Luther King Jr. was supported on so many levels. Harry Belafonte paid for his housing; Andrew Young’s brother [Walter Young] was a dentist and did free dental work for everybody in the Civil Rights Movement. When you think about Coretta, after Martin died, she was on the phone doing fundraisers, lobbying and doing a ton of work that wasn’t on camera or in the press.\n\nI was interested in how Black women navigate politics and activism in ways that aren’t so public but still have an immense impact. With Helen and Edwin in the play, a lot of the scenes are domestic and at home. Sometimes Helen can see the reality of the dream quicker than Edwin, but he always listens to her.\n\nI want to touch on a couple of your other plays. I’m thinking about How to Catch Creation and pen/man/ship, both of which deal with points in history that some politicians are trying to suppress the teaching of right now. What is going on with those plays?\n\nHow to Catch Creation had productions lined up before the pandemic, but everything came to a halt. Recently, Geva Theatre in Rochester, N.Y. and Julliard produced it, and from my understanding they both went well. I don’t know what’s going to happen, but hopefully it will pick back up.\n\nMolière in the Park did a couple of awesome online productions of pen/man/ship. Young people send me DMs on Instagram that some of the monologues have gotten them awards and into undergraduate acting programs. I’m also interested in adapting it into a screenplay, and funnily enough, that script also deals with water.\n\nI’ve been thinking a lot about this banning that’s been happening, and what recently happened with Indecent [in Florida]. It’s a sad and wild time, but this is also history repeating itself. The arts are the first target. When politicians are trying to get elected or get on bigger political stages, the arts are the first thing they try to regulate. I hope the reaction to it can change.\n\nWhat are you working on right now?\n\nI am doing a stage adaptation of Barracoon: The Story of the Last ‘Black Cargo’, based on the book by Zora Neale Hurston. It is a commission for the Public Theater, and I’m excited to pick it back up.\n\nWhat do you want your plays to do in the world? What do you want your impact to be?\n\nWhen people come to see my work, I’m still purposeful and intentional in finding moments of joy and laughter. In my life, when bad things are happening, there are still those moments where miraculously I can find humor. I want people to see a good piece of theatre and see fantastic Black actors. I want people to enjoy live theatre, I want people to see parts of themselves and also see something new, or reconsider things in a new light. I want people to talk about what they’re seeing.\n\nKelundra Smith (she/her), a writer based in Atlanta, is a frequent contributor to this magazine.\n\nSupport American Theatre: a just and thriving theatre ecology begins with information for all. Please join us in this mission by making a donation to our publisher, Theatre Communications Group. When you support American Theatre magazine and TCG, you support a long legacy of quality nonprofit arts journalism. Click here to make your fully tax-deductible donation today!\n\nShare this: Print\n\n\n\nTweet\n\nEmail\n\n"
    }
]