[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnRhbGtpbmdyZXRhaWwuY29tL3Byb2R1Y3RzLW5ld3MvYWxjb2hvbC9icm90aGVycy1sYXVuY2hlcy1yYXNwYmVycnktcmlwcGxlLWZsYXZvdXItY2lkZXItMDYtMDQtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Brothers launches raspberry ripple flavour cider - Talking Retail",
        "content": "The latest variant is a based on the classic ice-cream combination and is best served chilled over ice. Available in 500ml and 330ml glass bottles, and in 6x330ml and 10x330ml multi-pack can formats, Brothers Raspberry Ripple launches this spring, with RRPs aligned to existing variants.\n\nNicola Randall, head of marketing Brothers Drinks Co., says: “Flavour innovation is what we do best at Brothers. We break the mould and bring all-new flavours to the cider category; we know our range of curious flavours has broad appeal across a wide range of consumers.\n\n“We’re adding to our successful range of highly original variants with Raspberry Ripple, which draws its inspiration from the world of ice-cream. The new flavour will hold strong appeal for impulse shoppers and comes hot on the heels of our already-popular Cherry Bakewell variant launched in 2022.”\n\nThe launch of Brothers Raspberry Ripple will be supported with a disruptive marketing campaign comprising influencer partnerships, social media activations, and POS materials available to drive visibility in depots and in-store."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5mb3g0My5jb20vYXJ0aWNsZS9saWZlL2Zvb2Qvd2Vpcy1tYXJrZXRzLXdlaXMtYnktbmF0dXJlLWljZS1jcmVhbS1pbnRyb2R1Y3Rpb24vNTIxLTkzMzU4ODIxLWIyY2QtNGQ1Mi1iN2I2LTU0Y2Y2YTliNDllONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Weis Markets unveils new ice cream brand | fox43.com - WPMT FOX 43",
        "content": "Weis Markets introduces new Weis By Nature Ice Cream\n\nThe new collection of flavors produced in the company’s Sunbury creamery without GMOs or artificial flavors, preservatives, colors or ingredients, the company said.\n\nYORK, Pa. — Weis Markets today announced the launch of Weis By Nature ice cream, a collection of flavors produced in the company’s Sunbury creamery without GMOs or artificial flavors, preservatives, colors or ingredients. Weis By Nature ice creams comes in 11 premium flavors, including: Chocolate: Decadent Dutch chocolate ice cream\n\nDecadent Dutch chocolate ice cream Coffee: Rich, flavorful coffee in creamery ice cream\n\nRich, flavorful coffee in creamery ice cream Cookies ‘N Cream: Chunks of cream-filled cookies in vanilla ice cream\n\nChunks of cream-filled cookies in vanilla ice cream Fudge Twirl: Vanilla ice cream swirled with fudge ripple\n\nVanilla ice cream swirled with fudge ripple Mint Chocolate Chip: Mint ice cream filled with chocolate chunks\n\nMint ice cream filled with chocolate chunks Mocha Caramel Swirl: Mocha ice cream with a salted caramel ripple\n\nMocha ice cream with a salted caramel ripple Peanut Butter Cup: Peanut butter sauce swirled in chocolate ice cream\n\nPeanut butter sauce swirled in chocolate ice cream Peanut Butter Ripple: Peanut butter sauce swirled in vanilla ice cream\n\nPeanut butter sauce swirled in vanilla ice cream Salty Caramel Ripple: Creamy vanilla ice cream swirled with sea salt caramel ripple\n\nCreamy vanilla ice cream swirled with sea salt caramel ripple Vanilla Bean and Chocolate: A delightful combination of vanilla bean and chocolate ice cream\n\nA delightful combination of vanilla bean and chocolate ice cream Vanilla Bean: Vanilla bean specks in vanilla ice cream “Our Weis By Nature ice cream offers customers a premium, delicious product free from artificial ingredients at a more affordable price point,” said Alison Gregas, Weis Markets director of private brands. Weis By Nature ice cream retails for $3.99. Related Articles Create your own ice cream flavor at the Turkey Hill Experience | Family First\n\nRanch-flavored ice cream is coming to Walmart\n\nNew McFlurry flavor is coming to McDonald's near you Download the FOX43 app"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2plcmVteS1ob2dhbi1zZWMtdnMtcmlwcGxlLWxhd3N1aXQtY291bGQtY29udGludWUtYmV5b25kLTIwMjYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Jeremy Hogan: SEC vs. Ripple lawsuit could continue beyond 2026 - CryptoSlate",
        "content": "Lawyer Jeremy Hogan said the SEC vs. Ripple lawsuit could run beyond 2026, depending on the outcome of the current case.\n\nIn Nov. 2022, James Filan predicted Judge Torres would deliver her verdict by March 31 – setting off a buying frenzy in the run-up. However, the date passed with no judgment given.\n\nJohn Deaton later chimed in, clarifying that March 31 was not the deadline. He expects the verdict to come within the next 30 to 60 days.\n\nHowever, as pointed out by Hogan, the upcoming verdict may not be the end of the matter, as both parties have the right to appeal the judge’s decision.\n\nThe SEC vs. Ripple\n\nIn Dec. 2020, the SEC brought legal proceedings against Ripple on allegations it had raised over $1.3 billion in the sale of XRP tokens – an unregistered security per the agency.\n\nThe lawsuit has uncovered inconsistencies with regulatory policies, even accusations of dodgy dealings at the hands of senior ex-SEC personnel.\n\nFor example, Former SEC Director William Hinman was accused of corruption due to his ties with the law firm Simpson Thacher, a member of the Ethereum Enterprise Alliance. Ripple’s legal team argued that the SEC picked winners and losers, including granting Ethereum “not a security” status.\n\nOver the years, Ripple Chair Brad Garlinghouse has blasted the unfair treatment of XRP. Most recently, he took aim at SEC Chair Gary Gensler, calling him an “autocrat” motivated by encouraging a vague regulatory landscape.\n\n“When you behave like an autocrat running a $2.2B bloated agency, why would you ever want to provide clarity about what’s “in or out”? “\n\nHogan’s legal analysis\n\nAs Garlinghouse said in his initial reaction to the SEC filing in Dec. 2020, Ripple will take on the SEC and attempt to pave a fairer deal for the crypto industry going forward.\n\nHogan pointed out that previous SEC crypto lawsuits were hamstrung by the defendants’ unwillingness to fight and the size of their defense budgets.\n\nHowever, with Ripple willing to fight, alongside a vast war chest, this is the case that could bring an end to spurious crypto lawsuits at the hands of the SEC, said Hogan.\n\n“Ripple has put $100 million into fighting the SEC. And the facts for Ripple are pretty good. Better than for most crypto projects. So, this is the case where, what the SEC is doing, could be put to an end.”\n\nConsidering each scenario, Hogan said if Ripple settled, all of the effort and money spent defending its case would be wasted – as the SEC would be free to continue citing the Howey test and its subjective interpretation of that law to sue crypto firms.\n\nThis would also contradict Garlinghouse’s previously stated intent to fight for industry-wide regulatory clarity.\n\nHogan believes if the judge rules in favor of Ripple, the SEC will likely accept that judgment and not appeal the decision. This is because another favorable Ripple ruling at the appellant court would set a binding precedent in law.\n\nHowever, if Ripple loses, Hogan imagines the firm will appeal, taking the case to the appellant court. A loss at the second circuit would mean another appeal at the Supreme Court level – taking matters well past 2026.\n\n“Time-wise, we get the judge’s decision, let’s say, in April or May. The second circuit wouldn’t be hearing it until next year. And if it goes up to the U.S. Supreme Court, to really replace the Howey test, we’re talking two to three more years from there.\n\nMentioned in this article"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3Blb3BsZS5jb20vaHVtYW4taW50ZXJlc3QvZGVhZi1ib3lmcmllbmQtZ2lybGZyaWVuZC1jbGltYmVycy1mYWNlLW1vdW50LWV2ZXJlc3QtYnJ1dGFsLWNvbmRpdGlvbnMtc3RhcnQtcmlwcGxlLWVmZmVjdC1yZWFsLWxpZmUtbG92ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Deaf Climbers Scott Lehmann and Shayna Unger Will Attempt Everest - PEOPLE",
        "content": "Shayna Unger and Scott Lehmann became the first deaf-led team to stand on the snow-covered peak of Alaska's Denali in June 2021. Shortly after the climb, which took them to an elevation of 20,310 feet, the couple — who hadn't even unpacked their gear yet — started planning their next ambitious expedition.\n\nIn the coming weeks, Unger, 33, and Lehmann, 31, will strike out on their latest high-altitude odyssey: an attempt to reach the 29,032-foot-high summit of Mount Everest, the world's highest mountain.\n\n\"The day after we got off Denali, we looked at each other and said, 'Let's go for it,'\" recalls Lehmann, using American Sign Language (ASL) and an interpreter.\n\nCourtesy\n\nTheir Mount Everest expedition is part of the couple's larger plan to become the first deaf climbers to ascend the highest mountain on each of the seven continents, known as the Seven Summits.\n\nBut the couple are also determined for their quest to be about something bigger than climbing mountains for the nearly 30 million Americans living with hearing loss in both ears.\n\n\"We want to be role models and show our community, especially the kids, that climbing or even just being in the outdoors isn't something that only hearing people do,\" says Unger, who, like her boyfriend, worked for years at the Maryland School for the Deaf in Frederick (she as a counselor; Lehman taught math), before leaving to train for their current expedition. \"We want this to have a ripple effect.\"\n\nCourtesy\n\n\"It's not just about reaching the summit,\" Lehmann adds. \"It's the whole experience, sharing what we've learned with our community.\"\n\nThe couple, who met in high school, have been focused on mountaineering ever since Lehmann began teaching himself to climb 11 years ago.\n\nDo you have a sweet story the world needs to know? Send the details to love@people.com for a chance to be featured in Real-Life Love, People.com's series dedicated to sharing extraordinary connections and heartfelt gestures.\n\nWhen he couldn't find any classes for deaf climbing enthusiasts, he decided to teach himself by watching YouTube videos and reading books. \"I'd often show up the mountain,\" he says, \"and ask anyone who would answer my questions [by writing them down on notepads].\"\n\nCourtesy\n\nHe soon began sharing his obsession with Unger and then teaching her everything he'd struggled to learn on his own.\n\n\"I wanted to save her the embarrassment of having to ask random strangers on the mountains,\" he says. \"It was really amazing how quickly she learned because she had direct access to the information from me.\"\n\nIn 2015, the couple climbed Africa's highest peak, 19,341-foot-high Mount Kilimanjaro, and before long they were bagging peaks in South America, Mexico and the French Alps.\n\n\"Standing on top of a summit is such a feeling of accomplishment,\" says Unger, who will have three additional peaks — in Antarctica, Indonesia and Russia — to climb after Everest before she and Lehmann become the first deaf alpinists to complete the Seven Summits.\n\nCourtesy\n\nThey both admit that their upcoming expedition to the world's highest mountain — which they hope to summit in early May with the help of two sherpas, weather permitting — will be their most challenging adventure to date.\n\nThe couple is ready to begin and clearly focused on the arduous climb. Asked whether Lehmann might pop the question to his longtime girlfriend when they reach the peak of the highest mountain on Earth, Unger quickly dismisses the suggestion.\n\n\"'Don't even think about it,' I've told him,\" she says with a laugh, admitting that she's determined to complete their lofty mountaineering goals before tying the knot. \"No Seven Summits, no ring.\""
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8veXViYW5ldC5jb20vcmVnaW9uYWwvcmlwcGxlLWVmZmVjdC1vbi1maXJlLXJlc2lsaWVudC1mb3Jlc3RzLXRoZS1ub3J0aC15dWJhLWxhbmRzY2FwZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Ripple Effect on Fire-Resilient Forests: The North Yuba Landscape - YubaNet",
        "content": "VALLEJO, Calif., APRIL 5, 2023 – Note: The Tahoe National Forest and National Forest Foundation recently signed an agreement for an additional $177 million to implement forest management work in the North Yuba Landscape.\n\nFire-resilient forests have a ripple effect — from trees to landscapes to communities — as their benefits spread beyond their borders to all of us.\n\nThe 275,000-acre North Yuba Landscape within California’s Tahoe National Forest is one of the largest contiguous unburned areas remaining in the Sierra Nevada Mountains. It was selected for the Wildfire Crisis Strategy in 2022 as a high-risk landscape. It is home or backyard for several mountain communities, including Downieville — about 3 square miles with a population of around 250. Like many other small towns within forested lands in the West, Downieville is exposed to significant wildfire risks due to rising temperatures, enduring drought, and an overabundance of living and dead trees on the land.\n\nDownieville, this 2022 photo shows an overgrowth of trees, which would allow fire to spread and grow in intensity in the event of a wildfire.\n\n“There’s a lot of potential for large scale, high severity fire if something starts during the summer,” said Andrew Mishler, Acting Yuba River District Ranger. “And the work planned for this landscape really focuses on reducing the density of vegetation around communities and giving that buffer firefighters need to defend them.”\n\nAt first it is hard to see the need to remove anything. The sea of green seems like a positive thing, a sign the forest is productive and beautiful. But look closer and consider drought years when these trees and shrubs are water stressed and drying. Then the vegetation becomes potential fuel for a fire.\n\nWildfire risks become more visible during a drive to Downieville along a winding highway, hemmed in by heavily forested canyons.\n\nThis highway is the only way in and out of Downieville for residents and the nearly million visitors each year coming to the Tahoe National Forest for recreation. If the hillsides ignited, entrapment becomes a real danger for everyone. Increasing the wildfire resilience of important forest infrastructure, like roads and bridges, by reducing vegetation around them protects locals and anyone travelling to relax on public lands.\n\nFire-resilient forests also benefit the water supply, locally and regionally.\n\n“The water resources in this landscape are very important to a lot of communities, not just here in the area, but downstream as well,” said Mishler. “If we lose a lot of this forest cover to fire, we’re going to have sediment and debris flowing into those waterways and impacting water quality.”\n\nThe North Yuba River is the main tributary of the Yuba River. The name comes from ‘uba seo, the Nisenan word for “Yuba waterway”.\n\nThe North Yuba Landscape is named for the North Yuba River, which provides drinking water, habitat for sensitive wildlife, and recreation along the river.\n\nBut even if you never visit the North Yuba Landscape or even know its name, protecting this water source from wildfire risks affects us all. The North Yuba River supplies 260,000 acre-feet of water for 60,000 acres of productive farmland as far away as the Sacramento Delta. The Delta provides water to nearly 30 million residents in California and supports agriculture supplying food across the country. So if you live in Maine, but you eat asparagus grown in the Delta, you might be absorbing the wildfire resilience of the North Yuba Landscape despite being thousands of miles away.\n\nThat’s why the Forest Service and a collaborative group of eight partners — called the North Yuba Partnership — are working to implement the agency’s Wildfire Crisis Strategy in the North Yuba Landscape. Proposed work includes reducing the number of trees on the landscape with ecological thinning. Strategic tree removal can help reduce wildfire risk to communities, lessen the potential for carbon emissions from a catastrophic fire, and promote healthy old-growth forest that will be left. Plus, biomass will either be burned by prescribed fire or used for bioenergy — to reduce vegetation on the ground and help stop fire from climbing into the forest canopy to spread quickly.\n\n“By working together and forming the North Yuba Forest Partnership, we are all able to move more quickly and effectively toward achieving social and environmental resilience,” said Tahoe National Forest Supervisor Eli Ilano. “With 5 million dead trees across the Tahoe in 2022 alone, the urgency of this work has never been more important.”\n\nSimilar work will be happening in landscapes within national forests throughout the country with the announcement of 11 new landscapes. For updates on the work to reduce wildfire risk or for more information on the Forest Service’s national strategy, please visit Confronting the Wildfire Crisis | US Forest Service (usda.gov)"
    }
]