[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS94cnAtZXhwbG9kZXMtYWJvdmUtMC01LWhlcmVzLXRoZS1uZXh0LWNoYWxsZW5nZS1mb3ItdGhlLWJ1bGxzLXJpcHBsZS1wcmljZS1hbmFseXNpcy_SAXFodHRwczovL2NyeXB0b3BvdGF0by5jb20veHJwLWV4cGxvZGVzLWFib3ZlLTAtNS1oZXJlcy10aGUtbmV4dC1jaGFsbGVuZ2UtZm9yLXRoZS1idWxscy1yaXBwbGUtcHJpY2UtYW5hbHlzaXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Jun 2023 07:00:00 GMT",
        "title": "XRP Tests $0.5 Critical Resistance But Will the Rally Continue? (Ripple Price Analysis) - CryptoPotato",
        "content": "Ripple’s price has shown bullish movement in recent weeks. However, there is a notable resistance level that needs to be overcome before a more sustained rally can be anticipated.\n\nTechnical Analysis\n\nBy: Edris\n\nXRP/USDT Daily Chart:\n\nXRP has displayed a consistent upward trend after being rejected from the 200-day moving average of around $0.4. Additionally, it has surpassed the 50-day moving average of around $0.45 and appears to be targeting the resistance zone at $0.6 in the short term.\n\nA successful breakthrough of the $0.6 level would likely initiate a bullish phase, with the price potentially reaching as high as $0.9 in the mid-term. However, it is worth noting that the RSI has recently indicated an overbought condition, suggesting the possibility of a pullback or a period of consolidation in the upcoming days.\n\nXRP/BTC Daily Chart\n\nThe price has successfully broken out of the significant descending channel after finding support near the 0.000016 SAT level. Furthermore, both the 50-day moving average, positioned around 0.000017 SAT, and the static resistance level at 0.000018 SAT have been surpassed.\n\nThe price is attempting to breach the 200-day moving average; however, the RSI’s overbought signal suggests the potential for a short-term correction. In such a scenario, both the 0.000018 SAT level and the 50-day moving average are likely to be retested, providing support to the market."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aHktcmlwcGxlLXhycC1wcmljZS1leHBsb2RlZC0xMi1pbi03LWRheXMtYW5kLW9uZS1pbXBvcnRhbnQtY2F0Y2gv0gFgaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3doeS1yaXBwbGUteHJwLXByaWNlLWV4cGxvZGVkLTEyLWluLTctZGF5cy1hbmQtb25lLWltcG9ydGFudC1jYXRjaC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Jun 2023 07:00:00 GMT",
        "title": "Why Ripple (XRP) Price Exploded 12% in 7 Days (And One Important Catch) - CryptoPotato",
        "content": "Despite the fact that the larger part of the cryptocurrency market is mostly covered in red, one prominent altcoin seems to stand out.\n\nRipple’s XRP price is soaring in the past few days, and it shows no signs of slowing down. The coin is up around 12% on the weekly and has conquered an important level – that of $0.5. So, without any further ado, here are a couple of reasons why that might be.\n\nThe SEC Chances Growing Slimmer?\n\nWhile there’s no new breakthrough in the case against the Securities and Exchange Commission of the United States, it appears that investors are starting to price in the potential for a victory.\n\nRecall that a couple of weeks back, Judge Analisa Torres denied the SEC’s request to seal documents pertaining to a speech by the former director of the agency’s corporate finance division – Bill Hinman.\n\nThis has apparently had many people thinking that the case is close to its end. Charles Hoskinson – the founder of Cardano – is among them. He believes that the case will get resolved in June.\n\nXRP Bulls Getting Excited\n\nIt also appears that investors are preparing for a potential uptick in the price of XRP on leveraged exchanges.\n\nData from the popular analytics resource, CoinGlass, shows that the ratio between long and short positions over the past day has spiked above 1. This is true for most of the major cryptocurrency exchanges that support leveraged trading.\n\nIn essence, this indicates that long positions are dominating and that there are more buyers than sellers at the moment.\n\nHowever, this could also raise some concerns. Leveraged positions are liquidated once the collateral posted for them is not enough to cover the trade. In other words, they are force-closed. And the way closure works is – long positions get sold, while short positions get bought. This is capable of causing the so-called squeezes.\n\nWhen the price starts moving aggressively against the predominant sentiment (in this case – bullish), this causes a cascade of long liquidations (read: sold positions), which add more fuel to the fire."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDYvMDEvZXhwZXJ0LXNheXMtcmlwcGxlLWlwby1jb3VsZC1leGNlZWQtMjB4LXZhbHVhdGlvbi13aXRoLTYwMC1wZXItc2hhcmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Jun 2023 07:00:00 GMT",
        "title": "Expert Says Ripple IPO Could Exceed 20x Valuation with $600 per Share - The Crypto Basic",
        "content": "A market analyst calculates an estimate of a potential valuation for Ripple in the event of an IPO, possibly exceeding $600 per share.\n\nRenowned Wall Street veteran Linda P. Jones, with a 25-year career in the financial industry, has shared her expert insights on what a potential Ripple Public Offering (IPO) could look like following a decisive legal ruling in the ongoing lawsuit.\n\nIn a recent video, Jones embarked on a back-of-the-envelope calculation to estimate Ripple’s stock value. Based on current data from Linqto, Ripple’s shares are priced at $35, reflecting a valuation of $5.7 billion. Notably, Linqto allows investors to buy a company’s stock pre-IPO.\n\nWill we see a record setting #iPO for #Ripple after the Judges decision?\n\nListen to 25yr Wall St veteran discuss what a @Ripple iPO could look like,a 20x Valuation=$600+ Ripple share price? #RETWEET #XRPArmy\n\nCredit: @LindaPJones pic.twitter.com/Ph7vdoeR0e — Digital PerspectivesPermaBull (@DigPerspectives) May 31, 2023\n\n- Advertisement -\n\nHowever, Jones highlighted that Linqto’s figure seems disproportionately low when considering Ripple’s historical performance and substantial XRP holdings.\n\nDrawing attention to Ripple’s vast XRP reserves, Jones emphasized that the 42 billion XRP tokens held in escrow are currently valued at $21 billion, assuming a market rate of $0.50 per token. This valuation alone outstrips Ripple’s current market value by fourfold, indicating a significant undervaluation.\n\n- Advertisement -\n\nComparing Ripple IPO to Coinbase\n\nTo substantiate her hypothesis, Jones drew a parallel to the successful IPO of Coinbase, America’s largest crypto exchange. Coinbase witnessed an exponential increase in value after going public, with a valuation surging from $86 billion to remarkable heights.\n\nJones speculated that if Ripple was valued similarly to Coinbase, at $86 billion, combined with its $21 billion XRP holdings, the total valuation could reach an astonishing $107 billion—almost 20 times the current market value.\n\nEnvisioning a scenario where XRP regains its former peak value of $3.59, Jones projected a staggering valuation of $150 billion for Ripple’s escrowed XRP holdings alone. Such a remarkable figure would necessitate a substantial increase in Ripple’s stock price to align with this valuation.\n\nJones pointed out that leading companies such as Nvidia, Apple, and Amazon have attained trillion and billion-dollar valuations. Given Ripple’s potential and alignment with world-class enterprises, Jones reasoned that a valuation of half a trillion dollars could be within reach.\n\nThe financial expert concluded that Ripple’s stock appears to be an enticing investment prospect, potentially offering a 20-fold increase.\n\n“Where we are today, it is worth 20 times what’s on Linqto. So, it’s a great buy, a great investment. I think it can only be up from there,” she remarked.\n\nNotably, Ripple’s CEO recently gave subtle hints of the company’s forthcoming IPO, as reported by The Crypto Basic. Speculations suggest that the IPO could come up after the firm secures victory from the court against the SEC."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5zdGFyd2Fyc25ld3NuZXQuY29tLzIwMjMvMDYvcmV2aWV3LWRvY3Rvci1hcGhyYS0zMi1yaXBwbGUtZWZmZWN0LXNlbmRzLWFwaHJhLWFuZC1sdWtlLXNreXdhbGtlci1vbi1hLWZhc2NpbmF0aW5nLWplZGktYWR2ZW50dXJlLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Jun 2023 07:00:00 GMT",
        "title": "Review: 'Doctor Aphra' #32 - 'Ripple Effect' Sends Aphra and Luke Skywalker On a Fascinating Jedi Adventure - Star Wars News Net",
        "content": "The decision to team up Doctor Aphra and Luke Skywalker for the first time since the Screaming Citadel arc has potential for some fascinating adventures, and Ripple Effect does not disappoint on that front.\n\nIt turns out Aphra has a new lead that she needs Luke’s help with; a lead involving some notable characters from the prequel era that most fans will recognize immediately. Only a Jedi can gain access to the treasure at the end of her latest archaeological adventure, and Luke fits the bill perfectly.\n\nIt’s unclear how affected Aphra is by the emotional confrontations she experienced in the last issue — while the memories do seem to have sparked a desire inside her to do better, she still seems primarily motivated by money. That will surely cause friction with Luke at some point, but for now it’s nice to see her on the start of a new personal journey.\n\nThe issue ends on a great cliffhanger that invites so many exciting questions that I can’t wait to find the answers to. This arc is gonna be a good one.\n\nSpoilers ahead…\n\nThankfully Luke doesn’t spend long as Doctor Aphra’s captive. Once he wakes up, she lets him out of the trunk she’d been holding him in and offers him a caf. She offers him an opportunity to find an ancient Jedi relic that might give him an edge against Darth Vader; an edge Luke needs right now, considering his unstable connection to the Force.\n\nIt seems this arc takes place between the Star Wars series’ Kezarat Convoy arc and the current one that has Luke on a quest to build a new lightsaber, as he’s still using his faulty yellow saber and agrees to hunt down this ancient artifact pretty quickly, knowing he’s outmatched against Vader right now.\n\nNow, let’s get to the tasty part of Aphra’s proposal. She shows Luke a malfunctioning holo message from Jedi Master Shaak Ti intended for fellow Jedi Master Aayla Secura. Not all of the Togrutan Jedi’s message comes through, but enough of it is intact to understand that she wants to lock away a powerful artifact that would spell doom for all should a Sith Lord get their hands on it.\n\nWhen Luke asks her why she cares about his fight against Vader, we immediately see her flash back to the memory of Sana Starros walking away in the previous issue. It’s clear she wants to better herself so she can deserve a life with Sana, but she’s clearly not going to open up to Luke about that. Instead, she does a strange double bluff, acting like she’s pretending to care about fighting the Sith when actually she just wants to get paid, even though her own flashback betrays her. Maybe she is only in it for the money, but it seems to me it’s a mask she’s putting on out of comfort.\n\nIt appears Shaak Ti succeeded, locking the artifact away in a secret Jedi temple on the planet Sason. Aphra, Luke and R2 fly to the planet and shortly after entering the atmosphere, they are caught in a magnetic storm. After Chelli reluctantly trusts Luke’s instinct to fly further into the storm, risking irreparable damage to the Ark Angel, they find the temple located in the centre of the storm.\n\nShortly after landing, Luke reveals he’s unable to open the door to the temple. His connection to the Force comes in waves, and right now the tide is low indeed. As Aphra bemoans her luck, it gets worse when the temple summons two monstrous guardians made out of the pink crystals native to the planet, presumably summoned to attack anyone unworthy of entering the temple. Luke and R2 keep the monsters distracted while Aphra looks for a way to disable the trigger that keeps the crystals forming together.\n\nThe monster fight is pretty exciting and I definitely got a slight adrenaline rush when Chelli roared in delight as Luke’s faulty lightsaber belatedly ignited just in time to fight back. She manages to deactivate the mechanism summoning the monsters just as Luke is hit by a big Force wave, hitting the creatures with a huge Force push.\n\nLuke’s pretty exhausted by the effort involved and is about to pass out when the ground opens up beneath them and they fall down a large pit into a pool of water. Presumably the Force push was the proof the temple needed to grant them entry.\n\nThey survive the fall, only to look up and find Shaak Ti and Aayla Secura looking down on them, brandishing their lightsabers. Of course, we know that both Jedi were slain during Order 66 — Secura by clone troopers, Ti by Darth Vader himself — so clearly these aren’t the real Jedi. Most likely we’re dealing with illusions, but it’s a hell of a mic drop to end on.\n\nThis was a tense and fascinating issue of Doctor Aphra, leaving us with plenty of questions to ponder and some entertaining action sequences. Hopefully writer Alyssa Wong can keep this momentum going.\n\nRating: 8/10"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2hvc3BpdGFsaXR5LmVjb25vbWljdGltZXMuaW5kaWF0aW1lcy5jb20vbmV3cy9zcGVha2luZy1oZWFkcy90aGUtcGFuZGVtaWNzLXJpcHBsZS1lZmZlY3Qtb24taG90ZWwtbWFuYWdlbWVudC1jb2xsZWdlcy8xMDA2Njg2MDfSAYsBaHR0cHM6Ly9ob3NwaXRhbGl0eS5lY29ub21pY3RpbWVzLmluZGlhdGltZXMuY29tL2FtcC9uZXdzL3NwZWFraW5nLWhlYWRzL3RoZS1wYW5kZW1pY3MtcmlwcGxlLWVmZmVjdC1vbi1ob3RlbC1tYW5hZ2VtZW50LWNvbGxlZ2VzLzEwMDY2ODYwNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Jun 2023 07:00:00 GMT",
        "title": "The pandemic's ripple effect on hotel management colleges - ETHospitality",
        "content": "The ripple effect highlights the interconnectedness of various systems and reminds us that our actions can have broader implications beyond their immediate impact. It also emphasises the need to consider the potential consequences of our decisions and behaviours, both on an individual and societal level. Here’s a look into the repercussions and potential solutions of the impact of the pandemic on hotel management colleges.\n\n\n\nWe know the far-reaching consequences COVID-19 pandemic has had, affecting various sectors and industries worldwide including the hotel industry.\n\n\n\nIt’s important for the stakeholders to delve into the effects of decreased enrolment in hotel management courses, the resultant challenges faced by hotels, and look at the possible solutions or steps that can be taken to salvage the situation.\n\n\n\n\n\nAdvt\n\nAdvt\n\nBy ,\n\nETHospitalityWorld\n\nJoin the community of 2M+ industry professionals Subscribe to our newsletter to get latest insights & analysis. Download ETHospitalityWorld App Get Realtime updates\n\nSave your favourite articles Scan to download App\n\nTravel restrictions and the lockdown measures due to the pandemic resulted in a considerable decline in travel and tourism. The economic impact of this downturn has been staggering, leading to significant financial losses, business closures, and widespread unemployment across the globe.Hotels experienced a sharp decline in occupancy rates and revenue. As a result, many establishments were compelled to reduce their workforce. Staff members were either asked to stay at home or, in some unfortunate cases, laid off altogether. Consequently, there has been a drastic reduction in the manpower available at the lower levels of the hierarchy in hotels.The uncertainty surrounding the industry's future prospects, coupled with limited opportunities (as highlighted by some so called experts) for practical training and internships, translated into diminished interest among students to pursue careers in the hotel industry.With the restored travel and tourism, there is a growing demand for skilled professionals in hotel management. Hotels are back to the pre pandemic levels in terms of business and occupancies are great indicators of this. To provide exceptional guest experiences, efficient service, and implement stringent health and safety measures; call for a workforce that is adequately trained and equipped.To tackle the repercussions of reduced intake in hotel management colleges and the subsequent shortage of skilled professionals, certain measures can be taken:Educational institutions and hospitality organisations should establish collaborative programs to bridge the gap between academia and industry. Such partnerships can provide students with internships and practical training opportunities, enhancing their employability.Hotel management colleges and industry associations should actively promote the benefits and career prospects within the hospitality sector. Highlighting success stories, career progression paths, and showcasing the industry's resilience can inspire potential students and rekindle interest in the field.To address the shortage of skilled professionals, hotels can invest in upskilling and retraining programs for existing staff members. By offering training initiatives and career advancement opportunities, hotels can retain valuable talent and fill positions in the lower levels of the hierarchy.With the industry experts, hotel management colleges should incorporate industry-relevant curricula, host guest lectures by industry experts, and organize workshops and seminars. This will ensure that students receive updated and practical knowledge, making them industry-ready upon graduation.Government can play a crucial role in supporting the hospitality industry by providing financial incentives, reducing taxes and fees, and implementing policies that promote travel and tourism. These measures can stimulate demand and encourage hotels to hire moreThe hospitality industry has long been renowned for its dynamic nature, diverse career opportunities, and the ability to create unforgettable experiences for guests. To ensure a steady pipeline of talent and cater to the evolving needs of the industry, it is essential for colleges to adopt innovative strategies that captivate the interest of prospective students.Hotel management colleges can engage students by highlighting the multitude of career paths available within the hospitality industry. By showcasing the diverse career prospects and success stories of industry professionals, colleges can inspire students to envision a promising future in hospitality.Establishing strong partnerships with industry leaders and renowned hotel chains can significantly enhance the appeal of hotel management colleges. By bridging the gap between academia and industry, colleges can offer students practical exposure, networking opportunities, and real-world experiences, making their education more relevant and valuable.Experiential learning plays a pivotal role in preparing students for the hospitality industry. Practical experiences provide students with a feel of the vibrant and rewarding nature of hospitality careers, fostering their passion and commitment.The hospitality industry is increasingly reliant on technology and innovation to enhance guest experiences and streamline operations. Demonstrating how technology can revolutionise the guest experience and improve operational efficiency will attract students who are passionate about hospitality and innovation.With environmental sustainability and social responsibility gaining prominence globally, hotel management colleges can appeal to socially conscious students. Integrating sustainability practices and ethical considerations into the curriculum can demonstrate how the industry addresses environmental challenges and contributes to the well-being of local communities.Colleges can leverage the success and achievements of their alumni to inspire and engage prospective students. Alumni networks can be utilised to organise events, career fairs, and mentoring programs. Interaction with successful alumni can provide students with tangible examples of the transformative power of hospitality education and motivate them to pursue similar paths.The hospitality industry thrives on cultural diversity and international experiences. Hotel management graduates have the advantage to embark on global careers or go for higher education to a country of their choice.The author is founder of Indian Women in Hospitality ( IWH )."
    }
]