[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS12cy1zZWMtbmV3cy13aHktZGlkLWp1ZGdlLXRvcnJlcy1kZWxheS10aGUtbGF3c3VpdC1ydWxpbmctcHJvLXhycC1sYXd5ZXItYW5zd2Vycy_SAXdodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9yaXBwbGUtdnMtc2VjLW5ld3Mtd2h5LWRpZC1qdWRnZS10b3JyZXMtZGVsYXktdGhlLWxhd3N1aXQtcnVsaW5nLXByby14cnAtbGF3eWVyLWFuc3dlcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Ripple Vs SEC News: Why Did Judge Torres Delay the Lawsuit Ruling? Pro-XRP Lawyer Answers - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nThe ongoing legal dispute between Ripple Labs and the U.S. Securities and Exchange Commission (SEC) has captured significant attention, particularly due to the delay in the summary judgment. Shedding light on the matter, attorney and Crypto Law founder John Deaton emphasizes the need for a closer examination of the situation before jumping to conclusions.\n\nDeaton addresses the alleged unusual delay in the Ripple case, noting that it has been seven months since both Ripple and the SEC filed their Reply Briefs in December. However, he provides sufficient justification to debunk any notion of peculiar circumstances surrounding the delay.\n\nSO MANY PEOPLE CLAIMING SOMETHING IS STRANGE BECAUSE THE RIPPLE DECISION IS ALLEGEDLY TAKING UNUSUALLY LONG.\n\n\n\nHere are some FACTS to consider before putting your tinfoil hat on jumping to conclusions. — John E Deaton (@JohnEDeaton1) July 10, 2023\n\nImportantly, Deaton highlights that Ripple is not the only case pending before Judge Torres, the presiding judge in this matter. He points out that the Thor Equities case, also under Judge Torres’ jurisdiction, had its Reply Briefs filed in December and is still awaiting a ruling.\n\nPrevious Cases Under Judge Torres Experienced Similar Delays\n\nTo provide further context, Deaton presents examples of other cases that experienced substantial delays before Judge Torres. In the New York District Carpenter’s fund case, for instance, it took over eight months from the filing of the Reply Briefs to reach a summary judgment ruling.\n\nSimilarly, in the Quiller Inc. vs. U.S.A. case, it took seven months for Judge Torres to issue a decision. Additionally, the Fitzgerald case and several others took approximately six months for Judge Torres to rule.\n\nConcluding his assessment, Deaton acknowledges that while many, including himself, anticipated a ruling by now, other cases have taken an equal amount of time. He suggests that Judge Torres is likely aware of the significance of her decision.\n\nThe market and cryptocurrency enthusiasts eagerly await the summary judgment, which will ultimately determine the outcome of the Ripple Labs vs. U.S. Securities and Exchange Commission case."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vbXNtYWdhemluZS5jb20vMjAyMy8wNy8xMS9ldGhpb3BpYS1hYm9ydGlvbi1yb2Utdi13YWRlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "How the Overturning of Roe Is Causing a Ripple Effect in Ethiopia - Ms. Magazine",
        "content": "The Dobbs ruling has emboldened anti-choice groups worldwide—but it has also inspired the global community to reassert the right to choose.\n\nActivists demonstrate after a 14-year-old girl died as a result of an unsafe secret abortion in Rabat, Morocco, on Sept. 28, 2022. (Fadel Senna / AFP via Getty Images)\n\nLast month marked one year since Roe v. Wade was overturned by the U.S. Supreme Court, eliminating the constitutional right to abortion nationwide. The decision dealt a devastating blow to reproductive rights in the U.S.—but the fallout has reverberated far beyond U.S. borders.\n\nIn Ethiopia, where I am from, abortion has been legal under a broad range of circumstances for 18 years, empowering women to take control of their futures and saving countless lives. I am so proud of the steps the government in Ethiopia has taken to expand access to abortion over the last two decades. Still, since the overturning of Roe v. Wade in the U.S. last year, these gains are looking increasingly vulnerable.\n\nImmediately after the Supreme Court decision, anti-choice groups in Ethiopia began calling the government to follow America’s lead and make abortion a crime. In previous years, these groups made sure that their presence was known. They organized marches, harassed women outside clinics, and spoke out in the media and churches, not just against abortion but contraception too. They were visible and vocal.\n\nBut since the Dobbs v. Jackson Women’s Health Organization ruling that struck down Roe, their tactics have changed.\n\nOn the surface, at least, it seems like nothing is happening. But under the radar, anti-choice groups are seeding disinformation, targeting politicians, policymakers and providers.\n\nEthiopia liberalized its abortion law in 2005 on public health grounds, but today many health professionals who saw women dying from unsafe abortions have now retired, and the younger generation of providers has not had to witness the grim consequences on the same scale. With the seed of doubt around the need for abortion care planted in their minds by the anti-choice movement, some doctors and nurses in public clinics that were providing safe, legal abortion care are refusing services.\n\nA woman in Harar, Ethiopia on May 4, 2023. In the country, abortion has been largely legal for the past 18 years—but since the fall of Roe in the U.S., global anti-choice groups are feeling emboldened. (Eric Lafforgue / Art in All of Us / Corbis via Getty Images)\n\nWorking for a sexual and reproductive health organization, I have seen with my own eyes the devastating consequences of restrictive laws. Evidence shows that abortions happen whether they are legal or not. The only difference is whether they are carried out safely.\n\nBefore 2005, gynecology wards in Ethiopia were filled with women who had resorted to desperate measures to end unwanted pregnancies, from drinking bleach, to inserting sticks or broken glass. Women were left with life-long injuries, and unsafe abortion contributed to a third of all maternal deaths in the country.\n\nWith the seed of doubt around the need for abortion care planted in their minds by the anti-choice movement, some doctors and nurses in public clinics that were providing safe, legal abortion care are refusing services.\n\nThanks to the leadership of the Ethiopian government, in liberalizing the abortion law coupled with a strong focus on expanding access to abortion and contraception, these scenes have become much less common and maternal mortality has significantly reduced. But I am worried about what the future holds.\n\nWe know that Dobbs has emboldened the anti-choice and more than likely given them a cash injection. They are more sophisticated, better organized and well-funded. In response, we also need greater investment to strengthen civil society, empower them to inform decision-makers and provide ongoing support to providers.\n\nAnti-choice groups are also targeting sexual and reproductive healthcare more broadly by preventing young people from accessing vital information. We have even seen a U.S.-based anti-choice group opening an office in Addis Ababa and actively lobbying to keep comprehensive sex education off curriculums.\n\nWith a general election on the horizon in the U.S. next year, reproductive healthcare providers around the world are anxiously waiting to see who will be chosen. Suppose the U.S.’ next leader is in favor of restricting abortion access. In that case, there is likely to be a ripple effect that will further embolden anti-choice groups worldwide. There is too much at stake to allow that to happen.\n\nBut while this vote has emboldened the anti-choice movement around the world, it has also inspired the global community to reassert the right to choose. This is an autonomy issue. A public health issue. A human rights issue. To anyone who wants to deny someone’s right to decide what is right for their body and future, our message is, ‘We are not going back.’ We will never stop working towards a world where everyone, everywhere, has the right to choose.\n\nUp next:\n\nU.S. democracy is at a dangerous inflection point—from the demise of abortion rights, to a lack of pay equity and parental leave, to skyrocketing maternal mortality, and attacks on trans health. Left unchecked, these crises will lead to wider gaps in political participation and representation. For 50 years, Ms. has been forging feminist journalism—reporting, rebelling and truth-telling from the front-lines, championing the Equal Rights Amendment, and centering the stories of those most impacted. With all that’s at stake for equality, we are redoubling our commitment for the next 50 years. In turn, we need your help, Support Ms. today with a donation—any amount that is meaningful to you. For as little as $5 each month, you’ll receive the print magazine along with our e-newsletters, action alerts, and invitations to Ms. Studios events and podcasts. We are grateful for your loyalty and ferocity."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vdHViZXJ2aWxsZS1jb25maXJtYXRpb24taG9sZHMtcGVudGFnb24tYWJvcnRpb24tdHJhdmVsLXdpbGwtcmlwcGxlLXRocm91Z2gtbWlsaXRhcnktMjAyMy030gF-aHR0cHM6Ly93d3cuYnVzaW5lc3NpbnNpZGVyLmNvbS90dWJlcnZpbGxlLWNvbmZpcm1hdGlvbi1ob2xkcy1wZW50YWdvbi1hYm9ydGlvbi10cmF2ZWwtd2lsbC1yaXBwbGUtdGhyb3VnaC1taWxpdGFyeS0yMDIzLTc_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Tuberville holds over DoD abortion travel will ripple through military - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nGen. David Berger retired from the US Marine Corps on Monday after four years as its top officer and 42 years in uniform. Waiting to replacing him is Gen. Eric Smith, and he will continue waiting until one senator lifts holds on the promotions of more than 250 generals and admirals.\n\nSen. Tommy Tuberville began applying holds in February and vows to continue until the Pentagon rescinds a policy allowing troops to take leave and have their travel expenses covered for an abortion or other reproductive health services not offered by the department. Tuberville says the Biden administration is \"flouting\" legal restrictions on use of taxpayer money for abortions, though the Justice Department has deemed the policy lawful.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThe holds could affect as many as 650 officers by year's end. US officials and experts say the delay will ripple through the military, preventing leaders from taking new commands, keeping families from moving to new homes, and creating friction across the force.\n\nTuberville's hold targets uniformed military officers over a policy set by the US military's civilian leadership, diverging from the longstanding manner in which members of Congress have expressed displeasure with such policies.\n\nRelated Video\n\n\"It's perfectly appropriate for the for Congress to provide its oversight role in asking the civilian appointees — so service secretaries and other civilians in that chain of command — questions about policy, which are fundamentally part of the political system,\" Katherine Kuzminski, director of the Military, Veterans, and Society Program at the Center for a New American Security, told Insider on Monday.\n\nSergeant Major of the Marine Corps Troy Black passes the colors to Gen. David Berger at the relinquishment of command ceremony on July 10. US Marine Corps/Staff Sgt. Kelsey Dornfeld\n\n\"Uniformed military officers do not set policy. They're only responsible for carrying out policy as it's currently written, and so the hold that Tuberville has placed is kind of a gross violation of civil-military norms,\" Kuzminski said.\n\nThe hold on Smith's confirmation meant the Corps couldn't hold a change of command ceremony on Monday, instead performing a ceremony in which Berger relinquished his office.\n\n\"It's been more than a century since the US Marine Corps has operated without a Senate-confirmed commandant,\" Secretary of Defense Lloyd Austin III said during the ceremony.\n\nAdvertisement\n\n\"We have a sacred duty to do right by those who volunteer\" to serve in the military, Austin added. \"I remain confident that all Americans can come together to agree on that basic obligation to those who keep us safe. I am also confident that the United States Senate will meet its responsibilities.\"\n\nSpeaking next, Berger said, \"We need the Senate to do their job so that we can have a sitting commandant that's appointed and confirmed.\"\n\nSmith, speaking last, referred to himself as \"the individual performing the duties of the commandant\" and told the audience and Marines that \"all orders, directives, and guidance which were in effect this morning remain in effect unless I direct otherwise. Further guidance to the force will follow.\"\n\n'We will lose talent'\n\nMaj. Gen. Eric Smith receives his three-star rank insignia during a ceremony in Okinawa in August 2018. US Marine Corps/Sgt. Olivia G. Ortiz\n\nThe military has been bracing for the impact of the holds. Speaking to reporters during the Modern Day Marine conference in Washington DC on June 29, Smith outlined the limits of being an acting commandant.\n\nAdvertisement\n\n\"I'll have all the authorities of the commandant, except for a few: I can't live in the [commandant's] house, can't use the security detail, I cannot write a commandant's planning guidance,\" Smith said. \"I can give guidance to the force as the acting commandant, but it does not carry the same weight quite as commandant's planning guidance.\"\n\nSmith said he will still hold the job of assistant commandant and will have to reassign those duties, which will make it harder to maintain \"synergy\" as those responsibilities are \"parceled out to four, five, six, seven officers who also have full-time jobs, and they will then in turn have to parcel some of their things out to a colonel, who will have to parcel his stuff out or her stuff out to a lieutenant colonel.\"\n\n\"The ripple effect is actually pretty significant,\" Smith added.\n\nOther officials warned of similar effects at Senate Armed Services Committee hearings this spring.\n\nAdvertisement\n\nCavoli, then head of US Army Europe, receives the colors at a change of command ceremony in Germany in July 2019. US Army/Sgt. Benjamin Northcutt\n\n\"If I have general officers who are scheduled to retire and do so but I don't have somebody to replace them, I will suffer a gap\" in some \"fairly critical positions,\" Gen. Christopher Cavoli, head of US European Command, said at a hearing in May, referring to the general serving as US representative to NATO's Military Committee, who is set to retire this summer and is \"a vital connection\" between Cavoli and the committee.\n\nAt an April hearing, Adm. Michael Gilday, the chief of naval operations, said dozens of offices would be affected if the holds lasted through the year, including the chief of the Office of Naval Reactors and fleet commanders in the Western Pacific and the Middle East.\n\nRelated stories\n\nGilday's deputy, Adm. Lisa Franchetti, told the committee a few weeks later that the three-star officers overseeing the Navy's air, surface, and subsurface forces \"all rotate this year, and they are the ones that do the man, train, equip missions. So again, this will have the biggest impact on readiness if they are delayed.\"\n\nKuzminski told Insider that officers in acting roles right now have demonstrated good judgment over long careers and would take \"decisive action\" if needed but said \"the real challenge is that it just adds a whole bunch of friction into the decision-making process on who needs to be cleared through and what authority individuals have.\"\n\nAdvertisement\n\nA US Navy change of command ceremony in California in March 2016. US Navy/MCS2 La’Cordrick Wilson\n\nA number of officials have said the most significant impact of the holds would be on lower-ranking officers, whose career paths could be affected, and their families, who will face uncertainty about their lives.\n\n\"It is the personal development, it is the family understanding and predictability\" that will be affected, Adm. John Aquilino, head of US Indo-Pacific Command, told senators in April. \"Will it hinder our ability to continue to maintain the right people in the right jobs to be able to then potentially advance and take the next right job? Absolutely.\"\n\nAt a hearing in March, Gen. James McConville, the US Army chief of staff, said the delay \"is probably most felt in some ways on the families and the kids.\"\n\n\"Even though it looks like it is only 40 generals there are probably four or five other transitions that have to happen\" as one officer advances, McConville said. \"So what it really does is it affects the families and some of the kids. They are trying to figure out where they are going to go to school, when they are going to move, and all those things kind of come in to the readiness of the force.\"\n\nAdvertisement\n\nAir Force Secretary Frank Kendall, the service's top civilian official, and his uniformed counterpart, chief of staff Gen. Charles Brown Jr. have both warned that holds will affect the desire of troops to remain in service.\n\nGen. Charles Brown Jr., left, at a change of command ceremony in South Korea in August 2018. Senior Airman Savannah L. Waters\n\n\"One of the things that motivates our people in terms of retention or not is how they feel that their families are being treated. Things like childcare and education and healthcare are all very important factors,\" Kendall said at a hearing in May. \"When they are planning for that and it is disrupted, it has very negative impact, and it definitely impacts on retention as well.\"\n\nBrown, who is nominated to take over as chairman of the Joint Chiefs of Staff, told senators at his confirmation hearing on Tuesday that troops will look elsewhere if they see military opportunities disrupted by political issues.\n\n\"We will lose talent because of those challenges,\" Brown said when asked about the holds. \"The spouse network is alive and well, and the spouses will compare notes, and the member may want to serve but the spouses and the families get a huge vote.\"\n\nAdvertisement\n\nNot targeting officers over policies has become a norm of civil-military relations \"because they don't set the policy. They only implement the policy,\" Kuzminski told Insider, adding that current situation could \"put a really sour taste in the mouth of service members.\"\n\n'\"Just vote\" is not an answer'\n\nSen. Tommy Tuberville speaks to reporters at the US Capitol on July 10. Drew Angerer/Getty Images\n\nWhile Tuberville is not alone in objecting to the Pentagon's abortion-travel policy, his holds have been widely criticized by Democrats and others. Senate Republican Leader Mitch McConnell said in May that he didn't support Tuberville's actions. Seven former secretaries of defense sent a letter that month to Senate leaders urging them to lift the blanket hold.\n\nTuberville has argued that Pentagon policy regarding abortion-related travel expenses should be set by law. He told CNN on Monday that as the minority in the Senate, \"the only power we have is to put a hold on something, and so we thought that this would get to the attention of the secretary of defense.\"\n\nIn the CNN interview, Tuberville signaled that Brown's confirmation could move forward, saying \"we will vote on him by himself.\" Tuberville has said the Senate could do the same for other held nominations.\n\nAdvertisement\n\n\"If the Democrats are so worried about Gen. Smith being an acting official, then let's vote,\" Tuberville said on the Senate floor on Monday, after moving to block Sen. Jack Reed's request to confirm Smith by unanimous consent — the 11th time Tuberville has done so.\n\nSecretary of Defense Lloyd Austin, right, and Chairman of the Joint Chiefs of Staff Gen. Mark Milley before the Senate Armed Services Committee in September 2021. Alex Wong/Getty Images\n\nThe Senate typically uses unanimous consent to approve multiple nominations at once. Overcoming the holds would require voting on nominees individually. Speaking on the Senate floor on Monday, Reed said filing cloture on all the held nominations would take roughly five hours and that voting on them could take another 27 days if the Senate worked around the clock or 84 days if it worked eight-hour days.\n\n\"So 'just vote' is not an answer. This is not a feasible solution to this issue,\" Reed said.\n\nThere are other ways Congress could settle the policy. Kuzminski noted that both houses of Congress are working on their versions of the annual defense authorization bill and that senators were pushing to block the reimbursements, which would \"un-do\" the Pentagon's current policy, while Democrats in the House were working on enshrining the current policy into law.\n\nAdvertisement\n\n\"So one way or the other, Congress has the ability to change the law, but holding military leaders' nominations hostage is not exactly the way to go about actually changing the policy,\" Kuzminski said, echoing a sentiment shared by more than a few lawmakers.\n\n\"If the senator from Alabama continues his reckless action, he will soon be holding 650 leaders who have served their country honorably hostage,\" Sen. Elizabeth Warren said at Brown's confirmation hearing on Tuesday. \"That has effects on many more of the best and brightest who have volunteered to serve our nation.\""
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vdHViZXJ2aWxsZS1jb25maXJtYXRpb24taG9sZHMtcGVudGFnb24tYWJvcnRpb24tdHJhdmVsLXdpbGwtcmlwcGxlLXRocm91Z2gtbWlsaXRhcnktMjAyMy030gF-aHR0cHM6Ly93d3cuYnVzaW5lc3NpbnNpZGVyLmNvbS90dWJlcnZpbGxlLWNvbmZpcm1hdGlvbi1ob2xkcy1wZW50YWdvbi1hYm9ydGlvbi10cmF2ZWwtd2lsbC1yaXBwbGUtdGhyb3VnaC1taWxpdGFyeS0yMDIzLTc_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Tuberville holds over DoD abortion travel will ripple through military - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nGen. David Berger retired from the US Marine Corps on Monday after four years as its top officer and 42 years in uniform. Waiting to replacing him is Gen. Eric Smith, and he will continue waiting until one senator lifts holds on the promotions of more than 250 generals and admirals.\n\nSen. Tommy Tuberville began applying holds in February and vows to continue until the Pentagon rescinds a policy allowing troops to take leave and have their travel expenses covered for an abortion or other reproductive health services not offered by the department. Tuberville says the Biden administration is \"flouting\" legal restrictions on use of taxpayer money for abortions, though the Justice Department has deemed the policy lawful.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThe holds could affect as many as 650 officers by year's end. US officials and experts say the delay will ripple through the military, preventing leaders from taking new commands, keeping families from moving to new homes, and creating friction across the force.\n\nTuberville's hold targets uniformed military officers over a policy set by the US military's civilian leadership, diverging from the longstanding manner in which members of Congress have expressed displeasure with such policies.\n\nAdvertisement\n\n\"It's perfectly appropriate for the for Congress to provide its oversight role in asking the civilian appointees — so service secretaries and other civilians in that chain of command — questions about policy, which are fundamentally part of the political system,\" Katherine Kuzminski, director of the Military, Veterans, and Society Program at the Center for a New American Security, told Insider on Monday.\n\nSergeant Major of the Marine Corps Troy Black passes the colors to Gen. David Berger at the relinquishment of command ceremony on July 10. US Marine Corps/Staff Sgt. Kelsey Dornfeld\n\n\"Uniformed military officers do not set policy. They're only responsible for carrying out policy as it's currently written, and so the hold that Tuberville has placed is kind of a gross violation of civil-military norms,\" Kuzminski said.\n\nThe hold on Smith's confirmation meant the Corps couldn't hold a change of command ceremony on Monday, instead performing a ceremony in which Berger relinquished his office.\n\n\"It's been more than a century since the US Marine Corps has operated without a Senate-confirmed commandant,\" Secretary of Defense Lloyd Austin III said during the ceremony.\n\nAdvertisement\n\n\"We have a sacred duty to do right by those who volunteer\" to serve in the military, Austin added. \"I remain confident that all Americans can come together to agree on that basic obligation to those who keep us safe. I am also confident that the United States Senate will meet its responsibilities.\"\n\nSpeaking next, Berger said, \"We need the Senate to do their job so that we can have a sitting commandant that's appointed and confirmed.\"\n\nSmith, speaking last, referred to himself as \"the individual performing the duties of the commandant\" and told the audience and Marines that \"all orders, directives, and guidance which were in effect this morning remain in effect unless I direct otherwise. Further guidance to the force will follow.\"\n\n'We will lose talent'\n\nMaj. Gen. Eric Smith receives his three-star rank insignia during a ceremony in Okinawa in August 2018. US Marine Corps/Sgt. Olivia G. Ortiz\n\nThe military has been bracing for the impact of the holds. Speaking to reporters during the Modern Day Marine conference in Washington DC on June 29, Smith outlined the limits of being an acting commandant.\n\nAdvertisement\n\n\"I'll have all the authorities of the commandant, except for a few: I can't live in the [commandant's] house, can't use the security detail, I cannot write a commandant's planning guidance,\" Smith said. \"I can give guidance to the force as the acting commandant, but it does not carry the same weight quite as commandant's planning guidance.\"\n\nSmith said he will still hold the job of assistant commandant and will have to reassign those duties, which will make it harder to maintain \"synergy\" as those responsibilities are \"parceled out to four, five, six, seven officers who also have full-time jobs, and they will then in turn have to parcel some of their things out to a colonel, who will have to parcel his stuff out or her stuff out to a lieutenant colonel.\"\n\n\"The ripple effect is actually pretty significant,\" Smith added.\n\nOther officials warned of similar effects at Senate Armed Services Committee hearings this spring.\n\nAdvertisement\n\nCavoli, then head of US Army Europe, receives the colors at a change of command ceremony in Germany in July 2019. US Army/Sgt. Benjamin Northcutt\n\n\"If I have general officers who are scheduled to retire and do so but I don't have somebody to replace them, I will suffer a gap\" in some \"fairly critical positions,\" Gen. Christopher Cavoli, head of US European Command, said at a hearing in May, referring to the general serving as US representative to NATO's Military Committee, who is set to retire this summer and is \"a vital connection\" between Cavoli and the committee.\n\nAt an April hearing, Adm. Michael Gilday, the chief of naval operations, said dozens of offices would be affected if the holds lasted through the year, including the chief of the Office of Naval Reactors and fleet commanders in the Western Pacific and the Middle East.\n\nRelated stories\n\nGilday's deputy, Adm. Lisa Franchetti, told the committee a few weeks later that the three-star officers overseeing the Navy's air, surface, and subsurface forces \"all rotate this year, and they are the ones that do the man, train, equip missions. So again, this will have the biggest impact on readiness if they are delayed.\"\n\nKuzminski told Insider that officers in acting roles right now have demonstrated good judgment over long careers and would take \"decisive action\" if needed but said \"the real challenge is that it just adds a whole bunch of friction into the decision-making process on who needs to be cleared through and what authority individuals have.\"\n\nAdvertisement\n\nA US Navy change of command ceremony in California in March 2016. US Navy/MCS2 La’Cordrick Wilson\n\nA number of officials have said the most significant impact of the holds would be on lower-ranking officers, whose career paths could be affected, and their families, who will face uncertainty about their lives.\n\n\"It is the personal development, it is the family understanding and predictability\" that will be affected, Adm. John Aquilino, head of US Indo-Pacific Command, told senators in April. \"Will it hinder our ability to continue to maintain the right people in the right jobs to be able to then potentially advance and take the next right job? Absolutely.\"\n\nAt a hearing in March, Gen. James McConville, the US Army chief of staff, said the delay \"is probably most felt in some ways on the families and the kids.\"\n\n\"Even though it looks like it is only 40 generals there are probably four or five other transitions that have to happen\" as one officer advances, McConville said. \"So what it really does is it affects the families and some of the kids. They are trying to figure out where they are going to go to school, when they are going to move, and all those things kind of come in to the readiness of the force.\"\n\nAdvertisement\n\nAir Force Secretary Frank Kendall, the service's top civilian official, and his uniformed counterpart, chief of staff Gen. Charles Brown Jr. have both warned that holds will affect the desire of troops to remain in service.\n\nGen. Charles Brown Jr., left, at a change of command ceremony in South Korea in August 2018. Senior Airman Savannah L. Waters\n\n\"One of the things that motivates our people in terms of retention or not is how they feel that their families are being treated. Things like childcare and education and healthcare are all very important factors,\" Kendall said at a hearing in May. \"When they are planning for that and it is disrupted, it has very negative impact, and it definitely impacts on retention as well.\"\n\nBrown, who is nominated to take over as chairman of the Joint Chiefs of Staff, told senators at his confirmation hearing on Tuesday that troops will look elsewhere if they see military opportunities disrupted by political issues.\n\n\"We will lose talent because of those challenges,\" Brown said when asked about the holds. \"The spouse network is alive and well, and the spouses will compare notes, and the member may want to serve but the spouses and the families get a huge vote.\"\n\nAdvertisement\n\nNot targeting officers over policies has become a norm of civil-military relations \"because they don't set the policy. They only implement the policy,\" Kuzminski told Insider, adding that current situation could \"put a really sour taste in the mouth of service members.\"\n\n'\"Just vote\" is not an answer'\n\nSen. Tommy Tuberville speaks to reporters at the US Capitol on July 10. Drew Angerer/Getty Images\n\nWhile Tuberville is not alone in objecting to the Pentagon's abortion-travel policy, his holds have been widely criticized by Democrats and others. Senate Republican Leader Mitch McConnell said in May that he didn't support Tuberville's actions. Seven former secretaries of defense sent a letter that month to Senate leaders urging them to lift the blanket hold.\n\nTuberville has argued that Pentagon policy regarding abortion-related travel expenses should be set by law. He told CNN on Monday that as the minority in the Senate, \"the only power we have is to put a hold on something, and so we thought that this would get to the attention of the secretary of defense.\"\n\nIn the CNN interview, Tuberville signaled that Brown's confirmation could move forward, saying \"we will vote on him by himself.\" Tuberville has said the Senate could do the same for other held nominations.\n\nAdvertisement\n\n\"If the Democrats are so worried about Gen. Smith being an acting official, then let's vote,\" Tuberville said on the Senate floor on Monday, after moving to block Sen. Jack Reed's request to confirm Smith by unanimous consent — the 11th time Tuberville has done so.\n\nSecretary of Defense Lloyd Austin, right, and Chairman of the Joint Chiefs of Staff Gen. Mark Milley before the Senate Armed Services Committee in September 2021. Alex Wong/Getty Images\n\nThe Senate typically uses unanimous consent to approve multiple nominations at once. Overcoming the holds would require voting on nominees individually. Speaking on the Senate floor on Monday, Reed said filing cloture on all the held nominations would take roughly five hours and that voting on them could take another 27 days if the Senate worked around the clock or 84 days if it worked eight-hour days.\n\n\"So 'just vote' is not an answer. This is not a feasible solution to this issue,\" Reed said.\n\nThere are other ways Congress could settle the policy. Kuzminski noted that both houses of Congress are working on their versions of the annual defense authorization bill and that senators were pushing to block the reimbursements, which would \"un-do\" the Pentagon's current policy, while Democrats in the House were working on enshrining the current policy into law.\n\nAdvertisement\n\n\"So one way or the other, Congress has the ability to change the law, but holding military leaders' nominations hostage is not exactly the way to go about actually changing the policy,\" Kuzminski said, echoing a sentiment shared by more than a few lawmakers.\n\n\"If the senator from Alabama continues his reckless action, he will soon be holding 650 leaders who have served their country honorably hostage,\" Sen. Elizabeth Warren said at Brown's confirmation hearing on Tuesday. \"That has effects on many more of the best and brightest who have volunteered to serve our nation.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vdHViZXJ2aWxsZS1jb25maXJtYXRpb24taG9sZHMtcGVudGFnb24tYWJvcnRpb24tdHJhdmVsLXdpbGwtcmlwcGxlLXRocm91Z2gtbWlsaXRhcnktMjAyMy030gF-aHR0cHM6Ly93d3cuYnVzaW5lc3NpbnNpZGVyLmNvbS90dWJlcnZpbGxlLWNvbmZpcm1hdGlvbi1ob2xkcy1wZW50YWdvbi1hYm9ydGlvbi10cmF2ZWwtd2lsbC1yaXBwbGUtdGhyb3VnaC1taWxpdGFyeS0yMDIzLTc_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Tuberville holds over DoD abortion travel will ripple through military - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nGen. David Berger retired from the US Marine Corps on Monday after four years as its top officer and 42 years in uniform. Waiting to replacing him is Gen. Eric Smith, and he will continue waiting until one senator lifts holds on the promotions of more than 250 generals and admirals.\n\nSen. Tommy Tuberville began applying holds in February and vows to continue until the Pentagon rescinds a policy allowing troops to take leave and have their travel expenses covered for an abortion or other reproductive health services not offered by the department. Tuberville says the Biden administration is \"flouting\" legal restrictions on use of taxpayer money for abortions, though the Justice Department has deemed the policy lawful.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThe holds could affect as many as 650 officers by year's end. US officials and experts say the delay will ripple through the military, preventing leaders from taking new commands, keeping families from moving to new homes, and creating friction across the force.\n\nTuberville's hold targets uniformed military officers over a policy set by the US military's civilian leadership, diverging from the longstanding manner in which members of Congress have expressed displeasure with such policies.\n\nRelated Video\n\n\"It's perfectly appropriate for the for Congress to provide its oversight role in asking the civilian appointees — so service secretaries and other civilians in that chain of command — questions about policy, which are fundamentally part of the political system,\" Katherine Kuzminski, director of the Military, Veterans, and Society Program at the Center for a New American Security, told Insider on Monday.\n\nSergeant Major of the Marine Corps Troy Black passes the colors to Gen. David Berger at the relinquishment of command ceremony on July 10. US Marine Corps/Staff Sgt. Kelsey Dornfeld\n\n\"Uniformed military officers do not set policy. They're only responsible for carrying out policy as it's currently written, and so the hold that Tuberville has placed is kind of a gross violation of civil-military norms,\" Kuzminski said.\n\nThe hold on Smith's confirmation meant the Corps couldn't hold a change of command ceremony on Monday, instead performing a ceremony in which Berger relinquished his office.\n\n\"It's been more than a century since the US Marine Corps has operated without a Senate-confirmed commandant,\" Secretary of Defense Lloyd Austin III said during the ceremony.\n\nAdvertisement\n\n\"We have a sacred duty to do right by those who volunteer\" to serve in the military, Austin added. \"I remain confident that all Americans can come together to agree on that basic obligation to those who keep us safe. I am also confident that the United States Senate will meet its responsibilities.\"\n\nSpeaking next, Berger said, \"We need the Senate to do their job so that we can have a sitting commandant that's appointed and confirmed.\"\n\nSmith, speaking last, referred to himself as \"the individual performing the duties of the commandant\" and told the audience and Marines that \"all orders, directives, and guidance which were in effect this morning remain in effect unless I direct otherwise. Further guidance to the force will follow.\"\n\n'We will lose talent'\n\nMaj. Gen. Eric Smith receives his three-star rank insignia during a ceremony in Okinawa in August 2018. US Marine Corps/Sgt. Olivia G. Ortiz\n\nThe military has been bracing for the impact of the holds. Speaking to reporters during the Modern Day Marine conference in Washington DC on June 29, Smith outlined the limits of being an acting commandant.\n\nAdvertisement\n\n\"I'll have all the authorities of the commandant, except for a few: I can't live in the [commandant's] house, can't use the security detail, I cannot write a commandant's planning guidance,\" Smith said. \"I can give guidance to the force as the acting commandant, but it does not carry the same weight quite as commandant's planning guidance.\"\n\nSmith said he will still hold the job of assistant commandant and will have to reassign those duties, which will make it harder to maintain \"synergy\" as those responsibilities are \"parceled out to four, five, six, seven officers who also have full-time jobs, and they will then in turn have to parcel some of their things out to a colonel, who will have to parcel his stuff out or her stuff out to a lieutenant colonel.\"\n\n\"The ripple effect is actually pretty significant,\" Smith added.\n\nOther officials warned of similar effects at Senate Armed Services Committee hearings this spring.\n\nAdvertisement\n\nCavoli, then head of US Army Europe, receives the colors at a change of command ceremony in Germany in July 2019. US Army/Sgt. Benjamin Northcutt\n\n\"If I have general officers who are scheduled to retire and do so but I don't have somebody to replace them, I will suffer a gap\" in some \"fairly critical positions,\" Gen. Christopher Cavoli, head of US European Command, said at a hearing in May, referring to the general serving as US representative to NATO's Military Committee, who is set to retire this summer and is \"a vital connection\" between Cavoli and the committee.\n\nAt an April hearing, Adm. Michael Gilday, the chief of naval operations, said dozens of offices would be affected if the holds lasted through the year, including the chief of the Office of Naval Reactors and fleet commanders in the Western Pacific and the Middle East.\n\nRelated stories\n\nGilday's deputy, Adm. Lisa Franchetti, told the committee a few weeks later that the three-star officers overseeing the Navy's air, surface, and subsurface forces \"all rotate this year, and they are the ones that do the man, train, equip missions. So again, this will have the biggest impact on readiness if they are delayed.\"\n\nKuzminski told Insider that officers in acting roles right now have demonstrated good judgment over long careers and would take \"decisive action\" if needed but said \"the real challenge is that it just adds a whole bunch of friction into the decision-making process on who needs to be cleared through and what authority individuals have.\"\n\nAdvertisement\n\nA US Navy change of command ceremony in California in March 2016. US Navy/MCS2 La’Cordrick Wilson\n\nA number of officials have said the most significant impact of the holds would be on lower-ranking officers, whose career paths could be affected, and their families, who will face uncertainty about their lives.\n\n\"It is the personal development, it is the family understanding and predictability\" that will be affected, Adm. John Aquilino, head of US Indo-Pacific Command, told senators in April. \"Will it hinder our ability to continue to maintain the right people in the right jobs to be able to then potentially advance and take the next right job? Absolutely.\"\n\nAt a hearing in March, Gen. James McConville, the US Army chief of staff, said the delay \"is probably most felt in some ways on the families and the kids.\"\n\n\"Even though it looks like it is only 40 generals there are probably four or five other transitions that have to happen\" as one officer advances, McConville said. \"So what it really does is it affects the families and some of the kids. They are trying to figure out where they are going to go to school, when they are going to move, and all those things kind of come in to the readiness of the force.\"\n\nAdvertisement\n\nAir Force Secretary Frank Kendall, the service's top civilian official, and his uniformed counterpart, chief of staff Gen. Charles Brown Jr. have both warned that holds will affect the desire of troops to remain in service.\n\nGen. Charles Brown Jr., left, at a change of command ceremony in South Korea in August 2018. Senior Airman Savannah L. Waters\n\n\"One of the things that motivates our people in terms of retention or not is how they feel that their families are being treated. Things like childcare and education and healthcare are all very important factors,\" Kendall said at a hearing in May. \"When they are planning for that and it is disrupted, it has very negative impact, and it definitely impacts on retention as well.\"\n\nBrown, who is nominated to take over as chairman of the Joint Chiefs of Staff, told senators at his confirmation hearing on Tuesday that troops will look elsewhere if they see military opportunities disrupted by political issues.\n\n\"We will lose talent because of those challenges,\" Brown said when asked about the holds. \"The spouse network is alive and well, and the spouses will compare notes, and the member may want to serve but the spouses and the families get a huge vote.\"\n\nAdvertisement\n\nNot targeting officers over policies has become a norm of civil-military relations \"because they don't set the policy. They only implement the policy,\" Kuzminski told Insider, adding that current situation could \"put a really sour taste in the mouth of service members.\"\n\n'\"Just vote\" is not an answer'\n\nSen. Tommy Tuberville speaks to reporters at the US Capitol on July 10. Drew Angerer/Getty Images\n\nWhile Tuberville is not alone in objecting to the Pentagon's abortion-travel policy, his holds have been widely criticized by Democrats and others. Senate Republican Leader Mitch McConnell said in May that he didn't support Tuberville's actions. Seven former secretaries of defense sent a letter that month to Senate leaders urging them to lift the blanket hold.\n\nTuberville has argued that Pentagon policy regarding abortion-related travel expenses should be set by law. He told CNN on Monday that as the minority in the Senate, \"the only power we have is to put a hold on something, and so we thought that this would get to the attention of the secretary of defense.\"\n\nIn the CNN interview, Tuberville signaled that Brown's confirmation could move forward, saying \"we will vote on him by himself.\" Tuberville has said the Senate could do the same for other held nominations.\n\nAdvertisement\n\n\"If the Democrats are so worried about Gen. Smith being an acting official, then let's vote,\" Tuberville said on the Senate floor on Monday, after moving to block Sen. Jack Reed's request to confirm Smith by unanimous consent — the 11th time Tuberville has done so.\n\nSecretary of Defense Lloyd Austin, right, and Chairman of the Joint Chiefs of Staff Gen. Mark Milley before the Senate Armed Services Committee in September 2021. Alex Wong/Getty Images\n\nThe Senate typically uses unanimous consent to approve multiple nominations at once. Overcoming the holds would require voting on nominees individually. Speaking on the Senate floor on Monday, Reed said filing cloture on all the held nominations would take roughly five hours and that voting on them could take another 27 days if the Senate worked around the clock or 84 days if it worked eight-hour days.\n\n\"So 'just vote' is not an answer. This is not a feasible solution to this issue,\" Reed said.\n\nThere are other ways Congress could settle the policy. Kuzminski noted that both houses of Congress are working on their versions of the annual defense authorization bill and that senators were pushing to block the reimbursements, which would \"un-do\" the Pentagon's current policy, while Democrats in the House were working on enshrining the current policy into law.\n\nAdvertisement\n\n\"So one way or the other, Congress has the ability to change the law, but holding military leaders' nominations hostage is not exactly the way to go about actually changing the policy,\" Kuzminski said, echoing a sentiment shared by more than a few lawmakers.\n\n\"If the senator from Alabama continues his reckless action, he will soon be holding 650 leaders who have served their country honorably hostage,\" Sen. Elizabeth Warren said at Brown's confirmation hearing on Tuesday. \"That has effects on many more of the best and brightest who have volunteered to serve our nation.\""
    }
]