[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdS50b2RheS9yaXBwbGUtc2Vuc2F0aW9uYWxseS1yZWJyYW5kcy1vZGwtc2VydmljZS1kZXRhaWxz0gFFaHR0cHM6Ly91LnRvZGF5L3JpcHBsZS1zZW5zYXRpb25hbGx5LXJlYnJhbmRzLW9kbC1zZXJ2aWNlLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ripple Sensationally Rebrands ODL Service: Details - U.Today",
        "content": "Advertisement\n\nSome activists of XRP Ledger and Ripple communities noticed that Ripple removed the section about on-demand liquidity (ODL), a RippleNet product for seamless and low-cost cross-border remittances. A Ripple Inc. officer sheds light on what has happened to ODL and who can continue using it.\n\nFarewell to ODL? Ripple's VP Yoshikawa makes things clear\n\nU.S. crypto decacorn Ripple decided to cease using the term ODL as it might be \"difficult to understand at first glance for outsiders.\" As such, a decision was made to \"consolidate\" ODL services under the term \"Ripple Payments.\" This statement was made by Ripple's Vice President Emi Yoshikawa yesterday, Sept. 15, 2023.\n\nYoshikawa addresses questions of Ripple community members who noticed that the firm deleted mentions of ODL from its official communication channels.\n\nDespite such a surprising \"rebranding,\" ODL mechanisms will work as usual, VP Yoshikawa added. She also opined that removing crypto-specific characteristics of services should be considered a \"trend\" now:\n\nThis is a trend in the transition from crypto-like jargon to more mainstream\n\nAs covered by U.Today previously, RippleNet's ODL is a cross-border payment solution that leverages the XRP cryptocurrency as a bridge asset. ODL \"money corridors\" are used by customers and institutions as a secure, fast and low-cost method of cross-border remittances.\n\nLatin America and Asia Pacific are two regions crucial for Ripple's ODL strategy. In 2019-2021, ODL was also integrated into the services of MoneyGram, one of the largest global payment systems.\n\nRipple's partners accelerate expansion to new regions\n\nA network of Ripple partners across the globe also use XRP-based ODL for their remittance channels. In 2023, more corridors were opened by SBI, Tranglo and other Ripple counterparties.\n\nFor some of the partners, using RippleNet's ODL marked the first step of their cryptocurrency journey. For instance, Ripple's long-term strategic partner Novatti Group publicly released its 1:1 fiat-backed stablecoin, AUDD. XRP Ledger was chosen as the technical basis for the new stablecoin project.\n\nAustralian Digital Dollar by Novatti Group is designed to offer a reliable on-chain stablecoin solution for the Australian market.\n\nThe XRP price is attempting to stay above the crucial level of $0.5 on major spot exchanges."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDkvMTYvZ29vZ2xlLWJhcmQtYWktcHJlZGljdHMtd2hlbi14cnAtY2FuLXJlY2xhaW0tMy04NC1hbGwtdGltZS1oaWdoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Google Bard AI Predicts When XRP Can Reclaim $3.84 All-Time High - The Crypto Basic",
        "content": "Google Bard AI predicts XRP could hit the previous $3.84 ATH, citing increasing adoption, novel use cases, and a potential resolution of the SEC lawsuit.\n\nAfter multiple weeks of bearish performance, XRP has reclaimed the $0.5 price mark. Given that XRP’s trading volume has stayed consistently above half a billion dollars in months, the asset could be gearing for a significant rally, as experts have projected.\n\nAs The Crypto Basic reported, many prominent market analysts have argued that XRP’s value cannot remain below a dollar. While they largely see XRP’s new all-time high (ATH) in double-digit value, an unusual master in price prediction has shared perspectives about XRP’s path.\n\n- Advertisement -\n\nWen $3.84?\n\nIn particular, Google-powered AI service Google Bard has weighed in on XRP reaching its previous ATH of $3.84. It first underscored that accurate price prediction for digital assets remains a complex puzzle, given the market’s volatility.\n\nRegardless, Google Bard cited that XRP could revisit its historic peak, possibly around 2025 or 2026. Additionally, it highlighted several factors underpin the optimistic outlook.\n\nAccording to Google Bard, businesses and consumers’ increasing adoption of XRP will play a pivotal role in reclaiming $3.84. This view implies that XRP’s value will appreciate in response to the expanding utility.\n\nSecondly, the AI service mentioned the development of novel use cases for XRP, particularly in areas such as cross-border payments and microtransactions. The third point it cited involves a potential resolution of the protracted legal dispute between Ripple and the US Securities and Exchange Commission (SEC).\n\n- Advertisement -\n\nAs The Crypto Basic reported, market experts agree that a settlement outcome in the lawsuit will boost XRP. They believe the ensuing rally will be similar to the one witnessed in July after the court pronouncement.\n\nMoreover, Google Bard stated that the SEC’s lawsuit has cast a long shadow over the XRP market for several years. Therefore, a resolution would be a pivotal turning point towards $3.84.\n\nMeanwhile, it highlighted certain factors that could impede the growth to $3.84. It cited the overall bearish trend in the market, regulation, and the emergence of competitor cryptocurrencies. Ultimately, Google Bard believes a $3.84 is possible in the bull seasons of 2025 or 2026."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDkvMTYvcmlwcGxlLWN0by1zYXlzLXhycC1iaXRjb2luLWFyZS1vbmx5LWRpZ2l0YWwtYXNzZXRzLXdpdGgtcmVndWxhdG9yeS1jbGFyaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ripple CTO Says XRP & Bitcoin Are Only Digital Assets With Regulatory Clarity - The Crypto Basic",
        "content": "Ripple’s CTO David Schwartz highlights the significance of the SEC v. Ripple ruling, saying XRP and Bitcoin are the only digital assets with regulatory clarity.\n\nDavid Schwartz, the Chief Technology Officer (CTO) at Ripple, has highlighted the significance of Judge Analisa Torres’ decision in the SEC lawsuit.\n\nRecall that Judge Torres released the highly-anticipated summary judgment for the SEC v. Ripple lawsuit on July 14. Notably, the ruling saw each party secure a partial victory.\n\n- Advertisement -\n\nWhile the court ruled that Ripple’s sale of XRP to institutional investors violated securities law, she found that the company’s programmatic sales and other distributions of the coin are not investment contracts. Furthermore, Judge Torres also declared that XRP in and of itself is not a security.\n\nXRP & BTC Are Only Digital Assets With Regulatory Clarity\n\nAlthough Schwartz has previously commented on the ruling, he recently took out time to weigh in on the significance of the ruling for XRP.\n\nDuring his recent keynote address at the Apex event in Amsterdam, Schwartz said that other than Bitcoin, XRP is now the only digital asset with regulatory clarity in the United States.\n\nNotably, the SEC has always stated that Bitcoin is out of its regulatory purview. The commission has made this known in statements issued by its chair, Gary Gensler.\n\n- Advertisement -\n\nPer the SEC, Bitcoin is a non-security due to its decentralized nature. Moreover, BTC holders do not expect to make gains by relying on the efforts of Bitcoin developers.\n\nCourt Gives XRP Clarity\n\nWhile Gensler has openly stated that Bitcoin is out of the SEC’s purview, the regulator has refused to provide regulatory clarity for other crypto assets.\n\nFor Ripple, the SEC lawsuit has always been about getting clarity for XRP. Interestingly, Ripple achieved its desire after Judge Torres declared XRP as a non-security.\n\nSEC Lawsuit – A Dark Time For Ripple\n\nIt is worth noting that the SEC v. Ripple’s legal battle has lasted nearly three years. Consequently, the company said it has already spent over $100 million in legal fees defending the SEC’s case.\n\nPer Schwartz, the two-and-a-half-year legal battle was a dark time for Ripple.\n\n“That was an incredibly difficult two and a half years that was a kind of a little bit of a dark time for us,” he said.\n\nAside from the funds spent defending the case, multiple US-based businesses, including Mastercard, ended their partnership with Ripple.\n\nAdditionally, top-tier exchanges in the United States, including Coinbase and Kraken, were prompted to delist XRP. With XRP receiving clarity, these exchanges have now relisted the coin.\n\nRipple CTO Shares Other XRPL-Related Updates\n\nMeanwhile, Schwartz commented on other interesting upgrades that aim to propel the growth of the XRP Ledger (XRPL).\n\nSome of the upgrades Schwartz mentioned include the introduction of Automated Market Maker (AMM) and Decentralized Identity solutions to the leading blockchain.\n\nHe also mentioned that Ripple will play a significant role in improving XRPL’s overall performance and scalability."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS1zdG9ja3Mtb3IteHJwLXdoZXJlLXNob3VsZC1pbnZlc3RvcnMtcGxhY2UtdGhlaXItYmV0cy_SAVxodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9yaXBwbGUtc3RvY2tzLW9yLXhycC13aGVyZS1zaG91bGQtaW52ZXN0b3JzLXBsYWNlLXRoZWlyLWJldHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ripple Stocks or $XRP: Where Should Investors Place Their Bets? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights Ripple is a technology company that develops blockchain solutions, while XRP is a digital asset that runs on the XRP Ledger (XRPL).\n\nRipple is a more traditional investment option, while XRP has the potential for decentralized innovation and exponential growth.\n\nThe decision of whether to invest in Ripple or XRP depends on your investment goals and risk tolerance.\n\nAs an investor, where would you invest? Ripple, the technology company, or its digital currency, XRP?\n\nPanos, the author of “Understanding Crypto Economy,” has taken to Twitter to give his opinion on the inherent value of each and the scalability of the XRP Ledger (XRPL). His insights come at a crucial time when the crypto industry is undergoing rapid changes and attracting mainstream investors.\n\nIs Ripple the Safer Bet?\n\nAccording to Panos, if you are a believer in Ripple’s business model and its longevity as a tech company, Ripple’s stock might be the safer bet. The company has been a pioneer in blockchain solutions aimed at enhancing cross-border payments. Furthermore, Ripple is backed by strategic partnerships and strong financials, suggesting a steady trajectory for growth.\n\n“Ripple is a safer bet and will probably have a steady growth,” says Panos.\n\n@Ripple stock or $XRP?\n\n🔸If you believe more in Ripple and their business model then go for Ripple's stock.\n\n🔹If you believe more in XRP/XRPL, which is a universal digital asset used for multiple use cases and a tech that anyone can use and build upon, go for XRP. — Panos 🔼{X} (@panosmek) September 15, 2023\n\nRead More: Ripple’s Fight Against SEC Saved 60+ Altcoins From “Security” Label; Here’s How\n\nBut XRP Could Be the High-Return Gamble You Need…\n\nOn the other hand, Panos believes that XRP holds greater potential for returns due to its broader applicability. XRP is not just another cryptocurrency; it is a digital asset that has multiple use cases, including speeding up transactions and reducing costs in the banking sector. Moreover, XRP runs on the XRP Ledger (XRPL), an open-source blockchain protocol. This means that unlike Ripple, where the value is tied to one company, XRP’s value can theoretically grow exponentially as more developers build upon XRPL.\n\n“It’s where potentially thousands of companies will build upon with millions of users,” Panos elaborates.\n\nOn top of that, XRP is the only digital asset that has regulatory clarity in the U.S. after bitcoin.\n\nAlso Read: Ripple’s Strategic Vision for XRP: Global Liquidity Tool in the Making\n\nScalability is Key\n\nBill Morgan underscores the scalability of the XRPL by pointing out that, “Only Ripple can add value to Ripple shares. Unlimited developers can build on the XRPL and add value to XRP.”\n\nOnly Ripple can add value to Ripple shares. Unlimited developers can build on the XRPL and add value to XRP. https://t.co/wU02vbmlHB — bill morgan (@Belisarius2020) September 15, 2023\n\nThis touches on an important aspect: the decentralized nature of XRPL allows for a democratized contribution to its value, offering perhaps a more dynamic potential for growth compared to Ripple’s corporate structure.\n\nThe Investor’s Dilemma\n\nFor those who seem confused between Ripple and XRP as investment choices, Panos suggests considering what you believe in more: Is it Ripple’s business model or the technological versatility of XRPL? Your investment decision should align with your faith in one over the other.\n\nThe debate between investing in Ripple or XRP exposes the complex dynamics of the cryptocurrency market. Ripple represents a more traditional, albeit technologically innovative, investment option. On the other hand, XRP holds the allure of decentralized innovation and exponential growth.\n\nSo, Which one are you investing in? Why?"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vdGhld2Vlay5jb20vZGlnZXN0L3JvdW5kLXVwLzEwLXRoaW5ncy15b3UtbmVlZC10by1rbm93LXRvZGF5LXNlcHRlbWJlci0xNi0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "10 things you need to know today: September 16, 2023 - The Week",
        "content": "1. Ripple effects seen throughout auto industry as UAW strikes\n\nRipple effects began to be seen across the auto industry Friday as the United Auto Workers launched a strike against the major American car manufacturers. UAW is now striking against Stellantis, General Motors and Ford, marking the first time in history that the major auto union has walked out on all three at the same time. As workers walked out on Friday, they were met with cheers at auto plants in Michigan, Missouri and Ohio. Despite the strike likely causing a shortage of vehicles and auto supplies, UAW President Shawn Fain stressed that their actions were \"not going to wreck the economy. The truth is we are going to wreck the billionaire economy.\" CNN, The New York Times\n\n2. Lee expected to bring flooding and storm winds to New England\n\nTropical Cyclone Lee is expected to bring hurricane-like weather to New England and parts of Atlantic Canada starting this weekend. The storm, which has been downgraded from a Category 1 hurricane, has calmed prior to slamming the East Coast. However, experts predict that Lee will still present a high risk of flash flooding, particularly in Maine and portions of the northernmost coast of New England. Rainfall in these areas is expected to be significant, and high wind speeds of up to 60 mph are also likely to play a factor, the National Weather Service (NWS) said in a forecast prediction. People across the region are being urged to stay indoors. CBS News, Newsweek\n\n3. Florida GOP drops loyalty pledge for 2024 in win for Trump\n\nFlorida's GOP Party said Friday that it would no longer require candidates to sign a loyalty pledge backing the party's eventual nominee, a victory for former President Donald Trump over the state's own governor. Officials in the party removed a provision requiring candidates for president seeking to be on the state's primary ballot to support the eventual nominee. Trump has previously lambasted the pledge, saying that he will not sign a bill of support for any other nominee. As a result, the decision to back off the pledge appears to show the Florida GOP moving in Trump's favor, as opposed to his chief rival, Gov. Ron DeSantis (R). The pair have been at odds with each other over the pledge for months. Politico, The Hill\n\nSubscribe to The Week Escape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives. SUBSCRIBE & SAVE Sign up for The Week's Free Newsletters From our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox. From our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox. Sign up\n\n4. Kim Jong Un inspects weaponry as trip to Russia continues\n\nNorth Korean leader Kim Jong Un inspected a variety of Russian weaponry on Saturday, according to state media, as he continued his trip to the country's eastern reaches. Russian media said that Kim was shown a series of nuclear-capable bombers, in addition to other warplanes and a warship from Russia's Pacific fleet. Kim was shown around military facilities by Russian Defense Minister Sergei Shoigu, who had previously visited the North Korean leader in Pyongyang. Kim's is part of an effort by North Korea and Russia to strengthen their ties and potentially provide the latter with shells to use against Ukraine. Kim also met days ago with Russian President Vladimir Putin to discuss this proliferation. The Associated Press, The New York Times\n\n5. Trio acquitted in plot to kidnap Michigan Gov. Gretchen Whitmer\n\nThree men were found not guilty Friday of attempting to kidnap Michigan Gov. Gretchen Whitmer (D) in 2020. William Null, Michael Null and Eric Molitor were acquitted on charges of providing support for a terrorist act and weapons charges. The three had been accused of heightening a plot by right-wing militia in Michigan to kidnap Whitmer, after they were angered by her lockdowns implemented during the Covid-19 pandemic. The trio were the last of 14 men to be charged in the plot, of whom nine were convicted. This includes the head co-conspirators, Adam Fox and Barry Croft Jr., who were sentenced last year to 16 years and 19 years in prison, respectively. The Guardian\n\n6. New Mexico governor narrows gun ban after political and judicial backlash\n\nNew Mexico Gov. Michelle Lujan Grisham (D) scaled back her previously implemented ban on carrying firearms in public on Friday after a judge blocked its enforcement. Grisham announced that the amended ban would only prohibit open and concealed carry in public parks or playgrounds. The governor had previously announced a ban, based on a public health order, that would've prevented open and concealed carry throughout Bernalillo County and its county seat, Albuquerque. However, even before a judge found this order to be too wide in scope, Grisham faced backlash politically, including from some in her own party. New Mexico's Democratic attorney general, Raul Torrez, said he wouldn't defend the state in ban-related lawsuits. Albuquerque Journal, ABC News\n\n7. Officials drop Maui wildfire death toll to 97 following DNA analysis\n\nHawaiian officials said Friday that they had amended the number of deaths from last month's wildfire in Maui to 97. It was previously believed that 115 people had died in the inferno, which almost completely destroyed the historic city of Lahaina. After additional rounds of DNA testing, though, Maui Police officials said that only 97 had died, and that the higher number had been due to multiple DNA samples belonging to the same victims. The number of people who remained missing was also amended from 41 to 31. However, Hawaii Gov. Josh Green (D) confirmed that more deaths were still possible as investigations into the missing persons cases continue. USA Today, NBC News\n\n8. Wagner Group declared terrorist organization by UK\n\nRussia's mercenary Wagner Group was officially designated a terrorist organization by the United Kingdom on Friday. The designation formally bans the group throughout the U.K., and also allows Britons who aid the group to face prison sentences of up to 14 years. British officials said last week they had planned to make this designation, with the country's home secretary, Suella Braverman, calling the Wagner Group a \"threat to global security,\" adding that they were \"terrorists, plain and simple.\" The designation comes just weeks after the head of the Wagner Group, Yevgeny Prigozhin, died in a plane crash that many assume may have been perpetrated by Russian President Vladimir Putin. BBC News\n\n9. Lauren Boebert apologizes after being kicked out of play for disruptive behavior\n\nRep. Lauren Boebert (R-Colo.) apologized Friday after she was kicked out of a Denver musical for being disruptive during the performance. In a statement released by her campaign, Boebert said she was \"truly sorry.\" A city incident report wrote that Boebert was \"vaping, singing, [and] causing a disturbance\" during a performance of the musical \"Beetlejuice,\" and security camera footage shows her being escorted out of the theater. Boebert reportedly threatened theater staff during the altercation, the city's report said. The congresswoman's statement added, \"None of my actions or words as a private citizen that night were intended to be malicious or meant to cause harm, the reality is they did and I regret that.\" The Washington Post, NBC News\n\n10. Ashton Kutcher resigns as chair of anti-child abuse group after Masterson letter\n\nActor Ashton Kutcher resigned Friday as chairman of the board of Thorn, a self-founded anti-child abuse organization. Kutcher's wife, Mila Kunis, is also stepping down from her role on the board. The couple's decision comes following a wave of backlash after they wrote letters of support for Danny Masterson, who was recently sentenced to 30 years to life in prison for the rape of two women. The couple had starred alongside Masterson on \"That 70's Show,\" and had defended him during his criminal trial. In a statement, Kutcher apologized to victims of abuse and said he \"cannot allow my error in judgment to distract from our efforts and the children we serve.\" Time"
    }
]