[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5yZWNvcmQtZWFnbGUuY29tL25ld3MvZ28vcmlwcGxlLWVmZmVjdC1kb2N1bWVudGFyeS1oaWdobGlnaHRzLWdpcmxzLWZseS1maXNoaW5nLXRyaXAtdG8taXNsYW5kcy9hcnRpY2xlXzFlYTQwOTY4LTdhNjEtMTFlZS05OWYxLTdmMTRlMmZkODQ5ZS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Ripple effect: Documentary highlights girls fly-fishing trip to islands - Traverse City Record Eagle",
        "content": "Close Get email notifications on {{subject}} daily!\n\nYour notification has been saved.\n\nThere was a problem saving your notification.\n\n{{description}}\n\nEmail notifications are only sent once a day, and only if there are new matching items."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZXMtbGVnYWwtdmljdG9yeS1pbi10aGUteHJwLWNhc2UtY2FsbGVkLWlkaW90aWMtYnktZmluYW5jaWFsLWpvdXJuYWxpc3QtY2hhcmxlcy1nYXNwYXJpbm8v0gF-aHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvcmlwcGxlcy1sZWdhbC12aWN0b3J5LWluLXRoZS14cnAtY2FzZS1jYWxsZWQtaWRpb3RpYy1ieS1maW5hbmNpYWwtam91cm5hbGlzdC1jaGFybGVzLWdhc3Bhcmluby9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Ripple’s Legal Victory in the XRP Case Called “Idiotic” by Financial Journalist Charles Gasparino - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nIn a recent Twitter exchange between prominent lawyer Bill Morgan and financial journalist Charles Gasparino, Morgan expressed his displeasure with Gasparino’s comments regarding the legal status of XRP, the digital asset associated with the blockchain company Ripple.\n\nRipple’s “Win” a Joke, SEC Will Appeal, Says Charles Gasparino\n\nCharles Gasparino, a senior correspondent at the Fox Business Network, expressed his opinion on Twitter that Ripple did not win in the ongoing lawsuit with the Securities and Exchange Commission (SEC).\n\nInstead, he stated that XRP holders, particularly retail investors, “won” for the time being due to Judge Sarah Netburn’s decision to deny the SEC’s motion to strike Ripple’s fair notice defense. Gasparino called the ruling “idiotic” and “the laugh of the southern district.” This indicates that Gasparino believes the ruling was poorly reasoned and may not hold up in future legal proceedings.\n\nBill Morgan Slams Charles Gasparino Over XRP Tweet\n\nBill Morgan responded to a critical comment made by Charles Gasparino. Gasparino had claimed that the decision was a “split” and that it was not a “good result” for Ripple. However, Morgan strongly disagreed with Gasparino’s assessment, stating that “there is no lawyer who thinks it was not a good result for Ripple.” Morgan further explained that the judge in the case, Analisa Torres, distinguished the XRP token from the underlying scheme, transaction, or contract and found that it was not a security.\n\nBased on the Twitter exchange between Bill Morgan and Charles Gasparino, it can be concluded that there is a difference in opinion regarding the legal status of XRP in the ongoing lawsuit between Ripple and the Securities and Exchange Commission (SEC). This exchange highlights the ongoing debate and uncertainty surrounding the classification of digital assets as securities under U.S. law."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbmdhcGUuY29tL3JpcHBsZS1jbG8tc3R1YXJ0LWFsZGVyb3R5LWNyaXRpY2l6ZXMtc2Vjcy1sZWdhbC1mYWlsdXJlcy_SAVNodHRwczovL2NvaW5nYXBlLmNvbS9yaXBwbGUtY2xvLXN0dWFydC1hbGRlcm90eS1jcml0aWNpemVzLXNlY3MtbGVnYWwtZmFpbHVyZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Ripple CLO Stuart Alderoty Criticizes SEC’s Legal Failures - CoinGape",
        "content": "Stuart Alderoty, Ripple’s Chief Legal Officer, once again criticized the Securities and Exchange Commission (SEC) and its chairman, Gary Gensler. Alderoty’s recent statements focus on the SEC’s string of legal losses and the disapproval it has faced from federal judges. This includes a notable case involving Ripple, where the court’s decision largely overturned the SEC’s stance on XRP, a digital asset.\n\nRipple Triumphs in SEC Lawsuit Ruling\n\nThe SEC’s approach has been questioned by Ripple’s defense and federal judges overseeing these high-profile cases. Judge Analisa Torres, in particular, has criticized the SEC’s inconsistent arguments in the Ripple lawsuit. In a significant development, the court ruled that XRP is not a security and that most of Ripple’s transactions complied with the law. This decision marks a crucial victory for XRP against the SEC’s longstanding accusation of securities law violations.\n\nadvertisement\n\nAdditionally, the SEC has faced setbacks in other cases beyond Ripple. The commission’s defeat in its case against Grayscale Investments over a Bitcoin ETF application is a case in point. Here, the SEC was condemned for its arbitrary regulatory methods.\n\nMore recently, the SEC lost its case against Aaron Govil in the Second Circuit, which could influence the remedies phase of the SEC v. XRP lawsuit. Legal experts believe this ruling, emphasizing penalties for victims with actual economic losses, might affect the ongoing XRP case, particularly in its remedies phase.\n\nAnalysts Predict Reduction in XRP Fine\n\nAs the Ripple case progresses, the SEC is expected to demand a substantial fine of $770 million, equivalent to the amount Ripple raised through institutional sales of XRP. Legal analysts like John Deaton and Jeremy Hogan speculate that XRP might reduce this sum by excluding non-U.S. sales and accounting for legitimate business expenses. This lawsuit phase is set to complete all remedies-related discoveries by February 2024, setting the stage for the next significant chapter in this legal saga.\n\nRead Also: Montenegro Court Upheld Verdict Against Terra Co-Founder Do Kwon"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvcmlwcGxlLXhycC1tYXJrZXQtY2FwLWNvdWxkLXJlYWNoLTUwYi1pbi1ub3ZlbWJlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Ripple (XRP) Market Cap Could Reach $50B in November - Watcher Guru",
        "content": "With positive sentiment abounding, Ripple and its native XRP token could see their market cap reach $50 billion in November. Indeed, the projection is feasible considering the influx of transactions and whale activity that have taken place. Moreover, the events of the last several months could coincide with a continued upward trajectory.\n\nRipple has seen its court conflict with the US Securities and Exchange Commission (SEC) near a resolution. Subsequently, its victory in the non-security distinction of XRP has driven the asset price. Additionally, announcements made at the Swell Conference 2023 are expected to continue growth.\n\nSubsequently, the overall market cap could have a massive surge in store, but just how high could it go?\n\nAlso Read: Ripple (XRP) Mid-November Price Prediction 2023\n\nRipple XRP Market Cap Set to Continue Upward Trend?\n\nOver the last several months, Ripple has enjoyed a tremendous positive turn. Specifically, its two-year-long legal conflict with the SEC had reached a tipping point. Subsequently, Ripple emerged victorious regarding one of its most important questions. Now, these developments could be set to catapult the overall value of the company and its native token to new heights.\n\nYet, could Ripple (XRP) see its market cap reach $50 billion in November? The figure would be a landmark milestone and would represent a massive turn of fortune for the asset. So, just what could be pointing to such a start turning upward? Well, much of that lies in the current trajectory that the figure has shown over the last month.\n\nAlso Read: Ripple (XRP) Could Reach $10, But When?\n\nOver the last 30 days, Ripple’s market cap has seen a 45% surge due to the performance and relevance of the DeFi project. Moreover, the rally that has catapulted that figure is connected to whale activity and a massive boost in trading volumes. Subsequently, its dominance within the community narrative has contributed to its breakout.\n\nIf that trend were to continue, the asset would be well on its way to surpassing the $50 billion mark for its overall market cap. Subsequently, this rise could be connected to the positive perception that the digital asset industry has seen and could continue to see as 2023 comes to a close.\n\nMany have predicted the approval of a Spot Bitcoin ETF coming before 2024. Indeed, that would have massive ramifications for the industry as a whole. Moreover, a company and coin already on the upswing would benefit exponentially from a total market rally. Additionally, its announcements regarding advancements in its cross-border payment offerings give it a unique edge. One that could pay off hugely as it seeks room to climb in November."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LndydHYuY29tL25ld3MvbG9jYWwtbmV3cy9icm9hZC1yaXBwbGUtYnVzaW5lc3Nlcy1hc2stZm9yLWNpdHlzLWFzc2lzdGFuY2UtYWZ0ZXItY29uc3RydWN0aW9uLWRlbGF5cy1odXJ0LXByb2ZpdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Broad Ripple businesses ask for city's assistance after construction delays hurt profits - WRTV Indianapolis",
        "content": "INDIANAPOLIS — Businesses in Broad Ripple are asking the city for help as on-going construction has taken longer than local businesses were told it would last.\n\nChelsey Wetzel, owner of Union Jack, says her business has lost “into six figures” due to the construction.\n\n“There have been months that have been as much as 70% down. It’s unbelievable really,” Wetzel said.\n\nWRTV\n\nWRTV\n\nRoad construction signs and detours through local neighborhoods have become a long-term problem.\n\nIt was supposed to be a short-term solution to improving the infrastructure on Broad Ripple Avenue and alleviate sewer and flooding issues.\n\nWRTV\n\n“We prepared to have some business hit but we were going to have a better street after. We were willing and able to do that,” Wetzel said. “When you are planning for 150 to 200 days, because that’s what you are told, but then it hits 580 days, there is no way to plan for that as a business.”\n\nBusinesses aren’t the only collateral damage.\n\nResidents of neighborhoods near Broad Ripple Avenue say more people are driving through the area and not obeying the speed limit, although there are flashing signs with posted speed limits.\n\nWRTV\n\n“Living off of Winthrop, we’ve gone from being a side street to a major thoroughfare,” Broad Ripple resident Thomas Peterson said. “The same people that don’t know how to do roundabouts, don’t know how to do side streets either. It’s been dangerous and time consuming to get through the intersections.”\n\nOriginally, the department of Public Works said the construction on Broad Ripple Avenue would be done by the end of summer 2022.\n\nBroad Ripple Avenue reopened to traffic in Sept. 2023, but now the east portion of the street is closed.\n\nWRTV\n\nDPW wouldn’t grant an on camera interview with WRTV. They sent us the following statement:\n\nIndy DPW is days away from completing the most disruptive traffic elements in the Broad Ripple Avenue Improvements project. When finalized, long-running issues related to flooding will be resolved, along with safer pedestrian facilities and beautification initiatives. The investment of more than $8 million into the neighborhood's infrastructure promises to be a boon for residents and business owners for decades to come.\n\nWRTV\n\nRegardless of what the city says, business owners say it will take a while for them to bounce back from this.\n\n“Some sort of compensation for the over run here and the extra impact we have taken on would be helpful,” Wetzel said. “If that’s not possible, I would love to see recovery effort for the village as a whole.”\n\nWRTV\n\nIn a follow-up correspondent with DPW, WRTV was told the project was delayed due to utility issues in both 2022 and 2023.\n\nThe closures that are currently taking place allow for the creation of the Broad Ripple Riverwalk – a 2-foot-wide multi-use path connecting from the Monon Trail to Primrose Avenue.\n\nDPW says with good weather, all major road work could be done by Nov. 18. The department says there will still be some minor work following that, including pavement markings, bike rack installations and tree plantings.\n\nFor more information, click here."
    }
]