[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmRlbnZlcnBvc3QuY29tLzIwMjMvMDMvMTMvY29sb3JhZG8tc3VtbWVyLWNhbXBpbmctcmVzZXJ2YXRpb25zLWZvcmVzdC1zZXJ2aWNlLWRpc3BlcnNlZC1jYW1waW5nL9IBcGh0dHBzOi8vd3d3LmRlbnZlcnBvc3QuY29tLzIwMjMvMDMvMTMvY29sb3JhZG8tc3VtbWVyLWNhbXBpbmctcmVzZXJ2YXRpb25zLWZvcmVzdC1zZXJ2aWNlLWRpc3BlcnNlZC1jYW1waW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Campground closure at Rocky Mountain National Park could have ripple effect across Colorado forests - The Denver Post",
        "content": "Click to share on Facebook (Opens in new window)"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnVzYXRvZGF5LmNvbS9zdG9yeS9ncmFwaGljcy8yMDIzLzAzLzEzL3NpbGljb24tdmFsbGV5LWJhbmstcmlwcGxlLWVmZmVjdC1iYW5rcy8xMTQ2MzE1OTAwMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Ripple effect: How Silicon Valley Bank collapse is affecting other US banks - USA TODAY",
        "content": "The collapse of Silicon Valley Bank, the second-largest bank failure in U.S. history, has created a ripple effect across the American financial industry.\n\nSVB was taken over by the Federal Deposit Insurance Corporation on Friday after depositors, fearing the bank would soon become unable to pay its debts, began withdrawing money at an alarming rate.\n\nHow it all went down: Silicon Valley Bank collapse explained in graphics\n\nA second entity, Signature Bank in New York, closed Sunday after its customers began withdrawing cash. State regulators said they took over the bank to stabilize financial systems.\n\nFederal regulators said depositors from both banks will get all their money. The Federal Reserve, the Treasury Department and the FDIC said regulators took the unusual step of guaranteeing the deposits because SVB presented a systemic risk to the U.S. financial system.\n\nWall Street ceased trades of several regional banks, however, when share values rapidly declined in early trading Monday.\n\nHow fast did SVB values fall?\n\nShares of First Republic Bank were stopped after falling 65% in morning trading.\n\nOutside the U.S., Japan’s benchmark Nikkei 225 slipped about 1.2% in morning trading. Australia’s S&P/ASX 200 shed 0.6% to 7,104.30.\n\nEuropean markets also closed lower, with the pan-European Stoxx 600 index down 2.34%.\n\nHow do Silicon Valley, Signature Bank failures compare?\n\nSVB, Signature are among largest US banks\n\nVisual explainer: How SVB came tumbling down, step by step\n\nUSA TODAY reports: Biden says taxpayers won't have to bail out banks\n\nCloser look: Regulators put SVB up for auction\n\nAnalysis: Fears of more banks collapsing\n\n________\n\nSOURCE USA TODAY Network reporting and research; The Associated Press; Federal Reserve; Federal Deposit Insurance Corporation"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiywFodHRwczovL2t0dmwuY29tL25ld3MvcmlwcGxlLWVmZmVjdC9yaXBwbGUtZWZmZWN0LW1lZGZvcmQtc2Nob29scy1pbXBsZW1lbnQtbmFyY2FuLWtpdHMtYWNyb3NzLWNhbXB1c2VzLXN1YnN0YWJjZS1vdmVyZG9zZS1mZW50YW55bC1kcnVnLW9waW9pZC1lcGlkZW1pYy1qYWNrc29uLWNvdW50eS1zYWZldHktc2VjdXJpdHktZWR1Y2F0aW9uLWNsYXNzcm9vbdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Ripple Effect: Medford schools implement Narcan kits across campuses - KTVL",
        "content": "As to opioid harm reduction, Medford School District is highlighting its proactive approach to overdose deaths across all its campuses.\n\nAccording to the Medford School District, the district began installing multiple Opioid Emergency Kits in its schools last summer and now every campus has at least one kit installed.\n\n“It’s always tragic to have an overdose but it’s also a different degree of tragic when you don’t know that you’re potentially even taking this drug,” said Ron Havniear, Executive Director of Safety and Security at MSD. “We wanted to make sure that Narcan, also known as ”\n\nNaloxone is a drug that rapidly reverses an opioid overdose and in many cases is administered through a nasal spray, like Narcan which is what Medford School District has on hand.\n\n\n\nAccording to the , Naloxone is considered a “safe medicine” meaning it only takes effect on someone who has opioids in their system. Havniear says because it’s safe, someone can administer the drug even if they aren’t entirely sure a student or faculty member is experiencing an overdose.\n\nSigns of an opioid overdose include unconsciousness, small pupils, shallow breathing, vomiting, faint heartbeat, pale skin, limp limbs, and purple lips and fingernails.\n\nHavniear says the district implementing Opioid Emergency Kits in its schools isn’t a result of overdoses in school on what the schools have seen happening in the community.\n\n“Our kids live in this community and we have that they’re exposed to and obviously that stuff spills over into our schools,” Havniear said.\n\nHe says they try their best to sweep every campus before school starts, specifically in places like the parking lots and playgrounds in the event dangerous pills get dropped or left behind.\n\nMedford School District began last summer which includes principals, assistant principals, office staff, and security. That’s in addition to the district nurses and school resource officers who are already trained in life-saving measures.\n\nAccording to the district, these are the steps that should be taken if a student or teacher sees someone overdosing:\n\nCall 911\n\nLocate an Opioid emergency Kit and staff member (both are located together)\n\nTake the nasal spray, insert it into either nostril, and depress the plunger\n\nIn the event the person experiences another overdose within the next few minutes, administer another dose of naloxone\n\n“We want to have this stuff be close enough on campus so we’re not waiting longer than a couple minutes to get it,” Havniear said.\n\nMedford School District now gets all its Narcan through the Oregon Health Authority. According to Havniear, they initially tried through the OHA and hospitals but it was easily available so they then acquired doses through a nonprofit organization.\n\nNow, thanks to greater access to harm-reduction services, OHA can provide public entities like schools with naloxone. Havniear says all they have to do is submit a form to OHA, specify which campuses they need the kits on and OHA will deliver the overdose-reversing drug."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8xMjMxOTkvc2lsaWNvbi12YWxsZXktYmFuay1jcnlwdG8tY29tcGFuaWVzLWNvbnRhZ2lvbtIBTmh0dHBzOi8vZGVjcnlwdC5jby8xMjMxOTkvc2lsaWNvbi12YWxsZXktYmFuay1jcnlwdG8tY29tcGFuaWVzLWNvbnRhZ2lvbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Silicon Valley Bank Contagion: Crypto Companies Affected Include BlockFi, Circle, Avalanche, Ripple - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs the fallout from the stunning collapse of Silicon Valley Bank (SVB) plays out, numerous crypto companies have signaled their exposure to the bank, which long maintained a reputation as one of the most prominent lenders to tech startups in the world.\n\nThe bank’s closure Friday by the California Department of Financial Protection marked the second-largest bank failure in American history, after the undoing of Washington Mutual during the financial crisis of 2008. Silicon Valley Bank reported $212 billion in assets last quarter.\n\nThe stock (SIVB) began spiraling late Wednesday after rumors circulated that the institution was seeking an acquisition after failing to raise sufficient capital to cover its obligations. In the hours and days that followed, numerous venture capital funds reportedly advised their clients to withdraw their funds, resulting in $42 billion of withdrawals initiated on Thursday, constituting a run on the bank. On Friday morning, the Nasdaq halted trading of SIVB shares.\n\nThough it was venture capital firms and tech startups that were most severely affected by the SVB scare on Friday, numerous crypto companies have also disclosed their exposure to the bank. Here’s a running list of the crypto firms caught in the crosshairs of SVB's collapse, along with those that have publicly claimed they avoided the damage.\n\nAD\n\nAD\n\nNote: On Sunday, U.S. Federal Reserve Chairman Jerome Powell, Treasury Secretary Janet Yellen, and Federal Deposit Insurance Corporation (FDIC) Chairman Martin Gruenberg issued a joint statement saying that all Silicon Valley Bank depositors would be made whole and have access to their funds on Monday, March 13. The Federal Reserve is now investigating the bank's failure.\n\nCrypto companies that had money in SVB\n\nRipple\n\nOn Sunday night, Ripple CEO Brad Garlinghouse tweeted that Ripple \"had some exposure to SVB—it was a banking partner, and had some of our cash balance.\"\n\nDespite this, Garlinghouse asserted that Ripple expects \"no disruption to our day-to-day business\" and that the company \"remains in a strong financial position.\"\n\nSetting the record straight on SVB Qs: Ripple had some exposure to SVB – it was a banking partner, and held some of our cash balance. Fortunately, we expect NO disruption to our day-to-day business, and already held a majority of our USD w/ a broader network of bank partners. — Brad Garlinghouse (@bgarlinghouse) March 12, 2023\n\nAD\n\nAD\n\nBlockFi\n\nFailed crypto lender BlockFi, which filed for bankruptcy in November in the wake of FTX's collapse, has $227 million in funds held at SVB, according to documents filed Friday related to BlockFi's bankruptcy proceedings. Those funds are reportedly not insured by the Federal Deposit Insurance Commission (FDIC) as they are in a money market mutual fund, which itself may constitute a violation of bankruptcy law.\n\nBlockFi first halted withdrawals just days after the implosion of crypto exchange FTX. The lender had previously been bailed out by FTX with a revolving $250 million line of credit, last June.\n\nPer new bankruptcy filing, BlockFi has $227m in Silicon Valley Bank. The bankruptcy trustee warned them on Mon that bc those funds are in a money market mutual fund, they’re not FDIC secured — which could be a prblm w/ keeping in compliance of bankruptcy law pic.twitter.com/hnpo8anrrS — Lauren Hirsch (@LaurenSHirsch) March 10, 2023\n\nCircle\n\nCircle, issuer of the world's second-largest stablecoin USDC, announced on Friday that some undisclosed portion of the cash reserves used to back USDC and tie its value to the US dollar were held at Silicon Valley Bank.\n\nThe company said in a statement Friday that SVB was one of six banks relied on to manage USDC's cash reserves, but claims USDC will be able to continue operating normally.\n\nSilicon Valley Bank is one of six banking partners Circle uses for managing the ~25% portion of USDC reserves held in cash. While we await clarity on how the FDIC receivership of SVB will impact its depositors, Circle & USDC continue to operate normally.https://t.co/NU82jnajjY — Circle (@circle) March 10, 2023\n\nStablecoins like USDC are cryptocurrencies backed by and pegged to the value of real-world assets. They are meant to serve as a sturdy intermediary between traditional finance and more volatile crypto markets; USDC, with a market capitalization of $42.17 billion, is the second-most used stablecoin in the world. 25% of the assets backing USDC, which purports to be fully collateralized, are cash, according to Circle.\n\nLast week, Circle cut ties with collapsed crypto-friendly bank Silvergate, which shut down on Wednesday. Circle had also used Silvergate to hold cash reserves until that point.\n\nAD\n\nAD\n\nPantera\n\nCrypto-focused venture capital firm Pantera may have an unknown amount of exposure to SVB's collapse. As recently as last month, the firm counted the failed bank among just three custodians of its private funds, according to a February 3 SEC filing.\n\nPantera counts among the largest crypto-focused VC firms in the world; last year alone it raised $1.3 billion for a fund exclusively focused on blockchain-based projects.\n\nAvalanche\n\nThe Avalanche Foundation, which supports the Avalanche blockchain, announced Friday evening that it has \"a little over\" $1.6 million in exposure to Silicon Valley Bank.\n\nAvalanche's native token AVAX, currently boasts a market capitalization of $4.84 billion.\n\nIn light of recent news, we would like to confirm that the Avalanche Foundation has no exposure to Silvergate and a little over $1.6mm of exposure to Silicon Valley Bank. Avalanche Foundation is saddened by the news about SI and SIVB, and hope that all depositors are made whole. — Avalanche 🔺 (@avalancheavax) March 10, 2023\n\nYuga Labs\n\nYuga Labs, the $4 billion company behind dominant NFT collection Bored Ape Yacht Club (among other projects), is exposed to SVB. Yuga co-founder Greg Solano said Friday that the company has \"super limited exposure\" to the failed bank, though Yuga has not yet confirmed exactly how much.\n\nSolano said the amount \"doesn't impact our business or plans in any way.\"\n\nBREAKING NEWS » @yugalabs Co-Founder @CryptoGarga Said that Yuga Labs Had “Super Limited” Financial Exposure To The @SVB_Financial Fallout. pic.twitter.com/RXxBkyPOwX — The Bored Ape Gazette🍌 (@BoredApeGazette) March 10, 2023\n\nAD\n\nAD\n\nProof\n\nProof, another leader in NFTs, may have been hit harder. The Web3 project created by Digg co-founder Kevin Rose, which is behind leading NFT collection Moonbirds, issued a statement Friday confirming the company holds cash as Silicon Valley Bank.\n\n\"Proof holds cash at SVB, however... We've thankfully diversified our assets across ETH, stablecoins, as well as fiat,\" the company Tweeted Friday.\n\nProof has not yet disclosed what amount of cash it has tied up with SVB. While the company conceded that SVB's collapse \"sucks,\" it also insisted the potential loss wouldn't affect the security of customer's assets, or Proof's roadmap.\n\n2/5: In the spirit of transparency, here’s everything we know about the situation with SVB: Proof holds cash at SVB, however…\n\nWe’ve thankfully diversified our assets across ETH, stablecoins, as well as fiat—so financially and operationally, we’re going to be OK. — PROOF (🥃,🦉) (@proof_xyz) March 10, 2023\n\nNova Labs\n\nNova Labs, the startup behind decentralized network and internet provider Helium, disclosed exposure to SVB late Friday.\n\n\"Nova Labs has some $ stuck in SVB, but the vast majority is in other institutions, Nova Labs CEO and Helium co-founder Amir Haleem said.\n\nincredible that (3,3) really was the right strategy@novalabs_ has some $ stuck in SVB, but the vast majority is in other institutions I feel terrible for all the other founders and startups who were not so fortunate. hoping for a speedy resolution 🙏🏽 — amir 🎈 (@amirhaleem) March 11, 2023\n\nDapper Labs\n\nDapper Labs, the company behind NBA Top Shot NFTs, said it had “minimal cash balances” with Silicon Valley Bank, and has not been “materially impacted” by the bank’s failure as a result. But \"minimal\" impact is still something.\n\nAD\n\nAD\n\n🚨 Announcement from Dapper community Discord: \"Dapper Labs is not materially impacted by the situation involving SVB. We had minimal cash balances with SVB.\" pic.twitter.com/nW2bG0gjo7 — Flowverse 🌊 - Discover Flow Blockchain (@flowverse_) March 12, 2023\n\nCrypto companies claiming no exposure to SVB\n\nNumerous crypto companies have also rushed to declare their lack of exposure to Silicon Valley Bank, in attempts to stave any potential additional panic.\n\nPaxos\n\nThe crypto brokerage firm Paxos said it had “no relationship” with Silicon Valley Bank, adding its stablecoins have zero exposure to the bank’s failure. The market capitalization of Paxos’s Binance-branded stablecoin BUSD is $8.4 billion and $840 million for its Pax Dollar stablecoin, according to CoinGecko.\n\nStatement from Paxos: Paxos has no relationship with Silicon Valley Bank. For further certainty, Paxos stablecoins have zero exposure to Silicon Valley Bank failure. — Paxos (@PaxosGlobal) March 10, 2023\n\nCrypto.com\n\nKris Marszalek, CEO of cryptocurrency exchange Crypto.com, said the company has no exposure to Silicon Valley Bank as well as Silvergate, a crypto-friendly bank that announced it would voluntarily wind down operations last week.\n\nhttps://t.co/pFc4Pz8PQj has $0 exposure to Silvergate and SVB. — Kris | Crypto.com (@kris) March 11, 2023\n\nBinance\n\nThe CEO of leading cryptocurrency exchange Binance Changpeng Zhao said the firm “does not have any exposure to” the collapse of Silicon Valley Bank. Invoking the crypto term that’s become a familiar phrase since it was first used in 2018, Zhao said funds “are #SAFU.”\n\n#Binance does not have exposure to SVB. Funds are #SAFU. — CZ 🔶 Binance (@cz_binance) March 10, 2023\n\nAD\n\nAD\n\nKraken\n\nJesse Powell, co-founder and CEO of cryptocurrency exchange Kraken, said the company has no exposure to Silicon Valley Bank. His comment was made in response to a user who asked for clarification about the systematic risk posed by the bank’s failure on Twitter.\n\nWe have no exposure to SVB. — Jesse Powell (@jespow) March 11, 2023\n\nTether\n\nTether, the company behind the world's largest stablecoin, USDT, announced Friday that it had no exposure to SVB's collapse. USDT has a market capitalization of $72.38 billion.\n\n#tether doesn't have any exposure to SVB — Paolo Ardoino 🍐 (@paoloardoino) March 10, 2023\n\nSolana\n\nAnatoly Yakovenko, co-founder of the Solana blockchain, claimed that neither Solana Labs nor the Solana Foundation had any exposure to SVB.\n\nNeither labs or foundation banked at svb. Dodged another bullet. — toly 🇺🇸 (@aeyakovenko) March 10, 2023\n\nPolygon\n\nRyan Wyatt, president of Polygon Labs, the company behind Ethereum scaling solution Polygon, similarly announced that no Polygon-affiliated companies or foundations had any exposure to SVB.\n\nSad day for a lot of companies who are going through the collapse of SVB, and my heart goes out to all these startups exposed to this. I am grateful that we had no relationship with SVB, and have escaped these bank failures unscathed. — Ryan Wyatt 💜 (@Fwiz) March 11, 2023\n\nAD\n\nAD\n\nImmutable\n\nImmutable, the Web3 game publisher and firm behind Ethereum scaling network Immutable X, had no SVB exposure, per a tweet from co-founder Robbie Ferguson. \"We have more than A$280M in the bank (predominantly in USD), and do not use financial leverage,\" he said on Thursday night, ahead of the bank's announced demise.\n\nA quick update: @immutable has no exposure to Silvergate or SVB. We have more than A$280M in the bank (predominantly in USD), and do not use financial leverage. Stay safe out there - and keep building. The infrastructure we build today will form the basis of digital property… https://t.co/B5hPTtgncP — Robbie Ferguson 🅧 | Immutable (@0xferg) March 10, 2023\n\nGala Games\n\nWeb3 gaming and entertainment startup Gala Games did not have any exposure to Silicon Valley Bank, according to Jason Brink, the firm's president of blockchain, in a tweet reply to Decrypt reporter Kate Irwin.\n\nHappy to note that we, at @GoGalaGames, do not have exposure to SVB. — Jason Brink aka BitBender (@BitBenderBrink) March 11, 2023\n\nOther companies that announced no exposure to SVB on Friday include Blur, the emergent NFT marketplace, Ledn, the crypto lending platform, crypto wallet Phantom, and DeLabs, the company behind top NFT collections DeGods and Y00ts.\n\nThis article was last updated Monday, March 13, 2023 at 5:05 p.m. EST."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNubi5jb20vMjAyMy8wMy8xMy9taWRkbGVlYXN0L3NhdWRpLWlyYW4tcmVnaW9uYWwtaW1wYWN0LW1pbWUtaW50bC9pbmRleC5odG1s0gFSaHR0cHM6Ly9hbXAuY25uLmNvbS9jbm4vMjAyMy8wMy8xMy9taWRkbGVlYXN0L3NhdWRpLWlyYW4tcmVnaW9uYWwtaW1wYWN0LW1pbWUtaW50bA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "A Saudi-Iran reconciliation may ripple across the region. Here’s why - CNN",
        "content": "Editor’s Note: A version of this story first appeared in CNN’s Meanwhile in the Middle East newsletter, a three-times-a-week look inside the region’s biggest stories. Sign up here.\n\nAbu Dhabi and Jerusalem CNN —\n\nSaudi Arabia and Iran have given each other just two months to prove they are serious about Friday’s surprise agreement to normalize ties.\n\nBefore ambassadors are reinstated, the two nations are likely to be discussing ways to end almost seven years of hostility, a large task given how far-reaching the implications could be.\n\nThe reconciliation happens as Iran finds itself increasingly isolated on the world stage and Saudi Arabia changes the course of its foreign policy in favor of diplomacy instead of confrontation.\n\nWith a focus on economic development, Saudi Arabia and its neighbor, the United Arab Emirates, have in recent years moved to mend fences with most of their regional adversaries.\n\nRiyadh has walked back from a hawkish foreign policy it had adopted when Crown Prince Mohammed bin Salman entered the picture after his father King Salman took the throne in 2015. It has reconciled with Turkey, re-engaged with Syria, and supported a ceasefire in Yemen.\n\nBut it had left the most difficult of the dossiers, and perhaps the most important of all, till the end. It surprised the world last week when it announced a deal to normalize ties with Iran after years of talks that appeared to have borne no fruit.\n\nThe Iran-Saudi cold war has had an impact on almost every conflict in the region. Its resolution therefore could have equally strong repercussions. Here’s what the ripple effects may be:\n\nYemen\n\nYemen has been one of the countries most affected by Riyadh and Tehran’s spat. The two nations supported opposing factions in the 2014 Yemen civil war, and in 2015, a Saudi-led coalition intervened to fight the Iran-backed Houthi rebels that had overrun the country.\n\nThe Yemen war was likely the priority on the agenda for both countries, said Firas Maksad, senior fellow at the Middle East Institute in Washington, DC and adjunct professor at George Washington University.\n\nThe country has witnessed relative calm following an April UN-brokered truce. That truce expired in October but appears to be holding anyway and Saudi Arabia has been engaged in direct talks with the Houthis.\n\nIn a Saturday statement, the Iranian mission to the United Nations said the reconciliation “would accelerate the ceasefire, help start a national dialogue, and form an inclusive national government in Yemen,” Iran’s state news agency IRNA reported.\n\nHussein Ibish, a senior resident scholar at the Arab Gulf States Institute in Washington, DC, told CNN that Iran may use its leverage against the Houthis to push for a resolution to the war.\n\n“It’s very likely that Tehran had to commit to pressuring its allies in Yemen to be more forthcoming on ending the conflict in that country, but we don’t know yet what behind-the-scenes understandings have been reached,” he said.\n\nA member of the Houthis’ political wing, Abdulwahab al-Mahbashi, told Lebanon’s al-Mayadeen TV that a resolution to the Yemen conflict must be achieved through direct negotiations with Riyadh as the Houthis are not “subordinate” to the Iranians, Al Arabiya reported Sunday.\n\nLebanon\n\nLebanon has been suffering a crippling financial crisis. Its once-closest Arab ally and benefactor Saudi Arabia largely disengaged from it following a years-long spat prompted by Iran-backed Hezbollah’s clout in the country.\n\nRelations hit their lowest in 2021, when Saudi Arabia and some of its Gulf Arab allies withdrew ambassadors from Beirut following the then-Lebanese information minister’s earlier criticism of the Saudi-led coalition’s war in Yemen.\n\nEnvoys later returned, but Saudi-Lebanese ties are still frosty.\n\nBoth Hezbollah and the Lebanese caretaker Prime Minister Najib Mikati praised the Saudi-Iran deal, with Mikati calling it an “opportunity to breathe in the region, and look to the future.”\n\nAnalysts, however, say that doesn’t mean that Lebanon’s relations with Riyadh will improve automatically.\n\nSaudi Foreign Minister Prince Faisal bin Farhan on Friday said that Lebanon needed “Lebanese rapprochement” for the situation in Lebanon to improve, not “Saudi-Iranian rapprochement,” Al Arabiya reported.\n\nThe deflective answer suggests that Saudi Arabia may be separating its grievances with Lebanon from its conflict with Iran.\n\n“Lebanon is not high on the priority of policy-makers in Riyadh,” said Firas Maksad.\n\n“There are much more consequential files in Riyadh to be concerned about before addressing the challenges in Lebanon,” he told CNN, adding that Lebanon is currently more important to the Iranians than it is to the Saudis, and that unless that changes, Hezbollah “in its current form” is likely to remain “the dominant player in Lebanon.”\n\nIsrael\n\nThe reconciliation has also made its way to Israel’s domestic political debate.\n\nHours before the deal was announced, Israeli Prime Minister Benjamin Netanyahu was in Italy, extolling one of his major goals: Normalization with Saudi Arabia.\n\nFor Israel, peace with Saudi Arabia is seen as the apex of normalization agreements. Even though behind-the-scenes relations have been ongoing for years, full-blown peace would be a major achievement, and one of the key elements in forming a regional alliance to counter Iran.\n\nThen reality hit later on Friday that Israel’s longtime and foremost foe, and Netanyahu’s would-be next best friend, were reconciling. And the blame game began in the Israeli political establishment.\n\nIsraeli newspaper Haaretz cited an unidentified “senior political source in Rome” as blaming the former government, led by Naftali Bennett and Yair Lapid for the reconciliation.\n\nIn turn, former prime ministers Lapid and Bennett said Netanyahu has been neglecting the situation in the broader Middle East, focusing instead on his government’s efforts to enact a controversial judicial overhaul.\n\nLapid tweeted that blaming him for the deterioration of the relationship with Saudi Arabia was “delusional,” saying that while he and Bennett were in power, Riyadh signed an aviation agreement with Israel, direct flights for the Hajj were arranged and a security agreement related to islands in the Red Sea was signed with Egypt and Saudi Arabia.\n\n“All this came to a screeching halt when the most extreme government in the country’s history was established here and it became clear to the Saudis that Netanyahu was weak and the Americans stopped listening to him,” Lapid tweeted.\n\n“The countries of the world and the region are watching Israel in conflict with a dysfunctional government that is engaged in systematic self-destruction,” Bennett tweeted on his own thread.\n\nNetanyahu did not mention the deal in remarks ahead of the weekly Israeli Cabinet meeting on Sunday, and the Israeli Ministry of Foreign Affairs said it had no comment on the development.\n\nIraq\n\nIraq, which hosted several rounds of talks between Iran and Saudi Arabia, was quick to welcome the reconciliation. Analysts say it’s in Baghdad’s interest for the reconciliation to go through as the country had become an arena for Iranian-Saudi rivalry since the fall of the Saddam Hussein regime in 2003.\n\n“Iran has used Iraq to add pressure to Saudi Arabia in all areas, including political, economic and specifically security pressure,” said Ihsan Al-Shammari, a politics professor at Baghdad University and head of the Iraqi Centre for Political Thought.\n\nIraq, he said, missed out on improving ties with Saudi Arabia and potentially large investments in the country due to Iran’s heavy influence in the country.\n\nIran-aligned parties have long held influence in Iraqi politics and have at times caused political deadlock that has culminated in violence.\n\nAl-Shammari said Saudi Arabia would want Iran to rein in some of its allies in Iraq, especially armed paramilitary groups that it sees as a security threat. He added however that that may be a pipe dream as Iran sees Iraq as a vassal state and that its allies in parliament will want to preserve their Tehran-aligned interests.\n\nThe Iranian foreign ministry didn’t respond to CNN’s request for comment.\n\nMedia wars\n\nSaudi Arabia and Iran have for years been engaged in a bitter media war, where news outlets allegedly backed by each government have been accused of inciting against the other.\n\nIran’s state-backed Arabic language news channel Al Alam and English language Press TV regularly run programming critical of Saudi Arabia and are blocked in much of the Arab world. Saudi Arabia in turn is accused by Iran of funding Iran International, a Farsi language news channel that regularly interviews Tehran’s adversaries and covers protests against the government. Iran has labeled the channel a “terrorist organization.” Iran International has denied connections to the Saudi government. Saudi Arabia also owns the Farsi franchise of the British newspaper The Independent.\n\nHow the media war plays out will demonstrate the viability of the Iran-Saudi agreement to normalize relations. Analysts have said Saudi Arabia has invested in Persian-language media outlets to build leverage over Iran in talks after over a decade of an Iranian media assault against Saudi Arabia. The Wall Street Journal reported on Sunday that Saudi Arabia has agreed to tone down critical coverage of the Islamic Republic by Iran International, citing unidentified officials from both countries. Last month, Iran International said it was relocating its operations to Washington, DC from London due to “the Islamic Republic’s threats.”\n\nThe digest\n\nPolls show Erdogan lags opposition by more than 10 points ahead of May vote\n\nPolls show the Turkish opposition’s presidential candidate, Kemal Kilicdaroglu, leading President Tayyip Erdogan by more than 10 percentage points ahead of elections on May 14 seen by many as the most consequential vote in Turkey’s recent history, Reuters reported. The polls also show the opposition bloc leading the parliamentary race, at least six points ahead of Erdogan’s AK Party (AKP) and its allies.\n\nBackground: Erdogan faces the biggest challenge to his 20-year rule after the erosion of his popularity during a cost-of-living crisis. Victims of last month’s earthquake are also reconsidering their loyalty in previous AKP strongholds.\n\nWhy it matters: The elections will decide not just who leads Turkey but how it is governed, where its economy is headed and what role it may play in easing conflict in Ukraine and the Middle East.\n\nIran says it pardoned 22,000 protesters\n\nIranian judicial authorities have pardoned 22,000 people who took part in anti-government protests, judiciary chief Gholamhossein Mohseni Ejei said on Monday, the official IRNA news agency reported. “So far 82,000 people have been pardoned, including 22,000 people who participated in (the) protests,” Ejei said. He did not specify over what period the pardons were granted or if or when the people had been charged.\n\nBackground: Iran has been swept by protests since the death of a young Iranian woman Mahsa Amini in the custody of the country’s morality police last September. Iranians from all walks of life have taken part, marking one of the boldest challenges to the Islamic Republic since the 1979 revolution.\n\nWhy it matters: State media reported early last month that Supreme Leader Ali Khamenei had pardoned “tens of thousands” of prisoners including some arrested in the protests in a deadly crackdown on dissent, but didn’t specify how many.\n\nSaudi crown prince launches new airline\n\nSaudi Arabia’s Crown Prince Mohammed bin Salman (MBS) announced the launch of Riyadh Air, a new carrier owned by his $600 billion Public Investment Fund (PIF), the Saudi state news agency SPA reported Sunday. The airline is expected to bring up to $20 billion in non-oil revenue and create more than 200,000 jobs, it said.\n\nBackground: Saudi Arabia’s Gulf Arab neighbors already operate some of the biggest airlines, including the UAE’s Etihad and Emirates, Doha’s Qatar Airways and Ankara’s Turkish Airlines. Riyadh Air aims to connect passengers “to over 100 destinations around the world” by 2030, said SPA, and will be chaired by PIF’s governor with British business tycoon Tony Douglas as its CEO. Saudi Arabia has been in advanced negotiations to order almost 40 A350 jets from Airbus, Reuters reported.\n\nWhy it matters: Saudi Arabia has been playing catchup with its Gulf Arab neighbors who for years have spent on tourism, entertainment and aviation. The oil-rich kingdom has been on a quest to diversify its sources of revenue beyond oil and gas and refashion its image into a more global and liberal international player.\n\nWhat to watch\n\nA city that was once reduced to rubble is now reviving its most prized cultural treasures. I spoke to the woman behind that effort, @UNESCO Director-General @AAzoulay who has just returned from Mosul. pic.twitter.com/7Zj6IZCSgF — Becky Anderson (@BeckyCNN) March 10, 2023\n\nDirector General of UNESCO Audrey Azoulay speaks to CNN’s Becky Anderson about recent efforts to revive the most cherished sites of Mosul, an Iraqi city that was destroyed during the battle with ISIS. Mosul was seized by ISIS in 2014 and later liberated in a violent battle in 2017.\n\n“The country in general, but Mosul in particular, was completely destroyed, and especially the Old City, by the occupation, by the consequences of the occupation, by ISIS,” said Azoulay, who is working alongside UAE experts on a reconstruction project in Mosul.\n\nWatch the report here.\n\nAround the region\n\nVideo Ad Feedback Dubai's burgeoning hip-hop scene 02:55 - Source: CNN\n\nThink of the UAE and you might not immediately think of hip-hop, but in recent years, Dubai has become home to a small and dedicated group of artists who rap in Arabic about local culture.\n\nPerhaps the biggest star is Mustafa Ismail, better known as “Freek,” a Somali rapper who was born and raised in the UAE. He has toured countries including the UK and performed at shows that featured the likes of Future, Gucci Mane, and Wu-Tang Clan.\n\n“There’s a culture here,” said Ismail. “There’s a story to tell, and people like me that grew up here want to hear a story of a kid that grew up in UAE, or Dubai. This is what hip-hop is all about.”\n\nAlmost nine in 10 people in Dubai are not citizens of the UAE, many of whom have been born and raised in the Gulf city. Its burgeoning hip hop scene tells the story of the city’s diversity.\n\nIsmail created a unique sound by performing drill rap in Arabic, a genre for which he is one of the most recognized artists in the region. His lyrics are a mix of accents and cultural references that reflect Dubai’s diverse demographic makeup.\n\n“I didn’t really think it’s going to get that big, to be honest, until my friend told me you’re trending on Twitter,” said Ismail. “It was my first, kind of, viral video. This is what gives you another push. So, it’s amazing.”\n\nOther artists are also making an impact on the local scene.\n\nChristopher Esho is the creator of RAPDXB, a new platform that curates playlists, releases interviews and brings artists together to make music. He says there is a culture and history of rap music in Dubai, but adds that the city lacks a hub for the genre.\n\n“There haven’t been record labels, there haven’t been communities, there haven’t been concerts that are celebrating this talent,” he says. “It’s just been a local buzz that’s been giving the artists exposure.”\n\nRAPDXB recently released its first album, featuring a number of the UAE’s leading rappers. “The goal is uniting the culture and cultivating the community,” says Esho.\n\nSuch projects, as well as music festivals and local record labels, have been giving the local hip-hop scene a much-needed platform, and artists say they’re just beginning.\n\n“The hip-hop scene in Dubai is growing. If you see the hip-hop scene in Dubai 10 years ago and now, it’s a huge difference. It is even going to get crazier,” said Ismail.\n\nBy Yara Enany\n\nPhoto of the day"
    }
]