[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5pbmR5c3Rhci5jb20vc3RvcnkvbmV3cy9sb2NhbC8yMDIzLzA2LzI4L2Jyb2FkLXJpcHBsZS1zaG9vdGluZy1iYXJzLXNldC1lYXJsaWVyLWNsb3NpbmctdGltZS1hZnRlci0zLWtpbGxlZC83MDM2NjE3MjAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Broad Ripple bars set earlier closing time after weekend shooting that left 3 dead - IndyStar",
        "content": "Indianapolis Star\n\nLate-night businesses in Broad Ripple will shut down early until further notice after a shooting in the area killed three people Sunday.\n\nThe business owners met Wednesday and unanimously agreed to close their doors at 1 a.m., which is two hours early for many.\n\nMany of the businesses also plan to discontinue day parties and use of promoters to host events.\n\n“The intent is to help law enforcement in the area by eliminating any overbearing entertainment atmosphere that often attracts guests to the Village, many with no intention of patronizing the open establishments,” a press release from the Broad Ripple Village Association reads.\n\nMore:Broad Ripple Village seeks gun-free zone designation for weekends after deadly shooting\n\nShortly after 2 a.m. Sunday, police reported finding four people in their early to mid-20s with gunshot wounds in the 800 block of Broad Ripple Avenue near Guilford Avenue. A man and woman were pronounced dead at the scene, and another man and woman were taken to hospitals in serious condition. The other man died at the hospital, police announced Sunday evening.\n\nThe three people killed were identified as 24-year-old Tywain Henning, 22-year-old Kaleyia Preer and 22-year-old Christopher Lee Wilson Jr.\n\nThe day after the shooting, Broad Ripple Village Association leadership announced they were requesting a gun-free zone for Friday and Saturday nights through Aug. 31. The exact details of the Broad Ripple gun-free enforcement, which would begin next weekend if the permit is approved, are yet to be announced.\n\n“This community-led shift cannot and will not be the only security change made in Broad Ripple Village and these Broad Ripple business owners hope that others will follow their lead to put public safety first,” the press release from the village association reads.\n\nMore:Indianapolis killings: Tracking every homicide in 2023"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LndydHYuY29tL25ld3MvbG9jYWwtbmV3cy9icm9hZC1yaXBwbGUtdmlsbGFnZS1hc3NvY2lhdGlvbi1iYW5kcy10b2dldGhlci10by1zdG9wLWNyaW1lLWd1bi12aW9sZW5jZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Broad Ripple Village Association bands together to stop crime, gun violence - WRTV Indianapolis",
        "content": "INDIANAPOLIS — The Broad Ripple Village Association announced today that late night business owners have come to a unanimous agreement to shut doors earlier to slow crime.\n\nStarting today, all bars and restaurants in Broad Ripple Village will close at 1 a.m. until further notice. Many places also plan to discontinue any type of day parties and use of promoters to host events.\n\n\"We have had loitering issues late night, and right now while Broad Ripple Avenue is torn up we want to put safety and love and care for our village first. We all came together and agreed on that one o'clock curfew,\" said Michael Cranfill, a restaurant owner in Broad Ripple.\n\nAccording to the Broad Ripple Village Association, the reasoning behind the change is to help eliminate the string of violence the Village has recently seen.\n\n“This community-led shift cannot and will not be the only security change made in Broad Ripple Village and these Broad Ripple business owners hope that others will follow their lead to put public safety first,” the Association said in a press release.\n\nThe Broad Ripple Village Association says this is a large financial sacrifice for the businesses included, but “everyone agreed something had to be done,” and there is “no time to wait for any other entity to act.”\n\nThis announcement comes one day after the association held an emergency meeting to discuss safety plans.\n\nAfter three people were shot and killed in Broad Ripple over the weekend, there has been a rising concern about senseless violence there.\n\nPREVIOUS | 3 killed, 1 injured after Broad Ripple shooting PREVIOUS | Broad Ripple Village Association: Gun restrictions will be for specific area\n\nCranfill attributes the ongoing construction as a reason for the ongoing issues with violent crime.\n\n\"It’s creating blocked off areas in the streets where cars aren’t traveling and that kind of becomes a gathering place for people. These people are under 21. They’re not even allowed in the bars, and they’re just gathering in the streets. At times when first responders, police officers can’t get police cruisers through the streets,\" said Cranfill.\n\nThe group plans to schedule a meeting in the next two-weeks with the mayor’s office, IMPD, DPW and the prosecutor's office to find additional ways to create a safe environment in Broad Ripple Village.\n\n"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3Lm5hc2EuZ292L2dhbGF4aWVzLXN0YXJzLWJsYWNrLWhvbGVzLzE1LXllYXJzLW9mLXJhZGlvLWRhdGEtcmV2ZWFscy1ldmlkZW5jZS1vZi1zcGFjZS10aW1lLW11cm11ci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "15 Years of Radio Data Reveals Evidence of Space-Time Murmur - NASA",
        "content": "This artist’s concept shows stars, black holes, and nebula laid over a grid representing the fabric of space-time. Ripples in this fabric are called gravitational waves. The NANOGrav collaboration detected evidence of gravitational waves created by black holes billions of times the mass of the Sun. NANOGrav collaboration; Aurore Simonet\n\nScientists have found evidence of a universal background of gravitational waves, or ripples in the fabric of space-time.\n\nThe motion of black holes and other massive objects through space can create ripples in the fabric of the universe, called gravitational waves. On June 28 scientists announced the first evidence of a background of long-wavelength gravitational waves that fills the cosmos. These waves are thought to have been created over eons by supermassive black holes, up to billions of times the mass of our Sun, circling each other before they merge. Detecting the gravitational wave background is analogous to hearing the hum of a large group of people talking at a party, without distinguishing any particular voice.\n\nThe background ripples detected by NANOGrav could help scientists better understand how gravitational waves are created and what happens to them as they propagate through the universe. They could also be used to study supermassive black hole mergers, events that can last for millions of years. Scientists think these mergers happen in most galaxies and influence their evolution.\n\nThe North American Nanohertz Observatory for Gravitational Waves (NANOGrav) presented the evidence in a series of papers published in the Astrophysical Journal Letters. NANOGrav is a National Science Foundation-funded Physics Frontiers Center of more than 190 scientists from the United States and Canada, including scientists at NASA’s Jet Propulsion Laboratory in Southern California and other NASA centers. The collaboration has spent more than 15 years collecting high-precision data from ground-based radio telescopes, looking for these gravitational waves.\n\nThe discovery complements the first-ever detection of gravitational waves in 2015 by LIGO, the Laser Interferometer Gravitational Observatory. Those signals, at a much shorter wavelength than the new discovery, were from black holes about 30 times the mass of our Sun.\n\nNASA is contributing to the ESA (European Space Agency)-led Laser Interferometer Space Antenna mission, a future space-based observatory that will detect gravitational waves that are in a wavelength range between those detected by NANOGrav and LIGO.\n\nTo learn more about the new result, read this news release from Caltech: https://www.caltech.edu/about/news/scientists-find-evidence-for-slow-rolling-sea-of-gravitational-waves\n\nCalla Cofield\n\nJet Propulsion Laboratory, Pasadena, Calif.\n\n626-808-2469\n\ncalla.e.cofield@jpl.nasa.gov\n\n2023-092"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy53ZnlpLm9yZy9uZXdzL2FydGljbGVzL2Jyb2FkLXJpcHBsZS12aWxsYWdlLWxlYWRlcnMtd2FudC10by1tYWtlLXRoZS1uZWlnaGJvcmhvb2QtYS1ndW4tZnJlZS16b25lLWFmdGVyLXR3by1wZW9wbGUtYXJlLXNob3QtZGVhZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Broad Ripple leaders want to make the neighborhood a 'gun-free zone' after three people are shot and killed - WFYI",
        "content": "The Broad Ripple Village Association has requested the city to make the neighborhood a gun-free zone on Friday and Saturday nights through the end of August.\n\nThis story has been updated.\n\nFollowing recent gun violence, Broad Ripple leaders seek a permit to make the neighborhood gun-free and late night businesses vote to close by 1 a.m.\n\nOn Wednesday, the association announced that bars and restaurants in the area will close every day at 1 a.m. until further notice. Many establishments will also stop hosting day-party events in hopes to eliminate the amount of people in the area. Neighborhood leaders plan to meet with law enforcement to discuss additional ways to address the violence.\n\nThe Broad Ripple Village Association requested a permit from the city to make the neighborhood a gun-free zone on Friday and Saturday nights through the end of August. The request comes after three people were shot dead and one was injured early Sunday morning on Broad Ripple Avenue.\n\nA man and woman were pronounced dead at the scene on Broad Ripple Avenue Sunday, according to the Indianapolis Metropolitan Police Department. Another man and woman were taken to the hospital in serious condition; that man was later also pronounced deceased.\n\nPolice also arrested a man who fired a gun nearby, but is not believed to have been involved in the shooting. IMPD says there may be unknown individuals who were involved in the shooting who have yet to be apprehended. They pleaded with witnesses to the shooting to share information with the department.\n\nPolice said the investigation is in its early stages.\n\nMayor Joe Hogsett said the city has encouraged civic, neighborhood and private organizations that host high-traffic events to request special event permits that would allow them to declare gun-free zones.\n\nHe said the Broad Ripple Village Association leadership will request such a permit.\n\n“If this permit is approved, I have pledged my full support that IMPD and other city agencies will provide resources and support to enforce this reasonable request,” Hogsett said.\n\nCity leaders announced the first use of the new “Gun Free Zone” designation at the WonderRoad Music Festival in Garfield Park earlier this month.\n\nIMPD Chief Randal Taylor said it was likely the shooting was the result of an interpersonal dispute.\n\n“The sad thing is it happened in a place where many people, myself, my family, my kids included, have spent a number of hours in Broad Ripple and certainly enjoyed Broad Ripple. Broad Ripple should be enjoyed,” Taylor said.\n\nHe said “emotional immaturity” is driving the gun violence in Indianapolis, and he lamented the passage of permitless carry, which allows adults to carry firearms without having to go through a permitting process.\n\nHogsett said law enforcement and prosecutors have begun to identify “problem properties” in the Broad Ripple neighborhood. He pledged to hold property owners accountable who do not take basic steps to ensure their properties do not become a magnet for criminal activity.\n\nAnd Hogsett also criticized the state’s permitless carry law.\n\n“Hundreds were terrorized in Broad Ripple last night because of the actions of a reckless individual or individuals and their guns, which they may have been perfectly legal in carrying,” he said. “And when they were empowered by a set of reckless policies that were designed to ensure the simplest solutions are not on the table, tragic evenings like last evening or early this morning happen.”\n\nHogsett said he respects the authority of the state’s General Assembly.\n\n“I just want the legislature to give Indianapolis the opportunity to provide for common sense measures that are applicable to Indianapolis,” he said.\n\nAnyone with information about the shooting is asked to contact Detective James Hurt at the IMPD Homicide Office at 317-327-3475, or via email: James.Hurt@indy.gov\n\n\n\nAlternatively, they can call Crime Stoppers of Central Indiana at 317.262.8477 or (TIPS) to remain anonymous.\n\nThis story has been updated.\n\nContact WFYI education reporter Lee V. Gaines at lgaines@wfyi.org. Follow on Twitter: @LeeVGaines."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2dyYXZpdGF0aW9uYWwtd2F2ZXMtYmxhY2staG9sZXMtdW5pdmVyc2UtY2MwZDYzM2VjNTFhNWRjM2FjYjA0OTJiYWY3ZjgxOGHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Scientists have finally 'heard' the chorus of gravitational waves that ripple through the universe - The Associated Press",
        "content": "NEW YORK (AP) — Scientists have observed for the first time the faint ripples caused by the motion of black holes that are gently stretching and squeezing everything in the universe.\n\nThey reported Wednesday that they were able to “hear” what are called low-frequency gravitational waves — changes in the fabric of the universe that are created by huge objects moving around and colliding in space.\n\n“It’s really the first time that we have evidence of just this large-scale motion of everything in the universe,” said Maura McLaughlin, co-director of NANOGrav, the research collaboration that published the results in The Astrophysical Journal Letters.\n\nEinstein predicted that when really heavy objects move through spacetime — the fabric of our universe — they create ripples that spread through that fabric. Scientists sometimes liken these ripples to the background music of the universe.\n\nIn 2015, scientists used an experiment called LIGO to detect gravitational waves for the first time and showed Einstein was right. But so far, those methods have only been able to catch waves at high frequencies, explained NANOGrav member Chiara Mingarelli, an astrophysicist at Yale University.\n\nThose quick “chirps” come from specific moments when relatively small black holes and dead stars crash into each other, Mingarelli said.\n\nIn the latest research, scientists were searching for waves at much lower frequencies. These slow ripples can take years or even decades to cycle up and down, and probably come from some of the biggest objects in our universe: supermassive black holes billions of times the mass of our sun.\n\nGalaxies across the universe are constantly colliding and merging together. As this happens, scientists believe the enormous black holes at the centers of these galaxies also come together and get locked into a dance before they finally collapse into each other, explained Szabolcs Marka, an astrophysicist at Columbia University who was not involved with the research.\n\nThe black holes send off gravitational waves as they circle around in these pairings, known as binaries.\n\n“Supermassive black hole binaries, slowly and calmly orbiting each other, are the tenors and bass of the cosmic opera,” Marka said.\n\nNo instruments on Earth could capture the ripples from these giants. So “we had to build a detector that was roughly the size of the galaxy,” said NANOGrav researcher Michael Lam of the SETI Institute.\n\nThe results released this week included 15 years of data from NANOGrav, which has been using telescopes across North America to search for the waves. Other teams of gravitational wave hunters around the world also published studies, including in Europe, India, China and Australia.\n\nThe scientists pointed telescopes at dead stars called pulsars, which send out flashes of radio waves as they spin around in space like lighthouses.\n\nThese bursts are so regular that scientists know exactly when the radio waves are supposed to arrive on our planet — “like a perfectly regular clock ticking away far out in space,” said NANOGrav member Sarah Vigeland, an astrophysicist at the University of Wisconsin-Milwaukee. But as gravitational waves warp the fabric of spacetime, they actually change the distance between Earth and these pulsars, throwing off that steady beat.\n\nBy analyzing tiny changes in the ticking rate across different pulsars — with some pulses coming slightly early and others coming late — scientists could tell that gravitational waves were passing through.\n\nThe NANOGrav team monitored 68 pulsars across the sky using the Green Bank Telescope in West Virginia, the Arecibo telescope in Puerto Rico and the Very Large Array in New Mexico. Other teams found similar evidence from dozens of other pulsars, monitored with telescopes across the globe.\n\nSo far, this method hasn’t been able to trace where exactly these low-frequency waves are coming from, said Marc Kamionkowski, an astrophysicist at Johns Hopkins University who was not involved with the research.\n\nInstead, it’s revealing the constant hum that is all around us — like when you’re standing in the middle of a party, “you’ll hear all of these people talking, but you won’t hear anything in particular,” Kamionkowski said.\n\nThe background noise they found is “louder” than some scientists expected, Mingarelli said. This could mean that there are more, or bigger, black hole mergers happening out in space than we thought — or point to other sources of gravitational waves that could challenge our understanding of the universe.\n\nResearchers hope that continuing to study this kind of gravitational waves can help us learn more about the biggest objects in our universe. It could open new doors to “cosmic archaeology” that can track the history of black holes and galaxies merging all around us, Marka said.\n\n“We’re starting to open up this new window on the universe,” Vigeland said.\n\n___\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group. The AP is solely responsible for all content."
    }
]