[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9pcy14cnAtaW4tdHJvdWJsZS1hZ2Fpbi1zZWMtc2lnbmFscy1hcHBlYWwtaW4tcmlwcGxlLWNhc2Uv0gFXaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2lzLXhycC1pbi10cm91YmxlLWFnYWluLXNlYy1zaWduYWxzLWFwcGVhbC1pbi1yaXBwbGUtY2FzZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "Is XRP in Trouble Again? SEC Signals Appeal in Ripple Case - CryptoPotato",
        "content": "The legal war between the United States Securities and Exchange Commission and Ripple Labs appears to be far from over.\n\nWhile the latter managed a partial win following a recent court ruling, the Commission doesn’t seem to be backing down just yet.\n\nAccording to a recent report by Bloomberg, the United States Securities and Exchange Commission has asked a federal judge to ignore key parts of the recent ruling in the agency’s case with Ripple Labs.\n\nThe watchdog argues that the decision fails to reflect existing securities regulations.\n\nIn a fresh filing in another case – against Terraform Labs and former Terra-Luna CEO Do Kwon, the regulator says:\n\nRipple creates an artificial distinction between the expectations of sophisticated institutional and retail investors, improperly transforms Howey’s reasonable investor inquiry into a subjective one, and turns on its head the reasoning underlying Howey and other cases.\n\nRecall that Judge Analisa Torres recently ruled partially in favor of Ripple Labs in their case against the SEC, arguing that secondary sales of XRP do not constitute an investment contract.\n\nThe price of XRP exploded immediately after the news broke out and has doubled since.\n\nBut is XRP in trouble again? With the SEC signaling a potential appeal, the case might be headed to trial and the legal battle might drag on, putting additional pressure on the cryptocurrency."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3hycC1wcmljZS13aXBlcy1vdXQtMTItZ2FpbnMtYWZ0ZXItc2VjLXNhaWQtdGhlLXJlZ3VsYXRvci13aWxsLWFwcGVhbC1qdWRnZS10b3JyZXMtcnVsaW5nLTIwMjMwNzIyMTIzN9IBmQFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy94cnAtcHJpY2Utd2lwZXMtb3V0LTEyLWdhaW5zLWFmdGVyLXNlYy1zYWlkLXRoZS1yZWd1bGF0b3Itd2lsbC1hcHBlYWwtanVkZ2UtdG9ycmVzLXJ1bGluZy0yMDIzMDcyMjEyMzc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "XRP price wipes out 12% gains after SEC said the regulator will appeal Judge Torres’ ruling - FXStreet",
        "content": "The US SEC signaled its intention to appeal the ruling in the SEC vs Ripple lawsuit, arguing that the court failed to properly apply the law.\n\nThe development has resulted in a wipeout of XRP’s recent gains, the altcoin’s price dipped 12% on Binance, since Friday.\n\nXRP price is $0.7738 at the time of writing, nearly 17% below its peak of $0.9375 from the day of Judge Torres’ ruling, July 13.\n\nUS financial regulator, Securities and Exchange Commission (SEC) recently signaled that it is prepared to appeal Judge Analisa Torres’ ruling in the SEC vs Ripple lawsuit. Since the judgement on July 13, there has been speculation among XRP holders regarding the SEC’s appeal and change in the Judge’s ruling on the case.\n\nPro-XRP attorney John Deaton has explained that despite an appeal, there is relatively low likelihood of Judge Torres’ ruling being overturned.\n\nAlso read: Ripple Europe Chief chases UK license after partial win in SEC vs Ripple lawsuit\n\nXRP price declines after SEC shares plan to appeal the judgement\n\nXRP price dropped 12% since Friday, against USDT on Binance. The altcoin wiped out its gains after news of the US SEC’s plan to appeal the ruling in the SEC vs Ripple case. The outcome of the lawsuit was out on July 13, fueling a massive rally in XRP and altcoins.\n\nBetween July 13 and 22, XRP price declined 17%. Ripple’s partial win fueled enthusiasm among XRP holders and pushed the altcoin to its local peak of $0.9375. At the time of writing, XRP price is $0.7738.\n\nXRP/USDT one-day price chart Binance\n\nSEC’s plan to appeal the ruling in SEC vs Ripple case\n\nAccording to a recent Bloomberg report, the US SEC said that a federal judge (Judge Analisa Torres in this case) erred in ruling against the institution in a landmark crypto case. The regulator has signaled its intention to appeal the decision.\n\nThe SEC argued that the court failed to consider the evidence presented by the regulator and failed to apply the law to the presented facts. The regulator argues that there is potential harm to investors if Ripple Labs is allowed to continue operating without registering the XRP token as a security.\n\nFind out more about the SEC’s plan here."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xNDk2Njcvc2VjLXJpcHBsZS14cnAtdGVycmFmb3JtLWxhYnMtZG8ta3dvbi1zZWN1cml0aWVzLWhvd2V5LXRlc3TSAVtodHRwczovL2RlY3J5cHQuY28vMTQ5NjY3L3NlYy1yaXBwbGUteHJwLXRlcnJhZm9ybS1sYWJzLWRvLWt3b24tc2VjdXJpdGllcy1ob3dleS10ZXN0P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "SEC Asserts Ripple XRP Case was 'Wrongly Decided', Signals Appeal - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter a judge delivered a mixed win for Ripple in its lawsuit against the U.S. Securities and Exchange Commission (SEC), the agency filed new documents late Friday in its lawsuit against Terraform Labs and its CEO Do Kwon, claiming the Ripple decision was flawed and could be appealed.\n\nAccording to a new set of documents filed in the Terraform Labs case yesterday, the SEC is now hinting at appealing the Ripple rulings, in which a federal judge ruled that the company did not violate securities laws in offering its native token XRP to retail investors, but did break the law when it came to institutional investors.\n\nThe SEC move comes in response to a filing earlier this week by Terraform’s lawyers, who said the Ripple rulings strengthen their defense and support their request that the lawsuit should be dismissed.\n\nAt the center of the controversy lies the Howey test, which is a legal test that determines whether a financial instrument constitutes an investment contract and thus falls under the regulatory purview of the SEC.\n\nAD\n\nAD\n\n“Contrary to Ripple’s assertions, much of the ruling supports the SEC’s claims in this case,” read the documents, adding that Ripple's practices conflict with the Howey test. “Those portions of Ripple were wrongly decided, and this court should not follow them.”\n\nFriday’s filings against Terra and Do Kwon show that the SEC believes the judge in the Ripple case should dismiss its recent rulings related to the retail sales of XRP, claiming the company “creates an artificial distinction between the expectations of sophisticated institutional and retail investors.” Should that distinction stand, according to the SEC, it turns the Howey test “on its head.”\n\nEven if the \"hodgepodge of purported factual differences\" were substantive, the SEC argues, the Ripple case benefits the SEC's position.\n\n\"The court must draw reasonable inferences in the SEC’s favor, including that the institutional buyers in this case—such as trading firms that purchased [Ripple's] crypto assets with no restrictions on resale—purchased because they viewed the assets as an investment opportunity into Terraform’s efforts.\"\n\nAD\n\nAD\n\nTerraform Labs and its CEO Do Kwon have been legally battling the SEC since early this year, after the company collapsed. The lawsuit is damning, after Terra’s stablecoin UST lost its peg, and took a $40 billion platform–with retail and institutional investors–down with it.\n\n“Finally, the underlying logic of the Ripple ruling is divorced from the basic principles behind Howey and the federal securities laws more broadly,” The SEC concluded."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS1zZWMtbGF3c3VpdC11cGRhdGUtdG9wLXJlYXNvbnMtd2h5LXNlY3MtYXBwZWFsLWFnYWluc3QteHJwLW1pZ2h0LWZhaWwv0gFsaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvcmlwcGxlLXNlYy1sYXdzdWl0LXVwZGF0ZS10b3AtcmVhc29ucy13aHktc2Vjcy1hcHBlYWwtYWdhaW5zdC14cnAtbWlnaHQtZmFpbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "Ripple SEC Lawsuit Update: Top Reasons Why SEC’s Appeal Against XRP Might Fail - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nStory Highlights The SEC might appeal the ruling classifying XRP as non-security.\n\nCrypto lawyer John Deaton argues that proving a common enterprise between Ripple and secondary XRP holders could be difficult for the SEC.\n\nThe SEC claims that the Ripple ruling imposes new, unfounded requirements on the Howey Test.\n\nAs ripples from the landmark decision in the Ripple-SEC case begin to quiet down, the world of cryptocurrency is buzzing again. This is because Gary Gensler’s SEC team is contemplating an appeal against the ruling which unequivocally declared XRP as non-security.\n\nThe Common Enterprise Conundrum\n\nREAD FOOTNOTE 13 PEOPLE:\n\n\n\n“The Court holds only that a common enterprise existed between Ripple and the Institutional Buyers. The Court does not reach the question of whether the common enterprise extends to encompass \"other XP holders.\" Defendants Garlinghouse and Larsen, the… https://t.co/uQO0q4M6sT pic.twitter.com/VwX4jyChSf — John E Deaton (@JohnEDeaton1) July 22, 2023\n\nInfluential cryptocurrency attorney, John Deaton, a vocal Ripple advocate, expressed his thoughts on this development via Twitter. Deaton unpacks the crux of the judgment in his tweet, which lies in ‘Footnote 13’, where the court determines the existence of a common enterprise solely between Ripple and its institutional buyers.\n\nIt remains unclear whether this connection extends to other XRP holders, Ripple’s top executives, Brad Garlinghouse and Chris Larsen, the broader XRP ecosystem, or any other entities.\n\nDeaton holds the view that the SEC will face a steep climb in proving a common enterprise connection between Ripple and secondary market XRP holders, even if they triumph in appealing Judge Torres’s ruling. He emphasizes that the SEC’s hypothesis in this case was convoluted and unconvincing, leading to their defeat.\n\nThe Howey Test Hurdle\n\nThe Securities and Exchange Commission contends that the Ripple ruling contradicts the core principles of securities laws, such as the Howey Test. This legal standard is instrumental in identifying whether an arrangement falls into the ‘investment contract’ category.\n\nThe Commission’s stance on the Ripple lawsuit came to light in a distinct case against Terraform Labs and Do Kwon, its founder, accused of spearheading a multi-billion-dollar cryptocurrency asset securities fraud.\n\nParallel Paths or Conflicting Crossroads\n\nThe SEC maintains that significant aspects of the Ripple ruling support their allegations in the Terraform Labs case, disputing arguments raised by the defense. They posit that the ruling in Ripple’s favor imposes unfounded requirements on the Howey Test, creating a conflict. They assert that such parts of the Ripple ruling are misguided and should not be followed by the court.\n\nIt remains to be seen how this developing situation will impact the complex intersection of traditional securities law and the evolving landscape of cryptocurrency regulation."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzA3LzIyL2NyYXp5LWNyeXB0by1ydWxpbmctanVkZ2Utc2hha2luZy11cC10aGUtMS0yLXRyaWxsaW9uLW1hcmtldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "Crazy crypto-ruling judge shaking up the $1.2 trillion market - New York Post",
        "content": "We are taught to revere the judiciary because divining legal truth is supposed to be heady stuff.\n\nWe probably shouldn’t.\n\nFor evidence, witness the bizarre rationale provided by Supreme Court Justice Ketanji Brown Jackson to support affirmative action. “For high-risk Black newborns,” she wrote in her dissent on the recent SCOTUS ruling, “having a Black physician more than doubles the likelihood that the baby will live and not die.” I would love to see the ­“research” on that doozy.\n\nAnother gem from the judiciary came about two weeks ago courtesy of a Manhattan federal judge named Analisa Torres. Securities law experts say that she, in essence, ruled that small investors don’t deserve the same type of protections as some dude working at a hedge fund.\n\nYeah, you read that right.\n\nJudge Torres, of course, didn’t say those exact words, but you don’t need to be a legal scholar to decipher the upshot on her weird decision that’s roiling the $1.2 trillion crypto market.\n\nIt involves the digital token XRP, utilized and sold by a crypto company named Ripple, and it’s further proof that judges can be acutely witless. More important, that Congress needs to take crypto regulation out of the hands of the judiciary ASAP and fix this possibly transformative business before it moves to places where there’s more rational regulations, like China.\n\nAnalisa Torres’ ruling is expected to shake up the cryptocurrency industry.\n\nTo get a better understanding of this mess, let’s go back to around 2012, when Ripple (no known relation to that cheap wine people used to drink back in the day) unveiled its cross-border payment system that uses blockchain technology to facilitate faster transactions.\n\nIt’s basically a crypto version of the SWIFT system used by banks to transfer money across the globe. By most accounts, it’s a decent product, and its goal is to make money transfers cheaper and more seamless via the blockchain.\n\nThe trouble began around 2017 when Ripple, which also created the digital coin XRP, began selling tons of it. Some proceeds went into financing Ripple’s platform; execs who had XRP sold as well.\n\nSome of these sales were to big investors, so-called institutions. Company officials, such as its CEO, Brad Garlinghouse, and its founder, Chris Larsen, and the company itself also sold additional XRP to small investors, not directly but by pumping the stuff through crypto exchanges.\n\nCost of doing business\n\nThe way securities laws traditionally work, when a company like Apple does something like this via a private placement or selling pre-IPO shares, an IPO or a secondary offering of stock, they go to the SEC and file a bunch of stuff about their operations. Depending on the type of sale (IPOs demand more disclosure than private placements), this can be time-consuming and expensive, but it’s the cost of doing business.\n\nThe reason: Stocks find their way into the hands of small investors, who aren’t plugged in like the hotshots at the big Wall Street asset management firms, aka institutions, that have the CEO and CFO on speed dial. Average people who buy stocks need to be able to see what the company is up to in a way that they can understand. The legal term for all of that is known as “disclosure.”\n\nRipple didn’t do that in selling all that XRP and it’s the reason why in 2020, the SEC sued the company and its top execs looking for dam­ages and disclosure.\n\nTorres’ logic is being compared to Ketanji Brown Jackson’s in her decision on affirmative action. REUTERS\n\nI’ve spoken both to SEC types who brought the case, and Ripple officials including Garlinghouse; both make compelling arguments for why they did what they did. The SEC, according to Ripple, is picking crypto winners and losers. Other cryptocurrencies, like Ethereum, did similar stuff, and the SEC hasn’t sued those guys. Plus crypto is an animal all its own and under law can’t be regulated like public companies.\n\nThe SEC worries about the Wild West stuff that goes on with digital coins — recall the notorious SBF. Plus, what’s the harm if Ripple just came in and filled out some paperwork about its operations?\n\nTorres’ ruling, meanwhile, makes some of the most absurd legal arguments impacting securities laws and now crypto regulation. Some of Ripple’s XRP sales to those Wall Street fat cats were in fact securities, and demand disclosure because these were so-called investment contracts, she declares.\n\nThen she rules that Ripple’s disclosure-free sales to small investors were totally kosher. According to her (il)logic, because they purchased their XRP through an intermediary like an exchange, they were not entering into investment contracts. These “blind” sales aren’t securities, so it’s perfectly legal for Ripple to stiff the little guy on disclosure.\n\nIn her words, both sides won, both lost. And now one really knows how to proceed going forward.\n\nWhat may have escaped Torres and her law clerks is that the vast majority of regular stock purchases on apps or from your broker are similarly “blind.” Yet Apple, like all public companies, provides lots of disclosures because the law says small investors need them more than hedge funds.\n\nMaybe there’s a method to Torres’ madness. She’s an Obama appointee and could be looking to emulate the Biden-appointed Brown Jackson and her legal reasoning to join SCOTUS when Sleepy Joe gets around to packing the court.\n\nIn the meantime, the crypto industry will have to live with one of the more bizarre and dangerous court rulings I’ve ever seen in covering finance for three decades."
    }
]