[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vdS50b2RheS94cnAtYW5kLXJpcHBsZS1jb2ZvdW5kZXItaW52ZXN0cy01MDAtbWlsbGlvbi1pbi1udmlkaWEtY2hpcHMtZm9yLWFpLWlubm92YXRpb27SAWJodHRwczovL3UudG9kYXkveHJwLWFuZC1yaXBwbGUtY29mb3VuZGVyLWludmVzdHMtNTAwLW1pbGxpb24taW4tbnZpZGlhLWNoaXBzLWZvci1haS1pbm5vdmF0aW9uP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "XRP and Ripple Cofounder Invests $500 Million in Nvidia Chips for AI Innovation - U.Today",
        "content": "In a pioneering initiative aimed at tackling the existing scarcity of artificial intelligence processing units, a nonprofit organization spearheaded by crypto magnate Jed McCaleb has injected close to $500 million into cutting-edge semiconductor technology, reports Reuters.\n\nAdvertisement\n\nThis endeavor, named Voltage Park, has set out to provide leasing services for this formidable computational power to enterprises deeply engaged in AI endeavors.\n\nJed McCaleb, renowned for his significant contributions to the crypto industry, has accumulated substantial wealth through his ventures. He played a pivotal role in shaping the blockchain industry, being involved in the creation of Ripple and XRP, followed by Stellar and XLM.\n\nVoltage Park functions as a subsidiary of McCaleb's nonprofit Navigation Fund. Any generated profits are channeled back into the fund, with the entrepreneur maintaining a hands-off approach, abstaining from direct involvement in the daily operations or strategic decision-making processes of either entity.\n\nCurrently, Voltage Park boasts possession of an impressive array of 24,000 state-of-the-art Nvidia chips, establishing itself as a dependable source for accessible AI computing solutions.\n\nCompetition is real, intelligence is artificial\n\nThe operational blueprint revolves around the strategic deployment of these advanced chips in key U.S. regions. While some chips are already in operation, Voltage Park is working to ensure the entire batch is operational by February.\n\nThis swift response is prompted by the escalating demand, spurred by the AI boom last year.\n\nThis strategic move mirrors the global trend of increasing demand for high-performance AI processors. In this competitive landscape, Nvidia, a major player in the industry, faces competition from industry titans and innovative start-ups, all vying to fulfill the burgeoning requirements of the artificial intelligence sector."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3hycC1sYXdzdWl0LWZvcm1lci1zZWMtY29tbWlzc2lvbmVyLWNyaXRpY2l6ZXMtcmlwcGxlLWxhd3N1aXQtcXVlc3Rpb25zLWV0aHMtdHJlYXRtZW50L9IBdmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3hycC1sYXdzdWl0LWZvcm1lci1zZWMtY29tbWlzc2lvbmVyLWNyaXRpY2l6ZXMtcmlwcGxlLWxhd3N1aXQtcXVlc3Rpb25zLWV0aHMtdHJlYXRtZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "XRP Lawsuit: Former SEC Commissioner Criticizes Ripple Lawsuit, Questions ETH’s Treatment - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nWhile the price of XRP currently stands at $0.5578, showing stability and even modest gains of 6.2 %, the cryptocurrency’s legal battle with the U.S. Securities and Exchange Commission (SEC) has unveiled intriguing details. The coin’s upward momentum is backed by positive on-chain metrics. However, there is a chance of a price correction, and if XRP falls to the support level at $0.50, it might experience a significant decline.\n\nThe letters Unfold the Long Tail in Short\n\nIt has come to light that Joseph Grundfest, a former SEC commissioner who currently serves as a professor at Stanford Law School, vehemently opposed the SEC’s lawsuit against Ripple, citing its far-reaching implications.\n\nIn a letter penned in December 2020, Grundfest expressed concerns that the lawsuit could have detrimental consequences for the nation’s financial and securities markets. He cautioned that the case wasn’t just about the technicalities of securities law but would also inflict harm on innocent XRP holders.\n\nHis argument was that the fear of legal repercussions would lead intermediaries to cease XRP transactions, which, in turn, would reduce liquidity and cause a decline in XRP’s value, resulting in billions of dollars in losses for third-party holders.\n\n“Upon learning of the proceeding, intermediaries will cease transacting in XRP because of the associated legal risk. The resulting reduction in liquidity will cause XRP’s value to decline.”\n\nETH Got the Free Pass?\n\nBut some got the free pass like ETH from the SEC; Grundfest also questioned the SEC’s inconsistency in treating Ethereum (ETH) and XRP. He argued that the SEC hadn’t presented any substantial differences in the operations of Ether and XRP concerning federal securities laws. This led him to challenge the fairness of subjecting XRP to securities law obligations while exempting Ether. Grundfest believed this approach created an unfair competitive imbalance in the enforcement of federal securities laws.\n\nThis revelation not only adds an interesting twist to the Ripple-SEC lawsuit but also raises pertinent questions about the regulatory approach to different cryptocurrencies. XRP’s price stability amid the ongoing legal battle underscores its resilience and the continued support it receives from its community."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYm9sZC5jb20vcmlwcGxlLXRvLXVubG9jay0xLWJpbGxpb24teHJwLXRvbW9ycm93LW5vdmVtYmVyLTEtd2hhdC10by1leHBlY3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Ripple to unlock 1 billion XRP tomorrow (November 1); What to expect? - Finbold - Finance in Bold",
        "content": "On the first day of every month, Ripple unlocks 1 billion XRP tokens from an escrow system programmed within the XRP Ledger. On November 1 (Wednesday), the token unlock will happen again in three transactions of 100 million, 400 million, and 500 million XRP.\n\nInterestingly, November 2023’s unlock accrues for 1.86% of the current circulating supply of 53.56 billion XRP and part of the remaining 46.43 billion XRP tokens owned by Ripple that are still locked in escrows to be released monthly until April 2027.\n\nThree escrows will reach finality on the last minutes of October 31, held by two known crypto wallet addresses under Ripple’s control:\n\nAddress “Ripple (22)” — for an unlock of 100 million XRP, locked on September 03, 2019, with the transaction ID “7EF17…CDA6F”.\n\nAddress “Ripple (22)” — for an unlock of 400 million XRP, locked on August 01, 2019, with the transaction ID “E0D06…DA8EA”.\n\nAddress “Ripple (23)” — for an unlock of 500 million XRP, locked on September 03, 2019, with the transaction ID “0ECCB…F84E3”.\n\nThese two addresses still hold 4 billion XRP tokens for monthly escrows that will be unlocked within the next four months until March 1, 2024.\n\nThis is what Ripple did to the 1 billion XRP released in October\n\n1 billion XRP tokens worth $550 million were unlocked, as expected, on October 1. Ripple immediately relocked 800 million (80%) of the total to escrows set to finalize by March and April 2027.\n\nMonthly escrow Ripple (XRP) | October 2023. Source: Finbold\n\nNotably, despite keeping 200 million XRP, the company spent 205 million tokens ($112.75 million) from its main address, “Ripple 1,” in October. For that, Ripple used 5 million XRP previously available in its balance from past months.\n\nThe sell-offs occurred weekly in three transactions, all sent to the same address, “ rJqiM…La8nE”:\n\nOn October 9, paying 60 million XRP through the transaction ID “AFAB4…1FF48”\n\nOn October 16, paying 75 million XRP through the transaction ID “2B333…81843”\n\nOn October 24, paying 70 million XRP through the transaction ID “BDBE1…97B07”\n\nHow does the escrow system work for Ripple unlocks?\n\nRipple created XRP in 2012, with a capped total supply of 100 billion XRP. The company then distributed 20 billion XRP to the creators and the core team.\n\nRipple’s treasury controlled the remaining 80 billion XRP and promised to release these coins gradually rather than all at once. In 2017, Ripple implemented a new system to make the release of XRP more predictable and controlled.\n\nThis system uses escrows — a smart contract that locks up XRP, making it impossible to use them unless it meets certain conditions. Ripple’s condition was to release one billion XRP on the first day of each month for 55 months, for a total of 55 billion XRP.\n\nHowever, despite a monthly release of one billion XRP, Ripple only spent or sold some of them. Instead, Ripple is reportedly locking up the remaining tokens each month in new escrows for future releases. The recurrent relocks extended the 55-month deadline for all XRP to start circulating."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8zMS9yaXBwbGUtZ2VuZXJhbC1jb3Vuc2VsLWNhbGxzLWxicnktbGF3c3VpdC1hbi1pbmp1c3RpY2UtdXJnZXMtc2VjLWNvbW1pc3Npb25lci10by1zcGVhay1vdXQtbG91ZGVyLWFuZC1zb29uZXIv0gGSAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzMxL3JpcHBsZS1nZW5lcmFsLWNvdW5zZWwtY2FsbHMtbGJyeS1sYXdzdWl0LWFuLWluanVzdGljZS11cmdlcy1zZWMtY29tbWlzc2lvbmVyLXRvLXNwZWFrLW91dC1sb3VkZXItYW5kLXNvb25lci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Ripple General Counsel Calls LBRY Lawsuit an Injustice, Urges SEC Commissioner To Speak Out Louder and Sooner - The Daily Hodl",
        "content": "Ripple’s top lawyer is urging U.S. Securities and Exchange Commission (SEC) Commissioner Hester Peirce to speak out sooner and louder against the regulator’s hostile approach toward the crypto industry.\n\nLast week, Peirce released a statement of dissent regarding the SEC’s lawsuit against the blockchain-based file-sharing payment network LBRY, which the regulator filed in 2021 under allegations the company sold crypto assets as unregistered securities.\n\nResponding to Peirce’s statement, Ripple’s chief legal counsel Stuart Alderoty asks the commissioner if perhaps it’s time for her to file an amicus brief in defense of LBRY or other cases in the crypto industry.\n\n“Thank you, Commissioner. When you see injustices like this continue in non-fraud cases (while consumers wait for recourse from actual frauds), perhaps it’s time to let ordinary rules of protocol go by the wayside and speak out louder and sooner? Perhaps even with an amicus brief?”\n\nPro-XRP lawyer John Deaton, who represented 75,000 XRP holders during his amicus curiae in the SEC’s lawsuit against Ripple, also responded to Peirce, echoing Alderoty’s sentiments.\n\n“Dissents and open letters of criticism are great and appreciated. Certainly, better than nothing.\n\nBut maybe it is time to get off the sidelines and take that extra step and file an amicus brief. As you know, 75,000 individual holders spoke up to have their voices heard in Court. I think it’s time someone from the inside also spoke out – in court.”\n\nIn Peirce’s recent statement of dissent against the SEC, the commissioner questioned why the regulator went after LBRY – a company that didn’t appear to cause any discernible harm to anyone – rather than go after other companies that were actually engaged in outright fraud.\n\n“Why go after a company that sold a token for a functioning blockchain with an established use when we could have pursued plenty of other projects that were outright frauds and did not attempt to comply with the securities laws? To make matters worse, the Commission took an extremely hardline approach in this case.\n\nFor example, after winning on summary judgment, the Commission sought monetary remedies of $44 million and asserted that LBRY’s offer to burn all tokens in its possession was not sufficient assurance that LBRY would not violate the registration provisions in the future. The Commission’s requested remedies were entirely out of proportion to any harm.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vcmlwcGxlLmNvbS9pbnNpZ2h0cy9xMy0yMDIzLXhycC1tYXJrZXRzLXJlcG9ydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Q3 2023 XRP Markets Report - Ripple",
        "content": "Ripple publishes the quarterly XRP Markets Report to voluntarily provide transparency and regular updates on the company’s views on the state of crypto markets, relevant XRP Ledger and XRP-related announcements, and market developments over the previous quarter.\n\nAs an XRP holder, Ripple believes proactive communication and transparency are part of being a responsible stakeholder. Moreover, Ripple urges others in the industry to build trust, foster open communication and raise the bar industry-wide.\n\nCrypto Markets Summary\n\nIn Q3, the crypto market drew fewer cues from broader macro assets, instead placing greater emphasis on industry specific news and flows of capital. Throughout Q3, BTC’s correlation to the S&P hit historic lows at 0.23. XRP also exhibited a low correlation of 0.16 over the same time period.\n\nThere were significant market developments that weighed on asset prices and liquidity. Multiple instances of protocol hacks, rug pulls and scams dominated headlines as nearly $686 million was lost in the recent quarter. In September, a hot wallet security breach on HTX resulted in the loss of $8 million worth of ETH while the cross-chain protocol Mixin Network suffered a $200 million worth of crypto loss due to an exploit. Coupled with ongoing volatility and uncertainty in traditional markets, these factors drove trading volumes to some of the industry’s lowest levels. BTC volumes reached a three-year low of $1-2B a day, and correspondingly, XRP volumes neared a four-year low of $300-400M a day.\n\nTrading activity in XRP continued to predominantly occur on the major non-US exchanges such as Binance, OKX and Upbit. Following the US court decision in July, which ruled XRP is not a security, the token was relisted on a number of US exchanges, including Coinbase and Kraken. Challenger exchanges that prioritized regulated token status gained market share. For instance, Bullish has shown material growth since its recent listing of XRP. Additionally, XRP options markets have emerged with new listings on Bit.com and Deribit.\n\nLimited inflow of fresh cash into the market led to continued leverage in the broader crypto system. Market activity was likely largely driven by market-maker positioning and their client flows as crypto interest levels resembled those before 2020 levels, and retail exchange volumes also were at similar levels.\n\nLastly, it will come as no surprise that all eyes are on spot BTC/ETH ETF approvals slated for Q1 2024 or earlier. Whether this marks the moment for a massive influx of capital remains uncertain. That uncertainty is reflected in global macro conditions as well, which have arguably become even more complex with the developments in the Middle East. Since then, the overall market perception of global economic conditions and stability has decidedly changed as US bond yields staged historic moves, commodities surged significantly and money flocked to safe-haven currencies like the Swiss Franc. The combination of these factors has sparked this most recent uptick in crypto prices.\n\nUpdate on the SEC Lawsuit against Ripple\n\nOn October 19, the SEC dismissed all remaining charges against Ripple CEO Brad Garlinghouse and Executive Chairman Chris Larsen. This stunning capitulation by the SEC was a dismissal “with prejudice,” meaning this decision is final and the SEC cannot later try and bring those claims again. There was no settlement involved, and there will be no trial against the individuals in April. The case will now move straight into the remedies stage in which the Court will decide which remedies to impose, if any, in light of the Court’s finding that certain institutional sales constituted sales of securities.\n\nThis news follows a series of consecutive wins for Ripple including the July 13 decision ruling that, as a matter of law, XRP is not a security, and the October 3 decision denying the SEC’s bid for an interlocutory appeal.\n\nGlobal Regulatory Developments\n\nWhile the US continues to grapple with a lack of crypto regulatory clarity, Asian regulators have taken the lead on providing guidance and rulebooks on crypto. Singapore's MAS granted a major payments institution license to Ripple only four months after granting initial in-principle approval in June of this year. Coinbase and Sygnum also received their Major Payment Institution licenses. In addition, MAS released a regulatory framework intended to bolster the stability of single-currency stablecoins. In Europe, the UK’s FCA asked crypto businesses to fall in line with new financial promotions rules and a new UK bill is set to give local authorities powers to freeze and confiscate crypto assets tied to crime if approved later this year. Finally, leaders of the G20 are pushing for a speedy implementation of a cross-border framework for crypto.\n\nDeep Dive: XRP Markets\n\nMoving forward, Ripple will publish standardized market metrics sourced from public sources including CCData, Bloomberg and Refinitv Eikon.\n\nChart 1: XRP price and realized volatility experienced spikes on the days of the SEC decision (July 13) and the large risk-off move that occurred on August 17. XRP ended the quarter at historical 90-Day lows of volatility (~40%).\n\nTable 1: Major tokens price and volume (end of Q3 ‘23 figures)\n\nCurrent USD prices and weekly returns in percentage points. The 30-Day, and 90-Day average trading volume reflects daily trading activity for the USD and stablecoin pairs on top tier exchanges as measured by CCData.\n\nChart 2: Following a large spike to ~$4B of traded volume on July 13 (the day of the Court decision), XRP volumes gradually cooled off and concluded the quarter at $300-400M a day.\n\nChart 3: The majority of XRP trading activity is currently with stablecoins, primarily due to the overwhelming majority of exchanges trading XRP against USDT.\n\nChart 4: Binance remained an outsized player in the XRP market (an average of ~60% over Q3). There has been some uptick in the “Other” category as more exchanges turned on XRP trading. US exchanges have grown to be almost 5% of global XRP volume (in USD value).\n\nThe State of the XRP Ledger\n\nAs the community continues to build on the XRP Ledger, significant features were proposed to ensure developers can create innovative applications while providing enhanced trust and safety for their issued assets:\n\nXLS-30d AMM : this proposal adds a non-custodial automated market maker (AMM) as a native feature to the XRPL’s decentralized exchange (DEX). Developers can use XLS-30d AMM integration to create new financial applications and/or integrate into non-financial applications. With the AMM being built as a protocol rather than an application, liquidity is aggregated at the protocol level and is shared with the order book DEX, ensuring better pricing and availability of tokenized assets on the XRPL. RippleX performance and engineering teams published a performance testing report attesting to the proposed amendment’s enhancement to network utility, particularly for cross-currency payments.\n\nXLS-38d : this amendment enables a cross-chain bridge where XRP can move bi-directionally between XRPL Mainnet and a XRPL Sidechain. This cross-chain bridging software will also be used to establish a connection between XRPL Mainnet and the upcoming EVM sidechain (currently available on devnet), bringing interoperability to the XRP Ledger and empower developers with better customization.\n\nLast quarter, the community continued to create and advance notable projects and apps to address a variety of use cases. Notably, NFTrade announced its integration with the XRP Ledger marking the first first multi-chain NFT marketplace to support XRPL. This integration also introduced protocol-level royalty protections through the XRPL's XLS-20 standard. RWA Protocol announced the launch of $HOME, the first mortgage-backed stablecoin on the XRP Ledger and Ducati launched its first-ever digital collectible on the XRP Ledger.\n\nOn-Chain Activity\n\nTrading volume on the XRP Ledger’s DEX increased more than 3x in Q3. This was due to several days between 7/12 to 8/17 when single-day trading volume was more than $1M, occasionally reaching $20M-30M mid-August.\n\nOn-Chain Activity Q3 2023 Q2 2023 Transactions 90,446,746 99,312,734 XRP Burned for Transaction Fees 243,201 389,073 Avg Cost per Transaction (in XRP) 0.00269 0.00392 Average XRP Closing Price (in USD) 0.55 0.48 Avg Cost per Transaction (in USD) 0.001490 0.001881 Volume on DEX (in USD) 218,610,501 51,671,864 Trustlines 7,583,330 7,951,618 Number of New Wallets 157,936 138,644\n\nThe DEX has been operating continuously since the XRP Ledger's launch in 2012, allowing users to buy and sell tokens for XRP or other tokens and providing on-chain liquidity for numerous currency pairs. Native functionality such as auto-bridging allows fungible and non-fungible assets transferred to the XRPL to access the DEX’s existing liquidity to create synthetic order books for assets. The Ledger also has built-in pathfinding functionality allowing it to find the most efficient path for a given trade.\n\nRipple’s XRP Holdings\n\nRipple reports information about its XRP holdings at the beginning of the quarter and last day of the quarter. Its holdings fall into two categories: XRP that it currently has available in its wallets, and XRP that is subject to on-ledger escrow lockups that will be released each month over the next 42 months.\n\nFor this latter category, Ripple does not have access to that XRP until the escrow releases it to Ripple on a monthly basis. The vast majority of the XRP released is put back into the escrow.\n\nJune 30, 2023\n\nTotal XRP Held by Ripple: 5,551,119,094\n\nTotal XRP Subject to On-Ledger Escrow: 41,900,000,005\n\nSeptember 30, 2023"
    }
]