[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3JpcHBsZS1wbGFuLXRvLXJlLWVuZ2FnZS13aXRoLXVzLW1hcmtldC1jb3VsZC10cmlnZ2VyLXhycC1wcmljZS1yZWNvdmVyeS0yMDIzMDgwMzEwNDjSAYgBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvcmlwcGxlLXBsYW4tdG8tcmUtZW5nYWdlLXdpdGgtdXMtbWFya2V0LWNvdWxkLXRyaWdnZXIteHJwLXByaWNlLXJlY292ZXJ5LTIwMjMwODAzMTA0OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "XRP price could recover with Ripple President announcement of return to US market - FXStreet",
        "content": "Ripple’s partial win in the SEC vs Ripple case is followed by the firms plans to re-engage with the US market.\n\nMonica Long announced that the cross-border remittance firm is ready to engage with countries where there is regulatory clarity.\n\nXRP price has been in a slump since the decline that followed the SEC vs Ripple ruling.\n\nRipple’s partial victory versus the US Securities and Exchange Commission’s (SEC) has helped the cross-border remittance firm make the decision to re-engage with the US market. The payment firm is already making strides in its partnerships in regulated places like the UK, Europe, Singapore, Dubai and the Middle East.\n\nRipple President sheds light on firm’s plans for the US market\n\nRipple President, Monica Long, told CNBC in an interview that Ripple is ready to make its comeback in the US. This development comes after Judge Analisa Torres’ ruling declaring partial victory for the payment remittance firm against the US SEC.\n\nAlso read: Pro-XRP attorney John Deaton considers XRP ruling the most significant non-fraud SEC enforcement action\n\nWhile there has been speculation of the ruling facing trouble after updates in the SEC v. Terraform Labs lawsuit, Ripple has plans to begin re-engaging with the US market and its key players.\n\nRipple’s executive acknowledged the firm’s international expansion in places with regulatory clarity, like the UK, Europe, Singapore, Dubai and the Middle East. These jurisdictions have provided clear framework and guidance to the payment remittance firm, making operations and expansion relatively easier for Ripple.\n\nThe announcement is likely to act as a bullish catalyst for XRPLedger’s native token XRP price.\n\nXRP price is in a slump, awaiting a catalyst for recovery\n\nXRP price has been in a consistent decline since its July 13 high of $0.9354 on Binance. At the time of writing, XRP is trading at $0.6641. The altcoin is awaiting a bullish catalyst to trigger a recovery, after nearly 30% decline from $0.9354 to $0.6641.\n\nXRP price could recover if the token’s adoption and utility increases, with a wider use case for the XRPLedger blockchain."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMDgveHJwLXJpcHBsZS1wcmVzaWRlbnQtbW9uaWNhLWxvbmctb24taGVyLWZpcm1zLWdsb2JhbC1leHBhbnNpb24taW4tdGhlLXdha2Utb2YtdG9ycmVzLXJ1bGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Ripple's Global Strategy Post-Torres Ruling: Insights from President Monica Long - CryptoGlobe",
        "content": "On 13 July 2023, a significant ruling was delivered in the ongoing SEC vs Ripple Labs lawsuit. The U.S. Securities and Exchange Commission (SEC) had accused Ripple Labs and its two senior executives, Bradley Garlinghouse and Christian A. Larsen, of unlawfully offering and selling securities. The case was presided over by Hon. Analisa Torres, a district judge at the United States District Court for the Southern District of New York.\n\nThe court’s decision was a mixed bag, granting and denying summary judgment motions from the SEC and Ripple. The SEC’s motion for summary judgment concerning the Institutional Sales was given but denied for other matters. Conversely, Ripple’s motion for summary judgment regarding the Programmatic Sales, the Other Distributions, and the sales made by Larsen and Garlinghouse was granted but denied concerning the Institutional Sales. The SEC’s motion for summary judgment on the aiding and abetting claim against Larsen and Garlinghouse was also denied.\n\nA key takeaway from the ruling was the judge’s statement that XRP, as a digital token, does not embody the Howey requirements of an investment contract, suggesting that the court does not view XRP as a security.\n\nIn a recent interview with CNBC, Ripple President Monica Long talked about the firm’s partial victory in court and the firm’s growing presence around the world.\n\nLong expressed her satisfaction with the court’s ruling, which she said provided much-needed clarity for Ripple’s operations. The ruling has allowed Ripple to re-engage with the U.S. market, but Long also emphasized that much of Ripple’s growth over the years has been outside the U.S., in regions where there is clear regulatory framework for cryptocurrencies.\n\nLong highlighted the UK, Europe, Singapore, and Dubai as jurisdictions that have provided clear frameworks and rules for cryptocurrencies. These regions have seen significant growth in Ripple’s business, particularly in the realm of payments.\n\nThe UK was singled out as a significant hub for fintech and a country where Ripple is looking to increase its investment. This is in line with the UK’s ambition to become a crypto hub with specific regulations tailored to crypto companies. Ripple’s presence in London has grown significantly over the years, with the office more than doubling in size.\n\nRipple also has a large customer base throughout Europe and the Middle East, with Dubai being another key office. In addition to Europe and the Middle East, Ripple has seen growth in Asia and Latin America. Long mentioned that Latin America, in particular, has been “heating up” for Ripple, with a key office located in Sao Paulo."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDgvMDMvcmlwcGxlLXByZXNpZGVudC1jb21tZW5kcy10ZWFtcy1yZWNvZ25pdGlvbi1vbi1jbmJjcy1maW50ZWNoLXJhbmtpbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Ripple President Commends Team's Recognition on CNBC's Fintech Ranking - The Crypto Basic",
        "content": "Ripple executive Monica Long is delighted as Ripple secures a spot on CNBC’s top fintech list alongside Paypal, Revolut, and Tencent.\n\nMonica Long, the President of Ripple, expressed delight and pride as Ripple secured a coveted spot on CNBC’s inaugural ranking of the world’s most prominent fintech firms.\n\nShe took to X (fka Twitter) to commend her team’s efforts in achieving this recognition. Long sees Ripple’s inclusion in the list as a significant accomplishment, given that only a few crypto companies were honored.\n\n- Advertisement -\n\n“So proud of team Ripple on making CNBC’s inaugural World’s Top Fintech Companies list. We’re one of only a handful of crypto companies honored – a feat we don’t take lightly,” she remarked.\n\nSo proud of team @Ripple on making @CNBC’s inaugural World's Top Fintech Companies list. We’re one of only a handful of crypto companies honored – a feat we don’t take lightly. Thanks @Ryan_Browne_ for having me on to discuss our recent global momentum. https://t.co/jWEsr11jeM https://t.co/qf3ISb5WZ3 — Monica Long (@MonicaLongSF) August 2, 2023\n\nCNBC Spotlights Ripple Among Top 200 Firms\n\nOn Wednesday, CNBC published an exhaustive list of 200 best-performing global fintech companies. It captures top firms across Asia, Africa, Europe, and North America, showcasing the diversity and scale of the payment industry.\n\nCNBC collaborated with Statista, an independent research firm, to ensure transparency in the selection process. Over 1,500 firms were thoroughly analyzed across nine market segments. The key performance indicators were revenue, user numbers, and funding raise.\n\n- Advertisement -\n\nThe final roster featured industry giants like Ripple and Paypal in the US, China’s Tencent, and the UK’s Revolut, alongside promising startups keen on shaping the future of financial services.\n\nIn particular, the digital payments industry, where Ripple was featured, is reportedly experiencing exponential growth, with its current valuation surpassing a staggering $54 trillion.\n\nAccording to the report, the competition in the digital payments market is intense, with numerous players vying for a piece of the lucrative pie. However, this environment has also allowed other industry participants to innovate and offer unique solutions.\n\nAmong the top 40 digital payments companies identified by Statista, notable contenders included Ripple, Paypal, and Stripe of the United States. Additionally, renowned payment firms in India, Nigeria, Indonesia, China, the UK, Sweden, and South Korea were featured in this category.\n\nMoreover, firms such as Klarna of Sweden and Afterpay of Australia were featured for their contributions to the “buy now, pay later” sector. Despite the challenges posed by fears of decreased consumer spending and rising inflation, these services have become a lifeline for many, offering flexible payment alternatives.\n\nRipple has continued to attract significant recognition from leading entities across multiple domains. Recall that Fortune Magazine recently ranked Ripple among the best workplaces, as The Crypto Basic reported."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9yaXBwbGUtZ2l2ZXMtdHdvLWNlbnRzLW9uLXNlYy1ydWxpbmctbG9ja3MtbmV3LXNldC1vZi14cnAv0gFUaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3JpcHBsZS1naXZlcy10d28tY2VudHMtb24tc2VjLXJ1bGluZy1sb2Nrcy1uZXctc2V0LW9mLXhycC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Ripple gives two cents on SEC ruling, locks new set of XRP - AMBCrypto News",
        "content": "The blockchain firm, Ripple, pointed out that both the judgment protects institutions and retailers.\n\nRipple sent 800 million XRP to its escrow wallet.\n\nRipple [XRP] finally gave an in-depth response to the partial win it had against the U.S. SEC on 13 July. Although the firm expressed its gladness shortly after the ruling, its latest Q2 market report provides a lot of clarity on certain misconceptions about the case.\n\nHow much are 1,10,100 XRPs worth today?\n\nWhile Ripple published the report on 31 July, it only went public on 2 August. According to Ripple, SEC’s lawsuit against it was misguided and a “quest for political power.”\n\nClarifying misconceptions\n\nHowever, Ripple also addressed some misinterpretations of the judgment. According to the firm, XRP is not just security in some corners but in all areas. Accusing the SEC of being a propaganda merchant, Ripple said,\n\n“The statement that the same “thing” can be sold to buyer “A” as part of a simple buy/sell transaction and also sold to buyer “B” as part of an investment contract is a non-controversial statement of the law. What finds no basis in the law is the SEC’s propaganda to the contrary.”\n\nRipple also addressed some comments that pitched their tent with the notion that the judgment favored institutional investors over the retail cohort. The blockchain company explained that the sentiment was nowhere true saying that,\n\n“Consumers need protection, but not all roads lead to the SEC. If the SEC’s overreach has exposed a regulatory gap, that gap is not for a court to fill (and certainly not for the SEC to fill without legal authority).”\n\nMeanwhile, the crypto wallet sleuth Whale Alert noted that Ripple once again locked 800 million XRP by sending it into an escrow wallet.\n\n? ? ? ? ? ? ? ? ? ? 500,000,000 #XRP (349,458,791 USD) locked in escrow at Ripple Escrow wallethttps://t.co/Zqfyy9EAnr — Whale Alert (@whale_alert) August 1, 2023\n\nXPR locked again\n\nAs a rule of thumb, Ripple locks XRP occasionally to ensure that market there is a balance between supply and demand in the market. In the report, Ripple also mentioned its XRP balance on the ledger, and in escrow. The report shed light on its holdings:\n\n“XRP that it currently has available in its wallets, and XRP that is subject to on-ledger escrow lockups that will be released each month over the next 42 months.”\n\nRipple CEO Brad Garlinghouse also commented on the report. He noted that the SEC had once used the firm’s transparency against it. But this time, the regulatory agency cannot do that.\n\nWe began these reports to voluntarily provide updates given our XRP holdings. Sadly, they were used against us in the SEC lawsuit – however, we remain steadfast in our commitment to transparency but I suspect they’re going to look a bit different moving forward https://t.co/oANR6WCG09 — Brad Garlinghouse (@bgarlinghouse) August 2, 2023\n\nIs your portfolio green? Check the Ripple Profit Calculator\n\nLately, another judge handling the Terraforms Labs matter opined that the Ripple ruling was wrong. As of this writing, the sentiment around XRP was no more as optimistic as it was before.\n\nAs of this writing, XRP’s 30-day performance was a 43.16% hike— a drawdown from the incredible rise when Judge Torres declared XRP a partial winner."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiKWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3hycC1ydWxpbmctc2Vj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 12:46:06 GMT",
        "title": "The XRP ruling is no knockout punch against the SEC - Blockworks",
        "content": "The recent ruling in SEC v. Ripple Labs has been hailed as a huge step forward for the crypto sector.\n\nAnd in a way, it is.\n\nThe overarching highlight of Judge Analisa Torres’ 34-page ruling?\n\nShe held that Ripple Labs had not violated US securities laws, as it was selling XRP anonymously to the average digital exchange user. This presents a significant roadblock to the Securities and Exchange Commission’s drawn-out campaign to try regulating cryptocurrencies by judicial order and piecemeal actions.\n\nYes, XRP holders should be thrilled about finally owning and purchasing XRP tokens without strings attached. The ruling is already affecting the SEC’s strategy in similar cases against players like Terra.\n\nHowever, that does not mean that today’s emerging crypto projects are in the clear.\n\nA road map to regulation\n\nIn her decision, Judge Torres teed up two standards of review when assessing whether Ripple Labs sold unregistered securities: one for how it addressed XRP sales to sophisticated hedge funds and other institutional investors, and another for how it approached the everyday consumer investor who uses publicly-accessible crypto exchanges.\n\nIn the process, she found that while Ripple Labs did not sell unregistered securities to lay crypto traders, it did so when selling to sophisticated investors.\n\nJudge Torres based this distinction on the idea that everyday investors who purchased XRP from 2011 to 2020 on exchanges did not receive any investment promotional materials, direct communications or legal agreements from Ripple when they traded XRP. To the contrary, many of these traders would not have known if they had purchased their tokens from Ripple Labs based on how digital exchanges operate.\n\nIn contrast, she found that the institutional investors Ripple pitched relied on Ripple’s token purchase contracts, marketing materials, and executive speeches and communications regarding Ripple’s role in creating value for the XRP tokens. Because of these communications, Judge Torres found that Ripple’s activities would have signaled to these sophisticated investors that it was presenting a “speculative value proposition” in XRP tied to the success of Ripple Labs.\n\nThis kind of analytical dichotomy is nothing unusual; the SEC promulgated a similar analysis in its “Framework for ‘Investment Contract’ Analysis of Digital Assets” back in 2018.\n\nStill, it should place public-facing crypto projects on notice that they could still come up against sanctions depending on how they sell their tokens and market their offerings to different audiences.\n\nRead more from our opinion section: Ratioing Gensler on Twitter is sadly crypto’s most powerful protest\n\nFortunately for the crypto industry, the decision identifies several steps companies can take to assess whether their activities align with US securities regulations. Judge Torres, for example, found that Ripple’s purchase contracts resembled investment contracts in how they incorporated lock-up provisions, resale restrictions, indemnification clauses and statements of purpose.\n\nThe company’s market reports, and even brochures to potential investors, also presented XRP tokens and their performance as materially tied to the success of Ripple Labs. It also didn’t help that the leadership of Ripple Labs touted on YouTube and Reddit on how by driving interest and certain capital investments in Ripple, the company could lift the price of XRP.\n\nAt this stage, the SEC could — and likely will — request the Second Circuit to revisit Judge Torres’ decision. While not delivering everything the crypto industry had hoped for, the decision in Ripple does provide a road map out of the current legal uncertainty bedeviling the crypto industry.\n\nAndrew St. Laurent is a New York-based partner at Harris St. Laurent & Wechsler LLP. He was part of the legal team defending former Coinbase product manager Ishan Wahi in SEC v. Wahi, which is among the first SEC actions to claim cryptocurrencies as securities. Andrew is a first-chair trial lawyer who has tried more than 20 cases to verdict, from federal jury trials, to FINRA, AAA and JAMS arbitrations, and numerous New York State court bench and jury trials. He regularly represents plaintiffs and defendants in employment cases, shareholder and partnership disputes, and criminal and regulatory matters.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]