[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm5peG9uZm91bmRhdGlvbi5vcmcvMjAyMy8wMy9hLWxhc3RpbmctcmlwcGxlLWVmZmVjdC10aGUtYWR2YW5jZW1lbnQtb2Ytd29tZW4tZHVyaW5nLXRoZS1uaXhvbi1hZG1pbmlzdHJhdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "A Lasting Ripple Effect: The Advancement of Women During the Nixon Administration - Richard Nixon Foundation",
        "content": "A lasting legacy of Richard Nixon’s presidency is the advancement of women. Among the notable outcomes of this dedicated effort by the Nixon administration was tripling the hiring of women in the Executive Branch.\n\nDuring the first year of his presidency, Nixon began an initiative to place women in positions in the federal government. Scholars, administration members, and representatives from corporate America were gathered to form The President’s Task Force for Women’s Rights and Responsibilities. In December of 1969 the task force issued a 33-page report with five key recommendations to change the course of women’s rights and employment in the United States, beginning at the federal level.\n\nBarbara Hackman Franklin, one of the first-ever female graduates of Harvard Business School and an executive at Citibank, was tapped by Fred Malek, Special Assistant to the President for Personnel, to lead what would be the first-ever concerted effort to put women on an equal employment footing with men."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY2FiaW5yYWRpby5jYS8xMjI5MzIvbmV3cy9wb2xpdGljcy9kZWxheWVkLXNjaG9vbC1yZW5vcy10aHJlYXRlbi1yaXBwbGUtZWZmZWN0LWluLXR1a3RveWFrdHVrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Delayed school renos threaten 'ripple effect' in Tuktoyaktuk - Cabin Radio",
        "content": "Tuktoyaktuk’s MLA says delays to renovation work at the community’s school risk depriving students and residents of the space they need.\n\nJackie Jacobson wants the NWT government to bring in four portable classrooms that would free up Mangilaluk School’s new gym for the start of the next academic year in September.\n\nThe gym is currently serving as a teaching space while classrooms elsewhere in the school are renovated.\n\nUltimately, the renovations will give the school a much larger gym than was previously the case, with a library, kitchen and other facilities replacing the former gym. The school says it will also be better equipped to serve its 240 or so students from junior kindergarten to Grade 12.\n\nA 2021 schedule had estimated that virtually all of the work would be complete by this month. Jacobson, whose Nunakput electoral district includes Tuk, said the work was expected to cost more than $30 million.\n\nSpeaking in the legislature on Tuesday, Jacobson said the school was now forced to try renting space elsewhere in Tuk – at churches or the community hall – while awaiting the completion of refurbishment work.\n\nHe said bringing in portable classrooms represented a better alternative than taking up community spaces that ought to be used by others, and the portable units could be added to Tuk’s housing stock afterward.\n\n“This is supposed to be a good news story, but now it’s nothing but headaches,” Jacobson said.\n\n“It has a ripple effect on my students and community. There’s no gym? Mental health issues. It ripples right across the community as a whole, having no gym.”\n\nInfrastructure minister Diane Archie said the GNWT has no spare portables it can send nor the budget to pay for any new ones.\n\n“We are working with the contractor to be able to get an updated schedule so that we can share that with the community,” Archie said.\n\nThe minister said her department was working with the contractor to “allow the gym to be open at the start of the school year.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiowFodHRwczovL3dsb3MuY29tL25ld3MvbG9jYWwvcmVnaW9uYWwtZWNvbm9teS10by1mZWVsLXJpcHBsZS1lZmZlY3RzLW9mLXBhY3Rpdi1ldmVyZ3JlZW4tcGFwZXItbWlsbC1jbG9zdXJlLWNhbnRvbi1oYXl3b29kLWNvdW50eS13ZXN0ZXJuLW5vcnRoLWNhcm9saW5hLTUwMC1taWxsaW9u0gGnAWh0dHBzOi8vd2xvcy5jb20vYW1wL25ld3MvbG9jYWwvcmVnaW9uYWwtZWNvbm9teS10by1mZWVsLXJpcHBsZS1lZmZlY3RzLW9mLXBhY3Rpdi1ldmVyZ3JlZW4tcGFwZXItbWlsbC1jbG9zdXJlLWNhbnRvbi1oYXl3b29kLWNvdW50eS13ZXN0ZXJuLW5vcnRoLWNhcm9saW5hLTUwMC1taWxsaW9u?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Ripple effects on economy from Pactiv Evergreen paper mill closure estimated to be $500M - WLOS",
        "content": "The closure of the Pactiv Evergreen paper mill in Canton is expected to have a significant economic impact on the area. The paper mill, set to close in late May or early June, employs hundreds of workers and has an annual payroll of about $140 million.\n\nAccording to Haywood County Economic Development Director David Francis, the loss of that infusion into the regional economy and its total ripple effect is estimated to be closer to $500 million.\n\n“We are really trying to get our heads around what this ripple effect is going to do,” Francis said.\n\n\n\nThe 115-year-old paper mill its employees have an average income of $80,000 per year plus benefits. With the loss of about 900 jobs at the plant in Canton and potentially another 200 in Waynesville, the effect could be far beyond the immediate $140 million.\n\n“Five-hundred million was the last estimate we had in about 2019 of their yearly impact in the economy,” Francis said.\n\nThat ripple effect includes goods, like wood pulp, provided by the local logging industry, and services, like trucking and rail, that help get the product to market. However, according to , the ripple effect can be even greater.\n\n\n\n“Any time you take something that has several hundred million dollars in annual economic impact out of your economy, that's not good,” executive director Nathan Ramsey said.\n\nThe expended ripples will include everything from grocery stores and local small businesses to health care providers. According to Francis, the effect of the impending closure has already resulted in the closure of another local business that serves the mill.\n\n“We just learned a company in Cherokee County is going to be closing down due to their contract with Evergreen,” Francis said.\n\nFor most workers, the loss of their jobs will mean entering a job market that many haven’t experienced in decades. According to the Asheville/Buncombe County Chamber of Commerce, there continue to be more jobs in the area than available workers.\n\n\n\nThough this may bode well for some Evergreen employees, it may also be a challenge.\n\nAccording to Ramsey, “The challenge is, those jobs (at Evergreen) pay very well. So, the likelihood that someone can get a job paying them as well as Evergreen, in some cases, they will be able to do that. In other cases, they may struggle.”\n\nHaywood County is already working with various economic groups across the region to help soften the landing for those soon-to-be displaced workers. Along with job retraining resources, they are also building a website to help Evergreen's many workers better navigate the jobs market.\n\nThe Asheville metropolitan area has a $24 billion annual economy that, according to Land of Sky, can certainly weather the economic effects of the closure. However, for those on the front line, it will still likely be a blow.\n\n“I’m bullish on our region,” Ramsey said. “I’m bullish in the future of our community. But, this certainly was a gut punch.”"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LnBvcHN1Z2FyLmNvbS9iZWF1dHkvbWFuZS10cmlwbGUtcmlwcGxlLWp1bWJvLWhhaXItd2F2ZXItcmV2aWV3LTQ5MTA5MzE00gFbaHR0cHM6Ly93d3cucG9wc3VnYXIuY29tL2FtcGh0bWwvYmVhdXR5L21hbmUtdHJpcGxlLXJpcHBsZS1qdW1iby1oYWlyLXdhdmVyLXJldmlldy00OTEwOTMxNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Mane Triple Ripple Jumbo Hair Waver Review With Photos - POPSUGAR",
        "content": "POPSUGAR Photography | Renee Rodriguez POPSUGAR Photography | Renee Rodriguez\n\nEvery editorial product is independently selected by our editors. If you buy something through our links, we may earn commission.\n\nThe first time I saw someone with mermaid waves created by a flat iron, my jaw visibly dropped. I was obsessed with everything about the look. The effortless vibe, the piece-y texture — it was all that I was looking for, and everything I wanted my hair to look like. Unfortunately, when I figured out how people were achieving said waves, my jaw dropped again, and not in a good way. No matter how many different YouTube tutorials I watched or how many different straighteners I tried, I just couldn't nail it. When I found out that Jen Atkin, one of the celebrity hairstylists who practically made the style her signature, created a singular hair tool that would help me achieve the look, I knew I had to test it out, and I'm glad I did. Allow me to introduce the Mane by Mane Addicts Triple Ripple Jumbo Hair Waver ($75). Keep reading for all the details on the product, which is one of the first in her latest hair brand since Ouai, and my unfiltered review below. Mane by Mane Addicts Triple Ripple Jumbo Hair Waver From $75 $75 at maneaddicts.com About the Mane by Mane Addicts Triple Ripple Jumbo Hair Waver This hair tool features three 1.25\" barrels that are ceramic coated to create creaseless waves.\n\nIt has a removable handle for easy packing and goes up to 410 degrees.\n\nIt is suitable for all hair types, lengths, and textures.\n\nThe device has an auto shut-off after 60 minutes. How to Use the Mane by Mane Addicts Triple Ripple Jumbo Hair Waver\n\nPOPSUGAR Photography | Renee Rodriguez\n\nThe brand recommends using the waver in three simple steps: Step One: Section off your hair and start with the base of your head working upward.\n\nSection off your hair and start with the base of your head working upward. Step Two: Hold the waver horizontally and clamp each section beginning near the root.\n\nHold the waver horizontally and clamp each section beginning near the root. Step Three: After two to five seconds, continue down the length of your hair and make sure to overlap the last bend of the previous section to keep everything looking seamless. When I want a supersleek look with defined waves, I typically follow these instructions to a T after washing and rough drying my hair with a blow dryer. However, I've learned that one of the best ways to use this tool is on air-dried hair. I have a little bit of a natural wave to my hair, and I've always had a hard time styling it after it's been air-dried. My waves aren't defined enough to be worn on their own, but when I go in with a curling iron the look doesn't come off natural or cohesive. This waver allows me to add just a few waves on the top layer of my hair and leaves everything looking perfect. What I Like About the Mane by Mane Addicts Triple Ripple Jumbo Hair Waver\n\nPOPSUGAR Photography | Renee Rodriguez"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LnZpY2UuY29tL2VuL2FydGljbGUvODh4NDh6L2VzYS1saXNhLW1pc3Npb24tZ3Jhdml0YXRpb25hbC13YXZlcy1zcGFjZXRpbWXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Ripples in Spacetime Are Passing Through You Right Now. This Mission Will Reveal Their Secrets. - VICE",
        "content": "ABSTRACT breaks down mind-bending scientific research, future tech, new discoveries, and major breakthroughs. See More →\n\nIt wasn’t a totally random thought—I was on my way to talk to an expert in these ripples, known as gravitational waves—but it seemed especially compelling looking out at the calm landscape spotlit by a bright winter sun. The view, almost like a high-contrast photo, somehow made it easier to imagine the invisible waves sweeping across the flatlined exurbs flanking the road between Amsterdam and the town of Noordwijk, home of the European Space Research and Technology Centre (ESTEC), which was my destination. It wasn’t a totally random thought—I was on my way to talk to an expert in these ripples, known as gravitational waves—but it seemed especially compelling looking out at the calm landscape spotlit by a bright winter sun. The view, almost like a high-contrast photo, somehow made it easier to imagine the invisible waves sweeping across the flatlined exurbs flanking the road between Amsterdam and the town of Noordwijk, home of the European Space Research and Technology Centre (ESTEC), which was my destination.\n\nAdvertisement\n\nGravitational waves are created by practically everything in the universe, from the ambient remnants of the Big Bang, to the explosive deaths of stars, to the mergers of giant galaxies. Even on the most boring days of your life, when you are laid-up sick in bed or handling the most tedious of workplace tasks, you can take comfort in the bizarre fact that you and everyone you know are being gently buffeted by these cosmic waves that warp the fabric of reality. Gravitational waves are created by practically everything in the universe, from the ambient remnants of the Big Bang, to the explosive deaths of stars, to the mergers of giant galaxies. Even on the most boring days of your life, when you are laid-up sick in bed or handling the most tedious of workplace tasks, you can take comfort in the bizarre fact that you and everyone you know are being gently buffeted by these cosmic waves that warp the fabric of reality.\n\nThe first detection of a gravitational wave, snagged in 2015, ushered in a major new era in astronomy that has exposed strange cosmic encounters—like mergers between distant black holes—that are invisible to light-based observatories. It also delivered on a century-old dream to capture the elusive waves, which were first proposed by Albert Einstein in his theory of general relativity. The first detection of a gravitational wave, snagged in 2015, ushered in a major new era in astronomy that has exposed strange cosmic encounters—like mergers between distant black holes—that are invisible to light-based observatories. It also delivered on a century-old dream to capture the elusive waves, which were first proposed by Albert Einstein in his theory of general relativity.\n\nNow, scientists at the European Space Agency (ESA) are working toward a new milestone in the hunt for gravitational waves unlike anything that has come before. The mission, known as the Laser Interferometer Space Antenna (LISA), will be made up of three spacecraft flying in a synchronized formation that will stretch across millions of miles of deep space. Now, scientists at the European Space Agency (ESA) are working toward a new milestone in the hunt for gravitational waves unlike anything that has come before. The mission, known as the Laser Interferometer Space Antenna (LISA), will be made up of three spacecraft flying in a synchronized formation that will stretch across millions of miles of deep space.\n\nIf all goes to plan, this futuristic trio will be able to eavesdrop on epic cosmic events that have remained far out of reach for other detectors, such as encounters between supermassive black holes, while also probing unexplored realms of the universe. If all goes to plan, this futuristic trio will be able to eavesdrop on epic cosmic events that have remained far out of reach for other detectors, such as encounters between supermassive black holes, while also probing unexplored realms of the universe.\n\nAdvertisement\n\nOn a recent morning, I was watching the hypnotic Dutch countryside roll by from the backseat of a cab and wondering about the invisible ripples in spacetime that imperceptibly pass through everything, including me.\n\nLocated on the dune-rippled coast north of the Hague, ESTEC is ESA’s biggest site and its main space technology hub, Located on the dune-rippled coast north of the Hague, ESTEC is ESA’s biggest site and its main space technology hub, billing itself as “Europe’s gateway to space.” Most of Europe’s extraterrestrial ambitions are born and nourished within this 100-acre complex, which contains several sophisticated testing facilities and harnesses the talents of some 2,500 scientists, engineers, and other space specialists.\n\nAfter picking up my visitor’s badge, I was able to get a quick caffeine fix in ESTEC’s cafeteria, which sits in a historic building with some low-key “Jurassic Park Visitor Center” vibes, mostly due to its retro design and aura of scientific bustle. The site has a feline mascot, After picking up my visitor’s badge, I was able to get a quick caffeine fix in ESTEC’s cafeteria, which sits in a historic building with some low-key “Jurassic Park Visitor Center” vibes, mostly due to its retro design and aura of scientific bustle. The site has a feline mascot, Micky the Space Cat , who often hangs around the sunlit reception area, but on that day he was off exploring the grounds.\n\nMy guides led me down the center’s main corridor, a huge passageway adorned with images and replicas of ESA space missions, including a full-scale model of the agency’s experimental reentry vehicle. We met Jennrich in a conference room tucked along the corridor that was set up with a small-scale model of LISA Pathfinder spacecraft, a mission launched in 2015 and successfully tested out some of the technologies that will be used on LISA. My guides led me down the center’s main corridor, a huge passageway adorned with images and replicas of ESA space missions, including a full-scale model of the agency’s experimental reentry vehicle. We met Jennrich in a conference room tucked along the corridor that was set up with a small-scale model of LISA Pathfinder spacecraft, a mission launched in 2015 and successfully tested out some of the technologies that will be used on LISA.\n\nAdvertisement\n\nImage: Author\n\nAs a researcher who has spent decades working on gravitational waves, Jennrich has seen his field move from the very fringes of the astronomical community into the center of mainstream attention. Now, with LISA, he is helping to push the field into an entirely new dimension that will expose some of the most mysterious, and consequential, interactions in our universe. As a researcher who has spent decades working on gravitational waves, Jennrich has seen his field move from the very fringes of the astronomical community into the center of mainstream attention. Now, with LISA, he is helping to push the field into an entirely new dimension that will expose some of the most mysterious, and consequential, interactions in our universe.\n\nWhereas existing gravitational wave detectors can hear the rumbles of “stellar-mass” black holes, which can be several dozen times the mass of the Sun, LISA will be able to tune into the hulking giants that sit at the center of galaxies, which can be millions or even billions of times more massive than the Sun. Understanding how these immense objects have coalesced over billions of years will shed light on the fundamental structure of the universe itself, and they are just one of LISA’s epic observational targets. Whereas existing gravitational wave detectors can hear the rumbles of “stellar-mass” black holes, which can be several dozen times the mass of the Sun, LISA will be able to tune into the hulking giants that sit at the center of galaxies, which can be millions or even billions of times more massive than the Sun. Understanding how these immense objects have coalesced over billions of years will shed light on the fundamental structure of the universe itself, and they are just one of LISA’s epic observational targets.\n\n“With LISA, we will see any supermassive black hole coalescence within the right mass range wherever they happen in the universe,” Jennrich told me. “They can't hide” because “the machine is so sensitive.” “With LISA, we will see any supermassive black hole coalescence within the right mass range wherever they happen in the universe,” Jennrich told me. “They can't hide” because “the machine is so sensitive.”\n\nIndeed, the three spacecraft that make up LISA will be two and a half million kilometers apart, but will be able to measure distance changes on the order of picometers, a unit that is one trillionth the size of a meter. Indeed, the three spacecraft that make up LISA will be two and a half million kilometers apart, but will be able to measure distance changes on the order of picometers, a unit that is one trillionth the size of a meter.\n\nA main focus of LISA’s mission will be those supermassive black holes, or the “big boys” as Jennrich calls them. These objects are the dark hearts of galaxies, making them an essential piece of the universe’s fabric, but nobody is sure just how they grew to their enormous scales. A main focus of LISA’s mission will be those supermassive black holes, or the “big boys” as Jennrich calls them. These objects are the dark hearts of galaxies, making them an essential piece of the universe’s fabric, but nobody is sure just how they grew to their enormous scales.\n\nAdvertisement\n\nLISA could help resolve this question by picking up the gravitational waves produced by seeds of supermassive black holes that existed in the early universe, less than a billion years after the Big Bang. LISA could help resolve this question by picking up the gravitational waves produced by seeds of supermassive black holes that existed in the early universe, less than a billion years after the Big Bang.\n\n“We will immediately know what scenarios were more likely and what was the prevalent cause of growth,” Jennrich said. “That is of tremendous interest for the people who are looking into the structure formation of the universe. That is difficult to assess through optical astronomy, simply because you're so far away.” “We will immediately know what scenarios were more likely and what was the prevalent cause of growth,” Jennrich said. “That is of tremendous interest for the people who are looking into the structure formation of the universe. That is difficult to assess through optical astronomy, simply because you're so far away.”\n\nIn addition to probing the evolution of supermassive black holes, LISA will be able to listen to the hum of tens of thousands of compact objects, such as black holes and neutron stars, that are stuck in close orbits with one another. It will be able to pick up the sound of merging objects much earlier than ground-based detectors, expanding our understanding of how these unions occur. It may even be able to hear an ancient stochastic echo, known as the gravitational wave background, that could open a new window into the very early eras of the universe. In addition to probing the evolution of supermassive black holes, LISA will be able to listen to the hum of tens of thousands of compact objects, such as black holes and neutron stars, that are stuck in close orbits with one another. It will be able to pick up the sound of merging objects much earlier than ground-based detectors, expanding our understanding of how these unions occur. It may even be able to hear an ancient stochastic echo, known as the gravitational wave background, that could open a new window into the very early eras of the universe.\n\nWith its ambitious design and ability to sense hidden behemoths in space, LISA is one of those missions that inspires daydreams, even though we will all have to wait until the 2030s, at the earliest, for its launch. To learn more about the trailblazing project, I headed to ESTEC to meet with Oliver Jennrich, an ESA astrophysicist who serves as LISA study scientist.\n\nAdvertisement\n\n“If I wave my hand, that hand emits gravitational waves,” Jennrich explained. “A bus that passes by, or turns around the corner emits gravitational waves—tiny, non-measurable amounts in this case. What you really need are enormously big masses and you need to measure extremely small effects.” “If I wave my hand, that hand emits gravitational waves,” Jennrich explained. “A bus that passes by, or turns around the corner emits gravitational waves—tiny, non-measurable amounts in this case. What you really need are enormously big masses and you need to measure extremely small effects.”\n\nThere’s little doubt that Einstein would have been delighted to have been proved wrong about our capacity to snag these tiny effects. It took a century of overcoming naysayers and enduring painstaking trial-and-error, but the first gravitational wave was finally captured in 2015 at the Laser Interferometer Gravitational-Wave Observatory (LIGO) in the U.S. The historic breakthrough marked a new era of “multimessenger astronomy,” a term that describes observations from very different signal sources, and earned the Nobel Prize in Physics in 2017. There’s little doubt that Einstein would have been delighted to have been proved wrong about our capacity to snag these tiny effects. It took a century of overcoming naysayers and enduring painstaking trial-and-error, but the first gravitational wave was finally captured in 2015 at the Laser Interferometer Gravitational-Wave Observatory (LIGO) in the U.S. The historic breakthrough marked a new era of “multimessenger astronomy,” a term that describes observations from very different signal sources, and earned the Nobel Prize in Physics in 2017.\n\nUnlike light, gravitational waves can travel through the universe without getting warped, obscured, or swallowed by massive objects like black holes or galaxy clusters. As a result, these abundant waves are valuable messengers from dark and distant reaches of the universe that are beyond the range of light-based telescopes. Unlike light, gravitational waves can travel through the universe without getting warped, obscured, or swallowed by massive objects like black holes or galaxy clusters. As a result, these abundant waves are valuable messengers from dark and distant reaches of the universe that are beyond the range of light-based telescopes.\n\n“I’m reasonably sure that we will see something that we don't expect”\n\nWhile they are commonly described as “ripples in spacetime,” Jennrich thinks gravitational waves are most easily understood through their physical effect on the universe. While they are commonly described as “ripples in spacetime,” Jennrich thinks gravitational waves are most easily understood through their physical effect on the universe.\n\nAdvertisement\n\n“What I sometimes tell people is, ‘let's concentrate on what gravitational waves do’” which is “change distances,” he said. For instance, if you were out to dinner with friends and a gravitational wave passed through the party, the distances between you and your friends would shorten and lengthen ever so slightly. “What I sometimes tell people is, ‘let's concentrate on what gravitational waves do’” which is “change distances,” he said. For instance, if you were out to dinner with friends and a gravitational wave passed through the party, the distances between you and your friends would shorten and lengthen ever so slightly.\n\nWe don’t notice all of these ambient waves because their oscillations are so small. Even waves produced by massive objects, such as merging black holes or colliding neutron stars, produce ripples with wavelengths that are far smaller than the width of a proton. We don’t notice all of these ambient waves because their oscillations are so small. Even waves produced by massive objects, such as merging black holes or colliding neutron stars, produce ripples with wavelengths that are far smaller than the width of a proton.\n\nGravitational waves, like so much else in classical physics, are the brainchildren of Albert Einstein. The concept of ripples that travel through space sprang from his theory of general relativity, published in 1915, though Einstein was famously skeptical that humanity would ever achieve the technological means to capture such subtle perturbations.\n\nLISA will be like an ultra-super-sized version of these ground detectors that covers an area 10 times bigger than the Moon’s orbit around Earth. The idea is to launch three spacecraft that will each carry two lasers that can shoot pulses across the vast distances between the nodes of the constellation. In this way, the trio can detect waves that pass through its immense baselines as it trails Earth’s orbit around the Sun. LISA will be like an ultra-super-sized version of these ground detectors that covers an area 10 times bigger than the Moon’s orbit around Earth. The idea is to launch three spacecraft that will each carry two lasers that can shoot pulses across the vast distances between the nodes of the constellation. In this way, the trio can detect waves that pass through its immense baselines as it trails Earth’s orbit around the Sun.\n\nAdvertisement\n\n“LISA is a mission that is designed to detect gravitational waves from space,” Jennrich said. “To measure them, we will have three satellites in orbit and we will continuously measure the distance between the three satellites with laser links. When a gravitational wave passes by, it will change the distance by a very small amount. We can measure and register that change, and send the data to the ground, to scientists, to analyze the data to determine what was the source of the gravitational wave.” “LISA is a mission that is designed to detect gravitational waves from space,” Jennrich said. “To measure them, we will have three satellites in orbit and we will continuously measure the distance between the three satellites with laser links. When a gravitational wave passes by, it will change the distance by a very small amount. We can measure and register that change, and send the data to the ground, to scientists, to analyze the data to determine what was the source of the gravitational wave.”\n\nThe enormous scale of the mission presents numerous technical challenges that are expected to take more than a decade to overcome, which is why launch is expected no earlier than the mid-2030s. However, the success of LISA Pathfinder in demonstrating the feasibility of this wild concept is a source of optimism for the team. The enormous scale of the mission presents numerous technical challenges that are expected to take more than a decade to overcome, which is why launch is expected no earlier than the mid-2030s. However, the success of LISA Pathfinder in demonstrating the feasibility of this wild concept is a source of optimism for the team.\n\n“I think it’s fair to say that LISA Pathfinder over-fulfilled our expectations quite a bit,” Jennrich said. “The performance was about, by a factor of 10, better than we designed it and expected it to be. We are very happy and I think the results give us all confidence that the same technology that we will use on LISA will work flawlessly.” “I think it’s fair to say that LISA Pathfinder over-fulfilled our expectations quite a bit,” Jennrich said. “The performance was about, by a factor of 10, better than we designed it and expected it to be. We are very happy and I think the results give us all confidence that the same technology that we will use on LISA will work flawlessly.”\n\nWith that in mind, let’s imagine the moment when LISA does finally reach the launchpad in a little more than a decade, if all goes to plan. Once the trio has spread out into its enormous constellation and finished its tests, it will tune into the kind of low-frequency hums of the universe that have eluded scientists for centuries. With that in mind, let’s imagine the moment when LISA does finally reach the launchpad in a little more than a decade, if all goes to plan. Once the trio has spread out into its enormous constellation and finished its tests, it will tune into the kind of low-frequency hums of the universe that have eluded scientists for centuries.\n\nBesides probing black holes and the structure of the universe, LISA’s most exciting discoveries may be those that cannot be predicted today. Like a giant net in outer space, the gargantuan constellation is likely to catch waves from all kinds of sources that are beyond our current imagination. Besides probing black holes and the structure of the universe, LISA’s most exciting discoveries may be those that cannot be predicted today. Like a giant net in outer space, the gargantuan constellation is likely to catch waves from all kinds of sources that are beyond our current imagination.\n\n“All but one of the signals that LIGO saw are things that we didn't know existed,” Jennrich said. “I’m reasonably sure that we will see something that we don't expect.” “All but one of the signals that LIGO saw are things that we didn't know existed,” Jennrich said. “I’m reasonably sure that we will see something that we don't expect.”\n\n“Even if we don't find anything unexpected, if we just stick to the stuff we already know is out there, to me, it's already mind-boggling,” he concluded. “Even if we don't find anything unexpected, if we just stick to the stuff we already know is out there, to me, it's already mind-boggling,” he concluded.\n\nTo capture such minute disturbances, LIGO uses two twin facilities, one in Washington state and another in Louisiana, that shoot laser beams through tunnels that stretch across 2.5 miles. This technique allows LIGO and similar ground detectors, such as Italy’s Virgo and Japan’s Kamioka Gravitational Wave Detector, to measure the incredibly tiny shift in the distance traveled by the lasers, signaling the presence of a wave. Since that first historic detection in 2015, LIGO and other detectors have recorded dozens of gravitational waves that have exposed the secret behaviors of exotic objects, such as black holes and neutron stars."
    }
]