[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC90b3AtMTAtY3J5cHRvY3VycmVuY2llcy13aXRoLXRoZWlyLWhpZ2gtdHJhbnNhY3Rpb24tc3BlZWRzLWluLTIwMjPSAY4BaHR0cHM6Ly93d3cuYW5hbHl0aWNzaW5zaWdodC5uZXQvYW1wL3N0b3J5L2NyeXB0b2N1cnJlbmN5LWFuYWx5dGljcy1pbnNpZ2h0L3RvcC0xMC1jcnlwdG9jdXJyZW5jaWVzLXdpdGgtdGhlaXItaGlnaC10cmFuc2FjdGlvbi1zcGVlZHMtaW4tMjAyMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Top 10 Cryptocurrencies with Their High Transaction Speeds in 2023 - Analytics Insight",
        "content": "If you are a crypto enthusiast, you might be curious as to which cryptocurrencies have the fastest or fastest transaction speeds. You won't need to look any further because the information you require is right here. This article will focus on the top cryptocurrencies with the fastest transaction speeds and delve deeply into the world of Blockchain transaction speed. In addition, we will investigate the reason why speed is so important in the cryptocurrency industry. In this segment, we should investigate a portion of the highest-level 10 cryptocurrencies in 2023 with their high exchange speeds."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNhbXBhaWduYXNpYS5jb20vYXJ0aWNsZS9nb3Zlcm5tZW50LXRpa3Rvay1iYW4tbWF5LWhhdmUtODIxNnJpcHBsZS1lZmZlY3Q4MjE3LW9uLWJyYW5kcy1hbmQtY3JlYXRvcnMvNDgzNjg20gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Government TikTok ban may have ‘ripple effect’ on brands and creators, warns agency boss | Media - Campaign Asia",
        "content": "Thomas Walters, chief executive, Europe, and co-founder of influencer marketing agency Billion Dollar Boy, believes brands and content creators that have invested heavily in TikTok may suffer after a ban on the app on devices used by UK Government officials was announced today (16 March) by Cabinet Office minister Oliver Dowden.\n\nWalters said: “The move could have a surprising ripple effect for consumers and brands as unease over the platform’s future grows. This ban could significantly shake up the social media landscape in the UK.\n\n“The concern is that it could spook some consumers and brands, reducing the amount of time and investment they put into the platform. That presents a challenge for brands and content creators who have amassed large followings on TikTok, and whose content doesn’t translate across to other platforms perfectly.”\n\nFactors such as TikTok’s personalised algorithm and lack of emphasis on follower count, as well as its shift towards “spontaneous, raw, unfiltered content”, are among the reasons for the platform’s popularity, said Walters.\n\n\n\nHe said a temporary solution would be “for brands and creators to pivot to Instagram and YouTube’s equivalent shortform video content formats – Reels and Shorts, respectively – which are increasing in popularity”.\n\nOther social media platforms would be wise to “capitalise” on the opportunity, according to Walters.\n\n“As for TikTok,” he said, “the platform will need to reassure users and stakeholders of its compliance to fair and transparent data handling to avoid any further damage.”\n\nThe UK Government’s decision follows accusations, heavily denied by TikTok, that the platform shares data with the Chinese Government.\n\nA similar ban was issued by the US in December and by the European Commission last month."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNhbXBhaWduYXNpYS5jb20vYXJ0aWNsZS9nb3Zlcm5tZW50LXRpa3Rvay1iYW4tbWF5LWhhdmUtODIxNnJpcHBsZS1lZmZlY3Q4MjE3LW9uLWJyYW5kcy1hbmQtY3JlYXRvcnMvNDgzNjg20gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Government TikTok ban may have ‘ripple effect’ on brands and creators, warns agency boss | Media - Campaign Asia",
        "content": "Thomas Walters, chief executive, Europe, and co-founder of influencer marketing agency Billion Dollar Boy, believes brands and content creators that have invested heavily in TikTok may suffer after a ban on the app on devices used by UK Government officials was announced today (16 March) by Cabinet Office minister Oliver Dowden.\n\nWalters said: “The move could have a surprising ripple effect for consumers and brands as unease over the platform’s future grows. This ban could significantly shake up the social media landscape in the UK.\n\n“The concern is that it could spook some consumers and brands, reducing the amount of time and investment they put into the platform. That presents a challenge for brands and content creators who have amassed large followings on TikTok, and whose content doesn’t translate across to other platforms perfectly.”\n\nFactors such as TikTok’s personalised algorithm and lack of emphasis on follower count, as well as its shift towards “spontaneous, raw, unfiltered content”, are among the reasons for the platform’s popularity, said Walters.\n\n\n\nHe said a temporary solution would be “for brands and creators to pivot to Instagram and YouTube’s equivalent shortform video content formats – Reels and Shorts, respectively – which are increasing in popularity”.\n\nOther social media platforms would be wise to “capitalise” on the opportunity, according to Walters.\n\n“As for TikTok,” he said, “the platform will need to reassure users and stakeholders of its compliance to fair and transparent data handling to avoid any further damage.”\n\nThe UK Government’s decision follows accusations, heavily denied by TikTok, that the platform shares data with the Chinese Government.\n\nA similar ban was issued by the US in December and by the European Commission last month."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9pcy14cnAtbWFraW5nLWEtY29tZWJhY2stdG8tY29pbmJhc2UtaGVyZXMtd2hhdC15b3UtbmVlZC10by1rbm93L9IBW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9pcy14cnAtbWFraW5nLWEtY29tZWJhY2stdG8tY29pbmJhc2UtaGVyZXMtd2hhdC15b3UtbmVlZC10by1rbm93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Is XRP making a comeback to Coinbase? Here’s what you need to know - AMBCrypto News",
        "content": "Coinbase might relist XRP if Ripple wins the ongoing lawsuit against SEC.\n\nWhales started to amass XRP anticipating a favorable verdict.\n\nCoinbase, the largest U.S.-based cryptocurrency exchange, may have given the XRP community one of the biggest reasons to cheer.\n\nIn an interview with Thinking Crypto host Tony Edward, Coinbase’s Chief Legal Officer (CLO) Paul Grewal hinted that the exchange might relist XRP if the verdict in the two-year-long Ripple vs. SEC lawsuit comes in the former’s favor.\n\n“I am very eager as anyone else to see how the court rules and what I can say, as soon as we have the ruling, we will put in our process to see if we need to revisit our listing decision.”\n\nHowever, the CLO added that the conditions for the same will depend on the basis for the ruling, the judge’s legal reasoning, and Coinbase’s assessment of whether or not the appeals court will uphold the decision.\n\nCoinbase announced the delisting of XRP from the exchange in December 2020, soon after the U.S. Securities and Exchange Commission (SEC) filed a lawsuit against Ripple Labs over claims that the token was a security.\n\nHow much are 1,10,100 XRPs worth today?\n\nThe crypto community awaits summary judgment\n\nNotably, the controversial case is moving to its conclusion, as the verdict is speculated to come in the first half of 2023. Ripple CEO Brad Garlinghouse earlier said that he was confident of Ripple’s chances.\n\nThe verdict could have significant implications for the wider cryptocurrency market. The laws governing the status of cryptocurrencies as commodities or securities are still not very clear.\n\nThere were early signs that after XRP, U.S. regulators were training their guns on the second-largest crypto in the ecosystem, Ethereum [ETH].\n\nRecently, New York State Attorney General Letitia James filed a lawsuit against the crypto exchange Kucoin for issuing tokens that fit the definition of securities. One of the tokens mentioned in the lawsuit was ETH.\n\nWhales spring into action\n\nMeanwhile, anticipating a favorable decision, whales started to amass XRP in bulk. The number of addresses holding between 1,000 to 1 million coins increased significantly over the past month, as per Santiment.\n\nRealistic or not, here’s XRP’s market cap in BTC’s terms\n\nA reason for the accumulation could be that most sellers were giving away tokens at a discount, as shown by falling transaction volume in profit.\n\nThe 30-day MVRV Ratio treaded in negative territory, which lent further credence to the observation. The negative MVRV Long/Short Difference highlighted that short-term holders will realize higher profits.\n\nMoreover, at the time of writing, XRP jumped 4.55% in the 24-hr period, as per CoinMarketCap."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmlzcmFlbDIxYy5vcmcvd2h5LWJhbmstY3Jhc2gtaXNudC1jYXVzZS1mb3ItcGFuaWMtaW4tdGhlLXN0YXJ0dXAtbmF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Why bank crash isn't cause for panic in the startup nation - ISRAEL21c",
        "content": "The collapse of Silicon Valley Bank (SVB), the 16th-largest bank in the United States, has sent shockwaves throughout the global financial markets.\n\nAs the provider of banking services to nearly half of tech and life-science ventures, it is (or was) the go-to bank for the venture-backed startup market.\n\nFor Israelis, this begs the question: How might this seismic event influence the wellbeing of our own high-tech startup environment?\n\nThere have been any number of explanations for the cause of the failure, with the most popular being a run on the bank by its customers. A “run on a bank” is when a large number of a bank’s customers try to withdraw their money from the institution.\n\nAt any given time, a bank doesn’t have all the money deposited with it; rather, the money has been lent out to borrowers.\n\nNot all money on deposit is lent out. Some is held as “reserves” so that the bank has cash for ordinary withdrawals by depositors. However, if too many depositors try to withdraw their money at the same time, the bank will collapse.\n\nWill SVB’s collapse have a substantial ripple effect in Israel, home to “Silicon Wadi,” the tech startup scene that resembles Silicon Valley?\n\nThe short answer is: There won’t be a significant impact.\n\nGood shock absorbers\n\nIsrael’s economy is strong enough to absorb the shock and move on.\n\nThis isn’t meant to sugar-coat the events in the US, as there will be some consequences.\n\nThe collapse of the bank means that some of its clients, including Israeli firms, won’t have access to their funds to cover payroll and other obligations. Unless they have access to other funds, that could push them under.\n\nMany, even most, will have access to other funds. If a venture has promise of success, current investors may lend or invest additional funds in the venture to keep it going.\n\nSimilarly, other investors may also offer to provide funds to the venture.\n\nThe threat of bankruptcy results from the failure of a bank holding its money. A viable business will always be able to find additional funds.\n\nLayoffs vs. positive trends\n\nThat said, the timing isn’t ideal. The Israeli high-tech industry, like that of the US, is currently downsizing — an elegant word for laying off workers.\n\nFor high-tech workers, this isn’t an auspicious time for another blow to the high-tech industry. The result is that we could see a period of heightened layoffs in the high-tech industry in Israel.\n\nIf the layoffs become too significant, this could impact the real-estate industry, which is a major beneficiary of the salaries high-tech workers have been earning.\n\nProf. Micheal Humphries of Jerusalem College of Technology. Photo courtesy of JCT\n\nIsrael’s economy, however, is strong enough to handle the fall. The number of job vacancies, a measure of the economy’s strength, was 142,730 at the end of January 2023 (the most recent data available), up a pinch from December 2022.\n\nThe Central Bureau of Statistics’ Business Tendency Survey, published February 6, 2023, revealed positive economic trends. Foreign tourism has been up 2.9 in the past three months and 4.8% in the prior three-month period.\n\nRecession unlikely\n\nA slowdown in the high-tech sector of the economy will definitely affect the overall economic forecast. However, a recession in Israel due to the banking crises in the U.S. is unlikely.\n\nOn top of the strength of the economy, the government’s promise of intervention, if necessary, further reduces the likelihood of a recession.\n\nWould the government have the resources to finance support of the local high-tech industry?\n\nThis past January, the Finance Ministry confirmed that the previous 12 months (2022) had seen a budget surplus generated by increased revenues, not by decreased expenditures, as was the case in the past.\n\nIn other words, the Israeli economy is performing well enough to the point where tax revenue exceeded government spending.\n\nAccordingly, we can assume that the government will have the necessary funds to stem the tide of a potential recession.\n\nUltimately, that’s why the collapse of SVB shouldn’t make Israelis panic.\n\nMicheal Humphries teaches marketing and management at the Jerusalem College of Technology – Lev Academic Center and is deputy chairman of the Business Administration Department at Touro College Israel, where he teaches finance.\n\nADVERTISEMENT"
    }
]