[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NlYy1sb3Nlcy1yaXBwbGUtYXBwZWFs0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Judge rejects SEC's Ripple interlocutory appeal - Blockworks",
        "content": "Judge Analisa Torres shut down the Securities and Exchange Commission’s hope for an interlocutory appeal on Wednesday.\n\nIn a ruling, Torres wrote that the appeal for a stay of trial was also denied, ensuring that the trial against Ripple CEO Brad Garlinghouse and Christian Larsen will move forward as previously planned.\n\nTorres denied the SEC’s ability to pursue an interlocutory appeal on the grounds that her previous order — which gave Ripple a partial win — did not entail an order that “involved a controlling question of law,” which is necessary for the certification of an interlocutory appeal.\n\nThe court did not find a “substantial ground for difference of opinion,” Torres wrote.\n\nIf neither of those legal standards applied, then the SEC could have argued that the certification would “materially advance the termination of the litigation,” but Torres did not find merit in that argument.\n\n“Here, the SEC has not presented a ‘pure question of law’ that could be ‘decided quickly and cleanly without having to study the record,” Torres wrote.\n\n“The SEC does not argue that the Court applied the wrong legal standard in deciding the cross-motions for summary judgment,” she continued. “Rather, the core of the SEC’s argument is that the Court improperly applied the Howey test to the facts in the undisputed record.”\n\nAs cited by Torres herself, the SEC has said that the Howey test should be applied to “the facts and circumstances at hand,” which means that its argument is not valid.\n\nThe SEC filed its appeal in early August. At the time, the agency said that the appeal would “avoid the possibility of engaging in protracted remedies” in litigation.\n\nRipple did not immediately respond to a request for comment.\n\nDon’t miss the next big story – join our free daily newsletter.\n\nFollow Sam Bankman-Fried’s trial with the latest news from the courtroom."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93ZS1hc2tlZC1jaGF0Z3B0LXdpbGwtdGhlcmUtYmUtYS1yaXBwbGUteHJwLWJ1bGwtbWFya2V0LW5leHQteWVhci_SAV9odHRwczovL2NyeXB0b3BvdGF0by5jb20vd2UtYXNrZWQtY2hhdGdwdC13aWxsLXRoZXJlLWJlLWEtcmlwcGxlLXhycC1idWxsLW1hcmtldC1uZXh0LXllYXIvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "We Asked ChatGPT Will There be a Ripple (XRP) Bull Market Next Year? - CryptoPotato",
        "content": "TL;DR\n\n\n\nRipple’s trial against the SEC in April 2024 is pivotal for XRP’s price.\n\nPartnerships with banks like HSBC and macroeconomic factors will impact its valuation.\n\nXRP is currently more trending than Bitcoin due to recent legal victories.\n\nCould XRP Thrive Next Year?\n\nThe popular AI-powered language model ChatGPT could not directly answer the question of whether the Ripple community will witness a price surge of XRP in 2024. However, it pinpointed several factors that could play a role in such a development.\n\nRegulatory clarity is mentioned as the most fundamental. Ripple’s legal battle against the United States Securities and Exchange Commission (SEC) is expected to reach a conclusion next spring as the trial date is set for April 23, 2024.\n\nPreviously, the blockchain enterprise secured two landmark court victories, following which XRP’s price spiked significantly.\n\nAnnouncements of new banking partnerships or adoption by financial institutions come in the second position. It is worth mentioning that the British bank HSBC and the American behemoth Chase Bank recently allowed eligible clients to conduct certain payments in XRP instead of fiat. However, those moves had little-to-no effect on the coin’s valuation.\n\nOverall crypto market trends, technological advancements, supply and demand, speculation, and others complete the list of elements. One factor worth paying particular attention to is the global macroeconomic environment.\n\nIt is safe to assume that a potential recession or any kind of financial crisis could have a negative effect on the entire cryptocurrency sector. On the other hand, positive news surrounding geopolitical conflicts or the Fed’s probable decision to halt its anti-inflationary policy could be welcomed by bulls.\n\nXRP is Currently the Most Trending Crypto\n\nBesides speculating on the future price of the coin, it is important to observe its current condition. The latest Ripple win against its big enemy – the US SEC – has turned the asset into the top trending one in the entire crypto realm.\n\nXRP gathered huge attention and was among the best performers after Ripple’s first landmark victory in July, too. Back then, trades involving the token comprised 21% of the total cryptocurrency trading volume, while BTC was second with 20%."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS9yaXBwbGUtc2F5cy14cnAtbGVkZ2VyLXhscy0zMC1hbW0tdGVzdGluZy1jb21wbGV0ZWQtd2hhdHMtbmV4dNIBUmh0dHBzOi8vdS50b2RheS9yaXBwbGUtc2F5cy14cnAtbGVkZ2VyLXhscy0zMC1hbW0tdGVzdGluZy1jb21wbGV0ZWQtd2hhdHMtbmV4dD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Ripple Says XRP Ledger XLS-30 AMM Testing Completed, What's Next? - U.Today",
        "content": "Advertisement\n\nRippleX announced that XLS-30, a hotly-anticipated upgrade for the XRP Ledger protocol designed to introduce basic DeFi functionalities for XRP holders, is now stress-tested and almost ready for mainnet activation. Here's why it is a crucial milestone for Ripple, XRP Ledger and XRP in 2023.\n\nXLS-30 AMM testing competed: XRP Ledger becomes DeFi blockchain\n\nExtensive performance testing of the XLS-30 upgrade to the XRP Ledger protocol was successfully completed. The update is ready to natively bring basic DeFi functions — cross-assets swap, liquidity providing and trading — to XRPL. This statement was made by the RippleX team on their official X account today, Oct. 7, 2023.\n\n1/ Extensive performance testing of the XLS-30 #AMM has now been completed.\n\n\n\nXLS-30 is a proposed amendment as part of the rippled 1.12.0 upgrade. If adopted, it will bring automated swap, trading, and liquidity provisioning capabilities to the #XRPLedger.https://t.co/Cz1w76uc8c — RippleX (@RippleXDev) October 6, 2023\n\nTechnically, XLS-30 is the most critical part of the upcoming rippled 1.12.0 upgrade. It is set to be a major technological advancement for the entire XRP Ledger ecosystem.\n\nBesides an extensive set of features, the upgrade will introduce several new transaction types that will integrate with the payments engine.\n\nAs recalled by Ripple developers, in July 2023, the proposal underwent stringent third-party audits by the leading blockchain security firm CertiK.\n\nIn early September 2023, XLS-30 and XLS-39 Clawback upgrades were merged to the code base of the proposed release, as covered by U.Today.\n\nWhen mainnet activation?\n\nIn the last 12 months, Ripple developers researched the readiness of the XRP Ledger mainnet to adopt such upgrades in terms of compatibility and performance:\n\nTo complement a secure codebase, the RippleX team has conducted ongoing performance testing of the core XRP Ledger for over a year. A rigorous methodology has been employed to assess the ledger’s and consensus’s performance and latency to ensure the health of XRPL Mainnet\n\nAs such, the blockchain now started the referendum procedure on the necessity of the activation of the proposed changes on the XRP Ledger mainnet.\n\nShould the active nodes supporting the upgrade hit the threshold of 28/35 and hold it for two weeks, the new rippled 1.12.0 upgrade will get activated.\n\nAlso, Evernode, an L2 scaling platform on top of XRP Ledger, completed its audit and is getting closer to public mainnet launch."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS12cy1zZWMtbGF3c3VpdC1oZXJlcy13aGF0LXRvLWV4cGVjdC1mcm9tLW5leHQtdHJpYWwtb24tYXByaWwtMjAyNC_SAWhodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9yaXBwbGUtdnMtc2VjLWxhd3N1aXQtaGVyZXMtd2hhdC10by1leHBlY3QtZnJvbS1uZXh0LXRyaWFsLW9uLWFwcmlsLTIwMjQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Ripple Vs. SEC Lawsuit: Here’s What to Expect From Next Trial on April 2024 - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nA pro-Ripple legal expert, John Deaton, has elucidated on a probable settlement scenario between the U.S. Securities and Exchange Commission (SEC) and Ripple instead of proceeding to trial. Here are the key points from his discussion:\n\nSettlement Instead of Trial: Deaton postulates that a trial is unlikely due to a recent decision viewed as a setback for the SEC. He questions the SEC’s ability to prove its case, advocating for the consideration of a settlement or dismissal of charges to avoid the complexities of a trial​.\n\nDespite a trial date set for April 2024, Deaton boldly predicts that a trial might not occur due to the slender odds of SEC’s success, weak evidence, and hefty legal costs associated with the case​. Settlement Discussions: There have been arrangements for legal counsel representing Ripple and the SEC to engage in settlement discussions before a crucial pretrial conference scheduled for April 16, 2024​.\n\nUS District Judge Analisa Torres mandated Ripple and the SEC to discuss a potential settlement, showcasing a legal pathway toward resolving the lawsuit outside of court​. Factors Influencing Settlement: Deaton emphasizes that any potential settlement should avoid negatively impacting other crypto-related lawsuits, reflecting the broader implications of the Ripple case on the crypto industry​.\n\nHe also points out that the SEC is engaged in other significant legal battles with companies like Coinbase and Binance, which could strain their resources and add complexity to their efforts, thus potentially making a settlement with Ripple a more appealing option​. Potential Reduction of Claim Amount: In upcoming hearings before Judge Torres, there might be debates over the appropriate settlement amount, with Ripple likely aiming to reduce the initial $770,000,000 claim by excluding sales related to On-Demand Liquidity (ODL) and arguing for the inclusion of legitimate business expenses. Impact on Crypto Industry: Deaton expresses concerns over the limited scope of the ruling, which could leave many projects in a regulatory gray area, thus potentially discouraging innovation in the U.S. He underscores the crypto industry’s ongoing quest for comprehensive regulatory clarity for sustained growth and leadership in blockchain technology​.\n\nAlso Read: Ripple Emerges Victorious at PAY360 Awards: A Testament to Its Resilience\n\nThese points encapsulate the crux of Deaton’s argument for a possible settlement between the SEC and Ripple, reflecting on the broader implications for the crypto industry amidst the legal quandaries facing Ripple and other crypto enterprises."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvcmVndWxhdGlvbi9yaXBwbGUtcHJlcGFyZXMtZm9yLWNvdXJ0cm9vbS1zaG93ZG93bi13aXRoLXRoZS1zZWMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Ripple vs SEC — a $200m showdown that's been brewing for two decades - DLNews",
        "content": "Ripple’s fight with the SEC was brewing long before the agency sued the crypto company in 2020 alleging securities violations.\n\nWhile Judge Analisa Torres’ July ruling was seen as a partial victory for the exchange, it was only the latest in a string of events leading up to a courtroom showdown next year.\n\nTo see how we got here and gauge what may come next, here’s a timeline of everything you need to know about the case of the SEC vs. Ripple Labs.\n\nThis story was last updated on October 20.\n\nRipple’s fight with the US Securities and Exchange Commission is far from over.\n\nThe crypto exchange and the SEC are preparing to duke it out in court in the second quarter of next year.\n\nThis, after CEO Brad Garlinghouse said the company had already paid more than $200 million in legal fees so far.\n\nWhen US District Judge Analisa Torres ruled partially in favour of Ripple in July, some crypto pundits hailed it as an unequivocal victory for the firm.\n\nXRP, the token Ripple uses to facilitate transactions on its network, skyrocketed on the back of the verdict.\n\nStill, the SEC, spearheaded by Chair Gary Gensler, was not letting Ripple off the hook. Since the implosion of crypto exchange FTX last year, the agency has fired off a barrage of enforcement at industry, including lawsuits against crypto exchanges Binance and Coinbase.\n\nThis week, the judge denied SEC’s motion to appeal parts of the Ripple verdict. While that was a setback for the regulator, the case is still thundering towards a 2024 trial about the other parts that are yet to be ruled upon.\n\nJoin the community to get our latest stories and updates\n\nWe’ve put together this timeline to help you understand what’s going on, how we got here, and what is likely to happen next.\n\n2004\n\nThe origins of Ripple date back to 2004, when Canadian programmer Ryan Fugger released RipplePay, a peer-to-peer payment programme that predated blockchain technology by several years. Instead of cryptocurrencies, it relied on a form of digital IOUs or credits.\n\n2011\n\nMay: Things really took off in 2011 when cryptographer David Schwartz, Mt. Gox creator Jed McCaleb, and video game designer-cum-chief strategist Arthur Britto became interested in Bitcoin. Together they sought to develop a more efficient system without proof-of-work mining.\n\nIn a 2011 post on the Bitcointalk forum, McCaleb criticised Bitcoin mining’s energy consumption.\n\n2012\n\nJune: Schwartz, McCaleb, and Britto purchased the rights to Fugger’s RipplePay name and brand. They renamed the entity Ripple Labs. The team launched the XRP Ledger.\n\nSchwartz, McCaleb, and Britto purchased the rights to Fugger’s RipplePay name and brand. They renamed the entity Ripple Labs. The team launched the XRP Ledger. August: Angel investor Chris Larsen joined Ripple and eventually became Ripple’s chief operating officer.\n\nAngel investor Chris Larsen joined Ripple and eventually became Ripple’s chief operating officer. Ripple Labs developed Ripple’s blockchain infrastructure, resulting in RippleNet, a payment network.\n\n2013\n\nApril: Ripple received $3.5 million in funding from several investors. At the time, it did not disclose the total figure.\n\nRipple received $3.5 million in funding from several investors. At the time, it did not disclose the total figure. July: McCaleb left Ripple to start a new project.\n\n2014\n\nFebruary 18: MIT Technology Review placed Ripple Labs on its 50 Smartest Companies list, with Ripple taking 50th place.\n\nplaced Ripple Labs on its 50 Smartest Companies list, with Ripple taking 50th place. June: McCaleb founded Ripple rival Stellar. He was previously given nine billion XRP, which were worth about $126 million at the time, for his early work as founder and developer. McCaleb was revealed in 2021 to have sold his holdings for upwards of $2 billion as XRP’s price rose.\n\nMcCaleb founded Ripple rival Stellar. He was previously given nine billion XRP, which were worth about $126 million at the time, for his early work as founder and developer. McCaleb was revealed in 2021 to have sold his holdings for upwards of $2 billion as XRP’s price rose. September: Ripple announced partnerships with banks CBW Bank and Cross River Bank. It said they were the first American banks to adopt Ripple’s open-source distributed transaction infrastructure.\n\n2015\n\nApril: Ripple hired former Yahoo COO Brad Garlinghouse to fill the same role at the payments network. Garlinghouse began to pitch the XRP token for use by banks and institutions as a bridge currency and as a SWIFT alternative.\n\nRipple hired former Yahoo COO Brad Garlinghouse to fill the same role at the payments network. Garlinghouse began to pitch the XRP token for use by banks and institutions as a bridge currency and as a SWIFT alternative. May: FinCEN fined Ripple Labs $700,000 in the “first civil enforcement action against a virtual currency exchanger” in the US, according to the regulator. The agency charged Ripple with “willfully violating” several regulations, including the sale of digital currency without registration, and failure to implement anti-money laundering practices. Ripple immediately surrendered $450,000 to satisfy a portion of the fine, and had to make up the remainder within 30 days.\n\nFinCEN fined Ripple Labs $700,000 in the “first civil enforcement action against a virtual currency exchanger” in the US, according to the regulator. The agency charged Ripple with “willfully violating” several regulations, including the sale of digital currency without registration, and failure to implement anti-money laundering practices. Ripple immediately surrendered $450,000 to satisfy a portion of the fine, and had to make up the remainder within 30 days. October: Ripple Labs rebranded itself as Ripple.\n\nRipple Labs rebranded itself as Ripple. Ripple spent $150,000 on US lobbying as a whole in 2015, according to OpenSecrets, an organisation that tracks US lobbying.\n\n2016\n\nJune: Ripple obtained a virtual currency licence from the New York State Department of Financial Services. It applied under the corporate name XRP II LLC.\n\nRipple obtained a virtual currency licence from the New York State Department of Financial Services. It applied under the corporate name XRP II LLC. September: The company raised $55 million in Series B funding from backers including Standard Chartered, CME Group, and more.\n\nRipple lobbying spend over the years Ripple lobbying spend over the years (Ana Ćurić /Credit: Ana Ćurić/DL News/Flourish)\n\n2017\n\nSeptember: Blockchain startup R3 sued Ripple Labs over a contract dispute that allowed it to purchase XRP at a steep discount until 2019. Ripple’s CEO tried to terminate the contract, which prompted R3 to sue Ripple. R3 has since offered its solutions to a number of central bank digital currency projects.\n\nBlockchain startup R3 sued Ripple Labs over a contract dispute that allowed it to purchase XRP at a steep discount until 2019. Ripple’s CEO tried to terminate the contract, which prompted R3 to sue Ripple. R3 has since offered its solutions to a number of central bank digital currency projects. December: XRP crossed $1 in price, up from $0.0063 on January 1 — a 15,873% moonshot.\n\nXRP crossed $1 in price, up from $0.0063 on January 1 — a 15,873% moonshot. Ripple spent $50,000 on lobbying in 2017, according to OpenSecrets.\n\n2018\n\nJanuary: Ripple said it had provided its xCurrent product to over 100 financial institutions. XRP briefly overtook Ethereum as the number two cryptocurrency by market cap after Bitcoin.\n\nRipple said it had provided its xCurrent product to over 100 financial institutions. XRP briefly overtook Ethereum as the number two cryptocurrency by market cap after Bitcoin. September: Ripple and R3 ended their dispute with a closed-door settlement. They kept the outcome confidential, although papers leaked in 2020 place the settlement figure at more than $240 million.\n\nRipple and R3 ended their dispute with a closed-door settlement. They kept the outcome confidential, although papers leaked in 2020 place the settlement figure at more than $240 million. Ripple spent $450,000 on lobbying in 2018, according to OpenSecrets.\n\n2019\n\nJune 17: Ripple announced a partnership with MoneyGram, one of the largest international money transfer companies, that would see MoneyGram utilise Ripple’s xRapid product. The partnership ended in 2021.\n\nRipple announced a partnership with MoneyGram, one of the largest international money transfer companies, that would see MoneyGram utilise Ripple’s xRapid product. The partnership ended in 2021. December 16: XRP fell to $0.183 from its January 2018 all-time high of $3.32. It tumbled as much of the crypto market suffered from a bear market.\n\nXRP fell to $0.183 from its January 2018 all-time high of $3.32. It tumbled as much of the crypto market suffered from a bear market. Ripple spent $220,000 on lobbying in 2019, according to OpenSecrets.\n\n2020\n\nSeptember 24: The XRP Ledger, or XRPL, foundation was launched as an independent and nonprofit entity to drive adoption of XRP. The foundation raised $6.5 million to create the XRP Community Fund and bolster infrastructure.\n\nThe XRP Ledger, or XRPL, foundation was launched as an independent and nonprofit entity to drive adoption of XRP. The foundation raised $6.5 million to create the XRP Community Fund and bolster infrastructure. December 21: The SEC sued Ripple Labs as well as Garlinghouse and Larsen. The agency claimed Ripple ran an unregistered securities offering. Garlinghouse denied the SEC’s charges and committed the company to a legal battle. XRP dropped from $0.58 to $0.21 on the news.\n\nThe SEC sued Ripple Labs as well as Garlinghouse and Larsen. The agency claimed Ripple ran an unregistered securities offering. Garlinghouse denied the SEC’s charges and committed the company to a legal battle. XRP dropped from $0.58 to $0.21 on the news. December 22: Judge Analisa Torres was assigned to the Ripple case.\n\nJudge Analisa Torres was assigned to the Ripple case. December 28: Crypto exchange Coinbase delisted the XRP token, with Coinbase Chief Legal Officer Paul Grewal citing the recent lawsuit as the primary reason.\n\nCrypto exchange Coinbase delisted the XRP token, with Coinbase Chief Legal Officer Paul Grewal citing the recent lawsuit as the primary reason. Ripple spent $330,000 on lobbying throughout 2020, according to OpenSecrets.\n\n2021\n\nMarch 3: Garlinghouse and Larsen challenged the SEC’s approach, on grounds the agency did not give them fair notice regarding classification of Ripple’s XRP token as a security. They said in letters to the court that the SEC failed to provide clear guidance for crypto firms — a claim that would be echoed by numerous crypto chiefs in one form or another over the next few years.\n\nGarlinghouse and Larsen challenged the SEC’s approach, on grounds the agency did not give them fair notice regarding classification of Ripple’s XRP token as a security. They said in letters to the court that the SEC failed to provide clear guidance for crypto firms — a claim that would be echoed by numerous crypto chiefs in one form or another over the next few years. March 8: The SEC requested a hearing with Judge Sarah Netburn to address the Ripple executives’ fair notice claim and other matters.\n\nThe SEC requested a hearing with Judge Sarah Netburn to address the Ripple executives’ fair notice claim and other matters. March 22: Judge Netburn ruled that XRP possessed value and utility, which differentiated it from cryptocurrencies such as Bitcoin. This ruling was significant as it highlighted legal differences between cryptocurrencies, and paved the way for future classifications and enforcement actions.\n\nJudge Netburn ruled that XRP possessed value and utility, which differentiated it from cryptocurrencies such as Bitcoin. This ruling was significant as it highlighted legal differences between cryptocurrencies, and paved the way for future classifications and enforcement actions. April 13: SEC Commissioner Hester Peirce introduced Safe Harbor Proposal 2.0, which would give crypto firms, “under certain conditions,” a three-year grace period where they would be “exempted from the registration provisions of the federal securities laws” in order to facilitate participation in and the development of a functional or decentralised network.” She also said that the appointment of Gensler as new SEC chair marked “the perfect time for the Commission to consider afresh how our rules can be modified to accommodate this new technology in a responsible manner.”\n\nSEC Commissioner Hester Peirce introduced Safe Harbor Proposal 2.0, which would give crypto firms, “under certain conditions,” a three-year grace period where they would be “exempted from the registration provisions of the federal securities laws” in order to facilitate participation in and the development of a functional or decentralised network.” She also said that the appointment of Gensler as new SEC chair marked “the perfect time for the Commission to consider afresh how our rules can be modified to accommodate this new technology in a responsible manner.” June 14: The court extended a deadline placed on the SEC to August 31. The court had previously asked the agency to disclose its internal policies regarding cryptocurrency trading, conflicts of interest, and securities classifications.\n\nThe court extended a deadline placed on the SEC to August 31. The court had previously asked the agency to disclose its internal policies regarding cryptocurrency trading, conflicts of interest, and securities classifications. August 27: Ripple’s lawyers filed a motion that would require the SEC to disclose its policies regarding crypto trading among agency employees. The filing was rejected by the court in September.\n\nRipple’s lawyers filed a motion that would require the SEC to disclose its policies regarding crypto trading among agency employees. The filing was rejected by the court in September. October 15: An expert discovery deadline was set to gather opinions from various figures in cryptocurrency and traditional finance. The discovery period aimed to flesh out perspectives on the case.\n\nAn expert discovery deadline was set to gather opinions from various figures in cryptocurrency and traditional finance. The discovery period aimed to flesh out perspectives on the case. Ripple spent $1,120,000 on lobbying in 2021, according to OpenSecrets.\n\n2022\n\nSeptember 17: The court granted a request from American crypto advocacy group the Chamber of Digital Commerce to file an amicus curiae brief. Amicus curiae means “friend of the court” and refers to a person or an organisation that is not party to the case. An amicus curiae brief is a written submission to a court where someone can set out legal arguments and recommendations in a given case. In the brief, the Chamber of Digital Commerce picked no side on the SEC’s claim that XRP is an unregistered security, but highlighted what the group said was a lack of regulatory clarity on digital assets laws.\n\nThe court granted a request from American crypto advocacy group the Chamber of Digital Commerce to file an amicus curiae brief. Amicus curiae means “friend of the court” and refers to a person or an organisation that is not party to the case. An amicus curiae brief is a written submission to a court where someone can set out legal arguments and recommendations in a given case. In the brief, the Chamber of Digital Commerce picked no side on the SEC’s claim that XRP is an unregistered security, but highlighted what the group said was a lack of regulatory clarity on digital assets laws. October 31: Coinbase filed a petition with a federal court for an amicus curiae brief on behalf of Ripple Labs. In the brief, Coinbase raised the question of whether or not the SEC had given fair notice prior to its enforcement against Ripple. Coinbase would face enforcement action from the SEC a few months later in 2023.\n\nCoinbase filed a petition with a federal court for an amicus curiae brief on behalf of Ripple Labs. In the brief, Coinbase raised the question of whether or not the SEC had given fair notice prior to its enforcement against Ripple. Coinbase would face enforcement action from the SEC a few months later in 2023. December 2: Following a November 30 deadline, SEC and Ripple Labs’ supporting statements were released to the public. The documents gave new insights into each party’s arguments and legal claims. Both sides urged the appointed judge, Torres, to rule in their favour without sending the case to trial.\n\nFollowing a November 30 deadline, SEC and Ripple Labs’ supporting statements were released to the public. The documents gave new insights into each party’s arguments and legal claims. Both sides urged the appointed judge, Torres, to rule in their favour without sending the case to trial. December 22: The SEC petitioned the court to prevent the release of the “Hinman documents,” which Ripple Labs considered relevant to the case, due to their sensitivity. The documents contained a 2018 draft of a speech given by former SEC director William Hinman, in which he stated that Ethereum’s Ether token was not a security.\n\nThe SEC petitioned the court to prevent the release of the “Hinman documents,” which Ripple Labs considered relevant to the case, due to their sensitivity. The documents contained a 2018 draft of a speech given by former SEC director William Hinman, in which he stated that Ethereum’s Ether token was not a security. Ripple spent $1,080,000 on lobbying in 2022, according to OpenSecrets.\n\n2023\n\nMay 8: CEO Garlinghouse said Ripple had spent $200 million defending the SEC case.\n\nCEO Garlinghouse said Ripple had spent $200 million defending the SEC case. June 6: The SEC sued Coinbase for the unlawful operation of an exchange and facilitation of trade in unregistered securities.\n\nThe SEC sued Coinbase for the unlawful operation of an exchange and facilitation of trade in unregistered securities. June 12: The Hinman documents were made public. While the documents revealed previous statements made by Hinman, their impact was fairly uneventful at the time they were released.\n\nThe Hinman documents were made public. While the documents revealed previous statements made by Hinman, their impact was fairly uneventful at the time they were released. Ripple spent $480,000 on lobbying in the first half of 2023, according to OpenSecrets.\n\nJuly 13: The SEC vs. Ripple Labs case came to a split decision. Torres ruled Ripple’s public sale of XRP to exchanges did not break the law, while its offer of XRP to institutions was deemed illegal. It was determined that the case would go to a jury trial. Coinbase and other exchanges relisted XRP on the back of the verdict.\n\nThe SEC vs. Ripple Labs case came to a split decision. Torres ruled Ripple’s public sale of XRP to exchanges did not break the law, while its offer of XRP to institutions was deemed illegal. It was determined that the case would go to a jury trial. Coinbase and other exchanges relisted XRP on the back of the verdict. July 21: After a judge in the separate Terraform Labs case cast doubt on Torres’ verdict, the SEC hinted at a potential appeal.\n\nAfter a judge in the separate Terraform Labs case cast doubt on Torres’ verdict, the SEC hinted at a potential appeal. July 24: Ripple’s UK and Europe boss Sendi Young told DL News the partial win against the SEC set the stage for further international expansion.\n\n‘Just as this court explicitly rejected the approach of the XRP ruling, another court could explicitly reject this decision just as easily’ — Teresa Goody Guillén\n\nAugust 7: A former SEC litigator commented to DL News that just because the Terra judge rejected Torres’ ruling, it is not game over for Ripple. “Just as this court explicitly rejected the approach of the XRP ruling, another court could explicitly reject this decision just as easily,” said Teresa Goody Guillén, a partner at law firm BakerHostetler and a former litigation counsel for the SEC.\n\nA former SEC litigator commented to that just because the Terra judge rejected Torres’ ruling, it is not game over for Ripple. “Just as this court explicitly rejected the approach of the XRP ruling, another court could explicitly reject this decision just as easily,” said Teresa Goody Guillén, a partner at law firm BakerHostetler and a former litigation counsel for the SEC. August 9: On the same day that Judge Torres set a tentative second-quarter 2024 timeline for the jury trial, the SEC announced it seek to appeal part of her July decision.\n\nOn the same day that Judge Torres set a tentative second-quarter 2024 timeline for the jury trial, the SEC announced it seek to appeal part of her July decision. August 17: DL News revealed that Ripple is among the crypto firms that have spent the most money on US lobbying in 2023. The list includes Binance, Coinbase and Crypto.com.\n\nrevealed that Ripple is among the crypto firms that have spent the most money on US lobbying in 2023. The list includes Binance, Coinbase and Crypto.com. August 28: Ripple took to X, formerly Twitter, to announce that it would host a “community celebration” in New York City in September. “As promised — it’s time for that proper victory party,” Garlinghouse tweeted.\n\nRipple took to X, formerly Twitter, to announce that it would host a “community celebration” in New York City in September. “As promised — it’s time for that proper victory party,” Garlinghouse tweeted. September 6: DL News published a story reporting that Ripple had paid lobbyists to attempt to influence laws that would make the Commodities and Futures Trading Commission the de facto crypto regulator in the US. Many in the crypto community view the CFTC as a friendlier regulator with a softer touch than the SEC. Sam Bankman-Fried, the former CEO of FTX, lobbied for the CFTC to regulate crypto before his exchange collapsed.\n\npublished a story reporting that Ripple had paid lobbyists to attempt to influence laws that would make the Commodities and Futures Trading Commission the de facto crypto regulator in the US. Many in the crypto community view the CFTC as a friendlier regulator with a softer touch than the SEC. Sam Bankman-Fried, the former CEO of FTX, lobbied for the CFTC to regulate crypto before his exchange collapsed. October 3: Torres denied the SEC’s motion for leave to appeal.\n\nTorres denied the SEC’s motion for leave to appeal. October 19: Torres cleared Garlinghouse and Larsen of all claims in the SEC case, with the agency voting to dismiss charges against them without prejudice. The SEC dropped the case against them in a filing. The regulator will continue to pursue its case against Ripple itself.\n\nThis is an evolving story and we will update it as we learn more."
    }
]