[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vcHJvc3BlY3Qub3JnL2Vjb25vbXkvMjAyMy0wMS0xMC1sZXNzb25zLWluZmxhdGlvbi1mZWRlcmFsLXJlc2VydmUtaW50ZXJlc3QtcmF0ZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Learning the Right Lessons From Recent Inflation - The American Prospect",
        "content": "× Expand Seth Wenig/AP Photo Traders work on the floor of the New York Stock Exchange, November 10, 2022.\n\nThis story is part of a Prospect series called The Great Inflation Myths, which takes on the dominant orthodoxies mainstream economists and the Federal Reserve have been espousing about inflation and the need for interest rate hikes to tame it. The series was developed in collaboration with the Political Economy Research Institute (PERI) at the University of Massachusetts Amherst. You can read every piece in the series at prospect.org/ GreatInflationMyths.\n\nThe inflation of 2021-2022 has sparked furious debate over the proper policy response. It also exposed how little innovative thinking has been done on inflation by either macroeconomists or policy analysts since the 1980s price acceleration was ended by the “Volcker shock”—when the Federal Reserve (led by chair Paul Volcker) raised short-term interest rates to 20 percent and threw the economy into its worst recession since the end of World War II.\n\nThese decades of inattention to the full spectrum of inflation’s potential sources and remedies threaten to do grave damage in coming years. Essentially, today’s conventional wisdom holds that the existence of inflation is ipso facto evidence of excess aggregate demand (or desired spending by households, businesses, and governments) relative to the economy’s aggregate supply (its potential to produce goods and services). If the problem of inflation is driven by this kind of macroeconomic “overheating” wherein demand outpaces supply, the policy corollary is straightforward: reduce aggregate demand by reining in spending. Hence the demands for today’s Federal Reserve to emulate its Volcker-era behavior and rapidly raise rates to slow demand growth.\n\nMore from Josh Bivens\n\nBut reining in aggregate demand growth could easily sacrifice the economy’s clearest bright spot in recent years—a strong job market delivering disproportionate gains to low- and moderate-wage workers. Further, too-weak aggregate demand that kept unemployment unnecessarily high was the biggest problem facing the U.S. economy for two full decades before COVID-19 struck. If the inflation of the past 20 months reinforces policymakers’ timidity in boosting aggregate demand to push the economy closer to full employment in coming years, this would be a disaster.\n\nGiven these stakes, analysis of today’s inflation needs a lot more nuance than our current debate is providing. Most importantly, there is plenty of evidence that recent inflation has not been driven simply by the macroeconomic overheating described above. An alternative account of this inflation centers the importance of huge economic shocks from the COVID-19 pandemic and the Russian invasion of Ukraine, and traces out the ripple effects in labor markets that have stemmed from these shocks. These competing accounts of inflation are not just of academic interest—they carry very different policy implications, for both today and the future.\n\nThe Weak Evidence for Macroeconomic Overheating Driving Today’s Inflation\n\nIn early 2021, debate raged about the potential economic effects of the American Rescue Plan (ARP). The ARP, passed in early 2021, was explicitly designed as fiscal stimulus, with large and front-loaded transfers to households as its centerpiece, along with substantial aid to state and local governments.\n\nIt is worth remembering the macroeconomic situation at the time of this debate. Of the 22 million jobs lost due to the COVID-19 shock, barely half had been recovered by December 2020, leaving the economy more than ten million jobs below pre-recession levels. This was a larger jobs gap than we had at the trough of the Great Recession and financial crisis of 2008-2009. Further, the recovery that had begun in May 2020 was flagging. Monthly job gains had been getting smaller and smaller since September of that year, and December 2020—the last month’s data informing the meat of the debate over the ARP—saw outright job losses again. The decision to go for a large fiscal stimulus was very well founded in the evidence.\n\nSome critics of the ARP worried about its potential effect on inflation. The most famous of these worriers was Larry Summers. Summers explicitly framed his concerns as centered around estimates of potential output, and how excess fiscal stimulus would push gross domestic product (GDP) well over the economy’s long-run potential to deliver, hence causing inflation. As he put it:\n\nI agree with the general consensus of progressive economists that it would have been much better if the Obama administration had been able to legislate a much larger fiscal stimulus in early 2009, in response to the Great Recession. Yet a comparison of the 2009 stimulus and what is now being proposed is instructive. In 2009, the gap between actual and estimated potential output was about $80 billion a month and increasing. The 2009 stimulus measures provided an incremental $30 billion to $40 billion a month during 2009—an amount equal to about half the output shortfall.\n\nIn contrast, recent Congressional Budget Office estimates suggest that with the already enacted $900 billion package—but without any new stimulus—the gap between actual and potential output will decline from about $50 billion a month at the beginning of the year to $20 billion a month at its end. The proposed stimulus will total in the neighborhood of $150 billion a month, even before consideration of any follow-on measures. That is at least three times the size of the output shortfall.\n\nThe emergence of higher levels of inflation by mid-2021 has led many to assume this output gap–based reasoning had turned out to be true, and that the inflation was clearly the result of macroeconomic overheating. But there are plenty of reasons to be skeptical.\n\nFor one, this reasoning is very U.S.-centric. But inflation—even outside of food and energy prices—has clearly been global. Every single advanced economy has seen inflation accelerate relative to pre-COVID trends, and most of these countries have seen a large acceleration, whether or not they used large stimulus programs. Some have argued that this just means that every single other advanced country replicated the U.S. “mistake” of overheating their economies. But this would suggest that the extent of inflationary acceleration should be correlated with reductions in unemployment—for overheating to take hold, it must run through labor market tightening. Yet across countries, there is no correlation at all between the reduction in unemployment and the acceleration of inflation in recent years.\n\nDomestically, the reasoning of Summers and other hawks based on output gaps carries a clear prediction when set against pre-COVID forecasts. Because their pre-COVID forecasts indicated no inflationary pressure in coming years, the overheating story implies that either gross domestic product (GDP) has been pushed far above these forecasts or that potential GDP (an estimate of the economy’s productive capacity) has fallen far short. In either case, a positive “output gap” with actual GDP far exceeding the economy’s long-run potential should have appeared. By the third quarter of 2022, GDP was slightly below pre-COVID forecasts. Reasonable estimates of potential GDP that account for the damage done by the pandemic were also slightly below pre-pandemic trends, but the size of the resulting output gap was utterly unremarkable—totally in line with recent past episodes that saw larger and more sustained gaps without generating any inflation at all.\n\nFinally, key aspects of the labor market show little conventional signs of heat. One of the most reliable empirical relationships in modern business cycles is that low and falling unemployment (i.e., an economy that is “heating up”) pushes up the share of corporate-sector income claimed by workers (rather than capital owners). Yet the labor share fell sharply and has remained depressed all through the recent inflationary surge.\n\nAn Alternative Account: Shocks and Ripples\n\nIf inflation was not driven by macroeconomic overheating, what’s the alternative account? Extreme sectoral shocks kicked off large—but steadily diminishing—ripple effects. In this “shocks and ripples” account, if shocks relent, then inflation will normalize—even if it will take some time.\n\nObvious Shocks. The pandemic led to a historically sharp reallocation of consumer spending away from face-to-face services and toward goods consumption and residential investment. Simultaneously, the pandemic introduced huge snarls in global supply chains that need to function smoothly to meet demand for goods and materials used in residential investment. These extreme shocks to both sectoral demand and supply was the spark to inflation in 2021. In 2022, the Russian invasion of Ukraine added another, more familiar shock to energy and food prices.\n\nProponents of the macroeconomic overheating view often refuse to acknowledge that sectoral shocks that lead to large changes in relative prices (i.e., prices for specific goods and services) can cause overall inflation. Their reasoning is that if, say, gas prices rise by 50 percent in a short period, then this should lead to a near-immediate reduction in demand for other goods and services that forces down their prices, leaving overall inflation unaffected. There’s some logic to this, but the time span in which this kind of countervailing demand reduction happens following sectoral price shocks is far longer than they think—measured in years, not months. In short, thinking that sectoral shocks can have profound implications for inflation is not a simple failure to understand macroeconomics. James Tobin, perhaps the greatest macroeconomist of his generation, wrote in 1972 that:\n\ndispersion is inflationary … the rate of wage inflation will depend not only on the overall dispersion of excess demands and supplies across markets but also on the particular markets where the excess supplies and demands happen to fall. An unlucky random drawing might put the excess demands in highly responsive markets and the excess supplies in especially unresponsive ones.\n\nRipples That Were Surprising—But Likely to Decline Without High Interest Rates. These sectoral shocks led to more persistent effects on inflation than many anticipated in part because of a key ripple effect—nominal wage growth accelerated noticeably in late 2021 and early 2022. This nominal wage acceleration did not provide the initial impetus to inflation—the pandemic and war shocks did that. Further, while nominal wage growth accelerated relative to pre-pandemic levels, it remained slower than overall inflation and so actually muffled rather than amplified the inflationary shock.\n\nNominal wage acceleration did keep inflation higher than it would have been had wage growth not budged from its pre-pandemic pace. But even if nominal wage growth had not quickened at all, we still would have had a burst of inflation over the past two years. The reduced inflation that could have been “bought” by keeping unemployment higher and nominal wage growth lower in 2021 and 2022 would have been relatively small—and the price of this slightly slower inflation would have been even larger declines in real wages for working families than we’ve seen.\n\nYet, the wage growth ripple effect stemming from the inflationary shocks invites further analysis. Essentially, the pandemic and war shocks to prices sent economic actors—firms, workers, and consumers—scrambling to protect their own real incomes from higher costs. This aspect of “conflict inflation” was recently highlighted by Olivier Blanchard—perhaps the single most well-pedigreed macroeconomist in the world (MIT professor and former chief economist of the International Monetary Fund). As nonlabor costs rose due to pandemic and war shocks and pushed up prices, workers tried to protect their real (inflation-adjusted) incomes by demanding higher nominal wages. Firms in turn tried to keep their own profit margins intact or even to opportunistically raise them. This cascade of higher nominal wage demands and profit margin hikes intensified the inflationary effect of the initial shocks and made them more persistent.\n\nOne might have expected (I certainly did) that workers’ ability to push up nominal wages to protect their real incomes from rising prices would be extremely limited. Recent decades have seen a relentless campaign of policy-driven wage suppression that kept wage growth extremely muted even during times of very low unemployment.\n\nBut workers showed a surprising degree of bargaining power in 2021 and early 2022. Well before the unemployment rate approached its pre-pandemic levels, employers were pushed to raise wages to attract and retain workers. Most notably, this wage growth occurred in industries where workers often have the least bargaining power and face the lowest pay—in retail and leisure and hospitality, for example.\n\nThere were likely two major changes to labor markets in 2021 that provided temporary boosts to workers’ bargaining power. First, the massive layoffs and business closures that accompanied the pandemic meant that employers’ usual degree of monopsony power over their workers’ wages was abruptly weakened. This usually unequal power keeps workers from even obtaining information about jobs with higher wages in their immediate area, let alone obtaining better jobs.\n\nBy the end of 2020, however, tens of millions of employee-employer ties had been severed by the pandemic, and then at the beginning of 2021 the fiscal relief convinced employers to staff up quickly. This rapid staffing-up happened in the context of workers having far fewer ties binding them to current employers and subverting potential competition for their services than is the norm. But this “severed monopsony” boost to workers’ bargaining power is also likely to fade as new employee-employer matches made in 2021 and early 2022 are cemented. Essentially, the same frictions that hindered workers’ competitive searching for better wages in pre-pandemic times seem highly likely to reassert themselves as labor market churn subsides.\n\nThe second major component of workers’ empowerment in 2021 was the role of pandemic aid in providing a wealth and income buffer. This buffer bought workers time to find employment that suited them while still covering their household necessities, rather than being forced back into the first available job regardless of its fit for them. Stimulus checks, expanded unemployment insurance, and the monthly Child Tax Credit gave tens of millions of workers the ability to accumulate savings and a level of financial security that had been largely unavailable before the pandemic. This translated into significant bargaining power in the labor market. However, while this fiscal support was unprecedented, it was also short-lived, and both employers and workers knew with a high degree of certainty when this aid would turn off. The last stimulus check was mailed in the spring of 2021. Enhanced unemployment insurance and the CTC phased out in fall and winter 2021, respectively. The buffer-for-all provided by fiscal pandemic relief made job search and wage offers in 2021 far different than they were during normal times—and different than they will likely be going forward.\n\nThe High Stakes of an Abstract Debate\n\nWhether recent inflation was caused by “macroeconomic overheating” or by “shocks and ripples” sounds awfully abstract. But the real-world stakes are immense.\n\nA view that sees the mere existence of inflation as evidence of overheating will call for policy measures to cool off the economy quickly. This means the Fed hiking interest rates until demand softens. An obvious knock-on effect of that will be higher unemployment. If the Fed overshoots on rate hikes, the increase in unemployment will be large and cause a lot of misery. Many monetary hawks are clear that they think higher unemployment is a necessary condition for reeling inflation back in. Obviously, if they are wrong and today’s inflation is not caused by general overheating and will relent on its own in coming months without any “need” for higher unemployment, the prospect of Fed overshooting on rate hikes and causing lots of excess unemployment is much greater.\n\nA view that sees recent inflation as the result of generationally large economic shocks and some unexpectedly large but still manageable ripples will have more policy patience. This patience might mean inflation persists a bit longer, but it means the risks of engineering a recession are much lower.\n\nIn the future, a “shocks and ripples” view will focus policymaking attention on broadening the anti-inflation tool kit beyond just having the Fed raise rates and cause higher unemployment. Monitoring for potential shocks (like energy supply/demand imbalances, or supply chain snarls) and making strategic investments and regulatory changes to manage their fallout might be more likely (think temporary excess profits taxes or more active management of the Strategic Petroleum Reserve or even short-term price controls in key sectors).\n\nFrom an analytical point of view, the shocks and ripples view seems persuasive. Wage growth has come down over the past year even as unemployment has remained historically low. Many sectors driving overall price growth due to pandemic shock effects—durable goods and home prices and rentals, for example—are seeing rapid disinflation appear.\n\nAnd yet there has been a fairly recent turn in economic commentary toward the view that the Fed must bring pain to stop economic overheating. If the Fed continues raising rates into 2023, they will very likely snatch defeat from the jaws of potential victory. The greatly sought-after “soft landing”—where unemployment remains low while inflation returns to normal—might already be off the table, sacrificed to the Fed rate hikes that have already happened. But the Fed should try as hard as they can to keep it on the table by showing a lot more policy patience going forward.\n\nFinally, a smart and determined campaign by a mix of academics, policy economists, and genuine grassroots groups in the 2010s was highly influential in convincing more policymakers—including many at the Fed—to be willing to take on more inflation risk if it meant the economy saw longer periods of time with very low unemployment rates. Sustained low unemployment rates carry mammoth social benefits, and before the pandemic large structural forces in the economy were keeping inflation low (too low, in fact). This campaign argued for much more aggressive recession-fighting efforts from both the Fed and fiscal policymakers, and called on the Fed for policy patience as unemployment dropped. This campaign’s broad recommendations and outlook were largely adopted by the Biden administration and the Fed’s response to the pandemic during the first 15 months of recovery.\n\nIt turns out that this was the worst possible test period for these recommendations to be adopted from the perspective of inflation risk and its political fallout. But this “go for growth” approach to recession recovery was the right thing to do—even in the extraordinarily tough circumstances of recovery following the COVID-19 shock. The inflation that we have seen over this time was largely inevitable, not due to a macroeconomic policy mistake. Yes, different policies could have led to lower inflation—but not that much lower, and they would have been accompanied by significantly higher unemployment. If we allow global price shocks driven by pandemic and war to convince us to return to pre-COVID-19 policy passivity in the face of high unemployment and lost decades of potential growth, this will be by far the worst damage wrought by recent years’ inflation."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5wZW1iaW5hdmFsbGV5b25saW5lLmNvbS9hcnRpY2xlcy9hcy1hLWxhbmRvd25lci1ob3ctY2FuLXRoZS1wZW1iaW5hLXZhbGxleS13YXRlcnNoZWQtZGlzdHJpY3QtaGVscC15b3UtZmluZC1vdXQtaW4tcmlwcGxlLWVmZmVjdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "As a landowner, how can the Pembina Valley Watershed District help you? Find out in Ripple Effect! - PembinaValleyOnline.com",
        "content": "Tuesday morning brought another edition of Ripple Effect sponsored by the Red River Basin Commission. This month's program had CFAM Radio 950 Morning Show Co-Host Chris Sumner speaking with staff from the Pembina Valley Watershed District; Tiffany Hemphill - GROW Coordinator East, Samantha Leech - GROW Coordinator West and newly hired District Manager Ryan Sheffield.\n\nThe quartet connected to talk about what regions the PVWD encompasses, and the various programs it offers to landowners, both those who have flood and drought prone operations.\n\nYou can listen to the conversation below."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vcHJvc3BlY3Qub3JnL2Vjb25vbXkvMjAyMy0wMS0xMC1sZXNzb25zLWluZmxhdGlvbi1mZWRlcmFsLXJlc2VydmUtaW50ZXJlc3QtcmF0ZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Learning the Right Lessons From Recent Inflation - The American Prospect",
        "content": "× Expand Seth Wenig/AP Photo Traders work on the floor of the New York Stock Exchange, November 10, 2022.\n\nThis story is part of a Prospect series called The Great Inflation Myths, which takes on the dominant orthodoxies mainstream economists and the Federal Reserve have been espousing about inflation and the need for interest rate hikes to tame it. The series was developed in collaboration with the Political Economy Research Institute (PERI) at the University of Massachusetts Amherst. You can read every piece in the series at prospect.org/ GreatInflationMyths.\n\nThe inflation of 2021-2022 has sparked furious debate over the proper policy response. It also exposed how little innovative thinking has been done on inflation by either macroeconomists or policy analysts since the 1980s price acceleration was ended by the “Volcker shock”—when the Federal Reserve (led by chair Paul Volcker) raised short-term interest rates to 20 percent and threw the economy into its worst recession since the end of World War II.\n\nThese decades of inattention to the full spectrum of inflation’s potential sources and remedies threaten to do grave damage in coming years. Essentially, today’s conventional wisdom holds that the existence of inflation is ipso facto evidence of excess aggregate demand (or desired spending by households, businesses, and governments) relative to the economy’s aggregate supply (its potential to produce goods and services). If the problem of inflation is driven by this kind of macroeconomic “overheating” wherein demand outpaces supply, the policy corollary is straightforward: reduce aggregate demand by reining in spending. Hence the demands for today’s Federal Reserve to emulate its Volcker-era behavior and rapidly raise rates to slow demand growth.\n\nMore from Josh Bivens\n\nBut reining in aggregate demand growth could easily sacrifice the economy’s clearest bright spot in recent years—a strong job market delivering disproportionate gains to low- and moderate-wage workers. Further, too-weak aggregate demand that kept unemployment unnecessarily high was the biggest problem facing the U.S. economy for two full decades before COVID-19 struck. If the inflation of the past 20 months reinforces policymakers’ timidity in boosting aggregate demand to push the economy closer to full employment in coming years, this would be a disaster.\n\nGiven these stakes, analysis of today’s inflation needs a lot more nuance than our current debate is providing. Most importantly, there is plenty of evidence that recent inflation has not been driven simply by the macroeconomic overheating described above. An alternative account of this inflation centers the importance of huge economic shocks from the COVID-19 pandemic and the Russian invasion of Ukraine, and traces out the ripple effects in labor markets that have stemmed from these shocks. These competing accounts of inflation are not just of academic interest—they carry very different policy implications, for both today and the future.\n\nThe Weak Evidence for Macroeconomic Overheating Driving Today’s Inflation\n\nIn early 2021, debate raged about the potential economic effects of the American Rescue Plan (ARP). The ARP, passed in early 2021, was explicitly designed as fiscal stimulus, with large and front-loaded transfers to households as its centerpiece, along with substantial aid to state and local governments.\n\nIt is worth remembering the macroeconomic situation at the time of this debate. Of the 22 million jobs lost due to the COVID-19 shock, barely half had been recovered by December 2020, leaving the economy more than ten million jobs below pre-recession levels. This was a larger jobs gap than we had at the trough of the Great Recession and financial crisis of 2008-2009. Further, the recovery that had begun in May 2020 was flagging. Monthly job gains had been getting smaller and smaller since September of that year, and December 2020—the last month’s data informing the meat of the debate over the ARP—saw outright job losses again. The decision to go for a large fiscal stimulus was very well founded in the evidence.\n\nSome critics of the ARP worried about its potential effect on inflation. The most famous of these worriers was Larry Summers. Summers explicitly framed his concerns as centered around estimates of potential output, and how excess fiscal stimulus would push gross domestic product (GDP) well over the economy’s long-run potential to deliver, hence causing inflation. As he put it:\n\nI agree with the general consensus of progressive economists that it would have been much better if the Obama administration had been able to legislate a much larger fiscal stimulus in early 2009, in response to the Great Recession. Yet a comparison of the 2009 stimulus and what is now being proposed is instructive. In 2009, the gap between actual and estimated potential output was about $80 billion a month and increasing. The 2009 stimulus measures provided an incremental $30 billion to $40 billion a month during 2009—an amount equal to about half the output shortfall.\n\nIn contrast, recent Congressional Budget Office estimates suggest that with the already enacted $900 billion package—but without any new stimulus—the gap between actual and potential output will decline from about $50 billion a month at the beginning of the year to $20 billion a month at its end. The proposed stimulus will total in the neighborhood of $150 billion a month, even before consideration of any follow-on measures. That is at least three times the size of the output shortfall.\n\nThe emergence of higher levels of inflation by mid-2021 has led many to assume this output gap–based reasoning had turned out to be true, and that the inflation was clearly the result of macroeconomic overheating. But there are plenty of reasons to be skeptical.\n\nFor one, this reasoning is very U.S.-centric. But inflation—even outside of food and energy prices—has clearly been global. Every single advanced economy has seen inflation accelerate relative to pre-COVID trends, and most of these countries have seen a large acceleration, whether or not they used large stimulus programs. Some have argued that this just means that every single other advanced country replicated the U.S. “mistake” of overheating their economies. But this would suggest that the extent of inflationary acceleration should be correlated with reductions in unemployment—for overheating to take hold, it must run through labor market tightening. Yet across countries, there is no correlation at all between the reduction in unemployment and the acceleration of inflation in recent years.\n\nDomestically, the reasoning of Summers and other hawks based on output gaps carries a clear prediction when set against pre-COVID forecasts. Because their pre-COVID forecasts indicated no inflationary pressure in coming years, the overheating story implies that either gross domestic product (GDP) has been pushed far above these forecasts or that potential GDP (an estimate of the economy’s productive capacity) has fallen far short. In either case, a positive “output gap” with actual GDP far exceeding the economy’s long-run potential should have appeared. By the third quarter of 2022, GDP was slightly below pre-COVID forecasts. Reasonable estimates of potential GDP that account for the damage done by the pandemic were also slightly below pre-pandemic trends, but the size of the resulting output gap was utterly unremarkable—totally in line with recent past episodes that saw larger and more sustained gaps without generating any inflation at all.\n\nFinally, key aspects of the labor market show little conventional signs of heat. One of the most reliable empirical relationships in modern business cycles is that low and falling unemployment (i.e., an economy that is “heating up”) pushes up the share of corporate-sector income claimed by workers (rather than capital owners). Yet the labor share fell sharply and has remained depressed all through the recent inflationary surge.\n\nAn Alternative Account: Shocks and Ripples\n\nIf inflation was not driven by macroeconomic overheating, what’s the alternative account? Extreme sectoral shocks kicked off large—but steadily diminishing—ripple effects. In this “shocks and ripples” account, if shocks relent, then inflation will normalize—even if it will take some time.\n\nObvious Shocks. The pandemic led to a historically sharp reallocation of consumer spending away from face-to-face services and toward goods consumption and residential investment. Simultaneously, the pandemic introduced huge snarls in global supply chains that need to function smoothly to meet demand for goods and materials used in residential investment. These extreme shocks to both sectoral demand and supply was the spark to inflation in 2021. In 2022, the Russian invasion of Ukraine added another, more familiar shock to energy and food prices.\n\nProponents of the macroeconomic overheating view often refuse to acknowledge that sectoral shocks that lead to large changes in relative prices (i.e., prices for specific goods and services) can cause overall inflation. Their reasoning is that if, say, gas prices rise by 50 percent in a short period, then this should lead to a near-immediate reduction in demand for other goods and services that forces down their prices, leaving overall inflation unaffected. There’s some logic to this, but the time span in which this kind of countervailing demand reduction happens following sectoral price shocks is far longer than they think—measured in years, not months. In short, thinking that sectoral shocks can have profound implications for inflation is not a simple failure to understand macroeconomics. James Tobin, perhaps the greatest macroeconomist of his generation, wrote in 1972 that:\n\ndispersion is inflationary … the rate of wage inflation will depend not only on the overall dispersion of excess demands and supplies across markets but also on the particular markets where the excess supplies and demands happen to fall. An unlucky random drawing might put the excess demands in highly responsive markets and the excess supplies in especially unresponsive ones.\n\nRipples That Were Surprising—But Likely to Decline Without High Interest Rates. These sectoral shocks led to more persistent effects on inflation than many anticipated in part because of a key ripple effect—nominal wage growth accelerated noticeably in late 2021 and early 2022. This nominal wage acceleration did not provide the initial impetus to inflation—the pandemic and war shocks did that. Further, while nominal wage growth accelerated relative to pre-pandemic levels, it remained slower than overall inflation and so actually muffled rather than amplified the inflationary shock.\n\nNominal wage acceleration did keep inflation higher than it would have been had wage growth not budged from its pre-pandemic pace. But even if nominal wage growth had not quickened at all, we still would have had a burst of inflation over the past two years. The reduced inflation that could have been “bought” by keeping unemployment higher and nominal wage growth lower in 2021 and 2022 would have been relatively small—and the price of this slightly slower inflation would have been even larger declines in real wages for working families than we’ve seen.\n\nYet, the wage growth ripple effect stemming from the inflationary shocks invites further analysis. Essentially, the pandemic and war shocks to prices sent economic actors—firms, workers, and consumers—scrambling to protect their own real incomes from higher costs. This aspect of “conflict inflation” was recently highlighted by Olivier Blanchard—perhaps the single most well-pedigreed macroeconomist in the world (MIT professor and former chief economist of the International Monetary Fund). As nonlabor costs rose due to pandemic and war shocks and pushed up prices, workers tried to protect their real (inflation-adjusted) incomes by demanding higher nominal wages. Firms in turn tried to keep their own profit margins intact or even to opportunistically raise them. This cascade of higher nominal wage demands and profit margin hikes intensified the inflationary effect of the initial shocks and made them more persistent.\n\nOne might have expected (I certainly did) that workers’ ability to push up nominal wages to protect their real incomes from rising prices would be extremely limited. Recent decades have seen a relentless campaign of policy-driven wage suppression that kept wage growth extremely muted even during times of very low unemployment.\n\nBut workers showed a surprising degree of bargaining power in 2021 and early 2022. Well before the unemployment rate approached its pre-pandemic levels, employers were pushed to raise wages to attract and retain workers. Most notably, this wage growth occurred in industries where workers often have the least bargaining power and face the lowest pay—in retail and leisure and hospitality, for example.\n\nThere were likely two major changes to labor markets in 2021 that provided temporary boosts to workers’ bargaining power. First, the massive layoffs and business closures that accompanied the pandemic meant that employers’ usual degree of monopsony power over their workers’ wages was abruptly weakened. This usually unequal power keeps workers from even obtaining information about jobs with higher wages in their immediate area, let alone obtaining better jobs.\n\nBy the end of 2020, however, tens of millions of employee-employer ties had been severed by the pandemic, and then at the beginning of 2021 the fiscal relief convinced employers to staff up quickly. This rapid staffing-up happened in the context of workers having far fewer ties binding them to current employers and subverting potential competition for their services than is the norm. But this “severed monopsony” boost to workers’ bargaining power is also likely to fade as new employee-employer matches made in 2021 and early 2022 are cemented. Essentially, the same frictions that hindered workers’ competitive searching for better wages in pre-pandemic times seem highly likely to reassert themselves as labor market churn subsides.\n\nThe second major component of workers’ empowerment in 2021 was the role of pandemic aid in providing a wealth and income buffer. This buffer bought workers time to find employment that suited them while still covering their household necessities, rather than being forced back into the first available job regardless of its fit for them. Stimulus checks, expanded unemployment insurance, and the monthly Child Tax Credit gave tens of millions of workers the ability to accumulate savings and a level of financial security that had been largely unavailable before the pandemic. This translated into significant bargaining power in the labor market. However, while this fiscal support was unprecedented, it was also short-lived, and both employers and workers knew with a high degree of certainty when this aid would turn off. The last stimulus check was mailed in the spring of 2021. Enhanced unemployment insurance and the CTC phased out in fall and winter 2021, respectively. The buffer-for-all provided by fiscal pandemic relief made job search and wage offers in 2021 far different than they were during normal times—and different than they will likely be going forward.\n\nThe High Stakes of an Abstract Debate\n\nWhether recent inflation was caused by “macroeconomic overheating” or by “shocks and ripples” sounds awfully abstract. But the real-world stakes are immense.\n\nA view that sees the mere existence of inflation as evidence of overheating will call for policy measures to cool off the economy quickly. This means the Fed hiking interest rates until demand softens. An obvious knock-on effect of that will be higher unemployment. If the Fed overshoots on rate hikes, the increase in unemployment will be large and cause a lot of misery. Many monetary hawks are clear that they think higher unemployment is a necessary condition for reeling inflation back in. Obviously, if they are wrong and today’s inflation is not caused by general overheating and will relent on its own in coming months without any “need” for higher unemployment, the prospect of Fed overshooting on rate hikes and causing lots of excess unemployment is much greater.\n\nA view that sees recent inflation as the result of generationally large economic shocks and some unexpectedly large but still manageable ripples will have more policy patience. This patience might mean inflation persists a bit longer, but it means the risks of engineering a recession are much lower.\n\nIn the future, a “shocks and ripples” view will focus policymaking attention on broadening the anti-inflation tool kit beyond just having the Fed raise rates and cause higher unemployment. Monitoring for potential shocks (like energy supply/demand imbalances, or supply chain snarls) and making strategic investments and regulatory changes to manage their fallout might be more likely (think temporary excess profits taxes or more active management of the Strategic Petroleum Reserve or even short-term price controls in key sectors).\n\nFrom an analytical point of view, the shocks and ripples view seems persuasive. Wage growth has come down over the past year even as unemployment has remained historically low. Many sectors driving overall price growth due to pandemic shock effects—durable goods and home prices and rentals, for example—are seeing rapid disinflation appear.\n\nAnd yet there has been a fairly recent turn in economic commentary toward the view that the Fed must bring pain to stop economic overheating. If the Fed continues raising rates into 2023, they will very likely snatch defeat from the jaws of potential victory. The greatly sought-after “soft landing”—where unemployment remains low while inflation returns to normal—might already be off the table, sacrificed to the Fed rate hikes that have already happened. But the Fed should try as hard as they can to keep it on the table by showing a lot more policy patience going forward.\n\nFinally, a smart and determined campaign by a mix of academics, policy economists, and genuine grassroots groups in the 2010s was highly influential in convincing more policymakers—including many at the Fed—to be willing to take on more inflation risk if it meant the economy saw longer periods of time with very low unemployment rates. Sustained low unemployment rates carry mammoth social benefits, and before the pandemic large structural forces in the economy were keeping inflation low (too low, in fact). This campaign argued for much more aggressive recession-fighting efforts from both the Fed and fiscal policymakers, and called on the Fed for policy patience as unemployment dropped. This campaign’s broad recommendations and outlook were largely adopted by the Biden administration and the Fed’s response to the pandemic during the first 15 months of recovery.\n\nIt turns out that this was the worst possible test period for these recommendations to be adopted from the perspective of inflation risk and its political fallout. But this “go for growth” approach to recession recovery was the right thing to do—even in the extraordinarily tough circumstances of recovery following the COVID-19 shock. The inflation that we have seen over this time was largely inevitable, not due to a macroeconomic policy mistake. Yes, different policies could have led to lower inflation—but not that much lower, and they would have been accompanied by significantly higher unemployment. If we allow global price shocks driven by pandemic and war to convince us to return to pre-COVID-19 policy passivity in the face of high unemployment and lost decades of potential growth, this will be by far the worst damage wrought by recent years’ inflation."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5wZW1iaW5hdmFsbGV5b25saW5lLmNvbS9hcnRpY2xlcy9hcy1hLWxhbmRvd25lci1ob3ctY2FuLXRoZS1wZW1iaW5hLXZhbGxleS13YXRlcnNoZWQtZGlzdHJpY3QtaGVscC15b3UtZmluZC1vdXQtaW4tcmlwcGxlLWVmZmVjdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "As a landowner, how can the Pembina Valley Watershed District help you? Find out in Ripple Effect! - PembinaValleyOnline.com",
        "content": "Tuesday morning brought another edition of Ripple Effect sponsored by the Red River Basin Commission. This month's program had CFAM Radio 950 Morning Show Co-Host Chris Sumner speaking with staff from the Pembina Valley Watershed District; Tiffany Hemphill - GROW Coordinator East, Samantha Leech - GROW Coordinator West and newly hired District Manager Ryan Sheffield.\n\nThe quartet connected to talk about what regions the PVWD encompasses, and the various programs it offers to landowners, both those who have flood and drought prone operations.\n\nYou can listen to the conversation below."
    }
]