[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy50aGVyaW5nZXIuY29tLzIwMjMvMy8zLzIzNjIzNDY1L2JhcmNlbG9uYS02LTEtcHNnLXRoZS1uaWdodC10aGF0LWNoYW5nZWQtZXVyb3BlYW4tZm9vdGJhbGwtZm9yZXZlci1zZXJnaS1yb2JlcnRvLW5leW1hctIBkAFodHRwczovL3d3dy50aGVyaW5nZXIuY29tL3BsYXRmb3JtL2FtcC8yMDIzLzMvMy8yMzYyMzQ2NS9iYXJjZWxvbmEtNi0xLXBzZy10aGUtbmlnaHQtdGhhdC1jaGFuZ2VkLWV1cm9wZWFuLWZvb3RiYWxsLWZvcmV2ZXItc2VyZ2ktcm9iZXJ0by1uZXltYXI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Mar 2023 08:00:00 GMT",
        "title": "Barcelona 6-1 PSG: The Night That Changed European Football Forever - The Ringer",
        "content": "\n\nJames Allcott is joined by Ed from PSG Talk alongside Dan Hilton from The Barcelona Podcast to analyse why the Barcelona 6-1 PSG caused shock waves throughout Europe. Who was impacted the most? Why is Neymar the main character? And who were the real losers from this match? The trio look at the post-event effects of THAT Sergi Roberto goal, THOSE refereeing mistakes and of course WHAT happened later …\n\nHost: James Allcott\n\nGuest: Ed from PSG Talk, Dan Hilton\n\nProducer: Cai Jones\n\nEditor: Finn McSkimming\n\nAdditional Production: Jonathan Fisher\n\nSubscribe: Spotify"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS9yaXBwbGVzLWtleS1wYXJ0bmVyLWxpbmtzLXdpdGgtbWFzdGVyY2FyZC10by1sYXVuY2gtZGViaXQtY2FyZNIBUmh0dHBzOi8vdS50b2RheS9yaXBwbGVzLWtleS1wYXJ0bmVyLWxpbmtzLXdpdGgtbWFzdGVyY2FyZC10by1sYXVuY2gtZGViaXQtY2FyZD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Mar 2023 08:00:00 GMT",
        "title": "Ripple's Key Partner Links with Mastercard to Launch Debit Card - U.Today",
        "content": "Mexican crypto exchange Bitso announced the launch of a debit card in partnership with Mastercard. The innovation will allow exchange users to pay with the Mexican Peso (MXN) from their Bitso wallet balance wherever Mastercard is accepted. The card is only available to residents of Mexico who have undergone the KYC procedure.\n\nAdvertisement\n\nBitso, Ripple and XRP\n\nBitso is one of Ripple's key partners in the region. As its representatives have previously stated, the partnership with Ripple makes instant money transfers possible for millions of Mexican workers. Bitso's use of Ripple services, such as On-Demand Liquidity, over the past four years has resulted in XRP vs. MXN taking up 54% of all trading volume on the exchange. In comparison, Bitcoin (BTC) versus MXN is in second place with a share of 12%.\n\nWhile it is impossible to say definitively what impact the Bitso card launch will have on Ripple, it seems like a clear win-win situation for XRP. To illustrate the point, the sum of all XRP volumes on all pairs on Bitso is $19.64 million, with a total exchange value of $31.42 million.\n\nThe introduction of debit cards, co-branded with Mastercard, will take the adoption of cryptocurrency services to the next level in Mexico, and it will happen through the largest XRP liquidity holder in Mexico."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9yaXBwbGUtY2VvLXNheXMtYW1lcmljYS1mYWxscy1iZWhpbmQtb3RoZXItY291bnRyaWVzLWluLWNyeXB0by1hZG9wdGlvbi_SAWVodHRwczovL2NyeXB0b3BvdGF0by5jb20vcmlwcGxlLWNlby1zYXlzLWFtZXJpY2EtZmFsbHMtYmVoaW5kLW90aGVyLWNvdW50cmllcy1pbi1jcnlwdG8tYWRvcHRpb24vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Mar 2023 08:00:00 GMT",
        "title": "Ripple CEO Says America Falls Behind Other Countries in Crypto Adoption - CryptoPotato",
        "content": "Brad Garlinghouse – Chief Executive Officer of Ripple – thinks the US is already lagging behind other nations in crypto because of regulatory uncertainty.\n\nHe compared the technology’s potential to the Internet, highlighting America’s decision to embrace it in the 1990s, although its merits were relatively unknown at the time.\n\nThe US is Now Catching up\n\nIn a recent interview for Bloomberg, Garlinghouse argued that countries like Australia, Japan, Singapore, the UK, and Switzerland have already imposed comprehensive rules on the cryptocurrency sector and thus encouraged investors and entrepreneurs to operate on their soil:\n\n“There’s a lot of countries that have taken their time and thoughtfulness to create that clear rules of the road.”\n\nHe advised the American government, specifically the SEC, to do the same and cease the talent exodus offshore.\n\nGarlinghouse gave the early days of the Internet as an example, praising the US for setting a proper regulation in the late 1990s that allowed it to turn into the technology hub it is nowadays:\n\n“Look at the benefits to the United States on a geopolitical basis: to have the Amazons and Googles based and headquartered in the US.”\n\nHe thinks the best crypto regulatory framework should mainly focus on consumer protection. At the same time, the SEC should stop acting like a “hammer” and view everything as “nails” but realize that not all assets are securities.\n\n“These aren’t always going to be securities, some of them are used as currencies.”\n\nThe SEC’s Chairman – Gary Gensler – recently reiterated his opinion that “everything other than bitcoin” is a security. As such, he insisted that all crypto transactions, excluding those involving BTC, should be monitored and supervised by the agency.\n\nSEC-Ripple Case Will Echo Across the Entire Industry\n\nAmerica’s securities watchdog launched a lawsuit against Ripple in 2020, alleging the latter’s executives illegally sold XRP tokens to investors without first registering them as securities. While the legal battle has still not been settled, Garlinghouse believes its outcome will be “pivotal” for the entire sector.\n\n“The SEC bringing the case against Ripple is not really just the case about Ripple or about XRP, it’s really about the industry and how the SEC is going to play in offense and attack the whole industry.”\n\nThe CEO opined that the regulator’s way of setting rules through enforcement is not the right one. Instead, it should allow the technology to grow while ensuring maximum security for investors."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LnNwb3J0YWxzdWIubmV0L2VuL3JpcHBsZS14cnAtcHJpY2UtdG9kYXktYW5kLXdoYXQtaXMtYmV0dGVyLXhycC1vci1sdGMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Mar 2023 08:00:00 GMT",
        "title": "Ripple XRP Price Today and What is Better: XRP or LTC? - Sportalsub.net",
        "content": "XRP and Litecoin are two of the most widespread digital currencies available, each with its own unique characteristics and purposes. Even though they both run on blockchain technology, there is a wide range of distinctions between them.\n\nWhat is Ripple?\n\nXRP is a low-cost digital currency that was formulated to allow expeditious international payments. Unlike LTC, which has an emphasis on decentralization, Ripple is owned by the company Ripple Labs and focuses on integration with existing financial systems – making it an attractive choice for banks worldwide. With its secure payment protocol, XRP offers both private citizens and corporate institutions alike a safe method of sending money around the world quickly and cost-effectively.\n\nXRP is traded on all large crypto exchanges. To check out the Ripple live price, you may address the WhiteBIT, Binance, or any other reputable exchange. As of February 2023, the ripple cryptocurrency price is $0.38. The price of Litecoin is $99.47.\n\nConsidering the market capitalization, XRP is barely bigger than LTC – at approximately $19 billion compared to its counterpart’s around $7 billion. This signifies that XRP has a broader adoption as an online payment protocol while LTC remains foremost used as an electronic currency.\n\nOther compression factors:\n\nOne of the biggest advantages of XRP is its transaction speed and cost. XRP transactions are processed much faster than LTC transactions, and they are significantly cheaper. That makes XRP a popular choice for international money transfers, which can be slow and expensive with traditional banking systems.\n\nOn the other hand, LTC has several advantages over XRP when it comes to decentralization and security. Because the network is not owned by any one entity, it is much more resistant to censorship and government interference. LTC blockchain is also more secure than Ripple, thanks to the immense computing power that is required to mine LTC.\n\nThere is a maximum of 100 billion XRP, whereas Litecoin has an absolute cap of 84 million coins and only 72 million currently available for trading. It potentially impacts its long-term worth and stability due to scarce availability on the market.\n\nRipple cryptocurrency price prediction: by some estimates, the XRP token can reach a value between $1.04 and $1.25 by 2025.\n\nLitecoin forecast sounds more optimistic: $255.41.\n\nShould You Invest in Ripple?\n\nAs with any crypto asset, XRP is known for its high volatility, and investing always comes with risks. Before purchasing any asset, it’s essential to conduct your own research. However, given all the innovative features Ripple brings to the world of finance, there is a good chance that it could replace outdated and inefficient ways of transferring funds worldwide, which may contribute to an increase in the XRP rate.\n\nThe fact that XRP is well-suited for use by banks and financial institutions is promising for the project’s continued development and widespread adoption. Any positive changes in the banking sector could potentially drive up the asset’s value, making it an excellent opportunity to profit from holding XRP tokens.\n\nHow to Invest in Ripple Cryptocurrency and Litecoin?\n\nXRP and LTC have different strengths and weaknesses and have their own unique use cases. While XRP is faster and cheaper for international money transfers, LTC is more decentralized and secure. These assets are listed on all crypto platforms, so getting them will not be a problem. If you are looking for a place to buy XRP with fiat money, try the WhiteBIT platform – the largest exchange in Europe with official registration and a variety of trading tools.\n\nLast Updated on March 3, 2023\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\n"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vYWJjN2NoaWNhZ28uY29tL2NoaWNhZ28tcG9saWNlLW9mZmljZXIta2lsbGVkLWFuZHJlcy12YXNxdWV6LWxhc3NvLWVkdWFyZG8tbWFybW9sZWpvLzEyOTEwODI1L9IBamh0dHBzOi8vYWJjN2NoaWNhZ28uY29tL2FtcC9jaGljYWdvLXBvbGljZS1vZmZpY2VyLWtpbGxlZC1hbmRyZXMtdmFzcXVlei1sYXNzby1lZHVhcmRvLW1hcm1vbGVqby8xMjkxMDgyNS8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Mar 2023 08:00:00 GMT",
        "title": "Chicago police officer killed: Impact of Officer Andrés Vásquez Lasso's murder ripples through police families - WLS-TV",
        "content": "CPD chaplain spoke talks about ministry, how putting faith first in times of crisis can help heal spiritual wounds\n\nFr. Dan Brandt said when one of their brothers or sisters in blue is ripped away through violence in the line of duty, a piece of the department's soul is torn as well.\n\nFr. Dan Brandt said when one of their brothers or sisters in blue is ripped away through violence in the line of duty, a piece of the department's soul is torn as well.\n\nFr. Dan Brandt said when one of their brothers or sisters in blue is ripped away through violence in the line of duty, a piece of the department's soul is torn as well.\n\nFr. Dan Brandt said when one of their brothers or sisters in blue is ripped away through violence in the line of duty, a piece of the department's soul is torn as well.\n\nCHICAGO (WLS) -- Whenever a police officer loses their life, the ripples are felt throughout the city and in the hearts of every Chicago police officer.\n\nCPD Chaplain, Father Dan Brandt, spoke about his ministry and how putting faith first in times of crisis can help heal spiritual wounds.\n\n\"It's something that every day goes through the mind of every officer: 'it could have been me.' And every day, that they put on that uniform it could be them. And they know that and their families know that,\" Fr. Brandt said.\n\nFr. Brandt has ministered with the Chicago Police department for 20 years. He said in just the last 12, he's helped lay to rest at least 20 officers, and will again with Officer Andres Vasquez Lasso.\n\nRELATED | Chicago police officer shot, killed as kids played outside Gage Park school: prosecutors\n\nProsecutors revealed details about the murder of Officer Andres Vasquez-Lasso. He was allegedly shot by Steven Montano outside Sawyer Elementary School.\n\n\"They're doing God's work, and the death of our brother Andres is not in vain,\" Fr. Brandt said. \"He died doing God's work, and frankly, he probably saved at least one life. Sadly he lost his.\"\n\nBrandt said when one of their brothers or sisters in blue is ripped away through violence in the line of duty, a piece of the department's soul is torn as well.\n\n\"I was talking to an officer yesterday whose son caught him crying - 10-year-old son caught dad crying -- and dad wants to be strong for his kids and not scare the kids, and let them know this is certainly a possibility, but it is,\" Fr. Brandt said.\n\nOfficer Vasquez Lasso's wife and family are mourning.\n\n\"He did have a lovely wife who is going to miss him like crazy now. And her family is all in Columbia so she has no one now and it's heartbreakin, and the officers feel it because when one is cut, all bleed,\" Fr. Brandt said.\n\nBut Brandt said through faith, healing can begin. Not just in Vasquez Lasso's family, but for his fellow police officers as well, despite the uncertainty they face every day.\n\n\"The fact that people want to go into this line of work still speaks to the profound sacred nature of this vocation,\" Fr. Brandt said. \"Just the outpouring of support of love and support for the community means the world to our guys and gals out there. And I encourage people, if you're a person of faith prayer changes things.\"\n\nAfter speaking with ABC7, Brandt went to minister to new CPD recruits at the police academy to tell them God is working through them.\n\nImpact of Chicago police officer's murder ripples through first responders' families\n\nNo one knows the pain more than Maria Marmolejo, whose husband Eduardo was killed by a train while investigating a shots fired call in 2018.\n\nA line of police vehicles made its way through Chicago Friday as the body of fallen officer Andres Vasquez Lasso was taken to a funeral home. People stood along the sidewalk and saluted as the ambulance rolled past.\n\nThe impact of that tragedy is felt by people all over the city, including the families of first responders who have lost their own loved ones in the line of duty.\n\nFrom the time her only child was a toddler, Sonya Shaw said her son Stephen had a talkative and persuasive personality. Shaw thought he was going to be a lawyer, but he wanted to do something else.\n\n\"As he got a little older, he started expressing, you know, I want to be in law enforcement,\" Shaw said. \"And I'm like, 'What? During this this climate we are in, are you sure?'\"\n\nStephen Shaw told his mother being a police officer is his calling. The 30-year-old will graduate from the Chicago Police Academy next week.\n\n\"When your child tells you something is their calling, you really have to step back a parent and reassess and listen and take it all in and support,\" she said.\n\nBut Shaw said her heart dropped when hearing about the Officer Andrés Vásquez Lasso killed in the line of duty.\n\nNo one knows the pain more than Maria Marmolejo. Her husband, Eduardo, was killed by a train in 2018 when he and another Chicago police officer were investigating a shots fired call on the South Side.\n\n\"When you sign on to do something like this, you are sacrificing everyone's life,\" said Maria Marmolejo, who also serves as chairwoman of the Gold Star Families. \"Everything will change. It has for me, at least.\"\n\nConcerned about the danger of the job, Marmolejo admitted she was extremely mad when her husband joined the force in his 30s as a father of three girls. But Marmolejo said she understood he was following his passion.\n\n\"I had to support him as the wife I am, and I loved him and this was going to be his calling,\" she said. \"He was so proud of it and excited. How could you not support him?\"\n\nMarmolejo said the pain never goes away, but it does get better with time. She said it gives her comfort knowing her husband so loved being a police officer and viewed it as his calling."
    }
]