[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlcy13aGF0LXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtcmlwcGxlcy14cnAtbGF0ZXN0LWltcG9ydGFudC1wYXJ0bmVyc2hpcC_SAWhodHRwczovL2NyeXB0b3BvdGF0by5jb20vaGVyZXMtd2hhdC15b3UtbmVlZC10by1rbm93LWFib3V0LXJpcHBsZXMteHJwLWxhdGVzdC1pbXBvcnRhbnQtcGFydG5lcnNoaXAvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Here’s What You Need to Know About Ripple’s (XRP) Latest Important Partnership - CryptoPotato",
        "content": "TL;DR\n\nRipple joins forces with crypto exchange Uphold to enhance cross-border payments, with both parties optimistic about the collaboration’s impact.\n\nXRP’s value dropped by 5% recently, despite its peak at $0.58 on October 24.\n\nThe ongoing Ripple-US SEC lawsuit and overall crypto market trends could sway XRP’s future price movements.\n\nRipple’s Latest Collaboration\n\nRipple announced that it had teamed up with the American-based cryptocurrency exchange – Uphold – “to underpin and enhance its cross-border payments infrastructure.” Pegah Soltani – Head of Payments Product at the blockchain enterprise – argued that the platform’s “deep liquidity expertise” could help with the achievement of that goal.\n\n“We see this as the start of our relationship and are excited about what the future holds,” he added.\n\nSimon McLoughlin – Chief Executive Officer at Uphold – also gave his two cents on the partnership, praising Ripple as an important player in the crypto scene and one that “provides a tremendously valuable service to businesses making cross-border payments.”\n\nHe further said that the collaboration illustrates how both firms’ qualities could be combined to “make efficient crypto-to-fiat transfers and bank payouts.”\n\nXRP Retraces Despite the Partnership\n\nThe alliance between Ripple and Uphold has not prompted any price spikes for XRP. Moreover, the coin has plunged by approximately 5% in the past 24 hours after spiking significantly to $0.58 on October 24.\n\nIt is worth mentioning that XRP might experience enhanced volatility in the following months due to the dynamics of the entire cryptocurrency market and potential upcoming developments surrounding the lawsuit between Ripple and the US SEC.\n\nAnalysts and the AI-powered language model – ChatGPT – have assumed that a decisive victory for the blockchain firm could trigger a bull run for the asset. We also released a video depicting XRP’s possible price movement in the remaining months of the year:"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3hycC1wcmljZS1leWVzLTA2MC1hcy1yaXBwbGUtam9pbnMtaGFuZHMtd2l0aC11cGhvbGQtdG8tZW5oYW5jZS1jcm9zcy1ib3JkZXItcGF5bWVudHMtMjAyMzEwMjUxNTQ50gGVAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3hycC1wcmljZS1leWVzLTA2MC1hcy1yaXBwbGUtam9pbnMtaGFuZHMtd2l0aC11cGhvbGQtdG8tZW5oYW5jZS1jcm9zcy1ib3JkZXItcGF5bWVudHMtMjAyMzEwMjUxNTQ5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ripple proponent John Deaton calls SEC an “absolute disgrace” for prosecuting XRP and LBRY - FXStreet",
        "content": "XRP price is testing crucial support after rising by nearly 15% in the past week.\n\nRipple and Uphold announced their partnership to enhance crypto liquidity capabilities on a global scale.\n\nRipple proponent attorney John Deaton called the SEC an absolute disgrace for its prosecution of Ripple and LBRY.\n\nXRP price is eyeing $0.60 as Ripple continues to receive support from its community. The SEC attacking the firm is still a matter of criticism, especially to Ripple enthusiasts who believe the regulator has let bad actors in the crypto space persist.\n\nDaily Digest Market Movers: Ripple and Uphold to enhance cross-border payments\n\nRipple joined hands with global Web3 financial platform Uphold, according to an announcement on Tuesday. The new partnership will provide the payment processor with enhanced crypto liquidity capabilities, which are crucial in improving cross-border payment infrastructure.\n\nRipple’s partnership with banks across the globe has been made in an effort to establish itself as the largest instantaneous cross-border payment processor. Worldwide, governments adopting crypto regulations, as well as Ripple partnering with such firms, will help the company achieve its goals. The impact of the same can be witnessed on XRP price as well.\n\nAdditionally, the support that Ripple has been receiving from the community, as always, continues to be at its best. Proponents like attorney John Deaton have time, and again highlighted the Securities and Exchange Commission’s (SEC) ruthlessness.\n\nDeaton took to X, formerly Twitter, calling the regulator out for prosecuting good actors in the crypto industry, such as LBRY and Ripple, while not batting an eye on alleged fraudsters such as FTX, Sam Bankman-Fried and others that were meeting with the SEC, CFTC and Congressional members.\n\nDeaton stated,\n\n“It should anger you when you realize what an absolute disgrace the SEC has become.\n\nTechnical Analysis: XRP price could see green\n\nXRP price trading at $0.553 is testing a key resistance level of $0.551 after rising by more than 14.7% in the past seven days. Establishing this level as a support floor is crucial for the altcoin’s rally toward $0.600.\n\nReclaiming this price point will confirm a bull run for the XRP price and set the cryptocurrency on the path to recovery from the losses it witnessed throughout August. The Relative Strength Index (RSI) in the bullish zone is indicative of the potential XRP still has for posting green candlesticks.\n\nXRP/USD 1-day chart\n\nHowever, XRP still needs to chart an 8% rally in order to reach $0.600, and a failed breach of this barrier may pull it back down to the present trading price. Losing the $0.551 level, would invalidate the bullish thesis."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzEwLzI1L3JpcHBsZS1wYXJ0bmVycy13aXRoLXVwaG9sZC10by1ib2xzdGVyLWNyb3NzLWJvcmRlci1wYXltZW50cy13aXRoLTMwLXVuZGVybHlpbmctdHJhZGUtdmVudWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ripple Partners with Uphold to Bolster Cross-Border Payments with 30 Underlying Trade Venues - The Crypto Basic",
        "content": "San Francisco-based payments firm Ripple has partnered with U.S.-based trading platform Uphold to bolster its cross-border payment infrastructure.\n\nAccording to an official press release, Ripple plans to leverage solutions provided by Uphold to bolster the existing infrastructure for its cross-border payments solution.\n\nBIG NEWS: @Ripple Forges New Partnership with Uphold to Enhance Underlying Crypto Liquidity Infrastructurehttps://t.co/1gJh95KDTQ pic.twitter.com/FLSDQxO0co — Uphold (@UpholdInc) October 24, 2023\n\n- Advertisement -\n\nRipple’s cross-border payments solution already boasts several advantages over legacy payment systems.\n\nDetails of the Partnership\n\nThe latest collaboration aims to enhance the offering as the San Francisco-based firm seeks growth initiatives despite its long-standing legal battle with the U.S. SEC.\n\nIn the release, Ripple stressed that Uphold’s trading infrastructure simplifies the transfer of assets between traditional currencies and cryptocurrencies over diverse networks. This empowers businesses to cater to their clientele and facilitate transactions on a global scale.\n\nCommenting on the development, Simon McLoughlin, CEO at Uphold, emphasized that Uphold is excited to become a crucial part of Ripple’s journey to facilitate seamless cross-border settlements.\n\n- Advertisement -\n\nAccording to McLoughlin, Uphold’s infrastructure leverages an automated trade system boasting high-frequency capabilities. McLoughlin confirmed that this infrastructure interfaces with up to 30 underlying trade venues. The integration allows Uphold to offer narrow spreads and high liquidity. This shows Ripple aims to integrate these 30 trade venues Uphold uses to enhance cross-border payments.\n\nRipple aims to tap into this architecture for its transnational offering, utilizing it for seamless and quick conversions between crypto and fiat. The partnership is one of numerous collaborations Ripple has inked to expand its cross-border payment solution.\n\nRipple noted that it pioneered the solution to the challenges of international payments by harnessing blockchain and crypto on a massive scale. Over time, Ripple’s product portfolio has expanded to cater to emerging business needs, including tokenization, custody, and liquidity.\n\nRipple serves a diverse clientele spanning more than 55 nations, with payout capabilities extending to over 70 markets. The firm boasts over 20 million cross-border transactions, amounting to $30 billion in transaction volume.\n\nUphold: An Unsurprising Choice\n\nThe partnership with Uphold comes without surprise, as the crypto trading platform has continued to support Ripple and XRP amid the legal battle with the U.S. SEC. While other U.S.-based exchanges delisted XRP due to the SEC’s charges, Uphold chose not to tow that path.\n\nAs a result, the trading platform essentially created a haven for American investors looking to trade XRP when the asset was practically outlawed in the country. Following XRP’s victory in the lawsuit, other exchanges have relisted the asset."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS9lY29ub215L2dhcC1ib2FyZC1tZW1iZXItcmlwcGxlLWNvLWZvdW5kZXItd2FudC1zYXZlLWNyaW1lLXJpZGRlbi1zYW4tZnJhbmNpc2Nv0gFvaHR0cHM6Ly93d3cuZm94YnVzaW5lc3MuY29tL2Vjb25vbXkvZ2FwLWJvYXJkLW1lbWJlci1yaXBwbGUtY28tZm91bmRlci13YW50LXNhdmUtY3JpbWUtcmlkZGVuLXNhbi1mcmFuY2lzY28uYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Gap board member, Ripple co-founder want to save crime ridden San Francisco - Fox Business",
        "content": "San Francisco recently saw a new civic pride campaign go live as part of a bid by business leaders seeking to help the Bay Area city.\n\nAdvance SF, the non-profit behind the campaign, said in a press release it aimed to \"assert San Francisco’s role as an innovative and thriving hub for business and the arts\" and to tout the city as one of the greatest in the world with the new \"It All Starts Here\" ad campaign. It began last week.\n\nIt also seeks to address what it described as the \"negative national narrative\" about the city, according to the campaign’s website.\n\nIndividuals such as Gap board member Bob Fisher and Ripple co-founder Chris Larsen given money to make \"It All Starts Here\" happen, per Advance SF. They are both billionaires — worth $1.2 billion and $2.9 billion respectively according to Forbes — with close ties to the city.\n\nSAN FRANCISCO APARTMENT BUILDING FACING FORECLOSURE, SIGNIFICANT DECLINE IN VALUE\n\nThe non-profit has identified companies such as Levi Strauss, OpenAI, Uber and Lyft as having involvement in the ad campaign as well.\n\nReports have said it cost $4 million.\n\n\"San Francisco has survived great fires, earthquakes and deep recessions, and it keeps coming back — stronger,\" San Francisco Giants CEO and Advance SF board co-chair Larry Baer said in a press release. \"There is no doubt, we have real challenges to overcome, and we know the business community, along with the local community and government, must drive the solutions. With this campaign, we’re creating a spark so that people say, ‘Let’s do this together, because San Francisco is an amazing city and ‘it all starts here.’\"\n\nSome issues in San Francisco that have received widespread attention include homelessness, crime and drugs.\n\nMUSK SAYS X WON'T LEAVE SAN FRANCISCO DESPITE CITY FACING ‘DOOM SPIRAL'\n\nIn a dashboard on its website, the San Francisco Police Department reported the number of crimes that the city has seen from the start of 2023 to Oct. 22 totaled about 40,900.\n\nWithin that time-frame’s total, some offenses — rape, assault, human trafficking, burglary, arson and larceny theft — have posted decreases compared to last year, while others — robbery and motor vehicle theft — have increased. Overall, there was a decline of 6.1% when held up to last year, according to the data.\n\nThis year, a slew of companies also indicated they would exit locations in San Francisco’s downtown area, pointing to reasons varying from changing consumer habits to local business conditions to safety concerns.\n\nAT&T, WESTFIELD MALL, NORDSTROM LEAD SAN FRANCISCO DOWNTOWN EXODUS\n\nMeanwhile, the city’s office space market posted a 34% vacancy rate for the third quarter, according to a recent report from CBRE. The firm said that rate \"is expected to increase further into 2024, but the sharp increase in tenant demand over the last three quarters indicates that leasing activity will rebound\" next year.\n\nFor its efforts to lift San Francisco’s image, the \"It All Start Here\" campaign uses billboards, posters, digital and other forms of media. Its main video ad, which debuted last week, specifically touted technological and cultural innovations from companies and figures that have ties to the city.\n\nThe campaign has debuted just under a month before the city will play host to the Asia-Pacific Economic Cooperation summit. That group plans to hold its leaders’ meeting in San Francisco over multiple days starting Nov. 11.\n\nAPEC has 21 member economies, including the U.S., China, Russia, Mexico and Canada."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvcmlwcGxlLWFuZC11cGhvbGQtZm9yZ2UtcGFydG5lcnNoaXAtZm9yLWNyb3NzLWJvcmRlci10cmFuc2FjdGlvbnMv0gF1aHR0cHM6Ly93d3cuZmluYW5jZW1hZ25hdGVzLmNvbS9jcnlwdG9jdXJyZW5jeS9yaXBwbGUtYW5kLXVwaG9sZC1mb3JnZS1wYXJ0bmVyc2hpcC1mb3ItY3Jvc3MtYm9yZGVyLXRyYW5zYWN0aW9ucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Ripple and Uphold Forge Partnership for Cross-Border Transactions - Finance Magnates",
        "content": "Asset Allocation & Trading in a Lower Interest Rate Environment | FMAS:24 Asset Allocation & Trading in a Lower Interest Rate Environment | FMAS:24 Asset Allocation & Trading in a Lower Interest Rate Environment | FMAS:24 Asset Allocation & Trading in a Lower Interest Rate Environment | FMAS:24 Asset Allocation & Trading in a Lower Interest Rate Environment | FMAS:24 Asset Allocation & Trading in a Lower Interest Rate Environment | FMAS:24\n\nTraditional investment paradigms shift in a lower interest rate environment, compelling investors to reassess their asset allocation and trading strategies. This scenario prioritizes diversification beyond conventional bonds and equities. Investors should adapt by seeking assets with the potential for higher yields, considering global markets, and employing dynamic trading strategies that leverage short-term market fluctuations, all while managing risk more meticulously to safeguard returns. SPEAKER: Roger Eskinazi, Managing Partner at Tickmill South Africa #fmas #fmas24 #fmevents #financemagnates #fintech #technology #onlinetrading #forex #investing #investors 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Traditional investment paradigms shift in a lower interest rate environment, compelling investors to reassess their asset allocation and trading strategies. This scenario prioritizes diversification beyond conventional bonds and equities. Investors should adapt by seeking assets with the potential for higher yields, considering global markets, and employing dynamic trading strategies that leverage short-term market fluctuations, all while managing risk more meticulously to safeguard returns. SPEAKER: Roger Eskinazi, Managing Partner at Tickmill South Africa #fmas #fmas24 #fmevents #financemagnates #fintech #technology #onlinetrading #forex #investing #investors 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Traditional investment paradigms shift in a lower interest rate environment, compelling investors to reassess their asset allocation and trading strategies. This scenario prioritizes diversification beyond conventional bonds and equities. Investors should adapt by seeking assets with the potential for higher yields, considering global markets, and employing dynamic trading strategies that leverage short-term market fluctuations, all while managing risk more meticulously to safeguard returns. SPEAKER: Roger Eskinazi, Managing Partner at Tickmill South Africa #fmas #fmas24 #fmevents #financemagnates #fintech #technology #onlinetrading #forex #investing #investors 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Traditional investment paradigms shift in a lower interest rate environment, compelling investors to reassess their asset allocation and trading strategies. This scenario prioritizes diversification beyond conventional bonds and equities. Investors should adapt by seeking assets with the potential for higher yields, considering global markets, and employing dynamic trading strategies that leverage short-term market fluctuations, all while managing risk more meticulously to safeguard returns. SPEAKER: Roger Eskinazi, Managing Partner at Tickmill South Africa #fmas #fmas24 #fmevents #financemagnates #fintech #technology #onlinetrading #forex #investing #investors 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Traditional investment paradigms shift in a lower interest rate environment, compelling investors to reassess their asset allocation and trading strategies. This scenario prioritizes diversification beyond conventional bonds and equities. Investors should adapt by seeking assets with the potential for higher yields, considering global markets, and employing dynamic trading strategies that leverage short-term market fluctuations, all while managing risk more meticulously to safeguard returns. SPEAKER: Roger Eskinazi, Managing Partner at Tickmill South Africa #fmas #fmas24 #fmevents #financemagnates #fintech #technology #onlinetrading #forex #investing #investors 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more! Traditional investment paradigms shift in a lower interest rate environment, compelling investors to reassess their asset allocation and trading strategies. This scenario prioritizes diversification beyond conventional bonds and equities. Investors should adapt by seeking assets with the potential for higher yields, considering global markets, and employing dynamic trading strategies that leverage short-term market fluctuations, all while managing risk more meticulously to safeguard returns. SPEAKER: Roger Eskinazi, Managing Partner at Tickmill South Africa #fmas #fmas24 #fmevents #financemagnates #fintech #technology #onlinetrading #forex #investing #investors 📣 Stay updated with the latest in finance and trading! Follow FMevents across our social media platforms for news, insights, and event updates. Connect with us today: 🔗 LinkedIn: https://www.linkedin.com/showcase/financemagnates-events/ 👍 Facebook: https://www.facebook.com/FinanceMagnatesEvents 📸 Instagram: https://www.instagram.com/fmevents_official 🐦 Twitter: https://twitter.com/F_M_events 🎥 TikTok: https://www.tiktok.com/@fmevents_official ▶️ YouTube: https://www.youtube.com/@FinanceMagnates_official Don't miss out on our latest videos, interviews, and event coverage. Subscribe to our YouTube channel for more!"
    }
]