[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvcmlwcGxlLXhycC1jaGF0Z3B0LXByZWRpY3RzLTQwMC1yYWxseS10by0zLWhlcmVzLXdoZW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Ripple XRP: ChatGPT Predicts 400% Rally to $3, Here's When - Watcher Guru",
        "content": "XRP, the token utilized by the fintech company Ripple, has faced a 0.8% correction in the last 24 hours. The token is also down by 1.1% over the previous week. Nonetheless, XRP is still up by over 76% since the beginning of the year. XRP began to surge after a US court ruled that Ripple selling the token to retail investors did not fall under securities law. The “non-security” status makes XRP an attractive asset for many investors.\n\nAlso Read: Ripple XRP to Rally 200% and Hit $1.88: Predicts Analyst\n\nAccording to OpenAI’s AI (Artificial Intelligence) chatbot ChatGPT, XRP could end 2023 with a price of $3. The increase translates to a growth of about 400% from current levels. The chatbot cites Ripple’s recent partial victory in its battle with the SEC (Securities and Exchange Commission) and the possibility of a bull run in 2024. Many analysts expect the crypto market to rally in 2024 due to the high probability of a spot Bitcoin (BTC) ETF (Exchange Traded Fund). Both developments could usher in a 2021-like rally for the digital asset industry.\n\nOn the other hand, Google’s Bard AI has forecasted a more conservative outlook for Ripple’s XRP token. As per the AI bot, XRP could reach between $0.5 and $1.8. The AI platform considered market sentiment, regulatory oversight, and institutional adoption, among other factors.\n\nWill Ripple’s XRP face another correction?\n\nSource: Zebpay.com\n\nAlthough XRP has shown incredible performance in 2023, some whale movements have caught the community’s attention. As per the data on Whale Alert, 80 million XRP tokens moved from Ripple to an unknown wallet. The value of the tokens is around $48.11 million.\n\nAlso Read: Ripple XRP Could Rally 480% and Hit $3.8: Predicts Analyst\n\nMoreover, another significant transaction caught the community’s attention when 26.70 million XRP tokens moved to Bitstamp, a Luxembourg City-based exchange.\n\nThe movement of tokens into an exchange is bearish as it may increase sell pressure."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTEvMjkveHJwLWFybXktZXllcy1iaWctYmFuay1wYXJ0bmVyc2hpcHMtZm9yLXJpcHBsZS1hZnRlci1tZXRhY29zLWhzYmMtc3VjY2Vzcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "XRP Army Eyes Big Bank Partnerships for Ripple After Metaco's HSBC Success - The Crypto Basic",
        "content": "Ripple-owned Metaco reported earlier this month that it was now working with banking giant HSBC, a deal that XRP investors hope would bring Ripple even closer to big banks.\n\nSince launching in 2012, Ripple has had one mission: to make global cross-border transfers frictionless. Achieving that objective requires adopting its XRP Ledger solution within existing financial infrastructure, especially those used by the big banks.\n\nFor the past decade, the path to progress for Ripple has been challenging, mainly because of regulatory hurdles and skepticism towards crypto by banking firms. However, the tide is turning after a Ripple portfolio company secured a major deal to provide crypto custody services to banking giant HSBC.\n\n- Advertisement -\n\nEarlier this month, Metaco, a company Ripple acquired for $250 million in May, revealed the HSBC deal. For an industry where such major deals are hard to come by, it is not surprising that XRP holders consider the Metaco/HSBC partnership as one that brings Ripple closer to large banks. Notably, Metaco has also expanded its relationship with Swiss banking behemoth BBVA.\n\nRipple and Metaco Offerings Indirectly Related\n\nRipple’s cross-border payment capabilities backed by the XRP Ledger and the company’s ownership of Metaco all bode well for its continued success. The general consensus is that Metaco will inevitably serve as a channel for Ripple to offer its XRP Ledger and XRP token integration to major banking partners.\n\nIn a recent interview, Metaco’s CEO Adrien Treccani confirmed that such an idea was not mere wishful thinking. He reportedly noted that there is an “indirect link” between Ripple and Metaco’s offerings and that a win for either arm bodes well for the XRPL protocol in the long run.\n\nAdrien Treccani further teased that the XRPL protocol allows Metaco to offer its banking clients a full stack of crypto-based solutions. One area where the Metaco CEO expects the XRPL to be crucial for its clients is in the field of tokenization, a sector that most big banks believe will become blockchain’s most popular use case.\n\n- Advertisement -\n\nIt remains to be seen how long it will take for such wide adoption of Ripple’s XRPL and XRP to come from its Metaco division. However, the reality is that the company seems to be on the right path, and the possibilities excite its loyal community."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1kb3Zpc2gtZmVkLWFuZC1zZWMtZGVsYXktY291bnRlci1yaXBwbGVzLWxlZ2FsLWJhdHRsZS0xMzkyMDc40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "XRP News: Dovish Fed and SEC Delay Counter Ripple's Legal Battle - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTEvMjkvZXhwZXJ0LWNpdGVzLXJpcHBsZXMtbW9udGhseS14cnAtc2FsZS1hcy1wcm9vZi10aGF0LXhycC1wcmljZS1pcy1zdXBwcmVzc2VkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Expert Cites Ripple's Monthly XRP Sale as Proof that “XRP Price is Suppressed” - The Crypto Basic",
        "content": "A notable figure in the crypto community argues that XRP’s price is suppressed amid Ripple’s sales of XRP.\n\nRecently, a pro-XRP crypto vlogger with X username, “Jungle Inc,” conducted a survey gauging the opinion of XRP community members about the widespread view that XRP’s price suffers from any form of suppression or manipulation.\n\nThe poll has been concluded with a few thousand crypto market participants partaking. Of the respondents, the overwhelming majority affirmed that the price of XRP is manipulated.\n\n- Advertisement -\n\nExpert Cites Ripple XRP Sale as Proof\n\nNotably, the poll garnered significant engagement from the community. One of the leading commenters was Jerry Hall, a crypto YouTuber who has attracted followership from other prominent figures in the XRP community, such as attorney John Deaton and Crypto Eri.\n\nIn the reply tweet to the poll, Jerry Hall expressed a longstanding belief in the suppression of XRP’s price, attributing it to Ripple’s monthly market sales. Hall claimed Ripple orchestrated those monthly sales to finance its business operation.\n\nAs a result, he pointed out a misalignment of goals, suggesting that while Ripple benefits from the market, those holding XRP are essentially financing Ripple without receiving reciprocal support.\n\nIn his words: “Bag holders are financing Ripple while Ripple is not financing bag holders,”\n\nI have believed the price of XRP has been suppressed for years. When I realized Ripple was selling into the market on a monthly basis to finance their business I knew Ripple and I had different goals. Bag holders are financing Ripple while Ripple is not financing bag holders — Jerry V Hall (@Jerryvhall1) November 27, 2023\n\n- Advertisement -\n\nRipple’s XRP Sale\n\nThe Crypto Basic has recently reported Ripple’s XRP sale per information from the firm’s most recent quarterly report detailing transactions in the XRP market.\n\nThe report disclosed the sale of more than 0.892 billion XRP during the third quarter of 2023. Based on XRP’s current market value of around $0.614, the sale amounts to a dollar value exceeding $547 million.\n\nNotably, Ripple’s total XRP holdings currently stand at 46.5 billion, with 41.3 billion of these tokens being inaccessible.\n\nXRP Price Manipulation\n\nNotably, the argument around the supposed XRP suppression has been a longstanding discussion in the XRP community. The backbone of the claim is that XRP has failed to see a sustained upward trajectory despite the myriad of positive developments around the digital asset.\n\nBesides, the creator of the recent poll, Jungle Inc, disagreed with Jerry Hall’s view. He questioned the characterization of XRP as “suppressed” given its current valuation. He noted that XRP’s value is equivalent to nearly double the values of competing projects such as Cardano (ADA) and Polkadot (DOT).\n\nMoreover, he stated that historically, XRP has maintained relatively high values, making it less clear-cut to label it as suppressed."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3JpcHBsZS1jdG8tZGF2aWQtc2Nod2FydHotY2FsbHMtZm9yLWxlZ2lzbGF0aXZlLWFjdGlvbi10by1jbGFyaWZ5LWNyeXB0by1yZWd1bGF0aW9ucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Ripple CTO David Schwartz calls for legislative action to clarify crypto regulations - CryptoSlate",
        "content": "David Schwartz, CTO of Ripple, recently shared his thoughts on the changing dynamics of U.S. securities law. Specifically, he addressed its application to digital assets and underscored the necessity for legislative clarity to pave the way for balanced regulation.\n\nSchwartz underscored the flexible nature of the Howey test, which serves as a cornerstone for securities laws. He stressed that its application calls for a nuanced approach rather than a “robotic” one. While he conceded that various court decisions have expanded its interpretation over the years, Schwartz insisted there is still confusion about its application in some cases.\n\nCongressional action\n\nSchwartz’s commentary reflects a growing consensus that the digital asset space may require a fresh legislative perspective to ensure fair and effective regulation.\n\nIn his series of tweets, Schwartz provided a nuanced view of the current legal landscape for digital assets and highlighted the need for a balanced approach, possibly through congressional involvement. He expressed skepticism that courts alone could strike an appropriate balance in defining what constitutes security in the context of digital tokens.\n\nHe hinted that without legislative action, courts might not classify digital tokens as securities. In such a scenario, a congressional response becomes more likely and would be needed for a more balanced approach to regulation, according to Schwartz.\n\nSecurities laws\n\nSchwartz’s comments are rooted in the ongoing debate around the application of the Howey test, which is used to determine whether certain transactions qualify as investment contracts and, thus, are subject to securities laws.\n\nSchwartz asserted that the primary objective of securities laws is to counter securities fraud, which often presents significant detection challenges. He discussed how these laws tackle unique difficulties related to uncovering and penalizing fraud in the securities sector, for example, by mandating disclosure requirements on organizations that seek public investment.\n\nSchwartz noted that while the original Howey test required profits to come “solely” from the efforts of others, subsequent cases have broadened this understanding, acknowledging the influence of market forces. He highlighted that the complexity of defining an investment contract further increases when considering instances where items, given at no cost, are regarded as potential investment contracts.\n\nThe Howey test is codified in SEC v. W.J. Howey Co., 328 U.S. 293 (1946), which reads:\n\n“The test is whether the scheme involves an investment of money in a common enterprise with profits to come solely from the efforts of others. If that test be satisfied, it is immaterial whether the enterprise is speculative or nonspeculative, or whether there is a sale of property with or without intrinsic value (See SEC v. Joiner Corp., supra, 320 U. S. 352.) The statutory policy of affording broad protection to investors is not to be thwarted by unrealistic and irrelevant formulae.”\n\nSchwartz, however, argued that for something to be deemed an investment contract, there must be an actual contractual agreement with the potential for defrauding the investor. He also pondered why certain items, like early works of art or collectibles, are not considered securities despite seemingly meeting the criteria set by the Howey test.\n\nHowever, SEC v. Howey also cites the prevalence of “blue sky” laws in many states as its precedent, complicating Schwartz’s position. According to the Court’s reasoning in constructing the Howey test:\n\n“The term ‘investment contractl is undefined by the Securities Act or by relevant legislative reports. But the term was common in many state ‘blue sky’ laws in existence prior to the adoption of the federal statute, and, although the term was also undefined by the state laws, it had been broadly construed by state courts so as to afford the investing public a full measure of protection. Form was disregarded for substance, and emphasis was placed upon economic reality. An investment contract thus came to mean a contract or scheme for ‘the placing of capital or laying out of money in a way intended to secure income or profit from its employment.'”\n\nIn July, a U.S. court ruled that Ripple’s programmatic sales and distributions of XRP are not securities. The court found that these distributions and sales did not meet the Howey Test criteria. However, XRP sales to institutional buyers could be considered securities due to their understanding of the link between XRP’s price and Ripple’s performance.\n\nMentioned in this article"
    }
]