[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3Lmt1b3cub3JnL3N0b3JpZXMvcmVwb3J0ZXItcy1ub3RlYm9vay1ob3ctdGhlLXJpcHBsZS1lZmZlY3Qtc2VyaWVzLXdhcy1ib3Ju0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Reporter's Notebook: How The Ripple Effect series was born - KUOW News and Information",
        "content": "I’ve been reporting on housing for KUOW for over 10 years, first as a freelancer, and then as a staff reporter. The housing shortage, and the way it shapes the city’s demographics, have become a huge story, but one that can feel really abstract.\n\nOne way I’ve found to tackle that is to take things neighborhood-by-neighborhood, to really hear how it’s affecting folks.\n\nI came to South Park at the request of some neighbors who were upset about the new homes being built there, but quickly learned about the Latino and Southeast Asian communities there that were at risk of getting pushed out. I met with Bunthay Cheam, a member of the Khmer community. He’s also a freelance reporter whose day job is with a nonprofit housing provider, so he has a lot of useful insights. We decided to work together.\n\nWith help from Kamna Shastri of KUOW's Community Engagement team, We held a dinner party and listening session for a few members of his community and heard many stories. I went out and did further reporting on solutions, and brought these back to Bunthay for his perspective.\n\nThe result is a documentary where both the problems and solutions are viewed through the lens of people who are living their consequences."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LndydHYuY29tL2hvbWVwYWdlLXNob3djYXNlL292ZXItYS1xdWFydGVyLW9mLWEtbWlsbGlvbi1kb2xsYXJzLXdvcnRoLW9mLWpld2Vscnktc3RvbGVuLWZyb20tYnJvYWQtcmlwcGxlLWJ1c2luZXNz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Over a quarter of a million dollars' worth of jewelry stolen from Broad Ripple business - WRTV Indianapolis",
        "content": "INDIANAPOLIS --- More than a quarter of a million dollars’ worth in jewelry -- gone in a matter of minutes from a jewelry store in the heart of broad ripple.\n\nOwner Joaquin Parraga says he is the Owner of Diamond Studio by Dejoan in Broad Ripple. He says he has been in the jewelry business for more than 30 years\n\nParraga says he has been serving Indianapolis for the last 14 years. Each customer is by appointment only.\n\n“Soon as I turn around because I don’t put two chains outside – he is running away,” Parraga said.\n\nParraga says on Monday a well-known customer was looking to buy a new piece of jewelry - something bigger, but that customer did something unexpected.\n\n“He left his wallet with his social security card and birth certificate,” Parraga told WRTV.\n\nSurveillance video shows Parraga chasing after him. A police report shows that the estimated value of the chain is $340,000.\n\nIMPD says the case remains under investigation.\n\n“I feel so bad. It’s not just us, it’s about the business. I worry about the business for everybody,\" Parraga said. \"It’s no safety even if the people we know.”\n\nParraga is the latest victim of an unsettling trend. The U.S. Chamber of commerce says more than 50% of small businesses say they were robbed last year.\n\nIMPD says while the department works to make an arrest in all crimes... community is always helpful.\n\n“I hope the police find this guy and take him off the streets and he don’t rob anybody else,” Parraga concluded.\n\n"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdS50b2RheS94cnAtYnV5YmFjay1ub3QtcG9zc2libGUtc2F5cy1leC1yaXBwbGUtZXhlY3V0aXZl0gFFaHR0cHM6Ly91LnRvZGF5L3hycC1idXliYWNrLW5vdC1wb3NzaWJsZS1zYXlzLWV4LXJpcHBsZS1leGVjdXRpdmU_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "XRP Buyback Not Possible, Says Ex-Ripple Executive - U.Today",
        "content": "A new wave of discussion about government buyback of XRP tokens emerged a few days after Valhil Capital's managing director, Jimmy Vallee, spoke in an interview, discussing what XRP might be worth now if not for the SEC's prosecution. He once again suggested that the cryptocurrency could be bought back if the regulator is defeated in court.\n\nAdvertisement\n\nVallee has long promoted his buyback theory about XRP and has also speculated that the token will be worth $35,000 at some point. He believes that will happen when all banks switch to ISO20022 and use XRP.\n\nCommon sense\n\nMany in the XRP community are rather pessimistic about such assumptions. Ripple's former director of developer relations, Matt Hamilton for example, considers Vallee's claims to be complete fantasy, a scenario that is logically impossible.\n\nCome on Eri, It is all a complete fantasy. There is no scenario in which a buyback makes any logical sense. — Matt Hamilton (@HammerToe) January 3, 2023\n\nHe noted, however, that even if a buyback of XRP were to occur, its price could not be considered fair value because the second is formed solely by market laws. Commenting on the possibility that the buyback would happen to make XRP the new government currency, Hamilton also questioned what prevents the government from simply buying the tokens from the market.\n\nAs a general summary of Vallee's words, Hamilton said he was suspicious of his and Valhil Capital's activity, and that so far \"he has been saying more clever words than doing anything.\""
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdS50b2RheS94cnBsLXRvcC11c2UtY2FzZXMtaW4tMjAyMy1pbmRpY2F0ZWQtYnktY29tbXVuaXR50gFFaHR0cHM6Ly91LnRvZGF5L3hycGwtdG9wLXVzZS1jYXNlcy1pbi0yMDIzLWluZGljYXRlZC1ieS1jb21tdW5pdHk_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "XRPL Top Use Cases in 2023 Indicated by Community - U.Today",
        "content": "Advertisement\n\nA community-managed account for Ripple, XRP token and XRP Ledger blockchain, dubbed @WKahneman, recalls the core elements of RippleNet multi-purpose platform and their main use cases.\n\nFrom xCurrent, xRapid and xVia to RippleNet: Long story short\n\nThe anonymous XRP enthusiast who goes by @WKahneman on Twitter shared a thread designed to explain the design of Ripple's XRP-based solutions for newcomers to its ecosystem.\n\nA brief overview for folks reading about @Ripple & $XRP use in 2023. Years ago, Ripple offered 3 products:\n\nxCurrent = payment messaging\n\nxRapid = #XRP as bridge currency\n\nxVia = an API solution\n\nCo's originally signed bilateral agreements w/ partners to move value. And now?\n\n1/3 pic.twitter.com/yAgM5onogN — WrathofKahneman (@WKahneman) January 2, 2023\n\nHe recalled that some years ago, Ripple offered three solutions for businesses and individuals focused on seamless cross-border value transfers.\n\nThe first one, xCurrent, facilitated messaging in payment channels. xRapid instrument leveraged XRP as a bridge currency for seamless payments. xVia in this stack served as an API solution suitable for being integrated into various business designs.\n\nIn 2023, all of these functions are integrated into a single ecosystem, RippleNet. RippleNet, in turn, leverages XRP as a currency for On-Demand Liquidity (ODL) payment corridors in various regions of the globe. RippleNet removes the need for bilateral agreements between the parties.\n\nODL solutions expanded to new regions in 2022\n\nAs such, direct usage of XRP is not necessary any longer; clients use RippleNet without swapping their funds to XRP themselves.\n\nLast year was a crucial period for Ripple and its XRPL solutions, including ODL. In its detailed report shared in Q4, 2022, the Ripple team highlighted that expansion to Africa, Argentina, Belgium, Israel, Australia, Brazil, Singapore, the UAE and the U.K. is the company's top priority.\n\nIn 2023, Ripple's payments solutions are used not only for cross-border transfers but also for payments of crypto friendly SMEs and e-commerce platforms."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYml0Y29pbmlzdC5jb20vcmlwcGxlLWNlby1pcy1jYXV0aW91c2x5LW9wdGltaXN0aWMtZm9yLTIwMjMv0gFIaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9yaXBwbGUtY2VvLWlzLWNhdXRpb3VzbHktb3B0aW1pc3RpYy1mb3ItMjAyMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Ripple CEO Garlinghouse Is 'Cautiously Optimistic' For 2023 - Bitcoinist",
        "content": "Ripple Labs CEO Brad Garlinghouse doesn’t often get to speak on Twitter, but when he does, he usually delivers a powerful message. Yesterday, Garlinghouse took to Twitter again to deliver a prediction for 2023.\n\nThe Ripple CEO explained that yesterday was the first day of the 118th U.S. Congress, and while efforts to bring regulatory clarity to crypto in the U.S. have stalled on and off in recent years, he expects that 2023 is the year “we will (finally!) see a breakthrough.”\n\nHere’s Why Ripple CEO Says 2023 Could Be Different\n\nGarlinghouse reasons that support for regulation is bipartisan and bicameral. Leaders have publicly supported blockchain technology and recognized the need for clarity.\n\nSpecifically, the Ripple CEO supports the policy pushes of Patrick McHenry (Republican), Glenn “GT” Thompson (Republican), Tom Emmer (Republican), Ritchie Torres (Democrat), Ro Khanna (Democrat), Sen. Debbie Stabenow (Democrat), John Boozman (Republican), Kirsten Gillibrand (Democrat), Sen. Cynthia Lummis (Republican), and Cory Booker (Democrat).\n\nAs the Ripple CEO says, the industry is no longer working with a blank sheet of paper. “Prior bills have tried to address everything from stablecoins and CEXs (RFIA and DCEA); clearer definitions of what constitutes a digital asset security (Securities Clarity Act); safe harbors (Clarity for Digital Tokens Act) and more,” Garlinghouse elaborated.\n\nAt the same time, he expressed that no bill is perfect and there will likely never be one that satisfies everyone. “But perfect shouldn’t be the enemy of progress.” According to him, the proposals offer a basis for discussion, and the “stakes couldn’t be higher.”\n\nAs in previous tweets and the court documents in the legal battle with the U.S. Securities and Exchange Commission, Garlinghouse points to other countries that he sees as leading the way for the crypto industry. “Singapore, the EU, Brazil, and Japan all have crypto frameworks – and the UK is well ahead of the US,” the Ripple CEO says.\n\nHe also warns of the danger of non-regulation in the U.S. The lack of coordinated standards globally or any in the U.S. continues to push businesses to countries with lower regulatory bars. “BG” cites the collapse of FTX as a bad example with a disastrous outcome.\n\nLooking optimistically into the future, the Ripple CEO concludes his hope with the following words:\n\nChanging the status quo is never easy but I believe that the will to act exists. The building blocks for regulation have already been introduced, […] The 118th Congress has a historic opportunity before it to ensure the US remains an innovation leader for decades to come. We hope it’s one they take.\n\nAt press time, XRP was down 0.8% in the last 24 hours and the price stood at $0.3473, facing major resistance at $0.3539\n\nFeatured image from Protocol.com, Chart from TradingView.com"
    }
]