[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2E4MGFkNjE0LTU1Y2UtNGZjYy1iMjNiLTE4NTY3Nzg2OTIwOdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Relief and pain ripple across Israel after first hostages released - Financial Times",
        "content": "Try unlimited access\n\nOnly S$1 for 4 weeks\n\nThen S$99 per month.\n\nComplete digital access to quality FT journalism on any device. Cancel anytime during your trial."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2E4MGFkNjE0LTU1Y2UtNGZjYy1iMjNiLTE4NTY3Nzg2OTIwOdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Relief and pain ripple across Israel after first hostages released - Financial Times",
        "content": "Try unlimited access\n\nOnly S$1 for 4 weeks\n\nThen S$99 per month.\n\nComplete digital access to quality FT journalism on any device. Cancel anytime during your trial."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2E4MGFkNjE0LTU1Y2UtNGZjYy1iMjNiLTE4NTY3Nzg2OTIwOdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Relief and pain ripple across Israel after first hostages released - Financial Times",
        "content": "Try unlimited access\n\nOnly S$1 for 4 weeks\n\nThen S$99 per month.\n\nComplete digital access to quality FT journalism on any device. Cancel anytime during your trial."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmZveHdlYXRoZXIuY29tL2V4dHJlbWUtd2VhdGhlci9kb2RnZS1jaXR5LWthbnNhcy1jbG91ZHMtb2NlYW4td2F2ZXPSAVNodHRwczovL3d3dy5mb3h3ZWF0aGVyLmNvbS9leHRyZW1lLXdlYXRoZXIvZG9kZ2UtY2l0eS1rYW5zYXMtY2xvdWRzLW9jZWFuLXdhdmVzLmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Watch: Kansas clouds ripple ‘like ocean waves’ in mesmerizing time lapse video - Fox Weather",
        "content": "DODGE CITY, Kan. – The skies above the southern Kansas wheat fields looked more like a scene peering out into the Gulf Coast Friday.\n\n\"The clouds today look like ocean waves when seen through a time lapse,\" said the National Weather Service office in Dodge City.\n\nHORSESHOE CLOUD SPOTTED GLIDING ACROSS FLORIDA SKIES AMONG WORLD’S RAREST\n\nThe mesmerizing video transformed the gray sky into a Caribbean display as a sea of undulatus asperatus clouds rippled over the Sunflower state.\n\nIf you feel like the scene calls for flip-slops and sunscreen, hold off on that thought. The weekend in central Kansas is forecast to bring snow and extremely cold temperatures. Some areas may see up to 7 inches of snow accumulation.\n\nCENTRAL PLAINS SLAMMED WITH 4-8 INCHES OF SNOW, MAKING FOR TREACHEROUS THANKSGIVING TRAVEL\n\nThe formation of undulatus asperatus clouds is considered rare by the NWS. The name translates approximately as roughened or agitated waves.\n\nAlthough they appear dark and storm-like, they tend to dissipate without a storm forming. The ominous-looking clouds have been particularly common in the Plains states, often during the morning or midday hours following convective thunderstorm activity, the NWS notes."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMinAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3JpcHBsZS1haW1zLXRvLXRhcC0zMDAtdHJpbGxpb24taW5kdXN0cnktdGhyb3VnaC1ibG9ja2NoYWluLXhycC1wcmljZS1zdGlsbC1zdHJ1Z2dsZXMtdG8tcmVjb3Zlci0yMDIzMTEyNDIzNTHSAaABaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvcmlwcGxlLWFpbXMtdG8tdGFwLTMwMC10cmlsbGlvbi1pbmR1c3RyeS10aHJvdWdoLWJsb2NrY2hhaW4teHJwLXByaWNlLXN0aWxsLXN0cnVnZ2xlcy10by1yZWNvdmVyLTIwMjMxMTI0MjM1MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Ripple plans to be the torchbearer of the potential $300 trillion cross-border payment industry - FXStreet",
        "content": "XRP price observed some increase in the past day but not enough to initiate a recovery rally.\n\nUntil XRP holders begin accumulating again, the chance of a rally akin to the end of October is unlikely.\n\nThe Head of Payments Product at Ripple stated that the company intends to be a large part of the potentially $300 trillion cross-border payment industry.\n\nXRP price is close to taking a break from the active downtrend, but the altcoin still does not have enough bullish momentum to initiate a recovery rally. For the most part, the focus of the parent company Ripple is now on the macro-financial aspect, as evidenced by an executive who stated that the payment processor is eyeing the global cross-border payment industry.\n\nRipple has its next target\n\nRipple, which has been a key entity in connecting banks and other financial institutions for conducting instantaneous cross-border payments, is now looking to double down on the same. According to the Head of Payments Product at Ripple, Pegah Soltani, the company intends to revolutionize the cross-border payment sector, potentially using a powered solution.\n\nAccording to Soltani, the industry has the capability of becoming a $300 trillion sector by 2030, and if Ripple manages to become a crucial part of it, it would unlock immense profits for not just the company but for XRP holders as well.\n\nAs is, XRP is an important part of institutional investors' holdings. As observed in the Coinshares’ report, for the week ending November 17, XRP bought in over half a million dollars in investment, bringing its month-to-date inflows to $17 million. Consequently, since the beginning of the year, the cryptocurrency has managed to bring in $68 million, which is much higher than the other assets on the list, such as Cardano (ADA), Tron (TRX), etc.\n\nRipple institutional inflows\n\nThis is expected to act as a bullish catalyst for XRP price as well.\n\nXRP price continues to struggle\n\nXRP price is likely set to begin a sideways movement, trading at $0.620 at the time of writing. Over the past two weeks, the altcoin has declined by close to 19% but gained slightly in the past 48 hours.\n\nNevertheless, the larger picture ascertains that until XRP manages to reclaim $0.644 as a support floor, a recovery rally is unlikely. The Moving Average Convergence Divergence (MACD) indicator has also yet to confirm a bullish crossover, as the bars on the histogram are still red, suggesting that the bearishness is waning.\n\nThus, a retest of $0.644 would prove to be the bullish boost needed for Ripple to initiate a recovery rally and send the XRP price to $0.700.\n\nXRP/USD 1-day chart\n\nHowever, if the sideways movement continues and XRP fails to produce enough bullishness, it could slip back down to test $0.600 as support. Falling through this line would invalidate the bullish thesis and push the altcoin to $0.551.\n\nInvestors need to make a move\n\nBy the looks of it, the XRP price is bound to witness sideways movement for a while since the investors are not making a definite move at the moment. Neither are XRP holders willing to sell their assets to book profits or offset losses nor are they trying to accumulate more tokens to instill a sense of bullishness in the market.\n\nThis is evident by looking at the Market Value to Realized Value (MVRV) ratio. This indicator is used to assess the average profit/loss of investors who purchase an asset. The 30-day MVRV ratio measures the average profit/loss of investors who purchased an asset in the past month.\n\nFor Ripple, when the 30-day MVRV hits 12% to 23%, XRP has undergone major corrections. At this time, investors are likely to sell their holdings to realize profits, which could trigger a sell-off. Hence, this area is termed a danger zone.\n\nLikewise, when the MVRV value hit anywhere between -17% and -32%, it was often followed by rallies. Hence, this area is termed an “opportunity zone” and an ideal place for accumulation.\n\nRipple MVRV ratio\n\nBut since XRP has missed hitting either zone during the recent rally and correction, investors are likely going to refrain from making a move until they witness clearer signs. Thus, Ripple will most likely have to wait for either accumulation or selling and consequently continue moving sideways for a while."
    }
]