[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vdmFyaWV0eS5jb20vMjAyMy9maWxtL2dsb2JhbC91bHJpY2gtdGhvbXNlbi1yaXBwbGUtam9leS1tb2UtamFzbWluLWppcmFtYW5pLTEyMzU2MDk2ODQv0gFjaHR0cHM6Ly92YXJpZXR5LmNvbS8yMDIzL2ZpbG0vZ2xvYmFsL3VscmljaC10aG9tc2VuLXJpcHBsZS1qb2V5LW1vZS1qYXNtaW4tamlyYW1hbmktMTIzNTYwOTY4NC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ulrich Thomsen Among Nordic Stars to Headline Psychological Thriller ‘Ripple’ by Super8 Grads Joey Moe, Jasmin Jiramani (EXCLUSIVE) - Variety",
        "content": "Ulrich Thomsen (“”Festen,” “Banshee”), Rasmus Hammerich (“On My Mind”), Ida Marie Nielsen (“Vikings”) and Diêm Camille (“Washington Black”) are set to headline “Ripple,” a graduation film by promising new director Joey Moe and producer Jasmin Jiramani.\n\nJiramani recently delivered the Star Wars fan film “Shrouded Destiny: A Star Wars Long Tale” starring Lars Mikkelsen, who has also been in the Disney+ Star Wars series “Ahsoka.”\n\nMoe and Jiramani, who are both students of the prestigious Danish film school Super8, said “Ripple” explores why people spend so much time obsessing over macabre true crime tales.\n\n“Ripple” is a psychological thriller inspired by true events that send a ripple effect through half a century of murders,” said the pair.\n\nPopular on Variety\n\n“Ripple” has already been pre-bought by Scandinavian Film Distribution and will be released across the Nordics in 2024.\n\n“I think we’re both the missing piece to our respective puzzles. The energy, the ambition, the determination,” said Moe, referring to his creative collaboration with Jiramani. “We just connected instantly and seized the momentum and the call to do something extraordinary, and now we have an incredible 90-minute film,” the director continued.\n\n“For the past year, we have focused all of our energy into this film – and we have been completely fearless about it,” Jiramani continued.\n\nThomsen said “’Ripple” is “something special” and added that he “took part of it as an ambitious school project and watched it grow out of its own roof.”\n\nScandinavian Film Distribution, which signed the two students in while visiting their school, said “Ripple” has been a “display of passion and raw talent.”\n\n“Jasmin and Joey are the next generation of filmmakers, and i’m excited for the future collaboration. Their energy and everything-is-possible-mentality is admirable as it is evident. It has been a journey following them in their uprising from a school project to a debut feature film with international class,” said Michael Fleischer at Scandinavian Film Distribution\n\nMoe and Jiramani will be on the ground with Ulrich Thomsen in Cannes where they’ll be looking to meet with industry players and festival programmers."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDUvMTEvcmlwcGxlLXBhcnRuZXItY29ycGF5LXRvLW9mZmVyLWNyb3NzLWJvcmRlci1wYXltZW50LXNlcnZpY2VzLXRvLXN1bmZsb3dlci1iYW5rL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ripple Partner Corpay to Offer Cross-Border Payment Services to Sunflower Bank - The Crypto Basic",
        "content": "Being a partner of Ripple, Corpay already leverages the RippleNet solution to facilitate its cross-border payment solutions.\n\nCorpay, a business payments company under the FLEETCOR brand and a prominent partner of Ripple, recently announced that its cross-border unit has teamed up with Sunflower Bank, a commercial bank in the United States. The collaboration was disclosed in a recent press release.\n\n#Ripple partner Corpay (fmr Cambridge Global Payments) will provide cross-border payments & foreign currency exchange solutions for Sunflower Bank, N.A. (western US). https://t.co/vZ21LUK0Dv pic.twitter.com/lDdSjxK7Zw — WrathofKahneman (@WKahneman) May 10, 2023\n\n- Advertisement -\n\nThrough this partnership, Sunflower Bank customers, especially those in the Southwest and Mountain West regions, will have access to Corpay’s cutting-edge solutions for cross-border payments and foreign exchange risk mitigation.\n\nBy leveraging Corpay’s acclaimed trading platform, clients of Sunflower Bank can effortlessly manage their global transactions from a centralized access point. This will be particularly advantageous for institutional clients with routine payment requirements due to Corpay’s FX risk management facilities.\n\nCorpay, formerly Cambridge Global Payments, secured a partnership with Ripple as far back as October 2020 to help enhance its cross-border services. Corpay joined RippleNet, Ripple’s global network of banks and payment institutions, to leverage the network to facilitate efficient and cost-effective cross-border payments.\n\n- Advertisement -\n\nWhile Corpay leverages RippleNet for its transnational settlements, it is unclear whether Sunflower will also utilize the network due to its recent partnership with Corpay. Regardless, this collaboration between Corpay and Sunflower Bank is expected to bring greater convenience and efficiency to businesses that must transact internationally.\n\nAndrew Heffernan, the VP of Strategic Sales NA at Corpay Cross-Border Solutions, has expressed his enthusiasm for the newly formed partnership, stating that the Corpay team is excited to establish enduring business relationships with Sunflower Bank’s clientele.\n\nCorpay is the latest Ripple partner to expand its cross-border services to more clients recently. Two months back, MFS Africa, another Ripple partner, secured a collaboration with leading financial services company Western Union to allow customers to send and receive money in Africa through their mobile wallets.\n\nAs previously reported by The Crypto Basic, Ripple partner SentBe unveiled a payments service in the US in January. These extensions expose RippleNet to a greater adoption rate if the partnerships leverage the network."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy53dGhyLmNvbS9hcnRpY2xlL25ld3MvbG9jYWwvbWl4ZWQtdXNlLWRldmVsb3BtZW50LXJlcGxhY2luZy12YWNhbnQtYnJvYWQtcmlwcGxlLWtyb2dlci1zdG9yZS81MzEtMzNmZjY2MzctZjU4OC00YmZlLWFiYWItNGYwNjY0MGNmYWRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Mixed-use development to replace Broad Ripple Kroger - WTHR",
        "content": "The $70 million development is called “Versa” and will have 233 apartment units and 3,600 square feet of ground-floor retail space with an outdoor patio.\n\nExample video title will go here for this video\n\nExample video title will go here for this video\n\nINDIANAPOLIS — After sitting vacant for years, the old Broad Ripple Kroger is officially being torn down to make way for a new mixed-use development.\n\nThe lot sits on Guilford Avenue, just off Broad Ripple Avenue.\n\nLocal developers Milhaus, Gershman Partners and Citimark broke ground on the project Thursday. The $70 million development is called “Versa” and will have 233 apartment units and 3,600 square feet of ground-floor retail space with an outdoor patio.\n\n“Developing a new community in Broad Ripple Village was an obvious choice for Milhaus as soon as Gershman and Citimark approached us about the project. The village embodies so many of our key values, bringing walkability and an urban feel to residents, showcasing local artists and elevating the local community,” said Brad Vogelsmeier, Milhaus vice president of development.\n\nCurrently, there are several other high rises in the area, but the Broad Ripple Village Association said there’s still a lot of demand.\n\n“Most of them are at max or close to max capacity, so there is, despite what people might believe, there’s a desire to still be here,” said Jordan Dillon, the executive director of BRVA.\n\nMany also hope the development will make the area safer, with one less vacant lot.\n\n“It naturally promotes safer streets at all times and all hours of the day,” said Indianapolis Mayor Joe Hogsett.\n\n“The more development and the more use of empty space that we can put in the village, the more quickly we are able to meet our mission of having a very safe and vibrant village and community,” Dillon said.\n\nOthers are concerned the identity of the village is changing with large developers coming in.\n\n“It’s probably like 1,200 bucks to live there,” said Jonathon Hall.\n\n“The neighborhood people are getting pushed out,” said Maia Blazek.\n\nThe village association believes it can do both.\n\n“We can be funky and we can be sleek at the same time. We can have larger buildings and still have our smaller businesses and bungalow homes in the area,” Dillon said.\n\nWith more people moving in, businesses are also excited about new customers.\n\n“Excited that the lot is going to be turned into something. It was a parking lot for a while and now it’s just vacant and a waste of space in a town and place where there’s not much space to be had in the first place,” said Julian Orem, general manager of Ripple Bagel & Deli. “We will have more business opportunities coming to town and bringing more people to be part of the community.”\n\nDemolition is underway, with construction starting soon. It's expected to conclude in 2024."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3dhdGNoZG9nLWZpbGVzLXNlYy1sYXdzdWl00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 20:52:39 GMT",
        "title": "Watchdog Files SEC Lawsuit Seeking Documents Related to XRP, ETH - Blockworks",
        "content": "Did former SEC officials have crypto-related conflicts of interest when they were at the commission?\n\nEmpower Oversight, a watchdog agency, is suing the SEC to comply with Freedom of Information Act requests that the agency filed with the SEC.\n\nAccording to the lawsuit, the requested records will allow Empower to see whether or not there were multiple conflicts of interest that were crypto-related, specifically with a former director of the SEC’s Corporation Finance Division – William Hinman – and former SEC Chair Jay Clayton.\n\nBoth Clayton and Hinman have since left the SEC, with Hinman joining Simpson Thacher & Bartlett as a senior adviser and Clayton joining Sullivan & Cromwell as a senior policy adviser.\n\nThe lawsuit alleges that Hinman received a pension from Simpson Thacher while at the SEC, linking back to a 2021 Insider report. While Hinman was at the SEC, the law firm was an Enterprise Ethereum Alliance member.\n\nIn a Yahoo Finance All Markets Summit speech in 2018, Hinman declared that “the Ethereum network and its decentralized structure, current offers and sales of Ether are not securities transactions.”\n\n“After his declaration, Ether’s value rose significantly,” the lawsuit states. “That same month, the SEC filed a lawsuit against one of Ethereum’s rivals, Ripple, alleging that its XRP cryptocurrency was a security, such that the offering and sales of XRP violated federal securities law.”\n\nThe speech has been part of Ripple’s ongoing case with the SEC, and documents surrounding the speech were confidentially released to Ripple last October.\n\nThe nonprofit whistleblower agency has filed other FOIA requests in relation to possible conflicts of interest. In 2022, it released 200 emails last April that focused on correspondence between Hinman and SEC personnel.\n\nBut Hinman isn’t the only former SEC official with alleged conflicts of interest.\n\nClayton, who helmed the SEC from 2017 to 2020, is also mentioned by Empower.\n\n“As another example, former SEC Chairman Jay Clayton publicly stated while at the SEC that Bitcoin was not a security,” it states. “Shortly after leaving the SEC, Clayton joined One River Asset Management, a cryptocurrency hedge fund that focuses exclusively on Bitcoin and Ether.”\n\nLast year, Clayton told Blockworks that he didn’t expect to be involved with digital asset companies after he left his SEC post.\n\nThis is not the first time that Empower has taken the SEC to court over FOIA requests. According to the legal document, “Empower Oversight filed a complaint in the Eastern District of Virginia” in December 2021.\n\n“The SEC’s failure to provide any transparency on this issue is making a bad situation look even worse. We’re approaching two years since Empower Oversight made its initial FOIA request, and a year and a half since our first lawsuit. Yet the SEC has consistently stonewalled any attempts to shed light on these clear conflicts of interest at the agency,” Tristan Leavitt, President of Empower Oversight, said in a statement.\n\nEmpower is pursuing that the SEC conduct “legally sufficient searches” to fulfill Empower’s FOIA requests and award attorney fees and “costs incurred in this action.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vdGhlZmludGVjaHRpbWVzLmNvbS9yaXBwbGUtdGFsa3MtZHViYWktZXhwYW5zaW9uLXRoZS1mdXR1cmUtb2YtY3Jvc3MtYm9yZGVyLXBheW1lbnRzLWFuZC1maW5hbmNpYWwtaW5jbHVzaW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 May 2023 07:00:00 GMT",
        "title": "Ripple Talks Dubai Expansion, the Future of Cross-Border Payments and Financial Inclusion - The Fintech Times",
        "content": "Ripple, the enterprise crypto and blockchain solution provider, is expanding its presence in Dubai by opening a new office location in the Dubai International Financial Centre (DIFC); citing the region’s innovation-forward regulations, expansive network and growing reputation as a leading global financial centre.\n\nTo find out more about the future plans and aspirations of Ripple, The Fintech Times spoke to its managing director in MENA and South Asia, Navin Gupta about expansion in the region, cross-border payments and financial inclusion.\n\nRipple has long focused on serving customers around the world with over 90 per cent of its business coming from outside the US. The MENA region has become a key market for the company – with it revealing that around 20 per cent of all RippleNet customers, such as SABB, Qatar National Bank, Lulu Financial Holdings, Al-Ansari Exchange, and RAK Bank, are based there.\n\nNavin Gupta explained exactly why the Middle East market represents a unique opportunity for Ripple to move into: “For the whole remittance market, we realised that there is no place like the Middle East as a region. For example, it has multiple times more remittances being set up than the United States. So for us said, it makes sense.\n\n“Secondly, we found it was very progressive in terms of regulation, even when the regulations weren’t in place. We approached the authorities who explained we could go ahead and they would work hand in hand with us to put the regulations in place’. So we found a lot of openness with a very large commercial opportunity, so it was very natural for us to put our roots here”.\n\nRipple is testing its ideas in Dubai thanks to forward-thinking regulation\n\nGupta further explained how the regulators in Dubai are fostering innovation in and around the region: “Firstly, we are here in Dubai for expansion, but we are also looking to bring some of our early products here as well. We are an American company. Lots of early innovations happened in the US, but I think everything will start moving in a more decentralised way around the world. In the UAE there are a lot of market leaders and one of the reasons for that is the progressive regulation here.\n\n“If we are able to go to the regulator and explain that an idea is not ‘fully baked’ but show them how we are thinking about it. We can then ask if we can work hand in hand to launch it in the market. If yes, then it’s a great market for us to build everything from there.”\n\nOver half of Ripple’s MENA payment volume currently consists of cross-border payments such as remittances from the UAE, Bahrain and Saudi Arabia to India.\n\nGupta explained how working in the remittance space has given Ripple a platform to work on other areas in cross-border payments: “Remittance as a use case has already given us a foot in the door: institutional engagement with banks, PSPs and our client base because we are an enterprise company, it makes it easier for them to have a much deeper discussion with us. We are because we are already a trusted partner in one area of business”.\n\n‘Building towards the endgame: making cost per payment almost negligible’\n\nDiscussing Ripple’s aims, Gupta likened the future of cross-border payments to how email revolutionised sending information globally:\n\n“We have a very simple and clear direction in our mind. We want cross-border payments to be exactly like email. The example I want to give is, in the past, we would have to send letters from the UK to the likes of Australia – which would take seven days, and it would cost a lot more for postage – but then came email. You could be sitting next to someone and send them an email that they would receive almost at the exact same time, and this would be the same for someone hundreds of miles away from you.\n\n“In our view, cross-border payments are moving in that way. Technically, today we could offer a payments subscription model which costs $29.99 and lets consumers send as many payments worldwide as they need to.\n\n“What we need to do is to keep building towards that endgame; in which where you would see the total number of payments skyrocketing, but the actual cost per payment will almost become negligible. It will be exactly like email: simply moving data from A to B.”\n\nFinancial inclusion is ‘all about building a commercial model’\n\nGupta also talked about the future of financial inclusion. He explained how, if the cost of payments successfully is reduced enough worldwide, the positive impact this could have on financial inclusion could be significant:\n\n“In my mind, financial inclusion is very, very simple. It’s all about building a commercial model – not not-for-profit models because eventually, those things don’t work. If you want this to work at scale, it has to be a commercial model, which works both for the buyer and supplier, in the localised contexts for the receiver.\n\n“The easiest way I can explain it is using microinsurance as an example. Normally, when people buy insurance, they choose coverage for a one-year period. But maybe there’s a daily wage earner, that wants to buy the insurance on a one-day basis. And again, then the payment collection comes in because sometimes you can sell that microinsurance to them through an electronic channel without it becoming overly costly on their end”."
    }
]