[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTA3L2JpdGNvaW4tYnRjLWNyeXB0by1ncmlwLWVhc2VzLWFzLXRva2Vucy1saWtlLXJpcHBsZS14cnAtcmFsbHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC USD) Crypto Grip Eases as Tokens Like Ripple (XRP) Rally - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTA3L2JpdGNvaW4tYnRjLWNyeXB0by1ncmlwLWVhc2VzLWFzLXRva2Vucy1saWtlLXJpcHBsZS14cnAtcmFsbHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC USD) Crypto Grip Eases as Tokens Like Ripple (XRP) Rally - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTA3L2JpdGNvaW4tYnRjLWNyeXB0by1ncmlwLWVhc2VzLWFzLXRva2Vucy1saWtlLXJpcHBsZS14cnAtcmFsbHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC USD) Crypto Grip Eases as Tokens Like Ripple (XRP) Rally - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTEwNzQ2MzExMS9lbi9SaXBwbGUtVHJhbnNmb3Jtcy1QYXltZW50cy1FeHBlcmllbmNlLXRvLVVubG9jay1FbnRlcnByaXNlLUNyeXB0by1BZG9wdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ripple Transforms Payments Experience to Unlock Enterprise Crypto Adoption - Business Wire",
        "content": "DUBAI, United Arab Emirates & SAN FRANCISCO--(BUSINESS WIRE)--Ripple, the leader in enterprise blockchain and crypto solutions, debuted today the evolution of its crypto-enabled cross-border payments solution, Ripple Payments, formerly known as RippleNet. Ripple Payments provides the enterprise-grade infrastructure required for businesses to leverage blockchain easily for faster, cheaper, more efficient cross-border payments without needing to be an expert.\n\nMore than ever, leading Web2 companies and legacy payments institutions are investing resources to integrate blockchain utility into their services – over 80% of global finance leaders are likely to begin using some form of cryptocurrencies in their business in the next three years. As such, Ripple is evolving its flagship payments product and building toward a future where Ripple Payments is the fastest and most efficient cross-border payment solution for any business, regardless of the currency, time of day or end destination.\n\nKey updates include:\n\nExpanded access to Ripple’s full global network of more than 70 crypto and traditional payout markets – the Ripple Payments network now provides near global payout coverage through single onboarding.\n\nA payment system forged by Ripple’s deep regulatory know-how – Ripple’s years of experience combining crypto-native services with traditional finance and compliance requirements provides the peace of mind needed to access enterprise-grade crypto solutions. With 30+ licenses, including a MAS Major Payments Institution license and Money Transmitter Licenses (MTLs) across the U.S., Ripple is introducing its solutions to a broader customer base, including SMEs (Small and Midsize Enterprises).\n\nLightning-fast onboarding and accelerated go-to-market strategies – new integrations with the XRP Ledger’s native decentralized exchange (XRPL DEX) will improve product performance and lower the barrier to enter new markets by tapping into global liquidity options.\n\nThe ability to fulfill customers’ liquidity needs on demand 24-7-365 – regardless of the currency or end destination, expanded crypto liquidity options will allow Ripple to continue providing an optimized experience as the payments product scales.\n\n“Since the start, Ripple focused on creating products that solve real problems for real customers. This evolution of Ripple Payments represents an extension of our long-running work to optimize the cross-border payments experience through transformative technology,” said Monica Long, President at Ripple. “Ripple has led the way in addressing key components of crypto financial infrastructure, including liquidity, off ramps, tokenization, custody, and compliance. Bringing these elements together within Ripple Payments for an intuitive end-to-end enterprise experience is the natural next step for Ripple to make crypto’s benefits accessible for any business.”\n\n“At Ripple, we’ve long known that payments are unequivocally the ‘killer app’ for digital assets. Achieving that vision requires a seamless experience for institutional users to solve real-world problems,” added Brendan Berry, Head of Payment Products at Ripple. “With more businesses than ever seeing real utility in blockchain, our goal is to provide our customers with optionality, speed, ease of use, and compliance – all in one comprehensive product.”\n\nGlobal payments solution company RocketFuel is one of the first customers to leverage the newest iteration of Ripple Payments. RocketFuel provides payment solutions to merchants who wish to send or accept payments via crypto or fiat. Ripple Payments will manage the end-to-end flow of payments, with a breadth of payout currencies available around the world, enabling RocketFuel to meet rapidly increasing demand for direct payments to merchants and their customers.\n\n“For too long, the financial industry has suffered from using antiquated technologies, resulting in high costs, lost revenue, and inefficient and unpredictable processes. Blockchain and digital currency applications provide an avenue to radically improve those shortcomings,” said RocketFuel CEO Peter Jensen. “Ripple Payments supports our products, allowing us to serve our customers globally in a dramatically more effective way than the legacy financial system.”\n\nRipple Payments was announced today at the company’s seventh flagship event, Swell, taking place in Dubai from November 8-9, 2023. The annual conference plays a central role in advancing the business of crypto by bringing together the brightest minds across payments, financial services, crypto, blockchain, and economic policy.\n\nBest known for its flagship payments products, Ripple was the first company to address the multi-trillion dollar pain points in cross-border payments utilizing blockchain and cryptocurrency. Today, Ripple serves hundreds of customers in over 55 countries and on six continents, with payout capabilities in 70+ markets. The newly launched Ripple Payments solution is now available in the U.S., with more regions to come in 2024 based on jurisdiction. The availability of specific products and features will vary by jurisdiction.\n\nAbout Ripple\n\nRipple is the leader in enterprise blockchain and crypto solutions, transforming how the world moves, manages, tokenizes and stores value. Ripple’s business solutions are faster, more transparent, and more cost effective - solving inefficiencies that have long defined the status quo. And together with partners and the larger developer community, we identify use cases where crypto technology will inspire new business models and create opportunity for more people. With every solution, we’re realizing a more sustainable global economy and planet - increasing access to inclusive and scalable financial systems while leveraging carbon neutral blockchain technology and a green digital asset, XRP. This is how we deliver on our mission to build crypto solutions for a world without economic borders."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiswFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTEwNzYwMjM2My9lbi9SaXBwbGUtcGFydG5lcnMtd2l0aC1PbmFmcmlxLXRvLXBvd2VyLWRpZ2l0YWwtYXNzZXQtZW5hYmxlZC1jcm9zcy1ib3JkZXItcGF5bWVudHMtYmV0d2Vlbi1BZnJpY2EtYW5kLXRoZS1yZXN0LW9mLXRoZS13b3JsZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ripple partners with Onafriq to power digital asset-enabled cross-border payments between Africa and the rest of the ... - Business Wire",
        "content": "LONDON & JOHANNESBURG & DUBAI, United Arab Emirates--(BUSINESS WIRE)--Ripple, the leader in enterprise blockchain and crypto solutions, and leading payments fintech Onafriq, previously MFS Africa, announced today that they are partnering to facilitate digital asset-enabled cross-border payments between Africa and several new markets, including the Gulf Cooperation Council (GCC), the UK and Australia.\n\nOnafriq is utilising Ripple Payments, Ripple’s crypto-enabled payments technology, to open up three new payments corridors between Africa and the rest of the world. Customers of PayAngel in the UK, Pyypl in the GCC, and Zazi Transfer in Australia are now able to make speedy and cost-effective remittance and business payments to recipients in 27 countries across Onafriq’s pan-African network1.\n\nUsing Ripple’s crypto technology, Onafriq is eliminating the traditional problems associated with cross-border payments such as lengthy transfer times, unreliability and excessive cost. In this way the partnership is bringing faster, more efficient, and cost-effective international money transfers to Africa, and is set to accelerate financial inclusion across the continent.\n\n“For a number of years, Ripple has supported crypto-enabled, cross-border payments to individuals and businesses, and we are particularly excited to expand the reach of our solution into Africa thanks to our Onafriq partnership,” said Aaron Sears, SVP, Global Customer Success at Ripple. “Connecting our partners PayAngel, Pyppl and Zazi Transfer with Onafriq over Ripple Payments will bring the benefits of faster and more cost-effective cross-border payments to individuals seeking to send money into Africa from around the globe.”\n\nOnafriq has the largest mobile money movement footprint across Africa at a time when mobile money is a significant driver of financial inclusion and has revolutionized access to financial services across the continent. ​​The fintech’s payment hub connects over 500 million mobile wallets across 40 African countries, and operates across more than 1300 payment corridors on the continent, underpinning regional payment interoperability and seamless cross-border payments.\n\nThe announcement is being made as Dare Okoudjou, Founder & CEO of Onafriq, is set to appear at Swell Global 2023, the seventh edition of Ripple’s annual customer conference, which this year takes place in Dubai.\n\nDare Okoudjou, Founder & CEO at Onafriq, said: “Our mission is to make borders matter less when it comes to payment within, to, and from Africa. We are advancing this mission through our partnership with Ripple, which is already enabling new types of connections with fintechs such as PayAngel, Pyppl and Zazi Transfer. These connections are set to enable fast, secure and low-cost remittances at scale between Africa and the rest of the world, and represent a bold first step for our crypto strategy to leverage blockchain technologies to amplify our impact on people and businesses on the continent.”\n\nBest known for its flagship payments products, Ripple was the first company to address the multi-trillion dollar pain points in cross-border payments by utilizing blockchain and cryptocurrency. The company focused on solving the hardest problems – such as building blockchain-enabled payments infrastructure from the ground up – before expanding its product offerings to address new areas such as liquidity management and tokenization, including Central Bank Digital Currencies (CBDCs). Today, Ripple serves hundreds of customers in over 55 countries and 6 continents with payout capabilities in more than 70 markets.\n\nAdditional Partner Quotes:\n\nJones Amegbor, CEO at PayAngel, said: “Our partnership with Ripple and Onafriq aims to address the long-standing challenges associated with cross-border remittances into Africa. By leveraging Ripple’s blockchain technology, our innovative payment platform and Onafriq’s extensive reach across Africa, the collaboration aims to unlock new possibilities for economic growth and financial inclusion.”\n\nAntti Arponen, CEO at Pyypl, said: “The success of the GCC in drawing in people from all over the world to live and work here has made it a hub for remittance payments. So we are really pleased that our ever-increasing number of customers seeking to send money to Africa will greatly benefit from our new connection with Onafriq, which will allow them to send remittances quickly and cost-effectively to the continent.”\n\nHidayat Olanrewaju, CEO at Zazi Transfer, said: “With the global remittance market continuing to expand, it is increasingly important to look at ways to enhance the speed and efficiency of cross-border transactions. Traditional remittance channels often suffer from high fees, lengthy settlement times, and limited accessibility, which can hold back individuals relying on these transfers. By utilising Ripple’s blockchain technology, our partnership with Onafriq aims to address these pain points and streamline remittances between Australia and Africa.”\n\nAbout Ripple\n\nRipple is the leader in enterprise blockchain and crypto solutions, transforming how the world moves, manages, tokenizes and stores value. Ripple’s business solutions are faster, more transparent, and more cost effective - solving inefficiencies that have long defined the status quo. And together with partners and the larger developer community, we identify use cases where crypto technology will inspire new business models and create opportunity for more people. With every solution, we’re realizing a more sustainable global economy and planet - increasing access to inclusive and scalable financial systems while leveraging carbon neutral blockchain technology and a green digital asset, XRP. This is how we deliver on our mission to build crypto solutions for a world without economic borders.\n\nAbout Onafriq\n\nOnafriq is an omnichannel network of networks, making borders matter less by providing our partners with a single pathway to unlock the full power of cross-border and cross-platform payment solutions. With a network spanning 40 African markets, Onafriq connects over 500 million mobile money wallets, 200 million bank accounts, and 300,000 agents in Nigeria, enabling domestic and cross-border disbursements and collections, card issuing and processing, agent banking, and treasury services. By connecting global and regional enterprises, mobile network operators, money transfer operators, banks, fintechs, global development organisations, and online and offline merchants, supported by world-class regulatory and compliance capabilities and a strong regional presence in 10 offices in Africa, and others in the UK, US, and China, Onafriq is ushering in a new era of access for people across the African continent and beyond.\n\nAbout PayAngel\n\nPayAngel is a revolutionary financial service addressing the challenges faced by Africans living abroad. Unlike traditional payment services with high fees and slow transfers, PayAngel offers a pioneering, zero-fee and borderless solution that eliminates intermediaries, ensuring transparent and accountable transactions.\n\nThis innovative approach caters to the African diaspora in the UK, Canada, and Australia, facilitating easy transfers for family support, payments for goods and services; and, with a unique and value-added service in the form of embedded life/funeral insurance and robust security measures, PayAngel provides an added layer of protection. In short, PayAngel empowers Africans in the diaspora to send back home cost-effectively, conveniently, and securely, contributing to the economic growth of Africa.\n\nAbout Pyypl\n\nPyypl is one of the fastest growing fintechs in MEA, with an industry-leading management team with unrivalled experience in the region. Powered by its proprietary technology, unlocking breakthrough consumer capabilities and sustainable growth, Pyypl is now operational in multiple markets across Africa and the GCC. Pyypl enables cross border transfers to 80 countries through its international remittances as well as user-to-user transfers. Pyypl also provides internationally accepted virtual and physical prepaid cards that have transacted at over 30,000 merchants across over 150 countries and over 100 currencies.\n\nPyypl is succeeding in its mission to be the leading one-stop fintech ecosystem for consumers, seamlessly and across borders. Pyypl’s purpose-driven approach offers transformational financial services to 850 million financially underserved smartphone users across Africa and the Middle East in a single app.\n\nAbout Zazi Transfer\n\nZazi Transfer is an Australian online international money transfer and cross-border payments company headquartered in Sydney. Zazi Transfer Pty Ltd currently provides money transfer services to Africa and the rest of the world instantly and for free. Zazi Transfer Payment’s infrastructure is optimized for shorter settlement windows and immediate funds receipt in the most efficient and cost effective manner. Zazi Transfer facilitates cross border payments at a competitive and bank beating rate.We have a strategic business plan that puts the company in a position to be a pace setter in the cross border remittance sector, competing distinctly and successfully, satisfying customers, able to evolve and achieving enviable business performance.\n\n1 Benin, Botswana, Burkina Faso, Burundi, Central African Republic, Egypt, Equatorial Guinea, Eswatini, Ethiopia, Gambia, Ghana, Ivory Coast, Liberia, Madagascar, Malawi, Mali, Morocco, Mozambique, Niger, Nigeria, Senegal, South Africa, Tanzania, Togo, Uganda, Zambia and Zimbabwe."
    }
]