[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy5yZWRhbmRibGFjay5jb20vYXRoZW5zbmV3cy9hdGhlbnMtcmlwcGxlLWVmZmVjdC1wcm9qZWN0LWhpZ2hsaWdodHMtd2F0ZXItY29uc2VydmF0aW9uLWFuZC15b3VuZy1hcnRpc3RzL2FydGljbGVfNzViN2ZjZmMtYzllZC0xMWVkLTliMjctNjMzNjYxMWUzZDk2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Athens Ripple Effect Project highlights water conservation and young artists - Red and Black",
        "content": "he dog area of the Athens-Clarke County Animal Services Adoption Center is under precautionary quarantine until April 5 after the detection of canine parvovirus, according to a press release from Athens-Clarke County government.\n\nThe quarantine began on March 22 after a dead dog was found with a “slight presence” of canine parvovirus, also known as CPV or parvo. Parvo is a highly contagious virus that affects dogs and is most often seen in puppies who are too young to be vaccinated and other unvaccinated dogs. The infected dog was vaccinated as part of standard intake procedure, the release said."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8yNy9jcnlwdG8tbGVhdmluZy11cy_SAU1odHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDMvMjcvY3J5cHRvLWxlYXZpbmctdXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "US Crypto Firms Eye Overseas Move Amid Regulatory Uncertainty - CoinDesk",
        "content": "As my colleague Emily Parker has compellingly argued, crypto leaving the U.S. would impact more than just crypto. Think about the economic impact. “If you have a gigantic office building stuffed with tech workers in New York City, all those people are going to eat lunch in sandwich shops across the street,” says Gottlieb. “Now they’re eating Ban Mian from the streets of Singapore.” Nage estimates that $3 billion of crypto wages in the U.S. translates to over $750 million in taxes, and “there are definitely going to be countries that are welcome to that tax revenue.” Smith even considers the growth of Web3 to be important to national security because “the next generation of the internet is going to be built on top of crypto networks,” and “we want to make sure the U.S. is leading that.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vaW5keXRvZGF5LjZhbWNpdHkuY29tL2ZyZW5jaC1wYXN0cmllcy1pbmRpYW5hcG9saXMtaW7SAUdodHRwczovL2luZHl0b2RheS42YW1jaXR5LmNvbS9mcmVuY2gtcGFzdHJpZXMtaW5kaWFuYXBvbGlzLWluP19hbXA9dHJ1ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Where to get French pastries in Indianapolis, IN - INDYtoday",
        "content": "At the beginning of this year, we asked our readers to submit story ideas for us to cover in 2023, and Brooke L.'s question was too delicious to pass up: “Where can I get really good French pastries?”\n\nSo without further adieu, here are our top recs for some of the best pâtisserie-like spots around Indy.\n\nGallery’s pastry display never fails to impress. | Photo by INDYtoday team\n\nThis local pâtisserie and restaurant just opened its newest location on College Avenue and should be your go-to spot for a showstopping dessert for your next dinner party.\n\nOur pick: macarón\n\nIf you’ve lived in Indy long enough, there’s no doubt you’ve stopped into this bakery famous for its sourdough.\n\nOur pick: chocolate croissant\n\nDon’t forget to grab a caramelly Breton-style pastry, which is pronounced “kween uh-mon” and means “butter cake.”\n\nOur pick: kouign-amann\n\nThe mille-feuille from MOTW is back after a brief hiatus. Photo via @motw.coffee\n\nYou can get pastries from France to Syria to North Africa at this ever-growing local coffee chain.\n\nOur pick: mille-feuille\n\nThis pastry shop will make you feel like you’ve entered Paris.\n\nOur pick: fruit croissant\n\nFiligree has a robust online menu available for custom orders.\n\nOur pick: macarón pop\n\nFiligree Bakery is getting into the spring spirit with these macarons. | Photo via @filigree.bakery\n\nWhen we say “don’t sleep on these pastries,” we mean it. Get there early or you’ll miss all your favorites.\n\nOur pick: guava swirl croissant\n\nFind the local sweet spot at The Amp at 16 Tech and don’t forget it when you’re planning your next birthday party.\n\nOur pick: seasonal macarón"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYm9sZC5jb20vcmlwcGxlLXYtc2VjLWNvdXJ0LWNhc2UtdXBkYXRlLWFzLW9mLW1hcmNoLTI3LTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Ripple v. SEC court case update as of March 27, 2023 - Finbold - Finance in Bold",
        "content": "There is a growing consensus in the crypto community that the conclusion of the case between blockchain firm Ripple and the Securities Exchange Commission (SEC) is around the corner. The case outcome is highly expected to impact the regulatory trajectory in the crypto markets, especially on securities classification.\n\nIn the latest update, pro-Ripple lawyer John Deaton in a tweet on March 27, projected that the judge’s ruling was coming down within the next few weeks or even this week.\n\nAccording to Deaton, if the SEC wins, there might not be much downside for XRP, noting that the token has the most attractive risk/reward ratio. However, he pointed out that if Ripple wins, it will be made clear that XRP is not a security, and the token will have an upside.\n\nXRP has the most attractive risk/reward ratio IMO. The Judge’s ruling is coming down w/in the next few weeks (maybe this week). If the SEC wins, what’s the downside from .45? Ripple appeals and we get the status quo. Ripple wins and its made clear XRP isn’t a security? Upside? 🤔 — John E Deaton (@JohnEDeaton1) March 26, 2023\n\nThe possibility of the summary judgment date was further elevated by a Fox Business report that indicated that lawyers working on the matter have suggested that the legal dispute might end in the coming days.\n\nDeaton, who believes that the controversial Hinman speech emails will be unsealed on the grounds of being “judicial documents,” has challenged the crypto community to view the case as an attack on the general digital asset industry and not solely a Ripple issue.\n\nSEC responds to Ripple’s defendants\n\nIn another update, defense lawyer James Filan in a tweet on March 23, shared the SEC had filed its response to the Ripple defendants’ letters regarding supplemental authority drawn from the Bittner and Voyager cases.\n\nAccording to the SEC’s response, the letter set forth stray remarks, lines from the judge’s concurring opinion in the Bittner case, and a bankruptcy plan confirmation order from the Voyager case. It added that the defendants contend that the excerpts support their “fair notice” defense, which the regulator disagrees with, and that it does not provide any basis to deny the SEC’s motion for summary judgment.\n\nIn this line, lawyer Jeremy Hogan, who is in support of Ripple, suggested that the SEC’s response raises valid points about the Bittner case but notes that the regulator’s attempt to argue against the Voyager judge’s ruling on the apparent uncertainty of the crypto space is “smirkable.” He further explained that while the response negates the Bittner decision, the Voyager judge’s ruling remains good for Ripple.\n\nWith both parties confident about winning the case, one notable outcome has been a possible settlement. However, Australian lawyer Bill Morgan noted that an assessment of the SEC’s response letter ends the possibility of a settlement.\n\nXRP price analysis\n\nThe latest happenings around the case have acted as a bullish catalyst for XRP, with the asset recording a price breakout from the rest of the market recently. By press time, XRP was trading at $0.46 after recording daily gains of about $0.5%. On the weekly chart, XRP is up over 20%.\n\nXRP seven-day price chart. Source: Finbold\n\nAt the current value, XRP is now targeting breaching the $0.50 resistance position even as the token continues to attract significant capital inflow that has culminated in a market cap of $23.80 billion.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vY3J5cHRvLW1hcmtldC13ZWVrbHktd2lubmVycy1yaXBwbGUteGRjLW5ldHdvcmstYW5kLWZsYXJlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Crypto Market Weekly Winners: Ripple, XDC Network, and Flare - Securities.io",
        "content": "The cryptocurrency market has taken a breather after rallying in the first half of March on the back of a series of bank runs leading to the collapse of multiple financial institutions. As of writing, Bitcoin (BTC) is trading at $27,900 and Ethereum (ETH) at $1,765, while the total market cap has surpassed $1.2 trillion, according to CoinGecko.\n\nStill, some coins are surging in value more than others, and this last week, the top three performers among the top 100 cryptocurrencies have been:\n\nXRP\n\nThe 6th largest cryptocurrency with a market cap of $23.6 bln is trading at $0.465, up more than 18% in the past week. In the last 24 hours, the crypto asset recorded $1.6 bln in trading volume. And although XRP is up 35% year-to-date (YTD), it is still down 86.5% from its peak of $3.40 hit five years ago in Jan. 2018.\n\nAccording to recent data from CoinMarketCap, XRP has been seeing rising interest from Korean investors. While trading volume on Upbit and Bithumb has recorded a surge, it is unclear just how long this trend will continue.\n\nXRP's positive price performance has also been in tandem with its soaring social metrics, as per data aggregator Lunar Crash. XRP's social engagement rose by 105.9% to 245.57 million, and its mentions grew by 26.4% to 80,720.\n\nIt also had up to 3,440 unique social contributors per hour, indicating an active and engaged community. Many within the XRP community have been actively promoting the token on social media, as they strongly believe that its parent company Ripple will win its ongoing legal battle against the U.S. Securities and Exchange Commission (SEC).\n\nIt's worth noting that Ripple recently submitted a new filing for its fair notice defense, referencing the decision of Judge Michael Wiles of the U.S. Bankruptcy Court for the Southern District of New York in his ruling on SEC objections in the Voyager bankruptcy case. This move by Ripple has further fueled the optimism of XRP supporters, who see this as a positive sign in their favor.\n\nThe ongoing legal battle between Ripple Labs and the U.S. SEC has been a major source of uncertainty for the cryptocurrency industry. But investors' optimism that Ripple will emerge victorious in the lawsuit is finally aiding XRP's value.\n\nIf the court rules in favor of Ripple, it could not only pave the way for XRP's future growth but also provide much-needed clarity on the regulatory status of cryptocurrencies.\n\nThe SEC has accused Ripple of conducting an unregistered securities offering of $1.3 billion in XRP tokens beginning in 2013. Ripple, however, has vehemently disputed the SEC's allegations and argued that XRP is not a security.\n\nThe court decision is expected to be made in the next few weeks, and if Ripple wins, it could further lead to increased demand for XRP and even boost the price of other cryptos facing regulatory uncertainty. A victory for Ripple could further encourage broader adoption of the crypto market.\n\nBesides all this, Ripple (XRP) also witnessed a surge in transactions. Recent data from XRP Scan indicates that the XRPL network has processed over 1 million transactions on average, with over 2000 new addresses being created daily.\n\nHowever, concerns have arisen over recent transactions involving large amounts of XRP tokens, coinciding with the news of Signature Bank shutting down.\n\nAlthough Ripple CEO claims that the bank shutdown has not impacted its operations, it remains to be seen just how this will affect XRP as the repercussions of the bank shutdown become clearer.\n\nClick here to learn all about investing in XRP.\n\nXDC Network (XDC)\n\nThe 84th largest crypto with a market cap of $551 mln, XDC is trading at almost $0.04, up 13% in the past week while managing $4.3 mln in the last 24 hours. Although XDC is up 58.6% in 2023 so far, it is still down over 79% from its all-time high (ATH) of $0.192 from Aug. 2021.\n\nXDC Network (formerly XinFin Network) is a blockchain platform that aims to revolutionize global trade and finance by addressing key issues such as scalability, interoperability, and transaction speed.\n\nOne of the most significant advantages of XDC Network is its delegated proof-of-stake (dPoS) mechanism, which ensures near-zero gas fees, two-second transaction times, and over 2,000 TPS. The platform's hybrid relay bridges and interoperability features enable blockchain users to enjoy a seamless and democratized trading experience.\n\nXDC Network's native token, XDC, plays a vital role in fueling the platform and enabling users to access global trade by streamlining transactions and supporting various use cases through tokenized and non-tokenized solutions.\n\nOne of the key advantages of the XDC Network is its compatibility with ISO20022 messaging standards. ISO 20022 is an ISO standard for electronic data exchange between financial institutions, covering financial information such as payment transactions, securities trading and settlement information, credit and debit card transactions, and more.\n\nThe XDC Network's compatibility with this standard allows for easy integration into legacy banking systems, ERPs, and SWIFT systems, making it one of the most flexible enterprise-grade blockchains in the space.\n\nIn recent news, the XDC Network has partnered with Fathom to offer users an innovative way to earn XDC coins. And as part of the partnership, Fathom will allow users to borrow real-world assets as collateral and earn XDC tokens in return.\n\nThe goal of this collaboration is to offer higher returns than other lending platforms while also increasing the utility and liquidity of XDC. The partnership is a strategic move that will help bridge traditional finance and the blockchain space by providing a seamless and sustainable method for earning XDC.\n\nClick here to learn all about investing in XDC.\n\nFlare (FLR)\n\nWith a market cap of $425 mln, FLR sits at the 99th spot in the crypto market. The token recorded an 11.4% jump in its price this past week to now trade at $0.035 while managing $9.1 mln in trading volume in the last 24 hours.\n\nThe coin hit a new high earlier this year in January at $0.15 but is currently down 76.4% from its peak.\n\nFLR tokens were airdropped to XRP holders earlier this year after almost two years of anticipation. More than 4.28 billion FLR tokens were distributed to XRP holders who held at least one token during the snapshot on a 1:1 basis. This represented 15% of the project's total supply, with the remaining scheduled to be distributed over the next three years.\n\nRecently Flare Networks also successfully completed the first of 36 planned FLR airdrops to wrapped FLR token holders (WFLR). The airdrop was made possible after passing the Flare Improvement Proposal (FIP.01), which entitles WFLR holders to FLR drops every month for the next three years.\n\nPreviously, the plan was to distribute the remaining FLR tokens to XRP holders in 36 tranches over the same period, but the introduction of FIP.01 made the airdrop more inclusive and in line with the project's broader vision.\n\nTo be eligible for this airdrop, users need to hold WFLR for 23 days before each claim day. The network chooses three random blocks within this specified holding period to get an average of the WFLR tokens held by each wallet. Each holder's rewards are then calculated as a percentage of the wallet's average WFLR holdings to all WFLR in circulation.\n\nFlare Network is transitioning from a mere DeFi application using XRP tokens to a layer 1 blockchain and oracle provider. The network has already handled more than 268 million requests for data and transactions.\n\nClick here to learn all about investing in FLR.\n\nTop Gainers of the Crypto Market\n\nAmong all the coins in the market, obscure tokens like Vow (VOW), Polylastic (POLX), Curio Governance (CGT), and Cratos (CRTS) recorded the most gains of 1,096%, 1,530%, 3,470%, and 14,426% respectively, as per Messari. However, these coins have extremely low volume, making them easy to pump and dump.\n\nLow-cap coins with decent amounts of volume that pumped the hardest the past week involve OAX (OAX), which is a $26.4 mln market cap token with $2.38 mln in 24-hour volume. The coin is up 109% in the last week and 178% YTD.\n\nThe $278 mln market cap token FLEX Coin (FLEX), with $1.87 mln in 24-hour volume, surged over 79% last week and is up 102% in the last month.\n\nOther notable mentions include; Diamond (DMD), a $34 mln market cap token with $0.85 mln in volume, which is up 52% in the past week and 112.5% YTD. QLC Chain (QLC) is a $58.5 mln market cap token with about $4.5 mln in volume, surging 45% in the past seven days and 219% YTD.\n\nRadicle (RAD) is another one, which is a $124 mln market cap token with $43.13 mln in volume, up 44% in 7 days and 87% YTD. Trader Joe (JOE), meanwhile, is a $161 mln market cap token with $88.54 mln in volume recording 43% gains in the past seven days and 258% YTD."
    }
]