[
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNy8yNS9tYXNoaW5za3lzLWFycmVzdC1yaXBwbGUtcnVsaW5nLWV0Yy_SAVNodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDcvMjUvbWFzaGluc2t5cy1hcnJlc3QtcmlwcGxlLXJ1bGluZy1ldGMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Mashinsky's Arrest, Ripple Ruling, Etc. - CoinDesk",
        "content": "The U.S. Department of Justice accused former FTX CEO Sam Bankman-Fried of leaking the personal diary of former Alameda Research CEO Caroline Ellison, who he had previously been in a relationship with, to discredit her as a witness in his upcoming criminal trial. Bankman-Fried’s attorneys denied that he was trying to discredit her, but acknowledged that he had provided a New York Times reporter with unspecified materials not obtained through discovery."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3JpcHBsZS1leHBhbnNpb24tdWstaXJlbGFuZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Ripple's next stop: Service expansion in UK, Ireland - Blockworks",
        "content": "Ripple looks to expand its services to the UK and Ireland following its partial victory in a high profile case brought by the SEC.\n\nRipple has applied for a crypto asset firm license with the UK’s Financial Conduct Authority (FCA), and now it’s going after a payment institution license in Ireland, Sendi Young said to DL News in an article published Monday.\n\nYoung, Ripple’s European managing director, confirmed the information she provided to DL News in an early morning tweet on Tuesday. Blockworks reached out to Ripple for additional information about its activities in the UK and Ireland, but the company declined to comment.\n\nThe UK’s FCA approved Bitstamp’s registration as a crypto asset firm in June 2023. MoonPay, Wintermute Trading and eToro are among other notable firms that have registered.\n\nIn Ireland, payment institutions need to be approved by the country’s central bank, whose leader wasn’t too fond of “unbacked crypto” as recently as May.\n\nBank of Ireland Governor Gabriel Makhlouf said in a May blog post that “the claimed benefits of ‘unbacked crypto’ should be treated with a large dose of skepticism. The purchase of such products can be similar to purchasing a lottery ticket: you might win but you probably won’t.”\n\nThis could perhaps present a hurdle to Ripple, which is linked to the cryptocurrency XRP. Though it should be noted that Ripple says its payment solutions and XRP are separate from one another.\n\nIn fact, many banking institutions use RippleNet, an enterprise blockchain network, including Santander and the Canadian Imperial Bank of Commerce.\n\nAnd Ripple isn’t just expanding in Europe. Singapore allowed Ripple in June to begin offering crypto and payment services in the southeast Asian city state.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wNy8yNS9yaXBwbGUtc2VjLXJ1bGluZy14cnAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Ripple court 'win' doesn't mean battle for regulatory clarity is over - TechCrunch",
        "content": "It’s been almost two weeks since a federal court ruling settled a years-long battle between Ripple Labs and the SEC over the nature of Ripple’s XRP token. Southern District of New York judge Analisa Torres ruled that the XRP token is not a security when sold to the general public, but it can be treated as a security for past XRP sales to institutional clients.\n\nThe verdict was a “win” for both the company and the crypto community alike, but Stu Alderoty, chief legal officer of Ripple Labs, hinted on TechCrunch’s Chain Reaction podcast that the search for regulatory clarity is far from over.\n\nThe SEC said after the ruling that the verdict in favor of Ripple on secondary markets sales was “wrongly decided” and the court “should not follow them.” The statement was mentioned in legal documents for a separate case against Terraform Labs, and the agency said it’s considering other available avenues for further review.\n\nBut Ripple won’t shy away from the SEC’s likely appeal, Alderoty said. “We think the judge got that right, and we think that was a faithful application of the law, and I think a court of appeals will not only affirm that but maybe even amplify that to even a greater extent.”\n\nAlderoty said the Ripple case could provide clarity for other pending lawsuits. “I think our case and the decision rendered by our judge will provide comfort to other judges that the SEC is just misguided.” But, he said, the question that policymakers and lawyers should be asking is, “What’s the best regulatory framework that we can create that protects the integrity of the market?”\n\nIn general, the industry needs a comprehensive regulatory framework, not least because without it, the U.S. is at risk of losing innovation, he said. “Without that, I don’t think the crypto industry and the technology behind it, the brilliant entrepreneurs that are driving it, will be able to really realize the full potential of this technology in the U.S. and it’s going to continue to move offshore.”\n\nAnd that might be true. An Electric Capital report from April found that the U.S.’s share of blockchain developers has fallen 2% per year in the last five years, dropping to 29% last year from 40% in 2017. Compared to other regions in the world, the drop in the U.S. is “a marginal difference,” Maria Shen, partner at Electric Capital, said at the time.\n\nWhile Alderoty is Ripple’s lawyer, his advice to others is simple: Build a company in a country where there is a “clear regulatory regime.”\n\n“Otherwise, you’re still going to face the hostility that we see about the face of the crypto industry in the U.S.,” Alderoty said. “Until we have a clear, comprehensive regulatory framework in the U.S., this is probably not the place where you want to start your business. And that’s an unfortunate statement.”\n\nThis story was inspired by an episode of TechCrunch’s podcast Chain Reaction. Subscribe to Chain Reaction to hear more stories and tips from the entrepreneurs building today’s most innovative companies.Connect with us: Connect with us:"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3JpcHBsZS1mb29kcy1idWlsZHMtb24tc3VjY2Vzcy1vZi1yaXBwbGUta2lkcy1wbGFudC1iYXNlZC1taWxrLXdpdGgtbmV3LXVuc3dlZXRlbmVkLXZlcnNpb24tMzAxODg0ODIzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Ripple Foods Builds on Success of Ripple Kids Plant-Based Milk with NEW Unsweetened Version - PR Newswire",
        "content": "New Innovation Developed In Response to Consumer Demand Rolls Out to Stores Nationwide\n\nBERKELEY, Calif., July 25, 2023 /PRNewswire/ -- Ripple Foods , a leader in plant-based dairy, announced today the newest addition to its portfolio of plant-based products: Ripple Kids Unsweetened Original Milk. The new offering is an unsweetened version of its wildly popular Kids Original Milk and features 8 grams of plant-based protein and 50 mg of DHA Omega-3s and Choline, while having zero added sugars.\n\nNew Ripple Kids Unsweetened Original Milk rolls out to stores nationwide\n\nThe product was developed in response to consumer desire for an unsweetened version of Ripple Kids plant-based milk, one of the most requested items by parents to the company. Since its launch in 2021, Ripple Kids Original Milk has experienced explosive growth, and has been one of the fastest-growing products across all retail channels in the refrigerated plant-based milk category over the past year.\n\n\"The feedback we have received from parents about Ripple Kids has been overwhelmingly positive. Parents consistently say Ripple Kids has been a game-changer for their family, due to the need for an alternative to dairy that provides great taste and optimal nutrition for children,\" said Laura Flanagan, CEO of Ripple Foods. \"Parents also expressed a desire for an option without added sugar, so we felt it was important to bring this to the marketplace and give consumers the choices they're looking for -- especially since Ripple Kids is the only plant-based milk developed specifically for kids.\"\n\nRipple Kids Unsweetened Original features zero grams added sugar, 8 grams of plant-based protein for growing bodies, healthy DHA Omega-3's for brain building nutrition, prebiotic fiber to support digestion, and provides more calcium per serving than dairy milk.\n\n\"With so many kids suffering from dairy allergies or lactose intolerance today, it's important to have alternatives to dairy with the right taste and nutritional profile to meet their unique needs at such an important stage of growth and development,\" said Frances Largeman-Roth, RDN. \"Ripple Kids plant-based milk offers families a convenient solution, and I'm excited there's now an unsweetened version without the added sugars, to provide even more choices. There's nothing else like this on the market,\" she added.\n\nRipple Kids Unsweetened Original comes in a 48 oz bottle and is currently rolling out to Target stores nationwide, as well as other fine retailers. The product retails for $5.49-$6.49 and can be found in the dairy aisle.\n\nAbout Ripple Foods: Berkeley-based Ripple Foods is a leader in developing innovative and delicious dairy-free products. Using protein from yellow peas, Ripple Foods creates creamy and protein-filled products like Plant-Based Milk, Protein Shakes, and Half & Half. Sustainably produced and using significantly less water than dairy and other dairy alternatives, Ripple is a Certified Benefit Corporation, proudly built on transparency that even the smallest actions can have far-reaching impacts. Ripple products are gluten-free, 100% vegan, certified non-GMO and made without nuts, lactose and soy. For more information visit: www.ripplefoods.com and join the plant-based conversation with @ripplefoods on Instagram and Facebook.\n\nSOURCE Ripple Foods"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZ2ZtYWcuY29tL2Vjb25vbWljcy1wb2xpY3ktcmVndWxhdGlvbi9jYWxsLWl0LXRoZS1yaXBwbGUtZWZmZWN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Call It “The Ripple Effect” - Global Finance",
        "content": "Recent court crypto ruling offers corporates an FX alternative.\n\n\n\n\n\nThe recent landmark judgment that handed crypto platform provider Ripple Labs a partial victory against complaints brought by the US Securities and Exchange Commission (SEC) is likely to disrupt the US market and drive broader adoption of Ripple’s XRP digital token, which is often used by businesses, government and financial institutions as a bridge currency. Other crypto firms such as crypto exchange operator Coinbase—which is also accused of selling unregistered securities on its platform—might use Ripple’s win as a legal precedent.\n\nThe judgment by the US District Court for the Southern District of New York ruled that XRP is not a security except when used for institutional sales. The ruling will also likely force US banks to innovate even faster amid the threat of greater disintermediation that broader usage of the digital token may bring. For starters, US corporate treasury departments will now have unencumbered access to XRP at a fraction of the cost of traditional banks in foreign exchange (FX) transactions.\n\nRipple also stands to gain from US banks using XRP for cross-border payments as a blockchain alternative to the payment-messaging cooperative SWIFT. And the US government is likely to be watching events closely.\n\nThe roll-out of the highly anticipated FedNow real-time payment service on July 20 allows 41 participating banks and financial institutions to offer their customers instant payments in the US. Designed by the Federal Reserve, the system uses technology powered by Volante—a Ripple partner—as one of the companies supporting the Fed initiative.\n\nThat has led to speculation that Ripple’s indirect involvement could speed the use of XRP. The Fed is on the record saying that it assessed XRP’s capabilities during research before FedNow’s launch. Indeed, central bank officials have said FedNow is an attempt to modernize America’s banking system and may limit the reach of private sector players such as Venmo and PayPal.\n\nFor now, FedNow is limited to domestic payments, but it is not inconceivable that it may be deployed in cross-border payments as part of the Fed’s modernization efforts. Digital-first banking services are increasingly taking center stage, but the current payment rails in the US look dated and mismatched concerning consumer demand.\n\nMeanwhile, Ripple Labs could benefit if the Biden Administration pushes ahead with plans for central bank digital currency (CBDC). In May, it launched a CBDC platform that lets central banks, governments and financial institutions issue their own CBDC, leveraging the same blockchain technology used by the XRP Ledger.\n\nRipple’s partial victory is also a much-needed shot in the arm for the cryptocurrency sector, which remains weighed down by the specter of regulatory uncertainty. The hawkish stance of regulators, notably the SEC, has stifled innovation and driven business abroad, leading some analysts to claim the US is falling behind other major economies in the crypto space.\n\nConsidering such observations, the US Congress faces growing pressure to provide regulatory clarity and rein in so-called ‘regulation by enforcement’ that has hampered the domestic crypto and digital assets. Unsurprisingly, Ripple is highly bullish on the disruptive ability of cryptocurrencies, particularly in the payment space. In early July, it published a report in which the authors estimated that more than 65% of the US population is expected to use mobile banking by 2025.\n\n\n\n\n\nMobile money payments reached a staggering $1.26 trillion in 2022, according to the GSM Association’s State of the Industry Report on Mobile Money 2023, which the Bill and Melinda Gates Foundation funded. There are now 174 million money agents globally servicing the mobile payments sector, the authors note, in what must be the mother of all wake-up calls for banks.\n\nStill, some legal analysts predict Ripple’s victory against the SEC could be short-lived if the regulator decides to appeal the judgment. Such an outcome would deal a heavy blow to the recuperating crypto sector.\n\nIndeed, it would cause quite a ripple."
    }
]