[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9ob3JyaWZ5aW5nbHktcmVhbGlzdGljLXJpcHBsZS1zY2FtLWVtZXJnZXMtb24tc29jaWFsLW1lZGlh0gFOaHR0cHM6Ly91LnRvZGF5L2hvcnJpZnlpbmdseS1yZWFsaXN0aWMtcmlwcGxlLXNjYW0tZW1lcmdlcy1vbi1zb2NpYWwtbWVkaWE_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Horrifyingly Realistic Ripple Scam Emerges on Social Media - U.Today",
        "content": "Advertisement\n\nA new scam involving Ripple-affiliated XRP cryptocurrency has surfaced on social media platforms. The scam, alarmingly sophisticated in its execution, utilizes AI technology to imitate Ripple CEO Brad Garlinghouse's voice and image, aiming to mislead users into believing in a non-existent XRP giveaway.\n\nNature of scam\n\nThe scam lures victims with a seemingly generous offer: Send a minimum of 1,000 XRP and receive double the amount in return.\n\nThe scam video features Garlinghouse promoting this fake giveaway. The video's voice, mimicking the Ripple boss in an extremely realistic manner, promises swift returns to those participating in this so-called community support initiative.\n\nHowever, eagle-eyed viewers have noticed discrepancies in the video's editing, particularly around the mouth movements, raising red flags about its authenticity.\n\nThis scam is part of a worrying trend of using AI to clone the voices of public figures. Similar tactics have been employed against other prominent individuals, including venture capitalist Tim Draper, a well-known Bitcoin enthusiast.\n\nAs reported by U.Today, Draper recently warned the public about these AI voice cloning scams, stressing that he would never solicit funds in such a manner.\n\nRipple's legal action against YouTube\n\nXRP scams have been plaguing YouTube for years. Back in 2021, Garlinghouse took legal action against the popular video-hosting platform for allowing such scams to proliferate on its platform.\n\nUltimately, the case was settled, with both parties agreeing to work together to prevent such deceptive practices in the future.\n\nHowever, with the rise of AI-powered voice-cloning technologies, cryptocurrency scams continue to proliferate on social media platforms."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LnB5bW50cy5jb20vY3J5cHRvY3VycmVuY3kvMjAyMy9yaXBwbGUtY2hpZWYtc2VjLWNvdWxkLWJlLXRoYXdpbmctdG93YXJkLWNyeXB0by_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Ripple Chief: SEC Could Be 'Thawing' Toward Crypto - PYMNTS.com",
        "content": "The CEO of Ripple says the SEC has stumbled in its investor protection duty.\n\n“I think the SEC, in my opinion, has lost sight of their mission to protect investors,” Brad Garlinghouse said of the Securities and Exchange Commission (SEC) in an interview with CNBC published Saturday (Nov. 11). “And the question is, who are they protecting in this journey?”\n\nA spokesperson for the SEC declined to comment when reached by PYMNTS.\n\n“One of the things that people talk about is, one of the definitions of insanity is doing the same thing over and over again, and thinking you’ll get a different outcome, the SEC is doing the same thing over and over again,” Garlinghouse added. “And they think, I guess, they’re gonna get a different outcome at some point.”\n\nGarlinghouse is no stranger to tangling with the SEC, which sued Ripple and its executives in 2020 for securities law violations. The regulator accused Ripple of failing to register an ongoing offer and sale of billions of XRP tokens to investors.\n\nRipple won a crucial victory — for itself and the crypto sector as a whole — in July when a judge found that XRP is not a security. The ruling has “far-ranging repercussions across the digital asset ecosystem, which has long argued that its tokens do not represent securities contracts,” PYMNTS wrote soon after.\n\nThe SEC later lost its bid to appeal that decision. Last month, the commission dropped its charges against Garlinghouse and fellow Ripple executive Chris Larsen, though its case against the company continues.\n\n“I think it is a positive step for the industry, not just for Ripple, not just for Chris and Brad, but for the whole industry, that the SEC has been put in check in the United States,” Garlinghouse said.\n\n“And I’m hopeful this will be a thawing of the permafrost in the United States for really seeing an amazing industry that has immense potential to thrive in the largest economy in the world.”\n\nThe SEC’s attitude toward the crypto sector has previously caused Garlinghouse to say that the company was focusing on other jurisdictions for its hiring.\n\nInterviewed in September at the Token2049 conference in Singapore, he said Ripple plans to conduct 80% of its hiring from countries he argued are better at regulating cryptocurrency.\n\n“It’s super frustrating that you see markets like we have here in Singapore … where the governments are partnering with the industry, and you’re seeing leadership providing clear rules, and you’re seeing growth,” he said. “And frankly that’s why Ripple is hiring there.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1yaXBwbGVzLXN3ZWxsLXN1Y2Nlc3MtYW1pZC1zZWMtYmF0dGxlcy0xMzg4MTEw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "XRP News: Ripple's Swell Success Amid SEC Battles - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS92ZXJ5LWN1cmlvdXMtZmluZGluZy1hYm91dC10aGUtcmlwcGxlLXhycC1wcmljZS1hbmQtYml0Y29pbi_SAVlodHRwczovL2NyeXB0b3BvdGF0by5jb20vdmVyeS1jdXJpb3VzLWZpbmRpbmctYWJvdXQtdGhlLXJpcHBsZS14cnAtcHJpY2UtYW5kLWJpdGNvaW4vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Very Curious Finding About the Ripple (XRP) Price and Bitcoin - CryptoPotato",
        "content": "TL;DR\n\nPrice Correlation Evidence : Recent data shows a high correlation coefficient (0.84) between Bitcoin and Ripple prices, suggesting a closer relationship than previously thought, especially compared to the negative correlation between Bitcoin and stock prices.\n\n: Recent data shows a high correlation coefficient (0.84) between Bitcoin and Ripple prices, suggesting a closer relationship than previously thought, especially compared to the negative correlation between Bitcoin and stock prices. Trading Volumes Indicate Overlap: High daily trading volumes for the XRP-BTC pair on major exchanges like Bitstamp and Binance demonstrate significant overlapping interest among investors in both cryptocurrencies.\n\nWay back in February 2019, “Mastering Bitcoin” author Andreas Antonopoulos claimed:\n\n“People interested in XRP are not interested in Bitcoin.”\n\nBackground: BTC vs. XRP\n\nThe two ultra-high market cap, blue chip cryptocurrencies have certainly competed for capital inflows and development. Back in those “early days” of the burgeoning blockchain industry, so-called “Bitcoin Maxis” said Ripple wasn’t a “real” blockchain. The XRP army called Bitcoin an outdated blockchain.\n\nMaxis claimed Bitcoin’s proof-of-work consensus mechanism to secure an entirely P2P cash network makes BTC more secure than XRP. Meanwhile, the most zealous Ripple supporters criticized Bitcoin for being too energy-intensive and slower to make payments.\n\nBut is it really true anymore that Bitcoin and Ripple people really have nothing to do with each other? Here’s what some of the data has to say.\n\nBitcoin Ripple Price Correlation: 0.84\n\nThe three-month Bitcoin Ripple price correlation coefficient is running at a hot 0.84, according to data from Macroaxis, a fintech analytics firm:\n\n“The correlation between historical prices or returns on Bitcoin and XRP is a relative statistical measure of the degree to which these equity instruments tend to move together[…] Values of the correlation coefficient range from -1 to +1[…]”\n\nCompare that to the Bitcoin stocks correlation, which fell into negative territory after the S&P 500 Index dipped while Bitcoin and XRP prices rallied in October.\n\nMeanwhile, The XRP-BTC trading pair saw a daily volume Saturday of over 590,000 XRP on Bitstamp alone, according to TradingView data. On Binance, the XRP-BTC pair saw an even higher daily trading volume of 41.2 million XRP.\n\nIn addition to the high Bitcoin-Ripple price correlation, that’s strong evidence that there is an overlap of interest in XRP and BTC among a sizable number of cryptocurrency traders today."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlcy1ob3ctbXVjaC1yaXBwbGUteHJwLXdhcy1zdG9sZW4taW4tdGhlLXBvbG9uaWV4LWF0dGFjay_SAVlodHRwczovL2NyeXB0b3BvdGF0by5jb20vaGVyZXMtaG93LW11Y2gtcmlwcGxlLXhycC13YXMtc3RvbGVuLWluLXRoZS1wb2xvbmlleC1hdHRhY2svP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Here’s How Much Ripple (XRP) Was Stolen in the Poloniex Attack - CryptoPotato",
        "content": "TL;DR\n\nPoloniex Hack : Cryptocurrency exchange Poloniex was hacked on November 10, losing $125 million in various cryptocurrencies from its hot wallets, including 3.1 million XRP tokens.\n\n: Cryptocurrency exchange Poloniex was hacked on November 10, losing $125 million in various cryptocurrencies from its hot wallets, including 3.1 million XRP tokens. Widespread Token Impact : Over 175 different tokens were affected, with major losses including $11M in USDT, $10.4M in ETH, and $6M in ELON, indicating a highly sophisticated and extensive attack.\n\n: Over 175 different tokens were affected, with major losses including $11M in USDT, $10.4M in ETH, and $6M in ELON, indicating a highly sophisticated and extensive attack. Response and Containment: Owner Justin Sun confirmed the breach and offered a 5% bounty for fund recovery.\n\nPoloniex, one of the leading cryptocurrency exchanges, fell victim to a sophisticated hack on November 10. The attackers successfully targeted the platform’s hot wallets, making off with a staggering $125 million in various cryptocurrencies, a significant blow to the exchange and its users.\n\nThe hackers’ brazen heist included the theft of approximately 3.1 million XRP tokens, roughly $2.07 million. XRP Forensics confirmed the news, as it happened at the same time as the incident on other chains, including Ethereum, Tron, and Bitcoin.\n\nA Poloniex hot wallet was emptied for 3.1 million XRP about 30 minutes ago. This happened at the same time as the incident on other chains, including ETH, BTC and Tron. We have flagged the accounts involved and are following the money.https://t.co/r9FsO8euLe — XRP Forensics (XRPLF) (@xrpforensics) November 10, 2023\n\nThis makes XRP one of the tokens with the most significant outflows in the hack —others include GLM ($2.5M), OX ($3.1M), SHIB ($4.7M), USDC ($5M), and other important cryptocurrencies such as ETH.\n\nThe biggest token outflows ($), but not all were: $11M USDT\n\n$10.4M ETH\n\n$6M ELON\n\n$5M USDC\n\n$4.7M SHIB\n\n$3.1M OX\n\n$2.5M GLM This is currently the final page for Poloniex outflows pic.twitter.com/SCNVpBQKxw — Nansen 🧭 (@nansen_ai) November 10, 2023\n\nLosses Within ‘Manageable Limits’\n\nAs CryptoPotato reported, the hack compromised more than 175 different tokens, each with individual valuations exceeding $10,000. This broad scope indicates a well-planned attack that sought to maximize the impact on the exchange’s digital assets.\n\nPoloniex’s owner, Justin Sun, confirmed the breach in a public statement, prompting users to remain calm and offering a 5% white hat bounty for the attacker in exchange for the return of the stolen funds.\n\nSun revealed that the hackers specifically targeted various wallets across multiple blockchains, demonstrating a high level of sophistication in their approach. Blockchain analytics company Nansen showed only 175 tokens left in Polonie’s wallet, amounting to just $10k."
    }
]