[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LnNwZ2xvYmFsLmNvbS9tYXJrZXRpbnRlbGxpZ2VuY2UvZW4vbmV3cy1pbnNpZ2h0cy9ibG9nL3NuYXBzaG90LXRoZS1yaXBwbGUtZWZmZWN0cy1vZi0yMDIzLWJhbmstZmFpbHVyZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Snapshot: The Ripple Effects of 2023 Bank Failures - S&P Global",
        "content": "The collapse of SVB Financial and Signature Bank marks the second and third largest US bank failures since 2008. The total assets of the two failures amount to 87.6% of the total assets from the 25 failures of 2008. What have been the ripple effects on the global banking sector so far? Check out our summarized coverage of the week."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LnN0YXRpc3RhLmNvbS9jaGFydC8yOTUyOC9tYXJrZXQtY2FwLWdsb2JhbC1iYW5rcy_SAUFodHRwczovL3d3dy5zdGF0aXN0YS5jb20vY2hhcnQvYW1wLzI5NTI4L21hcmtldC1jYXAtZ2xvYmFsLWJhbmtzLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "U.S. Bank Failures Continue Global Ripple Effects - Statista",
        "content": "HTML code to embed chart\n\nCan I integrate infographics into my blog or website?\n\nYes, Statista allows the easy integration of many infographics on other websites. Simply copy the HTML code that is shown for the relevant statistic in order to integrate it. Our standard is 660 pixels, but you can customize how the statistic is displayed to suit your site by setting the width and the display size. Please note that the code must be integrated into the HTML code (not only the text) for WordPress pages and other CMS sites."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNpdHlvZm1vYmlsZS5vcmcvZmlyZS9icmFuZG9uLXJpcHBsZS1uYW1lZC1mZWJydWFyeS1maXJlZmlnaHRlci1vZi10aGUtbW9udGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Brandon Ripple Named February Firefighter Of The Month - City of Mobile",
        "content": "Firefighter of the Month Brandon Ripple Named February Firefighter of the Month Mar 20th, 2023\n\nThe Mobile Fire-Rescue Department proudly recognizes Firefighter Brandon Ripple as the February 2023 Firefighter of the Month. Firefighter Ripple began his career with the Mobile Fire-Rescue Department in November 2018.\n\nRipple joined the MFRD with a positive, can-do, team-oriented attitude toward all aspects of the job. His unbeatable spirit allowed him to accomplish most anything that was asked of him, no matter the scale. Ripple’s hyper-positive perspective has proven to be contagious amongst his crews and peers.\n\nAs an informal leader around the fire station and on emergency scenes, Firefighter Ripple gives unparalleled attention to even the most minute details. From mentoring new recruits and probational firefighters to providing emergency, medical aid, and more, Ripple’s empathy, compassion, and willingness to help anyone, anywhere, anytime is unrivaled.\n\nFirefighter Ripple is always eager to learn new skills and methods to better perform his job. He often goes above and beyond in his efforts to improve his skillset and elevate the performance of his crews and those around him. Within just four years, Firefighter Ripple achieved certifications as an Aerial Relief Driver, Rescue Technician, and Hazmat Technician. He has volunteered countless hours instructing and assisting the Department during Alabama Fire College certification courses; thus, ensuring improved training and skills for MFRD firefighters.\n\nWith a proficiency that exceeds the standard, Firefighter Ripple is a valuable asset to the Mobile Fire-Rescue Department and citizens of Mobile."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9jcnlwdG8taGFja2Vycy1wcm9tb3RlLWZha2UteHJwLWFpcmRyb3Atb24tbmV3czI0LXR3aXR0ZXItYWNjb3VudC_SAV9odHRwczovL2NyeXB0b3BvdGF0by5jb20vY3J5cHRvLWhhY2tlcnMtcHJvbW90ZS1mYWtlLXhycC1haXJkcm9wLW9uLW5ld3MyNC10d2l0dGVyLWFjY291bnQvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Crypto Hackers Promote Fake XRP Airdrop on News24 Twitter Account - CryptoPotato",
        "content": "The Twitter account of one of the leading news channels in India – News24 – became a victim of a recent cryptocurrency scheme. Hackers breached their security to post phishing links of a fake XRP drop, urging people to click and potentially get conned.\n\nCrypto scammers have previously compromised the Twitter account of India’s Prime Minister – Narendra Modi – and the profiles of the Indian Medical Association (IMA), the Indian Council of World Affairs (ICWA), and Mann Deshi Mahila Bank.\n\nThe Latest Victim in India\n\nWrongdoers took control of News24’s Twitter account and posted counterfeit Ripple events, such as an XRP airdrop. They attached compromised links regarding and even featured the image of Ripple’s CEO – Brad Galinghouse – to gain people’s trust.\n\nNeedless to say, there was no such airdrop, hinting that some of the 1.4 million followers of News24 might have become victims of the scam.\n\nSome fake announcements are still visible on the outlet’s Twitter account, meaning it has either not noticed the issue or has struggled to cope with the attackers.\n\nIndia has recently emerged as a hotbed for such scams. Hackers compromised the official Twitter profile of Prime Minister Narendra Modi at the end of 2021 and published a malicious post that the country has adopted bitcoin as legal tender and that the government has purchased 500 BTC, which will distribute to the population.\n\nIt remained unknown how many people fell victim to the scam, but their number could have been substantial, considering that Modi has over 87 million followers.\n\nBad actors stepped in again a month later, breaching the security of the Twitter accounts of the Indian Medical Association (IMA), the Indian Council of World Affairs (ICWA), and Mann Deshi Mahila Bank. They shared several tweets featuring Elon Musk, who seemingly promoted cryptocurrencies.\n\nThe Fake Arbitrum Airdrops\n\nAs CryptoPotato recently reported, cryptocurrency participants should be cautious about another scam related to the Ethereum layer-2 scaling solution – Arbitrum.\n\nScammers flooded the space with fake airdrops of the project and phishing websites which, upon clicking, can lead to financial loss for users. Arbitrum News DAO said it detected over 270 such sites.\n\nRecall that the actual ARB token airdrop will occur on March 23. Consumers can view all necessary details and check their eligibility here."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYm9sZC5jb20vcmlwcGxlLXYtc2VjLWNvdXJ0LWNhc2UtdXBkYXRlLWFzLW9mLW1hcmNoLTIwLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Ripple v. SEC court case update as of March 20, 2023 - Finbold - Finance in Bold",
        "content": "The crypto community is eagerly awaiting the possible summary judgment date in the Ripple lawsuit fronted by the Securities Exchanges Commission (SEC). As a recap, legal experts had speculated that the matter might be determined in the first quarter of 2023.\n\nIn the meantime, various legal practitioners are offering predictions regarding the possible outcome in the case and the judgment’s overall implication on the crypto space. Under the latest update, pro-XRP lawyer John Deaton in a tweet on March 19, has maintained that the controversial Hinman documents will be eventually made public despite the SEC’s objection.\n\nAccording to Deaton, the documents relating to former SEC official William Hinman will be unsealed regardless of the decision by presiding judge Analisa Torres. He noted that the judge would rely on the documents to make her judgment and, in the process, declare them “judicial documents” and order them to be unsealed.\n\n“Regarding the Hinman emails and speech drafts: the SEC has requested for them to remain sealed, even after Judge Torres’ ruling on summary judgment. I believe the emails and speech drafts will be made public at some point, regardless of Judge Torres’ decision on whether to seal,” he said.\n\nRelevance of Hinman documents in other litigations\n\nThe attorney added that the documents are relevant because they might be required to be used in other litigations, such as the lawsuit against Dragonchain. Notably, Dragonchain is an ERC20 token governed by the Ethereum (ETH) blockchain and has active litigation. In this regard, Deaton believes Dragonchain will seek to obtain the emails and drafts to build their defense.\n\nMeanwhile, Deaton had earlier faulted the SEC for naming Ripple executives Brad Garlinghouse and Chris Larsen in its lawsuit, terming it an ‘error.’ Deaton argued that the SEC ought to have concentrated its attention exclusively on Ripple, instead of going after individuals who were not directly accountable for the purported securities infringements.\n\nAmid the speculations regarding the case’s outcome, Ripple’s chief legal officer Stuart Alderoty had welcomed the court’s ruling on the “Daubert” motions. In the ruling, the judge failed to grant and deny portions of each party’s motions in relation to striking out expert witnesses.\n\nOn the other hand, U.S. lawyer Jeremy Hogan had previously suggested that judge Torres may have already decided whether XRP is a security. As a reminder, the SEC is suing Ripple for selling XRP tokens without getting relevant approvals from the agency.\n\nXRP price analysis\n\nAs the crypto community turns to focus on the case outcome, XRP continues to record gains aligning with the general market price movement. By press time, XRP was valued at $0.39 with daily gains of about 0.6%.\n\nThe token is currently controlling a market capitalization of about $19.55 billion. Overall, XRP has attracted increased capital inflow in the past week, with the value peaking at $20.3 billion on the weekly chart.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]