[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd2lja2VkbGVla3Mucml2ZXJmb3JkLmNvLnVrL29waW5pb24vcmlwcGxlLWVmZmVjdC1maWdodHMtYS10cmlwbGUtY3Jpc2lzLW9mLWh1bmdlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ripple Effect fights a 'triple crisis' of hunger - Wicked Leeks",
        "content": "This plea is for the lucky ones amongst you who, like me, are fortunate enough to have enough money to give you choices. If your budget affords you few options, this request is not aimed at you – especially as so many of you have already given to our charity partners recently. But if you are one of the privileged few, and want to use your cash to positively influence the world around you, then we could use your help.\n\nDeciding how to put money to the best use is complex; so many charitable interventions have unintended consequences, and you can’t support everything. My own choice is clear, supporting a cause that I have seen the value of first-hand.\n\n20 years ago, provoked by the common argument that “Organic is all very well for the wealthy west, but it will never feed the world,” I spent two months visiting subsistence farmers in East Africa. The second month was spent with a man called Timothy Njakasi, who had previously trained on our farm in Devon, visiting farmers trained by the charity Ripple Effect (then called Send a Cow) in southern Uganda.\n\nIt was some of the most inspiring farming I had ever seen. I was astounded by how productive these tiny organic plots of an acre or less could be, with highly complex systems incorporating multi-canopy cropping, water conservation, seed saving, composting, and clever companion planting. The best of these farms were up to 20 times more productive than the poorly farmed monocultures and grazing next door, while delivering food security, improved nutrition, and financial independence.\n\nThere were no white aid workers driving fancy pickup trucks, either; Ripple Effect workers were mostly local, peer-to-peer farmer teachers, travelling on small motorbikes to the remote villages where their patient interventions supported lasting change.\n\nRiverford and our customers have supported Ripple Effect ever since, raising over £950,000 so far. We have always pledged our funds to specific projects, but recently learned that the charity faces a ‘triple crisis’ of hunger, caused by Covid-19, soaring living costs, and climate change – while inflation of 30 per cent or more in many African countries, combined with a weakened pound, has eroded their central funding and threatens their programmes. Reading this post by their Ethiopia Country Director made me want to do more.\n\nIf any of you are lucky enough to be in a similar position, please join me by donating here. For every £2 you give via this page, I will add another £1 myself."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDQvMDUvcmlwcGxlLXRyYW5zYWN0cy0zLTNiLWJldHdlZW4tbWV4aWNvLWFuZC11cy13aXRoLWJpdHNvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ripple Transacts $3.3B Between Mexico and US With Bitso Using XRP - The Crypto Basic",
        "content": "The remittances leveraged XRP and moved funds between the United States and Mexico.\n\nBitso, a Mexican crypto exchange and one of Ripple’s most prominent On-Demand Liquidity (ODL) partners, recently disclosed in an official statement that it processed up to $3.3 billion in remittances between the United States and Mexico in 2022. According to Bitso, this feat was achieved in alliance with Ripple.\n\nThis figure represents three times the volume processed in 2021, underscoring the growing rate at which cryptocurrencies are leveraged for cross-border settlements due to their promise. Bitso noted that they expect this figure to increase in the coming years.\n\n- Advertisement -\n\nThe Latin American exchange highlighted that the remittances were facilitated through its Cripto Para Empresas (Crypto for Business) service and were mainly carried out using XRP and stablecoins as bridge assets. Notably, Bitso’s crypto for a business solution is primarily used by remittance and payment companies.\n\nAccording to Bitso’s statement, the “strategic” partnership with Ripple played a major role in bolstering this massive growth in remittance volume. Ripple’s ODL expansion into Latin America in 2019 was marked by a collaboration with Bitso as its primary ODL partner in the region. Three years later, the partnership continues to yield fruitful results.\n\nMonica Long, Ripple’s President, called attention to the recent remittance feat. She highlighted the massive volume of funds moved between the United States and Mexico in cross-border services each year. According to Long, Bitso’s ability to process $3.3 billion of these funds through crypto underscores the “real-world utility” of crypto assets.\n\nThe US <> Mexico corridor sees 10s of billions of $ in payments every year (remittances, treasury, you name it), and last year @bitso processed $3.3B of that through crypto with @Ripple and others. This is real-world utility. https://t.co/MF0GrEgo9c — Monica Long (@MonicaLongSF) April 4, 2023\n\n- Advertisement -\n\nSpeaking on the achievement, Aaron Sears, Ripple’s Managing Director of the Americas, remarked, “Our collaboration with Bitso allows us to continue to offer unprecedented cross-border payments in Mexico, a key region for our clients.”\n\nSears expressed Ripple’s delight in playing a key role in Bitso’s remittance feat and noted that the company wants to increase this figure as they bring trans-national payments to more businesses in Latin America.\n\nBitso’s ODL partnership with Ripple was driven by the company’s goal to facilitate cross-border settlements, especially between Mexico and the United States. This goal also inspired a collaboration with remittance firm Félix Pago through which Bitso aimed to provide WhatsApp-based payments from the United States to Mexico."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNC8wNS9pcy1mZWRub3ctYS1iZXR0ZXItYWx0ZXJuYXRpdmUtdG8tcmlwcGxlLWFuZC1zdGVsbGFyLWx1bWVucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Is FedNow a Better Alternative to Ripple and Stellar Lumens? - The Coin Republic",
        "content": "The United States Federal Reserves clarified that its payment system FedNow is likely to launch by July this year. There are still about months until the launch of the US central bank’s quite anticipated payment system. Yet, it started getting attention and started posing itself as a replacement for many existing cross-border payment systems. This includes payment protocols like Ripple (XRP) and Stellar Lumens (XLM), and multiple stablecoins, which facilitate ultra-cheaper and faster value transfer methods than the traditional methods.\n\nFedNow will likely make the fund’s transfer in the US dollar across financial institutions, like banks, relatively faster and will charge ultra-low costs. It is reportedly a medium to initiate peer-to-peer (P2P), business-to-business and business-to-consumer (B2C) transactions.\n\nUndoubtedly the upcoming payment system will have superiority over the existing centralized payment system. The latter has a slow process that takes days to process payments in the name of business days. Moreover, limited banking hours, in particular, also make it an issue.\n\nWith FedNow, the payments within financial entities will be done instantly and will be beneficial for businesses that rely on continued cash flow. The 24*7 availability of the upcoming payment system will eliminate the issue with time and be readily available for cash deposits or withdrawals.\n\nThough all this could be cited as an end for blockchain-based crypto payment systems, it should also be kept in mind where the revolution got sparked. The world might only deal with minor banking payment system updates, not cryptocurrency-based payment solutions.\n\nThe inception of Bitcoin (BTC) proved the theory of peer-to-peer (P2P) transactions without any intermediary is possible using blockchain as the underlying technology. The development in the technology and smoothening of decentralized payment methods went on to revolutionize the systems.\n\nStablecoins emerged as an alternative to fiat currencies with fascinating features of cryptocurrencies like:\n\nFaster transaction speed,\n\nCross-border payments, and\n\nLow transaction fees.\n\nPayment protocols like— Ripple (XRP) and Stellar Lumens (XLM) have redefined international payments with unprecedented advantages.\n\nCrypto and blockchain-based payment solutions have given a push to the traditional financial system. Initiatives like central bank digital currencies (CBDCs) and payment settlement programs like FedNow will likely result from those efforts that came in the wake of competing with the burgeoning decentralized financial system.\n\nHowever, the other boasted features of FedNow, like its ultra-low transaction fees, could potentially threaten Ripple or Stellar-like protocols. Yet the challenge will long last or push the other revolution down the road; it would be a matter of time."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vc3BlY3RyYS5taGkuY29tL3RoZS1yaXBwbGUtZWZmZWN0cy1vZi10aGUtaW5mbGF0aW9uLXJlZHVjdGlvbi1hY3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "The ripple effects of the Inflation Reduction Act | Spectra - Spectra",
        "content": "The Inflation Reduction Act (IRA) is America’s answer to the global call for strong policy action on the climate crisis. It includes almost $370 billion of incentives to reduce carbon emissions, including targeted support for carbon dioxide capture, utilization and storage (CCUS), heat pumps, green hydrogen, electric vehicles (EVs) and energy storage.\n\nThe introduction of the Inflation Reduction Act (IRA) of 2022 by the US government has sent ripples across the global energy industry.\n\nSeveral months on, we’ve had some time to think about this law, which seeks to invest and catalyze hundreds of billions of dollars in US clean energy production. We’ve seen reactions from non-US companies, nations, and blocs that are affected by the federal law, not all of them positive.\n\nBut ‘positive’ is one of the words I’d use to describe the impact on the energy industry from the IRA. Pragmatic would be another. Disruptive would be a third.\n\nPositive for net zero\n\nWhy positive? Because there is a general global alignment on green investment. Of course, the IRA has led to companies wanting to invest more in green projects in the US because the conditions are right for investment.\n\nWe also see that the general direction — all across the world — is towards reaching net zero. Anything that moves us closer to that goal has to be seen as positive.\n\nThe IRA directs nearly $370 billion in funding to US clean energy\n\nPragmatic for manufacturers\n\nThe IRA is pragmatic too — and comprehensive, directing around $370 billion in federal funding to clean energy, with the goal of substantially cutting US carbon emissions by 2030.\n\nThe funds will be delivered through a mix of tax incentives, grants, and loan guarantees, covering all the solutions needed to help us get to net zero, from CCUS, to geothermal, renewable, hydrogen, ammonia and more. The IRA is providing real solutions at scale, and manufacturers can work with the tools it offers them.\n\nDisruptive for non-US markets\n\nThe IRA is also disruptive. You cannot throw a stone into the water and not expect ripples. And the IRA is a very big stone. In fact, it improves the country’s green business case by so much that other areas of the world are racing to respond.\n\nTake the EU. I can’t think of a region that has been doing more to incentivize decarbonization initiatives, while discouraging non-green energy investment. But the European Green Deal is now ‘competing’ with the US’ offering in some ways. Not all of these impacts are intentional, and there are concerns from European businesses that the IRA could pull investment away from the EU.\n\nOn the other hand, you have to feel for the US. For so long, the world has been vocal on asking the US to step up and be bold in the fight against the climate crisis. Then the IRA arrives, and the size and scale of it raises a few eyebrows, and leads to a flurry of discourse on many topics, including the impact on other regions and World Trade Organization rules.\n\nA period of realignment is occurring in the global energy sector\n\nNext steps — balance and calm\n\nThe IRA has clearly made a big splash — possibly bigger than intended — but the waters will become calm again. Right now, manufacturers and market participants involved in global decarbonization are taking stock, trying to understand the impact of the IRA and the subsequent knock-on effects.\n\nAnd policymakers are also re-evaluating their decarbonization initiatives to see if they can level the playing field, and coordinate global efforts to lower emissions.\n\nIn some ways, the outlook is murky, but there are positive signals.\n\nWe’ve already seen the US working with France and Germany to communicate subsidy details more transparently so the EU can match them if they want to. And we’ve seen at least part of the EU’s response to the IRA in the form of its Green Deal Industrial Plan, which details better access to finance and more global cooperation.\n\nThe IRA has made waves, but its ultimate intention is the same across the world — accelerating decarbonization. Investment clarity and global coordination is improving every day, creating more investment opportunities that will help us achieve this goal together."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vc3BlY3RyYS5taGkuY29tL3RoZS1yaXBwbGUtZWZmZWN0cy1vZi10aGUtaW5mbGF0aW9uLXJlZHVjdGlvbi1hY3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "The ripple effects of the Inflation Reduction Act | Spectra - Spectra",
        "content": "The Inflation Reduction Act (IRA) is America’s answer to the global call for strong policy action on the climate crisis. It includes almost $370 billion of incentives to reduce carbon emissions, including targeted support for carbon dioxide capture, utilization and storage (CCUS), heat pumps, green hydrogen, electric vehicles (EVs) and energy storage.\n\nThe introduction of the Inflation Reduction Act (IRA) of 2022 by the US government has sent ripples across the global energy industry.\n\nSeveral months on, we’ve had some time to think about this law, which seeks to invest and catalyze hundreds of billions of dollars in US clean energy production. We’ve seen reactions from non-US companies, nations, and blocs that are affected by the federal law, not all of them positive.\n\nBut ‘positive’ is one of the words I’d use to describe the impact on the energy industry from the IRA. Pragmatic would be another. Disruptive would be a third.\n\nPositive for net zero\n\nWhy positive? Because there is a general global alignment on green investment. Of course, the IRA has led to companies wanting to invest more in green projects in the US because the conditions are right for investment.\n\nWe also see that the general direction — all across the world — is towards reaching net zero. Anything that moves us closer to that goal has to be seen as positive.\n\nThe IRA directs nearly $370 billion in funding to US clean energy\n\nPragmatic for manufacturers\n\nThe IRA is pragmatic too — and comprehensive, directing around $370 billion in federal funding to clean energy, with the goal of substantially cutting US carbon emissions by 2030.\n\nThe funds will be delivered through a mix of tax incentives, grants, and loan guarantees, covering all the solutions needed to help us get to net zero, from CCUS, to geothermal, renewable, hydrogen, ammonia and more. The IRA is providing real solutions at scale, and manufacturers can work with the tools it offers them.\n\nDisruptive for non-US markets\n\nThe IRA is also disruptive. You cannot throw a stone into the water and not expect ripples. And the IRA is a very big stone. In fact, it improves the country’s green business case by so much that other areas of the world are racing to respond.\n\nTake the EU. I can’t think of a region that has been doing more to incentivize decarbonization initiatives, while discouraging non-green energy investment. But the European Green Deal is now ‘competing’ with the US’ offering in some ways. Not all of these impacts are intentional, and there are concerns from European businesses that the IRA could pull investment away from the EU.\n\nOn the other hand, you have to feel for the US. For so long, the world has been vocal on asking the US to step up and be bold in the fight against the climate crisis. Then the IRA arrives, and the size and scale of it raises a few eyebrows, and leads to a flurry of discourse on many topics, including the impact on other regions and World Trade Organization rules.\n\nA period of realignment is occurring in the global energy sector\n\nNext steps — balance and calm\n\nThe IRA has clearly made a big splash — possibly bigger than intended — but the waters will become calm again. Right now, manufacturers and market participants involved in global decarbonization are taking stock, trying to understand the impact of the IRA and the subsequent knock-on effects.\n\nAnd policymakers are also re-evaluating their decarbonization initiatives to see if they can level the playing field, and coordinate global efforts to lower emissions.\n\nIn some ways, the outlook is murky, but there are positive signals.\n\nWe’ve already seen the US working with France and Germany to communicate subsidy details more transparently so the EU can match them if they want to. And we’ve seen at least part of the EU’s response to the IRA in the form of its Green Deal Industrial Plan, which details better access to finance and more global cooperation.\n\nThe IRA has made waves, but its ultimate intention is the same across the world — accelerating decarbonization. Investment clarity and global coordination is improving every day, creating more investment opportunities that will help us achieve this goal together."
    }
]