[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDYvMDIvcmlwcGxlLWN0by1leHBsYWlucy1ob3ctdG8tcHJvZml0LWZyb20teHJwbC1hbW0tdHJhZGluZy1jaXRpbmctYnRjLXhycC1wYWlyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Jun 2023 07:00:00 GMT",
        "title": "Ripple CTO Explains How to Profit from XRPL AMM Trading, Citing BTC/XRP Pair - The Crypto Basic",
        "content": "The CTO of Ripple demystifies the trading strategy the upcoming XRP Ledger (XRPL) automated market maker (AMM) can leverage for profit.\n\nRipple’s CTO, David Schwartz, has simplified the concept of Automated Market Makers (AMMs) and their profitable trading strategies. AMMs utilize price volatility to generate financial gains, and Schwartz’s explanation helps demystify the underlying principles.\n\nThe recent remarks further underscore David Schwartz’s enthusiasm for the eventual launch of the XRP Ledger’s native AMM. As The Crypto Basic reported two months back, Schwartz previously emphasized that the AMM is the most exciting feature to grace the XRPL in the past decade.\n\n- Advertisement -\n\nThe Ripple CTO recently took to Twitter to demystify how AMMs, such as the one coming to the XRP Ledger (XRPL), leverage price volatility.\n\nFor those who want to understand an AMM's trading strategy and may find the math too complex to follow, here's a grossly oversimplified way to understand how the trading strategy works: Say you have an asset that's volatile but no signifcant long-term trend. That is, its price… — David \"JoelKatz\" Schwartz (@JoelKatz) June 1, 2023\n\nSchwartz highlighted that AMMs excel when an asset observes marked volatility but retains its overall trend. The strategy involves buying when the price is low and selling when it is high, capitalizing on the average positive movement despite temporary fluctuations.\n\nThe concept involved is that even though the price may go up and down, the average movement is often positive, as the asset’s overall trend remains intact. This means that, on average, profit is made by buying low and selling high.\n\n- Advertisement -\n\nHowever, Schwartz emphasized that the strategy works best when one asset in the trading pair has a fixed price while the other asset observes volatile price swings. Reacting to this, XRP community member Molly Elmore asked if XRP could serve as the asset with a fixed price.\n\nThe XRPL AMM is Not Limited to Specific Asset Pairs\n\nIn response, Schwartz clarified that AMMs are not limited to specific asset pairs. They can be created between any two assets, although the mathematical properties of the trading strategy differ when both tokens exhibit volatility. Nonetheless, AMMs remain generally successful in such cases.\n\nNo. You can create AMM instances between any two assets. The trading strategy has somewhat different mathematical properties if both assets are volatile (like, say, a BTC/XRP AMM). But it's still interesting and generally quite good. — David \"JoelKatz\" Schwartz (@JoelKatz) June 2, 2023\n\nTo illustrate the concept further, Schwartz presented a hypothetical scenario. Instead of opting for an XRP/USD AMM, where USD remains stable, an investor bullish on both XRP and Bitcoin (BTC) can choose an XRP/BTC AMM. This approach allows them to benefit from the upward price movements of both assets.\n\nIn the example provided, if XRP and BTC double in price, an XRP/USD AMM yields a worst-case scenario of around 40%. In contrast, an XRP/BTC AMM could yield a worst-case scenario of 100%. However, it is essential to balance the AMM correctly and rebalance it when necessary for optimal results.\n\nSchwartz stressed that considering risks is crucial. If the investor’s bullish forecast is incorrect, resulting in a 50% decrease in XRP and BTC prices, the worst-case loss for an XRP/USD AMM would be approximately 30%. In contrast, an XRP/BTC AMM would entail a 50% loss. Thus, XRP/USD is considered safer, while XRP/BTC exhibits higher volatility."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmluZHlzdGFyLmNvbS9zdG9yeS9lbnRlcnRhaW5tZW50L2RpbmluZy8yMDIzLzA2LzAyL2luZGlhbmFwb2xpcy1kb251dHMtZG91Z2hudXRzLWJha2VyaWVzLzcwMjc5MDEzMDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Jun 2023 07:00:00 GMT",
        "title": "National Donut Day Indianapolis: Here's where you can celebrate - IndyStar",
        "content": "The Indianapolis area has plenty of local favorite doughnut shops — some of which have been around for generations, while others made their debuts during the pandemic.\n\nCheck out treats at these locally owned shops offering experiences from wine bars and board game centers to Hawaiian-inspired getaways.\n\nBB&B Bread Truck\n\ninstagram.com/booksbourbonbacon\n\nCatch this Books Bourbon & Bacon food truck posted around the area for its stuffed fried bourbon buttermilk brown butter brioche doughnut, regularly filled with chocolate hazelnut cream, vanilla confetti or peanut butter marshmallow fluff. It’s hefty, made with Hotel Tango bourbon and comes as part of a trio. Catch other flavors that change weekly throughout the year, including strawberry-rhubarb, horchata cream with passion fruit and a vegan coconut cream Oreo option.\n\nNeed a break? Play the USA TODAY Daily Crossword Puzzle.\n\nBreadWorks at Broad Ripple\n\n1050 E. 54th St., Indianapolis, 317-756-9224\n\nbreadworksatbroadripple.com\n\nYeast and cake doughtnuts and pastries are brought in daily from the Greencastle bakery to this Broad Ripple outpost. The bakery turns out flavors suchs as cinnamon cream cheese and strawberry milkshake and compliments Bridges Wine Bar, whose executive chef, Sal Fernandez, attended the Culinary Institute of America to help open.\n\nBreadWorks is giving away a free doughnut with each purchase on National Donut Day.\n\nDoughnuts & Dragons\n\n3838 E. 82nd St., Indianapolis, 317-288-0554,\n\ninstagram.com/doughnutsanddragonsindy\n\nHarry Potter fans must try the Butterbeer doughnut, a vanilla and cream soda-flavored cake doughnut with a butterscotch topping. It’s always on the menu at this shop that is also a wine and beer bar and a board game center.\n\nLong's Bakery\n\n1453 N. Tremont St., Indianapolis, 317-632-3741,facebook.com/longsbakery\n\nA random Saturday will see lines of 20-plus to pick up glazed yeast and blueberry cake doughnuts. So bring your patience. And cash. No plastic accepted.\n\nYou never know who you might run into there.\n\nOhanalulu\n\n11640 Brooks School Road, Fishers, 317-288-0922\n\n106 W. State St., Pendleton, 765-267-1762\n\neatohanalulu.com\n\nThis Hawaiian island-themed cake doughnut shop lets you choose your own icing and toppings combos if you’re not into its most popular signature flavors like the cinnamon sugar with a cream cheese drizzle or the maple bacon doughnut that uses real bacon crumbles and maple icing.\n\nPana Donuts\n\n5370 E. Thompson Rd., Indianapolis, 317-757-3933\n\n3269 W. 86th St., Indianapolis, 317-757-2103\n\n7810 E. 96th St., Fishers, 317-588 9326\n\npanadonutsin.com\n\nCronuts and glazed yeast are among the varieties at these shops.\n\nRise 'n Roll Bakery\n\n107 E. New York St., Indianapolis, 317-220-8416\n\n6311 E. Westfield Blvd., 317-956-5944\n\n1255 N. State Rd. 135, Greenwood, 317-300-1841\n\n9705 Fishers District Dr., Fishers, 317-845-5533\n\n9263 E. U.S. Hwy 36, Avon, 317-384-1024\n\nrisenroll.com\n\nThe pillowy cinnamon caramel doughnut is king at this Amish-style bakery. It’s covered in a sweet caramel sauce and dusted in cinnamon sugar.\n\nTaylor’s Bakery\n\n6216 Allisonville Road, Indianapolis, 317-251-9575\n\n8395 E. 116th St., Fishers, 317-596-2253\n\ntaylorsbakery.com\n\nDoughnuts come in yeast and cake varieties. The best-seller at this community staple is a glazed yeast, but the deep-fried danish is also melt-in-your-mouth deliciousness.\n\nTitus Bakery & Deli\n\n17471 Wheeler Road Westfield, 317-763-1700\n\n820 W. South St., Lebanon, 765-482-1740\n\ntitusbakery.com\n\nThis third-generation business has a full lineup of goodies, but it’s known for its Pershing maple iced cinnamon doughnut and maple bacon Long Johns.\n\nVida\n\n601 E. New York St., Indianapolis, 317-420-2323,vida-restaurant.com\n\nOK, there’s one doughnut on the menu. But it’s pretty much perfect. The ricotta doughnut hole comes in a set of three with a bourbon maple glaze atop maple cream, candied bacon and brown butter crumble, and is served with caramel ice cream.\n\nContact IndyStar reporter Cheryl V. Jackson at cheryl.jackson@indystar.com or 317-444-6264. Follow her on Twitter:@cherylvjackson."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2ZpbmFuY2UueWFob28uY29tL25ld3MvaG9sbHl3b29kLXdyaXRlcnMtc3RyaWtlLWNyZWF0ZXMtcmlwcGxlLWVmZmVjdHMtYWNyb3NzLWNhbGlmb3JuaWFzLWVjb25vbXktb3RoZXItc3RhdGVzLTIwNDc0Mjg5NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Jun 2023 07:00:00 GMT",
        "title": "Hollywood writers' strike creates ripple effects across California's economy, other states - Yahoo Finance",
        "content": "Roughly a month into the Hollywood writers’ strike, the standoff between the Writers Guild of America (WGA) and the Alliance of Motion Picture and Television Producers (AMPTP) remains at an impasse.\n\nThe financial impacts have already begun to reverberate across nearly every facet of the Southern California economy. From dry cleaners to restaurants and even the real estate sector, the work stoppage from 11,500 writers has jolted businesses that rely on income from the industry to make a living.\n\nAnd a prolonged strike threatens to spread the impact beyond the region.\n\n“With the increase in different kinds of filmed productions due to all of the new demand from streaming and film incentives being a great deal more robust now than they were in the last strike, the overall impact of the strike will be felt in places like Georgia, New York, and elsewhere in ways that it was more confined to California last time,” said Kevin Klowden, chief global strategist at the Milken Institute.\n\nWorkers and supporters of the Writers Guild of America protest outside Warner Bros. Studios after union negotiators called a strike for film and television writers, in Burbank, California, U.S., May 2, 2023. REUTERS/Mario Anzuoni (Mario Anzuoni / reuters)\n\nA 'longer, colder' strike\n\nIn North Hollywood, where Pam and Jim Elyea own a prop house called History for Hire, history feels like it’s repeating itself.\n\nTheir business has supplied props to movie productions for nearly 40 years, including the cameras for Steven Spielberg’s “The Fabelmans” and military gear for “Platoon.” The last time the WGA went on strike in 2007, the Elyeas delayed buying their own warehouse, using the money saved up to keep the business afloat instead.\n\nPam Elyea said this strike feels “longer, colder.”\n\n“There's not a lot of other options for us,\" she said. \"So what we do during this time when we're shut down is we work on our stock, we maintain it, but every week we're losing money. Every month we're losing money on this. And we really estimate the strike will at least go on to the end of September, possibly the end of the year.”\n\nIf the last writers' strike, which began in 2007 and ended in 2008, is any indication, a prolonged strike is likely to result in significant job losses and weigh on the region’s growth. The 100-day strike contributed to 37,700 job cuts and $2.1 billion in losses, according to a Milken Institute study conducted by Klowden. That accelerated the onset of California’s recession in 2008 in the midst of the subprime mortgage crisis that triggered the global financial crisis.\n\nNearly a month into the current strike, a growing list of shows and films have already halted production. But it’s too early to say what the full impact will be, Klowden said.\n\n“The secondary effect of the strike can often be delayed,” he said. “A number of those businesses were already hit hard by the pandemic, and an extended strike might force them to close down entirely.”\n\nStory continues\n\n'There are terrible costs'\n\nThe proliferation of streaming services is at the core of the strike. Chris Keyser, co-chair of WGA’s Negotiating Committee, said tech companies such as Netflix (NFLX) have fundamentally altered the way in which writers are paid, employing them for “the fewest amount of weeks, for the least amount of money they can pay” while maximizing output.\n\n“A bunch of tech companies came in during the streaming era and imposed a kind of efficiency and productivity onto the creative process that doesn’t make any sense,” Keyser said. “They pay us by the week and say, give us your great idea and go home. Doesn’t work anymore.”\n\nStriking writers rally in front of Netflix offices, Wednesday, May 3, 2023, in Los Angeles. Television and movie writers launched a strike Tuesday in a fight over fair pay in the streaming era. (AP Photo/Chris Pizzello) (ASSOCIATED PRESS)\n\nWriters are seeking increases in minimum pay, along with better residuals, which are similar to royalty payments, from streaming services. They’re also calling for strict limits on any content produced by artificial intelligence.\n\nKeyser said AMPTP has yet to come to the table on key issues to compensate writers fairly, even as Hollywood studios rack up profits.\n\n“If we don’t negotiate for this now, when we come back in three years, it may be too late,” Keyser said. “Yes, there are costs to it. There are terrible costs. We are painfully aware of those costs. The companies should come back and talk to us.”\n\nIn a statement to Yahoo Finance, the AMPTP said: “Member companies remain united in their desire to reach a deal that is mutually beneficial to writers and the health and longevity of the industry, and to avoid hardship to the thousands of employees who depend upon the industry for their livelihoods.”\n\nStalled negotiations with the Screen Actors Guild, which has already authorized a strike, and the Directors Guild of America, which has yet to reach its own deal with the AMPTP, may complicate the timeline for any resolution.\n\nDanny Tolli, a veteran writer and strike captain, said he’s hanging on to two additional jobs unrelated to the studios in preparation for the long haul.\n\n“I'm facing some financial hardships, but it's important to be out here,” he said from outside the Netflix building on Sunset Boulevard. “Given where I was before the strike, it wasn't a dangerous gamble to go on strike. I was already seeing my career as a writer evaporate. I knew that this was important.”\n\nAkiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujita\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2ZpbmFuY2UueWFob28uY29tL25ld3MvaG9sbHl3b29kLXdyaXRlcnMtc3RyaWtlLWNyZWF0ZXMtcmlwcGxlLWVmZmVjdHMtYWNyb3NzLWNhbGlmb3JuaWFzLWVjb25vbXktb3RoZXItc3RhdGVzLTIwNDc0Mjg5NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Jun 2023 07:00:00 GMT",
        "title": "Hollywood writers' strike creates ripple effects across California's economy, other states - Yahoo Finance",
        "content": "Roughly a month into the Hollywood writers’ strike, the standoff between the Writers Guild of America (WGA) and the Alliance of Motion Picture and Television Producers (AMPTP) remains at an impasse.\n\nThe financial impacts have already begun to reverberate across nearly every facet of the Southern California economy. From dry cleaners to restaurants and even the real estate sector, the work stoppage from 11,500 writers has jolted businesses that rely on income from the industry to make a living.\n\nAnd a prolonged strike threatens to spread the impact beyond the region.\n\n“With the increase in different kinds of filmed productions due to all of the new demand from streaming and film incentives being a great deal more robust now than they were in the last strike, the overall impact of the strike will be felt in places like Georgia, New York, and elsewhere in ways that it was more confined to California last time,” said Kevin Klowden, chief global strategist at the Milken Institute.\n\nWorkers and supporters of the Writers Guild of America protest outside Warner Bros. Studios after union negotiators called a strike for film and television writers, in Burbank, California, U.S., May 2, 2023. REUTERS/Mario Anzuoni (Mario Anzuoni / reuters)\n\nA 'longer, colder' strike\n\nIn North Hollywood, where Pam and Jim Elyea own a prop house called History for Hire, history feels like it’s repeating itself.\n\nTheir business has supplied props to movie productions for nearly 40 years, including the cameras for Steven Spielberg’s “The Fabelmans” and military gear for “Platoon.” The last time the WGA went on strike in 2007, the Elyeas delayed buying their own warehouse, using the money saved up to keep the business afloat instead.\n\nPam Elyea said this strike feels “longer, colder.”\n\n“There's not a lot of other options for us,\" she said. \"So what we do during this time when we're shut down is we work on our stock, we maintain it, but every week we're losing money. Every month we're losing money on this. And we really estimate the strike will at least go on to the end of September, possibly the end of the year.”\n\nIf the last writers' strike, which began in 2007 and ended in 2008, is any indication, a prolonged strike is likely to result in significant job losses and weigh on the region’s growth. The 100-day strike contributed to 37,700 job cuts and $2.1 billion in losses, according to a Milken Institute study conducted by Klowden. That accelerated the onset of California’s recession in 2008 in the midst of the subprime mortgage crisis that triggered the global financial crisis.\n\nNearly a month into the current strike, a growing list of shows and films have already halted production. But it’s too early to say what the full impact will be, Klowden said.\n\n“The secondary effect of the strike can often be delayed,” he said. “A number of those businesses were already hit hard by the pandemic, and an extended strike might force them to close down entirely.”\n\nStory continues\n\n'There are terrible costs'\n\nThe proliferation of streaming services is at the core of the strike. Chris Keyser, co-chair of WGA’s Negotiating Committee, said tech companies such as Netflix (NFLX) have fundamentally altered the way in which writers are paid, employing them for “the fewest amount of weeks, for the least amount of money they can pay” while maximizing output.\n\n“A bunch of tech companies came in during the streaming era and imposed a kind of efficiency and productivity onto the creative process that doesn’t make any sense,” Keyser said. “They pay us by the week and say, give us your great idea and go home. Doesn’t work anymore.”\n\nStriking writers rally in front of Netflix offices, Wednesday, May 3, 2023, in Los Angeles. Television and movie writers launched a strike Tuesday in a fight over fair pay in the streaming era. (AP Photo/Chris Pizzello) (ASSOCIATED PRESS)\n\nWriters are seeking increases in minimum pay, along with better residuals, which are similar to royalty payments, from streaming services. They’re also calling for strict limits on any content produced by artificial intelligence.\n\nKeyser said AMPTP has yet to come to the table on key issues to compensate writers fairly, even as Hollywood studios rack up profits.\n\n“If we don’t negotiate for this now, when we come back in three years, it may be too late,” Keyser said. “Yes, there are costs to it. There are terrible costs. We are painfully aware of those costs. The companies should come back and talk to us.”\n\nIn a statement to Yahoo Finance, the AMPTP said: “Member companies remain united in their desire to reach a deal that is mutually beneficial to writers and the health and longevity of the industry, and to avoid hardship to the thousands of employees who depend upon the industry for their livelihoods.”\n\nStalled negotiations with the Screen Actors Guild, which has already authorized a strike, and the Directors Guild of America, which has yet to reach its own deal with the AMPTP, may complicate the timeline for any resolution.\n\nDanny Tolli, a veteran writer and strike captain, said he’s hanging on to two additional jobs unrelated to the studios in preparation for the long haul.\n\n“I'm facing some financial hardships, but it's important to be out here,” he said from outside the Netflix building on Sunset Boulevard. “Given where I was before the strike, it wasn't a dangerous gamble to go on strike. I was already seeing my career as a writer evaporate. I knew that this was important.”\n\nAkiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujita\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2ZpbmFuY2UueWFob28uY29tL25ld3MvaG9sbHl3b29kLXdyaXRlcnMtc3RyaWtlLWNyZWF0ZXMtcmlwcGxlLWVmZmVjdHMtYWNyb3NzLWNhbGlmb3JuaWFzLWVjb25vbXktb3RoZXItc3RhdGVzLTIwNDc0Mjg5NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Jun 2023 07:00:00 GMT",
        "title": "Hollywood writers' strike creates ripple effects across California's economy, other states - Yahoo Finance",
        "content": "Roughly a month into the Hollywood writers’ strike, the standoff between the Writers Guild of America (WGA) and the Alliance of Motion Picture and Television Producers (AMPTP) remains at an impasse.\n\nThe financial impacts have already begun to reverberate across nearly every facet of the Southern California economy. From dry cleaners to restaurants and even the real estate sector, the work stoppage from 11,500 writers has jolted businesses that rely on income from the industry to make a living.\n\nAnd a prolonged strike threatens to spread the impact beyond the region.\n\n“With the increase in different kinds of filmed productions due to all of the new demand from streaming and film incentives being a great deal more robust now than they were in the last strike, the overall impact of the strike will be felt in places like Georgia, New York, and elsewhere in ways that it was more confined to California last time,” said Kevin Klowden, chief global strategist at the Milken Institute.\n\nWorkers and supporters of the Writers Guild of America protest outside Warner Bros. Studios after union negotiators called a strike for film and television writers, in Burbank, California, U.S., May 2, 2023. REUTERS/Mario Anzuoni (Mario Anzuoni / reuters)\n\nA 'longer, colder' strike\n\nIn North Hollywood, where Pam and Jim Elyea own a prop house called History for Hire, history feels like it’s repeating itself.\n\nTheir business has supplied props to movie productions for nearly 40 years, including the cameras for Steven Spielberg’s “The Fabelmans” and military gear for “Platoon.” The last time the WGA went on strike in 2007, the Elyeas delayed buying their own warehouse, using the money saved up to keep the business afloat instead.\n\nPam Elyea said this strike feels “longer, colder.”\n\n“There's not a lot of other options for us,\" she said. \"So what we do during this time when we're shut down is we work on our stock, we maintain it, but every week we're losing money. Every month we're losing money on this. And we really estimate the strike will at least go on to the end of September, possibly the end of the year.”\n\nIf the last writers' strike, which began in 2007 and ended in 2008, is any indication, a prolonged strike is likely to result in significant job losses and weigh on the region’s growth. The 100-day strike contributed to 37,700 job cuts and $2.1 billion in losses, according to a Milken Institute study conducted by Klowden. That accelerated the onset of California’s recession in 2008 in the midst of the subprime mortgage crisis that triggered the global financial crisis.\n\nNearly a month into the current strike, a growing list of shows and films have already halted production. But it’s too early to say what the full impact will be, Klowden said.\n\n“The secondary effect of the strike can often be delayed,” he said. “A number of those businesses were already hit hard by the pandemic, and an extended strike might force them to close down entirely.”\n\nStory continues\n\n'There are terrible costs'\n\nThe proliferation of streaming services is at the core of the strike. Chris Keyser, co-chair of WGA’s Negotiating Committee, said tech companies such as Netflix (NFLX) have fundamentally altered the way in which writers are paid, employing them for “the fewest amount of weeks, for the least amount of money they can pay” while maximizing output.\n\n“A bunch of tech companies came in during the streaming era and imposed a kind of efficiency and productivity onto the creative process that doesn’t make any sense,” Keyser said. “They pay us by the week and say, give us your great idea and go home. Doesn’t work anymore.”\n\nStriking writers rally in front of Netflix offices, Wednesday, May 3, 2023, in Los Angeles. Television and movie writers launched a strike Tuesday in a fight over fair pay in the streaming era. (AP Photo/Chris Pizzello) (ASSOCIATED PRESS)\n\nWriters are seeking increases in minimum pay, along with better residuals, which are similar to royalty payments, from streaming services. They’re also calling for strict limits on any content produced by artificial intelligence.\n\nKeyser said AMPTP has yet to come to the table on key issues to compensate writers fairly, even as Hollywood studios rack up profits.\n\n“If we don’t negotiate for this now, when we come back in three years, it may be too late,” Keyser said. “Yes, there are costs to it. There are terrible costs. We are painfully aware of those costs. The companies should come back and talk to us.”\n\nIn a statement to Yahoo Finance, the AMPTP said: “Member companies remain united in their desire to reach a deal that is mutually beneficial to writers and the health and longevity of the industry, and to avoid hardship to the thousands of employees who depend upon the industry for their livelihoods.”\n\nStalled negotiations with the Screen Actors Guild, which has already authorized a strike, and the Directors Guild of America, which has yet to reach its own deal with the AMPTP, may complicate the timeline for any resolution.\n\nDanny Tolli, a veteran writer and strike captain, said he’s hanging on to two additional jobs unrelated to the studios in preparation for the long haul.\n\n“I'm facing some financial hardships, but it's important to be out here,” he said from outside the Netflix building on Sunset Boulevard. “Given where I was before the strike, it wasn't a dangerous gamble to go on strike. I was already seeing my career as a writer evaporate. I knew that this was important.”\n\nAkiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujita\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    }
]