[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmF1ZHVib24ub3JnL25ld3MvcmlwcGxlLWVmZmVjdC1taWdyYXRvcnktYmlyZHMtYW5kLWxvbmctdGVybS1kcm91Z2h0LXdlc3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Ripple Effect: Migratory Birds and Long-term Drought in the West - National Audubon Society",
        "content": "This article was originally published in American Water Resources Association magazine \"Water Resources Impact\" and written by Audubon's Director of Migration Science Nat Seavy, and Karyn Stockdale, Audubon's Senior Director of Western Water.\n\nAs water managers know all too well, one of the fundamental challenges is that water is one element of a complex and connected system. Water that falls as snow in the mountains moves downslope to rivers, wetlands, lakes, underground aquifers, and coastal estuaries. These hydrological connections provide foundational resources for an incredible system that supports people, fish, birds, and other biodiversity across the planet.\n\nBut today’s hydrologic cycle is vastly different than 50 years ago, with evidence of climate disruption throughout the water cycle—including long-term drought, heat waves, flooding, wildfire, and more. One challenge of understanding and managing these water-based systems is that many impacts, such as long-term drought, do not affect just one location. They ripple out across larger areas. In the case of migratory birds that depend on rivers, wetlands, estuaries, and lakes, these ripples can extend from the Arctic all the way to the southern reaches of South America. As an integral part of broader drought resilience work in the American West, efforts to support migratory bird populations can also make waves, sending ripples well beyond the habitats where wildlife managers and water managers focus their efforts.\n\nTo read more, click here."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vbmV3cy5zZnN1LmVkdS9uZXdzL2RpZ2l0YWwtYXNzZXQtcGlvbmVlci1hbmQtYWx1bS1jaHJpcy1sYXJzZW4tcmV0dXJucy1jYW1wdXMtc3R1ZGVudC10YWxr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Digital asset pioneer and alum Chris Larsen returns to campus for student talk | SF State News - SF State News",
        "content": "San Francisco State University alumnus Chris Larsen (B.S., ’84) made a special visit to campus Tuesday, Feb. 14, to take questions from Business students. Held at the University’s J. Paul Leonard Library, the talk covered such topics as cryptocurrencies, climate change, staying motivated and the importance of taking risks...and even failing.\n\n“If you fail in America, particularly here in the Bay Area, it’s like a badge of honor. It makes you stronger for the next time. ... If you fail with honor and grace and treating people right, people remember that,” Larsen told students. “Failing with honor in the Bay Area — you’re stronger next time.”\n\nMore than 60 Finance seniors from San Francisco State’s Lam Family College of Business attended the event.\n\n“Chris Larsen, as an SF State alumni, a successful executive and an angel investor focusing on sustainability and cryptocurrency, was able to share with students firsthand his outlook for the crypto ecosystem, his perspectives on sustainability issues, his entrepreneurial spirit and his advice for a successful career path — all of which are hard to get elsewhere,” said Assistant Professor of Finance Xue Snow Han, who helped organize the visit.\n\nWhen asked for his advice on launching a new business venture, Larsen told students the first thing to look for is an opportunity to make a difference.\n\n“When you start a business, look for a problem that you can solve,” Larsen said. “The basic idea of any business is product, market, fit, right? If you’re not solving a problem, then what’s the point? And that might sound obvious, but as you guys probably have seen, there are so many technology companies that come up with a shiny new thing. They don’t really know what they’re solving. And lots of bad things happen from that.”\n\nLarsen co-founded online mortgage lender E-Loan in 1996, and later helped launch Ripple Labs and other cutting-edge technology and finance ventures. He and his wife Lyna Lam, whose two sisters and several other family members attended SF State, have been stalwart supporters of the University since 2001. In April 2019, SF State announced the donation of a historic $25 million gift from Larsen, Lam and the Rippleworks Foundation to the College of Business, establishing the Chris Larsen and Lyna Lam Funds for the College of Business. In honor of this longtime support, the California State University announced that SF State’s College of Business had been renamed the Lam Family College of Business.\n\nLearn more about SF State’s Lam Family College of Business."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmVkbi5jb20vY2FuY2VsLXB3bS1kYWMtcmlwcGxlLXdpdGgtYW5hbG9nLXN1YnRyYWN0aW9uLXJldmlzaXRlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Cancel PWM DAC ripple with analog subtraction—revisited - EDN",
        "content": "Once upon a time (2017), I published a simple design idea for filtering and attenuating PWM DAC output ripple that I’d found very useful for over a decade.\n\nIt works by passive summation of the PWM signal with its AC-coupled inverse for the purpose of attenuating the unwanted AC ripple signal component without affecting the DC component (Figure 1).\n\nAdvertisement\n\nFigure 1 The original ripple subtraction topology.\n\nAdvertisement\n\nPartner Content\n\nHowever, some of the finer details of how the idea works were not fully explored in the original short article. Here’s some of what was omitted.\n\nThe circuit’s basic principle of operation is passive summation (via R1 and R2) of the AC coupled (via C2) inverse of the PWM ripple signal current with the PWM signal current, followed by integration of the sum in DAC output capacitor C1. The resultant partial cancellation of ripple components allows adequate ripple attenuation while using a much shorter filter time constant than would otherwise be required for a single-stage RC filter. Faster response and shorter settling times are the payoff.\n\nHowever, a drawback of this current-mode scheme that limits its speed is that immediately following a step change in the PWM input duty cycle, the R1 and R2 currents will be opposite in sign but equal in magnitude so that their sum must momentarily equal zero. Consequently, with nothing for C1 to integrate, the DAC output signal can’t begin to respond to the step until C2 has begun to charge, reducing the current through R2, making the R1 and R2 currents unequal and giving C1 something besides zero to integrate. This undesirable null interval is shown in Figure 2 as a time delay evident in the rising edge of the output waveform.\n\nThis limitation on DAC response time seems to be an unavoidable shortcoming of the current-mode summation topology. While it’s still (much) faster than a single stage RC filter, maybe it’s not as fast as it could/should be.\n\nFigure 2 Current-mode ripple subtraction response showing leading edge delay.\n\nSo, I started wondering. What would happen if, instead of currents, ripple and PWM voltages were first computed and then subtracted from each other to achieve ripple cancellation? Could a little more performance be squeezed from the original idea without losing the simplicity that made it attractive in the first place? Figure 3’s topology was the answer.\n\nFigure 3 New voltage-mode ripple subtraction circuit.\n\nOperation of the new circuit relies on series connected capacitors C1 (which makes the PWM DC voltage component) and C2 (providing the inverted ripple component). Voltage summation is inherent from the series capacitor connection so that, as in the 2017 circuit, AC ripple is subtracted from DC output. It turns out that ripple attenuation adequate for 8 bit resolution happens if the R1C1 time constant is made equal to just 2Tpwm, or twice the PWM period—only 512µs in this example of 8bit PWM with a 1MHz clock. Faster clocks would of course allow even shorter time constants.\n\nNote that the total component count of the new filter circuit is exactly the same as the original: One inverter (e.g., 1/6 SN74HC04), two resistors, and two capacitors.\n\nFigure 4 shows its step response that now begins immediately at T = 0, unlike the current-mode summation delay of Figure 2, yielding 8bit settling in ~16 PWM cycles = ~4ms for this Tpwm.\n\nFigure 4 Voltage-mode step response showing no leading edge delay.\n\nFigure 5 compares the 8bit step settling time of the original current-mode design (~23 Tpwm) to the new voltage-mode version (~16 Tpwm).\n\nFigure 5 Comparison of current-mode (red) versus voltage-mode (green) response.\n\nThis 44% (23/16) increase in response speed seems a worthwhile performance improvement, especially given the associated 0% increase in circuit complexity and cost.\n\nElaborations applied to the original current-mode topology (e.g., utilizing faster clock rates, precision analog switches and voltage references to improve precision, noise, and accuracy) will of course apply directly to this new voltage-mode version.\n\nStephen Woodward’s relationship with EDN’s DI column goes back quite a ways. In all, a total of 64 submissions have been accepted since his first contribution was published in 1974.\n\nRelated Content"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZmluYm9sZC5jb20veHJwLXByaWNlLXByZWRpY3Rpb24tMjAyNS0yMDMwLWhvdy13aWxsLWl0cy1wcmljZS1yZWFjdC10by1zZWMtY2FzZS1hZnRlcm1hdGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "XRP price prediction 2025-2030: How will its price react to SEC case aftermath? - Finbold - Finance in Bold",
        "content": "Investors are keeping a careful check on the price of XRP as the cryptocurrency world awaits the conclusion of the Ripple v. the US Securities Exchange Commission (SEC) lawsuit.\n\nIf the lawsuit is decided in favor of Ripple, for example, this is anticipated to be seen as a bullish sentiment for those looking to buy XRP. In 2020, the US regulator filed a lawsuit against Ripple, claiming that the firm violated federal securities laws by selling unregistered securities to the tune of $1.3 billion.\n\nTokens purchased between 2013 and December 2020 were considered securities by the SEC. Ripple has responded to the claims by stating that it does not believe XRP to be a security and that it does not satisfy the requirements of the Howey Test.\n\nBoth sides have now handed in their closing arguments, which raises the possibility that a resolution may be reached in the near future.\n\nWhat happens to XRP if Ripple wins case\n\nThe legal dispute has been ongoing for the last three years, during which time both sides have submitted their closing arguments and are now awaiting a verdict.\n\nFinbold questioned industry experts on the possibility of a successful result for Ripple in its lawsuit against the SEC, and the impact such a victory may have on the average price of XRP since investors with a long-term perspective are looking as far ahead as 2025 and even the end of this decade.\n\nAccording to lead trial attorney Andrew Pickett:\n\n“If Ripple is successful in their lawsuit, it could help solidify XRP’s legality in the US market, which would benefit its price.”\n\nElsewhere, he views the outcome as a fundamental setting, ‘an important precedent applicable to other cryptocurrencies, such as Bitcoin,’ especially by leading financial institutions.\n\n“This could open up the cryptocurrency industry to more mainstream investors and businesses that would have previously been cautious about entering the market due to legal uncertainty.”\n\nThe stakes in this lawsuit are high, and if the regulator prevails, it may be disastrous for XRP, its investors, and the whole cryptocurrency industry. The regulatory body may issue a fine on Ripple Labs and require the company to register XRP as a security.\n\nGiven the similarities between XRP and traditional securities, such a ruling might limit both its acceptance and its use. But if Ripple can successfully counter the SEC’s claims, it may be seen as a major victory for the company and a vote of confidence in XRP. It’s crucial to remember that regardless of Ripple’s victories in court, the lawsuit’s final outcome is still unclear.\n\nInvestor interest\n\nDespite the ongoing litigation, Ripple and XRP development team continues to expand the XRP ledger’s capabilities and explore new applications in the international financial system. Indeed, the token continues to play an important role in the world of banking, technology and cryptocurrency as a whole.\n\nDuring the latter half of 2017, the price of XRP soared to an all-time high of $3.86. While its value has fallen below $0.50 since then, XRP remains a major participant in the cryptocurrency market, often ranked among the top ten currencies by market capitalization.\n\nXRP whale and shark addresses holding between 1 million and 10 million tokens grew to 1,617 in the final month of 2022, despite the price fall that occurred during the year. This rise occurred on December 21, 2022.\n\nAs a result of the holdings, the addresses accounted for the all-time high proportion of the XRP tokens that are owned, which is 7.23%. Indicating that large-scale investors are still interested in XRP.\n\nPrice analysis\n\nAt the time of publication, XRP was trading at $0.39, with a total market cap worth $19.6 billion.\n\nXRP 1-day price chart. Source: Finbold\n\nIn terms of the technical analysis (TA) indicators on the finance tracking website TradingView, the 1-month sentiment gauges for XRP are largely mixed. Specifically, the summary is currently indicating ‘sell’ at 10, which is aggregated from oscillators in the ‘buy’ area at 3 and moving averages (MA) pointing toward ‘strong sell’ at 9.\n\nXRP 1-month gauges chart. Source: TradingView\n\nXRP price prediction 2025\n\nNotably, if XRP prevails in the case, the panel of financial experts in Finder’s January 2023 report anticipates that the price of XRP would trade at $3.81 by the end of 2025.\n\nXRP price prediction for 2025 if Ripple wins the case. Source: Finder\n\nNevertheless, if the SEC wins in court, it will instead reach $0.98. In the meanwhile, investors will have to keep a close watch on the outcome of the case in 2023 to find out what happens, as it is likely to significantly impact the price either way.\n\nXRP price prediction for 2025 if Ripple loses the case. Source: Finder\n\nAccording to Martin Froehler, CEO of Morpher, if Ripple prevails, “it’s a huge win for the entire crypto industry.” If XRP is victorious, Froehler believes that the price of XRP would reach $5 by the year 2025. This is one of the most bullish XRP price projections.\n\nXRP price prediction 2030\n\nIt is hard to speculate on what the value of XPR will be in 2030. The price is dependent on a wide variety of factors, some of which are technical, while others are economical and regulatory. However, XRP has a lot going for it, and this will be particularly true if Ripple is successful in its case against the SEC and the first public offering goes forward as planned.\n\nTrading Education, which is bullish on XRP’s long-term development prospects, compares the platform to a Visa competitor towards the end of the decade. According to the site, XRP may reach a high of $31.81 by the year 2030.\n\nElsewhere, the Coin Price Forecast, which uses data science and machine self-learning technology for cryptocurrencies, predicts that the XRP price will climb to $0.76 by the end of 2025, a 96% increase from the current price. Meanwhile, by the end of the decade, it predicts the price would climb to $0.96, a +148% to the current price.\n\nXRP price prediction for 2025 and 2030. Source: Coin Price Forecast,\n\nConclusion\n\nWhile many market watchers believe XRP will appreciate in value over the next few years, others believe it will be worthless by the decade’s end.\n\nRipple already has a multitude of cutting-edge financial services that make it possible to make payments that can cross-platforms and cross-blockchains. For example, the PayID function enables users to pay money to other users on other platforms by using an ID that is both simple to read and safe.\n\nThe resolution of the dispute brought forth by the SEC is one of the most significant factors that will play a role in determining the price of XRP in the years to come. Following the conclusion of the pending legal action, an initial public offering is expected to be carried out.\n\nRipple’s partnerships with other financial institutions, the widespread use of cryptocurrencies, and central bank investments in CBDCs are all additional variables that might affect the price of XRP.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vd3d3LmF6b2NsZWFudGVjaC5jb20vYXJ0aWNsZS5hc3B4P0FydGljbGVJRD0xNTI40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Consumer-Owned Wind Farms: The Next Step in Saving Our Planet - AZoCleantech",
        "content": "insights from industry Sarah Merrick CEO Ripple\n\nAZoCleantech interviewed Sarah Merrick, CEO of Ripple, about the future of consumer-owned wind farms and their potential for moving the green economy forward on a massive scale.\n\nCan you tell the readers a little bit about what Ripple Energy does?\n\nRipple offers customers the opportunity to stabilize their energy bills by owning a stake in a wind farm. We enable people to take real climate action by owning part of a wind farm alongside thousands of others. Households can buy part of a wind farm to power their homes, helping to reduce and stabilize their bills for the long term and slash their carbon footprint. Ripple makes green energy ownership easy and affordable.\n\nIt is greener than a green tariff as our members directly contribute to developing a new wind farm and adding more green to the grid. It is 65% cheaper than installing rooftop solar and is a simple way to own your generation, even if you do not own your home or move house. Our mission is to make renewable energy ownership accessible to everyone.\n\nWhat are Ripple Energy’s main achievements so far?\n\nSelling out a membership for our first wind farm, Graig Fatha was a massive achievement for the team. It proves that our model of clean energy ownership works. We are very fortunate to have such a vocal and empowered community supporting Ripple’s vision. The interest in our first wind farm proved that people care about where their power comes from. We are excited to see the turbine energized in March and for our members to start seeing savings off their bills.\n\nOur next project in South Ayrshire, Scotland, is taking Ripple’s vision to the next level as we will launch the largest consumer-owned wind farm in the world, formed of eight turbines. We have just announced that membership has opened, and thousands have already signed up. This project will be Ripple’s most significant milestone to date and will demonstrate the success of a consumer ownership model which can be replicated across the country and further afield.\n\nWhat is a consumer-owned wind farm?\n\nInvesting in the wind farm makes you a co-op member alongside thousands of others. Ripple is the managing agent for the co-op and is responsible for the wind farm build, maintenance, and relationship with the suppliers, so members do not have to do anything. The suppliers then supply this cheaper, greener renewable energy to the member’s homes via the grid.\n\nThis consumer-owned model allows members to go beyond a green tariff as their investment directly helps build a new wind farm and adds more green to the grid. All while reducing and stabilizing their electricity bills for the long term.\n\nWhat are the main benefits of a consumer-owned wind farm?\n\nRenewable energy projects get cheaper with scale. Individuals can access large-scale projects traditionally only available to large businesses by coming together as a cooperative. This means members can own a small part of a large-scale project for their source of cheaper, greener electricity.\n\nYou cannot own a bit of a coal or nuclear power station to supply your home with electricity, but you can own a wind farm. Through the consumer-owned wind farm model, owning green energy has never been more accessible and affordable.\n\nFor example, investing in domestic solar panels can cost almost £5000 for an average UK household. It also requires roof space and can be restricted by location or planning issues. Plus, it is not an option for renters; you cannot take them with you if you move house. Ripple is up to 65% cheaper than installing rooftop solar. It strips away these barriers to renewable energy access and enables wider environmental and energy consciousness.\n\nWhy are these types of wind farms important for the future of our planet and net-zero goals?\n\nTackling climate change is firmly on the political agenda of almost every country in the world. As the lowest CO 2 source of electricity, the wind has a crucial role in accelerating a clean energy transition.\n\nTo avoid the worst impacts of climate change, the world needs to install wind power three times faster over the next decade to stay on a net-zero pathway. Community projects such as ours enable people to hold a physical stake in low-carbon technologies that are futureproofing our planet and bringing us one step closer to achieving net zero.\n\nHow can Ripple Energy’s wind farms supply their owners with low-cost electricity?\n\nPeople pay for their share of the wind farm’s construction costs upfront, so they only need to pay for its running costs on an ongoing basis.\n\nThe cost of running a wind farm is around 2p/kWh, which is much lower than the market electricity price (currently around 20p/kWh). Owners, therefore, save the difference between the two.\n\nWhen market prices are high, like at present, savings are high. When the market price is lower, savings fall too. The net effect is to help stabilize bills.\n\nWhat is the importance of wind energy and how can we bolster its use worldwide?\n\nScaling up electricity from renewables is crucial for decarbonizing the world’s energy system – and wind power generation, especially in the UK, is increasingly important in enabling the energy transition.\n\nIn the past decade, we have seen the global wind power market quadruple in size and establish itself as one of the world's most competitive and resilient power sources. Wind is clean, free, and readily available – what we need now is the deployment of more wind turbines on a global scale to harness the opportunities it brings for accelerating net-zero.\n\nCan you tell us about the two wind farms you have developed in Wales and Scotland?\n\nOur first wind farm project, Graig Fatha, in Coedely, South Wales, has just started generating power. It is the first-ever wind turbine to be owned by the customers it supplies. It is owned, alongside a co-investor, by 907 members who contributed £2.2m for the wind turbine construction. Those involved will see average annual savings of around 25% on their energy bills across the turbine’s 25-year lifespan, with most members buying enough shares to power their entire homes’ consumption through the power generated by Graig Fatha.\n\nOur next project at Kirk Hill, in Ayrshire, Scotland, will be the largest consumer-owned wind farm in the world. The wind farm will be formed of eight turbines and generate a total of 18.8 MW of clean electricity – enough to power 20,000 households.\n\nWe have just opened Kirk Hill for share purchases and have already had thousands of people join. People want simple ways to make a real climate impact while finding new solutions to stabilize their energy bills.\n\nHow are these wind farms key to accelerating the United Kingdom’s green energy use?\n\nThe current energy crisis has highlighted the importance of renewable energy and in allowing customers to take more control over the type of energy they consume.\n\nWind is the world’s lowest CO 2 source of electricity, and it is playing an increasingly important role in greening the grid as we accelerate toward a clean energy transition. In the UK, we are blessed with this fantastic resource, one of the world's windiest countries.\n\nDo you have any future wind farm developments?\n\nYes. Now we have proved consumer ownership works, we want to scale it up with much bigger wind farms, with more supply partners, across more countries. We are planning at least five new projects in the next few years. We also hope to offer consumers the chance to be part of offshore wind projects.\n\nIs there anything else you would like to tell the readers that we may have missed?\n\nWe were blown away by the level of interest in the Kirk Hill project. If you are interested in owning a part of it, I suggest acting fast.\n\nWhere can readers find more information?\n\nMore information can be found on our website. A webinar on our YouTube channel describes in detail how Ripple works and how it can help stabilize your bills.\n\nAbout Sarah Merrick\n\nBefore establishing Ripple Energy, I worked in the wind industry for 20 years as an economist, mostly on strategy, energy policy, and communications. I was Head of Public Affairs and vice-chair of RenewableUK, the UK’s wind and marine energy trade body.\n\nAs CEO of Ripple, my role is incredibly varied. When you find a start-up, you need to do everything, from investor relations, graphic design and sales, to UX and copywriting. You learn so much so quickly, putting multiple skills to use.\n\nIt has been incredible so far, and we have substantial growth ambitions to make renewable and green energy accessible and affordable for everyone. The highlight of my career was seeing Graig Fatha start operating. It was the culmination of everything the team had worked for. It was really special. Now I am looking forward to us filling Kirk Hill and launching bigger projects in the future."
    }
]