[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9maWxtLzIwMjMvbWF5LzAyL2hvbGx5d29vZC13cml0ZXJzLXN0cmlrZS1pbmR1c3RyeS1lZmZlY3Rz0gFWaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL2ZpbG0vMjAyMy9tYXkvMDIvaG9sbHl3b29kLXdyaXRlcnMtc3RyaWtlLWluZHVzdHJ5LWVmZmVjdHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Hairdressers, camerapeople, caterers: the ‘scary’ ripple effect of the Hollywood writers’ strike - The Guardian",
        "content": "As screenwriters across the country go on strike for the first time in 15 years, it won’t just be writers’ rooms that are empty. Without writers, studios must postpone or shut down productions, bringing shows off the air and affecting virtually every profession in the TV and film industry, from cinematographers to caterers, with effects rippling out to the broader economy.\n\n“This struggle is our struggle,” said Cory Hunter, a Los Angeles-based camera operator. “We all have been squeezed in the change to streaming.” Without jobs, he’s planning to get through the next few months by helping a family member do real estate work.\n\nDarrius Peace, an Alabama-based hairstylist who often flies out to work on movie sets, where he specializes in Afro-texture hair, says he’ll have to replace those jobs with more hours at his salon.\n\nPaige Simmons, the owner of Dine With 9, a Los Angeles caterer for production crews, says “it’s a little scary right now”: multiple clients have canceled their orders, and unlike during the height of the pandemic, there’s no federal aid coming for a writers’ strike.\n\nWhile writers are stopping work with the hope of improving their remuneration, the rest of the film industry is simply waiting to hear when they can go back to work. Nevertheless, there is a remarkable amount of solidarity.\n\nPeace is cheering on the writers: “Right now, it may hurt. But in the long run, it’s worth it. Once the writers succeed, everybody else can demand more.”\n\nSimmons supports the strike because many of her serving staff also work in the entertainment industry. “Everyone understands the importance of solidarity,” she says.\n\nThe entertainment business is highly profitable. In recent years, the combined profits of giants like Warner Bros, Netflix, Disney, Comcast and Paramount have reached close to $30bn a year, as their streaming services continue to add subscribers. CEO pay has soared, with the top 12 entertainment bosses receiving about $1bn in total pay in 2021.\n\nView image in fullscreen Kim Steele, an actor and writer, holds a sign in support of the strike outside the Warner Bros Discovery Atlanta campus on Tuesday. Photograph: Alyssa Pointer/Reuters\n\nEntertainment industry workers say that wealth hasn’t been shared with them, and it’s getting harder to stay afloat. After a long drought of opportunities during the pandemic, workers have been hit by recent layoffs and declining job openings. Studios are cutting positions and experimenting with AI to replace roles.\n\nWith talk of the strike looming for months, producers have held back projects in anticipation, “so many of us already were kind of in ‘famine mode’”, Hunter says.\n\nThe strike began on Tuesday after the Writers Guild of America and the Alliance of Motion Picture and Television Producers (AMPTP), which negotiates on behalf of major studios, failed to reach a new contract agreement. According to the Writers Guild, streaming platforms have upended long-held labor standards by shortening TV seasons and hiring fewer writers for briefer stints – essentially turning them into gig workers.\n\nIn the past, entertainment unions have not always agreed on strikes – sometimes even openly feuding during them – but this time there’s a remarkable sense of solidarity, at least for now. The International Alliance of Theatrical Stage Employees (IATSE), the actors’ union Sag-Aftra, and the Hollywood Teamsters union are among guilds that have expressed support for the strike.\n\nWhile these unions aren’t on strike, their members may choose not to cross picket lines – a decision protected by some of their contracts. “Teamsters don’t just talk about solidarity, we are contractually protected to walk the walk,” the union said in recent guidance sent to its members.\n\nOne big reason for the unity is a pervasive feeling of worsening inequality, says Jonathan Handel, a Los Angeles-based lawyer and entertainment union expert. As streaming companies “spend billions of dollars building out platforms and profit-generation machines”, writers are demanding “a fair share of that and sustainable careers, and that’s a message that resonates with the rest of the workforce as well”.\n\nWhat’s at stake in the fight is the future of the entertainment business model, says Handel. The last writers’ strike in 2007 was in part a disagreement over the residuals – a type of royalties – that writers could earn from new formats like DVDs and online downloads. Streaming is an even bigger shift. “We haven’t seen such a dramatic and tumultuous period of technological change in the film entertainment industry since after the second world war,” he says, when Americans switched from theaters to watching TV at home.\n\nScott Leslie, a Studio City, Los Angeles-based prop man and set dresser at Warner Brothers and a member of IATSE, which represents production crews, says his work hours have dropped during the streaming era, and he fears layoffs will be next. His wife, Julie Ganis, a freelance book editor, worries what will happen to them and their son in college if Leslie loses his job, “along with his union paychecks and union benefits, like healthcare”.\n\nView image in fullscreen A giant inflatable rat, a symbol of organized labor, is displayed as writers picket outside Peacock NewFronts in New York. Photograph: Bebeto Matthews/AP\n\nWith the strike starting, Ganis is trying to renegotiate their son’s financial aid package: “My income is not enough to support the family.” But the couple staunchly backs the writers: “I really want them to hold the line and get what’s right, even though it’ll cost the town lots of money and wages and ancillary things,” Leslie says. His wife agrees: “Our enemy is not the writers, it’s the corporate overlords who are putting skyrocketing profits for Wall Street ahead of everything.”\n\nHunter, the camera operator and another IATSE member, says he’s been having conversations with other camera operators about how to find side hustles. “We’re supposed to be in this amazing industry with great careers, yet so many of us are having to look elsewhere to make ends meet. Whether that’s unemployment every 18 months, or side hustles, or whatever, the viability of our careers is at stake,” he says. “That’s what really connected with me when the writers say it’s a critical moment for them as the viability of their livelihood hangs in the balance.”\n\nEntertainment workers are hopeful that by staying united, they will be able to push the studios for better conditions. In less than two months, Sag-Aftra’s contract with AMPTP will need to be renegotiated as well, and many actors see their fates as intertwined with writers’.\n\n“Writers are on the frontlines, and we have to make sure we support them, because it’s a domino effect,” says the actor Justin Shenkarow, a Sag-Aftra member. “If they’re able to fight and get their proper wages and working conditions, then hopefully that will trickle over to the rest of the unions as well.”\n\nShenkarow, who is also the co-founder of ThreePointZero, a small animation studio, says he’s particularly concerned about AI and hopes the unions can win some rules targeting it: “We’ve seen such a huge uptick in AI in the last several months, and we need to make sure AI doesn’t replace the voiceover industry.”\n\nThe writer’s strike could even have impacts beyond the United States. Eben Bolter, a UK-based cinematographer who recently worked as a director of photography on HBO’s The Last of Us, says “writers in the UK and everywhere are going to look at what’s happening in the US”, and a win by the Writers Guild “would empower UK writers and everywhere to expect better”. While he’s “stressed” about where his next paycheck will come from, “I still support [the strike], because I think they’re doing the right thing. And what they’re asking for is very reasonable.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3Rkbi5jb20vbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvd2hhdC1zLXJpcHBsZS1lZmZlY3Qtb2YtY29sdW1iaWEtcml2ZXItY3J1aXNlcy9hcnRpY2xlXzIwNTQ3OTJhLWU5ZmYtMTFlZC05ODRkLWI3YTcyZmY1NGZjMC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "What's ripple effect of Columbia River cruises? - The Daily News",
        "content": "Some people are drawn to the sun and festivities of the Mexican Riviera. Some go for the wilderness and scenic wonders of Alaska, and others opt for the intimacy of small boats cruising European rivers.\n\nBut an increasing number of cruising opportunities are popping up close to home, as cruise lines expand their offerings along the Columbia River.\n\nThis year, there are nine ships cruising the river, carrying thousands of passengers from Astoria through the Columbia River Gorge and up the Snake River to Clarkston in Eastern Washington.\n\nCruising on the Columbia isn’t cheap. Fares this year cost anywhere from around $2,500 per person to more than $11,000, according to the booking website USA River Cruises.\n\n“The Pacific Northwest offers breathtaking scenery, the chance to retrace the expedition path of Lewis and Clark and indulge in the finest wines and freshest seafood Oregon and Washington have to offer,” reads a statement from American Queen Voyages. The company operates the American Empress, which docks along the Vancouver waterfront during its trips up and down the river.\n\nBut while river cruises have become a booming industry on the Columbia River, the jury is still out on the economic impact they’re actually bringing to the region.\n\nThe company says its trips boost the economy of the region. Its passengers usually take part in excursions when they’re in port, and they have souvenir and retail opportunities at each port.\n\n“Our goal is support those already built into the fabric of the community and uplift regional members,” the statement said.\n\nPorts of call impact mixed\n\nPart of the appeal of river cruises is that they’re all-inclusive, meaning passengers often eat on board. That’s not great news for restaurants along Vancouver’s waterfront, where those interviewed haven’t seen much business from cruise passengers.\n\nPorts in Kalama, Camas-Washougal and Stevenson also are hosts to river cruises.\n\nThe Port of Kalama began welcoming American Cruise Lines last spring — a $3.5 million project that was split between the port and the cruise line. Port public relations administrator Dan Polacek says it’s difficult to quantify the total financial impacts of passengers to the town’s business core.\n\nThat port’s cruise dock is a busy one, having welcomed four ships per week between April and November of 2022, with an estimated 16,500 visitors. American Cruise Lines increased its business at the port in 2023, with five ships now docking there each week, around 20,000 passengers for the year.\n\nEven so, the nearby McMenamins Kalama Harbor Lodge, while convenient, isn’t often frequented by cruise passengers.\n\n“We see a little bit of a bump in our gift shop and from the crew at times coming in to eat,” said Renee Rank Ignacio, director of marketing at McMenamins. “But for the most part, the passengers are not coming in to eat and drink.”\n\nIf they come in, it’s to grab merchandise or cans of beer or wine to go, added Ignacio.\n\nThe story is much the same in Camas and Washougal. The Clark County Historical Museum hosted cruise passengers last year when they stopped at the Port of Camas-Washougal.\n\nThe museum’s tour, which will be running again later this year, took passengers to Washougal’s Two Rivers Heritage Museum, Pendleton Mill Store and Captain William Clark Park and then historic downtown Camas for shopping.\n\nThe Two Rivers museum alone saw 1,560 cruise passengers last year.\n\nYet, even though tour guides provided coupons and maps for passengers, museum Executive Director Bradley Richardson heard from Camas businesses that not many saw a significant bump in sales.\n\nRichardson acknowledged it wasn’t what they hoped. But he said they were honored to get the chance to advocate for local businesses rather than a cruise company just hiring a tourism group from outside the area.\n\n“The hope is we can continue to grow and encourage the guests to shop in historic downtown Camas,” he said.\n\nExcursion sites keep busy\n\nWhile the cruise industry hasn’t yet proved to be a windfall for local retailers, it has had a significant impact for those businesses fortunate enough to be an excursion destination.\n\nTwo of the must-do tours when cruising the Columbia are going to Mount St. Helens and visiting the Columbia Gorge Interpretive Center.\n\nThe Mount St. Helens Visitor Center remained consistently busy during last year’s cruise season. The center even brought on more interpretive staff to accommodate the extra visitors and cruise ship passengers, which often arrived in three to four buses at a time.\n\n“We enjoyed the change, and our colleagues to the south and east of us were welcoming the same folks — at the Lewis and Clark Interpretive Center and the Sacajawea Interpretive Center, both located along the Columbia River,” said Alysa Adams, interpretive ranger at the Mount St. Helens Visitor Center.\n\nThe center held multiple educational ranger programs each day to meet the demand of the tours.\n\nIn the heart of the Gorge, the Columbia Gorge Interpretive Center in Stevenson also has passengers bused to its doors. During the cruise season, Jessica Chamberlin, the museum’s visitors manager, estimates passengers make up 70 percent to 80 percent of the museum’s attendees.\n\nThe cruise companies also often set up tasting events at local breweries and wineries, which bring passengers to specific businesses in the area.\n\nEvoke Winery hosted a very successful party for a cruise ship at its winery in Hood River, Ore., said Evoke’s Shelly Kice.\n\nAirfield Estates’ Vancouver Tasting Room hosted two private tasting events for American Empress passengers in the past few weeks. There are two more scheduled for later in the cruise season. It recently got an inquiry for a private event from another cruise line, as well. The events so far haven’t been lucrative, though the business is hoping sales during the events pick up.\n\nJust on Monday the business held 70 tastings for passengers — all at a reduced rate. There were only a couple of bottles sold, said tasting room manager Jeremy Parker.\n\nDespite not making many sales, the tasting room has been happy to get its name out there.\n\n“Overall, we’re pretty happy and looking forward to doing more of them,” said Parker.\n\nEffect on ports not yet clear\n\nThe ports say they are happy with the cruise business at their docks.\n\nThe Port of Skamania built its cruise ship dock many years ago for the smaller day cruises and added dolphins, wooden pilings that are used by the longer cruise ships that started cruising the river more recently.\n\n“It was a way of expanding our economic impact,” said Pat Albaugh, executive director at the Port of Skamania. The port docks around 200 cruise ships each season, though one company recently contracted with the Port of Cascade Locks in Oregon instead.\n\nThere are no numbers on what kind of economic impact the cruise industry has had on Vancouver. Those numbers may be coming in the next year, according to Cliff Myers at Visit Vancouver USA.\n\nThe Port of Camas-Washougal used visitor spending impacts estimated by the cruise lines to estimate economic impacts. That study showed the total economic impact in the community was $2.29 million. The port completed its $1.4 million breakwater access ramps last year.\n\n“I think cruise ships are seeing these developments in these small communities and taking advantage of that, and that’s future demand that I think will continue,” said Derek Jaeger, director of business development and real estate at the Port of Camas-Washougal, pointing to the new waterfront developments in Vancouver, Kalama and Camas-Washougal.\n\nFor Myers at Visit Vancouver USA, the organization is bullish on cruises but with trepidation, lacking actionable information.\n\nIt’s safe to say, he said, that passengers are staying overnight in local hotels and shopping and eating at local retailers.\n\nHe questions if retailers would be able to tell that cruise passengers are specifically coming in to shop and eat, saying passengers don’t stick out like some other visitors to the area.\n\n“We really feel like there’s a lot to be said here, but again, we just need to be smart. We need to point ourselves in the right direction with some information that we don’t have currently,” said Myers."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9maWxtLzIwMjMvbWF5LzAyL2hvbGx5d29vZC13cml0ZXJzLXN0cmlrZS1pbmR1c3RyeS1lZmZlY3Rz0gFWaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL2ZpbG0vMjAyMy9tYXkvMDIvaG9sbHl3b29kLXdyaXRlcnMtc3RyaWtlLWluZHVzdHJ5LWVmZmVjdHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Hairdressers, camerapeople, caterers: the ‘scary’ ripple effect of the Hollywood writers’ strike - The Guardian",
        "content": "As screenwriters across the country go on strike for the first time in 15 years, it won’t just be writers’ rooms that are empty. Without writers, studios must postpone or shut down productions, bringing shows off the air and affecting virtually every profession in the TV and film industry, from cinematographers to caterers, with effects rippling out to the broader economy.\n\n“This struggle is our struggle,” said Cory Hunter, a Los Angeles-based camera operator. “We all have been squeezed in the change to streaming.” Without jobs, he’s planning to get through the next few months by helping a family member do real estate work.\n\nDarrius Peace, an Alabama-based hairstylist who often flies out to work on movie sets, where he specializes in Afro-texture hair, says he’ll have to replace those jobs with more hours at his salon.\n\nPaige Simmons, the owner of Dine With 9, a Los Angeles caterer for production crews, says “it’s a little scary right now”: multiple clients have canceled their orders, and unlike during the height of the pandemic, there’s no federal aid coming for a writers’ strike.\n\nWhile writers are stopping work with the hope of improving their remuneration, the rest of the film industry is simply waiting to hear when they can go back to work. Nevertheless, there is a remarkable amount of solidarity.\n\nPeace is cheering on the writers: “Right now, it may hurt. But in the long run, it’s worth it. Once the writers succeed, everybody else can demand more.”\n\nSimmons supports the strike because many of her serving staff also work in the entertainment industry. “Everyone understands the importance of solidarity,” she says.\n\nThe entertainment business is highly profitable. In recent years, the combined profits of giants like Warner Bros, Netflix, Disney, Comcast and Paramount have reached close to $30bn a year, as their streaming services continue to add subscribers. CEO pay has soared, with the top 12 entertainment bosses receiving about $1bn in total pay in 2021.\n\nView image in fullscreen Kim Steele, an actor and writer, holds a sign in support of the strike outside the Warner Bros Discovery Atlanta campus on Tuesday. Photograph: Alyssa Pointer/Reuters\n\nEntertainment industry workers say that wealth hasn’t been shared with them, and it’s getting harder to stay afloat. After a long drought of opportunities during the pandemic, workers have been hit by recent layoffs and declining job openings. Studios are cutting positions and experimenting with AI to replace roles.\n\nWith talk of the strike looming for months, producers have held back projects in anticipation, “so many of us already were kind of in ‘famine mode’”, Hunter says.\n\nThe strike began on Tuesday after the Writers Guild of America and the Alliance of Motion Picture and Television Producers (AMPTP), which negotiates on behalf of major studios, failed to reach a new contract agreement. According to the Writers Guild, streaming platforms have upended long-held labor standards by shortening TV seasons and hiring fewer writers for briefer stints – essentially turning them into gig workers.\n\nIn the past, entertainment unions have not always agreed on strikes – sometimes even openly feuding during them – but this time there’s a remarkable sense of solidarity, at least for now. The International Alliance of Theatrical Stage Employees (IATSE), the actors’ union Sag-Aftra, and the Hollywood Teamsters union are among guilds that have expressed support for the strike.\n\nWhile these unions aren’t on strike, their members may choose not to cross picket lines – a decision protected by some of their contracts. “Teamsters don’t just talk about solidarity, we are contractually protected to walk the walk,” the union said in recent guidance sent to its members.\n\nOne big reason for the unity is a pervasive feeling of worsening inequality, says Jonathan Handel, a Los Angeles-based lawyer and entertainment union expert. As streaming companies “spend billions of dollars building out platforms and profit-generation machines”, writers are demanding “a fair share of that and sustainable careers, and that’s a message that resonates with the rest of the workforce as well”.\n\nWhat’s at stake in the fight is the future of the entertainment business model, says Handel. The last writers’ strike in 2007 was in part a disagreement over the residuals – a type of royalties – that writers could earn from new formats like DVDs and online downloads. Streaming is an even bigger shift. “We haven’t seen such a dramatic and tumultuous period of technological change in the film entertainment industry since after the second world war,” he says, when Americans switched from theaters to watching TV at home.\n\nScott Leslie, a Studio City, Los Angeles-based prop man and set dresser at Warner Brothers and a member of IATSE, which represents production crews, says his work hours have dropped during the streaming era, and he fears layoffs will be next. His wife, Julie Ganis, a freelance book editor, worries what will happen to them and their son in college if Leslie loses his job, “along with his union paychecks and union benefits, like healthcare”.\n\nView image in fullscreen A giant inflatable rat, a symbol of organized labor, is displayed as writers picket outside Peacock NewFronts in New York. Photograph: Bebeto Matthews/AP\n\nWith the strike starting, Ganis is trying to renegotiate their son’s financial aid package: “My income is not enough to support the family.” But the couple staunchly backs the writers: “I really want them to hold the line and get what’s right, even though it’ll cost the town lots of money and wages and ancillary things,” Leslie says. His wife agrees: “Our enemy is not the writers, it’s the corporate overlords who are putting skyrocketing profits for Wall Street ahead of everything.”\n\nHunter, the camera operator and another IATSE member, says he’s been having conversations with other camera operators about how to find side hustles. “We’re supposed to be in this amazing industry with great careers, yet so many of us are having to look elsewhere to make ends meet. Whether that’s unemployment every 18 months, or side hustles, or whatever, the viability of our careers is at stake,” he says. “That’s what really connected with me when the writers say it’s a critical moment for them as the viability of their livelihood hangs in the balance.”\n\nEntertainment workers are hopeful that by staying united, they will be able to push the studios for better conditions. In less than two months, Sag-Aftra’s contract with AMPTP will need to be renegotiated as well, and many actors see their fates as intertwined with writers’.\n\n“Writers are on the frontlines, and we have to make sure we support them, because it’s a domino effect,” says the actor Justin Shenkarow, a Sag-Aftra member. “If they’re able to fight and get their proper wages and working conditions, then hopefully that will trickle over to the rest of the unions as well.”\n\nShenkarow, who is also the co-founder of ThreePointZero, a small animation studio, says he’s particularly concerned about AI and hopes the unions can win some rules targeting it: “We’ve seen such a huge uptick in AI in the last several months, and we need to make sure AI doesn’t replace the voiceover industry.”\n\nThe writer’s strike could even have impacts beyond the United States. Eben Bolter, a UK-based cinematographer who recently worked as a director of photography on HBO’s The Last of Us, says “writers in the UK and everywhere are going to look at what’s happening in the US”, and a win by the Writers Guild “would empower UK writers and everywhere to expect better”. While he’s “stressed” about where his next paycheck will come from, “I still support [the strike], because I think they’re doing the right thing. And what they’re asking for is very reasonable.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3Rkbi5jb20vbmV3cy9zdGF0ZS1hbmQtcmVnaW9uYWwvd2hhdC1zLXJpcHBsZS1lZmZlY3Qtb2YtY29sdW1iaWEtcml2ZXItY3J1aXNlcy9hcnRpY2xlXzIwNTQ3OTJhLWU5ZmYtMTFlZC05ODRkLWI3YTcyZmY1NGZjMC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "What's ripple effect of Columbia River cruises? - The Daily News",
        "content": "Some people are drawn to the sun and festivities of the Mexican Riviera. Some go for the wilderness and scenic wonders of Alaska, and others opt for the intimacy of small boats cruising European rivers.\n\nBut an increasing number of cruising opportunities are popping up close to home, as cruise lines expand their offerings along the Columbia River.\n\nThis year, there are nine ships cruising the river, carrying thousands of passengers from Astoria through the Columbia River Gorge and up the Snake River to Clarkston in Eastern Washington.\n\nCruising on the Columbia isn’t cheap. Fares this year cost anywhere from around $2,500 per person to more than $11,000, according to the booking website USA River Cruises.\n\n“The Pacific Northwest offers breathtaking scenery, the chance to retrace the expedition path of Lewis and Clark and indulge in the finest wines and freshest seafood Oregon and Washington have to offer,” reads a statement from American Queen Voyages. The company operates the American Empress, which docks along the Vancouver waterfront during its trips up and down the river.\n\nBut while river cruises have become a booming industry on the Columbia River, the jury is still out on the economic impact they’re actually bringing to the region.\n\nThe company says its trips boost the economy of the region. Its passengers usually take part in excursions when they’re in port, and they have souvenir and retail opportunities at each port.\n\n“Our goal is support those already built into the fabric of the community and uplift regional members,” the statement said.\n\nPorts of call impact mixed\n\nPart of the appeal of river cruises is that they’re all-inclusive, meaning passengers often eat on board. That’s not great news for restaurants along Vancouver’s waterfront, where those interviewed haven’t seen much business from cruise passengers.\n\nPorts in Kalama, Camas-Washougal and Stevenson also are hosts to river cruises.\n\nThe Port of Kalama began welcoming American Cruise Lines last spring — a $3.5 million project that was split between the port and the cruise line. Port public relations administrator Dan Polacek says it’s difficult to quantify the total financial impacts of passengers to the town’s business core.\n\nThat port’s cruise dock is a busy one, having welcomed four ships per week between April and November of 2022, with an estimated 16,500 visitors. American Cruise Lines increased its business at the port in 2023, with five ships now docking there each week, around 20,000 passengers for the year.\n\nEven so, the nearby McMenamins Kalama Harbor Lodge, while convenient, isn’t often frequented by cruise passengers.\n\n“We see a little bit of a bump in our gift shop and from the crew at times coming in to eat,” said Renee Rank Ignacio, director of marketing at McMenamins. “But for the most part, the passengers are not coming in to eat and drink.”\n\nIf they come in, it’s to grab merchandise or cans of beer or wine to go, added Ignacio.\n\nThe story is much the same in Camas and Washougal. The Clark County Historical Museum hosted cruise passengers last year when they stopped at the Port of Camas-Washougal.\n\nThe museum’s tour, which will be running again later this year, took passengers to Washougal’s Two Rivers Heritage Museum, Pendleton Mill Store and Captain William Clark Park and then historic downtown Camas for shopping.\n\nThe Two Rivers museum alone saw 1,560 cruise passengers last year.\n\nYet, even though tour guides provided coupons and maps for passengers, museum Executive Director Bradley Richardson heard from Camas businesses that not many saw a significant bump in sales.\n\nRichardson acknowledged it wasn’t what they hoped. But he said they were honored to get the chance to advocate for local businesses rather than a cruise company just hiring a tourism group from outside the area.\n\n“The hope is we can continue to grow and encourage the guests to shop in historic downtown Camas,” he said.\n\nExcursion sites keep busy\n\nWhile the cruise industry hasn’t yet proved to be a windfall for local retailers, it has had a significant impact for those businesses fortunate enough to be an excursion destination.\n\nTwo of the must-do tours when cruising the Columbia are going to Mount St. Helens and visiting the Columbia Gorge Interpretive Center.\n\nThe Mount St. Helens Visitor Center remained consistently busy during last year’s cruise season. The center even brought on more interpretive staff to accommodate the extra visitors and cruise ship passengers, which often arrived in three to four buses at a time.\n\n“We enjoyed the change, and our colleagues to the south and east of us were welcoming the same folks — at the Lewis and Clark Interpretive Center and the Sacajawea Interpretive Center, both located along the Columbia River,” said Alysa Adams, interpretive ranger at the Mount St. Helens Visitor Center.\n\nThe center held multiple educational ranger programs each day to meet the demand of the tours.\n\nIn the heart of the Gorge, the Columbia Gorge Interpretive Center in Stevenson also has passengers bused to its doors. During the cruise season, Jessica Chamberlin, the museum’s visitors manager, estimates passengers make up 70 percent to 80 percent of the museum’s attendees.\n\nThe cruise companies also often set up tasting events at local breweries and wineries, which bring passengers to specific businesses in the area.\n\nEvoke Winery hosted a very successful party for a cruise ship at its winery in Hood River, Ore., said Evoke’s Shelly Kice.\n\nAirfield Estates’ Vancouver Tasting Room hosted two private tasting events for American Empress passengers in the past few weeks. There are two more scheduled for later in the cruise season. It recently got an inquiry for a private event from another cruise line, as well. The events so far haven’t been lucrative, though the business is hoping sales during the events pick up.\n\nJust on Monday the business held 70 tastings for passengers — all at a reduced rate. There were only a couple of bottles sold, said tasting room manager Jeremy Parker.\n\nDespite not making many sales, the tasting room has been happy to get its name out there.\n\n“Overall, we’re pretty happy and looking forward to doing more of them,” said Parker.\n\nEffect on ports not yet clear\n\nThe ports say they are happy with the cruise business at their docks.\n\nThe Port of Skamania built its cruise ship dock many years ago for the smaller day cruises and added dolphins, wooden pilings that are used by the longer cruise ships that started cruising the river more recently.\n\n“It was a way of expanding our economic impact,” said Pat Albaugh, executive director at the Port of Skamania. The port docks around 200 cruise ships each season, though one company recently contracted with the Port of Cascade Locks in Oregon instead.\n\nThere are no numbers on what kind of economic impact the cruise industry has had on Vancouver. Those numbers may be coming in the next year, according to Cliff Myers at Visit Vancouver USA.\n\nThe Port of Camas-Washougal used visitor spending impacts estimated by the cruise lines to estimate economic impacts. That study showed the total economic impact in the community was $2.29 million. The port completed its $1.4 million breakwater access ramps last year.\n\n“I think cruise ships are seeing these developments in these small communities and taking advantage of that, and that’s future demand that I think will continue,” said Derek Jaeger, director of business development and real estate at the Port of Camas-Washougal, pointing to the new waterfront developments in Vancouver, Kalama and Camas-Washougal.\n\nFor Myers at Visit Vancouver USA, the organization is bullish on cruises but with trepidation, lacking actionable information.\n\nIt’s safe to say, he said, that passengers are staying overnight in local hotels and shopping and eating at local retailers.\n\nHe questions if retailers would be able to tell that cruise passengers are specifically coming in to shop and eat, saying passengers don’t stick out like some other visitors to the area.\n\n“We really feel like there’s a lot to be said here, but again, we just need to be smart. We need to point ourselves in the right direction with some information that we don’t have currently,” said Myers."
    }
]