[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmluZGlhbmFwb2xpc21vbnRobHkuY29tL2Zvb2QtYW5kLWRyaW5rcy9uZXctaW4tdG93bi10aGUtZW5nbGlzaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "New in Town: The English - Indianapolis Monthly",
        "content": "Butler alumni were delighted to see their beloved hangout, The Bulldog, brought back to life last summer after a reinvention that added a wristband-activated wall of self-serve adult beverages. Since then, a bespoke cocktail lounge called The English—as in English bulldog—opened in March, commanding the former Cornerstone Coffee House on the north side of the building. “It’s kind of a speakeasy vibe,” manager Mercede Hollings says of the intimate 60-seat setup that offers a menu of small plates and flatbreads. Thirsty patrons have an extensive lineup of tequilas and bourbons to consider, as well as flights, internationally sourced wines and bubbles, and seasonal cocktails with names inspired by British slang. In a departure from the sports-oriented Bulldog, The English occasionally screens old black-and-white movies on several TVs. 651 E. 54th St., 317-377-4735"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vdS50b2RheS90aGlzLWlzLXdoYXQtY291bGQtaGFwcGVuLXRvLXhycC1ob2xkZXJzLWlmLXJpcHBsZS1sb3Nlcy10by1zZWPSAVNodHRwczovL3UudG9kYXkvdGhpcy1pcy13aGF0LWNvdWxkLWhhcHBlbi10by14cnAtaG9sZGVycy1pZi1yaXBwbGUtbG9zZXMtdG8tc2VjP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "This Is What Could Happen to XRP Holders If Ripple Loses to SEC - U.Today",
        "content": "As the legal battle between Ripple and the SEC continues, XRP holders anxiously await the outcome and ponder the potential consequences. Attorney John Deaton, representing XRP holders in a class-action lawsuit against the watchdog, recently shed light on what might be at stake for investors if Ripple fails to secure victory.\n\nAdvertisement\n\nIf Ripple loses to the SEC there won’t be any money collected for years and ONLY if Ripple loses on appeal. If the Supreme Court takes it on appeal (which I believe they will if Congress hasn’t acted by then), I believe Ripple hands down wins with this Supreme Court. If the SEC… https://t.co/0xHw266YXf — John E Deaton (@JohnEDeaton1) July 6, 2023\n\nAccording to the attorney, if Ripple loses the lawsuit against the SEC, the ramifications for XRP holders could be significant and long-lasting. Deaton predicts that in such a scenario, there would be no immediate financial resolution. Instead, a lengthy process of appeals is expected, which could stretch over a period of 2-5 years.\n\nConsequences and implications\n\nIf the SEC emerges victorious, continues Deaton, Ripple would likely appeal the decision, leading to an extended period of legal limbo. Furthermore, even if XRP holders prevail in a separate civil case against Ripple, their chances of obtaining compensation would be jeopardized. Should Ripple exhaust all avenues of appeal and ultimately lose, the SEC would be entitled to collect the funds, estimated to be around $1.3 billion.\n\nThe attorney suggests that an SEC victory could significantly reduce the damages that XRP holders might be eligible to receive in the civil case against Ripple. Paradoxically, if the SEC were to recover funds, XRP holders could potentially benefit from a regulator's fund designed to compensate them. This would be particularly advantageous as the lawyers' fees would be deducted before disbursing the funds, potentially resulting in larger payouts for XRP holders."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS14cnAtbmV3cy1iYW5rLW9mLWFtZXJpY2EtZXhlY3V0aXZlLXJlY29nbml6ZXMtcmlwcGxlLXhycHMtcG90ZW50aWFsLWluLXBheW1lbnRzL9IBdmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZS14cnAtbmV3cy1iYW5rLW9mLWFtZXJpY2EtZXhlY3V0aXZlLXJlY29nbml6ZXMtcmlwcGxlLXhycHMtcG90ZW50aWFsLWluLXBheW1lbnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Ripple (XRP) News: Bank of America Executive Recognizes Ripple XRP’s Potential in Payments - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nIn a remarkable acknowledgment from a leading financial institution, Bank of America has recognized Ripple XRP as a “possible exception” within the payments space. This recognition highlights the unique position and potential game-changing capabilities of Ripple XRP.\n\nBank of America Recognizes Ripple XRP’s Unique Position in the Payments Sector\n\nToday, Bank of America executives recognized the role of blockchain technology in facilitating real-time payments, particularly in the Asia Pacific region.\n\nRipple, a leading enterprise blockchain and crypto solutions provider, has been forging partnerships with major financial institutions worldwide. The firm has recently obtained in-principle approval for its ‘Major Payments Institution License’ application in Singapore, a pivotal market in the Asia-Pacific region. This approval further solidifies Ripple’s expanding reach and influence in the industry.\n\nIts innovative payment solutions, including the use of XRP as a bridge currency through its On-Demand Liquidity (ODL) service, have garnered attention for their potential to revolutionize cross-border transactions.\n\nVenkat ES, Head of Treasury Products at the bank, highlighted the significance of blockchain technology in digitizing trade documentation through smart contracts. While the SWIFT gpi technology remains favored for cross-border payments, Ripple’s solutions, according to Venkat ES, offer a ‘possible exception’ in the payments landscape.\n\nRipple’s Collaborations Strengthen Position as Leader in Cross-Border Payments\n\nIt is worth mentioning that Ripple has established partnerships with renowned financial institutions such as SBI Holdings, the Saudi Arabian Monetary Authority, Banco Santander, Western Union, UAE Exchange, and American Express. These collaborations have further strengthened Ripple’s position as a leader in the cross-border payments sector.\n\nLooking ahead, the outcome of Ripple’s legal battle with the U.S. Securities and Exchange Commission (SEC) could have a significant impact on the future of the company and the value of the XRP token. A favorable judgment in the lawsuit could potentially boost Ripple and the XRP token price as we approach the end of 2023.\n\nWhile this acknowledgment from a Bank of America executive is significant, it is important to note that the broader financial industry continues to explore and evaluate the potential of Ripple XRP. The integration of Ripple’s technology into existing financial infrastructures could pave the way for widespread adoption and bring substantial changes to the payments ecosystem."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LndydHYuY29tL2VudGVydGFpbm1lbnQvaW5zaWRlLWluZHkvYnJvYWQtcmlwcGxlLWNvbW11bml0eS1zdXBwb3J0cy1wb3B1bGFyLWJha2VyLWRpYWdub3NlZC13aXRoLWNhbmNlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Broad Ripple community supports popular baker diagnosed with cancer - WRTV Indianapolis",
        "content": "BROAD RIPPLE — Nothing seems more unfair in life than having a baker who can't eat. Especially for a baker with a healthy lifestyle, but Rene’s Bakery owner, Albert 'Rene' Trevino, is dealing with just that.\n\n\"He's the guy who does all of the croissants,” said Olivia Trevino, Rene’s daughter. She said \"This came as a really big shock. He boxes three times a week, he rolls croissants ten hours a day, eats healthy, does everything right.\"\n\nIt all stated last Fall when 'Rene' got sick and felt like he had something in his throat. It grew into difficulty breathing. Because he's a small business owner, he supplies his own medical coverage, and it took months to get a doctor's appointment. Minute Clinic professionals said they found nothing. Then a doctor brought in a scope.\n\nDoctors found a cancerous tumor in his throat. He went into surgery last month. Rene is fighting stage four laryngeal cancer. Three surgeries, and twenty-six days in the hospital later, he's home.\n\n\"They said probably about two years he'd been living with this (the cancerous tumor), and he had no idea,\" said Olivia.\n\nRight now, Rene must write all his responses down. His daughter Olivia Trevino is speaking for him. Olivia said, \"(Rene) He says that I appreciate all my friends, customers, and strangers that have helped. It's a wonderful feeling.\"\n\nRight now, Rene can’t eat solid foods, and must use a feeding tube. Olivia said \"They went back in and reconstructed by using his chest muscle to reconstruct, they brought it up to reconstruct his neck because without taking the chest muscle he'd have to do tube feedings for the rest of his life. And he wants to be able to eat.\"\n\nOlivia was in her 'finals' week at IU-Bloomington when her dad was diagnosed and went into surgery quickly. She said she felt helpless in some ways and so Olivia took action, by making a go-fund me account.\n\n\"First, I made sure it was ok with him because I didn't really feel like he would want me to reach out to the community because he's always done everything on his own. He's built everything himself,” said Olivia.\n\nNow, his friends in Broad Ripple are making sure Rene is not in this cancer fight alone.\n\n\"And I started with a goal of ten-thousand dollars, and we hit that in six hours which is absolutely there weren't words. I thought ten-thousand dollars was outrageous,” said Olivia.\n\nSo, they raised the goal to fifty-thousand.\n\nShe said, \"The day he got released from the hospital, June 30th was the day we hit our 50-thousand-dollar goal. Which it's like I have tingles and it makes me emotional because for me he's always been this hero and shining light and just to see all the work he's put into the community give back to him and so overwhelming like you can't say thank you enough and I feel like words can't even describe.\"\n\nIt's neighbors helping one of their kindest neighbors who’s known for spreading sweets and goodness, in Broad Ripple."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDcvMDcvZ2VybWFuLWJhbmtpbmctZ2lhbnQtaGlnaGxpZ2h0cy1yaXBwbGVzLXVzZS1vZi14cnAtZm9yLWVmZmljaWVudC1nbG9iYWwtcGF5bWVudHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "German Banking Giant Highlights Ripple's Use of XRP for Efficient Global Payments - The Crypto Basic",
        "content": "A five-year-old report from German banking giant Deutsche Bank and The Banker highlights the use of XRP by Ripple to facilitate efficient cross-border payments.\n\nRipple, a trailblazing company committed to disrupting the cross-border payment industry using blockchain technology, has garnered recognition from major financial institutions. Among these is Deutsche Bank, a prominent multinational investment banking firm headquartered in Germany.\n\nEdward Farina, the CEO of Alpha Lions Academy, recently drew attention to a remarkable report published by Deutsche Bank AG, which dates back five years.\n\nCASH MANAGEMENT paper ? by Deutsche Bank and The Banker. “Central Banks ? are working on issuing stable coins, which is not issuing a pure-play cryptocurrency, but one that acts as a BRIDGE CURRENCY.”#XRP, #RIPPLE and XRapid mentioned nearly 20 times. pic.twitter.com/bgogwVcz9a — EDO FARINA ? XRP (@edward_farina) June 27, 2023\n\n- Advertisement -\n\nPublished in July 2018, the report sheds light on Ripple’s strategic utilization of XRP to facilitate efficient cross-border payments. It underlines the immense potential of blockchain technology to transform the traditional landscape of international payments, using Ripple’s solution as a remarkable case study.\n\nRipple’s RippleNet Product\n\nAt that time, Ripple’s flagship product, RippleNet, comprised three distinct components: xCurrent, xRapid, and xVia.\n\nThe Deutsche Bank report specifically highlights the role of xCurrent in enhancing payment information and processing while emphasizing xRapid’s ability to provide liquidity for cross-border transactions, utilizing XRP as a bridge currency.\n\n- Advertisement -\n\nThe report showcases Ripple’s remarkable success in attracting over 100 financial institutions to its RippleNet network. Notably, SEB, a renowned Swedish bank, facilitated more than $1 billion in payments between Sweden and the U.S., leveraging RippleNet’s capabilities.\n\nIn addition, the report highlights Ripple’s innovative approach to addressing liquidity challenges in cross-border payments. While xCurrent streamlines payment processing, xRapid utilizes XRP to ensure swift liquidity provision.\n\nCuallix, a non-bank financial institution based in the U.S., effectively employed xRapid to expedite payments from the U.S. to Mexico.\n\nThis groundbreaking process involved converting U.S. dollars into XRP via an exchange, which was then instantaneously converted to Mexican pesos, significantly reducing the time and cost associated with traditional international payments.\n\nThe Deutsche Bank report garnered public attention shortly after the XRP community brought to light a similar article by the U.S. Faster Payment Council, which spotlighted Ripple’s innovative cross-border payment solutions.\n\nThe Promise of Blockchain\n\nThe report from Deutsche Bank further accentuates the immense potential of blockchain technology to bridge gaps in cross-border payment services, particularly in regions where correspondent banks have withdrawn their support.\n\nHowever, it acknowledges the challenges that must be addressed for widespread adoption, including the establishment of industry-wide governance standards and rules, as well as concerns surrounding scalability.\n\nFurther exploration and expansion of proof-of-concept projects are imperative to ascertain the full extent of distributed ledger technology’s applicability in cross-border payments."
    }
]