[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvcmlwcGxlL3JpcHBsZS14cnAtcmVsYXRlZC1mbGFyZS1haXJkcm9wLWZsci1kdW1wcy_SAVNodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL3JpcHBsZS9yaXBwbGUteHJwLXJlbGF0ZWQtZmxhcmUtYWlyZHJvcC1mbHItZHVtcHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Ripple (XRP) Related Flare Network Token Airdrop: FLR dumps by 71% - NewsBTC",
        "content": "In late 2020, the Flare Network attracted a lot of attention in the Ripple (XRP) community. The creators wanted to open up the DeFi space for Ripple and announced an airdrop of Flare (FLR) tokens for all XRP holders.\n\nHowever, holders of XRP had to be patient for a long time. The launch was postponed several times. But today is finally the day: at 6:59 p.m. EST, the distribution of FLR tokens will take place.\n\nThe FLR Token Distribution event is just 24 hours away. Join the #Flare team and guests on Twitter tomorrow. The distribution starts at 23:59 UTC sharp. The stream will start a few minutes before.#ConnectEverything pic.twitter.com/CLtmUird1Z — Flare ☀️ (@FlareNetworks) January 8, 2023\n\nHowever, there is also bad news. Just before the launch, the FLR/USDT trading pair is seeing a massive dump of around 71% on Bitrue.\n\nThe exchange was the only trading platform besides Poloniex to date where FLR could be traded as an IOU. As can be seen in the 1-day chart from TradingView, the FLR/USDT pair has seen a massive dip over the last two days on Bitrue.\n\nThe token was trading at $0.5394 yesterday and crashed to a low of $0.1559 at times today before recovering to $0.2395 at press time. With this, the FLR token is still posting a loss of around 55% compared to two days ago.\n\nAirdrop For XRP Holders Is Finally Here – Too Late?\n\nWhen the project started, the narrative was clear: Ripple (XRP) lacked access to the booming sector of decentralized finance (DeFi). This has since changed, at least in part. Ripple has been developing a bridge to Ethereum (ETH) on its own to enable smart contracts and DeFi. Moreover, the XRP Ledger now has a DEX and its own NFT standard.\n\nRelated Reading\n\nXRP Price Primed For Future Rally Following Ripple’s MENA Expansion 1 year ago\n\nTo adapt to it, the project now aims to provide smart contract capabilities for blockchains without them, starting with Ripple (XRP). Flare Network is a layer 1 Ethereum Virtual Machine (EVM) based interoperable blockchain based on the Proof of Stake (PoS) consensus mechanism.\n\nRelated Reading\n\nHowever, whether Flare Network can convince investors after its 2-year delay with its new approach or whether there will be another dump tonight when the majority of Ripple (XRP) investors receive their FLR tokens, remains to be seen. Today’s dump suggests that some investors may not be interested in FLR in the long term.\n\nFLR Token Distribution\n\nFor every 1 XRP in the snapshot (taken in December 2020), 1.0073 FLR will be airdropped. Today, the first 15% of this amount will be distributed via airdrop. The remaining 85% of the tokens will be paid out in 36 monthly installments. The method of distribution depends on the outcome of the community vote on the Flare Improvement Proposal 01 (FIP.01).\n\nIf the community approves the proposal, the remaining 36 monthly distributions will be decentralized on the chain. The tokens will be divided among the wallets that packaged FLR tokens (WFLR).\n\nIf the community rejects the proposal, the same self-storage wallets and the same centralized exchanges that received the initial airdrop will receive one airdrop per month for 36 months.\n\nFeatured image from iStock, Chart from TradingView.com"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jaGVhdHNoZWV0LmNvbS9lbnRlcnRhaW5tZW50L3ByaW5jZS1oYXJyeS1ncmltYWNlLWR1cmluZy1pdHYtaW50ZXJ2aWV3LXNob3dzLWRpc2d1c3QtYW5nZXItYm9keS1sYW5ndWFnZS1leHBlcnQtc2F5cy5odG1sL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Prince Harry 'Grimace' During ITV Interview Shows 'Disgust or Anger,' Body Language Expert Says - Showbiz Cheat Sheet",
        "content": "A body language expert shares her analysis of Prince Harry during his ITV interview with Tom Bradby, noting how he appeared to show 'disgust or anger' with one 'grimace' gesture.\n\nPrince Harry appeared to show a gesture of “disgust or anger” in his ITV interview with Tom Bradby, according to a body language expert. The Duke of Sussex sat down with the interviewer ahead of the release of his memoir Spare.\n\nPrince Harry and Meghan Markle | Mike Coppola/Getty Images for 2022 Robert F. Kennedy Human Rights Ripple of Hope Gala\n\nPrince Harry sat down for an interview with ITV’s Tom Bradby\n\nWith his memoir Spare set for release, Prince Harry gave a number of interviews to promote the book, including one with Bradby for ITV.\n\nBody language expert Judi James shared her analysis of Harry’s reaction to one of the interviewer’s questions.\n\nBradby told Harry, “Some people will say you have railed against invasions of your privacy all your life but the accusation would be, here are you invading the privacy of your most nearest and dearest without permission. That would be the accusation.”\n\nHarry responded, “That would be the accusation from people that don’t understand or don’t want to believe that my family have been briefing the press.”\n\nHarry conveyed a look of ‘disgust or anger,’ body language expert says\n\nJames shared her analysis with the Mirror, pointing out how Harry showed discomfort about the question. “Tom’s comment about invasions of privacy seems to push Harry into a face-touching cut-off ritual though, suggesting a ‘blow’ might have landed,” she said.\n\nJames continued, “Harry touches his nose and sniffs. This can often be a way of partly hiding the face and behind the hand, Harry’s micro-expression seems to be a grimace of what could be disgust or anger.”\n\nShe also looked at Harry’s hand gestures. “There is also a double-clenching of his hands in a baton gesture as Tom displays passion to refer to Harry ‘invading the privacy of your nearest and dearest’ but Harry’s response suggests some ducking and diving as the verbal ‘punches’ are thrown.”\n\nHarry’s lack of eye contact is also revealing, according to James. “When Tom tries to invite Harry into the sibling role-play Harry declines, looking away again to the side and then upward,” she noted.\n\nJames added, “Harry avoids eye contact a lot here, looking upward as though searching for his now-signature sound bite of ‘staying silent.’ The repetition of quotes like this suggest an element of political responses might be on the cards during his book plugs.”\n\nHarry gave a quick response to the interviewer’s question about the monarchy\n\nHarry was asked whether he’ll attend the king’s coronation or not and James found his body language revealing.\n\n“He performs a precision pinch gesture with his right hand as he is asked about going to the coronation etc, to suggest he believes he is totally and utterly in the right,” she explained. “He also shrugs to emphasize his opinion that it is not up to him to make any first moves.”\n\nHarry’s quick response to his thoughts on the monarchy was also interesting, James said.\n\n“There is one moment in this trailer when Harry’s body language ‘norm’ in this clip would be established,” she said. “When asked about believing in the monarchy his reply is instant and emphatic, involving eye contact, a deep, hissed ‘Yes’ and a head baton nod.”\n\nShe added, “He doesn’t even have to think about his answer, unlike with some of the other questions that get lobbed at him.”\n\nShowbiz Cheat Sheet acknowledges conditions and cultures can impact body language and is sensitive to all backgrounds."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LndoYXR0b3dhdGNoLmNvbS9mZWF0dXJlcy90dWxzYS1raW5nLWVwaXNvZGUtOS1kd2lnaHQtZmlnaHRzLWZvci13aGF0LWhlcy1idWlsdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "Tulsa King episode 9: Dwight fights for what he's built - What To Watch",
        "content": "NOTE: this post contains spoilers for Tulsa King episode 9, \"Happy Trails.\"\n\nThe Tulsa King season 1 finale starts with a flashback back to 1997 New York. A young Chickie (Domenick Lombardozzi) and Vince (Vincent Piazza) are excessively torturing Ripple (David Deblinger) in an abandoned house. Armand (Max Casella) witnesses Chickie and Vince brand Ripple's face, so he calls Dwight (Sylvester Stallone), who immediately stops Chickie and Vince. But this leads to the brand falling onto the floor and the house setting on fire.\n\nDwight tells Chickie, Vince and Armand to leave, but Ripple is handcuffed to a radiator. Unable to break Ripple free and with the house engulfed in flames, Dwight does the most humane thing he can think of, shooting and killing Ripple to prevent him from burning to death.\n\nAs Dwight leaves, the fire brigade and police arrive on the scene, placing him under arrest, which leads to his 25 years in prison.\n\nBack in the present, Dwight is once again face-to-face with two cops. This time in an interrogation room, as they question him about Stacy (Andrea Savage) being shot outside by Black MacAdams leader Caolan Waltrip (Ritchie Coster). They want to know about Dwight's relationship with Stacy. Unsurprisingly, Dwight doesn't say a thing. Since Dwight didn't commit a crime, at least in this instance, he's allowed to leave. He heads straight to the hospital to see Stacy, who survived the shooting.\n\nHe calls Stacy the toughest woman he has ever met and says he owes her his life, vowing to find Waltrip and dish out some vengeance. But Stacy has more pressing matters on her mind. With her relationship to Dwight exposed, the FBI and ATF will not look fondly on her mixing with a known felon, meaning her career is basically over.\n\nAs well as dealing with Waltrip, Dwight also has to contend with the sudden arrival of Chickie, Vince and Goodie (Chris Caldovino) in Tulsa. But rather than waiting for the New York gangsters to come to him, Dwight confronts them as they're relaxing pool-side at their hotel.\n\nGet the What to Watch Newsletter The latest updates, reviews and unmissable series to watch and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nDwight demands Chickie and Vince get out of town immediately, telling them he's built a great life for himself here without any of their help and he doesn't have to give them money anymore. Dwight even offers Goodie a job with him in Tulsa, which he accepts rather than working under Chickie. Chickie and Vince threaten to make things much more violent, but before they can put their hands on their guns, Dwight points out four of his soldiers are surrounding the pool. Thoroughly outnumbered, Chickie and Vince depart back to New York.\n\nWith his New York problems now settled, Dwight focuses on Waltrip. He tells his make-shift crime family — Tyson (Jay Will), Mitch (Garrett Hedlund), Grace (McKenna Quigley Harrington) and Fred (Justin Garcia-Pruneda) — that they're going to war with the Black MacAdams. In a stirring speech to his new family, he says they have to fight past fear of what's coming.\n\nMartin Starr, Jay Will, Dashiell Connery and Justin Garcia-Pruneda in Tulsa King (Image credit: Brian Douglas/Paramount+)\n\nUnlike his confrontation with Chickie and Vince, Dwight wants Waltrip to come to him. Using his technical wizardry, Bodhi (Martin Starr) is able to hack into Waltrip's computer and seize the $8.2 million he has stolen over the years. Dwight even gives $1 million of this money to Stacy as a thank you for saving his life and a sorry for ruining her career.\n\nWaltrip responds exactly as Dwight wanted him to. Alongside the rest of the Black MacAdam bikers, they try to ambush Mitch's bar. But Dwight and his posse are waiting for them. A shoot-out unfolds, set to the Phil Collins classic \"In the Air Tonight.\"\n\nIt's not all smooth sailing, as Tyson and Armand are both shot in the fight (though they survive). Ultimately, all of the Black MacAdam bikers are killed and Dwight gets into a hand-to-hand fight with Waltrip. Of course, there was always only going to be one winner. Dwight grabs hold of Waltrip's throat, hangs him up on a pair of decorative deer antlers and then shoots him through the head.\n\nThree months later at the Fennario horse ranch, Dwight happily watches his grandkids, who are visiting with his daughter Tina (Tatiana Zappardino). She even calls him dad for the first-time and life is seemingly now bliss for Dwight.\n\nTina is in town for the grand opening of Dwight, Mitch and Jimmy's (Glen Gould) new casino. At the soiree to mark its launch, money is already piling in. Mitch even decides to sing \"Never Been to Spain\" in dedication to Dwight, who dances with Tina.\n\nThe pair are interrupted by Fred, who says a woman is waiting outside for Dwight. It's Stacy. Turns out she was able to keep her job at the ATF, but only in exchange for helping bring down Dwight. She told the FBI about the $1 million Dwight sent her, which they consider a bribe. Dwight is arrested, charged and placed into the back of a police van, just as Tina comes outside to see her father being taken to prison for the second time in her life.\n\nThis brings Tulsa King season 1 to a swift, mostly entertaining, but undeniably uneven conclusion. Tulsa King really felt like it sped towards its finale. Not only were the last two episodes shorter than most of its predecessors, but the storylines felt rushed and at times inconsistent. This isn't enough to wreck what has been an entertaining, if cliched, show, especially anchored by a compelling leading performance from Stallone.\n\nBut, ultimately, especially in its finale, Tulsa King's big confrontations didn't explode in a satisfying or dramatic enough manner, while it was too focused on making Dwight likable and redeemable.\n\nWith Tulsa King season 2 already confirmed, let's hope a little more of the complexity that made Terrence Winter's shows like The Sopranos and Boardwalk Empire so intriguing and impactful. Because making Tulsa King more cohesive and nuanced could take the show to another echelon of quality, rather than it just being enjoyable.\n\nAll of Tulsa King season 1 is now available to stream on Paramount Plus."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZG10YWxraWVzLmNvbS90dWxzYS1raW5nLXNlYXNvbi0xLWVuZGluZy1leHBsYWluZWQtMjAyMi1kcmFtYS1zZXJpZXMtdGF5bG9yLXNoZXJpZGFuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "'Tulsa King' Ending, Explained: What Happened Between Dwight And Waltrip? What To Expect From Season 2? - DMT",
        "content": "Created by Taylor Sheridan, the first season of the crime drama “Tulsa King” took us on a thrilling journey where we saw an ex-felon trying to reclaim his lost empire bit by bit. Sylvester Stallone, in the role of Dwight “The General” Manfredi, exudes the kind of authority and suaveness that the role uncompromisingly demanded. Hands down, nobody could have aced the role the way he did. Stallone is the pivot around whom the entire story revolves, and though the writers do not bring anything absolutely unique to the plate, “Tulsa King” keeps you engrossed for its entire runtime of nine episodes.\n\nSpoilers Ahead\n\nWhen Dwight Manfredi came to Tulsa on the orders of Pete Invernizzi, he didn’t know anybody there. Slowly, he started building a team with people he could trust, enabling him to establish his dominance over the entire area. There were quite a few roadblocks that came his way, but Dwight was always able to surpass them. The FBI and the ATF had been on his back for some time, but Stacy Beale made sure that they weren’t able to get any sort of incriminating evidence against him. When Dwight decided to sell nitrous oxide, he came to know about a rival group operating in the same area called the Macadam gang. Caolan Waltrip was the leader, and he had warned Dwight’s gang to not encroach upon their territory. Dwight was not the type of man who got threatened by such people, as all his life, he had dealt with far greater perils. When Waltrip came to know that Dwight was an ex-capo, he decided to have a talk and asked him to leave. Dwight said that he had no right to tell him what he should and shouldn’t do. Caolan Waltrip felt disrespected, as no one had ever dared undermine his authority until then. Apart from Waltrip, Chickie had also become an unnecessary nuisance for Dwight. His life had been saved by Dwight, but he didn’t show even an ounce of gratitude. All Chickie had ever done was try to backstab the man whom he ironically called his uncle, and Dwight was aware of his intentions. Manfredi had to settle scores and make sure his family and his people were safe and secure. So, let’s see what happens in the season finale of “Tulsa King” and whether Dwight is able to defeat his adversaries.\n\nWhy Had Dwight Gone To Prison?\n\nIt was the year 1997, and Pete Invernizzi’s entire gang operated from Brooklyn, where they had established their dominance. A person named Ripple hadn’t paid his debt, and Chickie was entrusted with the responsibility of warning him about the consequences, but he had taken it a step too far and become violent, handcuffing the man in his apartment and beating him mercilessly. Vince was adding more fuel to the fire while Armand was telling Chickie time and again to not go overboard with his actions. Vince and Chickie broke his legs, and that’s when Armand realized that the situation was getting out of hand. Armand went and informed Dwight about it, as he knew that only Dwight could stop those two. Dwight arrived as soon as he could, and he saw that Chickie had a branding iron in his hand and that he had left a mark on Ripple’s cheeks. Dwight asked the men to leave Ripple immediately, but they couldn’t find the key to open the cuffs. The room caught fire accidentally, and Dwight realized that he wouldn’t be able to save Ripple. He shot him because he knew that if he didn’t take that step, Ripple would have had a very slow and painful death. The others escaped, and when the police arrived at the scene, they found Dwight coming out of the house. He took the blame upon himself, and for 25 years, nobody knew what happened on that fateful night. Chickie owed his life to Dwight, as whatever had happened on that day was all his doing. But it seemed like he had forgotten about it, and after killing his own father, his next target was Dwight Manfredi. Chickie was clear that either Dwight accepted the proposed terms and conditions, or he would meet a similar fate as his father had.\n\nArmand Chooses To Face His Fears\n\nAfter Stacy was shot by Caolan Waltrip, the FBI took Manfredi into custody. They had found out through the call records that Stacy had been in touch with Dwight for quite some time. Before they could further investigate him, Elliot Evans, a lawyer, came to his rescue. Lawrence Geigerman, a.k.a. Bodhi, had sent him to get Dwight released from custody. Dwight straightaway went to meet Stacy, and he was relieved to find out that she was out of danger and on the path to recovery. Dwight wanted to compensate her for what she had done for him, and he assured Stacy that he would in due time. Dwight wanted to settle things with Chickie once and for all. He wanted to make it clear to him that he was not obliged to share his profits. Chickie had left him to fend for himself, and now that Dwight had created an empire, he wanted a share in it. Dwight gave Armand the choice of laying low, as he knew that he felt intimidated by Chickie’s presence. But Armand said that he was done hiding, and for once, he wanted to face his fears and let it be known that he wasn’t going to get bogged down so easily. Armand said that for years he hadn’t been able to look at himself in the mirror. He was ashamed of the fact that he was so timid. He said that he felt the same fear when he saw Dwight for the very first time in Tulsa. Armand chose to fight and stand by Dwight’s side because he had a lot to prove to himself.\n\nDwight, Armand, and Tyson ambushed Chickie, Vince, and Goodie. Dwight made it clear that he was breaking all ties with the Invernizzi family and was going to operate independently. He had a good relationship with Goodie, and he gave him the option of joining his gang. Goodie agreed, and Chickie went back to New York, as he knew that it would be a stupid decision to mess with Dwight in his territory. The next thing on Dwight’s list was to deal with Caolan Waltrip, and he told his people to get ready for the final showdown.\n\n‘Tulsa King’ Ending Explained: What Happened Between Dwight And Waltrip?\n\nThe first thing that Dwight did was to flush Waltrip’s bank account and make sure that he didn’t have any money to carry out his activities. Waltrip had a huge amount of money that he had procured through his illegal activities over the years, which gave him leverage. Dwight knew that Bodhi was an IT genius, and he could help him hack Waltrip’s account. Bodhi set up a bogus hotspot and gained access by sending a malware Trojan horse. Dwight sent a huge chunk of that money to Stacy and kept the rest for himself, as he had plans to renovate Mitch’s bar and open a casino there. Dwight waited in his den, as he knew that after stealing all his money, he had left Waltrip with no option other than to come out of hiding. The bar became a battlefield, and there were shots fired in all directions. Dwight finally killed Waltrip and became the uncrowned emperor of Tulsa.\n\nThe enemies had perished, and the authorities still didn’t have any dirt on Dwight. Tina, Dwight’s daughter, shifted to Tulsa, and it seemed like things had finally gone back to normal. Dwight could see his life from there, and he was happy to be around his family. He had not been there for his daughter when she was growing up, and he wanted to make up for the lost time. He felt elated when Tina called him dad, and he realized that no material wealth could ever equal that feeling. The casino was all set for its grand opening, and Dwight had invited everybody he knew to be a part of the celebration. But his problem had not ended, and he had no clue what the FBI was planning behind his back.\n\nStacy Beale was told that she could be reinstated to full duty if she provided some incriminating evidence against Dwight. Stacy didn’t know what to do as, on one side, she had an opportunity to get back her job, and on the other side, she could save the man whom she had loved and had an immense amount of faith in. When the party in the casino was in full swing, Stacy arrived with the police and FBI at the scene. She had given them the flash drive that Dwight had sent to her. The authorities now had evidence based on which they could arrest Dwight for attempting to bribe a federal agent. Dwight stood there in disbelief, as he had never thought that Stacy could betray him. Tina saw the authorities take her father, and it seemed like history was repeating itself. After all this time, she started becoming hopeful about the fact that she could mend her relationship with her father. While sitting in the police vehicle, Dwight apologized to Tina, knowing that she had done nothing to deserve such a life.\n\nWhat To Expect From ‘Tulsa King’ Season 2?\n\nThough “Tulsa King” season 1 ended with Dwight going back to prison, the story is far from over. We believe that Stacy must have some plan of action in her mind. Though she had given the authorities what they wanted, she might have some way of getting Dwight out of there. It was a big win for the FBI and the police, as they had tried to catch hold of the ex-capo for years. Though they still didn’t have any evidence to prove his involvement in other criminal activities, charging him with attempted bribery had bought them time. Dwight was an intelligent man, and we have seen how he was always a step ahead of others. In season 2 of “Tulsa King,” we would see him figuring out a way to quash all the charges against him. It is possible that he would be able to prove in a court of law that he had been falsely implicated through hook or crook. We might witness another rival gang rising in Tulsa and taking advantage of Dwight’s absence. Dwight had earned trusted friends who would stay by his side no matter what, and we are pretty sure that they would try their best to bring him out. Dwight might have lost control of the reins for a bit, but we are hopeful that in Season 2 of “Tulsa King,” he will get the better of authorities and run the show on his terms and conditions as he always had.\n\n“Tulsa King” is a 2022 Drama Thriller series created by Taylor Sheridan."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LndpZGVvcGVuY291bnRyeS5jb20vdHVsc2Eta2luZy1lcGlzb2RlLTktc2Vhc29uLTEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Jan 2023 08:00:00 GMT",
        "title": "'Tulsa King' Season Finale Recap & Predictions For Season 2 - Wide Open Country",
        "content": "And just like that, the first season of Tulsa King is signed, sealed and delivered. In the finale episode, entitled \"Happy Trails,\" Sylvester Stallone's aging mafioso Dwight Manfredi enjoys a big win and suffers an even bigger loss, leaving us hanging until Season 2. (Is it any wonder a Taylor Sheridan-created show would end on a cliffhanger?)\n\nTulsa King has been a strange, but ultimately successful experiment in combining the Western and gangster genres. The crossover of disparate elements — rural, urban, scheming and honesty — teased out what makes each genre so compelling. For the Western, it's the impossibility of the outlaw we respond to. And for the gangster genre, it's the tragic inevitability of criminal downfall that we come back to time and time again. And this season finale is all about the impossible and the inevitable: Even if Dwight could catch a break, would he really break free from the cycle of crime? Let's break down what we saw, what questions went unanswered, and what could happen next season.\n\nWarning: Spoilers ahead for the Season Finale of Tulsa King.\n\nThe Origin Story\n\nThe episode opens with a flashback to a rainy night in Gotham — ahem, Brooklyn — in 1997. It's Dwight's origin story, so to speak: We see the murder that landed him in prison for 25 years. A much-younger, balding Chickie (Domenick Lombardozzi) and Vinny (Vincent Piazza) beat up a handcuffed \"Ripple\" (David Deblinger) for failing to pay a debt to the Invernizzis. Manny (Max Casella) begs Chickie to lay off the guy, ultimately calling Dwight for help. In sadistic fashion, Chickie brands Ripple on the face. (This is a Taylor Sheridan show, after all.)\n\nDwight arrives, demanding that Chickie and Vinny uncuff Ripple. But the dopes can't find the key to the handcuffs, and Chickie's brand (which, let's be real, looks like a potato masher) meets some stray papers, starting a fire. Dwight tries to shoot through Ripple's steel handcuffs, to no avail. The fire is out of control at this point, and Dwight shoots Ripple in the forehead so that he won't burn alive. The police pull up and — bada bing, bada boom — Dwight takes the fall. Turns out he was being literal when he told Margaret in Episode 7 that he saved a man from a burning building.\n\nDwight Gets Off Easy\n\nWe fast forward to present-day Tulsa, where FBI Agent Ruiz (Alessandro Garcia) and ATF Agent Hendricks (Miles Mussenden) question Dwight about his relationship with Stacy. Elliot Evans (Josh Fadem), a young guy wearing a drug rug, waltzes in, professing to be Dwight's lawyer. It turns out Bodhi sent Elliot to save Dwight from the law's clutches. After succeeding in that task, Elliot dips and doesn't return for the remainder of the episode. In any case, it's always nice to meet one of Bodhi's blissed-out buddies.\n\nDwight visits Stacy (Andrea Savage) in her hospital room. She's out of surgery and doing fine, but she's going to lose her job for consorting with a felon. Dwight swears he'll make it up to her, beginning with finding and killing Waltrip. But Stacy knows the score: Waltrip's secret fortune means he's probably booked it down to Mexico already. Dwight will never get his hands on him now. She then tells Dwight that the ATF is holding Waltrip's laptop and so has access to his funds. Not wise, Stacy.\n\nStacy was wrong about Waltrip, of course. The guy's too much of an egomaniac to go bum it in Mexico, leaving Dwight to carve out his Tulsa kingdom unchallenged. No, if Waltrip's going down, he's dragging Dwight down with him. At a Black Macadam cabal, he drunkenly waxes poetic about his archenemy: \"A parasite doth feed upon its host. And ours? Ours will not stop until we cut him out with a f****** broadsword.\"\n\nWhen an upstart biker warns that it's too dangerous to go after Dwight with the ATF and FBI on their tails, Waltrip (Ritchie Coster) shoots him dead. The guy's only tack is to rule by fear. He's the antithesis of Dwight, and his mania is what you get when you take Chickie's aggressive ineptitude to its logical extreme.\n\nChickie's Defeat\n\nOver on Team Dwight, Manny bares his soul. Chickie, Vinny and Goodie have just arrived in T-town, and Dwight suggests Manny lay low. But Manny refuses to run again. Remember, Manny is a changed man. He won't abide intimidation from Chickie — or from a lousy neighbor and his unruly dog. (Manny's transformation from wimp to bruiser in Episode 4 played like a mini Coen Brothers movie, and it remains this viewer's favorite episode of the season.)\n\nDwight, Manny and Tyson (Jay Will) confront Chickie's crew at a rooftop pool, and The General does not mince words: \"You sent me out here to basically die. Exile,\" he tells Chickie. \"The point is, we're done. So I want you to pack your s***, get on a plane and stay the f*** out of my town.\" Dwight declares that his time in the Invernizzi family is over, and he invites Goodie (Chris Caldovino) to join his cause. Goodie, predictably, does a heel-turn and leaves with Dwight. Cue the fist pumps.\n\nHow to Steal $8 Million\n\nAfter washing his hands of Chickie, Dwight delivers a rousing speech to the crew at the Bred-2-Buck to strengthen their resolve before the impending war with Black Macadam. He tells the gang that there are two choices when life gets tough: Give up in fear, or barrel through and come out the other side stronger. In order to beat Waltrip, they must \"cover each other's backs and become part of each other's family,\" Dwight says. \"We do that, I swear to you, we're gonna put this fire out once and for all.\"\n\nStep one? The long-awaited theft of Waltrip's hidden money. Bodhi hacks into Waltrip's laptop remotely and transfers the entirety of the $8 million out of Waltrip's account. We cut to the ATF Office, where a lowly agent is shocked to see Waltrip's account balance hit 0. Then we get some very satisfying shots of Waltrip yelling (grunting? baying like an animal?) when he sees his account's been drained. Finally, we see that Dwight has sent Stacy a get-well-soon flash drive. She plugs it into her laptop, opening a bank account containing $1 million. Quite the care package.\n\nBefore the big showdown with Black Macadam, we get some touching, invigorating ra-ra moments from Tyson and Mitch. Dwight offers Tyson a way out (again), but the kid credits Dwight with helping him become self-reliant. \"That's the way to live your life: Stand up for what you believe in. Take what you want. You look after your friends,\" he tells Dwight. \"You showed me that, man.\"\n\nFor his part, Mitch (Garrett Hedlund) has a newfound sense of purpose and an appreciation for what a solid friendship can do for your mental — and it's all thanks to Dwight. \"One day this fella who looks like he stepped out of some mob movie walks into my joint. Can't say what exactly, but something told me this man was going to change my life.\"\n\nBlack Macadam vs. Team Dwight: Round 2\n\nAt long last, Black Macadam and Team Dwight come head-to-head. The crew is nervously shooting pool and playing cards at the Bred-2-Buck when they hear Macadam's motorcycles pull up outside. They kill the lights, grab their weapons and run to their stations behind the bar. Macadam advances slowly as Phil Collins' \"In the Air Tonight\" takes over the soundtrack. It's throwback, slightly gauche, totally awesome and exactly what you'd hope for in this show.\n\nThe shootout begins when Waltrip's crew steps over the tripwire Team Dwight has cleverly set up, triggering a round of bullets from unmanned guns. Our hidden heroes then pop out from under the bar like Whac-a-Mole, guns blazing. At one point, secret weapon Grace (McKenna Quigley Harrington) covers Dwight's back and blows away two bikers. She's definitely the MVP of the battle.\n\nWhen Tyson is hit, Dwight goes berserk. Waltrip is the last man standing in the Macadam camp, and The General clobbers him. (No one throws an on-screen punch quite like Stallone!) \"Do you still think I overplayed my hand?\" he asks Waltrip as he shoves his head through a wall-mounted buffalo horn. Disgusting way to go. When Waltrip is finished, the gang stands silently in the aftermath of the battle. They all live to tell the tale.\n\nA Royal Betrayal\n\nAfter the shootout, we fast-forward to three months later. Tina (Tatiana Zappardino) and her sons are visiting Dwight in Tulsa. They watch as the boys take Pilot for a spin at Fennario Ranch. Dwight finally tries his hand, mounting Pilot for the first time — and looking like he actually enjoys it. He's an Okie and proud of it.\n\nOver at the ATF Office (a.k.a. bureaucratic hell) Agent Hendricks and a supervisor reprimand Stacy for flagrant violations of protocol, then offer her job back on \"one condition.\" Yikes...\n\nIt's all fun and games before Stacy's betrayal comes to light. The Bred-2-Buck has returned to its former glory. (No casino yet, but at least the bullet holes are gone.) The entirety of Team Dwight is there for the reopening. Mitch is onstage singing \"Ramblin' Man,\" followed by \"Never Been to Spain,\" which he dedicates to Dwight. It's a fabulous use of Garrett Hedlund's country music chops. (By the way, Hedlund's new song \"Tulsa Night\" is out now.)\n\nDwight is dancing with Tina when Security Guard Fred (yes, that's how the character's name is listed in the credits), played by Justin Garcia-Pruneda, tells him there's a woman out front for him. He walks outside to find Stacy waiting there, looking like a million bucks. The cops immediately pull up and Stacy whispers to Dwight that she's sorry. Agent Hendricks arrests him for attempting to bribe Stacy. (Hendricks is holding the flash drive to the million-dollar bank account Dwight gifted her.) Tina runs outside, devastated, and the season ends with Dwight cruising through Tulsa in the back of a cop car.\n\nOof. Tough look for our guy Dwight. He tried to reform, but, alas, the thug life chose him. All jokes aside, it makes sense thematically that Dwight wouldn't last a season without another run-in with the law. Think about it like this: The show is a Western-gangster crossover dramedy. In the Western genre, going back to John Ford movies, the outlaw is bad for civilization. He upsets the social order of a Western town and ends up riding off into the sunset — if he can survive long enough to get outta Dodge, that is.\n\nSimilarly, in gangster movies, the mob man can't break the vicious cycle of criminality. Part of that is due to the fact that he may not be able to make a living on the straight and narrow. And part of it is because the mob is family-based, so the pressure to remain loyal to your blood relatives overtakes any sense of reason or decency. Al Pacino's Michael Corleone in The Godfather is the clearest example of this vicious cycle perpetuated through multiple generations of a family.\n\nOverall, Tulsa King has been a strange but successful exercise in genre-blending, teasing out the most interesting shades that both unite and divide Westerns and gangster pics. Besides, it's pretty awesome to see Stallone push the envelope and try something new in his seventies. And he'll get to do it again: Tulsa King has been renewed for a second season.\n\nQuestions and Predictions for Season 2\n\nWe never learned whether Pete, Chickie or both put a hit out on Dwight while he was in prison. Manny told Dwight that Pete ordered the killing, but this episode clarifies that Manny left New York (and abandoned the Invernizzi crime family) in 1998. Would Manny really know the truth of the matter, given that he left the game so soon after Dwight's arrest?\n\nChickie is still at large, and if Domenick Lombardozzi returns for Season 2, something tells me the touchy Invernizzi patriarch will not be happy with Dwight's newfound freedom.\n\nBefore Dwight goes tearing up Tulsa next season, the charges against him must be dropped. But how? The evidence is there; the ATF has the flash drive used to bribe Stacy. I suppose Dwight could cut a deal and become an ATF or FBI informant. But who would he rat out? Chickie? Alas, he doesn't have anything solid on the guy.\n\nDoes the ATF/FBI know that Dwight stole Waltrip's money? Bodhi is a seasoned hacker, so I'm guessing there's no digital footprint of the virtual robbery. But where does the ATF think Waltrip's millions went, and where do they assume Dwight got the $1 million bribe in the first place? If they assume he stole it from Waltrip's pot, they could get a warrant to search all his associates' homes and businesses. (Fingers crossed that Bodhi still keeps his bad-guy flash drives in top-secret wall compartments.)\n\nNow that Dwight's been arrested for bribery, his businesses (and business partners) are vulnerable. The Higher Plane is safe; Dwight's name isn't anywhere on Bodhi's business. But what about the Bred-2-Buck? Is Dwight a partner on paper? And what about the millions of dollars Bodhi is funneling into the casino? It's stolen money, so we can only hope it's untraceable.\n\nAfter Stacy's betrayal, Dwight may feel free to heat things up with Margaret. Her ex-husband Brian could pose a serious threat to Dwight's romantic hopes and business prospects.\n\nFinally, will anyone find out that Chickie ASSAULTED EMORY and MURDERED HIS FATHER?! We can't go another episode without these bombshells seeing the light of day.\n\nWhen Will Tulsa King Season 2 Premiere?\n\nThere's no word yet on when Tulsa King will return for its planned second season. Judging from other Sheridan shows like the Paramount+ crime drama Mayor of Kingstown, we can probably expect Season 2 to drop in about a year's time, in early 2024.\n\nIn the meantime, you can catch the stars of T-town in a bunch of exciting new projects this year. Sylvester Stallone will appear in Guardians of the Galaxy Vol. 3 and The Expendables 4. Garrett Hedlund will star opposite Star Wars alum Daisy Ridley in revenge thriller The Marsh King's Daughter. Finally, if you find yourself missing some of that Caolan Waltrip lilt, you can watch Ritchie Coster in the upcoming cage-fighting drama Rumble Through the Dark.\n\nUntil Season 2, Salut!\n\nThe entire first season of Tulsa King is now streaming on Paramount+."
    }
]