[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAzL2Jhbmstd2F0Y2hkb2dzLWV5ZS1wb3NzaWJsZS1yaXBwbGUtZWZmZWN0cy1mcm9tLWJlbmtvLXMtdHJvdWJsZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "European Bank Watchdogs Eye Possible Ripple Effects From Benko's Troubles - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAzL2Jhbmstd2F0Y2hkb2dzLWV5ZS1wb3NzaWJsZS1yaXBwbGUtZWZmZWN0cy1mcm9tLWJlbmtvLXMtdHJvdWJsZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "European Bank Watchdogs Eye Possible Ripple Effects From Benko's Troubles - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAzL2Jhbmstd2F0Y2hkb2dzLWV5ZS1wb3NzaWJsZS1yaXBwbGUtZWZmZWN0cy1mcm9tLWJlbmtvLXMtdHJvdWJsZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "European Bank Watchdogs Eye Possible Ripple Effects From Benko's Troubles - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LmxlZGdlcmluc2lnaHRzLmNvbS9nZW9yZ2lhLWNlbnRyYWwtYmFuay1yaXBwbGUtY2JkYy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Georgia central bank names Ripple as CBDC technology partner - Ledger Insights",
        "content": "Yesterday the National Bank of Georgia announced that it selected Ripple as its technology partner for its central bank digital currency (CBDC) pilot.\n\n“The committee selected Ripple due to its technical excellence and the expertise of its team,” said Natia Turnava, Acting Governor of the NBG.\n\nEach country has different motivations for pursuing CBDC projects such as financial inclusion. However, that’s not a key driver for Georgia’s Digital GEL. On multiple occasions the National Bank has highlighted its interest in exploiting modern technologies. Hence, it’s particularly interested in the programmability aspect.\n\n“Creating a platform with smart contract and programmable token capabilities will encourage banks and fintech companies to introduce innovations in the financial sector,” the central bank previously stated.\n\nThe interesting point is that XRP Ledger has never natively supported smart contracts as it pre-dates Ethereum. Its focus has always been on pure payments.\n\nHowever, there’s a bleeding edge sidechain that supports Ethereum-compatible smart contracts and links to the XRP Ledger with a bridge. It is being developed by Peersyst and funded by Ripple but is yet to launch.\n\nMeanwhile, the other contenders for the Georgia project were:\n\nAUGENTIC\n\nBitt\n\nBroxus Holdings\n\nCurrency Network\n\nDCM Corp\n\neCurrency Mint\n\nFARI Solutions\n\nSovereign Wallet Co.\n\nRipple has collaborated with five other central banks on CBDC projects. They included Bhutan, Palau, Montenegro, Colombia and Hong Kong. In the latter case, the Ripple pilot was one of a dozen use cases."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9hbm90aGVyLWh1Z2Utd2luLWZvci1yaXBwbGUteHJwLWFzLWdlb3JnaWFzLW5hdGlvbmFsLWJhbmstc2VsZWN0cy1pdC1mb3ItY2JkYy1waWxvdC1wcm9qZWN0L9IBeWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9hbm90aGVyLWh1Z2Utd2luLWZvci1yaXBwbGUteHJwLWFzLWdlb3JnaWFzLW5hdGlvbmFsLWJhbmstc2VsZWN0cy1pdC1mb3ItY2JkYy1waWxvdC1wcm9qZWN0Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Nov 2023 07:00:00 GMT",
        "title": "Another Huge Win for Ripple (XRP) as Georgia’s National Bank Selects it for CBDC Pilot Project - CryptoPotato",
        "content": "In a November 2 announcement, the National Bank of Georgia (NBG) revealed it had selected Ripple as its official technology partner for the Digital Lari (GEL) pilot project.\n\nThis partnership signifies a significant step forward in exploring blockchain technology and its applications in the realm of national digital currencies.\n\nRipple Selected as NBG’s Digital Lari Partner\n\nRipple emerged victorious in a rigorous selection process that involved nine shortlisted companies. These companies were carefully assessed for their capabilities to support the pilot project, and Ripple’s technical excellence and the expertise of its team ultimately secured its position as the technology partner of choice.\n\nIn NBG’s announcement, Natia Turnava expressed satisfaction with the selection, stating, “We were pleased to select Ripple as the official technology partner for our Digital Lari (GEL) pilot project following a thorough review of all shortlisted parties.”\n\nJames Wallis highlighted the innovative nature of the partnership as the NBG pioneers blockchain technology to digitize its economy, stating that Ripple’s CBDC Platform is set to drive transformative progress in public sector blockchain use. This collaboration demonstrates a commitment to innovation, efficiency, and the empowerment of entities through secure and transparent blockchain transactions.\n\nRipple’s CBDC Solution\n\nRipple’s CBDC solution, the Ripple CBDC Platform, is designed to provide a holistic end-to-end solution for central banks, financial institutions, and governments. It enables them to seamlessly mint, manage, transact, and redeem Central Bank Digital Currencies. Notably, this technology is powered by the XRP Ledger (XRPL), an energy-efficient and open-source blockchain.\n\nThe NBG’s choice of Ripple as the technology partner for its national digital currency pilot project was based on Ripple’s deep understanding of the project’s purposes and use cases, as well as its unwavering commitment to project success, sustainable business continuity, clear project development roadmap, and gradual deployment approach to use cases.\n\nAdditionally, NBG highlighted Ripple’s extensive experience conducting real-life pilot project deployments, ranging from primary CBDC digital infrastructure to smart contracts and tokenization.\n\nIn addition to its partnership with NBG, Ripple mentioned it is actively engaged in five pilot programs with governments and central banks in Bhutan, Palau, Montenegro, Colombia, and Hong Kong. Furthermore, discussions are underway with over 20 countries worldwide."
    }
]