[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vODAubHYvYXJ0aWNsZXMvYW4taW1wcmVzc2l2ZS11bnJlYWwtZW5naW5lLTUtcG93ZXJlZC1zeXN0ZW0tZm9yLWNyZWF0aW5nLXdhdGVyLXJpcHBsZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Impressive Unreal Engine 5-Powered System For Creating Water Ripples - 80.lv",
        "content": "Over the past few days, Technical Art Director Víctor Montero, a.k.a. VMonty, shared several great demos, showcasing an impressive Unreal Engine 5-powered system for creating digital water ripples. Using one render target and \"a compute shader that calculates a 2D wave equation that can be sampled into a surface shader,\" the system enables its creator to set up highly-realistic ripples and move them with the player's position."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDQvMDMvcmlwcGxlLW9kbC1wYXJ0bmVyLWxhdW5jaGVzLXNlcGEtcGF5bWVudHMtdG8tZXVyb3BlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Ripple ODL Partner Launches SEPA Payments to Europe - The Crypto Basic",
        "content": "Tranglo aims to facilitate lightning-fast cross-border payments in Europe with the recently-introduced payment solution.\n\nTranglo, a Ripple On-Demand Liquidity (ODL) partner and leading cross-border payments provider has announced the launch of an instant Single Euro Payments Area (SEPA) solution aimed at facilitating lightning-fast SEPA payouts to Europe.\n\nTranglo revealed the development in a recent press release. The move marked a significant European expansion for the firm and came as cross-border transactions have increased recently, with SEPA facilitating over 43 billion transactions annually.\n\n- Advertisement -\n\nPer the official press release, Tranglo’s latest offering was launched partly in response to the company’s anticipation of a substantial rise in cross-border settlements within the SEPA region in the coming months. This is further compounded by the increasing number of businesses and individuals who seek to avail themselves of real-time settlement services.\n\nSupported countries at launch include Belgium, Croatia, Finland, Germany, Greece, Hungary, the Netherlands, Portugal, Slovakia, Spain, Sweden, and the United Kingdom. However, the company plans to expand its coverage to more countries in the near future. Tranglo’s CEO, Jacky Lee, emphasized that introducing this service was fueled by the surging demand for real-time cross-border payments.\n\nThe instant SEPA payment solution is already operational and accessible 24/7, according to the press release. The company has urged all businesses and consumers within the supported countries to take advantage of this service, and it should be noted that any bank account used must have an IBAN.\n\nGiven the magnitude of the offering, the development was further highlighted by prominent crypto influencer Cryptic Poet in a recent tweet.\n\n- Advertisement -\n\nTranglo employs Ripple’s On-Demand Liquidity (ODL) solution to streamline cross-border payments, providing faster, more cost-effective, and dependable international transactions. This is achieved using XRP, Ripple’s native token, as a bridge asset. Tranglo added UAE as part of its Connect network last August."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZmluYm9sZC5jb20vcmlwcGxlLXYtc2VjLWNvdXJ0LWNhc2UtdXBkYXRlLWFzLW9mLWFwcmlsLTMtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Ripple v. SEC court case update as of April 3, 2023 - Finbold - Finance in Bold",
        "content": "As the courtroom battle between Ripple and the United States Securities and Exchange Commission (SEC) continues to grab the attention of the crypto community, as well as the world, a legal expert and amicus curiae for the blockchain company, John E. Deaton, shared an explanation of one of the most important legal terms referring to the case, as well as his views on the ruling deadline.\n\nIndeed, Deaton offered a detailed interpretation of securities and the ‘investment contract,’ which he called “one of the most misunderstood legal terms in the law,” and the Howey Test, “the most misapplied legal test or doctrine on social media,” as well as their connection to the current legal standoff as he stated in a Twitter thread published on April 2.\n\nOn securities and investment contracts\n\nAs he explained, sharing the definition of ‘security’ from the 1933 Securities Act, a “digital asset is not listed” and “software code is not listed,” also referring to the cases of the now-abandoned Telegram’s token GRAM, Kik Interactive’s token, as well as the decentralized video-sharing platform LBRY’s offerings of LBC to drive his point home.\n\nFurthermore, he said:\n\n“And the Supreme Court in the Howey case in 1946 defined what constitutes an investment contract. A digital asset or cryptocurrency (software code), STANDING ALONE, is NOT a security. It can be marketed, packaged, offered and/or sold as an investment contract aka a security.”\n\nAs he added, “when dealing with an investment contract, there hasn’t been a single case in U.S. history where the secondary sale of that asset was also found to be a security. NEVER.”\n\n“Every Altcoin arguably starts out as a security when it’s first distributed, ICO or not. When Satoshi was the only miner of Bitcoin (or one of a few) and had he offered 100K BTC for sale for $100K USD, it would have been an unregistered securities offering.”\n\nCourt ruling deadline\n\nEarlier, discussing the possibility that Judge Analisa Torres would make a summary judgment ruling soon, Deaton said that the deadline for her decision could range from hours to months and that, based on her earlier cases, two months following the Daubert/experts’ decision could be the waiting time, as he said in a tweet on March 31.\n\n“There is no deadline of today for her to rule. The decision could come out within the next hour, or it could take another 30-60 days. Based on previous cases, Judge Torres has issued her ruling on summary judgment within a couple of months of her Daubert/Experts’ decision.”\n\nConsidering that, as Finbold earlier reported, the Judge issued her ruling on both parties’ Daubert motions to preclude expert witnesses’ testimony on March 6, 2023, this means that the crypto sector could wait at least another month for the Ripple v. SEC lawsuit to end.\n\n‘Ripple’ effect of the case\n\nAs a reminder, pro-Ripple lawyers have voiced their opinion that the above decision could prove disastrous for the finance watchdog’s summary judgment motion, singling out the exclusion of one specific witness, who was supposed to testify on why people bought the XRP token, as ‘fatal’ to the SEC.\n\nMeanwhile, the outcome of the case is predicted to have a major impact on the price of XRP. The token recently displayed the opposite response to TV personality Jim Cramer seeming to voice a belief that the Securities and Exchange Commission would lose the lawsuit after all.\n\nAs things stand, XRP is currently changing hands at the price of $0.52, recording an increase of 0.28% on the day, as well as gaining 1515% over the previous week, adding up to the 36.69% advance on its monthly chart, as per data retrieved on April 3."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZmluYm9sZC5jb20vcmlwcGxlLXYtc2VjLWNvdXJ0LWNhc2UtdXBkYXRlLWFzLW9mLWFwcmlsLTMtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Ripple v. SEC court case update as of April 3, 2023 - Finbold - Finance in Bold",
        "content": "As the courtroom battle between Ripple and the United States Securities and Exchange Commission (SEC) continues to grab the attention of the crypto community, as well as the world, a legal expert and amicus curiae for the blockchain company, John E. Deaton, shared an explanation of one of the most important legal terms referring to the case, as well as his views on the ruling deadline.\n\nIndeed, Deaton offered a detailed interpretation of securities and the ‘investment contract,’ which he called “one of the most misunderstood legal terms in the law,” and the Howey Test, “the most misapplied legal test or doctrine on social media,” as well as their connection to the current legal standoff as he stated in a Twitter thread published on April 2.\n\nOn securities and investment contracts\n\nAs he explained, sharing the definition of ‘security’ from the 1933 Securities Act, a “digital asset is not listed” and “software code is not listed,” also referring to the cases of the now-abandoned Telegram’s token GRAM, Kik Interactive’s token, as well as the decentralized video-sharing platform LBRY’s offerings of LBC to drive his point home.\n\nFurthermore, he said:\n\n“And the Supreme Court in the Howey case in 1946 defined what constitutes an investment contract. A digital asset or cryptocurrency (software code), STANDING ALONE, is NOT a security. It can be marketed, packaged, offered and/or sold as an investment contract aka a security.”\n\nAs he added, “when dealing with an investment contract, there hasn’t been a single case in U.S. history where the secondary sale of that asset was also found to be a security. NEVER.”\n\n“Every Altcoin arguably starts out as a security when it’s first distributed, ICO or not. When Satoshi was the only miner of Bitcoin (or one of a few) and had he offered 100K BTC for sale for $100K USD, it would have been an unregistered securities offering.”\n\nCourt ruling deadline\n\nEarlier, discussing the possibility that Judge Analisa Torres would make a summary judgment ruling soon, Deaton said that the deadline for her decision could range from hours to months and that, based on her earlier cases, two months following the Daubert/experts’ decision could be the waiting time, as he said in a tweet on March 31.\n\n“There is no deadline of today for her to rule. The decision could come out within the next hour, or it could take another 30-60 days. Based on previous cases, Judge Torres has issued her ruling on summary judgment within a couple of months of her Daubert/Experts’ decision.”\n\nConsidering that, as Finbold earlier reported, the Judge issued her ruling on both parties’ Daubert motions to preclude expert witnesses’ testimony on March 6, 2023, this means that the crypto sector could wait at least another month for the Ripple v. SEC lawsuit to end.\n\n‘Ripple’ effect of the case\n\nAs a reminder, pro-Ripple lawyers have voiced their opinion that the above decision could prove disastrous for the finance watchdog’s summary judgment motion, singling out the exclusion of one specific witness, who was supposed to testify on why people bought the XRP token, as ‘fatal’ to the SEC.\n\nMeanwhile, the outcome of the case is predicted to have a major impact on the price of XRP. The token recently displayed the opposite response to TV personality Jim Cramer seeming to voice a belief that the Securities and Exchange Commission would lose the lawsuit after all.\n\nAs things stand, XRP is currently changing hands at the price of $0.52, recording an increase of 0.28% on the day, as well as gaining 1515% over the previous week, adding up to the 36.69% advance on its monthly chart, as per data retrieved on April 3."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vaW5zaWRlYml0Y29pbnMuY29tL25ld3MvaGVyZXMtd2hlbi10aGUtcmlwcGxlLXYtc2VjLWxhd3N1aXQtbWF5LWVuZC11cGRhdGVzLWZyb20tcHJvLXhycC1sYXd5ZXItam9obi1kZWF0b27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Here's when the Ripple v SEC Lawsuit May End, Updates From Pro-XRP Lawyer John Deaton - Inside Bitcoins",
        "content": "Don’t invest unless prepared to lose all the money you invest. This is a high-risk investment, you shouldn’t expect to be protected if something goes wrong.\n\nJoin Our Telegram channel to stay up to date on breaking news coverage\n\nCryptocurrency lawyer and XRP supporter John Deaton has given updates on when Ripple’s legal battle with the United States Securities and Exchange Commission (SEC) could end. The case started in late 2020 when the agency sued Ripple on allegations of selling XRP as an unregistered security.\n\nCould we see a #SECvRipple ruling soon? or may be later…https://t.co/RpR7GI5B2x — ErmoFi (@ErmofiNews) April 3, 2023\n\nPro-XRP Lawyer Updates Investors on When Ripple Lawsuit May End, Says Insiders Won’t Have Prior Knowledge\n\nIn a recent Twitter post to his 257,000 Twitter followers, Deaton said he believed the Judge in charge of the case, Analisa Torres, is not time bound to rule on the case. The comment came after community members questioned whether Judge Torres merited for the “naughty list” if she failed to issue a ruling on March 31.\n\nIn his response, Deaton noted the huge misunderstanding among community members. He clarified that “only motions that have been pending more than 6 months must be reported on a list to Congress. The 6-month list does not apply to Judge Torres’ summary judgment ruling because the motion has been pending for a little over 3 months.”\n\nThere is no deadline of today for her to rule. The decision could come out within the next hour or it could take another 30-60 days. Based on previous cases, Judge Torres has issued her ruling on summary judgment within a couple months of her Daubert/Experts’ decision. — John E Deaton (@JohnEDeaton1) March 31, 2023\n\nDeaton went on to explain that the final proofreading could be ongoing or that the Judge could be in the proofreading stage. In Deaton’s opinion, the delay comes as the stakes are high. Notably, the ruling could shape the entire blockchain and crypto landscapes in the U.S. for five years or longer.\n\n99.9% of all Court rulings don’t have the importance and significance this decision may prove to have. Not very often does a Judge’s decision impact not only the U.S. but the world. International holders have been held, hostage. 17 amicus briefs at the district court level.\n\nDeaton, representing XRP holders as amicus curiae in the Ripple v SEC case, also noted that there would not be any insider knowledge of the case’s final outcome. Only Judge Torres and her team will know what the ruling is before the public does.\n\nI see comments about “insiders” and whether @Ripple and the SEC will learn before hand. The only people who will know before the Judge publicly issues her ruling is her staff and any clerks who helped her with research or helped ✍️ the decision. https://t.co/EjcK25BRMc — John E Deaton (@JohnEDeaton1) March 31, 2023\n\nRipple CEO Garlinghouse, “Case Outcome Will Be Pivotal To The Industry”\n\nIn an interview last month, Ripple CEO Brad Garlinghouse highlighted that the lawsuit had ramifications on the entire cryptocurrency industry. This meant that the case outcome would be “pivotal” to the industry, determining how things would happen moving forward.\n\nIn his opinion, the SEC bringing the case against Ripple was not just about Ripple or XRP but the whole industry.\n\nThe SEC is kind of playing offense and attacking the whole industry. When it started two and a half years ago, I am not sure everyone fully digested that. And now that is widely understood.\n\nGarlinghouse also questioned how the SEC is going about regulating the U.S. crypto industry, calling it “unhealthy.” In his words, “The macro headline for me is this is not a healthy way to regulate an industry. Regulation through enforcement as opposed to what we are seeing in other countries where they are doing the work – they are codifying, they are creating a framework that allows an industry to grow while protecting consumers.”\n\nFurther, he noted that the regulatory uncertainty in the U.S. will and is negatively impacting the largest economy in the world. An excerpt from the interview reads, “Look at the benefits to the United States on a geopolitical basis to have the Amazons and Googles based and headquartered there. We are at, I think, severe risk of having that not happen in this next evolution of technology around blockchain and crypto. It has already started moving outside the United States.”\n\nNotably, consumers are also suffering because of that, as they do not have the same protections that the United States regulatory frameworks can provide.\n\nRipple Bulls Grow Impatient\n\nRipple bulls have grown tired of waiting. Now, the rally that began mid-March amid expectations of a ruling at the end of the month has started subsiding.\n\nAt the time of writing, XRP is auctioning for $0.51, down almost 0.5% in the last 24 hours. The remittance token is also down 5% since its peak price of $0.54 recorded on March 29. Nevertheless, Deaton says XRP is like a cockroach, the most resilient coin.\n\nHave people noticed the #XRP coverage at @CoinDesk lately? Call it the Banker’s Coin – call it a shitcoin – call it a security – call it whatever you want – but no Coin has been more resilient. Let me use lingo #BTC Maxi’s will enjoy: XRP is a🪳- even a nuclear war won’t kill it. https://t.co/wsJuRgiLHJ — John E Deaton (@JohnEDeaton1) April 2, 2023\n\nNoteworthy, XRP has been called a ‘banker’s coin’, ‘shitcoin’ or security. Irrespective of all the name-calling, it has maintained stronger resilience than most cryptocurrencies. In Deaton’s words, “[XRP is] hardy, resilient, and not easy to get rid of. It is imperative to note that the most recent bull run for XRP has been driven by most South Korean exchanges.\n\nRelated:"
    }
]