[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbmdhcGUuY29tL3hycC1sYXdzdWl0LXJpcHBsZS1sZWdhbC1jaGllZi11cy1zZWMtc2V0dGxlbWVudC_SAUpodHRwczovL2NvaW5nYXBlLmNvbS94cnAtbGF3c3VpdC1yaXBwbGUtbGVnYWwtY2hpZWYtdXMtc2VjLXNldHRsZW1lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "XRP Lawsuit: Ripple Legal Chief Reveals US SEC Settlement Offer - CoinGape",
        "content": "Ripple legal chief officer Stuart Alderoty revealed the settlement offer from the US Securities and Exchanges Commission (SEC) prior to the December 2020 lawsuit the agency filed.\n\nAlso Read: US SEC Reportedly Held Calls with Spot Bitcoin ETF Filers\n\nadvertisement\n\nXRP As A Security\n\nOn December 22, 2020, the SEC charged Ripple, its co-founder Christian Larsen and chief executive officer Bradley Garlinghouse with raising more than $1.3 billion through an unregistered, ongoing digital asset securities offering. Marking the completion of three years since the lawsuit was filed, Alderoty recalled the terms of a settlement offer the Commission offered prior to filing the case. He said,\n\n“Before the SEC sued Ripple, Chris and Brad (3 years ago today) they offered us the following settlement: the SEC would announce to the market that XRP is a security and the market would be given a short window to “come into compliance.””\n\nInterestingly, the SEC wanted Ripple to agree and publicly announce that XRP was a security asset, along with providing a small window of opportunity for crypto compliance to become compliant. While the crypto businesses in the United States have long argued that the existing securities laws are not suited for the nature of crypto assets, the SEC showed little efforts towards bringing a crypto-specific regulatory framework.\n\nOn the other side, the SEC’s settlement condition for XRP being a security proved to be wrong before the court, with judge Analisa Torres ruling in the July 2023 Summary Judgment that XRP was indeed not a security when it comes to retail buying. Earlier, CoinGape reported that the SEC dropped charges levied against CEO Garlinghouse and Larsen.\n\nRipple Legal Chief: SEC Never Built Crypto Compliance\n\nALderoty explained that the SEC never came up with guidelines for crypto compliance. Amid heavy criticism and companies moving offshore, the US markets regulator failed to build compliance for the industry three years after filing the XRP lawsuit. Instead, the agency took the enforcement-first approach, which involved legal attacks against top crypto exchanges Coinbase and Binance.\n\nAlso Read: Ripple CEO Calls Gary Gensler ‘Political Liability’ Over Call For Crypto Compliance"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NlYy1vZmZlcmVkLXRvLWFubm91bmNlLXhycC1pcy1hLXNlY3VyaXR5LXRocmVlLXllYXJzLWFnby1yaXBwbGUtY2xvLXNwaWxscy10aGUtdHJ1dGgtMjAyMzEyMjMwNjE50gGVAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3NlYy1vZmZlcmVkLXRvLWFubm91bmNlLXhycC1pcy1hLXNlY3VyaXR5LXRocmVlLXllYXJzLWFnby1yaXBwbGUtY2xvLXNwaWxscy10aGUtdHJ1dGgtMjAyMzEyMjMwNjE5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "SEC offered to announce XRP is a security, three years ago: Ripple CLO drops truth bomb - FXStreet",
        "content": "Ripple was offered a settlement by the US SEC three years ago on December 23, according to CLO Stuart Alderoty.\n\nThe SEC would announce to the market that XRP is a security and the market would be given a short window to “come into compliance.”\n\nRipple turned down the SEC’s offer and argued that XRP is not a security.\n\nRipple has been embroiled in a legal battle with the US Securities and Exchange Commission (SEC) since 2020. Reflecting on the SEC’s offer to Ripple, Chief Legal Officer (CLO) Stuart Alderoty, said that the payment remittance firm refused the settlement offered by the regulator.\n\nXRP on-chain metrics indicate likelihood of correction in the altcoin.\n\nAlso read: XRP Price Annual Forecast: Upbeat outlook for 2024 hinges on SEC lawsuit ruling, potential Ripple IPO\n\nRipple CLO drops details of SEC settlement offer from 2020\n\nAlderoty shared details of the US financial regulator’s settlement offer to the payment remittance firm in 2020. The Ripple CEO said that prior to filing the lawsuit, the SEC offered to announce to the market that XRP is a security and give market participants a short window to “come into compliance.”\n\nRipple refused the offer for two reasons, first being XRP is not a security and second that the SEC never built a framework for crypto compliance. Alderoty argues that irrespective of the spin put on the lawsuit by former SEC officials, Ripple wanted to prove a point that XRP is not in and of itself a security.\n\nBefore the SEC sued Ripple, Chris and Brad (3 yrs ago today) they offered us the following settlement: the SEC would announce to the market that XRP is a security and the market would be given a short window to “come into compliance.” We said no because: (1) XRP is not a… — Stuart Alderoty (@s_alderoty) December 22, 2023\n\nXRP on-chain metrics reveal bearish outlook on altcoin\n\nXRP price is likely headed towards a correction, according to altcoin's on-chain metrics. Ripple whales holding between 10 million and 100 million XRP tokens added another 360 million XRP to their holdings in the past week.\n\nXRP holdings of whale wallets between 10 million and 100 million. Source: Santiment\n\nThe addition of $223 million in XRP to whale holdings is not typically bearish. However, when combined with profit-taking activities recorded by the Network Realized Profit/Loss metric, it is evident that large wallet investors are realizing gains in XRP.\n\nXRP whale transaction count and Network Realized Profit/Loss. Source: Santiment\n\nThe increase in XRP holdings of whales is therefore likely to drive the altcoin’s price lower, amidst rising selling pressure on the asset.\n\nAt the time of writing, XRP price is $0.6149 on Binance."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTIvMjMvcmlwcGxlLWNsby1yZXZlYWxzLXNlYy1wcmUtbGF3c3VpdC1zZXR0bGVtZW50LW9mZmVyLW9uLXhycC1zZWN1cml0eS1zdGF0dXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ripple CLO Reveals SEC Pre-lawsuit Settlement Offer on XRP Security Status - The Crypto Basic",
        "content": "Ripple CLO Stuart Alderoty has taken to the X (formerly Twitter) platform to reveal the settlement offer made by the SEC before it officially filed its lawsuit against the blockchain-powered payment company.\n\nAccording to Alderoty, part of the SEC’s settlement offer before the lawsuit was officially filed required the regulator to announce that XRP is a security. In addition, the SEC also offered a small window for the market to “come into compliance” with existing securities laws.\n\nNotably, Alderoty disclosed that Ripple rejected the settlement offer because it was confident that XRP was not a security and that there was no established framework for crypto compliance at the time.\n\nBefore the SEC sued Ripple, Chris and Brad (3 yrs ago today) they offered us the following settlement: the SEC would announce to the market that XRP is a security and the market would be given a short window to “come into compliance.” We said no because: (1) XRP is not a… — Stuart Alderoty (@s_alderoty) December 22, 2023\n\n- Advertisement -\n\nWith Ripple rejecting the offer, the regulator officially charged Ripple with violating securities law on December 22, 2020.\n\nSEC Vs Ripple Case Now 3 Years Old\n\nThe SEC alleged that Ripple and two of its execs offered and sold XRP as an unregistered security. It has been three years since the SEC officially sued Ripple.\n\nHowever, several developments have emerged in the legal battle, including the highly-anticipated summary judgment released on July 13. As reported earlier, U.S. District Judge Analisa Torres ruled that XRP is not, in and of itself, a security.\n\n- Advertisement -\n\n“No matter the spin that Clayton, Hinman, Gensler or anyone else puts on this case now, it was always about one thing – – proving that XRP is not, in and of itself, a security,” Alderoty said.\n\nIn addition, the prominent legal expert said Ripple put everything on the line and engaged the SEC in an intense legal tussle. He stressed that Ripple won the lawsuit even though only a few believed the company would succeed.\n\nJudge Highlights SEC Hypocrisy\n\nFurthermore, Alderoty noted that Ripple successfully exposed the SEC’s hypocrisy and tyranny during the lawsuit. Last year, Magistrate Sarah Netburn, one of the judges presiding over the case, pointed out the SEC’s hypocrisy and inconsistent arguments.\n\nThe judge bashed the regulator for “adopting its litigation position to further its desired goal and not out of faithful allegiance to the law.”\n\nPotential Next Outcome\n\nIt is unclear whether the Ripple lawsuit will end in a settlement. The securities regulator has yet to publicly make any settlement offer to put an end to the multi-year legal tussle.\n\nThe lawsuit is currently in the remedies stage, as the court seeks to determine the appropriate penalty Ripple could pay for violating the law. Once the remedies phase is concluded, the court will issue its final judgment.\n\nAfter the final judgment is released, the SEC would decide whether to appeal the summary judgment decision at the Second Circuit or agree to settle with Ripple."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8venljcnlwdG8uY29tL3JpcHBsZS1jdG8tbWFrZXMtNS1ib2xkLXByZWRpY3Rpb25zLWZvci1ibG9ja2NoYWluLWluLTIwMjQteHJwLW1hc3NpdmUtYWRvcHRpb24taW4tdGhlLW9mZmluZy_SAXdodHRwczovL3p5Y3J5cHRvLmNvbS9yaXBwbGUtY3RvLW1ha2VzLTUtYm9sZC1wcmVkaWN0aW9ucy1mb3ItYmxvY2tjaGFpbi1pbi0yMDI0LXhycC1tYXNzaXZlLWFkb3B0aW9uLWluLXRoZS1vZmZpbmcvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ripple CTO Makes 5 Bold Predictions for Blockchain In 2024 — XRP Massive Adoption In The Offing - ZyCrypto",
        "content": "Advertisement\n\nRipple’s Chief Technology Officer (CTO), David Schwartz, has outlined five bold predictions for the landscape of blockchain technology in 2024.\n\nHis insights, shared on Wednesday on Ripple’s X page, spanned various dimensions of the blockchain ecosystem, pointing towards groundbreaking advancements to propel the technology into widespread acceptance. Notably, Schwartz emphasized the pivotal role of the XRP Ledger (XRPL), suggesting it could be instrumental in driving mainstream adoption.\n\nOne of Schwartz’s predictions revolved around the transformative convergence of artificial intelligence (AI) and blockchain by 2024. The pundit envisioned AI playing a critical role in reshaping cybersecurity and financial services.\n\nFurthermore, Schwartz highlighted the significance of AI chatbots on the XRPL, foreseeing these intelligent tools simplifying development processes, fostering global innovation, and promoting financial inclusion.\n\n“AI, pivotal in ensuring blockchain security, will empower accurate market insights and automated trading,” he said.\n\nAdvertisement\n\nSecondly, Schwartz noted he anticipates a significant shift towards Real World Asset (RWA) tokenization, particularly in real estate and commodities. The XRPL is expected to lead the tokenization market, facilitating collateralized loans, attracting institutional adoption, and enhancing interoperability. According to him, this will position XRPL as a leading blockchain for reshaping the financial sector through these use cases.\n\nFurther, he predicted that Decentralized Identity (DID) will gain widespread acceptance, transforming privacy within the blockchain sphere. Schwartz envisioned increased institutional participation in decentralized exchanges (DEXes) leveraging DIDs, fostering growth and enhancing liquidity in decentralized finance. Notably, an upcoming amendment for XRPL dubbed “XLS-40” aims to integrate DID functionalities into the XRPL, marking a significant stride in privacy, security, and financial innovation.\n\nSchwartz also noted he foresees substantial progress in blockchain interoperability and smart contracts in 2024. He asserted that initiatives like the XRPL Cross-Chain Bridge Amendment will contribute to ‘break down silos’, creating a unified and efficient ecosystem. This progress is expected to act as a catalyst for innovation, giving rise to novel decentralized finance (DeFi) applications and driving mainstream adoption of blockchain technology.\n\nThe fifth prediction revolved around stablecoins reshaping the global finance landscape. Schwartz emphasized their potential to establish new foreign exchange corridors and reduce dependence on the US dollar. Notably, the Middle East is anticipated to lead in adopting stablecoins for regional trades. Schwartz suggested that standardizing blockchain integration by financial institutions will pave the way for stablecoins to become a universal tool, streamlining international transactions and unlocking new economic potential.\n\nShwartz’s predictions come just a day after Ripple’s President, Monica Long, shared her insights for 2024, emphasizing the need for the crypto industry to move beyond speculative hype cycles. Long envisioned a “crypto summer” marked by increased real-world utility, compliance-focused decentralized finance, and strategic collaborations between traditional financial giants and crypto-native companies."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZXMtY2xvLWV4cG9zZXMtc2Vjcy1oeXBvY3Jpc3ktdG9vay1hLWphYi1vbi1zZWNzLXByZS1zZXR0bGVtZW50LW9mZmVyLTMteWVhcnMtYWdvL9IBdmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZXMtY2xvLWV4cG9zZXMtc2Vjcy1oeXBvY3Jpc3ktdG9vay1hLWphYi1vbi1zZWNzLXByZS1zZXR0bGVtZW50LW9mZmVyLTMteWVhcnMtYWdvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Did the SEC Offer to Settle with Ripple? Stuart Alderoty Exposes Hypocrisy! - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nStory Highlights Ripple is in a legal dispute with the SEC over whether XRP is a security. Ripple believes it is not, and the SEC wants them to register it as one.\n\nRipple has had some recent legal victories, including a court ruling that XRP is not a security.\n\nThe final judgment in the case is still pending, but Ripple is confident that they will ultimately prevail.\n\nThe ongoing dispute between Ripple and the SEC has taken a new direction. Stuart Alderoty, Ripple’s Chief Legal Officer, recently spoke out against SEC officials, especially Gary Gensler, referencing a contentious proposal from three years ago.\n\nWhat did Alderoty have to say? And what can this mean for the market? Read on!\n\nRipple’s Stand: No Settlement with the SEC\n\nAlderoty shared that before filing a lawsuit against Ripple, the SEC had suggested a settlement. This would have required Ripple to recognize XRP as a security and adjust to current securities regulations within a short timeframe. However, Ripple declined, firmly believing that XRP wasn’t a security and pointing to unclear rules about cryptocurrencies.\n\nBefore the SEC sued Ripple, Chris and Brad (3 yrs ago today) they offered us the following settlement: the SEC would announce to the market that XRP is a security and the market would be given a short window to “come into compliance.” We said no because: (1) XRP is not a… — Stuart Alderoty (@s_alderoty) December 22, 2023\n\nAfter a three-year legal battle, Ripple had some positive outcomes this year. A key decision on July 13 confirmed that XRP isn’t a security. Alderoty stressed that this clarity on XRP’s status was their main goal all along.\n\nRead More: XRP Lawsuit Update: Will the SEC Pay Any Reimbursement for Losing Against Ripple?\n\nRipple Stands Strong\n\nAfter three years of rigorous fight with the SEC, Ripple received some favorable court rulings earlier this year, notably a summary judgment on July 13 affirming that XRP isn’t a security. Alderoty emphasized that proving XRP’s non-security status was always the primary objective.\n\nAdditionally, Alderoty underscored Ripple’s resilience in fighting the lawsuit, stating that despite skepticism, the company emerged victorious. He also pointed out how the SEC’s inconsistent arguments were exposed during the legal proceedings, notably highlighted by Magistrate Sarah Netburn’s critique of the SEC’s opportunistic stance to serve its goals rather than faithfully uphold the law.\n\nAnd the Battle Continues…\n\nThe final judgment is pending as the case moves into the remedies phase to determine Ripple’s penalty for alleged law violations. Following this, the SEC will decide whether to challenge the judgment at the Second Circuit or consider a settlement with Ripple, which remains uncertain. While Ripple’s case is unique and was a well-played legal battle, others may struggle to overcome the regulatory hurdles.\n\nSince the SEC is in not well placed to bring new rules, they believe Howey and will rely on the Supreme Court’s decision to tackle the security complexities. On a clear note, the SEC said that if a crypto asset is offered and sold as a security, it must undergo the disclosure process established by Congress.\n\nThis Might Interest You: From Ripple to Coinbase: Adv. Deaton’s Insights into 2024’s Biggest Crypto Cases"
    }
]