[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvcmlwcGxlLWNvbmZpcm1zLXhycC1vZGwtcGF5bWVudHMtYXJlLW5vdy1hdmFpbGFibGUtaW4taW5kaWHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Ripple Confirms XRP ODL Payments are Now Available in India - Watcher Guru",
        "content": "According to Ripple’s new Quick Guide, there has been confirmation that XRP on-demand liquidity (ODL) payments are available in India. Moreover, the guide states that blockchain technology companies’ payment solutions are available in “complex corridors like Brazil, Mexico, India, and Southeast Asia.”\n\nThe US-based company has consistently worked to provide optimal solutions for international financial transactions. Additionally, their RippleNet blockchain network has used that technology to offer fast, secure, and cost-cutting ways to transfer finances globally.\n\nSource: Kryptomoney\n\nXRP ODL Now Live in India\n\nThere are few companies in the blockchain industry as well-known as Ripple. Although the blockchain technology company is in the midst of a court battle with the US Securities and Exchange Commission (SEC), they have continued pioneering exceptional work in the global finance sector.\n\nSpecifically, the network known as RippelNet revolutionized global financial transfers. Now, that network has expanded, as Ripple has confirmed its XRP ODL is now available in India. Moreover, the tech companies’ newly released quick guide confirms the technology’s presence in the country.\n\nSource: PYMNTS.com\n\nThe Ripple-designed payment solutions are designed to offer “optimized liquidity for cross-border payments,” the guide stated. Additionally, it noted its presence in India, alongside Brazil, Mexico, and Southeast Asia. Thereafter, noting the global payments network utilization of XRP “as a neutral bridge for various fiat currency pairs.”\n\nIt has been reported that several Indian banks are utilizing the cross-border payments network. Specifically, Axis Bank, the country’s largest private sector bank, has partnered with Ripple. Additionally, Yes Bank, a similarly vital private sector bank, has also utilized Ripple technology."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbmdhcGUuY29tL3JpcHBsZS1tb3Zpbmctb3V0LW9mLXUtcy1hZnRlci1jb2luYmFzZS1jZW8tZHJvcHMtaGludC_SAVBodHRwczovL2NvaW5nYXBlLmNvbS9yaXBwbGUtbW92aW5nLW91dC1vZi11LXMtYWZ0ZXItY29pbmJhc2UtY2VvLWRyb3BzLWhpbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Ripple Moving Out Of U.S. After Coinbase CEO Drops Hint? - CoinGape",
        "content": "Ripple News: Crypto firms based in the United States are reportedly seeking to relocate due lack of market guidance provided by the financial regulators. Coinbase, the U.S. biggest crypto exchange’s executive recently tipped off moving offshore, however, several developments are hinting that Ripple Labs might also be considering leaving the U.S.\n\nAlso Read: Ex SEC Chief Warns Of More Crypto Lawsuits Ahead; Which Exchange Can Be Next?\n\nadvertisement\n\nRipple Consider To Move Offshore?\n\nRipple Labs and its executives are involved in the long running legal battle with the U.S SEC. It is expected that a verdict in the XRP lawsuit will lead the crypto industry toward regulatory clarity around crypto assets. Meanwhile, Ripple’s recent job postings have left the crypto community confused.\n\nAs per Ripple’s Career posting page, the firm is offering around 66 roles in the firm. It is important to note that 46 postings are offered outside the United States. Meanwhile, 6 of the open roles offered in the U.S. are several kinds of internships. However, Ripple CEO Brad Galinghouse have earlier stated that they will move outside if they lose the legal battle against the SEC.\n\nIt is expected that the recent job posting might be a part of Ripple’s expansion as Garlinghouse and the team seems to be much more confident of winning the crucial XRP case after recent court verdicts.\n\nAlso Read: LUNA Is Not A Security, Declares S.Korean Court; Will US SEC Follow?\n\nU.S. watchdogs, Securities and Exchange Commission (SEC) and Commodity Futures Trading Commission (CFTC) have recently picked up the pace by suing the crypto exchanges and lenders like Kraken, Bittrex and Gemini.\n\nHowever, Brian Armstrong, Coinbase CEO is reportedly considering moving its head offices offshore. He stated that anything is on the table while in conversation with the ex UK Chancellor of the Exchequer George Osborne."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZmluYm9sZC5jb20vcmlwcGxlLXYtc2VjLWNhc2UtdXBkYXRlLWFzLW9mLWFwcmlsLTI0LTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Ripple v. SEC case update as of April 24, 2023 - Finbold - Finance in Bold",
        "content": "As the cryptocurrency sector is still on the edge of its seat, waiting for the judge to pass the final decision in the widely publicized lawsuit between Ripple and the United States Securities and Exchange Commission (SEC), regulatory uncertainty has already started to affect the blockchain company’s business and its standing with the XRP community.\n\nIndeed, Ripple’s newest product, Liquidity Hub (LH), lacks support for XRP, causing outrage among part of the XRP community. However, the blockchain company’s General Counsel, Stuart Alderoty, explained it was “an enterprise (institutional) product, not retail” and that regulatory clarity was important to enterprise customers.\n\nHaving said that, Alderoty confirmed that, in the future, there might still be support for the cryptocurrency, stating that “we’re keen to support XRP in LH when we can provide a good customer experience.” Seemingly, the lawyer was hinting at the possibility of introducing XRP after the court decision in the Ripple v. SEC case brings more clarity into the sector.\n\nSo what is security?\n\nElsewhere, it has come to the public’s attention that the SEC has recently named six crypto assets as securities, including Dash (DASH), Algorand (ALGO), OMG Network (OMG), Monolith (TKN), NAGA (NGC), and IHT Real Estate Protocol (IHT), in a lawsuit against crypto exchange Bittrex (but not against the issuers), according to the SEC press release from April 17.\n\nSpecifically, the SEC alleges that these six digital assets listed on the crypto trading platform should be considered securities under US law because, as the agency claims, investors had “reasonable expectation of profits.” Commenting on the development, David Schwartz, the CTO at Ripple, said on Twitter that this “sounds like investment advice to me.”\n\nInterestingly, the SEC boss Gary Gensler still refuses to provide a clear answer to the repeatedly asked question of whether Ethereum (ETH) is a security, including during his recent testimony before the US House of Representatives Financial Services Committee, as Finbold reported on April 19.\n\nMeanwhile, XRP was at press time changing hands at the price of $0.46, down 1.92% on the day, as well as declining 11.18% across the previous seven days but still holding on to the 8.47% increase to its price in the last month, according to the latest chart data."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnVhbGJlcnRhLmNhL2dpdmluZy9naXZpbmctbmV3cy8yMDIzL2ktd2FudC10aGUtdGhpbmdzLWktZG8tdG8taGF2ZS1hbi1pbXBhY3QtdG8taGF2ZS1hLXJpcHBsZS1lZmZlY3QuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "“I want the things I do to have an impact - to have a ripple effect.” - University of Alberta",
        "content": "Neil Salsbury, Bachelor of Education, 2002, has always known that he is passionate about helping others. He grew up in a small town in rural Alberta, where community giving was a big part of the culture.\n\nHis mother was an avid volunteer and he remembers his father lending a hand to neighbours during the harvest season. “It was an unwritten thing. We looked after people.”\n\nThese days in his role as Division Manager at IG Wealth Management he helps his clients plan for their future and reach their financial goals. He is also a committed volunteer and philanthropist for the causes he cares about.\n\nOne of which is the Fyrefly Institute for Gender and Sexual Diversity (previously the Institute for Sexual Minority Studies and Services), a program run through the University of Alberta’s Faculty of Education.\n\n“When I saw the work that the university was doing in the community, I knew this is what is important to me. I can support this 24 hours a day.”\n\nAs a member of the community, Neil sees the need for 2SLGBTQ+ youth in Edmonton and rural Alberta to have access to support resources.\n\nThe Fyrefly Institute provides critical support programs and resources to 2SLGBTQ+ youth.\n\nNeil served on the board for several years and continues to help through volunteerism and fundraising.\n\nTheir most popular program is Camp Fyrefly, a place for youth across Alberta, Saskatchewan, and Ontario, to be themselves, feel supported and learn leadership skills.\n\nAnother large project is The CHEW Project, an outpost for homeless 2SLGBTQ+ youth. “To see children as young as eight years old just breaks my heart. This is a really great initiative.”\n\nAnd a program that Neil helped bring to fruition is Brite Line, a support line for 2SLGBTQ+ people of all ages, created in partnership with the Canadian Mental Health Association.\n\nNeil has also created the Salsbury Trust which will help support the causes he cares most about into the future. This includes a bequest to the Fyrefly Institute.\n\nIt’s important to him that the causes he cares about the most have the financial backing they need for years to come, ideally into perpetuity.\n\n“At the end of the day I want a legacy that continues to help my community,’’ says Neil. And he is passionate about supporting work that will effect long-term change. “I want things that will create positive social change. That’s what I’m here for.”"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3Lmd1cnUzZC5jb20vcmV2aWV3L3NlYXNvbmljLXZlcnRleC1neC0xMDAwLTEwMHctYXR4MzAtcHN1LXJldmlldy9wYWdlLTYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Seasonic Vertex GX-1000 - 1000W ATX 3.0 PSU review (Page 6) - guru3d.com",
        "content": "Load testing the PSU\n\nLoad Testing The PSU\n\nTesting a power supply is challenging; professional load testers need to check the PSU’s behavior correctly.\n\nThe first basic test is performed with a simple power supply tester. It doesn’t load the PSU with more than a couple of Watts but helps determine if the power supply unit is operational. There’s a self-check indicating if the voltages are at the proper levels. As you can see, there have been no issues with the Seasonic Vertex GX-1000W unit.\n\nThe following setup was used for the remainder of the testing:\n\nVoltcraft VC-870 Digital Multimeter - voltage measurement (+ Fluke 97 scope meter)\n\nOscilloscope - GW INSTEK GDS 3154\n\nDC load - original solution\n\nFluke 97 Scope meter (a measurement of voltage and ripple),\n\nVoltcraft SL-451 decibel meter (volume measurement)\n\nACUVIM-IIRF – for measuring active power (input from the socket).\n\nPCE Instruments PCE-DT 50 tachometer – for the measurement of the rotational speed of the fan.\n\nMeasurements are taken only using 230 V input voltage.\n\nEfficiency\n\nOur power supply reviews emulate real-world usage by creating loads that a power-hungry, multi-GPU setup with a powerful CPU would generate. Older components used to require more power, but there has been some press. In a typical configuration, reaching over 500-600 Watts of power draw is difficult. Checking efficiency is a relatively easy thing to accomplish. Let’s take a look at Seasonic Prime’s efficiency first.\n\nIt does look great even at low loads (e.g., 10%, equaling 100 W), which is quite typical of the idle state in modern PCs.\n\nMaximum load\n\nNext is the maximum wattage this unit can hold before switching off.\n\nMaximum Load Efficiency (in %) 1220 W 89.49%\n\nEfficiency looks excellent, even above 100% load. Watts is a great value, but you wouldn’t want to come close to that for very long.\n\nErP Lot 6 Power Off wattage\n\nWe looked at the powered-off status (ErP/EuP), productivity mode (when we stress the CPU), and gaming. The lower the wattage, the more efficient the PSU. It is that simple.\n\nErP Lot 6 Power Off value in Watts 1000 W 0.07\n\nThis is well below the 0.5 W requirement.\n\nRipple testing\n\nFirst up is the ATX12V V2.2 specification for DC output ripple:\n\nATX12V Ver 2.2 Noise/Ripple Tolerance Output Ripple (mV p-p) +3.3 V 50 +5 V 50 +12 V 120\n\nThe Seasonic Vertex GX-1000W achieved the following results:\n\nAC Ripple (mV p-p) +3.3 V +5 V +12 V 100 W (10%) 6 8 10 250 W (25%) 8 10 12 500 W (50%) 10 9 15 750 W (75%) 11 13 14 1000 W (100%) 12 15 18\n\nThe values are very well within tolerance. Even in the worst-case scenario (100% load), it is not even a quarter of the allowed number, so this is not worrying."
    }
]