[
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9pbnRlcmVzdGluZy1ydW1vci1nZXRzLXJpcHBsZS14cnAtdXNlcnMtZXhjaXRlZC1kZXRhaWxzL9IBVWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9pbnRlcmVzdGluZy1ydW1vci1nZXRzLXJpcHBsZS14cnAtdXNlcnMtZXhjaXRlZC1kZXRhaWxzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Cryptic Tweets from Major Exchange Get Ripple (XRP) Users Excited: Details - CryptoPotato",
        "content": "TL;DR\n\nGemini’s recent tweets about XRP led to widespread speculation among the cryptocurrency community.\n\nA cryptic riddle posted by the firm intensified the hypothesis, with many anticipating an XRP-related announcement.\n\nThe cryptocurrency exchange Gemini sparked a speculative frenzy after posting a series of tweets related to Ripple’s XRP.\n\nThe posts included phrases like “Don’t forget about xrp,” “xcited about xrp,” and xrriving shortly,” allowing the community to guess what move might be on the horizon.\n\nSome assumed that Gemini might introduce new services involving the cryptocurrency, while others suggested that the interaction on X could be a precursor for a spot XRP ETF filed with a European partner.\n\nRecall that the exchange recently received approval to operate as a Digital Asset Service Provider (DASP) in France. It also serves as a custodian for VanEck’s newly launched spot Bitcoin ETF.\n\nThe XRP army (a term indicating the group of supporters and investors of the coin) also noted that Gemini released similar cryptic posts in August last year – a month after Ripple secured its first partial court victory against the US SEC.\n\nShortly after, the exchange allowed customers to deposit XRP tokens on the platform. Other trading venues that re-listed the asset at that time were Kraken, Coinbase, Crypto.com, Bitstamp, and more.\n\nEarlier today (January 22), Gemini posted a riddle on X, depicting something that is “swift and small” in “the land of giants.”\n\nCan you solve this riddle? In the land of giants, I’m swift and small, when I run I don’t stall. Across borders, I freely roam, in markets near and far from home. What am I? The answer will be posted in 24 hours. — Gemini (@Gemini) January 22, 2024\n\nMost guesses once again pointed out to XRP, with Gemini promising to reveal the answer within 24 hours."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS94cnAtYmVhcnMtZXllLTAtNDgtYXMtdGhlLXdvcnMtbWlnaHQtbm90LWJlLW92ZXIteWV0LXJpcHBsZS1wcmljZS1hbmFseXNpcy_SAWhodHRwczovL2NyeXB0b3BvdGF0by5jb20veHJwLWJlYXJzLWV5ZS0wLTQ4LWFzLXRoZS13b3JzLW1pZ2h0LW5vdC1iZS1vdmVyLXlldC1yaXBwbGUtcHJpY2UtYW5hbHlzaXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "XRP Bears Eye $0.48 as the Wors Might Not be Over Yet: Ripple Price Analysis - CryptoPotato",
        "content": "The recent market movements have subjected Ripple’s price to increased selling pressure, precipitating a descent below the significant 100-day and 200-day moving averages and concluding a pullback.\n\nDespite this, indications point toward a sustained downward trajectory in the mid-term.\n\nXRP Analysis\n\nBy Shayan\n\nRipple Price Analysis: The Daily Chart\n\nA thorough examination of the daily chart unveils a notable decline in Ripple’s price, breaching its multi-month sideways consolidation range and successfully completing a pullback. Intensified selling pressure also led to the breaking of a substantial support zone, encompassing the 100 and 200-day moving averages, prompting concerns about Ripple’s mid-term direction.\n\nConsidering the prevailing price action and market conditions, the likelihood of the recent descent persisting is high, with the aim of breaching the significant multi-month support region at $0.48. A successful break below this critical range could potentially set Ripple on a prolonged downward trajectory, instigating fear and uncertainty in the market.\n\nThe 4-Hour Chart\n\nA closer analysis of the 4-hour chart reveals an impulsive breach below the lower boundary of the multi-week sideways wedge, underscoring the dominance of sellers in the market. However, the price has reached a pivotal support region determined by the multi-month ascending trendline.\n\nThis trendline has proven to be a robust support, halting multiple downward attempts. Presently, as the price intersects this crucial trendline and the static support zone at $0.52, there is a notable potential for a reversal, leading to a sideways consolidation phase.\n\nNonetheless, given the prevailing strength of sellers in the current market conditions, the possibility of a break below this crucial support region persists, potentially prolonging the ongoing downward trend. In such a scenario, the next critical support level for the price would be at $0.48."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1pbnZlc3RvcnMtYXdhaXQtc2VjLXYtY29pbmJhc2UtYW5kLXJpcHBsZS1jb3VydC1ydWxpbmdzLTE0MDM4ODTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "XRP News: Investors Await SEC v Coinbase and Ripple Court Rulings - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3Byb21pbmVudC1jcnlwdG8tbGF3eWVyLWNyaXRpY2l6ZXMtc2VjLW92ZXJyZWFjaC1pbi1yaXBwbGUtbGF3c3VpdC1hZHZvY2F0ZXMtZm9yLWZpbmFuY2lhbC1mcmVlZG9tL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Prominent crypto lawyer criticizes SEC overreach in Ripple lawsuit, advocates for financial freedom - CryptoSlate",
        "content": "John Deaton, a well-known crypto lawyer, said that regulatory actions against the crypto industry point to a significant government overreach and intrusion into the private sector.\n\nDeaton made the statement on social media on Jan. 22, where he specifically called out the actions of various federal agencies, including the SEC, FBI, EPA, and the Federal Reserve — likening their operations to an Orwellian ‘Big Brother’ scenario.\n\nHis comments reflect a growing sentiment within the cryptocurrency community about the balance between regulation and financial liberty.\n\nRipple lawsuit\n\nDeaton’s criticism was particularly pointed towards the SEC’s lawsuit against Ripple Labs Inc., CEO Brad Garlinghouse, and co-founder Chris Larsen. Initiated in December 2020, the lawsuit accused Ripple of conducting an unregistered securities offering through the sale of XRP.\n\nHe criticized the SEC’s broad classification of XRP tokens as illegal securities, suggesting it was an unconstitutional expansion of the watchdog’s authority. Deaton added that the dismissal of charges against Brad Garlinghouse and Chris Larsen demonstrates the regulator’s misuse of its power.\n\nDeaton also pointed out that before the lawsuit, major players like Coinbase and MoneyGram had conducted due diligence on XRP without any objections from the SEC, which indicates a lack of clarity and consistency in the regulator’s approach toward cryptocurrencies.\n\nThe recent developments in the case bolster his argument. Judge Analisa Torres partially ruled in favor of Ripple Labs, determining that XRP sales on digital asset exchanges do not constitute a security.\n\nDeaton has suggested that the lawsuit was used as a weapon against Ripple, a stance he has maintained since filing a Writ of Mandamus against the SEC shortly after the lawsuit was announced.\n\nAttack on financial freedom\n\nDeaton, who has initiated legal action against the SEC on behalf of XRP investors, users, and developers, explained that his lawsuit was motivated by the broader implications of the SEC’s actions rather than personal financial interest.\n\nHe stated that his holdings in XRP are minimal compared to other investments like Bitcoin and Ethereum. For Deaton and 75,000 others, the lawsuit represents an assault on a crucial liberty: financial freedom. He argued that in America, people should have the autonomy to own legal assets beneficial to their lives without government interference.\n\nThe attorney also criticized the Accredited Investor Rule, viewing it as a tool for the elite to restrict financial mobility for the majority of the population. He said the rule is a mechanism to maintain dependency on the government and restrict access to financial opportunities.\n\nMentioned in this article"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JsYWNrcm9jay1zdGVlcnMtY2xlYXItb2YteHJwLWV0Zi1sYXVuY2gtYW1pZHN0LXNlYy12LXJpcHBsZS1sYXdzdWl0LTIwMjQwMTIyMTEyOdIBhAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ibGFja3JvY2stc3RlZXJzLWNsZWFyLW9mLXhycC1ldGYtbGF1bmNoLWFtaWRzdC1zZWMtdi1yaXBwbGUtbGF3c3VpdC0yMDI0MDEyMjExMjk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "BlackRock steers clear of XRP ETF launch amidst SEC v. Ripple lawsuit - FXStreet",
        "content": "BlackRock has decided to steer clear of an XRP ETF according to a Fox Business reporter.\n\nThe SEC’s lawsuit against Ripple rages on, despite Judge Torres’ ruling, XRP remains in a regulatory “gray” area.\n\nXRP price bleeds nearly 4% on the day, declines to $0.5291.\n\nThe Securities and Exchange Commission’s (SEC) lawsuit against Ripple continues in 2024. As the payment remittance firm is embroiled in the legal battle, a Fox Business reporter has commented on whether the asset management giant will support the XRP ETF.\n\nFollowing the SEC’s approval of a Bitcoin Spot ETF, XRP holders are awaiting the launch of an XRP ETF.\n\nAlso read: Bitcoin price is above $41,000 as BTC whales make strategic moves\n\nAsset management giant not likely to support XRP ETF\n\nBlackRock, one of the largest asset managers, is unlikely to support an XRP ETF according to Fox Business Reporter Charles Gasparino. The report is relevant since the SEC v. Ripple lawsuit rages on in 2024.\n\nAccording to the latest development in the lawsuit, the payment remittance firm has filed its response to the regulator’s motion to compel, as on January 20. The case continues to garner interest in the XRP holder community.\n\nSCOOP: @BlackRock has no plans for a spot $XRP ETF, according to people with direct knowledge of the matter story developing — Charles Gasparino (@CGasparino) January 18, 2024\n\nDespite Judge Torres’ ruling on XRP sale on exchange platforms, stating that the asset is not an “investment contract,” the altcoin is a regulatory gray area. It is likely that BlackRock steered clear of XRP ETFs since there is not adequate clarity on XRP’s status as a security or non-security.\n\nThe lawsuit’s final outcome is expected to shed light on XRP’s status.\n\nSEC v. Ripple lawsuit: What’s next\n\nRipple’s attorneys have opposed the SEC’s motion to compel. This is a motion that requires the defendant to share information and facts about the case. The SEC requested the court to order Ripple to share 2022-2023 financial statements and post-complaint contracts governing XRP institutional sales on January 11. Post-complaint refers to the period of time after the SEC first filed its charges.\n\nThe regulator expects Ripple to respond to questions relating to post-complaint XRP institutional sales proceeds. Ripple is arguing, however, that the regulator had adequate time to request post-complaint documents in the fact discovery phase of the lawsuit. This ended on August 31, 2021. Thereafter, the SEC did not question the post-complaint conduct of the payment firm and it remained irrelevant to the lawsuit.\n\nRipple argues that the SEC should not be permitted to reverse course and the post-complaint conduct is irrelevant to the case. The SEC is likely looking for evidence to note whether Ripple continued non-compliance with securities laws after the charges were filed against the payment remittance firm.\n\nIf the SEC finds this to be true, the Judge presiding the case could inflict a penalty on Ripple.\n\nAt the time of writing, XRP price is $0.5291, with the altcoin continuing its decline this week."
    }
]