[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzIzL3Nob3VsZC15b3UtYnV5LXJpcHBsZS14cnAtaGFuZC1vdmVyLWZpc3Qtd2l0aC0xMDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Should You Buy Ripple (XRP) Hand Over Fist With $1,000 in 2024? - The Motley Fool",
        "content": "Take the time to know more about this promising crypto before making an informed decision.\n\nRipple (XRP 0.65%) had a fantastic 2023, as its price soared 81% last year, but things have cooled off since then. This digital asset is down 14% this year, and it is 86% below its peak price from about six years ago.\n\nShould investors with $1,000 buy this cryptocurrency (the sixth most valuable in the world, with a market cap of $28 billion) hand over fist in 2024? Let's take a closer look.\n\nTrying to disrupt a major market\n\nRipple is one of the oldest blockchain networks; it was launched in 2012 to facilitate cross-border transactions for financial institutions. The way it works is that one currency would be converted into Ripple's native digital token, XRP, sent using the blockchain, then converted into the currency of the receiver.\n\nRipple has features that make it attractive for this exact use. Transactions can settle in less than five seconds and typically cost fractions of a penny to process. This is the opposite of how the slow and expensive traditional system works. These two key features are what many believe is Ripple's advantage over Bitcoin.\n\nWhat's interesting is that Ripple's focus on financial services preceded the rise of other promising networks, like Ethereum and Solana. Ethereum was the first crypto to enable capabilities for smart contracts, making it a hotbed for the development of decentralized finance protocols. And Solana, with throughput speeds of more than 2,200 transactions per second, could become a challenger in the payments market.\n\nBoth Ethereum and Solana might find that if they achieve greater adoption, particularly in financial services, they could give Ripple a run for its money for cross-border transactions. But the fact that Ripple processes nearly 700,000 transactions per day is indicative of its success thus far.\n\nRegulatory uncertainty\n\nWhen we look at the various sectors across the economy, it's hard to find any that are more burdened by regulatory oversight than financial services. And it's not surprising: Any business that deals with the movement of money has an outsize impact on consumers, enterprises, governments, and the broader economy. So legislators want to make sure that things are operating within strict guidelines.\n\nRipple has been in trouble with the Securities and Exchange Commission about whether its tokens are unlicensed securities. While a judge last summer partly ruled that Ripple didn't violate any laws, the ruling did assert that its sale of its securities to institutional buyers did. Consequently, this could mean more legal challenges.\n\nGiven all the scams in the cryptocurrency industry, regulatory uncertainty is amplified. And the major blow-ups of prominent players in the industry indicate how complex things are and how there is a need for regulatory clarity. This just means that the regulatory overhang is something that investors will always have to keep in mind with Ripple.\n\nA reason to be wary\n\nBesides that, there is another reason to think twice about adding Ripple to your portfolio. To its credit, it has brought on banking partners to use its network. But I question just how much adoption can be achieved given the regulatory issues I just described. I don't think any large financial institutions would want to open themselves up to any lawsuits should they use the crypto's system.\n\nMoreover, JPMorgan Chase, the largest U.S. bank by assets, has a competing service, known as Onyx. With millions of individuals and businesses already as customers of the bank, not to mention its scale and long history in financial services, I suspect that Ripple's opportunity would be limited given this important competitor.\n\nIf the risks seem too high, then avoid this token. But if you believe in Ripple's long-term potential, then it could be smart to initiate a tiny position."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vc2ZzdGFuZGFyZC5jb20vMjAyNC8wMS8yMy9zYW4tZnJhbmNpc2NvLXNhZmUtbm9ucHJvZml0LWNocmlzLWxhcnNlbi1ncmFudC1mdW5kaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "San Francisco Crime Nonprofit Audit Wanted By Ripple CEO - The San Francisco Standard",
        "content": "An anti-crime nonprofit caught improperly billing San Francisco police for luxury gift boxes, limo rides and valet parking is now facing tough questions about how it spent as much as $1 million in grant funding from a crypto billionaire.\n\nSan Francisco SAFE, the longtime nonprofit partner of the San Francisco Police Department, was the subject of a scathing report released by the Controller’s Office last week that found it wrongly charged police for at least $79,000 in expenses—including a nearly $15,000 staff trip to Lake Tahoe.\n\nThe Standard has since learned that Chris Larsen, the co-founder of Ripple and a local philanthropist, has separately called for an investigation into how SF SAFE spent up to $1 million of the $1.8 million that he gave the nonprofit to expand the use of security cameras in the city.\n\nAt the center of the dispute is an estimated $600,000 to $1 million that the nonprofit allegedly owes a security company, Applied Video Solutions, for work that it performed installing and maintaining surveillance cameras over the past three years, according to the company.\n\n“Unfortunately, we recently found discrepancies regarding the designated outcomes of previous funds provided, and I’ve asked my donor-advised fund to launch an independent audit and investigation,” Larsen told The Standard.\n\nLarsen gave SF SAFE $1.8 million through a charity, the Silicon Valley Community Foundation, according to his spokesperson, Alex Tourk. Tourk said less than $1 million of the funding was “contracted as intended, with numerous unpaid invoices.”\n\n“Discrepancies were identified when invoices for existing projects were not being paid and then new funding requests represented as being for camera project expansion came in that seemed to duplicate previous requests of work reported as already being completed,” Tourk said.\n\nLarsen declined a final grant request from SF SAFE and stopped doing business with the nonprofit last March, Tourk said.\n\nThe investigation he called for is ongoing, Larsen said.\n\nDmitri Shimolin, CEO and co-founder of Applied Video Solutions, said his firm was hired by SF SAFE to install and maintain security cameras on private property in undisclosed locations around San Francisco. Shimolin said that these cameras capture footage that can be accessed after the fact.\n\nHe said his firm continued to provide services to SF SAFE despite being owed an estimated six-figure sum because the work is so important.\n\n“The reason to do this in the first place is to take care of the city and keep it safe,” Shimolin told The Standard. “We need to continue doing the work because these are important public safety measures.”\n\nAn attorney for SF SAFE, Dylan Hackett, said that the nonprofit is investigating the issues to restore trust with the community.\n\n“SF SAFE is doing their due diligence to make sure that this type of situation does not happen again,” Hackett said. “We are actively looking into all of the allegations which are being presented to us.”\n\nHackett said that he discussed the issue with the nonprofit’s executive director, Kyra Worthy.\n\n“She said that she did not misappropriate any funds whatsoever,” Hackett said.\n\nApplied Video Solutions is not the only company that SF SAFE may owe money to.\n\nLarsen’s spokesperson, Tourk, also represented SF SAFE before canceling his contract with the nonprofit last summer. He said the nonprofit owes his firm, Ground Floor Public Affairs, $80,000.\n\n“Ground Floor is deeply dismayed by the recent discrepancies discovered at the organization,” Tourk said. “Although we remain proud of our public affairs advice provided in the past for the half-century-old trusted public safety community platform, our firm terminated its agreement with SF SAFE in the summer of 2023 due to contractual delinquency.”\n\nThe report by the Controller’s Office last week sullied the longtime financial ties between the SFPD and SF SAFE, which launched in 1976 and hosts meetings that bring the community together with police. The report found that the department reimbursed SF SAFE for more than $5.3 million in expenses between July 2018 and last March, largely without checking for receipts.\n\nA closer look by the Controller’s Office at $910,000 of the reimbursements for “crime prevention education services” revealed that 9% of it was used in ways it should not have been, including for the curated gift boxes handed out at community policing events and for valet parking at the Battery, a private San Francisco club. The reimbursements also covered the costs of ride-shares for Worthy, as well as the costs of parking expenses listed under her name.\n\nBased on that small sample, the report projected that the total amount of improperly reimbursed expenses over the years not scrutinized by the Controller’s Office was “likely significantly higher.”\n\nSupervisor Aaron Peskin, who said he has been raising concerns about misspending by SF SAFE for years, plans to call for a hearing Tuesday to seek answers from both San Francisco police and the nonprofit."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5jYnNzcG9ydHMuY29tL2NvbGxlZ2UtZm9vdGJhbGwvbmV3cy9ob3ctbmljay1zYWJhbnMtcmV0aXJlbWVudC1jcmVhdGVkLWEtY29hc3QtdG8tY29hc3QtcmlwcGxlLWVmZmVjdC1pbi1jb2xsZWdlLWZvb3RiYWxscy1jb2FjaGluZy1jYXJvdXNlbC_SAZ0BaHR0cHM6Ly93d3cuY2Jzc3BvcnRzLmNvbS9jb2xsZWdlLWZvb3RiYWxsL25ld3MvaG93LW5pY2stc2FiYW5zLXJldGlyZW1lbnQtY3JlYXRlZC1hLWNvYXN0LXRvLWNvYXN0LXJpcHBsZS1lZmZlY3QtaW4tY29sbGVnZS1mb290YmFsbHMtY29hY2hpbmctY2Fyb3VzZWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "How Nick Saban's retirement created a coast-to-coast ripple effect in college football's coaching carousel - CBS Sports",
        "content": "The college football coaching carousel appeared to have reached a halt for the 2023-24 cycle back in December, but that all changed in a heartbeat on Jan. 10 when Nick Saban announced his retirement after 17 seasons as the coach at Alabama. The seven-time national champion's bombshell decision gave way to a ripple effect across the entire sport, leading to five additional coaching searches beyond the epicenter in Tuscaloosa.\n\nThe impact wasn't limited to a single region or conference; at least one school in each time zone within the contiguous United States was forced to make a sudden change in leadership as one vacancy led to another, significantly altering their trajectories. Alabama alone was directly responsible for the departures of three sitting Football Bowl Subdivision coaches, headlined by Kalen DeBoer's arrival from Washington as Saban's successor.\n\nRosters were also impacted by these moves since players have a 30-day widow to enter the transfer portal when a coaching change occurs at their school. Alabama has already seen several notable starters depart, including two rising stars in defensive back Caleb Downs and offensive lineman Kadyn Proctor. For now, though, we focus on the coaching chaos that was sparked by the close of Saban's legendary run.\n\nHere's a timeline of how it went down, starting with the single announcement that rocked college football circles.\n\nNick Saban retires as Alabama coach\n\nWednesday, Jan. 10: The sports world was sent into a frenzy when reports flooded in during an otherwise calm Wednesday afternoon that Saban's unparalleled run in the college game had reached its end. Alabama made the news official shortly after. Between stops at Toledo, Michigan State, LSU and Alabama, Saban's career ended with a record seven national championships -- one with the Tigers and six with the Crimson Tide -- and an overall mark of 297-71-1. Less than 48 hours passed before Alabama finalized his replacement, putting even more programs on edge.\n\nAlabama names Washington's Kalen DeBoer as coach\n\nFriday, Jan. 12: Just four days after Washington fell to Michigan in the College Football Playoff National Championship, the Huskies took another blow when Alabama hired away DeBoer as Saban's successor. Boasting a 104-12 career coaching record that included a 25-3 mark in two seasons at Washington, DeBoer's name rapidly gained steam in the Crimson Tide's search as other candidates fell out. With an unexpected vacancy of its own to fill ahead of a much-anticipated move from the Pac-12 to the Big Ten, Washington took a similar approach to Alabama in finding DeBoer's successor.\n\nWashington names Arizona's Jedd Fisch as coach\n\nSunday, Jan. 14: Arizona became the second outbound Pac-12 school forced to deal with an abrupt coaching departure amid a promising stretch of momentum. Although Fisch was linked to several other vacancies amid an impressive turnaround for Arizona, it appeared the school had successfully fended off other suitors ahead of its move to the Big 12. That all changed when Washington came calling with an offer that reportedly more than doubled Fisch's annual salary to north of $7 million, a deal Fisch couldn't refuse. It was a brutal swing for a Wildcats program that seemed (and perhaps still seems) poised to contend for a Big 12 championship and College Football Playoff berth in 2024 after the success of a 10-win season in 2023.\n\nKane Wommack resigns as South Alabama coach\n\nTuesday, Jan. 16: With DeBoer reportedly targeting Kane Wommack as his next defensive coordinator, South Alabama announced Wommack's resignation after a 22-16 mark in three seasons as the Jaguars' coach. Wommack previously coached alongside DeBoer at Indiana as an assistant under former coach Tom Allen in 2019. Wommack is reportedly expected to earn more than $2 million annually in his new role with the Crimson Tide, more than double his salary at South Alabama. Wommack earned $810,000 with the Jaguars in 2023, according to USA TODAY.\n\nArizona names San Jose State's Brent Brennan as coach\n\nTuesday, Jan. 16: California became the fourth state with a school directly impacted by Saban's retirement after Arizona lured Brennan away from San Jose State to replace Fisch. Although Brennan was a pedestrian 34-48 in seven seasons leading San Jose State, he guided the Spartans to a Mountain West championship in 2020 and contended for another league title in 2023. He's no stranger to Arizona, where he was once a graduate assistant. Brennan was previously linked to the Wildcats job at the end of 2020, but Fisch ultimately landed the job.\n\nMaurice Linguist resigns as Buffalo coach\n\nWednesday, Jan. 17: The Saban domino effect officially extended from Montlake to Lake Erie when Linguist resigned as Buffalo's coach, reportedly with his sights set on joining DeBoer's defensive staff at Alabama. Linguist went just 14-23 in three seasons guiding the Bulls, that after making his rounds as an assistant across the power conference landscape. He even had a stint with the NFL's Dallas Cowboys in 2020. Reading the tea leaves of Wommack's situation, Linguist is presumably also due for a healthy pay bump at Alabama. He earned $684,500 at Buffalo during the 2023 season, according to USA TODAY.\n\nSouth Alabama promotes Major Applewhite to coach\n\nThursday, Jan. 18: South Alabama kept its coaching transition simple by promoting Applewhite, the team's offensive coordinator, just two days after Wommack's resignation. Applewhite has previous coaching experience at Houston, also the result of a promotion from offensive coordinator after former coach Tom Herman departed for Texas in December 2016. The Cougars went 15-11 overall under Applewhite before he was let go after the 2018 campaign.\n\nBuffalo names South Carolina assistant Pete Lembo as coach\n\nSunday, Jan. 21: Buffalo dipped into the SEC to find Linguist's replacement, hiring South Carolina associate head coach Pete Lembo. A member of coach Shane Beamer's original Gamecocks staff in 2021, Lembo has past coaching stops at Lehigh (2001-05), Elon (2006-10) and Ball State (2011-15). He compiled a 112-65 record during that stretch, including 44 wins during his tenure at Lehigh. The New York native had overseen special teams as part of his duties at South Carolina.\n\nSan Jose State names Ken Niumatalolo as coach\n\nSunday, Jan. 21: The final major development in the Saban domino effect was Niumatalolo's return to the head coach ranks after the former Navy boss was tabbed as Brennan's replacement at San Jose State. Niumatalolo won 109 games with the Midshipmen from 2007 up until his rather surprising dismissal after the 2022 campaign. He already spent the 2023 season on the West Coast working in an administrative role at UCLA and was briefly the team's tight ends coach before taking the San Jose State job."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm1pbnR6LmNvbS9pbnNpZ2h0cy1jZW50ZXIvdmlld3BvaW50cy8yMDI0LTAxLTIzLWNvbXBldGluZy1wcmVjZWRlbnQtc2RueS1zdWdnZXN0cy1jb250aW51ZWQtdW5jZXJ0YWludHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Competing Precedent in the SDNY Suggests Continued Uncertainty for Crypto Assets in 2024 - Mintz",
        "content": "The end of 2023 ushered in a flurry of new developments in key crypto cases. In August of last year, we wrote about conflicting decisions in two Southern District of New York (“SDNY”) cases testing the authority of the U.S. Securities and Exchange Commission (“SEC”) to regulate the crypto asset industry. In SEC v. Ripple Labs (“Ripple Labs”), which was generally considered a victory for Ripple, Judge Analisa Torres granted partial summary judgment in favor of Ripple on the issue of whether certain sales of Ripple’s XRP digital tokens were “investment contracts” and thus “securities” subject to SEC regulation. As discussed further below, Judge Torres found, in part, that purchasers who acquired XRP directly from Ripple enjoyed legal protections not shared by those who purchased XRP on crypto trading platforms in programmatic sales. Weeks later, Judge Jed Rakoff delivered a decision generally viewed as an SEC victory in SEC v. Terraform Labs Pte. Ltd. and Do Hyeong Kwon (“Terraform Labs”). Judge Rakoff generally rejected the position that the manner of sale of crypto asset securities—including whether to direct purchasers or via crypto trading platforms—has an impact on whether an asset is a security.\n\nAnalytical Divergence in the SDNY\n\nThe current divergence in SDNY precedent centers on application of the so-called \"Howey test\" to determine the existence of an “investment contract.” An investment contract is a type of “security” regulated by the SEC. Under the Howey test, an investment contract exists where a person makes: (1) an investment of money; (2) in a common enterprise; (3) with a reasonable expectation of profits; (4) to be derived from the efforts of others. We discussed this test and the implications of a crypto asset being a “security” in this prior article .\n\nJudge Torres and Judge Rakoff agree that the first two prongs of the Howey test are met in their respective cases. Their views appear to diverge on whether one or both of the following groups of people can establish a reasonable expectation of profits derived from the efforts of others:\n\nInvestors who purchase crypto assets on a platform and do not know the identity of the seller, do not possess a direct relationship with the asset issuer, and must rely primarily on non-specific statements promoting a crypto asset made by the issuer and its representatives to the general public. Investors who obtain assets directly from the issuer as part of a private placement of securities, possess a direct relationship with the issuer, and may be able to rely on promotional statements made by the issuer and its representatives directly to them in addition to any made to the general public.\n\nJudge Torres’ decisions have essentially found, based on the factual record in Ripple Labs, that public statements by Ripple and its representatives regarding future proceeds did not create a reasonable expectation of profits for investors who acquired XRP on crypto exchanges. Judge Rakoff’s decisions, based on the more limited record in Terraform Labs, arguably reject this reasoning and find that an investment contract can exist based on public statements by an issuer and its representatives regarding future proceeds—whether made directly to investors or not and regardless of the manner in which the crypto assets are acquired.\n\nRipple Labs Updates\n\nSince we last wrote, two significant developments took place in Ripple Labs. First, in October 2023, Judge Torres denied the SEC's bid for interlocutory appeal of her decision on summary judgment. The SEC challenged Judge Torres’ decision arguing, among other things, that she misapplied the Howey test and that her summary judgment holdings were “of particular consequence to an issue of programmatic concern to the SEC’s enforcement of the securities laws and potentially a large number of pending litigations.” Accepting the SEC’s argument may have expedited the Second Circuit’s review of the Ripple Labs decision, resulting in earlier consideration of Judge Torres’ ruling by one of the nation’s most influential securities law courts.\n\nPerhaps unsurprisingly, Judge Torres rejected the SEC’s argument that she “improperly applied the Howey test.” She also concluded that other cases brought by the SEC involved different circumstances (e.g., different assets, companies, or legal postures), and that because of this, her decision in Ripple Labs did not have precedential value for “a large number of cases” and did not involve “controlling questions of law.”\n\nJudge Torres also rejected the SEC’s argument that Judge Rakoff’s decision in Terraform directly conflicted with her decision in Ripple Labs. She concluded that the Terraform decision “did not engage with the Court’s reasoning” in Ripple Labs because of the different procedural postures in each case. Judge Rakoff’s decision in Terraform Labs came at the motion to dismiss stage. Thus, he accepted as true the SEC’s argument that promotional statements by Terraform “would have reached individuals who purchased their crypto asset assets on secondary markets” due to the lack of a factual record. Judge Torres, on the other hand, found that the SEC failed to prove that Ripple distributed certain promotional materials to the general public at the summary judgment phase and after the development of an extensive factual record.\n\nSecond, and shortly after Judge Torres denied the SEC’s petition for interlocutory appeal, the SEC voluntarily dismissed its claims against two Ripple executives alleging that they aided and abetted Ripple’s securities law violations with respect to the direct institutional sales of Ripple’s XRP tokens that did not occur on a crypto exchange (i.e., the sales of XRP that Judge Torres did deem to be sales of “unregistered securities” in her earlier decision).\n\nThe Ripple case is currently set for resolution in 2024 on the issue of the remedy and/or damages from the sales of XRP tokens to institutional buyers that the Court determined violated securities laws. Briefing on these matters appears likely to close in mid-spring, and we will be tracking the case closely to provide further updates.\n\nTerraform Updates\n\nOver two months after Judge Torres characterized Judge Rakoff’s decision in Terraform Labs as “not engag[ing] with the Court’s reasoning” in Ripple Labs, Judge Rakoff issued a highly anticipated decision on cross-motions for summary judgment in Terraform Labs. Perhaps unsurprisingly, his decision largely upheld his earlier reasoning in the motion to dismiss, in determining that Terraform (and its founder, Do Kwon) violated the federal securities laws by failing to register Terraform’s UST, LUNA, wLUNA and MIR crypto asset tokens.\n\nThe SEC argued that four of Terraform’s crypto assets (UST, LUNA, wLUNA, and MIRA) are securities, as defined in Section 2(a)(1) of the Securities Act for the purposes of the federal securities laws, because they are investment contracts under Howey. In response, Terraform and Do Kwon argued that the assets were not investment contracts as a matter of law; and the undisputed facts did not demonstrate that the crypto assets at issue are investment contracts.\n\nMany observers wondered how Judge Rakoff might respond to Judge Torres’ October ruling in Ripple Labs, and he responded by doubling down on his earlier decision. Judge Rakoff emphatically rejected both of defendants’ arguments. Among other things, he found that a myriad of evidence put forth by the SEC showed Terraform and its executives trumpeting how sales of the various tokens would be used to generate shared profits amongst the purchasers. While the facts and circumstances of each token varied, Judge Rakoff determined that Terraform marketed each of the four tokens in specific ways that met each prong of the Howey test. Given this, Judge Rakoff determined that each of the four tokens at issue were securities under Section 2(a)(1) of the Securities Act, and that the offerings of UST, LUNA, wLUNA, and MIRA should have been registered.\n\nIn addition, Judge Rakoff found that Terraform and Do Kwon violated Section 5 of the Securities Act by selling unregistered securities. The defendants argued that the securities were otherwise exempt from registration because they were only sold directly to sophisticated investors, an argument Judge Rakoff found unpersuasive. For some tokens, Judge Rakoff determined that even though Terraform sold them directly to institutional investors through sales agreements, the terms of these agreements expressly contemplated Terraform’s development of a secondary market to help incentivize resales. Many initial investors also received the tokens at a substantial discount, which would have allowed them to sell the tokens at higher prices after a lockup period. Sales of other tokens were made pursuant to agreements that did not restrict the resale of those tokens to secondary transactions. Judge Rakoff also found no indication that Terraform sought to restrict the resale of certain tokens to U.S. customers and investors.\n\nWhile Judge Rakoff ruled in favor of the SEC on the two critical legal issues above, his decision was not a complete win for the SEC:\n\nJudge Rakoff ruled that as a matter of law, the defendants did not offer unregistered security-based swaps (a product known as mAssets, which the SEC did not allege were securities) in violation of either Section 5(e) of the Securities Act or Section 6(1) of the Exchange Act. Judge Rakoff denied the parties’ cross-motions for summary judgment on the SEC’s claims that defendants intended to defraud investors in statements regarding Terraform’s business in violation of Section 10(b) and Rule 10b-5, determining that reasonable jurors could differ on the questions of whether: (1) a reasonable investor would have found specific statements made by Terraform to be materially misleading; and (2) the SEC had proven defendants acted with the requisite scienter in making the statements at issue, given that much of the SEC’s evidence to support scienter came from whistleblowers whose credibility and scope of testimony needed to be determined at trial.\n\nNotably, Judge Rakoff’s decision did not mention Judge Torres’ earlier decision in Ripple Labs, or specifically grapple with the differing outcomes on key legal issues.\n\nJudge Rakoff’s partial summary judgment decision in favor of the SEC leaves the remaining claims for a liability phase of trial recently rescheduled to start on March 25, 2024. The trial was postponed from January to March by Judge Rakoff’s Order in an effort to provide more time for Do Kwon to work through his extradition. Judge Rakoff noted that any remedies for the defendants’ sale of unregistered securities would be determined after the liability questions had been resolved at trial for all remaining claims.\n\nFinal Thoughts\n\nLooking ahead to 2024, we expect further significant legal decisions in Ripple Labs and Terraform Labs. We also expect the SEC to leverage what it views as favorable rulings in cases like Terraform Labs in other pending actions, and to downplay decisions that it considers less favorable. For example, the SEC has already made the court aware of Judge Rakoff’s decisions in its ongoing case against Coinbase. The SEC is also seeking to limit the reach of Judge Torres’s decisions. During over four hours of argument regarding Coinbase’s motion for judgment on the pleadings on January 17, 2024, Coinbase argued, among other things, that unlike the crypto assets at issue in its case, a stock reflects an interest in the permanent capital of a corporation. When it trades, that interest in the permanent capital of the corporation, which is a participation in its capital structure, transfers in entirety from one holder to another holder. The SEC countered that purchasers of crypto assets on an exchange are also investing in the network or ecosystem behind it, indicating there is a value proposition behind the crypto purchase that makes it a security. Judge Failla articulated concern that the SEC’s argument was too broad and risked impacting existing markets for collectibles and commodities, among other non-securities, but she did not clearly indicate which way she intended to rule. Should Judge Failla deny Coinbase’s motion, the case will proceed into discovery and potentially summary judgment in 2024 or later.\n\nDespite recent advancements in the Ripple Labs and Terraform cases, the industry likely remains many years away from clear judicial resolutions of which transactions in crypto assets are securities transactions under applicable law. Legislative action clarifying the SEC’s jurisdiction over crypto assets remains highly sought after by the industry, but Congressional action remains unlikely in 2024 due to the current political environment.\n\nSubscribe To Viewpoints"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vbmF0bGF3cmV2aWV3LmNvbS9hcnRpY2xlL2p1ZGdlLXJha29mZi1wdXRzLXJpcHBsZS1wYXJ0eS1pY2UtY3J5cHRvLWNvbW11bml0eS1hbmQtc2VjLXBvbmRlci10aGVpci1uZXh0LW1vdmVz0gF4aHR0cHM6Ly9uYXRsYXdyZXZpZXcuY29tL2FydGljbGUvanVkZ2UtcmFrb2ZmLXB1dHMtcmlwcGxlLXBhcnR5LWljZS1jcnlwdG8tY29tbXVuaXR5LWFuZC1zZWMtcG9uZGVyLXRoZWlyLW5leHQtbW92ZXM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Judge Rakoff puts the Ripple Party on Ice as the Crypto Community and SEC Ponder their Next Moves - The National Law Review",
        "content": "Just barely two weeks ago, we wrote about the half-victory for Ripple Labs in its ongoing litigation with the Securities and Exchange Commission (“SEC”), in which Judge Analisa Torres granted partial summary judgment in favor of Ripple on the issue of whether certain sales of Ripple’s XRP cryptocurrency tokens were “securities” under the federal securities laws. Some in the crypto industry interpreted her ruling to mean that secondary transactions in crypto assets on centralized and decentralized crypto exchanges were not transactions in “securities,” even though Judge Torres expressly declined to address the secondary trading issue. Fast forward to today, and a new ruling out of the SDNY against Terraform Labs casts further doubt on this interpretation.\n\nRipple Recap\n\nIn her ruling on the status of XRP tokens as “investment contracts,” Judge Torres concluded that under Howey certain sales of XRP tokens to institutional investors met the definition of “investment contracts,” while programmatic sales to individuals and retail investors via digital currency exchanges did not meet the same definition. Judge Torres’s decision hinged on how the XRP tokens were sold and what Ripple itself disclosed to purchasers of the tokens. While Ripple gave fulsome disclosures to institutional investors and as such, those individuals understood that purchasing XRP was investing in Ripple, retail investors purchasing XRP on the secondary market did not receive similar disclosures and were thus unaware they were buying XRP from Ripple, let alone investing in Ripple. The Ripple court determined that this difference in the nature of the transaction—and the buyer’s understanding in a particular transaction—drove the analysis of whether or not the XRP token sales at issue were “investment contracts” and thus “securities.”\n\nAs we noted, the court’s decision created an awkward dynamic favoring applying the protections of the federal securities laws to institutional investors, but not retail investors. We also highlighted that if other courts were to adopt Judge Torres’s reasoning, the critical factor in deciding whether a token is a security would be how that token is sold. Our key takeaway was that the split decision left both the SEC and the crypto industry in a tenuous holding pattern given the court’s focus on the nature of the transaction and the identity of the buyer, and the uncertainty concerning whether other judges faced with the same question would adopt Judge Torres’s reasoning.\n\nTerraform Decision\n\nWithin two weeks, a different judge within the Southern District of New York (this time, Judge Jed Rakoff) confronted a similar question, but came to a very different conclusion. In SEC v. Terraform Labs Pte. Ltd. and Do Hyeong Kwon, the defendants moved to dismiss the SEC’s complaint arguing that the cryptocurrency tokens Terraform Labs (“Terraform) developed and sold were not “investment contracts” (and thus “securities”) under the Howey test. According to the defendants, Judge Torres’s decision in Ripple was “fatal” to the SEC’s case that Terraform’s digital assets were sold as investment contracts. But Judge Rakoff disagreed, emphatically rejecting the ruling in Ripple and Judge Torres’s application of the Howey test. Judge Rakoff concluded that, at the Rule 12 stage, the SEC had met its burden of alleging that the tokens qualified as securities.\n\nIn Terraform, the SEC challenged Terraform’s sale of crypto assets (including its UST Coin) to investors in the United States. Terraform is a South Korean-based blockchain project that created a peer-to-peer payment network that also supported other decentralized applications. Terraform’s network depended on a suite of “stablecoins,” or crypto assets whose value is pegged to another asset, such as the U.S. dollar, to serve as a “useful medium[] of exchange” based upon its stable value compared to other, volatile crypto assets. Unlike a “traditional” stablecoin that is pegged directly the value of a real world asset, Terraform created a stablecoin, the UST Coin, which was indirectly pegged to the U.S. dollar by algorithms. The SEC alleged that Terraform marketed the UST Coins to investors as stable investments that would retain their value in perpetuity given they were pegged to the USD. The UST Coins then conferred a right to purchase Terraform’s LUNA Coins to investors. Ultimately, while UST Coins were supposed to maintain a 1:1 peg to the value of the USD, the UST Coins lost their peg because they artificially derived their value through an algorithmic pairing with the LUNA Coins.\n\nAccording to the SEC’s allegations, Terraform also launched in April 2019 a blockchain to house transactions using the UST Coin and other crypto assets the company developed, but the market demand for these coins did not develop fast enough. In response, Terraform allegedly began a concerted marketing effort in September 2020 for UST Coins as “profitable investment opportunities.” Terraform directed these efforts at US investors and at investment conferences in the US, as well as on social media. Terraform also created the “Anchor Protocol,” an investment pool in which owners of UST coins would deposit their coins and “earn a share of whatever profits the pool generated.” By doing so, and by advertising potential return of 19-20% for investors, Terraform allegedly boosted the demand for UST Coins. Terraform also represented to investors that the continued profitability of UST Coins and the Anchor Protocol was dependent on the continued development of the “broader Terraform ‘ecosystem,’” which required maximizing the total volume of transactions processed on the blockchain.\n\nAt bottom, according to the SEC’s allegations, Terraform allegedly offered and sold these assets via unregistered transactions to both institutional and retail investors, and imposed no restrictions on the resale of certain crypto assets with the understanding that the tokens “would be resold to the public.” The SEC also alleged Terraform violated the federal securities laws simply by “directly offering and selling” certain tokens and other assets on “crypto-asset marketplaces.” Lastly, the SEC alleged that Terraform defrauded investors by representing that its Coins were “stable” investments that would always retain their value, yet took steps unbeknownst to investors to artificially prop up the value of the stablecoins to preserve their value. These actions allegedly “restored confidence” in the Terraform marketplace and caused investors to invest billions of dollars into transactions on the ecosystem, only for the market for UST coins to collapse one year later (in May 2022), wiping out nearly $40 billion of total market value.\n\nThe SEC alleged that the above activity constituted violations of the antifraud provisions of the 1933 Act and the 1934 Act (along with Rule 10b-5), and separately, that Terraform’s failure to register the offer and sale of its crypto-assets separately violated the 1933 Act’s requirement to register such offerings.\n\nIt should be noted that the Court here was considering the defendants’ motion to dismiss, and as such, the defendants had a particularly high burden to meet under Rule 12 (in contrast to the Ripple court’s decision on summary judgment). Here, Judge Rakoff weighed the defendants’ motion to dismiss and uniformly rejected all grounds on which it moved. Most critically for the crypto industry writ large, the Court determined that the SEC pled a plausible claim that Terraform’s crypto assets (including UST Coins and LUNA Coins) were “securities” under the Howey test for investment contracts. The Court’s decision accepted all of the SEC’s allegations as true for purposes of the motion, and thus focused on the full set of facts and circumstances governing the transactions in Terraform’s crypto assets, and in so doing, rejected the Company’s suggestion to separately analyze whether the coins themselves were “securities” and then whether the investment protocols were as well.\n\nThe Court noted that the original UST Coins and LUNA coins “might not then have been, by themselves, investment contracts,” and that “where a stablecoin is designed exclusively to maintain a one to-one peg with another asset, there is no reasonable basis for expecting that the tokens -- if used as stable stores of value or mirrored shares traded on public stock exchanges -- would generate profits through a common enterprise.” But in the case of the UST and LUNA Coins, Judge Rakoff concluded that the circumstances around both tokens changed over time such that it would be inappropriate to erect artificial barriers between the coins and the investment protocols.\n\nThe Court next determined that according to the SEC’s allegations, Terraform’s crypto assets, taken together, met the element of a “common enterprise” under Howey. In sum, the Court found that the SEC met its burden by establishing the various crypto assets (UST Coins, LUNA Coins, and others) were allegedly either: (1) pooled together in the various investment protocols for the purposes of collective management by Terraform, whose managerial efforts created an expectation of profit generation that would then be redistributed to the individuals who had deposited their tokens in the protocol; or (2) sold to generate proceeds that would be used to develop Terraform’s blockchain further, which would increase the value of the tokens sold.\n\nLastly, the Court determined that if the SEC’s allegations were true, Terraform’s actions created a reasonable expectation of profits in its customers (the 3rd prong of the Howey test). Put another way, the SEC met its burden of alleging that a reasonable investor would believe profits would flow to it from their investment in Terraform’s crypto assets. The SEC met its burden through its allegations regarding Terraform’s marketing of the potential profitability of the Anchor Protocol or the future investment returns from Terraform’s use of proceeds from the sale of the LUNA Coins to “further develop[] the Terraform ecosystem.” In short, the SEC properly alleged that Terraform “held out to the coins’ consumers the possibility of profiting from their purchases,” which was sufficient to meet the 3rd Howey prong.\n\nIndeed, the most newsworthy part of the Court’s opinion was Judge Rakoff’s emphatic rejection of the applicability of the Ripple decision. The Court noted that it “rejects the approach recently adopted by another judge of this District in a similar case” and declined to “draw a distinction between these coins based on their manner of sale” as Terraform argued it should. Judge Rakoff noted that the Ripple court’s distinction between institutional purchasers and retail investors purchasing on digital exchanges was wrong because “Howey makes no such distinction between purchasers,” and for good reason—because whether the distinction of whether a purchaser “bought directly from the defendants or . . . in a secondary re-sale transaction has no impact on whether a reasonable individual would objectively view the defendants’ actions and statements as evincing a promise of profits based on their efforts.” According to the Court, Terraform customers, regardless of their method of purchase, would have learned about Terraform’s representations regarding the use of proceeds from sales of Terraform coins to generate additional profits for all asset holders. All Terraform customers, therefore, had “every bit as good a reason to believe that [Terraform] would take their capital contributions and use it to generate profits on their behalf.”\n\nThe Court also denied dismissal on the other grounds Terraform raised, namely:\n\nThe Court determined that it had personal jurisdiction over Terraform. Using a 2022 decision from the Second Circuit in a related SEC case against Terraform as the baseline, the Court determined Terraform had extensive contacts with the US, marketed and promoted sales to US customers, entered into agreements to sell crypto assets to US trading firms, and met with US investors at US-based conferences.\n\nThe Court rejected Terraform’s argument that various statutory interpretation doctrines (for example, the Major Questions Doctrine) and the Administrative Procedure Act prohibited the SEC from alleging Terraform’s digital assets were “securities” under the federal securities laws. In particular, the Court (much like the Court in Ripple) rejected Terraform’s argument that the SEC’s decision to regulate crypto assets as securities violated the Due Process Clause and the APA because crypto companies did not have fair notice of the SEC’s intention to do so. The Court noted that rather than paint all crypto assets as securities, it was sufficient that the SEC has consistently asserted that some crypto assets may be securities “depending upon their particular characteristics.”\n\nFinal Thoughts\n\nWhile Judge Rakoff’s decision in Terraform does not disturb the contrasting decision of Judge Torres in Ripple, it does create an internal split among the judges of the SDNY and, more importantly, significantly more uncertainty for crypto companies and the SEC moving forward. The SEC, in responding to Terraform’s request for supplemental briefing regarding the Ripple decision, argued that Judge Torres’s decision “conflicts with and adds baseless requirements to Howey and its progeny.” The SEC also called the Ripple decision “wrongly decided” as to the distinction between sales to institutional investors and programmatic sales. As to the internal split within the judges of the SDNY, the SEC noted in the same filing that it was “considering the various available avenues for further review” of the Ripple decision and “intend[ed] to recommend that the SEC seek such review,” thereby indicating it would appeal the decision to the Second Circuit. It is too early to know whether Terraform’s attorneys intend to seek interlocutory review of the Court’s denial of the motion to dismiss. Regardless, the SEC, regulators, and crypto markets can likely expect the Second Circuit to weigh in on the application of Howey and whether crypto asset sales constitute an “investment contract” (at least with respect to the XRP tokens sold by Ripple) at some point in 2024.\n\nGiven the differing opinions of the judges in these cases at different stages of litigation, and the likelihood that the facts and circumstances of each crypto asset and offering will dictate applicability of the federal securities laws, the only likely way to ensure uniformity and certainty for the industry moving forward will be an act of Congress. Clearly the Ripple decision did not have that effect, nor (likely) will the Terraform decision. Yet some congressional momentum has started to gather, with the House Financial Services Committee recently advancing a bipartisan bill out of committee aimed at: (1) clearly defining when crypto assets qualify as securities under the federal laws; (2) expanding the Commodity Futures Trading Commission’s scope of regulatory authority over the crypto industry; and (3) clarifying the SEC’s scope of authority over the industry. It is too early to know whether such a bill could pass a divided Congress, let alone be signed by the Biden Administration. Yet until Congress acts, the question of when and how a digital asset becomes a “security” subject to the federal securities laws and requiring registration remains far from settled."
    }
]