[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yMS9icmFkLWdhcmxpbmdob3VzZS1wcmVkaWN0cy1yZWd1bGF0b3J5LWNsYXJpdHktZm9yLXN0YWJsZWNvaW5zLWluLTIwMjQtc2F5cy1kb2xsYXItcGVnZ2VkLWNyeXB0by1zb2x2ZXMtcmVhbC1uZWVkL9IBlgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8yMS9icmFkLWdhcmxpbmdob3VzZS1wcmVkaWN0cy1yZWd1bGF0b3J5LWNsYXJpdHktZm9yLXN0YWJsZWNvaW5zLWluLTIwMjQtc2F5cy1kb2xsYXItcGVnZ2VkLWNyeXB0by1zb2x2ZXMtcmVhbC1uZWVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Brad Garlinghouse Predicts Regulatory Clarity for Stablecoins in 2024, Says Dollar-Pegged Crypto Solves Real Need - The Daily Hodl",
        "content": "Ripple Labs chief executive Brad Garlinghouse is predicting that regulatory clarity will come to stablecoins in 2024.\n\nIn a new interview with CNBC International, Garlinghouse says that the US government will create clear guidelines for the stablecoin industry this year as he believes dollar-pegged crypto assets have important utility.\n\n“I think this year there will be legislation that passes. I won’t be as predictive about which one I think, but the likelihood is that the [Clarity for Payment Stablecoins Act] – I can’t remember the name of the bill that has been going through the system in Washington DC – but I think we will see that in part because the US Treasury wants it.\n\nI think the stablecoin market has really surprised people in some ways in terms of solving a real need, and I think it only makes sense for there to be regulatory clarity around that I think that’s good for the whole industry.”\n\nGarlinghouse goes on to say that stablecoins such as USDT and USDC are here to stay and that if they have any skeletons in their closet, they will come to be known once clear guidelines are established for the nascent crypto sector.\n\n“One of the things you said earlier is, are there skeletons in the closet? The stablecoin market, because there hasn’t been clear rules of the road, it’ll be interesting as that comes to fruition.\n\nThe two primary [stablecoins] – obviously USDT and USDC – I think they are here to stay and I think you’re going to see other entrants in that market too.”\n\nThe Clarity for Payment Stablecoins Act was proposed last year and would require stablecoin issuers to hold all reserves associated with dollar-pegged digital assets in U.S dollars, government securities, or fully collateralized repurchase agreements.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Natalia Siiatovskaia/Tithi Luadthong"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1jcnlwdG8tbGVnYWwtZXhwZXJ0LXJlYWN0LWZ1cnRoZXItdG8tc2VjLXYtY29pbmJhc2UtaGVhcmluZy0xNDAzNzMy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "XRP News: Crypto Legal Expert React Further to SEC v Coinbase Hearing - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LndydHYuY29tL25ld3MvbG9jYWwtbmV3cy9icm9hZC1yaXBwbGUtcmVzdGF1cmFudC1ob3BjYXQtdG8tY2xvc2UtYXQtdGhlLWVuZC1vZi1qYW51YXJ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Broad Ripple restaurant HopCat to close at the end of January - WRTV Indianapolis",
        "content": "INDIANAPOLIS — A restaurant that proudly proclaims itself as \"Indiana's Best Beer Bar\" on its windows is closing its doors for good at the end of the month.\n\nHopCat announced on social media Thursday that it will close its location at the corner of Broad Ripple Avenue and College Avenue on Jan. 28.\n\nThe Michigan-based restaurant posted this statement about the closure:\n\nFor the past 10 years, it has been our pleasure to share great craft beer and made-from-scratch food with the Broad Ripple community. It is with regret that we announce the last day of service at HopCat Broad Ripple will be on 1/28/2024.\n\n\n\nPlease join us in raising a pint to our amazing staff, many of whom have been with us since we opened our doors. We thank you for your support and hope to see you before we close our doors later this month. And if your travels bring you our way, we look forward to serving you at another one of our 10 HopCat locations.\n\n\n\nIf you have questions, please email Guest Relations at support@hopcat.com.\n\nHopCat employee River Bennett said they and their co-workers suddenly learned about the closure from a human resources professional on Wednesday.\n\n\"No one in our store knew,\" Bennett said. \"General manager, assistant general manager...no one knew. We've been booking events for the summer time. We have wedding parties that people scheduled with us that they can't do anymore.\"\n\nBennett hoped HopCat executives would have given employees more time to try and find a new job.\n\n\"I'm sure the HR person would want a two-week notice from me if I was leaving, but she did let us know she could have told us we're let go by just putting a note on the door,\" Bennett said.\n\nThe small window between the closure announcement and the last day of business allowed customers to come back for one last meal.\n\n\"I said, 'I've got to go try it again,\" said Andrew Larrigan, who said he had eaten at HopCat at least six times over the years. \"The fries and the burgers are so good, and so is the beer selection. I'm sad to see it go.\"\n\nLarrigan dined at HopCat Saturday afternoon and soon realized he was not the only person who wanted a final bite and brew.\n\n\"The host said it was an hour wait today, but we lucked out and got a seat at the bar,\" Larrigan said.\n\nBennett did not have to wait long for another job opportunity.\n\n\"I had 30 to 40 different restaurants reaching out to me to offer me employment, which was wonderful,\" Bennett said. \"I was stressed. I thought I was going to get evicted.\"\n\nBennett does not regret working for HopCat, but remains upset about the way it ended.\n\n\"A lot of us had put all of our eggs in this basket and a lot of us had families,\" Bennett said. \"They dropped the news on us like it was nothing.\"\n\nHopCat does not have any other locations in Indiana. Its only other location outside of Michigan is in Lincoln, Nebraska."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS90aGUtY2xhc2gtb2YtdGl0YW5zLXJpcHBsZS1oZWRlcmEtc3dpZnQtYW5kLWZlZG5vdy1pbi10aGUtYmF0dGxlLWZvci1maW5hbmNpYWwtc3VwcmVtYWN5L9IBgQFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vdGhlLWNsYXNoLW9mLXRpdGFucy1yaXBwbGUtaGVkZXJhLXN3aWZ0LWFuZC1mZWRub3ctaW4tdGhlLWJhdHRsZS1mb3ItZmluYW5jaWFsLXN1cHJlbWFjeS8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "The Clash of Titans: Ripple, Hedera, SWIFT, and FedNow in the Battle for Financial Supremacy - Crypto News Flash",
        "content": "SWIFT and institutional products like FedNow have dominated the payments market, but with blockchain solutions from Ripple, Hedera and others gaining popularity, the end is nigh.\n\nUnlike SWIFT and FedNow, blockchain platforms are instant, have lower fees, are accessible 24/7, eliminate middlemen, and give users ownership of their data.\n\nGlobal trade relies on efficient payment systems, and for decades, the same few players have dominated the sector. Despite their inefficiencies, the likes of SWIFT have been the go-to services for cross-border funds transfers. This is changing, and as Ripple, Hedera, Stellar, and other blockchain networks become more prominent, the legacy players face their most formidable challenge yet.\n\nTrillions of dollars move globally daily—the global forex trading market alone accounts for over $6.6 trillion daily. Banks remain the most used avenue, a position they have enjoyed for several decades. Fintech startups have jumped on the map in recent times, but they still pale in comparison to the big banks.\n\nHowever, banks face several challenges as they have refused to change. While you can send a message from one end of the world to another in seconds, transferring money takes at least three business days. Even worse, you’d have to wait longer if this falls on the weekend or a public holiday. All this is done at premium fees, with a World Bank study finding that citizens in most African countries have to part with about 8% of the money they receive from other countries, including their neighbours, as fees.\n\nHow these banks have maintained a chokehold on the payments systems is puzzling. However, all this could end as blockchain technology invades this almost impenetrable market to offer users the cheapest, fastest and most convenient solutions.\n\nSWIFT vs Blockchain: Clash of the Titans\n\nUnlike the SWIFT-reliant banks, blockchain technology offers users a new way to send value worldwide in seconds for a tiny fraction of the cost. Ripple’s XRPL, for instance, only costs 0.00001 XRP, or $0.0000055, to send any amount of money anywhere. To contextualize it, $1 could pay for 181,000 transactions on XRP. According to the UN, sending $200 by bank on average globally costs 6.5%, or $13.\n\nRipple, the blockchain payments firm which pushes for the adoption of XRPL in payments, has been working on partnerships that integrate the blockchain into existing systems.\n\n“Since the start, Ripple focused on creating products that solve real problems for real customers. This evolution of Ripple Payments represents an extension of our long-running work to optimize the cross-border payment experience through transformative technology,” stated the company’s president, Monica Long.\n\nIt’s clear that banks are a dying breed in the face of the blockchain revolution. Cognizant of the potential of the technology, banks have been working on integrating blockchain. SWIFT, which faces the most significant threat, has been working to integrate various blockchains as it seeks to evolve and keep its place in the world of payments.\n\nRecommended for you:"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYm9sZC5jb20vcmlwcGxlLWZpcmVzLWJhY2stYXQtdW50aW1lbHktc2VjLXJlcXVlc3QtYXMteHJwLXNlbGwtb2ZmLXBlcnNpc3RzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Ripple fires back at 'untimely' SEC request as XRP sell-off persists - Finbold - Finance in Bold",
        "content": "The legal battle between the Securities Exchange Commission (SEC) and blockchain firm Ripple is persisting, with both sides currently tussling over financial statements.\n\nSpecifically, the regulator had previously filed a motion to compel Ripple to disclose its financial statements for 2022-2023 and post-complaint contracts.\n\nIn the latest development, Ripple has countered the SEC’s demand by filing a motion challenging it. Defense attorney James Filan, in a post on X (formerly Twitter) on January 19, revealed that Ripple deemed the motion ‘untimely.’\n\nThe court filing disclosed that Ripple argues the SEC’s requests are untimely, emphasizing that the regulatory body had ample opportunities during fact discovery to pursue the requested information.\n\nFurthermore, Ripple’s legal team contended that the appropriateness of post-complaint discovery has previously undergone litigation.\n\n“The SEC requests are irrelevant and has no bearing on the court’s remedies determination. The SEC’s considering whether Ripple’s post-complaint conduct violated the law will need a lengthy fact discovery period or a new litigation,” Ripple said.\n\nRipple also highlighted that, during this dispute, the SEC consistently asserted that such discovery was irrelevant to remedies. Consequently, Ripple asserts that the SEC should be prevented from reversing its position.\n\nPossible delays\n\nExpressing concern about potential delays caused by the SEC’s demand, Ripple believes that reexamining whether its post-complaint conduct breached the law could extend the proceedings, necessitating an extensive and protracted fact-discovery period.\n\nIt’s worth noting that the SEC-Ripple trial, set to begin in April, originated from charges filed by the regulator in 2020, alleging that Ripple raised funds by selling unregistered securities in XRP tokens.\n\nIn a significant development in 2023, Ripple partially won when the judge ruled that XRP does not qualify as a security.\n\nDespite ongoing legal challenges, Ripple continues to view the case as part of hostile regulatory actions in the United States.\n\nThe company’s CEO, Brad Garlinghouse, noted that the regulatory situation prompted the exploration of a possible initial public offering (IPO) outside the US. However, the IPO plans have been put on hold for now.\n\nXRP price analysis\n\nElsewhere, the latest developments in the case have had a minimal impact on the value of XRP, which continues to trade under pressure. By press time, XRP was valued at $0.55, reflecting daily gains of about 0.60%. On the weekly chart, XRP is down over 4%.\n\nXRP seven-day price chart. Source: Finbold.\n\nAt the same time, XRP technical analysis reveals bearish sentiments, with a summary of one-day gauges indicating a ‘sell’ rating at 15, moving averages are for ‘strong sell’ at 13, and oscillators align with ‘neutral’ sentiment at 8.\n\nXRP technical analysis. Source: TradingView\n\nOverall, since XRP lost its support level at $0.60, analysts speculate that the token might experience further drops before a potential rally.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]