[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9taWxsaW9ucy1vZi14cnAtZGlzYXBwZWFyLWluLW15c3RlcmlvdXMtcmlwcGxlLXRyYW5zZmVy0gFLaHR0cHM6Ly91LnRvZGF5L21pbGxpb25zLW9mLXhycC1kaXNhcHBlYXItaW4tbXlzdGVyaW91cy1yaXBwbGUtdHJhbnNmZXI_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Millions of XRP Disappear in Mysterious Ripple Transfer - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a surprising turn of events, Ripple, the trailblazing blockchain company specializing in international transfers, executed a mysterious transfer of 46.34 million XRP tokens worth approximately $24.75 million. The transaction, as reported by Whale Alert, involved the movement of these substantial funds from Ripple's official address to an undisclosed wallet identified as \"rP4X2.\"\n\nAdvertisement\n\nThe enigmatic wallet, first activated in October of the previous year with an initial transfer of 70 million XRP, has gained attention due to its characteristic large volume of transactions. Currently, it holds almost 50.7 million XRP, raising questions about its significance within the broader Ripple ecosystem.\n\nXRP price outlook\n\nSimultaneously, as Ripple carries out this unexpected maneuver, the XRP token's market performance hangs in the balance. Recent weeks have witnessed a downturn in the token's value, bringing it to a critical level of dynamic support dating back to January of the preceding year.\n\nHistorically, this juncture has acted as a reliable point of recovery for XRP; however, the current market conditions, characterized by uncertainty and fear, make predicting the token's trajectory a challenging task.\n\nThe looming month of February, just two days away, historically holds ominous undertones for the XRP price. While favorable market conditions could potentially favor XRP finding a local bottom at its current support level, the prevailing ambiguity in the market suggests a cautious approach.\n\nInvestors and XRP enthusiasts should pay close attention to these developments, as the mysterious transfer of millions of tokens adds an additional layer of intrigue to an already uncertain market landscape."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9yaXBwbGUteHJwLXByaWNlLWZvcmVjYXN0LTM4MG0tb3Blbi1pbnRlcmVzdC1oaW50cy1hdC1jb3JyZWN0aW9uLTE0MDYwMTjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ripple (XRP) Price Forecast: $380M Open Interest might trigger a major move - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbmdhcGUuY29tL3JpcHBsZS1vZmZsb2Fkcy00Ni1tbG4teHJwLXRva2Vucy1hbWlkLXByaWNlLXJlYm91bmQtbm9zZWRpdmUtYWhlYWQv0gFdaHR0cHM6Ly9jb2luZ2FwZS5jb20vcmlwcGxlLW9mZmxvYWRzLTQ2LW1sbi14cnAtdG9rZW5zLWFtaWQtcHJpY2UtcmVib3VuZC1ub3NlZGl2ZS1haGVhZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Ripple Offloads 46 Mln XRP Tokens Amid Price Rebound, Nosedive Ahead? - CoinGape",
        "content": "Ripple’s XRP has experienced a significant rebound today, erasing losses from the previous week. However, the XRP community is unsettled by significant selloffs and notable whale movements, further contributing to market uncertainty. Adding to the unease, Ripple has executed a substantial transfer of 46 million XRP tokens lately. This raised concerns about another impending selloff amid heightened volatility.\n\nRipple Dumps Massive XRP Reserve\n\nA recent post on X by Whale Alert, an on-chain tracking platform, brought attention to this massive XRP transaction carried out via its parent company, Ripple. The sizable transfer has sent shockwaves through the community, with expectations of a considerable selloff that could potentially drive the XRP price lower despite the recent rebound.\n\nadvertisement\n\nThe Whale Alert post suggests that Ripple has offloaded 46.34 million XRP tokens, valued at $24.74 million. The transaction was directed toward an undisclosed wallet. Moreover, according to data from Bithomp, an XRP ledger explorer, Ripple currently holds an extremely small XRP reserve now. Ripple currently holds just 270 XRP tokens, equivalent to $147. However, there are strong chances that Ripple might buy XRP to boost its reserve in the future.\n\nAdding to the dynamics, another major whale transaction has been reported by Whale Alert. This transaction involved the transfer of 27.10 million XRP tokens, equivalent to $14.57 million, to Bitstamp, a crypto exchange. The transfer was conducted via an unidentified wallet. Moreover, the recurrence of significant selloff moves in these transactions raises further concerns within the XRP community as the crypto price has just rebounded past $0.53.\n\nAlso Read: Ripple Vs SEC: XRP Lawyer John Deaton Gears Up To Share Exclusive Insights\n\nXRP Price Action\n\nThe XRP price recently climbed the $0.53 mark as the crypto market witnessed a shift to the green ahead of the upcoming FOMC meeting. As of writing, XRP traded at $0.533, gaining 1.03% on Tuesday, January 30. The crypto held a market valuation of $28.98 billion, up 1.01%.\n\nMoreover, the 24-hour trading volume for XRP boosted by a massive 33.73% to $909.06 million. Furthermore, the XRP crypto price soared from a bottom of $0.5206 to a peak of $0.5396 during the day. However, according to XRP Captain, an XRP supporter and crypto analyst, the XRP price is poised to drop below $0.50 soon.\n\nThis prediction aligns with the concerns regarding the recent major sell-offs. On the contrary, he also noted that the price crash event would take place before XRP experienced a Falling Wedge breakout. In addition, XRP Captain noted that the XRP price would surpass the $0.64 after the breakout.\n\nAlso Read: XRP Whale Offloads 27 Mln Tokens to Bitstamp, Will XRP Price Drop Below $0.50?"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5pbmR5c3Rhci5jb20vcGljdHVyZS1nYWxsZXJ5L3Nwb3J0cy9oaWdoLXNjaG9vbC8yMDI0LzAxLzMwL3Jvbi1wYXR0ZXJzb24tZ2l2aW5nLWJhY2stdG8taXBzLWFzLW1pZGRsZS1zY2hvb2wtdGVhY2hlci1jb2FjaC83MjQxNDIyNzAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Former Broad Ripple star Ron Patterson giving back to IPS as middle school teacher, coach - IndyStar",
        "content": "HIGH SCHOOL\n\nFormer Broad Ripple star Ron Patterson giving back to IPS as middle school teacher, coach\n\nRon Patterson, former Broad Ripple High School and IUPUI star, coaches the Arlington Middle School girls basketball team Wednesday, Jan. 24, 2024, during a game against Harshman Middle School Arlington at Arlington Middle School in Indianapolis. \"Even if I didn't go as far as I wanted to with basketball now I pass it down to my kids, my students that I'm teaching,\" Patterson said. Joe Timmerman/IndyStar\n\nRon Patterson, former Broad Ripple High School and IUPUI star, coaches the Arlington Middle School girls basketball team Wednesday, Jan. 24, 2024, during a game against Harshman Middle School Arlington at Arlington Middle School in Indianapolis. \"When I was younger, I was kind of a hothead,\" Patterson said. \"If I knew what I know now, I never would have been that type of player and I'm trying to put that in these kids heads now.\" Joe Timmerman/IndyStar\n\nRon Patterson, former Broad Ripple High School and IUPUI star, helps his daughter, Nori, put on her shoes Wednesday, Jan. 24, 2024, after a win against Harshman Middle School Arlington at Arlington Middle School in Indianapolis. \"(My players) need someone like me who knows the game and has been around it for a long time,\" Patterson said. \"And my daughter, she's starting to play so one day I want to be able to coach her.\" Joe Timmerman/IndyStar\n\nRon Patterson, former Broad Ripple High School and IUPUI star, right, coaches Arlington Middle School girls basketball player NaZari Harrison (20) on Wednesday, Jan. 24, 2024, during a game against Harshman Middle School Arlington at Arlington Middle School in Indianapolis. \"I didn't have nobody I could turn to at my age and talk to who played basketball at a high level which I did,\" Patterson said. \"So I try to give as much back as I can, as much knowledge back to the game for these young kids.\" Joe Timmerman/IndyStar\n\nRon Patterson of Broad Ripple High School drives on a rival in a game in 2011. Robert Scheer/IndyStar\n\nRon Patterson, IUPUI, Sr. (Broad Ripple/Indianapolis) Joe Ahlquist / Argus Leader\n\nRon Patterson of IUPUI Justin Casterline/IUPUI\n\nCarsen Edwards of Purdue and Ron Patterson of IUPUI fight over a loose ball Sunday, December 10, 2017, at Mackey Arena. Purdue defeated IUPUI 86-61. John Terhune/Journal & Courier\n\nNorthern Kentucky Norse guard Lavone Holland II (30) is blocked at the rim by IUPUI Jaguars guard Ron Patterson (25) in the first half during the college basketball game between the IUPUI Jaguars and the Northern Kentucky Norse, Thursday, Dec. 28, 2017, at BB&T Arena in Highland Heights, Ky. Kareem Elgazzar/The Enquirer\n\nBroad Ripple's Ron Patterson Matt Kryger/IndyStar\n\nFrom left, IUPUI basketball senior Ron Patterson, 25, poses for a portrait with his son BJ, at Ron's mother's home in Indianapolis, Friday, Feb. 23, 2018. The Broad Ripple grad originally intended to play for Indiana University as part of \"The Movement,\" but instead earned a degree at Brewster Academy prep school and attended Syracuse University for a stint, before personal matters led him home to IUPUI. Patterson will play his senior day game with the Jaguars on Sunday, Feb. 25, 2018. Jenna Watson/IndyStar\n\nFrom left, IUPUI basketball senior Ron Patterson, 25, poses for a portrait with his son BJ, at Ron's mother's home in Indianapolis, Friday, Feb. 23, 2018. The Broad Ripple grad originally intended to play for Indiana University as part of \"The Movement,\" but instead earned a degree at Brewster Academy prep school and attended Syracuse University for a stint, before personal matters led him home to IUPUI. Patterson will play his senior day game with the Jaguars on Sunday, Feb. 25, 2018. Jenna Watson/IndyStar"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vcGV0YXBpeGVsLmNvbS8yMDI0LzAxLzMwL3NwYWNleC1yb2NrZXQtY2F1c2VzLW1vb24tdG8tcmlwcGxlLWluLXBob3RvZ3JhcGhlcnMtZmFudGFzdGljLWltYWdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "SpaceX Rocket Causes Moon to Ripple in Photographer's Fantastic Image - PetaPixel",
        "content": "A photographer captured a thundering photo of a Falcon Heavy SpaceX rocket passing in front of the Moon — making the edges of Earth’s satellite look as if they’re rippling.\n\nSteven Madow’s photo was years in the making and took extensive, precision planning that saw him rock up in a “random parking lot” in a small city close to the John F. Kennedy Space Center in Florida.\n\nMadow had made attempts to get the photo in late 2022 when the Artemis mission blasted off to go around the Moon and again in February 2023 when he was close but no cigar. But on December 28, 2023, Madow nailed the shot.\n\n“For the planning, I realized a day or so before the launch that Moonrise was about 40 minutes before the launch,” Madow tells PetaPixel.\n\n“A Moon right on the horizon would make a shot like this easier to plan since the rocket wouldn’t be as high up. The higher it goes, the more challenging it is to understand the trajectory and line it up with the Moon.\n\n“So, to get an idea of where to stand, I started off with TPE (The Photographer’s Ephemeris) and roughly lined up where the Moon would be compared to the launchpad.”\n\n“From there, I was able to input some trial GPS coordinates into a platform called Flightclub.io. This website is normally used to plan long exposure nighttime launch photos (like this one that was previously featured on PetaPixel),” he continues.\n\n“It’s easy enough — input your location, your focal length, and the launch, and it will simulate how the rocket streak will look!”\n\n“However, in addition to planning the long exposure shot, with some more advanced usage, it is possible to input an extreme focal length and use the prediction to line things up with the Moon,” he says.\n\n“All of this coming together required the math behind this program to be precise. It’s incredibly challenging for the developer to get it right to this level of accuracy because he is limited to public data.\n\n“And in the case of this launch, nothing was in our favor. It was a brand new trajectory that this rocket had never flown, a top-secret Space Force launch (meaning less data available), and the Moon was relatively high up.\n\n“On top of all that, the available locations where things could line up were either not accessible (not public land) or had tons of trees that could block the Moon.”\n\nDespite all the hurdles, the shot worked out. The Moon rose above the tall trees just five minutes before the launch and when it perfectly crossed the lunar surface Madow says he screamed with joy at the top of his lungs.\n\nMadow set up four cameras in total across several hundred feet of latitude. Three of them were filming video with only one getting a great shot (see GIF below) where the air disturbance is clearly visible.\n\nTo capture the photo, Madow used a Panasonic LUMIX G9 II with a PanaLeica 100-400mm lens (at 400mm) and the shutter set to 1/1000 — the photo is just one single exposure.\n\n“I shot on my fastest burst mode (14 frames per second) and tested the buffer to know how long I could shoot. This camera was just released in late 2023 and it performs extremely well in this regard,” he says.\n\n“Everything was locked down on fully manual settings (including focus). I decided to underexpose for the Moon by a stop or two and figured that the rocket would be nicely silhouetted.\n\n“Amazingly, many people think that it was faked and that makes me like it even more. It is one of my least processed images and I was so happy to pull it off as a single shot.”\n\nWhat Causes the Moon to Ripple?\n\nMadow’s photo was selected as NASA’s Astronomy Picture of the Day; the space agency explains that the Moon ripples because of pockets of hot air emitted from the rocket deflecting moonlight less strongly than the pickets of cool air.\n\nThe rocket in the photo was part of the USSF-52 mission with the Falcon Heavy rocket carrying the X-37B — the U.S. military’s secretive X-37B robot spaceplane. The Boeing-built vehicle, roughly the size of a small bus and resembling a miniature space shuttle, is built to deploy various payloads and conduct technology experiments on years-long orbital flights.\n\nMore of Madow’s work can be found on his website, Facebook, Twitter, and Instagram.\n\nImage credits: Photographs by Steven Madow."
    }
]