[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS92aWRlby82MzQ1MTE3ODQ4MTEy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Blockchain cannot ‘thrive’ if it remains in a closed network: Brad Garlinghouse - Fox Business",
        "content": "Log in to comment on videos and join in on the fun."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMioAFodHRwczovL3d3dy53dGhyLmNvbS9hcnRpY2xlL25ld3MvbG9jYWwvaG9wY2F0LWJyb2FkLXJpcHBsZS10by1jbG9zZS1ieS1lbmQtb2YtamFudWFyeS1pbmRpYW5hcG9saXMtaW5kaWFuYS1jcmFmdC1iZWVycy81MzEtZGUyMDBhMTItNDE1Zi00MDRiLWFhYTItNjBjMTE3M2IyMzY40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "HopCat closing Broad Ripple bar - WTHR",
        "content": "The bar opened in 2014 and was located at the intersection of College and Broad Ripple avenues.\n\nINDIANAPOLIS — A popular Broad Ripple bar has announced they will close by the end of the month.\n\nHopCat, located at 6280 N. College Ave., announced in a Facebook post Thursday that their last day of business will be Sunday, Jan. 28.\n\nOpened in 2014, HopCat offers more than 100 craft beer choices in the heart of Broad Ripple.\n\nThe bar's closure means Indiana will no longer have a HopCat location. The franchise has 10 locations in Michigan and one location in Nebraska.\n\n\"We thank you for your support and hope to see you before we close our doors later this month,\" read the social media post announcing the closure."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmluZHlzdGFyLmNvbS9zdG9yeS9lbnRlcnRhaW5tZW50L2RpbmluZy8yMDI0LzAxLzE4L2hvcGNhdC1icm9hZC1yaXBwbGUtY2xvc2luZy1qYW51YXJ5LzcyMjY5ODIwMDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "HopCat Broad Ripple announces it will close this month - IndyStar",
        "content": "After 10 years, brewery chain HopCat will pull out of the Hoosier state.\n\nThe Grand Rapids, Michigan-based brewery opened its third location at 6280 N. College Ave. in Broad Ripple, its first outside Michigan, in 2014. The Broad Ripple location announced in a Facebook post the site will close after Jan. 28.\n\n\"Please join us in raising a pint to our amazing staff, many of whom have been with us since we opened our doors,\" the post said. \"We thank you for your support and hope to see you before we close our doors later this month.\"\n\nThe Broad Ripple location sold beer from several Indianapolis breweries including Sun King, Big Lug Canteen, Bier Brewery and more. Munster-based 3 Floyds and Bloomington-based Upland were also represented alongside HopCat's take on classic pub food, including their famous fries, once known as \"crack\" and in recent years rebranded as \"cosmik fries.\"\n\nHopCat will exit a high-profile spot along the Red Line near the Central Canal. The company maintains 10 other breweries, nine in Michigan and one in Lincoln, Nebraska.\n\nNeed a break? Play the USA TODAY Daily Crossword Puzzle.\n\nContact dining reporter Bradley Hohulin at bhohulin@gannett.com. You can follow him on Twitter/X @bradleyhohulin."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vYml6ZmF5ZXR0ZXZpbGxlLmNvbS90ZWNobm9sb2d5LzIwMjQvMS8xOC9yaXBwbGUtZmliZXItdG8tZXhwYW5kLWRpZ2l0YWwtYWNjZXNzLWZvci1yZXNpZGVudHMtYWNyb3NzLW1vb3JlLWNvdW50eS8yNjA00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Ripple Fiber to expand digital access for residents across Moore county | BizFayetteville - Greater Fayetteville Business Journal",
        "content": "The Ripple Fiber of Moore county team celebrate the official ribbon cutting of their Pinehurst location! Photo courtesy of Ripple Fiber of Moore County.\n\nRipple Fiber, a fiber optic internet provider based in the Southeast, officially joined the local community with a celebratory ribbon cutting, alongside the Moore County Chamber of Commerce.\n\nMany residents within the greater Pinehurst area will soon have access to innovative technology, with Ripple Fiber aiming to bring its fiber internet service to other surrounding communities in the near future.\n\n“The Ripple Fiber team is honored to bring fiber internet to the Moore County community to provide residents with a better communications infrastructure,” says Greg Wilson, CEO of Ripple Fiber in a press release. “At the core of our business is our desire to bring cutting-edge technology to the places that need it, setting them up for the future of telecommunications.”\n\nDriving digital transformation across the world, fiber internet is a powerful solution that functions at the speed of light. It transmits data through light pulses and is less susceptible to outside interference, making the fiber optic connections uniquely durable and strong.\n\nWith Ripple Fiber’s future-focused approach, residents of Moore County will have access to an infrastructure that will power the area for decades to come. Whether subscribers are using their internet for remote work or video streaming, they can rely on this service for exceptional bandwidth and impressive upload and download speeds.\n\n“As part of this community, we look forward to expanding access for local residents and improving their everyday lives,” adds Kylar Martin, Regional Executive in a press release. “Not only is Ripple Fiber committed to investing in the area’s infrastructure, but we will also invest in community partners and organizations that are valuable to our future customers to help build a brighter tomorrow.”\n\nRipple Fiber provides thousands of homes with lightning-fast connectivity through the utilization of its fiber optic network and patented software. Its team is dedicated to expanding access and constructing strong infrastructures in communities nationwide. Embracing optimism and recognizing the importance of digital equity, Ripple Fiber strives to empower its customers by equipping them with the necessary tools to build a bright future.\n\nRipple Fiber’s local office is located at 7647 NC 211 Highway, Suite A, West End, North Carolina.\n\nResidents in Moore County who would like to learn more about Ripple Fiber’s offerings and stay\n\nupdated on future availability in their neighborhood can visit www.ripplefiber.com and follow along on social media (@ripplefiber) for updates.\n\nEditor’s note: More on this location including words Ripple Fiber leadership will be featured in our upcoming “New Year, New Business” issue coming to the public on Jan. 26."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMivgFodHRwczovL3d3dy5uZXdzd2lzZS5jb20vYXJ0aWNsZXMvbnVzLXNjaG9vbC1vZi1jb21wdXRpbmctcmVjZWl2ZXMtdXMxLW1pbGxpb24tZ3JhbnQtZnJvbS1yaXBwbGUtcy11bml2ZXJzaXR5LWJsb2NrY2hhaW4tcmVzZWFyY2gtaW5pdGlhdGl2ZS10by1mdXJ0aGVyLWFkdmFuY2UtZmluYW5jaWFsLXRlY2hub2xvZ3ktZWR1Y2F0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "NUS School of Computing receives US$1 million grant from Ripple's University Blockchain Research Initiative to further ... - Newswise",
        "content": "Singapore, 17 January 2024 — The FinTech Lab at the National University of Singapore’s (NUS) School of Computing has received a generous grant of US$1 million from global enterprise blockchain and crypto solutions provider Ripple’s University Blockchain Research Initiative (UBRI). The new funding will support FinTech Lab’s operations for the next two years and extend Ripple and NUS’ existing collaboration in promoting innovation and thought leadership in fintech.\n\nNewswise — Established in November 2019, NUS FinTech Lab has evolved to become a strategic hub at the core of Singapore's vibrant fintech and business ecosystem, providing strategic dialogue and research-driven innovation. Through initiatives such as the FinTech Brew, a regular coffee chat series, the Lab brings the latest ideas and brightest minds together in an informal setting where students and business leaders meet to address and discuss the challenges facing the fintech sector. Additionally, the FinTech Lab’s regular podcast series extends its reach globally, providing both local and international audiences with valuable insights into its work.\n\nCommitment to innovation and collaboration\n\nProfessor Tan Kian Lee, Dean of NUS School of Computing, emphasised the FinTech Lab's role in bridging theory and practice. He said, \"This new phase of the NUS FinTech Lab symbolises our dedication to merging academic inquiry with practical industry solutions, fostering an ecosystem rich in innovation and impact.\"\n\n“NUS joined UBRI’s roster of incredible global academic partners in 2019 and has been driving innovation at scale through the NUS FinTech Lab ever since. We’ve been extremely impressed with the work to come out of this partnership – NUS has excelled at supporting an extremely active student fintech society, launching a new EVM sidechain validator, and maintaining an XRPL validator – not to mention the UBRI-funded NUS FinTech SG Programme, an advanced professional certificate initiative with 200 graduates achieving full-time job offers in fintech and over 50,000 programme participants receiving training in fintech via webinars, festivals, community events and more,” said Eric van Miltenburg, Senior Vice President of Strategic Initiatives at Ripple. “We look forward to many more years of collaboration as Singapore and NUS continue to pave the way for digital asset innovation and cement the country’s status as one of the leading fintech hubs in the region.”\n\nIn line with the University and the School’s mission, the FinTech Lab actively supports innovation and research leadership in partnership with industry, collaborating with Ripple’s UBRI programme and other business partners to catalyse knowledge sharing and collaborative inquiry. It also inspires students and young researchers to take up the greatest challenges in today's digital economy through regular workshops, conferences, hackathons, and knowledge transfer partnerships.\n\nRecognising the pivotal role of academic rigour in advancing the global fintech sector, and expressing appreciation for Ripple’s support, Professor Hahn Jungpil, Director of the NUS FinTech Lab, added, “The UBRI programme’s steadfast support is invaluable in our mission to blend rigorous academic research with real-time solutions to address critical industry challenges, leading to impactful advancements in financial technology.”\n\nLooking ahead\n\nDrawing on insights from the Singapore FinTech Festival – the world's largest gathering of fintech professionals, regulators and thought leaders – NUS FinTech Lab's agenda for the coming year will focus on the digital economy, digital assets and trusted AI and governance.\n\nNUS FinTech Lab looks forward to engaging with many more business partners and policy-making institutions in months to come, as it embarks on the next exciting phase of development.\n\n------------------------------------------------------------------------------------------------\n\nAbout National University of Singapore (NUS)\n\nThe National University of Singapore (NUS) is Singapore’s flagship university, which offers a global approach to education, research and entrepreneurship, with a focus on Asian perspectives and expertise. We have 16 colleges, faculties and schools across three campuses in Singapore, with more than 40,000 students from 100 countries enriching our vibrant and diverse campus community. We have also established more than 20 NUS Overseas Colleges entrepreneurial hubs around the world.\n\nOur multidisciplinary and real-world approach to education, research and entrepreneurship enables us to work closely with industry, governments and academia to address crucial and complex issues relevant to Asia and the world. Researchers in our faculties, research centres of excellence, corporate labs and more than 30 university-level research institutes focus on themes that include energy; environmental and urban sustainability; treatment and prevention of diseases; active ageing; advanced materials; risk management and resilience of financial systems; Asian studies; and Smart Nation capabilities such as artificial intelligence, data science, operations research and cybersecurity.\n\nFor more information on NUS, please visit nus.edu.sg.\n\nAbout NUS FinTech Lab\n\nNUS FinTech Lab is a convening hub for interdisciplinary dialogue with academia, fintech industry, policy makers and regulators. Our lab is dedicated to advancing thought leadership, catalysing innovative research, and education with a focus on areas such as digital payments, data privacy, trust and security, regulatory compliance, and financial inclusion.\n\nFor more information, please visit fintechlab.nus.edu.sg.\n\nAbout Ripple\n\nRipple is the leader in enterprise blockchain and crypto solutions, transforming how the world moves, manages, tokenises and stores value. Ripple’s business solutions are faster, more transparent, and more cost effective - solving inefficiencies that have long defined the status quo. And together with partners and the larger developer community, we identify use cases where crypto technology will inspire new business models and create opportunity for more people. With every solution, we’re realising a more sustainable global economy and planet - increasing access to inclusive and scalable financial systems while leveraging carbon neutral blockchain technology and a green digital asset, XRP. This is how we deliver on our mission to build crypto solutions for a world without economic borders. Ripple is a global leader in enterprise blockchain solutions, providing infrastructure for payments, settlements, and asset issuance. Ripple's solutions enable banks, payment providers, and digital asset exchanges to send and receive money globally, instantly, securely, and cost-effectively.\n\nFor more information, visit ripple.com."
    }
]