[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmF0bGFudGFuZXdzZmlyc3QuY29tLzIwMjQvMDEvMjAvbW9yZS10aGFuLTIwLWdsYXNzLXJlY3ljbGluZy1iaW5zLWluc3RhbGxlZC1tZXRyby1hdGxhbnRhL9IBdWh0dHBzOi8vd3d3LmF0bGFudGFuZXdzZmlyc3QuY29tLzIwMjQvMDEvMjAvbW9yZS10aGFuLTIwLWdsYXNzLXJlY3ljbGluZy1iaW5zLWluc3RhbGxlZC1tZXRyby1hdGxhbnRhLz9vdXRwdXRUeXBlPWFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "More than 20 glass recycling bins installed in metro Atlanta - Atlanta News First",
        "content": "ATLANTA, Ga. (Atlanta News First) - A glass recycling company has installed more than 20 new recycling bins in metro Atlanta.\n\nRipple Glass’ distinctive purple bins have been installed as far south as Fayetteville and as far north as Milton. The company says that their bins are free and open to the public, and that anything recycled will be reused within 30 days.\n\nThe bins will accept glass jars and bottles, cosmetic jars, candle jars and drinking cups such as wine glasses and pints.\n\nA full list of drop-off locations can be found here.\n\nCopyright 2024 WANF. All rights reserved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1zZWMtdi1yaXBwbGUtYnJhZC1nYXJsaW5naG91c2Utc2VjLXYtY29pbmJhc2UtYW5kLWdhcnktZ2Vuc2xlci0xNDAzMzg10gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "XRP News: SEC v Ripple, Brad Garlinghouse, SEC v Coinbase and Gary Gensler - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3JpcHBsZXMtY3RvLWNob29zZXMtcmlwcGxlLXNoYXJlcy1vdmVyLXhycC1hbi1pbnNpZGUtbG9vay_SAVlodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9yaXBwbGVzLWN0by1jaG9vc2VzLXJpcHBsZS1zaGFyZXMtb3Zlci14cnAtYW4taW5zaWRlLWxvb2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ripple’s CTO Chooses Ripple Shares Over XRP: An Inside Look - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nXRP’s price is on the rise, and Ripple, despite past legal challenges, seems set for a positive turn, especially with hopes of a Bitcoin ETF approval. In a recent talk, Ripple’s CTO, David Schwartz, shared some inside info.\n\nRipple CTO Shares His Bold Investment Moves\n\nDavid Schwartz, Ripple’s Chief Technology Officer (CTO), has made his bold choices public via his X post, he is drooling over Ripple shares more than XRP. But before that let’s analyse the real cause behind the move.\n\nIs it true that you decided to receive the ripple shares rather than the digital asset xrp? — 0 DOUBT (@GwenAlan) January 8, 2024\n\nLooking at the stats, Ripple boasts a substantial 46.55 billion XRP, accounting for about 46.5% of the total supply. And if you Break it down, they have 5.258 billion XRP ready for use and 41.3 billion XRP securely locked away, with a monthly release and relock mechanism in place, releasing and locking up a billion tokens each month.\n\nPlus, Ripple sold almost 892 million XRP in the Q3 2023 report, causing a grave concern that these sales might be impacting XRP prices negatively. Some in the community have suggested a bold move—getting rid of Ripple’s escrow balance. However, Schwartz clarified that it’s not a straightforward decision. He outlined two primary choices: holding onto the XRP or systematically selling it off, emphasizing the company’s goal to swiftly reduce its holdings.\n\nIn December, Ripple made news when it sold a huge amount of XRP tokens, 238 million of them, for $142 million. As Coinpedia News already reported, this amount is three times what Ripple usually sells each month. Such a big jump naturally led to conversations in the Bitcoin community and questions about Ripple’s plan.\n\nThat’s why when the idea of burning the escrow was raised, Schwartz expressed skepticism, stating it wouldn’t bring any tangible benefits.\n\nCTO Crossover Could Hurt XRP?\n\nAfter promoting the XRP ledger game. Schwartz recently said that he chose Ripple shares over XRP. Nevertheless, he also said he wasn’t sure if it was the right choice. Later, he thought that his holdings might be more flexible now if he had picked XRP. Currently, Ripple’s shares are worth about $11.3 billion, and the company wants to buy them back for $285 million. Furthermore, Brad Garlinghouse, the CEO of Ripple, made it clear that the company has no quick plans for an initial public offering (IPO)."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vcHN5Y2huZXdzLnBzeWNoaWF0cnlvbmxpbmUub3JnL2RvaS8xMC4xMTc2L2FwcGkucG4uMjAyNC4wMi4yLjI50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Mental Health Matters: The Ripple Effect on Youth Violence - Psychiatric News",
        "content": "Violence impacts many youth, which increases their risk to commit violence themselves. Psychiatrists are critical to identifying and treating these youth and breaking the cycle.\n\nGetty Images/iStock/ryasick\n\nYouth violence is a significant public health emergency and affects thousands of young people daily. The ripple effect of this violence is far reaching and impacts families, communities, and schools. The exposure to violence has disrupted our youth’s development and can lead to long-lasting mental health issues such as impaired decision-making, difficulty coping with stress, isolation, and delays in learning.\n\nResearch on youth involved in violence has increased the understanding of risk factors linked to violence. For example, toxic stress resulting from bullying (physical, mental, and cyber), food insecurity, and living in impoverished communities or in homes with violence contribute to the likelihood of youth experiencing violence and/or mental health issues. Exposure to violence often leads to disruption in a young person’s life, and manifests in different forms, such as missed school, displaying at-risk behaviors, substance use, or isolation. Violence prevention is central to promoting teen mental health and wellness.\n\nPsychiatrists are integral to recognizing these at-risk situations youth face. Because there is no stereotypical profile of a violent youth offender, early identification, assessment, and intervention are key.\n\nMonitoring and acting when warning signs are exhibited may reduce the risk for violence. Maintaining open dialogues between parents, teachers, and health care professionals may help identify warning signs for violence and determine whether emergency intervention is required. Communication is a critical component in developing plans to reduce risk. Key warning signs to consider include the following:\n\nIncreased irritability.\n\nIntense expression of anger or impulsivity.\n\nSocial isolation.\n\nExpression of intent to commit a violent act.\n\nLack of coping skills.\n\nInformed consent, documentation, and duty to warn are key risk mitigation strategies. These strategies help to complement and strengthen one another, working together to minimize risks in a comprehensive, sustainable, and long-term manner.\n\nPrior to treating the patient, obtain proper written consent from the person with the legal authority to consent on behalf of the patient. This includes consent to speak with other health care professionals or school counselors as deemed appropriate.\n\nConduct a complete history and mental status assessment, which may include a review of medical records and collateral information from the child’s current and former behavioral health professionals, school counselors, and primary care physician.\n\nDocument contemporaneously, and complete thorough risk assessments.\n\nDocument changes in behavior, such as social disconnection, bizarre statements, or out-of-character actions.\n\nDocument assessment of whether the patient was a victim of bullying, cyberbullying, or perpetuating bullying.\n\nDocument expressions of thoughts of harm to self or others and aggressive behavior and note if the patient has any access to weapons.\n\nDocument use of drugs or alcohol.\n\nBe aware of your state’s specific laws regarding duty to warn.\n\nTreating youth who demonstrate violent tendencies can be arduous. Maintaining open lines of communication between parents, school professionals, and other providers may help to identify warning signs for violent behavior sooner. Remember to consistently document communications, assessments, and follow-up actions taken in the medical record.\n\nUnderstanding your state’s laws on duty to warn and confidentiality regarding reporting and disclosure is critical. If you have any questions regarding your duty to warn, do not hesitate to contact your risk management professional or seek legal counsel. ■\n\nThis information is provided as a risk management resource for Allied World policyholders and should not be construed as legal or clinical advice. This material may not be reproduced or distributed without the express, written permission of Allied World Assurance Company Holdings, Ltd, a Fairfax company (“Allied World”). Risk management services are provided by or arranged through AWAC Services Company, a member company of Allied World. © 2024 Allied World Assurance Company Holdings, Ltd. All Rights Reserved."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmVsb24uZWR1L3UvbmV3cy8yMDI0LzAxLzE5L3JpcHBsZS1jb25mZXJlbmNlLWNyZWF0ZXMtc3BhY2UtZm9yLWNvbm5lY3Rpb24tYWNyb3NzLWRpZmZlcmVuY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ripple Conference creates space for connection across difference - Today at Elon",
        "content": "Share this page on Facebook Share this page on X (formerly Twitter) Share this page on LinkedIn Email this page to a friend Print this page\n\nHow can members of the Elon university create a space on campus for people of all religious, spiritual and ethical identities to come together, engage in dialogue, and really listen to one another? Just ask Lucy Sneader ’24 and Rachel Curtis ’24, the co-directors of Elon University’s student-led Ripple Conference, who have set out to do just that.\n\n“I wanted to have a role in shaping the way our campus understands interfaith work,” Curtis, a multifaith Intern at the Truitt Center for Religious and Spiritual Life shared. “Now more than ever, conversations, compassion, and understanding are integral aspects to navigating live while keeping in mind the respect and dignity of all. As I learn and grow, I hope to then point others in that direction. My hope is that Ripple starts this work for some and continues it for others.”\n\nThe Ripple Conference, now in its 9th year, is Elon’s student-led interfaith conference that encourages participants to engage in genuine and fun interfaith work, explore their own identities, ask tough questions and further engage in sustained interfaith on their own campuses. Throughout the conference, which will be held Feb. 9-11, participants will be invited to build community with one another to build skills to dialogue across difference.\n\nSneader believes those community-building spaces are of the utmost importance. “I am looking forward to creating a space where people can be themselves and help each other learn and see different perspectives of the world,” she said. “I am also looking forward to learning with everyone who comes to the conference while also making connections with people I wouldn’t otherwise have the opportunity to meet and learn from.”\n\nElon’s Truitt Center for Religious and Spiritual Life has long been seen as a preeminent practitioner of multifaith work on college campuses, and the staff is always engaged in creating opportunities for education, celebration, and meaning-making around religious identity.\n\n“The Ripple Conference is a unique space for university students and religious and spiritual life advisors from across the region to come together, listen, and learn about emergent ideas and strategies that are significant to multifaith engagement in our time,” shared Rev. Kirstin C. Boswell, university chaplain and dean of multifaith engagement. “Our conference adviser works hard to support our student leadership in curating a space that is student-led, and relevant to the challenges and opportunities that this generation is facing.”\n\nThis year’s theme, Interfaith Around the World, is especially important to both Curtis and Sneader, who have both spent extensive time outside the United States.\n\n“We are not as different as it seems,” explains Curtis. “Throughout my study abroad in Peru and Morocco, I have encountered enriching relationships with people from very different backgrounds from me. These have been some of my most valuable experiences as I have come to understand that though we may have different understandings of the world, many of these traditions point to similar values that I can relate deeply to.”\n\nSneader, Curtis and the leadership team – Rocco Albano, Ryan Gibbons, Alex James, Hasan Khan, Caden Samuel, Madison Williams, and Morgan Williams – work together to design the entire conference experience. From the theme and main speakers at the conference, to the logistics and marketing and public relations, to the content of breakout sessions, the community art project, and the Sacred Sounds coffee house, Ripple is student-led and staff-supported by conference advisor Hillary Zaken, interim assistant dean of multifaith engagement.\n\nAt the conference, participants will ask: how do different expressions of religious and spiritual identity vary around the world? What kind of diversity is there within each religious tradition? And how does the practice of different religious, spiritual, and ethical traditions differ within diverse geographic regions? This year, as part of the theme, the conference will incorporate a celebration of the Lunar New Year, a teaching Shabbat and a teaching Mass for the first time.\n\n“Ripple means learning how identities and faith can come together, and even make the world a better place for everyone to live in,” shared Sneader. “We learn more when we have people with different perspectives and identities around us.”\n\nMore about the Ripple Conference:\n\nEarly Bird Registration for the Ripple Conference is now open and will run through Jan. 21.\n\nRegistration information can be found at rippleconference.org. Elon students, faculty, and staff are invited to reach out to conference adviser Hillary Zaken or co-directors Rachel Curtis or Lucy Sneader with questions, and for codes for discounted participation.\n\nOn the conference website, you can register, apply for leadership roles, and view other conference details as they become available. Opportunities include leading Breakout Sessions, Community Groups, Affinity Groups, or performing in the Sacred Sounds Coffee House.\n\nFor more information and updates about the Ripple Interfaith Conference, please follow Elon University’s Truitt Center for Religious and Spiritual Life on Instagram and Facebook and visit the Truitt Center website or the Ripple Conference page."
    }
]