[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9yaXBwbGUtZXhlYy1zYXlzLXRoZXJlLXdhcy11bmF1dGhvcml6ZWQtYWNjZXNzLW9uLXBlcnNvbmFsLXhycC1hY2NvdW50cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Ripple Exec Says There Was 'Unauthorized Access' on Personal XRP Accounts | Video - CoinDesk",
        "content": "It's time now to take a look at what's trending. And today we're talking about crypto crime or maybe a lack thereof. Let's just let's see how it goes on this segment. We break down what happened in some of the most talked about stories in this industry. Yesterday, we took a look at the latest report from immun V that found hacks and scams were up six times from January 2023. This comes as XRP saw some price movement on Wednesday as folks tried to figure out if ripple was hacked or not. Ok. Spoiler alert, it turns out it was not hacked. So here's what have it after speculation that the network might have been hacked to the tune of 100 and $12.5 million. Ripple. Executive Chairman Chris Larson took to X to say that his personal XRP accounts were accessed by an unauthorized entity but noted that the problem was quickly caught and all affected addresses were frozen. The incident was initially flagged by Blockchain sleuth. Zack X BT noted that hundreds of millions of XRP were siphoned out of a large wallet on the Xrp ledger Blockchain and sent to multiple exchanges. Larsen continued on X stating quote, this is an isolated incident and ripple wallets are secure slash were never compromised. We've confirmed nearly all affected funds were converted out of XRP end quote. He also noted that law enforcement is now involved as expected. Folks weighed in on X Michael Wood hopes that people learn from Zack X BT s work and also from this incident. He said, quote, I really hope but doubt that people learn through your diligent work. People really need to set up proper checks and balances on asset storage, especially of this size. And even more, if you're a founder or executive, this should really be understood at minimum as negligence and quote. While off grid 212 point out the benefit that this situation highlights. They said, quote, that's the benefit of Blockchain can eradicate a lot of fraud as fully traceable and quote. Now, what do I think if there's one thing that we should take away from the story is that we should all do our best to protect ourselves online because even the most savvy folks, even the executives in this industry can fall victim to hacks and scams and these scams are getting more and more sophisticated."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1mYWtlLW5ld3MtdGhlLXNlYy12LXJpcHBsZS1jYXNlLWFuZC10aGUtbW90aW9uLXRvLWNvbXBlbC0xNDA2NDk20gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "XRP News: Fake News, the SEC v Ripple Case, and the Motion to Compel - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vaHJleGVjdXRpdmUuY29tL3doYXQtaHItY2FuLWRvLXRvLW1heGltaXplLXRoZS1wb3NpdGl2ZS1yaXBwbGUtZWZmZWN0LW9mLWNvYWNoaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Coaching and its 'ripple effect'; what HR needs to know - Human Resource Executive®",
        "content": "Does coaching have a broader impact than the manager immediately supported and developed by it? Many of us suspect the answer is “yes,” but until now, there’s not been any data to say either way.\n\n- Advertisement -\n\nAt last, we have the data to indicate that by investing in a manager’s capabilities with coaching, the benefit extends beyond that individual. In Torch’s new research, 91% of respondents saw positive changes in their skills after their manager received coaching.\n\nOf the top 10 changes respondents say they saw in their manager who received coaching, the most common was that the individual had become a “better manager or leader overall.”\n\nThat means that HR needs to start thinking about leveraging this side effect, which we might term the positive “coaching ripple effect.” But to get there? Let’s explore what this new data tells us.\n\nThe impact of coaching on communication\n\nWe set out to answer the following question: When people begin to behave differently due to coaching, what changes, if any, do their direct reports experience? The data shows that direct reports see their managers change from coaching in multiple ways, with most citing significant changes in the range and depth of their communication skills.\n\nRespondents observed more frequent and transparent communication from their manager, improvement in their manager’s ability to receive and deliver feedback, and even better communication among team members. “Since my manager’s coaching, the standout change at work is the evident shift in how our team communicates,” one line of business practitioner wrote. “Meetings have transformed into focused, open and inclusive sessions, valuing every team member’s input. This shift has nurtured better collaboration.”\n\nAll in all, six of the top 10 selections from respondents fall under positive change in communication, which extends beyond being clear and concise and having “executive presence.” In contrast, the findings illustrate that the best communicators are open to feedback, empathetic feedback-givers, active listeners and experts at managing difficult conversations.\n\nWhen managers grow, direct reports change, too\n\nNow, we can definitively say that, as a result of their manager getting coached, employees are developing new skills, shifting their mindset and having a better overall employee experience. Research suggests that 44% of workers’ skills will need to shift in the next five years and that the most important new skills include relational or soft skills like self-awareness, flexibility and resilience.\n\n- Advertisement -\n\nAnd when a manager helps their team develop new skills, this benefits individuals and organizations. Nine out of 10 respondents say they developed new skills as a result of their manager being coached, including continuous learning (51%), coordinating with others (49%), building high-performing teams (48%), and better self-perceived communication (47%) and strategic skills (41%).\n\nWith 51% of respondents sharing that their manager has helped encourage them to learn continuously, in some cases by encouraging a growth mindset, it’s no surprise that mindsets, in general, are another big area where employees are experiencing change.\n\nA growth mindset is the belief and attitude that one’s abilities and intelligence can be developed and improved through effort, learning and persistence. Our data shows that 67% of respondents are more likely to seek opportunities to develop new skills, and 61% are more likely to see mistakes or failures as opportunities for growth after their manager has been coached—strong indicators of a stronger growth mindset.\n\nEven better, more than two in three respondents strengthened their sense of self-efficacy, the belief in one’s ability to accomplish a task, based on their perception of their competence and effectiveness.\n\nSee also: 5 benefits to rebooting the performance review with a coaching mindset\n\nWhat about employee experience? This category is about how someone feels at work—their sense of psychological safety and belonging and whether they feel valued and recognized for their efforts and who they are. An employee’s experience of safety and belonging is crucial for retention and performance.\n\nWhen psychological safety isn’t present, it can result in employees not speaking up out of fear of retaliation, and a lack of psychological safety can have a “disproportionately toxic impact on engagement and belonging,” write authors Maren Gube and Debra Sabatini Hennelly in The Harvard Business Review.\n\nAnd on this vital metric, according to our respondents, coaching leaders also helps. Seventy-nine percent of the team members we spoke to in organizations where coaching and mentoring are embedded report a moderate level of improvement in their experience at work since their manager received coaching.\n\nThis shows up in two key ways. First, 65% say they can be more of themselves at work, and 72% say they feel safer offering their opinion, even if it’s different from their manager or the rest of the team. Second, 63% agree that they feel more valued for their unique skills, and 64% feel their contributions are valued more often.\n\nMore time spent in coaching can drive a stronger ripple effect\n\nInterestingly, there was a significant difference in the impact of the ripple effect on direct reports when the manager had six months or less of coaching versus seven months or more.\n\nCompared to managers who experienced less coaching, managers who were coached for seven months or more had a stronger impact on direct reports’ work satisfaction, organizational commitment, positive attitude at work and sense of psychological safety.\n\nRetention, promotion and team performance are most likely to be positively impacted by the coaching ripple effect. Other research further verifies coaching’s organizational impact. The International Coaching Federation found that organizations that offered coaching strategically (i.e., offered multiple modalities for coaching, had a dedicated budget line item for coaching, etc.) were more likely to have high-performing employees, were more likely to retain those high-performing individuals and reported greater employee engagement scores across the organization.\n\nResearch also shows that direct reports of coached managers are more likely to be satisfied at work, to stay and to be committed to their organizations.\n\nWhy is this happening? We think it’s emotional contagion when our emotions inspire similar emotions in others. Social research shows those who have power, like managers, are more likely to see their emotions spread among direct reports, creating a loop of positivity. In parallel, leaders who express positive emotions boost their teams, leading them to feel more hope, resilience and optimism.\n\nEmployees who feel more positively are higher performing and create higher-performing teams—which, in a positive feedback loop, reinforces the leader’s positivity and leads to other positive outcomes like performance and retention.\n\nThere’s an important caveat to all of this research—the positive coaching ripple effect can’t happen without support. CEOs and leaders across the organization must create a culture that supports the shifts in behaviors that help all employees succeed. For instance, managers won’t necessarily try to become better at listening or delivering feedback if those behaviors aren’t rewarded or valued organizationally. Evidence suggests a really powerful way to amplify the ripple effect is by creating a coaching culture inside your organization.\n\nSumming up, HR leaders today can’t afford to invest in solutions that don’t scale or provide lasting change. This data suggests that coaching could be a cost-effective way of maximizing investment and positivity by letting the “ripple effect” start happening in your environment to help your organization in multiple ways.\n\nFor more on this topic, read the full Coaching Ripple Effect research report here."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm55dGltZXMuY29tL2F0aGxldGljLzUyNDM2OTYvMjAyNC8wMi8wMS9sZXdpcy1oYW1pbHRvbi1tZXJjZWRlcy1mZXJyYXJpLXNhaW56LXByaW1lLXRpcmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "The downturn that led Hamilton to Ferrari, and ripple effects on F1: Prime Tire - The New York Times",
        "content": "This is a digital version of the Prime Tire newsletter. Sign up here to receive this content in your inbox every Wednesday morning in the offseason.\n\nWelcome back to Prime Tire, where we’re wondering if you’ve heard the big news: the watch company H. Moser & Cie. announced its partnership with Alpine Motorsports today. Huge development in the world of Formula One, if not the world.\n\nOh, and Lewis Hamilton is leaving Mercedes for Ferrari in 2025. I’m Patrick, and Madeline Coleman will be along shortly. Let’s dive into some truly stunning Formula One news.\n\nThe end of an era\n\nThe Mercedes dynasty is officially over. Lewis Hamilton is leaving for Ferrari in 2025, ending a spectacular 11-year run at Mercedes that resulted in six world championships.\n\nHamilton, Ferrari and Mercedes all confirmed the move on Thursday. Mercedes held a team-wide meeting in the afternoon to announce the news to employees. Hamilton, the sport’s most popular driver in a generation, will now chase his record-breaking eighth world championship at F1’s most iconic team.\n\nMercedes-AMG PETRONAS F1 Team and Lewis Hamilton will part ways at the end of the 2024 season. Lewis has activated a release option in the contract announced last year. — Mercedes-AMG PETRONAS F1 Team (@MercedesAMGF1) February 1, 2024\n\nThe move also means Carlos Sainz will officially be on the driver market in 2025 when Hamilton partners with Charles Leclerc as Ferrari’s “superteam.”\n\nLet’s ask and answer some obvious questions.\n\nWhy is Lewis Hamilton leaving Mercedes?\n\nWe won’t know for sure until we can hear from Hamilton himself. I can think of a few possible reasons. I can count on one finger the times when Hamilton seemed truly happy about his performance in 2023 – his pole in Hungary. He remained pretty subdued and disheartened even as Mercedes scratched and clawed its way into a second-place constructor’s finish. The W14 wasn’t much fun to drive.\n\nGO DEEPER How Mercedes’ sobering 2023 F1 season reinvigorated its ‘Everest climb’\n\nHamilton’s departure means Mercedes will reflect on its ‘size-zero’ sidepod design with even more regret. The team badly missed on the new rules package in 2022, opting for a distinctive ‘no sidepod’look that created terrific high-speed downforce with minimal aerodynamic gains. Rather than abandoning it after a one-win season, Mercedes instead iterated on the design for 2023, hoping to not lose ground and time to Red Bull’s development.\n\nAdvertisement\n\nMercedes boss Toto Wolff defended the decision at the launch, saying, “If you change a concept, you can end up going three steps backwards to take two forwards.”\n\nIn the end, Mercedes is taking three steps backward anyway – the team has confirmed the 2024 car design is a complete overhaul. And that leads us to our next question.\n\nWhy now?\n\nLewis Hamilton is 39 years old. The clock is ticking on his career, and his chase for the outright record of eight world drivers’ championships is no doubt paramount. If he’s making this move now, he’s making it because he thinks Ferrari is closer to winning a championship. Between staff turnover and the “three steps backward” Mercedes forced itself to risk with the 2024 car redesign, it’s easy to see why Hamilton felt like his Mercedes chapter was drawing to a close.\n\n“I am 100% committed to delivering the best performance I can this season and making my last year with the Silver Arrows, one to remember,” Hamilton said on Thursday. (Kym Illman/Getty Images)\n\n“We were winning for such a long time, and when you win for so long, we all get complacent and take things for granted,” Hamilton told ABC News in November. “I think the pressure is, as you’re getting older, it gets harder to train. It’s harder to stay fit. It’s managing your time.”\n\nIn hindsight, time management was at the heart of Hamilton’s two-year renewal with Mercedes last fall. It gave him at least two years to complete the “unfinished business” with Mercedes, a goal so obviously dear to him. We now know the deal’s “exit clause” also allowed Hamilton to move on if Mercedes’ return to title form felt further away than he had hoped. It’s best to keep options open when you’re running out of time.\n\n“I’m aware that it does take time,” Hamilton said last fall. “In my heart, I’m so hopeful that the decisions we are taking and the direction that we are rowing towards will put us in that target zone to fight the Red Bulls and be close, and be challenging for pole. But if it’s not next year, we will continue to work through it.”\n\nIf that becomes the case, Mercedes will work through it without Hamilton.\n\nGO DEEPER Why Lewis Hamilton is quitting Mercedes to form a Ferrari ‘superteam’\n\nWhy Ferrari?\n\nGood question. Hamilton is pretty close with some key names at Maranello (more on that in a bit). Reports linked Hamilton to Ferrari as early as May of last year. At the time, Ferrari denied any approach had been made. But it goes without saying that any team would love to add Hamilton – of course Ferrari would be interested in the megawatt combo of F1’s most iconic team and the sport’s most popular driver.\n\nAdvertisement\n\nSo, this makes sense for Ferrari, which can head into 2025 with one of the most potent driver duos in F1 history. The question is why the move makes sense for Hamilton. On that front, the answer is more obvious than you might think. Ferrari has tasted success more often than Mercedes since the rules changed:\n\nFerrari's edge on Mercedes since 2022 Stat Mercedes Ferrari Wins 1 5 Podiums 24 28 Poles 2 18 Points 924 960\n\nFerrari’s spirited late-season battle with Mercedes for second place undoubtedly left an impression on Hamilton, as did Sainz’s win ahead of him in Singapore. Also, keep in mind that some of the architects of Mercedes’ dominance have left in the past few years or moved around within the company. The band at Brackley hasn’t exactly broken up, but it’s different.\n\nWhere does this leave Mercedes?\n\nIn the capable hands of George Russell, it seems. There’s no doubt now that the 25-year-old will be the new face of Mercedes in 2025, an eventuality that comes a year or two sooner than he or the team had expected. Mercedes has put a lot of trust in the driver since his arrival in 2022. In that time, Russell has won a grand prix and came close in Singapore last year. He’s grown more assertive behind the wheel, and while that can get him in trouble at times, the hunger to win is undeniable. The pressure will be on him this season to prove he’s ready to fully assume Hamilton’s mantle.\n\nAs for who replaces Hamilton in 2025? We’ve got some dominoes to kick over.\n\nGO DEEPER Battle of the Brits: Lando Norris and George Russell’s race to succeed Lewis Hamilton\n\nHow the F1 cookie crumbles from here\n\nFirst, we should take stock of the drivers with expiring contracts after 2024.\n\nF1 drivers on expiring contracts Team Driver Driver Red Bull Max Verstappen Sergio Pérez Mercedes Lewis Hamilton George Russell Ferrari Charles Leclerc Carlos Sainz McLaren Lando Norris Oscar Piastri Aston Martin Fernando Alonso Lance Stroll Alpine Esteban Ocon Pierre Gasly Williams Alex Albon Logan Sargeant Visa Cash App RB Daniel Ricciardo Yuki Tsunoda Stake F1 Valtteri Bottas Zhou Guanyu Haas Kevin Magnussen Nico Hülkenberg\n\nThat’s, uh, a lot! Let’s discuss what Lewis Hamilton’s 2025 departure for Ferrari means for the rest of the grid. (Warning: We’re in full speculation territory here.)\n\nSainz suddenly becomes the hottest name on the 2025 driver market. He’s a proven winner and younger than countryman Fernando Alonso. While at Ferrari, Sainz established himself as a solid 1B option for a contender or a clear top driver for a midfield team.\n\nTo get a sense of how Hamilton’s move could affect F1’s seat dominos, I thought it was easiest to think about who replaces him at Mercedes (which we wrote about here):\n\nIf Fernando Alonso joins Mercedes, Sainz would become an attractive replacement at Aston Martin. But adding a star like Alonso isn’t exactly handing over the reins to Russell.\n\njoins Mercedes, Sainz would become an attractive replacement at Aston Martin. But adding a star like Alonso isn’t exactly handing over the reins to Russell. If Sergio Pérez joins Mercedes, the safe money is on Ricciardo replacing him at Red Bull. If Ricciardo leaves RB, that opens the door for Liam Lawson to return to F1.\n\njoins Mercedes, the safe money is on Ricciardo replacing him at Red Bull. If Ricciardo leaves RB, that opens the door for to return to F1. If Daniel Ricciardo joins Mercedes, see above with a cowboy hat on.\n\njoins Mercedes, see above with a cowboy hat on. If Esteban Ocon joins Mercedes (he’s a Mercedes driver program alum), that leaves a spot open at Alpine. Sainz could end up at Enstone, but it’s more likely Alpine pulls from its academy ( Jack Doohan , anyone?) or reaches out to someone it has connections with, like academy alum Zhou Guanyu . This leaves a door at Stake F1 for 2023 F2 champ Theo Pourchaire to walk through. The same goes if Pierre Gasly leaves Alpine for Mercedes.\n\njoins Mercedes (he’s a Mercedes driver program alum), that leaves a spot open at Alpine. Sainz could end up at Enstone, but it’s more likely Alpine pulls from its academy ( , anyone?) or reaches out to someone it has connections with, like academy alum . This leaves a door at Stake F1 for 2023 F2 champ to walk through. The same goes if leaves Alpine for Mercedes. Got all that? Good, me neither.\n\nIf Alex Albon or Logan Sargeant joins Mercedes, would Sainz consider joining Williams? I’m going to say unlikely. Zak O’Sullivan, a Williams academy driver racing in F2 this year, could be a more likely option.\n\nor joins Mercedes, would Sainz consider joining Williams? I’m going to say unlikely. Zak O’Sullivan, a Williams academy driver racing in F2 this year, could be a more likely option. If Andrea Kimi Antonelli joins Mercedes, then we’ll have our youngest F1 driver debut since 18-year-old Lance Stroll in 2017 – and Mercedes may have its next star.\n\njoins Mercedes, then we’ll have our youngest F1 driver debut since 18-year-old Lance Stroll in 2017 – and Mercedes may have its next star. If Carlos Sainz joins Mercedes, then it’s basically a trade between the two teams, and the last two hours I spent thinking about this stuff were absolutely wasted.\n\nWhere Carlos Sainz ends up in 2025 could determine the fates of many drivers. (Dan Mullan/Formula 1 via Getty Images)\n\nMy money at this (very early) stage is that Sainz picks a team where he can finally be the clear number one driver but still compete for wins. *checks notes* That’ll be Aston Martin. But who knows – I thought the most exciting thing in my life today would be the Salvation Army coming to pick up my old rugs. Obviously, can’t see into the future.\n\nAnyway, I asked Madeline Coleman for her thoughts on the day’s huge news. That’s where we’ll leave this bombshell for the day.\n\nInside the paddock with Madeline Coleman\n\nAhead of the 2023 Monaco Grand Prix weekend, speculation arose about who Charles Leclerc’s future teammate at Ferrari would be. (Reminder: This race was in May.) When asked during the FIA press conference, “What do you look for in a teammate?” Leclerc looked straight ahead for a moment, laughed, turned, and said, “Hello, Lewis,” before proceeding with the rest of his answer.\n\nAdvertisement\n\n“I mean, a fast teammate, as everybody. We are in Formula One, and we love to be fighting against the best. But that’s not to say that my teammate is not fast. Carlos (Sainz) is an extremely fast driver. But yeah, considering that, I mean, I’m not the person who makes the choices. So yeah, let’s see.”\n\nGO DEEPER Sainz wants stability for his F1 future. Why would Ferrari look elsewhere?\n\nAt the time, Lewis Hamilton didn’t have a contract set for 2024, and reports surfaced that Ferrari was considering making an offer. Leclerc was asked whether he’d welcome Hamilton as a teammate, to which he said, “If I say yes, I imagine it being the title of every newspaper. But I mean, Lewis is such an incredible driver, has achieved so much in the sport. So, I think anybody on the grid will love to have Lewis as a teammate, as everybody will learn a lot from him. But yeah, again, I’m happy where I am. And with Carlos, it’s a great relationship too.”\n\nThe seven-time world champion shut down the rumors and said there hadn’t been contact between him and the Prancing Horse. But several months later, things have changed.\n\nHamilton leaving Mercedes for Ferrari is one of — if not the — biggest driver moves in F1 history. The shock value is similar to when Lionel Messi signed with Inter Miami. Hamilton and the Silver Arrows’ stories have become so closely intertwined over his F1 career, particularly with how invested the team is in his off-track initiatives. As Hamilton said, in part, in his statement, “I have had an amazing 11 years with this team and I’m so proud of what we have achieved together. Mercedes has been part of my life since I was 13 years old. It’s a place where I have grown up, so making the decision to leave was one of the hardest decisions I have ever had to make.”\n\nBut his ties with a few people in the current-day Ferrari camp date back years. Hamilton previously competed for team principal Fred Vasseur’s ART Grand Prix team while climbing the ranks, and the British driver has a friendship with Ferrari’s president, John Elkann.\n\nFerrari will field a formidable duo in 2025 with Charles Leclerc and Lewis Hamilton. (Martin Rickett/PA Images/Alamy Images/Sipa USA)\n\nAnd then there’s the most obvious — the prestige and history of the iconic red is alluring to any driver. Ferrari and F1 are synonymous. But the Ferrari of today is vastly different from its glory years.\n\nCreating a superteam with Leclerc and Hamilton drastically helps Ferrari, giving it a fair shot at returning to its championship-contender form. But can it deliver the 39-year-old a chance at a record eighth title? In the short term, it depends on whether Ferrari found the magical fix in the 2024 overhauled car and solved the strategic mishaps.\n\nAs it stands, Ferrari benefits the most from the move.\n\n(Lead image: Allan Hamilton/Icon Sportswire, Dan Istitene/Formula 1 via Getty Images)"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm55dGltZXMuY29tL2F0aGxldGljLzUyNDM2OTYvMjAyNC8wMi8wMS9sZXdpcy1oYW1pbHRvbi1tZXJjZWRlcy1mZXJyYXJpLXNhaW56LXByaW1lLXRpcmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "The downturn that led Hamilton to Ferrari, and ripple effects on F1: Prime Tire - The New York Times",
        "content": "This is a digital version of the Prime Tire newsletter. Sign up here to receive this content in your inbox every Wednesday morning in the offseason.\n\nWelcome back to Prime Tire, where we’re wondering if you’ve heard the big news: the watch company H. Moser & Cie. announced its partnership with Alpine Motorsports today. Huge development in the world of Formula One, if not the world.\n\nOh, and Lewis Hamilton is leaving Mercedes for Ferrari in 2025. I’m Patrick, and Madeline Coleman will be along shortly. Let’s dive into some truly stunning Formula One news.\n\nThe end of an era\n\nThe Mercedes dynasty is officially over. Lewis Hamilton is leaving for Ferrari in 2025, ending a spectacular 11-year run at Mercedes that resulted in six world championships.\n\nHamilton, Ferrari and Mercedes all confirmed the move on Thursday. Mercedes held a team-wide meeting in the afternoon to announce the news to employees. Hamilton, the sport’s most popular driver in a generation, will now chase his record-breaking eighth world championship at F1’s most iconic team.\n\nMercedes-AMG PETRONAS F1 Team and Lewis Hamilton will part ways at the end of the 2024 season. Lewis has activated a release option in the contract announced last year. — Mercedes-AMG PETRONAS F1 Team (@MercedesAMGF1) February 1, 2024\n\nThe move also means Carlos Sainz will officially be on the driver market in 2025 when Hamilton partners with Charles Leclerc as Ferrari’s “superteam.”\n\nLet’s ask and answer some obvious questions.\n\nWhy is Lewis Hamilton leaving Mercedes?\n\nWe won’t know for sure until we can hear from Hamilton himself. I can think of a few possible reasons. I can count on one finger the times when Hamilton seemed truly happy about his performance in 2023 – his pole in Hungary. He remained pretty subdued and disheartened even as Mercedes scratched and clawed its way into a second-place constructor’s finish. The W14 wasn’t much fun to drive.\n\nGO DEEPER How Mercedes’ sobering 2023 F1 season reinvigorated its ‘Everest climb’\n\nHamilton’s departure means Mercedes will reflect on its ‘size-zero’ sidepod design with even more regret. The team badly missed on the new rules package in 2022, opting for a distinctive ‘no sidepod’look that created terrific high-speed downforce with minimal aerodynamic gains. Rather than abandoning it after a one-win season, Mercedes instead iterated on the design for 2023, hoping to not lose ground and time to Red Bull’s development.\n\nAdvertisement\n\nMercedes boss Toto Wolff defended the decision at the launch, saying, “If you change a concept, you can end up going three steps backwards to take two forwards.”\n\nIn the end, Mercedes is taking three steps backward anyway – the team has confirmed the 2024 car design is a complete overhaul. And that leads us to our next question.\n\nWhy now?\n\nLewis Hamilton is 39 years old. The clock is ticking on his career, and his chase for the outright record of eight world drivers’ championships is no doubt paramount. If he’s making this move now, he’s making it because he thinks Ferrari is closer to winning a championship. Between staff turnover and the “three steps backward” Mercedes forced itself to risk with the 2024 car redesign, it’s easy to see why Hamilton felt like his Mercedes chapter was drawing to a close.\n\n“I am 100% committed to delivering the best performance I can this season and making my last year with the Silver Arrows, one to remember,” Hamilton said on Thursday. (Kym Illman/Getty Images)\n\n“We were winning for such a long time, and when you win for so long, we all get complacent and take things for granted,” Hamilton told ABC News in November. “I think the pressure is, as you’re getting older, it gets harder to train. It’s harder to stay fit. It’s managing your time.”\n\nIn hindsight, time management was at the heart of Hamilton’s two-year renewal with Mercedes last fall. It gave him at least two years to complete the “unfinished business” with Mercedes, a goal so obviously dear to him. We now know the deal’s “exit clause” also allowed Hamilton to move on if Mercedes’ return to title form felt further away than he had hoped. It’s best to keep options open when you’re running out of time.\n\n“I’m aware that it does take time,” Hamilton said last fall. “In my heart, I’m so hopeful that the decisions we are taking and the direction that we are rowing towards will put us in that target zone to fight the Red Bulls and be close, and be challenging for pole. But if it’s not next year, we will continue to work through it.”\n\nIf that becomes the case, Mercedes will work through it without Hamilton.\n\nGO DEEPER Why Lewis Hamilton is quitting Mercedes to form a Ferrari ‘superteam’\n\nWhy Ferrari?\n\nGood question. Hamilton is pretty close with some key names at Maranello (more on that in a bit). Reports linked Hamilton to Ferrari as early as May of last year. At the time, Ferrari denied any approach had been made. But it goes without saying that any team would love to add Hamilton – of course Ferrari would be interested in the megawatt combo of F1’s most iconic team and the sport’s most popular driver.\n\nAdvertisement\n\nSo, this makes sense for Ferrari, which can head into 2025 with one of the most potent driver duos in F1 history. The question is why the move makes sense for Hamilton. On that front, the answer is more obvious than you might think. Ferrari has tasted success more often than Mercedes since the rules changed:\n\nFerrari's edge on Mercedes since 2022 Stat Mercedes Ferrari Wins 1 5 Podiums 24 28 Poles 2 18 Points 924 960\n\nFerrari’s spirited late-season battle with Mercedes for second place undoubtedly left an impression on Hamilton, as did Sainz’s win ahead of him in Singapore. Also, keep in mind that some of the architects of Mercedes’ dominance have left in the past few years or moved around within the company. The band at Brackley hasn’t exactly broken up, but it’s different.\n\nWhere does this leave Mercedes?\n\nIn the capable hands of George Russell, it seems. There’s no doubt now that the 25-year-old will be the new face of Mercedes in 2025, an eventuality that comes a year or two sooner than he or the team had expected. Mercedes has put a lot of trust in the driver since his arrival in 2022. In that time, Russell has won a grand prix and came close in Singapore last year. He’s grown more assertive behind the wheel, and while that can get him in trouble at times, the hunger to win is undeniable. The pressure will be on him this season to prove he’s ready to fully assume Hamilton’s mantle.\n\nAs for who replaces Hamilton in 2025? We’ve got some dominoes to kick over.\n\nGO DEEPER Battle of the Brits: Lando Norris and George Russell’s race to succeed Lewis Hamilton\n\nHow the F1 cookie crumbles from here\n\nFirst, we should take stock of the drivers with expiring contracts after 2024.\n\nF1 drivers on expiring contracts Team Driver Driver Red Bull Max Verstappen Sergio Pérez Mercedes Lewis Hamilton George Russell Ferrari Charles Leclerc Carlos Sainz McLaren Lando Norris Oscar Piastri Aston Martin Fernando Alonso Lance Stroll Alpine Esteban Ocon Pierre Gasly Williams Alex Albon Logan Sargeant Visa Cash App RB Daniel Ricciardo Yuki Tsunoda Stake F1 Valtteri Bottas Zhou Guanyu Haas Kevin Magnussen Nico Hülkenberg\n\nThat’s, uh, a lot! Let’s discuss what Lewis Hamilton’s 2025 departure for Ferrari means for the rest of the grid. (Warning: We’re in full speculation territory here.)\n\nSainz suddenly becomes the hottest name on the 2025 driver market. He’s a proven winner and younger than countryman Fernando Alonso. While at Ferrari, Sainz established himself as a solid 1B option for a contender or a clear top driver for a midfield team.\n\nTo get a sense of how Hamilton’s move could affect F1’s seat dominos, I thought it was easiest to think about who replaces him at Mercedes (which we wrote about here):\n\nIf Fernando Alonso joins Mercedes, Sainz would become an attractive replacement at Aston Martin. But adding a star like Alonso isn’t exactly handing over the reins to Russell.\n\njoins Mercedes, Sainz would become an attractive replacement at Aston Martin. But adding a star like Alonso isn’t exactly handing over the reins to Russell. If Sergio Pérez joins Mercedes, the safe money is on Ricciardo replacing him at Red Bull. If Ricciardo leaves RB, that opens the door for Liam Lawson to return to F1.\n\njoins Mercedes, the safe money is on Ricciardo replacing him at Red Bull. If Ricciardo leaves RB, that opens the door for to return to F1. If Daniel Ricciardo joins Mercedes, see above with a cowboy hat on.\n\njoins Mercedes, see above with a cowboy hat on. If Esteban Ocon joins Mercedes (he’s a Mercedes driver program alum), that leaves a spot open at Alpine. Sainz could end up at Enstone, but it’s more likely Alpine pulls from its academy ( Jack Doohan , anyone?) or reaches out to someone it has connections with, like academy alum Zhou Guanyu . This leaves a door at Stake F1 for 2023 F2 champ Theo Pourchaire to walk through. The same goes if Pierre Gasly leaves Alpine for Mercedes.\n\njoins Mercedes (he’s a Mercedes driver program alum), that leaves a spot open at Alpine. Sainz could end up at Enstone, but it’s more likely Alpine pulls from its academy ( , anyone?) or reaches out to someone it has connections with, like academy alum . This leaves a door at Stake F1 for 2023 F2 champ to walk through. The same goes if leaves Alpine for Mercedes. Got all that? Good, me neither.\n\nIf Alex Albon or Logan Sargeant joins Mercedes, would Sainz consider joining Williams? I’m going to say unlikely. Zak O’Sullivan, a Williams academy driver racing in F2 this year, could be a more likely option.\n\nor joins Mercedes, would Sainz consider joining Williams? I’m going to say unlikely. Zak O’Sullivan, a Williams academy driver racing in F2 this year, could be a more likely option. If Andrea Kimi Antonelli joins Mercedes, then we’ll have our youngest F1 driver debut since 18-year-old Lance Stroll in 2017 – and Mercedes may have its next star.\n\njoins Mercedes, then we’ll have our youngest F1 driver debut since 18-year-old Lance Stroll in 2017 – and Mercedes may have its next star. If Carlos Sainz joins Mercedes, then it’s basically a trade between the two teams, and the last two hours I spent thinking about this stuff were absolutely wasted.\n\nWhere Carlos Sainz ends up in 2025 could determine the fates of many drivers. (Dan Mullan/Formula 1 via Getty Images)\n\nMy money at this (very early) stage is that Sainz picks a team where he can finally be the clear number one driver but still compete for wins. *checks notes* That’ll be Aston Martin. But who knows – I thought the most exciting thing in my life today would be the Salvation Army coming to pick up my old rugs. Obviously, can’t see into the future.\n\nAnyway, I asked Madeline Coleman for her thoughts on the day’s huge news. That’s where we’ll leave this bombshell for the day.\n\nInside the paddock with Madeline Coleman\n\nAhead of the 2023 Monaco Grand Prix weekend, speculation arose about who Charles Leclerc’s future teammate at Ferrari would be. (Reminder: This race was in May.) When asked during the FIA press conference, “What do you look for in a teammate?” Leclerc looked straight ahead for a moment, laughed, turned, and said, “Hello, Lewis,” before proceeding with the rest of his answer.\n\nAdvertisement\n\n“I mean, a fast teammate, as everybody. We are in Formula One, and we love to be fighting against the best. But that’s not to say that my teammate is not fast. Carlos (Sainz) is an extremely fast driver. But yeah, considering that, I mean, I’m not the person who makes the choices. So yeah, let’s see.”\n\nGO DEEPER Sainz wants stability for his F1 future. Why would Ferrari look elsewhere?\n\nAt the time, Lewis Hamilton didn’t have a contract set for 2024, and reports surfaced that Ferrari was considering making an offer. Leclerc was asked whether he’d welcome Hamilton as a teammate, to which he said, “If I say yes, I imagine it being the title of every newspaper. But I mean, Lewis is such an incredible driver, has achieved so much in the sport. So, I think anybody on the grid will love to have Lewis as a teammate, as everybody will learn a lot from him. But yeah, again, I’m happy where I am. And with Carlos, it’s a great relationship too.”\n\nThe seven-time world champion shut down the rumors and said there hadn’t been contact between him and the Prancing Horse. But several months later, things have changed.\n\nHamilton leaving Mercedes for Ferrari is one of — if not the — biggest driver moves in F1 history. The shock value is similar to when Lionel Messi signed with Inter Miami. Hamilton and the Silver Arrows’ stories have become so closely intertwined over his F1 career, particularly with how invested the team is in his off-track initiatives. As Hamilton said, in part, in his statement, “I have had an amazing 11 years with this team and I’m so proud of what we have achieved together. Mercedes has been part of my life since I was 13 years old. It’s a place where I have grown up, so making the decision to leave was one of the hardest decisions I have ever had to make.”\n\nBut his ties with a few people in the current-day Ferrari camp date back years. Hamilton previously competed for team principal Fred Vasseur’s ART Grand Prix team while climbing the ranks, and the British driver has a friendship with Ferrari’s president, John Elkann.\n\nFerrari will field a formidable duo in 2025 with Charles Leclerc and Lewis Hamilton. (Martin Rickett/PA Images/Alamy Images/Sipa USA)\n\nAnd then there’s the most obvious — the prestige and history of the iconic red is alluring to any driver. Ferrari and F1 are synonymous. But the Ferrari of today is vastly different from its glory years.\n\nCreating a superteam with Leclerc and Hamilton drastically helps Ferrari, giving it a fair shot at returning to its championship-contender form. But can it deliver the 39-year-old a chance at a record eighth title? In the short term, it depends on whether Ferrari found the magical fix in the 2024 overhauled car and solved the strategic mishaps.\n\nAs it stands, Ferrari benefits the most from the move.\n\n(Lead image: Allan Hamilton/Icon Sportswire, Dan Istitene/Formula 1 via Getty Images)"
    }
]