[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vYWlybWFpbC5uZXdzL2lzc3Vlcy8yMDI0LTEtMjcvcmlwcGxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "\"Ripple\" Podcast by Dan Leone: Recommended - Air Mail",
        "content": "Time spent in New York City rental apartments feels like dog years. On paper, I’ve lived in the same West Village apartment for almost six years, but it’s really felt more like 40, and over those past 40 years I’ve acquired a lot of stuff. At best, I’m a collector. At worst, I’m a hoarder. I have so many throw pillows that, some days, I can barely find a place to sit on my couch. I’m probably the only person under the age of 65 who has more than five regular print-magazine subscriptions. Drawers almost overflow with random papers. Things can quickly appear disorganized, so if you’ve lived in an apartment as long as I have, you simply need a tray from Kate Rheinstein Brodsky’s Upper East Side shop to get things in order. They’re finished in a high-gloss lacquer, and the design is inspired by Villa Bologna, in Malta. They’ll fool any and all visitors into thinking you have it all under control. ($370, krbnyc.com) —Michael Pescuma"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbmdhcGUuY29tL3Nwb3QteHJwLWV0Zi1yaXBwbGUtYWN0aXZlbHktaGlyaW5nLWV4ZWN1dGl2ZXMtdG8tcHJlcGFyZS1mb3ItZmlsaW5nL9IBXmh0dHBzOi8vY29pbmdhcGUuY29tL3Nwb3QteHJwLWV0Zi1yaXBwbGUtYWN0aXZlbHktaGlyaW5nLWV4ZWN1dGl2ZXMtdG8tcHJlcGFyZS1mb3ItZmlsaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "Spot XRP ETF: Ripple Actively Hiring Executives To Prepare For Filing? - CoinGape",
        "content": "In what could be a preparatory move before filing for the spot XRP ETF filing with the U.S. Securities and Exchange Commission (SEC), Ripple is hiring for a senior manager role in the institutional Decentralized Finance (DeFi) space. Is this the beginning of a wider institutional adoption of the cryptocurrencies in the financial world?\n\nAlso Read: Altlayer (ALT) Price Jumps 30% After Airdrop And Binance Listing\n\nadvertisement\n\nRipple Already Holds Advantage For XRP ETF Approval?\n\nThe company has already secured a court win in July 2023, with U.S. District Judge Analisa Torres in Manhattan ruling partially in its favor when it comes to the regulatory compliance of securities laws for the sale of XRP tokens to retail investors. The judgment pertaining to the institutional sale of tokens is still pending before the court. In yet another victory for the company, the US SEC had withdrawn the charges it made against company’s executives including chief executive officer Brad Garlinghouse.\n\nWith this judgment, the SEC already faces a legal precedent that shows XRP sales do not amount to investment contracts, paving way for approval of the spot ETF approval. In a recent development, the SEC asked the court to make Ripple provide certain information, like audited financial statements for 2022-2023, contracts for selling or transferring XRP to non-employee parties, and details on XRP sales money received after the lawsuit was filed in December 2020. In a response filed on January 19, Ripple disagreed with the SEC’s request for the documents.\n\nRipple Preparing For ETF Filing?\n\nThe company is hiring for the Senior Manager, Business Development (Institutional DeFi) role, which is to be based in London. It stated that the managerial role is part of the ‘Ripple X’ team, which is actively partnering with enterprises and institutions to develop solutions and use cases, leveraging on the XRPL Ledger and its native digital asset, XRP. Among the key responsibilities of the role would be to drive cryptocurrencies related ETFs initiatives with internal trading teams and relevant partners.\n\nAlso Read: Terra Luna Classic Core Security Upgrade Proposal Hits Roadblock"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9yaXBwbGVzLW9kbC14cnBsLWFtbS1oZXJlcy1ob3ctdGhleS1jYW4taGVscC1lYWNoLW90aGVy0gFLaHR0cHM6Ly91LnRvZGF5L3JpcHBsZXMtb2RsLXhycGwtYW1tLWhlcmVzLWhvdy10aGV5LWNhbi1oZWxwLWVhY2gtb3RoZXI_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "Ripple's ODL, XRPL AMM: Here's How They Can Help Each Other - U.Today",
        "content": "The potential launch of automated market making functionality on top of XRP Ledger might change the way Ripple's on-demand liquidity corridors work, a seasoned community enthusiast says. At the same time, other voices in the XRP army raise concerns about this integration.\n\nAdvertisement\n\nRipple's ODL might reward XRPL AMM liquidity providers: Community\n\nOnce the XRP Ledger AMM amendment is activated, its liquidity providers will be able to benefit from the activity of the Ripple Payments (previously known as On-Demand Liquidity or ODL) service. This statement was shared by Ripple's pseudonymous enthusiast who goes by @WKahneman on X.\n\nThe great thing about the AMM amendment is that by participating in liquidity pools, participants are ostensibly profiting off of ODL. — WrathofKahneman (@WKahneman) January 26, 2024\n\nHe explained that while Ripple Payments and XRPL AMM will be separate independent mechanisms, they might cooperate for mutual benefit. Ripple Payments might source liquidity from AMM, and anyone will be able to participate in on-chain market making with an asset utilized in this or that \"corridor.\"\n\nHowever, to make this dual-system mechanism work, the XRPL/Ripple ecosystem will need an interface for liquidity providers, the influencer admitted.\n\nThe team of XRPL-focused analytical platform XPMarkets opined that this hypothetical tool will only work with a large volume of liquidity injected from the very beginning. Otherwise, the price slippage will be too high and the usage of XRPL AMM by Ripple Payments will make no sense:\n\nIn order for such thing to function, a really high TVL is required. We are talking tens of millions of liquidity in a single pool. Anything less will result in significant price impact and inefficiency for large capital.\n\nRipple's ODL was the most popular product of Ripple in terms of retail cross-border payment. It was rebranded to Ripple Payments in mid-September 2023, as U.Today reported.\n\nXRPL AMM needs five votes to pass\n\nAlso, Jon Nilsen, the owner of an XRP Ledger validator, stressed that injecting liquidity in XRPL AMM is too risky, in particular during the first phases of its operations.\n\nMeanwhile, the exact timeline for the XRPL AMM activation remains unclear. As of printing time, it only scored 23 votes in favor out of the 28 votes it needs to pass.\n\nUnlike Ethereum (ETH), in the XRP Ledger ecosystem, amendments have no voting deadline. However, the XRPL AMM proposal discussion has already scored the status of the longest in the last years."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS94cnAtbmV3cy1zZWMtdi1yaXBwbGUtY291cnQtbW90aW9ucy1hbmQtYnRjLXNwb3QtZXRmcy0xNDA1Mzgx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "XRP News: SEC v Ripple Court Motions and BTC-Spot ETFs - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vaW50ZXJhY3RpdmUvMjAyNC9oYXRlLWNyaW1lLWlzcmFlbC1wYWxlc3RpbmUtaW1wYWN0LWp1c3RpY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "An alleged N.Y. hate crime tied to Israel-Gaza war raises questions of justice - The Washington Post",
        "content": "NEW YORK — There was a woman walking toward him, but he didn’t recognize her. They were at a basketball court on a Tuesday morning in Brooklyn, just after 10 a.m. — two strangers at a playground. The sun was out. It was warm. Ashish Prashar, 40, had taken off his jacket and laid it on the ground. He watched his son, who was 18 months old, standing near the three-point line, happy, babbling, fascinated by an older boy playing basketball. Maybe the boy was this woman’s son, Ash thought, and now she was coming closer, and she began to speak.\n\nThe tone of her voice surprised him. It was firm and direct.\n\nTwo weeks from now, in a courtroom, a prosecutor would summarize what Ash said he heard:\n\n“You support Hamas.”\n\n“They kill babies.”\n\n“Your baby should die.”\n\n“You’re a terrorist.”\n\nThat morning, it was one month into the Israel-Gaza war, and as the woman came closer, Ash asked himself what was happening. He scanned the playground, and now the facts of the situation came to order in his mind: Around his neck, he was wearing a kaffiyeh, a Palestinian scarf. He and his son had brown skin. They were not Palestinian — Ash was Punjabi, born in London — but they might look Palestinian to the woman, whose voice was getting louder now. Ash took a few steps back. He grabbed his son. He grabbed his phone inside his jacket pocket. And then he made a decision that would cascade outward in the weeks ahead, testing what he thought he believed about accountability and compassion.\n\nAt 10:19 a.m., he pressed the record button.\n\n“Go away,” the woman said.\n\nThe phone shook, pointed at the ground, a blacktop covered in dry leaves. The camera leveled. Her figure came into focus on the screen: a woman in a hat and sunglasses, phone in one hand, paper coffee cup in the other.\n\n“You and your son, go away,” she said.\n\n“Why?” Ash asked.\n\nShe walked toward him, nearly in front of him now.\n\n“Don’t!” she said at a high pitch. “You cannot take —”\n\nShe raised her hand and hurled her cellphone toward him.\n\n“— any pictures!”\n\nHer phone crashed, landing in the leaves.\n\n“What?!” Ash said.\n\nShe raised her hand again and this time hurled the coffee cup. The cup flew past him, but the lid came off. He felt the liquid hit his neck. It felt hot.\n\n“Get away!” she said.\n\nShe was close to his face now. The camera shook.\n\n“Don’t f---ing touch me, love!” Ash said.\n\n“Get away!” the woman said.\n\n“Why am I getting away?”\n\n“I told you to leave,” she yelled. “I told you to leave.”\n\nShe picked up her phone from the ground.\n\nStory continues below advertisement Advertisement Story continues below advertisement Advertisement\n\n“Get the f--- out,” the woman said. “Get the f--- out.”\n\n“I’m not gonna do that.”\n\nShe walked back to Ash again and lunged, swiping at his phone.\n\n“Don’t — don’t come near me, love,” he said.\n\n“Don’t take pictures of me,” she said.\n\nThe woman swiped at him a second time. Then a third.\n\n“I’ve got a baby,” Ash said.\n\n“Get away,” she said.\n\n“I’ve got a baby!” he said.\n\nThe woman turned and started to leave. The playground was quiet.\n\nWhat is happening, Ash kept thinking, until whatever just happened was over.\n\nHe stopped recording, held his son and wondered what he was supposed to do next.\n\n(Ashish Prashar)\n\nForty-seven seconds — that’s how long the video lasted. And that might have been the end of it. But in a time of rising hate crimes, with anger and outrage available to anyone at any time online, that’s not the way it worked out. Ash went home and showed the video to his wife, Mary Rinaldi. “We got attacked,” he said. Later that day, he walked to the 88th Precinct in Brooklyn and showed the video to the police, who elevated it to the Hate Crime Task Force in Manhattan. The next day, after Mary said to him, “She hurt our child and needs to be held accountable,” Ash decided to post the video on Instagram, too.\n\nIn a week, it had passed 1 million views.\n\nNow his phone was filled with hundreds of messages. Sad faces, angry faces, Palestinian flags. Strangers zoomed in on the woman’s face, rushing to identify her. They zoomed in on Ash’s son, who had been on the ground at one point, holding something small and red. An Israeli hostage poster, someone online said, though it was only an empty bag of chips, crinkling in his hands. One person sent close-ups of the coffee cup the woman had thrown, identifying the logo of the bakery where it had been purchased. People told Ash how well he handled the situation, how calm he’d kept his voice. More than one person said they would have punched the woman in the face, if it had been them that day.\n\nAsh didn’t want to punch the woman. He’d tried to de-escalate the situation. He considered himself a nonviolent person, in large part because of two things that had happened in his life. The first came when he was 17 years old. He was arrested for stealing from a London department store and spent four months in prison. Anger was all around him there, and he told himself that in order to survive, he would need to become a different person — someone who didn’t react. One morning, when a guard pinned him against the wall and shouted racist slurs, Ash just looked at him and let him yell. He became a person who said, “Okay,” if he said anything at all.\n\nThe second thing happened years later, after he had begun a career in politics. He joined a team working for former prime minister Tony Blair, the Middle East peace envoy at the time. In 2011, the job took Ash to the West Bank, where he received his kaffiyeh as a gift. That same year, he traveled to Sierra Leone, where he sat in on reconciliation meetings as the country healed from a decade-long civil war. He watched a mother face the child soldier who had been accused of killing her son and daughter. Here was a chance for vengeance, but when the council asked what punishment the soldier should face, the mother asked for the boy to be released into her own care, and to raise him as her own. It was a life-changing moment for Ash. He began to think of himself as an abolitionist, a person who stood against forms of oppression and occupation. It was a feeling that only deepened as he moved to the United States, met and married Mary, and worked as a human rights activist and political strategist for campaigns and criminal justice groups.\n\nIn Gaza, Ash had long seen another system of oppression. After Oct. 7, when Hamas militants killed at least 1,200 people and took hundreds hostage in Israel, he and Mary began organizing pressure campaigns for a permanent cease-fire. They used words like “genocide” to talk about Israel’s military actions in Gaza, where the death toll would climb past 25,000 in the weeks to come, according to Gaza’s Health Ministry. Along with a few activists, they spent their days documenting firsthand accounts from the region to send to reporters and government officials.\n\nAsh wanted the person who attacked him and his son to be held accountable, but he also worried about the anger stirred up by the video of the confrontation he'd posted online.\n\nAsh and his wife, Mary, dress their son at their Brooklyn home.\n\nNow, seeing the outrage on his own Instagram feed, where strangers were promising to “find” the woman in the video, he began to worry about what all the anger could turn into. He posted a message urging restraint: “If you think you know this person please share the information but don’t take this in your own hands. We have never asked for that and we do not want that. This is not vigilante justice.”\n\nBut the messages kept coming.\n\nTwo strangers contacted Ash to say they recognized the woman from their gym. They each gave him the same name. “I do not have any doubt about who she is,” one of them said.\n\nHe looked up the woman’s name online. He read old comments he thought she’d left on YouTube videos. He wondered if he might pass her on the street. He sent the name to the detective assigned to his case, and now the detective was on the phone, sounding out the same name.\n\n“Her name is, like, Hadasa … Kara — vani? Karavani — Bozak?”\n\nAsh and Mary, 44, sat at their kitchen counter, listening.\n\nNow the detective was asking if Ash had seen any other photos of the woman online that he could send. It would help make a positive identification and ensure an indictment, he said.\n\n“The big deal is getting her prosecuted, you know?”\n\n“Yes, okay, understood,” Ash said. “We’ll look around.”\n\n“Just to confirm, you know, beyond a shadow of a doubt,” the detective said.\n\nMary didn’t speak until the call was over.\n\n“So we need to do the work for them, is basically what they’re saying,” she said.\n\n“Well, we need to do a search,” Ash said.\n\n“We don’t need to do their job for them. That’s my opinion,” Mary said. “I think it’s not very valuable for us, for our own mental space.”\n\n“No,” Ash said. “It’s a waste of energy.”\n\n“And it upsets you a lot.”\n\nStory continues below advertisement Advertisement Story continues below advertisement Advertisement\n\nAsh stared at his laptop, where a Google search for the name was still open in his browser.\n\n“I might email them and say they should look at the immigration database,” he said.\n\n“No, no, no,” Mary said.\n\n“No? Okay. Let them do it.”\n\n“You gotta let that go.”\n\n“Okay,” he said, but a few hours later, when Mary and their son were out, Ash was looking through his messages again. “My wife and I have to constantly look over our shoulders and don’t feel safe out and about with our baby,” he’d written in an email to the detective the day before. “It’s not a nice feeling at all.”\n\nThe gym must have a photo on file. The bakery must have security footage. They weren’t far away.\n\nHe got his coat and his scarf and walked out the door.\n\nOutside his building, he passed lampposts where someone had taped fliers.\n\n“HATE CRIME: ATTACKED 18 MONTH OLD,” they read.\n\n“Do you recognize her?”\n\nFliers were posted around Ash's neighborhood asking for information about the woman who had attacked him and his son.\n\nA few blocks away, a woman sat in her apartment looking at messages on her phone.\n\n“ … You vile human being!!!!!!”\n\n“ … YOU ARE EVIL.”\n\n“ … You thought you wouldn’t be found?”\n\nHer name was Annette Lalic.\n\nDid she look like the woman in the video? She had short, dark hair like the woman did, but that’s where the similarities ended. She lived in another part of Brooklyn. She worked as a lawyer for the U.S. Equal Employment Opportunity Commission, and at 10:19 a.m. on that Tuesday, as Ash pressed the record button in Brooklyn, she was at her office in Lower Manhattan, preparing for mediation in a discrimination case.\n\nTwo days later, Annette, 38, was working from home, just after lunch, when the first message came. A notification from Instagram said she had been tagged in a photo. It was a picture she hadn’t seen before: a woman in a hat and sunglasses. The logo on the hat was familiar to her, from a Brooklyn running store she went to often. Now she had a text from a friend at the store: “Call me when you get this.”\n\n“Something weird is going on online,” her friend said.\n\nSomehow, from the hat in the video, people had found a picture of Annette wearing a hat on the running store’s website. The hats didn’t look the same, she thought, but it didn’t matter. “Her name is Annette Marie Lalic,” someone said online. Now she watched part of the 47-second video and searched her name on social media. Someone had posted her photo next to screenshots from the video, with arrows pointing to each woman’s chin, nose and jawline. “100% is Annette Lalic,” the person had written.\n\nShe felt herself begin to panic.\n\nShe went to a neighbor’s apartment across the hall.\n\n“Do I respond to this?” she asked.\n\n“Let’s slow down,” her neighbor said.\n\n“How do I even prove that it’s not me? Clearly, it’s not me.”\n\nAnnette Lalic, a lawyer for the U.S. Equal Employment Opportunity Commission, was misidentified as the assailant in the attack on Ash and his son.\n\nFriends told her to stay off the internet, but Annette wanted to know what the people online knew, in case of a threat. She went through more messages. “Two blocks down … they’re watching you. When you least expect it,” one person wrote to her on Instagram, with an emoji of a gust of wind. What did the wind emoji mean? She didn’t know. She saw people post her old home address, her work address, her license number from the New York State Bar Association. They called her office in Manhattan. They found her LinkedIn, so she deactivated her account. There were friends and acquaintances on Reddit and Instagram, and neighborhood group chats for parents, all saying it wasn’t her.\n\n“This is misinformation! The woman in the video is NOT Annette Lalic!”\n\n“It’s definitely not her. I used to work with her.”\n\n“I can also confirm it is not Annette.”\n\nIt didn’t matter.\n\n“ … Your life will be hell from now on.”\n\n“ … You SLUT.”\n\n“ … You’re sick.”\n\nVoice mails filled her inbox.\n\n“ … You’re disgusting. Know that, all right? You’re a disgusting human being. I don’t even want to call you a human being.”\n\n“ … Annette, do you call yourself a woman? You are a barbarian.”\n\n“ … You stupid, racist, Jewish b----.”\n\n“ … Quit hiding, you f---ing p---y, Annette.”\n\n“Doxed,” she wrote in her planner beneath the date.\n\nShe went to bed and thought about what to do next. She could issue a statement of her own saying, “It’s not me.” She could record a video of herself reading the statement. Surely, as soon as people heard her voice and saw her face up close, they would realize it wasn’t her. “You need to do this,” some friends had told her. She wondered if people even cared whether it was her or whether it wasn’t. She had already seen one commenter say, “It doesn’t look like her,” to which another replied, “Agree to disagree.” There was no logic here. She decided to do nothing.\n\nAnnette described feelings of fear and guilt after being falsely accused of attacking Ash and his son.\n\nThe days passed, and now, as people kept telling her how terrible she was, her panic gave way to a new feeling, one she hadn’t expected. It was a feeling of guilt — as if she really had done something wrong, “as if I’d actually done what the woman had done,” she thought. The guilt was peculiar — detached and almost out-of-body. Physically, she was at home, eating dinner next to her cat. “This is me,” she told herself. She was fine, but the messages kept coming, telling her that she was not.\n\n“ … I will make sure the whole world knows that you are racist,” one said.\n\n“That’s not who I am,” she told herself.\n\n“ … We’re gonna see you out in the street.”\n\n“It’s not real,” she told herself.\n\nOn the day Ash left his apartment to search for the woman, Annette was scheduled to coach a running group in Central Park but thought about staying home instead. “Do what you’re comfortable with,” one of the other coaches told her. On the train, she looked around and wondered if people were staring at her. How many knew her face as the face in the video?\n\nShe got off the train, walked into the park, coached the group and was starting to leave when she heard someone shout her name.\n\n“Annette!”\n\nHer stomach dropped. Panic.\n\nShe turned around. It was only someone she knew, a friend coming up to her to say hi.\n\nAsh and Mary walk their son to the park.\n\nAsh was still out searching. Seven blocks west, past the playground, past more fliers, past a crossing guard on the corner who stopped him and said someone told her just yesterday that the woman in the video was an attorney.\n\n“No,” Ash said to her, knowing she meant Annette. He had already heard about what happened to her. He had thought about contacting her, but what would he even say? Instead, he told the crossing guard: “It’s not her. I think I know who the woman is. I’m just trying to find her now.”\n\nHe walked another 13 blocks to the gym, where the people behind the front desk said they couldn’t give out private information. Another seven blocks back to the bakery, where the people behind the counter said they would check their security footage and get back to him. Six blocks back to his neighborhood. It was getting dark now. From the street, he called the detective again and told him about his trip to the gym, and the bakery, and that’s when the detective told him that they didn’t need any more photos of the woman. They had an arrest warrant.\n\n“Oh!” Ash said. “That’s amazing!”\n\nHe headed home, walked inside and kicked off his boots.\n\n“Well, they’re gonna arrest her,” Ash said.\n\nMary stood at the kitchen counter chopping onions.\n\nLoading...\n\nWhile Ash had been out on his search, she had been looking at news from overseas. A video from al-Shifa Hospital in Gaza, showing premature babies crying. Another video from the West Bank, showing two boys, one 8, one 14, shot in the street.\n\n“Mer?”\n\n“Great,” she said. Her voice was low. She kept chopping. “You know how I feel about it.”\n\nHe did know. Earlier that week, Ash had told her, “Mary, you might have punched her in the face,” and Mary had said, “I wonder what I would have done.” Maybe she would have snapped, she said, or maybe she would have picked up their son and run. “You don’t know until you’re in the situation,” Ash said, and that was the difference between them. Ash had been there. Mary hadn’t. And now they were processing the same event in their own way. While Ash was becoming more and more focused on the arrest, Mary sometimes noticed herself getting quiet.\n\nAsh took off his scarf and coat. “They’re issuing an arrest warrant,” he said again. “Like, I think they might actually pick her up today.”\n\n“Okay,” Mary said.\n\n“Which means, ‘Yay,’” Ash said.\n\n“Mhmm.”\n\n“A little bit of relief.”\n\n“Yeah,” Mary said. She paused. She didn’t want her son to be hurt. “Obviously,” she said. “And I don’t want other kids to be hurt.” She kept her head down. “But it’s all sad. Like, the whole thing is just …”\n\nNow she stood in the kitchen and began to cry.\n\n“The emotion … it’s up here,” she said, putting a hand to her neck.\n\n“Hey, come here. I’m sorry.”\n\nAsh walked to the other side of the counter and put his arms around her.\n\nMary took a deep breath. “So what’s the next thing for us?” she asked. “Is the state going to prosecute her? Or the city? Do we have a say?”\n\n“I don’t know. I actually don’t think we’re going to have a say.”\n\n“If we do have a say, what do we want to do?”\n\nAsh was invited to speak at pro-Palestinian demonstrations after the video of him and his son being attacked went viral.\n\nNo matter how many times they discussed it, Ash and Mary couldn’t come up with an answer.\n\nThey thought an arrest might bring some clarity. But the arrest did not happen that night, as Ash thought it would. It did not happen the next day, or the next, or the day after that. The weekend came and still no arrest. Ash was still getting messages, and in between his Instagram posts about Gaza, he wrote updates about the case to his followers, which in a matter of weeks had grown from several hundred to 10,000. He was invited to speak at two pro-Palestinian demonstrations, and he accepted. People in the neighborhood recognized him on the street. He was becoming the face of something.\n\nHe could sense people becoming impatient, and he understood their frustration.\n\n“What’s taking them so long?” someone asked in the comments of one of Ash’s posts.\n\n“What’s her name?!” said another.\n\n“Release the name.”\n\n“Please we need her full name.”\n\n“It’s gonna snowball,” the detective had warned him, and it had, so much so that Ash was now worried about the woman’s safety. What if someone attacked her? He thought about what had happened to Annette, and imagined worse. “Someone is going to make a citizen’s arrest,” Mary told him.\n\nProtesters watch as Ash speaks at a New York rally opposing the ongoing Israeli attacks on the Gaza Strip.\n\nNow there was a new message.\n\nSomeone had seen the woman at a grocery store in Brooklyn.\n\nThe person had taken photos. They’d called the precinct and waited at the store for the police. No police came. No arrest was made. Ash was also feeling impatient. He decided to post the photos to his Instagram. “It is disheartening to let you know that the NYPD didn’t send an officer to the scene to apprehend her,” he wrote, and more comments came streaming in.\n\nBut a few days later, he saw something that alarmed him. It was a new video about the case, from another stranger. This one named the woman and listed her home address.\n\n“This is not what I wanted,” Ash said.\n\nHe called the detective. “Someone posted her address and her name online,” he said, speaking quickly. “I don’t know who this person is, but I wanted to call you to tell you straight away —”\n\nThe detective stopped him. “Okay, so, Ash,” he said, “I have her under arrest.”\n\n“You have her under arrest?”\n\n“I have her under arrest.”\n\nAsh and Mary's son plays at home in Brooklyn.\n\nAfter all this time, Ash had seen the woman only once, during that brief encounter at the playground. He could only guess what she had been doing in the days since. He’d imagined her in a state of isolation, rarely leaving her apartment building, 12 blocks away from his own, where fliers of her face still hung outside on the street. He’d studied the pictures from the grocery store, where she stood with a shopping basket on her arm, glancing at a bin of fresh fruit. But the woman was still a stranger to him, a person he could read about online, the same as anyone else.\n\nNow there was a chance to see her. Arraignments were open to the public.\n\nThe courthouse in Brooklyn was a 25-minute walk away, and the woman was already there.\n\nShe had turned herself in at 7 a.m. She’d been in one of the holding pens downstairs since morning, waiting. All day there were arraignments. First-degree robbery. Second-degree harassment. The hours passed. It was evening now. “Warning,” read a sign on the stairwell door. Each time the door opened, yelling came from the floor below.\n\nThe door opened again and now it was almost midnight.\n\nThe woman walked into the courtroom, led by a police officer. She was short and small. Her hair was tied back. A black mask sat beneath her nose. Her fingernails were painted. Her hands were in handcuffs behind her back. In legal documents, her name was listed as Hadasa Bozakkaravani.\n\n“How do I say your last name?” the judge said.\n\n“Karavani,” she told the judge.\n\n“Karavani,” he repeated. “Good evening, Miss Karavani.”\n\nStory continues below advertisement Advertisement Story continues below advertisement Advertisement\n\nAcross the aisle, a prosecutor approached a microphone and began to recount that morning in the playground for the judge. “Defendant was a stranger to the complainant,” she began.\n\n“Defendant approached the complainant …”\n\n“ … stated in sum and substance: ‘Why are you wearing that? You support Hamas. They kill babies. Your baby should die. You’re a terrorist …’”\n\n“Defendant then threw a cellphone …”\n\n“ … threw a hot beverage …”\n\n“ … nearly striking the child …”\n\nBozakkaravani shook her head.\n\nHer lawyer introduced her to the court: forty-eight years old, a longtime Brooklyn resident and a first-time offender — zero contacts with the system, he told the judge. No warrant history. No absconding or escapes. No felonies. No misdemeanors. “Nothing,” he said. She had turned herself in voluntarily. “Everything went very smoothly.” The complainant, “by the way,” he said, “went immediately onto social media and did every interview he could possibly do to explain what he believed occurred.”\n\n“Obviously, the court is aware of what is occurring politically, not only internationally, but out there on the streets.”\n\nThe case should have been charged as a misdemeanor assault, he said, or a menacing, or an attempt of those things. “Instead, it’s been charged as a hate crime.”\n\nBozakkaravani stared ahead.\n\nAt 12:11 a.m., some 16 hours after she’d turned herself in, she was released without bail. She was handed a copy of an order of protection, barring her from contact with Ash and his son. The handcuffs came off. She left the courthouse with her lawyer, stepped outside and disappeared.\n\nBy that time, Ash and his family were asleep.\n\nInstead of going to the courthouse, he and Mary had stayed home. They were cooking dinner. Their son was in the living room. The television was on, and suddenly Ash heard a voice in his apartment. The local news was playing the video again.\n\n“You and your son, go away.”\n\n“Get away!”\n\nHe turned off the TV and the sound was gone.\n\nAsh plays with his son at Edmonds Playground in Brooklyn, where the attack on them happened in early November.\n\nThe fliers in the neighborhood had come down. The mob that had found the wrong woman and misidentified an empty bag of potato chips had mostly moved onto another outrage. The online comments had slowed. It had been six weeks since that morning in the playground, but Ash still had one question he couldn’t answer: What was an appropriate punishment for hate?\n\nHate is what it had been, he thought.\n\nAnd the charges that followed were serious: attempted assault as a hate crime, menacing as a hate crime, aggravated harassment and endangering the welfare of a child. Twelve counts in all.\n\nAfter her arraignment, Bozakkaravani had returned to court, this time to enter a plea.\n\nShe had yet to say anything publicly about the case. (She and her lawyer declined multiple interview requests for this story.) As she waited to see the judge, a tabloid photographer walked up to her and began to take pictures. She held a hand up to cover her face. “No,” she said. She got up from the bench where she’d been sitting and stood in a corner, turning her back to the camera. “She said no,” said a man in the waiting room. “She said no, bro.” The photographer took another picture. “I’m gonna knock your head off,” the man said. The photographer stopped and a few minutes later, Bozakkaravani entered the courtroom and pleaded not guilty.\n\n“Justice and mercy are hard,” Mary had said to Ash as they discussed it one day.\n\n“Mercy isn’t always the answer,” she said.\n\nBut prison?\n\nStory continues below advertisement Advertisement Story continues below advertisement Advertisement\n\nThe charges carried a maximum sentence of seven years, according to the district attorney’s office.\n\n“Is there a path to reconciliation?” Ash asked during another conversation.\n\n“That’s the question,” Mary said.\n\n“What is justice now?” Ash asked.\n\n“I don’t know,” Mary said.\n\nAnother conversation:\n\n“It was a hypothetical. Now it’s real,” Ash said. “My feelings are more complex.”\n\nSoon, the prosecutor would ask them what they thought the woman deserved.\n\nThey had contacted a few Palestinian friends for advice. One of them said the woman should be forced to attend a class about Palestine. Another said she should be forced to spend one day in jail, to have some idea of what it’s like to be oppressed. Just one day.\n\n“They can’t appear to be soft,” Mary said during another conversation. They were back at the playground with their son.\n\n“If she’s going to prison, okay, fine,” Ash said, “but they need to put the same energy that they put into this into everything else — every hate crime.”\n\nThey were still talking when they heard a cry.\n\n“Oh, no!” Ash said.\n\nIt was their son. He had tripped near the entrance to the basketball court.\n\nAsh and Mary ran to him. They wiped some dirt off his pants. They wiped a small bit of blood from a scrape on his forehead. They hugged him until he stopped crying, and then, distracted for a moment from their conversation about hate and the question they still could not answer, Ash helped him to his feet, held out his hand and guided him back onto the court.\n\n“Let’s go so that you can play,” he said."
    }
]