[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5nbG91Y2VzdGVydGltZXMuY29tL25ld3MvbG9jYWxfbmV3cy9lc3NleC1iYWNrcy1saWNlbnNlLXRyYW5zZmVyLWZvci1yaXBwbGUvYXJ0aWNsZV9kNzlkMGZmMC1hZmVhLTExZWUtYTBiMy1jZmM1NWRjNGZlN2MuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Essex backs license transfer for Ripple | Local News | gloucestertimes.com - Gloucester Daily Times",
        "content": "Close Get email notifications on {{subject}} daily!\n\nYour notification has been saved.\n\nThere was a problem saving your notification.\n\n{{description}}\n\nEmail notifications are only sent once a day, and only if there are new matching items."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjQvMDEvMTMvcmlwcGxlLWN0by1jaXRlcy1sYWNrLW9mLWxpcXVpZGl0eS1hcy1yZWFzb24tZm9yLXJpcHBsZS1tYXNzaXZlLWJ1eWJhY2sv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Ripple CTO Cites “Lack of Liquidity” as Reason for Ripple Massive Buyback - The Crypto Basic",
        "content": "Ripple’s Chief Technology Officer, David Schwartz, has shared his perspective on the ongoing discussion regarding Ripple’s proposed buyback.\n\nFor context, The Crypto Basic has uncovered that Ripple plans to repurchase company shares from initial investors and employees. The total figure is estimated at $285 million.\n\nExpectedly, the development has sparked diverse reactions within the XRP community. The concern was especially considering that the buyback decision arose from Ripple’s decision to step back from its initial public offering (IPO) plans in the United States.\n\n- Advertisement -\n\nRipple Needs No IPO?\n\nCrypto vlogger “Jungle Inc” contended that Ripple’s actions appear to carry a negative tone. This prompted Matt Hamilton, Ripple’s former director, to inquire about the usefulness of an IPO for Ripple.\n\nJungle Inc stated an IPO would demonstrate Ripple’s robust and expanding business performance. This perspective relies on the fact that a significant portion of Ripple’s business revolves around cross-border services, where the utility of XRP plays a crucial role.\n\nMeanwhile, Hamilton argued that an initial public offering would make no functional difference for Ripple. He pointed out that, typically, companies pursue IPOs to raise additional funding. In contrast, given its buoyancy, Ripple has no pressing need for such financial infusion.\n\nBut it would make no functional difference. Companies do IPOs to raise funding. Ripple doesn’t need to raise funding. — Matt Hamilton (@HammerToe) January 10, 2024\n\n- Advertisement -\n\nThe Crypto Basic has recently disclosed that Ripple’s valuation has crossed $11 billion. Also, the firm holds over $25 billion worth of crypto.\n\nMeanwhile, the crypto vlogger countered by suggesting that, even if not for capital, opting for an IPO could still be beneficial in attracting skilled developers and retaining key employees.\n\nRipple CTO Reacts\n\nIn response, Ripple CTO David Schwartz stated that employees are concerned about having a pathway to liquidity for their stock options. He emphasized that they do not necessarily have to be publicly traded shares.\n\nEmployees care that there be some path to liquidity for their stock options, RSUs, or whatever. There's no particular reason it needs to be publicly traded shares specifically. — David \"JoelKatz\" Schwartz (@JoelKatz) January 11, 2024\n\nFurthermore, Jungle Inc asked Schwartz the rationale behind Ripple’s share buyback if a liquid market exists. Ripple CTO clarified that there is no liquid market, highlighting that the market for equity in privately held companies is predominantly illiquid.\n\nUltimately, this explanation sheds light on the motivation behind Ripple’s decision to repurchase shares."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LnNpLmNvbS9uZmwvYmlsbHMvbmV3cy9idWZmYWxvLWJpbGxzLXBvc3Rwb25lbWVudC1hZmMtcGxheW9mZnMtcGl0dHNidXJnaC1zdGVlbGVyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Bills vs. Steelers Postponement Causing Ripple Effect on NFL Playoffs - Sports Illustrated",
        "content": "Moving the game back a day may put the winner of the Buffalo Bulls vs. Pittsburgh Steelers at a disadvantage in the next round of the AFC playoffs.\n\nThe Buffalo Bills and Pittsburgh Steelers Wild Card playoff game has officially been moved to Monday at Highmark Stadium at 4:30 p.m. due to inclement winter weather, the league and team announced on Saturday.\n\nThe game was first scheduled to take place at 1 p.m. on Sunday.\n\nBoth teams' ability to play in the heavy snow and winds isn't in question, as the postponement came down to public safety and travel issues. Inclement weather has caused New York Governor Kathy Hochul to enforce a travel ban that begins at 9 p.m. on Saturday in Erie County, the one Buffalo is located in.\n\nSnow-filled seats at Highmark Stadium.\n\nWhile public safety is undoubtedly the priority in any situation, the No. 2 Bills vs. No. 7 Steelers being pushed back a day will put the winner at a disadvantage heading into the next round, which was noted by media executive Joe Ferreira.\n\nThe other two AFC Wild Card playoff games each take place on Saturday, with the No. 4 Houston Texans playing the No. 5 Cleveland Browns at 4:30 p.m. at NRG Stadium and the No. 3 Kansas City Chiefs vs. No. 6 Miami Dolphins playing at 8:10 p.m. at Arrowhead Stadium.\n\nRegardless of who wins on Saturday, Buffalo or Pittsburgh will be at a significant disadvantage heading into the divisional round. For Buffalo, it faces the higher seed remaining if it wins, meaning its opponent will have two more days of rest. If the Steelers win, they'll face a Baltimore Ravens team that already had a week off because they're the No. 1 seed.\n\nThe other ripple effect of having the No. 2 and No. 7 seed play on a Monday is no one in the AFC will know who they're playing until after Buffalo vs. Pittsburgh concludes. That won't be the case in the NFC, as the teams in that conference will know who they're playing before the No. 4 Tampa Bay Buccaneers vs. No. 5 Philadelphia Eagles play on Monday at 8:15 p.m. ET at Raymond James Stadium.\n\nThe other two NFC Wild Card games take place on Sunday, with the No. 2 Dallas Cowboys vs. No. 7 Green Bay Packers taking place at 4:30 p.m. ET at AT&T Stadium and the No. 3 Detroit Lions facing the No. 6 Los Angeles Rams at 8:15 p.m. ET at Ford Field.\n\nFerreira also noted that the NFL likely scheduled two of its three AFC games in the Wild Card round on Saturday in hopes of its Divisional Round being played on Jan. 20. With Buffalo vs. Pittsburgh, that likely puts that plan in doubt.\n\nGiven the weather Buffalo is expecting, pushing the game back a day was best for all parties involved for everyone's safety. The ripple effect, however, will make what has already been a brutal path to playoffs that much tougher for Buffalo."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjQvMDEvMTMvc2xldXRoLWV4cG9zZXMtd2h5LXJpcHBsZS1pcy1pbi1mYXZvci1vZi1hbi1hbW0tb24tdGhlLXhycC1sZWRnZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Sleuth Exposes Why Ripple is in Favor of an AMM on the XRP Ledger - The Crypto Basic",
        "content": "A blockchain sleuth recently aimed to uncover the reason behind the Ripple support for the proposed Automated Market Maker (AMM) feature on the XRP Ledger (XRPL).\n\nThe AMM, which is currently under voting, would allow anyone to act as a liquidity provider and earn rewards for any trading pair on the blockchain network. This is beneficial to both the XRPL and market participants, as it helps bolster liquidity as well.\n\nThe AMM is one of the most anticipated features on the XRPL, as it would enable more liquidity, diversity, and innovation on the network. However, the voting process has been delayed by the lack of consensus among validators.\n\n- Advertisement -\n\nReason Behind Ripple Support?\n\nSome validators have drummed support for the feature despite the reservations from others. Ripple is one of the validators pushing for the AMM.\n\nRecently, Mr. Huber, an on-chain sleuth, revealed that he discovered the reason behind Ripple’s support from a court document in the Ripple vs. Zakinov case.\n\nThe Ripple vs. Zakinov case is a class action lawsuit filed by some XRP holders who claim that Ripple violated securities laws by selling unregistered XRP. The plaintiffs seek to represent all XRP holders who held XRP at a loss.\n\nThe document presented by Mr. Huber, marked as “highly confidential” in 2021, showed that Ripple’s On-Demand Liquidity (ODL) service (now Ripple Payments), which uses XRP to facilitate cross-border payments, had a high cost of liquidity.\n\n- Advertisement -\n\nAccording to the document, Ripple had to pay fees to market makers who supplied liquidity for ODL transactions in markets where XRP was not liquid enough.\n\nMr. Huber explained that the AMM would solve this problem by enabling anyone to become a market maker and increase the liquidity of any trading pair without extra fees or friction. He called the AMM an “ingenious” solution that would lower the cost of ODL.\n\nTo corroborate his claims, he shared an excerpt of the document. The document stated that Ripple was trying to reduce the cost of liquidity, which accounted for 50% of the amount the firm spent on ODL.\n\nIt also stated that Ripple had to contract with market makers to facilitate ODL flows on exchanges where XRP liquidity was low.\n\nCommunity Reactions\n\nHowever, not everyone in the XRP community was convinced this plan could work. Panos Mekras, a crypto author and XRP proponent, stressed that the AMM alone was not enough to push this narrative for the improvement of ODL.\n\nHe pointed out that ODL still needed on/off-ramp protocols, which were not available in some countries. Also, most of them have high fees.\n\nAccording to Mekras, the combination of ODL and AMM would only be feasible when these rails were available and accessible in all the ODL corridors.\n\nAnother community member asked Mr. Huber why the implementation of the AMM was taking so long, as some validators, including Ripple, had already voted in favor of it. As of press time, 17 validators have voted Yea, while 18 remain on Nay.\n\nWrathofKahneman, a prominent XRP community figure, emphasized that some validators have not voted Yea because of concerns about the network strain that the AMM might cause. He said that they are awaiting more testing before implementing the feature."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy93b3JsZC1ldXJvcGUtNjc5NDQ3MTbSATJodHRwczovL3d3dy5iYmMuY29tL25ld3Mvd29ybGQtZXVyb3BlLTY3OTQ0NzE2LmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Queen Margrethe: Will abdication cause a ripple effect? - BBC.com",
        "content": "Queen Margrethe: Will abdication cause a ripple effect?\n\n14 January 2024 By Laura Gozzi , BBC News Share\n\nWatch: Queen Margrethe II signs the instrument of abdication\n\nWhen Queen Margrethe II of Denmark steps down on Sunday, many Danes will be bereft.\n\nNow that she is abdicating in favour of Crown Prince Frederik, 55, the question is whether she has broken a taboo for all three Nordic royal families.\n\nDenmark's chain-smoking, flamboyant, polyglot Danish queen - who Prime Minister Mette Frederiksen described as the \"epitome of Denmark\" - spent more than half a century on the throne. Danes have been proud of her brains and her quirks, her outspoken rejection of mobile phones and the internet, and her relaxed and playful air.\n\nMargrethe's approachability is typical of the royal houses of Denmark, Sweden and Norway, whose informal manner has earned them high approval ratings as well as the nickname of \"bicycling monarchies\" - perhaps a nod to a favourite pastime of many northern Europeans, but also a way of setting the Nordic hereditary kingdoms apart from stuffier counterparts.\n\nYounger royals have cemented this impression. Danish Crown Prince Frederik is seen as a friendly, down-to-earth family man with a penchant for rock music; Haakon, the heir to the Norwegian throne, has built a reputation for pranks at gala dinners; and Sweden's beloved Crown Princess Victoria has been open about her struggles with anorexia.\n\nMany Danish and Norwegian royals also send their children to state schools - and it helps that the three heirs to the Nordic thrones have all married commoners.\n\nGetty Images King Carl XVl Gustaf of Sweden, Queen Margrethe ll of Denmark and King Harald V of Norway celebrate Margrethe's 40th jubilee in 2012\n\nThe affinity between the members of the three royal families is plain to see: they often visit one another, and some even go on holiday together. It's also worth noting that the three current monarchs are all related: Norway's King Harald V and Sweden's Carl XVI Gustaf are Margrethe's second and first cousins respectively.\n\n\"Nordic monarchies share the same values, culture, history. Their royals are all widely seen as hard-working and keen to talk to people and to engage with them,\" royal commentator Marie Ronde for Denmark's TV2 told the BBC.\n\nMonarchs in the three Nordic royal families have also been able to keep up with changing times.\n\nIn the late 1970s, Swedish law was changed to ensure Carl XVI Gustaf's eldest daughter could succeed him, rather than his only son. The king has been a lifelong champion of environmentalism, and has often used his position to raise awareness on climate change.\n\nHarald has been known to hold similarly progressive views. In 2016, he made an impassioned speech in support of LGBT equality and refugees, paying tribute to his fellow citizens from \"Afghanistan, Pakistan and Poland, from Sweden, Somalia, and Syria,\" and saying that Norwegians \"are girls who love girls, boys who love boys, and girls and boys who love each other\".\n\nAbove all, Nordic monarchies have proved they are capable of more than just cosmetic changes - most notably by choosing to slim down their monarchies.\n\nPatrick van Katwijk Queen Margrethe, pictured here at a horse ceremony with her family, will step down on 14 January - 52 years to the day since she became monarch\n\nIn 2019, Carl XVI Gustaf removed five of his grandchildren from the royal house, reflecting a wider view that there is no need to pay so many members of the royal family for official duties.\n\nThree years later, Margrethe stripped four of her grandchildren of their royal titles - something she said would \"future-proof\" the institution and allow it to \"keep with the times\".\n\nThese decisions have paid off. Approval rates for the Danish and Norwegian regents consistently hover around the 80% mark, while a recent Swedish poll showed that anti-monarchy sentiment was at its lowest in over 20 years.\n\nAbdication, then, remains the last hurdle. Despite negative connotations in some quarters, it is not a universally reviled practice among Europe's royal families.\n\nIn the Netherlands it has become something of a tradition: four Dutch monarchs have decided to step down in favour of their children since the Netherlands became an independent monarchy in 1815, and several grand dukes of neighbouring Luxembourg have also relinquished the throne to their heirs with apparent ease.\n\nGetty Images King Harald V of Norway, Queen Margrethe II of Denmark and Queen Sonja of Norway at the World Nordic Ski Championships in 2011\n\nIt's true that, in many places, the concept conjures up unpleasant memories. The former kings of Spain and the Belgians stepped down in the wake of major scandals, while the UK was plunged into a constitutional crisis following Edward VIII's decision to vacate the throne to marry a divorcee in 1936.\n\nFor their part, the Nordic monarchs had resisted the practice altogether - until Margrethe's shock announcement on New Year's Eve.\n\nNow, her move - due to longstanding health issues - has led many to wonder if a similar surprise might be on the cards elsewhere in the region. Nordic regents have always batted away suggestions of stepping down in favour of their heirs - but, then again, so had Margrethe.\n\n\"The queen had always been very firm in her position that hers is a position for life... something you do until you die,\" Swedish royal expert Roger Lundgren told the BBC.\n\nIn 2012, on her 40th anniversary as Queen, Margrethe famously said: \"I will remain on the throne until I drop.\" The only other precedent for abdication in Denmark is Erik III - who stepped down from the throne in 1146.\n\nSwedish royal commentator Anders Pihlblad says that although Carl XVI Gustaf is often asked about the possibility of stepping down, \"it's not because Swedish people don't think he's doing a good job, but because his daughter, Crown Princess Victoria, is very, very popular.\"\n\nGetty Images Prince Frederik of Denmark, Princess Victoria of Sweden, and Prince Haakon of Norway in Greenland in 2009. The three, who are all close in age, are said to be good friends\n\nCarl XVI Gustaf has previously indicated he was determined to remain on the throne until his death. \"Retirement? No, that word doesn't actually run in our family. At least not historically,\" he told Swedish outlet Expressen in 2014. \"It is an old tradition of ours not to retire.\"\n\nSimilarly, Harald has told Norwegian media that the oath he took in 1991 is \"for life\": \"It's that simple for me. We're at it until the bitter end.\"\n\n\"Norwegians will support Harald [if he abdicates], but they are very impressed he is still on the throne in spite of all his health issues,\" said Kristi Marie Skrede, royal correspondent for Norway's NRK TV.\n\nTheir reluctance has sometimes seemed surprising: after decades of service, it is unlikely they would be berated for stepping down.\n\nThe youngest of the three, Carl XVI Gustaf, is 77, and has been on the Swedish throne since he was 27; once Margarethe steps down, he will become the third current longest-reigning monarch in the world.\n\nHarald, who will be 87 next month, has taken sick leave a number of times - including to undergo surgery for heart problems and bladder cancer, and was admitted to hospital with an infection as recently as last year. His son, Haakon, seamlessly stepped in to act as regent. Like the heirs of the other Nordic royal houses, he is highly popular.\n\nIs it possible, then, that Margrethe's abdication will pave the way for similar moves in neighbouring kingdoms?"
    }
]