[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTEvYWF2ZS1kYW8tdG8tdm90ZS1vbi1naG8tc3RhYmxlY29pbi1kZXBsb3ltZW50LW9uLWV0aGVyZXVtL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTEvYWF2ZS1kYW8tdG8tdm90ZS1vbi1naG8tc3RhYmxlY29pbi1kZXBsb3ltZW50LW9uLWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Aave DAO to Vote on Gho Stablecoin Deployment on Ethereum - CoinDesk",
        "content": "These facilitators, which can be protocols or entities, have the ability to generate and burn GHO tokens up to a certain limit, enabling depositors to borrow GHO against their collateral deposited in Aave V3's Ethereum mainnet pool."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS10dXJuaW5nLXBvaW50LTE5MDAv0gFLaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXR1cm5pbmctcG9pbnQtMTkwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Reaches Key Turning Point, $1,900 Is The Key - NewsBTC",
        "content": "Ethereum price is attempting a fresh increase from $1,825 against the US Dollar. ETH could rally if there is a clear move above the $1,900 resistance.\n\nEthereum is currently attempting a recovery wave above the $1,855 zone.\n\nThe price is trading above $1,865 and the 100-hourly Simple Moving Average.\n\nThere is a major bearish trend line forming with resistance near $1,900 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could start a decent increase if there is a close above $1,900.\n\nEthereum Price Revisits Resistance\n\nEthereum’s price remained stable above the $1,825 support zone. ETH started a slow recovery wave and was able to climb a few points higher above $1,850, similar to Bitcoin.\n\nThe bulls were able to push the price above the 100-hourly Simple Moving Average. The price broke the 50% Fib retracement level of the key decline from the $1,955 swing high to the $1,825 low. However, the bears were seen active near the $1,900 resistance zone.\n\nThere is also a major bearish trend line forming with resistance near $1,900 on the hourly chart of ETH/USD. Ether is now trading above $1,865 and the 100-hourly Simple Moving Average.\n\nImmediate resistance is near the $1,890 level. The first major resistance is near the $1,900 zone and the trend line. The trend line is close to the 61.8% Fib retracement level of the key decline from the $1,955 swing high to the $1,825 low.\n\nSource: ETHUSD on TradingView.com\n\nA close above the $1,900 resistance could start a decent increase toward $1,975. The next major resistance is near the $2,000 level. Any more gains could send Ether toward the $2,050 resistance or even $2,120.\n\nAnother Rejection in ETH?\n\nIf Ethereum fails to clear the $1,900 resistance, it could start another decline. Initial support on the downside is near the $1,865 level or the 100-hourly Simple Moving Average.\n\nThe first major support is near the $1,825 level, below which there is a risk of a larger decline. The next major support is near the $1,740 level. Any more losses could send Ether toward the $1,720 support level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $1,825\n\nMajor Resistance Level – $1,900\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdS50b2RheS9ldGgtZ29lcy11cC1pbi1mbGFtZXMtZGl2ZS1pbnRvLWZpZXJ5LWRlcHRocy1vZi1ldGhlcmV1bXMtZmlyZS1zYWxl0gFXaHR0cHM6Ly91LnRvZGF5L2V0aC1nb2VzLXVwLWluLWZsYW1lcy1kaXZlLWludG8tZmllcnktZGVwdGhzLW9mLWV0aGVyZXVtcy1maXJlLXNhbGU_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "ETH Goes up in Flames: Dive into Fiery Depths of Ethereum's 'Fire Sale' - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nCryptocurrency markets often undergo significant price fluctuations, leading to unique buying opportunities known as \"fire sales.\" The term refers to situations when an asset is perceived to be oversold, prompting interested investors to buy in at relatively low prices. For Ethereum (ETH), one of the leading indicators that tracks these opportunities is the rainbow chart, and it is currently signaling a \"fire sale.\"\n\nAdvertisement\n\nTo understand what this means, let's first examine the rainbow chart concept, typically used in Bitcoin (BTC) analysis. The Bitcoin rainbow chart is a logarithmic price chart that applies color-coded bands to represent the predicted price growth of BTC over time. Each color corresponds to different levels of price action, from the red \"maximum bubble territory\" to the dark blue \"basically a fire sale.\"\n\nThese charts are based on the assumption that Bitcoin's price will follow a predictable exponential growth pattern over the long term, with periodic boom-and-bust cycles.\n\nTranslating this to Ethereum, the rainbow chart concept suggests that Ethereum is currently in \"fire sale\" territory, indicating that ETH could be significantly undervalued at its current price levels.\n\nHowever, it is crucial to remember that these charts require different calculations when applied to Ethereum. Unlike Bitcoin, which has a capped supply and predictable inflation, Ethereum's monetary policy is more complex, particularly with its transition from proof of work (PoW) to proof of stake (PoS).\n\nThis shift alters Ethereum's inflation rate and introduces a new deflationary mechanism through the burning of transaction fees, fundamentally changing the dynamics that the rainbow chart seeks to model.\n\nWhile Ethereum's rainbow chart may currently indicate a \"fire sale,\" these metrics should not be used in isolation. Investors should account for Ethereum's unique monetary policy changes, market conditions and other technical indicators when making investment decisions."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2Fub3RoZXItemstcm9sbHVwLW9uLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Ethereum welcomes another zk rollup to mainnet - Blockworks",
        "content": "Blockchain software development firm Consensys has gone down as the latest to join the zero-knowledge rollup game, unveiling Linea on Ethereum’s mainnet.\n\nThis move comes after Linea’s testnet phase on Goerli, which saw over 5.5 million wallet addresses execute over 46 million transactions.\n\nLinea is a type 2 zero-knowledge Ethereum virtual machine, or a zk-EVM — meaning it is an EVM equivalent, but not an Ethereum equivalent. The layer-2 network is designed to replicate user experience on mainnet, but at faster speeds and transaction costs by up to 15 times lower compared to Ethereum layer-1.\n\n“By leveraging its industry-leading prover, Vortex, the result of over four years of R&D, Linea can generate efficient ZK proofs and offer performances that unlock cheaper transactions for users and faster settlement finality with Ethereum,” Declan Fox, senior product manager at Consensys, told Blockworks.\n\nBeing fully EVM compatible also means that there are no switching costs for Ethereum, Fox said.\n\nAt launch, Linea will be integrated with existing Web3 products such as MetaMask and Infura, meaning that, from the get-go, infrastructure ought to be familiar to developers.\n\nLinea’s mainnet launch will also be introducing new features:\n\nBatch conflation — designed to reduce costs by optimizing layer-2 transactions, so that it can fit better into a batch submitted to Ethereum layer-1\n\nA new Canonical ERC-20 bridge — designed to enable any ERC-20 tokens to be created on Linea when bridged\n\nDynamic fee mechanism — used to manage Ethereum gas fees\n\nA new outer proof system will also be introduced.\n\n“The Linea prover, Vortex, offers fast proof generation by using lattice-based cryptography and self-recursion to compress a proof of computation, this ‘inner proof’ is then compressed in a final step, known as the ‘outer proof’ to reduce its size and the costs to verify on Ethereum,” Fox said. “Linea uses PLONK as its outer proof as it requires a universal trusted setup — essentially, each time the circuit is updated, a new setup ceremony does not need to be conducted to dispose of the randomness.”\n\nTo prevent any implementation risks, Linea will be using a multi-prover approach, Fox said.\n\n“The Multi-Prover uses multiple diverse implementations of a zkEVM to prove a transaction thus ensuring if one prover has a bug or becomes unavailable, as long as a quorum is reached amongst the other available proofs, the system will continue to operate reliably,” he said.\n\nWith the zero-knowledge rollup space drawing significant competition, Consensys notes it will unveil a major NFT collection on its network on July 18. All testers who participated in Linea Voyage will be eligible to mint the collection. Developers will also be able to participate in a hackathon with prizes of up to $50,000.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDcvMTEvZXRoZXJldW0tc3Rha2luZy1zZWMtYWxsdXZpYWwtc2VyaWVzLWEtdmFyaWFudC1jb2luYmFzZS_SAWJodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA3LzExL2V0aGVyZXVtLXN0YWtpbmctc2VjLWFsbHV2aWFsLXNlcmllcy1hLXZhcmlhbnQtY29pbmJhc2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Alluvial raises $12 million to build out Liquid Collective, an Ethereum staking protocol for institutions - Fortune",
        "content": "The software company Alluvial announced on Tuesday that it’s closed a Series A round, raising $12 million co-led by Ethereal Ventures and Variant, with other backers including Brevan Howard Digital, Coinbase Ventures, Kraken, and Avon Ventures, which is affiliated with Fidelity.\n\nAlluvial is the developer behind Liquid Collective, a protocol that supports “liquid staking” for Ethereum. Unlike competitors such as Lido and RocketPool that offer a “staking-as-a-service” product, Alluvial is catering to institutions and traditional finance, predicting that larger players will want to enter the space. With regulators including the Securities and Exchange Commission circling around staking, Alluvial is making a long-term gamble on the Ethereum ecosystem.\n\nProof of stake\n\nBlockchains require a decentralized consensus mechanism, where network participants verify and validate transactions, adding them to the distributed ledger. Bitcoin employed a proof-of-work mechanism, in which miners race to validate blocks in exchange for rewards. Its energy-intensive nature led later projects to adopt a proof-of-stake model, where validators who lock up large amounts of cryptocurrency within the blockchain get a chance at processing transactions. In late 2022, Ethereum—the second-largest blockchain by market cap—switched to proof of stake in a process known as the Merge.\n\nWhile staking can yield lucrative rewards, it poses multiple challenges, including a technical cliff to entering as well as the difficulty of accessing staked Ether, despite the recent Shanghai upgrade. Liquid staking providers such as Alluvial’s Liquid Collective ease these challenges, working with exchanges to offer simple on-ramps into staking as well as a “receipt token” that users receive after staking cryptocurrencies. Liquid Collective’s token, LsETH, reflects the accrued network rewards and can be traded on exchanges such as Coinbase.\n\nLiquid Collective differs from other products by catering to institutions. While individual users can purchase LsETH on exchanges, they cannot stake Ether with Liquid Collective without access to institutional trading platforms like Coinbase Prime and Bitcoin Suisse, which require a higher barrier of entry for traders.\n\nRegulatory clarity\n\nIn recent months, the SEC has targeted staking, with Chair Gary Gensler noting in public comments that proof-of-stake tokens should be regulated as securities, and the SEC suing both Coinbase and Kraken for their staking-as-a-service programs, alleging that the products constitute an unregistered security. A task force of 10 state securities regulators also alleged that Coinbase’s staking program violated state securities law.\n\nIn an interview with Fortune, Alluvial CEO Mara Schmiedt argued that the company’s focus on compliance will position it for a future where there is more “regulatory clarity,” even if that means staking services are not viable in the short-term in the U.S. Unlike other products, Liquid Collective’s closely guarded entry means that it includes more know-your-customer and anti-money-laundering checks than competitors. Schmiedt also said that its noncustodial model, meaning it doesn’t hold users’ Ether, and fixed reward mechanism from Ethereum differentiates it from other services that bear the characteristics of a security offering.\n\nJesse Walden, a general partner and co-founder of Variant, said his firm invested in Alluvial because it uses Liquid Collective. They chose it over other KYC-compliant services, including Coinbase’s, because of its diversification of validator nodes. He acknowledged the regulatory risk but remains bullish on staking’s future. “Access to this very large—and growing—market that is not going away is going to triumph over the short-term regulatory uncertainty,” he told Fortune.\n\nAlluvial is a Delaware-incorporated company, with the Liquid Collective Foundation registered in the Cayman Islands. The team is distributed, including across the U.S., Europe, and Dubai. Schmiedt said Alluvial plans to use the funding to grow the team, particularly in engineering, to continue product development and expand staking services to other blockchain networks."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGVjcnlwdC5jby8xNDc5Njgvc3Rha2VkLWV0aGVyZXVtLW5vdy1hY2NvdW50cy1mb3ItMjAtb2YtdGhlLXRvdGFsLXN1cHBsedIBV2h0dHBzOi8vZGVjcnlwdC5jby8xNDc5Njgvc3Rha2VkLWV0aGVyZXVtLW5vdy1hY2NvdW50cy1mb3ItMjAtb2YtdGhlLXRvdGFsLXN1cHBseT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Staked Ethereum Now Accounts for 20% of the Total Supply - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJust shy of $45 billion or 20% of Ethereum in circulation has been staked—a milestone reached on Monday that captures coins at work like never before.\n\nPeople pledge tokens to the network to keep it secure and receive rewards for doing so. And close to 24 million Ethereum is currently locked up across 744,000 validators that process transactions, according to a dashboard on Dune Analytics created by a user named hildobby.\n\nAD\n\nAD\n\nEthereum is one of many blockchains that utilizes a proof-of-stake consensus model, which, in the case of Ethereum, involves validators pledging at least 32 Ethereum for the chance to validate transactions and receive associated fees.\n\nBut that hasn’t always been the case. In September of last year, after much anticipation, Ethereum transitioned from proof-of-work—an energy-intensive process used by networks like Bitcoin—to proof-of-stake. And for months, staked Ethereum couldn’t be withdrawn until an upgrade this past April enabled it.\n\nFor reference, around $29 billion worth of Ethereum, or 14.5% of ETH in circulation, was pledged leading up to the pivotal Shanghai upgrade that enabled staking withdrawals.\n\nMonday’s milestone represents a noteworthy achievement and captures the success of Ethereum’s journey toward a consensus model that’s ultimately friendlier on the environment, prominent venture capitalist and crypto analyst Adam Cochran told Decrypt.\n\n“This is a huge point of progress for the network, aligning economic incentives with security goals works and is critical for a decentralized network,” he said. “We should all be proud of this milestone.”\n\nAD\n\nAD\n\nWhen it comes to how people stake their Ethereum, Lido Finance, the crypto market’s largest liquid staking protocol, is by far the most popular choice. Allowing users to stake ETH in any amount and receive a staked Ethereum token called “stETH” in exchange, it accounts for nearly 32% of all staked Ethereum, according to Dune.\n\nCryptocurrency exchanges are also big players. Coinbase, Kraken, Binance, and OKX account for around 19% of all staked Ethereum, according to Dune. In a bear market, where trading volumes are depressed, staking has helped exchanges find an alternative source of revenue.\n\nYet regulators in the U.S. have their qualms with how staking services are offered to customers, alleging they run afoul of securities laws. Both Kraken and Coinbase have faced regulatory heat for staking products this year—Kraken settled a lawsuit in February and Coinbase’s is ongoing.\n\nFinancial institutions are paying attention to staking and exploring how it can bolster the products they offer, in Canada, at least. Two weeks ago, the digital asset manager 3iQ said two of its exchange-traded funds (ETFs) will offer staking to clients in August."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb25zZW5zeXMtbGF1bmNoZXMtbGluZWEtemstZXZtLXRvLXNjYWxlLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "ConsenSys launches Linea zkEVM to further scale Ethereum - Cointelegraph",
        "content": "The Ethereum ecosystem welcomes another layer-2 scaling solution as ConsenSys begins onboarding partners to its Linea network, which has produced significant scaling milestones in testing.\n\nLinea is an Ethereum layer-2 scaling network that allows developers to build or migrate decentralized applications for Ethereum. It operates using zero-knowledge proofs and is Ethereum Virtual Machine (EVM) equivalent, meaning its applications can seamlessly interact with the Ethereum blockchain.\n\nThe network went through a lengthy testnet period which saw some 5.5 million unique wallets carry out over 46 million transactions. ConsenSys outlined improvements to Linea’s performance, transaction costs and user experience through its testing period.\n\nThe gradual alpha release began on July 11 with more than 100 partners and ConsenSys touts faster throughput and 15 times lower transaction fees than those executed on Ethereum’s mainnet.\n\nLinea also integrates with ConsenSys’ Ethereum browser wallet MetaMask, giving Linea users access to its token bridge, swap and buy functionality.\n\nConsenSys founder and CEO Joseph Lubin highlighted the number of layer 2 Ethereum scaling protocols and solutions as a key component driving the development of Web3 applications and functionality:\n\n“With the Merge to Proof of Stake and the broad traction of the rollup-centric roadmap, Ethereum L2s are set to play a crucial role in making great advances in scalability and usability.”\n\nThe announcement shared with Cointelegraph highlights decentralized finance (DeFi) applications migrating to Linea to tap into fast finality, capital efficient bridge and inherited security from Ethereum’s mainnet.\n\nMeanwhile the network also offers lower gas fees, high throughput and low latency, which are key components needed to power nonfungible tokens, blockchain gaming and social applications.\n\nRelated: Are ZK-proofs the answer to Bitcoin’s Ordinal and BRC-20 problem?\n\nConsenSys also launched its Linea Ecosystem Investment Alliance (EIA), which will see more than 30 venture capital firms lend capital and advisory assistance to ecosystem builders.\n\nThe launch of Linea’s alpha mainnet will make use of safeguards to protect users, DApps and the network itself. This includes only allowing launch partners the execute calls to the network over the first week.\n\nConsenSys intends to open up the network during ETHCC in France from July 17, while some limits on withdrawals may be instituted over the first 90 days. The firm will carry out a bug bounty and monitor system performance before fully opening LIna to end users.\n\nEthereum layer 2's have been a major talking point in 2023. Layer 2 development firm Polygon also tooks its zkEVM network public in March 2023. Meanwhile Starknet, whose founder Eli Ben-Sasson pioneered zk-proofs, has focused on increasing throughput of its network this year.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: ZK-rollups are ‘the endgame’ for scaling blockchains: Polygon Miden founder"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9oZXJlcy1ob3ctZXRoZXJldW0tdHJhZGVycy1jYW4tbmF2aWdhdGUtc2hvcnQtdGVybS10cmVuZHMv0gFUaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2hlcmVzLWhvdy1ldGhlcmV1bS10cmFkZXJzLWNhbi1uYXZpZ2F0ZS1zaG9ydC10ZXJtLXRyZW5kcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Here’s how Ethereum traders can navigate short-term trends - AMBCrypto News",
        "content": "Disclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion.\n\nThe price action of Ethereum in the past three weeks showed large volatility and no clear trend.\n\nThe psychological level at $1900 was retested as resistance in recent hours.\n\nEthereum [ETH] showed some conflicting signs on the higher timeframe charts. The asset has been on an uptrend in 2023 after the move above $1350, but the trend shifted bearishly in mid-April.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nOn 16 June, ETH dropped as low as $1626 before rallying to $1976 on 3 July. This signified a bullish structure- but is ETH ready to rally?\n\nThe lower timeframe picture was clearer. The 4-hour chart showed a strong possibility that Ethereum is preparing for the next big move. The price was in a phase of consolidation, but can the bulls drive another rally?\n\nThe rejection from $1978 saw selling pressure dominate\n\nA range formation between $1843 and $1934 was highlighted in yellow. The brief breakout above this range in early July was quickly swatted down by the bears. Moreover, the OBV, which had been trending higher until then, declined.\n\nOver the past week, the OBV continued to drop as the price dropped to the range lows. A candlewick to the $1826 mark on 7 July saw a quick reversal, which suggested that the bulls were not ready to give up on the range formation yet.\n\nThe RSI oscillated between bullish and bearish territory over the past few days to indicate the lack of a trend. However, on lower timeframes such as 1-hour, there was momentum for traders to profit from.\n\nBut, given the decline in OBV, the consolidation phase could be followed by a downtrend for Ethereum. Until the range lows are ceded to the bears, buyers can look to bid in the $1840-$1860 targeting the high at $1935.\n\nThe spot CVD remained flat despite Ethereum’s bounce from the range lows\n\nHow much are 1,10,100 ETHs worth today?\n\nOn 7 July, after the dip below $1830, Ethereum prices recovered. At the time of writing, ETH was trading at $1885 after rejection from $1900. Even though it was a minor bounce, the spot CVD did not climb higher.\n\nNor did the Open Interest budge much. It remained flat over the past few days and reflected the lack of conviction from speculators. The lack of reaction on the OI despite a minor bounce for Ethereum suggested the bullish side could be weakened."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8xMS9oZXJlcy1ob3ctZXRoZXJldW0tZXRoLWNvdWxkLWlnbml0ZS1uZWFybHktMzUtcmFsbHktYWNjb3JkaW5nLXRvLXRyYWRlci13aG8tcm9kZS0yMDIzLWNyeXB0by1icmVha291dC_SAYsBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDcvMTEvaGVyZXMtaG93LWV0aGVyZXVtLWV0aC1jb3VsZC1pZ25pdGUtbmVhcmx5LTM1LXJhbGx5LWFjY29yZGluZy10by10cmFkZXItd2hvLXJvZGUtMjAyMy1jcnlwdG8tYnJlYWtvdXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Here’s How Ethereum (ETH) Could Ignite Nearly 35% Rally, According to Trader Who Rode 2023 Crypto Breakout - The Daily Hodl",
        "content": "A trader who skillfully rode the surge in the crypto markets earlier this year is outlining a scenario where Ethereum (ETH) could witness a significant burst to the upside.\n\nIn a recent strategy session, trader DonAlt tells his 52,200 YouTube subscribers that Ethereum continues to consolidate just under its key resistance level at $1,935.\n\nAccording to the top trader, further consolidation at current prices could lead to an eventual breakout.\n\n“ETH is actually consolidating in an area where it’s actually okay because this resistance really should produce a down move. So far, it’s done that a couple of times, but nothing really stuck…\n\nBitcoin should move soon. Otherwise, it’s going to be not nice. And then I look at ETH, if this stays (like) this for two, three, four more weeks that resistance should be cooked…\n\nYou get a close above ($1,935), I think it’s pretty likely that you’re going to go higher.”\n\nDonAlt also says that a move above $1,935 could ignite a rapid rally that could send ETH to a level last seen in May 2022, before Ethereum broke down due to the collapse of the Terra (LUNA) ecosystem.\n\n“To the upside, we close above $1,935, it seems pretty damn clear that we’re going to go to $2,500. There’s pretty much just empty air… Given that we’ve stuck around the $2,000 handle so much just seems sensible to go up quite quickly if we do get through it.”\n\nAt time of writing, Ethereum is trading for $1,882.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vYmxvY2tjaGFpbm1hZ2F6aW5lLm5ldC90b3AtMTAtZXRoZXJldW0tYmxvY2tjaGFpbi1pbm5vdmF0aW9ucy1kcml2aW5nLWFkb3B0aW9uLWFuZC1ncm93dGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Top 10 Ethereum Blockchain Innovations Driving Adoption And Growth - Blockchain Magazine",
        "content": "Ethereum is a decentralized, open-source blockchain platform that enables the creation and execution of smart contracts and decentralized applications (DApps). It was proposed by Vitalik Buterin in late 2013 and officially launched on July 30, 2015. Ethereum’s native cryptocurrency is called Ether (ETH), which is used to facilitate transactions and incentivize participants on the network.\n\nEthereum is a decentralized, open-source blockchain platform that enables the creation and execution of smart contracts and decentralized applications (DApps). It was proposed by Vitalik Buterin in late 2013 and officially launched on July 30, 2015. Ethereum’s native cryptocurrency is called Ether (ETH), which is used to facilitate transactions and incentivize participants on the network.\n\nAt its core, Ethereum is a decentralized platform that allows developers to build and deploy smart contracts. Smart contracts are self-executing agreements with predefined rules and conditions written into code. They automatically execute transactions and actions when specific conditions are met, eliminating the need for intermediaries or third parties.\n\nEthereum introduced the concept of a Turing-complete programming language within its blockchain, allowing developers to create complex and highly customizable decentralized applications. This flexibility has led to the rapid growth of the Ethereum ecosystem and the development of various decentralized finance (DeFi) applications, non-fungible tokens (NFTs), decentralized exchanges, and much more.\n\nEthereum operates on a distributed network of computers called nodes. These nodes maintain a copy of the entire Ethereum blockchain and work together to validate and record transactions. This decentralized nature ensures that there is no central point of control or failure, making the network resilient to censorship and single points of failure.\n\nThe Ethereum blockchain uses a consensus mechanism known as Proof-of-Work (PoW), although there are plans to transition to a more energy-efficient consensus algorithm called Proof-of-Stake (PoS) with the upcoming Ethereum 2.0 upgrade. PoW requires miners to solve complex mathematical puzzles to validate transactions and secure the network. Miners are rewarded with Ether for their computational efforts.\n\nEthereum’s blockchain consists of a series of blocks, each containing a list of transactions and a reference to the previous block, creating a chronological chain of data. This ensures the immutability and integrity of the blockchain. Ethereum also allows for the storage of data and the execution of code within its blockchain, enabling developers to create decentralized applications that are censorship-resistant and tamper-proof.\n\nThe Ethereum ecosystem is supported by a vibrant community of developers, entrepreneurs, and enthusiasts. The Ethereum Virtual Machine (EVM) is a runtime environment that executes smart contracts on the Ethereum network. It enables developers to write code in various programming languages, including Solidity (Ethereum’s native language), Vyper, and others.\n\nIn addition to its role as a platform for creating DApps, Ethereum has its own economy and serves as a financial instrument. Ether (ETH), the native cryptocurrency, can be used for various purposes within the Ethereum ecosystem. It can be traded on cryptocurrency exchanges, used to pay for transaction fees (gas) when executing smart contracts or transferring tokens, and staked to participate in the network’s consensus mechanism.\n\nOverall, Ethereum has revolutionized the blockchain industry by providing a powerful platform for decentralized applications and smart contracts. Its open nature, flexibility, and growing ecosystem have made it a popular choice for developers and entrepreneurs seeking to build innovative and transparent applications in a decentralized manner.\n\nBlockchain is a decentralized and distributed ledger technology that allows multiple participants to maintain a shared, tamper-resistant, and transparent record of transactions or information. It was originally introduced as the underlying technology for the cryptocurrency Bitcoin, but its potential applications have expanded far beyond digital currencies.\n\nAt its core, a blockchain is a chain of blocks, where each block contains a list of transactions or data. These blocks are linked together using cryptographic hashes, creating a chronological and immutable record of all transactions or information stored on the blockchain.\n\nThe key features of blockchain technology are decentralization, transparency, security, and immutability.\n\nDecentralization: Unlike traditional centralized systems where a central authority, such as a bank or government, maintains and controls the data, a blockchain operates in a decentralized manner. It is distributed across multiple computers or nodes that participate in the network. Each node has a copy of the entire blockchain, and transactions are validated and added to the ledger through a consensus mechanism agreed upon by the network participants. This decentralized nature eliminates the need for intermediaries and creates a trustless environment where participants can interact directly with one another.\n\nTransparency: Blockchain provides transparency by allowing anyone to view the transactions or information recorded on the blockchain. Once a transaction is added to the blockchain, it becomes visible to all participants in the network. This transparency promotes accountability and reduces the potential for fraud or manipulation since the data is open and verifiable by anyone.\n\nSecurity: Blockchain ensures the security of transactions and data through cryptographic techniques. Each transaction or block is secured using a cryptographic hash, which is a unique digital fingerprint generated by an algorithm. Any modification to the data within a block would result in a different hash, making it easily detectable. Moreover, blockchain’s decentralized nature and consensus mechanism make it highly resistant to attacks or unauthorized changes. To alter a transaction or block, an attacker would need to control the majority of the network’s computing power, making it computationally infeasible and economically unviable.\n\nImmutability: Once a transaction or block is added to the blockchain, it is nearly impossible to alter or delete it. This immutability is a result of the cryptographic linking between blocks and the decentralized consensus mechanism. As new blocks are added to the blockchain, they are linked to previous blocks using cryptographic hashes. This chaining of blocks makes it computationally expensive to alter past transactions, as it would require modifying all subsequent blocks as well. The immutability of blockchain provides a high level of data integrity and builds trust among participants.\n\nBlockchain technology has expanded beyond cryptocurrencies and is now being explored and implemented in various industries and sectors. It has the potential to revolutionize supply chain management, voting systems, financial services, healthcare, identity verification, real estate, and more. Smart contracts, which are self-executing agreements with predefined conditions written into code, can be deployed on blockchains to automate and enforce contractual obligations without the need for intermediaries.\n\nHowever, it is important to note that blockchain technology also has its limitations. It can be computationally expensive and slower compared to centralized systems, and scaling the technology to handle large volumes of transactions is an ongoing challenge. Nevertheless, ongoing research and development efforts are focused on improving scalability and addressing other limitations to unlock the full potential of blockchain technology.\n\nAlso read: 10 Best Books To Learn About Ethereum To Understand Open- Source Blockchain\n\nRelation between Ethereum and Blockchain\n\nEthereum is one of the most prominent implementations of blockchain technology. It is a decentralized blockchain platform that utilizes blockchain’s fundamental principles to enable the creation and execution of smart contracts and decentralized applications (DApps).\n\nIn essence, Ethereum is built upon the underlying blockchain infrastructure. It leverages the decentralized, transparent, secure, and immutable nature of blockchain to provide a platform for developers to build and deploy DApps and smart contracts. Ethereum extends the capabilities of blockchain beyond simple financial transactions by incorporating a Turing-complete programming language within its blockchain.\n\nHere are the key aspects of the relation between Ethereum and blockchain:\n\n1. Blockchain as the underlying technology: Ethereum is based on the concept of blockchain, which serves as the underlying technology that enables the secure and transparent recording of transactions. The Ethereum blockchain consists of a series of blocks, each containing a list of transactions and a reference to the previous block, creating a chronological chain of data. This blockchain architecture ensures the integrity and immutability of the recorded transactions.\n\n2. Smart contracts on the Ethereum blockchain: Ethereum introduced the concept of smart contracts, which are self-executing agreements with predefined conditions written into code. These smart contracts are stored and executed on the Ethereum blockchain, taking advantage of the decentralized and transparent nature of blockchain. The Ethereum Virtual Machine (EVM), a runtime environment on the Ethereum network, executes the smart contracts. The blockchain serves as the secure and immutable platform to record and validate the execution of these contracts.\n\n3. Decentralized applications (DApps): Ethereum allows developers to build decentralized applications (DApps) on its blockchain. DApps are software applications that run on a decentralized network of computers, rather than a single server or a centralized infrastructure. Ethereum provides developers with the tools, frameworks, and libraries to create and deploy DApps. These applications can interact with the Ethereum blockchain, execute smart contracts, and utilize the decentralized nature of the network.\n\n4. Ethereum’s consensus mechanism: Ethereum initially used a Proof-of-Work (PoW) consensus mechanism, similar to that of Bitcoin, to secure its blockchain and validate transactions. However, with the upcoming Ethereum 2.0 upgrade, it is transitioning to a more energy-efficient consensus mechanism called Proof-of-Stake (PoS). The consensus mechanism determines how nodes in the network agree on the validity of transactions and maintain the integrity of the blockchain.\n\n5. Native cryptocurrency: Ethereum has its native cryptocurrency called Ether (ETH). Ether serves multiple purposes within the Ethereum ecosystem. It can be used to facilitate transactions, pay for gas fees (transaction fees) when executing smart contracts, and participate in the consensus mechanism by staking. The transfer of Ether and other tokens on the Ethereum blockchain is recorded and secured by the underlying blockchain technology.\n\nIn summary, Ethereum is a specific implementation of blockchain technology that extends its capabilities by allowing the execution of smart contracts and the development of decentralized applications. Ethereum utilizes blockchain’s decentralized, transparent, secure, and immutable properties to provide a platform for developers to create innovative applications and execute programmable contracts on a distributed network.\n\nImportance of Ethereum and Blockchain for Economy\n\nEthereum and blockchain technology have significant implications for the economy, offering several important benefits and opportunities. Here are some of the key ways in which Ethereum and blockchain impact the economy:\n\n1. Decentralization and disintermediation: Ethereum and blockchain technology enable decentralized systems, removing the need for intermediaries such as banks, financial institutions, or centralized authorities. This disintermediation reduces costs, streamlines processes, and increases efficiency in various economic activities, including financial transactions, supply chain management, and identity verification. By eliminating intermediaries, blockchain technology can potentially democratize access to financial services, promote financial inclusion, and reduce economic inequality.\n\n2. Trust and transparency: Blockchain’s transparent and immutable nature enhances trust and accountability in economic transactions. The decentralized nature of blockchain ensures that all participants have access to the same information, eliminating information asymmetry and reducing the potential for fraud and manipulation. This transparency can enhance the integrity of financial transactions, improve auditing processes, and enable stakeholders to make more informed decisions based on verified and auditable data.\n\n3. Smart contracts and automation: Ethereum’s smart contract functionality allows for the automation of agreements and contractual obligations. Smart contracts are self-executing and self-enforcing, eliminating the need for intermediaries to facilitate and enforce contracts. This automation streamlines business processes, reduces administrative costs, and increases efficiency in sectors such as insurance, real estate, supply chain management, and more. Smart contracts can also reduce the risk of contract disputes, as the terms and conditions are predefined in code and automatically executed based on predetermined conditions.\n\n4. Innovation and new business models: Ethereum and blockchain technology have unleashed a wave of innovation and the creation of new business models. The decentralized nature of blockchain allows for the development of decentralized applications (DApps) and the tokenization of assets. This opens up new opportunities for crowdfunding, peer-to-peer lending, decentralized finance (DeFi), non-fungible tokens (NFTs), and more. These innovations have the potential to reshape traditional industries, unlock liquidity, and provide alternative investment avenues for individuals and businesses.\n\n5. Financial inclusion and access: Ethereum and blockchain can enhance financial inclusion by providing access to financial services to the unbanked and underbanked populations. Through the use of blockchain-based digital identities, individuals without traditional identification documents can establish verifiable digital identities, enabling them to access banking services, loans, and participate in the formal economy. Additionally, blockchain-based remittance services can offer faster, cheaper, and more secure cross-border transactions, benefiting migrant workers and their families.\n\n6. Tokenization and asset ownership: Blockchain allows for the tokenization of physical and digital assets, representing ownership or value in a digital form. This enables fractional ownership, liquidity, and tradability of assets that were previously illiquid or restricted to a limited group of investors. Tokenization opens up opportunities for real estate investments, art, intellectual property rights, and other assets, creating more accessible and inclusive investment markets.\n\n7. Economic empowerment and decentralized governance: Blockchain-based platforms can empower individuals by providing them with control over their data, digital assets, and financial transactions. Through decentralized governance mechanisms, participants can have a say in the decision-making processes of blockchain networks and protocols, fostering a more democratic and inclusive economy. This empowerment can lead to increased economic opportunities, innovation, and collaboration.\n\nIt is important to note that while Ethereum and blockchain offer numerous benefits, there are also challenges to overcome, including scalability, regulatory frameworks, energy consumption, and interoperability. However, the potential of Ethereum and blockchain technology to transform the economy and drive innovation is significant, and their continued development and adoption are expected to reshape various sectors and create new opportunities in the global economy.\n\nAlso read: How Does Ethereum In Casino Work?\n\nTop 10 Ethereum Blockchain Innovations Driving Adoption and Growth\n\nSure, here is an article about the top 10 Ethereum blockchain innovations driving adoption and growth: Top 10 Ethereum Blockchain Innovations Driving Adoption and Growth Ethereum is a blockchain platform that allows for the creation of decentralized applications (Dapps). Dapps are applications that run on a peer-to-peer network and are not controlled by any central authority. This makes them ideal for applications that require trustless and secure transactions, such as financial services and supply chain management. In recent years, Ethereum has seen a surge in adoption and growth. This is due in part to the many innovations that have been developed on the platform. Here are the top 10 Ethereum blockchain innovations driving adoption and growth: Smart contracts: Smart contracts are self-executing contracts that are stored on the blockchain. They can be used to automate a wide range of transactions, such as payments, loans, and insurance. Smart contracts are one of the most important innovations on Ethereum, as they allow for trustless and secure transactions without the need for a third party. Decentralized finance (DeFi): DeFi is a financial system that is built on top of blockchain technology. It allows for people to access financial services without the need for a traditional financial institution. DeFi is one of the fastest-growing sectors in the blockchain industry, and it is being used for a wide range of applications, such as lending, borrowing, and trading. Non-fungible tokens (NFTs): NFTs are digital assets that are unique and cannot be replaced. They are often used to represent ownership of digital artworks, collectibles, and in-game items. NFTs have exploded in popularity in recent years, and they are now being used in a wide range of industries, including gaming, art, and finance. Consensus mechanisms: Consensus mechanisms are algorithms that are used to reach agreement on the state of the blockchain. The most common consensus mechanism on Ethereum is proof-of-work (PoW), but there are a number of other consensus mechanisms being developed, such as proof-of-stake (PoS) and delegated proof-of-stake (DPoS). The consensus mechanism that is used can have a significant impact on the performance and security of the blockchain. Sharding: Sharding is a technique that can be used to improve the scalability of blockchains. By dividing the blockchain into smaller pieces, called shards, it is possible to process more transactions per second. Sharding is still in development, but it has the potential to make Ethereum much more scalable. Privacy features: Ethereum is not a privacy-focused blockchain, but there are a number of projects that are working on developing privacy features for the platform. These features could be used to protect user data and to make Ethereum more suitable for applications that require a high degree of privacy. Scalability solutions: Ethereum is facing scalability challenges, as the network can only process a limited number of transactions per second. A number of scalability solutions are being developed, such as sharding, state channels, and plasma. These solutions could help to make Ethereum more scalable and able to handle the increasing demand for transactions. Enterprise adoption: Ethereum is increasingly being adopted by businesses and organizations. A number of large companies are now using Ethereum for a variety of applications, such as supply chain management, financial services, and insurance. Enterprise adoption is one of the key drivers of growth for Ethereum, and it is expected to continue to grow in the years to come. Developer community: Ethereum has a large and active developer community. This community is responsible for developing new applications and features for the platform. The developer community is one of the main strengths of Ethereum, and it is essential for the continued growth and development of the platform. Marketing and awareness: Ethereum is still a relatively young platform, and it is not as well-known as some other blockchain platforms. However, there is a growing awareness of Ethereum, and this is being driven by a number of factors, such as the increasing adoption of DeFi and NFTs. Marketing and awareness are essential for the continued growth of Ethereum, and it is expected that the platform will become more widely known in the years to come.\n\nRisks associated with Ethereum and Blockchain\n\nWhile Ethereum and blockchain technology offer numerous benefits and opportunities, there are several risks and challenges that should be considered. Here are some of the key risks associated with Ethereum and blockchain:\n\n1. Security vulnerabilities: While blockchain is touted for its security, no system is entirely immune to vulnerabilities. Smart contracts deployed on Ethereum are not immune to bugs or coding errors, and if exploited, these vulnerabilities can lead to financial losses or other detrimental effects. The infamous DAO hack in 2016, which exploited a vulnerability in a smart contract, resulted in the theft of millions of dollars’ worth of Ether. Ongoing audits, code reviews, and security best practices are necessary to minimize such risks.\n\n2. Regulatory uncertainty: The regulatory landscape surrounding blockchain and cryptocurrencies is still evolving and varies across different jurisdictions. Regulatory actions, such as restrictive legislation, taxation policies, or bans, can significantly impact the usability and adoption of Ethereum and blockchain technology. Uncertainty around regulatory compliance and potential legal repercussions can deter businesses and individuals from fully embracing blockchain solutions.\n\n3. Scalability limitations: Scalability remains a challenge for Ethereum and other blockchain networks. As the number of participants and transactions increases, the network can face congestion and slower transaction processing times. This limitation hampers the scalability of decentralized applications and can hinder the widespread adoption of Ethereum in high-demand use cases, such as global payment systems or internet-scale applications. Efforts like Ethereum 2.0 aim to address scalability through the introduction of sharding and a transition to Proof-of-Stake consensus.\n\n4. Interoperability challenges: Interoperability refers to the ability of different blockchains and systems to communicate and exchange data seamlessly. The lack of standardization and interoperability protocols can create siloed blockchain networks, limiting the potential benefits of a decentralized ecosystem. Interoperability challenges can hinder the efficient transfer of assets, data, and value between different blockchains and ecosystems, reducing the overall utility and adoption of Ethereum and blockchain technology.\n\n5. Energy consumption: The energy consumption associated with blockchain, particularly the Proof-of-Work consensus mechanism used by Ethereum, has raised concerns about its environmental impact. The computational power required for mining and validating transactions can be energy-intensive, contributing to carbon emissions and environmental degradation. Efforts to transition Ethereum to a more energy-efficient consensus mechanism, such as Proof-of-Stake, are underway to address these concerns.\n\n6. User error and irreversibility: Blockchain transactions, once confirmed and added to the blockchain, are nearly immutable and irreversible. While this feature enhances security and prevents fraudulent activities, it can also be a risk if users make mistakes or encounter fraudulent transactions. Accidental loss of private keys, sending funds to the wrong address, or falling victim to phishing attacks can result in permanent loss of assets. Users must exercise caution and follow best practices to safeguard their private keys and ensure the accuracy of transactions.\n\n7. Lack of privacy: While blockchain transactions are transparent, they are also pseudonymous, meaning that transactions are associated with cryptographic addresses rather than real-world identities. However, sophisticated analysis techniques can potentially deanonymize participants and trace transactions, compromising privacy. Privacy-enhancing technologies, such as zero-knowledge proofs and secure multiparty computation, are being developed to address these concerns. However, ensuring privacy without compromising transparency remains a challenge.\n\n8. Technological obsolescence: Blockchain technology is rapidly evolving, and new advancements could make existing implementations, including Ethereum, obsolete or less competitive. Technological advancements, protocol upgrades, or the emergence of new blockchain platforms may impact the adoption and value proposition of Ethereum. Staying abreast of technological developments and ensuring adaptability to changing landscapes is crucial to mitigate the risk of technological obsolescence.\n\nAs with any emerging technology, it is important to assess and manage these risks. Robust security measures, regulatory compliance, ongoing research and development efforts, and user education are crucial for minimizing risks and maximizing the potential benefits of Ethereum and blockchain technology.\n\nAlso read: Your Ultimate Guide To Ethereum RPC Nodes\n\nFuture of Ethereum and Blockchain\n\nThe future of Ethereum and blockchain technology holds immense potential for transformative impact across various industries and sectors. Here are some key areas that highlight the potential future developments:\n\n1. Ethereum 2.0: Ethereum is undergoing a significant upgrade known as Ethereum 2.0 or Eth2. This upgrade aims to address scalability, energy efficiency, and security concerns associated with the current Proof-of-Work consensus mechanism. Ethereum 2.0 introduces Proof-of-Stake (PoS) consensus, shard chains for scalability, and a new virtual machine. This upgrade is expected to enhance the scalability and efficiency of the Ethereum network, opening doors to a broader range of use cases and facilitating increased adoption.\n\n2. Decentralized Finance (DeFi): DeFi has emerged as a prominent sector within the Ethereum ecosystem. DeFi applications aim to recreate traditional financial systems in a decentralized and trustless manner using smart contracts. With DeFi, individuals can access lending, borrowing, trading, and other financial services without relying on intermediaries. The future of Ethereum and blockchain is likely to see further growth and innovation in the DeFi space, potentially transforming traditional financial systems and increasing financial inclusion.\n\n3. Non-Fungible Tokens (NFTs): NFTs have gained significant attention and adoption, enabling unique digital ownership and representation of assets. NFTs are tokens that represent ownership or proof of authenticity of digital or physical items such as art, music, collectibles, and virtual real estate. Ethereum has been a key platform for NFT development, and the future of Ethereum is expected to witness continued growth in NFTs, with advancements in areas like NFT marketplaces, intellectual property rights, and gamification.\n\n4. Interoperability and Cross-Chain Solutions: Interoperability is a crucial aspect for the future of blockchain technology. As the number of blockchains increases, the ability to communicate and exchange value seamlessly between different blockchain networks becomes vital. Solutions like cross-chain bridges, interoperability protocols, and standardized frameworks are being developed to enable interoperability and create a connected blockchain ecosystem. The future of Ethereum and blockchain will likely see advancements in interoperability, facilitating efficient asset transfers and collaborations between different blockchains.\n\n5. Central Bank Digital Currencies (CBDCs): Several central banks worldwide are exploring the concept of issuing their digital currencies using blockchain technology. These Central Bank Digital Currencies (CBDCs) aim to provide a digital form of fiat currency while leveraging the benefits of blockchain, such as transparency, security, and programmability. Ethereum has been considered as a potential platform for CBDC development, and the future may witness the integration of Ethereum or Ethereum-based solutions into national digital currency initiatives.\n\n6. Enterprise Adoption: Blockchain technology has been gaining attention from enterprises across industries such as supply chain management, healthcare, energy, and more. As the technology matures and scalability improves, Ethereum and blockchain are likely to witness increased enterprise adoption. Enterprises can leverage blockchain for enhanced transparency, traceability, and efficiency in their operations, leading to cost savings and improved trust among stakeholders.\n\n7. Sustainability and Green Initiatives: As the environmental impact of blockchain technology becomes more apparent, efforts are being made to address sustainability concerns. The future of Ethereum and blockchain will likely focus on enhancing energy efficiency, exploring alternative consensus mechanisms, and integrating sustainable practices. Transitioning to Proof-of-Stake consensus in Ethereum 2.0 is one such step towards reducing energy consumption. Additionally, research and development efforts are ongoing to optimize energy usage and improve the environmental sustainability of blockchain networks.\n\n8. Regulation and Standards: With the increasing adoption of blockchain technology, governments and regulatory bodies are actively working on frameworks and regulations to govern its usage. The future of Ethereum and blockchain will likely witness the development of clearer regulations and standards to ensure consumer protection, prevent fraud, and foster responsible innovation. Regulatory clarity is crucial to encourage mainstream adoption and mitigate risks associated with blockchain technology.\n\nIt’s important to note that the future of Ethereum and blockchain technology is dynamic and subject to rapid innovation and development. New technological advancements, unforeseen challenges, and market forces will shape the trajectory of Ethereum and blockchain in the coming years. However, the potential for transformative impact across various sectors and industries remains significant, making Ethereum and blockchain technology an integral part of the digital future."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmNjbi5jb20vZWR1Y2F0aW9uL2VyYy03MjY1LWFuLWV0aGVyZXVtLXN0YW5kYXJkLWZvci1kZWZpLXNlY3VyaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "ERC 7265: An Ethereum Standard For DeFi Security - CCN.com",
        "content": "Key Takeaways\n\nERC 7265 proposes a circuit breaker mechanism to enhance security and mitigate risks in DeFi protocols.\n\nThe circuit breaker temporarily pauses token outflows when predefined thresholds are exceeded, reducing potential losses and improving protocol stability.\n\nDevelopers benefit from flexibility in tailoring the mechanism to their protocol’s requirements.\n\nUser protection is strengthened, which can boost confidence and adoption of DeFi platforms.\n\nThe loss of billions of dollars in user assets as a result of the alarmingly frequent attacks on decentralized finance (DeFi) protocols prompted a group of Ethereum community members to create a new standard targeted at increasing security precautions.\n\nUsers have suffered considerable financial losses as a result of the ongoing wave of vulnerabilities aimed at DeFi technologies. According to recent data from DeFiLlama, almost $6.73 billion has been lost through various flaws, with a startling $5.44 billion finding its way into the hands of DeFi protocol hackers.\n\nWhat Is The ERC 7265 Standard?\n\nERC 7265 is a proposed standard within the Ethereum community that advocates for the inclusion of a “circuit breaker” mechanism in DeFi protocols. The Circuit Breaker feature is designed to temporarily pause token outflows across an entire protocol when a predefined threshold for a specific metric is surpassed. This mechanism is independent of the underlying protocol structure and primarily acts as a conduit for token outflows.\n\nTo ensure accurate internal accounting for integrated protocols and to offer developers greater flexibility, the circuit breaker contract allows for two options: delaying settlement and temporarily holding custody of outflows during the cooldown period, or reverting attempted outflows. This approach enables developers to tailor the circuit breaker functionality based on their specific requirements while maintaining control and maximizing protocol stability.\n\nBy implementing this fail-safe measure, potential losses can be minimized and the security of DeFi protocols can be significantly enhanced.\n\nWhat Is the Potential Impact Of ERC 7265 On Risk Mitigation?\n\nThe ERC 7265 standard could impact DeFi risks in following ways:\n\nAdded Security\n\nThe security of DeFi protocols can be greatly increased by including a circuit breaker mechanism. The circuit breaker can protect potential losses during unusual market situations or when specific metrics signal potential hazards by momentarily pausing token outflows when predetermined thresholds are exceeded. Users’ funds and general protocol stability may both be protected by this feature.\n\nRisk Reduction\n\nBy giving developers the option to postpone settlement or undo attempted outflows, the circuit breaker mechanism adds another layer of risk reduction. This adaptability enables protocols to quickly address unforeseen risks or problems. Potential losses can be reduced and the overall risk profile of DeFi protocols enhanced by putting in place such fail-safe procedures.\n\nProtocol Stability\n\nWhen market conditions are erratic or anomalies are found, the circuit breaker mechanism can help keep the protocol stable. Protocols can evaluate and address potential problems by temporarily stopping token outflows, which lowers the likelihood of catastrophic failures. People may feel more secure as a result of this consistency, which may also draw more people to DeFi platforms.\n\nFlexibility For Developers\n\nThe circuit breaker contract’s two options provide developers with flexibility to tailor the mechanism based on their specific requirements. This customization can be crucial for protocols with different use cases, risk profiles, or tokenomic designs. Developers can choose the option that aligns best with their protocol’s needs, allowing them to maximize stability and control.\n\nUser Protection\n\nBy reducing potential losses, the circuit breaker mechanism can serve as a safety feature for users. The circuit breaker can assist in preventing more funds from being at risk in the event of a severe circumstance, such as a smart contract vulnerability or an unexpected market meltdown. The adoption of DeFi platforms and a rise in user confidence can both be attributed to this protection.\n\nWill The Implementation Of The ERC 7265 Standard Drive Widespread Adoption Of DeFi?\n\nPotential losses and risks related to protocol weaknesses or unexpected market changes can be reduced by including a fail-safe solution, such as the circuit breaker. Users and investors may feel more secure using this approach because it strengthens the protocol’s security.\n\nAdding a consistent circuit breaker mechanism to diverse DeFi protocols can also increase interoperability and make it simpler for users to move between and engage with different platforms. By lowering complexity and boosting user confidence, standardization encourages uniformity, compatibility, and ease of integration, which can support larger DeFi adoption.\n\nNonetheless, it is important to remember that the success of the ERC-7265 standard—or any standard, for that matter—will depend on a variety of elements, including community support, technical viability, and successful implementation. Additionally, the evolution of DeFi is a dynamic and rapidly changing landscape, with new proposals and standards continuously emerging.\n\nConclusion\n\nRisk reduction and security could both be considerably improved by the proposed ERC-7265 standard inside the DeFi ecosystem. The circuit breaker can reduce possible losses and increase protocol stability by momentarily pausing token outflows when predefined thresholds are exceeded.\n\nDevelopers can customize it depending on individual protocol requirements due to its flexibility, and user safety is improved thanks to lower risks and greater confidence. By enhancing interoperability and streamlining user interaction with various platforms, the standardization of such techniques can help promote broad adoption.\n\nFAQs:\n\nIs ERC 7265 a recognized standard in the Ethereum community?\n\nERC 7265 standard has recently gained recognition and adoption within the Ethereum community.\n\nHow does the circuit breaker mechanism work in ERC 7265?\n\nThe circuit breaker mechanism in ERC 7265 temporarily pauses token outflows across a DeFi protocol when a predefined threshold for a specific metric is surpassed. This helps mitigate risks and potential losses during abnormal market conditions.\n\nCan the circuit breaker be customized by developers?\n\nYes, the circuit breaker contract in ERC 7265 allows developers to choose between delaying settlement and temporarily holding custody of outflows during a cooldown period or reverting attempted outflows. This flexibility enables developers to tailor the mechanism to their specific protocol requirements.\n\nCan the implementation of ERC 7265 propel the adoption of DeFi on a large scale?\n\nWhile the inclusion of fail-safe mechanisms like the circuit breaker can enhance security and reduce risks, widespread adoption of DeFi depends on various factors such as community support, technical viability, and successful implementation. Standardization efforts, including the introduction of ERC 7265, can contribute to larger adoption by increasing interoperability and user confidence."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTEvbWV0YW1hc2stZGV2ZWxvcGVyLWNvbnNlbnN5cy1icmluZ3MtbGF5ZXItMi1ibG9ja2NoYWluLWxpbmVhLXRvLWV0aGVyZXVtLW1haW5uZXQv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNy8xMS9tZXRhbWFzay1kZXZlbG9wZXItY29uc2Vuc3lzLWJyaW5ncy1sYXllci0yLWJsb2NrY2hhaW4tbGluZWEtdG8tZXRoZXJldW0tbWFpbm5ldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "MetaMask Developer ConsenSys Brings Layer 2 Blockchain ‘Linea’ to Ethereum Mainnet - CoinDesk",
        "content": "For now, ConsenSys will still be the only party allowed to submit zero-knowledge proofs to Linea’s smart contracts on Ethereum. In layman’s terms, this means the firm will act as a sort of transaction traffic cop for the time being – directing transactions and packaging them up into the bundles that it sends to Ethereum."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hcmNhZGlhLWZpbmFuY2UtaGFja2VkLW9uLWV0aGVyZXVtLWFuZC1vcHRpbWlzbS1mb3ItNDU1a9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "DeFi protocol Arcadia Finance hacked on Ethereum and Optimism for $455K - Cointelegraph",
        "content": "A hacker drained approximately $455,000 from noncustodial decentralized finance (DeFi) protocol Arcadia Finance by exploiting a code vulnerability.\n\nBlockchain investigator PeckShield alerted about the hack on Arcadia Finance, highlighting the cause as “the lack of untrusted input validation.” The code supposedly lacked a validation mechanism to cross-check unverified inputs. This loophole allowed the hacker to drain funds worth roughly $455,000 from Ethereum (darcWETH) and Optimism (darcUSDC) vaults.\n\nArcadia Finance code required no validation of untrusted input. Source: PeckShield\n\nArcadia Finance has not yet responded to Cointelegraph’s request for comment about the hack. However, the team told Cointelegraph that the root cause pointed out by PeckShield is wrong.\n\nArcadia Finance confirmed the hack two hours after PeckShield’s intimation and subsequently paused the contracts to prevent further bleeding of funds.\n\nWe are aware of a potential exploit in our protocol.\n\nWe have paused the contracts and are investigating the root-cause with security experts as we speak. More info will follow as it comes available. — Arcadia Finance (@ArcadiaFi) July 10, 2023\n\nWhile the investigations are underway, Arcadia’s code houses another vulnerability, which could prove catastrophic for the protocol if exploited. According to PeckShield:\n\n“In addition, there is a lack of reentrancy protection, which allows for the instant liquidation to bypass the internal vault health check.”\n\nMost of the stolen funds were from Optimism — approximately 180 Ether (ETH) — and have been washed via Tornado Cash. However, the stolen tokens on Ethereum — worth over $103,000 at the time of writing — remain parked at the suspected wallet address.\n\nRelated: Multichain MPC bridge sees $100M+ outflows, sparking fears of exploit\n\nIn the second quarter of 2023, hacks and exploits in the crypto space resulted in a cumulative loss of over $300 million.\n\nA report by blockchain security company CertiK showed that a total of 212 security incidents were recorded in the quarter, resulting in a loss of $313,566,528 from Web3 protocols.\n\nCompared with the previous year’s Q2 data, CertiK found that the crypto hacks declined by 58%. Out of the lot, the BNB Smart Chain recorded the most incidents, with 119 incidents leading to $70,711,385 in losses.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8xMC9tYWNyby1ndXJ1LXJhb3VsLXBhbC1vdXRsaW5lcy1kcmVhbS1zY2VuYXJpby1mb3Itc29sYW5hLXVudmVpbHMtbWFzc2l2ZS1wcmljZS10YXJnZXQtZm9yLWV0aGVyZXVtLXJpdmFsL9IBjQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8xMC9tYWNyby1ndXJ1LXJhb3VsLXBhbC1vdXRsaW5lcy1kcmVhbS1zY2VuYXJpby1mb3Itc29sYW5hLXVudmVpbHMtbWFzc2l2ZS1wcmljZS10YXJnZXQtZm9yLWV0aGVyZXVtLXJpdmFsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Macro Guru Raoul Pal Outlines Dream Scenario for Solana, Unveils Massive Price Target for Ethereum Rival - The Daily Hodl",
        "content": "Real Vision CEO Raoul Pal is outlining the best-case scenario for Ethereum (ETH) rival Solana (SOL), saying that the smart contract platform could see a massive price increase.\n\nIn a new interview with the host of InvestAnswers, the macro guru says that Solana could follow in the footsteps of the leading altcoin when it skyrocketed after hitting a low in 2018.\n\nAt the time, Ethereum saw about a 47x increase. However, Pal says that he anticipates Solana seeing at least a 20x increase from current prices.\n\n“There’s a potential, a possibility [of] a dream scenario that Solana does what ETH did from the 2018 low, which was a 47x. And so [the] Solana low was $9, so you could do the math, the numbers are potentially very interesting – that it’ll be 20-something X from here for Solana.”\n\nSolana is trading for $21.84 at time of writing, a 1.48% increase during the last 24 hours. If Pal’s prediction comes to light, SOL could be worth about $436.\n\nPal goes on to say that he believes Bitcoin (BTC) could double or triple up from its all-time high, adding that such a rise would be modest and the worst bull run in the crypto king’s history.\n\n“It’s very difficult to predict where it actually goes, but what we can say is it’s reasonable that Bitcoin, from all-time highs, doubles or triples. That’s not asking a lot. That will be the worst bull market in Bitcoin’s history…\n\nIt probably triples from the all-time high and currently it’s at $30,000 so that’s a 6x from here. That’s pretty good. And the upside is maybe I’m totally wrong and it gets complete panic to the upside…\n\nWe don’t know what’s going to be happening in the economy in 2025, what could be driving prices, so I think you [can] get the upside for free.”\n\nBitcoin is trading for $30,321 at time of writing, a fractional increase during the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Kiran 360 Degree"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vdHJvbi1jby1mb3VuZGVyLXVuc3Rha2VzLTU2LW1pbGxpb24tZnJvbS1ldGhlcmV1bS12aWEtbGlkby13aWxsLWV0aC1wcmljZXMtZmFsbC_SAXpodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL3Ryb24tY28tZm91bmRlci11bnN0YWtlcy01Ni1taWxsaW9uLWZyb20tZXRoZXJldW0tdmlhLWxpZG8td2lsbC1ldGgtcHJpY2VzLWZhbGwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Tron Co-Founder Unstakes $56 Million From Ethereum Via Lido, Will ETH Prices Fall? - NewsBTC",
        "content": "Justin Sun, the co-founder of Tron, withdrew 30,000 ETH, worth roughly $56 million, via two addresses via Lido, a liquidity staking service provider, on July 10, Lookonchain reveals. Following his move, his Ethereum stake via Lido is down to 263,294 ETH, or $491.6 million at spot rates.\n\nJustin Sun Unstakes From Ethereum\n\nLookonchain, a blockchain analytics platform, notes that between February 25 and 27, Sun staked 288,100 ETH, or $538 million, and earned 5,194 ETH, or $9 million. This translates to average daily earnings of 38 ETH, or $72,000, going by the annualized percentage yield (APY) of around 4.87% offered by Lido on Ethereum stakers.\n\nThe reasons behind Sun’s withdrawal of 30,000 ETH from Lido are unclear. It could indicate his intention to sell some of the ETH, transfer to a different staking platform, or even run his private Ethereum validator node.\n\nDespite this transfer, Sun remains one of the largest stakers at Lido, accounting for over 9% of the total ETH staked. While Sun’s decision to unstaked and transfer coins may be a cause of concern, ETH prices are firm when writing on July 10 and edging closer to $1,900.\n\nContrary to fears ahead of the Shanghai upgrade in mid-April, the number of users staking ETH remains upward. Trackers show that over 21 million ETH has been locked by over 657,000 validators as of July 10.\n\nWith the Shanghai upgrade implemented, ETH holders who had staked at least 32 ETH in the Beacon Chain from December 2020 can withdraw their assets. Despite earlier fears that more coins will be withdrawn and sold in the spot markets, impacting ETH prices, more validators and more coins have been locked on the Beacon Chain and other staking solutions.\n\nWill The SEC Dampen Coin Staking?\n\nLido, the leading staking provider for ETH, is the largest decentralized finance (DeFi) protocol by total value locked (TVL), according to DeFiLlama. As of July 10, Lido managed over $14.6 billion of assets, most of which are ETH.\n\nOver $14.5 billion of ETH have been delegated and locked through Lido infrastructure. In Lido, users can stake ETH and other supported coins without needing lock-up periods or meeting high requirements, making it an attractive option for some investors.\n\nIn lawsuits filed against crypto exchanges Binance and Coinbase in early June, the United States Securities and Exchange Commission (SEC) alleged that some proof-of-stake coins, including Cardano’s ADA and Algorand’s ALGO, were unregistered securities.\n\nFollowing this assessment, their prices tanked, even impacting ETH. This is partly because Ethereum is now a proof-of-stake network after transiting from a proof-of-work algorithm and uses the same consensus system as those employed by competing smart contract platforms accused of issuing unregistered securities. The situation is worsened by Gary Gensler’s failure to clarify whether ETH is a utility like Bitcoin.\n\nCover image from Canvas, chart from Tradingview\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTEvZXRoZXItc3Rha2luZy1yYXRpby1uZWFycy1rZXktbWlsZXN0b25lLWFzLWluZmxvd3Mtc2xvdy1hbWlkLXJlZ3VsYXRvcnktcHJlc3N1cmVzL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzExL2V0aGVyLXN0YWtpbmctcmF0aW8tbmVhcnMta2V5LW1pbGVzdG9uZS1hcy1pbmZsb3dzLXNsb3ctYW1pZC1yZWd1bGF0b3J5LXByZXNzdXJlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Ether Staking Ratio Nears Key Milestone as Inflows Slow Amid Regulatory Pressures - CoinDesk",
        "content": "Following the lawsuits, net flows into ETH staking plummeted for a period and turned negative on some days for the first time since early May, a Dune Analytics dashboard by 21Shares shows. Since then, flows returned to positive but at a lower level than in May."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vYmxvY2tjaGFpbm1hZ2F6aW5lLm5ldC90b3AtMTAtZXRoZXJldW0tc2NhbGluZy1zb2x1dGlvbnMtaW1wcm92aW5nLWJsb2NrY2hhaW4tcGVyZm9ybWFuY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Top 10 Ethereum Scaling Solutions Improving Blockchain Performance - Blockchain Magazine",
        "content": "Ethereum scaling solutions refer to the various techniques and technologies implemented to overcome the scalability limitations of the Ethereum blockchain. Ethereum is one of the most popular and widely used blockchain decplatforms, known for its ability to Dentralized applications (DApps). However, as Ethereum gained popularity, it became evidexecute smart contracts and build ent that the\n\nEthereum scaling solutions refer to the various techniques and technologies implemented to overcome the scalability limitations of the Ethereum blockchain. Ethereum is one of the most popular and widely used blockchain decplatforms, known for its ability to Dentralized applications (DApps). However, as Ethereum gained popularity, it became evidexecute smart contracts and build ent that the network’s capacity was struggling to keep up with the increasing demand, leading to issues such as high fees, network congestion, and slower transaction speeds.\n\nTo address these challenges, developers and researchers have been working on scaling solutions that aim to improve Ethereum’s scalability, throughput, and efficiency. These scaling solutions can be categorized into two main types: layer-one (on-chain) solutions and layer-two (off-chain) solutions.\n\n1. Layer-One Scaling Solutions:\n\nLayer-one scaling solutions involve making changes to the underlying Ethereum protocol itself, primarily focusing on improving the blockchain’s base layer. These solutions aim to enhance the Ethereum network’s scalability and capacity, allowing it to process a higher number of transactions per second (TPS) and reducing fees. Some notable layer-one scaling solutions include:\n\na. Ethereum 2.0 (Eth2): Ethereum 2.0 is a major upgrade of the Ethereum network that is being implemented in phases. It introduces a new consensus mechanism called Proof of Stake (PoS) to replace the existing Proof of Work (PoW). Eth2 also introduces shard chains, which will enable parallel processing of transactions, significantly increasing the network’s scalability and capacity.\n\nb. Beacon Chain: The Beacon Chain is the core component of Ethereum 2.0 and serves as the coordination and consensus layer for the entire network. It manages validators, handles consensus, and coordinates crosslinks between shard chains, enabling parallel processing and improving overall scalability.\n\nc. Shard Chains: Ethereum 2.0 introduces shard chains, which are additional chains that run in parallel to the Ethereum main chain. These shard chains allow for increased transaction throughput and improved scalability by dividing the network’s workload across multiple chains.\n\n2. Layer-Two Scaling Solutions:\n\nLayer-two scaling solutions build on top of the existing Ethereum network and aim to scale Ethereum by processing transactions off-chain or using sidechains, while still maintaining the security and trust of the main Ethereum blockchain. These solutions provide faster and cheaper transactions without directly impacting the base layer. Some prominent layer-two scaling solutions include:\n\na. State Channels: State channels enable off-chain transactions between participants, where only the final state of the transaction is recorded on the Ethereum blockchain. By conducting most of the transactions off-chain, state channels reduce congestion and improve scalability.\n\nb. Plasma: Plasma is a framework that allows for the creation of sidechains connected to the Ethereum main chain. Sidechains can handle a high volume of transactions and periodically commit their state to the main chain, providing scalability while retaining the security of the Ethereum network.\n\nc. Rollups: Rollups are layer-two solutions that bundle multiple transactions into a single transaction that is submitted to the Ethereum main chain. There are two types of rollups: optimistic rollups and zk-rollups. Optimistic rollups assume that transactions are valid by default but allow challenges if any invalid transactions are detected. Zk-rollups use zero-knowledge proofs to validate the correctness of the bundled transactions, providing scalability while maintaining high security.\n\nThese layer-one and layer-two scaling solutions are not mutually exclusive, and they can be combined to achieve even greater scalability and efficiency. Ethereum developers and the community are actively researching and implementing these scaling solutions to address the network’s limitations and unlock the full potential of decentralized applications, enabling a more scalable and sustainable Ethereum ecosystem.\n\nEthereum Co-Founder Vitalik Buterin, on a #Twitter Spaces said: “I think if we want #Bitcoin to be more than payments, it needs more scaling solutions, pointing to several experiments that #Ethereum has been trying out over the past years”.#Crypto #BTC #ETF #BitcoinETF… pic.twitter.com/nlvLsE1yDp — Fahad Faqeeh (@FahadFaqeeh65) July 10, 2023\n\nAlso read: 10 Best Books To Learn About Ethereum To Understand Open- Source Blockchain\n\nRelation between Ethereum Scaling Solutions and Blockchain\n\nEthereum scaling solutions and blockchain are intricately connected. Ethereum, being a blockchain platform, relies on scaling solutions to address the scalability limitations inherent in blockchain technology. Let’s explore the relationship between Ethereum scaling solutions and blockchain in more detail:\n\n1. Scalability Challenges in Blockchain:\n\nBlockchain technology, including Ethereum, faces inherent scalability challenges. The traditional blockchain design, often referred to as the “layer one,” has limitations in terms of transaction throughput, confirmation times, and scalability. This is primarily due to the consensus mechanisms, such as Proof of Work (PoW), which require significant computational resources and result in slower transaction processing times. Additionally, as more users and applications join the network, the blockchain becomes congested, leading to higher fees and delays in transaction confirmation.\n\n2. Need for Ethereum Scaling Solutions:\n\nThe need for Ethereum scaling solutions arises from the scalability challenges mentioned above. As the Ethereum network gained popularity and usage increased, it became clear that the base layer of Ethereum needed to be improved to handle the growing demand. Scalability solutions aim to alleviate these challenges and enhance the performance of the Ethereum blockchain, allowing it to process a higher number of transactions per second, reduce fees, and improve overall user experience.\n\n3. Layer-One Scaling Solutions:\n\nLayer-one scaling solutions focus on improving the base layer of the Ethereum blockchain itself. These solutions involve making fundamental changes to the underlying protocol, consensus mechanisms, or infrastructure. For example, Ethereum 2.0 is a major layer-one scaling solution that introduces a new consensus mechanism (Proof of Stake) and shard chains to enhance scalability. By improving the base layer, Ethereum scaling solutions aim to increase transaction throughput and reduce confirmation times.\n\n4. Layer-Two Scaling Solutions:\n\nLayer-two scaling solutions build on top of the existing Ethereum blockchain and provide additional scalability by processing transactions off-chain or on secondary chains. These solutions aim to alleviate congestion on the main Ethereum network by enabling high-volume and fast transactions without compromising security. Layer-two solutions, such as state channels, plasma, and rollups, allow for faster and cheaper transactions while leveraging the security and trust of the underlying blockchain.\n\n5. Interplay between Scaling Solutions and Blockchain:\n\nEthereum scaling solutions are designed to work in conjunction with the underlying blockchain technology. They leverage the security, immutability, and decentralization provided by the blockchain while introducing improvements to scalability and performance. These solutions maintain the integrity and trustlessness of the blockchain while expanding its capabilities to handle a larger volume of transactions and accommodate more users and applications.\n\nUltimately, Ethereum scaling solutions and blockchain are interdependent. Scaling solutions leverage blockchain technology to enhance scalability, while the blockchain provides the foundation of security, decentralization, and immutability for these solutions to function effectively. The development and implementation of scaling solutions are crucial for the growth and adoption of blockchain platforms like Ethereum, as they enable the ecosystem to accommodate a broader range of use cases and handle increased transaction demand.\n\nAlso read: Get Ethereum in long term investment- As it gets Scaling Testnet Upgrade\n\nImportance of Ethereum Scaling Solutions\n\nEthereum scaling solutions are of paramount importance for the continued growth, adoption, and sustainability of the Ethereum ecosystem. Here are several key reasons why scaling solutions are crucial for Ethereum:\n\n1. Scalability and Transaction Throughput: Ethereum scaling solutions are essential to address the scalability challenges faced by the network. As Ethereum gained popularity, it experienced congestion and increased transaction fees, making it less efficient for everyday use. Scaling solutions aim to increase the network’s transaction throughput, allowing for a higher volume of transactions to be processed within a given time. This is crucial for accommodating the growing user base and supporting decentralized applications (DApps) that require fast and reliable transaction processing.\n\n2. User Experience: Improved scalability directly enhances the user experience on the Ethereum network. By reducing congestion and transaction backlogs, users can enjoy faster confirmation times and lower fees. This is particularly important for applications such as decentralized finance (DeFi), gaming, and decentralized exchanges, where speed and cost-efficiency are vital for user satisfaction and adoption.\n\n3. Lower Transaction Fees: Ethereum scaling solutions can help alleviate high transaction fees, which have been a significant concern during periods of network congestion. Lower fees make it more accessible for users to interact with the Ethereum network and encourage a wider range of use cases. For instance, high transaction fees can be a deterrent for small-scale transactions or microtransactions, making them economically unviable. Scaling solutions that reduce fees make it feasible to use Ethereum for various applications, including micropayments, digital content purchases, and remittances.\n\n4. Scalable Decentralized Applications: Ethereum scaling solutions enable the development of scalable decentralized applications (DApps). DApps built on Ethereum often face scalability challenges due to the limitations of the underlying blockchain. With effective scaling solutions, DApps can handle a larger user base, process more transactions, and offer a seamless user experience. This paves the way for innovation, expansion, and increased adoption of decentralized applications across various industries.\n\n5. Network Sustainability: Ethereum scaling solutions play a vital role in ensuring the long-term sustainability of the network. Without efficient scaling mechanisms, the Ethereum blockchain could become overwhelmed by the increasing demand, resulting in network congestion, higher fees, and slower transaction times. These factors can hinder user adoption, discourage developers from building on Ethereum, and limit the platform’s growth potential. By implementing scaling solutions, Ethereum can maintain its competitive edge and remain a leading blockchain platform.\n\n6. Enhanced Use Cases: Scalability improvements provided by scaling solutions open up new and diverse use cases for Ethereum. With a scalable and efficient network, Ethereum can support a wider range of applications, including high-frequency trading, supply chain management, decentralized social networks, and more. Scaling solutions unlock the potential for innovative projects to thrive and leverage the benefits of blockchain technology, ultimately expanding Ethereum’s utility and impact.\n\n7. Competitiveness: The blockchain ecosystem is highly competitive, with various platforms vying for dominance. Ethereum scaling solutions are crucial for maintaining Ethereum’s position as a leading blockchain platform. By addressing scalability challenges, Ethereum can attract developers, businesses, and users, offering them a scalable and efficient platform to build their applications and conduct transactions. It helps Ethereum to differentiate itself and remain at the forefront of blockchain innovation.\n\nIn summary, Ethereum scaling solutions are of utmost importance as they improve scalability, enhance the user experience, reduce fees, support the growth of decentralized applications, ensure network sustainability, unlock new use cases, and maintain Ethereum’s competitiveness in the blockchain space. These solutions are critical for realizing Ethereum’s full potential as a decentralized and scalable platform for the future.\n\nAlso read: Get Ethereum in long term investment- As it gets Scaling Testnet Upgrade\n\nTop 10 Ethereum Scaling Solutions Improving Blockchain Performance\n\nEthereum is one of the most popular blockchains in the world, but it has a scalability problem. The Ethereum network can only process about 15 transactions per second (TPS), which is not enough to handle the increasing demand for decentralized applications (dApps). To address this scalability issue, a number of Ethereum scaling solutions have been proposed. These solutions aim to increase the throughput of the Ethereum network without sacrificing its security or decentralization. Here are the top 10 Ethereum scaling solutions improving blockchain performance: Polygon (MATIC) is a decentralized Ethereum scaling platform that combines the best of Ethereum and sovereign blockchains into a full-fledged multi-chain system. Polygon offers a variety of scaling solutions, including sidechains, plasma chains, and optimistic rollups. Optimism is a Layer 2 scaling solution that uses optimistic rollups to increase the throughput of the Ethereum network. Optimistic rollups allow transactions to be processed off-chain and then submitted to the Ethereum mainchain for verification. Arbitrum is another Layer 2 scaling solution that uses optimistic rollups. Arbitrum is built by Off-chain Labs, a world-class team of researchers, engineers, and Ethereum enthusiasts. Starkware is a Layer 2 scaling solution that uses zk-rollups to increase the throughput of the Ethereum network. zk-rollups are a type of zero-knowledge proof that allows transactions to be verified without revealing the underlying data. Loopring is a Layer 2 scaling solution that uses zk-rollups to power a decentralized exchange (DEX) on Ethereum. Loopring offers high throughput and low fees, making it a popular choice for traders. Hermez is a Layer 2 scaling solution that uses zk-rollups to power a decentralized exchange (DEX) on Ethereum. Hermez is similar to Loopring, but it offers a more user-friendly interface. ZkSync is a Layer 2 scaling solution that uses zk-rollups to increase the throughput of the Ethereum network. ZkSync is still in development, but it has the potential to offer high throughput and low fees. Fuel is a Layer 2 scaling solution that uses optimistic rollups to increase the throughput of the Ethereum network. Fuel is still in development, but it has the potential to offer high throughput and low fees. Metis Andromeda is a Layer 2 scaling solution that uses optimistic rollups to increase the throughput of the Ethereum network. Metis Andromeda is built by the team behind the Metis project, which aims to create a decentralized ecosystem for building and deploying dApps. Boba Network is a Layer 2 scaling solution that uses optimistic rollups to increase the throughput of the Ethereum network. Boba Network is a fork of Optimism, but it offers some additional features, such as support for cross-chain transfers. These are just a few of the many Ethereum scaling solutions that are currently being developed. As the demand for Ethereum continues to grow, it is likely that we will see even more scaling solutions emerge in the future. Which Ethereum scaling solution is the best? The best Ethereum scaling solution for you will depend on your specific needs and requirements. If you are looking for a solution that offers high throughput and low fees, then a zk-rollup or optimistic rollup solution may be a good choice. If you are looking for a solution that is easy to use, then a DEX that is built on a Layer 2 scaling solution may be a better option. Ultimately, the best way to choose an Ethereum scaling solution is to do your research and compare the different options available. There is no one-size-fits-all solution, so it is important to find the solution that is right for you.\n\nBenefits of Ethereum Scaling Solutions\n\nEthereum scaling solutions offer a range of benefits that are essential for the growth, adoption, and success of the Ethereum ecosystem. Let’s explore these benefits in detail:\n\n1. Improved Scalability: The primary benefit of Ethereum scaling solutions is the significant improvement in scalability. Scalability refers to the ability of a blockchain network to handle an increasing number of transactions efficiently. By implementing scaling solutions, Ethereum can process a higher volume of transactions per second (TPS), overcoming the limitations of the base layer. This increased scalability is crucial for accommodating the growing user base, supporting decentralized applications (DApps), and facilitating mainstream adoption of Ethereum.\n\n2. Increased Transaction Throughput: Scaling solutions enable Ethereum to achieve higher transaction throughput, which is the total number of transactions processed within a given time. With improved throughput, Ethereum can handle a larger number of transactions simultaneously, resulting in faster confirmation times and reduced congestion. This is particularly important for applications such as decentralized finance (DeFi) protocols, where speed and responsiveness are crucial for providing seamless user experiences.\n\n3. Lower Transaction Fees: Ethereum scaling solutions help address the issue of high transaction fees, especially during periods of network congestion. By increasing scalability and transaction throughput, these solutions alleviate the demand-supply imbalance, leading to lower fees for users. Reduced transaction fees make Ethereum more accessible and economically viable for a wider range of use cases, including microtransactions, remittances, and everyday transactions. It enables individuals and businesses to transact on the Ethereum network at a lower cost, fostering greater adoption.\n\n4. Enhanced User Experience: With improved scalability and lower fees, Ethereum scaling solutions significantly enhance the user experience. Users can enjoy faster confirmation times, reducing the waiting period for their transactions to be included in blocks. This improves the responsiveness of applications and reduces the risk of potential bottlenecks or delays in transaction processing. A seamless user experience is crucial for attracting and retaining users, promoting engagement, and driving broader adoption of Ethereum.\n\n5. Increased Efficiency and Network Utilization: Scaling solutions optimize the utilization of Ethereum’s network resources. By increasing scalability and reducing congestion, these solutions enable the network to operate more efficiently. They make better use of the available computing power, storage capacity, and bandwidth, leading to improved resource allocation and overall network efficiency. This ensures that Ethereum can handle a higher volume of transactions without sacrificing performance or incurring excessive costs.\n\n6. Expansion of Use Cases: Ethereum scaling solutions unlock new possibilities and expand the potential use cases for the Ethereum network. With improved scalability and transaction throughput, developers can build and deploy more complex and demanding decentralized applications (DApps). This includes applications in sectors such as finance, supply chain management, gaming, identity verification, and more. Scaling solutions enable these DApps to handle larger user bases, process more transactions, and deliver improved functionality and user experiences.\n\n7. Network Security and Decentralization: While scalability improvements are essential, Ethereum scaling solutions aim to achieve these benefits without compromising network security or decentralization. Many scaling solutions maintain the security guarantees of the underlying Ethereum blockchain by leveraging techniques such as off-chain computations, layer-two protocols, or improved consensus mechanisms. This ensures that the network remains resilient against attacks, maintains data integrity, and upholds the principles of decentralization.\n\n8. Ecosystem Growth and Competitiveness: By addressing scalability limitations, Ethereum scaling solutions foster the growth and competitiveness of the Ethereum ecosystem. These solutions attract developers, businesses, and users by providing a scalable and efficient platform to build applications and conduct transactions. As the ecosystem expands, it leads to a virtuous cycle, with more users attracting more developers, leading to further innovation, adoption, and network effects.\n\nIn conclusion, Ethereum scaling solutions offer a multitude of benefits, including improved scalability, increased transaction throughput, lower fees, enhanced user experience, greater efficiency, expanded use cases, network security, and ecosystem growth. These benefits are instrumental in realizing Ethereum’s vision of a decentralized, scalable, and globally adopted blockchain platform.\n\nFuture of Ethereum Scaling Solutions\n\nThe future of Ethereum scaling solutions holds great promise as developers and researchers continue to innovate and implement new techniques to overcome scalability challenges. Here are some key aspects and developments to consider:\n\n1. Ethereum 2.0 (Eth2) Full Implementation: Ethereum 2.0 is a significant upgrade that introduces a variety of scaling solutions. As the phased rollout continues, with the Beacon Chain already live, the full implementation of Ethereum 2.0 is expected to bring significant improvements to scalability and performance. The introduction of shard chains will allow for parallel processing of transactions, greatly increasing the network’s capacity. Eth2’s shift from Proof of Work to Proof of Stake consensus will enhance energy efficiency and security while facilitating faster block confirmation times.\n\n2. Continued Evolution of Layer-One Solutions: Layer-one scaling solutions for Ethereum will continue to evolve and refine their capabilities. Research and development efforts will focus on improving consensus mechanisms, exploring alternative architectures, and optimizing the underlying protocol to boost scalability. This may involve advancements in areas such as blockchain sharding, cross-chain interoperability, and governance mechanisms.\n\n3. Maturation and Adoption of Layer-Two Solutions: Layer-two scaling solutions will play a crucial role in the future of Ethereum scalability. State channels, plasma, and rollups, both optimistic and zk-rollups, are expected to mature and gain wider adoption. These solutions allow for off-chain transaction processing, bundling transactions, and submitting only the essential data to the Ethereum main chain, thereby significantly increasing transaction throughput and reducing fees. Continued research and development will focus on improving the security, usability, and interoperability of these layer-two solutions.\n\n4. Integration of Hybrid Solutions: The future of Ethereum scaling may witness the integration of hybrid solutions that combine layer-one and layer-two approaches. These hybrid solutions aim to leverage the benefits of both on-chain and off-chain processing, striking a balance between scalability, security, and decentralization. Such integration could involve using layer-one protocols for settlement and security, while offloading transaction processing to layer-two solutions for improved throughput and efficiency.\n\n5. Research into Novel Scaling Approaches: The Ethereum community will continue to explore and research novel scaling approaches beyond the existing solutions. This includes ongoing research into technologies such as sidechains, stateless Ethereum, advanced cryptography, and improved consensus algorithms. These advancements aim to push the boundaries of scalability, security, and privacy further, enabling Ethereum to support a broader range of use cases and accommodate increasing transaction demand.\n\n6. Community-driven Innovation: The future of Ethereum scaling solutions heavily relies on the active participation and collaboration of the Ethereum community. Developers, researchers, and the wider community will continue to contribute their expertise and ideas to address scalability challenges. This collaborative approach fosters experimentation, promotes the discovery of new solutions, and ensures the sustainability and growth of the Ethereum ecosystem.\n\n7. Interoperability and Cross-Chain Solutions: As the blockchain industry evolves, interoperability between different blockchain networks will become increasingly important. Ethereum scaling solutions are likely to explore interoperability protocols, cross-chain bridges, and standardization efforts to facilitate seamless communication and value transfer between Ethereum and other blockchain platforms. This interoperability will support the growth of decentralized applications, facilitate the exchange of assets, and enhance the overall scalability of the blockchain ecosystem.\n\nIn summary, the future of Ethereum scaling solutions is characterized by a combination of layer-one and layer-two advancements, ongoing research into novel approaches, integration of hybrid solutions, community-driven innovation, and a focus on interoperability. These developments will enable Ethereum to overcome scalability limitations, achieve higher transaction throughput, reduce fees, and support a diverse range of decentralized applications, ultimately driving wider adoption and establishing Ethereum as a leading blockchain platform."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8xMS9tYWNyby1ndXJ1LXJhb3VsLXBhbC1wcmVkaWN0cy1uZXctYWxsLXRpbWUtaGlnaHMtZm9yLWV0aGVyZXVtLXRoaXMteWVhci1zYXlzLXdlYWtlbmluZy1kb2xsYXItdG8tYm9vc3QtY3J5cHRvL9IBkwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8xMS9tYWNyby1ndXJ1LXJhb3VsLXBhbC1wcmVkaWN0cy1uZXctYWxsLXRpbWUtaGlnaHMtZm9yLWV0aGVyZXVtLXRoaXMteWVhci1zYXlzLXdlYWtlbmluZy1kb2xsYXItdG8tYm9vc3QtY3J5cHRvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Macro Guru Raoul Pal Predicts New All-Time Highs for Ethereum This Year, Says Weakening Dollar To Boost Crypto - The Daily Hodl",
        "content": "Real Vision CEO Raoul Pal is predicting that the smart contract platform Ethereum (ETH) will hit new all-time highs before the year’s end.\n\nIn a new blog post, the former Goldman Sachs executive says that a strong-performing Nasdaq-100 Index (NDX) is likely to hit new all-time highs within five months along with Ethereum.\n\n“We think the NDX may get to new all-time highs by November; the same applies to ETH. The NDX continues to outperform current liquidity conditions. This also happened in the past in 2019, for example – you can’t hold a beach ball underwater for long – the NDX will always tend to outperform.”\n\nPal says the NDX is likely to keep climbing on the back of secular trends like the emergence of artificial intelligence (AI) and a weakening dollar.\n\n“Remember: NDX = Debasement + Secular trend.”\n\nAt time of writing, Ethereum is trading for $1,880, up 1% during the last 24 hours. ETH reached an all-time high of $4,878 on November 10th, 2021.\n\nThe macro guru is also watching the performance of the US dollar index (DXY), which compares the American currency versus a bucket of other fiat currencies.\n\nPal says that the DXY is likely to break its support at 100 in the coming months, which he notes could boost the performance of risk-on assets like Bitcoin (BTC) and other cryptocurrencies.\n\n“Our base case at GMI (Global Macro Investor) is that we’re trading within a larger symmetrical triangle (continuation pattern). A break of 100 likely means the next stop is 90, which we expect to play out over the next twelve to eighteen months as the business cycle starts to bottom – a broadly supportive environment for risk assets…\n\nDollar weakness is not the ONLY thing that matters for risk assets and crypto markets, but looking back, it’s a pretty big plus.”\n\nBitcoin is worth $30,367 at time of writing, up 0.7% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4td2FudHMtYml0Y29pbi10by1leHBlcmltZW50LXdpdGgtbGF5ZXIyLXNvbHV0aW9ucy1qdXN0LWxpa2UtZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Vitalik Buterin wants Bitcoin to experiment with layer-2 solutions, just like Ethereum - Cointelegraph",
        "content": "Ethereum co-founder Vitalik Buterin believes the Bitcoin network needs scalable solutions like zero-knowledge rollups (ZK-rollups) to become more than another payment network. Buterin’s comments came during a Twitter Space hosted by Bitcoin developer Udi Wertheimer, with discussions revolving around Ethereum’s scaling experiments.\n\nA ZK-rollup is an off-chain protocol that operates on top of the Ethereum blockchain and is managed by on-chain Ethereum smart contracts. It offers a more scalable and faster way to verify transactions without sharing critical user information.\n\nThe Ethereum co-founder shed light on how Ethereum has incorporated various scaling solutions over the years to increase throughput. Buterin cited Optimism and Arbitrum as two successful examples of rollups that could be considered case studies for Bitcoin, adding:\n\n“I think if we want Bitcoin to be more than payments, it needs more scaling solutions”\n\nScalability has been a long-drawn point of discussion for Bitcoin and Ethereum over the years. While the Ethereum network has shifted from a proof-of-work to a proof-of-stake network, it is also experimenting with various layer-2 solutions like ZK-rollups and Plasma.\n\nRelated: Zero-knowledge proofs coming to Bitcoin, overhauling network state validation\n\nOn the other hand, Bitcoin’s layer-2 solution, the Lightning Network, has been crucial to its scalability, and lately, Bitcoin Ordinals have helped the Bitcoin network become more than just another payment layer. Buterin lauded the rise of Ordinals and said he thinks they have brought back the builder culture into the Bitcoin ecosystem.\n\nBitcoin Ordinals are the latest layer-2 solution enabling decentralized storage of digital art on the Bitcoin blockchain. Its popularity soared fast, and by the end of June, Bitcoin Ordinals inscriptions hit over $210 million in trading volume.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: ‘Moral responsibility’ — Can blockchain really improve trust in AI?"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vbWFjcm9oaXZlLmNvbS9oaXZlLWV4Y2x1c2l2ZXMvNjItb2YtdGhlLWV0aGVyZXVtLXN1cHBseS1oYXMtbm90LW1vdmVkLWluLWF0LWxlYXN0LWEteWVhci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "62% of the Ethereum Supply Has Not Moved in at Least a Year - Macrohive",
        "content": "This article is only available to Macro Hive subscribers. Sign-up to receive world-class macro analysis with a daily curated newsletter, podcast, original content from award-winning researchers, cross market strategy, equity insights, trade ideas, crypto flow frameworks, academic paper summaries, explanation and analysis of market-moving events, community investor chat room, and more.\n\nSummary\n\nTrading View (next 2-4 weeks): We like to be slightly bullish ethereum.\n\nInvestment View (next 1-3 years): We like to hold ethereum.\n\nMacro Signals\n\nThe labour market is still hot.\n\nWe expect the Federal Reserve (Fed) to hike twice more this year.\n\nWe think the Fed’s two planned hikes are unlikely to break the broader risk market rally.\n\nOn-Chain/Flow Signals\n\nWe have three bullish signals, two bearish, and one neutral.\n\nOverall View\n\nWith the macro backdrop neutral and our on-chain/flow metrics slightly bullish, our overall signal is slightly bullish ethereum (Chart 1).\n\nMacro: The Labour Market Is Still Hot\n\nThe labour market is still hot. The US ADP private sector employment report revealed 497,000 private-sector jobs were added in June against expectations of 220,000. Furthermore, despite a negative surprise in nonfarm payrolls (NFPs), the details continue to show a strong labour market: labour demand growth is slowing from the unsustainable highs of the pandemic but remains well above pre-pandemic levels.\n\nThe Fed will hike twice more this year. The Fed is on track to hike 25bps this month, and we expect a second 25bp hike in November. Markets are convinced of a July hike but are yet to fully price a November hike, which is Dominique’s base case. Furthermore, they are also overestimating Fed 2024 rate cuts.\n\nWill rate hikes break the risk rally? Dominique sees the two rate hikes planned by the Fed this year as unlikely to break the broader risk market rally, though signs of inflation persistence temper her optimism longer term.\n\nOn-Chain/Flow Metrics: HODLers Dominate\n\nWe have two bullish signals this week:\n\nLiquidity demand: bias for exchange outflows.\n\nbias for exchange outflows. P&L: the profitability of the coin supply has ticked up recently, and realised profits still dominate on chain (SOPR > 1).\n\nthe profitability of the coin supply has ticked up recently, and realised profits still dominate on chain (SOPR > 1). HODLer behaviour: 62% of the coin supply has not moved in at least a year, and the uptrend in the proportion shows no signs of abating yet.\n\nWe have two bearish signals:\n\nInstitutional demand: ETF outflows resume.\n\nETF outflows resume. : total value locked in DeFi for ethereum falls.\n\nThe remaining signal is neutral:\n\nFutures activity: futures open interest has not moved meaningfully on a MoM basis despite funding rates remaining positive on average (though trending down in magnitude).\n\nOn balance, on-chain/flow metrics are giving a slightly bullish bias for ethereum. Here are the details of each metric (with explanations in the Appendix).\n\nInstitutional Demand: Bearish Ethereum\n\nOur preferred metric to track institutional demand is flows into ethereum ETFs. After a brief period of inflows toward the end of June, outflows have resumed (Chart 2). In general, the year so far has had a bias for outflows. This is bearish for ethereum.\n\nDemand for Liquidity and Exchange Activity: Bullish Ethereum\n\nOn exchange flows:\n\nShort term, a bias exists for exchange outflows with net 109,000 ETH exiting exchanges over the past two weeks (Chart 3).\n\nLonger term, the 30-day change in the exchange balance remains in deep negative territory with the total exchange balance down 1.2mn ETH MoM (Chart 4).\n\nOn balance, the bias for exchange outflows is bullish for ethereum.\n\nFutures Activity: Neutral Ethereum\n\nOn futures markets:\n\nFutures open interest, a good proxy for investor interest, is currently around $4.9bn (-2% MoM, Chart 5).\n\nPerpetual funding rates have been trending down, though they remain positive on average, meaning traders are paying a premium to keep open long positions (Chart 6).\n\nFutures open interest has not moved meaningfully on a MoM basis and, despite funding rates remaining positive on average, their magnitude has been decreasing. Overall, this is neutral for ethereum.\n\nHODLers: Bullish Ethereum\n\nOn HODLer metrics:\n\nThe 30-day moving average of the coin days destroyed (CDD) metric is down -5% MoM, suggesting reduced movement of older coins over the past month (Chart 7).\n\n\n\nSplitting the entire coin supply into those who have held for under one year and those for one year or more reveals the latter vintage continues to set new all-time highs, with 62% (+62bps MoM) of the coin supply having not moved in at least a year (Chart 8).\n\nA sizeable proportion of the ethereum supply remains dormant, pointing to a strong investor base that continues to hold despite ongoing macroeconomic and regulatory headwinds. This is bullish for ethereum.\n\nInvestor Profit and Loss: Bullish Ethereum\n\nOn profitability of the coin supply:\n\nThe percentage of circulating supply in profit (PSIP) is 60% (+11bps MoM, Chart 10).\n\nNet unrealised profit/loss (NUPL) is now 0.15 (15% of market cap, +5bps MoM, Chart 11). This means that the overall ethereum supply remains in a state of unrealised profit (NUPL > 0) as market cap exceeds realised cap.\n\nThe spent output profit ratio (SOPR, price sold/price paid) has been falling on average this month, but it still maintains a bias for levels above one (realised profits, Chart 12). Year to date, 80% of days have seen realised profits. Furthermore, over the past 30 days, 80% of days have had a SOPR value above one.\n\nThe profitability of the coin supply has recovered to over 50% and realised profits on-chain (SOPR > 1) still dominate. Overall, this is bullish ethereum.\n\nDeFi: Bearish Ethereum\n\nOf the top five DeFi protocols by total value locked (TVL), all are down in terms of their TVL (Charts 13 and 14). Ethereum’s TVL is down the most (-3% WoW) – this is bearish.\n\nAppendix\n\nInstitutional Demand\n\nPerhaps the largest institutional vehicle for ethereum is the Grayscale ETHE Trust, with over $27bn in assets. It invests solely in ETH, and so many investors, notably institutional, who cannot hold ETH directly can get exposure through investing in Grayscale. Consequently, if the trust trades at a premium to ETH prices, it may imply ‘excess’ demand from institutions, but ‘excess’ supply if it trades at a discount. Alternatively, the discount may suggest investors have found other ways to get exposure to ETH, whether through ETFs or directly holding ETH. We therefore focus on how the discount has changed in recent months to gauge investor interest. Alternatively, investors may be using other vehicles to get exposure such as ETFs or holding ETH directly. We put more weight on ETF flows than the Grayscale premium.\n\nLiquidity Demand\n\nAnother measure of cryptocurrency bullishness is whether investors are willing to hold it in illiquid form (e.g., a private wallet) or prefer a liquid form (e.g., on an exchange). The former would suggest investors are bullish, as they are comfortable with being unable to sell easily. Conversely, holding it in liquid form would suggest investors are bearish, as they prefer being able to sell easily.\n\nTherefore, large flows onto crypto exchanges would suggest investors want to convert their holdings to a more liquid form, implying more bearishness.\n\nFutures Activity\n\nWe track the growing market of ethereum futures. Open interest – the sum of long and short contracts – is a good measure of investor interest.\n\nPerpetual funding rates reveal the directional bias of investors. Exchanges set funding rates to prevent a lasting divergence in the price of the futures contract and the underlying since perpetual contracts have no expiry date so never settle in the traditional sense. Consequently, we can interpret funding rates as the cost of holding ethereum via perpetual futures. Positive funding rates imply longs pay shorts and vice versa. We use it as a proxy for trader sentiment since a positive funding rate implies traders are paying a premium to keep open long positions.\n\nHODLers\n\nIn our introductory bitcoin flow framework, we explained ‘HODLers’ and ‘HODLing.’ HODLing refers to buy-and-hold strategies in the context of bitcoin and other cryptocurrencies. Those who HODL for extended periods are die-hard adherents.\n\nWe can categorise HODLers by the length of time they have held ETH. We define long-term or staunch HODLers as those who bought ETH five or more years ago and have held it ever since, medium-term HODLers as those who bought 6-12 months ago, and short-term HODLers as those who bought 3-6 months ago.\n\nThe coin days destroyed (CDD) metric is defined as the number of coins in a transaction multiplied by the number of days since the coins were last spent. So, increasing CDD suggests older coins are being spent (more coin days are destroyed) and vice-versa.\n\nProfit and Loss\n\nThe percent supply in profit (PSIP). This tracks the share of circulating ETH supply in profit. That is the percentage of circulating ETH whose current price is higher than when it was last transacted (movement).\n\nNet unrealized profit and loss (NUPL). This is the ratio of unrealised profits over total market capitalisation. While PSIP just focuses on whether ETH coins are in profit or not, the NUPL focuses on the size of profits. So, we could have a situation where the PSIP is low – that is, a low share of supply is in profit – but the NUPL could be high if the size of those profits is large.\n\nSpent output profit ratio (SOPR). While PSIP and NUPL focus on unrealised profits or mark-to-market, this measure focuses on realised profits. SOPR is the realised value of a transaction divided by the value at initiation (or creation) – more simply, price sold divided by price paid. If SOPR is above one, investors in aggregate have realised profits, while below one means they have realised losses. In broad uptrends, SOPR spends a significant amount of time above one, whereas the opposite is true for broad downtrends.\n\nWhen SOPR is rising, sellers are increasingly realising profits. The opposite is true when it is falling. A price rally with a flatter SOPR trend indicates investors are not yet realising their profits with the rally. The reluctance of investors to sell and realise a profit may be because they believe the price will increase further, which would be bullish. At the same time, more profit taking could precede a correction. Typically, buying as SOPR moves around one during bullish periods has proven to be a profitable strategy.\n\nMining Activity\n\nComputing power is central to the crypto market. Miners use advanced computing hardware to solve complex problems that confirm ETH (and other coins) transactions on the public ledger or blockchain. The miners are rewarded with new coins for their efforts. A measure of the complexity of the problems and so the computing performance required to solve them is the hash rate. The higher this rate, the more computing performance is needed to maintain the blockchain. The rate can fluctuate depending on demand for crypto.\n\nDeFi\n\nWe track the total value locked (TVL) in decentralized finance (DeFi) – the sum of all assets deposited in DeFi protocols, many of which use ethereum as the underlying protocol. The more DeFi products are created, the more ethereum gets locked into the DeFi system and removed from the broader market. This reduction in supply should lead to higher ethereum prices.\n\nDalvir Mandara is a Quantitative Researcher at Macro Hive. Dalvir has a BSc Mathematics and Computer Science and an MSc Mathematical Finance both from the University of Birmingham. His areas of interest are in the applications of machine learning, deep learning and alternative data for predictive modelling of financial markets."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9hcHBlYWxpbmctYml0Y29pbi1ldGhlcmV1bS1kaXNjb3VudHMtb24tYmluYW5jZS11cy1idXQtbm90LWZvci1ldmVyeW9uZS_SAWVodHRwczovL2NyeXB0b3BvdGF0by5jb20vYXBwZWFsaW5nLWJpdGNvaW4tZXRoZXJldW0tZGlzY291bnRzLW9uLWJpbmFuY2UtdXMtYnV0LW5vdC1mb3ItZXZlcnlvbmUvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Appealing Bitcoin, Ethereum Discounts on Binance.US But Not for Everyone - CryptoPotato",
        "content": "Bitcoin and Ethereum are trading at an enticing discount on Binance.US, but not all users will be able to leverage it.\n\nAt nearly $27,500, Bitcoin is trading about $2,500 lower on Binance.US compared to global spot markets. Ethereum, on the other hand, was trading at $1,700 – a discount of $200, offering market participants a better price than other crypto exchanges.\n\nDiscount Concerns\n\nCrypto users took to Twitter to address the situation and termed it a “depeg” of cryptocurrencies, a term denoting a significant divergence from the global spot prices.\n\nBut it’s not easy to take advantage of the disparity since discounted cryptocurrencies can only be purchased via USD holdings. However, Binance.US suspended USD deposits into the platform on June 9. This essentially leaves only those users with USD already sitting on the exchange to grab the arbitrage opportunity.\n\nAnother instance of price anomaly on a Binance platform was observed in late May when the Australian branch of the crypto giant witnessed a massive decline in Bitcoin’s price compared to global spot prices.\n\nThe event unfolded after the termination of fiat on- and off-ramps by the company’s third-party payments provider. Subsequently, Bitcoin’s price on Binance’s Australian platform plummeted by 20% against the AUD relative to global prices.\n\nTether CTO Chimes in\n\nBesides Bitcoin and Ethereum, the world’s largest stablecoin – USDT – was also trading below $1 on the exchange, which fueled FUD in the community. In an attempt to alleviate concerns, Paolo Ardoino, the CTO of the stablecoin issuer, explained that the lack of many market makers willing to arbitrage could be behind the disparity considering Binance.US is embroiled in legal challenges.\n\nThe exec further added that Tether is in charge of its primary market, while arbitrageurs and market-making professionals are responsible for market-making secondary markets i.e., crypto exchanges.\n\n“BTC/USD trades at 27600 there (30.1k on other exchanges). seems there is a general spread of ~8%. does it mean that BTC is also worth less globally? Of course not. The same logic applies. do the math on the spread for BTC/USD and USDt/USD and you get pretty much the same percentage.”"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vdGhlZGVmaWFudC5pby9ldGhlcmV1bS1pcy10ZXJyaWZ5aW5nbHktY2VudHJhbGl6ZWQtYnV0LXRoZXJlLXMtYS13YXktb3V0LWV0aGVyLWZpLWZvdW5kZXItc2F5c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 01:04:19 GMT",
        "title": "🎙️ Ethereum is \"Terrifyingly\" Centralized but there's a way out, ether.fi founder says - The Defiant - DeFi News",
        "content": "Parcl is the decentralized real estate trading platform that is making it easier to get exposure to global real estate. For a limited time get 10% back on your first trade.\n\n________________________________________________________________\n\nArch, the crypto asset management platform that helps you maximize returns with diversified and gas-efficient investment strategies. Learn more at https://www.arch.finance/best-of-web3.\n\n________________________________________________________________\n\nIPOR Protocol, the home of interest rate benchmarks, derivatives, structured products, and some of the best stablecoin yields in DeFi."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tc29sYW5hLXBvbGthZG90LW9uLWNoYWluLXN0YWtpbmctZW5hYmxlZC1vbi1jcnlwdG8tY29t0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Ethereum, Solana, Polkadot On-Chain Staking Enabled on Crypto.com - Watcher Guru",
        "content": "Crypto.com, one of the most popular crypto exchanges in the world, has launched its on-chain staking initiative. According to an official announcement, only Ethereum (ETH), Solana (SOL), and Polkadot (DOT) staking will be available upon launch. However, more protocols will be added in the future.\n\nThe announcement also noted that the staking feature will only be available in “select markets.” Unfortunately, the official release does not state which markets the new staking initiative will be available in. The feature is not available to citizens or residents of the U.S. and its territories, Australia, Canada, Hong Kong SAR, South Korea, Singapore, Thailand, and Malta.\n\nAlso Read: Rise in Ethereum Staking Still Carries Major ‘Lido’ Risk\n\nThe minimum staking amount for all three protocols is currently set at 1.00E-08. Moreover, there is no minimum staking period for all three projects. However, the frequency of rewards is different for each asset. Ethereum (ETH) stakers will receive rewards every 7 days, Solana (SOL) stakers every 2.5 days, and Polkadot (DOT) stakers will receive them every day.\n\nStaking allows investors to participate in securing the network while receiving rewards for doing so. Typically, stakers join staking pools managed by validators, who aid in transaction verification and adding them to the network. In exchange, they are rewarded with freshly minted tokens. After deducting their costs, validators can proportionally distribute the rewards to stakeholders.\n\nEthereum, Solana, and Polkadot staking on the rise\n\nThe Ethereum (ETH) network has seen a significant rise in staking after the Shapella upgrade. According to crypto analysis firm Glassnode, the total ETH locked in staking has surpassed 26 million. On the other hand, ETH’s circulating supply has consequently declined.\n\nSource: Glassnode\n\nThe Shapella upgrade allowed stakers to unstake their tokens, which has boosted investor confidence.\n\nAlso Read: Ethereum Could be a Layer-2 for Solana: Co-Founder\n\nSolana (SOL) on the other hand, had seen a massive plummet in TVL (total value locked) since June 2022. However, the trend is slowly changing in 2023. According to DefiLlama, locked SOL has seen an upward movement since the beginning of this year.\n\nPolkadot (DOT), according to Messari, has about 45.7% of its supply currently staked, which amounts to about 607.20 million tokens, in Q2 2023. This is a decline from the 50% which was staked in Q1 2023. According to Messari, the lower percentage results in higher stake rewards, which promotes greater stake involvement. Moreover, the analysis firm noted that Polkadot has consistently kept its staking percentage towards its desired level.\n\nAlso Read: Vitalik Buterin Advocates for Bitcoin’s Exploration of Layer-2 Solutions"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2FhdmUtZGFvLXN0YWJsZWNvaW4tZ2hvLW9uLWV0aGVyZXVtL9IBSWh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2FhdmUtZGFvLXN0YWJsZWNvaW4tZ2hvLW9uLWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Aave DAO Floats Proposal To Launch Stablecoin GHO On Ethereum - Ethereum World News",
        "content": "Aave V3 users will be able to mint GHO tokens on Ethereum’s mainnet if the proposal is approved by the community.\n\nThe proposal also suggested using staked Aave coins as a way to cut down GHO borrowing costs and incentivize users to mint the stablecoin.\n\nGHO developers rigorously tested the stablecoin on Ethereum’s Goerlie testnet since February and did not encounter any major bugs with the product.\n\nThe Aave DAO community will soon vote on a proposal aimed at launching the GHO stablecoin on Ethereum’s mainnet after months of testing on Goerli, a popular testnet on Ethereum.\n\nIf approved, users would be able to mint GHO tokens against their collateral directly on Ethereum’s main chain. GHO’s interest rate will be changeable through Aave DAO governance votes.\n\nProposed by Aave Companies, an active contributor to the DeFi lender, the plan hopes to generate additional revenue for the project’s DAO. The proposal also would bootstrap competition among stablecoin borrowers on the lender’s platform, per the AIP.\n\nIf approved, the introduction of GHO would make stablecoin borrowing on the Aave Protocol more competitive and generate additional revenue for the Aave DAO by providing to the DAO treasury 100% of the interest payments made on GHO borrows.\n\nVoting on the proposal opens later today at 22:02 UTC +01:00 and ends 14 Jul 2023, 14:02 UTC +01:00.\n\nGHO Minting Via Aave Facilitators, Aave DAO Plans\n\nThe proposal plans to introduce GHO minting on Ethereum through facilitators – protocols or entities that are able to burn and mint GHO coins. “This proposal combined two previously approved Facilitators (the Aave V3 Ethereum Pool and the FlashMinter)”, the proposal reads.\n\nThis means that users have two options for minting GHO tokens. They can either deposit collateral in the V3 Ethereum Mainnet Pool and borrow GHO through Aave V3 Ethereum Pool or lash mint GHO tokens without any collateral using the FlashMinter Facilitator. The latter option requires that users repay the loan in a single transaction.\n\nThis AIP also proposes slashing the cost of borrowing GHO by using a mechanism built on Staked Aave (stkAAVE).\n\nIn other related news, the DAO is also voting to increase staking revenue by converting unproductive ETH from its treasury into wrapped staked ETH and rocket pool ETH."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtY3BpLWNvdWxkLWdpdmUtYnRjLWRpcmVjdGlvbi0yMDIzMDcxMDIwNTjSAYsBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLXJpcHBsZS1jcGktY291bGQtZ2l2ZS1idGMtZGlyZWN0aW9uLTIwMjMwNzEwMjA1OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: CPI could give BTC direction - FXStreet",
        "content": "Share:\n\nBitcoin price could breach the $30,500 hurdle if it holds above the local low of $29,950.\n\nEthereum price looks ready for another leg higher above $2,000 as ETH gains pace against the USDT.\n\nRipple price shows investors are not trading the intermediate with possible entry and exit points at $0.448 and $0.506, respectively.\n\nBitcoin (BTC) price is bullish on the lower timeframe, but there is no actionable price action in the higher timeframe. Without a proper catalyst in individual ecosystems, Ethereum (ETH) price is moving in tandem with BTC, steadily gaining ground as the broader market braces for the Consumer Price Index (CPI) reading scheduled for July 12. Meanwhile, Ripple (XRP) price is moving within a steady range as market participants plan their next move.\n\nAlso Read: Will altcoin investments pay out in third quarter of 2023?\n\nBitcoin price braces for the CPI week\n\nBitcoin (BTC) price shows an actionable price move in the one-hour chart for the BTC/USDT 1-hour trading pair. This is unlike the one-day timeframe, where you can assume a stagnating market. The king of crypto remains bullish after flipping the 50-, 100-, and 200-day Exponential Moving Averages (EMA) hurdles at $30,252, $30,296, and $30,344 into support.\n\nHowever, experts anticipate a prolonged drag until the CPI inspires some volatility. Based on popular opinion, the report could come in at 3.1%, an outcome that could trigger a rally for the flagship crypto.\n\nA positive reading could see Bitcoin price break the range, potentially breaching the $30,500 mark to record a new range high.\n\nThe Fibonacci Retracement indicator shows that Bitcoin price is likely to head north toward the 50% Fib at $30,727. This outlook is supported by the Relative Strength Indicator (RSI) and the Awesome Oscillator (AO), moving up to show rising momentum.\n\nBTC/USDT 1-hour Chart\n\nHowever, the influence of macroeconomics like CPI has sort of dried up over time, meaning BTC could continue the dull price action or succumb to investor greed and head south.\n\nAlso Read: CPI meets low BTC supply – Five things to know in Bitcoin this week\n\nEthereum price gains pace against USDT\n\nEthereum (ETH) price is sitting above the 50-day EMA at $1,852, with momentum indicators pointing to a rising momentum. The PoS token is gaining momentum against Tether (USDT), recording a daily rise of almost 2% and almost 10% over the last month. A sustained increase in buying pressure could see ETH breach the immediate barricade at $1,959 before confronting the $2,000 level.\n\nThe AO, an indicator histogram that compares and displays market momentum, is trading above the zero line to show Ethereum price is still bullish. Similarly, the RSI is edging north, pointing to a growing momentum.\n\nBitcoin price recording a potetial fresh increase, possibly catalyzed by the oncoming macroeconomic report, could increase the chances for the upside as the overflows of a BTC rally often bode well for Ethereum price.\n\nETH/USDT 1-Day Chart\n\nConversely, a rejection from the $1,959 hurdle could send Ethereum price below the support offered by the 50-day EMA.\n\nAlso Read: Veteran trader Peter Brandt calls Binance ‘scam of the decade’ as Bitcoin, Ethereum trade at discount\n\nRipple price to record significant moves upon breaking the intermediate\n\nRipple (XRP) price points to a market where traders are reluctant to make moves as XRP continues moving within a zone. The complacency comes as community members grow weary of a long-overdue judgment in the network’s case against the US SEC.\n\nThe resistance at $0.506 and the support at $0.444 has the remittance token caught in a bound, possibly as investors plan the ideal entry or exit points. An increase in buyer momentum could see Ripple price rise 5% above the current market position of $0.478 to fight off the $0.506. With investor greed in check, XRP could extend further toward the $542 level.\n\nXRP/USDT 1-day chart\n\nNevertheless, the $0.506 range could also be the ideal exit points for investors booking early profits. The ensuing selling pressure could send Ripple price southward to find support at $0.444.\n\nAlso Read: Ripple price suffers the aftermath of Hinman email failure as the XRP hype train dissipates"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWRlY2xpbmluZy1hY3Rpdml0eS1oaW5kZXItZ3Jvd2luZy1yZXZlbnVlL9IBUmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWRlY2xpbmluZy1hY3Rpdml0eS1oaW5kZXItZ3Jvd2luZy1yZXZlbnVlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Ethereum: Will declining activity hinder growing revenue? - AMBCrypto News",
        "content": "Ethereum observed a spike in revenue over the last quarter.\n\nHowever, NFT volumes surged as floor prices for blue chip NFTs fell.\n\nDespite experiencing volatility in the past year, the Ethereum [ETH] network witnessed a growth in recent months. The introduction of the Shapella upgrade, which facilitated staking withdrawals from the beacon chain, has further stimulated interest in the protocol.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nHow did Ethereum perform in Q2?\n\nOne area where Ethereum witnessed the most amount of growth was revenue. Based on Ethereum’s income statement, there was a substantial increase of 56% in total fees during Q2. Furthermore, Ethereum demonstrated a remarkable gross profit margin of 84%.\n\nHowever, despite the growth showcased in terms of revenue, there was a slight decline in activity observed in the protocol. Based on recent data, Ethereum’s daily active users (DAU) experienced a year-on-year decline of -3% and a quarterly decline of -4%.\n\nAdditionally, the average daily transactions decreased by -4% compared to the previous year and -1% compared to the previous quarter.\n\nRegardless, DAUs across the Ethereum Ecosystem have witnessed significant growth, doubling in numbers. Layer 2 (L2) Protocols such as Polygon [MATIC], Optimism [OP], and Arbitrum [ARB] have attracted large users during this quarter.\n\nHowever, it is important to note that this does not necessarily indicate a twofold increase in the number of individuals interacting within the Ethereum Ecosystem. Nevertheless, this emphasizes the heightened level of engagement observed within the ecosystem.\n\nIn terms of transactions, Ethereum has witnessed a stagnation with an average of approximately 1 million transactions per day.\n\nHowever, across the broader Ethereum Ecosystem, average transactions per day have experienced a surge of around threefold. This indicates a substantial rise in transactional activity beyond the network itself.\n\nSource: Artemis.xyz\n\nHow is the NFT sector doing?\n\nThe NFT sector also observed growth over the last month. According to Dapp Radar’s data, the volume of NFTs being traded and the number of sales occurring on the network increased materially. However, the floor price of most blue-chip Ethereum NFTs declined during this period.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nThe discounted price of these NFT collections may have driven buyer interest in these NFTs.\n\nAt press time, ETH was trading at $1,880.46 as its price surged by 1.86% in the last 24 hours."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNy8zMzE5Mjc2Ny9iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXNsaWdodGx5LXVwLWFoZWFkLW9mLWluZmxhdGlvbi1kYXRhLXJlbGVhc2UtYW5hbHlzdC1zYXlzLXByZXR0eS3SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzMxOTI3Njc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Slightly Up Ahead Of Inflation Data Release: Analyst Says 'Pretty Damn Clear' - Benzinga",
        "content": "Major cryptocurrencies traded in slightly positive territory on Tuesday evening as investors eagerly await Wednesday’s Consumer Price Index (CPI).\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin BTC/USD +0.37% $30,617 Ethereum ETH/USD +0.16% $1883 Dogecoin DOGE/USD +0.19% $0.065\n\nWhat Happened: This upcoming release, marking the first significant inflation data since mid-June, has the potential to determine whether the range-bound trading pattern continues.\n\nThis year has been a strong one for Bitcoin, with prices soaring 84% year to date. However, a closer look at the month-to-month data reveals that much of the gains were consolidated during the winter months. Specifically, January and March boasted average daily returns of 1.11% and 0.73% respectively.\n\nJune also demonstrated robust performance, with an average daily gain of 0.41%, largely fueled by BlackRock’s spot ETF announcement. On the other hand, February and April were relatively stagnant in terms of Bitcoin’s performance, while May stood out as the only month with negative returns this year.\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Compound +13.85% $67.38 Inch +8.49% $0.3325 Aave +6.58% $74.80\n\nAt the time of writing, the global crypto market capitalization stood at $1.19 trillion, an increase of 0.19% over the last day.\n\nU.S. stocks showed gains on Tuesday following a three-session decline, with the major averages rebounding.\n\nThe S&P 500 recorded a 0.67% increase, while the Nasdaq Composite, which focuses on technology stocks, saw a gain of 0.55%.\n\nSee More: Best Crypto Day Trading Strategies\n\nAnalyst Notes: \"The others chart for #Crypto is still facing depression. This means, the best opportunities to gather your positions is in that phase before we’ll be taking out the previous lower highs and start rallying into the bull.With ETF’s. With more institutional adoption,\" wrote crypto trader Michael Van de Poppe.\n\nAccording to pseudonymous trader Dontells, the current consolidation phase of ETH at its current prices could potentially result in a breakout. Dontells suggests that the resistance at play should ideally lead to a downward movement, which has happened a few times already but without significant impact.\n\n\"Bitcoin should move soon. Otherwise, it's going to be not nice. And then I look at ETH, if this stays (like) this for two, three, four more weeks that resistance should be cooked.\"\n\nThe trader adds that if ETH manages to rise above $1,935, it could trigger a rapid rally, potentially taking ETH to a level last witnessed in May 2022, before the collapse of the Terra Classic (LUNC) ecosystem. \"To the upside, we close above $1,935, it seems pretty damn clear that we're going to go to $2,500. There's pretty much just empty air… Given that we've stuck around the $2,000 handle so much just seems sensible to go up quite quickly if we do get through it.\"\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8xNDgwNjgvbGF5ZXItMi1kZWZpLXByb2plY3Qtcm9kZW8tZmluYW5jZS1oYWNrZWQtNDcyLWV0aGVyZXVt0gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzE0ODA2OC9sYXllci0yLWRlZmktcHJvamVjdC1yb2Rlby1maW5hbmNlLWhhY2tlZC00NzItZXRoZXJldW0_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "DeFi Project Rodeo Finance Hacked for $888,000 in Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nArbitrum-based Rodeo Finance has lost $888,000 in a recent attack.\n\nA “ForceInvestment” hack was deployed, allowing the attacker to steal 472 Ethereum ($888,000). The wallet later sent 150 ETH into mixer Tornado Cash, leaving 371 ETH remaining in the wallet.\n\nThe exploiter originally funded 50 ETH from Tornado Cash to execute the hack.\n\nAD\n\nAD\n\nArbitrum is a popular layer-2 scaling solution for the Ethereum network that uses optimistic roll-up technology.\n\nBlockchain security firm PeckShield, first highlighted the attack on Twitter with a link to the attack transaction commenting, \"Hi, @Rodeo_Finance you may want to take a look.\"\n\nThe attacker used the “Investor.earn()” function to force a swap from Rodeo’s interest-bearing USDC pool. First, the exploiter took 290 Wrapped Ethereum (WETH) from the pool, bridging the assets to the Ethereum network before using oracle manipulation to inflate the price of their ETH by swapping it for unshETH.\n\nunshETH is a DeFi project aimed at promoting validator decentralization by creating a marketplace for staked ETH liquidity in which validators compete to offer the best yield.\n\nAD\n\nAD\n\nWhen the above swap is performed, the slippage control—the difference between a trade’s order and its execution—is invalid. This meant that the conversion of WETH to unshETH did not reflect a fair market value.\n\nThe attacker then bridged back to the Ethereum network to steal another 230 WETH from the Rodeo vault.\n\nBefore bridging back to the Ethereum network, sending 150 ETH into Tornado Cash and leaving 371 ETH in the wallet.\n\nA total of 520 WETH was grabbed from the Rodeo vault but only 472 WETH is counted as losses. This is due to the attacker funding the wallet with 50 ETH to execute the exploit.\n\nPeckShield originally reported this as a $1.5 million loss but later corrected it to a $888,000 loss due to a double calculation."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNy8zMzE3NzM4Ni9iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXJpc2UtYW1pZC11cHRpY2staW4tYnRjLXdhbGxldHMtdG8tYWxsLXRpbWUtaGlnaC1hbmFseXN0LXNheXMtdGjSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzMxNzczODY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Rise Amid Uptick In BTC Wallets To All-Time High: Analyst Says This Is How Lo - Benzinga",
        "content": "Major cryptocurrencies traded in positive territory on Monday evening as the number of wallets holding at least one Bitcoin reached a record-breaking 1,008,737 million, according to Glassnode data.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin BTC/USD +1.69% $30,578 Ethereum ETH/USD +1.56% $1883 Dogecoin DOGE/USD +0.92% $0.065\n\nWhat Happened: The growing distribution of wallets with a minimum of one Bitcoin indicates a surge in decentralization within the network.\n\nIn May, the number of wallets holding at least one bitcoin surpassed one million and has been steadily increasing ever since.\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Mina +17.04% $0.50 Polygon +9.42% $0.7413 Wrapped BTC +9.09% $30,497.39\n\nAt the time of writing, the global crypto market capitalization stood at $1.19 trillion, an increase of 1.67% over the last day.\n\nUS stocks rebounded on Monday, signaling a positive turn for Wall Street after a challenging week. Investors were bracing themselves for upcoming inflation data and the beginning of the second-quarter earnings season.\n\nThe S&P 500 showed a 0.24% increase, while the Nasdaq Composite saw a gain of 0.18%. Later this week, the consumer price index report is scheduled to be released on Wednesday, followed by the producer price index, which measures wholesale price pressures, on Thursday.\n\nSee More: Best Crypto Day Trading Strategies\n\nAnalyst Notes: \"Bitcoin got a strong vote of confidence from Standard Chartered, with a price target of $50,000 this year and $120,000 for 2024. Miner profitability was one of the key reasons for the elevated price targets, but that might not be as easy as electricity costs grow and over-surging debt payments,\" wrote Edward Moya, Senior Analyst at OANDA.\n\nHe added, \"Bitcoin appears locked in a range, but that might continue as we may have to wait months before getting any concrete ETF updates.\"\n\nPseudonymous trader Altcoin Sherpa said that we may have to wait about eight months for the next Bitcoin bull run. According to the trader, Bitcoin’s price action on the weekly time-frame chart appears bullish, as it currently sits above its major exponential moving averages (EMAs), resembling a similar pattern seen in 2019.\n\n\"We can see on the one-week, all of the EMAs are clumping together and tightening up. This usually means that price is compressing and a big move is coming.”\n\n\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0zMDAwMC1ldGhlcmV1bS1iZWxvdy0xOTAwLWxpdGVjb2luLXRyb24tZHJvcC11cC10by00LTM4ODkyNC0yMDIzLTA3LTEw0gGbAWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuaW4vYW1wL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0zMDAwMC1ldGhlcmV1bS1iZWxvdy0xOTAwLWxpdGVjb2luLXRyb24tZHJvcC11cC10by00LTM4ODkyNC0yMDIzLTA3LTEw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $30,000; Ethereum below $1,900; Litecoin, Tron drop up to 4% - Business Today",
        "content": "Bitcoin and other top crypto tokens were down on Friday as traders were cautious ahead of key economic data and rate hike cues by the central banks. The crypto market will have its eye on inflation numbers and jobless claims, two figures that the Fed will consider when making its next moves on rates.\n\n\n\nBitcoin continued to weaken further on Monday. The largest crypto token dropped further but managed to hold around $30,000-mark. Its largest peer, Ethereum, also declined slightly and slipped below $1,900-level. However, price action in other altcoins was majorly on the downside.\n\n\n\nBitcoin entered the new week with a sideways trading pattern, maintaining its position above the $30,000 mark. It has been trading between the level $30,000 and $31,400 since the past few days. This range suggests that both bullish and bearish forces are actively participating in the market, said Edul Patel, Co-founder and CEO at Mudrex.\n\n\n\n\"There is a decrease in volatility since last week, indicating a consolidation phase for its next move. If bulls fail to sustain the US$30,000 support level, the next key support level to monitor would be around $29,500, potentially triggering a breakout,\" he added.\n\n\n\nAll of the top crypto token were trading lower on Monday. Litecoin dropped as much as 4 per cent, while Tron declined 3 per cent each. Polkadot, Dogecoin, Solana and Cardano shed 3 per cent each during the early trade. XRP and BNB were also among the top laggards.\n\n\n\nThe global cryptocurrency market cap was trading lower, dropping to $1.17 trillion-mark as it declined almost a per cent in the last 24 hours. However, the total trading volumes surged more than 9 per cent to $22 billion.\n\n\n\n\n\nTech View by Giottus Crypto Platform\n\nBNB is currently moving sideways within a horizontal channel in the medium long term, which indicates further development in the same direction. The candle sticks have inched closer to the $240 level in the past two days which is also its 20-day moving average.\n\n\n\n\n\nIf there is an upside momentum, additional gains could potentially drive the price towards the resistance levels of $265 and $280. The RSI slope is moving upwards which indicates that the underlying buying pressure for BNB is increasing gradually. However, if BNB fails to withhold the $225support level, it could encounter renewed selling pressure.\n\n\n\nMajor Levels:\n\nSupport: $225,$215\n\nResistance: $245, $265, $280\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1idGMtYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1zaGliYS1pbnUtc29sYW5hLXBvbHlnb24tMTcxODE0NTEuaHRt0gGJAWh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9waG90b3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LWJ0Yy1iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXNoaWJhLWludS1zb2xhbmEtcG9seWdvbi0xNzE4MTQ1MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum and other tokens gain, Polygon up 10% - CNBCTV18",
        "content": "1 / 7\n\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, gained 1.6 percent to 30,592.2. Its market value stood at $592.68 billion. The trade volume was at $14.67 billion.\n\n2 / 7\n\nEthereum | The second largest virtual currency, Ethererum or Ether, gained 1.65 percent to $1,885.91 with a market capitalisation of $226.10 billion. The trade volume of Ethereum was $5.9 billion in the last 24 hours.\n\n3 / 7\n\nDogecoin | Meme-based virtual currency, Dogecoin, was up 1.57 percent. Its market value stood at $9.15 billion. The trade volume was at $219.52 million.\n\n4 / 7\n\nShiba Inu | Shiba Inu fell 0.4 percent with a market capitalisation of $4.47 billion. The trade volume was $91.1 million in the last 24 hours.\n\n5 / 7\n\nSolana | Solana gained 5.89 percent to $22.13 with a market capitalisation of $8.84 billion. The trade volume of Solana was $532.54 million in the last 24 hours.\n\n6 / 7\n\nPolygon | Polygon gained 10.30 percent with a market capitalisation of $6.91 billion. The trade volume was $530.64 million in the last 24 hours.\n\n7 / 7"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLW9yZGluYWxzLWtlZXAtZXRoZXJldW0tbmZ0cy1vbi10aGVpci1oZWVscy1hcy1icmMtNjktZHJpdmVzL9IBXmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLW9yZGluYWxzLWtlZXAtZXRoZXJldW0tbmZ0cy1vbi10aGVpci1oZWVscy1hcy1icmMtNjktZHJpdmVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals keep Ethereum NFTs on their heels with BRC-69 - AMBCrypto News",
        "content": "Several Bitcoin NFT collections registered higher volumes than Ethereum.\n\nSince BRC-69 came into play, Ordinals Inscriptions have increased.\n\nBitcoin Ordinals, which represent the NFTs created on the Bitcoin [BTC] network, seems to be closing in on their Ethereum [ETH] counterparts in terms of dominance. By looking at CryptoSlam’s data, Bitcoin NFT sales have grown by 8301% in the last 24 hours.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nThis was in high contrast to the volume on the Ethereum blockchain which only registered a 1.33% increase within the same period. However, it was worth noting that Ethereum’s sales were way above Bitcoin’s.\n\nThe flipping could be in motion\n\nAt the time of writing, overall sales of digital collectibles on Ethereum were $14.75 million. On the other hand, Bitcoin NFTs recorded $6.69 million. But that’s not all.\n\nOne eye-catching occurrence in the sector was how Bitcoin Ordinals had sent the blue-chip Ethereum NFTs off the top of sales.\n\nAccording to the NFT aggregator, collections including $INSC BRC-20 NFTs, Uncategorized Ordinals, and $ BRC-20 NFTs had much more volume than the likes of Azuki, BAYC, and MAYC.\n\nThis flip suggests that traders’ interest in Bitcoin NFTs surpassed that of Ethereum. And one reason linked to the latter’s inability to claim traction was the falling floor prices of the top collections.\n\nEarlier Ethereum held the mantle as the king of volume when it comes to NFTs. This was because of the traction it gained during the mass adoption of 2021. But since the year began, collections under the blockchain have struggled to witness a steady long-period climb.\n\nAnd it was during this same period that Bitcoin Ordinals emerged. While there have been controversies about its operation on the Bitcoin network, the development backed by the Taproot network has continued to gain adoption.\n\nAnother high on the cards\n\nMeanwhile, Bitcoin Ordinals has not only limited its potency to its initial application. Lately, the introduction of Inscriptions has led to the rise of BRC-20 fungible tokens.\n\nHowever, it was also important to highlight that these developments have caused some issues on the Bitcoin network.\n\nIn May, at the height of Ordinals’ adoption, Bitcoin experienced a slowdown in block confirmation and transactions. And this was one of the reasons there was a conflict of interest among Bitcoin developers.\n\nBut last week, Luminex, a Bitcoin Ordinals’ launch pad, proposed the BRC-69 standard to curb this challenge.\n\nHow much are 1,10,100 BTCs worth today?\n\nAccording to Luminex, BRC-69, with the integration of Recursive Inscriptions, would help with the high demand for Bitcoin Ordinals while avoiding any case of transaction delay.\n\nSince the introduction, other Ordinals inscriptions besides texts, audio, or applications have emerged. This has also resulted in the total daily Inscriptions reaching the highest since 7 May. According to Dune Analytics, the total number of Inscription minted on 9 July was 385,920."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzExL2V0aGVyZXVtLWJsb2NrY2hhaW4tZ2FtZS1waWthbW9vbi1yYWlzZXMtMy02LW1pbGxpb24tZmluYWwtaWNvLXBoYXNlLXNlbGxpbmctb3V0LWZhc3Qv0gF7aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDcvMTEvZXRoZXJldW0tYmxvY2tjaGFpbi1nYW1lLXBpa2Ftb29uLXJhaXNlcy0zLTYtbWlsbGlvbi1maW5hbC1pY28tcGhhc2Utc2VsbGluZy1vdXQtZmFzdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Blockchain Game Pikamoon Raises $3.6 Million, Final ICO Phase Selling Out Fast - The Daily Hodl",
        "content": "July 11, 2023 – Dubai, United Arab Emirates\n\nPikamoon, an emerging Ethereum blockchain game, has raised $3.6 million in its ongoing ICO to bring more value to the Ethereum ecosystem and revolutionize the blockchain gaming space.\n\nPikamoon would launch the world’s most immersive metaverse game and a first-of-its-kind earning model that allows players to withdraw their in-game rewards directly to their wallet or bank account without the need for a third party.\n\nPikamoon focuses on becoming the most realistic metaverse game where players can get a 360-degree experience of the growing virtual space through unparalleled gameplay, stunning visuals and innovative DeFi features.\n\nDrawing inspiration from legendary games like Fortnite, Pokemon and FIFA, the Ethereum game has leaped forward and is prepared to blend NFTs, video gaming and metaverse entertainment perfectly.\n\nThe Pikamoon game is built on Unity, the world’s most advanced game development technology, to create the stunning visuals and architecture needed to give players a truly immersive experience.\n\nAdditionally, Pikamoon is built across two blockchains – Ethereum and MultiversX (formerly Elrond).\n\nWhile Ethereum provides scalability, MultiversX complements it by providing efficiency and ensuring the game is environmentally friendly by reducing carbon emissions generated by transactions.\n\nThis dual blockchain feature ensures that the Pikamoon ecosystem can cater to legions of gamers without any lag.\n\nGaming enthusiasts and smart investors are convinced Pikamoon is the future of gaming, and this is evident in how fast phase one and phase two of the ICO sold out.\n\nIn the first phase, one PIKA sold for $0.0002, which increased to $0.0004 in the second phase, and now in the third and last phase, one PIKA is selling for $0.0006 and selling out faster.\n\nNotable partners of this Ethereum-based game include future-thinking Web 3.0 brands such as Ethereum, Transak, Cryptonews.com, Kevuru Games and MultiversX.\n\nThis line-up of industry leaders further reinforces the credibility of the project, reaffirming the fact that the team is committed to building the best of the best gaming projects.\n\nPikamoon offers investors the opportunity to enter what is strategically seen as a huge market of the metaverse and gaming on the Ethereum blockchain.\n\nA core feature of the PIKA token is its deflationary nature.\n\nWhenever a sell or transfer transaction occurs in the Pikamoon ecosystem, 0.5% of the tokens involved in the transaction are burned forever, translating into more profits for long-term investors.\n\nThe much talked about presale, which is still on, uses Ethereum as its base currency, becoming the new favorite of the Ethereum community.\n\nThis seamless integration with Ethereum not only simplifies the investment process for eager investors but also strengthens the overall Ethereum ecosystem.\n\nAbout Pikamoon\n\nPikamoon makes metaverse gameplay exciting and rewarding for players of all age groups.\n\nThe Pikamoon’s metaverse, the Pikaverse, offers players endless opportunities to explore, battle, trade and earn a living within the game.\n\nIt operates on two blockchains, Ethereum and MultiversX, ensuring smooth and glitch-free gameplay for every player.\n\nSimilarly, Pikamoon’s unique earning model allows players to easily monetize gameplay, solidifying its place as one of the best metaverse games on the market.\n\nFind out more about Pikamoon (PIKA) at the links below.\n\nWebsite | Buy PIKA | Twitter | Telegram\n\nContact\n\nNick Evans, founder of Pikamoon"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS93aGF0LWFyZS1ldGhzY3JpcHRpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "What Are Ethscriptions? A Beginner's Guide - Unchained - Unchained",
        "content": "Ethscriptions provide a new way to create image-based NFTs on the Ethereum blockchain, taking inspiration from the emergence of Bitcoin Ordinals.\n\nThe rise of Bitcoin Ordinals in January 2023 has presented Ethereum and Solana-based projects with serious competition. Ethscriptions draw inspiration from Ordinals but are built on the Ethereum blockchain. In this article, we’ll explore how Ethscriptions work and differ from traditional Ethereum NFTs.\n\nWhat Are Ethscriptions?\n\nEthscriptions (Ethereum Inscriptions) are digital artifacts onto the Ethereum blockchain, enabling a new type of on-chain NFT on Ethereum through the inscription of image data.\n\nWhile NFTs use the ERC-721 protocol that utilizes smart contracts, Ethscriptions rely on transaction calldata (the data contained in an Ethereum transaction). Creators ensure the immutability of each asset through a uniform resource identifier (URI) within the data. The URI helps ensure the lack of identical content in prior or current blocks.\n\nHow Do Ethscriptions Work?\n\nEthscriptions allow users to inscribe non-financial data on the Ethereum blockchain. According to the creator, the protocol ensures cheaper costs and a more decentralized approach than smart contract storage.\n\nThree critical rules guide the workings of Ethscriptions:\n\nThe input data of a successful Ethereum transaction must comprise a valid data URI that is unique.\n\nA valid Ethscription transfer requires the sender to be its owner and the Ethereum transaction to contain a valid Ethscription transaction hash in its input data.\n\nThe URI’s uniqueness requires the content not to match the content of an Ethscription from a previous block or a transaction in the same block.\n\nA key feature of Ethscriptions is the 96KB file requirement for a single asset. According to the creator, Tom Lehman, Ethscriptions can only store images currently. However, there are plans to advance beyond images and include other file formats.\n\nHow Are Ethscriptions Created?\n\nThere are four steps in creating an Ethscription:\n\nEnsure your chosen image is 96KB or smaller and convert it into a base64-encoded data URI. Various online tools offer this service. Using online tools such as Hexhero, convert the data URI to hex. In a 0 ETH transaction, add the hex data in the “hex data” field to the desired recipient. Wait a few moments for the information on the new owner to appear on the ethscriptions.com website. If it doesn’t, that means it’s duplicate content of data someone else had already ethscribed.\n\nOnce the process is complete, you can track the Ethscription on ethscriptions.com. Indexer platforms, such as Etherscan, also come in handy for users who find them convenient.\n\nHow Are Ethscriptions Different From (Traditional) Ethereum NFTs?\n\nThe storage mechanism is the most significant difference between Ethscriptions and traditional NFTs. Ethscriptions are stored on-chain, whereas traditional Ethereum-based NFTs store data off-chain.\n\nThe idea behind on-chain storage is that it saves on costs since there is no off-chain storage like in traditional NFTs.\n\nThe Ethscriptions protocol only reinterprets existing Ethereum data. The decentralized nature of that data implies that no party can control the usage through banning and granting permissions. For traditional NFTs, specific contracts store the data, creating the possibility of individual parties claiming control.\n\nWhen creating an Ethereum NFT, the creator links their file to the block. The NFTs value comes from the proof of ownership with the actual file stored off-chain. With Ethscriptions, calldata allows for on-chain information storage on the Ethereum network.\n\nHow Do Ethscriptions Compare To Bitcoin Ordinals?\n\nAt this point, you might be wondering how Ethscriptions compare to Bitcoin Ordinals, given some fundamental similarities.\n\nOrdinals support various file types, including games, images, music, and video. Ethscriptions only support images with indications that this may change in the future. The 4MB file capacity per Ordinal allows versatility, with Ethscriptions being limited to 96KB.\n\nStorage of Ethscriptions in the calldata field leaves them vulnerable to pruning via EIP-4444. The data pruning module proposes the purging of specific data that is more than a year old. For Ordinals, storage on the block header ensures security from any pruning.\n\nThe Bottom Line\n\nThe introduction of Ethscriptions in June 2023 shifts the conversation around NFT innovation back to the Ethereum network. With Ethereum boasting its position as the go-to NFT chain, a project that runs on the same principles as Bitcoin Ordinals may offer Ethereum a chance to maintain its leading position in the NFT market.\n\nWhether Ethscriptions have the staying power largely depends on the improvements the creator has hinted at. With file size and type limitations, concerns about utility and scalability linger."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZmluYW5jZWZlZWRzLmNvbS9jcnlwdG8tY29tLWxhdW5jaGVzLW9uLWNoYWluLXN0YWtpbmctZm9yLWV0aGVyZXVtLXNvbGFuYS1hbmQtcG9sa2Fkb3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Crypto.com launches on-chain staking for Ethereum, Solana, and Polkadot - FinanceFeeds",
        "content": "Crypto.com launches on-chain staking for Ethereum, Solana, and Polkadot\n\nSingapore-based cryptocurrency exchange Crypto.com has added support for on-chain staking, which allows clients in select markets to tap into rewards offered by certain types of cryptocurrencies running on proof-of-stake networks.\n\nStaking, the company explained, enables users to earn dividends or interest on their digital assets for validating transactions and also allows them to vote on changes in the blockchain. Users are rewarded for simply depositing and holding coins on Crypto.com App as they normally would.\n\nMoreover, users have the flexibility to stake or unstake their assets without being subjected to a mandatory lockup period. Initially, the Ethereum (ETH), Solana (SOL), and Polkadot (DOT) blockchains will be available for staking within the Crypto.com platform, with plans to include more protocols in the future.\n\nOn-chain staking is a process specific to Proof-of-Stake blockchains that involves staking cryptocurrency directly on the blockchain itself. Conversely, off-chain staking, also known as lending, does not require staking your crypto directly on the blockchain.\n\nThe key difference between on-chain and off-chain staking is that on-chain staking supports the network and is rewarded, while off-chain staking is purely financially motivated and does not have any technical purpose for the blockchain. Both types of staking carry their own risks, with off-chain staking being the riskiest since it occurs outside the blockchain.\n\nWe last reported on Crypto.com in June when it announced plans to discontinue its institutional exchange service for professional customers in the United States.\n\nThe Singapore-based cryptocurrency exchange cited a decline in demand, likely influenced by the current market conditions in the US, including the ongoing legal actions against prominent exchanges such as Binance and Coinbase.\n\nAccording to a statement from Crypto.com, the platform provided advance notice to its institutional users regarding the suspension of its institutional service. The exchange also stressed that its retail mobile application and platform will continue to operate as usual for users in the United States.\n\nFurthermore, Crypto.com continues to offer cryptocurrency derivatives trading that is regulated by the CFTC. Additionally, retail users have been assured that the UpDown Options product remains accessible in the United States.\n\nThe crypto exchange stated that it might consider reopening its institutional trading platform in the future if there is a shift in market conditions. However, it refrained from divulging further details regarding the specific changes that would need to resume operations."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbmdlZWsuY29tL3ZpdGFsaWstYnV0ZXJpbi1zYXlzLWJ0Yy1yZWFsbHktd2VpcmQtcG9saXRpY3MtaG9sZGluZy1iYWNrLWFkb3B0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Vitalik Buterin says BTC's 'really weird politics' holding back adoption - CoinGeek",
        "content": "Ethereum founder Vitalik Buterin believes BTC really needs to address its scaling limitations but the ‘laser-eye’ crowd won’t let that happen.\n\nLast week, Buterin participated in a nearly two-hour long Twitter Space, taking questions from Eric Wall and Udi Wertheimer, the self-identified ‘Taproot Wizards’ who recently started completely filling individual BTC blocks with large JPEGs to test the viability of the new Ordinals protocol.\n\nThis activity was hugely controversial in the BTC space, mainly because of the protocol’s notoriously constrained transaction capacity. One side viewed Ordinals as a sorely needed expansion beyond the protocol’s limited functionality as ‘digital gold,’ while purists complained about NFT transactions delaying pure payment transactions from making it into the next blocks on the chain.\n\nAsked by the hosts about this divide, Buterin said his own experience with Ethereum taught him that “doing things in consensus is hard … it’s a property of social systems in general.” Buterin likened it to congested city traffic woes, saying it’s easier to for a small team to create Uber than for multiple committees to figure out the best way to solve public transit.\n\nButerin lamented the fact that BTC has effectively merged its technical and cultural systems, resulting in “really weird politics holding it back.” Buterin believes “maximalism is crazy. Sometimes people in [BTC-land] say things that go way too extreme, crazy and factually incorrect and falsifiable six months later. I wasn’t really into being part of that.”\n\nButerin turned the tables on his hosts, asking what the top-five arguments would be if he were a BTC Core developer who proposed an expansion of BTC’s block-size to 32Mb. The hosts acknowledged there simply wasn’t the political will within BTC for such a step, saying “it will be the first thing people reject, just as an instinct.”\n\nLightning in a very small bottle with a stubborn cork\n\nThe hosts suggested there was a mindset within BTC to “fully exhaust” second-layer (L2) solutions before being forced to admit that increasing the main layer’s block-size is the only way forward. “That would be a big failure case for BTC culture.” The hosts added that BTC has effectively “tied itself to the Lightning Network mast,” with the BTC Core developers having “basically given up on main layer” tinkering.\n\nButerin said “the Lightning Network criticism that made the most sense to me was that it doesn’t do enough.” Citing the BTC main layer’s seven-transactions-per-second limit, Buterin said it would take 80 years to onboard the global population onto Lightning, and that’s without factoring in existing Lightning users looking to do other transactions like rebalancing.\n\nThe hosts added that “even medium-sized Lightning payments fail so frequently that they’re looking to use AI to find better ways to predict which payment routes will work and which will fail. When someone tells me they need AI to make a transaction, then I feel something architecturally is too complex.”\n\nEthereum has dealt with its own scaling issues—which can result in transaction fees occasionally soaring to punitive heights—by imposing an ever greater array of L2 solutions, including Plasma, various types of roll-ups and sharding, which splits Ethereum’s main layer into multiple parallel-processing chains.\n\nButerin suggested a similar Rube Goldberg scenario might alleviate BTC’s concerns, saying “you could stack these things on top of each other, make Lightning on top of Plasma, a system in which all three exist as payment options,” leaving it up to the system “to find automatically which one actually works.” (Nothing like trying to solve a problem by creating ever more attack vectors and potential points of failure.)\n\nThe hosts wondered if this would just be “turning BTC into Ethereum,” suggesting that this was BTC’s “plan all along: observe Ethereum, let them deal with the growth pains and if it works, we’ll write a [BTC improvement proposal] and see if it gets consensus.”\n\nNaturally, all this public shaming of Lightning’s numerous flaws didn’t sit well with Blockstream’s Adam Back, who tweeted that “we already told [Ethereum devs] things to avoid for security/complexity … in 2014 and they ignored us and did the opposite, so I’m not sure there’s that much to learn.”\n\nBear in mind that this is the same Back who has insisted for years that Lightning is perennially 18 months away from reaching critical mass. Despite Lightning’s original chest-thumping about eventually surpassing Visa and Mastercard in transaction volume, it remains a transaction cul-de-sac, in part because most BTC users bought their tokens as ‘digital gold,’ not the peer-to-peer electronic cash described in Bitcoin’s 2008 white paper.\n\nStill, Lightning’s recent adoption by the compliance-averse Binance exchange will no doubt boost transaction volume, although the purpose of those transactions will likely be exposed as criminal/fraudulent once the U.S. Department of Justice completes its ongoing probe of Binance’s shady dealings.\n\nProof of crime\n\nKeeping law enforcement in the dark re blockchain transactions was a key plank of Tornado Cash, Ethereum’s primary ‘mixing service’ that allowed users to obfuscate the origin of ETH tokens. The service was blacklisted last August by the U.S. Treasury Department, citing its use in aiding North Korea’s nuclear weapons program and its developers’ alleged ties to Russian security services.\n\nWell and Wertheimer suggested that both BTC and Ethereum were “very far today from achieving base-layer privacy” for users, although they fingered Ethereum as even less private, because of the network’s embrace of smart contracts.\n\nButerin admitted that other blockchains have far greater privacy benefits but these chains’ tokens “end up getting delisted from exchanges” under pressure from financial watchdogs. Buterin somewhat grandiosely suggested that both BTC and Ethereum are “too big to fail. We have weight and so we shouldn’t be afraid to throw that weight around to protect people’s privacy.”\n\nHowever, Buterin acknowledged that, despite the chains’ alleged ‘weight,’ achieving this goal would be “a tough political game, man.” He longed for a world in which governments and regulators “don’t ban the money, [instead] ban the things the money is being used for,” although he admitted that this cryptopian fantasy was a “very unrealistic longshot.”\n\nButerin offered a potential workaround that would permit coin-mixers to continue operating via a concept he called ‘proof of innocence.’ The general idea is that coins you funnel into a mixer could be distinguished from crime-connected coins by a “central party” who would be tasked with flagging coins/wallets of dubious character. This would “exclude large classes of bad people but still give backdoor-free actual privacy for everyone else.”\n\nButerin suggested Chainalysis and MetaMask as potentially filling these centralized coin-flagging roles, notably dodging any responsibility for the Ethereum Foundation. That’s a significant departure from 2016, when Buterin and the other major Ethereum developers intervened to hard-fork the network following the infamous hack of a decentralized (in name only) autonomous organization.\n\nNonetheless, Buterin bristled at the notion that Ethereum was considered “the intervention chain,” pointing out that other chains have occasionally taken steps to freeze or recover lost or stolen tokens.\n\nButerin further qualified his commitment to justice by noting that it would be up to chain users to decide whether or not they wanted to implement this ‘proof of innocence,’ and that there would be no “entrenched rules or authorities” on which to rely in times of need. Unless, of course, it’s the Foundation devs’ coins that are in need of rescue.\n\nThings change quickly\n\nThe discussion wrapped with Buterin claiming that BTC’s Ordinals flirtation was “starting to bring back a culture of actually doing things … some kind of organic return to builder culture” that was a “real pushback to the laser-eye movement.”\n\nOkay, but the BTC fundamentalists have fiercely resisted nearly every proposal to expand their one true faith beyond its current function-free ‘store of value’ state and there’s no guarantee that Ordinals will be able to shift that dial. And Buterin suggested there was “value” in BTC “making choices different from Ethereum so the two aren’t taken down by the same thing.”\n\nThat is, unless that ‘thing’ is regulatory authorities publicly acknowledging that both BTC and ETH are unregistered securities. The fact that current legal actions against U.S.-facing exchanges like Coinbase (NASDAQ: COIN) and Binance.US have yet to cite BTC or ETH as securities doesn’t rule out the possibility that more actions are in the pipeline.\n\nAs Buterin himself put it while describing the pace of change in the digital asset space, “things change quickly.” And depending on where you’re sitting, not always for the better.\n\nFollow CoinGeek’s Crypto Crime Cartel series, which delves into the stream of groups—from BitMEX to Binance, Bitcoin.com, Blockstream, ShapeShift, Coinbase, Ripple,\n\nEthereum, FTX and Tether—who have co-opted the digital asset revolution and turned the industry into a minefield for naïve (and even experienced) players in the market.\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hcy1jcnlwdG8tZ2lhbnRzLWxpa2UtZXRoZXJldW0tZXRoLWV4cGVyaWVuY2Utc3RlYWR5LWdyb3d0aC1pbnF1YmV0YS1xdWJlLWNvdWxkLWJyaW5nLTEwMHgtcm9pLXRvLWl0cy1pbnZlc3RvcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "As Crypto Giants Like Ethereum (ETH) Experience Steady Growth, InQubeta (QUBE) Could Bring 100X ROI to its ... - Analytics Insight",
        "content": "The world of crypto is witnessing remarkable growth, with Ethereum (ETH) leading the charge as one of the most prominent blockchain platforms.\n\n\n\nHowever, amidst this surge, a promising crypto brand called InQubeta (QUBE) is poised to offer investors an unprecedented opportunity for substantial returns on their investment. InQubeta stands out as the world’s first crypto crowdfunding platform, introducing fractional investment in AI startups through its native token, $QUBE.\n\nInQubeta: A Gateway to the Exciting World of AI Startups\n\nInQubeta is the first-ever crypto crowdfunding platform that lets people invest fractionally in AI startups using $QUBE tokens. The platform aims to transform the way AI startups raise funds and engage with their community.\n\nWith the power of blockchain technology and smart contracts, InQubeta’s NFT marketplace allows AI startups to raise funds and offer reward and equity-based NFTs. On the flip side, QUBE token holders can easily invest in projects they believe in, creating a unique ecosystem that benefits both parties. It’s win-win for all involved.\n\nThe platform is powered by QUBE, deflationary ERC20 tokens, and an investment opportunity that has sparked the interest of AI tech enthusiasts. With a 2% tax on all buy and sell transactions going to a burn wallet, they help increase the token’s value over time. In addition, QUBE has a 5% sell tax that goes straight into a dedicated reward pool, allowing investors to earn rewards by staking their tokens.\n\nAt InQubeta, they believe in the incredible potential of AI technology and crypto coming together to create something truly extraordinary. They also understand that traditional investment methods can be daunting and out of reach for many. That’s why they’ve created the QUBE token and InQubeta’s NFT marketplace – to make investing ideal, organized, and accessible to all. The transparent and secure investment ecosystem empowers the growth and success of AI technology startups.\n\nThe world of AI technology is a new and exploding market, and AI startups are at the forefront of this exciting movement, driving breakthroughs in machine learning, robotics, and beyond. Investing in these startups means becoming a part of their incredible journey, but it can be risky and intimidating, especially for those without Silicon Valley connections.\n\nThis is where InQubeta helps. By allowing fractional investment in AI startups using QUBE tokens, they’re bridging the gap between investors and startups. This means more opportunities for everyone to be a part of this technological advancement.\n\nEthereum (ETH): Pioneering the Crypto advancement\n\nWhen it comes to cryptocurrencies, Ethereum (ETH) stands tall as one of the giants that has been at the forefront of the crypto transformation. Its inventive features and robust infrastructure have positioned it as a leading platform for decentralized applications (dApps), smart contracts, and blockchain-based solutions.\n\nOne of Ethereum’s key contributions to the crypto landscape is its ability to support smart contracts. These self-executing contracts enable the automation and execution of agreements without the need for intermediaries.\n\n\n\nThis breakthrough technology has transformed various industries, including finance, supply chain management, gaming, and more. By providing developers with a versatile and secure platform, Ethereum has empowered them to create decentralized applications that offer transparency, coherency, and trust.\n\nConclusion\n\nIn conclusion, Ethereum has played a pioneering role in the crypto advancement, offering a robust platform for decentralized applications and smart contracts. InQubeta’s decision to build its investment ecosystem on Ethereum showcases the platform’s capabilities and highlights its significance in the crypto space.\n\n\n\nWith Ethereum’s secure infrastructure and unique features, InQubeta can provide a flawless and secure investment experience for its community. As Ethereum continues to evolve and expand, the future of InQubeta and Ethereum looks brighter than ever, promising exciting opportunities for investors and AI startups alike.\n\n\n\nVisit InQubeta Presale\n\n\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiJGh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vemtzeW5jLWVyYdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "zkSync Era deep dive: A solution for Ethereum's scalability conundrum? - OKX",
        "content": "Layer 2 solutions have emerged as a response to the scalability limitations of blockchain networks, particularly the Ethereum network. Layer 2 refers to a secondary framework built on the main blockchain that addresses scalability issues by processing transactions off-chain while maintaining the underlying blockchain's security and decentralization benefits.\n\nWhile layer 2 solutions come in various forms, they generally involve aggregating multiple transactions into a single transaction on the main blockchain. This helps reduce the overall load on the main chain and increases transaction throughput, resulting in faster and cheaper transactions.\n\nOne unique layer 2 solution is zkSync, which uses zero-knowledge proofs (zk-proofs) for enhanced scalability and privacy. zkSync allows for secure, trustless, and low-cost transactions by bundling multiple transactions and submitting them as proof on the Ethereum blockchain.\n\nBy leveraging zk-proofs, zkSync validates all transactions and keeps information private, while also significantly reducing the computational requirements and costs associated with on-chain transactions.\n\nIn February 2023, Matter Labs, the brains behind zkSync, rebranded, renaming zkSync 2.0 to zkSync Era and zkSync 1.0 to zkSync Lite. This strategic move aimed to more closely align their products. On the same day, zkSync announced the start of onboarding for registered projects onto the zkSync Era mainnet. The onboarding set the stage for the full mainnet launch. As expected, zkSync Era became available to all users on March 24, 2023, marking the first of many impactful launches related to zkEVM.\n\nOKX Wallet recently launched Cryptopedia, a unique Web3 project experience and learn-to-earn platform. We're working with several projects and partners to create learning quest sections that educate the community and give you the chance to earn exciting rewards.\n\nOur first themed event is based around zkSync Era. After you complete the quests around the zkSync Era, you can participate in an NFT lottery for every completed DApp interaction quest. Take your best shot, and have fun!\n\nzkSync Era: A tech revolution for Ethereum?\n\nAt its core, zkSync is a ZK rollup. What does that mean exactly? ZkSync is a trustless protocol that leverages cryptographic validity proofs to provide fast and cost-effective transactions on Ethereum. By moving most of the computation and data off-chain, zkSync achieves scalability without compromising security.\n\nOne of the most exciting aspects of zkSync is that it provides the same security level as Ethereum. How? All transactions on zkSync are proven on the Ethereum mainchain, meaning you can trust the system just as you'd trust Ethereum.\n\nBut zkSync isn't just about security and scalability. It's also designed to provide a familiar and seamless experience. With zkSync Era, the user interface is designed to resemble Ethereum, so you'll feel right at home.\n\nPlus, you can write and interact with smart contracts using Solidity or Vyper, just like you would on Ethereum. The best part? With zkSync Era, you can use the same clients compatible with other Ethereum Virtual Machine (EVM) chains, making it even more accessible.\n\nOther highlights of zkSync Era include:\n\nUnparalleled security: Experience the same level of security as the Ethereum mainnet without depending on any third parties. Rest assured that your transactions and assets are safeguarded with utmost trust and reliability.\n\nEmpowering smart contracts: Enjoy the freedom of permissionless EVM-compatible smart contracts on zkSync Era. Unleash your creativity and bring innovative ideas to life on this powerful platform.\n\nSeamless integration: Connect effortlessly to the broader blockchain ecosystem with zkSync Era's standard Web3 API. Interact with zkSync using the familiar tools and libraries you already know, simplifying integration.\n\nPreserving Ethereum's essence: Embrace zkSync Era while retaining the key features that made Ethereum successful. Smart contract composability remains intact, allowing you to combine and integrate contracts seamlessly.\n\nAccount abstraction: zkSync Era's groundbreaking account abstraction feature represents a major advancement in decentralized finance. The innovation opens up new possibilities, allowing you to manage and use your funds uniquely.\n\nZero-knowledge rollups enhancing Ethereum's ecosystem\n\nZero-knowledge rollups are a way to make Ethereum faster and cheaper by improving its scalability and transaction speed. Blockchains like Ethereum can be slow and expensive to use because every transaction needs to be verified by thousands of nodes in the network. However, layer 2 systems, specifically rollups, solve this problem.\n\nZero-knowledge rollups reduce Ethereum's workload by verifying transactions with minimal data. Instead of burdening the network with individual transactions, rollups bundle hundreds of transactions together as a single transaction. This bundled transaction is verified and added to Ethereum's public ledger, keeping the main network uncongested.\n\nThe reduced workload on Ethereum makes it faster and cheaper to use. When the network is not congested, the fees for transactions, known as gas fees, decrease significantly. This is important because, during high network traffic, such as during a bull cycle, Ethereum fees tend to rise.\n\nBy offloading transactions to layer 2 rollups, the Ethereum network remains less congested and more affordable for users.\n\nZero-knowledge rollups adopt a technique called zero-knowledge proof to accomplish their task. Zero-knowledge proof verifies the authenticity of the bundled transactions on a layer 2 network, such as ZK-Sync, by providing proof of validity.\n\nThis proof acts as a receipt, confirming transactions are genuine and can be added to Ethereum. Using minimal data in zero-knowledge cryptography ensures privacy and faster, less expensive transactions.\n\nZK-rollups rely on two smart contracts: the main and verifier contracts. These contracts operate on Ethereum and connect the layer 1 and layer 2 networks. The main contract stores the bundled transactions and determines the state of users' withdrawals and deposits. The verifier contract authenticates the transactions using zero-knowledge proof.\n\nThe actual execution of ZK-rollups occurs off-chain through a virtual machine specifically designed for rollups. This offloading process ensures that Ethereum's main network remains uncongested. The ZK virtual machine functions similarly to the EVM and runs the smart contracts that process the transactions.\n\nDespite executing off-chain, ZK-rollups still rely on Ethereum itself. After batching the transactions off-chain, ZK-rollups submit the transaction as a validity proof back to the layer 1 network, making sure Ethereum confirms the correctness of the updates.\n\nzkSync Era transaction speed\n\nAre you frustrated with slow Ethereum transactions and high fees? zkSync Era is here to help by taking scalability to a whole new level. While Ethereum can currently handle around 13 transactions per second (TPS), zkSync Era boasts an impressive peak load capacity of up to 2,000 TPS.\n\nSo, how does zkSync Era achieve this? By validating multiple transactions as a single transaction on the Ethereum network, it streamlines the process and reduces congestion. This means faster and more cost-effective transactions for you.\n\nzkSync: A path towards decentralized scalability?\n\nzkSync Era aims to achieve hyper-scalability while preserving the core values of Ethereum, including decentralization and trustlessness. It does this using zero-knowledge cryptography.\n\nOne of the key goals of the zkSync Era is to make decentralized applications (DApps) more accessible and affordable, regardless of the scale. By using hyper-bridges, assets can be transferred from one hyperchain to another at the cost of a normal transfer.\n\nLike hyperlinks taking you from one web page to another with a single click, hyperbridges streamline asset transfers across different hyperchains without needing separate transactions on each layer. This asynchronous communication ensures trustless and eventual delivery of assets and messages between hyperchains.\n\nHyperchains are instances of zkEVM running in parallel and settling on the Ethereum mainnet (layer 1). They can be developed and deployed by anyone, providing permissionless innovation.\n\nHowever, to maintain trust and interoperability, each hyperchain must be powered by the same zkEVM engine as the main zkSync layer 2 instance. This means all ZKP (Zero-Knowledge Proof) circuits remain identical, inheriting the same security as Ethereum's layer 1.\n\nThe modular approach allows developers to customize their hyperchains, except for the zkEVM core, which guarantees consistency and avoids additional trust assumptions.\n\nThrough the zkSync Era, Ethereum's scalability is enhanced while staying true to its core values. The protocol expands Ethereum's security and values, such as trustlessness, permissionless access, censorship resistance, resiliency through decentralization, and community ownership.\n\nBy employing zero-knowledge cryptography, zkSync Era aims to increase personal sovereignty and drive mass adoption of cryptocurrencies.\n\nSpotlight on zkSync Era projects: SyncSwap and Mute.io\n\nThere are two zkSync Era projects to highlight, but it's essential to do your own research before participating.\n\nSyncSwap\n\nSyncSwap is a decentralized exchange (DEX) that operates on the zkSync Era, using zero-knowledge technology for enhanced security. It aims to provide a wider audience with easy-to-use, cost-effective decentralized finance (DeFi) solutions.\n\nThe vision for SyncSwap is to create a user-friendly DeFi hub that offers advanced features and accessibility, even to those unfamiliar with Ethereum and blockchain technology. It aims to achieve this on the scaled Ethereum network.\n\nAt its core, the SyncSwap protocol serves as an exchange layer and liquidity solution for the zkSync Era network. It is an open-source and composable protocol, enabling seamless integration with the zkSync ecosystem.\n\nSyncSwap aligns with zkSync's mission of accelerating the mass adoption of cryptocurrencies and personal sovereignty. It is a community-driven project designed with user-friendly features in mind. The objective is to bring the benefits of scaled Ethereum, zero-knowledge technology, and Web3 to more people, fostering the mass adoption of decentralized finance.\n\nOne of the notable features of SyncSwap is its dynamic fee structure. Trading fees on the SyncSwap DEX can be adjusted flexibly based on market conditions or the community's preferences. There are four key facets to the fee system:\n\nVariable fees: This feature allows fees to be customized separately for different pool models and specific liquidity pools. Each pool model has a default fee, and liquidity pools inherit the default fee unless explicitly set otherwise. Variable fees apply to both trading fees and protocol fees.\n\nDirectional fees: SyncSwap enables liquidity pools to have different trading fee tiers for buying and selling tokens. For example, a liquidity pool for XXX/USD may have a lower fee for buying XXX but a higher fee for selling XXX. This flexibility can be determined based on community and token issuer preferences.\n\nFee discount: Similar to centralized exchanges (CEXs), SyncSwap supports fee discounts. Token stakers can receive fee discounts based on different tiers. The more tokens staked, the higher the discount ratio.\n\nFee delegate: This innovative feature allows the trading fees of specific pools to be delegated to partner ecosystem projects democratically. External sources, such as other ecosystem projects, can control a specific pools' fees by delegating the decision-making power for trading fees.\n\nSyncSwap adopts an Auto Market Maker (AMM) as the core mechanism for pool models and liquidity pools. Instead of relying on Oracle prices, AMMs determine prices algorithmically.\n\nCurrently, SyncSwap offers two types of pools:\n\nClassic pool: This pool is designed for general-purpose trading and employs the constant product algorithm (x * y = k), also known as x*y=k. The Classic Pool can support a wide range of assets and maintains a balanced reserve of 50% for each token. However, it is not optimized for stable assets.\n\nStable pool: The Stable Pool is optimized explicitly for trading stablecoins like USDC/USDT. It uses a hybrid algorithm combining the constant product and constant sum concepts. When the price is pegged around 1:1, the pool functions as a constant sum AMM for highly efficient trading (x + y = k). When the price deviates from the peg, it reverts to the constant product AMM (x * y = k). This pool model is ideal for assets tightly pegged around a 1:1 ratio.\n\nAdditionally, SyncSwap plans to introduce a Concentrated Pool, which dynamically adjusts prices instead of maintaining a fixed 1:1 ratio. This pool will concentrate liquidity around the market price, providing a tighter spread and improved efficiency.\n\nMute.io\n\nMute.io is a DeFi platform that serves as a liquidity hub for protocols built on zkSync, a layer 2 scaling solution for Ethereum. Its main product, Mute Switch, is a DEX incorporating AMM with limit orders, a farming platform, and a Bond platform. Mute.io aims to provide liquidity solutions for protocols on zkSync, allowing them to incentivize liquidity for their specific use cases.\n\nThe team behind Mute.io has extensive experience with zero-knowledge protocols in the crypto space. They've previously developed the first Zero-Knowledge Atomic Swap protocol between Bitcoin and UTXO-based chains and innovative work on Zerocoin and Sigma addressing schemes and transactions.\n\nWith their expertise, the team is focused on building Mute.io and their Mute DAO initiative to become a leading player in the zkDeFi (zero-knowledge decentralized finance) space. They leverage zkSync's technology to drive long-term value for the Mute community.\n\nThe Mute Switch, Mute.io's flagship DApp, is a DeFi platform built on zkRollup technology, specifically zkSync v2. It offers various features such as investing, trading, earning yields, and participating in bonds. The platform allows users to capitalize on the security of Ethereum without high gas fees, thanks to the scalability provided by zkRollup.\n\nOne of the key components of Mute Switch is its liquidity pools. The platform is designed to have dynamic setups for liquidity pools, accommodating both stable and normal AMM curves. Stable pools are meant for assets that should be traded within a tight price range, while normal pools are suitable for non-correlated and volatile assets.\n\nThe Mute Switch automatically finds the best-priced trades regardless of the pool type. Each pool operates independently, and fees for each pool are separate from others.\n\nStable pools are optimized for high volume trades with capital-efficient swaps. The trade price in stable pools maintains a tight spread once the pricing is set upon pool creation. On the other hand, normal pools apply a generic AMM formula and are suitable for most trading pairs.\n\nMute Switch also allows for the creation of pools with different liquidity provider (LP) fees, ranging from 0.01% to 10% for normal pools and 2% for stable pools. These fees can only be changed through the LP governance system, which requires an LP provider (or a delegated provider) with over 50% vote weight to make the change.\n\nTo prevent manipulation, there is a 0.1% fee on total votes when changing pool fees, discouraging flash loans from altering fee structures without losses.\n\nGovernance plays a vital role in the Mute Switch ecosystem. The platform features a built-in LP governance and delegation system, enabling complex protocols to be built on top of it. LP providers can set the fee for their pools upon creation, and the LP governance system allows for fee changes based on votes tied to LP token supply balances.\n\nLP providers can also delegate their votes to other providers, allowing for increased pool weight and lobbying for delegates. This design concentrates liquidity within one pool and enables dynamic fee adjustments through governance.\n\nThe Mute Switch has two types of fees: dynamic fees (a percentage of LP pool fees) and fixed fees (a fixed percentage of the overall trade). If the protocol's fixed fee is set and is larger than the LP pool fees, LP providers will not earn fees for trades. The fixed fees are primarily used during the early stages until the LP total value locked (TVL) grows to a sustainable level.\n\nThe final word\n\nThe zkSync Era ecosystem shows promises of bringing improvements to the Ethereum network. As a ZK rollup, zkSync uses cryptographic validity proofs to achieve fast and cost-effective transactions on Ethereum while maintaining trustlessness and security.\n\nOne of the remarkable aspects of zkSync is its ability to provide the same level of security as Ethereum. All transactions on zkSync are proven on the Ethereum mainchain, providing high trust and reliability.\n\nAlongside security and scalability, zkSync Era delivers a familiar and simple user experience. Its user interface resembles Ethereum, making it easy for users to transition and feel at home.\n\nMoreover, developers can write and interact with smart contracts using Solidity or Vyper, just as they would on Ethereum. Compatibility with existing EVM clients further enhances accessibility.\n\nSome notable highlights of zkSync Era include unparalleled security, empowering smart contracts, seamless integration with the broader blockchain ecosystem, preservation of Ethereum's key features, and the introduction of groundbreaking account abstraction.\n\nWith zkSync Era, users can experience a secure and reliable platform for executing transactions and managing their assets, while developers can leverage its capabilities to build innovative and permissionless applications.\n\nNow you have a deeper understanding of zkSync Era, why not try out our learn-to-earn Cryptopedia platform? By flexing your brain, you'll have a chance to earn some exciting rewards.\n\nDisclaimer:\n\nTHIS ARTICLE IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY. IT IS NOT INTENDED TO PROVIDE ANY INVESTMENT, TAX, OR LEGAL ADVICE, NOR SHOULD IT BE CONSIDERED AN OFFER TO PURCHASE OR SELL OR HOLD DIGITAL ASSETS. DIGITAL ASSET HOLDINGS, INCLUDING STABLECOINS, INVOLVE A HIGH DEGREE OF RISK, CAN FLUCTUATE GREATLY, AND CAN EVEN BECOME WORTHLESS. YOU SHOULD CAREFULLY CONSIDER WHETHER TRADING OR HOLDING DIGITAL ASSETS IS SUITABLE FOR YOU IN LIGHT OF YOUR FINANCIAL CONDITION. PLEASE CONSULT YOUR LEGAL/TAX/INVESTMENT PROFESSIONAL FOR QUESTIONS ABOUT YOUR SPECIFIC CIRCUMSTANCES."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90cm9uLXZzLWFyYml0cnVtLWEtY29tcGFyYXRpdmUtYW5hbHlzaXMtb2YtZXRoZXJldW1zLWxheWVyLTItc29sdXRpb25zLXdpdGgtYmVhc3RzLWNvaW4tYXMtYS1wcm9taXNpbmctYWRkaXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Tron vs. Arbitrum: A Comparative Analysis of Ethereum's Layer-2 Solutions, with BEASTS Coin as a Promising Addition - Analytics Insight",
        "content": "From Tron to Arbitrum: Exploring Ethereum’s Layer-2 Rivals & The Rise Of BEASTS Coin\n\nIn the vast and ever-evolving world of cryptocurrencies, two prominent players, Tron (TRX) and Arbitrum (ARB), are pushing the boundaries of blockchain technology. Tron has established itself as a powerhouse with its lightning-fast transaction speeds and impressive Total Value Locked (TVL), while Arbitrum has emerged as a rising star, promising to enhance Ethereum’s scalability.\n\nAmidst this landscape, a new contender, BEASTS Coin (BEASTS), enters the stage, ready to shake up the meme coin market. Let’s embark on a thought-provoking journey as we explore the potential outcomes and implications of these intriguing developments.\n\nTron: Revolutionizing the Web\n\nLed by the visionary Justin Sun, Tron (TRX) aims to decentralize the web by leveraging blockchain technology. It has gained recognition for its ability to handle high transaction volumes and provides efficient decentralized applications (dApps) and smart contracts.\n\nTron’s strengths lie in its fast transaction speeds and low fees, attracting users seeking seamless and cost-effective blockchain solutions. With an established user base and robust infrastructure, Tron has cemented its position as a significant player in the crypto space.\n\nArbitrum: Scaling Ethereum’s Potential\n\nArbitrum, developed by Offchain Labs, introduces a Layer-2 solution that addresses Ethereum’s scalability challenges. By leveraging optimistic rollup technology, Arbitrum aims to reduce congestion on the Ethereum network, enabling faster and more cost-efficient transactions.\n\nWhat sets Arbitrum apart is its compatibility with Ethereum’s existing infrastructure, making it an attractive option for developers and users looking for seamless integration. While still in its early stages, Arbitrum shows great promise in enhancing the Ethereum ecosystem.\n\nTron vs. Arbitrum – Who Will Rule Ethereum’s Layer-2 Kingdom?\n\nCan Tron maintain its stronghold as Ethereum’s Layer-2 solution, or will Arbitrum steal the spotlight in the Ethereum narrative? The answer lies within the dynamic nature of the crypto space. Tron has amassed a significant user base and boasts impressive transaction speeds, positioning itself as a formidable competitor. However, Arbitrum’s compatibility with Ethereum’s existing infrastructure provides a compelling advantage, attracting developers and users seeking seamless integration.\n\nThe outcome will depend on various factors, including technological advancements, user preferences, and market dynamics. Tron’s established presence and robust infrastructure offer stability, while Arbitrum’s potential to enhance Ethereum’s scalability presents an intriguing alternative. Both platforms possess unique strengths and cater to different needs, fueling a healthy competition that drives innovation and pushes the boundaries of blockchain technology.\n\nIn this ever-evolving landscape, predicting the outcome with certainty is a challenge. The crypto space is known for its surprises and twists, where underdogs can rise and incumbents can stumble. The ultimate victor will be determined by the market’s response, user adoption, and the ability to deliver on the promises made. Only time will reveal the destiny of Tron and Arbitrum in the Ethereum layer-2 realm.\n\nThe Rise of BEASTS Coin: Embracing the Meme Coin Market\n\nAmidst the innovations brought by Tron and Arbitrum, we encounter the emergence of BEASTS Coin (BEASTS), a fresh and exciting meme coin that aims to disrupt the market. BEASTS Coin sets itself apart by introducing decentralization and locked liquidity, ensuring transparency and integrity. Led by a diverse group of influential individuals within the web3 community, BEASTS Coin emphasizes trust, open communication, and financial accountability.\n\nBEASTS Coin introduces a highly enticing referral scheme that rewards participants generously. By generating their unique referral codes, users can invite others to join the BEASTS Coin community. When someone makes a purchase using a referral code, the code owner receives an immediate 20% deposit bonus in popular cryptocurrencies like ETH, BNB, or USDT.\n\nBut that’s not all – the investor using the referral code also enjoys a 20% bonus in BEAST tokens, enhancing their potential gains. This win-win scenario fosters a vibrant and engaged community, offering an opportunity for investors and enthusiasts to maximize their returns while spreading the word about BEASTS Coin’s exciting journey.\n\nLayer-2 Breakthrough…\n\nA Thrilling Crypto Frontier Unfolds As we traverse the vast landscape of altcoins, Tron and Arbitrum showcase their respective strengths in revolutionizing blockchain technology.\n\nWhile Tron’s established user base and efficient infrastructure position it as a significant player, Arbitrum’s compatibility with Ethereum presents new possibilities for seamless integration. Meanwhile, BEASTS Coin adds an exciting twist to the meme coin market, offering the potential for profit generation alongside support for charitable causes.\n\nBEASTS Coin:\n\n\n\nWebsite: https://cagedbeasts.com\n\nTwitter: https://twitter.com/CAGED_BEASTS\n\nTelegram: https://t.me/CAGEDBEASTS\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZmluYW5jaWFsaXQubmV0L25ld3MvYmxvY2tjaGFpbi9jb25zZW5zeXMtbGF1bmNoZXMtbGluZWEtbWFpbm5ldC11bmxvY2tpbmctbmV3LWxldmVsLXVzZXItZXhwZXJpZW5jZS1hbmQtc2NhbGFiaWxpdHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Consensys Launches Linea Mainnet, Unlocking a New Level of User Experience and Scalability for Ethereum - Financial IT",
        "content": "Consensys Launches Linea Mainnet, Unlocking a New Level of User Experience and Scalability for Ethereum\n\nToday, the leading web3 software technology company, Consensys, announces the mainnet alpha release of its highly anticipated Linea zkEVM rollup network. The launch follows a successful testnet phase that saw 5.5 million unique wallets commit over 47 million transactions in three months, making Linea one of the largest and fastest-growing projects on Goerli. This week Linea will be onboarding its testnet partners, before opening the network broadly during EthCC.\n\nLinea Mainnet Alpha Ushers in the Age of the Builder and New Era of Scalability\n\nThis milestone accelerates the onset of the age of the builder, where everyone is a participant and builder in a global network generating value for themselves and their communities. The mainnet alpha release brings us a step closer to a new era of scalability with a range of innovative features and integrations aimed at reducing friction for developers and enhancing onboarding. DeFi applications are choosing Linea for its fast finality, capital-efficient bridge and inherited Ethereum security. NFTs, gaming and social apps benefit from the zkEVMs EVM Equivalence, low gas fees, high throughput and low latency.\n\nWith an ecosystem of over 100 protocols, developer tools and dapps from all around the globe, Linea empowers users, builders and developers to start building on day one. Built on five years of extensive research, it delivers faster throughput and transaction fees up to 15 times lower than Ethereum Layer 1, thanks to its recursion-friendly, lattice-based prover. The mainnet alpha release introduces several upgrades that include a new outer-proof system and batch conflation, as well as a dynamic fee mechanism to manage changes in L1 gas fees.\n\nJoe Lubin, Founder and CEO of Consensys, expresses excitement about Linea’s mainnet alpha launch stating that: “The convergence of various blockchain networks around Ethereum as a data and security layer accelerates the establishment of web3 and decentralized protocols as a new decentralized trust foundation for the world’s systems. With the Merge to Proof of Stake and the broad traction of the rollup-centric roadmap, Ethereum L2s are set to play a crucial role in making great advances in scalability and usability. Linea’s zkEVM is the catalyst we've been waiting for to empower developers to shape the future of decentralized applications and encourage the builder in everyone. The next chapter of web3 will be written on Ethereum L2s, and Linea is poised to become a major trusted L2 execution environment for scalable dapps.”\n\nLinea used its testnet to not only harden its zkEVM but also attract and learn from a thriving ecosystem of partners who are forming the early pillars of the network’s ecosystem. As partners begin migrating to the alpha release, they will unlock a constellation of new scalable dapps from gaming and identity to decentralized social networks and NFTs.\n\n“The launch of Linea's mainnet alpha is a major milestone on the path to delivering scalable and user-friendly blockchain solutions. Developers are building new apps leveraging Linea’s fast finality, seamless withdrawals and Ethereum-level security, while full EVM equivalence has enabled seamless adoption by many of web3’s most popular apps,” said Nicolas Liochon, Global Product Lead for Linea.\n\nLinea Gains Out-of-the-Box Integrations with Leading Web3 Players, Amplifying Network Adoption and Growth\n\nLinea’s zkEVM is fully EVM bytecode compatible and offers out-of-the-box integrations with MetaMask, the world’s leading self-custody web3 wallet, and popular Consensys developer tools, including Infura, Diligence and Hyperledger Besu.\n\nMetaMask today announced plans to deepen Linea integrations with MetaMask Portfolio. MetaMask Portfolio is a decentralized web app to which users can connect their MetaMask wallet to access a range of curated web3 features including Portfolio View, Buy, Swap, Bridge and Stake. Over the next few weeks, MetaMask will offer Linea to users of its popular Bridge, Swap and Buy features, which aggregate providers vetted for offering safe and reliable web3 experiences.\n\nConsensys Announces Linea Ecosystem Investment Alliance, Rewards Early Testers and Supports Future Use Cases\n\nTo accelerate the growth of the Linea ecosystem, Consensys is launching the Linea Ecosystem Investment Alliance (EIA), an investment syndicate of over 30+ leading venture capital firms to support builders through validated interest, dedicated capital and a clear pipeline to the network. Interested builders are encouraged to apply HERE.\n\nSpeaking on the launch of the Linea EIA, Michael Camarda, Director of Corporate Development at Consensys, said: “Raising capital as an entrepreneur can be difficult even in the best of times. Through the EIA, Consensys and our partners are excited to support projects looking to redefine DeFi, gaming, NFTs, social and more. Our message to builders is, we want to hear from you and we’re here to support.”\n\nPlus during EthCC in Paris next week, Consensys will recognize the efforts of hundreds of thousands of testers who participated in its Linea Voyage program and prepared the network for mainnet alpha. On July 18th, the Linea team will unveil the first major NFT collection on the network, with an open mint for all Voyage participants and a limited edition drop recognizing top Voyage testers. Together with rich bug bounties and hackathon prizes of up to $50,000 for teams, Consensys is excited to celebrate and recognize the early community building and testing on Linea. Come build with us."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC93aGVuLWlzLXRoZS1uZXh0LWJ1bGwtcnVuLWFyZS13ZS1oYXZpbmctYS1kZWZpLXN1bW1lci1ob3ctd2lsbC1iaXRjb2luLWFwZW1heC1hbmQtZXRoZXJldW0tYmUtYWZmZWN0ZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "When Is the Next Bull Run? Are We Having a Defi Summer? How Will Bitcoin, Apemax, and Ethereum Be Affected - Analytics Insight",
        "content": "As we enter the summer of 2023, anticipation for an upcoming crypto bull run is growing among enthusiasts. In this informative article, we delve into the timing of this anticipated event and its implications for coins like Bitcoin, ApeMax, Ethereum, and others in the crypto market. With meticulous market analysis and research, this comprehensive guide equips you with valuable insights to be more well-informed in the dynamic world of cryptocurrencies.\n\nApeMax, an exciting newcomer in the crypto space, has been generating significant excitement with its presale launch. With innovative tokenomics and a focus on staking, ApeMax provides an interesting opportunity for users to earn rewards and actively join a fun and young ecosystem’s growth. This guide explores the specifics of ApeMax’s presale, highlighting its unique features, advantages, and potential within the broader market.\n\nBy the end of this guide, you’ll be well-prepared to navigate the thrilling realm of crypto presales and the potential bull market. However, it’s crucial to approach these opportunities with caution and a comprehensive understanding of the risks involved, ensuring you only spend what you can afford to lose.\n\nWhen is the crypto Bull Run?\n\nThe timing of the next bull run in the crypto market remains a topic of speculation, with various opinions suggesting potential time frames ranging from summer 2023 to the end of 2024. The introduction of Central Bank Digital Currencies (CBDCs) in the Chinese market is considered a potential catalyst for market activity. However, it’s important to approach predictions about the bull run with caution, as accurately predicting its timing is extremely challenging.\n\nAttempting to predict the future and the exact timing of a bull run is a daunting task. While experts and analysts provide their insights, it’s crucial to exercise skepticism and not solely rely on these predictions. The crypto market is dynamic and influenced by numerous factors, making it unpredictable. A prudent approach involves conducting thorough research, staying informed about market trends, and making informed decisions based on individual risk tolerance and goals.\n\nWhat is the ApeMax presale?\n\nThe ApeMax presale is an enticing opportunity for cryptocurrency enthusiasts to acquire ApeMax coins at great presale prices. By participating in this top new crypto presale, individuals can secure ApeMax tokens at advantageous rates. Early adopters also have the advantage of accessing additional benefits, such as Early Birds Loot Boxes, which provide discounts of up to 50%. These incentives make the presale phase of ApeMax an exciting opportunity for purchasing the coin.\n\nWhat will happen in the next crypto Bull Run?\n\nDuring a bull run in the cryptocurrency market, we often witness a surge in network activity and increased interest in DEFI technology. This optimistic environment gives rise to new projects, including NFTs and altcoins, offering a wider range of opportunities and applications. As the bull run gains momentum, the crypto industry receives more media coverage and attention, leading to greater adoption of cryptocurrencies and blockchain technology.\n\nHowever, it is important to remember that the dynamics of a bull run are unpredictable. While historical trends can provide insights, accurately predicting specific outcomes or which cryptocurrencies will experience significant price increases is impossible. Therefore, it is crucial to approach claims about specific coins or guaranteed gains during the bull run with caution. Instead, individuals should focus on exploring the innovative developments within the crypto space while maintaining a balanced perspective on the potential risks and rewards of cryptocurrency investments.\n\nConclusion\n\nIn summary, the anticipation surrounding the next bull run in the cryptocurrency market has generated excitement and speculation. While potential timelines have been proposed, the exact timing remains uncertain. During a bull run, we can expect increased network activity, the emergence of new projects like NFTs and altcoins, and greater adoption of cryptocurrencies.\n\nHowever, it is crucial to approach claims about guaranteed gains and specific price predictions with caution, given the market’s inherent volatility and unpredictability.\n\nAmidst this dynamic landscape, opportunities like the ApeMax presale offer discounted token acquisition, leveraging the potential of early adoption. It is important to conduct thorough research, exercise skepticism, and make informed decisions and conduct independent research before participating in the crypto market.\n\nPlease note that ApeMax’s availability may be restricted in certain countries, and the full list of blocked countries is detailed on the ApeMax website.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWNvbW11bml0eS13aXRoLTk0LWhpc3RvcmljYWwtYWNjdXJhY3ktc2V0cy1ldGhlcmV1bS1wcmljZS1mb3ItanVseS0zMS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "Crypto community with 94% historical accuracy sets Ethereum price for July 31 - Finbold - Finance in Bold",
        "content": "Disclaimer: The CoinMarketCap cryptocurrency community price estimate is based only on the votes of its users. Estimates do not guarantee end-of-month prices.\n\nThe price of Ethereum (ETH) is rising in unison with the price of Bitcoin (BTC), slowly gaining ground as the wider market prepares for the reading of the Consumer Price Index (CPI) that is slated for July 12.\n\nIf there is a consistent rise in purchasing pressure, Ethereum may be able to break over the immediate barrier located around $1,960 before coming up against the level of $2,000 in the near term.\n\nAs for the second largest digital asset by market caps value for the end of the month, Finbold turned to the price estimates of the crypto community at CoinMarketCap, which has a 93.54% historical accuracy on predicting the end-of-month price for ETH based on estimates made over the last six months.\n\nNotably, based on 501 votes as of July 11, Ethereum is estimated to trade at an average price of $1,848, a marginal 1.24% decrease from the cryptocurrency’s current price.\n\nPrice estimates for ETH. Source: CoinMarketCap\n\nThe most recent prediction for end of June made by the community had an accuracy rating of over 93%. Meanwhile, Finbold analyzed the predictions by the machine learning algorithm over on the crypto monitoring and prediction platform PricePredictions which expects Ethereum to be $2,105 on July 31, 2023.\n\nETH price dynamics\n\nThe price of Ethereum has climbed by 62% over the course of the last year, outperforming 87% of the top 100 crypto assets over the same time period. This includes outperforming Bitcoin over this time frame.\n\nAt the moment, the price of ETH is trading at $1,875, an increase of 0.42% and an additional 4.21% in the last week, giving it a market worth of $225 billion.\n\nETH seven-day price chart. Source: Finbold\n\nIn addition to this, Ethereum’s price is now trading above its 200-day simple moving average, and there have been 16 green days in the last 30 days, representing a 53% increase.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5iaXRjb2luc2Vuc3VzLmNvbS9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWRhaWx5LTEwLWp1bHktZXRoLXNldHRpbmctdXAtZm9yLW9uZS1sYXN0LWR1bXAtYmVmb3JlLXRoaXMtbWFzc2l2ZS1yYWxseS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (10-July): ETH Setting Up For One Last Dump Before This Massive Rally! - Bitcoinsensus",
        "content": "Ethereum price prediction from a previous analysis Urgent! The ETH Bulls Must Defend This Key Support At All Cost Or Else!\n\nIn our previous ETH analysis Urgent! The ETH Bulls Must Defend This Key Support At All Cost Or Else! we talked about the major support zone the ETH price was currently testing in the 4-hour timeframe.\n\nThis $1,755 key support is very important to Ethereum because if the bulls can defend this zone, there is a very high probability that we might see a massive rally in the Altcoin price in the coming days.\n\nHowever, before this rally plays out, there is a very high chance we might see one last sell-off for the Ethereum price play out soon.\n\nIn this ETH analysis, we will be talking about the Head and Sholders Pattern we are currently tracking in the 4-hour timeframe.\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nETH Head and Shoulders Pattern\n\nWe believe the Ethereum price is setting up for one last dump in value, deep into the $1,755 support zone.\n\nThe key pattern we are currently tracking for a move like this is the Bearish Head and Shoulders Pattern that is forming right now in the ETH 4-hour timeframe.\n\nWe can already see the Left Shoulder already completed, and in the coming days, we will be looking out for the formation of the right shoulder.\n\nOnce this Head and Shoulders Pattern is completed, we can expect to see Ethereum sell off aggressively deeper into this $1,755 support zone. How deep the ETH price will sell off into this zone will depend on how well the bulls defend this key support region.\n\nETH Setting Up For One Last Dump Before This Massive Rally! Watch this key pattern forming right now in the 4-hour timeframe\n\nFinal Verdict!\n\nThe ETH price is testing a major support zone in the 4-hour timeframe. However, the Altcoin is looking like it might be setting up to make one last price dump deep into this support zone before running out of steam.\n\nThe key pattern that supports this bearish bias is the ETH Head and Shoulders Pattern currently forming in the 4-hour timeframe.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDcvMTAvbmV3LWNyeXB0by1oYWNrLWV0aGVyZXVtLW9wdGltaXNtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "New crypto hack on Ethereum and Optimism - The Cryptonomist",
        "content": "A new crypto hack was discovered today: this time the DeFi Arcadia Finance protocol on the Ethereum and Optimism chains was successfully attacked.\n\nPeckShieldAlert broke the news on Twitter, reporting that the hack netted the attackers about $455,000.\n\nThe hack was also later confirmed by the operators of Arcadia Finance themselves.\n\nWe are aware of a potential exploit in our protocol.\n\nWe have paused the contracts and are investigating the root-cause with security experts as we speak. More info will follow as it comes available. — Arcadia Finance (@ArcadiaFi) July 10, 2023\n\nAfter a few hours, they reported that they were able to make contact with the hacker, and that they were working together with their security partners, law enforcement, and the community to solve the problem as best they could in an effort to recover funds for protocol users.\n\nThe bug that led to the crypto hack\n\nAccording to PeckShield, the hack to Arcadia Finance’s smart contract was due to untrusted input validation being exploited to drain funds from darcWETH and darcUSDC reserves.\n\ndarcWETH and darcUSDC are two wrapped Arcadia Finance tokens, so they each hold reserves.\n\nTheoretically for every darcWETH token there should be a WETH token in the reserves, and for every darcUSDC token there should be a USDC token.\n\nEvidently the smart contract that manages the reserves of these two wrapped tokens had a bug that attackers were able to exploit.\n\nFurthermore, PeckShield discovered a lack of re-entry protection in these smart contracts, which in this way allowed the instant settlement to bypass the internal state check of the reserves manager.\n\nIn addition, there is a lack of reentrancy protection, which allows for the instant liquidation to bypass the internal vault health check. pic.twitter.com/Am58ZOvgQJ — PeckShield Inc. (@peckshield) July 10, 2023\n\nTo be fair, Arcadia later refuted this reconstruction, but was unable to provide an alternative explanation.\n\nMost of the funds were stolen from Optimism’s chain, and they were then moved thanks to Tornado Cash in order to lose track of them.\n\nThe Arcadia Finance protocol\n\nArcadia Finance is a DeFi protocol on Ethereum and Optimism that does not have its own native token.\n\nBefore the hack, its TVL was about $600,000, while after the theft it plummeted to $145,000.\n\nThis is a non-custodial protocol that allows for the composition of on-chain cross-margin accounts.\n\nUsers of these margin accounts can collateralize entire wallets, access up to 10 times more capital than their initial collateral value, and use the deposited collateral and borrowed capital to interact with any other DeFi protocol in a permissionless manner.\n\nLenders provide liquidity to Arcadia’s loan pools, earning passive returns.\n\nBeing non-custodial, the hackers were not able to steal funds directly from users’ wallets, but rather from those used as reserves for issuing the wrapped tokens darcWETH and darcUSDC.\n\nThus, no darcWETH or darcUSDC were stolen directly from users’ wallets, but WETH and USDC were stolen from the wallets on which the reserves were held. This means that there is no longer 1 WETH for every darcWETH issued, and 1 USDC for every darcUSDC issued, so effectively users still have all their wrapped tokens but can no longer redeem them.\n\nThe problem with wrapped tokens\n\nIt is often said that non-custodial wallets are safe, if stored and maintained properly, but sometimes the risks lie upstream.\n\nIndeed, for any non-custodial wallet there is little difference in storing original tokens, such as USDC, or wrapped tokens, such as darcUSDC.\n\nHowever, wrapped tokens have an additional layer of risk. In fact, the custody of the collateral is not done by the users themselves on their non-custodial wallets, but by the managers of the wrapped tokens.\n\nIn fact, this is not very different from a custodial wallet, since custody of the collateral is in some ways equivalent to custody of the wrapped tokens.\n\nTherefore even if the wallets of users holding wrapped tokens are not breached, in the event of a breach of the reserve wallets, users can still lose their funds, simply because while they still have the wrapped tokens they can no longer redeem them. Their actual value in this way effectively goes to zero.\n\nThis actually applies to USDC as well, because while it is not a wrapped token it is a collateralized stablecoin, meaning it has reserves as collateral, which is held and managed by a single entity (Circle).\n\nThe impact on crypto markets of the hack that occurred\n\nThe impact on the crypto markets of this hack has been almost zero, if we exclude the wrapped tokens darcWETH and darcUSDC.\n\nOP, which is Optimism’s native token, has also not suffered serious losses, so much so that its price today moved in line with those of many other similar tokens.\n\nThen again, $455,000 is not that much, and by now the crypto markets have developed a habit of this kind of theft on DeFi protocols.\n\nMoreover, DeFi is not about Bitcoin, and right now it is Bitcoin that is dictating the trend in the crypto markets.\n\nSituations like this one only serve to provide a better understanding of the risks involved when using DeFi protocols, especially when they are hidden as in the case of wrapped tokens.\n\nSomething much worse had happened in March, when it was discovered that Circle held a significant portion of USDC reserves on the failed Silvergate bank, so much so that for a moment it was feared that the stablecoin might lose its peg with the dollar.\n\nBut then the US central bank intervened directly to cover all the shortfalls, thereby giving all Silvergate depositors back all their funds."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNy8xMS9ob3ctbXVjaC1ldGhlcmV1bS1wdW5rcy10YWtlLWRvd24td2lsbC1kYW1hZ2UtZXRoc2NyaXB0aW9ucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jul 2023 07:00:00 GMT",
        "title": "How Much Ethereum Punks “Take Down” Will Damage Ethscriptions? - The Coin Republic",
        "content": "With the emergence of Ethscriptions in June this year, the crypto space assumed another innovation unfolding down the road. Before the Ethereum-based inscriptions protocol could pick up pace, it met with a bump. The protocol saw the minting of a significant collection within hours of launch: Ethereum Punks. And now the Ethscribed punks on Ethereum are gone from the official website.\n\nCo-founder and former CEO of music website Genius.com, Tom Lehman created Ethscriptions. The protocol was released on June 17, 2023, and became the talk of the town within a matter of hours. Ethereum Punks was among the first collection over the network having 10,000 Ethscribed punks.\n\nThe idea of inscriptions already gained a lot of heat following the launch of Bitcoin Ordinals in January this year. However, many argued, including the Ethscriptions creator, that the concept of Ethscriptions has been around since 2016, but became a formal protocol with the website and “indexer” after Middlemarch, popular name of Lehman, developed them.\n\nAkin to Bitcoin Ordinals Inscriptions, Ethscriptions allow users to inscribe “non-financial data.” Where it was to put data on individual Satoshi (SAT) on Bitcoin, Etheruem-based inscriptions use transaction call data. They are considered NFTs without NFTs.\n\nThe official website offers easy creation of Ethscriptions and suggests step-by-step procedures. Though it is meant to allow sharing of data, it is currently limited to sharing only images. As the website noted, an image size of less than 90 kilobytes (KB) needs to be converted to a Base 64-encoded data URI using specific tools. Then the converted data is sent to hex using tools again for further conversion.\n\nEthscriptions uses 0 ETH transactions which could be sent to someone or to self. Following the steps mentioned over the website, one can easily mint an Ethscribed token within a minute, says some creators.\n\nAs mentioned earlier, Ethereum Punks were the earliest and significant collections on the platform. The collection has a similar appearance to the popular NFT collection from Yuga Labs, CryptoPunks.\n\nRecently Ethscriptions creator Middlemarch announced the taking down of the official website of its prominent collection Ethereum Punks. He cited the reason for CryptoPunks creator Yuga Labs to request for the same.\n\nAt the request of Yuga Labs, the owner of CryptoPunks, I am taking down the Ethereum Punks website, removing all Ethereum Punks images from https://t.co/ZcR9HKlexS, and deleting my Tweets that reference Ethereum Punks, including my Tweet introducing the Ethscriptions Protocol. — Middlemarch (@dumbnamenumbers) July 11, 2023\n\nIn addition to the website takedown, the Ethereum Punks images were also erased from Etherescriptions.com website. Middlemarch even deleted his Tweets related to the Ethereum inscribed collection.\n\nsource – ethereumpunks.net\n\nEarlier the website used to have the content as the image shows above. But now the address shows the error as the image shows below.\n\nsource – ethereumpunks.net\n\nUntil the time of writing, there is no official comment or confirmation from Yuga Labs about the instance. The Ethereum Punks deleting announcement was the last message from Middlemarch until now."
    }
]