[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy93aGF0LWlzLWV0aC1nYXRlLWV0aGVyZXVtLXByZWZlcmVudGlhbC10cmVhdG1lbnQtcmVndWxhdG9ycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "What is ETH Gate and Did Ethereum get Preferential Treatment from U.S. Regulators? - CCN.com",
        "content": "Key Takeaways\n\nThe SEC contended that it should classify all cryptocurrencies except Bitcoin and Ether as Securities.\n\nHowever, some individuals have raised questions regarding how ETH became recognized as a unique case.\n\nBold claims from a former Ethereum advisor reignited allegations of preferential treatment by the SEC toward Ethereum.\n\nThe US Securities and Exchange Commission (SEC) has spent years pursuing its lawsuit against Ripple Labs for allegedly selling unregistered securities in the form of XRP.\n\nHowever, the commission has made no such attempt to crack down on Ethereum, leading to allegations it received preferential treatment.\n\nIn the latest twist in the “ETH Gate” saga, Steven Nerayoff, an early adviser to the Ethereum network, has revisited how the SEC responded to Ethereum’s Initial Coin Offering (ICO), and the lasting implications of that response.\n\nNerayoff Adds Fuel to the ETH Gate Fire\n\nSteven Nerayoff, an early Ethereum advisor, has questioned the SEC’s cryptocurrency approach, highlighting the agency’s focus on XRP and similar tokens as securities while leaving bitcoin and ether untouched.\n\nSpecifically, Neyaroff casts doubt on how the SEC came to the conclusion that Ethereum is “sufficiently decentralized” to avoid scrutiny, a classification from former SEC director William Hinman.\n\nLowell Ness has been @a16zcrypto ’s attorney from the first day. Clayton tells Hinman to reach out to Lubin who is represented by Clayton’s firm. December 13, 2017 Lubin meets Hinman. The next month Clayton tells Chris Dixon to ✍️ a memo 📝 of what they want SEC to do. Ness writes… — John E Deaton (@JohnEDeaton1) September 16, 2023\n\n“How exactly did @ethereum even satisfy this magical agency pixie dust?” he asked, speculating that Hinman and his SEC colleagues may have even intentionally misconstrued the network’s decentralized nature.\n\nIn response to Nerayoff’s remarks, John Deaton, a crypto lawyer known for advocating XRP, hinted at close interactions between senior SEC staff and Ethereum’s founders, suggesting a potentially questionable working relationship.\n\nIn a video shared to X (formerly Twitter), comments attributed to Ethereum co-founder Joseph Lubin could even imply some kind of back-room deal with the SEC.\n\n“We are big friends and fans of the SEC,” Lubin purportedly stated. He would go on to state that the SEC wouldn’t find any other tokens except Bitcoin and Ether sufficiently decentralized, even dropping Hinman’s name as his source, the video alleges.\n\nETHGATE: We were right\n\nAttorney @JohnEDeaton1 Crypto Law Website, 81 Factual Event TIMELINE 2013-2023 curated by #XRP Sleuth Research. {Decentralized Justice}🙏\n\n👉https://t.co/imdoLomjDk\n\nOG @XRPArmyNews1 brought that TIMELINE \"alive\" narrated by 18. 🙏Listen to the Complete… pic.twitter.com/iTQeH4IcVH — 🌸Crypto Eri 🪝Carpe Diem (@sentosumosaba) September 18, 2023\n\nIn another tweet on Sunday, September 17, Deaton added, “I’ve always said that one day we will get the full truth. Today is one day closer.”\n\nI’m getting a lot of messages asking what this means. Im speculating a bit, but, as a lawyer, I suspect that @StevenNerayoff ’s desire to tell what he knows after what he’s been through may have gotten ahead of the legal advice he was likely receiving. His lawyer, @mascotto89 , who… https://t.co/u9BQiG0jAh — John E Deaton (@JohnEDeaton1) September 17, 2023\n\nThe Ethereum Decentralization Debate\n\nCentral to ETH Gate allegations is the charge that, contrary to Hinman’s classification, the Ethereum ICO actually displayed far less evidence of decentralization than other ICOs.\n\nFor example, an analysis of ETH transactions at the time of its ICO concludes that a significant proportion of the earliest ETH went to a small number of investors.\n\n“Most of the Ether sold in the 2014 token pre-sale in exchange for Bitcoin may have been paid out to one person or, more likely, a handful of close associates working in concert,” the report observes.\n\nTo this day, the identity of Ethereum whales that hold a significant volume of ICO funds remains shrouded in mystery.\n\nWith ETH Gate casting doubt on the network’s decentralization, allegations of Chinese control continue to circulate.\n\nA complete guess, 66.6%. I found 12 Genesis Block Wallets today, alone where they ended up with the majority of the ETH from. Its so hard to know. They were invested in over 500 projects by EOY 2021, and in many cases got the pre-ICO tokens prior to both ETH/altcoin price waves. — TruthLabs 🫡 (@BoringSleuth) June 28, 2023\n\nSpecifically, critics have speculated that through Ethereum ICO investors such as Wanxiang Blockchain Labs, the Chinese Communist Party is Ethereum’s biggest whale, secretly controlling as much as a third of the ETH supply."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdS50b2RheS9ndWlkZXMvZXRoZXJldW0tZ29lcmxpLXRlc3RuZXQtanVzdC1yZXBsYWNlZC1ieS1ob2xlc2t5LXdoYXQteW91LW5lZWQtdG8ta25vd9IBYWh0dHBzOi8vdS50b2RheS9ndWlkZXMvZXRoZXJldW0tZ29lcmxpLXRlc3RuZXQtanVzdC1yZXBsYWNlZC1ieS1ob2xlc2t5LXdoYXQteW91LW5lZWQtdG8ta25vdz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Goerli Testnet Just Replaced by Holesky: What You Need to Know - U.Today",
        "content": "Advertisement\n\nEthereum (ETH), the second largest blockchain and the most mainstream smart contracts platform, has accomplished a major milestone. The history of its most important testnet, Goerli, has come to an end.\n\nHere's why Ethereans decided to sunset Goerli in 2023 and what is special about Holesky, Goerli's hotly anticipated successor.\n\nEthereum replaces Goerli testnet by Holesky: Basics\n\nToday, Sept. 15, 2023, on the first anniversary of The Merge activation in mainnet, Ethereum (ETH) has ceased supporting its testnet, Goerli. Developers need to migrate toward Holesky, the first PoS-by-design testnet.\n\nHolesky (or Holešky, Holešovice) is an Ethereum (ETH) test network (testnet) activated on Sept. 15, 2023.\n\nHolesky replaces Goerli as a staking, infrastructure and protocol-developer testnet.\n\nFor dApp stress tests, smart contract experiments and other EVM-related procedures, developers should refer to Sepolia testnet.\n\nHolesky is the first-ever Ethereum (ETH) testnet launched on the top of the proof-of-stake (PoS) consensus.\n\nHolesky launches to address scalability issues of Goerli: the shortage of goETH testnet tokens, the low number of validators and so on.\n\nHolesky will have 1.46 million validators, which is almost twice as much as Ethereum (ETH) mainnet has.\n\nNew testnet support will be abandoned by 2028.\n\nAs such, with Holesky, Ethereum (ETH) developers will have a new sandbox environment in which to experiment with various features of the protocol.\n\nWhat is testnet?\n\nIn cryptocurrencies, a test network or testnet is an experimental distributed network that emulates the processes that happen on a cryptocurrency network, but with no real value transferred. Just as with main networks (mainnets), accounts can send tokens to each other, while validators confirm them by adding new blocks to the chain.\n\nUsers of a testnet get \"play\" tokens from faucets, a free-to-use mechanism created by Ethereum (ETH) enthusiasts. For instance, some faucets distribute free testnet Ethers for sharing Twitter accounts, connecting to Discord and so on.\n\nSuch networks are necessary for stress testing dApps without the risks of losing money. Every modern DeFi or wallet undergoes a testnet phase before mainnet deployment.\n\nRopsten, Rinkeby, Goerli, Sepolia: Crucial Ethereum (ETH) testnets\n\nEthereum (ETH), the second largest blockchain and the first programmable network (with smart contracts), used a couple of testnets during its eight-year history. Launched in 2016, Ropsten replaced Morden, the first-ever testnet for proof-of-work (PoW) Ethereum. Ropsten was a testbed of all major Ethereum (ETH) dApps we are using and the first testnet to be \"merged\" when Ethereum (ETH) tested the PoW-to-PoS transition.\n\nIn 2017, Ethereans launched Rinkeby, a testnet on the top of the Clique proof-of-authority (PoA) consensus mechanism, which is a modified version of proof of stake (Pos). It only interacted with the Go Ethereum (Geth) version of client software.\n\nAt the ETH Berlin Conference in 2018, Ethereum (ETH) developers unveiled Goerli, a multiclient Ethereum (ETH) testnet. It means that it could work with the versions of Ethereum (ETH) software written in various programming languages.\n\nFinally, in 2021, Ethereum Sepolia testnet was launched with an unlimited number of testnet tokens.\n\nIntroducing Holesky, very special Ethereum (ETH) testnet\n\nActivated today, Ethereum's Holesky is an attempt by core developers to address all the issues that somehow affected previous testnets and their usage by teams.\n\nHolesky: Highlights\n\nHolesky is the first long-standing public Ethereum testnet that is \"merged from genesis\"; this means that Holesky never had a proof-of-work (PoW) version. Not unlike its predecessors, Holesky draws its name from the Nádraží Holešovice subway station in Prague.\n\nHolesky works together with Sepolia; while the first testnet is designed to be a technical platform for experiments with staking designs, the general infrastructure of Ethereum (ETH) and protocol-level development ideas, Sepolia is a platform for testing smart contracts, decentralized applications and all EVM functionalities. Like all mainstream crypto testnets, Holesky will have its own set of validators, block explorer and ecosystem of faucets.\n\nHolesky: What was wrong with Goerli?\n\nHolesky goes live to replace Goerli, a major Ethereum (ETH) testnet since 2018. Holesky is designed to help Ethereum (ETH) testers avoid the disadvantages of earlier testnets. For instance, Ethereum Goerli users faced a shortage of GoETH test tokens and were even forced to purchase them for money, which is in contradiction of Ethereum (ETH) testnet rules. Holesky is unlikely to face similar issues.\n\nHolesky public testnet genesis file has been generated, and merged into main branch of https://t.co/JWKySOSvtU.\n\nLaunch date Sept/15, 2023, 14:00 UTC\n\nChain ID-17000 (zip code of Holešovice).\n\nThe genesis will have 1,460,000 validators. Our biggest public network to date. — Barnabas Busa (@BarnabasBusa) August 22, 2023\n\nAlso, it will have a previously unimaginable number of validators: 1.46 million entities will protect network integrity. This is more than Ethereum’s mainnet (700,000) and Goerli (512,000) have in all. This, in turn, will allow developers to mimic \"real-world\" Ethereum (ETH) operations closely.\n\nPer the creators of Holesky, they allocated over two billion HoleskyETH by the launch in order to make this quantity sufficient for all developers.\n\nHolesky: Specifications\n\nHolesky goes live with a set of specifications just like any other EVM ecosystem blockchain. Here's what future Holesky users should consider before getting connected to the network."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMTcvaXRzLWJlZW4tb25lLXllYXItc2luY2UtdGhlLWV0aGVyZXVtLW1lcmdlLWhlcmVzLWhvdy10aGUtbmV0d29yay1pcy1kb2luZy1vbi1pdHMtZ29hbHMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "It's been one year since the Ethereum merge. Here's how the network is doing on its goals. - CNBC",
        "content": "Despite ether's recent price action, the network has been thriving since the \"merge\" – and could just be getting started. A year ago Ethereum underwent a major technical transition that was meant to improve its security in an energy efficient way that many hoped would lead to higher price s and, separately, would open a new yield-generating opportunity for investors. The price of ether is down over the past six months, but it's still up 8% over the past year and nearly 35% year-to-date, according to Coin Metrics. With the crypto market as a whole suffering from low liquidity and volatility amid regulatory uncertainty, the incremental regulatory and technical developments in Bitcoin and Ethereum haven't been enough to push prices to new highs after the banking crisis-fueled rally earlier this year. Still, market participants are seeing and feeling the success of the Ethereum merge. \"ETH's transition to proof-of-stake created a more composable, cheaper and less energy-intensive network that currently yields stakers about 4%,\" said Matthew Sigel, head of digital assets research at VanEck. \"But with T-bills yielding 5% and the U.S. regulatory onslaught ongoing, investor and developer interest has been insufficient to pump the token much in recent months.\" \"Ethereum daily gas fees are languishing near 2023 lows and daily trading activity at 2-year lows,\" he added. \"We look forward to Ethereum protocol upgrade EIP-4844 in Q4, which should enable much cheaper transactions on Ethereum-compatible layer 2s and potentially catalyze wider adoption of stablecoin and loyalty applications.\" Here's how Ethereum is doing on some of its post-merge goals: Yields Ether's staking reward reference rate was 5.854% per annum on Sept. 15, 2022, according to Ethereum data provider Beaconchain. It spiked to about 8% after the fall of FTX and in May following JPMorgan's takeover of First Republic. Yields were last at 3.9%. The yield changes based on participation levels in staking and Ethereum's process of validating transactions. It is expected to fall as more stakers come onto the network. (For more on staking check out our guide here .) More validators The amount of staked ether has been rising steadily over the past year with investors keen to earn extra yield on their assets. While the merge gave investors the opportunity to earn yield – by locking up their funds – this year's Shanghai, also known as Shapella, upgrade gave them the ability to unstake their funds. The Shanghai upgrade was widely seen as an event that would bring more liquidity to Ethereum. \"While the market has been really stagnant across digital assets, staking has been one of the few areas that have seen constant growth in this period,\" said Andrew Ballinger, head of staking solutions at Canadian investment firm 3iQ. \"About a week after [Shanghai] happened in April, we started to see assets coming into the network to be staked outpacing assets being withdrawn,\" he added. \"That really demonstrates the immediate interest from people who were sitting on the sidelines, who hadn't been staking until this point to start doing so.\" The percentage of ether supply being staked has risen from 11.99% on Sept. 15, 2022, to 20.46% on Aug. 30 of this year. Burning fees and decreasing supply Ethereum has a mechanism programmed in to regulate the network's notoriously high transaction fees, called gas fees, by \"burning\" them. Everyday new ether is emitted into the market and if demand doesn't match the supply level, the price goes down. After the merge, investors expected there to be less supply in the market, and if demand stayed constant, that the price would rise. Since the merge, the supply of ether has fallen 0.248%, according to data provider Ultrasound Money . About 681,449 ETH have been issued while 981,427 have been burned. \"The ETH supply is now kind of dependent on the usage – the more usage, the more ETH that's burned,\" said Maria Shen, a general partner at Electric Capital. \"Right before the merge, the supply of ETH peaked, and now we are on a flat, deflationary supply curve.\" \"Whenever someone does a transaction, they pay a fee,\" she explained. \"Part of that fee is now being burned, and whenever you do that, the supply of Ethereum shrinks. So you have effectively a deflationary supply of ETH\" – meaning the supply over time will begin to decline as opposed to increase, which is historically what it's always done – \"as long as people keep using the network.\" The next upgrade The merge was just the first step in a series of upgrades that are planned to make improvements on Ethereum. The blockchain is the most popular among developers who are keen to build a new world of applications on this technology. But, in recent years, it has been hampered by its famously slow transaction times and egregious transaction fees. Those specific problems gave rise to alternatives like Solana and Cardano. If Ethereum can speed up transactions and solve the fee structure, it could become more competitive, Shen said. \"Those no longer become differentiating factors,\" she said. \"So those ecosystems will be forced to figure out other differentiating factors. \"A lot of them do scale in different ways with different types of trade offs, so that's one consideration: what are the trade offs that users are willing to make?\" she added. \"It's not just enough for something to be fast, you need something to be able to do it on the chain.\""
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1nYWlucy1ub3Qtb3Zlci0xNjUwL9IBTGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1nYWlucy1ub3Qtb3Zlci0xNjUwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Gains are Slowing but Not Likely Over – Here’s Why - NewsBTC",
        "content": "Ethereum price faced resistance near $1,650 against the US Dollar. ETH corrected gains but the $1,620 support might spark another upward movement.\n\nEthereum is eyeing a key upside break above the $1,650 resistance.\n\nThe price is trading above $1,625 and the 100-hourly Simple Moving Average.\n\nThere was a break above a connecting bearish trend line with resistance near $1,625 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bullish momentum if there is a close above $1,650 and $1,670.\n\nEthereum Price Aims Higher\n\nEthereum’s price was able to climb further above the $1,620 resistance. However, ETH struggled to gain strength for a move above the $1,650 resistance, like Bitcoin.\n\nThere was a downside correction below the $1,630 level. The price even spiked below $1,620 but the downsides were limited. A low was formed near $1,613 and the price is now moving higher. There was a break above the $1,620 level and the 23.6% Fib retracement level of the recent decline from the $1,652 swing high to the $1,613 low.\n\nBesides, there was a break above a connecting bearish trend line with resistance near $1,625 on the hourly chart of ETH/USD. Ether is now trading above $1,625 and the 100-hourly Simple Moving Average.\n\nOn the upside, the price might face resistance near the $1,635 level or the 76.4% Fib retracement level of the recent decline from the $1,652 swing high to the $1,613 low at $1,642. The next resistance is near the $1,650 level. A close above the $1,650 resistance might send the price toward the $1,670 resistance.\n\nSource: ETHUSD on TradingView.com\n\nIf there is a close above $1,670, the price might start a strong increase. The next major hurdle is near the $1,750 level. A close above the $1,750 level might send Ethereum further higher toward $1,880.\n\nAnother Drop in ETH?\n\nIf Ethereum fails to clear the $1,650 resistance, it could start another decline. Initial support on the downside is near the $1,620 level.\n\nThe first key support is close to $1,610. The next key support is $1,585. A downside break below $1,585 might start another bearish wave. In the stated case, the price could even decline toward the $1,520 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $1,610\n\nMajor Resistance Level – $1,650\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ncmF5c2NhbGUtaW52ZXN0bWVudHMtYW5ub3VuY2VzLWFiYW5kb25tZW50LXJpZ2h0cy0xMjMwMDAwNDIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Grayscale Investments® Announces Abandonment of Rights to Ethereum Proof of Work Tokens - Yahoo Finance",
        "content": "Grayscale Investments\n\nSTAMFORD, Conn., Sept. 18, 2023 (GLOBE NEWSWIRE) -- Grayscale Investments® , the world’s largest digital currency asset manager and the sponsor of Grayscale Ethereum Trust ( OTCQX: ETHE ) and manager of Grayscale Digital Large Cap Fund ( OTCQX: GDLC ) (each a “Product” and collectively, the “Products”), announced today that on behalf of the record date shareholders of each Product as of the close of business on September 26, 2022 (the \"Record Date Shareholders\"), it has irrevocably abandoned all of the rights to Ethereum Proof of Work tokens (“ETHPoW”) distributed to such Record Date Shareholders.\n\nEach Product previously announced that Grayscale Investments, LLC (“Grayscale”) would be appointed as agent on behalf of each Product’s Record Date Shareholders. After thorough review, Grayscale has, in consultation with the Products’ service providers, determined that the Products’ custodian does not support the ETHPoW tokens, nor have trading venues with meaningful liquidity developed for the ETHPoW tokens. As such, it is not possible to exercise the rights to acquire and sell the ETHPoW tokens, and on behalf of the Record Date Shareholders, Grayscale is abandoning the rights to these assets.\n\nFor the avoidance of doubt, Grayscale is acting only in its capacity as agent of the Record Date Shareholders with respect to the foregoing, and not in its capacity as sponsor or manager of the Products.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of regulated, and future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest digital currency asset manager. Investors, advisors, and allocators turn to Grayscale for single asset, diversified, and thematic exposure. Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC). For more information, please follow @Grayscale or visit grayscale.com .\n\nStory continues\n\nPress Contact\n\nJennifer Rosenthal\n\npress@grayscale.com\n\n\n\n"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWhvbGVza3ktdGVzdG5ldC1sYXVuY2gtZmxvcHMtcmVsYXVuY2gtaXMtZXhwZWN0ZWQtaW4tY29taW5nLXdlZWtzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Holesky testnet launch flops, relaunch is expected in coming weeks - CryptoSlate",
        "content": "Ethereum’s Holesky testnet experienced an error that will require another launch attempt, community members and developers said on Sept. 15.\n\nEthereum researcher Diederik Loerakker, aka protolambda, wrote that one developer entered certain data in the wrong part of the network’s genesis files. He said:\n\n“Someone put 0x686f77206d7563682069732074686520666973683f (“how much is the fish?”) as extra-data in the EL Holesky genesis.json, and not in the CL genesis.ssz.”\n\nThis resulted in a misconfiguration that caused the testnet to fail to launch, according to Loerakker. He added that other fork parameters are “rumored to mismatch” but did not provide further details of those issues.\n\nLoerakker added that Holesky did not experience issues related to network size, something that was considered before launch. In August, developers determined that Holesky could handle 1.4 million validators. In response, they introduced a large amount of Holesky ETH, amounting to 1.6 billion tokens.\n\nRelaunch expected in coming weeks\n\nThough developers will soon relaunch Holesky, the exact date of that event is still unclear. Nethermind, an Ethereum research and engineering group, said developers will relaunch Holesky in one week. That seemingly places the next attempt on Sept. 22.\n\nMeanwhile, Ethereum contributor and Sigma Prime member Michael Sproul has suggested in a GitHub pull request that Holesky should be relaunched on Sept. 28. That date is nearly two weeks later than the network’s first launch attempt.\n\nRegardless of delays, the issue does not affect Ethereum’s mainnet, which is responsible for transactions with real value. Beaconchain.eth acknowledged this, writing that the Holesky launch “didn’t go as expected, but that’s what testnets are here for.”\n\nAccording to Ethereum documentation, Holesky will supersede Ethereum’s Goerli testnet. Both testnets are intended for testing related to staking, validating, and core network upgrades. Another testnet called Sepolia, which is aimed at independent developers who want to test their own Ethereum-based apps, also exists.\n\nEach of these testnets relies on special testnet ETH that is freely available through faucets and which generally has no real market value."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tdW52ZWlscy1uZXctdGVzdG5ldC1jYWxsZWQtaG9sZXNreS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum unveils new testnet called 'Holešky' - crypto.news",
        "content": "Ethereum’s developers launched a new testnet that’s being touted as a promising alternative to the aging Goerli network.\n\nDubbed “Holešky,” the testnet was designed to facilitate staking, infrastructure, and protocol development.\n\nEthereum preps for future\n\nEthereum, the blockchain powering the world’s second-largest crypto by market cap, is continually evolving to meet the demands of a rapidly growing blockchain ecosystem. To keep pace with the ambitious roadmap, Ethereum developers have introduced a new testnet called “Holešky.”\n\nAt the core of the Holešky testnet launch is its unprecedented initial supply of 1.6 billion Holešky testnet Ether (HETH). This substantial allocation is provided to validators on Holešky’s inaugural day to kick start network operations.\n\nIn contrast, it’s worth noting that this token amount is ten times more than what the main Ethereum network currently holds. Ethereum developer Tim Beiko justified this allocation, stating that “devnets [are] regularly using 10B supply.” This move ensures that Holešky has ample resources to support the development and testing of new features.\n\nYou might also like: Ethereum developers on Goerli now have to pay for test ETH\n\nRetiring the Goerli testnet\n\nBefore Holešky emerged, the Goerli testnet was Ethereum’s primary platform for testing new staking, infrastructure, and protocol developments.\n\nConcerns began to surface in October when developers voiced their reservations about Goerli’s insufficient supply of Goerli ETH to meet testing requirements. Holešky’s generous HETH supply is expected to address this issue effectively.\n\nIn tandem with Holešky’s launch, Ethereum developers have been encouraging application developers to migrate from Goerli to Sepolia, a move that leaves only protocol developers on the old network. The Ethereum team has set its sights on deprecating Goerli in January 2024. Following deprecation, Goerli will receive another year of maintenance before being permanently shut down, as outlined in official documentation.\n\nThe advent of Holešky marks a critical juncture in Ethereum’s journey. The platform is poised to implement a slew of transformative features, including proto-danksharding, danksharding, and Verkle trees.\n\nThese innovations reduce transaction fees and make running a node more cost-effective. To ensure seamless integration into the mainnet, each feature will undergo rigorous testing on Holešky, underscoring the testnet’s pivotal role in Ethereum’s development pipeline.\n\nRelentless development\n\nEthereum’s commitment to innovation remains unwavering. Recent upgrades, including the Shanghai upgrade, have already introduced substantial scalability, security, and functionality improvements. Ethereum researcher Christine Kim affirms that Ethereum’s development community is far from complacent and is already plotting the next wave of enhancements. The blockchain’s execution layer (EL) and consensus layer (CL) are the focal points of these upcoming code changes.\n\nWhile Holešky gears up for pivotal infrastructure and protocol testing, Ethereum has also made strides in simplifying the process of launching tokens on its blockchain.\n\nEthereum developer Aram Mughalyan recently revealed a groundbreaking development. Using the OpenZeppelin Contract Wizard, Mughalyan demonstrated how anyone can create a new token on the Ethereum blockchain in under one minute. This streamlined process allows broader token innovation within the Ethereum ecosystem.\n\nYou might also like: Ethereum upgrade doubled energy efficiency rates, study reveals\n\nEther price analysis\n\nAccording to data from CoinGecko, the price of Ethereum (ETH) stands at $1,628; over the past seven days, the token has recorded a 0.07% increase. Ethereum’s market capitalization stands at more than $195 billion. On Sept. 11, ETH witnessed a dip to $1,530 before rebounding to its current valuation.\n\nThe introduction of the Holešky testnet and the simplification of token launches on Ethereum demonstrate the blockchain’s commitment to staying at the forefront of Web3 innovation. These developments pave the way for a more robust and accessible Ethereum ecosystem with exciting prospects.\n\nFollow Us on Google News"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTcvZXRoZXJldW1zLWhvbGVza3ktdGVzdG5ldC1mYWlscy10by1sYXVuY2gtaW4tcmFyZS10ZWNoLW1pc3N0ZXAtZm9yLXRoZS1ibG9ja2NoYWluL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTcvZXRoZXJldW1zLWhvbGVza3ktdGVzdG5ldC1mYWlscy10by1sYXVuY2gtaW4tcmFyZS10ZWNoLW1pc3N0ZXAtZm9yLXRoZS1ibG9ja2NoYWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum’s Holesky Testnet Fails to Launch, in Rare Tech Misstep for the Blockchain - CoinDesk",
        "content": "Holesky is also supposed to be critical for Ethereum’s next hard fork, Dencun, in which proto-danksharding, a technical feature aimed at scaling the blockchain, is supposed to go live. Jayanthi told CoinDesk that the set back in Holesky’s launch is not supposed to affect the timing of Dencun. “This won’t affect Dencun at all,” he said."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xOC9leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS1sYXlzLW91dC1idWxsLWNhc2UtZm9yLWV0aGVyZXVtLXJpdmFsLXNvbGFuYS1zYXlzLXNvbC1iZXN0LXN0b3J5LW91dHNpZGUtb2YtZXRoL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xOC9leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS1sYXlzLW91dC1idWxsLWNhc2UtZm9yLWV0aGVyZXVtLXJpdmFsLXNvbGFuYS1zYXlzLXNvbC1iZXN0LXN0b3J5LW91dHNpZGUtb2YtZXRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Ex-Goldman Sachs Executive Lays Out Bull Case for Ethereum Rival Solana, Says SOL Best Story Outside of ETH - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal says that Solana (SOL) is one of his top altcoin picks and is potentially the most promising project outside of Ethereum (ETH).\n\nIn a new interview with Altcoin Daily, the Real Vision founder says Solana co-founder Anatoly Yakovenko, commonly referred to as Toly, is becoming an important thought leader in the crypto space and represents the Solana ecosystem nicely.\n\n“Too many people get too involved with what they like because they like it and they’re a part of that thing. But I just observe Solana… I see Toly as a thought leader. He’s accepting of others around him, he builds bridges and doesn’t destroy them.\n\nI see a very engaged developer community. And people are really, really passionate about building their ecosystem and building their technology, and there’s a lot of people who use it, and there’s a lot of public awareness of the chain.”\n\nRecently, payments giant Visa announced it is building new stablecoin settlement capabilities on Solana. According to Pal, the chances are slim that Visa isn’t at least somewhat on the right track.\n\nIf digital assets are destined for another market expansion in the next couple of years, which Pal believes, he says that Solana could be one of the safest bets.\n\n“So, why is Visa using Solana? Because it’s fast. It’s fast, and it does a good job.\n\nIt’s not Ethereum. It’s different from Ethereum and even the way Toly has been talking about, ‘Could SOL be a layer-2 on ETH?,’ or ‘How do these worlds integrate?’ It just shows that for Visa to make a wrong decision is not that easy because things can be bridged, things can be interoperable…\n\nI’ve just been observing that and the Solana space has not put a foot wrong for a long time now, just when everybody had maximum fear and hate over the space…\n\nFor me, it’s a great story. It’s still probably the best major story in the space outside of Ethereum because Ethereum is the big daddy. But we’re looking at the next stage down, where’s the next altcoin that has relative security, and you’re not taking a wild guess…”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Rattanamanee Patpong"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDkvMTgvbDJzLW9uLXRoZS1yaXNlLWFzLWJhc2UtYW5kLXprc3luYy1lcmEtb3ZlcnRha2VzLWV0aGVyZXVtLWJ5LXRwcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "L2s on the Rise as Base and zkSync Era Overtakes Ethereum by TPS - The Crypto Basic",
        "content": "Ethereum-based layer-2 network Base and zkSync have seen their transaction capabilities overtake legacy Ethereum for the first time.\n\nEthereum’s long-term roadmap includes a future where layer-two solutions handle a significant portion of transactions that eventually settle on the Ethereum mainnet. In a related positive development, Ethereum-based networks Base and zkSync Era surpassed mainnet Ethereum in transactions per second (TPS) metric.\n\nLayer-2 analytics platform L2Beat shows that in the past 24 hours, Base and zkSync Era recorded a TPS metric of 12.93 and 12.62, respectively. On the other hand, the Ethereum network handled 10.18 transactions per second over the same period. Starknet and Arbitrum One complete the top 5 with 9.79 and 4.90 TPS, respectively.\n\n- Advertisement -\n\nIncubated by publicly traded crypto company Coinbase, Base is a layer-2 network built using a technology stack developed by blockchain scalability-focused startup Optimism. It is noteworthy that although Optimism offers its layer-2 network and token OP, the startup also empowers blockchain projects with a tech stack to deploy their networks.\n\nHowever, zkSync Era is a layer-2 network that primarily integrates zero-knowledge proof (ZKP) technology. Beyond scaling throughput, zkSync Era aims to offer advanced privacy and security features to users transacting on the network.\n\nBase, zkSync, and Shibarium are on the rise\n\nBase and zkSync Era reaching a higher transaction throughput than the native Ethereum mainnet underlines the potential layer-2s have to ease the workload on legacy networks like Ethereum. It also represents a remarkable feat, given both networks only launched earlier this year. While the zkSync Era mainnet launched in March, Coinbase’s Base network went live in August.\n\nSpeaking about L2s, Shibarium is another scalability solution that has recently gained traction. The Shiba-Inu-backed network has gained over two million wallets and aims to hit the three million transaction milestone within one month after launch.\n\n- Advertisement -\n\nAlthough these Ethereum-based layer-2s do not offer the same level of decentralization as the Ethereum mainnet, they deliver on two main components. They provide faster transactions and cheaper fees, even when fees on the mainnet are near yearly highs."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGgtcHJpY2UtYW5hbHlzaXMtaXMtZXRoZXJldW0tcHJpY2UtaGVhZGluZy10by0yMDAwL9IBXmh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGgtcHJpY2UtYW5hbHlzaXMtaXMtZXRoZXJldW0tcHJpY2UtaGVhZGluZy10by0yMDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "ETH Price Analysis: Is Ethereum Price Heading To $2000? - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nStory Highlights Ethereum recovery rally is ready to challenge the short-term downtrend.\n\nA bullish breakout of the resistance trendline can fuel the ETH price to $2000.\n\nA reversal from the trendline can plunge ETH to $1500.\n\nAmidst the volatile market, ETH price emerges resilient, clutching firmly to its pivotal $1,500 support zone. Even with sharp market moves, Ethereum’s unwavering posture above this key benchmark is commendable.\n\nTrading View\n\nLooking back at last week, the ETH price climbed its way back up to $1600. That’s a jump of 6.30% in just a week! But, just like Bitcoin, Ethereum had a slow weekend and saw a small drop of 1.5%. The ETH price is currently trading at $1635 as the market hints at a recovery.\n\nDigging deeper into the technical panorama, the conspicuous ‘death cross’ on the daily graph casts a shadow of bearishness over Ethereum’s trajectory. But, starting the week, Ethereum’s showing some promise with a 0.49% rise.\n\nPlus, with the ETH price not dipping much over the weekend, it looks like Ethereum might be gearing up for a comeback. Moreover, the lower price rejection observed in the recent daily candles implies a potential imminent bullish resurgence.\n\nTechnical indicators:\n\nRSI indicator: The daily RSI traces a potent bullish divergence, further fanning the flames of a prospective rally breakout.\n\nMACD indicator: Both the MACD and its counterpart, the signal line, dance deftly, evading a bearish entanglement.\n\nAlso Read: Ethereum Price Prediction 2023, 2024, 2025: Will ETH Price Cross The $2,000 Again This Year?\n\nWill Ethereum Prices Float To $2000?\n\nETH price rally seems set to collide with a potent barrier located at the intersection of the 50-day EMA and the short-term resistance trendline. A triumphant breach past these adversaries could set the stage for Ethereum’s glorious return to $2000. This will realign the 50 and 200-day EMA in a bullish manner.\n\nConversely, a descent beneath the $1600 mark may threaten to pull Ethereum back into the gravitational grip of the $1500 threshold."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0taWNvLXBhcnRpY2lwYW50LWV0aC1rcmFrZW4v0gFOaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1pY28tcGFydGljaXBhbnQtZXRoLWtyYWtlbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Ethereum ICO Participant Moves $9.96 Million Of ETH To Kraken. Will He Sell? - NewsBTC",
        "content": "An Ethereum initial coin offering (ICO) participant and one of the earliest supporters of the smart contract platform has moved 6,000 ETH worth $9.96 million to Kraken, a cryptocurrency exchange, recent data from Lookonchain on September 18 reveals.\n\nThe unidentified whale received 254,908 ETH when each traded for 40.31 during the crowdfunding in 2014. This amount is currently worth over $466 million at spot rates.\n\nEthereum Whale Transfers Over $9.96 Million To Kraken\n\nThe anonymous nature of public blockchains, including Ethereum, makes it harder to decipher the owner’s identity. Determining whether an entity or an individual controls the address is also more complex.\n\nWhale transfers to a crypto exchange are usually considered bearish since the ramp provides an easier swapping option for token holders to cash out. Typically, crypto whales have the potential to impact the market due to the sheer size of their holdings.\n\nAccordingly, their trading decisions can influence prices, increasing volatility. Therefore, the recent deposit to Kraken may suggest that the whale plans to sell, taking a profit.\n\nOn the brighter side, the whale could be moving their coins via an intermediary, in this case, Kraken, before transferring them to other platforms like Rocket Pool or Lido Finance for staking.\n\nIn the current proof-of-stake consensus algorithm used by Ethereum, whales can earn annual staking rewards if they lock at least 32 ETH. While the whale can set up a node and stake, liquidity staking providers like Rocket Pool allow users to stake coins and earn staking rewards using their infrastructure.\n\nAs of September 18, there are over 804,000 validators, that is, users who have locked at least 32 ETH operating an Ethereum full node. Cumulatively, over 25.7 million ETH have been locked.\n\nETH Prices Recovering\n\nAs of this writing, the transfer on September 18 is amid the broader recovery in the crypto market. Of note, Ethereum (ETH) prices are up roughly 6% from September lows. Overall, supporters are bullish, expecting more growth in the days ahead.\n\nThe pump also means bulls have reversed some of the losses of September 11, and the current formation may anchor the next leg up that could propel the coin above $1,750, or August 29 highs, and later peel back sharp losses recorded on August 17.\n\nFrom the candlestick arrangement in the daily chart, ETH remains under pressure, dropping 23% from 2023 highs of around $2,140.\n\nHowever, since bears didn’t reverse losses of the June to July leg up, buyers have a chance following the rejection of lower lows from around the 78.6% Fibonacci retracement level of the Q3 2023 trade range. Presently, the September and August 2023 lows remain critical support levels for ETH, with the retest of August 17 lows on September 11 causing concern for optimistic traders.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9vbmUtbWVyZ2UtZXRoLXN1cHBseS1zaHJpbmtzLTA0NTUzMTI4My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "One Year After The Merge: ETH Supply Shrinks But Challenges Remain - Yahoo Finance",
        "content": "The Merge was tipped to be the most significant upgrade in Ethereum’s history, promising to make ETH a deflationary asset while significantly reducing the carbon footprint of the network.\n\nWhile Ether has traded sideways over the past 12 months, much has changed for the network’s fundamentals. New Ether issuance is down more than 80%, staking participation is up 87%, and nearly 1M ETH has been permanently removed from supply.\n\nOne Year After The Merge: ETH Supply Shrinks But Challenges Remain\n\nBut while Ethereum is largely making good on its deflationary promise, new challenges to the network’s decentralization have emerged.\n\nDeflationary Ethereum\n\nThe Merge took place on Sept. 15, 2022, transitioning the network from Proof of Work to Proof of Stake consensus.\n\nThe shift overhauled Ethereum’s fundamental tokenomics, with new daily Ether issuance falling more than 80% from 13,500 ETH to currently around 2,300 ETH. Coupled with the introduction of Ethereum’s burn mechanism one year prior, analysts predicted Ethereum would become deflationary, meaning that more ETH is burned from base transaction fees than enters circulation as rewards for stakers.\n\nThere are now nearly 300,000 fewer ETH in existence than at the time of The Merge. For comparison, an additional 3.8M ETH ($6.2B) would have been issued under Proof of Work.\n\nChallenges Posed By Liquid Staking\n\nThe Merge also gave rise to the 2023 boom in liquid staking tokens (LSTs) — assets representing an underlying position of staked Ether which can be easily traded on exchanges or used in DeFi applications.\n\nEthereum’s Shanghai upgrade also activated staked ETH withdrawals in April, reducing the price spread between ETH and popular liquid staking tokens and bolstering the adoption of LSTs. Today, 10.8M ETH or 42.5% of all staked Ether is held by liquid staking protocols.\n\nETH locked in Lido, the top LST protocol, increased 82% from 4.6M to 8.6M since the year began, according to Dune Analytics. Coinbase’s LST token, cbETH, also boasts 1.17M Ether locked after launching last September, followed by Rocket Pool’s rETH with 450,000.\n\nStory continues\n\nHowever, with Lido now commanding one-third of staked Ether, many onlookers decry Lido as a centralizing threat to Ethereum, warning that a further increase in Lido dominance could facilitate governance attacks against the network if the protocol desired.\n\nIn May, Ethereum chief scientist, Vitalik Buterin, advocated that staking providers controlling more than 15% of staked ETH should actively raise user fees to deter adoption until their dominance falls.\n\n“If a stake pool controls > 15%, it should be accepted and even *expected* for the pool to keep increasing its fee rate until it goes back below 15%,” Buterin tweeted.\n\n\n\nRead the original post on The Defiant"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMTgvZXRoZXItdHJhZGluZy1hdC0yNy1kaXNjb3VudC10by1mYWlyLXZhbHVlLW5ldy1yZXNlYXJjaC1zaG93cy_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzE4L2V0aGVyLXRyYWRpbmctYXQtMjctZGlzY291bnQtdG8tZmFpci12YWx1ZS1uZXctcmVzZWFyY2gtc2hvd3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ether Trading at 27% Discount to Fair Value, New Research Shows - CoinDesk",
        "content": "Per the Metcalfe law (ML), the value of the network is directly linked and proportional to the square of the number of users it has. Ether enables users to transact on the Ethereum blockchain, earn interest, and participate in network security through staking, store non-fungible tokens and much more. Thus, ether's value proposition has long been closely tied to Ethereum's network usage."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vdS50b2RheS9jYXJkYW5vLWZvdW5kZXItZW5kcy1zcGVjdWxhdGlvbi1vbi1ldGhlcmV1bS1hbmQtc2VjLWNvbnNwaXJhY3ktYWdhaW5zdC1yaXBwbGUtYW5kLXhycNIBamh0dHBzOi8vdS50b2RheS9jYXJkYW5vLWZvdW5kZXItZW5kcy1zcGVjdWxhdGlvbi1vbi1ldGhlcmV1bS1hbmQtc2VjLWNvbnNwaXJhY3ktYWdhaW5zdC1yaXBwbGUtYW5kLXhycD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Cardano Founder Ends Speculation on Ethereum and SEC Conspiracy Against Ripple and XRP - U.Today",
        "content": "In a recent X post, Charles Hoskinson, the notable blockchain entrepreneur and creator of Cardano, weighed in on the longstanding debate surrounding Ethereum's connection to the U.S. Securities and Exchange Commission and their alleged conspiracy against Ripple and XRP. Hoskinson's comments came as a response to renewed discussions sparked by Steven Nerayoff, an early adviser to the Ethereum network.\n\nAdvertisement\n\nHoskinson recalled Ethereum's early days, highlighting its humble beginnings as an $18 million initial coin offering (ICO). He suggested that during this nascent period, the SEC conveniently turned a blind eye to Ethereum, allowing it to thrive unchecked. However, according to Hoskinson, personal relationships and behind-the-scenes dealings may have played a pivotal role in this regulatory leniency.\n\nNevertheless, the Cardano founder dismissed the notion of Ethereum bribing the SEC to target Ripple and XRP, labeling it a baseless conspiracy theory. He pointed out that Ripple was not even operating in the same smart contract space and, therefore, could not be a competitor.\n\nWhat's going on?\n\nThe controversy was initially ignited by Steven Nerayoff, who claimed that a fabricated case had been built against him due to his knowledge about Ethereum's ICO. He asserted that individuals associated with the SEC, the Department of Justice, the FBI and even Ripple were involved in this alleged plot. Notably, Nerayoff emerged victorious in his legal battle.\n\nFormer SEC Chair was Joe Grundfest who has integrity which seems out of fashion. As to the number, I now realize one can’t tell the true # of ETH ICO buyers as it was explained by some how whales could disguise their large positions during the ICO. Violation of Terms of Service… https://t.co/TjSIsszGmG — Steven Nerayoff (@StevenNerayoff) September 17, 2023\n\nNerayoff's lawyer subsequently issued a statement, indicating that Nerayoff intended to reveal what he knew but would follow proper procedures to do so, serving the interests of justice and the public."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9jYXJkYW5vcy1jaGFybGVzLWhvc2tpbnNvbi1wb3Vycy1jb2xkLXdhdGVyLW9uLWV0aC1nYXRlLWNvbnNwaXJhY3kv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Cardano's Charles Hoskinson Pours Cold Water on ETH Gate Conspiracy - CCN.com",
        "content": "Key Takeaways\n\nEthereum and Cardano co-founder Charles Hoskinson has weighed in on “ETH Gate.”\n\nHoskinson denies charges of a secret deal between the Ethereum founders and the SEC.\n\nHis remarks did little to quench the anger of hostile XRP supporters, who argue that the SEC has received preferential treatment from the SEC.\n\nOver the weekend, comments by the crypto lawyer John Deaton triggered an “ETH Gate” Twitter storm, but is there any truth to crypto’s latest conspiracy theory?\n\nIn response to wild online allegations, Charles Hoskinson, one of Ethereum’s co-founders who later played a key role in launching Cardano, has dismissed Deaton’s more extreme claims.\n\nWhat is ETH Gate?\n\nETH Gate erupted over the weekend after the prominent crypto lawyer John Deaton implied that Ethereum’s founders may have engaged in shady backroom deals with the US Securities and Exchange Commission SEC.\n\nAccording to Deaton and other ETH Gate conspiracy theorists, the Ethereum co-founder Joseph Lubin secretly met SEC officials around the time of the ETH Initial Coin Offering ICO.\n\nBased on these supposed contacts, the SEC allegedly agreed to the classification it has stuck to in the years since. Namely, Bitcoin and Ethereum are decentralized enough to exempt them from US securities law.\n\nMeanwhile, the SEC seems to have designated Ripple’s XRP and similar tokens as fair game for enforcement.\n\nEthereum got Lucky, Says Hoskinson\n\nCommenting on the ETH Gate charges, Hoskinson dismissed the idea that Ethereum’s founders engaged in any kind of conspiracy with the SEC.\n\nHowever, he didn’t attempt to justify the apparent double standard that fuels speculation the SEC granted Ethereum preferential treatment.\n\nI've always believed that when Ethereum was an 18 million dollar ICO and very few people were doing them that the SEC decided to ignore it and crypto and they got lucky to be too old to consider after the eye of sauron moved over. Absolutely personal relationships and backroom… — Charles Hoskinson (@IOHK_Charles) September 17, 2023\n\nHoskinson suggests that Ethereum simply got lucky. Its ICO slipped under the regulatory radar, and by the time the SEC started its recent crypto crackdown, it was, in his view, “too old to be considered.\n\n“Personal Relations and Backroom Stuff Likely Played a Role”\n\nAlthough Hoskinson denies that the Ethereum founders inappropriately influenced SEC policy, he said that “personal relations and backroom stuff likely played a role.”\n\nIn a bid to justify such backroom lobbying, he added that “it happens every day,” comparing Ethereum’s efforts with tactics used by businesses across different industries.\n\n“It happens every day with blackrock, chase, Goldman Sachs, big pharma, the telcos, the defense industry, and many others.” In other words #Ethereum should also be ok to get the pass from the SEC without any justification for the rest.\n\nWhat a biase way to cope — XrpNurse🩺 (@XrpNurse) September 18, 2023\n\nDespite Hoskinson’s attempt to subdue the ETH Gate conspiracy theory, comments on his post point to a prevailing sense of injustice among XRP supporters.\n\n“This was always about control. You can feel for us all you want but this was a war on ripple and #XRPL being a threat to ETH,” one user argued .\n\nAnother accused Hoskinson of ridiculing and belittling the XRP community by not acknowledging their concerns."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb3Ntb3MtYmFzZWQtY2FudG8tbGVhZGluZy1wb2xrYWRvdC0wNDM0Mjc5NTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Cosmos-based Canto and Leading Polkadot Chain Astar Moves to Ethereum as Layer-2s - Yahoo Finance",
        "content": "Cosmos-based Canto and Leading Polkadot Chain Astar Moves to Ethereum as Layer-2s\n\nCanto And Astar Are Moving To Ethereum as Layer-2s\n\nCanto, a Cosmos-based blockchain, and Astar, a leading Polkadot chain, have both announced that they will be moving to Ethereum as Layer-2 solutions. The move is aimed at improving scalability and interoperability between different blockchain networks.\n\nCanto is a layer-1 permissionless general-purpose blockchain on Cosmos with the goal of bringing the traditional financial sector on board with decentralized finance applications via open public infrastructure. Canto Commons has agreed to construct an Ethereum ZK rollup utilizing the Polygon Chain Development Kit (CDK).\n\nCanto will gain access to the liquidity of Polygon's ecosystem through the use of a shared ZK bridge. Canto's validators and staking system will be unaffected by the migration.\n\nSeveral protocols have recently revealed plans of building ZK layer 2 solutions using Polygon's CDK. Notably, leading Polkadot chain Astar revealed that it will begin developing its own Ethereum layer-2 scaling solution, Astar ZK-Ethereum Virtual Machine (EVM), which will also use Polygon's CDK.\n\nCanto and Astar are both intended to facilitate cross-chain communication and interoperability among different blockchain networks. They will be able to harness the security and scalability of the Ethereum network while retaining their own unique features and functions by switching to Ethereum as Layer-2 solutions.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc2VjLWluLWJlZC13aXRoLWV0aGVyZXVtLWV0aC1nYXRlLWV4cGxhaW5lZC_SAU1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL3NlYy1pbi1iZWQtd2l0aC1ldGhlcmV1bS1ldGgtZ2F0ZS1leHBsYWluZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Was The SEC In Bed With Ethereum? ETH Gate Explained - NewsBTC",
        "content": "Conspiracy theory or one of the biggest scandals in crypto? The term “ETH Gate” has been on the lips of every XRP supporter in recent months and, increasingly, the broader cryptocurrency community. At the heart of this issue is the US Securities and Exchange Commission’s (SEC) decision to classify Ethereum (ETH) as a non-security, contrasting sharply with its ongoing legal action against Ripple and the XRP token.\n\nWhat is ETH Gate\n\n“ETH Gate” refers to a theory alleging that the Ethereum Foundation and ConsenSys have fostered close relationships with key individuals within the US Securities and Exchange Commission (SEC) and other entities like JP Morgan, thereby ensuring a favorable regulatory environment for Ethereum.\n\nOne cornerstone of this theory are the Hinman emails which were released earlier this year. In these emails, Hinman, who made the landmark speech in 2018 declaring that Ethereum was not a security, interacted with Ethereum’s co-founder, Vitalik Buterin right before the speech. Hinman reportedly consulted Buterin to “understand the operational dynamics of Ethereum.”\n\nRemarkably, Bill Hinman rejoined the law firm Simpson Thacher in 2020 after leaving the SEC. The significance? Simpson Thacher is associated with the Ethereum Enterprise Alliance. Therefore, the XRP army believes that Hinman’s decision to deliver a speech giving Ethereum a regulatory “free pass” may not have been impartial.\n\nSpeculations By XRP Army\n\nJohn E Deaton, an outspoken figure in the XRP community and a keen observer of the SEC’s dealings, has painstakingly put forth allegations suggesting a deeper web of interlinked relationships that hint at possible conflicts of interest. (There are so many that it is not even possible to highlight them all in one article.) His assertions have become pivotal in the “ETH Gate” theory, and here we’ll delve deeper into these connections.\n\n1. Joseph Lubin’s Strategic Moves: Joseph Lubin, co-founder of Ethereum and founder of ConsenSys, is at the core of Deaton’s claims. According to Deaton, within just two months of Jay Clayton’s appointment as the SEC Chairman, Lubin made a potentially strategic hire, bringing on board Patrick Berarducci from the law firm Sullivan & Cromwell. This move is seen by Deaton and many in the XRP community as more than coincidental.\n\nDeaton has drawn attention to this connection in the past, positing that it might have provided Ethereum an inside track or at least a more favorable disposition from the SEC. Sullivan & Cromwell is also notable because Jay Clayton himself was a partner there before his stint as the SEC Chairman.\n\n2. The Hinman-Lubin Email Exchange: Deaton frequently refers to the now-infamous email exchange between Bill Hinman and Joseph Lubin. For Deaton, this correspondence underscores a problematic level of proximity between a regulatory figure and a significant player in the crypto sphere.\n\nThe fact that Hinman reportedly emailed Lubin directly is seen by Deaton as a potential sign of collaboration or at least a peculiar level of familiarity. More so, given Hinman’s subsequent public remarks about Ethereum being a non-security, despite warnings against such pronouncements from the SEC’s Office of General Counsel.\n\n3. Jay Clayton and One River Digital Asset Management: After his tenure at the SEC, Jay Clayton joined One River Digital Asset Management. Deaton emphasizes this move as a point of contention. One River is known for its large holdings of Bitcoin and Ethereum. Deaton hints at a potential conflict of interest, questioning if Clayton’s decisions during his time at the SEC may have been influenced by future career prospects or associations that favored Ethereum.\n\n4. Simpson Thacher, Ethereum Enterprise Alliance, and Hinman: One of the most significant points of contention brought forth by Deaton involves Bill Hinman’s associations with the law firm Simpson Thacher. This firm played a role in the Ethereum Enterprise Alliance.\n\nDeaton suggests that Hinman’s connection to Simpson Thacher and, by extension, the Ethereum Enterprise Alliance, could have influenced his decision to publicly declare Ethereum a non-security.\n\nSimilarly, an XRP community member known as Mr. Huber has been extremely vocal and is raising compelling questions: “ETH Gate is a conspiracy theory that the SEC tried to create a monopoly for Ethereum?” He goes on to argue that this is a concerted attempt by powerful Wall Street banks like JPMorgan to “control the global crypto market by bribing the SEC to gain a monopoly for Ethereum.”\n\nLatest News On ETH Gate\n\nYesterday, John E Deaton indicated that new, potentially damning, information about ETH Gate might soon be disclosed. “I’ve always said that one day we will get the full truth. Today is one day closer,” Deaton tweeted in response to Steven Nerayoff’s lawyer, Michael Scotto, who indicated that Nerayoff is prepared to make his facts known “at a time and manner that serves the interests of justice and the people.”\n\nSteven Nerayoff, an early adviser to Ethereum, had extortion charges against him dismissed in May this year. Deaton speculates that Nerayoff could be a significant source of insider information, possibly related to Ethereum’s regulatory free pass. “I have the map,” was Nerayoff unequivocal response to Deaton’s speculative tweets about the matter, as Bitcoinist reported today.\n\nThe “ETH Gate” controversy calls into question the impartiality of the SEC in its treatment of different cryptocurrencies. Although allegations remain unproven, the gathered evidence paints a picture of inconsistent regulatory approaches and potential conflicts of interest.\n\nWhether these allegations hold any water remains to be seen, but they have certainly fueled a sense of urgency and scrutiny around the SEC’s policies. If the hints dropped by Steven Nerayoff and John E Deaton materialize into something substantive, ETH Gate could become a pivotal chapter in the annals of cryptocurrency regulation.\n\nAt press time, ETH traded at $1,635.\n\nFeatured image from Blockchain Association & Commerce Society, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aWxsLWV0aGVyZXVtcy1wcmljZS10dXJuLXZvbGF0aWxlLXNvb24v0gFCaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3dpbGwtZXRoZXJldW1zLXByaWNlLXR1cm4tdm9sYXRpbGUtc29vbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Will Ethereum’s price turn volatile soon? - AMBCrypto News",
        "content": "Ethereum’s exchange supply declined.\n\nIts demand in the derivatives market was high, as its funding rate turned green.\n\nAfter months of less volatility, top cryptos like Ethereum [ETH] might see a change in trend. The possibility seemed likely as buying pressure on ETH was on the rise. If the increase in accumulation starts to show its effects, then the king of altcoins might soon reach the $1,800 mark again.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nBuying pressure on Ethereum is high\n\nSantiment’s 15 September tweet revealed an optimistic development that hinted at an increase in volatility in the crypto market. Reportedly, Ethereum’s exchange supply declined, as traders appeared content with their holdings.\n\nThe above development was accompanied by a rise in Tether’s [USDT] supply of exchanges. This was a positive outcome, as an increase in Tether’s supply could mean that investors might further increase accumulation.\n\n? #Bitcoin's & #Ethereum's exchange supply has resumed going lower as traders appear content #hodling. And the even better news is that #Tether is moving back on to exchanges, now at the highest level since March. This indicates more future buy interest. https://t.co/j5aviy3b5F pic.twitter.com/22b90022aB — Santiment (@santimentfeed) September 15, 2023\n\nA closer look at ETH’s on-chain performance suggested that investors were already stockpiling the token in hopes of a price rise in the near future. According to CryptoQuant, both ETH’s exchange reserve and net deposits on exchanges were dropping.\n\nMoreover, Ethereum’s supply outside of exchanges flipped its supply on exchanges. Supply held by top addresses also increased, suggesting that the whales were buying the token.\n\nEthereum’s investors can expect this\n\nUpon checking Ethereum’s metrics, a few other bullish signals were also revealed. For instance, over the last week, Ethereum’s funding rate turned green, meaning that it was in demand in the derivatives market.\n\nPositive sentiment around the token also remained relatively high, and its MVRV ratio improved, suggesting a possible price uptick.\n\nThough the metrics looked bullish, a look at ETH’s daily chart painted a different picture of what the token’s near-term future might look like. Most of the market indicators remained bearish on the king of altcoins and suggested that its price could go down further.\n\nThe Chaikin Money Flow (CMF) and Money Flow Index (MFI) registered downticks. Moreover, ETH’s Relative Strength Index (RSI) was resting below the neutral mark of 50.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAs per the Bollinger Bands, Ethereum’s price was in a less volatile zone, which decreased the chances of a price uptick in the near future. However, one indicator still remained in the buyers’ favor. ETH’s MACD pointed out that the bulls were still controlling the market.\n\nAccording to CoinMarketCap, ETH was up by nearly 0.2% in the last 24 hours. At the time of writing, it was trading at $1,635.63 with a market capitalization of over $196 billion."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1jb21tdW5pdHktYnVpbHQtemtldm0tc2Nyb2xsLWxhdW5jaGluZy1pbi13ZWVrc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Idealistic Ethereum community-built zkEVM Scroll launching in weeks - Cointelegraph",
        "content": "After two years of development, a group of Ethereum idealists are close to launching their zero-knowledge EVM (Ethereum Virtual Machine) — Scroll — developed with Ethereum’s values in mind.\n\nWhile there are already several zero-knowledge EVMs in existence today, Scroll co-founder Ye Zhang told Cointelegraph at Token2049 that the project was “idealistic” as the team was sticking to the philosophy and the principles that Ethereum already cultivates.\n\nZhang said that they have been working on this mostly as a “labor of love,” driven by a shared vision to scale Ethereum while staying true to its decentralization principles.\n\nHe added that the project was more human interest than simply solving computational problems. “We started in an open source way, in a community-driven way,” he said.\n\n“We can grow this community very organically, and then grow our network effect, not in a very silly way, not in a very marketing-driven aggressive way.”\n\nThe new zkEVM is set to launch within weeks, having already undergone extensive testing and carried out audits on the code. Zhang said the Scroll will launch after some final testing and major projects like Uniswap and Aave are ready to deploy on Scroll at launch.\n\nScroll co-founder Ye Zhang. Source: Cointelegraph\n\nThe mathematician believes ZK-rollups are the “holy grail” or best-in-class of layer-2 scaling solutions, very cheap and secure.\n\nHowever, Scroll is entering a crowded ecosystem that already has zkEVM solutions from Polygon, Immutable, StarkWare, zkSync Era, and ConsenSys’ Linea, which launched in August.\n\nZhang claimed that some of the other systems such as Linea have some “unproven” parts in the circuit but believes Scroll provides a “complete proof” of all Ethereum “opcodes” and components of the transaction.\n\n“So it's not only compared to compatibility, but also a full proof for proving that everything we already have,” he said.\n\nRelated: Buterin weighs in on zk-EVMs’ impact on decentralization and security\n\nScroll is a layer-2 scaling project that has been in development for two years. It uses zero-knowledge proofs to compress data off-chain, meaning only proofs are submitted on-chain — enabling higher throughput.\n\nAs always, we published another ecosystem update, highlighting some of the latest projects to join the Scroll ecosystem\n\n\n\nThis week, we cover DeFi aggregators and permissionless lending protocols. https://t.co/1G4ErzAB00 — Scroll (@Scroll_ZKP) September 16, 2023\n\nThe EVM component enables full native compatibility with any existing Ethereum software and applications.\n\nThe initial setup will still involve some centralization such as sequencers, Zhang said, but the roadmap will decentralize this further over time.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Attack of the zkEVMs! Crypto’s 10x moment"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tZGV2cy10by1yZWJvb3QtaG9sZXNreS10ZXN0bmV0LWFmdGVyLWJvdGNoZWQtbGF1bmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum devs to reboot Holesky testnet after botched launch - crypto.news",
        "content": "The Holesky testnet meant to celebrate Ethereum’s one-year anniversary of The Merge will be rebooted after configuration errors caused a network crash.\n\nEthereum engineers plan to relaunch the Holesky public testnet following issues with the network’s initial deployment on Sep. 15.\n\nThe testnet, which developers released at 10 a.m. ET, encountered “major problems” due to network misconfigurations, according to Galaxy researcher Christine Kim. Devs said Holeksy would be launched again soon, but no definite date was mentioned.\n\nhttps://twitter.com/beaconcha_in/status/1702689589666717918\n\nHolesky was set to join Goerli and Sepolia as Ethereum’s third testnet. Testnets allow developers to simulate upgrades and run applications intended for the main network or mainnet. They are akin to dress rehearsals for blockchain builders to fix bugs and test deployments.\n\nTim Beiko, an Ethereum Foundation contributor, said developers allocated 1.6 billion testnet Ether (ETH) as Holesky’s genesis token supply. The massive testnet ETH pool is likely to incentivize use of the network.\n\nhttps://twitter.com/TimBeiko/status/1692287180306276546\n\nEthereum testnets\n\nRegarding Ethereum testnets, there has been talk of sunsetting Goerli in early 2024. This possible outcome could place Holesky at the epicenter of developer activity on Ethereum and even networks compatible with Ethereum Virtual Machine (EVM)\n\nFurthermore, developers launched Holesky on the one-year anniversary of The Merge, Ethereum’s switch from Proof of Work (PoW) to Proof of Stake (PoS).\n\nThe Merge marked a massive structural upgrade for Ethereum, including changes to network participant roles and token emissions.\n\nAccording to on-chain data dashboard ultrasound.money, Ethereum net token supply reduced by 0.24% or 299,922 ETH. This means that ETH’s supply is deflationary in terms of how many new tokens enter circulation annually.\n\nThe Merge also introduced staking on Ethereum, which is locking up ETH in a smart contract to earn rewards or qualify as a network validator among other incentives. Per Coinbase data, nearly 25% of ETH’s supply is staked. It amounts to over 20 million ETH tokens.\n\nEthereum boasts a $40 billion staking market with protocols like Lido Finance dominating the space.\n\nYou might also like: Ethereum sees second-highest on-chain activity in history\n\nFollow Us on Google News"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aGF0LWRvZXMtcmlwcGxlLXhycC1uZWVkLXRvLWNhdGNoLXVwLXRvLWV0aGVyZXVtL9IBT2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aGF0LWRvZXMtcmlwcGxlLXhycC1uZWVkLXRvLWNhdGNoLXVwLXRvLWV0aGVyZXVtLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "What Does Ripple (XRP) Need to Catch up to Ethereum? - CryptoPotato",
        "content": "There’s been an interesting ongoing discussion among XRP aficionados on Twitter lately, with some laying arguments as to what the future of Ripple should look like so that it supports the company’s vision, as well as that of XRP holders.\n\nA community member, Yassin Mobarak, took it to X to comment:\n\nI’m sensing Ripple is shifting from reliance on XRP in cross-border payments to new use cases such as institutional custody of digital assets, derivatives, CBDCs, and carbon credit markets. Not saying that’s a bad strategy at all, but in order for XRP to prosper long-term, we cannot rely on just Ripple.\n\nIndeed, there have been multiple announcements recently related to Ripple. Just a few days ago, the company expanded its liquidity hub to two new countries – Brazil and Australia.\n\nBefore that, Ripple made headlines by revealing an acquisition of the well-known crypto-focused financial institution called Fortress Trust.\n\nCommenting on the matter was also a popular blockchain analyst, who said:\n\nWe cannot rely on Ripple. It’s the builders we should be focusing on. XRP ecosystem has approximately 1000 projects according to Ripple Markus Infanger at Apex. We need 100,000 active projects to even get close to ETH. If you love to focus on Ripple, shop for private equity that is sold on more than dozen platforms with competitive prices.\n\nIn essence, the expert argues that there’s a long way ahead if Ripple is to catch up to Ethereum in terms of development, but this in itself brought up another interesting argument by another user, who said:\n\nXRPL is not a SC-centered chain, you don’t need to keep acting like it is. Different use cases will create a different value."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW50cnVzdC5jb20vZXRoZXJldW0tbmV3cy9ldGhlcmV1bXMtaG9sZXNreS10ZXN0bmV0LWZhY2VzLWRlbGF5LWR1ZS10by1jb25maWd1cmF0aW9uLWVycm9y0gFsaHR0cHM6Ly93d3cuY29pbnRydXN0LmNvbS9ldGhlcmV1bS1uZXdzL2V0aGVyZXVtcy1ob2xlc2t5LXRlc3RuZXQtZmFjZXMtZGVsYXktZHVlLXRvLWNvbmZpZ3VyYXRpb24tZXJyb3IvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum’s Holesky Testnet Faces Delay Due to Configuration Error - CoinTrust",
        "content": "Ethereum’s Holesky testnet, initially anticipated to launch smoothly, has encountered an unexpected delay necessitating a second launch attempt, as revealed by community members and developers on September 15. Ethereum researcher Diederik Loerakker, known as protolambda, reported that an error had occurred when one developer placed certain data in an incorrect section of the network’s genesis files.\n\nLoerakker explained that “how much is the fish?” (encoded as 0x686f77206d7563682069732074686520666973683f) was mistakenly included as extra data in the EL Holesky genesis.json instead of the CL genesis.ssz. This configuration misstep resulted in a critical misalignment that prevented the testnet from successfully launching. While Loerakker hinted at potential discrepancies in other fork parameters, he refrained from disclosing further details regarding these issues.\n\nNotably, Loerakker emphasized that the problems with Holesky were not related to network size, a concern that had been carefully evaluated before the initial launch. In August, developers had determined that Holesky was capable of accommodating 1.4 million validators. In response, they allocated a substantial quantity of Holesky ETH, totaling 1.6 billion tokens.\n\nWhile developers are committed to relaunching Holesky, the exact date for this relaunch remains uncertain. Nethermind, a prominent Ethereum research and engineering group, announced plans to reintroduce Holesky within one week, potentially targeting September 22 for the subsequent attempt. Conversely, Ethereum contributor and Sigma Prime member Michael Sproul has proposed a relaunch date of September 28, nearly two weeks later than the initial launch date.\n\nDue to mismatching of some parameters, the holesky test network failed to start today. The Ethereum Holesky test network is scheduled to be officially launched today. It will be twice the size of the main network and will become the largest test network in Ethereum, with 1.46… — Wu Blockchain (@WuBlockchain) September 16, 2023\n\n\n\nIt is worth noting that despite the delays and challenges faced by the Holesky testnet, Ethereum’s mainnet remains unaffected. The mainnet continues to facilitate transactions with tangible value, distinguishing itself from the testnet environment. Beaconchain.eth acknowledged the Holesky launch setback, underlining the essential purpose of testnets as platforms for identifying and rectifying issues before they impact the main network.\n\nIn accordance with Ethereum’s documentation, Holesky testnet is expected to supersede Ethereum’s Goerli testnet. Both Holesky and Goerli serve as dedicated test environments for experimentation related to staking, validation processes, and core network upgrades. Additionally, there exists another testnet known as Sepolia, catering to independent developers keen on testing their Ethereum-based applications. These testnets rely on specialized testnet ETH that is freely obtainable through faucets and generally lacks real market value.\n\nIn summary, Ethereum’s Holesky testnet has encountered a setback necessitating a second launch attempt due to a configuration error in the genesis files. While the exact relaunch date remains uncertain, the Ethereum community remains committed to resolving these issues and further refining the network’s test environment. It is important to underscore that these challenges have no bearing on Ethereum’s robust and fully operational mainnet, which continues to support transactions of real value."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ib3VuY2UtdG8tMmstb3ItbW9yZS1wYWluLWZvci1ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMv0gFXaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2JvdW5jZS10by0yay1vci1tb3JlLXBhaW4tZm9yLWV0aGVyZXVtLWV0aC1wcmljZS1hbmFseXNpcy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Bounce to $2K or More Pain for Ethereum? (ETH Price Analysis) - CryptoPotato",
        "content": "After facing rejection for several weeks and experiencing a series of bearish developments, the price of Ethereum reached a critical point near a pivotal support area. This includes the 61.8% Fibonacci retracement level.\n\nFortunately, the price returned from this crucial zone, providing hope amidst the prevailing bearish sentiment. This rebound also indicates the possibility of a temporary consolidation phase.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nEthereum’s price has been in a prolonged downtrend, breaking multiple support levels, including the crucial 100 and 200-day moving averages. As a result, Ethereum reached a multi-month low at $1,531. However, at this point, Ethereum’s price encountered a critical support zone, spanning the range between the 50% and 61.8% Fibonacci retracement levels.\n\nDespite this, market participants see this range as the final defense for Ethereum bulls. If the price drops below this threshold, it could increase the likelihood of a significant downward plunge.\n\nIn addition to these bearish signals, the 100-day moving average crossed below the 200-day moving average, forming a death cross event, which is a strong bearish signal. However, despite these bearish indicators, there is still hope that the price could find support and enter a consolidation phase, moving around the 200-day and 100-day moving averages.\n\nThe 4-Hour Chart\n\nShifting our focus to the 4-hour timeframe, we can see that Ethereum’s price underwent a consolidation phase between the $1.6K-$1.8K price range. During this period, a bearish flag pattern formed, and eventually, the price broke below the lower trendline of the flag, triggering a significant downward movement.\n\nHowever, as Ethereum approached the critical support level at $1.5K, buying pressure intensified, leading to a rebound. This resulted in a retracement towards the lower threshold of the broken flag, potentially forming a pullback. If this pullback occurs successfully, it could indicate the start of another downward phase, aiming to break below the $1.5K mark.\n\nOn the other hand, if the price fails to complete the pullback and instead breaks above the trendline, market participants may anticipate a surge toward the $1.7K resistance level. Therefore, it is crucial to closely monitor these price fluctuations, as the upcoming price action around these significant support and resistance levels will likely determine Ethereum’s mid-term trajectory.\n\nOn-chain Analysis\n\nBy Shayan\n\nThe provided chart displays the Taker Buy Sell Ratio metric, complemented by a 30-day simple moving average, alongside Ethereum’s price. This metric helps assess whether buyers or sellers are aggressively executing their orders. Positive values typically indicate bullish sentiment, while negative values are bearish indicators.\n\nHowever, Ethereum’s price has been on a downtrend recently, repeatedly facing rejection around the $2,000 resistance level. The metric has consistently remained negative for the past few months, reflecting a prevailing bearish sentiment in the ETH futures market.\n\nNevertheless, there has been a notable shift in this metric as it suddenly surged, bringing its value closer to the neutral 0 line. This surge suggests a potential change in sentiment among market participants, indicating a shift towards a more bullish stance.\n\nIf this metric continues its upward trajectory and enters positive territory, it could signal the beginning of a new phase characterized by bullish price action. In such a scenario, Ethereum’s price may experience an upsurge, potentially targeting higher resistance levels."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xOTc2ODcvaG93LXNwaWRlcmNoYWluLXBsYW5zLXRvLWJ1aWxkLWV0aGVyZXVtLW9uLWJpdGNvaW7SAVJodHRwczovL2RlY3J5cHQuY28vMTk3Njg3L2hvdy1zcGlkZXJjaGFpbi1wbGFucy10by1idWlsZC1ldGhlcmV1bS1vbi1iaXRjb2luP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "How ‘Spiderchain’ Plans to Build Ethereum on Bitcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFollowing weeks of debate about Bitcoin drivechains, a similar project to unlock the network’s programming potential is picking up steam.\n\nOn Monday, Jameson Lopp—co-founder and CTO of mobile self-custody firm Casa—published a blog post about “Spiderchain,” which he called “yet another proposal for building 2-way pegged sidechains.”\n\nA sidechain is a separate blockchain that is tied into the main Bitcoin network in some way. They typically use the same native currency—BTC—and may also leverage Bitcoin’s security guarantees. Sidechains let Bitcoiners access more features with their BTC that the main network can’t always provide, such as scalability, programmability, and privacy.\n\nAD\n\nAD\n\nA prevailing difficulty with sidechains, however, is building a “2-way peg” allowing BTC to be safely transferred to the sidechain and back without requiring a centralized middleman.\n\nThat’s where the Spiderchain, developed by Botanix Labs, comes into play.\n\n“The Spiderchain works as a Proof of Stake Layer 2 on Bitcoin,” Willem Schroé, founder of Botanix Labs, told Decrypt. “You stake Bitcoin on Bitcoin in decentralized multisigs.”\n\n\n\nEntities that manage decentralized multisigs are called “orchestrators,” who run both a Bitcoin node and a Spiderchain node. With every request to move BTC to the Spiderchain, a new multisig is created that’s controlled by a random subset of 100 participants within the staker set.\n\nIn many ways, the Spiderchain operates much like Ethereum: it is Ethereum Virtual Machine-compatible, has 12-second block times, and uses a proof of stake consensus mechanism to secure the network, whereby orchestrator nodes must stake BTC to participate.\n\nIts EVM is also “fully equivalent,” meaning existing Ethereum dapps can be easily transferred over to the network by developers. But unlike Ethereum, Schroé said that a malicious majority of orchestrators still cannot conspire to steal users’ BTC.\n\nAD\n\nAD\n\n“The design is possible on the current Bitcoin core, so no soft fork or upgrade is needed,” noted Schroé. This sets Spiderchain apart from Paul Sztorc’s drivechain proposal, which requires changing the Bitcoin code that users and miners are currently running.\n\n\n\nDrivechain was introduced as BIP 300 and BIP 301 back in 2015, and is still yet to be widely embraced for implementation by Bitcoiners.\n\nDrivechains effectively put control of pegged BTC into the hands of Bitcoin miners, but allow for any number of sidechains with any number of properties to be created. It also directly inherits Bitcoin’s security through merge mining, which piggybacks on the main network’s immense proof of work security.\n\nWhen asked about Spiderchains, Sztorc said they seem “very complex” compared to his proposal.\n\n“I also think that the whole \"needs a change to Bitcoin\" is pure superstition, unfortunately,” he added. “People think it means 'the network' must upgrade, but really it is like asking users to install an app on their phone.”\n\n\n\nIn Lopp’s Monday blog post, the CTO cited the nearly decade-old Rootstock proposal, and pointed out some technical vulnerabilities with Spiderchain. Among them is the risk that its BTC peg is “broken” if the main Bitcoin blockchain experiences a reorg of longer than five blocks, due to the system by which Spiderchain orchestrators are determined.\n\n\n\n“It would be unlikely to be catastrophic due to how the funds are dispersed across many multi-sig wallets,” he noted.\n\n\n\nSchroé also admitted that in the network’s early stages, Spiderchain will be centralized until more users can come in to stake their BTC. “We need to start off centralized in the sense that initially we will have to make the staking permissioned,” he said."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmRhaWx5ZnguY29tL25ld3MvaGF2ZS1iaXRjb2luLWV0aGVyZXVtLWNhcGl0dWxhdGVkLWJ0Yy11c2QtZXRoLXVzZC1wcmljZS1zZXR1cHMtMjAyMzA5MTguaHRtbNIBbWh0dHBzOi8vd3d3LmRhaWx5ZnguY29tL25ld3MvaGF2ZS1iaXRjb2luLWV0aGVyZXVtLWNhcGl0dWxhdGVkLWJ0Yy11c2QtZXRoLXVzZC1wcmljZS1zZXR1cHMtMjAyMzA5MTguaHRtbC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Have Bitcoin & Ethereum Capitulated? BTC/USD & ETH/USD Price Setups - DailyFX",
        "content": "Bitcoin, BTC/USD, Ethereum, ETH/USD - Outlook:\n\nBitcoin is attempting to rise above immediate resistance.\n\nETH / USD has been holding above a vital support.\n\nWhat is the outlook and what are the key levels to watch?\n\nRecommended by Manish Jaradi How to Trade the \"One Glance\" Indicator, Ichimoku Get My Guide\n\nBITCOIN: Holds above 25000\n\nOver the past few weeks, Bitcoin has been holding above strong horizontal trendline support since mid-August, roughly coinciding with the June low of 24750. Last week, BTC/USD attempted to rise above immediate resistance at the early-September high of 26500. While the price action is still unfolding – BTC/USD hasn’t broken above 26500 cleanly – the ongoing attempt to rise above 26500 raises the chances that the worst could be over.\n\nBTC/USD 240-Minute Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nThat’s because trends generally turn with capitulation. And the brief dip below 25000 last week coupled with the attempt to rise past 26500 suggests the tide could be turning temporarily in favour of BTC/USD. Still, a decisive rise above the resistance is needed for the imminent downside risks to fade. Such a break could open the upside toward the end-August high of 28150.\n\nBTC/USD Weekly Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nHaving said that, a fall below 24750-2500 would negate the above scenario, potentially triggering a double top (the April and July highs), pointing to a deeper retracement toward the March low of 19550. For more discussion on this, see “Bitcoin & Ethereum Influenced by Thick Cloud Cover; BTC/USD & ETH/USD Price Setups,” published September 5.\n\nETH/USD Daily Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nETHEREUM: Awaiting confirmation of a low\n\nIn contrast, while Ethereum has been holding above its August low of 1550, ETH/USD has yet to rise above a meaningful resistance. In line with BTC/USD, similar resistance for ETH/USD is at the early-September high of 1660. Until some sort of upward momentum develops, the balance of risks for ETH/USD remains toward the downside in the near term – not the 14-day Relative Strength Index has been capped at the 50-mark – indicating a corrective rally, rather than the start of a new uptrend.\n\nETH/USD 240-Minute Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nBelow the August low of 1550, the next support is on the lower edge of a downtrend channel since April (now at about 1500). A break below the 1500-1550 region could pave the way toward the October low of 1370.\n\nAs noted earlier this month, ETH/USD has been under the influence of the bearish Ichimoku cloud cover on the weekly charts. Furthermore, in recent weeks, ETH/USD has been snowed under the Ichimoku cloud on the daily charts. At a minimum, Ethereum needs to surpass 1660. A stronger signal that an interim low was in place would be a crack above the end-August high of 1750.\n\nRecommended by Manish Jaradi Get Your Free Introduction To Cryptocurrency Trading Get My Guide\n\n--- Written by Manish Jaradi, Strategist for DailyFX.com\n\n--- Contact and follow Jaradi on Twitter: @JaradiManish"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xOC9jYXJkYW5vLXNvbGFuYS1hbmQteHJwLXNlZS1pbnN0aXR1dGlvbmFsLWluZmxvd3Mtd2hpbGUtYml0Y29pbi1hbmQtZXRoZXJldW0taW52ZXN0bWVudHMtc2xpZGUtY29pbnNoYXJlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Cardano, Solana and XRP See Institutional Inflows While Bitcoin and Ethereum Investments Slide: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares reports that Cardano (ADA), Solana (SOL) and XRP products are bucking the trend of an otherwise pessimistic institutional investment climate.\n\nIn its latest Digital Asset Fund Flows Weekly Report, CoinShares says investors are currently less optimistic as reflected in outflows over eight of the last nine weeks totaling over $450 million.\n\nCoinShares finds that digital assets saw outflows of $54 million last week, marking the fifth week of outflows in a row.\n\n“Digital asset investment products saw outflows totaling US$54m last week, marking the 5th consecutive week. There have been outflows for 8 out of the last 9 weeks that aggregate to US$455m, with year-to-date net inflows falling to just US$51m.”\n\nAccording to CoinShares, much of the outflow activity can regionally be traced back to the United States.\n\nPer usual, the leading crypto by market cap Bitcoin (BTC) suffered the heaviest outflows.\n\n“Bitcoin comprised 85% of the outflows, seeing US$45m last week. Short-bitcoin inflows the prior week proved to be short-lived, with outflows of US$3.8m last week, However, it remains the most loved investment product with month-to-date inflows at US$12m.”\n\nMeanwhile, Ethereum (ETH) products bled out to the tune of nearly $5 million last week, while Binance Coin (BNB) and Polygon (MATIC) lost $0.3 million each.\n\nNot all altcoins went down though. Solana (SOL), Cardano (ADA), and XRP products all saw inflows totaling $0.7 million, $0.4 million, and $0.1 million, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtMjctNTAwLWluLXRoZS1jYXJkcy1mb3ItYnRjLWJlZm9yZS1hLWJpZy1tb3ZlLTIwMjMwOTE4MTcwMNIBnAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLTI3LTUwMC1pbi10aGUtY2FyZHMtZm9yLWJ0Yy1iZWZvcmUtYS1iaWctbW92ZS0yMDIzMDkxODE3MDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: $40 million in total liquidations as BTC yanks - FXStreet",
        "content": "Share:\n\nBitcoin price is up almost 5% in the last day, with momentum indicators bolstering the bullish case, but resistance lies ahead.\n\nEthereum price is likely to face a rejection from the $1,682 level before a 10% pullback below the $1,552 range.\n\nRipple price coils up for a run down to the $0.4600 support level unless bulls show resilience.\n\nBitcoin (BTC) price sprinted north then pulled back in an interesting turn of events that saw up to $40 million in total liquidations within a day. Specifically, $30.95 million shorts against $11.95 million longs were liquidated.\n\nBTC liquidations\n\nEthereum (ETH) price followed BTC in the fluctuations, just the only $10 million shorts were liquidated against $5 million longs. Meanwhile, Ripple (XRP) price is at an inflection point.\n\nAlso Read: Bitcoin open interest outperformed crypto markets amid BTC Spot ETF hype\n\nBitcoin price has a big move on the cards\n\nBitcoin (BTC) price is trading with a bullish bias, although much remains to be said as it confronts a critical barrier at $27,500. However, momentum indicators suggest rising momentum, and if sustained, the flagship cryptocurrency could shatter this level, with the potential to extend into the $28,000 range.\n\nFurther north, and in a highly bullish case, Bitcoin price could rise to the supply zone at $29,367, confirming the uptrend above this supplier congestion zone.\n\nThe Relative Strength Index (RSI) is moving north, suggesting rising momentum, just like the Awesome Oscillator (AO) is flashing green to show bulls are leading the market.\n\nBTC/USDT 1-day chart\n\nConversely, a rejection from the $27,500 level could catch longs off guard. This could send Bitcoin price south, with a forecasted target below the $26,640 range and into the foothold of the descending trendline.\n\nIn a dire case, the largest crypto by market capitalization could extend to the demand zone, confirming the downtrend below its mean threshold at $25,357, or worse, extrapolate lower in an attempted liquidity grab.\n\nAlso Read: Bitcoin punches above $27k, but analysts have bearish price predictions\n\nEthereum price is committed to BTC\n\nEthereum (ETH) price has mirrored Bitcoin’s price action for a long time now, with its strong correlation suggesting it will follow the king of crypto to its next move. As such, with the momentum RSI and AO indicators painting a bullish picture, ETH could breach the $1,682 level and extend north.\n\nETH/USDT 1-day chart\n\nHowever, a closer look suggests an impending slump in Ethereum price, just like in the case of BTC with a lot of uncollected liquidity resting underneath. With this, the largest altcoin by market capitalization is likely to correct below the $1,552 support level before a sustainable move north.\n\nAlso Read: Ethereum Layer 2 networks BASE, zkSync Era make history, ETH bites the dust"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZG9nZWNvaW4vZG9nZWNvaW4tYml0Y29pbi1ldGhlcmV1bS_SAURodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2RvZ2Vjb2luL2RvZ2Vjb2luLWJpdGNvaW4tZXRoZXJldW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "How Much Will Dogecoin Trade At If It Attains The Market Cap Of Bitcoin Or Ethereum? - NewsBTC",
        "content": "Comparisons in the crypto market are not out of the norm, especially given the fierce rivalry that goes on between two or more tokens at a time. So this report will take a look at where the price of Dogecoin will realistically be if the meme coin’s market cap were to reach the current market cap of Bitcoin or Ethereum.\n\nDogecoin With The Market Cap Of Bitcoin\n\nBitcoin, the world’s largest cryptocurrency, has a market cap of $521 billion. This is over 2x the market cap of the second-largest cryptocurrency Ethereum, and makes up around half of the total crypto market cap. While this is interesting, a more interesting fact is where the price of Dogecoin would be if it were to reach the market cap of Bitcoin.\n\nCoinGecko’s Coin Comparison feature allows users to input two different cryptocurrencies and show how much one would trade for if they had the market cap of the others. Using this feature, NewsBTC has been able to determine how much a single DOGE token would be at a market cap of $521 billion.\n\nDOGE would trade at $3.70 with Bitcoin's market cap | Source: CoinGecko\n\nA single DOGE token at such a market cap comes out to $3.70 per token, an over 59x (5,900%) increase from its current price. Inversely, Bitcoin at the $8.8 billion market cap of Dogecoin would put each BTC at a price of $448.\n\nWhere Will DOGE Trade With Ethereum’s Market Cap\n\nEthereum is currently the second-largest cryptocurrency in the space with a market cap of $196 billion. With this market cap, the price of Ethereum’s nice ETH token is sitting at $1,635 with a circulating supply of 120,225,429 ETH.\n\nNow, using CoinGecko’s Coin Comparison feature and checking the price of where Dogecoin would be if it reaches the $196 billion market cap of Ethereum, it comes out to a $1.39 price point for the meme coin.\n\nDOGE would trade at $1.39 with Bitcoin's market cap | Source: CoinGecko\n\nFrom its current price of $0.06192, it comes out to a 22x or 2,200% move. On the flip side, Ethereum falling to the market cap of DOGE at $8.8 billion would see the digital asset’s price trade at just $72.53, a long way from its present value.\n\nThe price differences between the cryptocurrencies mentioned at the same market cap come down to their circulating supply. Dogecoin has a circulating supply of over 141 billion DOGE compared to 19.48 million BTC for Bitcoin and 120 million ETH for Ethereum.\n\nDOGE price at $0.06 with $8.8 billion market cap | Source: DOGEUSD on Tradingview.com\n\nFollow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from CoinMarketCap, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS10cmFkZXJzLWluY3JlYXNpbmdseS1idWxsaXNoLWFzLXRha2VyLWJ1eS1zZWxsLXJhdGlvLWhpdHMtbmV3LWhpZ2gv0gFmaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLXRyYWRlcnMtaW5jcmVhc2luZ2x5LWJ1bGxpc2gtYXMtdGFrZXItYnV5LXNlbGwtcmF0aW8taGl0cy1uZXctaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Ethereum traders increasingly bullish as taker buy-sell ratio hits new high - AMBCrypto News",
        "content": "ETH’s taker buy-sell ratio has risen steadily since 10 September\n\nWith strong resistance at $2000, ETH investments have continued to return very low profits\n\nEthereum’s [ETH] taker buy-sell ratio assessed on a 30-day simple moving average (SMA) has climbed to its highest level since 23 June. This, according to data from CryptoQuant.\n\nThe taker buy-sell ratio is a metric that measures the ratio between the buy volume and sell volume in an asset’s Futures market. A value greater than 1 indicates more buy volume than sell volume, while a value less than 1 indicates more sell volume than buy volume.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nA steady decline in this metric suggests that the Futures market for the asset concerned has become plagued by more sell orders than buy orders.\n\nDue to the significant resistance faced by ETH around the $2000-price level, its taker buy-sell ratio has trended south since 29 May. In fact, by 28 August, it had fallen to its lowest level this year.\n\nAlthough still below 1, CryptoQuant analyst ‘Greatest_Trader’ has now claimed that the surge in ETH’s taker buy-sell ratio since 10 September represents a re-emergence of positive sentiment. This might help drive up the altcoin’s value.\n\n“This surge suggests a potential change in sentiment among market participants, indicating a shift towards a more bullish stance. Should this metric continue its upward trajectory and venture into positive territory, it could herald the onset of a new phase characterized by bullish price action. In such a scenario, Ethereum’s price might experience an upsurge, potentially targeting higher resistance levels.”\n\nETH promises little to no returns for now\n\nWhile positive sentiments might be returning to ETH’s Futures market, the general market appears rife with bearish activity. This, as gleaned from the consistent decline in the daily count of profitable transactions involving the alt.\n\nAccording to Santiment, the ratio of ETH’s daily on-chain transaction volume in profit to loss has fallen over the last month. With a figure of 0.85 at press time, it suggested that for every ETH transaction that resulted in a loss, only 0.85 returned profit.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAlso, after peaking at 23% on 29 July, the coin’s Market Value to Realized Value (MVRV) has dropped. This metric tracks when an asset becomes overvalued or undervalued in relation to its historical price movements and the price at which it was last moved.\n\nFinally, with a reading of 18% at press time, the count of ETH holders who would log profit on their investments if they sold the coins has plummeted since the end of July."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS9zb2xhbmFzLTEtbmZ0LW1hcmtldHBsYWNlLWJlYXRzLXdob2xlLW5mdC1pbmR1c3RyeS1vbi1ldGhlcmV1bdIBUmh0dHBzOi8vdS50b2RheS9zb2xhbmFzLTEtbmZ0LW1hcmtldHBsYWNlLWJlYXRzLXdob2xlLW5mdC1pbmR1c3RyeS1vbi1ldGhlcmV1bT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Solana's #1 NFT Marketplace Beats Whole NFT Industry on Ethereum - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSolana's leading NFT marketplace is making waves, boasting nearly as many daily traders as all Ethereum-based NFT platforms combined. This is not just a fluke; it is a testament to the unique synergy between Solana's user-friendly, cost-effective blockchain and the ever-popular world of NFTs.\n\nAdvertisement\n\nWhy is this a big deal? Solana's blockchain is not just fast; it is also incredibly accessible. Combine that with NFTs, which have a universal appeal, and you've got a recipe for mass adoption. While Ethereum's NFT marketplaces are still performing well, the sheer volume of activity on Solana's top NFT platform should make anyone sit up and take notice.\n\nNow, let's talk numbers. Solana's current total value locked (TVL) stands at approximately $306.8 million, according to DefiLlama. This robust DeFi landscape adds another layer of allure to Solana's NFT marketplace, making it a one-stop-shop for all things crypto.\n\nAs for Solana's price performance, the latest data shows that one SOL is valued at around $18. While this might not be its all-time high, the coin has shown resilience and potential for growth, especially considering the anti-FUD measures Solana influencers are taking in order to battle the effect of the upcoming FTX liquidation.\n\nBut let's not get carried away. Ethereum has its strengths, and its NFT marketplaces are far from obsolete. However, the rapid rise of Solana's NFT platform is a wake-up call. It is a vivid reminder that the crypto space is ever-evolving, and what's hot today might not be tomorrow.\n\nSo, what is the takeaway? Solana and its NFT marketplace are a force to be reckoned with. They have tapped into a formula that combines speed, low costs and mass appeal. And while Ethereum will continue to be a major player in the NFT scene, it might just have to share the spotlight with Solana for a while."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9hcy1ldGhlcmV1bS1nYXMtdXNhZ2UtcGx1bW1ldHMtaG93LWhhcy10aGUtbmV0d29yay1mYXJlZC_SAVNodHRwczovL2FtYmNyeXB0by5jb20vYXMtZXRoZXJldW0tZ2FzLXVzYWdlLXBsdW1tZXRzLWhvdy1oYXMtdGhlLW5ldHdvcmstZmFyZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "As Ethereum gas usage plummets, how has the network fared - AMBCrypto News",
        "content": "Ethereum’s total gas usage declined to around 107.6 billion from 107.9 billion.\n\nFees have also decreased recently.\n\nRecent data indicates a significant decrease in Ethereum [ETH] gas usage. Has a decrease in network interactions accompanied this decline in gas usage?\n\nHow much are 1,10,100 ETHs worth today\n\nEthereum gas usage sees a sharp drop\n\nAs per a recent update from Glassnode Alerts, Ethereum has experienced a recent reduction in its daily gas consumption. According to their report, this decrease marked the lowest gas usage observed over the past month.\n\nThe provided chart illustrates that ETH gas usage has fallen to approximately 4.4 billion. As of this report, the total gas consumption was approximately 107.6 billion. Before this decline, the total gas usage had exceeded 107.9 billion.\n\nEthereum addresses see a slight impact\n\nAccording to Santiment’s 30-day active addresses chart, there has been a recent uptrend in the number of active addresses, suggesting an increase in the addresses engaging with the network. The chart illustrated a rise from approximately 5.7 million to over 6 million as of the latest data available.\n\nHowever, when examining the daily active addresses metric, it’s evident that there has been a decline in recent days. As of 14 September, there were more than 452,000 daily active addresses, but this number dropped to around 373,000 by 16 September.\n\nAt the time of this report, the number has further decreased to approximately 140,000.\n\nTransaction fees drop to second-lowest\n\nThe volume chart on Santiment revealed a recent decline in Ethereum’s trading volume. On 14 September, the volume was recorded at over $5 billion, but it subsequently dropped to approximately $3.7 billion on 16 September. As of this writing, the volume was around $2.7 billion.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAdditionally, according to data from Crypto Fees, Ethereum has maintained its position at the top of the list in terms of transaction fees despite the drop in gas usage. However, upon closer examination, it’s evident that transaction fees have been decreasing over the past few days.\n\nAs of this report, the fee was slightly over $2.4 million, and this decline in fees appears to be a consistent trend. Notably, this fee was the lowest that the network has seen in over three months, with the previous lowest fee recorded at $2.2 million on 10 September."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMTgvY3J5cHRvLXdoYWxlLXRha2VzLTE1MG0tYnVsbGlzaC1iZXQtb24tZXRoZXItdHJhZGluZy1kYXRhLXRyYWNrZXItc2hvd3Mv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOS8xOC9jcnlwdG8td2hhbGUtdGFrZXMtMTUwbS1idWxsaXNoLWJldC1vbi1ldGhlci10cmFkaW5nLWRhdGEtdHJhY2tlci1zaG93cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Crypto Whale Trades $150M in ETH Call Options, Trading Data Tracker Shows - CoinDesk",
        "content": "Since then, ether has bounced to $1,634. Prices have risen 36% this year. According to research firm RxR, the cryptocurrency is trading at a discount of 27% to its fair value based on a Metcalf law model, incorporating active user adoption on both the mainnet and the layer 2 scaling solution."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1zdXJnZXMtYWJvdmUtMjY2MDAtZXRoZXJldW0taG9sZHMtMTYwMC1sZXZlbC9hcnRpY2xlc2hvdy8xMDM3NTEyNzMuY21z0gGYAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXN1cmdlcy1hYm92ZS0yNjYwMC1ldGhlcmV1bS1ob2xkcy0xNjAwLWxldmVsL2FtcF9hcnRpY2xlc2hvdy8xMDM3NTEyNzMuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin surges above $26,600; Ethereum holds $1,600 level - The Economic Times",
        "content": "ETMarkets.com\n\nThe crypto tokens were trading mixed in Monday's trade ahead of a key US Federal Reserve policy meeting later this week. Bitcoin, Ethereum, BNB , Solana and Litecoin were trading with gains, while XRP Dogecoin , Toncoin and Shiba Inu were trading with cuts.Bitcoin (BTC) rose 0.55% to $26,678, whereas Ethereum (ETH) was above the 1,600 level. Meanwhile, the global cryptocurrency market cap was trading higher, around $1.06 trillion, rising 0.29% in the last 24 hours.\"The weekend witnessed Bitcoin trading above the $26,000 level, possibly driven by a noteworthy collaboration between Deutsche Bank, Germany's leading bank, and Taurus, a Swiss cryptocurrency startup specializing in secure asset management and tokenization services,\" Edul Patel- CEO & Co-founder of Mudrex, said.\"Investors are awaiting the Federal Open Market Committee meeting scheduled for September 20, which may influence market dynamics. Bitcoin's next challenge is to surpass the $27,400 resistance level to maintain its upward momentum,\" Edul said.The total volume in DeFi is currently $2.14 billion, 11.27% of the total crypto market 24-hour volume. The volume of all stablecoins is now $16.79 billion, which is 88.6% of the total crypto market 24-hour volume.Bitcoin's dominance is currently 49.04%, according to CoinMarketCap. Meanwhile, BTC volume stood at approximately $7.6 billion, rising 14.17% in the last 24 hours.\"After three consecutive weeks of Doji candlestick patterns on the weekly Bitcoin chart, this week's positive close suggests a shift in favour of the bulls. However, the ongoing recovery remains in its early stages, and the Federal Open Market Committee meeting on September 20 could introduce volatility,\" said CoinDCX Research Team.Bitcoin is poised to conclude the week with gains, signalling a potential resolution of the ongoing uncertainty between buyers and sellers in favour of the bulls.On September 14th, Bitcoin managed to climb above the 20-day exponential moving average, currently situated at $26,303, which suggests a diminishing selling pressure. Since then, the bulls have successfully defended against multiple attempts by bears to drive the price below the 20-day EMA. While this recovery is still in its early stages, the upcoming Federal Open Market Committee meeting on September 20th could introduce additional volatility.BTC last week, again tested the critical support of $25,000 (Horizontal Trendline & 50% Fibonacci Retracement Level) as it made a low of $24,901. However, it failed to give a daily closing below the support and after that, the asset witnessed some recovery as it rallied up to $26,888 by forming four consecutive green candles.BTC has strong resistance at $28,500 and $32,500 and to catch a rally it needs to break, close and sustain above $32,500 whereas a break below the support of $25,000 will lead to further downfall.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vdS50b2RheS9idGMtZXRoLXdoYWxlcy1wbGF5aW5nLXdhaXRpbmctZ2FtZS1oZXJlcy1ob3fSAUFodHRwczovL3UudG9kYXkvYnRjLWV0aC13aGFsZXMtcGxheWluZy13YWl0aW5nLWdhbWUtaGVyZXMtaG93P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "BTC, ETH Whales Playing Waiting Game, Here's How - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAs lead cryptocurrencies Bitcoin and Ethereum continue to consolidate in a range, on-chain data offers a picture of what is likely going on with the group of large holders, or whales.\n\nAdvertisement\n\nOn-chain analytics firm Santiment paints a plausible picture of whales playing the waiting game in anticipation of higher prices in the days ahead.\n\n🐳 #Bitcoin continues to trade between $26K-$27K, and #Ethereum at $1.6K to 1.65K. #Crypto's top market caps' $100K+ transaction levels are at their lowest levels of 2023 right now. This is a sign of whales likely waiting, and not necessarily disinterest. https://t.co/FKfhB5X3Yh pic.twitter.com/m9990wqlpM — Santiment (@santimentfeed) September 18, 2023\n\nAccording to Santiment, large transactions, which refer to those greater than $100,000, are at their lowest levels so far in 2023. It was mentioned that this might be a sign of whales waiting for the best moment and not necessarily of disinterest, as some may think.\n\n\"Bitcoin continues to trade between $26K and $27K, and Ethereum is at $1.6K to 1.65K. Crypto's top market caps' $100K+ transaction levels are at their lowest levels of 2023 right now. This is a sign of whales likely waiting, and not necessarily disinterest,\" Santiment tweeted.\n\nAn albeit bullish scenario is playing out among long-term holders, whose numbers keep reaching new highs. Long-term Bitcoin hodlers, or those whose average purchase date is at least more than 155 days ago, now control 70% of the total supply of Bitcoin, or 14,787,265 BTC.\n\nAs the number of this category of Bitcoin holders continues to grow, top Bitcoin analyst Charles Edwards points out a trend of accumulation, saying, \"They are accumulating for the next bull run. \" Edwards also stated that over 57% of the Bitcoins on the network have not moved their capital in over two years.\n\nAt the time of writing, BTC was up 1.16% in the last 24 hours to $26,865. Recent analysis provided by crypto analyst Ali indicates that a boost in BTC buying pressure might target $28,000 or $31,000, whereas an invalidation of this bullish scenario might occur if BTC dips below $24,500.\n\nWhale places $150 million bullish bet on ETH\n\nAs reported by Wu Blockchain, the cumulative number of block calls traded for Ethereum has reached 92,600 ETH in the last 24 hours.\n\nIn just the past hour, over 40,000 ETH Block calls were traded, almost all buying 29DEC23-2200-C, and with the nearly 50,000 buying 27OCT23-2000-C last night, the cumulative number of block calls traded has reached 92,600 ETH. The whale actively bought $150 million worth of… — Wu Blockchain (@WuBlockchain) September 18, 2023\n\nAlso, a whale is trading a large number of call options. The said whale actively bought $150 million worth of notional ETH calls, and all of them were naked buys with clear long-term bullish expectations.\n\nAt the time of writing, ETH was trading in the green and was marginally up in the last 24 hours to $1,636."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3p5Y3J5cHRvLmNvbS93aHktZXRoZXItdGhyaXZlZC13aXRob3V0LXNlYy1zY3J1dGlueS1hbWlkLXdoaXNwZXJzLW9mLWEtY29uc3BpcmFjeS1hZ2FpbnN0LXJpcHBsZXMteHJwLWNhcmRhbm9zLWhvc2tpbnNvbi_SAYUBaHR0cHM6Ly96eWNyeXB0by5jb20vd2h5LWV0aGVyLXRocml2ZWQtd2l0aG91dC1zZWMtc2NydXRpbnktYW1pZC13aGlzcGVycy1vZi1hLWNvbnNwaXJhY3ktYWdhaW5zdC1yaXBwbGVzLXhycC1jYXJkYW5vcy1ob3NraW5zb24vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Why Ether Thrived Without SEC Scrutiny Amid Whispers Of A Conspiracy Against Ripple’s XRP — Cardano’s Hoskinson - ZyCrypto",
        "content": "Advertisement\n\nAs the SEC continues its row with Ripple Labs, whispers of a conspiracy against XRP have surfaced.\n\nCardano’s founder dismissed claims that Ethereum may be behind XRP’s legal battle with the securities watchdog.\n\nHe suggests that personal relationships may have steered Ethereum away from the SEC’s regulatory net.\n\nCardano’s founder says Ethereum may have reaped the benefits of “personal relationships” and “backroom stuff” in avoiding the SEC’s searchlight.\n\nCardano’s founder Charles Hoskinson has weighed in on the rumours hinting at a conspiracy against Ripple Labs by the Securities and Exchange Commission (SEC) and Ethereum (ETH). According to a post on X, Hoskinson pointed out that it is highly unlikely for Ethereum to have “bribed” the SEC to go after Ripple Labs.\n\nHoskinson noted that the reports of an Ethereum conspiracy against Ripple were widely exaggerated on the grounds that Ripple’s XRP was not a competitor in the smart contract ecosystem.\n\nHis comments come in the wake of scathing claims by Steven Nerayoff, an early Ethereum adviser, noting that the SEC may have turned a blind eye to Ethereum’s shortcomings during its initial coin offering (ICO) stage.\n\nHoskinson disclosed that the SEC’s decision to ignore Ethereum in the early years could be linked to the interplay of personal relationships and behind-the-scenes dealings. He added that while the allegation raises eyebrows, similar “backroom stuff” occurs in several key sectors, including Big Pharma, telecommunications, and defense industries.\n\nAdvertisement\n\n“I’ve always believed that when Ethereum was an 18 million dollar ICO and very few people were doing them, the SEC decided to ignore it and crypto, and they got lucky to be too old to consider after the eye of Sauron moved over,” said Hoskinson.\n\nThe SEC has been embroiled in a long-running legal fiasco with Ripple Labs over allegations of offering unregistered securities to the public. Ripple Labs has maintained its innocence, opting to slug it out with the regulator in court, earning a partial victory after nearly three years.\n\nSince the SEC labelled XRP a security, critics have been probing how Ethereum managed to “satisfy the magical agency pixie dust” after SEC staff William Hinman claimed in a speech that ETH was not a security.\n\nTurning a blind eye to Ethereum\n\nAccording to the allegations mooted by Nerayoff, the SEC turned a blind eye to a number of infractions revolving around Ethereum’s ICO. Nerayoff claimed that the ICO process was far from transparent, hinting that whales may have concealed their true positions.\n\nThere are further allegations that Ethereum may have breached its Terms of Service (ToS), raising doubt over the decentralization of the project.\n\nFlowing from the allegation, the founder of Dizer Capital Yassin Mobarak stated that the SEC may not proceed with its case against Ripple in order to protect the “skeletons in its closet.”\n\n“How could these executives be expected to know, back in 2013-2018, that XRP was a security when these shenanigans were going on at the SEC?” asked Mobarak."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3VudmVpbGluZy1iaXRjb2luLXNwYXJrLXRoZS1uZXh0LWJpZy1wbGF5ZXItYWZ0ZXItYml0Y29pbi1hbmQtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Unveiling Bitcoin Spark: The Next Big Player After Bitcoin and Ethereum - Analytics Insight",
        "content": "Cryptocurrencies have reshaped the entire DeFi ecosystem since Bitcoin rose to fame in 2013. The crypto platform is widely known for its lucrative uncontrolled perks, making it the ideal antithesis of modern-day banking systems. Although Bitcoin is the most prominent digital asset in popularity and market capitalization, the platform has a docile network with high transaction fees, low transaction speeds, and limited scalability. Other platforms, such as Ethereum and Bitcoin Spark, have emerged to bring further decentralization in finance and solve some of the significant Bitcoin shortcomings.\n\nWhat is Ethereum?\n\nEthereum is an old-generation blockchain pioneered after Bitcoin was invented to offer a suitable alternative to Bitcoin’s limited network. Ethereum started as a proof-of-work blockchain, mimicking Bitcoin’s network validation process. Proof of work is a heavyweight network verification process that consumes much energy and involves a high initial outlay. Ethereum successfully underwent a major hard fork upgrade in September 2022, transitioning to a proof of stake consensus, a network verification that is less complicated and eco-friendly.\n\nBitcoin Spark is the next Big crypto platform\n\nBitcoin and Ethereum paved the way for the growth of decentralized finance projects. Among the upcoming platforms is Bitcoin Spark, a major Bitcoin hard fork potentially bringing massive changes to the industry. Bitcoin Spark has a new consensus mechanism called proof of process that leverages proof of work and proof of stake consensus mechanisms to enhance network operations for Bitcoin Spark users. In other words, the network accommodates both mining and staking activities, and the network participants are rewarded in the platform’s native digital asset, BTCS.\n\nThe Bitcoin Spark network is still under development and is expected to go live on the mainnet soon after the ongoing ICO ends. The network’s “proof of work” aspect will be the primary validation process that will provide processing power to the network. Unlike Bitcoin, BTCS mining has a reduced mining power consumption rate required to confirm new Bitcoin Spark blocks.\n\nFor parties interested in beginning the mining process, the Bitcoin Spark devs will launch an online application tool that will allow them to calculate the estimated returns. The Bitcoin Spark network is divided into four layers. First is the execution layer, which is where the creation of a block takes place. This layer will operate on the Bitcoin Spark validator blueprint.\n\nThe second layer is the consensus layer, which mediates between all validator nodes to come up with an agreement concerning the validity of a block. The third layer is the mining layer. This layer runs independently from other layers. The mining layer’s output yields the platform processing power helpful in completing virtual complex tasks such as film rendering. The last layer is the rewards layer. This layer gets information from the mining layer’s computational data summaries but lacks access to encrypted data encoded on the Bitcoin Spark blocks.\n\nBitcoin Spark is a utility platform with an ongoing ICO event. The team is currently distributing BTCS tokens to early enterprising individuals who wish to participate in the project’s early development as well as get significant gains on their invested capital. BTCS is retailing for $2.50 each in the current 5th ICO stage.\n\nLearn more about Bitcoin Spark on:\n\nWebsite: https://bitcoinspark.org/\n\nBuy BTCS: https://network.bitcoinspark.org/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMi0wFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLXNlcHRlbWJlci0xNy1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNjMwMTQw0gHXAWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktaW4taW5kaWEtc2VwdGVtYmVyLTE3LWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE2MzAxNDAvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Sees Losses As Toncoin Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to remain above the $26,000 and $16,000 marks, respectively, on early Sunday morning. However, in terms of percentage-wise performance, BTC saw a loss of 0.25 per cent. Other popular altcoins — including the likes of Litecoin (LTC), Ripple (XRP) — landed in the negative as overall prices saw minor losses across the board. Toncoin (TON) emerged to be the biggest gainer, seeing a 24-hour jump of over 2.38 per cent. VeChain (VET), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.06 trillion, registering a 24-hour loss of 0.43 per cent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $26,532.19 seeing a 24-hour loss of 0.25 per cent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 22 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,628.74, marking a 24-hour loss of 0.75 per cent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.39 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour loss of 0.65 per cent as per CoinMarketCap data, currently priced at $0.06204. As per WazirX, Dogecoin price in India stood at Rs 5.3001.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 3.43 per cent. At the time of writing, it was trading at $63.93. LTC price in India stood at Rs 5,543.40.\n\nRipple (XRP) price today\n\nXRP price stood at $0.4969, seeing a 24-hour loss of 0.80 per cent. As per WazirX, Ripple price stood at Rs 42.7889.\n\nSolana (SOL) price today\n\nSolana price stood at $18.98, marking a 24-hour loss of 1.78 per cent. As per WazirX, SOL price in India stood at Rs 1,663.33.\n\nTop crypto gainers today (September 17)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nToncoin (TON)\n\nPrice: $2.38\n\n24-hour gain: 12.43 per cent\n\nMultiverseX (EGLD)\n\nPrice: $25.85\n\n24-hour gain: 3.41 per cent\n\nConflux (CFX)\n\nPrice: $0.1231\n\n24-hour gain: 2.47 per cent\n\nImmutable (IMX)\n\nPrice: $0.5333\n\n24-hour gain: 2.18 per cent\n\nRocket Pool (RPL)\n\nPrice: $22.80\n\n24-hour gain: 1.72 per cent\n\nTop crypto losers today (September 17)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nVeChain (VET)\n\nPrice: $0.01732\n\n24-hour loss: 5.88 per cent\n\nCompound (COMP)\n\nPrice: $39.05\n\n24-hour loss: 5.47 per cent\n\nOptimism (OP)\n\nPrice: $1.37\n\n24-hour loss: 3.92 per cent\n\nFilecoin (FIL)\n\nPrice: $3.29\n\n24-hour loss: 3.60 per cent\n\nAxie Infinity (AXS)\n\nPrice: $4.63\n\n24-hour loss: 3.47 per cent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aC1idXJucy01bS14bG0tYWRhLWFuZC1yb2UtZ2F0aGVyLWJ1bGxpc2gtc3RlYW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "$ETH Burns $5M; $XLM, $ADA, and $ROE Gather Bullish Steam - Analytics Insight",
        "content": "The cryptocurrency market has recently witnessed a whirlwind of events, leaving investors on the edge of their seats. Ethereum ($ETH) made headlines as it burned a staggering $5 million worth of its native currency, while alternative cryptocurrencies like Stellar ($XLM), Cardano ($ADA), and the emerging star Borroe.Finance ($ROE) have been steadily gaining momentum. In the dynamic world of crypto, these developments are driving the search for the best altcoin to buy. Let’s explore these exciting trends!\n\n>>BUY $ROE TOKENS NOW<<\n\nEthereum’s Remarkable $5 Million Burn\n\nOn a notable Tuesday, Ethereum experienced an extraordinary event. A total of 3,292.33 Ether (ETH), equivalent to an impressive $5 million was deliberately burned as part of Ethereum transactions. Burning in the crypto realm refers to the process of sending a coin or token to an unusable wallet, effectively removing it from circulation.\n\nWhy Ethereum’s Burn Matters\n\nThis substantial Ethereum burn stems from Ethereum Improvement Proposal 1159 (EIP-1159), which was implemented on August 5th, 2021. This Ethereum upgrade drastically transformed the fee model.\n\nNow, each transaction includes a variable base fee that adjusts according to the current demand for block space. What sets this apart is that this base fee is permanently removed from circulation, reducing the overall supply of Ether. This mechanism has far-reaching implications for Ethereum’s scarcity, potentially affecting its long-term value.\n\nBorroe.Finance ($ROE): The Best Crypto Investment Opportunity\n\nAmid these significant developments, Borroe.Finance ($ROE) stands out as a promising crypto project, positioning itself as the best crypto investment in the evolving crypto landscape. Borroe.Finance is a unique initiative dedicated to transforming the Web3 space, built on Polygon, a layer-2 blockchain lauded for its robust privacy features.\n\nBorroe.Finance introduces a revolutionary marketplace where the Web3 community can convert their future recurring income into Non-Fungible Tokens (NFTs), which are available for sale at discounted rates to buyers seeking upfront cash with full repayment on a fixed date.\n\nThis innovative platform integrates AI-powered risk assessment, secure blockchain technology, and streamlined payment solutions, facilitating a secure and efficient fundraising process. By enabling buyers to effortlessly sell and trade future recurring revenue NFTs directly with each other on secondary markets, Borroe.Finance fosters a truly peer-to-peer ecosystem.\n\n>>BUY $ROE TOKENS NOW<<\n\nInnovative Fee Structure for Long-Term Growth\n\n$ROE, the native token of Borroe.Finance, features a distinctive fee structure designed to incentivize responsible investment. It includes a 3% buy tax, with allocations of 1% towards burning, 1% for rewarding stakeholders, and 1% dedicated to marketing efforts. Additionally, a 3% sell tax encourages long-term holding, ensuring the sustainability and growth of the $ROE ecosystem.\n\nThe Borroe.Finance team is led by industry experts, including Michael Price, a former VP at XE.com, and Maxim Prishchepo, a respected figure in the blockchain space with extensive experience in tier 1 projects.\n\nThis transparent and credible leadership sets Borroe.Finance apart from projects with anonymous teams, instilling confidence and trust among investors. Furthermore, Borroe.Finance’s code has undergone rigorous auditing by Block Audit, one of the leading smart contract auditing platforms, ensuring the safety of all users.\n\nDon’t Miss Out on Borroe.Finance Presale\n\nBorroe.Finance is currently in the first stage of its presale, generating immense excitement among investors. Priced at a competitive rate of just $0.0125 per token, $ROE has captured the attention of investors seeking the best crypto to buy today.\n\nWith over 70 million $ROE tokens already sold during the presale, the funds raised will be dedicated to building a robust ecosystem and delivering utility to $ROE holders. To foster inclusivity, Borroe.Finance has significantly lowered the entry barriers to the presale, enabling anyone to participate in this exceptional opportunity.\n\nMoreover, multiple payment methods, including Bitcoin (BTC), Ethereum (ETH), and Binance Coin (BNB), have been integrated to accommodate a diverse range of crypto communities.\n\nExploring Stellar Lumen (XLM)\n\nStellar Lumen (XLM) is another altcoin that has caught the attention of investors. This cryptocurrency has been gaining ground due to its unique features and robust technology. In the next section, we will delve deeper into why investors are bullish on Stellar and what sets it apart in the crypto market.\n\nThe Appeal of Cardano ($ADA)\n\nCardano ($ADA) is yet another cryptocurrency that has garnered considerable interest. Its innovative features and the potential to revolutionize various industries have made it a top contender in the crypto space. We will explore the reasons behind the bullish sentiment surrounding Cardano in the following section.\n\nAs the crypto market continues to evolve and present new opportunities, Ethereum’s burn, alongside the rising prominence of alternative cryptocurrencies like Stellar ($XLM), Cardano ($ADA), and Borroe.Finance ($ROE), showcases the dynamic nature of this financial landscape.\n\nInvestors keen on identifying the best crypto investments and top altcoins to buy are in for an exciting journey filled with potential rewards.\n\nLearn more about Borroe.Finance ($ROE) here:\n\nVisit Borroe Presale | Join The Telegram Group | Follow Borroe on Twitter\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2NhbnRvLWJsb2NrY2hhaW4tbWlncmF0ZXMtdG8tZXRoZXJldW1zLWxheWVyLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Canto blockchain migrates to Ethereum's Layer 2, leveraging Polygon's technology to revolutionize ‘neofinance’ - Cryptopolitan",
        "content": "In a significant development for the blockchain community, Canto, a Layer 1 blockchain initially launched in 2022, announced its migration to Ethereum‘s Layer 2 (L2). The migration is facilitated by Polygon’s Chain Development Kit (CDK), a technology that enables the creation of zero-knowledge (ZK) chains. This move aims to focus on real-world assets and is seen as a step towards a “neofinance” future.\n\nThe role of Polygon CDK and zero-knowledge proofs\n\nPolygon’s CDK offers an open-source, permissionless framework that allows for the design of ZK chains, which can be customized to reflect a community’s ethos. These chains maintain their independence while being part of a unified ecosystem connected to Ethereum. For Canto, this means that if an agreement is reached within its community framework, known as the Canto Commons, core developers will construct a ZK L2 that embodies the community’s principles of permissionless sovereignty and public liquidity.\n\nThe migration will enable Canto to tap into a unified Polygon ecosystem that provides seamless access to Ethereum. Security for users will be ensured through a best-in-class ZK prover, inheriting cryptographic security from Ethereum. This eliminates the need for socio-economic incentives of fraud proofs, thereby enhancing trust and decentralization.\n\nTowards a neofinance future\n\nThe term “neofinance” refers to a new era of financial efficiencies achieved by deploying off-chain assets on blockchain protocols. Polygon’s modular design allows these efficiencies to be unlocked at scale, without compromising security or liquidity. For neofinance to be realized at scale, deep liquidity is essential, and this is where the migration to an Ethereum ZK-powered L2 comes into play. Canto will utilize a Plonky2 ZK proving implementation and will maintain its proof-of-stake validator set for decentralized sequencing. This ensures that there will be no changes for Canto’s existing validators or stakers.\n\nCanto is not alone in this migration trend. Earlier this year, Celo and Fantom also announced plans to become Ethereum Layer 2s, signaling a broader industry move toward Ethereum’s ecosystem. Canto now joins the ranks of Astar, Immutable, IDEX, and Palm Network as ZK-based Layer 2s built by the Polygon network.\n\nCanto’s migration to Ethereum’s Layer 2, facilitated by Polygon’s CDK, marks a significant milestone in the blockchain community’s ongoing efforts to integrate real-world assets and move towards a neofinance future. The migration not only enhances security and liquidity but also sets the stage for greater decentralization and trustless guarantees."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vaW52ZXN0b3Jza2luZy5jb20vMjAyMy8wOS8xOC9yeHItYW5hbHlzaXMtcmV2ZWFscy1ldGhlcnMtdHJ1ZS13b3J0aC0yNy1oaWdoZXItdGhhbi1tYXJrZXQtcHJpY2Uv0gFsaHR0cHM6Ly9pbnZlc3RvcnNraW5nLmNvbS8yMDIzLzA5LzE4L3J4ci1hbmFseXNpcy1yZXZlYWxzLWV0aGVycy10cnVlLXdvcnRoLTI3LWhpZ2hlci10aGFuLW1hcmtldC1wcmljZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "RxR Analysis Reveals: Ether’s True Worth 27% Higher than Market Price - Investors King Ltd",
        "content": "The first ever cryptocurrency was launched in 2009, and fourteen years later, crypto has experienced massive growth and adoption worldwide.\n\nFrom being accepted as legal tender in countries like El Salvador to being accepted as a payment method by businesses worldwide, digital currencies have proved they are here to stay and thrive. We have witnessed the boom of crypto globally, and Nigeria has not been left off the group chat.\n\nDespite the limitations of the Central Bank of Nigeria, Nigerians have been at the front line of cryptocurrency adoption in Africa , with millions of users. We all know Nigeria does not have the most stable economy, but we Nigerians have looked to crypto to give us leverage. It has helped us in many ways, from protection from inflation, currency devaluation and much more. With crypto, we can transact with anyone, anywhere in the world, without the need for middlemen, and it’s great for startups and small businesses in need of funding. All in all, crypto has been a game-changer for Nigerians, and it will only get bigger!\n\nAre you ready to hop on the crypto wave and start making money from it? It is never too late. That’s why I am here to share with you all you need to know on how to trade Ethereum in Nigeria. Keep reading to discover the benefits of trading Ethereum and exactly how to trade the popular crypto coin in Nigeria and get the most out of your investment.\n\nOverview of Ethereum\n\nIn 2015, Ethereum was released to the market by Vitalik Buterin, a young Russian programmer who saw the potential for blockchain technology beyond only crypto.\n\nWith Ethereum , developers can create decentralised applications (dApps) and smart contracts. Ethereum has its own crypto, Ether (ETH), used to pay for transactions and encourage developers to build on the platform.\n\nA brief history of Ethereum\n\nAlthough Ethereum was launched in 2015, the idea started in 2013 when Buterin wrote a whitepaper describing the concept of a blockchain platform that could be used beyond financial transactions.\n\nBut it did not stop there. In 2014, the project became quite popular as Buterin started a crowdfunding campaign to raise funds for Ethereum’s development.\n\nThe campaign was a huge success and even raised over $18 million worth of Bitcoin in only 42 days. Amazing, indeed.\n\nCurrently, Ethereum is one of the most popular blockchain platforms. It gave rise to thousands of decentralised applications, ranging from financial applications like decentralised exchanges (DEXs), stablecoins, to non-financial applications such as supply chain management and even voting systems.\n\nBenefits of Trading Ethereum in Nigeria\n\n1. Potential to Make Quick Profits:\n\nYou cannot deny that the whole point of making investments is to make a profit, which makes Ethereum a good choice. Like other crypto coins, the price of Ethereum is volatile, which means that its price can fluctuate rapidly over short periods. This makes it possible for traders to buy when the price is low and sell ETH for quick profit when it is high.\n\n2. Ability To Access a Global Market:\n\nTraditional financial markets are geographically limited, but the cryptocurrency market is global. This means that traders in Nigeria can buy Ethereum in Nigeria and also sell with anyone in the world, giving you access to a much larger market. Is Naira crashing again? Don’t worry; Ethereum has your back.\n\n3. Allows Traders To Bypass Traditional Financial Institutions:\n\nTraditional financial institutions are either inaccessible or unreliable in many parts of the world. The same is the case in Nigeria, from screaming at ATMs today to fighting for your money in the bank tomorrow. It’s a never-ending struggle.\n\nCrypto provides an alternative to these institutions, allowing you to transact directly with each other without the need for intermediaries.\n\nHow To Sell Ethereum For Cash in Nigeria\n\nIf you’re looking to sell your Ethereum in Nigeria, several options are available. One popular option is to use a crypto trading mobile app, Breet. Breet is a Nigerian-based OTC crypto trading app that allows you to convert Ethereum to naira , convert it to fiat currency and withdraw straight to your local bank account free of charge. Let me walk you through the steps of using Breet to sell Ethereum for Naira.\n\nStep 1: Download and Install Breet\n\nTo use Breet, you must first download and install the app on your mobile device. The mobile app is available for Android and iOS devices, and you can download it from the respective app stores.\n\nStep 2: Register and Verify Your Account\n\nOnce you’ve installed the app, you must create an account with Breet. To register, you’ll need to provide your name, email address, phone number, and password. You’ll also need to complete the app’s KYC (Know Your Customer) process by submitting a government-issued ID and a selfie.\n\nStep 3: Generate an Ethereum Wallet Address\n\nOnce your account is verified, you need to generate an Ethereum wallet address to receive crypto. To do this, click on ETHEREUM from the app’s dashboard. This will then open up the Ethereum trade page. Click on ‘Generate Wallet Address’. You’ll then be provided with a unique Ethereum address that you can use to transfer your Ethereum from your external wallet.\n\nStep 4: Send Ethereum To Your Wallet Address:\n\nThe Ethereum wallet address acts just like a bank account number. All you need to do is send your address to the sender or your external wallet through the multiple options available.\n\nStep 5: Sell Ethereum for Cash\n\nSend the amount of Ethereum you want to sell and select “Naira” as the currency you wish to receive. Breet will automatically calculate the amount of Naira you will receive based on the current market rate.\n\nOnce your Ethereum is sent into your Breet Ethereum wallet, you need to wait for at least three confirmations from the blockchain network. Once confirmation is complete, your transaction is tagged as successful, and your funds will reflect in your Breet Naira wallet.\n\nStep 6: Withdraw Your Naira to Your Bank Account\n\nAfter selling your Ethereum for Naira, you can withdraw your funds directly to your Naira bank account. Breet offers free and instant withdrawals to any Nigerian bank account. To withdraw your funds, select the “Withdraw” option, enter the amount you want to withdraw, and select your bank account from the list of available options. Click on “Withdraw” to complete the transaction.\n\nIf your automatic settlement feature is turned on from settings, your funds are automatically withdrawn to your provided local bank account after completing the transaction.\n\nConclusion\n\nTrading Ethereum is profitable, but it is not without risks. Using a crypto trading app like Breet can be a convenient and hassle-free way to sell your Ethereum for cash in Nigeria. With Breet, you can convert your Ethereum to Naira and withdraw your funds straight to your Naira bank account within minutes and free of charge."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3LmZvbGxvd2NoYWluLm9yZy93aXRoZHJhdy1tZXRhbWFzay10by1iYW5rL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "How to Withdraw Money From MetaMask to Bank Account - Followchain",
        "content": "MetaMask is a cryptocurrency wallet that allows you to store your Ethereum.\n\nHowever, you won’t be able to sell your crypto on it because it’s not an exchange.\n\nIf you don’t sell your crypto (e.g. ETH), you won’t be able to withdraw money to your bank account.\n\nIf you want to sell your crypto, you need to use a cryptocurrency exchange like Binance or Coinbase.\n\nBinance is highly recommended because it has one of the lowest fees.\n\nBy selling your crypto on Binance, you can choose the currency that you want to receive.\n\nFor example, if you live in Europe, you can select the “EUR” currency.\n\nIn this guide, you’ll learn how to withdraw money from MetaMask to your bank account by selling your Ethereum on Binance.\n\nHow to withdraw money from MetaMask to bank account\n\nTo withdraw money from MetaMask to your bank account, you need to send your crypto (e.g. ETH) to a cryptocurrency exchange like Binance.\n\nNext, sell your crypto on Binance for fiat money (e.g. USD) and withdraw it to your bank account.\n\nDo note that you won’t be able to sell your crypto on MetaMask because it’s not a cryptocurrency exchange.\n\nHence, you need to send your crypto to a cryptocurrency exchange like Binance and sell it there.\n\n1. Create a Binance account\n\nGet started on Binance here: https://www.binance.com/en/register?ref=73583477 or use “73583477” as the referral code.\n\nGo to binance.com and click on the “Register” button. Enter your email address, choose a password, and use “73583477” as the referral ID. Accept the terms of service and click on “Create Account”. Verify your identity by uploading a government ID and taking a photo of yourslef.\n\nNote: To withdraw your money from MetaMask, you need to sell your crypto on an exchange like Binance first.\n\n2. Copy your Ethereum address on Binance\n\nLog in to Binance > Wallet > Fiat and Spot. Scroll down the list until you find the crypto that you want to sell for money (e.g. ETH). Click on “Deposit” next to the crypto that you want to deposit (e.g. ETH).\n\nNote: After you’ve created a Binance account and verified your identity, you need to copy your crypto address of the crypto that you want to sell (you need to send that crypto from MetaMask to this address later on).\n\nSelect the crypto that you want to deposit/sell from the “Coin” dropdown box (e.g. ETH/BTC). If you’re depositing Ethereum, select the “ERC20” network. Copy your crypto address by clicking on the duplicate icon.\n\n3. Send your Ethereum from MetaMask to Binance\n\nOpen your MetaMask wallet and unlock it. Navigate to the crypto (e.g. ETH) that you want to sell. Click on “Send” to withdraw your crypto.\n\nOn the “Add Recipient” page, you’ll see a “Search, public address (0x), or ENS” field. Paste your Binance wallet’s crypto address from from step #2.\n\nSelect the crypto that you want to send in the “Asset” field (e.g. ETH). Enter the amount of crypto that you want to withdraw to Binance. Click on “Next” followed by “Send” to send your crypto to Binance.\n\nNote: The withdrawal process will typically take about 30 minutes to complete.\n\n4. Sell your Ethereum on Binance\n\nSell your Ethereum on Binance here: https://www.binance.com/en/buy-sell-crypto?type=SELL.\n\nGo to the selling page on Binance here: https://www.binance.com/en/buy-sell-crypto?type=SELL. On the selling page, select the crypto that you want to sell on the “Spend” field (e.g. ETH). Enter the the amount of crypto that you want to sell. Select the currency that you want to receive in the “Receive” field (e.g. EUR). click on “Continue” and follow the on-screen instructions to sell your crypto for fiat money.\n\n5. Withdraw your money from Binance to your bank\n\nNote: Now that you’ve sold your Ethereum for fiat money on Binance, you’ll be able to withdraw it to your bank account.\n\nClick on “Wallet” followed by “Fiat and Spot” to go to your fiat and spot wallet. On your fiat and spot wallet, you’ll see your fiat and cryptocurrency balances. Click on “Withdraw” at the top of the page to go to the withdrawal page.\n\nAfter you’ve clicked on “Withdraw”, you’ll land on the withdrawal page.\n\nHere’s what you need to do to withdraw your money to your bank account:\n\nSelect the currency that you want to withdraw using the “Currency” dropdown box (e.g. EUR). Select the payment method that you want to use (e.g. Bank Card”). Enter the amount that you want to withdraw to your bank account in the “Amount” field. If you’re using the “Bank Card” payment method, click on “Add New Card” and enter your card information. Click on “Continue”.\n\nAfter you’ve clicked on “Continue”, you need to complete a security verification.\n\nThis includes entering a 6-digit code that is sent to your phone number.\n\nAfter you’ve completed the security verification, you’ll see an “Order Submitted” pop-up.\n\nThis means that you’ve successfully withdrawn money from Binance to your bank account!\n\nThe withdrawal process will typically take 5 minutes if you’ve selected the “Bank Card” payment method.\n\nHowever, if you’re using a payment method like SWIFT, it can take 1 to 4 business days for the money to arrive in your bank account.\n\nTo check the withdrawal status, click on “View History” on the pop-up or click on “Transaction History” on the left sidebar of your fiat and spot wallet.\n\nConclusion\n\nIf you want to withdraw money from MetaMask to your bank account in the future, you need to send your crypto (e.g. ETH) to Binance first.\n\nThen, you’ll be able to sell your crypto for fiat money and transfer it to your bank account.\n\nKeep in mind that every transaction you make involves a fee.\n\nHence, it’s a good idea to withdraw your money from MetaMask to your bank account only if you want to sell a lot of crypto.\n\nWhenever you’re sending crypto (e.g. ETH) from MetaMask, make sure that you’ve entered the right address or your crypto will be lost.\n\nFurther reading\n\nHow to Create a Binance Account\n\nHow to Make a MetaMask Wallet\n\nBest Binance Referral ID Code in 2021"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lm5hbWVjb2lubmV3cy5jb20vZXRoZXJldW1zLW5ldy10ZXN0bmV0LWhvbGVza3ktZmFpbHMtdG8tbGF1bmNoL9IBT2h0dHBzOi8vd3d3Lm5hbWVjb2lubmV3cy5jb20vZXRoZXJldW1zLW5ldy10ZXN0bmV0LWhvbGVza3ktZmFpbHMtdG8tbGF1bmNoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Ethereum’s new testnet Holesky fails to launch - NameCoinNews",
        "content": "Ethereum recently faced a surprising failure after failing to launch its Holesky test network. The network was set to be the celebratory launch for the Merge from last year.\n\nSome of the validators managed to launch the test network manually. However, a misconfiguration in the network’s genesis files led to the failure. Ethereum core developers revealed this information shortly after the launch mishap.\n\nSoon after the development, Ethereum postponed the launch for two weeks. The network will use the time to regroup and retest the entire plan. A developer from Ethereum talked about the issue on Twitter/X.\n\nGiven the status Ethereum boasts, missteps of such nature are quite rare. The network even concluded its massive Merge update without a hitch. Similarly, Ethereum had previously integrated the Shapella network without such issues.\n\nThe entire industry is closely monitoring Ethereum, which is the second-largest blockchain. Thus, the recent failure reflects poorly on both Ethereum and the blockchain in general.\n\nThe Holesky update was planned to replace the current Goerli testnet. However, since the launch failed, the Goerli testnet is still live for developers. Developers can test apps on the network, which is expected to stay live until Q1 2024.\n\nWith Holesky, Ethereum plans on easing several scaling troubles. The update will help developers support twice as many validators entering the network compared to the mainnet.\n\nParithosh Jayanthi, a DevOps engineer at Ethereum, stated that resurrecting the network was a choice for the network. However, Ethereum decided to start with a clean slate to ensure the network stayed around for years.\n\nDencun, the next Ethereum hard fork, relies on Holesky, so the testnet must be executed perfectly. Ethereum has confirmed that this setback does not affect the expected launch date of Dencun.\n\nThe debut was scheduled to coincide with the first anniversary of the “Merge,” the momentous occasion at which Ethereum switched to a more efficient “proof-of-stake” blockchain model in place of its previous “proof-of-work” system."
    }
]