[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8yOC91cy1jZnRjLWNoaWVmLWJlaG5hbS1yZWluZm9yY2VzLXZpZXctb2YtZXRoZXItYXMtY29tbW9kaXR5L9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8yOC91cy1jZnRjLWNoaWVmLWJlaG5hbS1yZWluZm9yY2VzLXZpZXctb2YtZXRoZXItYXMtY29tbW9kaXR5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "U.S. CFTC Chief Behnam Reinforces View of Ether as Commodity - CoinDesk",
        "content": "\"It should be absolutely a concern,” he said. “Europe has put in place a pretty comprehensive regime that's going to be implemented over the next couple of years,\" he said, adding that the U.S. needs to \"move the ball forward.\""
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3BvbHlnb24temtldm0tbGl2ZS1vbi1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Polygon's zkEVM Goes Live on Ethereum Mainnet - Blockworks",
        "content": "The options for layer-2 scaling are expanding as Polygon launches its long-awaited zkEVM technology on Ethereum mainnet today.\n\nThe zero-knowledge Ethereum Virtual Machine is a technology that can execute smart contract transactions in a way that can prove the information is executed correctly without revealing the information itself on Ethereum’s mainnet, thereby bundling more transactions in less mainnet blockspace.\n\nSandeep Nailwal, the co-founder and chief operating officer of Polygon, told Blockworks this type of technology is considered the “holy grail of scaling.”\n\n“With the power of mathematics…you can compute something off-chain on layer-2, then verify everything back on Ethereum in a very succinct way in a very short amount of time,” Nailwal said.\n\nPolygon’s launch on Ethereum comes just days after Matter Labs zkSync Era opened to the public on Ethereum mainnet.\n\nSimilar to zkSync’s offering, the Polygon zkEVM’s code is open-source, but under an AGPL v3 license.\n\n“That means that not only current repositories, but all future modifications and distributions as well, will remain open source, ensuring the code cannot be used for proprietary purposes,” Nailwal said.\n\nNailwal notes that Polygon zkEVM is EVM equivalent, whereas zkSync’s offering is EVM compatible.\n\nAccording to the framework laid out by Ethereum co-founder Vitalik Buterin in August 2022, zkSync Era is classified as a “Type-4 (high-level-language equivalent),” and there are advantages and disadvantages of various approaches to bringing the EVM to a zero-knowledge rollup. The merits of various tradeoffs are an ongoing topic of debate.\n\nLike zkSync Era, and the current crop of optimistic rollups, the Polygon zkEVM is not yet decentralized, but eventually, Nailwal hopes that Polygon’s new offering will take that step.\n\n“Everything is in the hands of the community,” he said.\n\nSecurity comes first\n\nIn addition to three internal audits, Nailwal notes that Polygon’s zkEVM has also gone through two rounds of external security audits from blockchain cybersecurity companies Hexens and Spearbit.\n\nOngoing, continuous audits are expected for the next three to four months following mainnet launch and a multi-million dollar bounty program will also be in place, he said.\n\nThe emphasis on security was also central to zkSync Era’s mainnet release, but Polygon said that Matter Labs had shared audits that cover their smart contracts and sequencer, not their prover.\n\n“This raises serious questions about security, at least until a full audit is released. The prover for Polygon zkEVM, meanwhile, has been audited, and is open-source,” Brendan Farmer, Polygon Zero co-founder, told Blockworks.\n\nA spokesperson for zkSync told Blockworks that the prover had been audited by Halborn Security, and pointed to the blockchain’s documentation, which notes that a recently completed review has not yet been published.\n\nEven conscientious security measures can leave gaps, however, and Nailwal notes that he does not wish users to bring millions of dollars to the zkEVM immediately.\n\n“Zk is new technology…so we [want] people [to be] as cautious as possible,” he said.\n\nDrawing on the example of the recent Euler Finance attacks, Nailwal cautioned that interacting with smart contracts is not without risk.\n\n“Euler, after running for two years, a bug was found — this can happen any day, on any smart contract-based application.” he said.\n\nZkEVMs are sure to be compared to their optimistic rollup counterparts — the most successful to-date being Optimism and Arbitrum.\n\n“Arbitrum took one and a half years before people actually started bringing in money,” Nailwal said. “So we don’t expect people to bring a lot of money [initially].”\n\nUpdated March 28, 2023 at 2:58 pm ET: After initial publication, Polygon announced the zkEVM prover would also be available under the AGPL v3 license, along with the rest of the codebase.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYmxvZy5rcmFrZW4uY29tL3Byb2R1Y3QvZXRoLWRlcG9zaXRzLWFuZC13aXRoZHJhd2Fscy1hdmFpbGFibGUtb24tdGhlLXBvbHlnb24tbmV0d29ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "ETH deposits and withdrawals available on the Polygon network! - Kraken Blog",
        "content": "Kraken is pleased to announce that we now support deposits and withdrawals of Ethereum (ETH) on Polygon!\n\nPolygon is a Layer 2 scaling solution and decentralized application development infrastructure for Ethereum. Polygon increases the transaction throughput for Ethereum-based assets and uses a modular framework to support the execution of interoperable smart contracts.\n\nCheck out the Kraken Learn Center guide What is Polygon? or How to buy Polygon (MATIC) to learn more.\n\nFunding\n\nFunding is already live. You can transfer Ethereum (ETH) to your Kraken account by navigating to Funding, selecting ETH and choosing the desired deposit method from the drop-down box (network): Polygon.\n\nAlready have ETH (Ethereum) on Polygon and a Kraken account? ⤵️\n\nHere’s what you need to know about the assets: Ethereum (ETH) is a global, open-source platform for decentralized applications. Ethereum is a marketplace of financial services, games and apps that is trustless, decentralized and secure. ETH is the cryptocurrency powering the Ethereum network. It’s used to pay for transactions, as a store of value or peer-to-peer payment method, or as collateral to generate entirely different crypto tokens that run on Ethereum. Learn how to add ETH to your crypto portfolio with our Learn Center article How to Buy Ethereum (ETH). Ready to deposit but don’t have a Kraken account yet? Sign up today!\n\nTrade with caution There is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders. These materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmJpdHJhdGVzLmNvbS9uZXdzL3AvZXRoZXJldW1zLXJvbGUtaW4tdGhlLWdyb3d0aC1vZi10aGUtaW50ZXJuZXQtb2YtdGhpbmdzLWlvdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's Role in the Growth of the Internet of Things (IoT) - Bitrates",
        "content": "Ethereum is a blockchain-based platform that enables the creation of smart contracts, decentralized applications, and autonomous organizations.\n\nThe Internet of Things (IoT) refers to the growing network of physical devices embedded with sensors, software, and connectivity that allows them to collect and exchange data.\n\nEthereum's secure and transparent smart contract technology is contributing to the growth of the IoT by enabling secure and efficient data exchange, decentralized data management and storage, and cost-effective transactions. As the IoT continues to expand, the integration of Ethereum's blockchain technology can provide new opportunities for innovation and growth, creating new possibilities for businesses and individuals alike.\n\nBenefits of Ethereum in the IoT\n\nEthereum's smart contract technology provides a secure and transparent platform for data exchange in the IoT. By using smart contracts, data can be exchanged and verified without the need for intermediaries, reducing the risk of fraud and improving transparency. This can be particularly beneficial in industries such as healthcare and finance, where secure and reliable data exchange is critical. With Ethereum, the data exchanged can be verified and recorded immutably on the blockchain, creating an auditable record of all transactions.\n\nThe efficient and cost-effective transactions enabled by Ethereum's blockchain technology are also beneficial in the IoT. By using cryptocurrency payments, transactions can be conducted more quickly and cheaply than traditional payment methods, reducing transaction fees and enabling cross-border transactions. This can be particularly useful in industries such as logistics and supply chain management, where real-time transactions are necessary for efficient operations.\n\nDecentralized data management and storage is another benefit of Ethereum in the IoT. By using Ethereum's decentralized network, data can be stored and managed in a secure and transparent manner without the need for a centralized authority. This can be particularly beneficial in industries such as energy management, where decentralized data management can enable more efficient and sustainable use of resources. With Ethereum, the data can be verified and accessed in real time, enabling more effective decision-making and improving overall operational efficiency.\n\nUse Cases of Ethereum in the IoT\n\nEthereum has numerous use cases in smart homes and energy management. By leveraging Ethereum's smart contract technology, smart homes can be automated and controlled using decentralized applications (dApps). Ethereum's decentralized network can also enable peer-to-peer energy trading, where users can buy and sell excess energy in a secure and transparent manner, promoting sustainable energy practices.\n\nIn supply chain management, Ethereum's blockchain technology can be used to ensure transparency and traceability throughout the supply chain. With Ethereum, transactions can be recorded immutably on the blockchain, creating an auditable record of the entire supply chain process. This can reduce the risk of fraud and enable more efficient and secure supply chain management.\n\nThe gambling industry is another use case for Ethereum in the IoT. Ethereum's blockchain technology can be used to ensure fair and transparent gameplay, creating trust and transparency between players and game developers. It is important to find reliable gaming platforms, to ensure fairness. If you’re interested, here’s Mercury News' list of the best Ethereum casinos online. Additionally, decentralized gaming platforms powered by Ethereum can also enable the creation of unique in-game assets, allowing players to own and trade digital assets securely and transparently.\n\nIn the healthcare industry, Ethereum can be used to create secure and transparent systems for data management and sharing. With Ethereum, patients can own and control their medical data, allowing for more efficient and secure sharing of medical information between healthcare providers. This can improve patient outcomes and reduce costs associated with healthcare data management. Overall, the use of Ethereum in the IoT has the potential to revolutionize various industries, enabling more efficient and secure operations and creating new opportunities for innovation and growth.\n\nChallenges and Solutions for Ethereum and the IoT\n\nOne of the major challenges facing Ethereum in the IoT is scalability and performance issues. As the number of devices connected to the IoT increases, the demand for processing power and storage capacity also increases. Ethereum's current architecture may not be able to handle the scale and speed required for efficient IoT operations. However, there are solutions being developed to address this challenge, such as sharding, a technique that partitions the Ethereum blockchain into smaller shards, enabling faster transaction processing and greater scalability.\n\nAnother challenge facing Ethereum in the IoT is interoperability. Different devices and networks may use different protocols and standards, making it difficult for them to communicate and share data effectively. This can create data silos and reduce the efficiency of IoT operations. However, there are solutions being developed to address this challenge, such as the creation of industry-wide standards for IoT devices and networks. Additionally, the development of decentralized networks and interoperability protocols, such as the Interledger Protocol (ILP), can enable more seamless communication and data exchange between different networks.\n\nTo address scalability and performance issues, Ethereum is exploring solutions such as sharding, layer-two solutions, and optimizations to improve its network's performance. For interoperability challenges, Ethereum is collaborating with other blockchain networks and working towards creating common standards and protocols.\n\nAdditionally, the Ethereum community is actively working on developing tools and frameworks that can make it easier to integrate IoT devices with the Ethereum network. As the Ethereum network and IoT continue to evolve, we can expect to see further innovations and solutions to address these challenges, enabling greater interoperability and scalability for the IoT.\n\nTo Sum up the Information\n\nEthereum's blockchain technology has numerous benefits and use cases in the Internet of Things (IoT), including secure data exchange, efficient transactions, and decentralized data management. The use of Ethereum in various industries, such as healthcare, supply chain management, and smart homes, has the potential to revolutionize these industries and enable more efficient and sustainable operations.\n\nHowever, there are also challenges to be addressed, such as scalability and interoperability issues. By embracing innovation and new technologies, the potential impact of Ethereum on the IoT is significant, and we can expect to see continued growth and development in this space. Overall, the use of Ethereum in the IoT represents a new era of innovation and opportunity for industries and individuals alike."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzAzLzI3L3BvbHlnb24tbGF1bmNoZXMtaG9seS1ncmFpbC16a2V2bS1tYWlubmV0LWJldGEtbWFzcy1zY2FsZS1jb3N0LXNhdmluZ3MtdG8tZXRoZXJldW0tdHJhbnNhY3Rpb25zL9IBigFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzAzLzI3L3BvbHlnb24tbGF1bmNoZXMtaG9seS1ncmFpbC16a2V2bS1tYWlubmV0LWJldGEtbWFzcy1zY2FsZS1jb3N0LXNhdmluZ3MtdG8tZXRoZXJldW0tdHJhbnNhY3Rpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Polygon launches ‘holy grail’ zkEVM mainnet beta that aims to increase scale and decrease cost of Ethereum transactions - Fortune",
        "content": "With the launch of its zkEVM mainnet beta on Monday, Polygon is bringing to life what’s for years been described as the “holy grail” of blockchain infrastructure, the cofounder of the layer-2 scaling solution told Fortune.\n\nThrough the use of zero-knowledge proofs, which allow a user to prove certain statements without revealing the actual data used, Polygon cofounder Mihailo Bjelic said zkEVM will provide massive possibilities for scaling the number of transactions on the blockchain while also incorporating the security and established ecosystem that the Ethereum network has built up over years.\n\nAmbitiously, Bjelic compared the zkEVM’s forthcoming impact on crypto to the effect OpenAI’s ChatGPT has had on artificial intelligence in recent months.\n\nBuilding on Ethereum’s execution layer, or EVM, was important for the Polygon team because it’s already the most popular blockchain for decentralized applications.\n\n“If you have a solution that satisfies these two first features, security and scalability, but completely changes user experience, developer experience, you have to build the whole ecosystem from scratch. That’s a humongous task,” Bjelic explained.\n\nThe technology is complicated, and as such, Bjelic said the Polygon team originally thought it might take three to five years to finish the project. Through some cryptographic breakthroughs and a lot of passion, especially from technical lead Jordi Baylina, the team finished in just over a year, he said.\n\nPolygon has partnered with important companies like Starbucks and Instagram in the past, and Bjelic said zkEVM would be a great fit for them and other companies or Web3 organizations. By adopting the zkEVM mainnet beta, users could in some cases pay 10 or 20 times less for the same number of transactions.\n\nSeveral companies have already committed to using the zkEVM mainnet beta, and on the first day of launch, Bjelic said he expects thousands of users to start using it for dozens of applications.\n\nVitalik Buterin, the founder of Ethereum, executed the first symbolic transaction via a livestream on Monday, which Bjelic said goes to show just how significant the tech is. Buterin appeared to agree.\n\nAlthough scaling was always on his mind since the beginning of Ethereum, he said during the livestream, during the last bull run it became clear how expensive it was to use the Ethereum mainnet. This is a problem that zkEVM will help to solve, along with enabling mass scaling for Ethereum, which will help with the onboarding of new users, Buterin said.\n\n“I feel very happy and excited for what’s to come,” Buterin said. “The whole zkEVM thing is something that we’ve all dreamed about and talked about for a long time.”\n\nAs for Bjelic, in the face of regulatory uncertainty and investors’ uneasiness tied to problems in the economy and banking sectors, he hopes zkEVM will bring some buzz back to Web3.\n\n“I think there is potential for zkEVM to again reignite this excitement about Web3,” he said, “and I think we really need that now.”"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGVjcnlwdC5jby8xMjQ2MjMvZHlkeC1yZXZlYWxzLWxhdW5jaC1kYXRlLW1vdmUtZXRoZXJldW0tdG8tY29zbW9z0gFQaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNDYyMy9keWR4LXJldmVhbHMtbGF1bmNoLWRhdGUtbW92ZS1ldGhlcmV1bS10by1jb3Ntb3M_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "dYdX Reveals Launch Date for Move From Ethereum to Cosmos - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\ndYdX announced the launch of its V4 private testnet this Tuesday, taking a significant step that will see the decentralized derivatives exchange (DEX) leave Ethereum.\n\nBy the end of September, the platform will be fully running on Cosmos.\n\nThe network allows developer teams to spin up their own native blockchains using the Cosmos Software Development Kit (SDK) according to their own preferences. Though distinct, each independent Cosmos-based blockchain can interact with one another.\n\nAD\n\nAD\n\nThe private testnet for dYdX is set to launch this Tuesday and run for two to three weeks. After that, a public testnet will be launched by the end of July.\n\nThe platform cited the lack of scalability on Ethereum as the main reason for the move.\n\n\"We reached a point where Ethereum couldn't process the transactions fast enough,\" dYdX’s marketing lead Nathan Cha told Decrypt at this year’s Paris Blockchain Week.\n\nThis is the second project to announce its migration from Ethereum to Cosmos. SushiSwap is also making the same move after the project acquired the Cosmos-based trading platform Vortex Protocol last month.\n\nThe teams explored various options, including Solana and layer-2 solutions. \"We came to the conclusion that Cosmos was the better option because we can customize the blockchain to our needs,” said Cha. “Now we can handle transactions at a faster pace.\"\n\nAD\n\nAD\n\ndYdX and centralized exchanges\n\nLaunched in 2017 by Antonio Juliano, who previously worked at Coinbase and Uber as a software engineer, dYdX currently has roughly $341.5 million in total value locked (TVL), per DeFi Llama.\n\nTVL is a metric used to measure how much money is sloshing around in a given DeFi protocol. Lido Finance, a liquid staking protocol, currently has the largest TVL at a whopping $10.4 billion.\n\nThough decentralized exchanges like Uniswap, Curve, and dYdX are steadily growing, they still only account for a small share of transactions compared to their centralized counterparts. Trading volume over the past day, Uniswap has facilitated more than $642 million in orders. Binance has processed more than $4.28 billion in trades over the same period.\n\nContrary to expectations at the time, the collapse of FTX last November did not significantly change this proportion.\n\n\"After FTX, we saw a 20-30% increase in trading volume, but only for a short time,\" David Gogel, Vice President of the dYdX Foundation, told Decrypt. \"The companies that benefited the most from the FTX case are other centralized exchanges. People don't really know about self-custody, and there's still a lot of work to do to educate them. It's a complicated journey.\""
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcGlubmVkLWJlbG93LTIwMDAtZGVzcGl0ZS1uZXR3b3JrLWJ1cm5pbmctb3Zlci0zLW1pbGxpb24tZXRoL9IBcGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcGlubmVkLWJlbG93LTIwMDAtZGVzcGl0ZS1uZXR3b3JrLWJ1cm5pbmctb3Zlci0zLW1pbGxpb24tZXRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Pinned Below $2,000 Despite Network Burning Over 3 Million ETH - NewsBTC",
        "content": "Ethereum prices remain below $2,000 months after the network initiated EIP-1559, trackers on March 28 reveal.\n\nEthereum Prices Trending Below $2,000\n\nETH, the native currency of Ethereum, is currently trading at $1,717, stable on the last day and week but retracing from recent highs of around $1,850.\n\nThe network has burnt over 3 million ETH from gas fees since the activation of Ethereum Improvement Proposal (EIP) 1559 in August 2021, a move that gradually makes the coin deflationary. However, despite this, the coin has been unable to break above $2,000 since May 2022.\n\nEIP-1559 was an intervention by the developer community to reduce the supply of ETH and it was a new way for Ethereum to calculate process transaction fees, effectively adjusting the fee market and making gas more predictable. Earlier, Ethereum used an auction system where miners prioritized transactions tagged with high fees.\n\nIn EIP-1559, the team agreed to introduce a base fee and a “tip” for every gas fee paid in a transaction. The base fee is what everyone transacting on Ethereum must pay. Notably, this fee will be adjustable depending on network demand and would be burned.\n\nAt the same time, the transactor would give a “tip” to the block validator as an incentive to include their transaction in a block. This fee is optional, and only those who want their transactions to be included in blocks faster can pay.\n\nEthereum Price On March 28 | Source: ETHUSDT On Binance, TradingView\n\nOver 3 Million ETH Burned Since August 2021\n\nFrom August 2021, when Ethereum introduced EIP-1559, the network has burned over 3 million ETH. At the same time, over 69,450 ETH has been destroyed since the Merge, when Ethereum officially transited to a proof of stake system, switching off miners.\n\nConsidering the current pace of ETH burning, the coin has been deflationary by 0.1% annually. Proponents are bullish that ETH will never be inflationary again, a move that could push prices even higher in the months and years ahead.\n\nThe pace of ETH burning depends on network activity. Over the months, especially during the 2022 bear run, ETH and token prices crashed, as DeFi and NFT activities also fell. The total value locked (TVL) in DeFi remains less than half the peaks of 2021, while NFT trading is subdued even with the recovery of asset prices in Q1 2023.\n\nTrackers on March 28 indicate that ETH transfers contribute to the bulk of coins destroyed since EIP-1559. From August 2021, users transferring ETH between addresses have contributed to 266,217.50 ETH being destroyed.\n\nMeanwhile, because of NFTs, primarily through OpenSea, 230,050 ETH have been burned, with 152,369 ETH destroyed from Uniswap’s trading activities.\n\nFeature Image From Canva, Chart From TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmNjbi5jb20vZXRoZXJldW0tY28tZm91bmRlci1oYXMtYmlnZ2VzdC1zdGFrZS1pbi12ZWNoYWluLWFuZC1xdHVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Co-Founder Has 'Biggest Stake' in VeChain and Qtum - CCN.com",
        "content": "Anthony Di Iorio, the billionaire co-founder of $50 billion blockchain network Ethereum and cryptocurrency wallet Jaxx, said that Chinese blockchain projects such as Qtum and VeChain will succeed.\n\n“The biggest stake for me is in Qtum and VeChain right now, the two Chinese projects. There’s much more opportunity in newer ones if you can identify them,” Iorio said.\n\nChina’s Poor Cryptocurrency Trading Regulations Don’t Matter\n\nVeChain, the Ethereum-based Internet of Things blockchain protocol in China, has attracted well-respected developers, venture capital firms, and large-scale institutions throughout the past six months.\n\nMost recently, the VeChain team disclosed that PwC, one of the Big Four auditors, have acquired a stake in the project, and announced a partnership with multi-billion dollar logistics giant DB Schenker to use the blockchain in processing sensitive information.\n\n“By collaborating with third-party logistics providers in China, DB Schenker can offer extensive and seamless logistics solutions across China for any industry and trade. However, the immense potential of such a comprehensive logistics network is challenged by the complexity of measuring the performance and service quality of their business partners,” the VeChain foundation said.\n\nBuilding blockchain protocols in itself is difficult and technologically challenging, as blockchain building essentially is solving unprecedented cryptographic problems with dire consequences. A simple error in a smart contract could result in large-scale security breaches and loss of funds.\n\nBuilding a blockchain protocol and convincing conglomerates, institutions, and businesses to utilize it to secure data rather than more efficient database technologies is even more difficult, because developers need to convince businesses to overcome the trade-off between decentralization and flexibility to use blockchain technology in the right way.\n\nThe blockchain is not database technology; it cannot process an unlimited number of transactions and information, and in its current form, it can barely process hundreds of transactions per second. Ethereum creator Vitalik Buterin emphasized that it is possible to reach a million transactions per second on the Ethereum blockchain with Sharding and Plasma enabled, but the industry is still several years behind.\n\nAs such, for blockchain projects, it is of utmost importance to secure partners like VeChain’s partnership with PwC and DB Schenker to build, solve, and investigate together on various methods that could be utilized to commercialize the blockchain at a large scale.\n\nIorio said that investors should also look for emerging projects that are capable of leading wide adoption of the blockchain, similar to the works of Qtum and VeChain, both of which are based in China.\n\nIn September 2017, the Chinese authorities effectively banned cryptocurrency trading but has not banned cryptocurrency businesses and blockchain projects. In fact, the latest multi-billion dollar funding of blockchain startups by the Chinese government reaffirmed its support for blockchain technology.\n\nGood to Get Reaffirmation That Ethereum is Not a Security\n\nDuring an interview with Bloomberg, Iorio added that while the creators of Ethereum including himself, Buterin, and Charles Hoskinson were comfortable with the regulatory nature of Ethereum and its non-security characteristics, it was “great” to get reaffirmation from the US government that it is not a security.\n\nIf the US SEC had categorized Ethereum as a security, it would have had shut down the entire industry in the US in an instant, forcing companies to move out of the country. The SEC’s clear statement that Ethereum is not a security demonstrated the intent of the agency to see continuous development in the blockchain sector."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tZmFjZXMtYmVhcmlzaC1kaXZlcmdlbmNlLXdpdGgtY3J5cHRvLW1hcmtldHMtdW5kZXItcHJlc3N1cmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Ethereum faces bearish divergence with crypto markets under pressure - crypto.news",
        "content": "The crypto markets are selling off in the wake of the U.S. CFTC filing suit against Binance. Technical traders are worried there could be more downside coming.\n\nIn a recent episode of The Crypto World channel, host Josh analyzed the current market conditions for both ethereum (ETH) and bitcoin (BTC), highlighting bearish divergence and resistance challenges.\n\nHere’s a breakdown of the key points from his analysis.\n\nJosh reported that ethereum is experiencing a bearish divergence, breaking below its short-term support. He encouraged his audience to stay tuned for further analysis on this trend. Ethereum is currently facing rejection from a resistance range of $1,770 to $1,820.\n\nIf the price continues to decline, support between $1,650 to $1,700 is expected to hold. A break below the short-term support level of $1,730 would signal a bearish turn, leading to further pullback.\n\nBitcoin, on the other hand, is facing rejection from a resistance range of $28,000 to $29,500, indicating a short-term pause or setback from its bullish trend. If the price experiences a further pullback, the support area between $24,000 to $25,200 is expected to provide significant support for the cryptocurrency.\n\nYou might also like: Crypto markets react to Binance’s battle with CFTC\n\nThe bearish divergence is also evident on the bitcoin-to-euro dollar chart, as lower highs are consistently forming in the short term. This is a sign of weakness in the cryptocurrency, which may lead to further declines in the near future.\n\nJosh also noted that the funding rates for all coins across all exchanges are flipping into the negative territory. This negative shift in funding rates encourages traders to short bitcoin. The development indicates a potential change in market sentiment, as traders position themselves for the possibility of a downward price movement.\n\nAs ethereum and bitcoin face resistance and bearish divergences, the host thinks more downside is possible. For ethereum, the support ranges between $1,650 and $1,700, which is a critical level to monitor.\n\nIf ethereum breaks below its short-term support of $1,730, it would signal a bearish trend and could result in further declines. For bitcoin, investors should watch the support area between $24,000 to $25,200. If the cryptocurrency falls below this range, it could face additional selling pressure and continue its downward trend.\n\nJosh’s analysis on The Crypto World channel serves as a reminder that the cryptocurrency market can experience fluctuations and setbacks, even during a bullish trend.\n\nBoth ethereum and bitcoin are currently facing resistance and bearish divergences, which could result in short-term declines. The remarks follow today’s report that crypto analyst The Crypto Lark sees the Wyckoff schematic as a valuable analytical tool, and shares his views on the bitcoin market in a recent YouTube video.\n\nRead more: Binance’s CZ responds to ‘unexpected’ CFTC accusations\n\nFollow Us on Google News"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1zZWVzLXNvbWUtd2hhbGUtYW5kLXJldGFpbC1kZW1hbmQtYnV0LWhlcmVzLXRoZS1pc3N1ZS_SAVlodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tc2Vlcy1zb21lLXdoYWxlLWFuZC1yZXRhaWwtZGVtYW5kLWJ1dC1oZXJlcy10aGUtaXNzdWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Ethereum sees some whale and retail demand, but here’s the issue - AMBCrypto News",
        "content": "ETH sees demand from whales and retail investors but in low volumes.\n\nETH TVL in Ethereum 2.0 soars to new ATH.\n\nThe Ethereum network’s next major upgrade dubbed Shanghai is less than a month away. Major network upgrades usually attract some investor interest days before the actual date of the event. Now, the question is- Will the same scenario play out for ETH?\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nRecent data reveals that ETH is experiencing noteworthy demand, especially from retail investors. There are currently over 23.3 million addresses holding at least 0.01 ETH and those addresses are currently at an 8-month high.\n\nThis confirms that retail buyers have been accumulating, perhaps in anticipation of some upside as the Shanghai countdown narrows.\n\nBut how does this match up to the level of demand from the whales or institutional buyers? A quick glance at the state of addresses holding over 1,000 and over 10,000 ETH reveals that they have been adding to their balances in the last seven days. This confirms that larger addresses or whales have also been accumulating the king alt.\n\nThings also look favorable for Ethereum on the DeFi front. The network’s TVL data revealed that the total value locked in ETH 2.0 deposit contracts has been growing. It recently reached a new all-time high (ATH) of 17.06 million ETH. It confirms that Ethereum 2.0 is still on a healthy growth trajectory.\n\n? #Ethereum $ETH Total Value in the ETH 2.0 Deposit Contract just reached an ATH of 17,061,207 ETH View metric:https://t.co/SzbMPqvhlb pic.twitter.com/eHxVwDn43i — glassnode alerts (@glassnodealerts) March 25, 2023\n\nSo, if the whales and retail segment are buying, why is ETH’s price not experiencing a massive rally?\n\nExchange flows may provide a reasonable answer. The volume of ETH flowing in and out of exchanges is down notably in the last seven days. It implies that the prevailing volumes are weaker, hence a lower impact on price action.\n\nHowever, the latest Glassnode readings revealed that the ETH exchange outflow volume was almost double the exchange inflow volume.\n\nThese flows were responsible for curtailing ETH’s downside on Saturday (25 March) and a 3.6% uptick within the last 24 hours to its $1778 press time price.\n\nHow many are 1,10,100 ETHs worth today?\n\nAlthough ETH is currently demonstrating some bullish signs, investors should note that the volumes are still low. The cryptocurrency has been stuck in a saturated performance for the last few days. Capitulation is still a likely outcome that may lead to a resurgence of sell pressure in the next few days.\n\nInvestors should watch for whether ETH demand will continue increasing in the next few days. This would give insights into what to expect."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vYnJhbmQtc3Rvcmllcy9iaXRjb2luLXZzLWV0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZXhwZXJ0cy1iZWxpZXZlLXJlbnEtd2lsbC1naXZlLXByb2ZpdHMtMTAxNjgwMDAzMDcyMzIxLmh0bWzSAZEBaHR0cHM6Ly93d3cuaGluZHVzdGFudGltZXMuY29tL2JyYW5kLXN0b3JpZXMvYml0Y29pbi12cy1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWV4cGVydHMtYmVsaWV2ZS1yZW5xLXdpbGwtZ2l2ZS1wcm9maXRzLTEwMTY4MDAwMzA3MjMyMS1hbXAuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin vs Ethereum Price Prediction Experts believe RenQ will give profits - Hindustan Times",
        "content": "Bitcoin and Ethereum have been the top two cryptocurrencies in the market for several years now. However, as the crypto industry continues to evolve, new altcoins are emerging that could offer better profit potential.\n\nRenQ Finance (RENQ) is one such altcoin that experts believe could outperform both Bitcoin and Ethereum in 2023.\n\nHindustan Times - your fastest source for breaking news! Read now.\n\n>>>>> BUY RENQ TOKENS HERE <<<<<\n\nBitcoin vs Ethereum: A Brief Comparison\n\nBitcoin and Ethereum are both decentralized, open-source blockchain networks that allow for peer-to-peer transactions without the need for intermediaries like banks. Bitcoin was the first cryptocurrency, launched in 2009 by an unknown person using the pseudonym Satoshi Nakamoto. Ethereum, on the other hand, was created by Vitalik Buterin in 2013 and launched in 2015.\n\nWhile Bitcoin's primary use case is as a digital currency, Ethereum's blockchain is designed to support smart contracts and decentralized applications (DApps). Ethereum's native cryptocurrency, Ether (ETH), is used to pay for transaction fees and computational services on the network.\n\nBitcoin has a fixed supply of 21 million coins, while Ethereum does not have a fixed supply but uses a mechanism called \"proof of stake\" to ensure the network's security and stability.\n\nBitcoin and Ethereum Price Forecast 2023\n\nBitcoin and Ethereum have had an impressive run over the past few years, with Bitcoin hitting an all-time high of nearly $69,000 in 2021, and Ethereum reaching an all-time high of over $4,300 in May 2021 as well. However, both cryptocurrencies have faced significant price fluctuations in recent months, with Bitcoin now trading at around $27,684 and Ethereum trading at around $1,755 as of writing.\n\nMany experts believe that both Bitcoin and Ethereum will continue to face price volatility in the coming years. Some predict that Bitcoin's price could reach $100,000 by the end of 2023, while others believe that it could fall as low as $10,000. Similarly, Ethereum's price forecasts for 2023 range from a high of $10,000 to a low of $500.\n\nRenQ Finance: The Altcoin with Better Profit Potential\n\nWhile Bitcoin and Ethereum have been the top performers in the cryptocurrency market, RenQ Finance (RENQ) is an altcoin that experts believe has better profit potential in the coming years. RenQ Finance is a decentralized finance (DeFi) platform that aims to provide institutional-grade liquidity to the DeFi market.\n\n>>>>> BUY RENQ TOKENS HERE <<<<<\n\nOne of the key features of RenQ Finance is its \"smart contract\" technology, which allows users to access liquidity from multiple sources, including centralized exchanges, decentralized exchanges, and lending platforms. This technology ensures that users always get the best price for their trades and allows them to move their assets seamlessly between different platforms.\n\nAnother significant advantage of RenQ Finance is its low transaction fees. Unlike Bitcoin and Ethereum, which have high transaction fees due to network congestion, RenQ Finance's fees are minimal, making it a more cost-effective option for users.\n\nExperts predict that RenQ Finance could see significant price growth in the coming years, with some forecasting a price of $1 or more by the end of 2023. The platform's unique features and strong community support make it an attractive investment option for those looking to diversify their portfolio and capitalize on the growing DeFi market.\n\nConclusion\n\nWhile Bitcoin and Ethereum have been the top performers in the crypto market for several years, new altcoins like RenQ Finance are emerging that offer better profit potential. RenQ Finance's innovative features, low transaction fees, and strong community support make it a promising investment option for those looking to capitalize on the growing DeFi market.\n\nHowever, as with any investment, it's essential to do your own research and carefully consider the risks before investing in any cryptocurrency.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nDisclaimer: This article is a paid publication and does not have journalistic/ editorial involvement of Hindustan Times. Hindustan Times does not endorse/ subscribe to the contents of the article/advertisement and/or views expressed herein.\n\nThe reader is further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions.\n\nHindustan Times shall not in any manner, be responsible and/or liable in any manner whatsoever for all that is stated in the article and/or also with regard to the views, opinions, announcements, declarations, affirmations etc., stated/featured in same. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Hindustan Times of being absolved from any/ all potential legal action, or enforceable claims. The content may be for information and awareness purposes and does not constitute a financial advice."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiKmh0dHBzOi8vdGhlZGVmaWFudC5pby9wb2x5Z29uLXprZXZtLWxhdW5jaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Polygon to Deliver Zero-Knowledge Powered Rollup - The Defiant - DeFi News",
        "content": "Layer 2 Sets March 27 Launch Date for Ethereum Scaling Offering\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nPolygon, the Layer 2 blockchain, plans to deliver an Ethereum-compatible rollup powered by zero-knowledge proofs on March 27, the development team said on Tuesday.\n\nThe offering, which is called a zkEVM, is expected to offer enhanced privacy features and validate transactions faster than other Ethereum scaling solutions. Unlike other L2s powered by zero-knowledge proofs, developers will easily be able to deploy code written for Ethereum on Polygon’s offering.\n\n‘Intense and Inspiring’\n\n“After more than a year of intense and inspiring research, development, and testing, we are incredibly proud to launch the first-ever zkEVM mainnet,” Mihailo Bjelic, Polygon’s co-founder, said onTwitter.\n\nThe DeFi community is counting on rollups to scale Ethereum, which, despite its ubiquity, has proven ill equipped to handle the workload for decentralized finance. Rollups work by bundling together transactions on a Layer 2 network before submitting the bundle to Ethereum’s mainnet for processing. In other words, this innovation may be crucial in enabling Ethereum to fulfill its promise.\n\nWhat Is Polygon? A Step-by-Step Guide to One of DeFi Most Popular Blockchains\n\nArbitrum and Optimism, the top Layer 2 networks by total value locked, both use optimistic rollups. Optimistic rollups offer easy compatibility with the Ethereum Virtual Machine (EVM), Ethereum’s core smart contract engine — meaning developers can easily port their from Ethereum’s mainnet to Layer 2.\n\nRollups powered by zero-knowledge proofs have long been touted as the holy grail for Ethereum scaling due to their improved performance and faster settlement compared to optimistic rollups.\n\nNext Bull Cycle\n\n“[ZkEVMs] will definitely help scale Ethereum to support more transactions in the future and will be a sorely needed addition to support the next bull cycle,” Bobby Ong, co-founder of CoinGecko, told The Defiant.\n\nOng added that the teams that are earliest to secure zkEVM market share will enjoy a significant first-mover advantage over their competitors.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nHowever, existing solutions are not compatible with the EVM, meaning developers historically have needed to build code from scratch to deploy it on ZK-rollups.\n\nBut on July 20, 2022, Scroll, Polygon, and Matter Labs all announced they were developing rollups secured by zero-knowledge proofs, or zkEVMs. Consensys, the blockchain software company chaired by Ethereum co-founder, Joseph Lubin, also revealed it was working on a zkEVM in November.\n\nWhile Polygon is the first team to publicly reveal a date for the launch of its zkEVM, Scroll has outpaced its rivals in terms of testnet adoption.\n\nDriven by Speculation\n\nMore than 900,000 unique wallets have interacted with the testnet for Scroll’s zkEVM, compared to 544,309 for Matter Labs’ zkSync 2.0 testnet, 85,166 for Polygon, and nearly 20,000 for Consensys, according to Messari.\n\nHowever, the high levels of testnet activity for Scroll and zkSync 2.0 may be driven by speculation that the projects may airdrop native tokens to early adopters in the future.\n\nZero-knowledge proofs are a privacy-preserving encryption method that was pioneered in the 1980s but struggled to find product-market-fit until Zcoin and Zcash leveraged the technology for privacy coins in 2016."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jZnRjLWNhbGxzLWV0aC1hLWNvbW1vZGl0eS1pbi1iaW5hbmNlLXN1aXQtaGlnaGxpZ2h0aW5nLXRoZS1jb21wbGV4aXR5LW9mLWNsYXNzaWZpY2F0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "CFTC calls ETH a commodity in Binance suit, highlighting the complexity of classification - Cointelegraph",
        "content": "The United States Commodity Futures Trading Commission filed suit against Binance on March 27 for violations of the Commodities Exchange Act and CFTC regulations. Those violations included transactions with Ether (ETH), according to the suit. This claim, at first glance, touched on a notable point of contention between the CFTC and Securities and Exchange Commission.\n\nThe CFTC claimed in its suit that Binance engaged in transactions with “digital assets that are commodities including bitcoin (BTC), ether (ETH), and litecoin (LTC) for persons in the United States.” That was not a new position for the agency. The CFTC claimed ETH was a commodity in its suit against FTX in December, and Chair Rostin Behnam stated his opinion that ETH and stablecoins were commodities as recently as March 8 in a Senate hearing.\n\nThe CFTC position on ETH was fairly uncontroversial before the Ethereum Merge. After Ethereum moved to a proof-of-stake consensus mechanism, SEC Chair Gary Gensler commented on staking coins, saying that “from the coin’s perspective, […] that’s another indicia that under the Howey test, the investing public is anticipating profits based on the efforts of others.”\n\nGensler’s comment brought on a slow wave of reactions. In February, for example, Ethereum co-founder and crypto entrepreneur Joseph Lubin told Cointelegraph, “Staking is not a security,” and it would be a “terrible path for the U.S.” to make it so. He added that he thought the U.S. courts would agree with him and that “there would be a tremendous outcry from not just the crypto community but different politicians and certain regulators” if ETH were classified as a security.\n\nRelated: CFTC head looks to new Congress for action on crypto regulation\n\nThe CFTC case against Binance does not rest on the nature of ETH as much as the nature of Binance products, however, limiting its applicability to the larger argument.\n\n“In this particular case, ETH is being treated as a ‘commodity’ rather than a ‘security,’” Timothy Cradle, director of regulatory affairs at Blockchain Intelligence Group, told Cointelegraph. “The complaint references securities as they relate to swaps.” Cradle added:\n\n“The economics of an offering including ETH could still change the definition applied to the token. For example, ETH staking could still be construed as an investment contract, and as such a security.”\n\nSome transactions, such as mixed swaps involving ETH, could be subject to regulation by both the SEC and CFTC, Cradle said, but that “would not necessarily define ETH itself as a security as mixed swaps also include commodities and currencies.”\n\nThis more complex approach to regulation would not necessarily imply cooperation between the two agencies. Yankun Guo, a partner at law firm Ice Miller, said of the situation in a statement to Cointelegraph:\n\n“It shows that both the multifaceted nature of how tokens function and how they are used can cause them to fall under multiple agencies’ jurisdictions. […] I wouldn’t be surprised to see a similar lawsuit by the SEC naming all the same tokens except BTC as securities.”\n\nSilver lining\n\n\n\nThe CFTC suit against Binance states that ETH is a commodity\n\n\n\nTask failed successfully pic.twitter.com/8HiF8LUOoi — sassal.eth (@sassal0x) March 27, 2023\n\nMagazine: Can you trust crypto exchanges after the collapse of FTX?"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjgvZXRoZXJldW0tc3Rha2luZy1wcm92aWRlci1saWRvLXRvLWluY29ycG9yYXRlLW5mdHMtaW50by11bnN0YWtpbmctcHJvY2Vzcy_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAzLzI4L2V0aGVyZXVtLXN0YWtpbmctcHJvdmlkZXItbGlkby10by1pbmNvcnBvcmF0ZS1uZnRzLWludG8tdW5zdGFraW5nLXByb2Nlc3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Staking Provider Lido to Incorporate NFTs Into Unstaking Process - CoinDesk",
        "content": "Ether withdrawals on Lido, where users can unstake their stETH and receive ETH at a 1:1 ratio, will have two steps: request and claim, according to Mariya Muzyko, product manager at Lido, during the call Tuesday afternoon. Once a user requests a withdrawal, they will receive a Lido-issued NFT representing their withdrawal request. The user can then use the NFT to claim their ETH rewards. The NFT is burned after the user redeems and claims their ETH."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDMvMjgvZWlnZW5sYWJzLWVpZ2VubGF5ZXItNTBtLWZ1bmRpbmctcm91bmQtYmxvY2tjaGFpbi1jYXBpdGFsLWluZnJhc3RydWN0dXJlL9IBc2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDMvMjgvZWlnZW5sYWJzLWVpZ2VubGF5ZXItNTBtLWZ1bmRpbmctcm91bmQtYmxvY2tjaGFpbi1jYXBpdGFsLWluZnJhc3RydWN0dXJlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Professor behind EigenLabs gets $50 million funding, promises to upgrade Ethereum network - Fortune",
        "content": "EigenLabs, which aims to make Ethereum as fast and flexible as centralized networks of servers like Amazon Web Services, announced on Tuesday a $50 million funding round led by Blockchain Capital.\n\nSreeram Kannan, the founder and CEO of EigenLabs as well as an associate professor at the University of Washington, Seattle, declined to provide his company’s implied valuation. Other investors in the round include Coinbase Ventures, Polychain Capital, Electric Capital, Hack VC, and Finality Capital Partners.\n\n“One of the biggest reasons blockchains are not able to support the original vision of, ‘Hey, we’re going to do social networks and Uber and all these crazy things,’ [is] because infrastructure is not ready for it,” Kannan told Fortune.\n\nHe believes his company’s flagship product, EigenLayer, is a potential solution to blockchain’s infrastructure crisis, joining a flood of other infrastructure-focused startups that have secured hoards of cash during the most recent crypto bear market.\n\n“By lowering the cost of trust and capital, [EigenLayer] opens up opportunities for entrepreneurs to experiment and build while significantly easing the financial barriers that have hindered innovation in the past,” Bart Stephens, founder and managing partner at Blockchain Capital, said in a statement.\n\nAs opposed to startup founders who immediately jumped from dorm room to boardroom, Kannan hails from academia. During his master’s and doctoral studies, he researched peer-to-peer wireless networks and soon grew interested in blockchain technology. When he landed at the Seattle campus of the University of Washington, he eventually took leave to launch his own startup. And in 2021, he founded EigenLabs.\n\nKannan saw that the performance of Ethereum, a cloud-computing network that is decentralized—or not owned by one tech conglomerate—paled in comparison to the centralized networks of servers run by the likes of Amazon and Google.\n\nSpecifically, when developers on Ethereum run their code on the blockchain, they do not have the choice of which servers, or Ethereum nodes, execute their programs. This creates redundancy, as many servers process the same code.\n\nDevelopers building on top of EigenLayer, Kannan says, will be able to choose which nodes run which parts of an application’s code. This capability allows programmers to create a division of computing labor, a capability long since available to developers using, say, AWS.\n\nTo show the utility of EigenLayer, he and his team are building a “data availability layer” atop their product, or a faster way to write data onto Ethereum’s blockchain, whose data inscription capabilities, Kannan says, are currently reminiscent of that of computers from the 1990s.\n\nBut this is just one promise of EigenLayer, which Kannan now hopes to build out as he adds employees, funds code audits, and supports developers seeking to build with his product.\n\n“Our focus,” he told Fortune, “will be exclusively on maximizing the surface of innovation, which is, What new things can you build? Which is going to onboard the next group of application builders, which then onboards the next group of users.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGVjcnlwdC5jby8xMjQ2NjAvYml0Y29pbi1ldGhlcmV1bS1jZnRjLWJpbmFuY2UtY2VvLWNoYW5ncGVuZy16aGFv0gFQaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNDY2MC9iaXRjb2luLWV0aGVyZXVtLWNmdGMtYmluYW5jZS1jZW8tY2hhbmdwZW5nLXpoYW8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Fall as CFTC Sues Binance and CEO Changpeng Zhao - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe leading cryptocurrency exchange by trading volume, Binance, and its CEO Changpeng Zhao were sued Monday by the Commodity Futures Trading Commission (CFTC).\n\nThe U.S. regulator alleged that Zhao and his company violated trading and derivatives rules, according to a lawsuit filed by the CFTC in a Chicago federal court.\n\nThe two largest cryptocurrencies by market capitalization, Bitcoin and Ethereum, fell on the news, according to CoinGecko. Over the past hour, Bitcoin had fallen 3.3% to $26,800, and Ethereum had stumbled 2.9% to under $1,700.\n\nAD\n\nAD\n\nZhao responded to the lawsuit's announcement by tweeting “4,” alluding to a tweet he made in January that connects the number to “Ignore FUD, fake news, attacks, etc.”\n\n4 — CZ 🔶 Binance (@cz_binance) March 27, 2023\n\nThe lawsuit alleges that Binance has operated a facility for trading digital asset derivatives in the U.S. since at least July 2019, allowing residents to trade futures, swaps, and options on cryptocurrencies including Bitcoin, Ethereum, and Litecoin.\n\nBinance also made attempts to grow its footprint in the U.S. despite claims that the exchange would prevent U.S. residents from accessing Binance’s platform, the lawsuit claims.\n\n“Binance has taken a calculated, phased approach to increase its United States presence despite publicly stating its purported intent to ‘block’ or ‘restrict’ customers located in the United States from accessing its platform,” it states.\n\nAD\n\nAD\n\n1/23 Oh boy https://t.co/2JnbfirRrp Case is up and it's bad. This is the CFTC attempting to strike *fatal* blow to Binance, and at first read through... I think they actually have really strong chances here of succeeding in toppling the Binance empire. — Adam Cochran (adamscochran.eth) (@adamscochran) March 27, 2023\n\nThough Binance, Zhao, and other employees at the exchange knew they were required to register Binance with the CFTC after soliciting customers in the U.S., the lawsuit claims they have all “chosen to ignore those requirements and undermined Binance’s ineffective compliance program.”\n\nOne of the ways that Binance undermined its compliance program was by having its officers, employees, and agents assist users in using a virtual private network (VPN) to obscure their location. CNBC reported last week that the exchange played a role in helping people bypass restrictions in China to access the exchange.\n\nThe lawsuit went on to claim that Binance’s reluctance to disclose the location of its executive offices is reflective of the exchange’s attempts to avoid regulation. It states that Binance failed to comply with laws designed to detect and prevent money laundering and terrorist financing.\n\n“Binance has never been registered with the CFTC in any capacity and has disregarded federal laws essential to the integrity and vitality of the U.S. financial markets,” the lawsuit states. “Unless restrained and enjoined by this Court, Defendants are likely to continue to engage in the acts and practices alleged in this Complaint.”\n\nThe lawsuit includes messages sent via the encrypted messaging app Signal that were collected from Zhao’s telephone. It added that Zhao instructed Binance representatives to use Signal to communicate with customers based in the U.S.\n\n“The defendants’ own emails and chats reflect that Binance’s compliance efforts have been a sham and Binance deliberately chose—over and over—to place profits over following the law,” acting director of the division of enforcement at the CFTC Gretchen Lowe said in a press release. “The CFTC and its Enforcement Division will pursue those digital asset platforms and individuals who flout and actively attempt to circumvent CFTC regulatory requirements.”\n\nAs part of its lawsuit, the CFTC seeks to compel Binance to repay allegedly ill-gotten gains that stem from the misconduct it is accused of. It also wants Binance to pay civil penalties and accept bans on trading as well as its ability to register within the U.S.\n\nAD\n\nAD"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctZXRoLWhvbGRlcnMtc2NyYW1ibGVkLWZvci1zaGVsdGVyLWZvbGxvd2luZy1jdGZjcy1jb21tb2RpdHktcHJvc2NyaXB0aW9uL9IBZ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctZXRoLWhvbGRlcnMtc2NyYW1ibGVkLWZvci1zaGVsdGVyLWZvbGxvd2luZy1jdGZjcy1jb21tb2RpdHktcHJvc2NyaXB0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "How ETH holders scrambled for shelter following CFTC’s ‘commodity’ proscription - AMBCrypto News",
        "content": "ETH’s supply outside of exchanges reached an all-time high.\n\nIncrease in adoption has been challenging since the token was called a commodity.\n\nThe number of Ethereum [ETH] held in self-custody reached its highest for the first time since the cryptocurrency became public in 2015, Santiment disclosed. At the time of writing, this number was 101.18 million, despite experiencing some drawbacks in September 2022.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nWithout fail, the ETH supply on exchanges reached an all-time low, closing at 10.30%. A situation like this implied that holders of the altcoin were confident in its long-term relevance, with a possible positive effect on the price action. However, the same measures reflected the skepticism investors may have towards keeping assets on exchanges.\n\nBreaking down the aftereffects\n\nThe development arose after the U.S. Commodity Futures Trading Commission (CFTC) accused Binance of breaking the country’s financial laws. Before the latest indictment, a number of exchanges were mounted with pressure as regulators seem in lurking mode.\n\nHowever, ETH was not left out of the picture. The SEC seemed resolute in its position to proscribe assets under the Proof-of-Stake (PoS) consensus as securities. But the CFTC had a different opinion about the cryptocurrency, as it called ETH a commodity in a statement made by Chairman Rostin Behnam.\n\nETH’s self-custody ATH might come as a shock, as other cryptocurrencies, including Bitcoin [BTC], had recorded high numbers. One undeniable factor that could have impacted the rise was Vitalik Buterin’s response to the FTX issue last November.\n\nAt that time, the Ethereum founder discussed the idea of non-custodial Centralized Exchanges (CEXs) while rooting for users to look in the Decentralized Exchanges’ (DEXs) direction.\n\nDespite the conviction displayed by ETH holders, the project’s network growth took a sharp dump in the last 24 hours. The metric shows the number of new addresses being created daily on a network.\n\nHold in traction, but ETH validators have a task\n\nAt press time, ETH’s network growth was down to 13,800. This implied that new entries were low, and Ethereum’s user traction was struggling. But there was a minute compensation for the blockchain with the state of the active addresses.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nAccording to the on-chain analytic platform, there was a 467,000 rise in active addresses in the last 24 hours. This helped the 30-day performance of the metric to hit 5.95 million. The hike represents an increase in transactions on the Ethereum blockchain by already existing addresses.\n\nMeanwhile, there has been a new update to the Shanghai upgrade as Prysmatic Labs announced a necessary node and validator operation. The core implementation team of the Ethereum PoS noted that failure to do such could lead to a fork in the chain or loss of rewards."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMjQ2MzEvcG9seWdvbi1sYXVuY2hlcy1maW5hbC1tYWlubmV0LXprZXZtLXNvbHV0aW9uLXNjYWxlLWV0aGVyZXVt0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNDYzMS9wb2x5Z29uLWxhdW5jaGVzLWZpbmFsLW1haW5uZXQtemtldm0tc29sdXRpb24tc2NhbGUtZXRoZXJldW0_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Polygon Launches Final Mainnet for zkEVM Solution to Scale Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAnother day, another zkEVM launch.\n\nPolygon today announced the final mainnet for its zkEVM product after the product’s testnet launch last October.\n\n“zkEVM can be recognized as the ‘holy grail’ of blockchain scaling,” Polygon’s co-founder Mihailo Bjelic told Decrypt. “It offers simultaneously three very important features. First is scalability. The second one is security. And the third one is EVM equivalency, or EVM compatibility. All three are equally important.”\n\nAD\n\nAD\n\nThe launch comes just days after zkSync launched its scaling solution, joining the competition to make Ethereum faster.\n\nWhat is zkEVM?\n\nzkEVM technologies batch transactions on so-called rollups into a zero-knowledge proof, hence the “zk,” and then execute those proofs on Ethereum. By reducing transactions into small pieces of data, this technology helps keep Ethereum relatively unclogged with activity.\n\nAs mentioned by Bjelic, these proofs are also easily compatible with the Ethereum Virtual Machine, making it easier for developers to simply move projects written using Solidity—Ethereum’s programming language—over to the networks.\n\nGiven the complexity of the code in play, the Polygon co-founder has also urged caution for users onboarding to the scaling solution.\n\n“This is bleeding edge technology that is deployed on mainnet for the first time and made available to everyone,” he said. “We definitely advise caution and not moving large amounts of funds to it. Give it time, basically, to become a little bit more battle-tested and mature.”\n\nAD\n\nAD\n\nThat doesn’t mean that the network is by any means untested, insisted Bjelic.\n\nIt’s already been through a comprehensive auditing cycle, both internally and externally. The team has also already identified several bugs and “made many improvements” to the network since its testnet launched last October.\n\n“Like any code, especially complex code like this one, it still needs time to fully mature. Here's why the label name is Beta,” he told Decrypt.\n\nBesides various crypto-native projects, including MetaMask and Lens Protocol, Telefónica Tech is also joining Polygon’s zkEVM Beta. The telco’s digital transformation subsidiary is turning to Polygon for its traceability and notarization solution called TrustOS."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdS50b2RheS80MTAtdHJpbGxpb24tc2hpYmEtaW51LXNoaWItYnVybi1ieS1ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLW1pZ2h0LWJlLWJpZ2dlc3Qtb2YtYWxsLXRpbWUtZGV0YWlsc9IBdmh0dHBzOi8vdS50b2RheS80MTAtdHJpbGxpb24tc2hpYmEtaW51LXNoaWItYnVybi1ieS1ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLW1pZ2h0LWJlLWJpZ2dlc3Qtb2YtYWxsLXRpbWUtZGV0YWlscz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "410 Trillion Shiba Inu (SHIB) Burn by Ethereum's Vitalik Buterin Might Be Biggest of All Time: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nConor Grogan, a director at Coinbase, recently took to Twitter to provide a list of the most expensive crypto-transactions-by-chain that he was aware of. According to the list he supplied, the Ethereum network's $4.4 billion move between Binance wallets on May 7, 2022, took the top spot.\n\nAdvertisement\n\nDid not include transactions to burn addresses; if I did, @VitalikButerin burn of $7B in SHIB would probably be #1 of all time\n\n\n\nNote: Cardano, Solana, Avalanche, Optimism, and others not included due to challenges navigating blockchain infrastructure there (Wen @ArkhamIntel?) pic.twitter.com/WXXeeNtqhp — Conor (@jconorgrogan) March 26, 2023\n\nIn the second spot, there was a $1.94 billion move by Binance to cold storage on Feb. 22.\n\nIn June 2018, Tron founder Justin Sun made a huge $1.46 billion transfer to the Huobi exchange. This took fourth place. Then in April 2020, $1.1 billion worth BTC moved from Bitfinex for the refill of its exchange hot wallet.\n\nAmong these noteworthy transactions is a transfer of $65.53 million worth of XRP from Bitso to Bithumb.\n\nWhile all of these transactions have a place in history, none stands out compared to Ethereum co-creator Vitalik Buterin's massive 410 trillion Shiba Inu burn.\n\nGrogan stated that if transactions to burn addresses are taken into consideration, Vitalik Buterin's $7 billion might be the biggest of all time. This even surpasses the $4.4 billion ETH move between Binance wallets previously stated. Grogan also says he did not include $13 billion worth of BETH burned back on June 7, 2022, in the list he provided for lack of clarity on the transaction.\n\nVitalik Buterin's massive 410 trillion SHIB burn\n\nIn May 2021, Ethereum co-creator Vitalik Buterin burned 90% of his SHIB holdings, totaling around $7 billion, saying he did not want to be a locus of power of that kind. Buterin had been unwillingly gifted half of SHIB's total supply.\n\nA stash of over 410 trillion tokens was sent to a dead blockchain address in a single transaction, removing them from circulation.\n\nThe remaining 10% was earmarked for charitable causes by the Ethereum co-creator."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtd2hhbGVzLXBsYXktc2h5LWd1eS1haGVhZC1vZi1zaGFuZ2hhaS11cGdyYWRlL9IBVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtd2hhbGVzLXBsYXktc2h5LWd1eS1haGVhZC1vZi1zaGFuZ2hhaS11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Ethereum [ETH] whales play ‘shy guy’ ahead of Shanghai Upgrade - AMBCrypto News",
        "content": "Holders of 10,000 to 1,000,000 ETH coins have reduced their holdings in the last month.\n\nLong-held ETH coins change hands as the Shanghai Upgrade draws closer.\n\nAhead of the 12 April date set for the Shanghai Upgrade, on-chain data revealed a gradual decline in Ether [ETH] holdings for whales that hold between 10,000 to 1,000,000 ETH coins.\n\nAccording to data from on-chain data provider Santiment, this cohort of investors held 1298 ETH tokens at press time. In fact, on 23 March, their collective ETH holdings fell to the lowest level in the last month. 30 days ago, this group of ETH investors held 1313 ETH coins.\n\nRead Ethereum [ETH] Price Prediction 2023-24\n\nConversely, ETH whales that hold between 10 to 10,000 ETH coins have intensified their Ether holdings during the same period, data from Santiment showed.\n\nHolding 358,100 ETH coins at press time, this group of ETH investors increased their holdings by 1% in the last month. As a result, they currently hold 28.87% of the total supply of the leading altcoin.\n\nLong-held Ether coins see action\n\nA further assessment of ETH’s on-chain performance in the last month revealed a slump in its Mean Coin Age and Mean Dollar Invested Age metrics on 22 March.\n\nPer Santiment Academy, Mean Coin Age refers to the average age of all coins/tokens on the blockchain. In contrast, Mean Dollar Invested Age refers to the average age of all coins/tokens on the blockchain weighted by the purchase price.\n\nA rise in an asset’s Mean Coin Age points to a network-wide accumulation of that token. On the other hand, when an asset’s Mean Dollar Invested Age increases, “it means that the locations of where the investments lie are becoming more and more dormant over time.”\n\nWhile it is normal for an asset’s Mean Dollar Invested Age to increase on most days, if it continues to rise for an extended period, it may suggest stagnancy on the coin’s network, making it difficult for the price to grow.\n\nThe brief decline in ETH’s Mean Coin Age and Mean Dollar Invested Age on 22 March indicated that long-held ETH coins changed hands, signaling a momentary drop in accumulation.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nA look at ETH’s exchange activity revealed a spike in the coin’s supply outside of exchanges on that day. This meant that while long-held ETH coins changed addresses, they were not sold. In fact, they have moved off exchanges and could have been staked.\n\nAt press time, the total value of ETH staked was 17.86 million ETH coins, having grown by 4% in the last month, according to data from Glassnode. During the same period, the total number of validators on the proof-of-stake network rallied by 4.2%."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9vcGVuc2VhLXNlZXMtYS1zbHVtcC1pbi1ldGhlcmV1bS1hbmQtcG9seWdvbi1uZnQtc2FsZXMtZGV0YWlscy1pbnNpZGUv0gFgaHR0cHM6Ly9hbWJjcnlwdG8uY29tL29wZW5zZWEtc2Vlcy1hLXNsdW1wLWluLWV0aGVyZXVtLWFuZC1wb2x5Z29uLW5mdC1zYWxlcy1kZXRhaWxzLWluc2lkZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "OpenSea sees a slump in Ethereum and Polygon NFT sales; Details inside - AMBCrypto News",
        "content": "Ethereum and Polygon-based NFTs on OpenSea gear up to close Q1 at their lowest sales volume yet.\n\nOpenSea’s market share has declined significantly since the year began.\n\nThe Q1 sales figures for Ethereum and Polygon-based non-fungible tokens (NFTs) on OpenSea are on track to register the lowest monthly volume of the year so far, according to data from Dune Analytics.\n\nEthereum-based NFT sales on the marketplace soared to a nine-month high of $643.61 million by the end of February. However, with four days left to end the first quarter of the year, OpenSea has logged $324.30 million in Ethereum-minted NFT sales in March, representing a 50% decline in sales volume from the February high.\n\nFollowing a record-breaking NFT sales volume of $109.12 million in February, sales of Polygon-based NFTs on OpenSea have experienced a sharp decline this month. Over the past 26 days, only $2.5 million in sales volume have been recorded, indicating a staggering 97% drop in sales.\n\nThe steep decline in sales volume of Ethereum and Polygon-based NFTs on OpenSea was attributed to the drop in the count of NFTs sold so far this month.\n\nRegarding Ethereum-minted NFTs on OpenSea, 715,925 NFTs have been sold so far. This represented a 16% decline from the 853,391 total NFTs sold in February and a 37% fall from the 1.13 million total Ethereum-based NFTs sold in January.\n\nRegarding Polygon NFTs on OpenSea, sales have plummeted by 93% this month, with only 35,064 NFTs sold compared to the 565,964 NFTs sold last month, and a 98% decline from the 1,514,895 NFTs sold in January.\n\nOpenSea’s dominance has dwindled severely\n\nData from DappRadar revealed a steep decline in key growth metrics for leading NFT marketplace OpenSea since the year began.\n\nFor example, the count of unique active wallets that trade on the marketplace has dropped by 98% in the last 90 days. Likewise, the transactions count on OpenSea has witnessed a 99% decline during the same period.\n\nThe decline in OpenSea’s dominance is attributable to the launch of Blur, which has gained significant traction since it became operational in October 2022.\n\nAccording to a recent report from Glassnode, Blur’s market share experienced a notable surge following the airdrop of its token on 14 February.\n\nBefore the distribution of the BLUR token, the NFT marketplace and aggregator held 48% of the NFT transfer volume across the entire market. However, the airdrop led to a significant increase in Blur’s NFT transfer volume, which soared to 78% at its peak.\n\nDuring the last week, Blur accounted for a significant portion of the total NFT sales volume, representing 73.8% of the market share. In contrast, OpenSea held a smaller share of 17%."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS93aHktemVyby1rbm93bGVkZ2UtcHJvb2ZzLWFyZS1jcml0aWNhbC10by1ldGhlcmV1bXMtZnV0dXJlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Why Zero-Knowledge Proofs Are Critical to Ethereum's Future - Unchained - Unchained",
        "content": "Episode 473\n\nIn this episode, Stanford cryptography professor Dan Boneh and a16z General Partner Ali Yahya elevate our knowledge of zero-knowledge proofs and their applications in the blockchain world. Listen as they dive into the intricacies of succinct proof systems, the difference between SNARKs and STARKs, the magic of recursive SNARKs, and why zero-knowledge systems are essential to the evolution of Ethereum.\n\nListen to the episode on Apple Podcasts, Spotify, Overcast, Podcast Addict, Pocket Casts, Stitcher, Castbox, Google Podcasts, TuneIn, Amazon Music, or on your favorite podcast platform.\n\nShow highlights:\n\nhow Ali became a general partner at a16z Crypto and why Dan started working on “the science of blockchains”\n\nwhat a succinct proof system is\n\nanalogies for understanding zero-knowledge proofs\n\nthe difference between SNARKs and STARKs and whether centralization can be fully avoided\n\nhow zero-knowledge technology became so crucial for blockchains\n\nthe reasons to push computations off-chain and the applications of this technology\n\nwhy zkEVMs are essential to help Ethereum scale\n\nwhy privacy is important not only in financial transactions but also in other areas like social networks and gaming\n\nthe challenges that arise from trusted setups and whether it would be possible to create false proofs\n\nhow to mitigate the trusted setup problem with different proof systems\n\nwhat is being built to make zero-knowledge proofs cheaper to create\n\nwhether a privacy-focused technology can be pursued while staying compliant with regulations\n\nhow zero-knowledge proofs can improve the security of blockchain bridges\n\n\n\n\n\nThank you to our sponsors!\n\nGuests:\n\nAli Yahya, general partner at a16z crypto\n\nDan Boneh, professor of computer science and electrical engineering, Stanford University; and senior research advisor, a16z crypto Using ZK Proofs to Fight Disinformation\n\n\n\nLinks"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9udmlkaWEtc2F5cy1jcnlwdG8tYWRkcy1ub3RoaW5nLTE4NTcxMzU1Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Nvidia Says Crypto Adds Nothing to Society, Despite Profiting From Mining - Yahoo Finance",
        "content": "Computer hardware manufacturer Nvidia has profited off of the cryptocurrency mining industry in recent years—but now CTO Michael Kagan has reportedly said that crypto does not “bring anything useful for society,” according to The Guardian.\n\nInstead, Kagan hopes that NVIDIA products are used for artificial intelligence (AI) development rather than crypto mining.\n\n“All this crypto stuff, it needed parallel processing, and [Nvidia] is the best so people just programmed it to use for this purpose,” Kagan said. “They bought a lot of stuff, and then eventually it collapsed, because it doesn’t bring anything useful for society. AI does.”\n\nNvidia Hackers Are Selling Ethereum GPU Mining Workaround\n\nWhile Kagan argues that the crypto industry has “collapsed,” Bitcoin and Ethereum, the two largest cryptocurrencies by market cap, have regained value in recent months. Bitcoin is up 17% in the past month, and Ethereum is up 7% per CoinGecko data.\n\nThe emerging Web3 gaming industry has also seen substantial venture capital funding in recent months. But Kagan simply doesn’t believe that crypto has merit.\n\n“I never believed that [crypto] is something that will do something good for humanity,” he added. “You know, people do crazy things, but they buy your stuff, you sell them stuff. But you don’t redirect the company to support whatever it is.”\n\nKagan did not immediately respond to Decrypt’s request for comment.\n\nNvidia has a historically mixed relationship with crypto. Before Ethereum’s move to a more energy-efficient proof-of-stake model in September 2022, there was a high demand for powerful graphics cards (GPUs) as Ethereum miners used them to mine token rewards via the original proof-of-work model.\n\nCombined with a pandemic-related chip shortage, the cost of GPUs skyrocketed and it became near-impossible for gamers to buy the latest generation of graphics cards.\n\nIn an effort to deter crypto miners, Nvidia first tried to force hashrate limitations on its products—for which hackers found a workaround. Later, the company released special products designed for crypto miners, such as the Nvidia Cmp Hx, a chip which NVIDIA’s website states is “designed for professional mining operations.”\n\nStory continues\n\nSEC Fines Nvidia $5.5M for Not Disclosing Crypto Mining Impact on Gaming Business\n\nDespite Kagan’s dislike for crypto, Nvidia has profited off of the industry for years. The firm’s PC original equipment manufacturer (OEM) revenue jumped 200% in 2017, with Nvidia writing that the spike was “due primarily to strong demand for GPU products targeted for use in cryptocurrency mining.”\n\nLast year, Nvidia paid the U.S. Securities and Exchange Commission (SEC) $5.5 million in fines for failing to disclose that its gaming GPUs also saw success because crypto miners were buying up those products en masse as well."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9mb3ItdGhlLWZpcnN0LXRpbWUtc2luY2UtMjAxNS1uZWFybHktOTAtb2YtdGhlLWV0aC1zdXBwbHktbm93LWluLXNlbGYtY3VzdG9keS_SAWtodHRwczovL2NyeXB0b3BvdGF0by5jb20vZm9yLXRoZS1maXJzdC10aW1lLXNpbmNlLTIwMTUtbmVhcmx5LTkwLW9mLXRoZS1ldGgtc3VwcGx5LW5vdy1pbi1zZWxmLWN1c3RvZHkvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "For the First Time Since 2015: Nearly 90% of The ETH Supply Now in Self Custody - CryptoPotato",
        "content": "The crypto analytics provider – Santiment – revealed that almost 90% of Ethereum’s supply is currently stored in self-custody addresses. The last time the figure was so high was in 2015, shortly after the protocol’s native token saw the light of day.\n\nThe new data comes at a time when investors seem to have lost some of their faith in centralized exchanges. Withdrawals from Binance soared in the past 24 hours, prompted by the recent clash between the platform and the CFTC.\n\nSantiment’s data showed that only 10.31% of Ethereum’s supply is now held on exchanges, the lowest ratio since the birth of the token.\n\nIt is worth noting that consumers have started moving their holdings en masse to self-custody addresses since September last year.\n\nThe process intensified in November during the FTX meltdown, which undermined the trust in centralized platforms.\n\nIt seems that some investors are rushing to move their possessions from Binance to cold wallets after the US CFTC threatened to sue the exchange for allegedly violating trading regulations.\n\nNansen showed that the company saw $400 million in net outflows over the past 24 hours. Interestingly, data released by Thanefield Capital indicated that investors had withdrawn approximately $850 million from the platform in the 12 hours preceding the indictment.\n\nBinance had to cope with substantial withdrawal requests again at the end of last year when US federal prosecutors hinted they could file money laundering charges against it.\n\nThe firm processed all transactions without registering any problems, while CEO Chanpeng Zhao (CZ) dismissed the accusations as “FUD.”"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL252aWRpYS1zYXlzLWNyeXB0by1hZGRzLW5vdGhpbmctdXNlZnVsLXRvLXNvY2lldHktYWZ0ZXItYmlsbGlvbnMtaW4tbWluaW5nLXNhbGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Nvidia says 'crypto adds nothing useful to society' after billions in mining sales - CryptoSlate",
        "content": "Nvidia’s Chief Technology Officer, Michael Kagan, has expressed a negative view on cryptocurrencies, stating that they do not “bring anything useful for society,” whereas “AI does.”\n\nCrypto isn’t ‘useful for society’\n\nAccording to Kagan, AI applications such as the chatbot ChatGPT have more value than mining crypto. Kagan’s comments are not too surprising given that Nvidia has a history of distancing itself from the crypto community, such as limiting the ability of its graphics cards to mine Ethereum in 2021.\n\nKagan doubled down on his anti-crypto stance, stating that he has never believed in blockchain technology.\n\n“I never believed that [crypto] is something that will do something good for humanity.”\n\nNvidia’s recent crypto past\n\nHowever, Nvidia’s success in the stock market over the past two years does seem to have a correlation to the crypto industry. In 2021, prior to The Merge, Nvidia released a graphics chip (CMP) that was optimized for Ethereum mining while limiting gaming-focused graphics cards. However, the chips failed to impress as sales were ‘nominal’ and collapsed 77% in the third quarter of 2022.\n\nIn addition, Nvidia was fined $5.5 million in May 2022 by the SEC for failing to disclose the number of GPUs sold for mining. The SEC alleged that Nvidia knew the cards were being used for mining but failed to reveal the information, which, they said, misled investors regarding the growth of the business. Given that the majority of Nvidia cards were used to mine Ethereum, which moved to proof-of-stake at the end of 2022, it is a fair criticism as demand for cards dissipated post-Merge.\n\nLeading up to the Ethereum Merge, which took place on Sept. 15, 2022, revenue for Nvidia gaming GPUs (which mostly still worked for crypto mining following community workarounds) fell to $1.57 billion, down from $3.2 billion the year prior. Thus, as demand for Ethereum miners fell, so did Nvidia’s sales. In fact, if you look at the Nvidia share price relative to the price of Ethereum, both reached all-time highs within a week of each other before declining significantly.\n\nInterestingly, Nvidia’s CEO, Jensen Huang, also said back in 2017 that “cryptocurrency and blockchain are here to stay. The market need for it is going to grow, and over time it will become quite large.”\n\nIt appears that now Ethereum has moved to proof-of-stake, and its CMP chips failed to take off; the company has all but completely turned its back on crypto, in line with Kagan’s statements. The company’s focus is on AI research and gaming, with major clients like Microsoft, Amazon, and Oracle purchasing over 36,000 of Nvidia’s AI-focused processors."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vZGVjcnlwdC5jby9uZXdzLWV4cGxvcmVyP3Bpbm5lZD0xMzkwMzgmdGl0bGU9c29sYW5hLXByb3RvY29sLWNlZ2EtcmFpc2VzLTUtbWlsbGlvbi1leHBhbmRzLXRvLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 16:39:38 GMT",
        "title": "News Explorer — Solana Protocol Cega Raises $5 Million, Expands to Ethereum - Decrypt",
        "content": "Mar 27, 4:00 pm\n\nThe Block\n\nSolana Protocol Cega Raises $5 Million, Expands to Ethereum\n\nCega, a DeFi derivatives protocol, has raised $5 million in a new funding round led by Dragonfly Capital, with participation from Pantera Capital and Robot Ventures. The round was realized via a Simple Agreement for Future Equity plus token side letter, and was an up round from Cega's last valuation of $60 million. This brings Cega's total funding to date to $9.3 million."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGVjcnlwdC5jby8xMjQ2NzIvdml0YWxpay1idXRlcmluLWhpZGRlbi1tZXNzYWdlLXBvbHlnb24temtldm3SAUxodHRwczovL2RlY3J5cHQuY28vMTI0NjcyL3ZpdGFsaWstYnV0ZXJpbi1oaWRkZW4tbWVzc2FnZS1wb2x5Z29uLXprZXZtP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Sends Hidden Message in First Polygon zkEVM Transaction - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nPolygon launched the long-awaited mainnet for its new Polygon zkEVM network today, and to mark the occasion, the core developers of the sidechain invited Ethereum creator Vitalik Buterin to send out the very first transaction—and he included a hidden message.\n\nButerin appeared on a livestreamed event to mark the occasion, and while building the transaction, he included the following message converted into hex code: “A few million constraints for man, unconstrained scalability for mankind.”\n\nFurthermore, Buterin repeatedly set the Ethereum network transaction gas limit to 69,042, potentially referencing one meme number (69) and nearly another one (420) as well. Polygon Labs Head of Growth Sanket Shah tweeted that the gas limit number made the Ethereum creator a “man of culture.”\n\nAD\n\nAD\n\n.@VitalikButerin did the symbolic first ever transaction on @0xPolygon #zkEVM and it has a message on it \"Millions of constraints for man, unconstrained scalability for mankind\" Goose bumps!! https://t.co/HLNiVyRLie pic.twitter.com/Ue0C1CuDTd — Sandeep Nailwal | sandeep. polygon 💜 (@sandeepnailwal) March 27, 2023\n\n“And just like that, Vitalik Buterin has completed the first transaction on the newly deployed Polygon zkEVM chain,” Polygon Labs President Ryan Wyatt tweeted this morning. “This is a big moment for scaling decentralized protocols to handle our growth.”\n\nPolygon zkEVM is billed as a next-generation blockchain network that enables faster and cheaper transactions that Ethereum’s own mainnet can handle.\n\n.@VitalikButerin sent the transaction on Polygon zkEVM He is a man of culture. Ensure that the gas limit is 69042 pic.twitter.com/Eh0ebi7giA — sanket.polygon | polygon zkEVM on 27th March (@sourcex44) March 27, 2023\n\nUnlike previous layer-2 and sidechain networks, a zkEVM pairs zero-knowledge rollups—which bundle together loads of transactions and execute those proofs onto Ethereum—with full compatibility with the Ethereum Virtual Machine. That means that it’s a native complement to Ethereum and that smart contracts, which contain the code that powers decentralized protocols and software, can be easily moved over to the zkEVM network.\n\nAD\n\nAD\n\n“zkEVM can be recognized as the ‘holy grail’ of blockchain scaling,” Polygon’s co-founder Mihailo Bjelic told Decrypt ahead of today’s launch.\n\nIt’s not the only zkEVM network out there, however: others are in development, and rival zkSync launched its own mainnet last week ahead of Polygon’s previously-announced move."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vdGhlZGVmaWFudC5pby9wb2x5Z29uLXprZXZtLWxpdmUtbWFpbm5ldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 14:09:03 GMT",
        "title": "Polygon’s Zero-Knowledge Rollup Goes Live On Mainnet - The Defiant - DeFi News",
        "content": "Second zkEVM To Launch In Four Days\n\nBy: Aleksandar Gilbert • Loading...\n\nDeFi News\n\nPolygon has released its Layer 2 blockchain built with zero-knowledge technology, becoming the second company in four days to make a so-called ‘zkEVM’ available to the general public.\n\nPolygon zkEVM remains in beta, and the company stressed that it should be used with caution – a fact that will change in the coming months, according to co-founder Mihailo Bjelic.\n\nIts release, nevertheless, marks a turning point in Ethereum scaling, he insists.\n\n“If we can maintain the security of Ethereum, achieve scalability, and do not sacrifice developer and user experience — that’s basically all we need, right?” Polygon co-founder Mihailo Bjelic said in an interview with The Defiant before the launch of Polygon zkEVM. “And zkEVM is, to the best of my knowledge, the only solution that offers all three things simultaneously.”\n\nPolygon’s MATIC token is down around 2% over the past 24 hours, according to data from The Defiant Terminal.\n\nzkEVMs\n\nLayer 2 blockchains built with zero-knowledge (zk) technology have been called the “holy grail” of making Ethereum cheaper and more performant. On Friday, Matter Labs released ZkSync Era, marking the first public launch of an Ethereum-compatible rollup secured by the technology.\n\nMatter Labs, Polygon, and others have raced to bring their rollups to market and storm a Layer 2 field dominated by optimistic rollups Arbitrum and Optimism, which together account for 88% of the crypto assets deposited on rollups, according to L2BEAT.\n\nScaling Ethereum\n\nEthereum is slow, and the simplest transactions typically incur a fee of $1 or more. That fee can surge when the network is congested — last May, during a hyped NFT sale from Bored Apes creator Yuga Labs, users incurred an average transaction fee of $474, according to DappRadar.\n\nLayer 2 blockchains, also known as “rollups,” batch and compress user transactions before appending them to the Ethereum blockchain. Doing so dramatically reduces the per-transaction cost and increases the number of transactions Ethereum can handle.\n\nRollups are considered the most promising technology to scale Ethereum. As such, the companies building them have been valued in the billions. But the field has been dominated by rollups built with so-called optimistic technology, which assumes submitted transactions are valid and provides a seven-day period during which one can dispute potentially fraudulent transactions. This means withdrawals take a week when using the official bridge.\n\nZK Technology\n\nZero-knowledge technology makes it possible to prove that a statement is or is not true — that John Smith is a millionaire, say — without revealing any of the information that would typically be required to do so — in this example, John Smith’s bank account or employment history.\n\nMany privacy-enhancing protocols leverage zero-knowledge technology, but the first Ethereum-compatible zk-rollups to hit the market will not preserve user privacy or obfuscate their transaction history.\n\nProponents of ZK rollups have long argued that they would be more secure than their “optimistic” competitors while providing instantaneous transaction finality — no seven-day dispute window required.\n\n“It is not possible to execute malicious transactions” on a zero-knowledge rollup, Bjelic said. “You just rely on mathematics.”\n\nBut they’re fiendishly complex, and building one that is compatible with the Ethereum Virtual Machine — the EVM in zkEVM — has proven difficult.\n\n“People familiar with the matter have been estimating that it’s gonna take roughly three to five years to build a zkEVM when we started a little bit more than a year ago,” Bjelic said. “This has been really an exciting journey during which we were able to achieve several important breakthroughs from the engineering and cryptography side.”\n\nPolygon zkEVM has been available for developers to test since October. Monday’s release marks its jump to Ethereum’s mainnet.\n\nOn the test network, developers are playing around with “test Ether, test MATIC tokens, whatever, there is no real value there,” Bjelic said. “When you’re on mainnet, you’re bridging actual assets. It’s the real thing.”\n\nWork In Progress\n\nBeta is developer shorthand for “work in progress.” Some long-running blockchains are still officially in beta, including Solana and Polygon’s original proof-of-stake sidechain,” Bjelic said. Nevertheless, users should exercise caution in Polygon zkEVM’s first couple of months.\n\n“It’s a bleeding-edge technology that has never been built before,” he said. “We will keep auditing it internally and externally. We have bug bounties etc. It’s a process of the network maturing, and it will take some months, if not a year.”\n\nZkSync Era was released Friday in alpha, the software development stage before beta.\n\nRollup Race\n\nThe race to launch the first Ethereum-compatible, zero-knowledge rollup has been contentious, with rival teams sniping at each other on social media over the past several months. Last year, a developer working on a competing zkEVM said Polygon’s zero-knowledge rollup did not meet the criteria to be called a zkEVM.\n\nBjelic attributed the “Twitter brawls” to the prestige that would come with delivering the first true zkEVM, and brushed off the criticism.\n\n“I think it always, obviously, boils down to the facts,” he said. “Vitalik [Buterin, the founder of Ethereum] helped introduce some clarity when it comes to the concept of zkEVM, and what is, and what is not.…and Polygon is very obviously a zkEVM, I think that’s not a question.”\n\nPolygon is most famous for its long-running blockchain, Polygon Proof-of-Stake. Polygon PoS is popular – with its speed and low fees, it has grown to become the fifth-largest blockchain as measured by total value locked, according to Defi Llama.\n\nWhile Ethereum-compatible, it is an entirely separate blockchain and does not append its transaction data to Ethereum. Last year, Bjelic said Polygon was working to turn Polygon PoS into a “true” Layer 2 that inherits its security from Ethereum.\n\nFuture of Polygon PoS\n\nWhich raises the question: having built the “holy grail” of Ethereum scaling, a true rollup, where does that leave Polygon PoS?\n\n“I think there’s definitely room for both,” Bjelic said. Because rollups submit transactions to Ethereum, they have inherent limitations in terms of throughput and how low they can push down transaction fees.\n\n“Polygon PoS chain still has very low fees and can have higher throughput than any rollup, including the zkEVM rollup,” he said. Some applications, such as DeFi lending platforms, which process a relatively small number of high-value transactions, don’t need the speed of PoS but could benefit from the security of a zkEVM. Blockchain-based games, on the other hand, might need fast and cheap transactions, which PoS is better positioned to deliver.\n\nBjelic said he was happy to release a zkEVM during a period some consider to be crypto’s darkest, with asset values still well below their all-time highs and heightened regulatory scrutiny in the US that has some entrepreneurs looking to move abroad.\n\n“The climate is generally kind of negative, I would say, and we now more than ever need some excitement,” he said. “And I think the zkEVM is really the technology that can reignite this interest. In some way, it can be kind of like a chatGPT for crypto.”"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vZGVjcnlwdC5jby9uZXdzLWV4cGxvcmVyP3Bpbm5lZD0xMzg4OTMmdGl0bGU9ZGVmaS1leGNoYW5nZS1keWR4LXRvLW1pZ3JhdGUtZnJvbS1ldGhlcmV1bS10by1jb3Ntb3MtaW4tc2VwdGVtYmVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 13:09:37 GMT",
        "title": "News Explorer — DeFi Exchange dYdX to Migrate From Ethereum to Cosmos in September - Decrypt",
        "content": "Mar 27, 1:01 pm\n\nDecrypt\n\nDeFi Exchange dYdX to Migrate From Ethereum to Cosmos in September\n\ndYdX has announced the launch of its V4 private testnet this Tuesday, taking a significant step towards leaving Ethereum and moving to Cosmos. Cosmos lets developers to spin up their own native blockchains and interact with one another. After the private testnet, a public testnet will be launched by the end of July due to Ethereum's lack of scalability. The mainnet launch on Cosmos is expected by the end of September."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMisQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iZWFycy1pbi10aGUtY3J5cHRvLW1hcmtldC1oYXZlLXN0YXJ0ZWQtdG8tZmVhci1ldGhlcmV1bS1ldGgtYW5kLXJlbnEtZmluYW5jZS1yZW5xLWFuZC10aGVpci1zdHJlbmd0aC1jYW4tcmV2ZXJzZS1hbnktYmVhci1tYXJrZXQtcG9zc2liaWxpdGllcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bears in the crypto market have started to fear Ethereum (ETH) and RenQ Finance (RENQ) and their strength can ... - Analytics Insight",
        "content": "Bears in the crypto market have been a force to be reckoned with, causing market downturns and bearish trends. However, with the rise of Ethereum (ETH) and RenQ Finance (RENQ), many crypto experts believe that the bear market may be coming to an end. In this article, we will explore why bears in the crypto market are starting to fear ETH and RENQ, and how these two cryptocurrencies could potentially reverse any bear market possibilities.\n\nThe Strength of Ethereum (ETH)\n\nEthereum (ETH) has been one of the most talked-about cryptocurrencies in recent times. ETH is a decentralized, open-source blockchain that allows developers to build decentralized applications (dApps) on top of it. ETH has become the go-to platform for developers looking to create smart contracts and dApps, making it one of the most widely adopted cryptocurrencies in the market.\n\nOne of the main reasons why bears in the crypto market are starting to fear ETH is because of its strong fundamentals. The network has a large and active developer community, with constant updates and improvements being made to the platform. Additionally, ETH has a wide range of use cases, from decentralized finance (DeFi) to non-fungible tokens (NFTs) and gaming.\n\nMoreover, ETH’s price has been on a steady rise. As of March 26, 2023, ETH’s price is around $1,775, with a market cap of $217 billion. With such a strong market capitalization and steady growth, bears in the crypto market are starting to worry that ETH could reverse any bearish trends.\n\nThe Strength of RenQ Finance (RENQ)\n\nRenQ Finance (RENQ) is a relatively new player in the crypto market, but it has quickly gained attention from investors due to its unique approach to decentralized finance (DeFi) and cross-chain interoperability. RENQ is designed to provide a decentralized platform for users to exchange assets across different blockchains, making it easier for users to move assets from one blockchain to another.\n\nRENQ’s unique approach to DeFi has caught the attention of many investors, and the cryptocurrency has been on a steady rise in recent months. As of March 26, 2023, RenQ Finance’s presale has raised over $3.4 million with a price of $0.03 per RENQ token. With such a strong response to the presale, bears in the crypto market are starting to fear that RENQ could also reverse any bearish trends.\n\nThe Potential for a Market Reversal\n\nWith the strength of ETH and RENQ, many crypto experts believe that a market reversal could be on the horizon. The fundamentals of these two cryptocurrencies are strong, and their market capitalizations and steady growth are proof that investors have faith in them.\n\nMoreover, the crypto market has been known to be volatile, and a sudden surge in demand for ETH and RENQ could potentially lead to a market reversal. The crypto market is also heavily influenced by market sentiment, and if investors start to feel bullish about ETH and RENQ, it could lead to a surge in demand and potentially reverse any bearish trends.\n\nConclusion\n\nThe crypto market has seen its fair share of bearish trends, causing worry among investors. However, with the impressive performance of Ethereum (ETH) and RenQ Finance (RENQ), crypto experts are optimistic that a market reversal is possible. ETH and RENQ have shown strong fundamentals, high market capitalizations, and consistent growth, indicating that investors have a great deal of confidence in these two cryptocurrencies.\n\nWhile the crypto market is always unpredictable, the potential for a market reversal is certainly there, and investors should keep a close eye on ETH and RENQ as they navigate the market.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmRhaWx5bWFpbC5jby51ay9zY2llbmNldGVjaC9hcnRpY2xlLTExOTA2ODI1L0NyeXB0b2N1cnJlbmNpZXMtbm90LXVzZWZ1bC1zb2NpZXR5LXNheXMtTnZpZGlhLmh0bWzSAXFodHRwczovL3d3dy5kYWlseW1haWwuY28udWsvc2NpZW5jZXRlY2gvYXJ0aWNsZS0xMTkwNjgyNS9hbXAvQ3J5cHRvY3VycmVuY2llcy1ub3QtdXNlZnVsLXNvY2lldHktc2F5cy1OdmlkaWEuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Cryptocurrencies are not 'useful to society', says Nvidia - Daily Mail",
        "content": "READ MORE: Crypto mining is worse for the environment than beef production\n\nFrom Bitcoin to Ethereum, cryptocurrencies have been hailed as the new way to pay for products and services online.\n\nBut according to one expert, they do not 'bring anything useful for society', despite using up massive amounts of processing power.\n\nMichael Kagan, chief technology officer at chipmaker Nvidia, has said cryptocurrencies will never 'do something good for humanity'.\n\nThe expert has citied artificial intelligence (AI) – including chatbot ChatGPT – as being of more use to the public and a better use of energy than 'crypto mining'.\n\nCryptocurrencies perform mining to generate new coins and verify transactions, but it's more environmentally costly than beef production, a recent study found.\n\nCryptocurrencies such as Bitcoin are the internet's version of money - unique pieces of digital property that can be transferred from one person to another\n\nKagan told the Guardian that the development of chatbots along the lines of ChatGPT was a more worthwhile act than crypto mining.\n\nWhat is crypto mining? People create Bitcoins and other cryptocurrencies through what is known as mining. Mining is the process of solving complex math problems using computers running Bitcoin software. These mining puzzles get increasingly harder as more Bitcoins enter circulation. Each time a puzzle is solved, a new groups of transactions - known as blocks - are added to the blockchain (the shared transaction record). Miners are rewarded by being issued with bitcoin. Advertisement\n\nChatGPT, created by San Francisco-based company OpenAI, has been trained on a massive amount of text so it can generate human-like answers to questions.\n\nSince its release in November, it's been used to write essays, prescribe antibiotics, fool job recruiters and even come up with beer recipes.\n\n'With ChatGPT, everybody can now create his own machine, his own programme,' Kagan said.\n\n'You just tell it what to do, and it will and if it doesn't work the way you want it to, you tell it \"I want something different\".'\n\nIn comparison, crypto is not 'something that will do something good for humanity', Kagan said.\n\nCryptocurrencies are the internet's version of money – unique pieces of digital code that can be transferred from one person to another.\n\nMining, meanwhile, lets people earn cryptocurrencies by solving computational problems that verify transactions in the currency.\n\n'All this crypto stuff, it needed parallel processing, and [Nvidia] is the best, so people just programmed it to use for this purpose,' Kagan said.\n\nBitcoin is the world's most popular cryptocurrency, but others include Ethereum and Litecoin (file photo)\n\nPictured, a data centre of BitRiver company providing services for cryptocurrency mining in the city of Bratsk in Irkutsk Region, Russia March 2, 2021. The cryptocurrency is 'mined' by high-powered computers that solve computational maths puzzles, the complexity of which require huge amounts of energy\n\nREAD MORE - Bitcoin mining uses more energy than beef production Climate damages attributable to Bitcoin mining averaged more than beef production and the mining of multiple precious metals put together Advertisement\n\n'They bought a lot of stuff, and then eventually it collapsed, because it doesn't bring anything useful for society. AI does.'\n\nHis comments came despite Nvidia selling graphics processing units (GPUs) for use in crypto mining, although the company released software back in 2021 that deliberately biased against the practice.\n\nInstead, the US company likes to focus on providing its chips to the gaming sector, helping render graphics and images by performing rapid mathematical calculations.\n\nIt's also rapidly expanding into fields such as AU and provides its GPUs to smart vehicles and robotics – including the likes of Tesla and Amazon.\n\n'[GPU] users are constantly discovering new applications for them, from weather simulation and gene sequencing to deep learning and robotics,' Matt Wuebbling, global head of GeForce marketing at Nvidia, previously told the Guardian.\n\n'Mining cryptocurrency is one of them.'\n\nEarlier this month, Microsoft said it had recently purchased tens of thousands of Nvidia AI-focused GPUs to power the workload of OpenAI, the company behind ChatGPT.\n\nMicrosoft is an investor in the company and the two are engaged in a partnership aimed towards accelerating 'AI breakthroughs'.\n\nChatGPT is a large language model that has been trained on a massive amount of text data, allowing it to generate eerily human-like text in response to a given prompt\n\nOpenAI has has already launched a more powerful second version of the tool called GPT-4, which is so advanced it could be 'harmful'.\n\n'GPT-4 and successor models have the potential to significantly influence society in both beneficial and harmful ways,' the company said.\n\nIts success has created a panic at Google, which fears that its days as the world's number one search engine could soon come to an end.\n\nGoogle scrambled to come up its own equivalent chat bot, called Bard, to be released in the 'coming weeks'.\n\nUnfortunately for Google, Bard presented incorrect information as fact in a Twitter video, instantly wiping £100 billion from the tech giant's value."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3RlY2guaGluZHVzdGFudGltZXMuY29tL3RlY2gvbmV3cy9jcnlwdG8tc3VycHJpc2UtZXRoZXJldW0tZm91bmRlci12aXRhbGlrLWJ1dGVyaW4tYmFja2luZy16YW1iaWEtcy1iaWQtdG8tYmUtYWZyaWNhLXMtdGVjaC1odWItNzE2NDgzNjg5MzU0MTQuaHRtbNIBnwFodHRwczovL3RlY2guaGluZHVzdGFudGltZXMuY29tL2FtcC90ZWNoL25ld3MvY3J5cHRvLXN1cnByaXNlLWV0aGVyZXVtLWZvdW5kZXItdml0YWxpay1idXRlcmluLWJhY2tpbmctemFtYmlhLXMtYmlkLXRvLWJlLWFmcmljYS1zLXRlY2gtaHViLTcxNjQ4MzY4OTM1NDE0Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Crypto surprise! Ethereum founder Vitalik Buterin backing Zambia's bid to be Africa's tech hub - HT Tech",
        "content": "Zambia may be better known for mining copper than crypto, but a group of young entrepreneurs are looking to reinvent the country as an African technology hub -- with support from Ethereum co-creator Vitalik Buterin.\n\nStartup founders from the southern African country and abroad are talking to the government about creating the regulatory and business environment that would attract more tech firms and capital. The group is in the process of organizing a conference in Lusaka, the capital, in May to draft detailed policy proposals that they believe will see Zambia succeed where previous African tech hubs have stuttered.\n\n“Ultimately it comes down to being welcoming,” said Mwiya Musokotwane, an early champion of the project and the son of Finance Minister Situmbeko Musokotwane. “If the policy doesn't really live up to people's expectations, noone's going to be there.”\n\nButerin, who helped create the world's second largest cryptocurrency in 2013, expressed his support in a virtual meeting with Zambian President Hakainde Hichilema earlier this year. That followed a 2019 visit to the country as a guest of Mwiya, who wanted him to view a new charter city outside Lusaka that is also positioning itself to attract businesses.\n\n“I was impressed by everyone I met's willingness to go and do big things,” the crypto pioneer said in an interview.\n\nThe talks are a further sign of Africa's recent and burgeoning role as a hotbed for startups, particularly in the fintech and e-commerce sectors. Businesses providing financial services to the continent's millions of unbanked yet online people are attracting the attention of foreign investors particularly from the U.S., and African firms raised a record $5 billion in 2021.\n\nCompanies including Nigerian payments firm Flutterwave Inc., whose latest $250 million fund-raising round valued it at more than $3 billion, are also interested in growing a presence in Zambia, Mwiya Musokotwane said.\n\nEmployment Drive\n\nFor Hichilema, attracting tech firms could be a means of delivering on one of his key election pledges -- boosting employment. More than one in four Zambians under the age of 24 have no income, according to data from the International Labour Organization, and the ratio has been worsening since 2013. The President's commitment to resolving the issue played a major role in his August election victory after five previous failed attempts.\n\nHe has since created the Ministry of Technology and Science as part of a drive to support the sector and help ease dependence on copper, which accounts for 75% of export earnings. The government is eager to consult with entrepreneurs on attractive policies for the tech industry, including tax incentives, according to Jito Kayumba, Hichilema's special assistant for economic and development affairs and a former director at Kukula Capital, which invests in young Zambian companies.\n\n“We want to have a much more open-minded approach,” Kayumba said in an interview from Lusaka. “You can't milk a cow that isn't fully developed.”\n\nEarly Mover\n\nPerseus Mlambo, originally from neighboring Zimbabwe, was one of the early movers. He started payments platform Zazu Africa Ltd. in Zambia five years ago, a firm that now accounts for half of Mastercard Inc. transactions in the country.\n\nHe went on to raise $3 million last year from investors led by U.S. fund Tiger Global LP for a new venture called Union54, a firm that allows companies to issue their own debit cards without going through a bank. Tiger, the investor firm of billionaire Chase Coleman, has also backed Flutterwave and been involved in talks on the Zambia hub.\n\n“Copper is old and boring,” Mlambo said in an interview from Belluno, north of Venice, Italy. Governments “risk missing the proverbial boat by over-investing in extractives and under-investing in software. Tech uplifts multitudes of people and the barrier to entry is very, very low.”\n\nBut ultimately the success of the project will come down to legislation.\n\nZambia must improve the ease and cost of getting work permits, according to Malawi-born Wiza Jalakasi, vice-president of global developer relations at Chipper Cash, another Africa-focused fintech startup. And Mlambo said he's been waiting for a residence permit to be approved since September.\n\nStill, the nation that's changed the ruling party three times in thirty years already has progressive financial services regulation, making it attractive, Jalakasi said.\n\n“It's not the biggest market in the region, but you can test things very easily,” he said. “That's only going to get better with time as these policies are implemented.”"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG8tbmV3cy1iaXRjb2luLWFuZC1ldGhlcmV1bS1wdXNoLXJlc2lzdGFuY2UtbGV2ZWxzLW5ldy1jcnlwdG8tZG9nZXR0aS1haW1zLWZvci1tZW1lLWNvaW4tdGhyb25lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Crypto News: Bitcoin and Ethereum push resistance levels; New Crypto Dogetti Aims for Meme Coin Throne. - Analytics Insight",
        "content": "The crypto world is showing mixed reactions to the Fed’s rate hike. While most currencies have taken a hit, Bitcoin (BTC) and Ethereum (ETH) have climbed back from slumps and are pushing ahead. New crypto Dogetti (DETI) is attracting investor attention with its unique features and focus on DeFi ecosystems.\n\nEthereum is pushing the crucial $1800 resistance level.\n\nEthereum (ETH) is pushing the $1800 resistance level, and there is optimism in the market that if ETH manages to break past the resistance mark, it will reach the $2000 mark soon. The token’s price has risen by almost 2% in the past 24 hours. Various factors contribute to Ethereum testing resistance levels, the foremost reason being ETH’s transition into a Proof-of-Stake coin. Ethereum’s growth as a favoured platform for DeFi applications is another factor adding to the rally in ETH prices.\n\nLong-term prospects of ETH are bright as the popularity of DeFi applications rises. Also, the volatility in the banking sector can also add growth to Ethereum, with the view that it is a more stable option than the former. Short-term volatility aside, the long-term investment credentials of Ethereum remain strong.\n\nBitcoin moves past rate hike blues.\n\nBitcoin (BTC) looks to cement its status as a safe haven investment option as the traditional financial system stares at banking failures. News of bank collapses and the general bad health of banks have contributed to a rally in Bitcoin prices. But the Fed’s rate hikes have put the rally on hold, and Bitcoin prices took a beating yesterday. But BTC prices have shown resilience and have climbed back to the $28k levels today.\n\nThe latest price rally of Bitcoin is a testament that it has shrugged off stress from the Fed’s latest round of rate hikes. In the background of the banking crisis, the premier crypto is resembling safer asset classes like gold and is displaying upward momentum. Investors decision to back Bitcoin may lie in its decentralised architecture with no single power centre. This feature differentiates it from fiat currencies, with powerful central banks controlling them. The growing popularity of decentralised finance will strengthen the case for favouring Bitcoin. Thus, Bitcoin could see a resurgence as the banking crisis unfolds. Nevertheless, its long-term prospects look strong on the back of the rise of DeFi.\n\nDogetti Eyes Top Doge Spot\n\nDogetti (DETI) is the newest entrant to the crypto world, and its stated goal is to be the top dog of the meme coin space. Dogetti is a community focussed token that plans to create generational wealth for its community. The token is themed around a DOGE mafia and calls itself the Dogetti family. The token is unique with its focus on decentralisation and community ownership. The Dogetti family’s plans to create generational wealth for its members hinge on its plans to develop a comprehensive ecosystem that has NFTs and DeFi projects playing a central role.\n\nDogetti stands apart from its peers with its flagship feature, the buy-back protocol. The buy-back protocol allows community members to earn a 2% reflection on all transactions. The protocol would allow the members of the Dogetti family to have a steady stream of income.\n\nNFTs play a crucial role in Dogetti’s plans for community engagement. The network would allow holders to have their versions of virtual pet Dogetti. NFTs on the network will give holders access to events and content. Another great feature of the Dogetti family is the DogettiDAO which will make decision-making on the network democratic and decentralised. Dogetti NFTs and DogettiDAO will put community members at the centre of the Dogetti project.\n\nDETI is based on the Ethereum blockchain and has a total supply of 100 billion tokens. Of the 100 billion liquidity, 75 billion are available on presale. The network also has plans for charity for which it will raise funds from taxes on its network.\n\nTo know more about Dogetti (DETI):\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaWctZXllcy1jb2luLWNvbW11bml0eS1wcmVwYXJlcy1mb3ItYm9uYW56YS1hcy1sYXVuY2gtbmVhcnMtYml0Y29pbi1ldGhlcmV1bS1jb250aW51ZS10by11cHRyZW5kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Big Eyes Coin Community Prepares For Bonanza As Launch Nears, Bitcoin & Ethereum Continue To Uptrend! - Analytics Insight",
        "content": "Crypto Soothsayers have predicted that the Big Eyes Coin is all set to break more records as the BIG community prepares for the official launch. When it comes to breaking records, Big Eyes Coin made headlines as it knocked the ball out of the park by hosting the most successful presale in recent history. Amidst terrible turbulence in the crypto market and a storm of volatility, Big Eyes Coin has successfully managed to raise $32 million! Based on these statistics, crypto investors are confidently placing their bets on Big Eyes Coin as they believe that this meme coin will soon come neck-to-neck with crypto giants like Bitcoin & Ethereum. Let’s learn more about this coin’s achievements till yet and why it is the safest and smartest investment option in the crypto market!\n\nBig Eyes Coin Presale – A Financial Gain Opportunity You Shouldn’t Miss!\n\nWithout a doubt, Big Eyes Coin has managed to captivate the hearts of most investors due to its generosity. This is also one of the major reasons why the Big Eyes Coin presale is turning out to be a sensational success. The BIG cat deeply cares about the financial gains of its community thus to ensure that every investor gets equal financial growth opportunities, it regularly gives out rewards and promo codes. From the magnificent loot boxes that can give up to a 1000% ROI to bonus codes that give a 250% bonus for free! – yep you read that right. Since the BIG launch is dawning upon us, this cute crypto kitty doesn’t want anyone to miss the chance to become an overnight millionaire which is why it has launched a very limited-time promo code BULLRUN250. This promo code allows you to get a 250% complimentary bonus upon the purchase of the BIG coins or loot boxes!\n\nIn addition to this, the Big Eyes Coin is also one of the few cryptos that deeply care about the well-being of their owners outside the crypto-verse as well. This is why the BIG cat has announced that 5% of the total generated revenue would go straight to charity wallets which will then be sent out for the well-being of the ocean. This all-rounder crypto is definitely off to a great start as investors are flocking to hoard this token and we can’t blame them as these off-furs are irresistible! Get your Big Eyes tokens now before the coin officially launches or you will miss out on the chance to gain massive presale benefits!\n\nBitcoin & Ethereum Regain Their Former Glory!\n\nThe rainbow is finally out after a long stormy winter night in the crypto town as most cryptos are once again hustling and bustling. The cryptos are chirping once again and are showing the world why they are the best investment options as the bullish trends restore in the crypto world. Among the loudest chirping ones are Bitcoin & Ethereum aka the king and queen of the crypto world. Despite hitting the rock bottom in the previous months, the crypto king and queen are back to their former glory as they continue to register massive gains over time. In the past seven days, Bitcoin registered 8.40% gains and ramped up its value to over $28,000 and maintains its top spot in the crypto chain, while Ethereum registered 5.67% gains in the last seven days and has increased its value to just above $1800 while maintaining the second spot from the top!\n\nKnow More About Big Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2R5ZHgtdXAtMTItYW5ub3VuY2VtZW50LW9mLWNvc21vcy10ZXN0bmV0L9IBT2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2R5ZHgtdXAtMTItYW5ub3VuY2VtZW50LW9mLWNvc21vcy10ZXN0bmV0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "dYdX Up 12% Following The Announcement Of Cosmos Testnet - Ethereum World News",
        "content": "DeFi exchange dYdX has announced the launch of its private testnet on Cosmos.\n\nThe testnet marks the DeFi crypto exchange’s transition to a completely decentralized model.\n\nNative token DYDX has gained over 12% since the testnet’s launch was announced earlier today.\n\ndYdX, one of the most popular decentralized crypto trading platforms, announced the launch of its private testnet on the Cosmos blockchain. The testnet brings the DeFi crypto exchange one step closer to transitioning to a completely decentralized model from its current “hybrid decentralized model”.\n\ndYdX to ditch Ethereum by September 2023\n\nAccording to a blog post by dYdX, the DeFi exchange recently achieved the third out of five milestones with the finalization of the private testnet’s launch. The launch is slated for 28 March 2023 and is expected to last between 2-3 weeks. The third milestone covers several objectives including Advanced order types, Dynamic funding rates, and documentation for Validators, among other things.\n\nThe decentralized trading platform plans to launch a fully public testnet by the end of July this year, thereby expanding the number of validators testing the changes. The DeFi exchange is anticipating the complete transition to Cosmos from Ethereum by September 2023, which is when its mainnet will go live.\n\nAntonio Juliano, founder, and CEO of dYdX told Bloomberg that the end game is full decentralization for his crypto exchange. The Cosmos mainnet will help eliminate centralized entities that are currently involved with the exchange’s operations. The move towards decentralization is also expected to help with the current regulatory landscape in the United States as authorities step up the crackdown on crypto.\n\nI think the end state for everything in DeFi has to be full decentralization. The middle ground doesn’t really work indefinitely.” Antonio Juliano, founder, and CEO of dYdX\n\nNews of the testnet’s imminent launch has sent native token DYDX soaring. The token has gained more than 12% since the announcement earlier, going from $2.1 all the way up to $2.4 at the time of writing."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZXRoLXN0cnVnZ2xlcy10by1icmVhay1vdXQtb2YtMTgwMC1haGVhZC1vZi10aGUtZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS13aWxsLXRoaXMtaW5jcmVhc2UtYnV5aW5nLXByZXNzdXJlL9IBlQFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZXRoLXN0cnVnZ2xlcy10by1icmVhay1vdXQtb2YtMTgwMC1haGVhZC1vZi10aGUtZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS13aWxsLXRoaXMtaW5jcmVhc2UtYnV5aW5nLXByZXNzdXJlLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "ETH struggles to break out of $1,800 ahead of the Ethereum Shanghai upgrade – Will this increase buying pressure? - Crypto News Flash",
        "content": "Ethereum (ETH) has witnessed some selling pressure over the weekend as it struggles to hold past $1,800. On the downside, $1680 is crucial support for the crypto.\n\nOver the last week, Ethereum whale addresses have been buying a good quantity of ETH ahead of the Shanghai upgrade.\n\nAfter a strong move to $1,800 last week, the world’s second-largest crypto Ethereum (ETH) has struggled to keep up with the rise and hold this level. Over the weekend, ETH faced some selling pressure. As of press time, Ethereum (ETH) is trading 1.88% down at a price of $1,756 with a market cap of $214 billion.\n\nMore or less, Ethereum seems to have entered a kind of consolidation just ahead of the Shanghai upgrade scheduled next month in April. On the technical chart, $1680 represents the top of a symmetrical triangle dating back to September 2021.\n\nAs the ETH price has already moved past this, it would serve as strong support for the altcoin going ahead. Thus, it will be important for the bulls to defend the $1680 level thereby preventing any further fall in the ETH price.\n\nAnother reason behind the selling pressure on Ethereum is the recent report by Bank of America that predicts that there will be a drop in ETH usage if the speed of the Ethereum network doesn’t pick up soon.\n\nThe Ethereum blockchain underwent the Merge upgrade last year in mid-September 2022 to improve the network scalability and performance. However, the analyst at Bank of America states that the speed of the Ethereum blockchain hasn’t increased considerably and is due for an upgrade if it wants to retain its position among the top two cryptocurrencies by market cap.\n\nEthereum Whales Back In Action\n\nAlthough the ETH price has come under some selling pressure, on-chain data shows that the Ethereum whales have been scooping up large supplies of ETH recently as the Shanghai upgrade draws closer. The Shanghai upgrade is important since it would unlock all the staked ETH allowing users to withdraw their coins from staking at their discretion.\n\nAs per the data from Santiment, Ethereum wallet addresses holding between 1,000 and more than 10,000 ETH as well the wallet addresses holding between 1 million to 10 million ETH tokens have been adding the ETH cryptocurrency to their kitty consistently over the past week. This clearly shows that the large wallet addresses are majorly bullish on the world’s second-largest cryptocurrency by market cap.\n\nIn addition to the Ethereum whales, the retail players have also been accumulating ETH consistently. The total number of Ethereum addresses with at least 0.01 ETH has now shot up to 23.3 million with the address count hitting an eight-month high as per the data on Glassnode.\n\nAt the same time, the total value locked (TVL) in the ETH 2.0 deposit contract has also touched a new all-time high above 17 million ETH. This is a bull-case scenario for ETH.\n\nAlthough, ETH has made strong advancements this year, it has struggled to keep pace with the Bitcoin gains.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL2JpdGNvaW4tZXRoZXJldW0tYnVyZ2VyLWtpbmcv0gE8aHR0cHM6Ly93d3cudHJvbndlZWtseS5jb20vYml0Y29pbi1ldGhlcmV1bS1idXJnZXIta2luZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Enabled In Burger King Paris: Details - TronWeekly",
        "content": "Bitcoin, Ethereum, and a host of crypto assets have been added to fast food behemoth Burger King [BK] at its Paris outlet, thanks to a partnership between crypto payment providers, Alchemy Pay and Binance Pay.\n\nIn accordance with the press release dated March 27, Burger King has installed market-leading Instpower power bank rental machines that take cryptocurrency payments processed by cryptocurrency payment providers- Alchemy Pay and Binance Pay.\n\nInstpower previously collaborated with the two top payment modules to enable consumers to pay for power bank devices at more than 14,000 places across the world using cryptocurrency.\n\nThe latest addition of Burger King is touted as a big step forward for the firm and for the acceptance of cryptocurrency for real-world goods and services.\n\nThe inclusion of the machines in Paris has thrilled Yann Phu, CEO of Flash Development, the distributor in charge of achieving the deployment of Instpower equipment across Europe:\n\n“This collaboration with Burger King in Paris has taken us to the next level with our operations in Europe. By having Alchemy Pay helping users to pay with crypto via Binance Pay, we are bringing cutting-edge payment options to Europeans.”\n\nIn 2017, the Russian subsidiary of the highly popular Burger King restaurant conducted the first cryptocurrency test by issuing WhooperCoin tokens on the Waves network, which were made available to consumers at every purchase.\n\nAlthough the project never took off, other BK branches started to accept Bitcoin payments, such as in the Netherlands, Germany, Venezuela, Brazil, and more. Nowadays, one can buy Whoppers with Bitcoin through debit cards.\n\nBitcoin also gained more utility, thanks to the crypto-based rewards program.\n\nCrypto Reward Schemes Boosted Bitcoin’s Use Cases\n\nThese are becoming increasingly popular within the restaurant industry as brands look for new and innovative ways to engage with consumers and build their technological cred.\n\nIn 2021, Burger King US partnered with Robinhood to give away free cryptocurrency to its customers.\n\nA year ago, popular burger chain Shake Shack launched a new Bitcoin-based rewards program in an effort to attract younger consumers and test the potential for long-term adoption.\n\nAs reported by TronWeekly, Shake Shack begin offering rewards of up to 15% in the form of Bitcoin for all payments made via Cash Card, a debit card available through Cash App."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3dlYi1zdG9yaWVzL2xpc3Qtb2YtaGlzdG9yaWNhbC1ldmVudHMtZm9yLWV0aGVyZXVtLXNpbmNlLWl0cy1sYXVuY2gv0gFiaHR0cHM6Ly93d3cuY3J5cHRvcG9saXRhbi5jb20vd2ViLXN0b3JpZXMvbGlzdC1vZi1oaXN0b3JpY2FsLWV2ZW50cy1mb3ItZXRoZXJldW0tc2luY2UtaXRzLWxhdW5jaC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 14:09:14 GMT",
        "title": "List of historical events for Ethereum since its launch - Cryptopolitan",
        "content": "Ethereum Homestead was the next iteration of the Ethereum blockchain, released in March 2016. This version of Ethereum marked a significant improvement over Frontier, as it introduced several new features and improvements, including security enhancements, bug fixes, and increased scalability. Homestead was the hard fork of the Ethereum network as it sparked the transition of Ethereum from a proof-of-concept platform to a production-ready platform. This release paved the way for wider adoption of Ethereum by developers and businesses, as it provided a more secure and stable environment for building and deploying dApps."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2V0aGVyZXVtLWNvLWZvdW5kZXItZmlyc3QtdHJhbnNhY3Rpb24tcG9seWdvbi16a2V2bS1iZXRhLWxpdmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin initiates first transaction as Polygon zkEVM Mainnet Beta goes live - Cryptopolitan",
        "content": "Polygon, a leading Ethereum scaling platform, announced the public launch of its zero-knowledge Ethereum Virtual Machine (zkEVM) beta Monday. This release is anticipated to be one of the most sought-after blockchain trends in 2023 and reflects Polygon’s commitment to open-source values by making all aspects of zkEVM code available to developers for study and collaboration. As part of its launch celebration, Vitalik Buterin, Ethereum’s co-founder, was granted the honor of initiating the first transaction on zkEVM, live-streamed at ETHGlobal at 4:30 p.m. Central European Time (10:30 a.m. ET).\n\n.@VitalikButerin did the symbolic first ever transaction on @0xPolygon #zkEVM and it has a message on it\n\n\n\n\"Millions of constraints for man, unconstrained scalability for mankind\"\n\n\n\nGoose bumps!! https://t.co/HLNiVyRLie pic.twitter.com/Ue0C1CuDTd — Sandeep Nailwal | sandeep. polygon 💜 (@sandeepnailwal) March 27, 2023\n\nVitalik Buterin recently demonstrated the success of his zkEVM transaction, sending 0.005 ETH to a random address with a cheeky message referencing Neil Armstrong’s famous first words upon walking on the moon: “A few million constraints for man, unconstrained scalability for mankind.” This sparked an industry-wide race to create and launch zkEVMs, with Polygon ultimately asserting their victory by publicly announcing that over 50 companies had agreed to build on the Polygon zkEVM technology. However, Buterin himself warned in a blog post back in August that different versions of zkEVMs come with various trade-offs, such as speed versus the degree of compatibility with the Ethereum Virtual Machine. “In general, it’s healthy for the space that all of these types are being explored,” he wrote.\n\nPolygon’s zkEVM is now available to users, but co-founder Sandeep Nailwal has stressed that caution should still be exercised as the technology is in its early days. To ensure user safety, Polygon has reiterated its commitment to exploring zero-knowledge technology for its main chain, the Polygon POS chain. Nailwal believes that this technology is the future of Ethereum and expects to see most large web3 applications built on zero-knowledge-proven layer 2 chains within the next 18 to 24 months."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vY2FwdGFpbmFsdGNvaW4uY29tL2hvdy10by1zdGFrZS1vbi1saWRvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 13:08:40 GMT",
        "title": "How Do I Stake ETH And Other Crypto On Lido in 2024 - Captain Altcoin",
        "content": "Home » Journal How To Stake ETH With Lido? Is Lido Good For Staking? JournalStaking How To Stake ETH With Lido? Is Lido Good For Staking? Rene Peters\n\nStaking Ethereum with Lido Finance is a great way to earn rewards without limitations imposed by validators. It’s super straightforward and simple to get started – all you need is a private crypto wallet and ETH in it.\n\nIn the dynamic landscape of digital finance, Lido Finance emerges as a beacon for those seeking to maximize their cryptocurrency’s potential. Offering a unique blend of flexibility and profitability, Lido’s staking rewards have become a focal point for savvy investors looking to stake crypto and reap substantial returns.\n\nThis article delves into the intricacies of Lido Finance, exploring its staking rewards system, and illuminating how you can stake crypto to unlock new avenues of growth in your digital asset portfolio. Join us as we navigate the rewarding world of Lido staking, where every crypto holder can become a stakeholder.\n\nQuick summary – How To Stake With Lido? Key Points Details 🌐 What is Lido? Lido is a liquid staking platform on the Ethereum blockchain. It allows users to stake any amount of Ethereum (ETH) without the need for complex infrastructure. 🔄 How does Lido work? Users stake their ETH and receive stETH tokens in return at a 1:1 ratio. The stETH tokens can be used in the same way as regular ETH. Staking rewards are received daily and there is no minimum deposit or lock-up periods for staking on Lido. 🎯 Features of Lido Lido offers liquid staking and is governed by a DAO. Users don’t need to lock assets or maintain a staking infrastructure. After depositing tokens, users receive liquid tokens in return. These tokens are staked by the DAO-controlled smart contracts using an elected staking provider. 💰 Benefits of staking with Lido Users can stake any amount of ETH and earn rewards every 24 hours. There’s no need to stake 32 ETH, and users can reduce the risk of losing staked cryptocurrency through software failures. Staked ETH (stETH) can be used in the DeFi space. ⚠️ Risks of staking with Lido Risks include potential delays or issues with the implementation of Ethereum 2.0, and vulnerabilities associated with using smart contracts. DeFi platforms like Lido are particularly vulnerable to security threats. 📈 Is Lido staking lucrative? Staking ETH with Lido can be a convenient way to stake on the Ethereum 2.0 network. It’s accessible to beginners and users get rewarded with Lido as well. Users can claim their cryptocurrency anytime without it being locked up for one year, as is the case with other staking protocols. ❓ What is stETH? stETH is the tokenized form of staked Ether issued by Lido. It combines the initial staking deposit and the daily staking rewards. stETH can be used in the same way as ETH and can be used on most DeFi apps. 🏦 Lido DAO and the LDO token The Lido DAO manages the Lido staking protocol. The LDO token is the Lido DAO governance token, enabling holders to vote on the DAO’s governance decisions. The amount of LDO they stake determines their voting power.\n\n🤔 What is Lido and How it Can Help You Earn More with ETH\n\nLido is a powerful Ethereum-based liquid staking solution that can help you to earn more with ETH. Supported by leading blockchain staking providers, it allows you to access DeFi applications like Curve, Sushi, Yearn and more without having to deal with complex infrastructure. You can stake any amount of ETH into Lido, unlocking the opportunity to earn rewards through stETH (staked ETH). This balance could then be used for further earning on other yield platforms and lenders.\n\nWhat makes Lido Finance even better, is that it removes problems associated with staking Ethereum such as illiquidity, immovability and inaccessibility. Providing full control of your ETH while staking – meaning you can unstake within seconds when you’re finished – making it one of the safest ways to make the most out of your cryptocurrencies.\n\n🌐 Supported Networks: A Comprehensive List of Lido’s Integrations\n\nIf you’re looking to stake on Lido, then the first thing you should check out is their comprehensive list of supported networks. They currently support Ethereum, Solana, Polygon, Polkadot, Kusama and many more! All you need to do is choose your network and start staking your tokens.\n\nLido also has a Scorecard feature that tracks your staking balances and activities in real-time. This gives you complete transparency over your staking rewards and activities. With such a wide range of integrations available from Lido, finding the perfect network for your needs is easy. So why not take advantage of these integrations today? Get started with Lido’s platform and stake those tokens in no time!\n\n🛠️ The Inner Workings of Lido: A Detailed Explanation\n\nThe inner workings of Lido are an interesting thing to understand. But first things first: What does Lido do?\n\nLido is a decentralized protocol that allows users to stake Ether (ETH) and receive rewards for helping secure the Ethereum blockchain. Stakers receive stETH at a 1:1 ratio to the amount of ETH they stake, allowing them to use stETH instead of regular ETH. The staking rewards are sent directly to your account on a daily basis and there’s no deposit or lock-up period required when staking on Lido.\n\nMoreover, staking with Lido doesn’t come with any downside risks as it only involves participating in the security of Ethereum without exposing yourself to any risk. The Annual Percentage Yield (APY) you’ll get when you stake your Ether will depend largely on the overall amount of ETH being staked in the network – As more people join in and more ETH is being staked, you can expect the APY rates to drop. It’s important to keep track of current APY rates, which is easy with the platform’s app.\n\nLastly, it should be said that Lido takes 10% of the yield you earn plus an additional 0.3% gas fee for transferring liquidity from Layer 1 to Layer 2, all part of their pooling process. All in all, if you’re looking for a safe way to invest your Ether then definitely consider giving Lido a try!\n\n📝 Staking ETH with Lido and Metamask: A Step-by-Step Guide\n\nStaking Ethereum (ETH) on the Lido protocol is a snap. Unlike other protocols, it allows users to instantly withdraw their tokens at any time with no penalty. Rewards are paid out every 24 hours based on the current Annual Percentage Yield (APY). Here’s a step-by-step guide to staking ETH with Lido and Metamask.\n\nFirst, open up Metamask on your supported browser and ensure you’ve deposited some ETH into your wallet. Once that’s all set up, head over to lido.fi and click “Start Staking”. Enter the amount of ETH you want to stake, select “Stake Now”, confirm with MetaMask, and you’re in! You’ll start receiving rewards every 24 hours.\n\nIf you need to access or withdraw your staked ETH early, go back to lido.fi and click “Unstake”, enter the amount of ETH you want to unstake, then select Unstake Now; and finally confirm it with Metamask – it’s that easy! So why wait? Start taking advantage of higher yields today with Lido!\n\n👉Step 1. Connect your wallet to the Lido app\n\nIf you want to stake on Lido, you first need to connect your wallet to the app. To do this, simply go to stake.lido.fi and hit the “Connect Wallet” button at the top right of the page or under the Stake Ether amount.\n\nOnce you’ve done this, you’ll be asked to read and accept terms and conditions, after which you can select which type of wallet you want to connect with Lido Protocol. You can choose from one of several supported wallets and must also make sure that it has an ETH balance before confirming your connection to the app. Once everything is set up properly, you will be able to proceed with staking on Lido!\n\n👉Step 2. Select the amount of ETH to stake\n\nOnce you’ve connected your wallet to the Lido ETH Staking App, the next step is to select your desired amount of ETH to stake. The app will show you how much ETH is available for staking and the current APY rate. It will also display all details of your transaction and the amount of stETH tokens you’ll receive.\n\nYou’ll need to keep some ETH in your wallet to pay for transaction fees and make sure you read the disclaimer regarding the 10% reward fee which will be applied to rewards earned, not your deposited amount.\n\nNow that you understand all that, it’s time to select how much ETH you want to stake! Go ahead and click “Submit” when you’re done making your selection – and watch those Ethereum rewards start rolling in!\n\n👉Step 3. Confirm the transaction from your wallet\n\nConfirm the transaction from your wallet: It’s time to confirm the transaction that you have set up in your wallet. This can usually be done by clicking on the “Confirm” button once you have reviewed all the transaction details. After doing so, you can now proceed with staking your ETH on Lido!\n\nWith Lido, you can rest assured knowing that you have complete control over your assets as you are free to unstake them at any time you choose. Furthermore, one great thing about using Lido for staking is that it can open up a whole new world of possibility regarding DeFi. For example, you could buy stETH on one of the many DEXs like 1Inch and then use Lido to unleash its full potential!\n\n💰 Maximizing Your Earnings: How Much Can You Make with Lido Staking?\n\nMaximizing your earnings is key when choosing how to stake on the Lido protocol. With Lido ETH staking you can make a decent return while also contributing to Ethereum’s 2.0 network. Plus, you don’t have to worry about having your ETH locked up for long periods of time like other staking protocols require.\n\nSo, just how much can you make with Lido staking? To maximize returns, the important elements are: understanding the reward system, having enough ETH in your wallet (at least 32 eth) and having patience. With these things in mind, you could potentially earn anywhere from 4-5% APY annually on your staked crypto – without sacrificing liquidity or flexibility.\n\nWhether you’re a beginner or a seasoned pro at staking, understanding the rewards will help you decide which protocol is best for your needs and increase your chance of earning more over time. With Lido staking, you get rewarded with their associated tokens and enjoy quick liquidity and flexibility whenever needed – making this a great option for any investor!\n\nRead also:\n\n🏆 Benefits of Staking with Lido: Why It’s a Top Choice for Investors\n\nStaking with Lido has become a top choice for investors looking to maximize their returns by taking advantage of the platform’s many benefits. With Lido, users can stake their ETH while still being able to trade, use, or unstake their tokens. Furthermore, it allows users to securely earn staking rewards no matter how big or small their deposits may be.\n\nLido also minimizes risks associated with losing staked funds through software failures or slashing due to its liquid staking feature and non-custodial structure — which means that users always have full control over their assets. Additionally, its stETH can be used as a building block in the DeFi space; for example, lending out collateral on ARCx or yield farming on Curve Finance.\n\nAll in all, Lido provides a trusted and improved alternative to exchange staking and self-staking for the Ethereum community — making it an ideal choice for investors who want more flexibility with their investments without compromising security and reliability.\n\n🗳️ The Lido DAO: How It Empowers Investors with Decentralized Governance\n\nThe Lido DAO enables users to have more control over their investments through decentralised governance. With the Lido DAO, users gain access to a suite of tools and services that allow them to securely stake Ethereum without going through the technical complexities of self-staking.\n\nThese tools also enable deposits as small as 0.00001 ETH, meaning users don’t have to commit large amounts of ETH to benefit from staking rewards. This helps decentralize the Ethereum network further, by reducing the threshold entry for potential stakers.\n\nIn addition, the Lido DAO works to help promote Lido and educate its users on staking and other related topics. Through this process, investors are empowered with knowledge and understanding of how their investments will be governed and managed continuously.\n\nOverall, the Lido DAO offers a streamlined solution that enables individuals with all levels of experience to safely and easily stake Ethereum while still enjoying returns on their investment. It’s an innovative approach that allows people to experience decentralized governance in action!\n\n🤝LDO token\n\nThe LDO token is the native token of the Lido DAO and is responsible for decentralized ownership of the platform. It grants holders voting rights to influence key decisions that will shape the future of Lido. Furthermore, when staked, it determines a user’s voting power and also allows them to add/remove nodes from and manage fee parameters on the network.\n\nLDO tokenomics works like this: 36.32% went to the DAO treasury, 20% to initial Lido developers, 22.18% to investors, 15% to founders & future employees and 6.5% to validators & signature holders.\n\nWhat is stETH?\n\nstETH is a tokenized representation of the Ether (ETH) that has been staked into Lido, a liquid staking solution on the Ethereum blockchain. You will receive a 1:1 ratio of stETH tokens in return whenever you stake ETH with Lido. These tokens represent your original staking deposit plus any daily rewards earned every day at 12pm UTC, due to a supply rebase.\n\nNot only can you hold and manage these tokens as if they were regular ETH, but you can also use them for integrated platforms like Curve or SushiSwap, apply them as collateral for DeFi lending services, sell them off, or exchange them back into their original form – Ether (ETH). The total amount of Ether (ETH) deposited into Lido’s contract is represented by the supply of stETH tokens held by users; this figure can always be seen on Etherscan whenever needed.\n\n❓ Frequently Asked Questions about Lido and Staking ETH\n\nIs Lido good for staking❓ Yes, Lido is a great option for staking ETH. It provides users with a secure and reliable platform to stake their funds with full control over their assets. Additionally, its liquid staking feature helps minimize risks associated with slashing or software failure and allows users to benefit from staking rewards without having to commit large amounts of ETH. How much does it cost to stake a Lido❓ Lido applies a 10% fee on a user’s staking rewards. How does Lido pay out❓ Lido pays out rewards to stakers based on their portion of the total amount of Ethereum staked in Lido. The reward rate is determined by the sum of all ETH staked, minus any fees associated with the platform and its services. Rewards are paid out in ETH on a daily basis at 12:00 UTC, and they can be tracked and monitored via Etherscan. Can I withdraw staked ETH from Lido❓ Yes, you can withdraw staked ETH from Lido at any time. All you need to do is go into your Lido Staking dashboard, click on the ‘Withdraw’ button and enter the amount of ETH you would like to withdraw. Once the withdrawal is processed, your staked ETH will be transferred back to your wallet address and you will no longer be able to earn rewards from it. Is staking ETH on Lido safe❓ Yes, staking ETH on Lido is safe. The platform utilizes best-in-class security measures to protect user funds and data, including multi-signature wallets, regular audits and penetration testing. Additionally, the Lido team has also implemented a liquid staking feature that helps minimize risks associated with slashing or software failure while still allowing users to benefit from staking rewards without having to. How often does Lido payout❓ Lido pays out rewards to stakers based on their portion of the total amount of Ethereum staked in Lido. The reward rate is determined by the sum of all ETH staked, minus any fees associated with the platform and its services. Rewards are paid out in ETH on a daily basis at 12:00 UTC, and users can expect to receive a reward for each day that their ETH is staked. What are the risk of staking with Lido❓ There are some risks associated with staking through Lido, including the risk of slashing and software failure. Slashing occurs when a validator or delegator signs off on an invalid block, and as a result, their stake is reduced. Software failure can also lead to losses since it results in downtime that prevents users from earning rewards from their stake. In addition, there is always a risk of loss due to hacking or other malicious activities. How much ETH is staked in Lido❓ At the time of writing, Lido has over $1.5 billion in ETH staked on its platform. This is a testament to the popularity and success of the protocol, as it has become one of the leading DeFi protocols for staking ETH. Over 20,000 users have chosen to stake their ETH with Lido, and this number is rapidly growing as more people recognize the benefits of staking through the platform. What are the risks in liquid staking❓ Liquid staking carries some risks associated with slashing and software failure. Slashing occurs when a validator or delegator signs off on an invalid block, resulting in their stake being reduced. Software failure can lead to downtime and prevent users from earning rewards from their stake.\n\n\n\nAdditionally, there is always a risk of loss due to hacking or other malicious activities. Liquid stakers should also be aware of the risk of impermanent loss, which occurs when the price of the token they are staking moves against them. Can you stake Lido token❓ Yes, you can stake Lido tokens. All you need to do is deposit your Lido tokens into the wallet of your choice and start staking. Once you’ve done that, you can track and monitor your rewards in real-time using the Etherscan dashboard. Staked Lido tokens will accrue rewards based on their portion of the total amount of Ethereum staked in L ido, and rewards are paid out in ETH on a daily basis at 12:00 UTC. Is Lido a DeFi❓ Yes, Lido is a decentralized finance (DeFi) protocol that enables users to stake their Ethereum in order to earn rewards. The platform utilizes best-in-class security measures to protect user funds and data, as well as a liquid staking feature that helps minimize risks associated with slashing or software failure while still allowing users to benefit from staking rewards without having to lock up their tokens."
    }
]