[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvLm5ld3MvbGFzdC1jaHJpc3RtYXMtMTAwLWluLWJpdGNvaW4tYW5kLWV0aGVyZXVtLWlzLW5vdy1zaWduaWZpY2FudGx5LWhpZ2hlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Last Christmas' $100 in Bitcoin and Ethereum is now significantly higher - crypto.news",
        "content": "If you decided to invest $100 in each BTC and ETH last Christmas, how much would they be worth today?\n\nAs the market is seemingly out of a prolonged crypto winter that began in early 2022, on Christmas day, we’re witnessing a significant contrast in the value of major cryptocurrencies, notably Bitcoin (BTC) and Ethereum (ETH), compared to the previous year’s values.\n\nIf an investor had the foresight to invest or gift someone $100 worth in Bitcoin and Ethereum last Christmas, they would be reaping some handsome profits.\n\nLet’s delve into the numbers. On Christmas Day in 2022, Bitcoin was valued at approximately $16,900. Fast forward to today, it stands at around $43,500. This substantial growth means that a $100 investment in Bitcoin a year ago would now be worth approximately $257.4, representing a 157.4% increase.\n\nYou might also like: SEC met multiple spot Bitcoin ETF applicants on Dec. 21\n\nEthereum has shown a similar performance. It has soared from around $1,200 on Christmas Day 2022 to about $2,290 today. Consequently, a $100 investment in Ethereum last Christmas would now amount to approximately $190.83, marking a 90.8% increase.\n\nHeading into 2024, the market is beaming with positivity, as the hype of Bitcoin ETFs and halving is poised to bring the market back to its all-time highs. Analysts are hoping for this bull market to stretch beyond next Christmas, but it will depend on which side of the scale market sentiment goes in the new year.\n\nFollow Us on Google News"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1uZWFycy1yZXNpc3RhbmNlLWRlc3BpdGUtZGVjbGluaW5nLW9wZW4taW50ZXJlc3Qtd2lsbC1ldGgtcHJpY2UtaG9sZC1idXllcnMtaG9wZS_SAYMBaHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2V0aGVyZXVtLW5lYXJzLXJlc2lzdGFuY2UtZGVzcGl0ZS1kZWNsaW5pbmctb3Blbi1pbnRlcmVzdC13aWxsLWV0aC1wcmljZS1ob2xkLWJ1eWVycy1ob3BlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Nears Resistance Despite Declining Open Interest! Will ETH Price Hold Buyers’ Hope? - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nIn recent weeks, Ethereum’s price has witnessed a growing surge of confidence as the total crypto market cap prepares to gain old momentum. As Bitcoin’s dominance exhibits a minor downturn, traders are increasingly placing their bets on Ethereum. This has steered Ethereum’s price towards critical immediate resistance levels. Analysts are now keenly observing whether Ethereum will break the $2,500 mark, marking a significant surge, or if it will encounter a decline.\n\nOI Loses Momentum Near High\n\nData from Coinglass reveals a recent decline in Ethereum’s open interest (OI), signaling a reduction in market momentum. The OI decreased from a peak of $7.95 billion to $7.57 billion, marking a drop of more than $380 million. This trend indicates that traders are actively closing their futures positions, which in turn is leading to a decrease in Ethereum’s volatility.\n\nIn the past 24 hours, Ethereum’s price experienced a total liquidation exceeding $15 million. This occurred as Ethereum struggled to break above the $2,300 mark, resulting in the liquidation of $10 million worth of long positions.\n\nA recent report by crypto analytics firm IntoTheBlock shows that Ethereum’s market cap has surged by 87% in the past year, rising from about $149 billion to its present value of $280 billion. Despite this growth, Ethereum’s performance, when compared to other major assets, indicates that there is still room for improvement, particularly given the numerous positive developments the asset has undergone in 2023.\n\nEthereum’s Layer 1 scalability challenges and high transaction fees have halted the expansion of its DeFi ecosystem. Despite being a leading player in decentralized applications, Ethereum’s scaling limitations have resulted in high costs and slower transactions, leading to user and developer dissatisfaction.\n\nIn contrast, Solana has been advancing rapidly, outpacing Ethereum with its high throughput and low-cost transactions. Solana has been dominating the altcoin market recently with robust buying demand, capturing a significant market share and surpassing ETH.\n\nWhat’s Next For ETH Price?\n\nEther’s price surged past the 20-day Exponential Moving Average (EMA), reaching $2,300, but failed to hold momentum due to increasing selling pressure. Currently, bears are aiming for a decline to solidify their positions. As of writing, ETH price trades at $2,278, declining over 0.8% from yesterday’s rate.\n\nShould the price remain above $2,300, it is anticipated that Ether might approach its 52-week peak of $2,403. This level is crucial for sellers to defend, as a breakthrough and sustained trading above this mark could trigger the next upward trend phase, potentially pushing the ETH price towards the $2,500 mark.\n\nConversely, if Ether faces resistance at this key level and starts to decline, it might retest the significant support level around $2,200. For the sellers to gain an advantage, they would need to break the ascending support line. In that case, we might see ETH price below the $2K mark."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1ldGZzLWJpdGNvaW4tZXRmcy1hcHByb3ZhbC1sYXctZGVjb2RlZC1kZWMtMTgtMjXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Ethereum ETFs pushed to May, Bitcoin ETFs approval in January: Law Decoded - Cointelegraph",
        "content": "The United States Securities and Exchange Commission is pushing back its decision on several Ether (ETH) exchange-traded funds (ETFs) to May 2024. The agency delayed its decision on the Hashdex Nasdaq Ethereum ETF and the Grayscale Ethereum Futures ETF. The Hashdex Ether ETF aims to hold both spot Ether and futures contracts, while Grayscale’s Ethereum Futures ETF is seen as a “trojan horse” that would corner the SEC into allowing Grayscale to convert its Ethereum Trust to a spot Ethereum ETF. In the filings, the agency said it was instituting proceedings that involve gathering further public input around whether or not the ETFs should be listed. The agency also pushed back its decision on the VanEck spot Ethereum ETF and the spot Ethereum ETF lodged by Cathie Wood’s ARK Invest and 21Shares.\n\nHowever, some analysts still expect approvals by early 2024 regarding Bitcoin (BTC) spot ETFs. Bloomberg ETF analysts James Seyffart and Eric Balchunas anticipate that the U.S. SEC will approve a spot Bitcoin ETF in January 2024 despite multiple last-minute amendments that applicants are scrambling to add to their proposals. Seyffart shared his observations about BlackRock’s latest spot Bitcoin ETF update, which accepted the SEC’s cash redemption system instead of in-kind redemptions or those implying non-monetary payments like BTC.\n\nThe analyst noted that multiple applicants, such as ARK, Bitwise and Valkyrie, have already set up a cash-only model, while some — including Grayscale and WisdomTree — still have in-kind or cash in their filings. In mid-December, finance lawyer Scott Johnsson predicted that ETF applicants would eventually have to bend their knee to using a cash creation and redemption model for their ETF.\n\nMontenegro won’t extradite Do Kwon\n\nA court in Montenegro has canceled the extradition approval of Terraform Labs co-founder Do Kwon to either the U.S. or South Korea. The High Court of Podgorica previously determined the legal requirements for Kwon’s extradition in November 2023, leaving the final decision on Kwon’s extradition to Montenegro’s minister of justice. According to the latest decision by the appeals court, Kwon’s defense has successfully appealed that decision, and the case should be returned to the Podgorica Basic Court for retrial. The panel of the appellate court specifically assessed that the previous decision by the High Court of Podgorica was affected by a “significant violation of the provisions” of Montenegro’s Criminal Procedure Code.\n\nContinue reading\n\nBinance will pay $2.7 billion to CFTC\n\nA U.S. court has entered an order against crypto exchange Binance and its former CEO, Changpeng “CZ” Zhao, that will see Binance pay $2.7 billion and CZ pay $150 million to the Commodity Futures Trading Commission. The CFTC announced that the U.S. District Court for the Northern District of Illinois had approved the previously announced settlement and concluded the enforcement action first issued by the CFTC in November. “The court finds Zhao and Binance violated the Commodity Exchange Act (CEA) and CFTC regulations, imposes a $150 million civil monetary penalty personally against Zhao, and requires Binance to disgorge $1.35 billion of ill-gotten transaction fees and pay a $1.35 billion penalty to the CFTC,” wrote the CFTC in a statement. The approved settlement marks the conclusion of a long-running case against CZ and Binance by the CFTC. The agency sued the executive and his exchange for evading federal law and operating an illegal derivatives exchange.\n\nContinue reading\n\nChina will tighten the regulations of online gaming\n\nThe General Administration of Press and Publication of China (GAPP) aims to restrict the scope of activities related to in-game tokens. The GAPP published a draft of its guidelines for the online games industry, suggesting physical goods purchases and the exchange of game tokens for legal tender should be banned. The guidelines contain 62 articles and cover a wide range of issues related to the regulation of online games. It proposes some stricter regulations: The companies will have to obtain a license in China, store their customers’ data for up to two years, ensure that their content complies with a list of national and socialist values, and expel any opportunity for anonymous registration of users.\n\nArticle 23 regulates the use of game tokens. It intends to ban the use of game tokens for buying physical goods, exchanging them for “products and services of other units” or “legal tender.” The latter point leaves room for speculation, given that cryptocurrencies don’t qualify as legal tender in China, and no specific mention of “crypto” is present in the guidelines. However, it appears the GAPP is trying to insulate online game economies from a tighter interchange with a real economy.\n\nContinue reading"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1kaXBzLTIyMjAv0gFCaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLWRpcHMtMjIyMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Dips Again – Is This Bulls Trap or Technical Correction? - NewsBTC",
        "content": "Ethereum price is correcting gains from the $2,350 resistance zone. ETH could start a fresh increase if it stays above the $2,200 support zone.\n\nEthereum started a downside correction from the $2,350 resistance zone.\n\nThe price is trading near $2,275 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $2,285 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could attempt a fresh increase unless there is a close below $2,200.\n\nEthereum Price Remains Supported\n\nEthereum price failed again to gain pace for a move above the $2,350 level. ETH formed a short-term near $2,350 and recently started a downside correction, like Bitcoin.\n\nThere was a move below the $2,320 and $2,300 levels. The price even spiked below $2,250. A low was formed near $2,247 and the price is now correcting higher. There was a move above the $2,265 level. The price climbed above the 23.6% Fib retracement level of the downward move from the $2,326 swing high to the $2,247 low.\n\nEthereum is now near $2,275 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,285 level. There is also a key bearish trend line forming with resistance near $2,285 on the hourly chart of ETH/USD.\n\nThe trend line is close to the 50% Fib retracement level of the downward move from the $2,326 swing high to the $2,247 low. A close above the $2,285 resistance could send the price toward $2,350.\n\nSource: ETHUSD on TradingView.com\n\nA clear move above the $2,350 zone could start a major increase. The next resistance sits at $2,420. Any more gains could start a wave toward the $2,500 level, above which Ethereum might rally and test the $2,550 zone.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $2,285 resistance, it could continue to move down. Initial support on the downside is near the $2,220 level.\n\nThe first key support could be the $2,200 zone. A downside break and a close below $2,200 might send the price further lower. In the stated case, Ether could revisit the $2,170 support. Any more losses might send the price toward the $2,120 level in the coming sessions.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $2,200\n\nMajor Resistance Level – $2,285\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jY24uY29tL2VkdWNhdGlvbi9kZWNvZGluZy1ldGhlcmV1bXMtcG90ZW50aWFsLWluLTIwMjQtbmF2aWdhdGluZy1mYWN0b3JzLXNoYXBpbmctcHJpY2UtZHluYW1pY3MtYW5kLW1hcmtldC1zZW50aW1lbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Decoding Ethereum's Potential In 2024: Navigating Factors Shaping Price Dynamics And Market Sentiment - CCN.com",
        "content": "focus-text-wrap]Key Takeaways[/focus-text-wrap]\n\nBlackRock’s Ethereum ETF filing could significantly boost Ethereum’s price in 2024, enhancing mainstream adoption.\n\nGlobal regulations will shape Ethereum’s 2024 price, impacting investor confidence in DeFi and NFTs.\n\nIncreased institutional investment and DeFi ecosystem growth in 2024 could drive Ethereum’s demand and price.\n\nMacroeconomic factors, including inflation and market health, will indirectly influence Ethereum’s price in 2024.\n\nIn 2024, the price of Ethereum is likely to be influenced by a number of key factors, including\n\nExchange Traded Fund (ETF)\n\nAs reports surfaced that BlackRock, the world’s largest asset manager, submitted an application to the U.S. Securities and Exchange Commission (SEC) for the iShares Ethereum Trust, a spot Ether exchange-traded fund (ETF), Ethereum’s price experienced a notable increase and is likely to edge the ETH price higher in 2024.\n\nRegulatory Changes\n\nGlobal cryptocurrency regulations will be crucial, especially given Ethereum’s prominence in the DeFi and NFT sectors. Clear, supportive regulations can boost investor confidence, while restrictive policies might dampen it.\n\nInstitutional Adoption And DeFi Growth\n\nIncreased institutional investment in Ethereum and the expansion of its DeFi ecosystem can drive demand. Ethereum’s ability to attract and sustain big players will be essential.\n\nMacroeconomic Environment\n\nThe broader economic climate, including inflation rates and overall market health, can indirectly sway Ethereum’s price as investors seek digital assets as potential hedges or speculative opportunities.\n\nMarket Trends and Competition\n\nThe overall sentiment in the crypto market and the rise of competing blockchains can impact Ethereum’s dominance and price. Technological advancements within and outside the Ethereum ecosystem will also play a part.\n\nEthereum Vs. Bitcoin Outlook For 2024\n\nUnderstanding The ETH/BTC Ratio: Key Indicator For Altcoin Market Sentiment And Investor Behavior\n\nFor investors and analysts, monitoring the ETH/BTC ratio offers valuable insights into the broader altcoin market. A strengthening ETH against BTC can be interpreted as a sign of bullish sentiment toward altcoins, while a weakening ETH/BTC ratio may suggest a more cautious or bearish outlook.\n\nThis correlation is beneficial for understanding market cycles and investor behavior in the cryptocurrency domain.\n\nImpact Of Proof-of-Stake On The ETH/BTC Price Dynamic Since November 2021\n\nEthereum continues to be a significant player in the cryptocurrency landscape, second only to Bitcoin. In September 2022, Ethereum shifted from the energy-intensive proof-of-work model to a more scalable proof-of-stake framework.\n\nSince November 2021, the ETH/BTC chart has shown a consistent devaluation against Bitcoin. A downward trend indicates that, during this period, holding BTC would have been a more strategic choice in the long term than holding ETH or most altcoins, except for a few outliers that outperformed Bitcoin.\n\nCurrent Market Position And Future Outlook After BlackRock ETF Filing\n\nToward the end of 2023, the ETH/BTC pair is at an exciting juncture. Without a decisive upward movement, there’s a risk of further downside if the critical support level of 0.053-0.049 is not held. However, a crucial development in the market could influence this trajectory.\n\nThe recent move by BlackRock to file for an Ethereum ETF is a significant step that could bolster investor confidence in Ethereum. While the current downtrend might persist in the short term, this development is a potential catalyst for reversing the upside in 2024.\n\nThe ETH/BTC pair may experience a short-term downtrend considering these factors. However, the BlackRock ETF filing could be a pivotal factor for a bullish reversal in the coming year, potentially altering the current market dynamics.\n\nConclusion\n\nThe price of Ethereum and its movement versus Bitcoin in 2024 will likely be shaped by a confluence of factors, including the potential launch of an Ethereum ETF by BlackRock, global regulatory changes, institutional adoption, DeFi growth, and the macroeconomic environment.\n\nThe ETH/BTC ratio remains a critical indicator of market sentiment, with Ethereum’s shift to a proof-of-stake model adding another layer to its price dynamics.\n\nWhile current trends suggest a cautious approach, the anticipated Ethereum ETF and other developments could catalyze a positive shift in Ethereum’s market position. As such, investors and market watchers should closely monitor these evolving factors to navigate the crypto landscape effectively in 2024.\n\nFAQs\n\nHow will an Ethereum ETF affect its price in 2024?\n\nThe potential launch of an Ethereum ETF, like the one proposed by BlackRock, could significantly boost Ethereum’s price in 2024 by increasing mainstream adoption and investor confidence.\n\nWhat role will regulatory changes play in Ethereum’s price in 2024?\n\nEthereum’s price in 2024 will be heavily influenced by global cryptocurrency regulations, especially due to its role in DeFi and NFTs. Supportive policies could enhance investor confidence, while restrictive ones might have a dampening effect.\n\nHow might institutional adoption and DeFi growth impact Ethereum in 2024?\n\nEthereum’s price in 2024 could rise with increased institutional investment and growth in its DeFi ecosystem, as these factors drive demand and showcase Ethereum’s utility and adoption in larger financial contexts.\n\nWhat impact will the macroeconomic environment have on Ethereum’s price in 2024?\n\nThe broader economic climate, including inflation rates and market health, will indirectly affect Ethereum’s price. Investors might turn to Ethereum as a hedge or speculative asset, influencing its market value."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNS90b3AtYW5hbHlzdC11bnZlaWxzLWV0aGVyZXVtLWNhdGFseXN0LXRoYXQtY291bGQtdHJpZ2dlci1uZWFybHktNTAtc3VyZ2UtZm9yLWV0aC1oZXJlcy1oaXMtb3V0bG9vay_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTIvMjUvdG9wLWFuYWx5c3QtdW52ZWlscy1ldGhlcmV1bS1jYXRhbHlzdC10aGF0LWNvdWxkLXRyaWdnZXItbmVhcmx5LTUwLXN1cmdlLWZvci1ldGgtaGVyZXMtaGlzLW91dGxvb2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Top Analyst Unveils Ethereum Catalyst That Could Trigger Nearly 50% Surge for ETH – Here’s His Outlook - The Daily Hodl",
        "content": "An analyst who nailed the end of the 2021 Bitcoin bull market believes that Ethereum (ETH) will rally behind a catalyst that’s been overshadowed by the potential approval of a spot market BTC exchange-traded fund (ETF).\n\nPseudonymous analyst Pentoshi tells his 727,600 followers on the social media platform X that the possible approval of spot Ethereum ETFs next year will likely give ETH a much-needed shot in the arm.\n\nEarlier this year, multiple asset management firms including BlackRock, Fidelity and Hashdex filed applications for spot-based Ethereum ETFs with the U.S. Securities and Exchange Commission (SEC).\n\nPentoshi says that Ethereum will likely generate bullish momentum as market participants anticipate the event.\n\n“We’ve been bull tweeting the BTC ETF since $25,000-$28,000. Soon, we get to do this all again with the ETH ETF in 2024.\n\nNo matter what you believe, it’s all game theory. As the date approaches, people will be less willing to sell, and others will feel the need to buy. $2,7xx and $3,400 on the table.”\n\nPentoshi is not the only crypto strategist who believes 2024 will be a good year for ETH. Trader Michaël van de Poppe tells his 678,200 followers on the social media platform X that Ethereum is likely in the process of carving a bottom against Bitcoin (ETH/BTC). He shares a chart that shows ETH massively outperforming BTC in the first few months of 2024.\n\n“Ethereum isn’t dead. There’s a temporary snapshot of hype taking place that other ecosystems are better.\n\nThey aren’t.\n\nThe best quarter for ETH is the first quarter of the year and that’s approaching.\n\nThree to eight months prior to Bitcoin halving -> bottoming period.”\n\nBased on the trader’s chart, he seems to predict that the ETH/BTC pair will rally toward his target of 0.12 BTC worth $5,243 by April next year. At time of writing, ETH/BTC is trading for 0.05257 BTC ($2,297).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Terablete"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLWRlbmN1bi11cGdyYWRlLXRvLWJlLXRlc3RlZC1pbi1lYXJseS0yMDI0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 06:49:42 GMT",
        "title": "Ethereum Dencun Upgrade to be Tested in Early 2024 - Bitcoinsensus",
        "content": "Ethereum’s Dencun Update: A Move Towards Enhanced Scalability and Efficiency\n\nEthereum’s Dencun upgrade begins its testing phase on January 17, 2024, with trials on the Goerli, Sepolia, and Holesky networks, introducing significant improvements in scalability and operational efficiency.\n\nThe Dencun upgrade introduces “proto-danksharding,” a critical development designed to significantly increase Ethereum’s data storage capabilities and reduce gas fees.\n\nThe anticipation of the Dencun upgrade has positively influenced Ethereum’s market performance, with ETH showing a robust increase in value and a surge in network activities, including NFT trades.\n\nThe Ethereum blockchain is onto an important upgrade with the Dencun update, marking a significant progression since the Shapella hard fork. This upcoming enhancement is integral to boosting Ethereum’s scalability and operational efficiency, particularly in terms of data storage capacity.\n\nA vital feature of the Dencun upgrade is the incorporation of “proto-danksharding.” This process is expected to considerably expand the network’s bandwidth and optimize overall performance, a critical step in Ethereum’s ongoing evolution.\n\nUnleash the potential of leverage trading! Join Bybit today with our link, complete KYC, and earn up to a $40 bonus on a $100 deposit. Don’t miss out on this exclusive offer; claim your bonus now!\n\nKey Developments and Testing Timeline\n\nAs the Ethereum community prepares for this major update, the developers have outlined a rigorous testing schedule. The first phase of the Dencun upgrade’s testnet is set for January 17, 2024, on the Goerli network. This phase will be followed by tests on the Sepolia and Holesky networks, scheduled for January 31 and February 7, 2024, respectively.\n\nThese dates, however, are provisional and may change if any significant issues arise during the testing process. Tim Beiko, a key figure at the Ethereum Foundation, has indicated that a comprehensive blog post will be shared in early January 2024 to offer stakeholders detailed insights into the upgrade and its implications.\n\nThe technical facets of the Dencun upgrade are both intricate and groundbreaking. At its core, the upgrade introduces “proto-danksharding,” a mechanism that significantly enhances Ethereum’s data storage capabilities. This is achieved through the use of “blobs,” a novel transaction type that provides additional space for data.\n\nThese blobs are strategically designed to reduce Ethereum gas fees by relocating rollup data from the more costly Ethereum Virtual Machine (EVM) layer to the consensus layer. The introduction of proto-danksharding, with its limitation of 16 blobs per block and a cap of 128 KB per blob, results in an additional 2 MB of space per processed block, thereby markedly increasing the network’s data storage capacity.\n\nUnleash the potential of leverage trading! Join Bybit today with our link, complete KYC, and earn up to a $40 bonus on a $100 deposit. Don’t miss out on this exclusive offer; claim your bonus now!\n\nImpact on Ethereum’s Market Performance\n\nThe upgrade has profound implications for Ethereum’s market performance. Recent market data shows Ethereum’s native token, ETH, performing robustly, trading at $2,315.75 with a 4.15% increase over the past 24 hours. This positive trend reflects the sustained interest and optimism surrounding the Ethereum network.\n\nThe robust activity of the network is further evidenced by its consistent gas usage and a notable uptick in Non-Fungible Token (NFT) trades, indicating a thriving and dynamic ecosystem. These trends collectively point to a healthy and burgeoning network ecosystem, likely to receive an additional boost from the forthcoming upgrades.\n\nThe Ethereum Dencun upgrade represents a critical point in the blockchain’s development, addressing key challenges of scalability and efficiency. The successful implementation of proto-danksharding could be a landmark achievement in Ethereum’s journey towards a more scalable and efficient blockchain ecosystem, setting the stage for wider adoption and greater utility.\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NvbGFuYS1lY2xpcHNlcy1iaXRjb2luLWFuZC1ldGhlcmV1bS1pbi13ZWVrZW5kLXRyYWRpbmctdm9sdW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Solana surpasses Bitcoin and Ethereum in weekend trading volume - CryptoSlate",
        "content": "Crypto traders’ interest in Solana remains very high as the trading volume for the digital asset surpassed that of Bitcoin and Ethereum on major centralized exchanges during the weekend.\n\nConor Grogan, a director at Coinbase, first pointed out this milestone on Dec. 24, saying SOL saw more trading than the combination of the top two largest cryptocurrencies by market capitalization.\n\nRiyad Carey, an analyst with Paris-based crypto intelligence platform Kaiko, further corroborated this finding, saying the same trend was observed on Kraken and Gemini, two of the largest U.S.-based crypto trading platforms.\n\nSOL’s trading volume also beat BTC and ETH on UPbit and MEXC for the past 2 and 3 days, respectively.\n\nCarey further shared a chart showing that SOL’s trading activities, compared to ETH and BTC, were experiencing an uptrend. According to the chart, SOL trading is approaching 40% of trading activities on centralized crypto platforms, while ETH and BTC were declining.\n\nAccording to Carey, these metrics are “unprecedented” and show the sustained interest SOL is currently generating in the market.\n\nWhy SOL volume is rising\n\nOver the past year, Solana has experienced remarkable growth, defying earlier associations with Sam Bankman-Fried, the disgraced founder of the bankrupt FTX cryptocurrency exchange. Despite this, the network has flourished, attracting an expanding user base.\n\nDuring this period, Solana forged strategic alliances with renowned global financial players like Visa and Shopify. These partnerships harness blockchain technology to streamline payment procedures, showcasing SOL’s network’s potential to a broader global audience.\n\nMoreover, the recent surge in interest surrounding the Solana-based BONK memecoin and the resurgence of decentralized finance (DeFi) activities on the smart contract-enabled blockchain have contributed significantly to its recent upward trajectory.\n\nThese developments have helped push the price of SOL to new highs, up more than 800% on the year-to-date metric to nearly $120 as of press time, according to CryptoSlate’s data."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vdS50b2RheS9zb2xhbmEtZWRnZXMtb3V0LWV0aGVyZXVtLWluLWtleS10cmFkaW5nLW1ldHJpY9IBQ2h0dHBzOi8vdS50b2RheS9zb2xhbmEtZWRnZXMtb3V0LWV0aGVyZXVtLWluLWtleS10cmFkaW5nLW1ldHJpYz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Solana Edges Out Ethereum in Key Trading Metric - U.Today",
        "content": "Solana (SOL) has overtaken Ethereum (ETH) in the 24-hour perpetual futures trading volume, a key performance indicator in the cryptocurrency market.\n\nAdvertisement\n\nAccording to data from CoinMarketCap, Solana's trading volume reached a staggering 5.56 billion USDT, surpassing Ethereum's 4.68 billion USDT.\n\nThis shift in market dynamics comes as Solana experienced a 7.51% increase in its price over the past 24 hours.\n\nPerpetual futures are a type of derivatives contract that allows traders to speculate on the future price of a cryptocurrency without an expiry date. These instruments are integral to the liquidity and price discovery of the crypto market.\n\nSolana's lead in this metric is particularly noteworthy, given that Ethereum has long been a dominant player in the field.\n\nFiring on all cylinders\n\nEven when comparing spot trading volume, Solana maintains its lead with a volume percentage of 8.43% against Ethereum's 4.62%.\n\nFurthermore, Solana's market capitalization has soared above the $50 billion mark, establishing it as a significant contender in the cryptocurrency space.\n\nAdding to Solana's impressive performance, it has recently surpassed Ethereum in 24-hour DEX (Decentralized Exchange) trading volume.\n\nThis marks yet another milestone for Solana, challenging Ethereum's stronghold in the decentralized finance (DeFi) sector.\n\nAnalysts attribute this surge to the increasing total value locked on Solana's platform, which has reached over $1.4 billion for the first time since last year's market turbulence.\n\nThe platform's competitive transaction fees and high-speed operations, coupled with a burgeoning ecosystem of meme coins and community interest, have contributed to its rally."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTIvMjQvd2hlbi1jYW4taS11bnN0YWtlLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "When Can I Unstake Ethereum? Understanding Ethereum Unstaking – The Crypto Basic - The Crypto Basic",
        "content": "“When can I unstake Ethereum?”, that is the question… gaining traction among crypto enthusiasts.\n\nAs cryptocurrencies continue to evolve incessantly, understanding the nuances of staking and unstaking Ethereum becomes essential, which is why this article by The Crypto Basic, your number one source for crypto news, aims to shed light on this topic, offering clarity for those navigating the intricate universe of crypto coins and staking.\n\nWhat is Staking Ethereum?\n\nStaking Ethereum refers to the process where Ethereum holders lock up their ETH to support the network’s operation; this transitioned significantly with the Ethereum network’s shift from proof-of-work (PoW) to proof-of-stake (PoS) in September 2022, known as The Merge.\n\n- Advertisement -\n\nStaking involves committing your Ethereum to the network, where it helps to secure the system and, in return, earns staking rewards.\n\nThis change aimed to enhance the network’s energy efficiency and scalability.\n\nWhat Does it Mean to Unstake Ethereum?\n\nUnstaking Ethereum is the process of withdrawing your staked ETH along with any earned rewards; it’s the reversal of staking, where you reclaim your staked Ethereum.\n\nUnstaking became possible with the completion of the Shapella upgrades (Shanghai and Capella upgrades), which followed The Merge; these upgrades allow users to retrieve their initially staked principal and unlock their staking rewards.\n\n- Advertisement -\n\nWhen Should You Unstake Ethereum?\n\nThe decision to unstake Ethereum depends on several factors, including personal investment goals and market conditions; typically, you might consider unstaking:\n\n1. When You Need Liquidity\n\nIf you require access to your staked ETH for trading or other purposes.\n\n2. When Market Conditions Are Met\n\nBased on your analysis of the crypto market, you might choose to unstake to capitalize on favorable market trends.\n\n3. When You Require a Change in Your Investment Strategy\n\nShifting your investment focus away from staking to other forms of crypto investments.\n\nThe Process of Unstaking Ethereum\n\nUnstaking Ethereum is a process that requires careful consideration due to its irreversible nature; here’s what you need to know:\n\n1. Irreversible Requests\n\nOnce you submit an unstaking request, it cannot be canceled, i.e., your ETH in the unstaking process cannot be traded, transferred, or restaked.\n\n2. Rewards During Unstaking\n\nThere’s no guarantee that ETH will continue earning new rewards during the unstaking period.\n\n3. Timeline\n\nUnstaking typically takes around 10 days, depending on network conditions and the number of users unstaking simultaneously.\n\n4. Reward Unlocking\n\nPost-Shapella upgrade, existing ETH staking rewards automatically go through an unlocking process, making them available without requiring an unstaking request.\n\nTechnical Aspects of Unstaking Ethereum\n\nUnderstanding the technicalities behind unstaking is crucial, and here’s why:\n\n1. The Shapella Upgrades\n\nThe Shapella upgrades made unstaking feasible on the Ethereum network by introducing changes to both the Execution Layer (“Deneb”, where smart contracts and transactions occur) and the Consensus Layer (“Cancun”, where network security and validator operations take place).\n\n2. Types of Unstaking\n\nEthereum supports both full and partial unstaking: full unstaking involves exiting the active validator set and receiving the initial stake plus accrued rewards; partial unstaking happens automatically when a validator’s balance exceeds 32 ETH, where the excess amounts are sent to the validator’s address.\n\n3. Exit Process\n\nExiting the validator set is a prerequisite for full unstaking; the time it takes to exit depends on the number of validators in the queue.\n\nThe process includes a cooldown period post-exit before the ETH can be unstaked.\n\nPlatform-Specific Unstaking Procedures\n\nDifferent platforms have distinct procedures for unstaking Ethereum; for instance, on Kraken:\n\nNavigate to the ‘Earn’ section after signing in; Select Ethereum (ETH) from the list of assets and choose ‘Unstake’; Enter the amount to be unstaked and confirm the process; The unstaked amount will appear as ‘Pending’ in the Portfolio tab until the end of the lockup period.\n\nRisks and Considerations in Unstaking Ethereum\n\nUnstaking Ethereum is not without risks and considerations, including:\n\n1. Market Volatility\n\nThe value of Ethereum can fluctuate significantly during the unstaking period.\n\n2. Loss of Staking Rewards\n\nOnce you unstake, you forfeit potential future staking rewards.\n\n3. Network Congestion\n\nHigh demand for unstaking can lead to delays in processing requests.\n\nKeeping Up with Ethereum and Crypto Trends\n\nStaying updated with the latest trends and news in cryptocurrencies is vital for anyone engaged in staking or other crypto-related activities.\n\nFor the most recent updates and insights in the world of cryptocurrencies, The Crypto Basic is your go-to source."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tbG9uZy10ZXJtLWhvbGRlcnMtaGl0LXJlY29yZC1udW1iZXJzLXN1cnBhc3NpbmctYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Ethereum long-term holders hit record numbers in December - crypto.news",
        "content": "The amount of Ethereum (ETH) owned by long-term holders has reached a new milestone, hitting 70% since Dec. 1.\n\nAccording to blockchain analytics firm IntoTheBlock, this is noteworthy as it puts Ethereum ahead of Bitcoin (BTC) per the same metric, which hovered just shy of 70%.\n\nThe amount of $ETH owned by long-term hodlers reached a record of over 70% in December pic.twitter.com/znKGxTAkvU — IntoTheBlock (@intotheblock) December 24, 2023\n\nSome market watchers consider the rise in the proportion of ETH held by these holders as showcasing a conviction in the cryptocurrency’s long-term potential.\n\nThe record comes amidst predictions that the time for Ethereum to outshine Bitcoin is fast approaching. On Dec. 23, well-known crypto analyst Raoul Pal reiterated an earlier prediction suggesting 2024 could see ETH and BTC repeat their 2021 cycle.\n\nIn that year, ETH went on to outpace BTC’s performance, growing by 254% to Bitcoin’s 45% after initially falling behind.\n\nFor all the ETH bears… in Feb 2021, BTC first hit $44,000 (where it is today) and ETH was at $1400 (now $2250), 9 months later ETH was up 245%, BTC was up 45%…\n\n\n\nI think ETH outperforming BTC will be a key macro trend of 2024 and our work at EXPAAM suggests it. 1/ pic.twitter.com/QGSZahhldg — Raoul Pal (@RaoulGMI) December 21, 2023\n\nPal’s outlook was mirrored in a cautiously optimistic forecast from JPMorgan analysts, who, despite their overall conservative attitude towards the crypto market, predicted ETH will outpace BTC and other digital assets in market price performance by 2024.\n\nYou might also like: Arthur Hayes forecasts Ethereum to soar above $5k in 2024\n\nThis upbeat outlook on ETH, as conveyed by Nikolaos Panigirtzoglou and his team, is tied to the significant EIP-4844 upgrade, known as protodanksharding. Set for launch in the first half of 2024, this upgrade is expected to significantly enhance Ethereum’s network performance by implementing a more efficient sharding method.\n\nDespite the current price action still lagging behind Bitcoin’s level, more analysts also feel the recent impressive performance of altcoins and L2 projects hints at an impending ETH rally, with the cryptocurrency currently priced at $2,300—a 4.3% increase over the past seven days and an 88.6% increase over 12 months.\n\nYet, Ethereum co-founder Vitalik Buterin has recently raised eyebrows by transferring 500 ETH, valued at over $1 million, to Coinbase, as per onchain analysts.\n\nThis follows a series of significant transfers made by Buterin in September and his statement in October that he hasn’t “sold Ether for personal gain since 2018.”\n\nThe recent activity in Buterin’s Ethereum wallet, including a $3.79 million transfer in ETH over ten days in September, led to speculation of him selling his crypto holding, which he later clarified as being for philanthropy rather than personal gain.\n\nFollow Us on Google News"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mb3VyLXprLXByb29mLWwycy10aGF0LXNjYWxlZC1ldGhlcmV1bS1pbi0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "The year of ZK-proofs: 4 layer 2s that helped Ethereum scale in 2023 - Cointelegraph",
        "content": "Ethereum’s ongoing evolution has gathered pace in 2023, with the ecosystem shifting focus to scaling solutions and protocols to improve throughput and reduce costs for decentralized applications (DApps) and users.\n\nThe transition from energy-intensive proof-of-work mining to a proof-of-stake consensus also laid the foundation for what had previously seemed like impossible scalability upgrades before the Merge. Several approaches have emerged that enable the network to handle more transactions without increasing the size of nodes.\n\nLayer-2 solutions have become the favored mechanism for scaling Ethereum’s ecosystem. These networks, which operate independently from Ethereum’s chain, process and batch transactions as “rollups” before submitting the summary data to Ethereum. Rollups aim to increase Ethereum’s throughput and reduce the cost of transactions for users.\n\nRelated: Are ZK-proofs the answer to Bitcoin’s Ordinal and BRC-20 problem?\n\nEthereum has two types of rollups that currently help the network scale. The first is optimistic rollups, which execute transactions off-chain and post transaction data to the mainnet as call data.\n\nAs Ethereum’s information database explains, these rollups are dubbed “optimistic” because they assume off-chain transactions are valid and don’t publish proofs of validity for transaction batches posted on-chain.\n\nThis is a distinguishing factor from zero-knowledge rollups (ZK-rollups), which also bundle transactions off-chain but submit a validity proof of the changes required to represent all transactions in a batch.\n\nThe validity proof is a cryptographic assurance that the state changes proposed by the rollup come from having actually executed the transactions themselves. ZK-rollups only need to provide validity proofs to finalize transactions instead of posting all transaction data on-chain like optimistic rollups.\n\nRelated: Ethereum’s proto-danksharding to make rollups 10x cheaper — Consensys zkEVM Linea head\n\nThere is no delay when moving funds from a ZK-rollup to Ethereum’s mainnet because transactions are executed when the ZK-rollup contract verifies the validity proof. Withdrawals from optimistic rollups have a delay that allows users to carry out fraud proofs to double-check the validity of batched transactions.\n\nWhile opinions vary, ZK-powered layer 2s have become increasingly popular in 2023 because they bypass the need for fraud proofs. A handful of solutions powered by the technology have taken center stage, and Cointelegraph revisits the leading players that have emerged this year.\n\nPolygon zkEVM\n\nPolygon has become a household name in the Ethereum scaling ecosystem, and the protocol has made significant strides in developing its tech stack in 2023. This includes the evolution of its own Polygon zkEVM and its Chain Development Kit, which allows developers to launch bespoke ZK-powered layer-2 protocols on Ethereum tailored to the requirements of their project.\n\nPolygon released its open-source zkEVM mainnet beta in March 2023, which delivers reduced transaction costs and increased throughput of smart contract deployments. The technology allows thousands of transactions to be batched off-chain, with cryptographic proof containing a minimal data summary posted to the Ethereum mainnet.\n\nPolygon’s zkEVM mimics the transaction execution environment of Ethereum’s mainnet. The open-source zkEVM allows DApps to scale through transaction batching, unlocking higher performance.\n\nThe Polygon zkEVM explorer reflects the usage of the network from its inception in March 2013, with over 8.6 million transactions processed to date. Over the past six months, the network has processed an average of 20,000 to 40,000 daily Ethereum transactions.\n\nZkSync Era\n\nZkSync Era claims to be the first Ethereum Virtual Machine-compatible ZK-rollup to launch an alpha version of its network, which it did in February 2023 after a lengthy four years under development by Matter Labs.\n\nThe alpha release the following month grabbed headlines as major decentralized finance players — including Uniswap, Sushi, Maker and Curve — launched on the zkEVM.\n\nSource: DaapRadar\n\nThe network has attracted a significant user base since then, with data from DappRadar reflecting over 150 active DApps at the time of writing. The network also has 6.2 million unique active wallets and has processed more than 200 million transactions to date at seven transactions per second, according to information from L2scan.\n\nLinea\n\nConsensys, the development firm behind core Ethereum products like MetaMask, joined the ZK-rollup race with its zkEVM network, Linea.\n\nThe platform allows Ethereum developers to build or migrate DApps to its networks and went live with its alpha release in July 2023. Linea was integrated with Ethereum’s browser-based wallet MetaMask, giving Linea users access to its token bridge, swap and buy functionality.\n\nSource: L2scan\n\nLinea completed its public launch in August 2023 and bridged over $26 million in Ether (ETH) in its first month of existence. Linea currently has over 2 million unique active wallets and has processed 34 million transactions since its launch to mainnet. Data from L2scan also reflects that the network can process five transactions per second.\n\nStarknet\n\nStarknet joins this list of layer 2s that have scaled Ethereum, operating as a validity rollup or ZK-rollup. It is not classified as a zkEVM, as it operates on its native Cairo virtual machine and bespoke programming language.\n\nAccording to Starknet’s developer resource, the Cairo VM is intentionally tailored for validity proof systems and is touted to be optimized for memory access. Starknet notes that EVMs read and write memory requires more computation to generate proofs.\n\nSource: Starknet\n\nDespite operating on a different type of virtual machine, Starknet provides the same functionality as Polygon zkEVM, Linea and zkSync Era in that it bundles transactions into an off-chain computed STARK proof.\n\nAt the time of writing, Starknet’s ecosystem metrics reflect 48,104 ETH bridged into the network, valued at $108 million. The layer 2 has processed 19.4 million transactions\n\nWatch this space\n\nZK-rollups continue to attract significant value from the broader Ethereum ecosystem, given the throughput increase and reduced costs provided by the central players touched on above.\n\nThe latter half of 2023 also saw the likes of Scroll, another zkEVM, go live, showcasing the increasing number of ZK-powered layer 2s coming online.\n\nThere’s plenty of room for healthy competition, though. Several project leads have expressly told Cointelegraph that a variety of ZK-powered platforms serve to make the Ethereum ecosystem more robust.\n\nMagazine: Big Questions: What did Satoshi Nakamoto think about ZK-proofs?"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNS9hbmFseXN0LXNheXMtdGhpcy1pbmNyZWRpYmx5LXVuZGVydmFsdWVkLWV0aGVyZXVtLXJpdmFsLWlzLWEtY29udGVuZGVyLWZvci10b3AtMTAtbGFyZ2VzdC1jcnlwdG8tYXNzZXRzLWxpc3Qv0gGSAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzI1L2FuYWx5c3Qtc2F5cy10aGlzLWluY3JlZGlibHktdW5kZXJ2YWx1ZWQtZXRoZXJldW0tcml2YWwtaXMtYS1jb250ZW5kZXItZm9yLXRvcC0xMC1sYXJnZXN0LWNyeXB0by1hc3NldHMtbGlzdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Analyst Says This ‘Incredibly Undervalued’ Ethereum Rival Is a Contender for Top 10 Largest Crypto Assets List - The Daily Hodl",
        "content": "A closely followed crypto strategist thinks that one Ethereum (ETH) rival that’s flying under the radar will see a big spike in market capitalization.\n\nPseudonymous analyst The Crypto Dog tells his 750,500 followers on the social media platform X that the smart contract platform Near (NEAR) is currently trading below its fair value.\n\nAccording to the crypto trader, Near has the fundamentals to compete for a spot in the 10 largest digital assets by market cap list.\n\n“Was targeting ~$3 but starting to think NEAR won’t dip any further.\n\nStill incredibly undervalued, a contender for the top 10.\n\nStrong tech and well capitalized, it just needs a narrative and some retail FOMO (fear of missing out). A pump encourages both.”\n\nAt time of writing, NEAR is the 24th-largest crypto by market cap and is trading at $3.75.\n\nAs for his price target for the altcoin, The Crypto Dog thinks that it is within the realm of possibility for NEAR to rally by over 86% in the coming weeks.\n\n“No idea on the exact timeline but I do think $7 is a good relatively near-term target.”\n\nLooking at ETH rival Solana (SOL), the trader thinks that the crypto asset still has more gas left in the tank after taking out its diagonal resistance.\n\n“I think SOL has more to go. Breaking the diagonal should send us into the $120s.”\n\nAt time of writing, SOL is trading for $110.54, well above the trader’s diagonal resistance.\n\nShifting his attention to Bitcoin, the trader says that while the approval of a spot market BTC exchange-traded fund could trigger increased volatility, he believes any correction will be an opportunity for long-term investors to load up on the top crypto by market cap.\n\n“BTC ETF is not the end of the bull market, in case you needed to hear that… It will be volatile, and if there’s a big dip it will be a great opportunity.”\n\nAt time of writing, Bitcoin is worth $43,172.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Elena Abrazhevich/INelson"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1raWxsZXItc29sYW5hLXNvbC1yZWNvcmRzLXdob3BwaW5nLTMwMC1ncm93dGgtYWdhaW5zdC1ldGjSAVZodHRwczovL3UudG9kYXkvZXRoZXJldW0ta2lsbGVyLXNvbGFuYS1zb2wtcmVjb3Jkcy13aG9wcGluZy0zMDAtZ3Jvd3RoLWFnYWluc3QtZXRoP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "'Ethereum Killer' Solana (SOL) Records Whopping 300% Growth Against ETH - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a remarkable turn of events, the Solana token (SOL), initially hailed as the \"Ethereum killer\" over two years ago, has solidified its reputation by recording an extraordinary 300% surge against Ethereum (ETH) in the past couple of months.\n\nAdvertisement\n\nThe crypto market has witnessed a paradigm shift as SOL's value soared by an astonishing 440%, hitting a pinnacle of $118.3 — a milestone not seen since April 2022.\n\nDuring the same period, the SOL/ETH price graph exhibited an unparalleled ascent, reaching 0.051 ETH per Solana token. This surge has not been observed since December 2021, and the trend shows no sign of abating.\n\nNotably, as Solana experienced this meteoric rise, Ethereum remained relatively stagnant, prompting speculations that the era of Ethereum dominance may be waning.\n\nFlippening, but Solana flips Ethereum\n\nAnalysts have begun to question whether Solana is poised to dethrone Ethereum permanently. The media landscape is buzzing with discussions about a potential shift in the cryptocurrency hierarchy, with some suggesting that ETH may be consigned to the past while Solana charts the future.\n\nEven as Ethereum exhibited modest growth in response to the market dynamics, Solana's remarkable rally has left it 20% away from its all-time high relative to Ethereum's price.\n\nThe lingering question now is whether Solana can fulfill its moniker as the \"Ethereum killer\" and establish a new all-time high. ETH, on the other hand, faces the challenge of recovering from the recent weeks' lag.\n\nWith Solana's newfound prominence, market observers are contemplating whether the cryptocurrency landscape is witnessing a default shift toward the innovative blockchain platform."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNC92ZXRlcmFuLXRyYWRlci1wZXRlci1icmFuZHQtd2l0aGRyYXdzLWJlYXJpc2gtb3V0bG9vay1vbi1ldGhlcmV1bS1zYXlzLXNvbGFuYS1jYW4tY29udGludWUtdHJlbmRpbmctaGlnaGVyL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNC92ZXRlcmFuLXRyYWRlci1wZXRlci1icmFuZHQtd2l0aGRyYXdzLWJlYXJpc2gtb3V0bG9vay1vbi1ldGhlcmV1bS1zYXlzLXNvbGFuYS1jYW4tY29udGludWUtdHJlbmRpbmctaGlnaGVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Veteran Trader Peter Brandt Withdraws Bearish Outlook on Ethereum, Says Solana Can Continue Trending Higher - The Daily Hodl",
        "content": "Seasoned trader Peter Brandt says he’s no longer expecting the leading altcoin Ethereum (ETH) go on a big move to the downside.\n\nLast week, Brandt told his 707,300 followers on the social media platform X that he was shorting Ethereum, predicting that ETH could tumble to as low as $650.\n\nIn an update, the veteran trader says that circumstances have changed and he’s no longer bearish on the top altcoin as ETH has managed to move above the resistance of an ascending triangle pattern.\n\n“Strong opinions, weakly held. When circumstances change, my opinion changes.\n\nMy recent appraisal of ETH called for an immediate price collapse – that has not happened. I have withdrawn my bearish outlook based on chart structure.”\n\nAt time of writing, Ethereum is trading for $2,316, still above the pattern’s resistance.\n\nLooking at Ethereum rival Solana (SOL), the seasoned analyst says that while the altcoin has already met his upside target, it is still within the realm of possibility for the coin to continue going up.\n\n“The log scale target of $86.48 of Solana SOL/USD has been met. Of course, prices can trend well beyond target levels.”\n\nAt time of writing, Solana is trading for $111.55, up about 56% in the last seven days.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/sdecoret/monkographic"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdS50b2RheS9kb2dlY29pbi1mb3VuZGVyLXNwYXJrcy11bmJlbGlldmFibGUtZXRoZXJldW0tc29sYW5hLWZhY2Utb2Zm0gFRaHR0cHM6Ly91LnRvZGF5L2RvZ2Vjb2luLWZvdW5kZXItc3BhcmtzLXVuYmVsaWV2YWJsZS1ldGhlcmV1bS1zb2xhbmEtZmFjZS1vZmY_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Dogecoin Founder Sparks Unbelievable Ethereum-Solana Face-Off - U.Today",
        "content": "Dogecoin creator Billy Markus, widely known as Shibetoshi Nakamoto, has ignited a remarkable face-off between Ethereum and Solana in an unconventional manner.\n\nAdvertisement\n\nIn a recent post, Markus threw the contentious question to the crypto community: \"Which is better, Solana (SOL) or Ethereum (ETH)? My opinion on which one is better is whichever community tips me more!\" He attached the addresses of his wallets on both platforms and waited for the verdict.\n\nThe response was swift and astonishing. Within just five hours, Markus amassed over $10,000 in various cryptocurrencies, with his Ethereum wallet receiving $8,200, primarily in ETH, comprising 88% of the total.\n\nThe Solana wallet, while garnering fewer funds, secured nearly $2,000 in various assets. However, it was the eclectic mix of Solana tokens that caught Markus by surprise.\n\nthis is getting completely out of control 🤣 pic.twitter.com/zMslZsLb43 — Shibetoshi Nakamoto (@BillyM2k) December 24, 2023\n\nHe conveyed that the wallets were now accumulating a diverse array of items. Originally intended as a lighthearted post, Markus shared that the situation took an unexpected turn when individuals began sending a variety of unfamiliar items to the wallets.\n\nHe admitted to having limited knowledge about Solana, except for its frequent appearance in his recent online activity.\n\nSolana versus Ethereum\n\nThe unconventional face-off between Solana and Ethereum gained traction amid Solana's remarkable surge, securing its position as the fourth-largest cryptocurrency by market capitalization. SOL exhibited astonishing 300% growth against ETH, reaching levels unseen since December 2021.\n\nThis resurgence reignited the discourse over whether Solana could potentially \"kill ETH,\" prompting the DOGE founder to offer his unique resolution to the dispute."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNS9ldGhlcmV1bS1jb21wZXRpdG9yLXRoYXRzLWV4cGxvZGVkLTEwMDAtdGhpcy15ZWFyLWV5ZWluZy1uZXctYWxsLXRpbWUtaGlnaC1hY2NvcmRpbmctdG8tdmVudHVyZS1jYXBpdGFsaXN0L9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNS9ldGhlcmV1bS1jb21wZXRpdG9yLXRoYXRzLWV4cGxvZGVkLTEwMDAtdGhpcy15ZWFyLWV5ZWluZy1uZXctYWxsLXRpbWUtaGlnaC1hY2NvcmRpbmctdG8tdmVudHVyZS1jYXBpdGFsaXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Competitor That’s Exploded 1,000%+ This Year Eyeing New All-Time High, According to Venture Capitalist - The Daily Hodl",
        "content": "Venture capitalist Chris Burniske says that one red-hot Ethereum (ETH) rival that has surged over 1,000% this year is primed to hit new all-time highs (ATHs).\n\nIn a new thread, the co-founder of New York-based venture capitalist firm Placeholder Capital tells his 270,500 followers on the social media platform X that smart contract platform Solana (SOL) appears to be gaining ground against Ethereum (SOL/ETH).\n\nAccording to the crypto investor, he sees the SOL/ETH pair rising to its all-time high of 0.06 ETH worth $136.\n\n“SOL/ETH moving so fast I forgot to post about 0.04 [ETH]; now knocking on the door of 0.05 [ETH], with 0.06 [ETH] the ~ATH (thus far) to follow.”\n\nIn November, Burniske predicted that the SOL/ETH pair reaching 0.21 ETH worth $477 is in the realm of possibility. At the time, he said it was too early to definitively make such a call.\n\n“0.06 [ETH] is [a] prior wick…\n\n0.1 [ETH] to 0.2 [ETH] seems like a comfy range to watch ~0.21 SOL/ETH is the current parity – too early to call for that, but should be entertained as a possibility.”\n\nBut with SOL rallying in the past few months, Burniske now says that he stands by his prediction, indicating that a fresh all-time high is in the cards for Solana.\n\nSolana is trading for $110.40 at time of writing, a staggering rise of over 1,000% since the start of the year when it was moving for $9.99. Back then, SOL/ETH was priced at 0.00834 ETH worth $18.96.\n\nEven with Solana’s bullish price action as of late, it remains over 56% down from its all-time high of $259.96.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/TadashiArt"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNC90b3AtYW5hbHlzdC1mbGlwcy1idWxsaXNoLW9uLWV0aGVyZXVtLWxheWVyLTItYWx0Y29pbi1zYXlzLWNsZWFyLXNraWVzLWFoZWFkLWZvci1vbmUtZGVmaS1jcnlwdG8v0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzI0L3RvcC1hbmFseXN0LWZsaXBzLWJ1bGxpc2gtb24tZXRoZXJldW0tbGF5ZXItMi1hbHRjb2luLXNheXMtY2xlYXItc2tpZXMtYWhlYWQtZm9yLW9uZS1kZWZpLWNyeXB0by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Top Analyst Flips Bullish on Ethereum Layer-2 Altcoin, Says Clear Skies Ahead for One DeFi Crypto - The Daily Hodl",
        "content": "A crypto strategist who nailed the top of the Bitcoin (BTC) bull market in 2021 believes that one Ethereum (ETH) scaling solution that’s trading under the radar will see a burst to the upside.\n\nPseudonymous crypto strategist Pentoshi tells his 727,200 followers on the social media platform X that he’s bullish on Arbitrum (ARB).\n\nAccording to the analyst, ARB will likely receive a shot in the arm if it manages to take out its immediate resistance at $1.70.\n\n“I think it needs to get over $1.70 to really get anyone excited. Has a great shot at trading up there near term.”\n\nAt time of writing, ARB is trading for $1.38.\n\nThe analyst is also keeping an eye on Injective (INJ), a decentralized exchange that aims to offer a variety of financial products including spot trading and futures. According to Pentoshi, it’s clear skies for INJ as there is no resistance left to stop the altcoin from price discovery.\n\n“This is one of the craziest charts in the entire space, and currently in price discovery. So right now it’s clear skies. I don’t know if you get it, but I think under $30 is a buy if given the chance.”\n\nAt time of writing, INJ is trading for $42.14.\n\nThe analyst is also looking at Optimism (OP), another layer-2 altcoin. According to Pentoshi, OP also has no known resistance left after breaking its recent all-time high at around $3.29.\n\n“About to begin price discovery… Often around discovery is a great time to buy as it’s likely to have continuation after some consolidation.”\n\nAt time of writing, OP is worth $3.42.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNS9ldGhlcmV1bS1jb21wZXRpdG9yLXRoYXRzLWV4cGxvZGVkLW92ZXItNDYwLWluLXVuZGVyLXRocmVlLW1vbnRocy1oYXMtY29uZmlybWVkLWEtYnJlYWtvdXQtc2F5cy10cmFkZXIv0gGMAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzI1L2V0aGVyZXVtLWNvbXBldGl0b3ItdGhhdHMtZXhwbG9kZWQtb3Zlci00NjAtaW4tdW5kZXItdGhyZWUtbW9udGhzLWhhcy1jb25maXJtZWQtYS1icmVha291dC1zYXlzLXRyYWRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Competitor That’s Exploded Over 460% in Under Three Months Has Confirmed a Breakout, Says Trader - The Daily Hodl",
        "content": "A widely followed crypto analyst says that one red-hot Ethereum (ETH) rival that’s skyrocketed over 460% in 90 days has confirmed a breakout.\n\nPseudonymous analyst Rekt Capital tells his 378,700 followers on the social media platform X that layer-1 blockchain Avalanche (AVAX) has technically confirmed a breakout by successfully flipping its macro downtrend from resistance to support.\n\nHowever, after confirming its breakout, the trader doesn’t specify what price level AVAX will ultimately reach.\n\n“Avalanche has successfully retested its macro downtrend as new support. Up +36% since the retest, even more if you caught the downside wick into $32 (red). Technically, this retest has fully confirmed a breakout beyond the macro downtrend.”\n\nAvalanche hit a low of $8.65 on October 16th but is now trading for $47.79 at time of writing, a staggering gain of about 460% during the last three months and a fractional decrease during the last day.\n\nNext up, the strategist brings up the data monetization project Ocean Protocol (OCEAN), saying that the digital asset has also successfully tested a key area as support – setting the stage up for a rally to around the $0.64 level – which he says will serve as a point of resistance.\n\n“OCEAN. Successfully retested the red area as support and now rallying +20%. On its way to the black resistance ahead. Following the green path perfectly.”\n\nOCEAN is trading for $0.561 at time of writing, a 1.73% increase during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Dotted Yeti/Nikelser Kate"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2V0aGVyZXVtLWdlYXJzLXVwLWZvci1hLWJ1bGxpc2gtMjAyNC1hbmFseXN0cy1leWUtc3BvdC1ldGYtYXBwcm92YWwtZm9yLWEtNTAtc3VyZ2Uv0gFyaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvZXRoZXJldW0tZ2VhcnMtdXAtZm9yLWEtYnVsbGlzaC0yMDI0LWFuYWx5c3RzLWV5ZS1zcG90LWV0Zi1hcHByb3ZhbC1mb3ItYS01MC1zdXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Gears Up for a Bullish 2024: Analysts Eye Spot ETF Approval for a 50% Surge - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nAs 2024 approaches, Ethereum (ETH) is emerging as a focal point for crypto enthusiasts, driven by a catalyst that often takes a backseat to Bitcoin’s market narratives. Renowned pseudonymous analyst Pentoshi has shared insights that spotlight the potential approval of spot Ethereum ETFs in the coming year could surge its price by more than 50%.\n\nEthereum ETFs Gain Traction\n\nIn a recent tweet post Renowned analyst Pentoshi, shares a unique perspective on the forthcoming Ethereum ETF approval. Meanwhile, drawing parallels with the Bitcoin ETF saga, Pentoshi notes, “We’ve been bull tweeting the BTC ETF since $25,000-$28,000. Soon, we get to do this all again with the ETH ETF in 2024.\n\nWe've been bull tweeting the $BTC etf since 25-28k\n\n\n\nSoon, we get to do this all again with the $ETH ETF in 2024\n\n\n\nNo matter what you believe, it's all game theory. as the date approaches people will be less willing to sell, and others will feel the need to buy\n\n\n\n$2,7xx and 3.4k… https://t.co/a1yufMX6l7 pic.twitter.com/bbO3EQIkNx — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) December 23, 2023\n\nNo matter what you believe, it’s all game theory. As the date approaches, people will be less willing to sell, and others will feel the need to buy $2,700 and $3,400 are on the table, potentially driving Ethereum’s value to new heights.\n\nMajor players in the asset management arena, including BlackRock, Fidelity, and Hashdex, have recently submitted applications for spot-based Ethereum ETFs to the U.S. Securities and Exchange Commission (SEC). This wave of institutional interest is reshaping the narrative around Ethereum, as industry insiders anticipate a surge in bullish momentum\n\nETH/BTC Poised for Growth\n\nPentoshi’s optimism resonates with other crypto strategists, such as Michaël van de Poppe, who foresees a promising year for Ethereum. Highlighting Ethereum’s strength against Bitcoin (ETH/BTC), van de Poppe emphasizes, “Ethereum isn’t dead.\n\n#Ethereum isn't dead. There's a temporary snapshot of hype taking place that other ecosystems are better.\n\n\n\nThey aren't.\n\n\n\nThe best quarter for $ETH is the first quarter of the year and that's approaching.\n\n\n\n3-8 months prior to Bitcoin halving -> bottoming period. pic.twitter.com/QzppjFLql6 — Michaël van de Poppe (@CryptoMichNL) December 23, 2023\n\nThere’s a temporary snapshot of hype taking place that other ecosystems are better. They aren’t.” The consensus among analysts suggests that Ethereum is gearing up for a robust performance in the first quarter of 2024.\n\nAccording to Van de Poppe’s chart, the ETH/BTC pair is expected to rally toward its target of 0.12 BTC, equivalent to $5,243, by April next year. Currently, ETH/BTC is trading at 0.053 BTC ($2,297), indicating significant potential for growth in the coming months.\n\nHowever, the technical analysis underscores Ethereum’s potential to outpace Bitcoin, further contributing to the positive outlook for the cryptocurrency in 2024."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9mbGlwcGVuaW5nLWV0aGVyZXVtLWV0aC1zdXJwYXNzZXMtYml0Y29pbi1idGMtaW4tdGhpcy1rZXktbWV0cmljL9IBXmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9mbGlwcGVuaW5nLWV0aGVyZXVtLWV0aC1zdXJwYXNzZXMtYml0Y29pbi1idGMtaW4tdGhpcy1rZXktbWV0cmljLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Flippening: Ethereum (ETH) Surpasses Bitcoin (BTC) in This Key Metric - CryptoPotato",
        "content": "The amount of Ethereum owned by long-term hodlers reached a record of over 70% in December, according to data from blockchain analytics firm IntoTheBlock.\n\nThese committed holders have refrained from selling their Ethereum stash, contributing to the altcoin’s new benchmark. The latest ITB data also reveals that Ethereum has surpassed Bitcoin in terms of the percentage held by long-term holders, with the latter a little below the 70% mark.\n\nHODLers, individuals who hold onto their crypto regardless of market volatility or price fluctuations, play a crucial role in maintaining the overall health of any blockchain.\n\nThe rise in Ethereum ownership by HODLers indicates a strong belief in the asset’s long-term potential, with investors demonstrating patience and conviction despite market uncertainties.\n\nDespite Ethereum’s impressive 85% growth in market capitalization in 2023 and various positive developments such as upgrades, ETF applications, and “robust” adoption metrics, it has slightly underperformed compared to other major assets, as per a previous ITB analysis.\n\nHowever, experts are optimistic about the altcoin’s price trajectory in 2024.\n\nGlassnode co-founders Jan Happel and Yann Allemann, for one, have set a target for Ethereum, aiming for $2,500, citing “market enthusiasm.” They suggest that a more ambitious push could help Ethereum potentially climb to $2,700.\n\nThe success of Ethereum in 2024 may depend significantly on the level of acceptance it receives from traditional finance (TradFi), according to a recent report by Messari, which suggested that the asset’s environmentally friendly image makes it appealing to Wall Street.\n\nMessari CEO Ryan Selkis even predicted a swift adoption of an Ethereum ETF, mirroring the trend seen with Bitcoin."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpbWVkLWZvci1yYWxseS10by0zNDAwLWFuYWx5c3QtcHJlZGljdHMtYWhlYWQtb2YtZXRmLWFwcHJvdmFs0gFgaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1wcmltZWQtZm9yLXJhbGx5LXRvLTM0MDAtYW5hbHlzdC1wcmVkaWN0cy1haGVhZC1vZi1ldGYtYXBwcm92YWw_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Primed for Rally to $3,400, Analyst Predicts Ahead of ETF Approval - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe cryptocurrency market is abuzz with anticipation as famous crypto analyst Pentoshi predicts a potential rally for Ethereum (ETH) to reach $3,400. The catalyst behind this optimistic forecast is the expected approval of spot Ethereum Exchange-Traded Funds (ETFs) in the coming year.\n\nAdvertisement\n\nEarlier this year, major players in the asset management arena, including Ark Invest and 21Shares, submitted applications for spot-based Ethereum ETFs to the U.S. Securities and Exchange Commission (SEC). If approved, these ETFs could pave the way for increased institutional participation and capital inflow into the Ethereum market.\n\nETF approval boost\n\nIn a tweet, Pentoshi stated that they had been expressing bullish sentiment about the Bitcoin ETF when its price ranged between $25,000 and $28,000. He anticipated a similar situation with the Ethereum ETF in 2024. According to him, irrespective of one's beliefs, it all boils down to game theory.\n\nWe've been bull tweeting the $BTC etf since 25-28k\n\n\n\nSoon, we get to do this all again with the $ETH ETF in 2024\n\n\n\nNo matter what you believe, it's all game theory. as the date approaches people will be less willing to sell, and others will feel the need to buy\n\n\n\n$2,7xx and 3.4k… https://t.co/a1yufMX6l7 pic.twitter.com/bbO3EQIkNx — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) December 23, 2023\n\nAs the approval date approaches, the analyst speculates that holders may become less inclined to sell their Ethereum, while others may feel compelled to enter the market, creating upward pressure on the price. Pentoshi pointed out that figures of $2,7xx and $3,400 were potential scenarios for Ethereum’s price.\n\nAs of the latest market data, the current price of Ethereum stands at $2,281, representing a marginal decline of 0.37% over the past 24 hours. The market now awaits regulatory decisions regarding Ethereum ETFs, with potential approval seen as a crucial factor in determining the short-to-medium-term trajectory of ETH prices.\n\nWhile market analysts and enthusiasts closely monitor developments in the ETF approval process, the crypto community remains divided on the potential impact of such regulatory decisions. Some believe that ETF approval will act as a strong catalyst for Ethereum's price, opening new avenues for institutional investment. Others caution that market reactions may be unpredictable, emphasizing the need for careful analysis and risk management."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vdS50b2RheS9iaXRjb2luLWJ0Yy1ldGhlcmV1bS1ldGgtc29sYW5hLXNvbC1hbmQtY2FyZGFuby1hZGEtZnVuZHMtc2VlLWZyZXNoLWluZmxvd3PSAV9odHRwczovL3UudG9kYXkvYml0Y29pbi1idGMtZXRoZXJldW0tZXRoLXNvbGFuYS1zb2wtYW5kLWNhcmRhbm8tYWRhLWZ1bmRzLXNlZS1mcmVzaC1pbmZsb3dzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC), Ethereum (ETH), Solana (SOL) and Cardano (ADA) Funds See Fresh Inflows - U.Today",
        "content": "Advertisement\n\nAccording to the latest financial report by CoinShares, the cryptocurrency market has experienced a significant influx of funds across various digital assets.\n\nBitcoin (BTC) remains the top gainer, with a reported weekly flow of $87.6 million, contributing to a year-to-date (YTD) increase of $1.8 billion, per data available up to Dec. 23.\n\nEthereum (ETH), Solana (SOL) and Cardano (ADA) also reported positive inflows. This indicates a continued interest in a diversified range of cryptocurrencies beyond the leading digital currency.\n\nTop cryptocurrencies by inflow\n\nBitcoin, the pioneering cryptocurrency, leads the charge with impressive inflows that overshadow its counterparts.\n\nThe digital asset's performance is a significant contributor to the total weekly inflow of $102.7 million into cryptocurrency funds.\n\nEthereum trails with a weekly inflow of $7.9 million, while Solana and Cardano follow suit, registering inflows of $6.0 million and $1.0 million, respectively.\n\nAmong the providers, Grayscale Investments LLC maintained a steady position with no new inflows or outflows, while CoinShares XBT saw a decrease in weekly flows by $9.8 million.\n\nHowever, 21Shares AG and Purpose Investments Inc ETF showed robust growth, with 21Shares leading the monthly inflow with $34.4 million.\n\nLeading countries by inflows\n\nIn terms of geographical distribution, Canada emerged as the frontrunner with a weekly inflow of $25.8 million into crypto funds, contributing to a significant YTD growth of $494 million.\n\nGermany and the United States also showed strong performance with weekly inflows of $41.6 million and $20.4 million, respectively.\n\nNotably, Sweden experienced a downturn with a weekly outflow of $8.7 million. The flow of funds across these countries underscores the global nature of the cryptocurrency market and reflects varying investor sentiment in different regions."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ob2RsZXJzLXN1cnBhc3MtYml0Y29pbi13aGF0LW5vdy_SAURodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0taG9kbGVycy1zdXJwYXNzLWJpdGNvaW4td2hhdC1ub3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Ethereum HODLers surpass Bitcoin, what now? - AMBCrypto News",
        "content": "ETH HODLers were unconcerned about the altcoin’s price fluctuations.\n\nThe short and long-term technical outlook suggested a bullish move for ETH.\n\nLong-term Ethereum [ETH] holders have desisted from liquidating their holdings while helping the coin reach a new milestone, IntoTheBlock noted.\n\nAccording to IntoTheBlock, the amount of ETH owned by HODLers has now hit 70% since the 1st of December.\n\nThe data also means that the altcoin had passed Bitcoin’s [BTC] position per the same metric. For BTC, the amount of coins held by long-term holders was almost at 70%, but ETH still surpassed it, AMBCrypto found.\n\nIt is important to mention that the blockchain analytics firm came to this conclusion after examining the BTC/ETH ratio.\n\nThe amount of $ETH owned by long-term hodlers reached a record of over 70% in December pic.twitter.com/znKGxTAkvU — IntoTheBlock (@intotheblock) December 24, 2023\n\nHODLers are vital to the health of any blockchain. This is because they rarely sell their coins irrespective of volatility or price performance.\n\nSo, the increase in the ETH owned by HODLers implies that there is enough conviction that the cryptocurrency’s long-term potential was worth waiting for.\n\nHowever, it is not surprising that the record came in December. This is because there have been predictions that ETH’s time to outshine Bitcoin is near.\n\nThough the price action was not yet at Bitcoin’s level, the impressive run of altcoins including L2 projects suggests that an ETH rally could be close.\n\nAs of this writing, ETH’s price was $2,290— a 3.69% increase in the last seven days. Regarding the long-term price potential, AMBCrypto decided to check Ethereum’s Dormancy.\n\nDormancy is the ratio of coin days destroyed and total transfer volume. The metric gives an insight into the sentiment of long-term holders.\n\nUp until the 23rd of December, Ethereum’s Dormancy showed high values. This suggests an increase in transactions by older coins. However, at press time, the metric was down to 67.61. This implies that older coins have largely remained unspent.\n\nIf Dormancy remains lower, then ETH may have a good shot at a rally in the near term.\n\nPer the 4-hour ETH/USD chart, the Exponential Moving Average (EMA) showed that the coin might be bullish in the mid to long term. This was because the 50-day EMA (blue) had crossover the 200 EMA (yellow).\n\nThis position is usually in favor of a bullish trend.\n\nSo, investors planning to hold ETH for an extended period might have a chance at buying at a discount. Another indicator to consider is the Aroon indicator. Results from the Aroon provide an idea of what ETH might do in the short term.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAt the time of writing, the Aroon Up (orange) was 21.43% while the Aroon Down (blue) was at the zero midpoint.\n\nThus, short-term holders may not need to wait for the long-term ETH rally before making potential gains. However, traders may need to be cautious as it could take a little while before confirmation of the bullish thesis."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctaGFzLWV0aGVyZXVtLWNoYW5nZWQtc2luY2UtbWVyZ2UtYW5kLXNoYXBlbGxhL9IBTGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctaGFzLWV0aGVyZXVtLWNoYW5nZWQtc2luY2UtbWVyZ2UtYW5kLXNoYXBlbGxhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "How has Ethereum changed since Merge and Shapella? - AMBCrypto News",
        "content": "About 339,121 ETH coins have exited circulation since the Merge.\n\nThe number of active ETH validators jumped by 58% since the Shapella upgrade.\n\nEthereum [ETH] has witnessed two major events over the last 15 months — the Merge and the Shapella upgrade — that have fundamentally altered the way the network is run.\n\nHowever, the ETH fanbase would take a lot of heart from the fact that the impact of these events has been positive, even by conservative estimates.\n\nETH becomes deflationary\n\nAbout 339,121 ETH coins have exited circulation since the Merge, with the rate of deflation accelerating significantly in the last quarter of 2023, according to AMBCrypto’s scrutiny of ultrasound money data.\n\nAs of this writing, ETH’s total circulating supply was 120.18 million, the lowest since the network transitioned from the proof-of-work (PoW) consensus mechanism to proof-of-stake (PoS).\n\nAs analyzed from the graph above, the net supply shrunk at an annual rate of 0.220%. Had the transition not taken place, ETH’s total supply would have increased by more than 4.8 million, with an annual inflation rate of 3.168%.\n\nTypically, a bullish market with high network usage aids deflation and vice versa. This is because a part of the fee charged for validating transactions, called the base fee, is burned and removed from circulation.\n\nHence, the higher the network activity, the more the deflationary pressure on ETH.\n\nStaking gets a boost\n\nThe Shapella upgrade launched earlier in the year, which enabled staking withdrawals, also gave a fillip to ETH staking activity.\n\nAs per a report by staking service provider P2P.org, the number of active ETH validators jumped by 58%, equating to $23 billion of new ETH stake.\n\nHowever, the sharp increase has started to pose new problems for the network.\n\nIs there an overdose?\n\nThe staking rewards curve is designed to decrease the yield paid to validators in proportion to increases in the validator count. This is to restrict excess capital inflow and maintain a liquid supply of ETH for use in transactions.\n\nHowever, emerging DeFi avenues like liquid staking and restaking have increased the potential yield which can be earned by staking ETH. These have boosted capital inflows and the validator count on the network.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nThe growing validator set will degrade network performance at some point and may also make future essential updates more challenging to implement, P2P.org noted in the report.\n\nAs of this writing, ETH was holding strong at $2,285, with weekly gains of 5.14%, AMBCrypto spotted using CoinMarketCap’s data."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMi8zNjM3ODczMy9pZi15b3UtZ2lmdGVkLXlvdXItZmFtaWx5LTEwMC1pbi1iaXRjb2luLWRvZ2Vjb2luLWFuZC1ldGhlcmV1bS1sYXN0LWNocmlzdG1hcy1oZXJlcy1ob3ctbXXSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzYzNzg3MzM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "If You Gifted Your Family $100 In Bitcoin, Dogecoin And Ethereum Last Christmas, Here's How Much They Wou - Benzinga",
        "content": "One of the annual traditions of Christmas for most families is the giving and receiving of gifts. While popular gift items include toys, clothes, gift cards, and money, another option is to give a gift of cryptocurrency.\n\nHere's a look back at how much a gift of cryptocurrency for Christmas in 2022 would be worth today.\n\nWhat Happened: Just like Mother's Day, Christmas is a holiday that could see the selection of gifts for loved ones in your family.\n\nGiving cryptocurrency as a gift at Christmas 2022 may not have been a popular choice for gift-givers or for those receiving gifts as the year was full of negative headlines.\n\nThe year 2022 saw several cryptocurrency platforms go bankrupt and all the major cryptocurrencies traded down during the year.\n\nIn 2023, cryptocurrencies have turned around with many of the largest cryptos outperforming the top stocks and overall broad stock market.\n\nHere's a look back at how much three major cryptocurrencies given as gifts for Christmas 2022 would be worth today.\n\nRelated Link: Tim Draper Says Yes to Bitcoin For The Holidays, Anticipates $250,000 BTC In 2024\n\nInvesting $100 in Bitcoin, Dogecoin, Ethereum: A popular gift amount may have been giving $100 in cryptocurrency to a loved one on Christmas Day 2022. Here's a look at how much one could have bought of Bitcoin BTC/USD, Dogecoin DOGE/USD and Ethereum ETH/USD based on the intraday high on Dec. 25, 2022.\n\n$Bitcoin: 0.0059 BTC\n\nDogecoin: 1,287.93 DOGE\n\nEthereum: 0.0817 ETH\n\nInvesting $100 in each cryptocurrency last Christmas would be worth the following based on prices at the time of writing:\n\nBitcoin: $254.84, +154.8%\n\nDogecoin: $119.00, +19.0%\n\nEthereum: $185.77, +85.8%\n\nA $300 gift consisting of the three top cryptocurrencies would be worth $559.61 today, an increase of 86.5%.\n\nFamily members would likely welcome the return of any of these three cryptocurrencies over the last year.\n\nCrypto Christmas 2023\n\nFor comparison, a $100 investment in the SPDR S&P 500 ETF Trust SPY, which tracks the S&P 500 Index, would be worth $123.72 today. This represents a return of 23.7%.\n\nThe holidays would likely be happier for loved ones who got cryptocurrency as a gift last year than many clothes, gift cards, cash, or stocks.\n\nRead Next: If You Invested $1,000 In Coca-Cola Stock When Company Redesigned Santa Claus, Here’s How Much You’d Have Today"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMTIvMjQvZXRoZXJldW0tbG9uZy10ZXJtLWhvbGRlci1jb252aWN0aW9uLWhpdHMtbmV3LWhpZ2hzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Long-Term Holder Conviction Hits New Highs - Crypto Times",
        "content": "The amount of Ethereum (ETH) owned by long-term holders has reached a new high, surpassing 70% since December 1st according to blockchain analytics firm IntoTheBlock.\n\nThis metric now exceeds Bitcoin’s (BTC), which has hovered just under 70%, showing conviction in Ethereum’s long-term potential.\n\nThe amount of $ETH owned by long-term hodlers reached a record of over 70% in December pic.twitter.com/znKGxTAkvU — IntoTheBlock (@intotheblock) December 24, 2023\n\nRecent predictions have suggested that 2024 could see ETH outperform BTC again, repeating the 2021 cycle where ETH grew 254% versus BTC’s 45% after initially lagging.\n\nFor all the ETH bears… in Feb 2021, BTC first hit $44,000 (where it is today) and ETH was at $1400 (now $2250), 9 months later ETH was up 245%, BTC was up 45%…\n\n\n\nI think ETH outperforming BTC will be a key macro trend of 2024 and our work at EXPAAM suggests it. 1/ pic.twitter.com/QGSZahhldg — Raoul Pal (@RaoulGMI) December 21, 2023\n\nThough still behind BTC’s price, analysts feel recent altcoin and L2 performance hints an ETH rally is coming, with ETH up 4.3% over 7 days and 88.6% over 12 months to $2,300.\n\nYet co-founder Vitalik Buterin recently raised eyebrows transferring 500 ETH worth over $1 million to Coinbase, following September transfers and an October statement he hasn’t “sold Ether for personal gain since 2018.”\n\nAdditionally, JPMorgan analysts predict ETH will outpace BTC and other assets by 2024, tied to the major EIP-4844 “protodanksharding” upgrade launching early 2024 to enhance network performance.\n\nThough cautiously optimistic on crypto overall, they feel this Ethereum upgrade will drive significant price gains."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmJsb2NremVpdC5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0tc2FudGEtY2xhdXMtcmFsbHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Are Bitcoin And Ethereum Heading For A Santa Claus Rally? - Blockzeit",
        "content": "It’s that time of the year again when everyone is in a festive mood. One of the anticipated events this week is the so-called “Santa Claus Rally.” So, will we see major gains in Bitcoin (BTC) and/or Ethereum (ETH) this season?\n\nSanta Claus Rally in a Nutshell\n\nPreviously, we discussed what the Santa Claus Rally is all about. In a nutshell, it’s a phenomenon in stock investments happening within “the final five trading days of the year and the first two trading days of the following year.” Since 1950 to 2023, the market has shown gains at an 80% probability.\n\nNow, there’s an ongoing narrative that cryptocurrencies may exhibit surges these holidays. With that, let’s take a look at the background and possibilities of a Christmas rally in Bitcoin and Ethereum on our way to 2024.\n\nBitcoin’s Santa Claus Rally\n\nBitcoin does not appear to play ball during the Santa Claus Rally. Since cryptocurrencies trade 24/7 compared to stocks which are only limited by the operating schedules of the stock market, Techopedia compiled the performance of BTC starting from December 25th to January 2nd.\n\nSource: Techopedia\n\nBased on the illustration above, BTC only indicated significant gains on a scale of four out of ten or 40% of the time. The most increase it got during these periods was in the days leading to 2021 when it soared 35.9%. The worst was in the run to the following year when it shed 6.9% of its value.\n\nEthereum’s Santa Claus Rally\n\nUsing the same formula, the source examined how Ethereum moved throughout the event from its launch in the Christmas of 2015 to the New Year of 2023.\n\nSource: Techopedia\n\nFrom the looks of it, ETH has outclassed BTC in most instances. In an eight-year frame, the crypto pumped five times, translating to a 62.5% chance of benefitting from the Christmas rally. Even if we narrow Bitcoin’s stats from 2015 to the last occurrence, it’s still three out of eight times on the charts or a mere 37.5%.\n\nThe best return for ETH during the rallies was 29.6% in 2017 while its worst was a dip of 5.4% in 2021. It should be noted, however, that Ethereum appeared to track the movements of Bitcoin from 2019 onwards.\n\nWill BTC and ETH Pump?\n\nAs displayed by the charts, Ethereum has better chances of outpacing Bitcoin during the Santa Claus Rally. But then again, if the two key narratives of BTC are placed in the equation being the anticipated mass approval of its spot exchange traded funds (ETFs) and halving all happening in the coming year, the premier crypto in terms of market cap could blow the roof.\n\nIf not during the Xmas season, the massive gains of Bitcoin might happen on the way to January 10 when the US Securities and Exchange Commission is expected to give all the applications a go. Meanwhile, Ether will most likely follow its crypto comrade in the coming bull run."
    }
]