[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWNyeXB0by1zdG9ja3Mtd2F0Y2gtMjAyMy0xMTUwMDAxNzcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "3 Crypto Stocks to Watch in the 2023 Ethereum Rally - Yahoo Finance",
        "content": "While Bitcoin (BTC) had a great first half of 2023, so did another crypto coin Ethereum (ETH). Ethereum, which trails only Bitcoin in the crypto world, is known for its uses as a blockchain-powered, open-ended decentralized software platform.\n\nSince the “crypto winter” of 2022, the network completed a significant update, known as the Shanghai Upgrade, under which it shifted its blockchain validation system from proof-of-work to proof-of-stake, and marked one of the most significant developments in the relatively small history of cryptocurrency.\n\nUnder the proof-of-stake system, miners of Ethereum will rely on Ether holders who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption.\n\nPowered by this development and what has largely been hailed as a crypto rebound, the price of Ethereum has soared in 2023, going up 54.9% year to date, as of Jul 25. In this endeavor, it lags behind Bitcoin, which has gone up 76.4% in the same period. But one must remember that while Bitcoin is primarily a digital currency, Ethereum is a programmable blockchain platform. Ethereum’s blockchain has a reputation for being highly versatile and adept in building complex applications.\n\nHistorically, a state of fast-rising interest rates has not proven conducive to the crypto market. However, a recent spate of data, which showed cooling inflation and market speculation that the Fed might be ending its hawkish monetary policy stance soon, means that things are looking up again for the sector.\n\nSo, with a “crypto spring” in the offing and Ethereum already starting to make good of the state of the market, it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform.\n\nAccenture plc ACN: This global system integrator, which provides consulting, technology and other services, markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nStory continues\n\nAccenture’s expected earnings growth rate for the current year is 8.2%. The Zacks Consensus Estimate for its current-year earnings has improved by 0.1% over the past 60 days. Accenture currently carries a Zacks Rank #3 (Hold).\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts. It provides various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 11.5%. The Zacks Consensus Estimate for its current-year earnings has improved 1.6% over the past 60 days. CME Group currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nHIVE Digital Technologies Ltd. HIVE: This cryptocurrency mining company operates in Canada, Sweden and Iceland. It engages in the mining and sale of digital currencies, including Ethereum Classic.\n\nHIVE’s expected earnings growth rate for the current year is 78.1%. The Zacks Consensus Estimate for its current-year earnings has improved 55.3% over the past 60 days. HIVE currently carries a Zacks Rank #1.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nHIVE Digital Technologies Ltd. (HIVE) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTI1L2V0aGVyZXVtLXNvZnR3YXJlLWluZnJhc3RydWN0dXJlLXByb3ZpZGVyLWZsYXNoYm90cy1yYWlzZXMtNjAtbWlsbGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Software Infrastructure Provider Flashbots Raises $60 Million - Bloomberg",
        "content": "Flashbots, a provider of software used to package Ethereum blockchain transactions, raised $60 million to help finance the development of a new version of the technology.\n\nThe San Francisco-based firm Paradigm led the series B round, a shift from the recent trend among Silicon Valley venture capitalists pivoting to artificial intelligence companies from crypto. The financing was raised through a so-called “beauty contest for decentralization” in which investors were selected based on their reverse pitches, according to a statement Tuesday from Cayman Islands-based Flashbots. The funding gives it a valuation of of at least $1 billion, a representative of Flashbots said."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLW9wdGltaXN0aWMtcm9sbHVwc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Staying optimistic about Ethereum's optimistic rollups - Blockworks",
        "content": "Ethereum’s layer-2 ecosystems are growing.\n\nTo date, nearly 30 different layer-2, or L2, networks have deployed on Ethereum. Recent entrants include Mantle Network and Consensys’ Linea. Projects like Scroll, Taiko and Honeypot are geared up to enter the game.\n\nThese second-layer protocols are intended to help scale the network by shifting some of the computational processes off Ethereum itself. For users, this means cheaper and faster transactions compared to how they might proceed on the mainnet.\n\nL2 networks have, over time, become economies of their own, collecting billions of dollars worth of digital assets in locked-up deposits along the way.\n\nToday’s crop of L2 networks chiefly break down into two categories: optimistic rollups and zero-knowledge (ZK) rollups.\n\nOptimistic rollups move user transactions off-chain and then post the data back to Ethereum as “calldata.” Zero-knowledge rollups, on the other hand, also post their transactions off-chain, but they can validate that it is accurate without revealing the information inside.\n\nOf those building optimistic rollups, prominent players in the game are Arbitrum, Optimism, Base and Mantle. The first two, Arbitrum and Optimism, have amassed nearly $9 billion in total value locked (TVL) between the two protocols.\n\nToday’s zkSync-centric rollups include Polygon zkEVM, Starknet, Scroll and Linea.\n\nSo optimistic\n\nToday, optimistic rollups are the dominant protocols in the L2 space, according to data from L2BEAT, an information portal for the ecosystem.\n\nArbitrum currently possesses the highest market share, with a TVL of $5.82 billion.\n\nArbitrum developer Offchain Labs is still exploring ways for the protocol to become a stage-3 optimistic rollup, according to co-founder and Chief Technology Officer Harry Kalodner. Under that framework, the rollup would be completely run via smart contracts.\n\n“I firmly believe that ZK rollups are much more complicated than optimistic rollups, and the amount of people who actually understand the tech is very tiny,” Kalodner said.\n\nIn conversation, Kalodner noted that L2 growth often involves a trade-off between permissionless and accessibility of the technology.\n\n“We want to see everybody who wants to have an Arbitrum chain, have an Arbitrum chain, and we’re balancing that with the competitive realities of the market and being the technical leader,” Kalodner said.\n\nOptimism is the second-biggest rollup, with a TVL of $2.42 billion. Unlike Arbitrum, Optimism’s source code is completely open-source, meaning that anyone can use the code to build their own L2.\n\nOf those, Base Protocol, Coinbase’s decentralized L2 network, has most prominently used the Optimism stack to help build out its so-called superchain vision.\n\nJesse Pollak, head of protocols at Coinbase, believes that on-chain computation will compete directly with the likes of Amazon Web Services and Google Cloud over the next decade. In his view, future apps will be able to run their own infrastructure at a much higher rate.\n\n“The mental model I have for this is you can think of Base and OP mainnet as a shared compute model where you’re in the same compute environment, then certain apps will scale out of the compute environment…they’re going to be app chains or L3s,” he said.\n\nPollak notes that Base is focused on maximizing decentralization and security for as cheap as possible.\n\n“The strategy for us is to create an open source code base, that’s standardized, configurable, modular, creates decentralized governance and funding infrastructure that attracts developers and makes them feel like they’re part of something bigger than themselves,” Pollak said.\n\nPollak added: “This way we have a bottoms-up groundswell of technology that even if it looks a little bit chaotic in the beginning, and maybe a bit slower. In the long run, it ends up being way faster and way bigger.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLWp1bHktMjbSATtodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLXByaWNlLWFuYWx5c2lzLWZvci1qdWx5LTI2P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for July 26 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBuyers are trying to keep the rates of coins in the green zone, according to the CoinMarketCap ranking.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nThe price of Ethereum (ETH) has risen by 0.13% since yesterday.\n\nImage by TradingView\n\nOn the local chart, the rate of Ethereum (ETH) is testing the resistance level at $1,860.50. At the moment, traders should focus on the bar's closure. If it happens around that area, the breakout may lead to a blast to the $1,870 zone shortly.\n\nImage by TradingView\n\nOn the bigger time frame, the price of ETH remains bearish as the rate has not bounced off far from the support level. In addition, the buying volume is low, which means that bulls are not ready yet to buy the coin.\n\nIn this regard, sideways trading between $1,850 and $1,870 is the more likely scenario until the end of the week.\n\nImage by TradingView\n\nA positive picture can be seen on the daily chart against BTC as the rate is closer to the resistance than to the support. If the price reaches the 0.064 mark and fixes there, one can expect a quicker test of the upper level of 0.06435.\n\nEthereum is trading at $1,859 at press time."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLWNoZWNrLWFuLWV0aGVyZXVtLXRyYW5zYWN0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "How To Check An Ethereum Transaction? - Watcher Guru",
        "content": "How To Check An Ethereum Transaction: A Comprehensive Guide\n\n\n\nNavigating the world of blockchain can be challenging, especially when you’re trying to keep track of your transactions.\n\nIn this guide, we’ll explain how to check an Ethereum transaction by walking you through the process step-by-step.\n\nWe’ll also answer common questions like “How do I track an Ethereum address?”, “How do I check my crypto transaction?”, and “How long does an Ethereum transaction take?”.\n\nAlso read: Investor Poll Shows 47% Confidence in Ethereum’s Rise Above Bitcoin\n\nUnderstanding Ethereum Transactions\n\nBefore we delve into how to check an Ethereum transaction, it’s essential to grasp what Ethereum transactions are.\n\nEthereum is a decentralized platform that permits users to conduct transactions with digital assets.\n\nEach Ethereum transaction is recorded on the blockchain network, providing transparency and public accessibility. Validators or miners on the network verify these transactions, making Ethereum a truly decentralized system.\n\nYou initiate a transaction when you send Ether (ETH) from one address to another. This transaction is then broadcast to the Ethereum network, where it is checked and verified.\n\nOnce the transaction gets a confirmation, it is added to a new block and permanently recorded on the blockchain.\n\nHow Ethereum Transactions Work\n\nEthereum transactions function through a series of steps:\n\nAn external account initiates a transaction, such as sending ETH to another user. The transaction request is broadcast to the Ethereum network. Validators on the network execute the transaction and propagate the change to the entire network. A transaction fee is deducted during the validation process. The validated transaction is included in a block.\n\nThere are different types of transactions on the Ethereum network, including regular transactions (from one account to another), contract-execution transactions (interactions with deployed smart contracts), and contract-deployment transactions (deploying the code of a smart contract).\n\nAlso read: Ethereum: Users Holding 1000+ ETH, Drops to 5-Year Low\n\nTracking an Ethereum Transaction: A Step-by-Step Guide\n\nNow that we’ve covered the basics, let’s dive into the steps on how to check an Ethereum transaction:\n\nStep 1: Acquiring the Transaction Hash\n\nYour journey to tracking your Ethereum transaction starts with obtaining the transaction hash. This unique identifier is given to every transaction on the Ethereum network. You can find this hash in the history or activity section of the crypto wallet or exchange platform you used to conduct the transaction.\n\nStep 2: Using an Ethereum Blockchain Explorer\n\nWith your transaction hash at hand, the next step is to visit an Ethereum blockchain explorer. These are online tools that allow you to view information about transactions, blocks, and addresses on the Ethereum blockchain. Some popular Ethereum blockchain explorers include Etherscan and Etherchain.\n\nStep 3: Input the Transaction Hash\n\nOn the blockchain explorer website, you’ll find a search field. Paste the transaction hash you obtained in Step 1 into this field and initiate the search. The explorer will then retrieve and display the transaction details.\n\nStep 4: Review the Transaction Details\n\nOnce you input the transaction hash, the transaction details will display. This information includes the sender and recipient addresses, the transaction amount, the gas fee paid, and the transaction’s current status. You can use these details to verify if the transaction was successful.\n\nBesides blockchain explorers, several tools can help you monitor your Ethereum transactions. These tools provide real-time updates and additional features for your transactions. Some popular options include:\n\nMetamask: Metamask is a renowned Ethereum wallet and browser extension that lets you manage your Ether and interact with decentralized applications. It also provides a transaction history and notifications for your transactions.\n\nMetamask is a renowned Ethereum wallet and browser extension that lets you manage your Ether and interact with decentralized applications. It also provides a transaction history and notifications for your transactions. MyEtherWallet (MEW): MyEtherWallet is a web-based wallet with a user-friendly interface for managing Ethereum transactions. It provides transaction tracking features and the ability to customize gas fees for faster transactions.\n\nMyEtherWallet is a web-based wallet with a user-friendly interface for managing Ethereum transactions. It provides transaction tracking features and the ability to customize gas fees for faster transactions. Etherscan Mobile App: Etherscan has a mobile app available for both iOS and Android devices. This app allows you to check your Ethereum transactions on the go, receive push notifications for transaction updates, and explore the blockchain.\n\nSource: Forbes\n\nHow Long Does an Ethereum Transaction Take?\n\nThe duration of an Ethereum transaction confirmation can vary based on several factors, including network congestion, the gas price of ETH, and the transaction’s complexity. Typically, Ethereum transactions can take anywhere from a few seconds to several minutes. However, during periods of high network activity, your transaction might take longer to process.\n\nConclusion: How To Check An Ethereum Transaction?\n\nIn conclusion, checking an Ethereum transaction involves using a hash and a blockchain explorer to review the details of the transaction.\n\nBlockchain explorers like Etherscan offer transparency and enable users to track their transactions on the Ethereum blockchain.\n\nAlso, tools like Metamask, MyEtherWallet, and the Etherscan Mobile App provide convenient ways to manage and monitor your Ethereum transactions.\n\nBy understanding and utilizing these tools, you can ensure smooth and successful transactions on the Ethereum network."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDcvMjUvc29sYW5hLWJhc2VkLW5mdC1tYXJrZXRwbGFjZS1leGNoYW5nZWFydC10by1leHBhbmQtaW50by1ldGhlcmV1bS_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vd2ViMy8yMDIzLzA3LzI1L3NvbGFuYS1iYXNlZC1uZnQtbWFya2V0cGxhY2UtZXhjaGFuZ2VhcnQtdG8tZXhwYW5kLWludG8tZXRoZXJldW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Solana-Based NFT Marketplace Exchange.art to Expand Into Ethereum - CoinDesk",
        "content": "“[Artists] would very much prefer to actually maintain only one platform and one community, instead of [always] juggling between two or three platforms, two or three communities, always updating information between the three of them, communicating with people on all of those platforms, and so on.” said Barbu. “It was actually a decision that we took because we had demand for it, from an artist perspective – and it will help quite a lot of artists.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZXRoLXByZWRpY3Rpb24tYnV5LXNpZ25hbC03OC1hY2N1cmFjeS_SAVlodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLWV0aC1wcmVkaWN0aW9uLWJ1eS1zaWduYWwtNzgtYWNjdXJhY3kvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction: Buy Signal With 78% Accuracy Flashes - NewsBTC",
        "content": "After Ethereum (ETH) once again failed to break the $2,000 level in the 1-day chart, the price has been on a downward slide in recent days. However, this could now change, as a historically accurate trend indicator shows.\n\nCrypto traders and analysts constantly seek reliable indicators to navigate the turbulent market. One such indicator gaining attention is the Tom Demark 9 (TD9), which has flashed a buy signal for Ethereum (ETH) on the daily chart. Renowned analyst Joe McCann shared his insights via Twitter, revealing an intriguing success rate of 78% for ETH’s historical TD9 buy signals.\n\nEthereum (ETH) Buy Signal\n\nJoe McCann’s tweet brought the spotlight on ETHUSD’s TD9 buy signal, which occurred after the asset dropped 8.7% from its recent high. The TD9 indicator, an indicator that also measures whether an asset is overbought or oversold, similar to the RSI, aims to identify potential trend reversals. According to McCann, historical data showcases the TD9 buy signal’s remarkable accuracy for ETH, with a win rate of nearly 78%.\n\nPossible price targets include the July open at $1,933, the August 2022 bear market rally high at $2,031, and the year-to-date 2021 high at $2,142, according to the analyst.\n\nDigging deeper into the data, McCann highlights the impressive performance of ETH following TD9 buy signals. The statistics reveal that, on average, the asset surged by over 2.6% in the seven days following the signal, with a median return of almost 5%. These figures alone could pique the interest of traders looking for an edge in the crypto market.\n\nTo provide a more nuanced picture, McCann narrowed the data to examine the year 2019, a period he deems analogous to the 2023 crypto market cycle. The results are even more captivating, showing a remarkable win rate of nearly 90% for TD9 buy signals during this period.\n\nHowever, if we trim the data back to starting in 2019 (a year very similar to 2023 in terms of crypto market cycles), ETH has a win rate of nearly 90% with the average return over +7%.\n\nBut, as with any indicator, there are exceptions and occasional inaccuracies. McCann’s data shows several instances where the TD9 buy signal failed to predict ETH’s price movement accurately.\n\nNoteworthy is March 13, 2018, when the ETH price slid massively after the buy signal. The ETH price plummeted by 19.3% within seven days and by as much as 34.8% within the next 14 days. The signal was similarly bad on May 8, 2018, after which ETH fell by 22.1% in the following seven days and 26.7% in the following 14 days.\n\nOn the other hand, the TD9 buy signal has predicted some massive rallies. For example, on December 10, 2018, following the signal, ETH initially rose by 3.7% in the first seven days, but then came a fabulous 53.0% rise in 14 days and 64.5% in 30 days. The most recent TD9 buy signal on March 11, 20223 delivered a price increase of 18.8% in the first seven days and 29.9% after 30 days.\n\nIn general, it can be seen that the accuracy of the TD9 indicator decreases over time. While the indicator has a success rate of 78% in the first seven days with an average 7-day forward return of +2.65% and a median return of almost 5%, the success rate falls in the subsequent period of time. After 14 days, the TD9 indicator has a success rate of only 55.5% (mean 3.8%, median 5.7%), after 30 days of 63.0% (mean 6.9%, median 3.8%) since 2018.\n\nFederal Reserve Meeting Looms\n\nWhile the TD9 buy signal paints a positive picture for ETH, the crypto market remains vulnerable to external factors, including the upcoming FOMC meeting today. There is a 98.9% probability that there will be a 25 basis point rate hike. But the big question is whether this will be the last hike in this cycle. McCann writes:\n\nJuly 26th is the latest meeting of the Federal Reserve and Jerome Powell is expected to hike rates another 25 bps. Will Jerome Powell ruin the party for the ETH bulls at the press conference?\n\nAt press time, the Ether (ETH) price stood at $1,859.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8xNTAwODkvZXRoZXJldW0tZ2VuZXJhdGl2ZS1hcnQtY2hhbGxlbmdlci1oaWdobGlnaHQtdGFrZXMtb24tYXJ0LWJsb2Nrc9IBYGh0dHBzOi8vZGVjcnlwdC5jby8xNTAwODkvZXRoZXJldW0tZ2VuZXJhdGl2ZS1hcnQtY2hhbGxlbmdlci1oaWdobGlnaHQtdGFrZXMtb24tYXJ0LWJsb2Nrcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Generative Art Challenger Highlight Takes on Art Blocks - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn spite of crypto’s enduring winter and the ever-spiraling NFT market, on-chain generative artwork has seen something of a renaissance in the last year. Now, a new platform with a major backer aims to take on the stalwarts of the space.\n\nLed by boutique, curatorial collectives like Art Blocks and globe-trotting experiential collections like Bright Moments, generative art pieces—digital works created by computer code, that are only realized in their final form by a randomized generation that takes place at the time of minting—continue to fetch record prices and regale art world elites.\n\nMuch of the generative art movement’s success has thus far stemmed from projects associated with a certain level of curatorial authority and exclusivity. Highlight, a digital art marketplace and artist tool suite debuting today, aims to shift that paradigm.\n\nAD\n\nAD\n\n48 hours until our Ethereum-based generative art platform is open for all Our genesis project, “Sum” by @DuaneKing, is an onchain SVG representation of your unique wallet address It pushes all the boundaries of what generative art and personal identity mean for Ethereum👇 pic.twitter.com/xlkPKfBfX1 — Highlight (@Highlight_xyz) July 24, 2023\n\nIt claims to be the first-ever “open access” generative art platform launched on the Ethereum blockchain. The company, which is backed by prominent venture fund Haun Ventures and raised $11 million in 2022 with the broader aim of launching no-tool Web3 tools for creators, says it has created a platform that will do away with many barriers to entry across the generative art ecosystem.\n\n“All the tools that exist on Ethereum at this point, they're not open access,” Highlight co-founder and CEO Nathaniel Emodi told Decrypt. “There are different levels of curation or gatekeeping. To us, that was a screaming opportunity.”\n\nUnlike leading platform Art Blocks, which carefully curates the generative artists it spotlights for its most prominent collection—but also has secondary categories with less stringent requirements—Highlight will be entirely free to use and list on by any member of the public.\n\nSimon De Mai, an artist who has launched projects on Art Blocks and will also release work via Highlight, told Decrypt that the upstart's model is a welcome shift from the norm.\n\nAD\n\nAD\n\n\"Releasing a project on Art Blocks today is an exciting but very challenging process, and they are very selective,\" he said. \"New platforms like Highlight offer open access; artists are free to experiment and start their own projects in a more autonomous way and with less financial risk. I’m happy to see that this sense of openness is still present today, as it will definitely lead to a richer digital art landscape.\"\n\nMost leading generative art platforms also charge artists a creator fee. Art Blocks, for example, levies a 10% fee on its artists for primary NFT sales, and a 2.5% fee for secondary sales. Highlight, by contrast, will request no such fee from artists who use its services. Instead, the site will generate revenue from a small fee charged to buyers.\n\nHighlight will also provide users with a suite of tools designed to streamline and simplify the process of creating generative artworks, which can be fairly technical and involved. These tools, said Emodi, will simplify a process that could easily take an artist weeks or months to complete independently and reduce it down to minutes.\n\nIn addition to the Ethereum mainnet, Highlight will also support scaling networks that typically enable cheaper transactions—such as Polygon, Arbitrum, OP Mainnet (or Optimism), Zora Network, and Coinbase's upcoming Base.\n\nThe first project launching on Highlight today is \"Sum\" by artist Duane King, also creative director for the startup, with the pieces resembling rainbow-colored bullseye targets. But there's more than meets the eye: the colors and characteristics of each generated work are drawn from the minter's Ethereum wallet address string and other on-chain details.\n\n\"With 'Sum,' we wanted to flip the idea of scarcity on its head and instead focus on abundance,\" reads a post by King. \"Abundance is a more appropriate representation of the diversity within the blockchain community and more fitting for the medium of long-form generative.\"\n\nAn example of artwork from Holger Lippmann's upcoming collection, \"Fractal Tapestries.\" Image: Holger Lippmann/Highlight\n\nDespite the fact that Highlight’s raison-d’être appears decidedly populist, the platform is also partnering with a number of established generative artists who will debut new collections on the site this summer. Several of those artists, including De Mai, Melissa Wiederrecht, Emanuele Pasin, and James Merrill, have previously launched projects on Art Blocks.\n\nA number of those artists gave input directly to Highlight’s team during the platform’s construction, regarding what they would want out of a generative art platform crafted to their needs.\n\nAD\n\nAD\n\nPer Emodi, several artists requested a loosening of restrictions around the type of code able to be used in a generative art piece. Highlight obliged; now, artists on the site will be able to experiment with sound, image files, and several other types of media that have not yet found their way into the generative art mainstream.\n\n“All of those things are outside of the existing definition of generative art, but it's art that these artists want to create,” Emodi said. “We think that will push the definition of generative art forward. And that’s really healthy.”\n\nEditor's note: This article was updated after publication to include comment from artist Simon De Mai."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL2NvaW5yaXZldC5jb20vc29tZS1jcnlwdG8td2hhbGVzLXByZWRpY3QtMzAwMC1mb3ItZXRoZXJldW0tZXRoLWluLTIwMjMtb3RoZXJzLXdvdWxkLXJhdGhlci10YWtlLXRoZWlyLWNoYW5jZXMtb24tcHJvbWlzaW5nLXZjLXNwZWN0cmEtc3BjdC_SAZcBaHR0cHM6Ly9jb2lucml2ZXQuY29tL3NvbWUtY3J5cHRvLXdoYWxlcy1wcmVkaWN0LTMwMDAtZm9yLWV0aGVyZXVtLWV0aC1pbi0yMDIzLW90aGVycy13b3VsZC1yYXRoZXItdGFrZS10aGVpci1jaGFuY2VzLW9uLXByb21pc2luZy12Yy1zcGVjdHJhLXNwY3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Some Crypto Whales Predict $3,000 for Ethereum (ETH) In 2023 – Others Would Rather Take Their Chances on Promising VC Spectra (SPCT) - Coin Rivet",
        "content": "Buy and sell Bitcoin the easy way Start your crypto portfolio today! Get started\n\nEthereum (ETH) is one of the largest blockchains in the world, so investors naturally consider it one of the best investments in the market. Its recent performance has been strong, but investors believe VC Spectra (SPCT) can become a strong challenger to Ethereum’s (ETH) dominance.\n\nVC Spectra (SPCT) has already raised $2.4 million in its private sale, showing strong signs of what’s to come. So, are investors accurate in their predictions about VC Spectra (SPCT)? Let’s find out.\n\n>>BUY SPCT TOKENS NOW<<\n\nVC Spectra (SPCT): A Viable Challenger To Ethereum’s (ETH) (ETH) Dominance?\n\nVC Spectra (SPCT) is poised to become a top token in 2023 because it caters to the deep-seated desires of investors. The platform is perfectly suited to creating investment opportunities for users in new sectors of the crypto industry. With VC Spectra (SPCT), the fear of missing out on new projects with strong potential is non-existent.\n\nVC Spectra (SPCT) bears the burden of analyzing new startups and investment opportunities to find the most secure and profitable. The platform combines the expertise of experienced venture capitalists alongside modern risk management strategies, which help identify reliable opportunities.\n\nAs for benefits, VC Spectra (SPCT) users earn interest from the platform’s investments through buybacks and dividends. Users also enjoy access to exclusive projects in the seed and presale phases. Holding the VC Spectra (SPCT) token will also grant investors voting rights.\n\nThe SPCT token is considered valuable because of its several uses. Its overall design is also eye-catching. The VC Spectra (SPCT) token is built on the Bitcoin blockchain but is also available on Ethereum (ETH). Being a deflationary token, it employs a burn mechanism to reduce token supply and increase value.\n\nThe market is already abuzz over the recent 37.5% increase in VC Spectra’s (SPCT) price. It rose from $0.008 to $0.011. Now in Stage 2 of its public presale, VC Spectra (SPCT) is expected to rise by 121.27%, reaching $0.025 by the next stage.\n\n>>BUY SPCT TOKENS NOW<<\n\nEthereum (ETH) Remains on A Strong Rally Since Q1 2023 Despite Regulatory Challenges\n\nEthereum (ETH) was trading at $1,420 by mid-March after a relatively slow movement in the year’s first quarter. On March 20, Ethereum (ETH) jumped by 23%, reaching $1,760. On May 17, Ethereum’s (ETH) bullish momentum skyrocketed, taking its price to $2,120 – a further 20.4% increase. Admittedly, Ethereum (ETH) was a bit overpriced then, so the 11.9% correction that took it back to $1,866 two weeks later didn’t shock anyone.\n\nEthereum (ETH) then dropped sharply in mid-June. It fell by 10.7%, reaching $1,665 on June 16. It then picked up its bullish, rising by $14% to reach $1899 on June 22. At the time of this writing, Ethereum (ETH) is trading at $1,886.\n\nSome investors expect Ethereum (ETH) to grow by 6.04%, reaching the $2,000 mark once its regulatory issues clear up. However, bearish investors predict a 20% decline taking ETH to $1,500. These bearish investors say Ethereum’s (ETH) decline will be due to skyrocketing gas fees. It is also worth noting that Ethereum’s (ETH) gas fees have been on the rise in recent times.\n\nLearn more about the VC Spectra (SPCT) presale:\n\nBuy Presale: https://invest.vcspectra.io/login\n\nWebsite: https://vcspectra.io\n\nTelegram: https://t.me/VCSpectra\n\nTwitter: https://twitter.com/spectravcfund\n\nDisclaimer: The views and opinions expressed by the author should not be considered as financial advice. We do not give advice on financial products."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1kZWF0aC1jcm9zcy10aHJlYXRlbnMtbW9yZS1kb3duc2lkZS1hcy1ldGgtcHJpY2UtdHJhZGVzLWF0LWEta2V5LXN1cHBvcnQtbGV2ZWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Ether death cross threatens more downside as ETH price trades at a key support level - Cointelegraph",
        "content": "Ether’s price fell this week, and several data points are beginning to suggest that further downside could be in store.\n\nOn July 24, Ether (ETH) experienced a drop close to its monthly low, reaching $1,825 amid Bitcoin’s (BTC) negative price action, as uncertainty loomed over macroeconomic conditions and a potential whale sell-off.\n\nSeveral on-chain and technical indicators point to further downside in ETH prices. However, the extent of this downward movement could be limited, considering the profit levels of existing holders and the decrease in ETH’s liquid supply.\n\nETH on-chain analysis suggests more downside\n\nSince the beginning of 2023, Ethereum’s network value-to-transaction value (NVT) metric has indicated that the asset may have been overpriced.\n\nGlassnode’s NVT signal gauges the relative value of the Ethereum network by comparing the market price to the volume of on-chain transactions. A higher NVT reading implies that ETH could be trading at a premium.\n\nThe NVT chart from Glassnode reveals that the metric typically fluctuates between 30 and 80. However, at the start of 2023, it surged to three-year highs of 120 and has maintained higher levels since then. This suggests that either a pullback in price or an increase in Ethereum’s on-chain activity would be necessary to trigger a reset in this metric.\n\nEthereum NVT signal. Source: Glassnode\n\nNevertheless, the profit levels of short- and long-term holders suggest that the downturn could be restricted.\n\nEther’s negative price action usually reverses when the net unrealized profit/loss (NUPL) metric of short-term holders is negative, meaning short-term holders are in losses. It causes some weak hands to panic sell, allowing buyers to scoop up coins at a cheaper price.\n\nCurrently, the short-term NUPL ratio is close to neutral levels. However, there’s room for some downside based on historic levels.\n\nEther’s net unrealized profit/loss metric for short-term holders. Source: Glassnode\n\nThe realized profit/loss metric, which evaluates the relative profitability of ETH transfers, paints a similar picture. On-chain analytics firm Santiment wrote in its latest analysis that “the ratio of on-chain transaction volume in profit to loss is still favoring profit takes,” but not by much.\n\nSantiment analyst Brian Quinlivan added:\n\n“If ETH drops a bit more from here and threatens the $1,700-$1,800 level again, panic sells would come pouring in to justify the buys.”\n\nSimilarly, the NUPL ratio of long-term holders is also ranging near 2019 and early 2020 peak levels, suggesting that a pullback is likely.\n\nEther’s NUPL metric for long-term holders. Source: Glassnode\n\nThe ETH supply on exchanges has dropped drastically since the Shapella upgrade in April. At the same time, the amount staked for validation of the proof-of-stake network has increased. The locked ETH in staking contracts decreased its liquid supply on exchanges, which is more susceptible to selling than staked ETH.\n\nETH’s realized price, which represents the fair value of the token based on the daily value moved on-chain, is currently at $1,507. In 2022, ETH quickly recovered below the realized price metric as the profit levels of long-term holders dropped into negative territory.\n\nThe on-chain metrics show that the price could suffer some selling pressure from short-term holders and panic selling from investors spooked by relatively lower levels of activity in 2023.\n\nNevertheless, the profit levels of short- and long-term holders suggest that the slump may not stretch far enough and the price could find support above the $1,500 level.\n\nRelated: Crypto investors cool on Bitcoin funds, turning to Ether and XRP\n\nETH/USD price analysis\n\nTechnically, the ETH/USD pair shows bearish risk in the short term with an impending death cross on the weekly scale.\n\nEther has witnessed only one death cross between the 50- and 200-period moving averages (MAs) on a weekly scale in the past in June 2019, after which its price dropped 60%.\n\nETH/USD weekly price chart. Source: TradingView\n\nOn the daily chart, the ETH/USD pair threatens a fall toward the 200-day MA at $1,761, which also coincides with the lower highs from November 2022.\n\nETH/USD daily charts. Source: TradingView\n\nThe derivatives data for ETH indicates that there has been no significant change in the open interest volume for futures contracts, which reflects the demand for these contracts. This suggests that traders are currently not showing much interest in the recent lackluster price action.\n\nLooking at the options data from Deribit reveals that contracts worth $1.1 billion are set to expire on July 28. The positioning in the options market indicates a bullish bias, with a notable concentration of call options between $1,900 and $2,400.\n\nAs the expiration date approaches, it is likely that the price will remain subdued around the maximum pain level for options buyers, which is at $1,850.\n\nBased on the on-chain and market indicators, it appears that Ether’s negative selling pressure could persist for a couple of weeks. However, there is potential for a strong influx of buyers, particularly at support levels of $1,700 and $1,500.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8yNS9mb3JtZXItZ29sZG1hbi1zYWNocy1leGVjdXRpdmUtc2F5cy1zb2xhbmEtc29sLXNldC10by1vdXRwZXJmb3JtLWV0aGVyZXVtLWV0aC1oZXJlcy1oaXMtb3V0bG9vay_SAYUBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDcvMjUvZm9ybWVyLWdvbGRtYW4tc2FjaHMtZXhlY3V0aXZlLXNheXMtc29sYW5hLXNvbC1zZXQtdG8tb3V0cGVyZm9ybS1ldGhlcmV1bS1ldGgtaGVyZXMtaGlzLW91dGxvb2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Former Goldman Sachs Executive Says Solana (SOL) Set To Outperform Ethereum (ETH) – Here’s His Outlook - The Daily Hodl",
        "content": "Real Vision CEO Raoul Pal says that Solana (SOL) is likely to sustain its uptrend against its smart contract rival Ethereum (ETH).\n\nIn a new blog post, the former Goldman Sachs executive says that he’s keeping a close watch on the Solana versus Ethereum (SOL/ETH) pair.\n\nAccording to Pal, he sees Solana outperforming Ethereum after the pair broke out from a descending channel.\n\n“Lastly, SOL is up over 30% on the month (+150% year-to-date!) and has broken the downtrend versus ETH. This is something that we’ve been expecting for a while now and we think this trend will continue higher.”\n\nSolana is trading for $23.25 at time of writing, down over 5% during the last 24 hours.\n\nIn a new strategy session, the macro guru says that he believes the broader crypto markets are likely to outperform other asset classes in the current cycle, citing wider global adoption and continued fiat currency debasement.\n\nPal also says that the approval of a spot-based Bitcoin (BTC) exchange-traded fund (ETF) will likely push the crypto markets to greater heights.\n\n“[Crypto] outperforms everything in this type of cycle. Like, technology, it is driven by the debasement of central banks, of the fiat currency market, particularly the world’s reserve currency of the dollar, but all of them together really.\n\nAnd in addition, it’s driven by the secular trend. The adoption trend of crypto is huge. It is now 421 million wallets. It keeps going up every single year. Even last year in a bear market, it grew 40%. So in the coming years, we will probably get that number up to a billion pretty fast.\n\nSo we’ve got a huge change to come. The ongoing adoption. We’ve got central bank digital currencies to come which is, whether you like it or not, still an adoption of blockchain technologies.\n\nWe also have payments rails and all of that kind of thing going on. Plus people are looking at tokenizing asset prices like bonds and stuff like that. So the financial world is moving onto blockchain, which is a core thesis of mine.\n\nIn addition to that, we have now the onramps for the average punter which is the ETF. I think ARK (Invest) gets the first one across on August 13th, 18th or whatever it is. That will open the floodgates. I think prices will be rising into that anyway, my forecast forwards to much higher prices anyway.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1iYXJlbHktaG9sZHMtMjkwMDAtZXRoZXJldW0tYWJvdmUtMTkwMC1kb2dlY29pbi1yaXNlcy04LTM5MTEwNS0yMDIzLTA3LTI10gGYAWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuaW4vYW1wL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1iYXJlbHktaG9sZHMtMjkwMDAtZXRoZXJldW0tYWJvdmUtMTkwMC1kb2dlY29pbi1yaXNlcy04LTM5MTEwNS0yMDIzLTA3LTI1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin barely holds $29,000; Ethereum above $1,900; Dogecoin rises 8% - Business Today",
        "content": "Bitcoin and other crypto tokens continued their downward movement on Tuesday, as the digital token trader shifted their focus to Sam Altman affiliated Worldcoin, which is now banned in the US. However, traders will be looking at the US Federal Reserve's monetary policy meeting.\n\n\n\nBitcoin continued to bleed on Tuesday as the largest crypto token dropped more than 2 per cent to barely hold 29,000-mark. However, its largest peer, Ethereum, was trading lower, falling about a per cent but managed to hold $1,850-level. Price in the action altcoins was on the downside during the early day.\n\n\n\nThe overall crypto market has observed some selling pressure in the last 24 hours. The crypto fear and greed index has swung back into the neutral zone after observing a drop of 5 points; the current score is at 50/100, said Shubham Hudda, Senior Manager, CoinSwitch Markets Desk.\n\n\n\n\"Dogecoin has shown a positive price action within a few minutes after Twitter CEO Elon Musk changed the Twitter logo to X.com - with his location teasing the DOGE logo, making traders speculate the use of DOGE on the new X app,\" he said.\n\n\n\nBarring the Dogecoin and the US dollar pegged stablecoins, all other top crypto tokens were trading lower on Tuesday. XRP and Bitcoin Cash dropped 5 per cent each, while Solana tanked 4 per cent. Litecoin, Cardano and Toncoin shed 3 per cent each. Among the gainers, Dogecoin surged 8 per cent each.\n\n\n\nThe global cryptocurrency market cap was trading significantly lower, falling down to $1.17 trillion-mark as it declined two per cent in the last 24 hours. However, the total trading volumes zoomed about 42 per cent to $34.47 billion.\n\nBitcoin volatility has dipped to its lowest level in a year as investors await the Federal Open Market Committee (FOMC) meeting this week. The FOMC is expected to raise interest rates by 25 basis points this week with an expectation that this may be the last rate hike by the Federal Reserve in the foreseeable future, said CoinDCX Research Team.\n\n\n\n\n\nTech View by WazirX Trade Desk\n\nTomoChain (TOMO) is a project aimed at enhancing the scalability of the Ethereum blockchain, primarily by boosting its transactions per second (TPS) capacity. The ultimate objective of the project is to construct a blockchain infrastructure catering to decentralized apps (DApps) while enhancing integration and security.\n\n\n\n\n\nThe TOMO/USDT price has jumped up by nearly 4 per cent in the last 24 hours. In the weekly time frame, TOMO has formed a distinctive cup and handle pattern, with the trend almost breaking out of the same. The next resistance is expected at $1.66 and a strong support is expected at the $0.81 level.\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvaXMtZXRoZXJldW0tcHJpY2UtY29ycmVjdGlvbi1waGFzZS1leHRlbmRpbmctNS1kcm9wL9IBVWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvaXMtZXRoZXJldW0tcHJpY2UtY29ycmVjdGlvbi1waGFzZS1leHRlbmRpbmctNS1kcm9wL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Is Ethereum Price Correction Phase Extending? Potential 5% Drop in Sight - CoinGape",
        "content": "The Ethereum price prolongs its correction trend, as the largest cryptocurrency Bitcoin resulted in its month-long correction on a bearish note. Within a fortnight, the Ethereum price has plunged from a high of $2028 to a current price of $1862, registering a 7.8% loss. Amid this downfall, the coin price also breached the support trendline of the megaphone pattern suggesting further downfall in ETH.\n\nAlso Read: Ethereum Price Charts Signals 18% Upside; Liquid Staking Hits ATH in 2023\n\nadvertisement\n\nEthereum Price Daily Chart\n\nThe strong support of the rising trendline could offer buyers an opportunity to rebound.\n\nThe Ethereum Fear and Greed index at 46% reflect a neutral sentiment among traders\n\nThe intraday trading volume in Ether is $4.13 Billion, indicating a 36% loss.\n\nSource- Tradingview\n\nFor over a month, the Ethereum price showcased a silent recovery within the divergence trendline of the Megaphone pattern. This pattern formation is a sign of uncertainty and increasing volatility among market participants.\n\nWith the recent downturn in the crypto market, the ETH price breached the support trendline of the aforementioned pattern on July 22nd. This crackdown flipped significant support into a potential resistance that sellers can use to pressurize the coin price lower.\n\nIf the coin sellers manage to sustain this breakdown, the altcoin price could fall 4-5% to reset the ascending trendline at $1775. This trendline currently maintains the overall uptrend in the second-largest cryptocurrency and offers a dip opportunity to interested buyers.\n\nCan ETH Price Regain Bullish Momentum?\n\nTaking a look at the bigger picture, the rising channel pattern is leading to an uptrend in Ethereum price. In the last eight months, the price retest to the lower trendline of this pattern has bolstered buyers with bullish momentum to create a new high of 2023. Thus, the crypto holders must keep a watch on the support trendline of signs of a reversal to catch the next recovery cycle.\n\nRelative Strength Index: The daily RSI slope below 50% reflects a weakening bullish momentum\n\nExponential Moving Average: The 200-day EMA walking along with a lower trendline increases the support strength of the channel pattern."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2VpZ2VubGF5ZXItZGlzc29sdmUtaW50by1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "EigenLayer's endgame: 'Dissolve into Ethereum itself' - Blockworks",
        "content": "As Sreeram Kannan describes it, EigenLayer is a “marketplace for raw, decentralized trust” — the fundamental resource at the heart of blockchain technology.\n\nEthereum has already created such a marketplace and acts as the “natural source” for the “raw material,” Kannan says, but it has limitations. “I can only consume it if I write a smart contract on top of this platform.”\n\n“For many reasons, I may want to access more raw, decentralized trust,” he explains. To do this, one would normally need to create “a whole new network of nodes as well as a staking token of value.”\n\n“We were forced to actually think about, do we want to start a whole new layer-1 with its own economics underpinning it?”\n\nSpeaking to Blockworks on the Bell Curve podcast (Spotify/Apple), the CEO and founder delves into details of the smart contract middleware and what he foresees as EigenLayer’s “endgame.”\n\nAnatomy of EigenLayer\n\nEigenLayer is not a new chain or a new layer-1, Kannan explains. Instead, it is a system of smart contracts that allow ETH stakers to “opt in” to serve other systems, called “actively validated services.”\n\nAny protocol that needs nodes to talk to each other and come to consensus can be built as an actively validated service, Kannan says. Such a service would “talk to the EigenLayer contracts,” he says, specifying who can register, payment structure, slashing conditions and other selected parameters.\n\n“If you’re claiming that you’re storing data relative to this hash,” for example, “I may ask you randomly to reveal portions of the data on the Ethereum chain and if you don’t, then you may lose your ETH,” he says.\n\n“You’re working with the raw aspect of decentralized trust and you can allow people to build arbitrary protocols on top.”\n\nKannan envisions a crypto world that operates similarly to modern web application development. “You have AWS, which is the cloud,” he says, “on top of which, there are a lot of SaaS services,” for functions such as authorization, payment, and databases.\n\nSaaS, or software-as-a-service, apps in the Web2 world allow for “open innovation,” he says. Anyone can be “hyper-focused and specialized in creating a certain utility” instead of needing to build out a “whole new world” from scratch.\n\n“We all become more specialized in what we create and more general in what we consume.”\n\nKannan points out that any given Web2 application might integrate 15 or more SaaS solutions. Crypto applications reflect a similar need for a range of services, he says, from trusted execution environments to private messaging, data storage and availability, oracles and bridges, guardian networks, and so forth.\n\n“You can dream up whatever you want and build on top of it,” he says. “Open innovation is our core value.”\n\nEigenLayer’s endgame\n\nWith the focus on decentralization, Kannan says “protocols should minimize subjective decisions.”\n\n“If protocols are not expressing subjective decisions — and there are definitely subjective decisions to be made — then who expresses these subjective decisions?”\n\n“We want to be as close as possible to the Ethereum staking layer,” he says. Ideally, Kannan says EigenLayer would become part of Ethereum’s staking layer, whether through a protocol upgrade or an Ethereum improvement protocol, or EIP.\n\nWhile the platform is currently undergoing an “initial shepherding process” with whitelisting for “cautionary” purposes, he says, it will eventually be a completely permissionless platform.\n\n“Our platform minimizes its own subjectivity. We are not going to be playing this role of deciding, is this good or not good? It is up to the market to figure that out,” Kannan says.\n\n“Open innovation is best built on top of a credibly neutral layer. This is why we like Ethereum, and this is why we want ourselves to be as similar as possible to Ethereum and even at one point, dissolve into Ethereum itself.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9maWRlbGl0eS1iYWNrcy1ldGhlcmV1bS13YWxsLXN0cmVldHMtYmlnZ2VzdC1wbGF5ZXJzLWJldC1vbi1jcnlwdG9zLW51bWJlci0yL9IBdmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9maWRlbGl0eS1iYWNrcy1ldGhlcmV1bS13YWxsLXN0cmVldHMtYmlnZ2VzdC1wbGF5ZXJzLWJldC1vbi1jcnlwdG9zLW51bWJlci0yL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Fidelity Backs Ethereum: Wall Street’s Biggest Players Bet On Crypto’s Number 2 - NewsBTC",
        "content": "Fidelity, a leading financial services provider, has recently released a report on Ethereum (ETH) that sheds light on some key metrics to watch for the cryptocurrency in the coming months.\n\nThe report highlights several important indicators, including the 50-day and 200-day moving averages (MA), the realized price, the Net Unrealized Profit/Loss (NUPL) ratio, Market Value to Realized Value (MVRV) Z-Score, percent in profit, and the Pi Cycle indicators, all of which can provide valuable insights into market sentiment and potential price movements.\n\nEthereum Holds Strong Above Key Support Levels\n\nPer the report, Ethereum has remained above key support levels, with the realized price serving as a strong support level since January 10th.\n\nAdditionally, the NUPL ratio suggests that Ethereum is currently in a neutral zone, while the MVRV Z-Score indicates that the cryptocurrency’s market value is estimated to be just over the “fair” zone, potentially setting the stage for a bull run or at least sideways price action, according to Fidelity.\n\nAnother interesting metric highlighted in the report is the percent of unique addresses in profit, which currently sits at nearly 66%. While this metric has not touched the green zone since January 2020, it suggests that Ethereum owners may be using the cryptocurrency for trading, DeFi, staking, or buying other digital assets.\n\nFurthermore, the Pi Cycle indicators, which have historically been a good cycle top indicator, are showing that Ethereum is currently in a neutral zone. As the long-term moving average continues to follow the sunken price downward, it may be setting the stage for more volatility shortly.\n\nHowever, whether this volatility will be to the upside or downside remains to be seen and could depend on a variety of macro factors.\n\nETH Adoption On The Rise\n\nOn the other hand, Fidelity’s report highlights that while monthly active addresses and the monthly transaction count have fallen by 1%, the number of monthly new Ethereum addresses has slowly increased by 9% in Q2 2023.\n\nNew addresses are defined as unique addresses that appeared for the first time in a transaction. This metric for momentum may not show direct network usage, but it does indicate a clearer picture of Ethereum adoption.\n\nThe short-term moving average of new addresses is shown to be rising back above that of the longer-term moving average, indicating that the rate of new users joining the network is increasing. New and existing projects are likely incentivizing new users and helping to drive this increase.\n\nAnother significant metric highlighted in the report is the net issuance of new supply issued by the network minus burned supply from transactions since The Merge.\n\nThis has driven a supply decrease for over five months now, with net issuance surpassing -700,000 Ether. The report notes that this is important because, in theory, as Ethereum’s supply is destroyed, it raises the relative ownership level of all remaining token holders.\n\nAs of writing, ETH’s price is at $1,849, which has decreased by 2% within the last 24 hours. Similar to Bitcoin’s situation, Ethereum has also lost its 50-day MA, which is currently positioned at $1,869.\n\nIf the market continues to decline, ETH can anticipate several key support levels that may help prevent a further bearish trend.\n\nThe closest support level is situated at $1,840, followed by another support level of $1,792. However, the most crucial support floor is the 200-day MA, which is located at $1,780. This will be a significant factor in determining who will dominate in the upcoming months.\n\nFeatured image from Unsplash, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8xNDk4MzAvc29sYW5hLWdhbWluZy1mcmFuY2hpc2UtYXVyb3J5LWV4cGFuZHMtZXRoZXJldW0tbGF5ZXItMi1hcmJpdHJ1bdIBYGh0dHBzOi8vZGVjcnlwdC5jby8xNDk4MzAvc29sYW5hLWdhbWluZy1mcmFuY2hpc2UtYXVyb3J5LWV4cGFuZHMtZXRoZXJldW0tbGF5ZXItMi1hcmJpdHJ1bT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Solana Gaming Franchise Aurory Expands to Ethereum Layer-2 Arbitrum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe team behind the NFT-driven game franchise Aurory announced today that it is expanding beyond the Solana blockchain, adding cross-chain support for Aurory NFTs and its AURY token with the Ethereum scaling network, Arbitrum.\n\nWhile Aurory is not the first Solana-native NFT or game project to embrace other chains, this particular move is being branded as an expansion rather than a migration.\n\n“We’re not leaving Solana necessarily,” Aurory Executive Producer Jonathan Campeau told Decrypt ahead of the official Arbitrum announcement. “For us, really, we need to branch out a little bit in terms of from a pure business point of view.”\n\nAD\n\nAD\n\nAurory’s SyncSpace tech will allow users to move their assets between Solana and Arbitrum and into the games.\n\nBecause Solana is not an Ethereum Virtual Machine-native or Ethereum-compatible chain, it typically means users have to create a new wallet via options like Phantom or Solflare, which can add friction to the user experience for those only familiar with the Ethereum ecosystem and wallets like MetaMask. Aurory also offers users the option to sign into their game accounts with just an email address, and connect a crypto wallet at a later time.\n\n“We just want to open more doors for players, because we understand that Solana has a specific audience,” Campeau said. “Arbitrum developed their own culture, their own audience as well.”\n\nAlthough SyncSpace effectively works like a bridge between blockchains and into the company's games, Aurory Head of Marketing and Business Development Michael Natoli told Decrypt that the goal isn't primarily to let NFT and token holders move from one chain to another—it's to create new kinds of on-ramps into the game, to tap into other crypto communities and their own liquidity.\n\nNatoli added that if a Solana NFT is moved over to Arbitrum, the original NFT will be held within SyncSpace and can eventually be moved back from Arbitrum to Solana at some point. The on-ramps will let players bring Aurory NFTs and USDC stablecoins into the game via either chain, and then USDC can be swapped for the game's AURY token for use in Aurory.\n\nAD\n\nAD\n\nUltimately, Aurory NFT items on Solana or Arbitrum will act the same inside the games.\n\n\"There is no 'upside' of moving them from one chain to the other, aside from people now having the option to withdraw their Aurory assets on the chain that they prefer between the two,\" said Natoli. \"We ultimately want to expand our community and bring the Aurory experience to another growing and committed Web3 ecosystem in Arbitrum.\"\n\nThere could be functional in-game benefits to exploring the chains, however. Adding support for more blockchains could open up avenues for new experiences with non-playable characters (NPCs), Campeau suggested, which could be tied to specific chains to encourage cross-chain exploration.\n\n“You could definitely see an NPC, particularly in the game, really heavily in crypto or really heavily on Solana, and be able to trade with them or to do quest items,” Campeau shared. “He’s only going to be asking for items that will be on the Solana blockchain for you to move forward, for example.”\n\nAurory has two games currently in development. One is Aurory Adventures, the player-versus-environment (PvE) role-playing game (RPG). The other is Aurory Tactics, a player-versus-player (PvP) battle arena game.\n\nAurory offers playable character NFTs called Aurorians, as well as Pokemon-like animal NFTs called Nefties. The game also has character skins and Neftie eggs on-chain as NFTs, and has one on-chain token, AURY. In 2021, Aurory collaborated with esports organization TSM and the now-shuttered crypto exchange FTX on limited edition NFTs.\n\nArbitrum marks the first step out of the Solana ecosystem for Aurory, but it may not be the last.\n\n“In the future, it’s not unrealistic for us to start looking at Polygon, to start looking at Avalanche,” Campeau said. “BNB is another one that we’ve been looking into.”\n\nAD\n\nAD"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZGVjcnlwdC5jby8xNTAwMTQvbGFjb3N0ZS1uZXctdmlydHVhbC1zdG9yZS1leGNsdXNpdmUtcGVya3MtZXRoZXJldW0tbmZ0LWhvbGRlcnPSAV5odHRwczovL2RlY3J5cHQuY28vMTUwMDE0L2xhY29zdGUtbmV3LXZpcnR1YWwtc3RvcmUtZXhjbHVzaXZlLXBlcmtzLWV0aGVyZXVtLW5mdC1ob2xkZXJzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Lacoste's New Virtual Store Has Exclusive Perks for Ethereum NFT Holders - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nApparel brand Lacoste is opening up a new virtual store for the summer. Created by retail technology developer Emperia, the digital rendition combines a more traditional immersive retail experience with elements exclusive to holders of Lacoste’s UNDW3 NFT passes.\n\nUNDW3 (pronounced “underwater”) is the name of the French brand’s NFT-based loyalty program. The virtual store experience is accessed via Lacoste’s standard e-commerce platform. After entering via the mouth of the brand’s emblematic crocodile, shoppers can explore a tiled boutique before taking the elevator up to an outdoor pool area overlooking a beach.\n\nPieces from Lacoste’s summer apparel collection are available for purchase throughout, and visitors can also participate in a crocodile-themed scavenger hunt game.\n\nAD\n\nAD\n\nA screenshot from Lacoste's new virtual store. Image: Lacoste/Emperia\n\nHolders of Lacoste’s UNDW3 tokens on Ethereum can access an additional underwater VIP space, which can be unlocked either by an email login or by connecting a digital wallet containing the token.\n\nFor sale in the VIP space is an exclusive UNDW3 apparel collection, made for and co-created in March by Lacoste’s UNDW3 community members. Each physical garment comes with its own digital twin as an NFT, plus an augmented reality (AR) feature accessed by scanning a QR code.\n\nAn exclusive extra level of the scavenger hunt game also plays out in the member space, with the opportunity to win prizes every week during the summer-long activation.\n\n“Our ongoing work with Lacoste and its advanced view of e-commerce and customer loyalty has given birth to new technologies that yield an improved user journey which connects the dots between virtual and physical retail,” Emperia co-founder and CEO Olga Dogadkina said in a statement.\n\nIn fact, this is the second shoppable activation that Emperia has built for Lacoste. The first, which launched in December 2022 and also involved a token-gated gamified element for UNDW3 holders, went on to win a Webby Award in May.\n\nAD\n\nAD\n\nEarlier this year, Emperia developed a virtual experience for L’Occitane, which showcased the French beauty brand's retail universe and spotlighted ingredients and best-selling products. Visitors could take a bicycle ride through the lavender fields of Provence and fly over Corsica in a hot air balloon.\n\nThe tech company has previously worked with Bloomingdale’s, Burberry, Christie’s, and Dior as well.\n\nA screenshot from Lacoste's new virtual store. Image: Lacoste/Emperia\n\nAfter launching its Web3 loyalty program UNDW3 in 2022, Lacoste rolled out the second phase in June. The brand evolved its genesis NFT pass into a new dynamic token, and introduced a gated community platform where holders can chalk up rewards by participating in interactive games and fashion design challenges.\n\nThe fashion challenges take place in close collaboration with Lacoste’s physical studio, and members can leverage 3D and AI-based tools. Points tallies are displayed on a leaderboard on the site, and those who achieve the highest scores can win prizes such as a week with Lacoste in Paris, or the chance to represent the UNDW3 community via a social media campaign."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8xNDk3NzIvd29ybGRjb2luLWhhcy1tYWpvci1pc3N1ZXMtd2lsbC10YWtlLXllYXJzLXdvcmstdml0YWxpay1idXRlcmluLXdhcm5z0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzE0OTc3Mi93b3JsZGNvaW4taGFzLW1ham9yLWlzc3Vlcy13aWxsLXRha2UteWVhcnMtd29yay12aXRhbGlrLWJ1dGVyaW4td2FybnM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Worldcoin Has 'Major Issues' and Will Take Years to Work, Vitalik Buterin Warns - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWorldcoin launched to much fanfare on Monday—but Ethereum's Vitalik Buterin has identified four \"major issues\" with the project's design.\n\nFounded by Sam Altman—the CEO of OpenAI—the company is offering a \"digital passport\" that allows owners to prove they're human, and not a bot. This is achieved through the use of Orbs, machines that scan a person's eyeball to create a World ID.\n\nIn a lengthy new blog post, Buterin argues that an effective, reliable proof-of-personhood system, like Worldcoin, \"seems very valuable,\" but warns there are big risks in the race to develop one.\n\nThe Ethereum co-founder's first concern relates to privacy—and the act of scanning someone's iris. Buterin fears this could capture much more data than meets the eye, including a person's sex, ethnicity and even certain medical conditions.\n\nPerhaps Buterin's most practical argument concerns accessibility—and how likely it's going to be that everyone who wants a World ID can get one.\n\nThe latest figures from Worldcoin suggest 1,500 Orbs will be available in 35 global cities as the year progresses—helping the total number of weekly registrations surge from 40,000 people a week to 200,000.\n\nOverall, it estimates that two million have already signed up for a World ID.\n\nSuggesting that sign-ups could plateau quickly, Buterin wrote: \"While there are billions of smartphones, there are only a few hundred Orbs. Even with much higher-scale distributed manufacturing, it would be hard to get to a world where there's an Orb within five kilometers of everyone.\"\n\nIf Orbs do become prolific, he believes the headaches wouldn't stop here. He pointed out that there's nothing to stop a government from banning Orbs in their country—or using this technology to coerce citizens.\n\nButerin issues centralization, security concerns\n\nButerin's third concern centers on centralization—a pejorative for crypto projects the world over.\n\nIn his blog, he points out that Orbs are hardware devices where backdoors could be installed into the system—allowing malicious manufacturers to create many bogus human identities.\n\n\"If even one Orb manufacturer is malicious or hacked, it can generate an unlimited number of fake iris scan hashes, and give them World IDs,\" Buterin warned.\n\nWhile Worldcoin vows to perform regular audits on Orbs to ensure they are built correctly, Buterin is calling for the project to ensure that World IDs generated with different manufacturers are distinguishable from one another. He believes this could weed out malicious activity, adding: \"If we see the North Korean government going around and forcing people to scan their eyeballs, those Orbs and any accounts produced by them could be immediately retroactively disabled.\"\n\nFinally, he warned about security—but stressed this affects all proof-of-personhood systems and not just Worldcoin.\n\nHe believes an \"unlimited amount of identities\" could be generated if Orbs mistakenly approve the irises of AI-generated photographs or 3D prints of fake people. There's also a danger of someone selling on or renting their World ID to someone else—or losing it after a phone hacking.\n\nButerin argues that, while there could be some solutions to all of his concerns, Worldcoin may need to team up with other proof-of-personhood projects that score more highly on decentralization, accessibility, and protection against fake users.\n\nHe concluded by stressing he believes a world without proof-of-personhood also has dangers—and said building a robust system won't be easy nor quick.\n\n\"I definitely do not envy the people attempting the task, and it will likely take years to find a formula that works,\" he said.\n\nWorldcoin did not immediately respond to Decrypt’s request for comment."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5kYWlseWZ4LmNvbS9uZXdzL2NvdWxkLXRoZS1mZWQtdHJpZ2dlci1hLWRlZXBlci1yZXRyZWF0LWluLWJpdGNvaW4tZXRoZXJldW0tYnRjLXVzZC1ldGgtdXNkLXByaWNlLWFjdGlvbi0yMDIzMDcyNi5odG1s0gGGAWh0dHBzOi8vd3d3LmRhaWx5ZnguY29tL25ld3MvY291bGQtdGhlLWZlZC10cmlnZ2VyLWEtZGVlcGVyLXJldHJlYXQtaW4tYml0Y29pbi1ldGhlcmV1bS1idGMtdXNkLWV0aC11c2QtcHJpY2UtYWN0aW9uLTIwMjMwNzI2Lmh0bWwvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Could the Fed Trigger a Deeper Retreat in Bitcoin & Ethereum? BTC/USD & ETH/USD Price Action - DailyFX",
        "content": "Bitcoin, BTC/USD, Ethereum, ETH/USD - Outlook:\n\nThe upward pressure in Bitcoin appears to be fading in the very short term.\n\nETH / USD continues to hold above a crucial support.\n\nWhat is the outlook and what are the key levels to watch in BTC/USD and ETH/USD?\n\nRecommended by Manish Jaradi Get Your Free Introduction To Cryptocurrency Trading Get My Guide\n\nThis week’s drop makes Bitcoin and Ethereum vulnerable to any hawkish tone from the FOMC meeting later Wednesday.\n\nThe Fed is widely expected to hike interest rates by 25 basis points at the end of the two-day FOMC meeting later today given inflation remains well above the central bank’s target – rate futures are pricing in near certainty of the move, according to the CME FedWatch tool. However, the Fed statement and Powell’s comments will be key.\n\nA hawkish tone could boost US Treasury yields and the US dollar, weighing on Bitcoin and Ethereum, while a wait-and-watch or a dovish hike could bring cheer to USD bears. For more discussion on the potential Fed and USD scenarios, see “US Dollar Scenarios Ahead of Fed Rate Decision: EUR/USD, GBP/USD, USD/JPY Price Setups,” published July 26.\n\nBTC/USD Weekly Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nBITCOIN: Still looking for the bullish break\n\nBTC/USD has struggled to break past a key converged barrier at the April high of around 31000, coinciding with the 89-week moving average and the upper edge of the Ichimoku cloud on the weekly chart. The back-to-back small body candles in recent weeks are a sign of indecision, given the significance of the resistance. A break above the barrier would be a strong signal that the medium-term bearish pressure is fading. Such a move could open the door toward 40000.\n\nBTC/USD 240-Minute Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nHaving said that, near-term technical charts suggest BTC/USD may have to wait a bit longer for the bullish move to ensue. On the 240-minute charts, BTC/USD has fallen below the 200-period moving average, and key support on the lower edge of a sideway channel since late June, potentially opening the door toward 28000 in the near term. Still, for the broader upward pressure to dissipate, BTC/USD needs to fall below the crucial floor at the June low of 24750.\n\nETH/USD Weekly Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nETHEREUM: Holding the above key support\n\nFollow-through gains have been lacking after ETH/USD in April rose above the August high of 2030. However, it hasn’t broken any significant support either to suggest the rebound from the end of 2022 is over. In this regard, the June low of 1620 is crucial support – ETH/USD needs to hold above this support for the broader upward trajectory to remain intact.\n\nETH/USD 240-Minute Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nIn the near term, though, ETH/USD has a tough cushion on a horizontal trendline from late June at about 1815. Any break below would temporarily halt the bullish pressure, opening the door toward 1765 initially, potentially 1620.\n\nRecommended by Manish Jaradi Get Your Free Top Trading Opportunities Forecast Get My Guide\n\n--- Written by Manish Jaradi, Strategist for DailyFX.com\n\n--- Contact and follow Jaradi on Twitter: @JaradiManish"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vY29pbmRvby5jb20vdml0YWxpay1idXRlcmluLW5ldC13b3J0aC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Vitalik Buterin's Net Worth Grows in 2023 - Latest Cryptocurrency Prices & Articles",
        "content": "Vitalik Buterin is a name that should be mentioned more often in the cryptocurrency industry, as he is one of the creative minds behind Ethereum, one of the most popular cryptocurrencies and the second-largest cryptocurrency by market capitalization after Bitcoin. For this reason, it is not surprising that crypto enthusiasts are interested in Vitalik Buterin’s net worth.\n\nAs of 2023, Buterin’s net worth is estimated at around $ 600 million from his on-chain Ethereum holdings and off-chain assets. Moreover, his financial status was influenced by his philanthropic endeavors and many charity donations. One notable example is the $1 billion SHIB donated to an India COVID relief fund, where he transferred the coins from his wallet as a gift. Isn’t this something rare that we hear?\n\nYet, despite his success, Vitalik Buterin wishes to remain involved in Ethereum’s evolution rather than as an investor, as he contributed immensely to developing the number-one platform for smart contracts and dApps, Ethereum.\n\nIn today’s article, we discuss Vitalik Buterin’s Net Worth in 2023, learning more about his achievements in the crypto space. Stay tuned and learn more about this brilliant mind that changed the landscape for the better.\n\nVitalik Buterin’s Early Life and Career Development\n\nBorn on January 31, 1994, in Kolomna, Russia, Vitalik is a Russian-Canadian programmer, considered one of the youngest cryptocurrency influencers in the crypto world, and a writer and developer in the Bitcoin community, being one of the co-founders of Bitcoin Magazine.\n\nHis interest in math and economics started around 6 or 7, when his parents moved to Canada, hoping for a better life. Indeed, this was the case, as Vitalik showed remarkable school results and was even transferred to a particular class for those with high achievements who needed a more challenging school system to sustain his interests further.\n\nFrom a private high school to the University of Waterloo, Vitalik Buterin advanced his classes and became the research assistant for Ian Goldberg, a famous cryptographer. Moreover, Buterin won a bronze medal in the International Olympiad in Informatics in 2012.\n\nStill, in 2014 he dropped out of college after receiving a substantial award, the $100,000 Thiel Fellowship, for his dedicated work on Ethereum. But his career could not be in vain, as he received an honorary doctorate from the University of Basel in 2018.\n\nVitalik Buterin Net Worth in 2023\n\nButerin has undoubtedly helped develop the cryptocurrency and blockchain space with the Ethereum project, being among the world’s top 15 most prosperous crypto traders and influencers.\n\nWith a net worth of approximately $600 million, his allegedly crypto wallet shows a value of around $500 million, and the rest in personal, off-chain assets. Furthermore, his wealth fluctuates as there is a constant dynamic shift in the market and his donations to various causes.\n\nHis fair share of Ethereum is speculated to be around 244,001 ETH, and many would think this is a small number of coins for an Ethereum co-founder. Considering that Satoshi Nakamoto, the creator of Bitcoin, took a million of the 21 million coins for himself, there is no doubt that Buterin’s interest in developing the technology is driving Ethereum to be a highly successful crypto project.\n\nEthereum 2.0\n\nThe cryptocurrency space has long anticipated the launch of Ethereum 2.0, as this is a 3-phase long-term process that aims to significantly increase the number of transactions, improve smart contracts’ stability, and reduce network fees.\n\nThe Beacon Chain introduced us to the PoS (Proof of Stake) mechanism, and the Merge in 2022 pushed the Ethereum network to be substantially more energy efficient. The last phase, the Sharding, would handle the large amounts of data into two rollups, also known as layer 2, and is estimated to be released in 2024.\n\nBut How Did Ethereum 2.0 Change Things?\n\nAs in the past, the gas fees reached incredibly high levels, and the 2.0 shift made it possible to move from a Pow to a PoS, where there is no need for crypto miners, as seen in Bitcoin. Instead, users are staking their Ethereum by joining a pool. In the end, Proof-of-Stake is a more sustainable mechanism that uses less energetic power, thus becoming much faster.\n\nFun fact: The energy usage dropped by roughly 99.95% and decreased average block times after switching to Proof-of-Stake.\n\nThe Ethereum Shanghai Upgrade\n\nIn April 2023, the Shanghai or EIP 1559 upgrade was the most awaited update of the year. This update addressed the issues related to the transaction fees and network congestion on the Ethereum blockchain, introducing a new fee structure, thus making ETH more deflationary.\n\nThis new fee structure included a base fee and priority fees that enhanced the efficiency of the transactions. However, the Shanghai upgrade has significant potential in the crypto world, making the transactions more user-approachable by reducing the fees volatility and increasing the network’s capacity.\n\nMoreover, this will further help make the Ethereum ecosystem more scalable, sustainable, and user-friendly to grow its user base.\n\nEthereum Reached Record Highs\n\nEthereum has been at the forefront of market performance since late 2020, just like Bitcoin. Although many believe that ETH followed Bitcoin’s price trends, it is essential to know that cryptocurrencies get more valuable with increasing network engagement.\n\nThe staking of billions of dollars in ETH on the network is likely a significant factor influencing the price and the use of DeFi (Decentralized Finance) and the smart contract and dApps infrastructure. Moreover, many analysts have mentioned the overvaluation of Ethereum several times due to the infrastructure.\n\nAs of July 2023, Ethereum trades at $1,871.76 after breaching an all-time high of $4,800 in 2021.\n\nFinal Thoughts\n\nVitalik Buterin’s journey from a young programmer to a key figure in the crypto world is truly remarkable, and undoubtedly, his contributions could not go without being noticed. From revolutionizing the blockchain space to introducing smart contracts and decentralized applications, Buterin has reshaped how we interact with technology.\n\nAs the cryptocurrency landscape continues to evolve, Vitalik Buterin’s story still influences many, as his vision, perseverance, and commitment led to the creation of one of the most well-known cryptos that are changing things for good.\n\nAs we stay tuned to what lies ahead, one thing is sure – the journey of Ethereum and its co-founder is far from over, and the potential for positive change in the world remains boundless.\n\nShare this Post Twitter\n\nLinkedin\n\nFacebook\n\nReddit\n\n* The information in this article and the links provided are for general information purposes only and should not constitute any financial or investment advice. We advise you to do your own research or consult a professional before making financial decisions. Please acknowledge that we are not responsible for any loss caused by any information present on this website."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY3J5cHRvLm5ld3MvZmxhc2hib3RzLWJlY29tZXMtdW5pY29ybi1hZnRlci1yYWlzaW5nLTYwLW1pbGxpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Flashbots becomes unicorn after raising $60 million - crypto.news",
        "content": "San Francisco-based firm Paradigm has invested $60 million to support the development of Flashbots’ new Ethereum blockchain transaction packaging software version.\n\nNotably, the series B funding round contrasts with the current trend among Silicon Valley venture capitalists.\n\nFlashbots fosters transparency\n\nFlashbots, a Cayman Islands-based software provider that bundles Ethereum blockchain transactions, secured funding via “decentralization beauty contest.” This involves selecting investors through reverse pitches.\n\nThe funding has led to a valuation of at least $1 billion, as confirmed by a Flashbots representative.\n\nSince 88% of validators collaborate with entities like Flashbots to receive additional fees, this valuation is expected.\n\nYou might also like: Flashbots drops new short-term censorship resistance strategy\n\nFlashbots specializes in developing software to address the issue of “maximal extractable value” (MEV), referring to the additional profit earned by blockchain operators beyond regular user fees.\n\nTechniques like front-running transactions, where operators pay fees to prioritize their trades ahead of others, contribute to MEV.\n\nThe company’s latest technology, the single unifying auction for value expression (SUAVE), aims to reduce the risks associated with MEV by fostering transparency and decentralization in MEV-related opportunities.\n\nFive days after announcing its successful acquisition of approximately $30.4 million in funding, the company has achieved unicorn valuation, as reported in its filing with the Securities and Exchange Commission (SEC) on July 21.\n\nQuiet in the headlines\n\nFlashbots has not been in the news for several months, with the most recent major headline being when the company faced public scrutiny in November.\n\nThen, the Office of Foreign Assets Control (OFAC) expanded its list of sanctioned addresses to encompass smart contracts for the first time, resulting in several repercussions for numerous Ethereum network users.\n\nThe implementation of the censorship strategy coincided with the market’s transition to complete block submission, leading to a clear separation between block builders and validators.\n\nValidators lost the ability to individually add transactions to a block, signifying a notable change in the network’s functioning.\n\nThe latest funding round is intended to support the development of SUAVE; the upgrade focused on censorship resistance.\n\nGiven the previous controversy, critics will be keen to observe if this funding helps maintain transparency and efficiency within the crypto space.\n\nRead more: Increasing Flashbots Usage Crashes Ethereum Gas Fees\n\nFollow Us on Google News"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW50cnVzdC5jb20vbWFya2V0LW5ld3MvcG9seWdvbnMtZ3Jvd2luZy1pbXBhY3QtcmVhbC13b3JsZC1pbXBsZW1lbnRhdGlvbnMtZXhwYW5kaW5nLW9uLWV0aGVyZXVtcy1sYXllci0yLW5ldHdvcmvSAYMBaHR0cHM6Ly93d3cuY29pbnRydXN0LmNvbS9tYXJrZXQtbmV3cy9wb2x5Z29ucy1ncm93aW5nLWltcGFjdC1yZWFsLXdvcmxkLWltcGxlbWVudGF0aW9ucy1leHBhbmRpbmctb24tZXRoZXJldW1zLWxheWVyLTItbmV0d29yay9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Polygon’s Growing Impact: Real-World Implementations Expanding on Ethereum’s Layer-2 Network - CoinTrust",
        "content": "Polygon, the leading layer-2 network on Ethereum, has evolved into a thriving ecosystem encompassing various Web3-native sectors, including gaming and decentralized finance. The network’s scalability advantages are now being harnessed for diverse real-world use-cases, demonstrating its potential to promote transparency, equality, and innovation on a global scale.\n\nLeveraging Polygon’s Versatility\n\nSoulbound Tokens Revolutionize Education Sector\n\nThe National University of Mongolia (NUM) has taken a pioneering step by issuing soulbound tokens, non-transferable NFTs, as digital diplomas to graduates. Utilizing Polygon’s network, this initiative is part of a broader project to establish a ‘Meta University’ in collaboration with multiple organizations. The utilization of soulbound tokens ensures a tamper-proof and immutable system for delivering and verifying academic qualifications.\n\nBlockchain-enhanced Transparency in Law Enforcement\n\nPolice in Uttar Pradesh, India, renowned for the Taj Mahal, are adopting Polygon’s foundational framework to record public complaints on the blockchain. The initiative aims to enhance transparency in law enforcement, mitigate corruption, and improve efficiency. By leveraging the immutability of Polygon’s network, the complaints remain secure and unaltered, marking a groundbreaking application of blockchain technology announced in 2022.\n\nNational University of Mongolia (NUM) has initiated \"Meta University\" #onPolygon, in collaboration with Octagon Marketplace & Guyuk Metaverse, as part of its 80th anniversary. 6 types of NUM #NFTs will be delivered to graduates, students, teachers, & staff. pic.twitter.com/jWhPSYmAxk — Polygon (Labs) (@0xPolygonLabs) November 3, 2022\n\n\n\nLugano’s Crypto Ambitions with Polygon\n\nThe Swiss city of Lugano aspires to become Europe’s crypto capital, unveiling plans to introduce its local stablecoin, LVGA, powered by Polygon for fast, efficient, and secure transactions. Residents will utilize LVGA for various payments, including taxes, parking tickets, public services, and student tuition fees. To foster blockchain-based businesses, Lugano intends to establish a $116 million fund, with many start-ups likely to leverage Polygon’s efficiency and existing ecosystem.\n\nPolice Complaints(FIR) on blockchain powered by @0xPolygon This is very close to my heart. We grow up hearing about so many of such cases wherein due to some corruption in a local police department, victims(mostly of rapes) are not even able to register complaint or…1/2 https://t.co/k9gRMD6r08 — Sandeep Nailwal | sandeep. polygon 💜 (@sandeepnailwal) October 12, 2022\n\n\n\nJPMorgan’s Foray into Polygon’s Network\n\nDespite prior hesitancy among traditional financial institutions to adopt blockchain technology, JPMorgan executed its first cross-border cryptocurrency transaction on the Polygon network in late 2022. Working with the Monetary Authority of Singapore, the transaction involved tokenized versions of the Japanese Yen (JPY) and the Singapore Dollar (SGD), signaling increased interest in Polygon’s capabilities.\n\n\"Blockchain is not just a technical revolution, but a human revolution about our guiding principles as a society.\" –@sandeepnailwal#Polygon is partnering w/ Tether to support the City of Lugano in becoming a blockchain-powered city 🌆 Thanks for an incredible time @LuganoPlanB https://t.co/Dc2ArBadGx — Polygon (Labs) (@0xPolygonLabs) November 1, 2022\n\n\n\nPolygon’s prominence as the largest Ethereum layer-2 network, coupled with its impressive total value locked and MATIC’s market capitalization, underscores its growing influence across the crypto landscape. As more innovative use-cases emerge, Polygon’s potential to revolutionize industries and drive meaningful change becomes increasingly evident."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNvaW5iYXNlLmNvbS9ieXRlcy9hcmNoaXZlL2JpcGFydGlzYW4tY3J5cHRvLWJpbGxzLWFkdmFuY2UtaW4tY29uZ3Jlc3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Coinbase Bytes newsletter - Coinbase",
        "content": "There’s never a dull moment on the blockchain. Here’s what you need to know this week:\n\n Two bipartisan crypto bills advanced in Congress. How Democrats and Republicans came together, and what’s next for the proposed legislation.  Ethereum turns eight. A look back at major milestones from the CryptoKitties craze to the transition to proof of stake.  The week in numbers. The total amount of crypto donated to Ukraine since 2022, and other key stats to know.\n\nBILLS BILLS BILLS\n\nBipartisan crypto legislation passes U.S. House committees\n\nDespite being the world’s biggest economy and home to many of the most innovative companies in the crypto industry (from mining and protocol startups to venture funds and major exchanges), the United States has lagged behind much of the world when it comes to crypto regulation. But a set of bills that would help set clear guardrails for the industry and establish consumer protections recently advanced in the House of Representatives, a key step in the long process of making them into laws.\n\nHere’s what you should know.\n\nWhat are the bills being considered by Congress?\n\nFirst up is the “Financial Innovation and Technology Act for the 21st Century,” or FIT21, which advanced through the House Financial Services Committee and the House Committee on Agriculture last week with bipartisan support.\n\nAs the latest attempt at comprehensive crypto reform, the bill defines when a cryptocurrency is a commodity versus a security; empowers the Commodity Futures Trading Commission (CFTC) to regulate digital asset commodity spot markets; and establishes a pathway for crypto trading platforms to register with the CFTC and the Securities and Exchange Commision (SEC).\n\nAs the bill made its way through committee votes, several amendments were added — including a provision that would create a process to certify whether a blockchain is sufficiently decentralized and another to provide an extra $150 million in funding for the CFTC over three years.\n\nThe other key bill under consideration is the “Clarity for Payment Stablecoins Act,” which would create a regulatory framework for stablecoins (cryptocurrencies pegged to a “stable” reserve asset, often the U.S. dollar) with the Federal Reserve creating a set of rules for their issuance.\n\nThe bill clarifies that stablecoins are payment instruments that are neither securities nor commodities. The proposed legislation also provides rules for reserves, transparency, compliance, and risk management, and creates a path for banks and non-banks to issue stablecoins with proper oversight.\n\nWhile the bill did pass out of the House Financial Services Committee with bipartisan support, some Democrats said they didn’t have sufficient input on the bill and would have preferred to hold the committee vote in the fall, after congressional recess.\n\nWhat happens next?\n\nLast week’s moves were a big deal. They marked the first time that standalone regulatory crypto bills advanced on their own merit and not as part of broader bills. But advancing past committee votes is just the beginning of the process — next up is a vote from the full House of Representatives this fall. Notably, both bills were supported in committee by both Democrats and Republicans — creating optimism that consensus can be reached. As Axios put it, “crypto policy is looking less like a partisan issue.”\n\nHAPPY ETHDAY\n\nA brief history of Ethereum to celebrate its 8th birthday\n\nEthereum — the second-biggest cryptocurrency by market cap after bitcoin — celebrated its eighth birthday on Monday, with cofounder Vitalik Buterin enjoying cake (and a dosa) in Bangalore, India. Ethereum’s founders set out to build a new kind of global, decentralized computing platform that takes the security and openness of blockchains and extends those attributes to a vast range of applications. In the years since, an entire economy ranging from NFTs to DeFi has been built on top of Ethereum’s adaptable blockchain.\n\nLet’s take a look back at some milestones.\n\n2013: Buterin, then a 19-year-old computer programmer (and Bitcoin Magazine cofounder), releases a whitepaper proposing a highly flexible blockchain that could support virtually any kind of transaction.\n\n2015: The first public version of the Ethereum blockchain launches in July (and smart-contract functionality begins to roll out).\n\n2017: The ERC-20 standard is created, defining a way that developers can create an asset (or token) on top of the Ethereum blockchain, making it easier to build Ethereum-compatible apps. The first widely popular Ethereum-based app arrives in the form of a game called CryptoKitties, in which users collect and trade digital cats. It becomes a genuine craze with rare digital cats selling for upwards of $200,000.\n\n2018: Decentralized finance (or DeFi) protocols built on Ethereum gain momentum. DeFi aims to transform the financial services industry by making transactions faster, cheaper, and more secure. Among the top early DeFi initiatives are lending protocol Compound, decentralized exchange Uniswap, and the USDC stablecoin — with more than $1 billion in USDC issued in the first year.\n\n2020: Ethereum begins its transition from a proof-of-work blockchain (like Bitcoin) to a proof-of-stake blockchain. Via staking, users can lock some of their ETH into a smart contract to help secure the network and earn rewards.\n\n2021: As crypto markets surge, NFT projects built on Ethereum’s ERC-721 standard like CryptoPunks and Bored Ape Yacht Club become multibillion-dollar asset classes. Meanwhile, the EIP-1559 upgrade is rolled out with the intention of reducing the supply of ETH circulating at any given time and making transaction fees more predictable.\n\n2022: Ethereum completes the Merge in September, completing its multi-year migration to the 99% more eco-friendly proof-of-stake system.\n\n2023: April’s Shappella upgrade allows staked funds to be withdrawn from the network.\n\nNUMBERS TO KNOW\n\n$100 billion\n\nBitcoin’s approximate trading volume in July, the lowest level since November 2020. The largest cryptocurrency by market cap has also seen five year volatility lows, with Bloomberg noting that “the digital currency’s five-day volatility [is] sitting below that of the S&P 500, tech stocks and gold.”\n\n$225 million\n\nDollar value of crypto raised for Ukraine since March 2022, according to a report from Crystal Blockchain. Roughly $134 million supported humanitarian needs while the remainder went to military defense. In the early days of the conflict, crypto was a crucial lifeline for many Ukrainians.\n\n$1.2 million\n\nTotal price of a 500-piece generative art NFT collection (Vera Molnár’s “Themes and Variations”) that sold out in less than an hour at a Sotheby’s auction. The July 26 event marked the debut of Sotheby’s new Gen Art Program — focusing on algorithmically generated artworks.\n\n422,000\n\nNumber of Bitcoin Ordinals that were added to Bitcoin’s blockchain on Sunday, the highest daily inscription volume since Ordinals were introduced in January — despite sales volumes that cooled nearly 50% from June levels. Ordinals are essentially NFTs for the Bitcoin blockchain — users can “inscribe” audio, images, text, or other data onto a single satoshi, which is the smallest denomination of a BTC.\n\nTOKEN TRIVIA\n\nWhat is proof of stake?\n\nA A way to verify data shared from another computer\n\nB A major consensus mechanism used by cryptocurrencies to verify new transactions, add them to the blockchain, and create new tokens\n\nC Identification cards for vampire hunters\n\nD The process by which networks of mining computers generate new bitcoin\n\nFind the answer below.\n\nTrivia Answer"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY2EubmV3cy55YWhvby5jb20vc29sYW5hLWJhc2VkLW5mdC1tYXJrZXRwbGFjZS1leGNoYW5nZS0xMzAwMDAwMjkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Solana-Based NFT Marketplace Exchange.art to Expand Into Ethereum - Yahoo News Canada",
        "content": "Exchange.art, the popular Solana-based digital art marketplace, is soon taking its platform multichain and integrating support for Ethereum.\n\nThe integration will go live on August 1 with more than 80 Ethereum-based artists including Sotheby’s “Glitch Art” sale artist Patrick Amadon and creator Amber Vittoria.\n\nAccording to data from analytics platform CryptoSlam!, Ethereum's non-fungible token (NFT) trading volume takes first place at $10.2 million in the past 24 hours, while Solana trails behind in second place with just over $920,000. Larisa Barbu, COO of Exchange.art told CoinDesk that Exchange.art always had the plan to expand beyond Solana, and aims to onboarding new creators and collectors in doing so.\n\n“The vision of Exchange.art is to be a hub for digital art and then slowly, build out solutions for traditional art as well,” said Barbu. “So because that's the vision, and that's where we aim to go…being multichain is just kind of the next step in this direction.”\n\nShe also added that many artists struggle to sell their work across different ecosystems and marketplaces, and doing so on Exchange.art helps them leverage the two largest NFT ecosystems in one place.\n\n“[Artists] would very much prefer to actually maintain only one platform and one community, instead of [always] juggling between two or three platforms, two or three communities, always updating information between the three of them, communicating with people on all of those platforms, and so on.” said Barbu. “It was actually a decision that we took because we had demand for it, from an artist perspective – and it will help quite a lot of artists.”\n\nAfter releasing in 2021, Exchange.art has onboarded 16,000 Solana-based artists, helping them earn a collective $13 million in sales. With a mission to stand by artists in a time of uncertainty around royalty payments, Exchange.art introduced a royalties protection standard to help creators earn a consistent percentage across marketplaces. In March, Exchange.art released Code Canvas, a derivative platform to help Solana-based creators mint generative art NFT collections.\n\nAdditionally, Exchange.art isn’t the first Solana-based NFT marketplace to introduce Ethereum. In August, Solana-based NFT marketplace Magic Eden integrated Ethereum to make its ecosystem multi-chain."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYml0Y29pbmtlLmlvLzIwMjMvMDcvbWFyYS1sYXVuY2hlcy1sYXllci0yLXRlc3RuZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Mara Launches Testnet as it Transitions into Mara Chain, an Ethereum Layer 2 Blockchain - bitcoinke.io",
        "content": "Mara, the Africa focused crypto startup, has announced the launch of its testnet for its highly anticipated Ethereum layer 2 chain, Mara Chain.\n\nAccording to Mara, this innovative network is designed as an Ethereum-compatible layer 2 network and utilizes MARA tokens for transaction fees.\n\nForked from Optimism, another Ethereum L2, the Mara Chain is expected to bring attractive advantages such as remarkably fast transaction speeds, economically friendly gas fees, and effortless compatibility with other networks based on Optimism technology.\n\nThe launch of the Mara Chain network comes right after the recent introduction of the Mara Wallet. The Mara Wallet provides users with the ability to trade and withdraw both fiat currencies and the Mara token.\n\nThe introduced Mara testnet serves as a platform for developers to conduct comprehensive testing of their applications and the blockchain itself, aiming to identify and resolve any potential bugs or issues before its official launch. It includes the Mara Block Testnet Explorer, described as a powerful tool that allows you to explore and interact with the Mara blockchain.\n\nTo connect to the testnet, users need to do so using Ethereum wallets like MetaMask. According to Mara, the fastest way to add the Mara Network to your MetaMask is to visit the Mara Landing page and then click ‘Add Chain to MetaMask.’\n\nMara, which reportedly laid off 85% of its workforce recently, is proactively seeking feedback from the developer community and its partners, emphasizing its commitment to continuous improvement and the establishment of a thriving ecosystem.\n\n“By actively engaging with users, Mara aims to strengthen collaboration and create a supportive ecosystem that nurtures the growth of blockchain applications,” a Mara chain representative shared in the report. “There are tangible rewards, bounty grants and development grants for those who work to advance and enhance the capabilities of the Mara Chain.”\n\nMara raised $23 million in May 2022 and announced they are the official crypto partner of the Central African Republic and an adviser to the president on crypto strategy and planning.\n\nFollow us on Twitter for the latest posts and updates\n\n______________________________________\n\n______________________________________"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lcmMtMjAtaW52ZW50b3ItZGlzY3Vzc2VzLW9yaWdpbnMtbmV3LWJsb2NrY2hhaW5zLWJyYy0yMNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "ERC-20 inventor discusses origins, new blockchains, BRC-20 and more - Cointelegraph",
        "content": "In 2018, Ethereum lead developer Fabian Vogelsteller contacted the community for a new standard for smart contracts he created alongside co-founder Vitalik Buterin. Dubbed ERC-20, Vogelsteller, at the time, only wished for input regarding the novel idea. Little did he know that ERC-20 would ignite a wave of initial coin offerings (ICOs) shortly after its inception to become the industry gold standard for issuing tokens on the Ethereum blockchain.\n\nJust as ERC-20 tokens were gaining traction, Vogelsteller left the Ethereum Foundation the same year to focus on developing a new blockchain, Lukso. In an interview with Cointelegraph, the ERC-20 inventor discussed his motivation for creating his multiverse blockchain, as well as the latest token standard developments in the sector.\n\nLet’s pump that creator economy they are currently rekt. pic.twitter.com/tIGiGjTpYn — Fabian Vogelsteller (@feindura) July 20, 2023\n\nCointelegraph: Currently, ERC-20 is the gold token standard in the ecosystem. But in 2018, you left Ethereum to develop Lukso. What was the motivation behind that?\n\nFabian Vogelsteller: The human story behind it is that Marjorie [who is also Lukso’s co-founder], my wife at the time, had an idea of creating a blockchain for lifestyle and fashion. And I thought that’s a great idea. So, the story evolved to create a blockchain specifically focused on more mainstream use cases, such as for lifestyle, fashion designers, social media, content creators and YouTubers. Anything that's more like what the internet users today would use rather than the token, finance or DeFi world.\n\nCT: What inspired you to create the ERC-20 standard?\n\nFV: I proposed the ERC-20 standard based on a concept from Vitalik. We discussed this, and it became the first smart contract standard. I called it an Ethereum Request for Comment because I just wanted to have comments. And I thought we’d issue a number randomly, like 20. This was never really thought out. So everything was just us going with the flow and figuring out how we use this stuff.\n\nCT: How does the traction currently look for Lukso?\n\nFV: Basically, we built out this smart contract account completely over the last five or six years. On May 23, we launched a mainnet that’s exactly like Ethereum. It’s the same tech and the same consensus algorithm. We started with 10,300 validator keys that are only community members. Now, the network has been running for one and a half months, and we have around 23,000 validators and growing.\n\nCT: So, if it’s so similar to Ethereum, what was your rationale for spending all these years to create your own blockchain instead of just launching it as a layer-1 or layer-2 on Ethereum?\n\nFV: There are multiple reasons. Number one, we are trying to attract a new crowd, a new group of people, a new ecosystem — an ecosystem that doesn’t currently exist — to create our economy.\n\nBut the main reason is to get people to adopt these new building blocks. You could never do this on Ethereum. If I would go and propose an ERC and say, \"Here’s a super smart contract account system,\" everyone will say we have ERC-20 already. You know, nobody would do anything; nobody would adopt this.\n\nAnd the other thing is when you are proposing a base account, you have the problem that you need to pay for the deployment for users, and they also need to pay gas fees. In order to solve this problem, we basically create a new chain to subsidize early users.\n\nCT: Another token standard that’s getting very popular recently is BRC-20 tokens. What are your thoughts on the future of Bitcoin or Inscriptions and Ordinals?\n\nFV: The fact that it’s called BRC-20 makes it already a joke. Obviously, he [the developer] means that as a joke. It’s good if people like us to create new standards. That said, Bitcoin is extremely limited; it’s not a generic programmable blockchain, and it’s slow. I stopped using Bitcoin in 2014 because it’s just slow and outdated.\n\nCT: You’ve been focusing your attention on Lukso for nearly six years now. How are you guys doing in terms of the runway?\n\nFV: We did an ICO in 2019-2020, [and it] kind of kicked off the ICO wave. I made something called a reversible ICO. What we did is that people had eight months to buy LYX tokens with refunds. So, for example, after four months, if they realize, “Oh, Fabian is an idiot, and this project is shit,\" they could have gotten their money back. Out of the 42 million LYX in circulation, the foundation holds about 26% of it. We are building everything from the LYX we have. And we are operating from that.\n\nFabian Vogelsteller (center). Source: Fabian Vogelsteller on Twitter\n\nMagazine: ‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC81LWNyeXB0b3MtdG8tZm9sbG93LXJpcHBsZXMtdmljdG9yeS1iaXRjb2luLWJ0Yy1ldGhlcmV1bS1ldGgtYmluYW5jZS1jb2luLWJuYi1kaWdpdG9hZHMtdG9hZHMtY2FyZGFuby1hZGEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "5 Cryptos to Follow Ripple's Victory: Bitcoin (BTC), Ethereum (ETH), Binance Coin (BNB) DigiToads (TOADS), Cardano ... - Analytics Insight",
        "content": "The favorable decision in the Ripple vs SEC legal case has renewed bulls’ energy in the crypto market. Following Ripple’s victory, several cryptocurrencies, including Bitcoin (BTC), Ethereum (ETH), Binance Coin (BNB), DigiToads (TOADS), and Cardano (ADA), have joined the rally. Here are the latest market updates about the best cryptos to buy now.\n\nDigiToads Presale Records a New High\n\nAmidst the market excitement, DigiToads (TOADS) has achieved a significant milestone with its presale reaching new heights. Currently in its ninth stage, the project has raised over $6.2 million, demonstrating strong growth potential.\n\nDigiToads created a buzz in the meme coin, offering a captivating play-to-earn gaming experience that combines blockchain technology, stake-to-earn features, and a highly competitive environment for traders, gamers, and investors.\n\nGamers are attracted by the unique Swamp where they engage in battles with NFT-backed digital toads, and can also join gaming competitions to earn TOADS tokens. At the same time, the ecosystem offers unique income-generation avenues for TOADS holders, who not only receive monthly airdrops but can also buy and stake NFTs to receive passive income.\n\nThe DigiToads community has grown rapidly, driven by gaming enthusiasts, crypto investors, and individuals seeking unique opportunities for wealth generation. Hence, the presale success reflects the growing interest in DigiToads and its potential for substantial growth as it redefines the meme coin market by providing real value and use cases. Renewed Interest in Bitcoin\n\nBitcoin (BTC), the oldest and most renowned cryptocurrency, has experienced a resurgence of interest following Ripple’s win but has since cooled off as it currently hovers just below $30,000. Yet, this marked a yearly peak for the oldest crypto on the market.\n\nThanks to Ripple’s win, investors demonstrated renewed confidence, but there are new developments that could pave the way for a new bull run. While BTC lacks DigiToads’ potential for tremendous growth as it is already a mature crypto, it remains a prominent contender in the space and could surge above $30,000 if the SEC approves BlackRock’s spot BTC ETF.\n\nEthereum Jumps After Ripple’s Win\n\nRipple’s victory hasn’t failed to touch Ethereum, either. The second leading cryptocurrency jumped above $2,000 in the aftermath of the court’s ruling. This is because ETH is one of the many other assets the SEC alleged were securities, so the win for XRP renewed optimism for ETH as well.\n\nYet, Ethereum is trading sideways at press time, but there are some bullish signs. For instance, ETH staking has broken a new record, registering 24 million staked ETH, which means 20% of the total supply.\n\nBinance Coin Could Reach New Highs After This Feature\n\nBinance, the largest crypto exchange in the world, is on track to potential gains after announcing a new feature that allows individuals to use multiple deposit addresses for a network. It will be available for ERC20 coins (tokens on the Ethereum network) and alternative ones, such as BNB smart chain, but the feature will be developed to include more blockchains in the future.\n\nCardano Capitalizes on Ripple’s Victory\n\nCardano (ADA) emerged as one of the biggest gainers following Ripple’s legal victory, driven by renewed hope among investors that ADA will also be exempt from SEC threats due to the SEC’s loss against XRP. As investors seek to benefit from the ongoing crypto rally, holding onto ADA may be an attractive option, as the coin has the potential to establish new support levels. Summary\n\nThe favorable outcome of the Ripple vs SEC case has revitalized the crypto market, leading to a rally in various coins. The ongoing developments in these cryptocurrencies indicate an evolving landscape with new opportunities for investors to explore.\n\nWhile Bitcoin, Ethereum, Binance Coin, and Cardano have each seen positive price movements, DigiToads stands out as the best DeFi crypto with its unique play-to-earn gaming concept and potential for significant growth.\n\nVisit DigiToads Presale\n\nMint DigiToads NFTs Here\n\nBuy DigiToads NFTs on OpenSea\n\nJoin the community\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vYml0Y29pbmlzdC5jb20vY21lLWdyb3VwLWV0aGVyZXVtLWJpdGNvaW4taGFsdmluZy_SAT5odHRwczovL2JpdGNvaW5pc3QuY29tL2NtZS1ncm91cC1ldGhlcmV1bS1iaXRjb2luLWhhbHZpbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "CME Group: Ethereum To Outperform Bitcoin After Halving? - Bitcoinist",
        "content": "The Chicago Mercantile Exchange (CME) Group, which operates a derivatives marketplace, published a report on July 26 discussing the potential dynamics between Bitcoin and Ethereum in the context of the upcoming 2024 halving event.\n\nAccording to the report’s author, Erik Norland, who serves as CME Group’s senior economist, Ethereum might outperform Bitcoin even if BTC rallies after its halving. This event cuts its issuance in half.\n\nEthereum And Bitcoin Correlation Before Halving\n\nThe CME Group is analyzing the correlation between Bitcoin and Ethereum months before halving, an event whose ripple effects would likely be felt across the market considering Bitcoin’s capitalization and status. Historically, Bitcoin halving events have supported BTC prices while also lifting altcoins in the process.\n\nBitcoin has been, in recent years, moving independently and emerging as a distinctive asset class, its high correlation with altcoins, especially legacy coins like Ethereum, has seen its expansion drive altcoins even higher. A recent report reveals that Bitcoin’s correlation with Nasdaq was at a 2-year low.\n\nThe report recognizes the correlation between Ethereum and Bitcoin and how the ETHBTC pair has moved over the years. However, Norland mentions other possible triggers of a Bitcoin bull run that could impact the ETHBTC pair and influence ETH’s valuation, possibly forcing Ethereum to outperform Bitcoin in 2024.\n\nTop of the list, he says, are the effects of the ongoing war between Russia and Ukraine which could increase Bitcoin’s demand, driving prices higher. Besides, the report highlights the unexpected impact of events like the collapse of regional banks, as it did happen in March 2023, which temporarily boosted prices for Bitcoin and Ethereum, as factors to watch out for.\n\n\n\nThe possibility of a Bitcoin rally is on the table, looking at past price performances. Nonetheless, the report acknowledges the case of these predictions and potentially influential factors being wrong.\n\nThis is considering the level of market maturation over the last four years. Moreover, while past halvings have seen price surges in Bitcoin, there is no guarantee that historical patterns will be repeated.\n\nMacroeconomic Factors And Interest Rates\n\nExploring macroeconomic factors, including central banks’ monetary policies, and their impact on Bitcoin and Ethereum, Norland said central banks would play a critical role going forward. On July 26, the Federal Reserve increased interest rates after an initial pause, forcing Bitcoin prices higher. Prices are now edging lower when writing, trending towards $30,000.\n\nLooking back, in 2020, central banks reduced rates and engaged in quantitative easing, pumping ETH and BTC prices to all-time highs. However, as inflation took root in 2021, central banks adjusted their policies and hiked rates, triggering a crypto winter from which most coins, including Ethereum, have yet to recover from fully.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vZ29vZ2xlLWJhcmQtcHJlZGljdHMtd2hhdC13aWxsLWJlLWV0aGVyZXVtLXByaWNlLWluLXN1bW1lci0yMDI0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Google Bard predicts what will be Ethereum price in summer 2024 - Finbold - Finance in Bold",
        "content": "Not long after OpenAI made its text-based artificial intelligence (AI) tool ChatGPT available to the public, a slew of other generative AI platforms came into being, including Google’s Bard, which has proven to be a valuable assistant in researching the cryptocurrency sector, including Ethereum (ETH).\n\nIndeed, as the price of Ethereum continued to follow the majority of assets in the crypto sector in trading largely sideways in the past several days, Finbold sought Bard’s insights into the future price of the second-largest cryptocurrency by market capitalization in the summer of 2024 from a viewpoint as of July 26.\n\nFrom $2,460 to $5,230\n\nSpecifically, after warning it is difficult to predict the price of ETH precisely, Bard shared several predictions, including that Ethereum could reach $2,458.15 in June 2024 and $2,519.15 in July 2024 “based on the assumption that the Ethereum ecosystem will continue to grow and develop, and that there will be increased demand for ETH.”\n\nETH price predictions. Source: Google Bard\n\nFurthermore, the tool listed some of the more bullish projections, particularly by AmbCrypto, according to which the token could hit $2,630.22 in June 2024 and $2,695.49 in July 2024, “based on the assumption that Ethereum will become the dominant platform for decentralized applications (dApps).”\n\nAccording to DigitalCoinPrice’s projections shared by Bard, $2,193.43 in June 2024 and $2,342.81 in July 2024 could be in play for Ethereum, or even $4,868.52 in June 2024 and $5,231.32 in July 2024, if the forecast by Gov Capital turns out correct.\n\nFinally, Bard stated:\n\n“Of course, it is important to remember that these are just predictions. The actual price of Ethereum in 2024 will depend on a number of factors, including the overall performance of the cryptocurrency market, the development of the Ethereum ecosystem, and global economic conditions.”\n\nEthereum price analysis\n\nMeanwhile, Ethereum was at press time trading at the price of 1,855.84, showing a very modest increase of 0.03% in the last 24 hours but still dropping 2.70% across the previous seven days and losing 1.26% to its value on the monthly chart.\n\nEthereum 30-day price chart. Source: Finbold\n\nAll things considered, as Bard pointed out, whether Ethereum truly manages to hit one of the above figures will depend on lots of factors, ranging from those closely related to the crypto asset itself to the more general conditions on the wider crypto and macro scene.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNy8yNi9ldGMtcHJpY2UtcHJlZGljdGlvbi13aWxsLWV0aGVyZXVtLWNsYXNzaWMtYnJlYWstYWJvdmUtMjAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "ETC Price Prediction: Will Ethereum Classic Break Above $20? - The Coin Republic",
        "content": "Ethereum Classic (ETC) is a smart contract network split from Ethereum (ETH) in July 2016. It hosts and supports decentralized applications (DApps). Ethereum Classic wanted to keep the original Ethereum blockchain after a hack stole 3.6 million ETH. Ethereum Classic and Ethereum have different technical goals and paths.\n\nThe Ethereum Classic price is currently trading at $18.05, with a decline of 0.04% in the past 24 hours. Ethereum Classic holds a total market cap of $2.56 Billion and ranks 29th in the crypto market.\n\nETC token has a trading volume of $99.19 Million, with a decline of 27.18% over the past 24 hours. It has over 142.17 Million tokens in circulating supply. The volume-to-market cap ratio of the Ethereum Classic coin is 3.86% indicating low volatility in the market.\n\nEthereum Classic Price Prediction Using Price Action Strategy\n\nSource: ETC/USD By TradingView\n\nEthereum Classic price analysis reveals that the ETC token surged nearly 180% in July 2022, breaking above the previous swing high. After that, the price declined and went into a correction phase, forming a descending triangle pattern with resistance from an upper trendline and support from a horizontal demand zone.\n\nRecently, the price bounced back from the demand zone with a rise in volume but could not break above the trendline resistance and got detained. Currently, the price is consolidating near the trendline resistance.\n\n\n\nNow, If the price can sustain above the trendline resistance, it may result in a trend change from the correction phase to an advancement phase. This may attract buyers and push the price higher.\n\nETC Price Forecast from Indicators’ point of view\n\nSource: ETC/USD By TradingView\n\nAs per the EMA analysis, the ETC price suffered rejection from the 200 EMA. Currently, the price tried to sustain above 50 EMA but suffered rejection indicating bearish sentiment prevailing in the short term.\n\nAt the time of publishing, the RSI value of the ETC token is 44.18, and that of the SMA line is 50.11. RSI has gone flat, showing a neutral bias in the market for now.\n\nMACD lines have made a bearish crossover. Also, Histogram bars are being formed below the mean line with increasing height, indicating a negative sentiment being built in the market for now.\n\nConclusion\n\nEthereum Classic price prediction shows that the price has undergone a correction phase after a surge of nearly 180% in July 2022 and formed a descending triangle pattern. Recently, the price hiked nearly 40% after getting support from the demand zone. But could not break above the trendline resistance and is consolidated. Now, if the price can break and sustain above the trendline resistance, then it may surge higher.\n\nTechnical Levels\n\nSupport levels: $14.1 and $10.3.\n\nResistance levels: $26.9 and $34.7.\n\nDisclaimer\n\nThe views and opinions stated by the author, or any people named in this article, are for informational purposes only and do not establish financial, investment, or other advice. Investing in or trading crypto or stock comes with a risk of financial loss."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDcvMjUvcmV2ZW51ZS1hbmFseXNpcy1ldGhlcmV1bS10cm9uLXRoYW5rcy1wZXBlLWNyeXB0by_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Revenue analysis of L1 blockchains: Ethereum and Tron dominate volumes thanks to crypto Pepe - The Cryptonomist",
        "content": "In the second quarter of 2023, the memecoin mania unleashed by the PEPE crypto led the layer1s Ethereum and Tron to record a surge in volumes and revenue, up sharply from the previous quarter.\n\nEspecially in May, Ethereum validators thanked crypto frog Pepe for creating the conditions for stellar revenues.\n\nLet’s look at all the details together.\n\nEthereum and Tron top the list of most profitable L1s: Pepe crypto triggers volume boom\n\nBlockchain research firm Messari highlighted how the memecoin mania triggered by the advent of the PEPE crypto created many benefits for Ethereum and Tron infrastructures during Q2 2023\n\nThe two blockchain networks saw their respective revenues increase especially during May, propelled by the large volumes generated on the DeFi platforms.\n\nOverall, revenue from Ethereum and Tron validators reached 93% of all L1 industry revenue in the second quarter.\n\nThe amount of net fees recorded on Vitalik Buterin‘s chain grew 83% on a QoQ basis, peaking at $32 million on 5 May, at the height of the hype caused by the Pepe crypto.\n\nIn the four-month reporting period, competitors BNB Chain, Polygon, Avalanche and the other smaller chains achieved a total gain of $74 million, 11 times less than that of Ethereum.\n\nAlso very interesting to note is that over the weekend of 6-7 May, the profits of validators reached 3,006.78 ETH, amounting to a counter value of $5.6 million, almost equal to what was recorded when the FTX exchange collapsed.\n\nThe flashboats dashboard shows how the gain was boosted enormously by MEV-boost payments, which in November 2022, during the exchange crash, came to 2,505.69 ETH, for a combined validators’ revenue of 3,929.68 ETH ($6.1 million).\n\nIn all of this, insiders validating transactions on the two networks thanked Pepe and the traders who traded it relentlessly on DEXs like Uniswap.\n\nIt is amazing to observe how the trend of a memecoin like the Pepe crypto has created such fertile ground that Tron and Ethereum have been able to achieve these numbers.\n\nAlso noteworthy is how during 6-7 May, about 600 ETH were burned through the memecoin, which is more than Coinbase, Optimism, or Blur generated individually.\n\nMeme coins generating nice revenue for Ethereum.\n\n\n\nAround $1.1m of eth burnt this week for Pepe alone. pic.twitter.com/JWpg1KLtGX — Elie Steinbock (@elie2222) May 7, 2023\n\nThe general situation in the DeFi world\n\nLet’s now try to broaden the horizon of analysis by looking at the overall situation of DeFi and the revenue it has generated so far, without focusing too much on Pepe or the individual Ethereum and Tron chains.\n\nIt is worth recalling that the decentralized finance sector, unlike the centralized counterpart run by cryptocurrency exchanges, is much younger and with a reduced history that sees the first results coming only in late 2020.\n\nIn just a few years, DeFi has grown a lot, both in terms of technologies and decentralized applications that can make sense of this industry, and in terms of volumes and revenue generated.\n\nCurrently the cumulative revenue of this financial environment is at $957 million, poised to reach the round figure of $1 billion by the end of the year.\n\nIts success stems not from the advent of crypto memes like Pepe, but from the enthusiasm of libertarian movements and new generations who do not want to delegate ownership of their crypto assets to third-party infrastructures and prefer self custody and decentralized exchanges on chains like Ethereum and Tron.\n\nThen again, if we think about it, it is absurd to think that Bitcoin and all other cryptocurrencies were born at the time to avoid financial intermediary situations, and then the same conditions with the spread of CEXs allowed the early years development of the industry.\n\nDeFi basically aims to offer a world where financial services are untethered from central entities, in which users can preserve their privacy without offering their personal data to the first competitor.\n\nUnfortunately, however, the market share of decentralized finance compared to CEXs is still very low with a value that currently stands at about 4%.\n\nAs for the most popular and most profitable protocols that populate the DeFi world we can mention the performance of Lido, Uniswap and MakerDAO, which generated fees of $52.18 mln $36.28 mln and $9.47mln in the last 30 days, respectively.\n\nThis is followed by projects such as Convex Finance, Aave, Gmx, Maestro, Blur, and Synthetix.\n\nIt is obvious how the Uniswap and Lido protocols represent the main benchmarks across the industry, with a respective TVL of $3.78bn and $14.67bn."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMisAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vY3J5cHRvLWJ1bGwtcnVuLWd1aWRlLXRvLXRoZS1iaWdnZXN0LWNyeXB0by1idWxsLXJ1bi1wcmVkaWN0aW9ucy1hbmFseXppbmctYml0Y29pbi1hcGVtYXgtZXRoZXJldW0tc29sYW5hLWNhcmRhbm8tcmlwcGxlLWFuZC1jcnlwdG9jdXJyZW5jaWVzL9IBtgFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vY3J5cHRvLWJ1bGwtcnVuLWd1aWRlLXRvLXRoZS1iaWdnZXN0LWNyeXB0by1idWxsLXJ1bi1wcmVkaWN0aW9ucy1hbmFseXppbmctYml0Y29pbi1hcGVtYXgtZXRoZXJldW0tc29sYW5hLWNhcmRhbm8tcmlwcGxlLWFuZC1jcnlwdG9jdXJyZW5jaWVzLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Crypto Bull Run Guide To The Biggest Crypto Bull Run Predictions | Analyzing Bitcoin, ApeMax, Ethereum, Solana, Cardano, Ripple, and Cryptocurrencies - Crypto News Flash",
        "content": "Welcome to the comprehensive guide on the biggest crypto bull run predictions. This well-researched and in-depth analysis looks into the exciting world of cryptocurrency bull runs, covering top contenders like Bitcoin, Ethereum, Solana, Cardano, Ripple, and the new exciting coin ApeMax. Get ready to explore the crypto market as we discuss and dissect some of the latest predictions and insights, and answer essential questions to help you navigate this exhilarating journey. Whether you are a seasoned crypto veteran or a newcomer to the crypto space, this guide discusses news and events surrounding the crypto bull run phenomenon.\n\nList of the Biggest Crypto Predictions\n\nOver the past few months and years, some cryptocurrency analysts have discussed the following topics:\n\nThe convergence of crypto, AI, and the metaverse creates potential for innovation in the crypto space, offering exciting new opportunities and utility.\n\nApeMax staking may emerge as an exciting contender with its innovative tokenomics and boost-to-earn staking model.\n\nMaturation of crypto infrastructure empowers decentralized applications (dApps) to thrive, attracting genuine users and driving further use cases.\n\nBitcoin’s upcoming halving event in April 2024 may trigger reduced supply, historically correlating with potential bull market conditions.\n\nThe final stages of Ethereum 2.0 upgrade by the end of 2023 could lead to improved scalability which could possibly have an impact on the overall crypto market.\n\nWhat is ApeMax?\n\nApeMax is an emerging cryptocurrency that has garnered growing attention within the crypto community. This unique digital token has introduced an innovative tokenomics model, featuring boost-to-earn staking, making it an intriguing option for eligible buyers looking for innovative new coins.\n\nWhy ApeMax?\n\nThere are several compelling reasons why eligible buyers might consider ApeMax.\n\nFirstly, the innovative boost-to-earn staking mechanism allows holders to take part in boost-to-earn staking and potentially earn rewards, creating a dynamic and engaging experience.\n\nSecondly, ApeMax’s unique tokenomics model, sets it apart from other cryptocurrencies in the market.\n\nAdditionally, early buyers have the opportunity to participate in the ApeMax presale , which allows them to secure tokens at presale prices.\n\nHowever, it is crucial to exercise due diligence, assess personal risk tolerance, and carefully consider one’s own goals before making any crypto decisions.\n\nWhat is the ApeMax presale?\n\nThe ApeMax presale represents an exciting opportunity for eligible buyers to acquire ApeMax tokens. During the presale phase, a limited number of tokens are offered for sale at presale prices. ApeMax’s fun features such as the boost-to-earn staking work even during the presale phase, and buyers get instant access to their coins as soon as they purchase them. All of this makes ApeMax stand out compared to other new coins in the space today.\n\nHow to know if crypto bull run is coming?\n\nPredicting the timing of a crypto bull run is a challenging task, as it involves numerous unpredictable factors that influence the market. However, there are some potential indicators that crypto analysts and investors have historically studied to gauge the likelihood of past bull markets. Increased trading activity and rising trading volumes, along with positive sentiment in the crypto community, have been past early signs of a potential bull run. Moreover, institutional interest and investment in cryptocurrencies could signal growing confidence in the market and contribute to a potential upswing in prices. However, it is essential to approach such predictions with skepticism, as the crypto market is highly volatile, unpredictable, and subject to rapid changes. One should always exercise caution, conduct thorough research, and understand the risks before making any crypto related decisions.\n\nWhat is the bitcoin halving event?\n\nThe bitcoin halving event is a crucial aspect of the Bitcoin protocol that occurs approximately every four years. During this event, the block reward for miners is halved, reducing the number of new bitcoins entering circulation. Historically, Bitcoin halving events have been associated with significant price increases, as the reduced supply creates a scarcity effect. With a fixed supply of 21 million bitcoins, the halving event leads to a decrease in the rate of new bitcoin creation, potentially impacting supply. While historical patterns suggest bullish trends around halving events, it is important to note that past performance and historical trends are not indicative of future results. The crypto market is highly uncertain, and price movements are influenced by various factors, including market sentiment, adoption rates, macroeconomic conditions, and many other unpredictable factors.\n\nWhat will be the price of Bitcoin in 2030?\n\nAttempting to predict the price of Bitcoin or any other cryptocurrency in 2030 involves a significant degree of speculation, as it depends on multiple factors that are challenging to forecast accurately. Bitcoin’s future price will be influenced by factors such as adoption rates, regulatory developments, macroeconomic trends, and technological advancements in the crypto space. While some analysts and enthusiasts may make long-term predictions based on current market conditions and historical trends, it is crucial to approach such forecasts with caution and skepticism. The crypto market is known for its volatility and unpredictability, and future developments can impact prices in unforeseen ways. Crypto buyers should focus on conducting thorough research and making decisions based on their individual goals and risk tolerance.\n\nBefore making decisions related to cryptocurrencies, thorough market research and independent due diligence are paramount. Take your time to conduct independent research, ask impartial experts for advice, and understand your own risk tolerance. Remember that cryptocurrencies are not for everyone, and they come with high risks and can be very volatile. Also, keep in mind that individuals from the United States, Canada, countries under sanctions, and other blocked countries are not eligible to purchase ApeMax tokens. For the full list of blocked countries, check the official ApeMax website.\n\nThis publication is sponsored. Crypto News Flash does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their own research before taking any actions related to cryptocurrencies. Crypto News Flash is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2xhY29zdGUtZW1icmFjZXMtdGhlLWZ1dHVyZS13aXRoLWV0aGVyZXVtLW5mdC1leGNsdXNpdmUtdmlydHVhbC1zdG9yZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Lacoste embraces the future with Ethereum NFT-exclusive virtual store - Cryptopolitan",
        "content": "Lacoste, the globally recognized fashion brand, has taken a significant step forward with the launch of a new virtual store for its summer collection. This innovative digital platform, developed in collaboration with retail technology developer Emperia, offers an immersive shopping experience that transcends the traditional retail model. The virtual store, accessible via Lacoste’s e-commerce platform, welcomes shoppers with an entrance shaped like the brand’s iconic crocodile. Inside, customers can explore a boutique filled with Lacoste’s summer collection and then ascend to an outdoor pool area with a beach view.\n\nEthereum NFT holders: A VIP experience\n\nLacoste’s virtual store offers an underwater VIP space, accessible exclusively to holders of Lacoste’s UNDW3 tokens on the Ethereum blockchain. This exclusive area showcases the UNDW3 apparel collection, a unique line co-created with Lacoste’s UNDW3 community members. Each item in this collection comes with a digital twin in the form of an NFT and an augmented reality feature. The VIP area also hosts an exclusive level of a scavenger hunt game, offering weekly prizes throughout the summer.\n\nFurthermore, Lacoste’s virtual store represents the brand’s progressive approach to e-commerce and customer engagement. By offering a unique retail experience that extends beyond its physical stores, Lacoste aims to foster a strong sense of community and enhance customer loyalty. The success of this initiative, which follows the brand’s award-winning holiday virtual experience in 2022, could inspire other brands to explore similar strategies, potentially leading to wider adoption of blockchain technology and NFTs in the retail sector.\n\n“Our ongoing work with Lacoste and its advanced view of e-commerce and customer loyalty has given birth to new technologies that yield an improved user journey which connects the dots between virtual and physical retail,” Emperia co-founder and CEO Olga Dogadkina\n\nThe launch of Lacoste’s virtual store marks a significant milestone in the integration of blockchain technology and NFTs into traditional retail. By offering unique benefits to Ethereum NFT holders, Lacoste is not only enriching its customer experience but also setting a precedent for the use of NFTs in the fashion industry. This initiative could potentially influence the broader retail landscape, prompting other brands to consider similar strategies. With this move, Lacoste is positioning itself at the forefront of this transformation, demonstrating a commitment to innovation and customer engagement."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMioQFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZWxvbi1tdXNrLXJlYnJhbmRpbmctb2YtdHdpdHRlci10by14LXNwYXJrcy1jcnlwdG8tcGF5bWVudC1zcGVjdWxhdGlvbi1mb3Itc29sYW5hLXNvbC1jYXJkYW5vLWFkYS1ldGhlcmV1bS1ldGgtYW5kLWJpdGNvaW4tYnRjL9IBpwFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZWxvbi1tdXNrLXJlYnJhbmRpbmctb2YtdHdpdHRlci10by14LXNwYXJrcy1jcnlwdG8tcGF5bWVudC1zcGVjdWxhdGlvbi1mb3Itc29sYW5hLXNvbC1jYXJkYW5vLWFkYS1ldGhlcmV1bS1ldGgtYW5kLWJpdGNvaW4tYnRjLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jul 2023 07:00:00 GMT",
        "title": "Elon Musk Rebranding of Twitter to X Sparks Crypto Payment Speculation for Solana (SOL), Cardano (ADA), Ethereum (ETH), and Bitcoin (BTC) - Crypto News Flash",
        "content": "Elon Musk’s interest in creating the ambitious “everything app” called “X” was evident even before he acquired Twitter in October 2022 for a staggering $44 billion.\n\nAt the time of writing, after Twitter’s official rebranding to X, Musk’s bio now includes a “D” resembling the DOGE logo.\n\nElon Musk’s rebranding of Twitter as X has sparked anticipation within the crypto industry, leading many to wonder if this move will pave the way for the adoption of cryptocurrencies as a payment method on the newly branded platform.\n\nElon Musk’s interest in creating the ambitious “everything app” called “X” was evident even before he acquired Twitter in October 2022 for a staggering $44 billion. He has further stated that if executed effectively, the X app, integrating various features from payments to shopping, could potentially encompass a significant portion of the global financial system.\n\nBy renaming Twitter as X, Musk reaffirms his long-standing commitment to creating an all-encompassing super app comparable to China’s WeChat, India’s PayTM, and Indonesia’s GoJek, which cater to diverse services and functionalities. The big question remains whether cryptocurrencies will play a crucial role in this transformative journey.\n\nTwitter’s new CEO, Linda Yaccarino, unveiled the company’s fresh logo and enthusiastically announced the arrival of “X!” in a recent post. In her earlier tweets, Yaccarino hinted at incorporating Artificial Intelligence into the new super app, emphasizing that “X” symbolizes the future of limitless interactivity, encompassing audio, video, messaging, payments, and banking. The ultimate goal is to establish a global marketplace where ideas, goods, services, and opportunities can thrive.\n\nExploring Potential Payment Tokens\n\nConsidering the Twitter owner’s close ties to the cryptocurrency industry, it is conceivable that crypto payments might find a place in the super app’s future. Elon Musk’s extensive involvement with the popular meme coin, DOGE, also suggests the possibility of cryptocurrencies playing a significant role in “X’s” payment system.\n\nWith Musk’s new move to revolutionize users’ financial transactions. Which tokens are likely to be the approved payment methods by X? At the top of the list, we can expect Bitcoin and Dogecoin, given their prominence and popularity. Other potential tokens include Ripple’s XRP and Stellar (XLM).\n\nDogecoin (DOGE)\n\nThis is the obvious token that Musk will integrate on ‘X.’ At the time of writing, after Twitter’s official rebranding to X, Musk’s bio now includes a “D” resembling the DOGE logo.\n\nAdditionally, Elon Musk is closely linked to Dogecoin, often regarded as the “father of DOGE” by the crypto community. Whenever Musk discusses, tweets about, or shares pictures of his Shiba Inu dog, the price of Dogecoin experiences a significant surge.\n\nIn addition to Dogecoin’s strong association with the Twitter CEO, the blockchain presents several compelling reasons why it could be a suitable payment platform for X. Firstly, its fast transaction time (33 TPS) and low fees make it a promising payment system. Secondly, its widespread popularity ensures high liquidity, facilitating easy buying and selling and appealing to X users who may require swift asset liquidation when necessary.\n\nBitcoin (BTC)\n\nDue to its popularity, widespread adoption, and status as the largest cryptocurrency by market capitalization, Bitcoin ranks as a preferred choice for those seeking to utilize it as a payment platform.\n\nAdditionally, X can utilize the Lightning Network, which operates on the Bitcoin blockchain and employs multi-signature wallets to establish off-chain payment channels. This implementation allows quicker transactions (1,000,000 TPS) at lower costs, enabling users to make transactions without waiting for block confirmations on the blockchain.\n\nRipple (XRP)\n\nRipple operates as a money transfer network tailored to meet the financial services industry’s requirements. XRP serves as the native cryptocurrency of the Ripple network. With its scalability at 1,500 transactions per second (TPS) and its eco-friendly characteristics that render it carbon-neutral and energy-efficient, XRP becomes a potential candidate for consideration by Musk.\n\nStellar Lumens (XLM)\n\nStellar may be a straightforward choice for Elon Musk due to its primary purpose of facilitating swift and dependable movement of financial resources at a minimal expense. Notably, each cross-border payment platform transaction requires only 0.00001 XLM (equivalent to $0.000014 at current rates).\n\nAdditionally, Stellar’s network can handle up to 4,000 transactions per second (TPS), with settlements occurring within 3 to 5 seconds, rendering it notably faster than numerous other blockchain platforms.\n\nEthereum (ETH)\n\nEthereum is the most extensively utilized blockchain platform globally, benefiting from its high demand and widespread adoption, contributing to its liquidity. This indicates a strong willingness among crypto users to continue using Ethereum.\n\nNevertheless, Ethereum’s transaction speeds of just 15 TPS and high gas fees might not position it as the preferred platform for Musk and X.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2Jsb2NremVpdC5jb20vZXRoZXJldW0tZXRoLXByaWNlLXByZWRpY3Rpb24tZm9sbG93aW5nLXNlY3MtZXhlbXB0aW9uLW9mLWV0aC1hcy1hLXNlY3VyaXR5LXRpbWUtdG8tYnV5LXV3ZXJ4LXdlcngtYW5kLXNob3J0LWV0aC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jul 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction Following SEC's Exemption of ETH as a Security; Time to Buy Uwerx (WERX) and ... - Blockzeit",
        "content": "The Securities and Exchange Commission, or SEC for short, recently declared Ethereum (ETH) to be a non-security, bringing relief to crypto investors.\n\nUwerx, a rising market player, has promise for those looking for fresh investment opportunities in line with this trend. Read on to know all about Uwerx and its exciting presale!\n\nEthereum (ETH) Roars Forward: Current Price and Price Prediction\n\nIn the face of recent market instability prompted by the SEC’s legal efforts against Binance, Ethereum (ETH) has shown resilience, dropping 3% in the last 24 hours.\n\nThis drop coincides with reports of increased staking activity, which reduces the circulating quantity of Ethereum (ETH).\n\nWith a daily volume of $9,994,027,714 and a live market capitalization of $223,019,565,321, Ethereum (ETH) is currently trading around $1,854, indicating its ability to survive the market hurdles posed by recent news.\n\nOur price prediction shows a positive curve for Ethereum (ETH). We expect a minor rebound to $1,900 in the next few weeks. This upward trend is expected to continue in the next months, with Ethereum (ETH) beating the $2,000 value mark.\n\nUwerx is a new platform that intends to shake up freelancing by offering freelancers and clients an open and affordable solution. Uwerx has a number of features and perks that distinguish it from standard freelance marketplaces such as Upwork and Fiverr.\n\nExciting Test Airdrop awaits as Uwerx presale reaches its climax on July 31st. The Uwerx team’s tokens have been locked for 9 months, and the project’s liquidity will be locked for 25 years after the presale ends, ensuring stability and investor confidence.\n\nUwerx’s Stage 5 presale offers WERX tokens at $0.041 per token with a generous 15% bonus on every purchase. Contracts will be renounced upon project readiness for centralized exchanges, leading to zero taxes and seamless access to a broader user base.\n\nUwerx disrupts the freelancing industry with a minimal platform transaction fee of only 1%, outshining competitors like Upwork and Fiverr. Uwerx unveiled the Uwerx Vault, empowering users to securely store WERX tokens and earn rewards based on platform variables through staking. Uwerx’s presale stages, 1 to 4, were completed remarkably quickly, setting new records and capturing the community’s attention.\n\nSolidProof and InterFi Network audits validate Uwerx’s transparency, security, and credibility commitment. CoinSniper listing achieved, while Uniswap listing scheduled for August 1st, expanding Uwerx’s reach and trading opportunities. Uwerx celebrates a growing community with over 8,500 sign-ups, 1,800 Twitter followers, and 2,091 Telegram members. Token allocations are adjusted based on presale speed and community feedback, demonstrating Uwerx’s responsiveness and inclusivity.\n\nAlpha platform release marks the beginning of Uwerx’s journey, with more exciting updates and features in the pipeline. Uwerx gears up for transitioning from the Alpha platform to Beta, aiming for enhanced functionalities and a seamless user experience.\n\nDetailed PDF update on the Alpha platform provides comprehensive guidance, covering sign-up, login, job creation, talent discovery, and more. User feedback is highly encouraged, with Uwerx eager to hear thoughts and suggestions at [email protected].\n\nTokens distributed after the presale will follow a 6-week vesting schedule, gradually unlocking benefits for holders. The vesting period unfolds over six weeks, with percentages increasing from 8% in Week 1 to 28% in Week 6, ensuring a balanced distribution.\n\nUwerx ignites optimism with price projections anticipating WERX tokens to reach $0.76 by Q3-Q4 2023 and soar to $1.99 by Q1-Q2 2024, fueling excitement and growth potential in the market.\n\nJoin Uwerx today, at $0.05245 before the price increase to $0.06294, where a 15% bonus on token purchase awaits:\n\nPresale: invest.uwerx.network\n\nTelegram: https://t.me/uwerx_network\n\nTwitter: https://twitter.com/uwerx_network\n\nWebsite: https://www.uwerx.network/"
    }
]