[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZXRmLXJhY2UtZ2V0cy1ob3R0ZXIv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1ldGYtcmFjZS1nZXRzLWhvdHRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Ethereum ETF Race Gets Hotter As SEC Receives 11 Filings In One Week - NewsBTC",
        "content": "The United States Securities and Exchange Commission (SEC) has been flooded with many applications for Ethereum (ETH) Exchange-Traded Funds (ETFs) in just one week. The applications currently stand at 12, with the latest addition coming from ProShares, a popular fund manager.\n\nThe platform filed four applications for Ether-based ETFs, including a dual Ether and Bitcoin futures strategy ETF, an Ether Strategy ETF, and a short Ether Strategy ETF.\n\nWill The SEC Approve An Ethereum Futures ETF?\n\nThe recent surge in applications started on the 28th of July this year after Volatility Shares filed its application. Ever since, other asset management companies, including ProShares, Roundhill Financial, Bitwise, Van Eck, and Grayscale Investment, have filled submissions, with some bringing multiple applications.\n\nThe most recent application, filed on August 3 by ProShares, proposes an equal-weight Bitcoin and Ether ETF to measure the performance of holding long positions in the nearest maturing monthly Ether and Bitcoin contracts.\n\nAccording to renowned Financial Expert at Bloomberg Intelligence, James Seyffart, ProShare filed four separate applications with the SEC. Bitwise also submitted three applications, while Grayscale Investments filed two applications.\n\nHowever, despite the growing optimism, it remains to be seen if the Securities and Exchange Commission will approve these filings. The SEC has never approved an ETF that tracks Ether Futures contracts, unlike Bitcoin Futures ETFs that have been around since October 2021.\n\nMany market experts have argued that these applications are a mere gamble by these asset management companies, who do not want to miss out on being the first Ethereum ETF in the United States.\n\nETH price holds steady above $1,830 amid ETF race | Source: ETHUSD on Tradingview.com\n\nThe likelihood of receiving the SEC’s approval remains slim as the regulatory body has never approved an Ethereum futures ETF filing. Add to the mix the consistent refusal of SEC’s Chair, Gary Gensler, consistent refusal to answer if the agency considers ETH a security. This has further compounded regulatory uncertainty around the network.\n\nIf none of the applications before the SEC get denied, the Ether ETFs will launch 75 days from their respective filing dates. Analysts expect the Volatility Shares ETF to lead the charge on 12th October.\n\nUnderstanding The Difference Between Futures And Spot ETF Products\n\nThe primary difference between futures and spot ETF products lies in the fact that while the former tracks the price of futures contracts, the latter requires the issuers to purchase the underlying assets. Spot ETFs are generally considered more valid since they require the fund manager to purchase and hold underlying assets.\n\nThe current spike in Ether-based applications comes amidst a wave of filings from leading asset management companies, including BlackRock, the world’s largest asset manager, among others. These companies are looking to offer the first spot in Bitcoin ETF in the US.\n\nInvestors and members of the crypto community remain expectant of the outcome of the SEC’s consideration of the applications lying before it. Whatever decision the agency takes is likely to affect the attractiveness and accessibility of crypto investments, especially for larger institutional investors.\n\nFeatured image from iStock, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wNS91cy1ldGhlcmV1bS1mdXR1cmVzLWV0Zi1oYXMtYS03NS1jaGFuY2Utb2YtYXBwcm92YWwtaW4tMjAyMy1hZnRlci1yZWNlbnQtZmxvb2Qtb2YtYXBwbGljYXRpb25zLWFuYWx5c3RzLWVzdGltYXRlL9IBlgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wNS91cy1ldGhlcmV1bS1mdXR1cmVzLWV0Zi1oYXMtYS03NS1jaGFuY2Utb2YtYXBwcm92YWwtaW4tMjAyMy1hZnRlci1yZWNlbnQtZmxvb2Qtb2YtYXBwbGljYXRpb25zLWFuYWx5c3RzLWVzdGltYXRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "US Ethereum Futures ETF Has a 75% Chance of Approval in 2023 After Recent Flood of Applications, Analysts Estimate - The Daily Hodl",
        "content": "A pair of Bloomberg exchange-traded fund (ETF) analysts think there’s a 75% chance an Ethereum (ETH) futures ETF gets approved in the US this year.\n\nJames Seyffart and Eric Balchunas say the odds of approval spiked amid a flood of Ethereum futures ETF application submissions to the U.S. Securities and Exchange Commission (SEC).\n\n“The odds of Ethereum futures ETFs hitting exchanges this year have risen dramatically to 75%, in our view, after a spurt of 12 applications to the SEC in recent days. The SEC appears to be changing its posture toward crypto, based on reports of its back-channel messaging to ETF issuers. Also, we believe the SEC would have a hard time in court defending the denial of Ethereum futures ETFs after approving standard and leveraged Bitcoin futures ETFs.”\n\nBalchunas predicts the SEC will approve an Ethereum futures ETF in October, two years after the approval of the first Bitcoin (BTC) futures ETF.\n\nNo US Bitcoin spot ETF applications have been greenlit thus far, though the crypto world eagerly awaits the SEC’s decision on a June application from BlackRock, the world’s largest asset manager.\n\nA spot Bitcoin ETF would give investors exposure to the crypto asset through a brokerage firm, much like commodities such as gold.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY29pbmdhcGUuY29tL2VkdWNhdGlvbi9ldGhlcmV1bS1pbXByb3ZlbWVudC1wcm9wb3NhbHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 05:11:04 GMT",
        "title": "What are Ethereum Improvement Proposals (EIPs)? - CoinGape",
        "content": "This article explains what are Ethereum Improvement Proposals (EIPs), their significance, and how they work in detail.\n\nEthereum is the most innovative blockchain that exists today. Backed by a strong team of developers, software engineers, and researchers, it constantly upgrades over time. But, have you ever wondered who is deciding and implementing these upgrades?\n\nA decision or a proposal to make a change to the network has to be agreed upon by the entire development community of Ethereum. Only then, they can put it into action. The Ethereum Improvement Proposals (EIPs) concept was introduced to make this process smooth. Let us help you understand everything about Ethereum Improvement Proposals (EIPs) in this article.\n\nWhat are Ethereum Improvement proposals (EIPs)?\n\nEthereum Improvement Proposals (EIPs) are standard potential changes, new features, or processes that improve the Ethereum ecosystem as a whole.\n\nThey were first introduced in October 2015 following the footsteps of the Bitcoin Improvement Protocols (BIPs) process, which itself followed Python Enhancement Proposals (PEPs). EIPs have all the information of an upgrade and act as a “source of truth” to the community.\n\nDecentralization is the core feature of Ethereum and hence anyone can suggest a change to the network. But, you must follow the guidelines included in EIP-1 to suggest a proposal. Till now, most of the EIP authors are application developers or protocol developers. And, EIP editors like Gavin Wood and Vitalik Buterin, review them, correct them, and format issues.\n\nSignificance of Ethereum Improvement Proposals (EIPs)\n\nWhether it’s the transition of Ethereum from a PoW network to a PoS network or the creation of non-fungible tokens, everything started with an EIP. They play a key role in every upgrade happening around the Ethereum network.\n\nSome of the top Ethereum Improvement Proposals that were already implemented are EIP-1559 (fee market change), EIP-20 (ERC-20 token standard), and EIP-721 (ERC-721 standard). The historical “The Merge” event was proposed by the EIP-3675. Similar to these, every upgrade happening on the network consists of a set of EIPs.\n\nEIPs allow the network to change, improve, and adapt to the increase in its usage. This makes Ethereum flexible and constantly updates to changes in the industry and meets changing demands of the users. By going through the review process by the whole community, EIPs make sure that these decisions are inclusive and accurate.\n\nTypes of Ethereum Improvement Proposals (EIPs)\n\nThere are 3 types of EIPs which we are going to discuss here.\n\nStandards Track EIP\n\nThe Standards Track EIPs change almost all of the Ethereum implementations. These proposals make changes directly to the Ethereum network protocol. They include changes in block or transaction validity rules, changes that affect the interoperability of Ethereum dApps, etc.\n\nStandards Track EIPs have 3 parts of implementation – a design document, an implementation, and an update to formal specification. Furthermore, we can categorize these EIPs into Core, Networking, Interface, and ERC proposals.\n\nMeta EIP\n\nUnlike Standards Track EIPs, Meta EIPs do not make direct changes to the Ethereum network protocol. These are more like procedures, guidelines, or changes in the decision-making process. We can also call them Process EIPs and these changes require community consensus as they are more than just recommendations.\n\nInformation EIP\n\nThese EIPs neither make changes to the network protocol nor require community consensus. These proposals suggest general guidelines or information to the Ethereum community. Members of the community and implementers can ignore informational EIPs or follow their advice based on their choice.\n\nHow are EIPs Processed?\n\nSimilar to how a law must pass some stages to be finally implemented, an EIP must also go through some stages. Every EIP must pass through the following steps.\n\nDraft – In this phase, the EIP is still in the hands of the author. Once it follows all the guidelines of proposing an EIP like having no errors, proper format, and making technical sense, it can now be submitted to the Ethereum repository on GitHub for review.\n\nIn this phase, the EIP is still in the hands of the author. Once it follows all the guidelines of proposing an EIP like having no errors, proper format, and making technical sense, it can now be submitted to the Ethereum repository on GitHub for review. Review – After being checked officially by an editor, the author can publish the EIP on GitHub. The next step is to mark the EIP as suitable for peer review. After passing through the early stages of review, the proposal needs a review by a wider public.\n\nAfter being checked officially by an editor, the author can publish the EIP on GitHub. The next step is to mark the EIP as suitable for peer review. After passing through the early stages of review, the proposal needs a review by a wider public. Last Call – Any EIP must at least be in the review stage for a minimum of 2 weeks so that the community has enough time to read, review, and suggest changes. In this stage, the proposals can be sent back and forth for changes by the author. If the EIP remains in this phase for more than 6 months, it will move to “stagnant.”\n\nAny EIP must at least be in the review stage for a minimum of 2 weeks so that the community has enough time to read, review, and suggest changes. In this stage, the proposals can be sent back and forth for changes by the author. If the EIP remains in this phase for more than 6 months, it will move to “stagnant.” Final stage – When the EIP clears all the stages of review, non-core EIPs reach the final standard. But, core EIPs need to go through another phase. The core development team will implement the approved proposal into the software to enable it.\n\nConclusion\n\nEthereum Improvement proposals (EIPs) are an important part of Ethereum’s development over the years. The network is still under various upgrades to improve the overall scalability. All of these upgrades started with EIPs and are now making huge changes to the network. Overall, EIPs bring flexibility and adaptability to Ethereum which are essential to increase its adoption.\n\nFAQs\n\nWhat is the most popular EIP?\n\nEIP-20, EIP-721, EIP-137, and EIP-1559 are popular EIPs. However, many EIPs exist today that are included in the upgrades of Ethereum.\n\nWhat is the purpose of EIPs?\n\nEthereum Improvement Proposals make changes to the network to make Ethereum better. They make the network flexible, efficient, and adaptable to the changing needs of users.\n\nWhat is the difference between EIP and ERC?"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vZGVjcnlwdC5jby8xNTE1MjgvbmZ0LXRyYWRlci1hZG1pdHMtbmFiYmluZy0xLTUtbWlsbGlvbi1pbi1ldGhlcmV1bS1hZnRlci1lbGl6YWItZXRoLWdldHMtcmVrdC1vbi1ibHVy0gF0aHR0cHM6Ly9kZWNyeXB0LmNvLzE1MTUyOC9uZnQtdHJhZGVyLWFkbWl0cy1uYWJiaW5nLTEtNS1taWxsaW9uLWluLWV0aGVyZXVtLWFmdGVyLWVsaXphYi1ldGgtZ2V0cy1yZWt0LW9uLWJsdXI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 07:00:00 GMT",
        "title": "NFT Trader Admits Nabbing $1.5 Million in Ethereum After ‘Elizab.eth’ Gets Rekt on Blur - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA series of transactions on the NFT marketplace Blur has captivated Crypto Twitter and sparked questions of legality after a prolific trader going by the name of Hanwe Chang duped a competitor into buying certain Azuki NFTs at an inflated price.\n\n“[I] noticed that someone's bot was copying my bids on Blur, so I decided to trick him,” Chang said on Twitter, adding he had made a profit of 800 Ethereum with the strategy, netting close to $1.5 million.\n\nA relative newcomer compared to NFT marketplaces like OpenSea and SuperRare, Blur surged ahead in terms of trading volume earlier this year due to gamified incentives that reward users with tokens based on trade-related activity.\n\nAD\n\nAD\n\nThis includes rewards for users that bid on NFTs by trait, a practice in which Chang has become established, according to Blur’s leaderboards. Profile picture NFTs, including those from Azuki, often have unique qualities that can impact their value based on rarity, like eye color or clothing.\n\nOn Saturday, 12 Azuki NFTs that shared the specific background color “Off White A” sold simultaneously for 50 Ethereum worth $91,500 each. The previous Azuki NFT with an “Off White A” background had sold for less than 5 Ethereum or around $9,000—making it a massive, eye-catching markup.\n\nThe 12 NFTs appear to have been gathered by Chang in a digital wallet. A large chunk of the trades’ profits was then sent to a wallet labeled as “hanwe.eth” using the Ethereum Name Service after they had been completed, according to Ethercan.\n\nKnowing there were bots out there copying his trait bids, Chang likely duped an unsuspecting trader into buying the Azuki NFTs at an elevated price by placing a bid on his own NFTs, an account that goes by A Raving Ape theorized on Twitter.\n\nContext on how @HanweChang executed a plan to perfection and made 800e by selling \"Off White A - Background color\" azuki at 50e each and azuki elementals at 15e each. This is an epic case of PvP in the current NFT trading market ⚔️ Hanwe has been coasting at the top spot of… pic.twitter.com/M8Ujm8CquJ — A-Raving-Ape.eth 🍌 (@a_raving_ape) August 5, 2023\n\nAD\n\nAD\n\nA Raving Ape described the interaction as “an epic case of PvP” in the NFT market, invoking the term “player versus player” that’s associated with confrontations in multiplayer video games. But it seems not everyone involved was entertained.\n\nThe bot’s apparent owner, “elizab.eth,” stepped forward on Twitter to claim the “funds were stolen form [their] bot.” The trader wanted to discuss the possibility of bounty and said Chang could keep 10% of the funds if they agreed to return the rest.\n\nThe pseudonymous NFT influencer Dave III said Chang’s statement wasn’t very wise and warned others not to “brag about committing fraud,” calling his trick “illegal market activity.”\n\nThese 2 crypto twitter posts will go down as the dumbest of all time. #1: Hanwe admits to ‘Bid Spoofing’ or ‘Shill Bidding’ — an illegal market activity of Fraud or Wire Fraud #2: Avi admits to Market Manipulation. He’s now serving jail time. Don’t brag about committing fraud. pic.twitter.com/zgDJJr9nEX — DAVE III (@dgoldzz) August 5, 2023\n\n“Placing bids you don’t want accepted solely to trigger other bids is the illegal part,” Dave III clarified in a comment on a separate post.\n\nWhile some commentators pushed back against the notion of impropriety and said elizab.eth was simply outsmarted, Delphi Labs General Counsel Gabriel Shapiro appeared sympathetic.\n\n\"I unironically think [elizab.eth] might have good legal claims to get their ETH back from the bot 'trick' if they hire a skilled litigator,” he said on Twitter. However, Shapiro acknowledged that “legally, the issues are a bit more nuanced.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS9oZXJlcy13aHktYXJiaXRydW0tYmVjYW1lLTEtZXRoZXJldW0tbDItc2NhbGVyLW9waW5pb27SAUpodHRwczovL3UudG9kYXkvaGVyZXMtd2h5LWFyYml0cnVtLWJlY2FtZS0xLWV0aGVyZXVtLWwyLXNjYWxlci1vcGluaW9uP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Here's Why Arbitrum Became #1 Ethereum L2 Scaler: Opinion - U.Today",
        "content": "Advertisement\n\nAmid aggressive competition in the Ethereum (ETH) L2s segment, it remains pretty concentrated. Almost 90% of its aggregated total value locked (TVL) is controlled by three networks. Here's how Arbitrum (ARB) keeps its supremacy in this field.\n\nArbitrum succeeds since it remains \"credibly neutral,\" Patrick McCorry says\n\nCryptocurrency researcher Patrick McCorry, former assistant professor at King's College London, is sure that \"credible neutrality\" is one of the reasons behind Arbitrum (ARB), Ethereum-based network's success. Its team has never launched \"official\" decentralized applications on Arbitrum (ARB), leaving space for open competition.\n\nIn my opinion as an observer, one of the reasons why Arbitrum has been successful to date is that the ecosystem did not pick a favourite and remained credibly neutral.\n\n\n\nWithout favourites, it allows anyone to feel like they can deploy on the chain and compete as an equal. https://t.co/fcM5IMVQ55 — Patrick McCorry (💙,🧡) (@stonecoldpat0) August 5, 2023\n\nWith no \"favorite\" applications officially supported by Arbitrum DAO and Offchain Labs, any team can come to the blockchain and start deploying \"like an equal.\"\n\nMcCorry's position echoes that of the Arbitrum (ARB) community head, who slammed the L1s and L2s that created their own applications on corresponding blockchain networks:\n\nThe worst thing a chain team can do is start creating their own native dApps or products on top of it. You just end up being in direct competition with teams building on your chain within that vertical\n\nArbitrum (ARB) has never endorsed any applications as its \"native\": All crucial protocols using it as a technical basis are created by third-party teams.\n\nAs covered by U.Today, there is strong evidence that Arbitrum's (ARB) growth is fueled by real usage in DeFi: Airdrop hunters are only responsible for 5-6% of its transactions.\n\nArbitrum vs Optimism rivalry gains traction\n\nBy press time, Arbitrum (ARB) remains the largest Ethereum-based network by TVL: It has accumulated $5.93 billion in liquidity across all of its verified protocols. This is equal to 56.16% of the whole Ethereum L2s ecosystem. Its closest competitor Optimism (OP) is responsible for $2.95 billion, or 27.8% of liquidity.\n\nHowever, in the past week, Optimism (OP) has surpassed its rival in a number of crucial metrics, starting from the number of daily on-chain transactions.\n\nIt was also closer to surpassing Arbitrum (ARB) in the net number of daily active addresses. However, both metrics might only be rallying due to the hype around Worldcoin (WDC), a controversial eye-scanning project by OpenAI's Sam Altman.\n\nThat is why analysts are sure that nothing poses a threat to Arbitrum's (ARB) dominance in the L2s segment it has kept for a couple of months."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctY2FyZGFuby1rZWVwcy1kb21pbmF0aW5nLWV0aGVyZXVtLWRlc3BpdGUtcHJpY2UtZGVjbGluZS_SAVZodHRwczovL2FtYmNyeXB0by5jb20vaG93LWNhcmRhbm8ta2VlcHMtZG9taW5hdGluZy1ldGhlcmV1bS1kZXNwaXRlLXByaWNlLWRlY2xpbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "How Cardano keeps dominating Ethereum despite price decline - AMBCrypto News",
        "content": "Cardano’s development activity was substantially higher compared to Ethereum.\n\nADA’s price dropped by 6% last week, but there was a possibility of a trend reversal.\n\nCardano [ADA] has outperformed the king of altcoins, Ethereum [ETH], by a huge margin in terms of development activity. In fact, data suggested that ADA’s development activity consistently remained three times higher than Ethereum.\n\nRead Cardano’s [ADA] Price Prediction 2023-24\n\nThis metric has been reflected in the blockchain’s efforts to push out new updates over the last few months, the latest being the Mithril mainnet upgrade.\n\nCardano’s development activity remains high\n\nIt was interesting to note that Cardano’s development activity rose substantially over the last month. Its development activity contributor count also remained high.\n\nA major reason for this uptrend can be attributed to the recent Mithril mainnet launch, which aimed to reduce the time required for nodes to sync with the blockchain.\n\nAfter the mainnet update was pushed, Cardano’s multiple teams continued to work on other projects, which were highlighted in the blockchain’s latest edition of its weekly development report.\n\nAs per the report, Mithril mainnet has been consistently producing new certificates and snapshots. The Mithril team also worked on upgrading the Cardano node to v.8.1.2, fixing the release-preprod network that stopped producing certificates.\n\nThis week’s #Cardano development update is live on #EssentialCardano! Read the report to learn about the latest on core technology, wallets and services, smart contracts, scaling, governance, #ProjectCatalyst, and #Cardano education. https://t.co/6DOQ2DXVMQ pic.twitter.com/P2MUJNmOMi — Input Output (@InputOutputHK) August 4, 2023\n\nApart from the BASHO team, the Plutus core team worked on adding decentralized governance support, as defined in CIP-1694, to Plutus v3. The Lace team continued the implementation of Posthog analytics and dedicated efforts to add Trezor support and implement the multi-delegation feature.\n\nThe report also mentioned updated statistics of the Cardano blockchain. The blockchain’s total transactions reached 72.7 million, while its native tokens exceeded 8.6 million.\n\nMoreover, the number of projects building on ADA reached 1,271, while the number of projects launched touched 136.\n\nADA investors aren’t content\n\nWhile development activity remained high, the native token’s price action turned bearish. As per CoinMarketCap, ADA’s price declined by more than 6% over the last week. At press time, it was trading at $0.2915 with a market capitalization of over $10 billion.\n\nThe price drop caused its MVRV Ratio to plummet. Additionally, negative sentiment around Cardano also remained relatively high. However, the whales continued to show interest in ADA, as evident from its high whale transaction count.\n\nIs your portfolio green? Check out the Cardano Profit Calculator\n\nThe good news was that the bearish price trend might come to an end in the coming days. This possibility was pointed out by Coinglass. According to the chart, Cardano’s Open Interest was declining.\n\nA drop in the metric usually means that the on-going market trend might change, giving hope for a price uptick."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvLm5ld3MvdmFsa3lyaWUtbW92ZXMtdG8tY29udmVydC1idGYtaW50by1kdWFsLWJpdGNvaW4tZXRoZXJldW0tZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 07:00:00 GMT",
        "title": "Valkyrie moves to convert BTF into dual Bitcoin, Ethereum ETF - crypto.news",
        "content": "Valkyrie recently filed a Form 497 detailing its plan to transform its existing Bitcoin Technique exchange-traded fund (BTF) into a dual Bitcoin and Ether exchange-traded fund (ETF) on Oct. 3.\n\nFinance experts are questioning the decision to convert the current futures fund rather than forming a whole new business. Observers speculate that regulatory procedures under the U.S. Securities and Exchange Commission (SEC) make it impossible to deviate from the set deadline.\n\nBloomberg ETF analyst Eric Balchunas compares Valkyrie’s move to that of the first marijuana ETF, MJ, which also aimed to gain market share.\n\nINTERESTING: Valkyrie just filed a 497 that they plan to convert $BTF into a Bitcoin + Ether ETF on Oct 3rd, which would would be two wks ahead of the other 13 filers scheduled launch. We'll see if this flies. Something similar happened back in day with $MJ, the first pot ETF https://t.co/Ypnien30ED pic.twitter.com/W9WiU2xc0W — Eric Balchunas (@EricBalchunas) August 4, 2023\n\nYou might also like: Grayscale calls for SEC to approve all Bitcoin ETFs simultaneously\n\nValkyrie vs Blackrock\n\nThe decision follows BlackRock’s Bitcoin ETF proposal to the SEC’s approval on July 13. The heightened focus on ETF proposals from the regulatory body is a good indication, especially in the Bitcoin sector.\n\nValkyrie’s Bitcoin (BTC) Miners ETF is a leader among cryptocurrency exchange-traded funds (ETFs) for 2023. As of July 27, the fund had $24 million in assets under management and returned an astounding 261% year-to-date.\n\nValkyrie, under the helm of CEO Leah Wald, would be the first fund to succeed if given the go-light by the SEC. Other applicants include ProShares, VanEck, Grayscale, and Bitwise.\n\nThe introduction of the Bitcoin and Ether ETF ahead of schedule is an exciting development for the market as the cryptocurrency sector develops.\n\nThe year’s ETF trend reflects the rising popularity of cryptocurrency and other digital assets. The growth seen by cryptocurrencies in 2023 is reflected in the fact that all the top 10 ETFs for the year are focused on them. This congruence further demonstrates the promise of ETFs in the cryptocurrency market.\n\nBlackRock, ARK Invest, Fidelity Investments, WisdomTree, VanEck and Invesco are currently applying for a spot bitcoin ETF.\n\nFollow Us on Google News"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wNS9ldGhlcmV1bS1jb21wZXRpdG9yLWF2YWxhbmNoZS1zZWVzLXN1cmdlLWluLWRhaWx5LXRyYW5zYWN0aW9ucy1hbmQtYWN0aXZlLWFkZHJlc3Nlcy1pbi1zZWNvbmQtcXVhcnRlci1uYW5zZW4v0gGSAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzA1L2V0aGVyZXVtLWNvbXBldGl0b3ItYXZhbGFuY2hlLXNlZXMtc3VyZ2UtaW4tZGFpbHktdHJhbnNhY3Rpb25zLWFuZC1hY3RpdmUtYWRkcmVzc2VzLWluLXNlY29uZC1xdWFydGVyLW5hbnNlbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Competitor Avalanche Sees Surge in Daily Transactions and Active Addresses in Second Quarter: Nansen - The Daily Hodl",
        "content": "Ethereum (ETH) competitor Avalance (AVAX) witnessed an uptick in on-chain activity in the second quarter of 2023, according to the crypto data firm Nansen.\n\nAvalanche’s C-Chain, the project’s default smart contract blockchain, saw between 200,000-550,000 daily transactions throughout the second quarter.\n\nAccording to the analytics firm, the figures represent nearly double the volume of daily transactions in Q1.\n\nThe data firm also notes that Avalanche’s daily active address count steadily increased across Q2, hitting a high of 117,304 on June 14th.\n\nSays Nansen,\n\n“The steady increase of active addresses, coupled with the rise in daily transactions, is indicative of healthy growth within the ecosystem and showcases the flourishing community supporting Avalanche.”\n\nQ2’s surge in on-chain activity wasn’t reflected in AVAX’s price, however. The 19th-ranked crypto asset by market cap dropped from trading around $17.79 at the beginning of the quarter in April to $13.02 at the end of June, a decrease of nearly 27%.\n\nAvalanche’s native token is trading at $12.40 at time of writing.\n\nDecentralized finance tracker DeFi Llama also notes that Avalanche’s total value locked (TVL) dropped from $867 million on April 1st to $693.94 million on June 30th, a decrease of nearly 20%. The platform’s TVL sits at $608.82 million at time of writing.\n\nThe TVL of a blockchain represents the total capital held within its smart contracts. TVL is calculated by multiplying the amount of collateral locked into the network by the current value of the assets.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNTE0MjQvdGhpcy13ZWVrLWluLWNvaW5zLXNpeC13ZWVrcy13ZWFrLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlc9IBXWh0dHBzOi8vZGVjcnlwdC5jby8xNTE0MjQvdGhpcy13ZWVrLWluLWNvaW5zLXNpeC13ZWVrcy13ZWFrLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "This Week in Coins: Sparse News Extends Streak of Underwhelming Bitcoin and Ethereum Prices - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt was the sixth consecutive week of underwhelming price performance by leading cryptocurrencies. There was a dearth of adoption or regulation stories, which for crypto fans and holders made this one of the slowest weeks in recent memory.\n\nMarket leader Bitcoin (BTC) fell 1.1% over the last seven days and currently trades at $28,972. Its closest rival, Ethereum (ETH), fell 2.3% to change hands at $1,829, according to CoinGecko.\n\nAD\n\nAD\n\nTether’s dollar pegged USDT is currently missing its mark and trades for $0.998247 despite the fact that the issuer’s recent quarterly report showed Q2 profits of $850 million, strengthening its total excess reserves to $3.3 billion.\n\nSeveral big altcoins posted notable losses, including XRP, which fell 12% to $0.624960, Solana (SOL) dropped 9.8% to $22.64, TRON (TRX) dipped 8.1% to $0.077501, Litecoin (LTC) depreciated 9.5% to $82.37, Toncoin (TON) dropped 8.3% to $1.19, and Stellar (XLM) fell 14.4% to $0.136595.\n\nOnly one of the top thirty cryptocurrencies by market cap posted notable gains: Dogecoin rival Shiba Inu (SHIB), which blew up 14.7% over the week to trade at $0.00000965.\n\nShiba Inu’s price movement appears to have been catalyzed by news that the coin’s makers are shedding their memecoin reputation and introducing a new identity protocol to all apps on the ecosystem for increased security and privacy.\n\nThe only major industry gossip in regulatory news this week broke on Monday, when a Financial Times report featuring Coinbase CEO Brian Armstrong revealed that the U.S. Securities and Exchange Commission had previously asked the exchange to delist all cryptocurrencies except Bitcoin.\n\nAnd in major institutional crypto news, software company MicroStrategy—the largest institutional holder of Bitcoin—reported a $24 million Bitcoin impairment charge in Q2.\n\nAD\n\nAD\n\nIn contrast, Jack Dorsey’s Bitcoin-friendly payments company Block reported that $2.4 billion of its total $5.5 billion Q2 net revenue came from Bitcoin."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMizwFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWF1Z3VzdC02LWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE2MjA5MzjSAdMBaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9jcnlwdG9jdXJyZW5jeS1wcmljZS10b2RheS1pbi1pbmRpYS1hdWd1c3QtNi1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNjIwOTM4L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Above $29,000 Mark As ApeCoin Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to remain above the $29,000 and $18,000 marks, respectively, on early Sunday morning. Other popular altcoins — including the likes of Litecoin (LTC), Dogecoin (DOGE) — landed in the positive as overall prices saw minor gains across the board. ApeCoin (APE) emerged to be the biggest gainer, seeing a 24-hour jump of over 14.20 per cent. Render (RNDR), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.16 trillion, registering a 24-hour gain of 0.39 per cent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $29,038.95 seeing a 24-hour gain of 0.04 per cent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 24 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,833.41, marking a 24-hour gain of 0.28 per cent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.57 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 1.85 per cent as per CoinMarketCap data, currently priced at $0.07569. As per WazirX, Dogecoin price in India stood at Rs 6.5101.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 1.39 per cent. At the time of writing, it was trading at $83.19. LTC price in India stood at Rs 7,091.46.\n\nRipple (XRP) price today\n\nXRP price stood at $0.635, seeing a 24-hour gain of 2.23 per cent. As per WazirX, Ripple price stood at Rs 54.6800.\n\nSolana (SOL) price today\n\nSolana price stood at $22.90, marking a 24-hour gain of 1.13 per cent. As per WazirX, SOL price in India stood at Rs 1,955.04.\n\nTop crypto gainers today (August 6)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nApeCoin (APE)\n\nPrice: $2.04\n\n24-hour gain: 14.20 per cent\n\nGala (GALA)\n\nPrice: $0.02477\n\n24-hour gain: 11.29 per cent\n\nShiba Inu (SHIB)\n\nPrice: $0.000009601\n\n24-hour gain: 4.93 per cent\n\nFrax Share (FXS)\n\nPrice: $6.61\n\n24-hour gain: 4.79 per cent\n\nCompound (COMP)\n\nPrice: $58.17\n\n24-hour gain: 3.68 per cent\n\nTop crypto losers today (August 6)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nRender (RNDR)\n\nPrice: $1.64\n\n24-hour loss: 3.71 per cent\n\nMaker (MKR)\n\nPrice: $1,236.98\n\n24-hour loss: 3.30 per cent\n\nXDC Network (XDC)\n\nPrice: $0.06791\n\n24-hour loss: 2.56 per cent\n\nConflux (CFX)\n\nPrice: $0.1787\n\n24-hour loss: 1.01 per cent\n\nBone ShibaSwap (BONE)\n\nPrice: $1.67\n\n24-hour loss: 1.00 per cent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2xlYXJuLXRvLWZpbmQtb25jZS1pbi1hLWxpZmV0aW1lLW9wcG9ydHVuaXRpZXMtbGlrZS1iaXRjb2luLXNwYXJrLWFuZC1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Learn To Find Once In a Lifetime Opportunities Like Bitcoin Spark and Ethereum - Analytics Insight",
        "content": "Great investments bear more fruits when investors chip in early. When investing in financial markets, timing is critical to making significant gains. This is why investors look for incoming ICO projects that are yet to hit mainstream adoption and massive popularity. Although Ethereum has been around for some time, and great potential for the network’s digital asset ETH to surge exists, upcoming ICO projects like Bitcoin Spark have more potential to reward investors.\n\nThe Rise Of Bitcoin Cash\n\nBitcoin Cash is classified among the crypto assets that offer an alternative platform to the Bitcoin network, hence the name Bitcoin Alternatives. The project was developed as a significant Bitcoin hard fork upgrade in 2017 to address the challenges and limitations of the first-generation blockchain. Unlike Bitcoin, Bitcoin Cash can host a larger volume of transactions in an isolated block while reducing transaction fees concurrently.\n\nIs Ethereum a good investment?\n\nEthereum has progressed immensely since its inauguration. The platform pioneered smart contracts, a technology that has reshaped the decentralized finance industry by deploying decentralized applications. The network capitalizes on the proof of stake consensus mechanism to promote decentralization and growth of the ecosystem.\n\nBitcoin Spark is a Once in a Lifetime opportunity\n\nFinding crypto gems that have the potential to give massive returns on investment is relatively tricky. Bitcoin Spark is the top Bitcoin hard fork ICO that has great utility. The project intends to solve the shortcomings associated with Bitcoin network functionalities. These challenges include high transaction fees, slow transactions, and centralization in the mining process.\n\nBitcoin mining is quite profitable. However, it has a massive entry barrier involving sophisticated mining equipment, large volumes of electricity, and high expenses. Bitcoin Spark utilizes the proof of process consensus mechanism that blends Proof of Work and Proof of Stake methodologies. This means that the network has both miners and validators. Bitcoin Spark’s mining is not as complicated as that of Bitcoin. Bitcoin Spark’s team is working on software mining applications to support mining BTCS tokens on handheld electronic devices such as mobile phones, laptops, and tablets.\n\nThe project is on the verge of beginning its presale. Bitcoin Spark‘s ICO phase 1 is scheduled to start on 1st August 2023, where investors will purchase BTCS tokens at a discounted price of $1.50. These early adopters will also get a 20% bonus on purchases from 1st August to 11th August.\n\nBitcoin Spark is also unique because participants will earn passive income, unlike the case of Bitcoin and Ethereum, where investors rely solemnly on staking/mining and capital gains. The Bitcoin Spark team is setting up two revenue streams. First, participants will be lent processing power to individuals or companies. This processing power is vital in virtual high-end activities such as video rendering. Miners will earn 97% from this income stream, while the remaining 3% will be allocated to the development team.\n\nSecondly, the platform’s website and mobile applications will have an advertisement slot governed by community members. Advertisers will pay for the service in BTCS tokens. 50% of the income generated from this stream will be directed to the team behind the project’s development. The remaining 50% will be distributed to the network’s participants.\n\nFor more information:\n\nWebsite: https://bitcoinspark.org/\n\nBuy BTCS: https://network.bitcoinspark.org/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmJvbG5ld3MuY29tL2J1c2luZXNzLzIwMjMvMDgvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi10b2RheXMtZXRoZXJldW0tcHJpY2UtNnRoLWF1Zy0yMDIzL9IBamh0dHBzOi8vd3d3LmJvbG5ld3MuY29tL2J1c2luZXNzLzIwMjMvMDgvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi10b2RheXMtZXRoZXJldW0tcHJpY2UtNnRoLWF1Zy0yMDIzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Today’s Ethereum Price, 6th Aug 2023 - BOL News",
        "content": "Ethereum is a decentralized blockchain system that operates on an open-source platform. It has its digital currency called Ether (ETH) and serves as a foundation for various other cryptocurrencies. Additionally, it enables the execution of decentralized smart contracts.\n\nVitalik Buterin outlined the concept of Ethereum in a whitepaper published in 2013. To fund the project, Buterin, and the co-founders organized a public crowd sale in 2014, during which they raised $18.3 million worth of Bitcoin.\n\nThe initial price of Ethereum during the Initial Coin Offering (ICO) was $0.311, and more than 60 million Ether were sold. Considering the current price of Ethereum, this translates to an impressive annualized return on investment (ROI) of over 270%, nearly quadrupling the initial investment each year since the summer of 2014."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMDgvY3J5cHRvLWFuYWx5c3QtYmVuamFtaW4tY293ZW4tcHJlZGljdHMtcG90ZW50aWFsLTUwLWRyb3AtaW4tZXRoZXJldW0tcmVsYXRpdmUtdG8tYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Could See 50% Drop Against Bitcoin: Crypto Analyst Benjamin Cowen's Forecast - CryptoGlobe",
        "content": "Prominent crypto analyst Benjamin Cowen has recently suggested that a single event could trigger a significant drop in Ethereum’s (ETH) value relative to Bitcoin (BTC).\n\nAccording to a report by The Daily Hodl published earlier today, in a recent discussion with Crypto Banter host Ran Neuner, Cowen speculated that the ETH/BTC pair could experience a drop of over 50% from its current value of 0.063 BTC, equivalent to $1,828.\n\nCowen’s prediction is based on his observation that the ETH/BTC pair appears to form a bearish double-top pattern on the monthly chart. This pattern suggests that investors will likely trade their ETH for BTC during any rally. Cowen described the current situation as a “massive distribution phase,” similar to patterns observed in previous cycles.\n\nCowen notes that historically the ETH/BTC pair has shown a tendency to decline from June through December. Cowen anticipates a potential drop to as low as 0.03 BTC ($871):\n\n“So what I would think is going to happen is that Ether/Bitcoin could plummet to around that 0.03 (BTC) to 0.04 (BTC) level and once the Ethereum/Bitcoin valuation gets there, I think that it could mark the end of the altcoin reckoning.“\n\nAccording to Cowen, the catalyst for this significant ETH/BTC decline could be a retracement in the stock market. He drew parallels with the late 2017 scenario when the ETH/BTC pair dropped to .022 BTC. A second drop to this level in 2018 marked the end of many altcoins’ reckoning. Cowen suggests that a similar pattern could be unfolding now, with a secondary drop to the level of 0.049 BTC potentially on the horizon.\n\nHowever, Cowen also cautioned that even after reaching this level, the ETH/BTC pair could experience further drops before finding a bottom. He believes that a potential seasonal correction in the S&P 500 could be the trigger for this scenario.\n\nFeatured Image Credit: Photo / illustration by vjkombajn via Pixabay"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2Jhc2UtYW5ub3VuY2VzLW1ham9yLW9uY2hhaW4tZGV2ZWxvcG1lbnRzLWFuZC1pbml0aWF0aXZlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "Ethereum layer 2 scaling solution Base announces major onchain developments and initiatives - Cryptopolitan",
        "content": "Base, the Ethereum L2 (layer 2) scaling layer backed by Coinbase, has revealed an important milestone in its mission to bring more users and builders onchain. Also, Base declared that it has opened bridging for selected Ethereum assets and will launch its mainnet on August 9, offering unrestricted access for developers to deploy their applications on the platform.\n\nThis launch will include bridging of Ethereum, Coinbase staked Ethereum, dai, and USDC to Base, with withdrawals of the same assets to Ethereum also enabled. While initially limited to these options, there are indications that more may be added in the future. Since opening the Ethereum bridge, Base’s total value locked (TVL) reached its peak value, registering more than $92 million.\n\nAccording to L2beat, a protocol aggregator, Base ranks within the top ten scaling solutions based on value locked. The recent initiation of Ethereum bridging escalated Base to its apex value, documenting over $92 million in total value locked (TVL). An intriguing spike in TVL was observed with the issue of the meme token bald on June 30. The token’s valuation skyrocketed by 40,000% within a mere 48 hours, although it did retrace to its inception levels soon after.\n\n‘Onchain Summer’ and grants for builders\n\nCommemorating the momentous occasion of its L2 chain launch, Base is championing “Onchain Summer.” As detailed by Base, this initiative is a month-long onchain festival orchestrated by a diverse ensemble of 50 illustrious builders, brands, products, artists, and creators. The festivity aims to offer many on-chain activities spotlighting art, music, gaming, advocacy, and more. The entire roster of collaborators for this event remains under wraps, slated for revelation on August 9. However, teasers include notable names such as Coca-Cola, Atari, Opensea, Pixelmon, and Optimism.\n\nTo catalyze innovation on its platform, Base is earmarking 100 ETH to disburse as grants to prospective builders and creators. These grants are being facilitated in collaboration with Prop House, a pioneering infrastructure platform capacitating capital allocation to creators. The grants are tailored to stimulate a spectrum of Base-related endeavors, from creating art and advanced applications to spearheading crypto advocacy and championing sensible legislation.\n\nThe upcoming Base initiatives, including the ‘Onchain Summer’ and grants for developers, mark a pivotal chapter in the L2 solution’s journey. With its mainnet launch imminent, Base is poised to become a formidable player in the Ethereum ecosystem, ushering in a new era of onchain innovation."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9uZXctaGlubWFuLWRvY3VtZW50cy1hbmQtZXRoZXJldW1zLWpvZS1sdWJpbi1yYWlzZS1vdXRyYWdlLWZyb20teHJwLWNvbW11bml0eS_SAXZodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vbmV3LWhpbm1hbi1kb2N1bWVudHMtYW5kLWV0aGVyZXVtcy1qb2UtbHViaW4tcmFpc2Utb3V0cmFnZS1mcm9tLXhycC1jb21tdW5pdHkvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 05 Aug 2023 07:00:00 GMT",
        "title": "New Hinman Documents and Ethereum’s Joe Lubin Raise Outrage from XRP Community - Crypto News Flash",
        "content": "Newly released documents show Joseph Lubin brought William Hinam and Vitalik Buterin together before the SEC director’s speech in 2018.\n\nOutrage sparked within the XRP community with some stating that the Hinman speech was actually “The Ether Speech”.\n\nIn the latest controversial revelation, oversight watchdog group Empower Oversight released a new batch of documents for a Freedom of Information Act (FOIA) request. The documents highlight the deeper involvement of Ethereum co-founder Joseph Lubin and his blockchain firm ConsenSys in the crypto speech by former SEC Director of Corporation Finance, William Hinman, on June 14, 2018.\n\nThis speech has been a source of disagreement in the Ripple case, particularly because the SEC has stated that other cryptocurrencies, like XRP, were also considered unregistered securities. Ripple attorneys stressed much on the Hinman speech of 2018 during its fight with the SEC, as it noted that assets like Ethereum aren’t securities. However, the latest details of Lubin’s involvement have sparked major outrage in the XRP community.\n\nThe documents released by the watchdog group reveal that “Lubin also appears to have been responsible for bringing Hinman and Ethereum creator Vitalik Buterin together as the speech drafting advanced”. Moreover, investors and lawyers closely linked to Ethereum were notably present at a meeting on March 28, 2018, regarding a proposal for a crypto safe harbor.\n\n4. Lubin also apparently brought Hinman and Ethereum creator Vitalik Buterin together as the speech was drafted.https://t.co/e1l1q4posg — Empower Oversight (@EMPOWR_us) August 3, 2023\n\nThe documents also show that Hinman had a meeting with Chris Lin, a partner at Simpson Thacher, which goes against advice on conflicts of interest rules. The SEC Ethics Office had warned Hinman multiple times because he was receiving millions of dollars from Simpson Thacher while working at the SEC.\n\nEmpower Oversight has been leading the fight for more transparency at the SEC. They have filed many requests and lawsuits under the Freedom of Information Act (FOIA) to make the SEC release documents related to their decisions about cryptocurrency matters.\n\nOutraged XRP Community Reacts\n\nThe news has sparked reactions among XRP supporters. In a tweet yesterday, Crypto-Law.US pointed out that the newly disclosed emails show how Lubin influenced Hinman’s decision to title his speech “The Ether Speech.”\n\nJUST ADDED to our Document Library:\n\n✅The Hinman-Lubin Emails, detailing how @ethereumJoseph and @Consensys initiated contact with Hinman & his staff, and drove Hinman's thinking on what he would later call \"the Ether speech\" 👇https://t.co/DJRcWUZb41 — CryptoLaw (@CryptoLawUS) August 3, 2023\n\nAs a response, Attorney John Deaton, the founder of Crypto-Law.US, shared how Hinman lied during his deposition in the Ripple lawsuit. Hinman had claimed that he never discussed the content of his speech with anyone outside the SEC before June 14. However, the Hinman documents revealed that he had a meeting with Buterin a week before his speech on cryptocurrencies.\n\nFred Rispoli, a lawyer at HODLaw, praised the efforts of Empower Oversight, tweeting, “Great job Empower Oversight. SEC never expected these documents to be made public…”\n\nSimilarly, Digital Asset Investor.XRP also questioned the double standards noting: “Why was Bill Hinman doing backflips to accommodate Joseph Lubin and Vitalik Buterin while at the same time giving Brad Garlinghouse the run-around with the help of Jay Clayton and even coming back to the SEC after he left to make sure the Ripple lawsuit went through?”\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vYmxvY2tjaGFpbnJlcG9ydGVyLm5ldC9jcnlwdG8tcHJpY2UtYW5hbHlzaXMtYnRjLWV0aC1hbmQtc2hpYi1zdHJ1Z2dsZS10by1icmVhay1hYm92ZS1rZXktbGV2ZWxzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 06 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Analysis: BTC, ETH, and SHIB Struggle to Break Above Key Levels - Blockchain Reporter",
        "content": "In this comprehensive crypto market analysis, we will delve into the recent price movements of several prominent cryptocurrencies and explore their technical indicators. Each coin exhibits unique traits that contribute to its popularity in the market. We’ll discuss Bitcoin’s stability as a market influencer, Ethereum’s battle with resistance levels, Bancor’s notable surge, and Curve Network’s rebound after an exploit.\n\nWe will also discuss Shiba Inu’s steady gains, StormX’s loyalty rewards impact, and SOLANA’s distinct appeal fueled by meme culture. Traders and investors alike must be well-informed as they navigate these dynamic crypto landscapes, considering both technical analysis and underlying factors affecting each token’s price trajectory.\n\nBitcoin (BTC) Price Analysis\n\nBitcoin (BTC) is currently trading at $29,036, which is up 0.01% in the last 24 hours. Bitcoin, being the pioneer and most dominant cryptocurrency, often sets the tone for the entire market. Looking at the price chart, we can see that Bitcoin has been moving in a relatively tight range over the last 24 hours. The small percentage change indicates a lack of significant price movement in the short term.\n\nFrom a technical perspective, Bitcoin’s price is still above its 50-day and 200-day moving averages, which is a bullish signal. However, the Relative Strength Index (RSI) is approaching overbought territory, suggesting a potential short-term pullback. Traders should keep a close eye on key support and resistance levels at $28,500 and $30,000, respectively. A breakout above $30,000 could lead to further gains, while a drop below $28,500 may signal a deeper correction.\n\nEthereum (ETH) Price Analysis\n\nEthereum (ETH) is currently trading at $1,830, which is 0.1% down in the last 24 hours. Ethereum, the second-largest cryptocurrency, has been experiencing minor losses in the past few days. The price chart shows that ETH is struggling to break above its recent resistance levels. The technical indicators for Ethereum are mixed. The moving averages are still in a bullish posture, indicating a potential for further upside.\n\nHowever, the RSI is hovering in neutral territory, suggesting a lack of clear direction. Traders should closely monitor the support level around $1,800 and the resistance level near $1,900. A break below $1,800 might trigger additional selling pressure, while a break above $1,900 could lead to a new bullish trend.\n\nBancor (BNT) Price Analysis\n\nBancor, an automated liquidity protocol, has seen a notable price surge today. Bancor (BNT) is currently trading at $0.5812, which is 7.16% up in the last 24 hours. This positive movement indicates increased buying interest in the token. From a technical standpoint, Bancor’s price has broken above its 50-day moving average, suggesting a potential trend reversal.\n\nThe RSI is also in bullish territory, indicating that there might be further upside potential. Traders should watch for potential resistance at the previous highs around $0.60 and $0.65. A continuation of the upward trend may lead to a test of these levels, while a pullback could find support at around $0.55.\n\nCurve Network (CURVE) Price Analysis\n\nCurve Network (CURVE) is currently trading at $0.0001385, which is 11.17% up in the last 24 hours. Curve Network, a decentralized exchange liquidity pool, recently witnessed a major exploit. This resulted in a significant decline in the price of CURVE. However, as the situation improved in the past few days, the token has experienced significant gains.\n\nThe price chart shows a strong upward movement. The technical indicators for CURVE are overwhelmingly bullish. The token’s price is well above its moving averages, and the RSI indicates that it is not yet in overbought territory. Traders should be cautious, as the sharp price increase might lead to profit-taking and a potential correction. Key levels to watch are the recent resistance at $0.00014 and the support around $0.00012.\n\nShiba Inu (SHIB) Price Analysis\n\nShiba Inu (SHIB) is currently trading at $0.000009652, which is 2.73% up in the last 24 hours. Shiba Inu, a meme-based cryptocurrency, has shown modest gains and the price movement appears to be relatively stable compared to some other cryptocurrencies in this analysis. The technical indicators for SHIB are neutral. The price is hovering around its moving averages, and the RSI is close to the middle ground\n\nThese technical indicators are indicating a lack of strong buying or selling pressure. Traders should keep an eye on the support level of Shiba Inu at $0.000009 and the resistance at $0.00001. A break above $0.00001 might signal a potential uptrend, while a drop below $0.000009 could lead to further downside for SHIB.\n\nStormX (STMX) Price Analysis\n\nStormX, a blockchain-based loyalty rewards platform, has seen a slight increase in its price today. StormX (STMX) is currently trading at $0.006927, which is 0.24% up in the last 24 hours. The technical indicators for STMX suggest a relatively stable market. The price is trading around its moving averages, and the RSI is in a neutral zone.\n\nSTMX traders should closely monitor the support level at $0.0065 and the resistance level at $0.007. A break above the resistance for the STMX price may signal a potential bullish move for the coin, while a drop below support could lead to further consolidation. Traders should closely watch STMX price movements in the upcoming days.\n\nBarbieCrashBandicootRFK888Inu (SOLANA) Price Analysis\n\nBarbieCrashBandicootRFK888Inu (SOLANA) is currently trading at $0.000000003932, which is 2.75% down in the last 24 hours. What sets SOLANA apart as an absolute game-changer is its unwavering commitment to memes and viral brilliance. This cryptocurrency thrives on pushing boundaries and refusing to settle for anything less than sheer awesomeness.\n\nThe community behind SOLANA is a force to be reckoned with, comprising meme warriors who unleash an unstoppable onslaught of viral content that will leave you in awe and stitches. These factors contribute to SOLANA’s popularity and make it an exciting and vibrant cryptocurrency in the market. However, investors and traders should exercise extreme caution when dealing with low liquidity and lesser-known tokens."
    }
]