[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wOC8xMS92aXNhLWV5ZXMtbWFzcy1hZG9wdGlvbi1vZi1jcnlwdG8tYnktdGVzdGluZy1tZXRob2Qtb2YtcGF5aW5nLW9uLWNoYWluLWdhcy1mZWVzLXRocm91Z2gtZmlhdC_SAY4BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDgvMTEvdmlzYS1leWVzLW1hc3MtYWRvcHRpb24tb2YtY3J5cHRvLWJ5LXRlc3RpbmctbWV0aG9kLW9mLXBheWluZy1vbi1jaGFpbi1nYXMtZmVlcy10aHJvdWdoLWZpYXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Visa Tests Way to Make Paying Ethereum Gas Fees Easier - CoinDesk",
        "content": "To bridge the gap, Visa suggests leveraging Ethereum’s ERC-4337, the current standard that enables smart contracts on the blockchain to serve as wallets via a process called \"account abstraction,\" and a paymaster contract — a smart-contract account that can sponsor gas fees on behalf of the user. The service would allow users to use a Visa card to pay directly for gas fees."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3Zpc2EtcGF5LWdhcy1mZWVzLWNhcmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Ethereum gas fees? Charge it, please! Visa proposes to let you pay with card - Blockworks",
        "content": "Visa has wrapped up testing a way for users to pay on-chain gas fees directly in fiat with a credit or debit card, the payments giant said on Thursday.\n\nThe experiment, which was conducted on the Ethereum Goerli testnet, uses a paymaster contract to sponsor gas fees on behalf of users, according to a statement.\n\nIt means users can send blockchain transactions without having to worry about maintaining a balance of ether. Visa believes the contract could make transactions more accessible to a wider range of users.\n\n“Our experiment aims to offer a promising approach to substantially addressing the challenges of blockchain-based transactions,” Visa’s technical team wrote. “By leveraging the innovative concept of a paymaster, in conjunction with account abstraction and the ERC-4337 standard, we explored the potential for a process that could redefine blockchain-based transactions.”\n\nA paymaster contract is a specialized type of smart contract within the blockchain ecosystem, designed to manage the payment of gas fees.\n\nThe company said merchants or decentralized applications (dapps) could run their own paymaster solution, or existing wallet and paymaster service providers could offer a card-based gas fee payment choice alongside their other paymaster offerings.\n\nThe experiment is part of Visa’s ongoing development within the industry. The company has been working on ways to make blockchain payments more user-friendly and accessible.\n\nVisa reportedly began experimenting with converting digital assets into fiat payments on the Ethereum blockchain earlier this year. The aim is to parallel its current foreign currency exchange processes, as part of its broader push to build proficiency in global settlements involving both digital and traditional currencies.\n\nIn the context of transactions on blockchains like Ethereum, every operation conducted incurs a cost known as a “gas” fee, representing the computational effort required to execute the operation. Gas fees help keep the Ethereum network secure by making it costly for bad actors to spam the network.\n\nSince inception, network fees have been a fundamental part of ensuring security and encouraging adoption within first-generation blockchain systems. Though, following ten years of user growth, the hope is the trajectory of Web3 will move towards a “gasless” future.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vaW5ub3ZhdGlvbi1jaXJjbGUvdGhlLW5leHQtYmlnLWxlYXAtZm9yLWV0aGVyZXVtLWxpcXVpZC1zdGFraW5nLXRoZS1zdGFraW5nLWxhbmRzY2FwZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "The next big leap for Ethereum liquid staking: The staking landscape - Cointelegraph",
        "content": "Imagine a world where everyone, regardless of their background, can easily access and participate in the revolutionary world of Ethereum. A world where decentralized applications empower individuals, and the potential for innovation knows no bounds. Against a highly equivocal and chaotic macroeconomic landscape, this is the world that the prophets of Ethereum dream of.\n\nBut little do they know this world is like an unrealized dream. Why? Let’s dig deeper.\n\nReflecting on the Ethereum liquid staking landscape\n\nCentralized liquid staking protocols are at the forefront of the liquid staking revolution on Ethereum, and it shouldn’t come as a surprise. Why? Because they are highly scalable — thanks to the centralized validator set that they have. The biggest liquid staking protocol on Ethereum currently has a limited node operator set of 29 operators. It must then be a no-brainer that they hold a hegemony over the network. Any protocol claiming to be decentralized but running its operations as a business is also able to offer much higher standards of composability. While this composability that is offered to users is a feature, it can be counter-productive as well — primarily because of the systemic risks this can cause.\n\nOn the flip side, decentralized protocols do exist, but they are highly unscalable. And thus, they have a fraction of ETH staked in them compared to what is often staked via the centralized ones.\n\nWhile decentralized protocols have attempted to reduce the minimum capital required to run a validator node from 32 to 8 ETH, that is still a sizeable amount for the wider ecosystem. Admittedly, this does open up opportunities for a wide number of stakers to start staking on the network, however, we contend that 8 ETH is still a sizeable amount. This reintroduces the problem of scalability, and thus a significant portion of ETH gets staked through a select group of professional node operators. This leads to the further concentration of staked ETH. The presence of these centralized node operators across different liquid staking protocols undermines the censorship resistance of the underlying network.\n\nThe inflow of ETH post-Shapella is a good indicator of users’ liquid staking preferences. One would hope that a lot of the incoming ETH would go to decentralized liquid staking; however, the figures state otherwise.\n\nMaking Ethereum liquid staking scalable\n\nOne of the biggest challenges for the existing liquid staking protocols today is that they are tuned for either scalability alone or decentralization alone. The ones that are tuned for scalability alone are not decentralized, and the ones that are tuned for decentralization are not scalable. There are several examples of this — from protocols having a concentrated node operator set to those having high minimum capital requirements to run validator nodes for Ethereum.\n\nWhile there have been attempts by these protocols to move towards either making their architectures scalable or decentralized, making that is quite difficult given the huge amounts of ETH that are already staked via them. Moreover, these protocol-level changes require a lot of internal deliberations (at-least for decentralized protocols) before they are rolled out.\n\nMoreover, a core objective of any business is to make sure that they hold the hegemony over the industry to persistently retain that. This is reflected by the feigned attempts at a willingness to decentralize — but then having them falling on their head. Perhaps, there is no reason why this would happen. A centralized liquid staking protocol often operates as a business whose core objective is to compromise decentralization to achieve profitability. While I do not condemn the latter, I do feel that it comes — almost always — at the cost of decentralization.\n\nWhat Ethereum needs\n\nEthereum prophets often call for the need to diversify staking across a multitude of protocols. And perhaps, it wouldn’t be remiss to credit those protocols that have emerged that are attempting to realize that vision. However, I must provide a caveat that any emerging protocols need strategic and critical analysis. No one would want shabby architecture being polished and presented as a resilient solution and risking the stability of Ethereum. I believe that there are two things that need immediate attention to drive growth to Ethereum liquid staking:\n\nReducing the minimum capital requirements to run a validator node: This is perhaps easier stated than executed. Reducing the minimum capital requirements incentivizes a wider spectrum of users to participate in network validation.\n\nThis is perhaps easier stated than executed. Reducing the minimum capital requirements incentivizes a wider spectrum of users to participate in network validation. Building censorship resistance: This is perhaps common knowledge, but it often gets overlooked. With the pace at which the macroeconomic landscape is evolving, it is a dire need for protocols to integrate solutions that build the censorship resilience of the protocol. This is akin to hedging against potential future slowdowns in validator architecture and building a high-performant architecture that keeps the network secure.\n\nAdmittedly, I find myself at crossroads while writing these solutions because, while I assert that being aware of the existing challenges as well as the solutions is of paramount importance, it is not enough to persistently echo them. It is essential that we engage in extensive research and relentlessly test and build solutions that help solve these challenges and build a resilient architecture.\n\nMohak is the founder of ClayStack. He is an entrepreneur, investor, and a leader in the staking and liquid staking space.\n\nMohak is the founder of ClayStack. He is an entrepreneur, investor, and a leader in the staking and liquid staking space."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vZGVjcnlwdC5jby8xNTIyNzEvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlcy1pbmNoLXVwd2FyZHMtYWZ0ZXItcGF5cGFsLXBpdGNoZXMtc3RhYmxlY29pbtIBe2h0dHBzOi8vZGVjcnlwdC5jby8xNTIyNzEvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlcy1pbmNoLXVwd2FyZHMtYWZ0ZXItcGF5cGFsLXBpdGNoZXMtc3RhYmxlY29pbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Prices Inch Upwards After PayPal Pitches Stablecoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nLeading cryptocurrencies finally broke a six-week spell of poor price performance or inertia this week.\n\nMarket leader Bitcoin (BTC) added a modest 1.5% to its market value over the seven days to trade at $29,408 on Saturday.\n\nAD\n\nAD\n\nAccording to the latest weekly report by CoinShares, last week was a strong indicator that institutional investors have stopped shorting the leading currency for the first time in fourteen weeks.\n\nMeanwhile, Ethereum (ETH), the second-largest coin by market capitalization, appeared to match the top coin’s pace, adding 1.3% to enter the weekend at $1,851.\n\nThere were no significant price drops among the top thirty cryptocurrencies. However, three altcoins posted notable gains.\n\nSolana (SOL) grew 8.5% to its current price of $24.55; Toncoin (TON) added 10.1% to hit $1.32, and Shiba Inu (SHIB) blew up 17.8% to trade at $0.00001108.\n\nShiba Inu appears to have kept up the momentum of last week’s rally that commenced on news that the coin’s makers are shedding their memecoin reputation and introducing a new identity protocol to all apps on the ecosystem for increased security and privacy.\n\nAltogether the market made small gains this week, as July’s U.S. inflation readings indicated a continued cooling off.\n\nAD\n\nAD\n\nIn the news...\n\nThis week brought a fairly busy and diverse news cycle, with institutional and global adoption stories commanding attention alongside the Fed’s new stablecoin note and the U.S. Security and Exchange Commission’s face-saving tactics in its failing war on crypto.\n\nOn Monday, payments giant PayPal announced it would be releasing an Ethereum-based dollar-pegged stablecoin called PayPal USD (PYUSD).\n\nThe currency will be issued by Paxos and is expected to become \"a part of the overall payments infrastructure,\" according to a media quote by PayPal CEO Dan Schulman.\n\nStarting next month, Paxos will be publishing monthly reserve reports and third-party attestations of PYUSD’s reserves, enabling the public to keep track of the credibility and value of the assets underpinning the stablecoin’s value.\n\nDemocratic Congresswoman Maxine Waters (D-CA) aired her concerns in a written statement: “I am deeply concerned that PayPal has chosen to launch its own stablecoin while there is still no Federal framework for regulation, oversight and enforcement of these assets. [...] Given PayPal’s size and reach, Federal oversight and enforcement of its stablecoin operations is essential.”\n\nOn Tuesday, Brazil announced the name of its new central bank digital currency (CBDC): DREX, or the “digital real”— the name being a near-acronym for “digital real electronic transaction.”\n\nThe digital real is a centrally-issued tokenized real that utilizes distributed ledger technology similar to blockchain, but it’s not without controversy.\n\nEarly last month, the Brazilian Central Bank published the code of the pilot project on its GitHub profile. Developers thus discovered several problematic functions within the smart contract.\n\nAD\n\nAD\n\nThe capabilities given to the Central Bank include the ability to freeze users' accounts, decrease target balances, confiscate, and mint new units of the digital currency. This, in turn, has attracted criticism that the project enforces exactly the kind of centralization crypto was created to avoid.\n\nThat day, Binance announced it had secured licenses to operate in El Salvador, a country where Bitcoin is legal tender. Binance has been feeling the heat of the SEC’s spotlight in the U.S. after the federal securities regulator sued it for breaching securities laws, alleging further still that Binance execs are involved in commingling customer funds and market manipulation.\n\nAlso that day, the Federal Reserve issued a statement announcing incoming guidance for chartered banks dealing with dollar-pegged stablecoins. It also said it was stepping up its “novel activities supervision program” for banks dealing with crypto or crypto companies in its jurisdiction.\n\nIn particular, the Fed is looking to monitor the transaction validation process, including the “timing and finality of settlement of transactions, potential irreversibility of transactions, and the central authority of transaction records.”\n\nThe statement hints that the Fed will implement know-your-client (KYC) measures and ensure that nationally-chartered banks demonstrate appropriate risk-mitigation strategies.\n\nOn Friday, the SEC announced it plans to appeal Judge Torres’s landmark ruling in the agency’s ongoing lawsuit against Ripple for—you guessed it—breaching securities laws.\n\nTorres ruled that Ripple’s XRP was not a security by definition but could be presented as one depending on how it’s sold. Her verdict essentially contradicted the SEC’s claim that offerings to retail customers via exchanges constitute securities offerings.\n\nThe following day, the SEC once more played for time and delayed its decision to approve or reject a high-profile spot Bitcoin exchange-traded fund application from ARK 21Shares.\n\nAD\n\nAD\n\nFinally, on Saturday payments giant Visa announced an experimental solution on the Ethereum blockchain that enables users to pay gas fees using Visa credit or debit cards."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8xMS9wYXlwYWxzLXVzLWRvbGxhci1zdGFibGVjb2luLXdpbGwtaGF2ZS1tYXNzaXZlLWltcGFjdC1vbi1ldGhlcmV1bS1zYXlzLWJsb29tYmVyZy1jcnlwdG8tc3RyYXRlZ2lzdC_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDgvMTEvcGF5cGFscy11cy1kb2xsYXItc3RhYmxlY29pbi13aWxsLWhhdmUtbWFzc2l2ZS1pbXBhY3Qtb24tZXRoZXJldW0tc2F5cy1ibG9vbWJlcmctY3J5cHRvLXN0cmF0ZWdpc3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "PayPal’s US Dollar Stablecoin Will Have Massive Impact on Ethereum, Says Bloomberg Crypto Strategist - The Daily Hodl",
        "content": "Bloomberg Intelligence crypto market analyst Jamie Coutts predicts PayPal’s new PayPalUSD (PYUSD) stablecoin will have a huge impact on Ethereum (ETH).\n\nCoutts says that there is massive growth potential for Ethereum even if just a small percentage of PayPal’s existing customer base adopts the stablecoin, which aims to keep a 1:1 peg to the US dollar and is built on Ethereum.\n\n“The PayPal announcement is not priced in.\n\nPayPal has 435 million active accounts vs. Ethereum Layer-1/Layer-2 active addresses 1 million.\n\nIf 1% convert a dollar balance to PYUSD (4.35 million) and begin to use it then the ramifications for the Ethereum ecosystem and ETH, the asset, are massive.”\n\nCoutts also says that he is bullish on the layer-1 (L1) smart contract platform after an expansion of layer-2 (L2) projects had less of an adverse impact on ETH’s financials than he expected.\n\n“The dual surprise of faster L2 adoption and less than expected cannibalization of the L1 financials has our confidence in Ethereum’s potential to accrue more value than alternative L1s over the cycle.”\n\nThe analyst says ETH’s sideways price action doesn’t tell the full story of all that is going on in the ecosystem, including network development and increased Ethereum staking.\n\n“Flat Price Masks Improving Value Accretion:\n\n1. Network is back on a growth trajectory driven by growing L2s, less severe monetary tightening\n\n2. Mostly deflationary despite bear market (pre-merge inflation was 4%+)\n\n3. Despite cooling activity, ETH staked accelerated up 38% in three months.”\n\nAccording to Coutts, ETH accumulation is increasing during the stalled crypto market.\n\n“While activity is down, investors are nonetheless demonstrating aggressive accumulation behavior. The total number of non-zero balance addresses exceeds 100 million, with over 1.7 million wallets containing at least one ETH.”\n\nCoutts notices that ETH’s network is generating 3x the amount of revenue compared to the fourth quarter of 2022.\n\n“Depending on your framing, dollar value of the network’s GDP/revenue, while down significantly from 2021, has increased 3x from the fourth quarter 2022 low and is now outpacing the price. L1 generates approximately $6 million in fee revenue per day – 80% is burnt (buyback) and the rest paid to validators (div).”\n\nHe also notes that the increase in fees is similar to a 2020 pattern that led to an ETH bull run.\n\n“2023 fees have climbed 176% vs. the price, up 53%. The relationship between the two was instructive for the last bull market when fees outpaced price in 2020 after a two-year decline.”\n\nEthereum is trading for $1,850 at time of writing, down 0.1% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvZXRoZXJldW0tZG93bnNpZGUtZGVhdGgtY3Jvc3MtbG9vbWluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Facing More Downside With Death Cross Looming? - CCN.com",
        "content": "Key Takeaways\n\nDeath Cross forming on a weekly chart for Ethereum\n\nThe ETH daily chart suggests short-term declines\n\nOn-chain metrics aren’t showing long-term holders’ selling pressure\n\nTwo scenarios are still in play\n\nThe price of Ethereum reached $2,130 on April 18, its highest point since May 2022. After the high, we saw a retracement of 23%, as it came down to $1,632 on June 15, but another attempt to continue an uptrend was made, with the price recovering just slightly above $2,000 on July 15.\n\n\n\nEven though these moves were in double-digit percentages, on a higher time frame like the daily chart, the price has moved sideways since the April high. Now, we are seeing some technical indicators signaling a potential start of a downtrend.\n\nETHUSD Forming Death Cross\n\nThe simple moving averages are starting to form a death cross on the weekly time frame. This occurs when the fast MA (50) crosses the slow MA (200) to the downside and indicates the start of a downtrend.\n\nIt especially carries more weight on the higher time frames, and seeing it on a weekly chart where the SMA 200 served as support since 18 June 2022 could be of concern.\n\nZooming into the daily chart, these moving averages are still far apart, which could be a sign of relief, but in the short term, the price is eyeing another interaction with the MA 200.\n\nThis interaction might end as a bounce around the $1,736, which correlates with the local horizontal support, but the situation is still vague.\n\nReal volume is, historically speaking, at its lowest level since October 5, 2020. This could indicate that the current price doesn’t carry much weight as with diminishing volume, retail traders primarily drive the price fluctuations.\n\nOn-chain data\n\nCurrently, by looking at the on-chain metrics, no data suggests incoming selling pressure. One of the most reliable signs would definitely be exchange inflows, meaning that investors are depositing ETH to exchanges for a potential sale.\n\nEven though The Netflow chart has a positive day, on July 26, it shows low volatility in its histogram, which has been the case since June 18. Of course, this might change with price fluctuations.\n\nSo what about the derivatives market? Can we see some short-term selling pressure from traders?\n\nAll of the key derivatives market metrics show a positive sentiment at the time of writing. The funding rate favors long-position traders, and open interest is decreasing, meaning there is less leverage on the market, and there are most short-position liquidations. Taker buy sell ratio also shows a bullish sentiment as more buy orders are filled.\n\nConclusion\n\nIt appears that the price of Ethereum is in a tough spot. We are seeing some mixed signals across the technical indicators, but overall the market is indecisive. The price has been in an uptrend from the start of the year until mid-April when it peaked and started moving sideways.\n\nIn our previous analysis, we outlined two scenarios that still stand. Some early signs of struggle have been seen but there isn’t much data to draw upon in further price expectations.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvaXMtZXRoZXJldW0tcHJpY2Utc3RhcnRpbmctYS1uZXctcmVjb3ZlcnktcmFsbHktYXMtcGVyLWVsbGlvdHQtd2F2ZS_SAWVodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2lzLWV0aGVyZXVtLXByaWNlLXN0YXJ0aW5nLWEtbmV3LXJlY292ZXJ5LXJhbGx5LWFzLXBlci1lbGxpb3R0LXdhdmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Is Ethereum Price Starting a New Recovery Rally As Per Elliott Wave? - CoinGape",
        "content": "As per the Elliot wave theory, the major downfall in Ethereum which started in November 2021 is a three-wave correction. The Elliott Wave Theory is a technical analysis approach used to predict future price movements in financial markets and is based on the idea that market prices move in repetitive patterns or waves, driven by the collective psychology of investors. From the November 2021 peak of $4951, the coin price tumbled around 82% to mark a $883 low in June 2022. If the wave counts are corrected, the ETH price could start a new impulse wave.\n\nAlso Read: Bitwise Revises Bitcoin Futures ETF To Bitcoin And Ether Strategy ETF\n\nadvertisement\n\nEthereum Price Daily Chart\n\nA channel pattern carries the current recovery rally in the ETH price\n\nThe Ethereum Fear and Greed Index at 49 reflects a neutral sentiment in the market.\n\nThe intraday trading volume in Ether is $3.25 Billion, indicating a 23.6% loss.\n\nSource- Tradingview\n\nConsidering the first wave of impulse started from the June 2022 low of $883 to August 2022 at $2029, the second wave(correction) retraced to around 78.6% Fibonacci retracement level and bottomed around $1074.\n\nA bullish upswing initiated from this low could be the third wave of an impulsive trend. In theory, the third wave is referred to as the most powerful and dynamic phase of a market trend.\n\nAs per the Fibonacci extension tool, the 3rd wave could be Wave 1 x 1.62%, 2.62%, or 4.25%. Thus, the potential target for Ethereum price could be $2900, $4010, or $5830 respectively.\n\nCan ETH Price Rally to $2500?\n\nSource- Tradingview\n\nBy the press time, the Ethereum price traded at $1853 with an intraday gain of 0.08%. The daily time frame chart shows the ETH price is resonating in a rising channel pattern. Amid the ongoing correction, the coin price would retest the support trendline to recuperate the bullish momentum. A potential reversal from this trendline would bolster buyers for a rally to $2500 registering a 35% growth. Crypto holders can maintain a strong bullish sentiment until the channel pattern is intact.\n\nExponential Moving Average: The Ethereum price above 200-day EMA reflects the long-term trend of bullish\n\nRelative strength index: The daily RSI slope rises above 40% indicates reflect a suitable scenario for a bullish upswing"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vdS50b2RheS9oZXJlcy13aGF0LWV0aGVyZXVtLWV0aC1mZWVzLWNhbi10ZWxsLXVzLWFib3V0LXByaWNlLWR5bmFtaWNzLWFuYWx5c3Rz0gFaaHR0cHM6Ly91LnRvZGF5L2hlcmVzLXdoYXQtZXRoZXJldW0tZXRoLWZlZXMtY2FuLXRlbGwtdXMtYWJvdXQtcHJpY2UtZHluYW1pY3MtYW5hbHlzdHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Here's What Ethereum (ETH) Fees Can Tell Us About Price Dynamics: Analysts - U.Today",
        "content": "Advertisement\n\nThis bullish rally can be a paradigm shift in Ethereum's L1/L2 ecosystem. Analysts foresee that by the year of 2026, Ethereum's L2 rollups will generate the majority of fees. Here's how this major indicator increased in seven months in 2023.\n\nEthereum (ETH) fees \"outperformed\" Ether price; bullish sign?\n\nIn the last seven months, the cumulative volume of Ethereum (ETH) fees increased by 176%. Over a similar period, the price of the second largest cryptocurrency only grew by 53%. Last time this \"imbalance\" was registered in 2020 after two years of the Crypto Winter.\n\nIn 2023 #Ethereum fees have climbed 176% vs. the price, up 53%. The relationship between the two was instructive for the last bull market when fees outpaced price in 2020 after a two year decline. -@Jamie1Coutts pic.twitter.com/0oIF54OgOK — Chris Burniske (@cburniske) August 12, 2023\n\nCryptocurrency veteran and seasoned blockchain researcher Chris Burniske posted these observations commenting on a thesis by Bloomberg Intelligence's analyst Jamie Coutts. Burniske also admitted that the correlation between these two indicators was \"instructive\" in previous rallies.\n\nAt the same time, migration of users from Ethereum's L1 to various L2 ecosystems is a dominant process in the ecosystem that heavily affects the indicators of fees.\n\nAs covered by U.Today previously, the second largest Ethereum L2 Optimism (OP) surprisingly flipped Arbitrum (ARB), the #1 scaler, in a number of metrics thanks to the overhyped Worldcoin (WDC) token release.\n\nOptimism (OP) exceeded Arbitrum (ARB) in the daily transactions volume and almost managed to eclipse it in the number of active wallets.\n\nL2s on fire in 2023, but we are still early\n\nHowever, by printing time, Arbitrum's (ARB) TVL is more than twice as high as that of Optimism (OP). Arbitrum's DeFi protocols total $5.94 billion in locked assets, while Optimism-based protocols only logged $2.82 billion.\n\nThings have only just started for L2s though. In seven months only, their share in Ethereum (ETH) ecosystem fees increased by more than 3x and almost reached 14%. The number of active addresses across L2s exceeded 900,000, Coutts' report says.\n\nShould L2 adoption keep this pace, major scaling solutions like Arbitrum (ARB), Optimism (OP) and zkSync will be responsible for 20% of Ethereum (ETH) fees by the end of 2023.\n\nIn three years, they will surpass L1's numbers, analysts conclude."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDgvMTIvdm95YWdlci1tb3Zlcy0yNTBiLXNoaWJhLWludS1hbmQtMS01ay1ldGhlcmV1bS10by1jb2luYmFzZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Voyager Moves 250B Shiba Inu and 1.5K Ethereum to Coinbase - The Crypto Basic",
        "content": "Bankrupt crypto lender Voyager shifts massive amounts of Shiba Inu coins (SHIB) and Ethereum (ETH) to Coinbase.\n\nBankrupt crypto lender Voyager has transferred over $5 million of its assets to San Francisco-based exchange Coinbase.\n\nIn a tweet shared today by Wu Blockchain, Voyager transferred a whopping 1,500 units of ETH ($2.77 million) and 250 billion units of SHIB ($2.7 million) to Coinbase.\n\nBankrupt crypto firm Voyager transferred 1,500 ETH ($2.77 million) and 250 billion SHIB ($2.7 million) to Coinbase. Additionally, Voyager is moving all remaining tokens to the main address. There are currently about $81.63 million worth of cryptocurrency in Voyager addresses.… — Wu Blockchain (@WuBlockchain) August 12, 2023\n\n- Advertisement -\n\nNotably, the combined value of the crypto assets moved by Voyager is worth $5.47 at the time of the report.\n\nVoyager Moves Its Assets to Main Address\n\nWhile the recent transfer may seem substantial, it is nothing compared to Voyager’s extensive crypto portfolio.\n\nWu Blockchain said Voyager recently moved its remaining tokens to the main address. Per the media outlet, Voyager still holds various crypto assets valued at around $81.63 million.\n\n- Advertisement -\n\nVoyager’s Past Transfers of ETH & SHIB\n\nIt bears mentioning that Voyager has been moving huge amounts of its assets to Coinbase since it filed for bankruptcy. As reported by the Crypto Basic in March, Voyager shifted 250 billion SHIB (worth around $3 million) to Coinbase.\n\nIn addition, the crypto lender also moved 17,000 ETH and 12 million Voyager tokens (VGX) in different transactions. In a similar development, PeckShield reported that Voyager transferred 250B SHIB and 15K ETH to Coinbase in February.\n\n#PeckShieldAlert Voyager has transferred $28.7M worth of cryptos to crypto-exchanges, including 15k $ETH ($25.3M) to BinanceUS & Coinbase ($ETH at $1,675) & 250B $SHIB ($3.4M) to Coinbase\n\nVoyager received 105k $ETH ($ETH at $1,559 on the day of transfer) from FTX on 7th Sep. 2022 https://t.co/WiFFMRgQr0 pic.twitter.com/qw0uYvXNka — PeckShieldAlert (@PeckShieldAlert) February 16, 2023\n\nAs reported earlier, Voyager sold a whopping 5.62 trillion SHIB coins between February and March 2023. While Voyager sells most of its assets on Coinbase, the crypto lender also uses Binance.US and Wintermute.\n\nSHIB & ETH Prices Soar Despite Voyager’s Transfers\n\nIt is worth noting that the recent transfers did not negatively impact SHIB and ETH prices. At the time of writing this line, Ethereum is up 1%, trading around $1,848.\n\nOn the other hand, Shiba Inu has risen over 9% over the past 24 hours, changing hands at $0.00001091."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYm9sZC5jb20vd2hhdC1pZi1lbC1zYWx2YWRvci1oYWQtYm91Z2h0LWV0aGVyZXVtLW92ZXItYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "What if El Salvador had bought Ethereum over Bitcoin? - Finbold - Finance in Bold",
        "content": "El Salvador — a 21.041 km² republic in Central America — made history by being the first country to officially adopt Bitcoin (BTC) as a legal tender currency in 2021.\n\nOn September 6 of the same year, Nayib Bukele, president of El Salvador, announced the Salvadoran treasury bought 400 BTC at an average price of $46,811.00. Following that, there were nine new purchase announcements on different days, until June 30, 2022 — all done on Bukele’s official Twitter (X) account.\n\nBesides Nayib Bukele’s own statements, there is no evidence that the country has ever bought one single Bitcoin, but — for this report — we are assuming that all his words are truthful and accurate.\n\nEl Salvador bought today 80 #BTC at $19,000 each!#Bitcoin is the future!\n\n\n\nThank you for selling cheap 😉 pic.twitter.com/ZHwr0Ln1Ze — Nayib Bukele (@nayibbukele) July 1, 2022\n\nWith a total investment of around $103.23 million for 2,381 BTC (at an average price of $43,357.14/btc), the country’s wallet is now down around $33 million (-32%), considering Bitcoin’s spot price of $29,400, by press time.\n\nBitcoin is the leading cryptocurrency by market cap, highly promoted as ‘sound money’; followed by Ethereum (ETH), promoted as ‘ultra-sound money’.\n\nThis makes Finbold wonder: What if El Salvador had bought Ethereum over Bitcoin?\n\nWhat if El Salvador had bought Ethereum?\n\nAccording to data collected by Finbold’s team — considering only the purchases from September 6, 2021 to June 30, 2022 — Nayib Bukele made the least worse investment decision with BTC than with ETH.\n\nIf El Salvador had used the same amount in US Dollars to buy Ethereum, on each of the same days Bukele announced the Bitcoin’s purchases, according to historical price data by Coingecko, the country would be losing $15 million more than the current losses.\n\nThese investments would now be worth around $55.60 million, holding 30,053.12 ETH, for a 46.14% loss.\n\nEl Salvador purchases simulation with Ethereum (Vinicius Barbosa / Finbold)\n\nIf El Salvador had staked all these Ethereum’s on July 1, 2022, considering an average yield of 3.29% annually, the country’s treasury would have earned around $1.83 million by now, still worse than by simply holding Bitcoin.\n\nBitcoin daily purchases by El Salvador\n\nOn November 17, 2022, the president once again talked about Bitcoin purchases, declaring that he would be buying 1 BTC per day starting on November 18 within El Salvador’s treasury. Since then, there have been no related updates made publicly, which keeps the promise alive.\n\nWe are buying one #Bitcoin every day starting tomorrow. — Nayib Bukele (@nayibbukele) November 17, 2022\n\nFinbold also collected historical price data from Coingecko for a raw simulation on the possible outcome if (A) Nayib Bukele kept his promises of buying 1 BTC per day since November 18, 2022; and (B) El Salvador had made daily ETH purchases with the same amount in USD.\n\nThere would have been a total of 267 Bitcoin purchases, at an average price of $24,692.13 per BTC, resulting in a current position of $7.85 million, profiting around $1.25 million (+19.07%) for these 267 days only. This would have reduced El Salvador’s total losses to around $31.85 million.\n\nEl Salvador purchases simulation with Ethereum (Vinicius Barbosa / Finbold)\n\nThe daily performance for Ethereum purchases would also have been worse than Bitcoin’s. Sitting in a current amount of around $7.27 million, for an estimated profit of $0.67 million (+10.38%), making a meaningless impact on the bigger outcome.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vZGVjcnlwdC5jby8xNTEwMTIvdGhlc2UtYXJlLXRoZS1oaWdoLXByb2ZpbGUtZXRoZXJldW0tZnV0dXJlcy1ldGYtYXBwbGljYXRpb25zLWN1cnJlbnRseS1pbi1wbGF50gFuaHR0cHM6Ly9kZWNyeXB0LmNvLzE1MTAxMi90aGVzZS1hcmUtdGhlLWhpZ2gtcHJvZmlsZS1ldGhlcmV1bS1mdXR1cmVzLWV0Zi1hcHBsaWNhdGlvbnMtY3VycmVudGx5LWluLXBsYXk_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "These Are the High-Profile Ethereum Futures ETF Applications Currently in Play - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWith issuers and investors still eagerly awaiting regulatory approval for Bitcoin exchange-traded funds (ETFs) in the U.S., attention has turned to Ethereum futures ETFs.\n\nAt least five applications from different firms were filed within 24 hours on August 1, and another was submitted last week.\n\nAn ETF tracking Ethereum futures would essentially invest in futures contracts of the industry’s second-largest cryptocurrency that are traded on the CFTC-regulated Chicago Mercantile Exchange (CME) rather than directly holding the underlying asset.\n\nAD\n\nAD\n\nHow these efforts pan out and whether the U.S. Securities and Exchange Commission (SEC) greenlights any of the current filings remains an open question, especially in light of the regulator’s recent clampdown on the crypto industry and its barely disguised attempts to classify almost every cryptocurrency—except for Bitcoin—as a security.\n\nYet, as Bloomberg’s senior ETF analyst Eric Balchunas noted on August 10, in the past, the SEC has told Ethereum futures ETF hopefuls to withdraw their filings 5-6 days after the first filing hit.\n\n“We are now on Day 13 and no withdrawals. Not home-free yet but very good sign. As we predicted these will likely hit the market in mid-October,” wrote Balchunas.\n\nIn the past the SEC has told Ether Futures ETF filers to withdraw 5-6 days after the first filing hit. We are now on Day 13 and no withdrawals. Not home free yet but very good sign. As we predicted these will likely hit market in mid-October. https://t.co/22WM1HghEp — Eric Balchunas (@EricBalchunas) August 10, 2023\n\nVolatility Shares: Ether Strategy ETF\n\nFiled: 07/27/2023\n\nSEC Response: 10/11/2023\n\nListing Exchange: CBOE BZX Exchange\n\nAD\n\nAD\n\nVolatility Shares, which manages $173.5 million across four exchange-traded funds, could become the first issuer of the ETF with a focus on Ether after outlining its plans in a July 28 filing with the SEC.\n\nThe company’s proposed Ether Strategy ETF (ETHU) complies with the provisions of the 1940 Act governing investment policies and capital structure and would invest up to 25% of its assets in cash-settled Ether futures contracts traded on the CFTC-regulated Chicago Mercantile Exchange (CME).\n\nAdditionally, the fund may invest in reverse purchase agreements and shares of other investment companies, but not directly in Ethereum, per the filing.\n\nThe fund intends to list and principally trade its shares on the CBOE BZX Exchange.\n\nThe proposed ETHU application follows the introduction of the Volatility Shares 2x Bitcoin Strategy ETF (BITX)—the first leveraged Bitcoin futures ETF—launched by the Mt. Kisco, NY-based firm in June.\n\nBitwise: Ethereum Strategy ETF\n\nFiled: 08/01/2023\n\nSEC Response: 10/16/2023\n\nListing Exchange: NYSE Arca\n\nAfter withdrawing its initial filing in May, Bitwise re-applied for its Ethereum Strategy ETF (ETHG) on August 1. According to the filing, ETHG intends to invest in cash-settled, front-month, i.e. with the shortest time to maturity, ETH futures contracts, without seeking direct exposure to the current spot price of Ethereum.\n\nThe fund is classified as “non-diversified” under the Investment Company Act of 1940, meaning it is able to invest a relatively high percentage of its assets in financial instruments with a single counterparty or a few counterparties.\n\nAD\n\nAD\n\nThe filing details that the fund will not invest in ETH futures contracts directly; instead, the investments will be channeled through a wholly-owned subsidiary operating under the laws of the Cayman Islands.\n\nFurthermore, since the Bitwise Ethereum Strategy ETF intends to qualify for treatment as a regulated investment company, the size of the fund’s investment in that subsidiary will not exceed 25% of its total assets at each quarter end of the fiscal year.\n\nDespite such a low allocation, the fund seeks to achieve its investment objective primarily through its investment in ETH Futures Contracts, whereas the remaining 75% of assets are expected to be invested in U.S. Treasuries and other U.S. government obligations, as well as money market funds, cash and cashlike equivalents such as high-quality commercial paper.\n\nRoundhill: Roundhill Ether Strategy ETF\n\nFiled: 08/01/2023\n\nSEC Response: 10/16/2023\n\nListing Exchange: Not specified\n\nNew York-based Roundhill Investments is an SEC-registered investment adviser focused on offering innovative financial products designed to offer exposure to investment themes that appeal to the next generation of investors.\n\nThe firm currently has a total of $662 million of assets under management across eight ETFs and is seeking to expand the offering with the launch of the Roundhill Ether Strategy ETF.\n\nAccording to the August 1 filing, the Roundhill Ether Strategy ETF is an actively managed fund that seeks capital appreciation by investing in CME-listed front-month Ether futures contracts.\n\nSimilar to Bitwise, the fund plans to invest up to 25% of its assets in a wholly-owned subsidiary organized under the laws of the Cayman Islands.\n\nAD\n\nAD\n\nVanEck: VanEck Ethereum Strategy ETF\n\nFiled: 08/01/2023\n\nSEC Response: 10/16/2023\n\nListing Exchange: Not specified\n\nVanEck, which is also among the spot Bitcoin ETF hopefuls, appears to be going big on Ethereum: according to the August 1 filing, the total value of the ETH to which the VanEck Ethereum Strategy ETF is planning to have economic exposure is approximately 100% of its total assets.\n\nIf for any reason such as exceeded position limits or liquidity constraints, the fund is unable to achieve the target exposure, it may invest in equity securities of ETH-related companies, i.e. companies listed on a U.S. stock exchange that the fund’s adviser believes provide returns that generally correspond, or are closely related, to the performance of ETH or ETH futures.\n\n“For example, the Fund may invest in U.S. listed companies offering digital asset trading platforms,” reads the filing\n\nIn addition to ETH futures, the VanEck Ethereum Strategy ETF expects to have “significant holdings” of cash and fixed-income investments, which are intended to provide liquidity and serve as collateral for the fund’s ETH futures, as well as to engage in “active and frequent trading of portfolio holdings.”\n\nProshares: Short Ether Strategy ETF and ProShares Ether Strategy ETF\n\nFiled: 08/01/2023\n\nSEC Response: 10/16/2023\n\nListing Exchange: Not specified\n\nOn August 1, ETF-issuer ProShares filed for two different Ethereum-focused ETFs: Short Ether Strategy ETF and ProShares Ether Strategy ETF.\n\nThe former seeks daily investment results that correspond to the inverse (-1x) of the daily performance of the S&P CME Ether Futures Index, whereas the latter seeks to provide capital appreciation primarily through managed exposure to CME-listed Ether futures contracts, with the investment objective being “non-fundamental,” meaning it may be altered by the Board of Trustees without the approval of the fund’s shareholders.\n\nAD\n\nAD\n\nSimilar to the Bitwise Ethereum Strategy ETF, both Proshares’ Ethereum futures ETF seeks to qualify as regulated investment companies, meaning that the size of the fund’s investment in their corresponding subsidiaries, which will also be based in the Cayman Islands, will not exceed 25% of the total assets at each quarter end of the fiscal year.\n\nGrayscale Investments: Grayscale Ethereum Futures ETF\n\nFiled: 08/01/2023\n\nSEC Response: 10/16/2023\n\nListing Exchange: Not specified\n\nOn May 9, Grayscale Investments, best known as the sponsor of the troubled Grayscale Bitcoin Trust (GBTC), announced the formation of Grayscale Funds Trust—a Delaware statutory trust structure that encompasses three new funds: Grayscale Ethereum Futures ETF, Grayscale Global Bitcoin Composite ETF, and Grayscale Privacy ETF.\n\nJust a week later, the firm submitted amendments to its SEC filing to remove mentions of the Ethereum Futures ETF though, only to re-apply for the offering on August 1.\n\nThe updated filing states that the Ethereum Futures ETF is an actively managed fund that seeks to achieve its investment objective primarily through exposure to Ethereum futures contracts, purchased via a Cayman Islands-based subsidiary.\n\nThe fund is also planning to hold approximately 100% of its net assets in Ethereum futures contracts, however, it may also have significant holdings of cash and cash equivalent investments, such as U.S. Treasury Bills or repurchase agreements.\n\nDirexion Bitcoin Ether Strategy ETF\n\nFiled: 08/02/2023\n\nSEC Response: 10/16/2023\n\nListing Exchange: NYSE Arca\n\nETF issuer Direxion joined the list of companies seeking to introduce Ethereum futures ETFs, after it filed its application for a combined Bitcoin and Ether Futures Fund on August 2.\n\nAD\n\nAD\n\nAccording to the prospectus, the Fund aims to achieve its investment objective through managed exposure to a combination of Bitcoin futures contracts and Ether futures contracts traded on CME.\n\nOne notable item in Direxion’s filing is that the fund’s shares would be issued and redeemed only in large blocks called “Creation Units,” comprising 25,000 shares each.\n\nThere’s no minimum investment set for the fund, which may also invest in other ETFs with exposure to futures products.\n\nBitwise Bitcoin and Ether Market Weight ETF\n\nFiled: 08/03/2023\n\nSEC Response: 10/17/2023\n\nListing Exchange: Not specified\n\nBitwise followed with another filing on August 3, which includes applications for two dual Bitcoin and Ethereum futures-based products: Bitwise Bitcoin and Ether Market Weight ETF and Bitwise Bitcoin and Ether Equal Weight ETF.\n\nThe Market Weight fund’s strategy is to invest in either Bitcoin futures contracts or Ether futures contracts, with the allocation based on the relative market capitalization between the two cryptocurrencies and rebalanced each month.\n\nDetails for the latter are scarce, as the information in the prospectus is not complete and may be changed.\n\nAgain, the filing states the investments would be done through the company’s Cayman Islands-based subsidiary.\n\nAD\n\nAD\n\nProshares Bitcoin & Ether Strategy ETF Bitcoin\n\nFiled: 08/02/2023\n\nSEC Response: 10/16/2023\n\nListing Exchange: Not specified\n\nFiled on August 2, ProShares’ dual Bitcoin & Ether Strategy ETF seeks investment results that track the performance of the S&P Cryptocurrency MegaCap CME Futures Index, with investments mostly targeting front-month crypto futures.\n\nAs is the case with the company’s Short Ether Strategy ETF and Ether Strategy ETF, the fund seeks to qualify as a regulated investment company, expecting to invest a portion of its assets (up to 25%) in a wholly-owned subsidiary organized under the laws of the Cayman Islands and advised by ProShare Advisors.\n\nThe filing also states that the Fund will issue and redeem shares only to authorized participants (typically broker-dealers) in exchange for cash in large blocks, known as Creation Units.\n\nThe fund’s shares may only be purchased and sold by retail investors in secondary market transactions through broker-dealers or other financial intermediaries\n\nProshares Bitcoin & Ether Equal Weight Strategy ETF\n\nFiled: 08/03/2023\n\nSEC Response: 10/17/2023\n\nListing Exchange: Not specified\n\nProShares’ fourth application in three days came on August 3, stating that the Bitcoin and Ether Equal Weight Strategy ETF \"seeks investment results, before fees and expenses, that track the performance of the Bitcoin and Ether Equal Weight Index.\"\n\n“The Index measures the performance holding long positions in the nearest maturing monthly bitcoin and ether futures contracts,” reads the filing.\n\nAD\n\nAD\n\nSimilar to the three previous filings, ProShare’s Bitcoin and Ether Equal Weight Strategy ETF will have exposure to futures and generate qualifying income by investing up to 25% of its assets in front-month crypto futures through a Cayman Islands-based subsidiary.\n\nAdditionally, the fund may invest in shares of other ETFs, which are registered investment companies that are traded on stock exchanges and hold assets such as stocks or bonds.\n\nThe filing further states that any cash balances maintained in connection with its use of derivatives are expected to typically be held in high-quality, short-term money market instruments, such as U.S. Treasury Bills and Repurchase Agreements.\n\nKelly Ethereum Ether Strategy ETF (EX)\n\nFiled: 08/04/2023\n\nSEC Response: 10/18/2023\n\nListing Exchange: Not specified\n\nDenver-based investment firm Kelly Strategic Management first filed for an Ethereum futures ETF back in November 2021; however, those plans were eventually shelved after none of the other similar products that landed on the SEC’s desk materialized.\n\nAccording to an updated prospectus filed with the SEC on August 4, Kelly Ethereum Ether Strategy ETF (EX) is an actively managed ETF that seeks to achieve its investment objective by investing, under normal circumstances, in standardized, cash-settled Ether futures contracts traded on CFTC-registered commodity exchanges, as well as pooled investment vehicles and exchange-traded products that provide exposure to Ether.\n\nAs with the majority of the other Ether futures ETF hopefuls, the Fund will invest in futures contracts traded on the CME indirectly, via a wholly-owned subsidiary organized under the laws of the Cayman Islands. The latter complies with the provisions of the 1940 Act relating to affiliated transactions and custody.\n\nValkyrie Bitcoin and Ether Strategy ETF\n\nFiled: 08/04/2023\n\nSEC Response: 10/3/2023\n\nListing Exchange: Nasdaq\n\nAD\n\nAD\n\nFinancial services firm Valkyrie Digital Assets made a surprise move on August 4 when it submitted another update to its existing Valkyrie Bitcoin Strategy ETF, declaring its intention to convert it into a dual Bitcoin and Ethereum futures ETF that will primarily invest in front-month Bitcoin and Ether futures contracts through a Cayman Islands-based subsidiary.\n\n“Notwithstanding anything to the contrary in the Fund’s Summary Prospectus, Prospectus or Statement of Additional Information, on or around October 3, 2023, the principal investment strategies of Valkyrie Bitcoin Strategy ETF will change to pursue its investment objective through managed exposure to a combination of bitcoin futures contracts and ether futures contracts,” read the filing’s definitive materials.\n\nThe fund’s name is also expected to change to Valkyrie Bitcoin and Ether Strategy ETF on or about October 3, however, it will keep the same ticker symbol “BTF” and is expected to continue to trade on the Nasdaq stock exchange.\n\nPer the prospectus, in addition to its investments in Bitcoin and Ether futures contracts, the fund will also invest its remaining assets directly in cash, cash-like instruments or high-quality securities, including bills, notes, and bonds issued by the U.S. Treasury, as well as money market funds and/or corporate debt securities.\n\nThe Valkyrie Bitcoin and Ether Strategy ETF is one of the few to state a management fee of 0.95%.\n\nBitwise Bitcoin and Ether Equal Weight Strategy ETF\n\nFiled: 08/10/2023\n\nSEC Response: 10/09/2023\n\nListing Exchange: NYSE Arca\n\nOn August 10, Bitwise filed an updated prospectus for its existing Bitcoin futures ETF, signaling its intention to turn the fund into an ETF centered on an equal-weight strategy for both Bitcoin and Ether, with the effective date set for October 9.\n\nThis means the firm now has as many as three applications for Ethereum-related ETFs.\n\nAD\n\nAD\n\nAs per its filing, Bitwise's Bitcoin Strategy Optimum Roll ETF will be renamed to Bitcoin and Ether Equal Weight Strategy ETF, while also altering its ticker from BITF to BTOP.\n\nThis strategic shift mirrors a similar move made by Valkyrie, which also modified its Bitcoin Strategy ETF into a Bitcoin and Ether Strategy ETF. Notably, this change aligns with the trend of various companies filing for Ethereum-focused ETFs.\n\nThe Fund is a series of Bitwise Funds Trust and is regulated as an “investment company” under the 1940 Act, with investments—made through a Cayman Islands-based subsidiary—primarily going into front-month Bitcoin and Ether futures contracts traded on the CME and rebalanced each quarter.\n\nThe Bitwise Bitcoin and Ether Equal Weight Strategy ETF states a management fee of 0.85%.\n\nValkyrie Ethereum Strategy ETF\n\nFiled: 08/16/2023\n\nSEC Response: 10/30/2023\n\nListing Exchange: Nasdaq\n\nValkyrie followed its previous filing to convert the existing Valkyrie Bitcoin Strategy ETF into a dual Bitcoin and Ethereum futures ETF with another application for Valkyrie Ethereum Strategy ETF.\n\nIn an August 16 filing, Valkyrie said that “Ether may be regarded as a currency or digital commodity depending on its specific use in particular transactions.” The filing further stated that, despite significant periods of price volatility, Ethereum may also be used as a store of value.\n\nIn addition to the investments in Ethereum futures, the fund will also invest directly in cash, cash-like instruments, or high-quality securities.\n\nAD\n\nAD\n\nTo help maintain the desired level of exposure to the Ethereum futures contracts, the Valkyrie Ethereum Strategy ETF may also enter into reverse repurchase agreements—a form of borrowing in which the fund sells portfolio securities to financial institutions and agrees to repurchase them at a mutually agreed-upon date and price that is higher than the original sale price, using the proceeds for investment purchases."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8xMi90cmFkZXItaXNzdWVzLWV0aGVyZXVtLXdhcm5pbmctc2F5cy1ldGgtY291bGQtc3VmZmVyLXByaWNlLWRlc3RydWN0aW9uLWFmdGVyLXJhbGx5aW5nLWhlcmVzLXRoZS10aW1lbGluZS_SAY4BaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDgvMTIvdHJhZGVyLWlzc3Vlcy1ldGhlcmV1bS13YXJuaW5nLXNheXMtZXRoLWNvdWxkLXN1ZmZlci1wcmljZS1kZXN0cnVjdGlvbi1hZnRlci1yYWxseWluZy1oZXJlcy10aGUtdGltZWxpbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Trader Issues Ethereum Warning, Says ETH Could Suffer Price ‘Destruction’ After Rallying – Here’s the Timeline - The Daily Hodl",
        "content": "A pseudonymous crypto trader is warning that the leading smart contract platform Ethereum (ETH) could collapse after a big run to the upside.\n\nIn a new strategy session, Altcoin Sherpa says that it is within the realm of possibility for Ethereum to rally well above $2,000 in the coming months.\n\nHowever, the analyst says that ETH will likely see a swift and deep correction following the surge.\n\n“It wouldn’t surprise me to see something like [a move to $2,5000] and then like, you know, come back down, maybe like $1,500 or whatever. And then we just chop around. There’s going to be some big rallies throughout this range. Don’t get me wrong. Like, for example, it wouldn’t surprise me as I said to go up to $2,500, but I’m still conflicted.\n\nI don’t think that $1,000 is going to come again. But it wouldn’t really surprise me at all to see some late-year destruction where we get down to like $1,500. It’s certainly possible in my opinion. But again, it’s going to depend on the next few weeks, months on how we get up.”\n\nLooking at his chart, the trader appears to predict that ETH could climb to $2,500 in November of this year and decline to about $1,500 in early 2024. The chart shows ETH crossing $1,800 again sometime in March 2004.\n\nThe trader also says that ETH’s price action is not convincingly forming a bull cycle.\n\n“I think that it’s just an overall choppy consolidation range right now. I don’t think there’s truly any strong convincing move personally. Yes, you can say this is a bullish market structure, because there are higher highs and higher lows, but it’s not very convincing in the sense that the higher highs are not super high. They don’t convincingly break the previous highs. And the same thing with the lows. They’re just kind of grinding up.”\n\nEthereum is trading for $1,849 at time of writing, down 0.1% in the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92aXNhLWNhcmQtY3J5cHRvLWJsb2NrY2hhaW4tZ2FzLWZlZXMtcGF5bWVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Visa explores crypto gas fees payments through cards - Cointelegraph",
        "content": "In a potential transformative move for users, Visa, the payments solution provider, is testing an innovative solution enabling on-chain gas fees to be paid using a Visa card.\n\nMustafa Bedawala, a product manager at Visa, presented the report, highlighting an observed challenge with cryptocurrency wallets; the ongoing requirement to oversee Ether (ETH) balances for covering gas fees.\n\nThe standard Ethereum procedure involves users acquiring ETH from an exchange or on-ramp service and then transferring it to their wallets to cater to variable gas fees. This continuous adjustment of gas prices frequently leads to users either overspending or having insufficient ETH, introducing intricacies and challenges.\n\nVisa’s innovative solution employs Ethereum’s ERC-4337 standard and the “Paymaster” smart contract, enabling off-chain gas fee settlement. The process involves the user triggering an Ethereum transaction via wallet, sent to the paymaster.\n\nImage illustrating steps involved in paying gas fees with Visa card via Paymaster. Source: Visa\n\nThe web service computes the gas fee and charges Visa using Cybersource. Subsequently, a digital signature is provided and momentarily validated, then attached by the wallet before being sent to Ethereum. Paymaster verifies the signature and covers the gas fee.\n\nThis sequence of steps allows the user to directly pay gas fees with their Visa card off-chain, eliminating the need for users to hold ETH merely for paying fees.\n\nAccording to the publication, Visa has trialed this concept on the Ethereum Goerli testnet, utilizing available open-source tools, such as Stackup’s userop.js library. The trial transactions effectively covered fees through the Paymaster, bypassing the requirement for ETH.\n\nRelated: 3 reasons why Ether price is still pinned below $1,900\n\nNotably, this concept has the potential to reduce friction for blockchain users and allows the user to directly pay gas fees with their Visa card off-chain, eliminating the need for users to hold ETH merely for paying fees.\n\nThe report also suggested wider ramifications, highlighting the potential for merchants or decentralized applications to utilize the Paymaster framework to improve customer interactions, facilitating gas fee payments using Visa cards. This innovation may also create opportunities for current wallet and Paymaster providers to introduce options for Visa card-based gas fee payments.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGVjcnlwdC5jby8xNTIxNzgvdmlzYS10cmlhbHMtZXRoZXJldW0tZ2FzLWZlZS1wYXltZW50cy11c2luZy1jYXJkc9IBUWh0dHBzOi8vZGVjcnlwdC5jby8xNTIxNzgvdmlzYS10cmlhbHMtZXRoZXJldW0tZ2FzLWZlZS1wYXltZW50cy11c2luZy1jYXJkcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Visa Trials Ethereum Gas Fee Payments Using Cards - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nPayments solution provider Visa has unveiled an experimental solution on the Ethereum blockchain that enables users to pay gas fees uing their Visa credit or debit cards.\n\nThe initiative aims to streamline the process of interacting with decentralized applications (dapps) built on the Ethereum blockchain. According to the company, the trial “helps set the stage for a more accessible and user-friendly approach to digital transactions.”\n\nThe successful test was conducted during an internal hackathon on the Ethereum Goerli testnet, a replica of the Ethereum mainnet's functionality designed for testing purposes, and follows the publication of a deep dive report on self-custodial crypto wallets at the end of the last year, in which Visa researched the potential of auto-payments on the Ethereum network.\n\nAD\n\nAD\n\nTraditionally, users need to acquire ETH from exchanges or on-ramp services and then transfer the coins to their wallets to cover fluctuating gas fees for transactions on the Ethereum mainnet or when transacting in stablecoins such as USDT or USDC. This often leads to overspending or insufficient ETH balances, increasing the complexity of the user experience.\n\nVisa's technical team utilized a combination of cutting-edge technologies to facilitate this experiment, including paymaster smart contract agreement, account abstraction, as well as the ERC-4337 standard.\n\nAccount abstraction refers to a comprehensive concept that involves transforming a traditional crypto wallet into a \"smart contract wallet.\" This evolution goes beyond the conventional setup of a public and private key pair, offering enhanced capabilities such as gasless transactions, batch transactions, and social recovery.\n\nERC-4337, in turn, is an Ethereum standard that outlines a specific approach for implementing account abstraction within a cryptocurrency wallet.\n\nHow the tech works\n\nIn Visa's implementation, the process begins when a user intends to execute a transaction on the blockchain. To initiate the operation, the wallet generates a User Operation request, which includes details about the intended transaction (known as \"calldata\") and the maximum cost allocated for the operation, encompassing parameters associated with gas fees.\n\nAD\n\nAD\n\nSpecifically, the parameters within this request define the gas limit, determining the highest computational effort allocated for the operation, and the gas fee, specifying the cost for each unit of computation required.\n\nHowever, rather than immediately transmitting the User Operation request to the blockchain, the wallet takes an intermediary step. It sends the User Operation along with the user's Visa card credentials to a paymaster web service (as depicted in Step 2 below).\n\nPaymaster Flow. Image source: Visa Crypto\n\nThis web service then utilizes the gas fee details to calculate the appropriate fiat currency cost that the user should be charged. Simultaneously, leveraging the provided card credentials, the card-issuing institution may opt to authorize the card payment.\n\nThe chosen payment acceptance solution for the web service is Visa's own payment management platform Cybersource, which equips developers with essential Software Development Kits (SDKs) and Application Programming Interfaces (APIs) and empowers merchants to seamlessly accept digital payments.\n\nOnce the payment has been successfully processed via Cybersource, the web service generates a digital signature encompassing pertinent information within the User Operation. This includes the calldata specifics and gas fee particulars (as indicated in Step 3, above). Additionally, the web service determines a specified timeframe during which this digital signature remains valid.\n\nSubsequently, the wallet receives the digital signature and the designated time window from the web service. These details, along with the on-chain address of the paymaster contract, are then appended as the paymaster parameter to the User Operation. Once all facets of the User Operation are in place, the wallet is empowered to sign and transmit it to the blockchain (as outlined in Step 4, above).\n\nUpon reaching the blockchain, in accordance with the processing framework outlined by the ERC-4337 standard, the paymaster contract receives the User Operation data. This data should encompass the digital signature obtained from the paymaster web service. If any discrepancies or inaccuracies are detected within the provided data (such as an incorrect signature or an invalid time window), the paymaster contract is designed to trigger an error, relieving it from covering the associated gas costs.\n\nHowever, when the signature is duly validated, signifying that the web service has received the card payment to cover the operational cost of the User Operation, the paymaster contract remains error-free and proceeds to manage the cost. Consequently, the User Operation can be executed without hindrance (Step 5).\n\nAD\n\nAD\n\nSummarizing the experiment, Visa said that “the intricacies and complexities of blockchain-based transactions have been a significant stumbling block for many users, creating a challenging learning curve and increasing user friction.” The experiment, the researchers added, offers a \"promising approach to substantially addressing these challenges.\""
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8xMi9vbmUtbWlkLWNhcC1ldGhlcmV1bS1hbmQtc29sYW5hLXJpdmFsLWlzLWZsYXNoaW5nLWEtYnVsbGlzaC1zaWduYWwtYWNjb3JkaW5nLXRvLWNyeXB0by1hbmFseXRpY3MtZmlybS1zYW50aW1lbnQv0gGVAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzEyL29uZS1taWQtY2FwLWV0aGVyZXVtLWFuZC1zb2xhbmEtcml2YWwtaXMtZmxhc2hpbmctYS1idWxsaXNoLXNpZ25hbC1hY2NvcmRpbmctdG8tY3J5cHRvLWFuYWx5dGljcy1maXJtLXNhbnRpbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "One Mid-Cap Ethereum and Solana Rival Is Flashing a Bullish Signal, According to Crypto Analytics Firm Santiment - The Daily Hodl",
        "content": "A top-50 altcoin by market cap could be on the verge of an upside move, according to blockchain analytics platform Santiment.\n\nThe analytics platform says that the native token of smart contract-enabled blockchain Aptos (APT) could reach “another higher high” after partnering with software maker Microsoft on artificial intelligence (AI) and web3 projects.\n\n“Aptos has decoupled after its partnership with Microsoft was announced to build AI tools for blockchain integrations. The crowd showed major FOMO (fear of missing out) but has calmed down. However, rising volume and developer activity may foreshadow another higher high.”\n\nAptos is trading at $7.12 at time of writing, up by over 7% in seven days.\n\nSantiment also says that Shiba Inu (SHIB) is performing relatively better compared to other mid and low-cap altcoins as traders increasingly turn their attention to the second-largest memecoin.\n\n“Prices are mildly up for altcoins today, but most mid and small caps are still struggling to gain any traction on the weekly time frame. Many traders have shifted their focus to Shiba Inu, as the memecoin is one of the few bright spots. SHIB is +19% with rising social volume.”\n\nShiba Inu is trading at $0.0000118 at time of writing, up over 12% in the last 24 hours.\n\nTurning to Ethereum (ETH), Santiment says that the ten largest addresses of the second-largest crypto asset by market cap now hold more than a third of the supply.\n\n“Ethereum has been seeing its top 10 addresses expand and accumulate more and more of the total available coin supply. In five years, the top 10 largest addresses have gone from owning 11.2% to now 34.6% of ETH. The 27.86 million ETH added is worth $51.6 billion.”\n\nEthereum is trading at $1,848 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8xMi9ldGhlcmV1bS1ldGgtY29tcGV0aXRvci1jYXJkYW5vLWFkYS13aXRuZXNzZXMtc3VyZ2UtaW4tZGFwcC1hY3Rpdml0eS1pbi1xMi1hcy1uZnQtdm9sdW1lLXNsdW1wcy1tZXNzYXJpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Competitor Cardano (ADA) Witnesses Surge in DApp Activity in Q2 As NFT Volume Slumps: Messari - The Daily Hodl",
        "content": "Crypto analytics firm Messari says that the Ethereum (ETH) competitor Cardano (ADA) displayed conflicting trends in the second quarter of 2023.\n\nIn a new analysis, the analytics firm notes that Cardano clocked an average of 57,881 daily decentralized application (DApp) transactions, an increase of 49% compared to Q1.\n\nThe Cardano blockchain also registered $151.7 million in total value locked (TVL) at the end of Q2, a nearly 10% increase from the end of the first quarter. Cardano now ranks 21st among all chains in terms of TVL, up from 34th at the beginning of the year, according to Messari.\n\nThe TVL of a blockchain represents the total capital held within its smart contracts. TVL is calculated by multiplying the amount of collateral locked into the network by the current value of the assets.\n\nDespite the increases in DApp transactions and TVL, Cardano also witnessed declining non-fungible token (NFT) activity.\n\nThe project clocked 2,945 average daily NFT transactions in Q2, a decrease of 35.7% on a quarter-over-quarter basis. Cardano’s total NFT quarterly trading volume was $46.2 million, a decrease of 41.9% compared to Q1.\n\nMessari says these downward NFT trends are “in line with the broader market.”\n\nADA is trading at $0.292 at time of writing. The ninth-ranked crypto asset by market cap is down more than 1.5% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLW1pZ2h0LXJlcGVhdC1ldGhlcmV1bS1ldGgtcGVyZm9ybWFuY2UtaW4tbmV4dC1idWxsLXJ1btIBVWh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLW1pZ2h0LXJlcGVhdC1ldGhlcmV1bS1ldGgtcGVyZm9ybWFuY2UtaW4tbmV4dC1idWxsLXJ1bj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Solana (SOL) Might Repeat Ethereum (ETH) Performance in Next Bull Run - U.Today",
        "content": "Advertisement\n\nBased on a recent report by on-chain analyst Delphi Digital, the cryptocurrency researcher indicates a number of similarities between Ethereum's (ETH) DeFi Summer of 2020 and what Solana (SOL) might be up to in 2024.\n\n\"Safest bet\" in non-EVM chains: Analyst on Solana (SOL)\n\nAfter a massive rally in 2020 and a painful drawdown, in the next bull market, Solana (SOL) might reemerge from the ashes and repeat the performance of Ethereum (ETH). Analyst and podcaster Sal Qadir shared such conclusions with his Twitter followers yesterday, Aug. 11, 2023.\n\nQuick tl:dr of this great report @Delphi_Digital just put out:\n\n\n\n\"Ghosts of Cycles Past - The Early Innings of a New Cycle?\"\n\n\n\nI'll be focusing on what it means for @solana\n\n\n\nLet's dive in 🧵\n\n1/10 — Sal.xyz (@sal_coin) August 11, 2023\n\nBased on the four-year-cycles approach, the current performance can be compared to that of Q4, 2019, the analyst admits. At the same time, given the fact of the DeFi activity increase on Solana (SOL), the blockchain might be entering its version of Ethereum's 2020 DeFi Summer right now.\n\nAlso, in terms of total value locked in DeFi protocols, Solana (SOL) is an undisputed leader amid all L1 blockchains outside the Ethereum Virtual Machine (EVM) ecosystem.\n\nSolana's (SOL) liquid derivatives staking ecosystem has huge room for growth. Based on the ratio between all SOL staked and the TVL of Solana-based LSTs, Qadir foresees \"billions of capital\" that can be injected once SOL liquidity providers start seeking additional yield.\n\nAs covered by U.Today previously, Solana's (SOL) price might be due for an amazing comeback in 2023, based on a number of technical analysis indicators.\n\nFlashbots, NFTs might contribute to Solana (SOL) success\n\nBesides TA triggers, Solana's (SOL) potential growth might be driven by a couple of technical advancements that either have been deployed to the protocol or might be introduced in the coming months.\n\nFor instance, new-gen Solana DeFis by Jito Labs might address the problems of MEV in more advanced ways compared to mainstream Ethereum-centric protocols.\n\nAlso, with data compression scaling technology, the minting of non-fungible tokens on Solana (SOL) might be almost 3,000x cheaper than on Polygon (MATIC), Delphi's data says."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8xNTIyMDIvZXRoZXJldW0tZGVmaS1kYXNoYm9hcmQtZGViYW5rLWxhdW5jaGVzLWxheWVyLTItb24tb3B0aW1pc21zLW9wLXN0YWNr0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzE1MjIwMi9ldGhlcmV1bS1kZWZpLWRhc2hib2FyZC1kZWJhbmstbGF1bmNoZXMtbGF5ZXItMi1vbi1vcHRpbWlzbXMtb3Atc3RhY2s_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Ethereum DeFi Dashboard DeBank Launches Layer-2 on Optimism’s OP Stack - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDeFi blockchain explorer platform DeBank has announced DeBank Chain, a new layer-2 blockchain built on Optimism’s OP Stack.\n\nBilled as an “asset later for social,” DeBank Chain is built as an optimistic rollup which claims to have reduced the “L1 data storage gas cost by 100 to 400 times.” The OP Stack is a blockchain development standard by Optimism team on which new layer-2 blockchains can be built.\n\nDeBank, a DeFi portfolio visualisation and blockchain explorer platform for Ethereum and other EVM-compatible blockchains, launched the testnet of its layer-2 network today with plans “to roll out the Mainnet in 2024.”\n\nAD\n\nAD\n\n1/7 We're excited to announce DeBank Chain, aiming to become the Asset Layer for Social! We're launching the Testnet today and it's planned to roll out the Mainnet in 2024. pic.twitter.com/Do1hwJtPGj — DeBank (@DeBankDeFi) August 11, 2023\n\nDeBank’s social media goals\n\nIn October 2022, DeBank rolled out an Ethereum L2 to facilitate DeBank Hi, a chat application embedded in its existing wallet tracking platform.\n\nUsers on the platform are paid to receive messages, creating a “market for attention.”\n\nDeBank has over 200,000 users registered on its Ethereum layer-2 network, per a Dune dashboard by Stakeridoo.\n\nThe team plans to expand DeBank Hi from a messaging app to a social media platform, DeBank Stream, where users would receive credit for “valuable contributions” on the platform.\n\nAD\n\nAD\n\nThe platform’s aim is to evaluate a “user's precise attention value” based on their social media interactions which will account for “every minute you invested, every post you published or read, every comment.”\n\nDecrypt has reached out to DeBank for comment.\n\nThe OP Stack is expanding\n\nDeBank has added to the list of new layer-2s building on the OP Stack.\n\nIt includes Coinbase’s Base, Andreessen Horowitz-backed Magi Protocol, and Binance-based BNB Chain, which launched a testnet built on the same standard on June 19, 2023."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYW1iY3J5cHRvLmNvbS95MDB0cy1jaG9vc2VzLWV0aGVyZXVtLW92ZXItc29sYW5hL9IBPWh0dHBzOi8vYW1iY3J5cHRvLmNvbS95MDB0cy1jaG9vc2VzLWV0aGVyZXVtLW92ZXItc29sYW5hL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "y00ts chooses Ethereum over Solana - AMBCrypto News",
        "content": "y00ts’ disclosure of its move to Ethereum has been met with intense debate.\n\nNFT sales across blockchains have decreased in the last 30 days.\n\nIn a surprising turn of events, Polygon [MATIC]-based NFT collection y00ts has made a strategic decision to ignore the possibility of a move back to Solana [SOL]. Instead, it announced its migration to the Ethereum [ETH] blockchain.\n\nRealistic or not, here’s MATIC’s market cap in SOL’s terms\n\nFrom Solana to Polygon, now to Ethereum\n\nWhile the y00ts Twitter handle said the date for the move was still undecided, it would ensure that it returns 100% of Polygon’s grant.\n\n2. We're returning 100% of the grant provided by Polygon. The funds will be re-deployed for NFT ecosystem growth to empower builders and creators. We still love Polygon. It's just time to unite the DeGods & y00ts communities. — y00ts (@y00tsNFT) August 9, 2023\n\nThe decision comes amid a backdrop of increasing competition among different blockchain ecosystems. However, y00ts’ latest decision to move from its host is once again controversial.\n\nBefore the collection migrated to Polygon, its first stop was Solana. When it launched on the blockchain, it experienced massive adoption, making it one of the most successful Solana NFT projects. This was because DeLabs, the team behind the collection, was also behind DeGods, which was also once Solana-based.\n\nBut in March, the project’s founders, led by Rohun Vora, popularly known as FrankDeGods, announced the switch to Polygon. At the time, Vora took a jab at Solana, saying the blockchain did have enough capacity to scale y00ts features but Polygon did.\n\nAnother controversy also arose then— the team denied ever receiving a $3 million grant from Polygon before recently admitting it.\n\nFinding calm amid the turbulence\n\nIt was also around the same period that DeGods moved to Ethereum. The team said that the decision to migrate y00ts was to ensure that the collection and DeGods were on the same blockchain.\n\nHowever, this decision did not sit well with some of the NFT holders. For some, it was a move well thought out as the y00ts brand did not fit the Polygon brand. Others, on the other hand, were not comfortable with moving from blockchain to blockchain.\n\nBut Vora, via his Twitter, begged the y00ts community to respect the project’s decisions and the communities of all blockchains involved, saying,\n\n“We tried our best to make it work but we just need to bring our 2 communities together. I would appreciate it if everyone remains respectful of all parties involved.”\n\nHow much are 1,10,100 ETHs worth today?\n\nAt press time, the NFT market was still in a state of upheaval. According to CryptoSlam, Ethereum, Solana, and Polygon were the top three blockchains with the highest volume in the last 30 days.\n\nHowever, the ranks they had did not stop them all from registering notable drops in sales and buyers. Within the last 30 days, Ethereum NFT sales dropped by 36.91%. Polygon decreased by 29.05% while Solana NFTs fell by 56.03%."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMinwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtbW9tZW50dW0tZWFzZXMtYXMtbWFya2V0cy10cmFuc2l0aW9uLXRvLXdlZWtlbmQtbW9vZC0yMDIzMDgxMTE5MDDSAaMBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLXJpcHBsZS1tb21lbnR1bS1lYXNlcy1hcy1tYXJrZXRzLXRyYW5zaXRpb24tdG8td2Vla2VuZC1tb29kLTIwMjMwODExMTkwMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC showing weakness shakes ETH, XRP and most altcoins - FXStreet",
        "content": "Share:\n\nBitcoin price could drop below the 50-day EMA at $29,348 as momentum indicates a flip below defining levels.\n\nEthereum price's overall bullishness stretches thin as BTC shows weakness, though delayed, a 5% drop may be inevitable.\n\nRipple price finds support on the 50-day EMA at $0.6260, but risks of a drop run high as momentum fades.\n\nBitcoin (BTC) price is on a downtrend, recording d three consecutive red candlesticks. This bearishness has diffused to Ethereum (ETH) and Ripple (XRP) prices and comes at a time when the BTC Exchange Traded Fund (ETF) bubble has burst before the eyes of traders and investors as the US Securities and Exchange Commission put off a decision concerning Cathie Wood's Ark Invest.\n\nAlso Read: Bitcoin Weekly Forecast: US SEC likely to reject BTC ETF, experts say\n\nBitcoin price could correct premature breakout\n\nBitcoin (BTC) price has been sitting on the 50-day Exponential Moving Average (EMA) at $29,348 since August 9. However, this support oasis may be running dry as the weekend sets in because of the retail tendency to relax their trading hands around that time.\n\nAccordingly, Bitcoin price could slide below the 50-day EMA back under the descending trendline to continue its downtrend. Without a strong catalyst to trigger impulse, the people's crypto could extend south to test the 100-day EMA at $28,641 or, in a dire case, the 200-day EMA at $27,198. This is likely considering speculation of the US SEC likely rejecting BTC ETF applications.\n\nThe nose-diving Relative Strength Index (RSI), whose direction is interpreted as falling momentum, reinforces this outlook. Similarly, the Moving Average Convergence Divergence (MACD) is in the negative zone, which points to the presence of stronger bears than bulls in the market currently.\n\nBTC/USDT 1-day chart\n\nConversely, with the weekend setting in, large holders are likely to step in, amassing or offloading BTC in huge chunks and cash in the weekend price swings. Former Morgan Stanley technical strategist Mark Newton supports this dynamic, saying:\n\nWe're seeing above-average volatility on weekends with it moving dramatically up or down… the size of individual orders is usually big with overall fewer orders. It indicates that the large holders of the cryptocurrency, so-called bitcoin whales, are active during the weekend to amass or offload bitcoins in big numbers and cash in the weekend price swings.\n\nIf they buy, Bitcoin price could extend north, potentially tagging the $31,440 resistance level or shattering past and recording a new range high.\n\nAlso Read: Bitcoin and altcoin prices could benefit from cooling inflation, US PPI for July exceeds expectations.\n\nEthereum price conformity to BTC threatens its overall bullishness\n\nEthereum (ETH) price is suffering because it is correlated to BTC, meaning it suffers the initial impact of a weakening Bitcoin before the ripples reach the rest of the altcoin community. Thus, if BTC slides below the downtrend line, ETH could follow suit to lose the support offered by the 100-day EMA at $1,842.\n\nThe subsequent selling pressure could see Ethereum price retest the 200-day EMA at $1,788 or, in the extreme case, test the $1,733 support level. Such a move would constitute a 5% drop from current levels.\n\nNotably, the RSI for Ethereum price is showing the same waning momentum as that of Bitcoin price, just as the MACD is in the negative zone. This adds credence to the bearish thesis.\n\nETH/USDT 1-day chart\n\nOn the flipside, a new resolve among bulls could send Ethereum price north, breaking out from below the foothold of the 50-day EMA for a chance to test the $2,005 resistance level. This would denote a 10% leap above current levels.\n\nIt is worth mentioning that on-chain metrics point to an incoming rally for Ethereum price, including the low supply of tokens deposited into exchanges. This is often interpreted as a sign of increasing buying pressure, while the fact that there is increasing whale accumulation also hints at a potential increase in prices. Find details here.\n\nAlso Read: Ethereum's low volatility and bullish on-chain metrics hint at potential ETH price rally\n\nRipple price could drop as 50-day EMA becomes trite\n\nRipple (XRP) price has been sitting on the 50-day EMA at $0.6308 for seven consecutive days, a risky stunt considering markets tend not to wait for so long. With broader crypto market momentum fading, chances of a slump increase, which could see the remittance token drop to the 100-day EMA at $0.5737. In a highly bearish case, the altcoin could slump further to test the $0.5206 support level.\n\nThe RSI and MACD are also nose-diving, suggesting a falling momentum that could lower Ripple price.\n\nXRP/USDT 1-day chart\n\nOn the other hand, bullish momentum could restore as Ripple price collects leftover liquidity from the past few days. The stability that follows and ensuing buying pressure could fuel an uptrend, possibly past the $0.6840 resistance level, or in a highly ambitious case, tag the $0.8193 resistance level. This would represent a 30% flight above present levels.\n\nAlso Read: XRP rallies to $50 on Gemini, Ripple holders speculate the outcome of SEC appeal against Judge Torres' ruling"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvYW5hbHlzdC1wcmVkaWN0cy1ldGgtcGx1bmdlLWFnYWluc3QtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Analyst Predicts ETH to Plunge 50% Against BTC: The End for Altcoins? - CCN.com",
        "content": "Key Takeaways\n\nThe altcoin market is facing a 40-50% drop\n\nBenjamin Cowen predicts a drop in Ethereum price for the same 40-50% decrease against Bitcoin\n\nThe analysis is valid and highly likely\n\nA popular macro investor and analyst behind Into the Cryptoverse Benjamin Cowen was interviewed by Crypto Banted host Ran Neuner. Among topics like “Are altcoins coming back,” “Why is Bitcoin better than Ethereum?” and “Macro Economics & Fundamentals,” Cowen has stated that his analysis points out a potential 50% dip in Ethereum compared to Bitcoin (ETHBTC).\n\nIt is worth delving deeper into this possibility and look into some of the other possibilities moving forward.\n\nWhere Does This Target Come From?\n\nThe first chart Benjamin uses is a ratio he developed in order to spot the altcoin market tops. The altcoin market cap (TOTAL3) minus USDT (deducting stablecoin) is divided by the BTC market cap.\n\nAs he states, when the ratio reached 1 it points out at the altcoin market tops, while it bottomed out at the 0.25 level. Measuring from its current level of 0.45 to its bottom area, there is a decrease potential of 44%.\n\nThe first question is how valid is this ratio, and can it be trusted? While comparing the prices of some altcoins that were most successful in the previous cycle and some that were not so much, we can see that the ratio is accurate.\n\nOn the chart above, we have inserted price charts of SOL, ADA, DOT, AVAX, DOGE, LINK, and MATIC. Aside from ADA, which is skewed to the left other altcoin tops match those of the ratio 1 mark interaction.\n\nOn the other hand, regarding bottoms, some of the compared altcoins were new to the market and there is no price history before July 2020. But December 28 was the lowest the ratio has been and from that point onward, we have seen bull market runups in these coins.\n\nThis ratio is for the altcoin market in general, and the total market cap 3 excludes Ethereum. So now let’s take a closer look at the Ethereum chart and what Benjamin Cowen states about it.\n\nETH/BTC\n\nAccording to Benjamin the price of ETH in BTC is forming a double-top chart pattern indicating a distribution phase.\n\nThe last time we saw a double top on the monthly chart, was in Jun 2017 to January 2018, after which a decline of 85% followed.\n\nWith the average monthly returns in the red from June to December, historically speaking, and with the double top forming on the monthly chart, these are the reasons Cowan believes that we are going to see a breakout to the downside.\n\nAccording to our chart, there is a significant support zone at 0.036 BTC which is 42.6% lower than the current level of 0.063 BTC. Cowan also points out this zone as the potential ending point of the “altcoin reckoning.”\n\nThe reasons behind this altcoin reckoning he sees in the traditional markets and the seasonal correction in the S&P500. Another reason he speculates that could be the catalyst for this ETHBTC plummet is the DeFi depreciating prices and collateral debt position (CDP) liquidations.\n\nConclusion\n\nCowen is a respected analyst who first came into the scene by introducing logarithmic regression analysis to analyzing Bitcoin and his macro outlooks. He is a Bachelor of Science in Mathematics and a Ph.D. in nuclear engineering, which “allows him to bring a unique perspective to the crypto verse.”\n\n\n\nThe analysis he presented is well-researched and backtested, so there isn’t a reason for doubt except for the standard probability chance that the data history indicates the potential future outcome.\n\nThere are strong clues that the altcoin market has indeed reached only halfway in the bear cycle, so another final low could occur with the prices in general decreasing by another 40-50%, and Ethereum is not an expedition.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0yOTUwMC1ldGhlcmV1bS1yZWdhaW5zLTE4NTAtc2hpYmEtaW51LXJpc2UtMy1lYWNoLTM5MzcyMy0yMDIzLTA4LTEx0gGYAWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuaW4vYW1wL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0yOTUwMC1ldGhlcmV1bS1yZWdhaW5zLTE4NTAtc2hpYmEtaW51LXJpc2UtMy1lYWNoLTM5MzcyMy0yMDIzLTA4LTEx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $29,500; Ethereum regains $1,850; Shiba Inu rise 3% each - Business Today",
        "content": "Bitcoin and other top crypto tokens were trading in red on Friday after better-than-expected US inflation data. The two largest cryptocurrencies continue to shake off macro waves. Other than macroeconomic factors, analysts continue to eye $30,000-mark for the Bitcoin.\n\n\n\nBitcoin extended its fall as on Friday as the largest crypto token dropped about another per cent to slip below 29,500-mark once again. Its largest peer, Ethereum, was trading slightly lower but brached $1,850-levels after the latest weakness. Price action in the major altcoins was on the lower side.\n\n\n\nBaring a few names, all other top crypto tokens were trading lower on Friday. Bitcoin Cash dropped more than 3 per cent, while Cardano dropped about 2 per cent. BNB, Litecoin and Polkadot shed over a per cent each. Among the gainers, Solana and Shiba Inu rose 2 per cent, while Tron added about a per cent.\n\n\n\nThe global cryptocurrency market cap was trading quite lower, falling down to $1.17 trillion-mark as it dropped almost a per cent in the last 24 hours. However, the total trading volumes dropped as much as 26 per cent to $25.84 billion.\n\n\n\n\n\nTech View by Giottus Crypto Platform:\n\nBNBis currently moving sideways within a horizontal channel in the medium term. The candle sticks have inched closer to the $240 level in the past two days which coincides with its 50-day moving average.\n\n\n\nIf there is any upside momentum, additional gains could potentially drive the price towards the resistance levels of $250 and $265. Its RSI slope, moving sideways, indicates that the underlying buying pressure for BNB isn’t strong. On the downside, if BNB fails to withhold the $230 support level, it may revisit support zones at $220.\n\n\n\nMajor Levels:\n\nSupport: $220, $230\n\nResistance: $250, $265, $280\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NvdWxkLWV0aGVyZXVtLWJyZWFrLXRoZS0yMDAwLWJhcnJpZXItc29vbi0xNTAwLWdyb3d0aC1vbi1ob3Jpem9uLWZvci1pbnF1YmV0YS1wcmVzYWxlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Could Ethereum Break the $2,000 Barrier Soon? 1500% Growth on Horizon for InQubeta Presale - Analytics Insight",
        "content": "The financial landscape is constantly evolving, and cryptocurrency continues to be a leading force in this revolution. While Ethereum has caught the eyes of many investors for its potential to break through the $2,000 barrier again, another crypto entity, InQubeta, is making waves with its groundbreaking presale growth.\n\nInQubeta’s Impressive Presale Surge\n\nBefore we delve deeper into Ethereum’s potential rise, it’s crucial to note the meteoric ascent of InQubeta. With its presale showing an astonishing 1500% growth trajectory, InQubeta is rapidly becoming a hot topic in investment circles.\n\nInQubeta’s approach is unique, focusing on creating a platform that allows fractional investment in AI start-ups using QUBE tokens. This means that instead of investors having to stake large amounts in startups, they can now take a different approach, investing as per their comfort and financial capability. Such a model promotes democratization in the investment ecosystem, allowing everyone a shot at being a part of groundbreaking AI innovations.\n\nOne of the standout features of InQubeta’s model is the QUBE token. As a deflationary ERC20 token, QUBE offers crypto investors a different avenue to diversify their portfolios. With buy and sell tax mechanisms that benefit the token’s ecosystem, investors can earn rewards through staking their tokens. This makes QUBE an attractive investment for those believing in the growth potential of AI technology start-ups.\n\nMoreover, the InQubeta NFT marketplace is another innovative feature. Here, investors use $QUBE tokens to invest in AI start-ups through fractional investment opportunities. These investments are in the form of reward and equity-based NFTs, making the process transparent, efficient, and, most importantly, lucrative for both investors and start-ups.\n\nWith the presale already garnering over $2.1 million and still surging, it’s evident that the crypto community recognizes InQubeta’s potential. The roadmap for InQubeta is also ambitious, with plans for the NFT marketplace launch and multichain expansion.\n\nEthereum’s Potential Breakthrough\n\nComing back to Ethereum, the second-largest cryptocurrency by market cap, there’s palpable anticipation around its possible return to the $2,000 mark. Since its inception, Ethereum has been seen as a major player in the DeFi sector and a formidable competitor to Bitcoin.\n\nWhile Ethereum’s past fluctuations have kept some investors on edge, many experts believe that its fundamental strengths, coupled with growing institutional interest and a robust decentralized application ecosystem, could propel its price. The platform’s smart contract functionality continues to be a major draw, with several decentralized apps and projects relying on Ethereum’s blockchain for their operations.\n\nHowever, it’s essential to consider the broader economic environment, the potential for new blockchain competitors, and regulatory challenges when evaluating Ethereum’s future price potential.\n\nConclusion\n\nWhile Ethereum’s potential breakthrough is on many traders’ radar, it’s impossible to overlook the promising rise of InQubeta. By tapping into the limitless potential of AI technology and offering a unique, inclusive investment platform, InQubeta may well be setting a new standard in the crypto investment realm. On the other hand, Ethereum’s long-standing reputation and functionalities make it a contender for further price surges. Both these entities, in their distinct ways, are paving the path for an exciting future in the crypto space.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMirgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvYmFua2luZy9maW5hbmNlL2FuYWx5c3RzLWJ1bGxpc2gtb24tZXRoZXJldW0tZXRmcy1idXQtaG93LWlzLWV0aC1wZXJmb3JtaW5nLXBvbWVyZG9nZS1wcmVkaWN0ZWQtdG8tMjAwMC1pbi0yMDIzL2FydGljbGVzaG93LzEwMjY1NDgxNS5jbXPSAbIBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL2luZHVzdHJ5L2JhbmtpbmcvZmluYW5jZS9hbmFseXN0cy1idWxsaXNoLW9uLWV0aGVyZXVtLWV0ZnMtYnV0LWhvdy1pcy1ldGgtcGVyZm9ybWluZy1wb21lcmRvZ2UtcHJlZGljdGVkLXRvLTIwMDAtaW4tMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTAyNjU0ODE1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Analysts Bullish on Ethereum ETFs, but How Is ETH Performing? Pomerdoge Predicted to 2,000% In 2023 - The Economic Times",
        "content": "The narratives shaping the crypto market are quite intriguing. There appears to be a glimmer of hope for Ethereum ETFs as analysts have predicted its bullishness. On the flip side, Ethereum (ETH) performance has come under intense scrutiny as a result of the crypto market volatility.\n\nAmid these uncertain times, Pomerdoge (POMD), a new project , has surfaced in the crypto space with promising gains that captivate the minds of investors.\n\nClick Here To Find Out More About The Pomerdoge (POMD)\n\nEthereum ETFs (ETF) Set to Stay Bullish by Analysts' Projection\n\nModeled after the success of Bitcoin ETFs, Ethereum has come up with another exciting investment option that allows investors to trade on the stock exchange. The Ethereum ETFs which came up as a result of the Volatility Shares filing in June have heightened the intense competition between Bitcoin and Ethereum.\n\nCrypto experts are predicting that Ethereum ETFs may likely remain on the upward trajectory due to these factors. First, ETFs can be traded on the stock exchange which seems easier and more convenient for investors.\n\nSecondly, ETFs are an investment option that is secure and regulated. It can serve as an entry point for investors and financial institutions who may not be in sync with traditional cryptocurrency exchanges. By leveraging the ETH price and attracting more investors, ETH is expected to remain bullish.\n\nHow Is Ethereum (ETH) Shaping Up in Terms of Performance\n\nAfter the early 2023 bull run in which many crypto tokens receive price boost, the reality of the current market is beginning to set in. Ethereum which had jumped the $2000 mark during the bull is now back to its pre-bull run price, with the current price trading at $1832.\n\nDespite this upheaval, experts are predicting a bullish run for Ethereum, with some analysts expecting it to outshine Bitcoin in the next bull run.\n\nWhile giving the reason for this perspective, the Chicago Mercantile Exchange (CME) Group stated that the Bitcoin halving which is expected to happen next April and the massive adoption of Ethereum by financial institutions is an obvious sign that Ethereum will bounce back to the $2000 threshold.\n\nPomerdoge (POMD) Set to Dethrone SHIB and DOGE\n\nAnalysts remain bullish on Pomerdoge, a new project bringing new ideas into the gaming industry. Pomerdoge is a newly built gaming platform that allows players to compete, interact and network globally. The platform will allow players through its Pomerplace marketplace to transact in-game assets like NFTs, cards and avatars.\n\nPomerdoge has also developed a utility token that will serve as a transaction token on the platform. Those who purchase the token at presale value will have access to the collection of 7,777 NFTs when they are launched.\n\nPOMD holders will also be able to acquire a certain percentage that is commensurate with their token worth from the platform game revenue. To vouchsafe investors' assets, Pomerdoge has undergone auditing by SolidProof and Cyberscope.\n\nAnalysts are predicting that POMD will skyrocket by 2,000% before the end of the year.\n\nFind out more about the Pomerdoge (POMD) Today\n\nWebsite: https://pomerdoge.com/\n\nTelegram Community: https://t.me/pomerdoge\n\nDisclaimer:\n\nThis is an advertorial. BCCL disclaims any and all warranties - expressed or implied - relating to the content and does not guarantee, vouch for, or endorse any of the content. The content does not promote, suggest or present Crypto products to be a way to solve financial difficulties / achieve financial security / act as an alternative to employment / income opportunity. Crypto products, crypto currencies, NFTs are unregulated and may be risky, with no legal recourse in case of monetary loss. Views expressed herein are independent opinions based on studies. You may act at your own risk while relying on the content of this advertorial. Should you make a decision to act, or omit to act, you should seek appropriate legal advice in the relevant jurisdiction.\n\nDisclaimer: Content Produced by IPD"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdGVjaG5leHQyNC5jb20vMjAyMy8wOC8xMi92aXNhLWludHJvZHVjZXMtZXRoZXJldW0tZ2FzLWZlZS1wYXltZW50LWZlYXR1cmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Visa introduces Ethereum gas fee payment feature - Technext",
        "content": "Get the best of Africa’s daily tech to your inbox – first thing every morning.\n\nJoin the community now!"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZXVyb3dlZWtseW5ld3MuY29tLzIwMjMvMDgvMTEvd2h5LWV0aGVyZXVtLWV0aC1wZXBlY29pbi1wZXBlLWFuZC1hbmFyY2h5LWFuYS1jb3VsZC1iZS10aGUtYmVzdC1pbnZlc3RtZW50LXRoaXMteWVhci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Why Ethereum (ETH), Pepecoin (PEPE), and Anarchy (ANA) Could Be the Best Investment This Year? - Euro Weekly News",
        "content": "By Guest Writer • Updated: 11 Aug 2023 • 15:58\n\nImage: Anarchy\n\n2023 has been a particularly exciting year for the crypto-verse, as tokens kept stunning us from the first week. Even now, Ethereum (ETH), Pepecoin (PEPE), and Anarchy (ANA) are still viable projects for investment, with Anarchy topping that list at the moment.\n\nThe reason for this is simple, meme coins are the rave in the cryptocurrency market, and Anarchy (ANA) is miles ahead of any other meme project.\n\nEthereum (ETH), Pepecoin (PEPE): Should I Buy ETH and PEPE?\n\nEthereum (ETH) and Pepecoin (PEPE) have taken quite different paths in the cryptocurrency market, leaving investors with a crucial decision to make. Let’s take a closer look at both tokens to help you make an informed choice.\n\nEthereum (ETH) has been a dominant force since its launch in 2015. Initially, it started as an ICO, which successfully raised $19 million in just a month, setting the stage for its future success. Over the years, Ethereum has evolved into a versatile platform, offering an extensive collection of decentralized applications (dApps) and smart contracts. Its robust ecosystem and widespread adoption have solidified its position as one of the top cryptocurrencies, attracting crypto enthusiasts and developers alike.\n\nOn the other hand, Pepecoin (PEPE) made headlines in 2023 with an astonishing price rally that surpassed 10,000%. This meteoric rise caught the attention of the entire cryptocurrency market, making it one of the hottest meme coins. However, since reaching its peak in May, PEPE’s price has been on a gradual decline, leading some to question its long-term sustainability and potential.\n\nWhile Ethereum continues to be a reliable and solid investment option with its wide range of utilities and innovative technology, there’s another contender that has been making waves in the meme coin space – Anarchy (ANA).\n\nAnarchy (ANA) Set to Recreate Pepecoin’s Launch\n\nThe meme coin market has been especially trendy in 2023, with Floki Inu (FLOKI), Pepecoin (PEPE), and Anarchy (ANA) already making it to the heart of the crypto buzz. Anarchy (ANA) is set to beat Pepecoin’s launch success. And why not? Its ongoing presale success is already telling tales of a promising launch.\n\nBut that’s where Anarchy’s similarities with the rest of the meme coin sector end. The meme coin brings something different to the table with its focus on bantering corrupt politicians and policymakers while also empowering its users with gains from their crypto investments.\n\nThat’s a lot for a meme coin, you think. But there is still more, and here are some of what to expect from the project.\n\n● Memes, But Not Just Entertainment!\n\nWhat did you expect? No memes? Heck no! What’s a meme coin without its memes? Anarchy’s creative team will work overtime to ensure the memes and jokes flow around the clock. And why? Anarchy (ANA) will give the government hell with its revolution, but it won’t use Twitter hashtags and protest placards. The memes will call out the corruption in government while giving everyone a good laugh at the end of it all.\n\n● Launch On Ethereum (ETH) Blockchain\n\nEthereum’s blockchain is a haven of treasure for any budding project. Its vast collection of DApps and massive user traffic are just the right mix for fast platform growth. Plus, Ethereum (ETH) has one of the most secure blockchains in the cryptocurrency market, so Anarchy (ANA) users have little to worry about regarding transaction glitches and server failure.\n\nAnarchy (ANA) Presale Update!\n\nYou might have missed out on Pepecoin’s launch, but Anarchy (ANA) is still profitable crypto business for investors this year. Anarchy’s presale is already over $2 million in sales, and there are still 100x potential profits to think about.\n\nThe ANA tokens go for $0.00024 each, and you can get them from the presale website to start your Anarchy (ANA) journey.\n\nAnarchy Website Anarchy Twitter Anarchy Telegram\n\nSponsored\n\nWARNING: The investment in crypto assets is not regulated, it may not be suitable for retail investors and the total amount invested could be lost\n\nAVISO IMPORTANTE: La inversión en criptoactivos no está regulada, puede no ser adecuada para inversores minoristas y perderse la totalidad del importe invertido"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vYml0Y29pbi5jb20uYXUvbGl0ZWNvaW4tdnMtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Litecoin vs Ethereum - Bitcoin Australia",
        "content": "You’ve probably heard of Bitcoin – the big name in the cryptocurrency world. But today, we’re diving into two other digital coin superstars: Litecoin and Ethereum. It’s not just about picking team blue or team green. Each has its own unique features, strengths, and uses. Whether you’re curious about dabbling in digital coins or simply looking to learn more about these crypto giants, join us as we dive deep into the Litecoin vs. Ethereum.\n\nShort Summary\n\nLitecoin and Ethereum are distinct cryptocurrencies with unique features; Litecoin focuses on fast and affordable transactions, while the Ethereum network emphasises smart contracts and a platform for decentralised applications.\n\nKey differences lie in their consensus mechanisms, hashing algorithms, and network scalability, with Ethereum transitioning to a more energy-efficient proof-of-stake and Litecoin retaining its proof-of-work model.\n\nBoth offer robust security features and decentralisation, ensuring transparent, trustworthy transactions and operations across their networks.\n\nContents\n\nUnderstanding Litecoin and Ethereum\n\nThink of Litecoin and Ethereum as two totally different apps on your phone. Litecoin, created by Charlie Lee in 2011, is like a speedy version of Bitcoin, aiming to process transactions quickly and efficiently—it’s like your go-to messaging app that sends texts in a flash! On the other hand, Ethereum, cooked up by Vitalik Buterin in 2015, isn’t just about sending and receiving coins. It introduces ‘smart contracts’—think of them as customisable mini-programs running on the blockchain. So, while both Litecoin and Ethereum are cryptocurrencies, they have different purposes and features. It’s a bit like comparing your favorite game app with a handy productivity tool—both super cool, but in different ways!\n\nLitecoin’s Purpose\n\nLitecoin is like the slightly younger sibling to Bitcoin, named . It was created back in 2011 by a guy named Charlie Lee, with the idea of being the “silver” to Bitcoin’s “gold”. In simpler terms, if Bitcoin is like the big, fancy store downtown where everyone goes to buy expensive things, then Litecoin is like the local convenience store – faster, more accessible, but still pretty cool. It was designed to process transactions quicker than Bitcoin, making it a great choice for smaller purchases and everyday use. So, in a way, while Bitcoin is often seen as a store of value (like gold bars in a vault), Litecoin is more like the change in your pocket, always ready to be spent.\n\nEthereum’s Vision\n\nThink of the Ethereum network like a massive LEGO set, but for the digital world. Instead of just being another cryptocurrency like Bitcoin, Ethereum wanted to be a platform where people can build anything they dream up, using special pieces called “smart contracts.” Imagine building a LEGO castle that can move its drawbridge all by itself whenever someone approaches. In the digital space, these smart contracts are like self-operating programs that follow specific rules. So, Ethereum’s big vision is to create a world where anyone can design their own projects, games, or even digital businesses, all without needing a middleman like a bank or a company. It’s like giving everyone the tools to be their own inventor, but in the online universe!\n\nComparing Key Features\n\nAlright, so imagine Ethereum and Litecoin are like two different types of cars. Both can get you from point A to B, but they have different features under the hood. Let’s dive into how they’re built and how they operate, so we can get a better sense of what makes each one unique.\n\nConsensus Mechanisms\n\nWhen it comes to cars, we have traffic rules to keep things in order, right? Similarly, in the cryptocurrency world, we have something called a “consensus mechanism” to make sure everyone plays fair and agrees on the same version of events. Ethereum originally used something called “Proof of Work” (like Bitcoin) where computers compete to solve complex math problems. After transitioning to proof-of-stake, Ethereum now consumes roughly 99% less energy than before and is far more cost effective, efficient and ecologically friendly as well. On the other hand, Litecoin continues to run its platform with an unchanged proof-of-work model.\n\nHashing Algorithms\n\nNow, onto the engines! If our cryptos are cars, then hashing algorithms are like their engines. They take in data, churn it up, and output a fixed code, ensuring everything’s secure. Ethereum uses something called “Ethash” for its engine, which is tailor-made for Ethereum’s needs. Litecoin, however, runs on “Scrypt”. It’s like choosing between a diesel and petrol engine; both do the job but have their own strengths and quirks.\n\nNetwork Scalability\n\nLastly, let’s talk about how many passengers these cars can carry, or in crypto terms, “network scalability”. If too many people try to use a cryptocurrency at once, it can get congested, like a traffic jam. Ethereum has faced some scalability issues in the past, but they’re working on solutions, like Ethereum 2.0, to handle more transactions. Litecoin, being a bit lighter and designed for faster transactions, can handle its traffic pretty smoothly, but it’s still smaller in scale compared to the big highways Ethereum aims to build.\n\nTransaction Speed and Fees\n\nOkay, let’s think of cryptocurrencies like online shopping. You’ve put something in your cart, and now you’re deciding between standard shipping (takes a bit longer, might be cheaper) and express shipping (super quick, but maybe pricier). In the crypto world, the “shipping” is how fast your transaction gets processed and how much it costs. So, let’s break down these “shipping” options for our digital money.\n\nTransaction Speed\n\nImagine you’re sending a digital coin to your friend. How fast that coin gets to them is the transaction speed. Some coins are like lightning – zap, and they’re there! Others might take a bit longer, like waiting for that slow pizza delivery. Ethereum, for example, can be pretty quick, but if their network is super busy, it might slow down. Litecoin, on the other hand, is designed to be speedy Gonzales, with a goal of processing transactions in just 2.5 minutes. So, it’s kinda like choosing between express and standard delivery, each coin has its own pace.\n\nTransaction Fees\n\nWhen it comes to transaction fees, Litecoin is the clear winner in terms of affordability and practicality for everyday use. Usually transactions with Litecoins cost around $0.0070 which makes them suitable for even smaller transactions compared to Ethereum whose gas-based system can result in higher costs depending on complexity and network demand during peak times.\n\nSecurity and Decentralisation\n\nImagine you’ve got this super secret diary where you write down all your thoughts. Now, instead of keeping it under your pillow (because let’s be honest, everyone checks there), you’ve made copies and given them to a bunch of trusted friends. This way, even if one friend loses their copy or someone tries to change what you wrote, the others can vouch for the original content. This idea of spreading things out for safety is at the heart of ‘security’ and ‘decentralisation’ in the world of cryptocurrencies. Let’s dive deeper.\n\nSecurity Features\n\nThe first thing to know about crypto is that it’s super focused on keeping things secure. It’s like having a diary with a hi-tech lock and an alarm system. Cryptocurrencies use complex math (called cryptography) to make sure your coins are safe and transactions are legit. Both Ethereum and Litecoin have their own “security guards”. Ethereum uses its unique ‘Ethash’ (remember, like its engine?), while Litecoin employs ‘Scrypt’ to keep things tight. These are like special codes that ensure no sneaky folks can tamper with your digital money or fake transactions.\n\nDecentralisation Levels\n\nBack to the diary example! Instead of one person or company being in charge (like a bank), cryptocurrencies spread their data across many computers worldwide. This is called ‘decentralisation’. It’s like if every time you wrote in your diary, all your friends with copies updated theirs too. So, if someone tried to sneak in and change an entry, the others would be like, “Hey, that’s not what the original said!” Ethereum and Litecoin both use this principle. By being decentralised, they make sure that no single group can control or mess with the system, making everything more transparent and trustworthy.\n\nSummary\n\nLitecoin and Ethereum are distinct pillars in the cryptocurrency landscape. Litecoin is tailored for quick and efficient transactions, while Ethereum offers versatility with its smart contracts. They differ in aspects like transaction speeds, fees, and core designs. By understanding these differences, users can navigate the crypto world more effectively. Both have their strengths, making them indispensable in the realm of digital currencies.\n\nFrequently Asked Questions\n\nWhat’s the main difference between Litecoin and Ethereum?\n\nThe primary difference is their purpose. Litecoin is designed primarily as a currency for fast and affordable transactions. Ethereum, on the other hand, is not just a cryptocurrency but also a platform for decentralised applications and smart contracts.\n\nHow do Litecoin and Ethereum differ in terms of transaction speed and fees?\n\nLitecoin is optimised for speed, aiming to process transactions in about 2.5 minutes, making it faster than Ethereum. In terms of fees, Litecoin transactions are generally cheaper, especially for everyday use, while Ethereum’s gas-based fee structure can vary depending on network congestion and transaction complexity.\n\nWhat is Ethereum’s vision with smart contracts?\n\nThe Ethereum blockchain aims to revolutionise the digital space by enabling users to create “smart contracts”, which are self-executing contracts with the terms directly written into code. These allow for customisable, decentralised applications to be built on the Ethereum platform without intermediaries.\n\nWhich consensus mechanism do Litecoin and Ethereum use?\n\nAs of 2023, Ethereum has transitioned from a proof-of-work (PoW) to a proof-of-stake (PoS) consensus mechanism, making it more energy-efficient. Litecoin, meanwhile, continues to use the proof-of-work model.\n\nAre Litecoin and Ethereum secure?\n\nYes, both Litecoin and Ethereum employ strong cryptographic techniques to ensure transaction security. Ethereum uses its unique ‘Ethash’ hashing algorithm, while Litecoin utilises ‘Scrypt’. The decentralised nature of both cryptocurrencies further enhances their security against potential attacks."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLWJyaWRnZS10by1zb2xhbmHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "How to Bridge to Solana - Watcher Guru",
        "content": "How to Bridge to Solana: The Ultimate Guide\n\nSolana and Ethereum are two prominent blockchain networks that have gained significant traction in the DeFi, NFT, and Web3 markets.\n\nAs the demand for interoperability between these networks grows, bridging tokens between Solana and Ethereum has become crucial for users looking to transfer assets seamlessly.\n\nThis comprehensive guide will explore how to bridge tokens between Solana and Ethereum using the popular Phantom Wallet.\n\nAlso read: How to Bridge to Ripple?\n\nSource: Outlook India\n\nUnderstanding Bridging\n\nBridging refers to the process of transferring tokens or coins from one blockchain network to another.\n\nIt enables users to move assets between different blockchains, overcoming the lack of cross-chain support.\n\nBridging is made possible through various mechanisms, such as cross-chain bridges and sidechains.\n\nIn the case of Solana and Ethereum, bridging allows for the seamless transfer of assets between these two networks, providing users with increased flexibility and access to a wider range of opportunities.\n\nAlso read: How to Bridge to Mantle?\n\nIntroducing the Phantom Wallet\n\nPhantom Wallet is a popular non-custodial cryptocurrency wallet that supports the Solana network.\n\nIt offers a user-friendly interface, robust security features, and seamless integration with various decentralized applications (dApps) on the Solana blockchain.\n\nRecently, Phantom Wallet has expanded its capabilities to support Ethereum and Polygon chains, making it an ideal choice for bridging tokens between Solana and Ethereum.\n\nSource: Bitcoinist\n\nPhantom Wallet Setup\n\nTo begin bridging tokens between Solana and Ethereum using Phantom Wallet, you must set up your device’s wallet. Follow these steps:\n\nVisit the Phantom Wallet website and download the wallet app for your preferred device (available for desktop and mobile). Install the wallet app and create a new wallet or import an existing wallet using your recovery phrase. Once your wallet is set up, ensure that you have both the Solana and Ethereum networks added to it.\n\nBridge from Solana to Ethereum with the Portal Bridge\n\nPortal Bridge, formerly known as Wormhole Bridge, is a cross-chain bridge that enables the transfer of assets between the Solana and Ethereum networks.\n\nHere’s how you can bridge tokens from Solana to Ethereum using the Portal Bridge:\n\nOpen your Phantom Wallet and navigate to the DApps section. Visit the Portal Bridge website within the Phantom Wallet browser. Connect your Phantom Wallet to both the Solana and Ethereum networks. Select the source chain as Solana and the target chain as Ethereum. Choose the token you want to bridge from the available options. Enter the number of tokens you wish to transfer and confirm the transaction. Wait for the bridge transaction to be processed and confirmed on both networks.\n\nSource: Youtube grab / Whiteboard Crypto\n\nSection 5: Bridge from Ethereum to Solana with Allbridge\n\nAllbridge is another reliable option for bridging tokens between Solana and Ethereum.\n\nIt supports the connection of EVM chains like Ethereum and Polygon with non-EVM chains like Solana, Fantom, and Near.\n\nFollow these steps to bridge tokens from Ethereum to Solana using Allbridge:\n\nAccess the Allbridge platform. Connect your Phantom Wallet to the Allbridge platform. Choose the option to bridge from Ethereum to Solana. Select the token you want to bridge from the available options. Enter the number of tokens you wish to transfer and confirm the transaction. Wait for the bridge transaction to be processed and confirmed on both networks.\n\nSection 6: Factors to Consider\n\nWhen bridging tokens between Solana and Ethereum, there are several factors to consider for a smooth and successful transaction:\n\nBridge Fee : Each bridging platform may have its own fee structure. Be aware of the bridge fees associated with your chosen platform and factor them into your decision-making process.\n\n: Each bridging platform may have its own fee structure. Be aware of the bridge fees associated with your chosen platform and factor them into your decision-making process. Transfer Speed: The time it takes for a bridge transaction to be processed and confirmed can vary. Consider the transfer speed the bridging platform offers and choose accordingly based on your requirements.\n\nThe time it takes for a bridge transaction to be processed and confirmed can vary. Consider the transfer speed the bridging platform offers and choose accordingly based on your requirements. Token Support: Ensure that the bridging platform supports the specific tokens you wish to transfer between Solana and Ethereum.\n\nEnsure that the bridging platform supports the specific tokens you wish to transfer between Solana and Ethereum. Security: Using reputable bridging platforms and exercising caution when entering your wallet addresses and confirming transactions is crucial. Be vigilant and double-check all details before proceeding.\n\nBenefits of Bridging\n\nBridging tokens between Solana and Ethereum offers several benefits to users, including:\n\nAccess to Unique Opportunities: Bridging allows users to tap into the vast ecosystems of both Solana and Ethereum, gaining access to unique applications and investment opportunities. Portfolio Diversification: By bridging tokens between Solana and Ethereum, users can diversify their cryptocurrency holdings across different blockchain networks, reducing risk and increasing potential returns. Lower Transaction Costs: Solana’s low transaction fees compared to Ethereum make bridging an attractive option for users looking to avoid high gas fees on the Ethereum network. Enhanced Liquidity: Bridging tokens between Solana and Ethereum increases liquidity by enabling seamless transfers between these two networks, opening up more trading possibilities. Cross-Chain Innovation: Bridging fosters cross-chain innovation by promoting interoperability and collaboration between different blockchain networks, driving the development of new decentralized applications and protocols.\n\nRisks and Considerations\n\nWhile bridging tokens between Solana and Ethereum offers numerous benefits, it’s essential to be aware of the risks and take the necessary precautions.\n\nSmart Contract Vulnerabilities: Smart contracts are an integral part of bridging platforms. Stay informed about potential vulnerabilities and ensure you only use reputable, audited smart contracts. Phishing Attacks: Be cautious of phishing attempts when entering your wallet addresses or interacting with bridging platforms. Verify the authenticity of the platforms and double-check all information before proceeding. Network Congestion: During high network congestion, bridge transactions may experience delays. Keep track of network conditions and plan your transactions accordingly.\n\nConclusion\n\nIn conclusion, bridging tokens between Solana and Ethereum using Phantom Wallet provides users with a seamless and efficient way to transfer assets between these two prominent blockchain networks.\n\nWhether you choose to use Portal Bridge or Allbridge, the process is straightforward and accessible to both novice and experienced users.\n\nBy bridging tokens, you can unlock a world of opportunities, diversify your portfolio, and take advantage of the unique features offered by both Solana and Ethereum.\n\nWhen selecting a bridging platform, consider the associated fees, transfer speed, token support, and security. Happy bridging!"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiJWh0dHBzOi8vZmludHkuY29tL2F1L2NyeXB0by9ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Investing in Ethereum (ETH): The Australian investor's guide - Finty",
        "content": "Ethereum (ETH) is a second generation cryptocurrency. Launched in 2015, Ethereum has much in common with its first generation counterpart, Bitcoin.\n\nLike Bitcoin, Ethereum uses distributed ledgers and cryptography to facilitate digital transactions. However, Ethereum is much more than a medium of exchange. It uses blockchain technology to monetise and facilitate self-executing programmatic contracts via its native token, ether (ETH).\n\nEthereum is widely regarded as the hottest platform in the crypto world with a wide range of data friendly services. Though Bitcoin is bigger than Ethereum by volume, Ethereum is faster than its first generation counterpart with the ability to validate transactions in seconds.\n\nUse these guides to learn more about what it does, how it works, and how you can invest in it from Australia."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2VyYy1zdGFuZGFyZHMtZXZlcnl0aGluZy15b3UtbmVlZC10by1rbm93LWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "ERC STANDARDS – Everything You Need to Know in 2023 - Analytics Insight",
        "content": "Discover everything about the different Ethereum standards like ERC20, ERC721, ERC1155 and more\n\nAccording to DefiLlama, Ethereum leads in terms of Total Value Locked (TVL) around $24 billion with an ecosystem of over 800 decentralised applications (dApps) based on the blockchain.\n\nThe data above signifies the popularity and robustness of Ethereum– the second-largest blockchain network in the world. With its genesis block created in July 2015 by Vitalik Buterin and Gavin Wood, the network has successfully managed to become the top choice for upcoming crypto projects.\n\nAnd the prime reason for the ever-growing usage and popularity of Ethereum is the development and maintenance of various crypto token standards by the ETH community. Some of the famous token standards include ERC20, ERC721, and ERC1155, which form the backbone of most of the stablecoins, NFTs and DeFi projects today.\n\nThis article comprehensively explains ERC standards and their pros & cons. Moreover, it also lists down different types of ERC tokens and standards widely used today.\n\nWhat is meant by ERC Standards?\n\nERC stands for ‘Ethereum Request for Comments.’ It is essentially a set of technical documentation comprising guidelines and standards for creating and managing smart contracts on the Ethereum blockchain. ERC standards state certain rules and guidelines that developers need to follow to ensure compatibility between the applications and the network.\n\nWhile Ethereum allows developers to create tokens that do not follow any crypto token standards, such tokens lack functionality and composability with other features of the network. Therefore, to enable features like transaction processing, fungibility/non-fungibility, security, and more, adhering to ERC standards is important.\n\nPros & Cons of ERC Standards\n\nPROS\n\nFacilitates composability and interaction between applications and the network\n\nEnhances the functionality of the network\n\nEnables features like token transfer functions, ownership, security and much more\n\nEstablishes a common language and set of guidelines for developers\n\nCONS\n\nRequires proper knowledge of blockchain and programming for one to understand\n\nEthereum’s core development team evaluates new token standards, causing uncertainty and delay in the deployment\n\nThe Ultimate List of All ERC Standards\n\nLet us have a look at an ERC tokens list comprising of 10 most-used token standards nowadays –\n\nERC20\n\nERC20 was one of the first Ethereum token protocols proposed in November 2015 by Fabian Vogelsteller that implements standards for fungible or interchangeable tokens. ERC20 Tokens show functionalities like balanceOf() for token balance checking, transfer() for token transfer, and approve() for transaction authorization. Due to their fungible nature, ERC20 tokens are suitable for stablecoins, utility and security tokens. Some famous ERC20 tokens are Ethereum(ETH), Chainlink(LINK), Tether(USDT) and Uniswap(UNI).\n\nERC165\n\nERC165, earlier known as EIP (Ethereum Improvement Proposal) 165 is a standard that allows smart contracts to run type introspection, an exercise of determining the properties of an object at runtime. Thus, ERC165 standard enables a smart contract to detect whether another contract implements certain features or not.\n\nERC621\n\nERC621 standard plays a key role in increasing and decreasing the total supply of circulation. This standard enhances the functionality of ERC20 tokens allowing them to be burned or redeemed for another asset.\n\nERC721\n\nHeard of NFTs? The ERC721 standard is the building block behind these Non-fungible Tokens. Unlike the ERC20, ERC721 tokens offer rarity and uniqueness. This means no ERC721 token is the same as another ERC721 token. Each NFT consists of a unique address and metadata (name or image) stored on the Ethereum network – making it easy to verify and transfer them.\n\nERC777\n\nERC777 offers extra features over the ERC20 tokens such as an emergency recover function in case the private key gets lost and a mixer contract for enhanced transaction privacy.\n\nERC827\n\nProposed in 2018, ERC827 is an Ethereum token standard that increases the functionality of ERC20 tokens by allowing users to transfer both data and currency simultaneously.\n\nERC865\n\nERC865 standard plans to reduce the transaction fee incurred by the users by introducing a function called ‘transferPreSigned’ – allowing a third party to pay the gas fees. This is helpful for dApps dealing with numerous token transfers.\n\nERC884\n\nERC884 is a proposed Ethereum standard that allows fractional ownership of assets across the blockchain. As fractional shares are economical, more users will adopt the network to buy the assets.\n\nERC1155\n\nProposed in 2018 by Witek Radomski (Enjin’s CTO), the ERC1155 standard enables the development of fungible, semi-fungible and non-fungible tokens on a single contract. This has led to a significant reduction in the number of transactions required to manage multiple types of ERC tokens and hence significantly increased the efficiency of the network.\n\nERC4626\n\nERC4626 standard is specially designed for yield-bearing vaults as it provides guidelines to optimize and combine their technical parameters. It can be beneficial for aggregators, lenders, and users as well to find the best yield for their crypto tokens.\n\nConclusion\n\nERC standards have been the driving force behind the growth and development of the Ethereum network. They provide a common set of guidelines for developers to build Native Tokens, DeFi projects, NFTs, etc. on the platform while ensuring the compatibility of these projects with other Ethereum-based applications as well. Therefore, following ERC standards is crucial for building functional, feature-rich, and seamless Ethereum-based applications.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2RjZy1jaGllZi1wbGF5aW5nLWR1bWItZ2VtaW5pLXdpbmtsZXZvc3Mv0gFOaHR0cHM6Ly9lbi5ldGhlcmV1bXdvcmxkbmV3cy5jb20vZGNnLWNoaWVmLXBsYXlpbmctZHVtYi1nZW1pbmktd2lua2xldm9zcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "DCG Chief Barry Silbert Is Playing Dumb: Gemini’s Cameron Winklevoss - Ethereum World News",
        "content": "Gemini co-founder Cameron Winklevoss has accused DCG’s Chief Executive Barry Silbert of playing dumb.\n\nWinklevoss has indicated that DCG’s motion to dismiss Gemini’s fraud lawsuit is baseless.\n\nThe Gemini co-founder believes that DCG’s defense will not hold up in front of a jury.\n\nGemini sued the Digital Currency Group last month for allegedly defrauding customers of the Gemini Earn Program.\n\nCameron Winklevoss has responded to the Digital Currency Group’s motion to dismiss the fraud lawsuit filed by Gemini last month. DCG’s filing on August 10 claimed that Winklevoss’ crypto firm had failed to support the fraud alleged against the crypto conglomerate and its founder Barry Silbert. In response, Winklevoss, who serves as Gemini’s president, has accused DCG and its chief of playing dumb in order to avoid responsibility.\n\nGood Luck In Front Of A Jury: Gemini’s Cameron Winklevoss\n\nThe Digital Currency Group’s motion to dismiss Gemini’s lawsuit highlighted that the complaint named DCG as the defendant, despite it having no direct business dealing with Cameron Winklevoss’ crypto exchange. The crypto conglomerate added that Gemini’s allegations pertaining to its transaction with its subsidiary, Genesis Global Capital.\n\nSilbert’s firm accused the Winklevoss twins of mounting a character assassination campaign on Twitter, to deflect the blame from the stranded customers of Gemini Earn Program. DCG also called out Gemini for avoiding responsibility, having actively promoted Genesis as a “sophisticated market participant” to its customers.\n\nIn an X (formerly Twitter) post earlier today, Winklevoss described DCG’s motion to dismiss as a brief written by a law school student making up baseless legal defenses. According to the Gemini founder, the motion was in line with Silbert’s playbook of refusing to take responsibility, playing dumb, and attempting to avoid accountability using technicalities.\n\nGood luck making these arguments to a jury of your peers. See you in court. Cameron Winklevoss\n\nWinklevoss also took issue with DCG’s claim of owing no direct duty to Gemini to correct the allegedly false statements made by Genesis. “When a company you own says you wrote a $1.1 billion check that you know you didn’t write, yes, you have a duty to correct this. Sorry, but this doesn’t even pass the giggle test,” the Gemini founder added."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hbGwtYWJvdXQtY3VydmUtZmluYW5jZXMtZGVjbGluaW5nLXN0ZXRoLXBvb2wv0gFIaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2FsbC1hYm91dC1jdXJ2ZS1maW5hbmNlcy1kZWNsaW5pbmctc3RldGgtcG9vbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "All about Curve Finance’s declining stETH pool - AMBCrypto News",
        "content": "The staked ETH pool on Curve has witnessed a significant downtrend.\n\nETH staking continued to see new entrants.\n\nKaiko’s report on 9 August highlighted a diminishing liquidity trend within one of Curve Finance’s [CRV] pools. The stETH-ETH pool, as indicated by the report, experienced a substantial outflow, resulting in decreased liquidity.\n\nThe $steth-ETH liquidity pool on Curve continues to see large outflows, reducing liquidity for the largest liquid staking token. pic.twitter.com/RDhNpq6vNt — Kaiko (@KaikoData) August 9, 2023\n\nIs your portfolio green? Check out the CRV Profit Calculator\n\nNotably, Curve Finance has been among the platforms benefiting from the increased utilization of staked ETH [stETH] following Ethereum’s [ETH] transition to Proof of Stake (PoS) and the subsequent activation of staking capabilities.\n\nCurve stETH trading volume and TVL declines\n\nIn addition to the reduction in stETH liquidity, there have been declines in trading volume and Total Value Locked (TVL) within the ETH-stETH pool over the past few months.\n\nDune Analytics data indicated that the TVL for this particular pool, which began the year at approximately $1.6 billion, has now decreased to roughly $398 million. This decline has consequently impacted the overall TVL of the Curve Finance platform.\n\nAdditionally, DefiLlama’s data illustrated a significant decrease in the platform’s TVL following a hack incident. The TVL plummeted from over $3 billion to around $1 billion. However, as of this writing, the TVL has recovered to approximately $2.4 billion, suggesting signs of improvement.\n\nAnalyzing ETH’s staking landscape\n\nThe decrease in the stETH pool’s size on Curve Finance prompted questions about the press time state of ETH staking. Insights from Glassnode revealed that ETH continued to be staked, albeit with a recent decline in the influx of new stakes.\n\nHow much are 1,10,100 CRVs worth today?\n\nNevertheless, a notable number of new stakes were still being observed.\n\nAs of this writing, the volume of newly staked ETH amounted to around 54,000. This situation indicated an ongoing and consistent inflow of stETH, although it appears that Curve Finance might not be capturing a significant portion of these inflows."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS94cnAtbGVkZ2VyLXN1cnBhc3Nlcy1ldGhlcmV1bS1pbi1kYWlseS10cmFuc2FjdGlvbnMtaGl0cy0xLTItbWlsbGlvbi10cmFuc2FjdGlvbnMtcGVyLWRheS_SAYIBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3hycC1sZWRnZXItc3VycGFzc2VzLWV0aGVyZXVtLWluLWRhaWx5LXRyYW5zYWN0aW9ucy1oaXRzLTEtMi1taWxsaW9uLXRyYW5zYWN0aW9ucy1wZXItZGF5Lz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "XRP Ledger Surpasses Ethereum in Daily Transactions, Hits 1.2 Million Transactions Per Day - Crypto News Flash",
        "content": "Since the beginning of August 2023, the XRP ledger has recorded 1.2 million transactions per day.\n\nAt the same time, the number of active addresses on the XRP ledger has also surged close to 200,000.\n\nEver since the court’s ripple ruling last month in July 2023, the XRP Ledger has witnessed a massive boost in transactions. Since the beginning of August 2023, the numbers have gone up even higher surpassing giants like Ethereum.\n\nOn-chain data shows that the XRP Ledger has been recording 1.2 million transactions per day this month in August. On the other hand, the Ethereum blockchain network recorded 1.09 million transactions every day, as per data on BitInfoCharts.\n\nAlso, the data shows that both these networks – XRPL and Ethereum blockchain – have been recording significantly higher transactions than Bitcoin, which has recorded 300,000 transactions per day on its blockchain. When considering total transaction volume, it’s important to highlight that Bitcoin led the way with over $8.35 billion transacted in July. In comparison, Ethereum witnessed $1.8 billion in transactions, while XRP recorded movement of nearly $500 million.\n\nIn the ruling last month, Judge Analisa Torres stated that the “programmatic” sales of XRP to retail players don’t constitute a security. Soon after the ruling, some of the top crypto exchanges like Coinbase re-listed the XRP token resulting in a huge surge in transaction volumes.\n\nXRP Active Addresses and XRP Price\n\nThe XRP network is experiencing a clear resurgence, with active addresses approaching 200,000. This metric underscores the network’s resilience despite recent price fluctuations.\n\nThe rising count of active addresses signifies that the XRP network retains a robust user base and transactional activity, even in the face of recent price declines. This growth in active addresses can be attributed to various factors.\n\nFirstly, the favorable outcome of the SEC lawsuit likely boosted confidence among current XRP holders and drew in new investors. The designation of XRP as a non-security may have acted as a guiding light, validating the asset’s credibility and its potential for future expansion.\n\nSoon after the Ripple court ruling, XRP was on an unprecedented price rally gaining more than 100% in less than a week’s time and hitting the 2023 high of $.094. However, it has reversed its trajectory since and has entered a significant retracement.\n\nAs of press time, the XRP price is trading at $0.63 and has a market cap of $33 billion. During this retracement, XRP lost its $20 billion market cap. XRP investors are once again waiting on the sidelines for the price to regain the important milestones of $1.\n\nRenowned cryptocurrency advocate and attorney, John Deaton, has outlined the factors contributing to XRP’s inability to reach the $1 mark, despite obtaining regulatory clarity from the XRP vs SEC case.\n\nIn a recent tweet, Attorney Deaton highlighted that had he foreseen XRP achieving regulatory clarity without reaching $1, many would have been skeptical. Similarly, he noted that people might have doubted his prediction that PayPal would unveil a stablecoin tied to the US dollar on the Ethereum network, while ETH’s value wouldn’t surge significantly.\n\nDeaton underscored that the subdued growth of XRP’s price can be attributed to Bitcoin’s strong consolidation phase. He further emphasized that Bitcoin, as the leading cryptocurrency by market capitalization, exerts substantial influence over the entire market. “Whether we like it or not, Bitcoin drives this market,” expressed Deaton.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYm9sZC5jb20vdmlzYS1pbnRyb2R1Y2VzLWEtd2F5LXRvLXBheS1nYXMtZmVlcy1vbi1ldGhlcmV1bS13aXRoLWEtY3JlZGl0LWNhcmQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Visa introduces a way to pay gas fees on Ethereum with a credit card - Finbold - Finance in Bold",
        "content": "Visa (NYSE: V) will use the current standard for Account Abstraction (ERC-4337) on Ethereum (ETH) in order to allow users to pay for their transaction’s gas fees directly with a Visa Credit Card, instead of keeping a certain amount of tokens available in the wallets for transactions fees.\n\nAs announced through an official post, this should be possible even with self-custody wallets, like Metamask, and could drive adoption of blockchain technologies.\n\n“One of the major obstacles in the world of crypto is the complex process of paying for transactions or operations on blockchains. Each operation, whether it’s a simple token transfer or a more intricate interaction with a smart contract, incurs a cost known as a ‘gas’ fee. In the case of Ethereum, this gas fee must be paid in the blockchain’s native token, ETH.” — Visa\n\nThe paper also explains that even for stablecoins transactions, like Circle USD (USDC), users are still required to have Ether (ETH) for gas fees.\n\nHow is it possible to pay gas fees with Visa’s credit cards?\n\nAccording to the example diagram shared by Visa, a user who wants to make a $200 worth purchase on a merchant’s website using Circle USD, but only has 1,000 USDC and no ETH, would initiate the blockchain transaction in a self-custodial wallet that supports ERC-4337, and chooses ‘Visa Card’ for gas fees.\n\nThe system would process the payment, paying the gas fees on the user’s behalf, allowing the transaction to be successfully sent to the Merchant’s wallet.\n\nSimplified user interaction image. Source: Visa\n\n“In this proposed solution, we once again put the paymaster at the heart of the process”, explains Visa. “A paymaster is a specialized type of smart contract account that can sponsor gas fees for user Contract Accounts (think of these as user-centric smart contracts).”\n\n“Our proposed solution liberates users from the need to hold native blockchain tokens or constantly engage in bridging tokens merely to cover gas fees. From a user’s perspective, this solution is appealing in its simplicity and ease of adoption.”\n\nPaying Gas Fees with a Visa Card via Paymaster. Source: Visa\n\nThe above process is still experimental, and users should be aware that there are risks involved.\n\nMeanwhile, most users will still face the burden of having to pay fees in order to use the vast majority of the available cryptocurrencies. Although, there are a few projects looking to solve the ‘fee issue’ on a protocol level, by completely removing transaction fees, like nano (XNO) or IOTA (MIOTA)."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMDgvZXRoZXJldW1zLWludmVudG9yLXZpdGFsaWstYnV0ZXJpbi1zaGFyZXMtdmlld3Mtb24tc2JmLWFuZC10aGUtcG90ZW50aWFsLW9mLWFpLWluLWNyZWF0aXZpdHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 12 Aug 2023 07:00:00 GMT",
        "title": "Ethereum's Inventor Vitalik Buterin Shares Views on SBF and the Potential of AI in Creativity - CryptoGlobe",
        "content": "Ethereum’s co-founder, Vitalik Buterin, recently expressed his perspective on Sam Bankman-Fried (aka “SBF”), the former CEO of now-defunct exchange FTX, and the crypto community’s initial skepticism toward him.\n\nAccording to a report by Decrypt, in episode 5 of The Aarthi and Sriram Show, Buterin revealed that despite Bankman-Fried’s prominence in mainstream media, many within the crypto space had reservations about him from the outset.\n\nButerin highlighted that a significant portion of the crypto community felt Bankman-Fried lacked a clear vision for the value of cryptocurrency technology. Instead, he seemed to view crypto primarily as a business opportunity to capitalize on. This perspective contrasted sharply with the foundational values of decentralization and the cypherpunk ethos that underpin projects like Bitcoin and Ethereum. Buterin emphasized that this might have been a primary reason for the existing mistrust towards Bankman-Fried.\n\nOn a different note, Buterin also commented on the advancements in artificial intelligence, particularly systems like ChatGPT. He expressed a positive outlook on AI’s potential to enhance human creativity rather than merely replace human roles. Buterin believes that, at its current stage, AI is more about empowering individuals than replacing them. He envisions a future where AI tools could enable individual creators to produce films and other artistic endeavors without the hefty costs associated with traditional Hollywood productions.\n\nButerin’s vision for AI in the entertainment industry is one where the cost of creating a movie could drastically reduce, allowing a single individual, armed with creativity and an AI platform to produce cinematic content. He sees this as an opportunity to move away from repetitive and overdone storylines, like the numerous remixes in popular culture, and shift towards unique narratives that reflect diverse values.\n\nFurthermore, Buterin regards the transition from human intelligence to superhuman AI as one of the most pivotal shifts in the history of our planet, likening its significance to only a few other monumental transitions in Earth’s history. However, he also acknowledged advanced AI’s challenges and potential risks. While he sees the need for research and possibly some targeted regulation, he cautioned against broad restrictions that could stifle innovation."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vYnV5LWFuYXJjaHktYW5hLW5vdy1pZi15b3VyZS1zZXJpb3VzLWFib3V0LWdldHRpbmctcmljaC10aGlzLXllYXItcmVub3duZWQtZXRoZXJldW0tZXRoLW1heGlzdC13YXJucy_SAY0BaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL2J1eS1hbmFyY2h5LWFuYS1ub3ctaWYteW91cmUtc2VyaW91cy1hYm91dC1nZXR0aW5nLXJpY2gtdGhpcy15ZWFyLXJlbm93bmVkLWV0aGVyZXVtLWV0aC1tYXhpc3Qtd2FybnMvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Buy Anarchy (ANA) Now If You’re Serious About Getting Rich This Year, Renowned Ethereum (ETH) Maxist Warns - Crypto News Flash",
        "content": "Anarchy (ANA), an up-and-coming meme coin, has caught the attention of a renowned figure in the Ethereum community, known for their steadfast support of the blockchain revolution.\n\nThis Ethereum Maxist, a visionary with a track record of accurately predicting trends, is now urging individuals to consider investing in Anarchy if they harbor serious ambitions of having massive profits this year. The recent endorsement of ANA has caught the attention of profit-driven investors. This backing reinforces the belief that this meme coin would soar high in the market.\n\nIn this article, we will take a look at the features and market prospects of Anarchy, exploring the reasons behind the Ethereum Maxist’s endorsement and analyzing the potential impact of ANA on your financial journeys as an investor. But first, let’s look at Ethereum.\n\n>>> BUY $ANA NOW <<<\n\nWhat is Ethereum (ETH)?\n\nEthereum took center stage by playing a pivotal role in driving the decentralized revolution. The ETH network has been at the forefront of the blockchain revolution, powering a wide range of decentralized applications (dApps) and enabling the rise of decentralized finance (DeFi). ETH has established itself as the go-to choice for developing blockchain-based solutions, thanks to its vibrant ecosystem, robust infrastructure, and extensive developer tools.\n\nEthereum Request for Comments (ERC) standards is a key aspect of Ethereum’s appeal in the market. These standards offer guidelines for developing smart contracts and dApps that can create, manage, and exchange tokens within the Ethereum network.\n\nAmong the various ERC standards, several stand out. The widely used ERC-20 standard allows for the creation of fungible tokens, facilitating seamless interchangeability and interoperability. On the other hand, ERC-721 is specifically designed for creating non-fungible tokens (NFTs), which have gained significant attention for their unique properties and applications.\n\nThese ERC standards have played a crucial role in shaping the development of the Ethereum ecosystem by establishing a common set of guidelines and protocols for creating and managing tokens on the blockchain. They have fostered interoperability, standardized token functionality, and facilitated the growth of tokenized economies.\n\nAs Ethereum (ETH) continues to evolve, it remains the platform of choice for developers seeking to harness the potential of blockchain technology. Its vibrant ecosystem, coupled with the versatility and utility of ERC standards, ensures that Ethereum will continue to drive innovation, foster growth, and provide a solid foundation for the development of blockchain-based solutions.\n\nNow, let’s delve deeper into understanding what ANA is and what it aims to achieve.\n\nSomething huge is coming. If you see this 👀 Then your early! pic.twitter.com/HssZ4ywwrJ — ANARCHY (@anarchycoineth) June 10, 2023\n\nAnarchy (ANA): What is ANA About?\n\nSay hello to Anarchy, a super cool project built on the Ethereum blockchain! ANA, the star of the show, aims to use the ERC-20 to shake things up and bring some awesome changes to traditional systems. Embracing decentralization, Anarchy puts the power right back into the hands of the people. Yep, you read that right – YOU get to control your financial future and join in the decision-making fun!\n\nANA has a clever trick up its sleeve – creative strategies like memes! These cheeky tactics are used to call out dishonest behavior and give a big thumbs-down to the broken structures that rule our society. Time for some change, folks!\n\nBut wait, there’s more! Anarchy is all about progress, so it introduces a DAO system. What’s that, you ask? Well, it’s a fancy way for all members to vote on where the funds should go – investments or even charity work! Everyone’s invited to the party, and any profits made will be shared among all the cool peeps.\n\nOh, and here’s a little secret to keep the ANA token valuable – Anarchy uses a token burn mechanism! After each transaction, a tiny percentage of tokens (0.5%) gets removed from circulation. This makes ANA a bit scarce and more valuable over time!\n\nSo, don’t miss out on this wild ride with Anarchy and ANA. It’s time to have some fun and make a difference together!\n\n>>> BUY $ANA NOW <<<\n\nJoin Others to Purchase ANA Tokens\n\nThe ANA token presale is in full swing and has already gathered over $2 million in sales. Don’t miss this golden chance to change your financial fortunes!\n\nEach ANA token is currently available at a discounted price of just $0.00024. Grab this opportunity now and join others who are capitalizing on it to seek potential growth in their portfolios.\n\nBuy ANA Today!\n\nAnarchy Website Anarchy Twitter Anarchy Telegram\n\nThis publication is sponsored. Crypto News Flash does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. Readers should do their own research before taking any actions related to cryptocurrencies. Crypto News Flash is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDgvMTEvY3J5cHRvLWNvbS1lbmFibGVzLXdpdGhkcmF3YWxzLWV0aGVyZXVtLXprc3luYy1lcmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Crypto.com enables withdrawals on the Ethereum zkSync Era - The Cryptonomist",
        "content": "It’s official: the cryptocurrency exchange Crypto.com has formalized the integration of zkSync Era, on layer-2 of Ethereum network, into its deposit and withdrawal section.\n\nUsers can thus take advantage of the speed and low gas consumption of the zk-rollup blockchain to transfer ETH from one wallet to another.\n\nLet’s look at all the details together.\n\nEthereum: Crypto.com integrates deposits and withdrawals via the zkSync Era network\n\nThe centralized trading platform Crypto.com has officially opened its doors to Ethereum’s layer-2 blockchain zkSync Era, enabling deposits and withdrawals for users through this network.\n\nThe news, which came yesterday via a Twitter post from the exchange, is very important for the layer-2 industry as it is the first instance of a zk-rollup network being integrated within a CEX.\n\nUsers of Crypto.com can take advantage of the zk-evm network that involves low fees and fast transaction executions: just consider that gas consumption can be as low as 1/100 compared to Ethereum while on the scalability front, up to 2000 transactions per second can be processed.\n\nInitially, deposits and withdrawals via zkSync Era are only available in ETH currency, but could be expanded to more tokens in the future.\n\nThe integration applies to both the web exchange and the app.\n\nWith this latest move, Crypto.com is aiming to carve out a new slice of audience after last years’ slide in which many users abandoned the platform due to reduced incentives on credit card cashback.\n\nWe hope that the implementation of the zkSync Era network will help the exchange compete at a high level again.\n\nThe CRO coin, despite the excellent news, did not see particular price movement yesterday, with a negative change of 0.33%.\n\nThe cryptocurrency currently trades at $0.057, down more than 93% from its all-time high in November 2021.\n\nFocus on zkSync Era\n\nzkSync Era is a layer-2 scaling solution for the Ethereum blockchain, developed by Berlin-based technology company Matter Labs.\n\nThe project was funded to the tune of $458 million by private investment from a number of companies and venture capitalists such as a16z, the Ethereum Foundation, Coinbase Ventures, Blockchain Capital, 1kx and others.\n\nAs a zk-evm blockchain, zkSync Era uses “SNARK” zero-knowledge cryptographic proofs to prove that all transactions wrapped in the rollup are valid.\n\nOther layer-2 “optimistic rollup” such as Arbitrum and Optimism use fraud proofs and act only when they detect erroneous data in transactions, while considering all wrapped TXs valid by default.\n\nLaunched in the mainnet in March 2023, the zkSync Era cryptographic network immediately attracted the attention of the DeFi world community, eventually capitalizing a TVL of $443 million according to L2Beat data.\n\nThe main decentralized applications in the crypto ecosystem are Syncswap, Mute.io, Maverick, IziSwap, Velocore, SpaceFi, EraLend, Pancakeswap,VeSync, and Reactor Fusion.\n\nA total of 939,648 ETH were bridged from the Ethereum blockchain within just five months for a counter value of $173 million.\n\nThe number of users of the infrastructure has skyrocketed in recent months to 1.47 million wallets and 1.8 million transactions made.\n\nThe success of zkSync and its rapid rise among top-of-the-line blockchains is justified by the narrative of a rumored airdrop of a governance token that is expected to arrive soon for all early adopters of the layer-2.\n\nBeyond that there is the efficiency of the chain and the convenience of zk-rollups: currently a transaction on zkSync Era is processed in seconds and requires payment of about $0.10 in gas fees.\n\nWe will most likely hear more and more about this network and the results that will be achieved."
    }
]