[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8wOS93aGF0LWhhcHBlbnMtaWYtZXRoZXJldW0taXMtYS1zZWN1cml0eS_SAVZodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDMvMDkvd2hhdC1oYXBwZW5zLWlmLWV0aGVyZXVtLWlzLWEtc2VjdXJpdHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "What Happens if Ether Is a Security? - CoinDesk",
        "content": "It is not, however, a foregone conclusion that the SEC will seek to classify ETH as a security. \"From a practical standpoint I still think it is very unlikely that the SEC is going to declare the current offer and sale of ETH to involve unregistered securities transactions,\" said Gulovsen, because \"the impact of doing so would be devastating to a large number of American investors\" and \"the amount of resources necessary to properly enforce that declaration\" would be \"far beyond what the SEC is probably willing\" to allocate."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmxlZGdlcmluc2lnaHRzLmNvbS9ldGgtZXRoZXJldW0tc2VjdXJpdHktbmV3LXlvcmstYXR0b3JuZXktZ2VuZXJhbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "New York Attorney General says ETH is a security - Ledger Insights",
        "content": "Continuing the regulatory clampdown on the cryptocurrency sector, the New York Attorney General has alleged that the Ethereum network token ETH is a security. It made the assertion in a lawsuit filed against crypto exchange KuCoin, alleging that it is operating in New York state without licenses as a commodities broker-dealer and securities broker-dealer.\n\nJoe Lubin, the founder of ConsenSys, was a major backer of Ethereum in the early days and had a big chunk of ETH at the time of its initial coin offering (ICO). ConsenSys is heavily involved in both crypto and enterprise applications of Ethereum including as maintainer of the Quorum enterprise blockchain. Ethereum was the first permissionless blockchain to show potential for various applications beyond payment, including real world solutions.\n\nBackground: A security or a commodity?\n\nBitcoin is generally considered a commodity, in part because it didn’t have an ICO. But we’ll come back to that. ETH is considered a commodity by the CFTC, and a 2018 speech by SEC Director William Henman implied that ETH probably was a commodity as well.\n\nThe well known Howey test looks at an investment contract. To determine if it’s a security, it asks whether it involves:\n\nThe investment of money\n\nin a common enterprise\n\nwith a reasonable expectation of profits derived from the efforts of others.\n\nHinman (sort of) added a ‘sufficiently decentralized‘ test: “If the network on which the token or coin is to function is sufficiently decentralized – where purchasers would no longer reasonably expect a person or group to carry out essential managerial or entrepreneurial efforts – the assets may not represent an investment contract.”\n\nHence, it was thought ETH probably was a security at the time of the ICO, but by 2018, perhaps it was not.\n\nIs it about staking or new legal precedents?\n\nThe NYAG court filing includes the following text, which interprets ETH as an investment and also references staking activities.\n\nThe court case states, “ETH satisfies the Waldstein test. The ICO was used to raise funds to develop the Ethereum network, as set forth in the ICO Documents. And Vitalik Buterin and the Ethereum Foundation retained large positions of ETH that they continue to use to fund ETH’s development. ETH was also designed as an investment. It continues to be referred to as an “investment” on the Ethereum Foundation’s website. And ETH is used to generate staking rewards for investors. Furthermore, ETH was used to promote the Ethereum enterprise because ETH is needed to process any transactions on the Ethereum network.”\n\nThere’s a lot more in the document about the ICO and staking.\n\nBut the NYAG filing also leans on a recent court case in late 2022 where a summary judgment ruled that the LBRY-issued LBC token was a security based on the Howey test. LBRY did not conduct an ICO, and LBC was designed as a utility token for a video network.\n\nAn interpretation of the ruling highlighted that LBRY and insiders retained significant quantities of the token, which reinforces the third prong of the Howey test of an expectation of profit based on the efforts of others. However, the alignment of interests is also evidence of a common enterprise. Ropes & Gray argued the case collapsed Howey prongs two and three into a single argument contrary to court precedent.\n\nThe law firm added, “There are numerous reasons for a project to retain portions of its own coin that would not relate to an expectation that the coin will increase in value. For example, a project may retain a portion of its own coins to facilitate validation of transactions on a proof-of-stake network.”\n\nMeanwhile, the trial between the SEC and Ripple over whether or not XRP is a security has yet to conclude after starting under the previous administration."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vdGhlZGVmaWFudC5pby9tYXJrZXRzLWRvd24tbnlhZy1jYWxscy1ldGgtc2VjdXJpdHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 21:29:27 GMT",
        "title": "ETH Crashes 7% After NYAG Calls Ethereum A Security - The Defiant - DeFi News",
        "content": "Crypto Exchange Kucoin Accused Of Acting As Unlicensed Broker-Dealer\n\nBy: Aleksandar Gilbert • Loading...\n\nBreaking News\n\nCrypto markets plummeted Thursday after the New York Attorney General called Ether a security in a lawsuit against crypto exchange KuCoin.\n\nBitcoin and Ether fell more than 7% on the news. Tokens for BNB, Cardano and Polygon, the largest smart contract platforms by market capitalization after Ethereum, are down more than 6% from the previous day.\n\nIn its lawsuit, the New York Attorney General’s office accused KuCoin of acting as a securities broker-dealer and “falsely representing itself as an exchange.”\n\n“KuCoin did not have the necessary license to operate in the state of New York. That representatives from the attorney general’s office were able to buy and sell cryptocurrency through the site constituted a clear violation of the law,” they said.\n\nThe lawsuit seeks to block New Yorkers’ access to KuCoin “until it complies with the law.”\n\nIn a news release, the office highlighted its categorization of ETH as a security.\n\n“The petition argues that ETH, just like LUNA and UST, is a speculative asset that relies on the efforts of third-party developers in order to provide profit to the holders of ETH,” the release notes."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAzLzEwL3doeS1iaXRjb2luLWV0aGVyZXVtLWFuZC1zb2xhbmEtYXJlLWNyYXNoaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Solana Are Crashing Today - The Motley Fool",
        "content": "What happened\n\nCryptocurrencies have had a rough couple of days as word spread that the influential Silicon Valley Bank, which trades under SVB Financial Group (SIVB.Q 8361.54%), is facing a liquidity crisis. While this isn't directly a hit to crypto, many venture capital firms use Silicon Valley Bank, so there's a risk of a broader financial impact, which is why cryptocurrencies are down Friday.\n\nAs of 10:30 a.m. ET, Bitcoin (BTC 0.90%) had fallen by 8.5% over the prior 24 hours, Ethereum (ETH 1.41%) had fallen 8.8%, and Solana (SOL -1.36%) was down 5.7%. Looking further back, over the past seven days, those cryptocurrencies are down 11.2%, 10.7%, and 18.5% respectively.\n\nSo what\n\nThe two major events of the past week have been the collapse of Silvergate Capital and the potential collapse of Silicon Valley Bank. Silvergate provided a direct gateway into cryptocurrencies for many wealthy investors and institutions, and even operates many publicly traded funds. But it was seen as a more crypto-specific bank.\n\nThis week's bank run on Silicon Valley Bank is more concerning for the broader tech ecosystem. It is used by many start-ups and provides services small companies need in order to scale their businesses quickly.\n\nContagion, or cascading risks from one entity to another, is the biggest fear here. That could lead to less lending and investors pulling back their investments. Silicon Valley's venture capital firms provide the fuel for the tech ecosystem, and anything that impacts them could impact a lot of smaller start-ups.\n\nAs far as crypto goes, dozens of blockchain start-ups have been funded by venture capitalists in Silicon Valley. If they face pressure from regulators, banks and ultimately, investors, they may not be able to build the tools and services that are intended to make cryptocurrencies like Bitcoin, Ethereum, and Solana more useful, and thus more valuable.\n\nIn short, these ecosystems are intertwined, and the fear this week is that a collapse of Silicon Valley Bank will make this crypto winter even worse.\n\nNow what\n\nThe risk to financial institutions can't be understated because they're critical to making the financial system work. When lending pulls back all at once or there's a credit crisis, there can be an economywide impact, as we saw in 2008 and 2009.\n\nThe Labor Department's February jobs report Friday morning did provide some positive news. The U.S. economy added 311,000 non-farm jobs last month, but more people entered the workforce to seek jobs, so the unemployment rate rose to 3.6%. So far, the tech sector slowdown, the crypto collapse, and the downfall of some banks haven't spilled over to the broader economy.\n\nInvestors with a long-term view should start looking at this as a buying opportunity for high-quality cryptocurrencies. Despite the downturn in token values, the crypto industry continues to grow and innovate, which is ultimately what's going to drive value.\n\nI don't know if we are at or even near the bottom, but I am betting on innovation in the blockchain winning in the long term. The Ethereum and Solana blockchains are where most developers are building, and that's where I'm looking to be a buyer if this crash gets worse."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMjMxMDIvbmV3LXlvcmstYXR0b3JuZXktZ2VuZXJhbC1rdWNvaW4tZXRoZXJldW0tc2VjdXJpdHnSAVJodHRwczovL2RlY3J5cHQuY28vMTIzMTAyL25ldy15b3JrLWF0dG9ybmV5LWdlbmVyYWwta3Vjb2luLWV0aGVyZXVtLXNlY3VyaXR5P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "New York Attorney General Sues KuCoin, Claims Ethereum Is a Security - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe New York Attorney General's office today filed a lawsuit against cryptocurrency exchange KuCoin for allegedly violating securities and commodities laws in the state.\n\nIn the complaint, Attorney General Letitia James makes the startling claim that not only are Terra (LUNA) and TerraUSD (UST) securities, as previously alleged by the United States Securities and Exchange Commission, but also Ethereum (ETH), the second-largest cryptocurrency by market capitalization.\n\n“This action is one of the first times a regulator is claiming in court that ETH, one of the largest cryptocurrencies available, is a security,” today’s announcement read. “The petition argues that ETH, just like LUNA and UST, is a speculative asset that relies on the efforts of third-party developers in order to provide profit to the holders of ETH.”\n\nAD\n\nAD\n\nThe NYAG's lawsuit targets KuCoin for allegedly “falsely representing itself as an exchange” when really it is a “securities and commodities broker-dealer.” It aims to block access to the exchange in New York by forcing KuCoin to geo-fence its website based on IP addresses and GPS location.\n\nThe Seychelles-based exchange ranks fifth on CoinGecko's list of crypto exchanges based on \"trust score\" and 17th in the world based on 24-hour trading volume. KuCoin allows users to buy and sell cryptocurrencies like Bitcoin and Ethereum from virtually anywhere in the world, including the United States. The company once touted itself as “the most advanced and secure cryptocurrency exchange,\" before suffering a $150 million hack in 2020.\n\nThe lawsuit argues that ETH is a security because, among other reasons, users can now earn financial rewards by holding the cryptocurrency. “Since transitioning to the proof-of-stake consensus, possession of ETH translates directly to profit potential by earning staking rewards,” reads the lawsuit.\n\nEthereum last year became a proof-of-stake blockchain. This is a consensus mechanism which requires users to stake or “lock-up” its native cryptocurrency, ETH, to keep the network running. And the more ETH a user stakes, the more rewards they can potentially earn.\n\nThe timing of the lawsuit is also notable, given the attention that staking services have received lately from regulators. Just last month, the SEC fined popular American exchange Kraken $30 million because its staking product allegedly violated securities laws. And SEC Chairman Gary Gensler has hinted that Ethereum may be on the Commission's radar, repeatedly making public statements that suggest Bitcoin is the only crypto asset the SEC believes is a non-security.\n\nAD\n\nAD\n\nAttorney General Letitia James’s move is the latest in a tough crackdown by U.S. authorities on the crypto industry.\n\nThe SEC has ramped up enforcement actions of late, and politicians and lawmakers have turned up the anti-crypto rhetoric following the dramatic collapse of the once-dominant FTX crypto exchange and the arrest of its founder Sam Bankman-Fried.\n\nThe state of New York, which has some of the strictest laws in the country regarding crypto, last month filed a lawsuit against crypto exchange CoinEx for also failing to register itself as a securities and commodities broker-dealer."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NyeXB0by1jb21tdW5pdHktcmVhY3RzLXRvLW55YWdzLWxhd3N1aXQtaXMtZXRoZXJldW0tcmVhbGx5LWEtc2VjdXJpdHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Crypto community reacts to NYAG's lawsuit: Is Ethereum really a security? - CryptoSlate",
        "content": "Neeraj Agrawal, the Director of Communications at Coin Center, disagreed with the New York Attorney General’s (NYAG) recent assessment of Ethereum as a security.\n\n“Coin Center will be monitoring the case and if there’s an opportunity to weigh in, we will.”\n\nIn support of this view, Agrawal linked a 2018 article arguing that there is a difference between “a token pre-sale and the token itself.”\n\nApplicable securities laws use the Howey Test to determine whether a contract, scheme, or transaction meets the definition of a security. It focuses on resolving if investors paid money in a common enterprise with the expectation of profits from the efforts of others.\n\nAlthough these rules date back to the 1930s, before computers and digital assets, specific cryptocurrencies and Initial Coin Offerings (ICOs) (or token pre-sales) have met the definition of an investment contract, according to regulators.\n\nNYAG says Ethereum is a security\n\nOn March 9, the NYAG, Letitia James, filed a lawsuit against Seychelles-based exchange KuCoin, citing concerns over “falsely representing itself as an exchange.”\n\n“Today’s action is the latest in our efforts to rein in shadowy cryptocurrency companies and bring order to the industry.”\n\nJames said she could trade cryptocurrencies on the exchange in New York, yet the entity was not registered in the state. Furthermore, the AG added that users could buy and sell “popular virtual currencies, including ETH, LUNA, and TerraUSD (UST), which are securities and commodities.”\n\nAlthough the principal theme of the lawsuit centered on KuCoin operating illegally in New York, James categorically called out the trading of securities on the platform as a basis for operating illegally, not just failure to register.\n\nThis paves the way for Ethereum’s U.S. securities status to be determined in a court of law.\n\n“This action is one of the first times a regulator is claiming in court that ETH, one of the largest cryptocurrencies available, is a security.”\n\nThe crypto community chimes in\n\nLawyer Jake Chervinsky dismissed James’ claims about Ethereum, saying the enforcement action is simply an unfounded allegation, albeit an allegation from a regulator.\n\n“Agencies are like any other plaintiff: they can write whatever they want in a complaint. It may get some press, but it doesn’t change a thing.“\n\nSimilarly, Messari founder Ryan Selkis echoed Chervinsky’s comments, saying, “ETH is not a security.” However, Selkis did not provide his reasoning, only hinting at a coordinated attack against crypto, saying, “the administrative state is completely out of control.”\n\nMeanwhile, as expected, Bitcoin maximalist Max Keiser opposed the previous consensus, praising regulators for “finally doing their job.”\n\n“ETH is obviously a security. Now the regulators are finally doing their job. Shut this sh**show down, Gary!!!“\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbWlnaHQtZHJvcC10by0zNTAtd2hhdC1kb2VzLW9wZW5haS1nb3QtdG8tZG8td2l0aC1pdNIBVWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbWlnaHQtZHJvcC10by0zNTAtd2hhdC1kb2VzLW9wZW5haS1nb3QtdG8tZG8td2l0aC1pdD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Might Drop to $350: What Does OpenAI Got to Do With It? - U.Today",
        "content": "Advertisement\n\nCitron Research, a top-tier short seller and research company, explains why Ethereum (ETH) could be the worst sufferer of new U.S. regulatory attacks on the cryptocurrency sphere.\n\nEther to $350: Ethereum (ETH) slammed by Citron Research as NY Attorney comes for KuCoin\n\nIn its recent Twitter thread, Citron Research experts predicted that Ethereum (ETH) could be under fire as New York Attorney General files suit against KuCoin, a major centralized exchange.\n\n1/ The situation in Ethereum could get real ugly. If $ETH would be worth same as ChatGPT parent OpenAi it would put price of $ETH around $350. — Citron Research (@CitronResearch) March 10, 2023\n\nAs KuCoin is accused of selling unregistered securites, Ethereum (ETH) is one of them. Citron Research stressed that the security status of Ether (ETH) bacame even more obvious as the network migrated to proof-of-stake (PoS) consensus and replaced mining by staking.\n\nEthereum (ETH) failed to deliver on its promises of a \"decentralized network,\" researchers say. Instead, it become a full-fledged investment vehicle and should, therefore, be taxed and regulated accordingly.\n\nAs such, Ethereum (ETH) could better be compared to corporations, not to \"alternative\" systems like Bitcoin (BTC). Should one compare Ethereum (ETH) and OpenAI, a U.S.-based ChatGPT creator, by approximate market capitalization, Ethereum (ETH) would be valued at about $350.\n\nEthereum (ETH) is changing hands at $1,401 by press time. Should Citron Research be right about its prospects, it would be on the eve of a 75% price plunge.\n\nAs covered by U.Today previously, Citron Research is an adamant critic of cryptocurrencies: they slammed Ethereum (ETH) in 2022 and compared it to collapsed exchange FTX. Also, it bashed Grayscale Bitcoin Trust (GBTC), one of the most overhyped investment tools of the previous bull run.\n\nEthereum (ETH) or OpenAI, Lululemon, Chipotle and Twitter?\n\nWhen regulators investigate the internal processes of Etheruem (ETH), they will find an ordinary \"ICO,\" not \"smart contracts,\" the skeptics added:\n\nWhen the AG opens the Ethereum Network kimono we expect the secrets of the to be just as bad as any shadowy organization with: self dealings, shady ICO transactions, multiple attempts to avoid federal laws of taxation and securities, all while being controlled by a small group of people under a guise of decentralization.\n\nAlso, recent charity initiatives by Vitalik Buterin look suspicious to Citron Research: they might cover tax evasion and look too similar to FTX's patented \"effective altruism.\"\n\nIn order to demonstrate how absurd Ethereum's (ETH) current market capitalization is, Citron Research stressed that it is bigger than the market caps of OpenAI, Lululemon, Twitter and Chipotle combined, or as large as Disney."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9uZXh0LXN0b3Atc2hhbmdoYWktZXRoZXJldW0tcy1sYXRlc3QtbWlsZXN0b25lLWFwcHJvYWNoZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Next stop Shanghai — Ethereum's latest milestone approaches - Cointelegraph",
        "content": "The Ethereum ecosystem will continue its ongoing metamorphosis as the highly anticipated Shanghai upgrade draws near. The latest preeminent smart contract blockchain protocol improvement will activate Ether (ETH) withdrawals from Ethereum’s Beacon Chain.\n\nThe Merge marked a significant milestone for the Ethereum network in 2022, with the blockchain platform shifting from proof-of-work to proof-of-stake consensus. That change introduced validators as the new “miners” of the network, with staking ETH becoming a key component in maintaining the network.\n\nWhile full validators were required to stake 32 ETH to process transactions and add new blocks to the network, the broader ecosystem could stake smaller amounts of ETH to earn a share of rewards — much like an investor that puts capital into interest-bearing accounts.\n\nThose that locked up ETH to become validators have been unable to withdraw their staked holdings from the Beacon Chain. This changes with the Shanghai upgrade, and is a major reason for the increased fanfare around the latest change to the Ethereum network.\n\nThe Shanghai upgrade features a handful of Ethereum Improvement Proposals (EIPs) in addition to activating staking withdrawals. Cointelegraph reached out to members of the ConsenSys team, the Ethereum Foundation and analytics firm Nansen to unpack all aspects of the upcoming milestone.\n\nCapella x Shanghai = Shapella\n\nThe upcoming changes feature two simultaneous upgrades amalgamated to encompass all facets of the upgrade.\n\nShanghai refers to changes to Ethereum’s execution layer, mainly enabling staked ETH to be deposited to execution layer wallets. The Shanghai upgrade requires a simultaneous change to the Beacon Chain, which has been dubbed Capella.\n\nJustin Florentine, a staff protocol engineer for Hyperledger Besu at ConsenSys, further explained the combined upgrades at the execution and consensus layers:\n\n“It is doubly named because it is the first simultaneous upgrade of Ethereum’s execution layer and consensus layer, and is highly anticipated because it will enable staked ETH withdrawals.”\n\nWithin the Ethereum ecosystem, execution layer upgrades are named after cities that have hosted Devcon events, while consensus layer upgrades are named after stars. Therefore the upcoming upgrade’s technical name is Shapella, combining Shanghai and Capella.\n\nNevertheless, given the focus on activating staked ETH withdrawals, the wider cryptocurrency ecosystem refers to the looming upgrade as Shanghai. As Beiko explained, Shanghai closes an important chapter in Ethereum’s evolution:\n\n“It’s better to think of Shanghai as ‘finishing the Merge’ than related to future upgrades. We didn’t introduce withdrawals during the Merge because that upgrade was already the most complex in Ethereum’s history.”\n\nShanghai in a nutshell\n\nAs has been highlighted by several analysts and Ethereum developers, Shanghai features five EIPs. EIP-4895 will enable users to withdraw from the Ethereum staking contract, which had previously been locked.\n\nReward payments will be sent automatically to withdrawal addresses at regular intervals to validators. Users also have the option to exit staking entirely, which will return their entire validator balance.\n\nEthereum's Shanghai upgrade will unlock 17.6M ETH or over $28 billion. https://t.co/qt8K4Zn55y — Cointelegraph (@Cointelegraph) March 2, 2023\n\nValidator balances are maxed out at 32 ETH, meaning that balances above this threshold as a result of rewards do not contribute to the principal amount nor increase the weight of a validator on the network.\n\nEIP-3651, EIP-3855, EIP-3860 and EIP-6049 are the other four elements of the network upgrade. Matt Nelson, Hyperledger Besu and Web3 senior product manager at ConsenSys, highlighted the impact of each of these EIPs.\n\nThe Ethereum protocol prices gas based on how many units of work a function will require of a computer in the network. Changes to Ethereum’s gas costs often adjust to correct overpriced or underpriced operations that have central processing units doing more or less work than anticipated. Warm coinbase (3651), PUSH0 (3855) and the initcode changes (3860) are part of these corrections, according to Nelson.\n\nEIP-3651 changes the price of accessing the coinbase address of a validator that submits and executes transactions. Validators receive fees to their coinbase address for maintaining the network. As Nelson summarized, EIP-3651 looks to lower the gas cost of accessing a coinbase address so that users that submit transactions can pay the validators directly in specific conditions:\n\n“Regardless, this EIP corrects a previous oversight on the cost to access the coinbase address and gives some added benefits to users and developers that open up new use cases.”\n\nEIP-3860 will have a similar effect. Developers submit initcode to the network when deploying a new smart contract. When the initcode is executed, a smart contract “bytecode” is created on-chain, running each time the contract is called, and also runs decentralized applications (DApps).\n\nMetering initcode intends to correct the gas cost required for network nodes to process and deploy the smart contracts specified in the initcode. Validating nodes currently check that contracts are valid on deployment, which costs time and gas to complete, which the initcode EIP aims to improve as Nelson explained:\n\n“EIP-3860 applies a new cost to the initcode that scales in correlation to the size of the ‘initcode’ to ensure handling that contract creation is costed appropriately.”\n\nLastly, EIP-3855 carries out a “straightforward and simple change” to the Ethereum Virtual Machine (EVM) and gas costing. The current state of the EVM does not store a value of zero on the execution stack cheaply, with developers having to use the “expensive” PUSH1 operation to set a value to zero.\n\nNelson highlighted that gas costs are directly linked to storage space in this instance, meaning the EVM only needs 1 byte to store a single zero, while more than 1 byte is required to store a bigger number from the PUSH1 operation:\n\n“This change creates a new PUSH0 opcode, which is cost for 1 byte of data storage (less than PUSH1), and will bring gas costs for developers (and ultimately users) down.”\n\nBeiko also reiterated that Ethereum Virtual Machine object format EIPs initially included in the Shanghai upgrade have been removed from the event.\n\nWhat to expect\n\nThe effect of the Shanghai upgrade on cryptocurrency markets and the value of ETH is another pertinent question that is perhaps more difficult to answer.\n\nMichiel Milanovic, a DeFi market analyst at ConsenSys, weighed in on the anticipated effects that Shanghai will have in terms of market supply and value of ETH after the upgrade. Milanovic noted that validators are broadly categorized as short-term or long-term, with the current market split roughly 40/60 respectively, which allows for some simple predictions to be made:\n\n“We see potential for an increase in the supply of ETH in circulation from long-term validators who are eager to withdraw their accumulated rewards.”\n\nMilanovic also highlighted that the mechanics of withdrawals are engineered with a limit of 16 withdrawals per block and prioritizes short-term validators. The likely outcome is that any market impact from long-term validators will be gradual.\n\nMeanwhile, short-term validators are mostly run by liquid staking providers (LSPs), which are more incentivized to use rewards to spin up new validators. Milanovic said this is mainly due to an expected increased demand once withdrawals are enabled, as it reduces the liquidity risk of staking ETH.\n\n“We also expect to see more staked ETH tokens issued by these providers to be used across DeFi, which has so far been fairly limited.”\n\nAndrew Thurman, an analyst at blockchain analytics platform Nansen, told Cointelegraph that the upgrade would have significant ramifications for supply flows and price of ETH, given that staking creates fundamental changes to Ethereum’s market structure:\n\n“Some believe that a successful network upgrade will spur more deposits, which would lead to bullish market activity. Others, meanwhile, believe that large portions of the staked ETH supply — now in excess of 17.5 million ETH — will be withdrawn and sold.”\n\nSimon Dudley, a ConsenSys senior blockchain protocol engineer, summed up a shift in focus for the Shanghai upgrade to prioritize validator withdrawals. This meant that the implementation of certain EIPs was shifted further down the timeline to limit risks of further delays to the upcoming upgrade:\n\n“For this reason, there was a strong desire among the core developers to prevent the Shanghai upgrade from becoming overly complicated.”\n\nSeveral of these EIPs have been pushed back to the Cancun upgrade, which will follow Shanghai later in 2023. This includes improvements that will lay the foundation for sharding, namely “Proto-Danksharding” EIP-4844.\n\nDudley noted that Shanghai intentionally excluded foundational sharding work, but work on EIP-4844 has continued in parallel. He also concedes that the deployment of Shanghai may well influence the ongoing work on sharding in the months to come:\n\n“Shipping the Shanghai upgrade may have an impact on sharding because it frees up developers who were working on Shanghai to focus on the more complicated series of sharding upgrades, known as ‘The Surge.‘”\n\nThe Shanghai upgrade is scheduled to take place on the Ethereum mainnet in early April. The original date was pushed out from March 2023, with the Goerli test network — which allows for development testing before mainnet deployments — carrying out the Shapella upgrade on March 14."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aC1zZWN1cml0eS1hbGxlZ2VzLW55YWfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "New York AG Alleges ETH is a Security in KuCoin Lawsuit - Blockworks",
        "content": "New York Attorney General Letitia James became the first regulator in the US to claim in court that ethereum is a security in a lawsuit against exchange KuCoin.\n\nSeychelles-based KuCoin has been operating in New York without registering as a securities and commodities broker-dealer, James alleged in the suit.\n\nKuCoin facilitates trading of ETH, James added, “a speculative asset that relies on the efforts of third-party developers in order to provide profit to the holders of ETH.” The exchange should have registered before offering ETH, LUNA and TerraUSD — all of which fall under the securities classification, according to James.\n\nHowever, the NYAG may not have the final say on the issue. Rostin Behnam of the CFTC told the Senate Agriculture Committee as recently as Wednesday that ETH is in fact a commodity, not a security.\n\n“We would not have allowed the Ether futures product to be listed on a CFTC exchange if we did not feel strongly that it was a commodity asset,” he explained.\n\nSEC leaders have made similar statements. In 2018, William Hinman, the then-Director of Corporate Finance at the SEC, said in a speech that both bitcoin and ETH are not securities. His justification was that bitcoin is “decentralized” and ETH, despite its 2014 initial coin offering, had become “sufficiently decentralized” over the past four years to make it a non-security.\n\nThe Office of the State Attorney General (OAG) confirmed KuCoin’s alleged unlawful actions because OAG Detective Brian Metz has been transacting on the exchange from New York since May 2022, the lawsuit states.\n\nKuCoin’s lending and staking product, KuCoin Earn, is also an unregistered security offering, the lawsuit alleges.\n\nThe OAG served KuCoin a subpoena on Jan. 10, 2023 but respondents did not reply and failed to appear to testify on the date specified in the subpoena, the lawsuit claims.\n\nThe lawsuit is similar to a suit brought against exchange CoinEx in February alleging the exchange offered trading services for tokens including AMP, LUNA and LBC, all of which the Attorney General’s office says are securities."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vZm9ya2FzdC5uZXdzL2NmdGMtY2hhaXItY2FsbHMtZXRoZXJldW0tYS1jb21tb2RpdHktaW4tY29udHJhc3QtdG8tc2VjLWNoYWlyLWdlbnNsZXJzLXBvc2l0aW9uL9IBamh0dHBzOi8vZm9ya2FzdC5uZXdzL2NmdGMtY2hhaXItY2FsbHMtZXRoZXJldW0tYS1jb21tb2RpdHktaW4tY29udHJhc3QtdG8tc2VjLWNoYWlyLWdlbnNsZXJzLXBvc2l0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "CFTC chair calls Ethereum a commodity, in contrast to SEC chair Gensler’s position - Forkast News",
        "content": "Chairman of the Commodities and Futures Trading Commission (CFTC) Rostin Behnam has called Ethereum a commodity and not a security, in apparent contrast to U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler who has consistently argued that every cryptocurrency other than Bitcoin falls under securities laws.\n\nSee related article: A house divided? SEC Commissioner Peirce attacks agency’s fines against Kraken exchange\n\nFast facts\n\nBehnam, speaking to the Senate Agriculture Committee in a Wednesday hearing, argued that Ethereum had been listed on CFTC exchanges for quite some time, and that creates a “direct jurisdictional hook” for the agency to police both ETH’s derivatives market and the underlying market.\n\n“We would not have allowed the Ether futures product to be listed on a CFTC exchange if we did not feel strongly that it was a commodity asset,” he added.\n\nThe debate of whether cryptocurrencies should be classified as securities or commodities has picked up steam among regulators over the past several years, as it would determine which agency assumes chief oversight of the digital assets. The crypto industry has widely voiced support for CFTC as a preferred regulator over the SEC.\n\nAccording to Gensler, proof-of-stake cryptocurrencies such as Etherium pass the Howey Test, which refers to a U.S. Supreme Court case for determining whether a transaction qualifies as a security asset.\n\nBehnam also seemed to diverge from Gensler on stablecoins. While the SEC threatened to charge Paxos for issuing BUSD as an unregistered security last month, Behnam has said that stablecoins should be considered commodities in the absence of new legislation for stablecoins.\n\nSee related article: Paxos ordered to stop minting Binance stablecoin as SEC mulls legal action"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1pcy1wbHVuZ2luZy0xNTAwL9IBSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1pcy1wbHVuZ2luZy0xNTAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Ethereum Price is Plunging, But It’s Too Early to Say Bulls Have Given Up - NewsBTC",
        "content": "Ethereum price is moving lower below $1,600 against the US Dollar. ETH must stay above the $1,500 support zone to start a recovery wave.\n\nEthereum is eyeing an upside break above the $1,560 and $1,580 resistance levels.\n\nThe price is trading below $1,560 and the 100 hourly simple moving average.\n\nThere is a connecting bearish trend line forming with resistance near $1,550 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could correct higher if there is a move above the $1,560 resistance zone.\n\nEthereum Price Extends Losses\n\nEthereum price failed to clear the $1,580 and $1,600 resistance levels. ETH formed a high near $1,565 and recently started a fresh decline. There was a move below the $1,545 support zone.\n\nThe price traded as low as $1,525 and the bulls were active above the $1,500 level. It is now consolidating losses below $1,560 and the 100 hourly simple moving average. Ether price corrected a few points above the $1,540 resistance zone.\n\nIt cleared the 23.6% Fib retracement level of the downward move from the $1,565 swing high to $1,525 low. On the upside, the price is facing resistance near the $1,550 zone. There is also a connecting bearish trend line forming with resistance near $1,550 on the hourly chart of ETH/USD.\n\nThe first major resistance is near the $1,560 zone. It is near the 76.4% Fib retracement level of the downward move from the $1,565 swing high to $1,525 low.\n\nSource: ETHUSD on TradingView.com\n\nThe next major resistance is near the $1,575 level, above which the price might start a decent increase. The next major resistance is near the $1,600 zone. A close above the $1,600 resistance zone might start a major upward move. In this case, the price may perhaps rise towards the $1,650 level.\n\nMore Losses in ETH?\n\nIf ethereum fails to clear the $1,560 resistance, it could start another decline. An initial support on the downside is near the $1,525 level.\n\nThe next major support is near the $1,500 zone. If there is a break below $1,500, the price might drop towards $1,435. Any more losses might call for a test of the $1,400 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is now gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,500\n\nMajor Resistance Level – $1,560\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8xMC9ldGhlci1hLXNlY3VyaXR5LXRoYXQtY291bGQtaGF2ZS1odWdlLXJhbWlmaWNhdGlvbnMtZm9yLWNyeXB0by1sZWdhbC1leHBlcnQtc2F5cy_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAzLzEwL2V0aGVyLWEtc2VjdXJpdHktdGhhdC1jb3VsZC1oYXZlLWh1Z2UtcmFtaWZpY2F0aW9ucy1mb3ItY3J5cHRvLWxlZ2FsLWV4cGVydC1zYXlzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Ether a Security? That Could Have Huge Ramifications for Crypto, Legal Expert Says - CoinDesk",
        "content": "Once there are \"federal guidelines, rules, regulations and laws that may preempt state law, oftentimes you'll see things percolate up from the states and eventually make it before the [U.S. Supreme Court] to render the ultimate determination. And this is what we often see\" in new and emerging asset classes and industries, she said."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy80LWV0aC1zdGFraW5nLWNob2ljZXMtdGhhdC1zYXktc29tZXRoaW5nLWFib3V0LXlvdXItcGVyc29uYWxpdHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "4 strategies for staking Ethereum - Cointelegraph",
        "content": "Staked Ether (ETH), liquid derivatives — it’s a whirlygig of smart contracts and big-brain blockchain jargon out there. Nonetheless, there are a few paths through the ETH staking wilderness.\n\nBut remember, anon, as the poet Antonio Machado said, “There is no path, paths are made by walking” — which is a fancy way of saying this isn’t financial advice and make sure you do your own research.\n\nLet’s start with the first personality type and the type of ETH staking that might be appropriate.\n\nThe Ox: Slow and steady\n\nThe ox, archetypally, has a strong, dependable personality but can be stubborn and suspicious of new ideas. If that sounds like you, you may be interested in staking directly with Lido.\n\nLido Finance is not only the biggest liquid staking derivative (LSD) protocol but it’s now the biggest decentralized finance (DeFi) protocol in the market in terms of total value locked ($9.5 billion) and market capitalization. Lido takes your ETH and stakes it via a team of vetted validators, pooling the yield garnered and distributing it to the validators, the decentralized autonomous organization (DAO) and investors.\n\nRelated: 3 tips for trading Ethereum this year\n\nIn return for providing ETH to Lido, the DAO issues “staked ETH” (stETH) tokens, which are like receipts (or “liquid derivatives”) that can be redeemed for your original ETH plus the yield accrued. These tokens, along with those from other LSD protocols, such as Rocket Pool and StakeWise, can be traded on the open market.\n\nThe risks include the fact that the smart contracts holding your ETH might have an undiscovered bug, the DAO might get hacked, or one or more of Lido’s validators might get penalized by Ethereum and have some of their stake removed. All the following strategies contain these risks plus more.\n\nThe Dog: Honest, prudent and a little feisty\n\nIf that sounds like you, maybe look into auto-compounders. For example, adding liquidity to Curve Finance and then locking up the liquidity pool (LP )tokens.\n\nWhen using Curve, I like to use Frax-based tokens, as the two protocols clearly have the hots for one another, and Frax pools often have the best rewards. I passed some of my ETH to Frax to stake and received their LSD called Frax ETH (frxETH).\n\nIt’s in Frax’s interest to maintain a highly liquid market for frxETH, so they run an LP on Curve, which offers up to 5.5% APY on top of the fact that your frxETH is also earning a similar yield. Nice.\n\nETH staked by entity. Source: Nansen\n\nBut some of this APY is paid out in CRV tokens. No shade, but I would rather have ETH, so I hopped on to Aladdin DAO’s Concentrator protocol and gave them my LP tokens, which is like a receipt for my share of the frxETH/ETH pool. They do some wizardry and return 8% APY paid in the underlying assets. Nice.\n\nNaturally, when mixing DeFi protocols into a screwy, money cake, the risks compound with the yield. Here, there are three protocols involved as opposed to one, which could mean the risk is cubed — but I’m no mathematician.\n\nThe Tiger: Sleek, sophisticated and always in control\n\nThis is perhaps the most sophisticated strategy on the list and should be considered by experienced investors with a large amount of money on the line.\n\nEssentially, the tiger can use a similar strategy to the dog; indeed, there are many LP pools and many compounders across the DeFi world, so finding one that fits shouldn’t be an issue. The issue for tigers is how to hedge their risk.\n\nA few options contracts might be in order. The basic approach would be to buy enough in-the-money put options to act as insurance in the event ETH takes a dive. This might be all that’s needed seeing as the risk of impermanent loss is low, given stETH tends to maintain its peg. (Those wanting to hedge against a depeg event should check out Y2K protocol over on Arbitrum.)\n\nA more optimal strategy would be a “bear call spread,” as that will insure against depreciation but also return some profit in a sideways market.\n\nThe Frog: The airdropping Ponzi lover\n\nThe next strategy is quite popular in some sections of the crypto world. In terms of risk, it’s as about as safe as covering yourself in peanut butter and running at a horde of malicious chimpanzees.\n\nIt involves “looping,” which refers to supplying an asset, borrowing against it, swapping the borrowed money for more of the original asset, and repeating the process.\n\nRelated: 5 tips for investing during a global recession\n\nFrom my own research, I found a yield farm that will give you about 2% yield when you deposit wstETH (the same as stETH but with a harder peg) and allow you to borrow USD Coin (USDC) against it for 3.5% interest.\n\nYou can then swap the USDC for more wstETH and repeat the process, using a 75% loan-to-value ratio, so you don’t get instantly liquidated. If you loop this process five times, you will end up with an APY of over 13% on your wstETH, which itself is earning 5%.\n\nWhatever your personality, it’s possible to find the strategy that works for you, and while it might sound complicated if you have your own decentralized wallet or one on an exchange, most of them can be enacted with just a few clicks. While some bearish types might decry the continuation of overly-ebullient risk-taking, I see the trend in LSDs as part of the birth of a new yield-bearing asset: ETH.\n\nOne day, stETH might even rival the traditional bond market. After all, if governments can run trillion-dollar economies essentially as derivatives of their own bond market, what are a few validator nodes among crypto friends?\n\nNathan Thompson is the lead tech writer for Bybit. He spent 10 years as a freelance journalist, mostly covering Southeast Asia, before turning to crypto during the COVID-19 lockdowns. He holds joint honors in communication and philosophy from Cardiff University.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pLWFudGktZW5kb3JzZS10aGVzZS1wcm9qZWN0cy1idXRlcmluLXMtc2hpdGNvaW4td2FyLXNlZXMtaGltLXNlbnQtYW5vdGhlci0yNTBr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "'I anti-endorse these projects' — Buterin's shitcoin war sees him sent another 250K - Cointelegraph",
        "content": "Ethereum co-founder Vitalik Buterin’s latest salvo against “shitcoins” has ended up with him simply being sent more of it.\n\nOnly days ago, the Ethereum developer made moves to sell over $700,000 of tokens previously airdropped to him, causing the price of these tokens to fall.\n\nButerin has since continued his war on apparent “shitcoins.” In a March 9 post on a small subreddit, Buterin labeled crypto token Bite (BITE) and most of the other coins discussed on the r/Testingtesting62831 subreddit as “shitcoins” that have “no redeeming cultural or moral value, and will probably lose you most of the money you put into them.”\n\n“I anti-endorse these projects to the greatest extent.”\n\nVitalik Buterin's full post on the Testingtesting62831 subreddit. Source: Reddit\n\nBITE was one of the tokens Buterin sold in his shitcoin selling spree on March 7, selling 3.4 million BITE for around $9,250, according to PeckShield.\n\nButerin’s post was also likely prompted by the huge number of posts pushing the BITE token on the subreddit, which he created back in July 2020 and still moderates.\n\nThe post set him up for a wave of trolling, however, with other members of the subreddit doubling down on their shilling and creating a number of memes.\n\nOne of the posts purportedly trolling the Ethereum co-founder. Source: Reddit\n\nButerin was even sent 250,000 BITE soon after making the post. The token doesn't appear to be listed on many mainstream crypto price tracking sites, but blockchain records show sales hover around $0.011 per token, making the 250,000 sent to Buterin worth approximately $2,750.\n\nA screenshot of transactions associated with one of Buterin’s wallets. Source: Etherscan\n\nMeanwhile, several Twitter accounts claiming to be affiliated with the BITE token and its community have called the mention by Buterin “BULLISH.”\n\nRelated: Vitalik Buterin's philanthropic fund donates 15M USDC to UC San Diego\n\nThe Ethereum co-founder had gone on a shitcoin selling spree just two days prior, offloading some $700,000 worth of tokens that were airdropped to him and exchanging them for Ether (ETH).\n\nButerin initiated a similar offload in May 2021, selling tokens such as Shiba Inu (SHIB) and Dogelon Mars (ELON), causing their prices to tank by 40% and 90%, respectively."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMy8wOS9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1kdW1wcy1hbHRjb2lucy13b3J0aC0yMjBldGgtdGhhdC1oYXZlLW5vLW1vcmFsLXZhbHVlL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMy8wOS9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1kdW1wcy1hbHRjb2lucy13b3J0aC0yMjBldGgtdGhhdC1oYXZlLW5vLW1vcmFsLXZhbHVlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Dumps Altcoins Worth 220 ETH That Have 'No Moral Value' - CoinDesk",
        "content": "In 2021, Buterin prompted a swing in the price of shiba inu (SHIB) tokens when he burned his holdings worth $6 billion after he was effectively given half of the token's supply. He said at the time that he didn't want the power of holding such a significant proportion of the tokens."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXRvZGF5LWV0aC10dW1ibGVzLWJ5LTctYXMtY3J5cHRvLW1hcmtldC1jcmFzaGVzL9IBWGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXRvZGF5LWV0aC10dW1ibGVzLWJ5LTctYXMtY3J5cHRvLW1hcmtldC1jcmFzaGVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Ethereum Price Today: ETH Tumbles By 7% As Crypto Market Crashes - CoinGape",
        "content": "Ethereum Price Today: The market is trading in red today as Bitcoin, and Altcoins including Ethereum see a tremendous decline. As of writing, Bitcoin price has decreased by 8.11% in the last 24 hours. Ethereum price decreases by 7.87%.\n\nThe global crypto market cap stands at 931.99 billion USD, slipping down by 60 billion in a mere 24 hours, a decrease of 6.59% over the past day. The total crypto market volume in the last 24 hours increased by 46.85% and is currently at 65.70 billion USD.\n\nadvertisement\n\nEthereum (ETH) price dips by 7.87%\n\nThe second largest crypto, Ethereum price today dropped by 7.87% in the last 24 hours. The market cap for Ethereum is 173.09 billion USD. Moreover, trading volume increases by 58.60% over the previous 24 hours, showing decreased interest among investors. Each ETH token is trading for 1,414 USD, thus, falling below the support level of 1500. Source: coinmarketcap\n\nAlso read: Crypto Prices Today: Bitcoin Falls To $20k; XRP, Cardano Drops Over 4%; Huobi Token Tanks 21%\n\nThe Shanghai upgrade which was all set to be executed by the end of March has been pushed further to April. The launch of the Goerli testnet, which serves as a thorough dress rehearsal for the Shanghai upgrade, is currently scheduled by Ethereum’s developers to take place on or around March 14.\n\nWhy is ETH plunging in the last 24 hours?\n\nThere are several reasons for the declining price of Ethereum, the major reasons being a couple of events in the last 24 hours that led to the crash of crypto market.\n\nAgainst the backdrop of a significant liquidity crisis, Silvergate Bank opted to cease its operations and transition into a state of liquidation. Notably, Block.One, the parent company of EOS has recently recorded an enormous $83 million gain in its equity holdings in Silvergate Capital\n\nAs Coingape reported , the New York Attorney General’s office initiated legal action against KuCoin on Thursday. The lawsuit alleges that the company engaged in the promotion of unregistered securities and commodities. KuCoin, which is headquartered in Seychelles, has been accused of carrying out business activities in New York without registering as a broker-dealer of securities and commodities.\n\nThe Chair of the US Federal Reserve , Jerome Powell, cautioned that the central bank may increase interest rates beyond the projected range as inflation continues to rise. These economic conditions are certainly impacting the price of Ethereum as well.\n\nAlso read: EOS Parent Block.One Books $83 Million Loss on Silvergate Equity Position"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1jYW4tYmUtc3ViamVjdGVkLXRvLWhhcnNoLXNlbGwtcHJlc3N1cmUtdGhpcy13ZWVrLWhlcmVzLXdoeS_SAV9odHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tY2FuLWJlLXN1YmplY3RlZC10by1oYXJzaC1zZWxsLXByZXNzdXJlLXRoaXMtd2Vlay1oZXJlcy13aHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Ethereum can be subjected to harsh sell pressure this week, here’s why - AMBCrypto News",
        "content": "ETH might be prone to more sell pressure as Voyager liquidates its holdings.\n\nLong positions shift in favor of shorts as bearish market conditions prevail.\n\nThe ghost of 2022’s crypto contagion is yet to be exorcised. A wave of ETH sell pressure might be on the way courtesy of distraught crypto firm Voyager.\n\nRealistic or not, here’s Ethereum’s market cap in BTC’s terms\n\nCrypto research company Arkham recently confirmed that voyager has commenced the process of liquidating its digital assets.\n\nThe company filed for bankruptcy after a series of unfortunate market events that led to heavy losses. Initial data reveal that Voyager has slightly over 100,000 ETH in its addresses which will be liquidated to pay creditors.\n\nVoyager is in the process of liquidating their on-chain assets. They are currently sending 7-8 figures of crypto to Wintermute and Coinbase addresses daily. They have over 100K ETH remaining to sell off – that's over $150M! Arkham will be dropping a deep-dive at 12:00 EST. pic.twitter.com/XhACb5wlxa — Arkham (@ArkhamIntel) March 9, 2023\n\nThe amount of ETH to be liquidated is worth over $150 million. The report further revealed that the funds will be sent to Coinbase and Wintermute addresses.\n\nThose liquidations may translate to a large amount of sell pressure within the next few days. Such an outcome might trigger a deeper bearish move below $1,500.\n\nETH bears have so far pushed the price down by roughly 12% from its February highs to its $1,527 press time price. However, the Voyager liquidations are not the only bearish concerns for bullish traders.\n\nBullish expectations dimmed for the last few weeks courtesy of anticipated rate hike increases. Federal Reserve chairman Jerome Powell recently reignited those bearish expectations during a recent Senate hearing. He revealed that the FED might have to increase rates to have a better chance at combatting inflation.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nAre ETH derivatives traders taking advantage?\n\nWith the aforementioned problems taking center stage, shorts traders will be looking to take advantage. That is likely the case according to multiple metrics including the futures estimated leverage ratio. The latter has improved over the last two weeks as prices dropped.\n\nThe surge in the futures estimated leverage ratio is particularly evident in the last two days confirming healthy demand for leverage.\n\nThe price has been bearish during the same time. Also, ETH’s open interest metric is on the rise this week and especially in the last two days. A potential sign that there is demand for shorts.\n\nAnother noteworthy observation regarding the state of derivatives is that investors have shifted from long positions likely in favor of shorts.\n\nThe longs liquidation metric shows a drop in liquidations courtesy of the bearish market conditions."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMjMxMzkvdm95YWdlci1saXF1aWRhdGVzLTU2bS1ldGhlcmV1bS1zaGliLWVyYy0yMC10b2tlbnPSAVJodHRwczovL2RlY3J5cHQuY28vMTIzMTM5L3ZveWFnZXItbGlxdWlkYXRlcy01Nm0tZXRoZXJldW0tc2hpYi1lcmMtMjAtdG9rZW5zP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Voyager Liquidates $56M in Ethereum, SHIB, and Other ERC-20 Tokens - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOn-chain data points to massive liquidations from the bankrupt crypto exchange Voyager.\n\nOn March 9, the exchange reportedly liquidated $56 million in Ethereum (ETH), Voyager Token (VGT), Shiba Inu (SHIB), and Chainlink (LINK).\n\nAccording to on-chain analytics firm Arkham Intelligence, Voyager has sold crypto assets worth $358.5 million in the last six weeks, selling their ERC-20 assets on Binance.US, Coinbase, and direct over-the-counter trades with market maker Wintermute.\n\nAD\n\nAD\n\nSince January, Voyager's USDC balance has increased to $460 million. USDC is a dollar-pegged stablecoin.\n\nThe firm’s crypto liquidations accelerated significantly in March, with over $138 million moved since the month's start, compared to a combined $221 million in January and February.\n\nThe defunct exchange's wallets still have around $271.5 million in crypto assets poised for liquidation. Analytics portal, LookonChain, confirmed Arkham's data showing a similar value left in its Ethereum wallets.\n\nAlongside Voyager's liquidation, it would appear that regulators are working hard to slow the process.\n\nAD\n\nAD\n\nBinance.US acquisition hits hurdle\n\nThe U.S. Department of Justice (DOJ) challenged a New York court order which allowed Binance.US to acquire the bankrupt crypto exchange Voyager Digital's assets. The appeal came one day after Judge Michael Wiles ruled in favor of the Voyager-Binance deal against the Securities Exchange Commission's (SEC) opposition.\n\nVoyager filed for bankruptcy last summer along with a host of other crypto firms. Prior to its collapse, FTX won the initial bid to buy the defunct firm’s assets.\n\nFollowing the exchange’s collapse, Voyager’s attorneys said at a hearing that there would “be no transaction with FTX, I think that is quite obvious.”\n\nIn December last year, Binance.US emerged as the ultimate winner of the bid."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vYml0Y29pbmtlLmlvLzIwMjMvMDMvc2Nyb2xsLXJhaXNlcy1mdW5kaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Ethereum ZK-Rollup Layer 2 Network, Scroll, Raises $50 Million to Become Latest Blockchain Unicorn - bitcoinke.io",
        "content": "Scroll, an Ethereum Layer 2 network that utilizes zk-rollups technology, has raised $50 million in its most recent funding round bringing its valuation to $1.8 billion.\n\nAn update: To accelerate plans for developing our zkEVM, pursue cutting-edge research, and continue building with a broader community, we've raised capital from a global set of participants. — Scroll 📜 (@Scroll_ZKP) March 6, 2023\n\nThe round comes at a time when funding to the entire sector has cooled off after a difficult 2022 when many companies went bankrupt, including the crypto exchange, FTX.\n\nNonetheless, Scroll’s round saw a host of notable firms signaling that some of the biggest investors retain interest in the sector.\n\nThe round saw the following participants:\n\nPolychain Capital\n\nSequoia China\n\nBain Capital Crypto\n\nMoore Capital Management\n\nVariant Fund\n\nNewman Capital\n\nIOSG Ventures\n\nQiming Venture Partners\n\nFounded in 2021, Scroll aims to scale Ethereum to a billion users by utilizing a Layer 2 network that processes transactions off Ethereum on its own network. The transaction data is then sent back to Ethereum which helps increase transaction speed and reduce costs.\n\nTo achieve scalability, Scroll’s network uses ZK-rollup technology, specifically its zkEVM (zero-knowledge Ethereum virtual machine). This technology allows Scroll to batch transactions and generate proof that verifies their legitimacy. Once the proof is created, it is broadcast to Ethereum for approval enabling the transactions to be processed more efficiently.\n\nLast week, Scroll launched its zkEVM on the Goerli testnet as it transitioned out of its pre-alpha testnet phase.\n\nThe traction on the pre-alpha testnet was impressive, with Scroll Co-Founder, Sandy Peng, noting in an interview that it had achieved one million unique addresses and 16 million transactions. The mainnet launch is expected to take place in the next three to four months, according to Peng.\n\nAlong with Scroll, several other Ethereum scaling networks use ZK-rollups, such as Polygon, StarkWare, and Matter Labs. According to Peng, who is just one of Scroll’s co-founders, the network’s competitive advantage lies in its three core design principles: community-driven, security-first, and decentralization at every level.\n\nWith the $50 million raised in the latest funding round, Scroll plans to use the capital to continue building its product, launch its mainnet, and expand its ecosystem. The company plans to increase its team size from around 60 to nearly 100 in the near future.\n\n______________________________________\n\nFollow us on Twitter for the latest posts and updates\n\nJoin and interact with our Telegram community\n\n______________________________________\n\n______________________________________"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbmdhcGUuY29tL2NmdGMtY2FsbHMtZXRoZXItYW5kLXN0YWJsZWNvaW5zLWFzLWNvbW1vZGl0aWVzLXdpbGwtdGhlLXNlYy1hZ3JlZS_SAVxodHRwczovL2NvaW5nYXBlLmNvbS9jZnRjLWNhbGxzLWV0aGVyLWFuZC1zdGFibGVjb2lucy1hcy1jb21tb2RpdGllcy13aWxsLXRoZS1zZWMtYWdyZWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "CFTC Seeks Jurisdictional Right Over Ethereum and Stablecoins - CoinGape",
        "content": "In an interesting development, the U.S. Commodities and Futures Trading Commission (CFTC) exerted jurisdictional power over Ethereum and stablecoins while calling them commodities. With this, the CFTC sets a direct confrontation with the U.S. SEC which is keen to treat all cryptocurrencies, except Bitcoin, as securities.\n\nInterestingly, the latest development also shows the non-alignment among US regulators to regulate the crypto space. Addressing the Senate Agriculture Committee on Wednesday, March 8, CFTC Chair Rostin Behnam said:\n\nadvertisement\n\n“Not withstanding that, they are a commodity, and we have to police that market without a clear direction from Congress that they’re some other type of asset. Based on the cases that we’ve brought around stablecoins, I think that there’s a strong legal argument that USDC and other similar stablecoins would be commodities”.\n\nThe CFTC chair added that the fiat-backed stablecoins don’t work with the expectation of profit and return to its holder. Thus, Behman was hinting that stablecoins shouldn’t fall in the category of securities.\n\nAlso, the CFTC chair cited the investigation into Tether during a 2021 lawsuit. After that, Tether agreed to pay $40 million in settlement charges.\n\nCFTC Chair Calls Ethereum A Commodity\n\nNot only stablecoin, but Behnam also stated that Ethereum, the world’s second-largest cryptocurrency and Bitcoin competitor, is also a commodity. He added: “It’s been listed on CFTC exchanges for quite some time, and for that reason,” it creates a “direct jurisdictional hook” for the CFTC to look after the Ethereum derivatives and underlying market.\n\n“We would not have allowed the Ether futures product to be listed on a CFTC exchange if we did not feel strongly that it was a commodity asset,” added the CFTC chair. Furthermore, he added that his agency has “serious legal defences” to support their case.\n\nAdditionally, Rostin Behnam called out the Congress, seeking more clarity regarding the jurisdictional powers in regulating the crypto space. Behnam also demanded comprehensive regulatory legislation from Congress adding that enforcement alone is not enough to address the risks and consumer protection issues in crypto.\n\n“And as our markets have proven, as our regulations have proven over many, many decades, comprehensive regulation can prevent fraud, can prevent manipulation, and can stabilize markets and ultimately protect customers,” he said."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LnRyYWRpbmd2aWV3LmNvbS9uZXdzL2NyeXB0b25ld3M6ZjYyOTg4YzY0MDk0YjowLWRvLW9yLWRpZS1mb3ItdGhlLWJ1bGxzLWFzLWV0aGVyZXVtLWV0aC1wcmljZS10ZXN0cy0yMDBkbWEtc3VwcG9ydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Do or Die For The Bulls as Ethereum (ETH) Price Tests 200DMA Support - TradingView",
        "content": "Ether (ETH) bulls are facing a do-or-die moment, as the world’s second-largest cryptocurrency by market capitalization that powers the dominant smart-contract-enabled Ethereum blockchain retests key support in the form of its 200-Day Moving Average in the $1,420s.\n\nThe ETH price briefly dipped below the 200DMA to hit $1,408, before regaining some composure to trade closer to $1,450 once again. But ETH/USD is still trading down by around 6% on the day, as per TradingView, and by more than 8% in the past 24 hours, as per CoinMarketCap.\n\nCryptocurrency markets have been taking a broad beating on Thursday in wake of Wednesday's collapse of crypto-friendly bank Silvergate, which has raised concerns that fellow crypto-friendly financial institutions SVB Financial and Signature Bank might be next.\n\nThe demise of Silvergate is widely viewed as a blow to crypto adoption, given the bank’s prior efforts to better connect the fiat monetary system and crypto exchanges via its now-shuttered 24/7 wire transfer service between the two.\n\nOngoing macro headwinds, with the US dollar and US yields having seen significant upside in recent weeks as markets up their Fed tightening bets, have been compounding things. Crypto traders will be nervously watching Friday’s US jobs report and next week’s US CPI report, which could determine whether or not the Fed hikes interest rates by 25 or 50 bps later this month.The 200DMA is Key to ETH’s Near-term Outlook\n\nThe 200DMA is viewed as a key technical level by most traders. A break above or below it can signal, or act as confirmation of a significant shift in the market’s near-term momentum. Meanwhile, if the market finds strong support at the 200DMA, or fails an attempt to break above it, this is also sometimes interpreted as a signal that the market isn’t ready to shift direction just yet, and may revert to its prior trend.\n\nIndeed, the 200DMA has certainly been a key level for Ethereum in recent months. It acted as a ceiling to the price action twice in 2022 (April and November), twice confirming that the Ether bear market was still in play. Meanwhile, Ether’s decisive break above its 200DMA in mid-January was viewed as a signal that the 2022 bear market might well be over, with the cryptocurrency going on to find strong support above it in mid-February.\n\nIt would be a significant blow to the market’s near-term sentiment if Ethereum was to lose its grip on its 200DMA. Indeed, a swift test of the mid-December highs in the $1,350s would become overwhelmingly likely, with a break below here possibly opening the door to a run lower towards November’s sub-$1,100 lows.\n\nOne saving grace for ETH might come in the form of its 14-Day Relative Strength Index (RSI), which is close to entering over-sold territory, signaling some consolidation might soon be in order."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3NpbGljb24tdmFsbGV5LWJhbmstc2l2Yi1jbG9zZWQtYnktZGZpcy_SAU1odHRwczovL2VuLmV0aGVyZXVtd29ybGRuZXdzLmNvbS9zaWxpY29uLXZhbGxleS1iYW5rLXNpdmItY2xvc2VkLWJ5LWRmaXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Silicon Valley Bank ($SIVB) Shut Down By Banking Regulator - Ethereum World News",
        "content": "Silicon Valley Bank has been shut down by the California Department of Financial Protection and Innovation.\n\nThe FDIC-insured crypto-friendly bank was shut down by the banking regulator due to inadequate liquidity and insolvency.\n\nTrading of the bank’s stock was suspended earlier today following a 66% slump in pre-market trading.\n\nCrypto firms including Binance and Immutable have confirmed that they have no exposure to SVB.\n\nSilicon Valley Bank has been shut down by banking regulators in the state of California. In what is being called the largest banking failure since the financial crisis, the SVB Financial Group was closed by the California Department of Financial Protection and Innovation (DFPI). The banking regulator took possession of the bank earlier today, making it the second crypto-friendly to shut shop this week, following Silvergate Bank‘s voluntary liquidation.\n\nDFPI: Silicon Valley Bank had inadequate liquidity\n\nAccording to a press release by the DFPI, Silicon Valley Bank had inadequate liquidity. The California banking regulator cited insolvency as another factor for taking possession of the FDIC-insured bank, pursuant to California Financial Code section 592. The U.S. Federal Deposit Insurance Corporation has been appointed as the receiver of the crypto-friendly bank.\n\nThe FDIC has created the Deposit Insurance National Bank of Santa Clara (DINB). At the time of SVB’s closing, all insured deposits of the bank were immediately transferred to DINB. As per a statement from the FDIC, depositors of Silicon Valley Bank will have full access to their insured deposits no later than 13 March 2023. The FDIC will be responsible for selling off the bank’s assets and distributing payments to uninsured depositors.\n\nThe FDIC will pay uninsured depositors an advance dividend within the next week. Uninsured depositors will receive a receivership certificate for the remaining amount of their uninsured funds.” Federal Deposit Insurance Corporation\n\nThe trading of Silicon Valley Bank’s stock on NASDAQ was suspended earlier today after its price fell as much as 66% in pre-market trading. The share price was $106.04 at previous close. As of 31 December 2022, the bank had total deposits of approximately $209 billion and total deposits of approximately $175.4 billion.\n\n#Binance does not have exposure to SVB. Funds are #SAFU. — CZ 🔶 Binance (@cz_binance) March 10, 2023\n\nBinance Chief Changpeng Zhao confirmed on Twitter that his firm had no exposure to SVB. Leading web3 firm Immutable also confirmed that it had no exposure to the shuttered bank. However, USD Coin issuer Circle does have an undisclosed sum deposited in Silicon Valley Bank."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL3doYXQtYXJlLWJpdGNvaW4tb3JkaW5hbHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "What are Bitcoin ordinals? - Cointelegraph",
        "content": "What are Bitcoin NFTs? Bitcoin NFTs — aka Bitcoin ordinals, aka digital artifacts — are a way to inscribe digital content on the Bitcoin blockchain. The Bitcoin ordinals protocol was launched in January 2023 by Casey Rodarmor. The protocol allows inscribing of digital content like art onto the Bitcoin blockchain. Unlike nonfungible tokens (NFTs) on Ethereum and other blockchains, Rodarmor wanted to create an immutable on-chain presence of a piece of art, text or video. The genesis ordinal was a pixel art of a skull that Rodarmor inscribed on Dec. 14, 2022. As the NFT space based on Ethereum’s ERC-721 standard skyrocketed in 2021, Rodarmor, who was a programmer and an artist, saw the opportunity to create a similar yet unique experience on the Bitcoin blockchain. His solution was Bitcoin ordinals, based on ordinal theory, which he went on to implement through 2022. Ordinal theory concerns itself with satoshis, giving them individual identities and allowing them to be tracked, transferred and imbued with meaning. The ordinals hype really kicked off in February 2023, six weeks after the genesis ordinal was created. The number of inscriptions doubled every week for a few weeks. However, the number could have been much higher if the infrastructure to inscribe and trade ordinals had been better planned and executed. The rise of Bitcoin ordinals has seen the Bitcoin network explode in terms of usage, fees and storage space as shown in the chart above. This may also be the first big breakthrough for the Bitcoin application tier and can help move the narrative from a pure “store of value” to something more utilitarian.\n\nHow do Bitcoin ordinals work? Bitcoin ordinals are based on ordinals theory that essentially has brought life to satoshis (sats) and allows them to be treated as atomic units on the Bitcoin blockchain. Ordinals, in their simplest state, are a numbering scheme for sats. Ordinals theory drives the mechanics behind how Bitcoin ordinals work. Ordinals theory defines satoshis (sats) as the atomic unit that can be identified and traded individually on the Bitcoin network. There are 100 million sats that make up 1 Bitcoin (BTC). Sats are numbered based on the order of mining, and this number, which uniquely identifies a sat, is an ordinal number. Related: Bitcoin vs. Satoshi: Key differences explained By being a unit of transaction, sats can also be inscribed with digital content that make up Bitcoin ordinals. They become immutable digital collectibles that can be transacted on the Bitcoin network using Bitcoin wallets. As per ordinal theory, sats can be attached to security tokens, accounts or stablecoins using ordinal numbers as stable identifiers. Due to the broad set of use cases that ordinals can support, Rodarmor prefers not to equate Bitcoin ordinals with NFTs. The use case of ordinals to number a sat that’s been attached to or inscribed with a JPEG can be called a nonfungible token on the Bitcoin blockchain. Although the ordinal’s use that found market fit is that of NFTs on the Bitcoin blockchain, ordinals are much more than just nonfungible tokens.\n\nHow to mine Bitcoin ordinals? Mining, minting or inscribing Bitcoin ordinals are the terms that have been used to refer to this process. Unlike minting NFTs on the Ethereum blockchain, which is a relatively matured process, mining Bitcoin ordinals is a technically complex process and lacks intuitive tools. Bitcoin ordinals, in the initial days, could only be mined by those who ran a Bitcoin node. For tech-savvy users, a Bitcoin node with the ord app, a command line wallet, would be the gateway to mining ordinals. Node operators would load their wallets with some sats to pay for the gas fees and perform an inscribing process on their ordinals. However, no-code ordinal mining applications like the Gamma or the Ordinals Bot aim to allow users to upload the content that they want to inscribe to create their Bitcoin ordinal. The user journey takes them through a payment process using a QR code and is intuitive enough for the less technically gifted. The tools around Bitcoin ordinals are still at a very early stage. It has only been a few months since the genesis ordinals were inscribed. As demand from ordinary users and followers increases, the ecosystem and the tooling should start maturing with more user-friendly journeys.\n\nHow to buy, sell and trade ordinals Much like the process of minting Bitcoin ordinals, the trading process hasn’t had the matured tooling. Yet there are a few tools to trade these digital artifacts. As Bitcoin ordinals grow in popularity, most of the trades have been largely over-the-counter. Collections, such as “Planetary Ordinals” and “Bitcoin Punks,” among the first 1,000 inscriptions were transacted mostly without an NFT marketplace such as OpenSea or Blur. However, tools like the Ordinals Wallet, Hiro and Xverse allow users to buy and sell Bitcoin ordinals. Users can buy some sats within the wallet, using on-ramp payment plugins, and perform the transactions to buy and sell ordinals. The typical user journey involved in buying Bitcoin ordinals using Ordinals Wallet is as follows. Go to ordinalswallet.com Click on “Create Wallet” Take a backup of the recovery phrase for your wallet Set up a password for wallet access Use the address of the Ordinals Wallet to send some sats to the wallet Go to “Collections” at the top of the page Choose the ordinals collection and the inscription that you would like to buy Buy the ordinal (using the sats in your wallet).\n\nHow have ordinals been perceived by the broader Bitcoin ecosystem? Bitcoin ordinals are a great innovation that can highlight various applications unique to the chain, thereby driving developers to participate and create the tools needed by users. Bitcoin ordinals have certainly seen a hype that potentially peaked sometime in February 2023, based on transaction data. However, the hype around the application tier on the Bitcoin blockchain is just getting started. For instance, Stacks (STX) has seen a rise in price since the ordinals episode warmed up. It is clearly the early days for the Bitcoin ecosystem, but if developers are attracted to the chain, then the network effects between developers and users could come in time for the next crypto cycle. Related: Bitcoin DeFi ecosystem explained However, there are downsides to the way ordinals have been designed. As the inscribed content is all on-chain with ordinals unlike with most Ethereum-based NFTs, the size of the blockchain would increase. As new applications emerge and network utilization and transactions increase, so will the cost of transactions. The other potential impact of Bitcoin ordinals is whether it will affect the fungibility of sats. So far, satoshis have been exchanged with one sat being valued the same as another. With various applications of ordinals, this may not be true in the future. A sat with a Bitcoin Punk inscribed in it could be priced differently. Nonetheless, it would be interesting to see how this narrative evolves over the next few months and years."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMitAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90aGUtbWFuLXdoby1wcmVkaWN0ZWQtdGhlLTIwMjItYmVhci1tYXJrZXQtbm93LXByZWRpY3RzLXRoYXQtcmVucS1maW5hbmNlLXJlbnEtYW5kLWV0aGVyZXVtLWV0aC13aWxsLWJlLXRoZS1jYXRhbHlzdHMtZm9yLXRoZS1uZXh0LWJ1bGxydW4taW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "The man who predicted the 2022 Bear market now predicts that RenQ finance (RENQ) and Ethereum (ETH) will be the ... - Analytics Insight",
        "content": "The cryptocurrency market is full of surprises and predictions. Some predictions have come true, while others have failed to materialize.\n\nHowever, one prediction that has recently gained attention is that RenQ Finance (RENQ) and Ethereum (ETH) will be the catalysts for the next Bullrun in 2023. This prediction comes from the same man who predicted the 2022 Bear market, and his forecast has sparked a lot of interest and discussion within the crypto community.\n\nWho is the man behind the prediction?\n\nThe man behind this prediction is a well-known crypto analyst and investor, who has made a name for himself in the crypto world with his accurate predictions and analysis.\n\nHe has been following the market for many years and has a deep understanding of how it works. His previous prediction of the 2022 Bear market came true, which is why his new forecast has been taken seriously by many investors.\n\nWhy RenQ Finance (RENQ)?\n\nRenQ Finance is a decentralized finance platform that aims to provide an all-in-one solution for all kinds of traders, both new and professional, under one platform. RenQ Finance aims to empower every user with a comprehensive solution by providing them with a platform that has the fast and easy-to-use feature of a centralized exchange in a decentralized manner.\n\nRenQ Finance offers a variety of services, such as swapping, farming, mining, staking, lending, borrowing, and shorting, among others. These features have made RenQ Finance a popular choice among investors and traders who are looking for a reliable and secure platform to trade their crypto assets.\n\nThe unique feature of RenQ Finance is its ability to connect all isolated blockchains and establish a cross-chain asset exchange network while providing all necessary, underlying support for the DeFi ecosystem. This feature has attracted many investors and traders who are looking for a platform that offers a truly safe, free, and transparent DeFi service.\n\nBased on current statistics, the RenQ Finance presale stage has shown a significant gain rate that indicates a bullish trend for the token. This is expected to result in substantial returns on investments made by early investors.\n\n>>>>> BUY RENQ TOKENS HERE <<<<<\n\nWhy Ethereum (ETH)?\n\nEthereum is one of the most popular and widely used blockchains in the crypto world. It is a decentralized, open-source blockchain platform that enables the creation of smart contracts and decentralized applications (DApps). Ethereum has a vast and active community of developers, users, and investors who are constantly working to improve the platform and make it more secure, efficient, and scalable.\n\nEthereum’s popularity and widespread use have made it an essential part of the crypto ecosystem. Many cryptocurrencies are built on the Ethereum platform, and it is also used for a variety of other purposes, such as ICOs and DeFi applications.\n\nEthereum has recently undergone a major upgrade known as Ethereum 2.0, which aims to improve the platform’s scalability, security, and efficiency. This upgrade has been eagerly anticipated by the crypto community, and it is expected to have a significant impact on the platform’s performance and value.\n\nConclusion\n\nIn conclusion, the prediction that RenQ Finance (RENQ) and Ethereum (ETH) will be the catalysts for the next Bullrun in 2023 is a bold one.\n\nHowever, considering the popularity and potential of these two cryptocurrencies, it is not entirely unfounded. RenQ Finance’s unique features and Ethereum’s widespread use and recent upgrade make them both excellent choices for investors and traders looking to strengthen their portfolios in the coming year.\n\nAs always, investors should conduct their research and analysis before making any investment decisions.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGVjcnlwdC5jby8xMjMxODYvYnJhdmUtbGV0cy11c2Vycy1zZWxsLWNyeXB0by13aXRob3V0LWxlYXZpbmctd2ViLWJyb3dzZXLSAVhodHRwczovL2RlY3J5cHQuY28vMTIzMTg2L2JyYXZlLWxldHMtdXNlcnMtc2VsbC1jcnlwdG8td2l0aG91dC1sZWF2aW5nLXdlYi1icm93c2VyP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Brave Browser Now Lets Users Sell Crypto Within the Wallet - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nPrivacy-focused web browser Brave announced on Friday the rollout of a new feature that allows users to not only buy cryptocurrency but also now sell it for fiat—including U.S. dollars, euros, and the British pound—without leaving the integrated Brave Wallet.\n\nSelf-custody and the “not your keys, not your coins” mantra have regained momentum following the collapse of prominent cryptocurrency firms like Celsius and FTX. Brave said it aims to make crypto self-custody easier with this new desktop browser feature, which is powered by crypto on-ramp startup Ramp Network.\n\n“After recent events where centralized exchanges mishandled customer funds, it’s more important than ever to offer secure and easy-to-manage self-custody,” the company said in a post announcing the update.\n\nIn Brave’s latest desktop version (v1.49), we’ve added a new off-ramping feature to Brave Wallet, powered by our friends at @RampNetwork! Several cryptocurrencies can now be sold more easily for fiat currencies. To learn more, read today’s blog post: https://t.co/ckP0w0W4VA pic.twitter.com/bwubrefqjT — Brave Software (@brave) March 10, 2023\n\nAccording to Brave, users in select countries can now sell their coins for fiat, including Ethereum, Solana, USDC, and Brave’s own Basic Attention Token (BAT). The company said that 38 cryptocurrencies can be sold via the off-ramp service.\n\n“While self-custody has grown in popularity over the past decade, the most common way to hold digital currency and tokens remains with centralized exchanges,” the company added. “We expect to see that shift with innovations in user experience, like the one we are releasing today.”\n\nLaunched in 2016, Brave blocks online advertisements and website trackers by default, making it a popular web browsing tool for privacy-minded individuals. In 2017, Brave added the Basic Attention Token, which rewards users for allowing the browser to show advertisements while they surf the web.\n\nBrave then announced a deal with Ramp in May 2022 that enabled users to buy crypto with fiat currency via the Brave Wallet installed within Brave’s desktop and mobile browsers.\n\nAD\n\nAD\n\nLast month, Brave added support for decentralized applications (dapps) using the Solana blockchain on its iOS and Android mobile browsers, allowing users to connect to platforms like the Solana-centric NFT marketplace, Magic Eden."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vbXlyZXB1YmxpY2EubmFnYXJpa25ldHdvcmsuY29tL25ld3MvZXRoZXJldW0tcy1pZGVvbG9naWNhbC1iYXR0bGUtd2l0aC1jb21tdW5pc20v0gFXaHR0cDovL215cmVwdWJsaWNhLm5hZ2FyaWtuZXR3b3JrLmNvbS9hbXAvZXRoZXJldW0tcy1pZGVvbG9naWNhbC1iYXR0bGUtd2l0aC1jb21tdW5pc20v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Ethereum's Ideological Battle with Communism - Myrepublica",
        "content": "If humans cannot be trusted to do what's best for them, why not pass the responsibility onto something that could - an AI? According to a recent survey conducted by IE University in Madrid, approximately 30 percent of the 25,000 people surveyed said they would be willing to be governed by AI. One of the main reasons for this line of thinking is that people have simply lost faith in their political leaders and believe that machines would be able to make better, fairer, and more rational decisions that would benefit everyone.\n\nVitalik Buterin, the founder of Ethereum, recently sparked a thought-provoking conversation with his tweet: \"What even is an institution?\" Accompanying the tweet was a blog post by Dennis Pourteaux titled \"Institutional Alignment\" with a subtitle of \"Navigating a Disorienting Era with a New Political Matrix.\" This highlights the significance and relevance of institutions in today's rapidly changing world, particularly for disenfranchised youth. The tweet and blog post come at a time when people around the world feel that institutions such as parliament, political parties, bureaucracy, and central banks - that we are used to - are already obsolete. The new paradigm of Decentralized Autonomous Organizations (DAOs) has emerged as a fit for the 21st century digital world.\n\nWith the tweet, Vitalik successfully prompted many people to question whether institutions like the government still serve a valuable purpose in society, as well as the effectiveness of current institutions. If the government is not fulfilling its purpose and delivering value to society, what roles can encryption, artificial intelligence, automation, and cryptocurrency play in shaping and refining our society and its institutions? In a similar fashion, Dennis argues that the disastrous institutional failures of the last decade have brought the question of their value and purpose in society to the forefront. Therefore, it is time for us to take a hard look at the role of government and other institutions in shaping our world and collectively ensure the greater good is delivered to society.\n\nThe Nepal Rastra Bank, the central bank of Nepal, has declared a ban on the use of cryptocurrencies. Even though the ban was implemented due to concerns over the absence of proper regulation and the potential for financial fraud, this decision is akin to banning the internet in the 90s. Despite the republican setup portraying itself as one of the most progressive to date, many believe that its policies, and those of most political parties, are outdated and do not align with modern thinking. The current government and political parties can be described as being stuck in the past, failing to keep pace with modern technological advancements. At its core, communism advocates for the abolition of private property and the creation of a classless society in which the means of production are collectively owned and controlled by the people. However, Ethereum enables individuals to create and manage their own digital assets through smart contracts, effectively allowing for the creation of private property within the platform. The interplay between these opposing forces is sure to be intriguing to observe.\n\nThe traditional institutions of democracy, politics, and bureaucracy are at risk of becoming defunct. With the advent of ChatGPT, people's hopes of replacing heads of state with AI have increased. In an article titled \"AI presidents – a good idea or a disaster waiting to happen?\" Richard van Hooijdonk discusses how the idea of having an AI president is gaining ground as the public becomes increasingly disillusioned with their current political leaders, who have failed to govern people based on facts and common sense, instead letting their emotions influence their decisions. Unfortunately, this is unlikely to change anytime soon. If humans cannot be trusted to do what's best for them, why not pass the responsibility onto something that could - an AI? In any case, government leaders will not be exempt from the upcoming robotic revolution, especially in light of the public's growing disillusionment with those in power.\n\nBrilliant individuals such as Elon Musk and the late Stephen Hawking have echoed this grim vision by repeatedly warning about the existential threat that AI poses to humanity. However, many people seem to have a different outlook. According to a recent survey conducted by IE University in Madrid, approximately 30 percent of the 25,000 people surveyed said they would be willing to be governed by AI. One of the main reasons for this line of thinking is that people have simply lost faith in their political leaders and believe that machines would be able to make better, fairer, and more rational decisions that would benefit everyone.\n\nOne of the big problems with human leaders is that they are selfish mammals, while an artificial intelligence president could be truly altruistic,\" says Bart Selman, a professor of computer science at Cornell University. \"Humans are actually quite poor at making compromises or looking at issues from multiple perspectives. I think there’s a possibility that machines could use psychological theories and behavioral ideas to help us govern and live much more in harmony.\n\nAt first, the idea of having an AI president may seem silly. However, considering that people already trust AI to perform tasks such as driving cars and airplanes, managing bank accounts, and making medical diagnoses, it may not be such a big leap to entrust the governing of a country to an AI.\n\nIn fact, some experts already believe that an AI president could potentially make more rational and impartial decisions, free from the biases and emotions that often influence human leaders. With advancements in technology, we could even envision building a new Nepal on Ethereum network and electing an AI president. While this idea may still seem far-fetched to some, it's worth considering the potential benefits and exploring the possibilities that technology can offer in shaping our future. Ethereum has the potential to disrupt old institutions, particularly those that rely on centralized leadership and control."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tYW5kLWV0aGVyZXVtLWRpcC1idXQtbG9ja3lvdXJjcnlwdG8tY29tLWlzLWhlcmUtdG8tc2F2ZS15b3UtZnJvbS15b3Vyc2VsZi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Dip But Lockyourcrypto.com is Here to Save You From Yourself! - Analytics Insight",
        "content": "Bitcoin and Ethereum Suffer\n\nThe crypto friendly bank Silvergate Bank has recently been struggling due to increased market regulations and has just announced that it will be winding down operations shortly. It’s safe to say that this has negatively affected the crypto market as Bitcoin and Ethereum have both dipped in value as a result.\n\nBitcoin has been on a downward bearish trend for the past week, and dipped under $22,000. BTC currently trades at a low of $21,664.22 and is down around 7.5% in the past 7 days. The bear trend comes in the midst of Silvergate Bank concerns and higher interest rates across the world, which are higher than first anticipated.\n\nEthereum is also in the red, but the decline has not been as severe as Bitcoin’s. Ethereum is down around 6% in the past week and currently trades at $1.535.45.\n\nEthereum’s current price prediction has a mixed outlook. Compared to Bitcoin it could be bullish but the burn rate of ETH tokens has decreased significantly since February. Since the start of March the blockchain has deployed various network upgrades and improvements which could help the coin rally.\n\nEnter Lockyourcrypto.com\n\nLockyourcrypto.com is an innovative platform that is designed to protect you from yourself. If you’re prone to panic selling or buying, this could be the perfect solution for you.\n\nWith Lock You Coin, you can deposit and store your crypto for a chosen amount of time. You will then receive a certificate verifying the amount and length of time. You won’t be able to make any withdrawals or transfers during this time – unless there is an extreme emergency. So no matter how much you’re tempted, your money will be safe with Lockyourcrypto.com.\n\nLockyourcrypto.com is a reliable and secure platform for storing and transferring cryptocurrencies. It uses industry standard security measures including high-level encryption and secure storage practices to ensure safety and privacy of user data and funds.\n\nStorage and security are some of the biggest barriers for crypto users and the potential for hacking or security breaches remains high. Lockyourcrypto.com has taken every measure possible to minimise the risk of security breaches and theft.\n\nLockyourcrypto.com makes the process sleek and easy for you. The platform has a user-friendly interface and will be continually developing to stay up to date and support you in every way.\n\nIf you’re unsure of the crypto market, and don’t want to make any mistakes that could lose your money, Lockyourcrypto.com is here to help you. Follow the link to find out more:\n\nWebsite: https://lockyourcrypto.com/\n\nTwitter: https://twitter.com/_LockYourCrypto\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2V1cm93ZWVrbHluZXdzLmNvbS8yMDIzLzAzLzA5L2RhcmstZGF5cy1hcmUtYWhlYWQtZm9yLWV0aGVyZXVtLWNyeXB0by1hbmFseXN0LXdhcm5zLWFzLWJpZy1leWVzLWFuZC1mbG9raS1pbnUtcmVjb3JkLWNvbnN0YW50LWdyb3d0aC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Dark Days are ahead for Ethereum! Crypto Analyst warns as Big Eyes and Floki Inu record constant growth - Euro Weekly News",
        "content": "By EWN • Published: 09 Mar 2023 • 10:00\n\nThe renowned crypto analyst, and the famous YouTuber Nicholas Marten’s recent price prediction on Ethereum, one of the top cryptocurrencies in the market, has shocked crypto investors across the world.\n\nEthereum faces a gloomy future\n\nEthereum is the second biggest cryptocurrency by market capitalisation. The currency is, at the time of writing, trading at 68.05% lower than its all-time high value. Though the coin has been in revival mode since the beginning of this year, the price fell below $1,600 due to the silver gate bank’s insolvency crisis. Before that, Ethereum was trying to breach the $1,677 mark but failed to achieve it. On Thursday, Nicholas Martin, founder of the DataDash, one of the largest YouTube channels for cryptocurrencies with over 500K Subscribers, shared his prediction on the Ethereum price action. In his video, he expressed his disappointment over Ethereum not being able to elevate beyond $1,600-$1,800 for multiple months. He also said that if Ethereum sees again what it saw in previous bear markets, it could go down to just a few hundred dollars.\n\nAs his prediction sent shock waves across the crypto community, other crypto analysts predicted Ethereum would rise. Chris Burniske, the founder of the venture firm Placeholder, predicted that if the dollar and rates slip lower, Bitcoin could push through $25,000. And Ethereum could also see another round of fireworks if it follows the trend. Another crypto analyst Guy Turne, who is also the host of YouTube Series Coin bureau, predicts a bright future for Ethereum. Garner said that he can only see Ethereum growing. Over the past 30 days, Ethereum’s price decreased by 6.0%. In the past week alone it lost 4.5% in its price.\n\nFloki Inu – No Looking Back\n\nIf Floki Vikings, an investors community of Floki Inu meme-coin, has anyone to thank, it’s certainly Elon Musk. The World’s Richest man’s single tweet has skyrocketed its price to surge by 489% since the beginning of this year. It also broke into the list of top 100 cryptocurrencies by market capitalisation in late February.\n\nOn 25 June 2021, Elon musk tweeted that he named his Shiba Inu breed dog Floki. It was how the Floki Inu meme-coin came into existence. It has a long relationship with Elon Musk’s family. Floki Inu is the partner of The Million Gardens Movement founded by Elon Musk’s brother Kimbel Musk. On February 15, right after Elon Musk published his dog Floki’s pic posing as the CEO of Twitter, the meme-coin market witnessed a sudden surge in price. Floki Inu utilised the hype and became the top gainer. Since then Floki Inu has been outperforming the crypto analysts’ predictions. It also surpassed its rivals Dogecoin and Shiba Inu by trading volume. With an ambitious goal of becoming the world’s most used cryptocurrency, it released a road map for 2023 consisting of 4 phases and 18 amazing plans. It has recently secured a strategic marketing partnership with the Real Madrid Football club. As part of this partnership, Floki Inu’s sign will be displayed during Real Madrid Home Games.\n\nBig Eyes Coin – $31 Million and Counting\n\nBig Eyes Coin, a cat-themed, cryptocurrency is reaching new heights in the meme-coin market filled with Dogs. Big Eyes Coin’s presale was rolled out in 2022. In the beginning, a single unit of BIG token cost only $0.0001. Now in stage 12 of the presale, a single unit of BIG token costs 0.00049, which is a 390% rise from the initial price. The price will be increased to $0.0006 at launch. Big Eyes Coin is planning to donate 5% of its total supply to save oceans. It promised not to impose any tax or fee. Big Eyes Coin is planning to launch an NFT called Sushi crew where users can buy exclusive digital assets. It also made a few notable charities to help children, pet animals, elderly people, and the people of Turkey who lost their livelihood in the earthquake. Big Eyes’ unique features and concern for the community have been bringing more investors to its ecosystem. It has raised more than 31 million dollars in the presale. To encourage investors, it has recently released 5 types of loot boxes at different prices which could offer the BIG tokens worth up to one million dollars. As each and every loot box has BIG tokens worth equal to or more than what they cost to open, the investors won’t lose even a penny. Click the link below to learn more about Big Eyes Coin\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nSponsored\n\nWARNING: The investment in crypto assets is not regulated, it may not be suitable for retail investors and the total amount invested could be lost\n\nAVISO IMPORTANTE: La inversión en criptoactivos no está regulada, puede no ser adecuada para inversores minoristas y perderse la totalidad del importe invertido"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3ZpdGFsaWstYnV0ZXJpbi1jaGFzdGlzZXMtYml0ZS1vdGhlci1zaGl0Y29pbnMtZm9yLWhhdmluZy1uby1yZWRlZW1pbmctY3VsdHVyYWwtb3ItbW9yYWwtdmFsdWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Vitalik Buterin chastises BITE, other shitcoins for having no 'redeeming cultural or moral value' - CryptoSlate",
        "content": "Ethereum co-founder Vitalik Buterin warned the crypto community about BITE and other unnamed assets being discussed on the r/Testingtesting62831 subreddit group.\n\nA look at the subreddit showed that its members heavily discussed BITE and other low-value meme coins.\n\nButerin said these assets are “sh*tcoins [that] have no redeeming cultural or moral value.” According to him, investors would lose most of their money by investing in these tokens.\n\n“$BITE and most other coins being discussed on this forum are shitcoins, have no redeeming cultural or moral value, and will probably lose you most of the money you put into them.”\n\nHe added:\n\n“I anti-endorse these projects to the greatest extent.”\n\nBITE was one of the several unsolicited altcoins Buterin dumped on March 7. The Ethereum co-founder had ditched other meme coins like MOPS, SHIK, and CULT. Cumulatively, these tokens earned him over $300,000.\n\nMeanwhile, Buterin’s latest warning has negatively impacted the meme coin’s price performance. The token has fallen by 27% in the last 24 hours, according to dexscreener data.\n\nAnother developer sends Buterin 450 trillion unsolicited tokens\n\nDingo’s deployer sent 50% of the asset’s total supply — 450 trillion tokens — to Vitalik Buterin’s public address on March 8. According to on-chain data, the deployer also burnt 50 trillion of the token’s supply.\n\nBlockchain analytical firm Arkham Intelligence reported the transfer and questioned the motive of the deployer. According to the firm, Buterin had recently sold off unsolicited tokens sent to his addresses.\n\nDingo is an ERC-20 token designed to burn 10% of the tokens involved in every transaction. According to its website, the burn function would help to control its overall supply and increase its value over time.\n\nIts five-phase roadmap showed it was supposed to reach 100,000 holders by the fourth quarter of 2022. However, it has only 444 holders as of press time.\n\nThe website showed no further information about its use case or other details. The token was previously deployed on Binance Smart Chain, according to tweets seen on its Twitter page.\n\nThe token is available on the decentralized exchange Uniswap.\n\nMentioned in this article"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tZXRoZXJldW0tY2FyZGFuby1hbmQtYmlnLWV5ZXMtY29pbi1nYW1lLWNoYW5nZXJzLWZvci1jcnlwdG8tbWFyY2gv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Cardano, and Big Eyes Coin: Game-changers for Crypto March - Analytics Insight",
        "content": "Notwithstanding the Securities and Exchange Commission’s (SEC) strict regulations, the crypto market grew by more than $80 billion as we entered the third quarter of February. Following a difficult first and second quarter, crypto markets are finally showing signs of a bullish run and increasing pace, ignoring any barriers or negative news.\n\nBig Eyes Coin, the newest meme coin in the cryptoverse, is leading the way, having raised over $31.5 million in its presale. Only time will tell when and where this adorable cat-themed coin will come to an end. On the other hand, there are two crypto titans, Bitcoin and Ethereum. The market was controlled by Bitcoin, with consumers exchanging other cryptocurrencies into BTC following SEC laws. Players like Cardano are also throwing their hats in the proverbial ring.\n\nBitcoin is here to rule:\n\nAs we entered the second half of February, Bitcoin (BTC), the king of cryptocurrencies, achieved a peak of $24,755, the highest since June of 2022. Once many users and investors switched their capital away from other cryptocurrencies, and towards the crypto beast, the value of BTC skyrocketed. BTC was priced at $24,551 at the time of writing, a gain of about 10% in the previous 24 hours, with a market capitalization of $473.59 billion.\n\nSatoshi Nakamoto, an anonymous entity, introduced Bitcoin as an alternate method of payment in 2009 with the goal of creating an interconnected and autonomous digital currency network. To validate transactions, Bitcoin employs a Proof-of-Work (PoW) mechanism, and BTC, Bitcoin’s digital currency, has a finite amount of just 21 million coins.\n\nCan Ethereum Hit $1.8K in BTC?\n\nEthereum (ETH), like Bitcoin, saw advances and hit $1,700, an increase of more than 8%. Only time will tell if Ether’s value can reach $1,800. Ethereum’s last value of $1,800 was in August 2022. At the time of writing, ETH was worth $1,683 and had a market value of $205.75 billion.\n\nEthereum was introduced in 2015 as a De-Fi coin and a platform for decentralized apps and smart contracts. In comparison to Bitcoin, it is the most desired platform in the world by developers and consumers due to its scalability, security, and usability. Ethereum initially employed the Proof-of-Work technique but switched to PoS (Proof-of-Stake) in 2022 because it is faster, uses less energy, and is more secure.\n\nCardano’s Long-Term Blockchain\n\nCardano is a blockchain that employs proof-of-stake (ADA). As a result, the energy efficiency of the coin is improved. The classic proof-of-work consensus approach necessitates additional mining and transaction time. The blockchain was developed in 2017, and four years later, the “Alonzo” hard fork was introduced. As a result, its smart contract functionality exists. Smart contracts are difficult to hack due to their encrypted security. The proof-of-stake system allows for highly fast, efficient, and exact transactions!\n\nCardano’s commitment to transaction security has aided its development into a powerful blockchain platform. The speed and efficiency of its transactions, as well as its smart contract, contribute to its environmental friendliness! Investing has a high potential for success.\n\nBig Eyes That Strain to the Horizon:\n\nBig Eyes Coin (BIG) is a community-owned, cat-themed meme coin that offers profitable utilities and use cases in addition to an attempt to enhance the Earth’s ecology. Big Eyes Coin has surpassed $31 million in its presale and now intends to reach $50 million by the end of its presale. This new meme coin with a cat mascot is a promising crypto with enormous potential and the ability to become the world’s largest meme coin.\n\nBig Eyes have run a series of promotional campaigns in recent weeks, including a tattoo competition, discount codes, and now, an amazing set of loot box offers that are too good to miss.\n\nWhile some online critics have called the currency and its authenticity into doubt, the community-led token has proven time and time again that it’s here to stay and has a bright future ahead of it, quelling any concerns being spread by these crypto pundits.\n\nWith amazing innovations in tech, accessibility, a user-friendly design, NFTs, loot boxes, and more, Big Eyes Coin is striving to become a crypto mainstay.\n\nFor more information:\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2RvZ2V0dGktYml0Y29pbi1hbmQtZXRoZXJldW0tcG9zdC1zaWx2ZXJnYXRlLXByaWNlLXByZWRpY3Rpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Dogetti, Bitcoin, and Ethereum: Post-Silvergate Price Prediction - Analytics Insight",
        "content": "On Wednesday, Silvergate bank publicly spoke about its problems with the SEC regarding a filing that would delay its financial report. With this, the crypto bank decided to press the breaks on the payments to its exchange, the Silvergate Exchange Network. This spiked fear and uncertainty in investors, causing a bank run that led to a loss of $1 billion!\n\nSilvergate Bank is the main payment network provider for numerous cryptocurrencies, so the bank run has had a severe impact on the industry. Silvergate is also well known for working with FTX and Alameda Research and, in effect, also experienced an enormous loss of $14 billion in 2022. How will the bank’s recent problems with the SEC affect some of crypto’s top coins and tokens?\n\nDETI’s Recent Developments\n\nThe top crypto meme coin, Dogetti (DETI), is yet to be officially released. However, through a strong community ethos and enticing features, the token has already managed to rake in a mass “family” of investors.\n\nWhile DETI is still in its early presale stages, they have already secured an official contract address as of last week. A contract address is an address created by cryptographic technologies which allow cryptocurrencies to be bought and sold. This is an exciting step toward the dog-themed coin becoming an established part of the industry. In addition, the DETI team has released a limited launch code (WISEGUY25) which offers 25% off all tokens during stage 1 of the presale.\n\nGiven that Dogetti is still in its presale, most investors assume the dust will have settled regarding the Silvergate damage before the token’s launch. Furthermore, crypto analysts predict that these unfortunate events will have little to no impact on DETI.\n\nBitcoin’s Bear March\n\nOn account of the Silvergate complications, Bitcoin’s (BTC) latest price action has abolished $20 billion of its market cap, which now stands at $431 billion. The coin’s price fell from $23,800 to $22,300, and many other coins, such as Solana (SOL), Cardano (ADA), and Polygon (MATIC), encountered losses between 4% to 5%. BTC is now facing major selling pressure following a decision taken by Coinbase and Paxos from Silvergate to alternative banking partners.\n\nOn the 4th of March, BTC was hanging on around $22,350. However, if it weren’t for recent events, analysts predict that BTC would have reached 25k this week! If matters get worse, the coin may even break $22k and plummet near $21,600. BTC is now floating at around $22,400, but if it manages to break $23k, we may see a bull run for BTC once again.\n\nCan Ethereum Recover from this?\n\nThere was another major bank run for crypto investors on Saturday, leaving Ethereum (ETH) to slip by 0.19%, in addition to its 4.73% drop on Friday. This reduced the coin’s price to $1,567, below the point of 1,600 for the first time since mid-February! This morning, ETH experienced a high of $1,578 but struggled against its resistance level, which stands at $1,630.\n\nConsidering the latest Silvergate bank drama, the ETH charts indicate more bear runs before things improve. However, Ethereum has managed to hold a price of above $1,550, which it hasn’t fallen below since the beginning of February, and even then, it quickly recovered back up to $1,600 in a mere few days.\n\nSo even if ETH is bound to face further price drops, there’s a good chance that it will recover soon enough. With that, we can only hope that the possible incoming bankruptcy of Silvergate bank doesn’t affect other crypto-related firms in its wake. All things considered, crypto analysts still believe that ETH is likely to return to $1,700 once things have cooled down. They also predict that by the end of 2023, the coin may likely break past $2,000 and be on its way to a full recovery!\n\nClick the Following Links to Learn More About Dogetti!\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiKWh0dHBzOi8vY2xlYXJ0YXguaW4vcy9iaXRjb2luLXZzLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin vs Ethereum: How Is Ethereum Different From Bitcoin - ClearTax",
        "content": "Bitcoin and Ethereum are the Xbox and Playstation of the cryptocurrency world. They are two of the most popular cryptocurrencies whose contribution to the sector's growth has been enormous. From price to the premise, their concepts are unique but with a few things in common.\n\nWhat is Bitcoin?\n\nUsers under the pseudonym Satoshi Nakamoto first created the concept of Bitcoin in 2008. Bitcoin allows users to manage a currency not controlled by any financial institution or government.\n\nA set of decentralised networks runs the Bitcoin blockchain software with its own rules to which every participant must agree. These rules determine how every transaction works. It was the first cryptocurrency based on DLT (Decentralized Ledger Technology) blockchain.\n\nThe Bitcoin network processes multiple data sets and converts them into hashes through an algorithm called the SHA-256 hash function. It processes data and converts them into long strings of numbers.\n\nBitcoin's mining and consensus mechanism ensures that users cannot spend their funds twice, enabling it to stand out as a tamper-proof currency. Moreover, Bitcoin also features a store of value, which users can stock as an asset and use over time. Bitcoin's hassle-free mode of transactions has increased its popularity over time.\n\nWhat is Ethereum?\n\nThe Ethereum network was launched in July 2015, and its co-founder, Vitalik Buterin, published its white paper in 2013. Ethereum uses its blockchain to create a decentralised computer, like interacting with applications and making transactions based on the Ethereum network.\n\nThe main goal of Ethereum was to decentralise everything on the internet. This cryptocurrency operates on its programming language and solidity and is surging daily on the ladders of innovation. For instance, Non-Fungible Tokens (NFTs) and decentralised financial service applications are examples of what developers can create using Ethereum-based smart contracts.\n\nUsers must pay a fee for creating smart contracts, paying for transactions, and using decentralised apps in Ether. Today, as this ambitious cryptocurrency's value is increasing, it is also being used to store value.\n\nBitcoin and Ethereum: Overview\n\nQuite often, these two biggies of the crypto world are compared against each other. However, you should know that Bitcoin and Ethereum are merely systems, whilst the cryptocurrencies these two systems use are called bitcoin (small letter b) and Ether. Their respective stock symbols are:\n\nbitcoin: BTC\n\nEther: ETH\n\nMain takeaways: Bitcoin v/s Ethereum\n\nParticulars Bitcoin Ethereum Currency v/s platform A feasible alternative to traditional currency. Acts as a medium of exchange and store of value. A platform that runs programmatic applications and contracts via Ether. Launch date January 2009 July 2015 Price** £23,756 £1,575 Market cap** £478 bn £191 bn Consensus mechanism Proof of work Proof of stake Block time 10 minutes 12 to 14 seconds Max supply 21 million Unlimited\n\n**Please note that the abovementioned data is current as of 27th May 2022 and is subject to change over time.\n\nSpeaking of how similar these two systems are, both use blockchain technology to record and validate all their transactions. However, Ethereum's upcoming change plans differ concerning accessibility, sustainability, and speed.\n\nBefore discussing their major difference in the consensus mechanism, let's understand what a consensus mechanism is.\n\nConsensus Mechanism\n\nA consensus mechanism refers to a computer algorithm which mainly aims at solving the problem of 'double spending' by making any blockchain viable. BTC is a string of codes that can be infinitely copied. In other words, you can become as wealthy as you want to be by simply making multiple copies of your BTC.\n\nHowever, the reality is very different. Every time you spend a bitcoin, its copy gets destroyed, and the recipient on the other side of the transaction receives a new version. A record of all details of transactions is maintained on a distributed ledger, where the world can see that you have spent your BTC.\n\nThe ledger holders' consensus would clearly indicate the fake one if you attempt to spend a copied version. Counterfeiting even one such transaction would be difficult, and then you have to modify each transaction since all of them are correlated.\n\nTo work around this, you either have to control at least 51% of that network's mining hash rate or have massive computing power. Therefore, an attack as such on Bitcoin or Ethereum is probable but still hypothetical. From the very beginning, Bitcoin and Ethereum used distinct consensus mechanisms. Bitcoin uses 'proof of work' while Ethereum aims at using a 'proof of stake' consensus mechanism.\n\nBitcoin: Proof of Work\n\nProof of work (PoW) is the decentralised consensus mechanism, where network members put feasible amounts of effort to deter anyone from gaming the system. It is mainly used in cryptocurrency mining for mining new tokens and validating transactions.\n\nProof of Work: Understanding\n\n'Work' involves estimating a unique 64 characters string that is alphanumeric as accurately as possible. Within a 10-minute window, anyone making the maximum number of guesses per second has the highest chance of being chosen as a validator.\n\nProof of Work: Criticism\n\nEarlier, hobbyists sitting at home used to do this 'work'. However, the processing power required to get it done has increased exponentially. As a result, only those able to afford the necessary power and hardware can get this work done today, like companies and specialist mining organisations.\n\nThe energy required for computer hardware is enormous and is the sole reason behind Bitcoin's criticism. Currently, it uses 19 terawatt hours (TWh) every year, nearly the amount used by an entire country like Norway.\n\nEthereum: Proof of Stake\n\nThis consensus mechanism initiates processing transactions and helps create new blocks in the blockchain based on the total number of validator stakes coins. The PoS structure has less potential for a network attack thanks to its well-designed structure.\n\nUnder Proof of Stake, the next block writer is selected randomly, with nodes having larger stake positions being assigned with higher odds.\n\nProof of Stake: Understanding\n\nUnder proof of stake (PoS), owners themself offer coins as collateral and are given a chance to validate blocks. As a result, coin owners with 'stake coins' are eligible to become 'validators'; however, they should own a specific amount of stake coins. Next, a random validator is selected who gets to do the 'mining' unlike the competition-based mechanism as in the proof of work.\n\nProof of Work v/s Proof of Stake: Main Takeaways"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vY2xlYXJ0YXguaW4vcy9ldGhlcmV1bS12aXJ0dWFsLW1hY2hpbmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Ethereum Virtual Machine (EVM): Features, Purpose And Benefits - ClearTax",
        "content": "The Ethereum Virtual Machine (EVM) is a computation engine which functions as a decentralised computer with abundant applications that can be implemented. It is the central framework in the Ethereum blockchain. The EVM is one entity upheld by numerous connected computers that perform instructions in large numbers. Every instruction comprises an operator and its operands.\n\nWhat is the EVM?\n\nThe Ethereum Virtual Machine (EVM) is a dynamic and isolated virtual stack implanted entirely throughout the Ethereum node. It is responsible for implementing contract bytecode. After writing them in complex languages, like Solidity, contracts are compiled to EVM bytecode. Many programming languages like C++, Java, JavaScript, Ruby, and Python execute Ethereum Virtual Machines efficiently.\n\nFeatures of EVM\n\nThe following are the essential features of the Ethereum Virtual Machine. They are:\n\nEVM acts as a virtual machine and the foundation of the total operating system of Ethereum.\n\nThere are two types of accounts for Ethereum under the EVM. They are Contract Accounts and Externally Owned Accounts (EOA).\n\nThe EVM arranges numerous additional utilities to the blockchain so users can enjoy hassle-free running on the system.\n\nAll nodes of Ethereum perform on EVM to keep consensus throughout the blockchain.\n\nEVM enables a special code to run on Ethereum, known as smart contracts.\n\nThe code inside EVM is entirely inaccessible to the system, network, or other areas.\n\nIt is a part of the Ethereum network that focuses on executing transactions alongside smart contract deployment. In the meantime, smart contracts keep contract accounts in smart wallets.\n\nWhat is the purpose of the EVM?\n\nThe main power of EVM is to decide the comprehensive state of Ethereum for every block in a blockchain. Ethereum is quite similar to other blockchain-based networks. It has its native cryptocurrency (Ether) and uses a distributed ledger that includes autonomous computers (nodes) for recording, synchronising and running transactions in particular electronic ledgers.\n\nHowever, Ethereum retains some special functions due to its smart contract capability. In other words, the state of Ethereum is a huge database that records every Ether (ETH) account and balance.\n\nHow is gas related to the performance of EVM?\n\nAny transaction on Ethereum symbolises an Ether (ETH) transaction. Transactions require fees. When it comes to Ethereum, it denotes its fees as gas, which fuels decentralised applications.\n\nIn case of high networking activity, gas fees increase. However, if the execution fails, you can stay sure of getting the pre-paid amount. An execution will end soon if it runs out of gas.\n\nBenefits of EVM\n\nThere are certain benefits of the Ethereum Virtual Machine. They are:\n\nAnyone can create their decentralised application via EVM as it has no involvement of security obstacles.\n\nNowadays, NFTs or Non-Fungible Tokens, are gaining a lot of fame in cryptocurrency. With adequate knowledge about these financial securities, you can create digital art and sell it on a decentralised market using EVMs.\n\nDrawbacks of EVM\n\nUnlike advantages, there are some disadvantages of the Ethereum virtual machine. Let’s see them too:\n\nIf the owners of these services discontinue using Ethereum, the nodes will stop doing any function, thereby crumbling the entire network.\n\nUsing an EVM requires certain technical proficiency. Hence, it is limited to those who do not know to code. Only a few applications have Graphical User Interfaces (GUIs) that only enable some selected individuals to gain the advantage of NFTs.\n\nEthereum is also called a ‘global/world computer’ as all Ethereum network nodes successfully run the EVM and implement similar instructions. It makes all other nodes reach a consensus about the system's state."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vaGFja2Vybm9vbi5jb20vZGVlcC1kaXZlLWludG8tdGhlLXBvbHlnb24tZWNvc3lzdGVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Deep Dive Into the Polygon Ecosystem - hackernoon.com",
        "content": "442 reads\n\nDeep Dive Into the Polygon Ecosystem\n\nMarch 10th 2023 11 m by @ pbhelsz 442 reads"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMioAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9yZWdpc3Rlci15b3VyLWVtYWlsLXdpdGgtc2lnbi11cC10b2tlbi1hbmQteW91LWNvdWxkLWJlLWEtbWlsbGlvbmFpcmUtbWVhbndoaWxlLXNpbHZlcmdhdGUtY3Jpc2lzLXdvYmJsZXMtYml0Y29pbi1hbmQtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Register Your Email With Sign Up Token, And You Could Be A Millionaire; Meanwhile Silvergate Crisis Wobbles ... - Analytics Insight",
        "content": "Cryptocurrency has been gaining prominence for several years now, both within the financial community and beyond. It’s not a straightforward market to breach successfully, and knowing when to invest or what to invest in is tricky in itself. The traditional giants, Bitcoin (BTC) and Ethereum (ETH), have been solid investments for many years, but the recent Silvergate Bank crisis has shown vulnerability. Sometimes, there is a potential for profits in new lesser-known cryptos, and one such coin is SignUp Token which presents people with an unmissable opportunity before it goes live.\n\nSignUp Token Launches Onto The Market Through Email Registration\n\nMost of the time, when crypto prepares to launch into the market, it does so through the usual avenues, be it presales or an ICO. This is a fine setting for many cryptos to assess the kind of impact they are likely to have on the market, but other ways ought to be explored. SignUp Token is a brilliant example of that.\n\nIt doesn’t need a presale or any kind of prepayment. Instead, all it pushes for is one million email sign-ups. What are the potential benefits for someone who signs up for this? Once SignUp Token reaches one million, it enters the crypto exchanges, and those who have registered their emails will be the first to know, allowing them to engage with the crypto with significant advantages with strong potential for huge profits.\n\nWe’ve all skipped past the endless streams of marketing emails, but this is not an email you want to miss out on. SignUp Token could be the new exciting crypto in 2023, and it’s offering everyone an unmissable opportunity to buy its tokens at an advantage when it finally enters the crypto market. Don’t spurn the golden chance to be one of the one million who register their emails.\n\nNo presale. Nothing to pay for whilst it’s yet to debut. All you need to do to put yourself in the position of eventually acquiring a potentially lucrative coin is register your email. That sounds too good an opportunity to pass up.\n\nSilvergate Troubles Cause Slump In Bitcoin Price\n\nThe Silvergate Bank has been providing a payment network to many cryptos for many years. But recently, it sunk into a crisis authored in part by the FTX crisis that saw Silvergate lose 60% of its deposits in one quarter when customers departed with around $8.1bn. This prompted a loss of confidence in Silvergate and saw many cryptos either distance themselves or entirely sever ties.\n\nThe effect on Bitcoin was clear. Its price went down by 4.5% as it fell from $23,500 to $22,259 whilst losing the not-so-small matter of £20bn from its market cap.\n\nThis underlines that, like a lot of other digital currencies, Bitcoin isn’t immune to experiencing blowbacks from external events. But it’s worth pointing out that Bitcoin is resilient to volatile trends within the market and has consistently stayed ahead of the competition. Its price has definitely been shaken by the Silvergate Bank crisis, but it is a coin built on tenacity, and that is why many investors persistently place their faith in it.\n\nEthereum Has Resilience To Recover From Silvergate Crisis\n\nBitcoin wasn’t the only major coin to be affected by what happened at Silvergate. The market’s second-largest coin, Ethereum (ETH), was also affected by the crisis as its price fell by 4.6% while its market cap dropped to just over $193 billion.\n\nBut just as this shouldn’t put anyone off from investing in Bitcoin, it has to be emphasised that Ethereum is one of the most resilient crypto platforms that investors love for a good reason. Why is this? It’s because price falls and bearish market moods are not uncommon. The crypto market regularly encounters turbulence, but what is striking about Ethereum is its capacity to remain one of the biggest coins despite this. Its prominence has grown within the market due to the growing use of DeFi platforms and decentralised applications, with many developers using Ethereum’s platforms to build their applications.\n\nIts utility and resilience make it one of the most coveted coins in the market for a reason.\n\nTo conclude, SignUp Token is utilising cost-free for everyone to get on board with its new token. It doesn’t cost you anything to register your email, and you get the significant advantage of knowing when it will debut on the market before everyone else.\n\nIf you’re interested in what it’s offering, have a look below!\n\nSignUp Token Website: https://signuptoken.com/\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vZGV2bS5pby9yZWFjdC9yZWFjdC1mcm9udGVuZC13ZWIzLWFwcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 18:56:38 GMT",
        "title": "How to Start Using Web3 on a React Frontend App - devmio",
        "content": "Experience our online live events, exclusive and interactive.\n\nThousands technical articles, magazines, cheatsheet and more.\n\nUp to 25% discount for more than 30 conferences a year with international experts."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vZG9sbGFyc2FuZHNlbnNlLnNnL3RvcC1jcnlwdG8tdHJlbmRzLWxvb2stMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Top 5 Crypto Trends To Look Out For In 2023 - DollarsAndSense.sg",
        "content": "The question that is probably on many investors’ minds is: Is the bottom here or is the crypto winter only just beginning?\n\nThe total market cap for all cryptocurrencies had peaked at US$2.97 trillion in November 2021 but had declined nearly 66% to about US$1 trillion as of the time of writing.\n\nYet signs of economic recovery and expectations for the US Federal Reserve’s (FED) rate hikes to reduce has caused Bitcoin prices to claw back some losses, rising 35% since 1 January 2023.\n\nHowever, crypto is still not out of the woods yet as regulatory bodies around the world including the US SEC are taking an increasingly hawkish approach towards crypto, signaling greater regulation for the industry and a taming of the crypto “wild west”.\n\nWith both bull and bear forces tugging on the market, we will look at five major trends that will shape the crypto world in 2023.\n\nRead Also: Top 10 Worst Performing Cryptocurrencies In 2022 (With At Least 1 Billion Market Cap)\n\n#1 The FED Seems Poised To Hike Rates A Few More Times In 2023\n\nAs Crypto Street and Wall Street become increasingly co-related in recent years, moves in the stock market are often magnified in the crypto market due to its nature as a risk-on asset. For much of 2022, the crypto world had been closely watching the actions of the US FED.\n\nRecent data have revealed inflation easing in the US. The inflation rate which reached a high of 9% in June 2022, has since dropped to 6.5% in Dec 2022.\n\nImage Credit: CNBC; US Bureau of Labor Statistics’ consumer price index\n\nHowever, the FED considers this reduction to be inadequate and is striving to bring inflation back to its target of 2% weighted average.\n\nBelow are the tentatively scheduled meetings in 2023, where they will decide on whether to raise interest rates or not. We will just have to watch the FED’s actions in the coming months.\n\nJanuary 31-February 1 (Concluded. Raised rates by 25 basis point, bringing interest rates to a target range of 4.5%-4.75% )\n\nMarch 21-22\n\nMay 2-3\n\nJune 13-14\n\nJuly 25-26\n\nSeptember 19-20\n\nOctober 31-November 1\n\nDecember 12-13\n\nWith a dropping inflation rate as well as a strong labour market, expectations are for the FED’s rate hikes to reduce. Cautious optimism has caused Bitcoin prices to recover in prices since this year.\n\n#2 Ethereum’s Shanghai Hard Fork Could Disrupt Crypto Markets\n\nEthereum’s price has been up nearly 30% since the start of 2023. Though a key reason was due to the improving economic climate, another main factor was the upcoming Shanghai Hard Fork in March.\n\nSo what is the Shanghai Hard Fork (and why was it given that name)?\n\nA crypto Hard Fork is basically a huge update to the blockchain, and historically Ethereum forks had always been named after famous cities (both historical and modern) such as Istanbul, Atlantis, and Constantinople.\n\nImage Credit: Visual Capitalist\n\nThe Shanghai Hard Fork will be the biggest Ethereum upgrade since The Merge in September 2022. The Shanghai upgrade will include Ethereum Improvement Proposal (EIP) 4895. This basically allows the withdrawal of staked ETH, which at the time of writing is worth more than US$26 billion, making it the most staked crypto in terms of market cap.\n\nThis change raised concern due to the fact that validators could potentially withdraw $26 billion ETH, leading to a wave of selling pressure. However, the opposing view is that with greater liquidity, more validators would be incentivised to stake, soaking up excess liquidity.\n\nIn fact, the percentage of staked ETH to total ETH Supply is only around 14%, which is low compared to other major Proof-of-Stake chains such as Cardano, Solana (both about 70%), and BNB (around 97%). With the new liquidity, ETH staking may in fact even increase post-Shanghai to 30-50% according to analysts.\n\nRegardless of whether there will be more or less ETH being staked, the market is betting that some of the biggest winners of Shanghai will be staking services like Lido Finance (LDO) and Rocketpool (RPL). The price of LDO is up ~140% since 1 Jan 2023, while RPL is up ~138%.\n\nRead Also: [Airdrops, Hard Forks, Play-To-Earn, Staking, Yield Farming] 8 Ways You Can Earn Cryptocurrencies For Free And Why They Are Free In The First Place\n\n#3 Impressive ETH Layer 2 Growth Show No Signs Of Abating\n\nThe amount of gas used by Ethereum Layer 2s has increased by nearly 400% in the past seven months, and the percentage of gas used by Layer 2s compared to the rest of the Ethereum Network continues to show an uptrend.\n\nLayer 2 ETH gas units increased from 1 billion in July 2022 to 4 billion in February 2023 / Image Credit: Dune Analytics\n\nIn Nov 2022, Ethereum Layer 2 Network Gas Usage hit all-time highs as transactions on Layer 2s increased substantially. Though the amount of gas has since dropped due to the market downturn, the percentage of ETH used for Layer 2s as compared to the rest of the Network continues to grow.\n\n\n\nPercentage of gas used by Layer 2s hovered between 1-2% for much of 2021 and 2022. It is now 4%. / Image Credit: Dune Analytics\n\nWith the growth of Web 3 and decentralised applications, ETH Layer 2’s demand increases. Some of the most popular Layer 2 crypto solutions include Polygon, Loopring, Arbitrum, and Optimism.\n\nMost of the popular Layer 2s are built upon Ethereum, and despite the ongoing updates to the Ethereum blockchain, Layer 2s remain a key factor in scaling. The Ethereum Foundation has stated: “The Ethereum ecosystem is firmly aligned that Layer 2 scaling is the only way to solve the scalability trilemma while remaining decentralised and secure.”\n\nLayer 2 solutions on other blockchains such as Bitcoin Lightning Network also showed explosive growth last year. 2022 was the year that saw a 300% increase in Bitcoin locked within the network as compared to mid 2021, spurred by factors such as growth of Bitcoin peer-to-peer payments. The Lightning Network is currently in use in El Salvador, and is one of the most popular Layer 2 solutions for Bitcoin.\n\n#4 Increased Regulations Will Shape The Crypto Market\n\nFor years, governments around the world have been looking to subject crypto markets to greater financial regulations, but with the recent crypto contagion, these efforts have only heightened.\n\n2022 was the biggest year ever for crypto hacking, with $3.8 billion stolen from cryptocurrency businesses, according to a Chainalysis report.\n\n\n\nImage Credit: Chainalysis\n\nThe US Securities and Exchange Commission (SEC) is leading the push to subject the crypto market to greater regulation, increasing scrutiny on Initial Coin Offerings and new tokens, calling for greater scrutiny on exchanges, and ramping up probes into Wall Street firms’ dealings with crypto, amongst other measures.\n\nChina has famously banned crypto mining in May 2021, followed by an outright ban in September 2021. Last year, it rolled out its own Central Bank Digital Currency officially in August.\n\nThe EU has launched various Anti Money Laundering (AML) directives in recent years, tightening Know Your Customer (KYC) and standard reporting requirements. In September 2020, the EU also proposed the Markets in Crypto-Assets Regulation (MiCA) framework aimed at protecting consumers, which was passed into law in 2022.\n\nFirms themselves have also started to release Proof-of-Reserve in order to regain customer trust in the wake of the FTX collapse. These firms include Binance, Bitfinex, OKX, Huobi, Gate.io, and Kraken.\n\nThe recent years also saw an increase in the number of crypto custody providers due to firms’ need to navigate complex crypto regulations in their respective jurisdictions as well as increasing crypto security risks.\n\n\n\nImage Credit: Blockdata\n\nRead Also: Insights: Key Lessons From The Recent FTX Fallout For Crypto Investors\n\n#5 Institutional Investors Back Away From Crypto and DeFi (For Now)\n\nFollowing the rapid collapse of FTX, institutional investors have slowed down their pace of investing in the crypto markets. Global institutional investments dropped from over $5 billion in Q1 2022 to under $1 billion in Q4 2022.\n\nImage Credit: S&P Global\n\nImage Credit: S&P Global\n\nMajor institutional investors from Blackrock to Ontario Teacher’s Pension Plan fund have written off their tens of millions invested into FTX. After institutional investors backed out, the ProShares Bitcoin ETF, once a popular vehicle with moneyed financial companies, quickly became the sixth-worst-performing ETF of all time, and crypto shorting intensified.\n\nAs recently as Dec 2022, JP Morgan’s head of institutional portfolio strategy Jared Gross said that “crypto is effectively non-existent for most large institutional investors.”\n\nRead Also: The Difference Between A Market Cap And A Fully Diluted Market Cap In The Crypto World\n\nA Silver Lining\n\nIt is important to note that these data were obtained given the recent economic climate and crypto contagion. Once the economy starts to turn for the better, institutional investing may yet again return to crypto. And whilst institutional interest in crypto waxes and wanes, longterm crypto plans for many Wall Street firms continue to stand, signaling that institutions believe that crypto is here to stay and are willing to invest in it.\n\nFinance giants Blackrock, Nasdaq, BNY Mellon, JPMorgan and Citadel are all launching various crypto services or investing in partners, and unveiled plans in Q3 and Q4 last year.\n\nThese institutions have signaled that they are primarily tapping digital assets as an alternative investment to stocks and bonds. There is also a growing sense among institutions that digital assets are here to stay, according to co-founder and CEO of Digital Asset Capital Management Richard Galvin.\n\nThe crypto market looks set to recover in the not-too-distant future (though that may take months, or at worst years). While some of these trends may cool the markets in the short term, for the long term interest and market fundamentals are only going to improve as a result.\n\nWhilst prices are low, investors may even consider Dollar Cost Averaging into crypto. As long as we are willing to hunker down and ride out the winter, the spring will eventually come.\n\nRead Also: 6 Cryptocurrency Exchanges For Singaporeans Who Want To Buy Bitcoin, Ethereum and DogeCoins\n\nAdvertiser Message\n\nGet The Latest Bite-sized Investment News, Ideas & Insights\n\nIt's free! Don't miss out on the latest financial market movements. FSMOne aims to help investors around the world invest globally and profitably, follow FSMOne’s Telegram for bite-sized finance analyses and exclusive happenings."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2JpdGNvaW5pc3QuY29tL2xpdGVjb2luLWx0Yy1hbmQtZXRoZXJldW0tZXRoLXByaWNlcy1jb250aW51ZS10by1yaXNlLWhlcmVzLXdoeS1pbnZlc3RvcnMtYXJlLXN3YXJtaW5nLW9yYmVvbi1wcm90b2NvbC1vcmJuL9IBhwFodHRwczovL2JpdGNvaW5pc3QuY29tL2xpdGVjb2luLWx0Yy1hbmQtZXRoZXJldW0tZXRoLXByaWNlcy1jb250aW51ZS10by1yaXNlLWhlcmVzLXdoeS1pbnZlc3RvcnMtYXJlLXN3YXJtaW5nLW9yYmVvbi1wcm90b2NvbC1vcmJuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 06:05:22 GMT",
        "title": "Litecoin (LTC) and Ethereum (ETH) Prices Continue To Rise, Here’s Why Investors Are Swarming Orbeon Protocol - Bitcoinist",
        "content": "The cryptocurrency world has seen significant growth and development over the past few years, with new projects emerging daily. Among the most exciting are Litecoin (LTC), Ethereum (ETH) and Orbeon Protocol (ORBN). Orbeon Protocol (ORBN) is currently in its presale stage, surging by 1988% so far.\n\n>>BUY ORBEON TOKENS HERE<<\n\nLitecoin (LTC)\n\nLitecoin (LTC) is a decentralized proof of work cryptocurrency meant as a faster and cheaper alternative to Bitcoin.\n\nAs one of the oldest crypto projects out there, Litecoin (LTC) shares many similarities with Bitcoin (BTC). Still, Litecoin (LTC) has several distinguishing features from Bitcoin (BTC). These unique features make Litecoin (LTC) better suited for smaller payments.\n\nFor one, Litecoin (LTC) transactions are four times faster than Bitcoin (BTC), and have lower fees. Additionally, Litecoin (LTC) has a higher supply limit, with a maximum of 84 million LTC compared to Bitcoin’s (BTC) 21 million.\n\nSince the FTX crash last year, there has been a resurgence in interest in Litecoin (LTC). Investors considered “digital silver” Litecoin (LTC) a safer bet than many other crypto projects. When decentralization is at a premium, Litecoin (LTC) will probably do well.\n\n>>BUY ORBEON TOKENS HERE<<\n\nEthereum (ETH)\n\nEthereum (ETH) is the largest blockchain network for smart contracts and decentralized applications (dApps). These innovative features attracted a strong community to Ethereum (ETH), with thousands of projects.\n\nThe primary advantage of Ethereum (ETH) is its smart contract capabilities, which enable developers to build decentralized applications that run on the blockchain. This feature has led to the growth of the decentralized finance (DeFi) sector, which has seen significant growth in recent years.\n\nUnlike other smart contract networks, the size of Ethereum (ETH) means that it is relatively decentralized. This helps independent developers mitigate the platform risk. So far, Ethereum (ETH) was the go-to network for most serious dApp developers.\n\nHigh gas fees and slow transactions have slowed the adoption of Ethereum (ETH). However, the latest upgrades are tackling those issues. The popularity for Ethereum (ETH) will likely continue to grow as the network expands its capabilities and features.\n\n>>BUY ORBEON TOKENS HERE<<\n\nOrbeon Protocol (ORBN)\n\nOrbeon Protocol (ORBN) is a unique investment platform disrupting the crowdfunding and venture capital industries. The Orbeon Protocol (ORBN) platform enables anyone to invest in some of the most promising early-stage companies on a fractional basis.\n\nThe Orbeon Protocol (ORBN) platform allows startups to raise funds and engage their communities by issuing reward and equity-based NFTs. Additionally, Orbeon Protocol (ORBN) uses blockchain as an additional layer of security for investors.\n\nORBN is currently in its presale phase and has seen tremendous price growth in recent weeks. So far, the Orbeon Protocol (ORBN) token jumped 1988%. Experts believe it could go as high as 6000% before the end of the presale.\n\nGoing forward, Orbeon Protocol (ORBN) could play a significant role in the growth of the decentralized finance (DeFi) and startup sector. This makes Orbeon Protocol (ORBN) a project to watch in the coming weeks.\n\nFind Out More About The Orbeon Protocol Presale\n\nWebsite: https://orbeonprotocol.com/\n\nPresale: https://presale.orbeonprotocol.com/register\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of Bitcoinist. Bitcoinist does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5oYXJsZW13b3JsZG1hZ2F6aW5lLmNvbS9jcnlwdG8tZXhwZXJ0cy1uYW1lLWV0aGVyZXVtLXRoZS1xdWVlbi1vZi1kaWdpdGFsLWN1cnJlbmN5LWJ1dC1sZXRzLXRhbGstYWJvdXQtaXRzLXNlY3VyaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Crypto Experts Name Ethereum The Queen Of Digital Currency But Let's Talk About Its Security - Harlem World Magazine",
        "content": "The last few years have shown that the jurisdiction of digital currencies knows no limit as several sectors welcomed cryptocurrencies and the blockchain into operations.\n\nInvesting in digital currencies with a history of beating bear markets and secure networks is crucial for organisations seeking ways to maintain exposure and competitiveness in the market. Ethereum and Bitcoin are the most well-known digital currencies that fit the bill. Those looking for a platform where to buy Ethereum or Bitcoin can use Binance because it provides information about cryptocurrencies’ evolution and helps them figure out when the ideal moment to invest in a coin is.\n\nBitcoin and Ethereum have been on the crypto market for more than two cycles, enabling investors to earn high returns on investments in bull markets. People considering investing in cryptocurrency at the moment most likely think about buying one of the two largest digital currencies by market cap. However, considering the high price of Bitcoin, many turn to Ethereum. Ethereum is also a proven bear market beater because it spiked in value in the next bull market. A lot has changed for the most popular altcoin since the last bear market, most notably the Merge that allowed it to switch to a proof-of-stake consensus. This eco-friendly consensus allows the blockchain to save 99.95% more energy. Considering the present global focus on energy efficiency, ETH ensured its longevity and survival in the sector. But this feature isn’t enough to convince investors to add it to their portfolios.\n\nIs Ethereum secure?\n\nThe potential of a cryptocurrency like Ethereum doesn’t count for much if it lacks advanced security features. So, the question is, how secure is the decentralised network that is Ethereum?\n\nAccording to experts, Ethereum is more secure than most innovative blockchain solutions. Still, if you use an exchange or decentralised app that lacks proper security, your data and finances can get compromised.\n\nSign-Up for our Newsletter * Select list(s) to subscribe to Harlem World Magazine Example: Yes, I would like to receive emails from Harlem World Magazine. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. By submitting this form, you are consenting to receive marketing emails from: Harlem World Magazine, 2521 1/2 west 42nd street, Los Angeles, CA, 90008, https://www.harlemworldmagazine.com. You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact\n\nSuppose you’re new to the subject; asking if Ethereum is a secure cryptocurrency is similar to asking if laptops and smartphones are secure; you should be more specific if you want a meaningful answer. Ethereum is a blockchain, like all the other cryptocurrencies available on the market. However, its functionality is different from the other digital currencies because it was created to enable the execution of smart contracts. So if you want to find out if Ethereum is secure, you need to find answers to more specific questions like Is the Ethereum blockchain secure? Are smart contracts secure? Can the Ethereum network be hacked?\n\nUnfortunately, people lacking cryptocurrency knowledge will look at a hack resulting from an issue with smart contracts and conclude the entire Ethereum blockchain is unsafe. This is a bad interference because you cannot say that the entire Internet is unsecure only because cybercriminals can use it to send scam emails.\n\nWhy do some believe Ethereum lacks security?\n\nThe matters of security have become more complicated since Layer 2 networks have increased in popularity because they add a new dimension to the Ethereum network and bring their own security concerns. Layer 2 ecosystems are different from the Ethereum blockchain because they’re meant to remove some of the computational strain the main blockchain features and boost its scalability.\n\nTo understand if Ethereum is secure, it’s best to focus on its infrastructure as a blockchain and its smart contracts – even if the Layer 2 networks have a huge impact on its security processes.\n\nBlockchain hacks don’t have much to do with Ethereum’s security\n\nMost of the high-profile hacks and security issues the news reported aren’t the result of a vulnerability in the Ethereum blockchain. They’re connected with the infrastructure of smart contracts because blockchain as technology in itself is one of the most reliable solutions known.\n\nBlockchain (whether we talk about Ethereum or bitcoin) has been created to prevent anyone from seizing control over the ecosystem or adding counterfeit blocks to the ecosystem. Ethereum miners receive economic incentives – minted ether, transactions fees – for mined blocks, which encourages them to act in the blockchain’s best interest instead of trying to manipulate it.\n\nThe proof-of-stake consensus is expected to boost Ethereum’s security\n\nEveryone knows that Ethereum completed the Merge, meaning that it transitioned from a proof-of-work to a proof-of-stake consensus. The previous mining model encouraged miners to solve complex mathematical problems to create new blocks to add to the blockchain. But the new model requires validators to take turns on the ecosystem to propose and validate blocks. They receive incentives according to the number of coins the node is staking.\n\nEthereum supporters state that the switch can increase Ethereum’s security. For someone to take control over a proof-of-stake blockchain, they need to control 51% of the computing power. But for someone to control a proof-of-stake blockchain, they need to control over 51% of the total number of coin stakes. Therefore, holding this amount of ETH is more expensive than controlling 51% of computing power.\n\nStatistics show that a 1-hour attack on Ethereum using the proof-of-work consensus would cost $282,539. Ethereum’s current market cap is over $38 billion, so someone would need around $20 billion to control 51% of ETH. An attack in the present conditions would cost millions.\n\nSmart contracts’ flexibility could harm Ethereum’s security\n\nWhen it comes to digital currencies, there’s a trade-off between decentralisation and security because the more decentralised a system is, the higher the risk of a security breach. Smart contracts are such a trade-off example. Solidity – the programming languages of the blockchain were created with flexibility in mind. Ethereum enables developers to design virtually any kind of token or DApp they want. This is one of the reasons why Ethereum hosts some of the most prominent projects in the sector but has also experienced several security breaches over the years.\n\nThe programming language’s flexibility shouldn’t be blamed for the blockchain’s vulnerability, but its semantics because they make it challenging for some programmers to master. It’s hard for some developers to learn programming languages because while they look similar to JavaScript, they behave differently.\n\nGiven the presented info, we can conclude that Ethereum is a secure blockchain, but its users’ choices can make them vulnerable to breaches."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vYml0Y29pbmlrLmNvbS9jZnRjLWNoYWlybWFuLXNheXMtZXRoZXJldW0taXMtYS1jb21tb2RpdHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "CFTC Chairman Says Ethereum Is A Commodity - Bitcoinik",
        "content": "The latest statement passed by Rostin Benham over the nature of Ethereum (ETH), created a new controversy among US lawmakers.\n\nIn the United States (US), there are two dominant financial market regulatory bodies. These are the Commodity Futures Trading Commission (CFTC) and the United States Securities and Exchange Commission (SEC). The SEC agency regulates the crypto market with more dominance over the CFTC agency. The CFTC agency regulates derivatives markets, including futures, options, and swaps. The SEC agency ensures the creation of fair markets, corporate disclosure, protecting Investors, and enforcing the law.\n\nOn 8 March 2023, Before the Senate Agriculture Committee, the CFTC chair Rostin Benham said that he believes Ethereum is security and should be listed on CFTC exchanges.\n\n“I’ve made the argument that Ethereum is a commodity…it’s been listed on CFTC exchanges for quite some time,” Benham said.\n\nAccording to Benham, his opinion on the nature of Ethereum will provide a basic support for the CFTC agency to regulate the derivatives markets trading ETH & also underlying products.\n\nFurther on the stablecoins, Benham said that Stablecoins should also be a commodity in his opinion despite the comprehensive dedicated regulatory framework on the stablecoin companies.\n\n“I agree … that stablecoins are and should be … regulated financial instruments. Notwithstanding a regulatory framework around stablecoin, they’re going to be commodities in my view,” the CFTC chair said.\n\nJust a few weeks ago, SEC chairman Gary Gensler stated that all cryptocurrencies are securities, except Bitcoin. For that statement, Gensler faced huge criticism from the crypto proponents.\n\nHowever many experts said that we should not focus on the statement passed by the SEC chairman because it was his personal opinion on the nature of cryptocurrencies.\n\nIn the present time, the SEC agency fighting against the San Francisco headquartered Fintech company Ripple over the nature of the XRP token, as a priority case in its to do list. In Dec 2020, the SEC initiated the case against Ripple executives & Ripple labs over the sale of more than $1.3 billion worth of unregistered securities sale.\n\nRead also: Despite several crypto companies’ fallout, people trust centralized crypto custody services"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYmxvY2t6ZWl0LmNvbS90aGUtc2hhbmdoYWktdXBncmFkZS1hLWdhbWUtY2hhbmdlci1mb3ItZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "The Shanghai Upgrade: A Game-Changer for Ethereum? - Blockzeit",
        "content": "The Shanghai upgrade for Ethereum is currently targeted for this March. This will enable staking withdrawals for the first time since people began staking their ETH in 2020. Unlike other PoS networks like Cosmos, with a fixed withdrawal period for stakers, set at 21 days, Ethereum’s is dynamic based on how many validators are exiting at a given time.\n\nSo, how does the Shanghai upgrade come into play?\n\nThe Ethereum’s Overview\n\nThe Ethereum network is scalable, programmable, and decentralized. For many investors, it is the blockchain of choice.\n\nEthereum started with a proof of work (PoW) mechanism. Later, it began its journey toward proof of stake (PoS) with the launch of the Beacon Chain in December 2020. Later on, the Ethereum Merge happened after a series of testnet checks, making the Ethereum network a PoS one.\n\nStaking, for many investors, is a crucial way of making money as it helps put assets to work and earn passive income without selling assets. However, in the Ethereum network, one issue still was hectic; cost. This is because the minimum amount required for staking to join the Beacon Chain was 32 ETH.\n\nAs a result, a series of projects began working on a more accessible way to stake on Ethereum, dubbed liquid staking.\n\nThe Shanghai Upgrade\n\nThe Shanghai upgrade is likely one of the most significant events for the Ethereum blockchain. Currently planned for the first half of 2023, the upgrade is set to bring several improvements to Ethereum.\n\nShanghai comprises of several upgrades, but the most impactful one allows ETH stakers to remove their staked ETH and the rewards accrued.\n\nThis change is established in the EIP-4895 proposal.\n\nSeveral other proposals related to the Ethereum Virtual Machine (EVM) Object Format (EOF). This software component of all EVM-compatible chains contains more than 120 operation codes that give decentralized programmability to the networks.\n\nHowever, one of the proposals that will not be present in the March 2023 release is EIP-4844. The proposal introduces proto-danksharding and sets up the highly anticipated sharding upgrade due in 2024 for the Ethereum network.\n\nThe most likely advantage of the upgrade is the spur it brings on the case of innovations regarding direct staking and liquid staking solutions. Additionally, it will bring on ETH’s position on the table as a staking protocol.\n\nTakeaway\n\nThere are preparations already set for the upgrade. The most visible is Metamask integrating Lido and Rocket Pool, some of the most popular liquid-staking options. Once the Shanghai upgrade is complete, this will enable their users to stake ETH directly from their Metamask wallets.\n\nThe Shanghai upgrade is an essential milestone in Ethereum’s ongoing evolution. As the network continues to grow, we can be sure to expect even more exciting developments in the future."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmludmVudGl2YS5jby5pbi9idXNpbmVzcy9maW5hbmNlL2tub3ctdGhlc2UtdGhpbmdzLWFib3V0LWV0aGVyZXVtLXZpcnR1YWwtbWFjaGluZS1ldm0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Know These Things About Ethereum Virtual Machine (EVM) - Inventiva",
        "content": "To understand how the Ethereum blockchain works, it is essential to get acquainted with its core component – the Ethereum Virtual Machine (EVM). The EVM provides a secure, trustless infrastructure for developers to compile and execute smart contracts on Ethereum. Before investing in Ethereum, you may also read about some top advantages of Ethereum.\n\nFor many skilled coders in the blockchain space, this technology is one of the biggest advantages that make launching DeFi platforms like DApps, tokens, and DEXs on Ethereum so appealing. If you’re new to all this tech talk but still curious about what makes the EVM appealing, here’s an overview of what it does and how it functions.\n\nWhat is an Ethereum Virtual Machine?\n\nEthereum Blockchain has developed an important component known as Ethereum Virtual Machine (EVM). It is the main platform of blockchain that permits the operation of codes for smart contracts. It’s authored in Solidity programming language and also operates on Ethereum as a runtime atmosphere for several distributed applications (DApps).\n\nThe EVM’s adaptability as well as support for smart contracts is exactly what makes it well-known among programmers. Additionally, it enables you to create applications in your chosen programming language and run them in the safe environment of Ethereum. The EVM can identify the condition of the bzzlockchain after including each block, apart from utilising smart contracts. It’s developed like a state machine which enables it to execute specific immutable operations to figure out the state of Ethereum.\n\nHow does Ethereum work?\n\nEthereum Virtual Machine functions like a sandbox or a private Virtual computer in which you could create dApps. These dapps are created in various programming languages and are maintained in the Ethereum blockchain. Inside the Ethereum system, the EVM can be incorporated into every node. It produces a cloud environment including all guidelines as well as conditions for the delivery of code. This guarantees the instant implementation of smart contracts.\n\nCode may be made in scripting languages such as Solidity, Python, Vyper or maybe some EVM-compatible language. The EVM can’t, though, handle all programming languages. Firstly, it transforms the code into “bytecode” computer-understandable code. Additionally, since operations are carried out in a sandbox atmosphere, you can change them at any time without impacting your data or programs.\n\nThis will make the computer more dependable and secure for getting started on any DeFi project. At the front end of carrying out smart contracts, various functions happen. It includes 2 primary features:\n\nGas Fee Calculation\n\nFor every transaction which the EVM performs there’s a charge. It makes sure, though, that the device doesn’t have downtime and functions seamlessly. If you wish to utilize the highly effective EVM tool to put into action a smart contract, you have to purchase the gas. Gas is utilized as a unit of work for Ethereum. It sets the price of calculation for a transaction in the system. This is the reason the EVM computes its gas charges along with the backdrop of good contract execution. Additionally, it internally calculates commissions for completed orders. Thus, whenever you verify a transaction, your wallet is going to ask you for a little amount of Ether as reimbursement for gas. The payment generally depends upon the specifics of a smart contract.\n\nEVM using OpCode\n\nThe EVM is a Turing Complete platform, which means that it can operate any complicated algorithm. This particular ability is the result of the Opcode because it lets EVM carry out instructions for smart contracts. Opcodes are a group of more than 140 instructive operations that assist EVM in executing codes. These actions are Push, Call, and ISZERO mSTORE among others. It additionally utilizes other actions to be able to work with various blockchains."
    }
]