[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdG8tY2hlY2stYW4tZXRoZXJldW0tdHJhbnNhY3Rpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "How to check an Ethereum transaction - Cointelegraph",
        "content": "A transaction on the Ethereum blockchain is technically initiated by an external account owner (not a contract). For example, if User A sends 1 Ether (ETH) to User B, the action of debiting from one account and crediting to another changes the blockchain’s state.\n\nThe change specifically takes place on the Ethereum Virtual Machine (EVM). Ethereum transactions need to be broadcast to the entire network, and any node can broadcast a request for the execution of a transaction on the EVM.\n\nAfter broadcasting the request, a validator can then execute the transaction and propagate the state change to the whole network. Transaction fees are incurred during the process of validation, and each transaction must be included in a validated block. There are different types of transactions on the Ethereum network:\n\nRegular transactions: transactions occurring from one account to another.\n\nContract-execution transactions: transactions interacting with deployed smart contracts (the “to” address is a smart contract address).\n\nContract-deployment transactions: transactions with no “to” address (the data field is simply used to deploy the smart contract’s code).\n\nHow to check the status of an Ethereum transaction\n\nHere’s a brief step-by-step guide on how to track Ethereum transactions:\n\nStep 1: Select an Ethereum blockchain explorer\n\nSome blockchain explorers are specific to Ethereum, such as Etherscan, Ethplorer and EthVM. Others support multiple chains, such as Blockchain.com and Tokenview, among others.\n\nStep 2: Enter the transaction hash into the blockchain explorer’s search field\n\nOn Etherscan, for example, the search field is on the top, left-hand corner of the screen next to a dropdown that says “All Filters.” Depending on the tool, a user can search for information based on a wallet address, transaction hash (txid), block, token or domain name.\n\nThe txid is a unique identifier attached to a specific transaction. All transactions carried out on-chain, or those to and from external addresses, carry a unique txid found in the transaction details.\n\nDepending on the platform, it can also be called a “hash” or “txn hash.” It usually looks like a string of random letters and numbers. On MetaMask, for example, a user can instantly see the txid upon clicking the “Activity” tab and selecting the transaction.\n\nOther than the txid, traders can also use their public address (a string of 42 characters corresponding to their public account). In this case, they will be taken to an overview of their wallet activities, allowing them to navigate to the specific transaction independently.\n\nRelated: Ethereum wallets: A beginner’s guide to storing ETH\n\nStep 3: Click the icon for “search” or “enter” on the blockchain explorer\n\nStep 4: Check if the transaction was successful or not\n\nHow to know if an ETH transaction was successful: Details indicating the state of the transaction will appear on the blockchain explorer. If the transaction was successfully validated and is now on the blockchain, it will say “success” or “successful.”\n\nIf there are no errors displayed, it means that the transaction was completed successfully. The ETH should be credited to the destination wallet or exchange account within 24 hours of sending.\n\nIn the event of an Ether transaction failure, on the other hand, several error messages can appear:\n\nError message or symbol: A red exclamation point or an error message saying “bad instruction” or “out of gas” means that the transaction was unsuccessful and the funds did not reach their intended destination. In the case of an “out of gas” error, users can double the gas limit they initially specified and try again.\n\nReverted: This pertains to a smart contract user error. It means that the user should double-check the details of the transaction.\n\nTransaction not found: Either the transaction did not go through or it isn’t appearing on the blockchain explorer yet. Try using another explorer. If it still doesn’t appear on multiple ones, there’s a good chance it did not go through.\n\nPending: The transaction is still waiting to be validated or processed, but it was located in the explorer’s transaction pool. Sometimes pending transactions can still be canceled or replaced by a user.\n\nRelated: ​​​​How to sell Ethereum: A beginner’s guide to selling ETH\n\nHow long does an Ethereum transaction take to process?\n\nAn average transaction on the Ethereum blockchain will typically take between 15 seconds and five minutes to process, depending on several factors. These include the amount paid to process it (transaction fee) and how busy the network is at the time of processing.\n\nEthereum transitioned from a proof-of-work to a proof-of-stake blockchain after the Merge. However, transaction speeds remain roughly the same. According to the Ethereum Foundation, it’s a common misconception that the Merge drastically sped up transactions.\n\nHowever, there’s a slight difference, with slots occurring precisely every 12 seconds post-Merge compared with every 13.3 seconds pre-Merge. In any case, the change is barely noticeable by most users, as processing still usually depends on network congestion and transaction fees.\n\nWhen a transaction is initiated, it is logged into Ethereum’s memory pool (mempool) and waits for validators to pick it up. The mempool functions much like a waiting room where pending transactions are held.\n\nOnce a validator enters transaction data into a block and adds the block to the blockchain, the transaction is considered complete. It is said to be finalized and irreversible after six additional blocks have been mined and added on top of it.\n\nBy checking a transaction’s status, traders can confirm whether their transaction has succeeded or failed and how many blocks have been created since their transaction was added to the chain.\n\nWhy should traders check a transaction’s status?\n\nEthereum participants must pay gas fees to use the network to transfer funds or deploy smart contracts. The fees largely depend on the number of participants waiting to execute transactions at a given time.\n\nNetwork congestion and demand are thus directly proportional to transaction costs. When demand is high, costs rise — the opposite is true when demand is low. In any case, checking a transaction’s status helps a trader monitor the cost of using the network.\n\nIt can also help users determine if the gas fee they paid is sufficient to have their transaction confirmed. Low gas fees can usually truncate or delay transactions, leaving them to remain pending for long periods of time, especially during high network congestion.\n\nSuch transactions will remain pending until the gas fees reach the required minimum fees on the network. If this happens, a user can resend the transaction by resubmitting it and increasing the gas fee while ensuring it carries the same nonce.\n\nIn addition to transaction status, Ethereum blockchain explorers can also reveal the following helpful information:\n\nTimestamp: the date and time the transaction was added to the blockchain.\n\nBlock confirmations: the number of blocks mined since the transaction was confirmed.\n\nTransaction fee: the fee paid to the miner or validator.\n\nETH price: the price of ETH at the time of processing.\n\nBase fee: the lowest fee required to transact on Ethereum.\n\nGas limit: the maximum amount of gas the sender is allocating to process the transaction.\n\nNonce: a unique number marking each transaction executed on a user’s wallet; it increases by one each time a new transaction is sent.\n\nBy being aware of the above, traders can stay on top of their ETH transactions and make sure transactions are processed correctly and quickly. This helps to ensure smooth Ethereum transactions when sending and receiving funds or deploying smart contracts. Understanding a transaction’s status can also help users adjust their spending habits and optimize network usage."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMDUvZXRoZXJldW1zLW1lZGlhbi1nYXMtcHJpY2Utc3VyZ2VzLXRvLTEyLW1vbnRoLWFzLXBlcGUtZnJlbnp5LWdyaXBzLW1hcmtldC_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzA1L2V0aGVyZXVtcy1tZWRpYW4tZ2FzLXByaWNlLXN1cmdlcy10by0xMi1tb250aC1hcy1wZXBlLWZyZW56eS1ncmlwcy1tYXJrZXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum Gas Fee Surges to 12-Month High as PEPE Frenzy Grips Market - CoinDesk",
        "content": "PEPE surpassed the $500 million mark in market capitalization within three weeks of the launch. Similar frenzied activity has been seen other smaller coins. For instance, CHAD and 4TOKEN have rallied 450% and 250% in one week, while DINO has risen 500% in two weeks."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbmdhcGUuY29tL2hpc3RvcmljYWwtZGF0YS1zdWdnZXN0ZXRoZXJldW0tZm91bmRhdGlvbi12aXRhbGlrLWJ1dGVyaW4v0gFUaHR0cHM6Ly9jb2luZ2FwZS5jb20vaGlzdG9yaWNhbC1kYXRhLXN1Z2dlc3RldGhlcmV1bS1mb3VuZGF0aW9uLXZpdGFsaWstYnV0ZXJpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Ethereum Foundation, Vitalik Buterin Dumps 15K ETH; Will History Repeat? - CoinGape",
        "content": "After Ethereum creator Vitalik Buterin dumped 200 ETH on Friday, Ethereum Foundation followed suit and dumped 15,000 ETH to a crypto exchange.\n\nTypically, Ethereum Foundation sells small amounts of ETH to manage operations and Vitalik Buterin usually dumps meme coins he received in his wallet for ETH. But this time it’s different.\n\nadvertisement\n\nEthereum Foundation and Vitalik Buterin Transfers Over 15K ETH\n\nOn Friday, Vitalik Buterin related address vitalik.eth transferred 200 ETH to crypto exchange Kraken as per PeckShieldAlert. As per Etherscan data, this is not the first time the address transferred ETH to the same Kraken wallet. There are 5 similar transactions to Kraken in the last 2 months.\n\nEthereum Foundation followed suit and transferred 15k ETH to Kraken, as per the transaction reported by PeckShieldAlert on Saturday, May 6. The large transaction by Ethereum Foundation raised FUD in the crypto community, with many thinking that an ETH price and meme coins crash could be coming.\n\nAlso Read: Ethereum Gas Fees Hit Record Levels Amid PEPE Meme Coin Hype; Flips SHIB, DOGE\n\nAs per historical data, a large ETH move by the Ethereum Foundation led to a massive fall in ETH prices. The last time 20,000 ETH was transferred to Kraken on November 12, 2021. After the Ethereum Foundation cash out at $4,722, near ATH, the ETH price fell 40% in 2 months.\n\nMeanwhile, Vitalik Buterin has sold several meme coins historically. The coins Vitalik Buterin sold mostly get rekt, similar to last time when shitcoins lost most value after he dumped massive amounts of shitcoins. In March, Vitalik sold 50 billion MOPS for 1.25 ETH, 10 billion CULT for 58 ETH, and 500 trillion SHIK for 380 ETH. In Addition, he sold 3.4M BITE for 5.9 ETH and transferred 214 ETH worth $337k to Ethereum Foundation.\n\nETH price fell 3% in the last 24 hours, with the price currently trading below $1800. The 24-hour low and high are $1,794 and $2,017, respectively. Furthermore, the trading volume has increased slightly by 52% in the last 24 hours, indicating an interest among traders.\n\nAlso Read: New York Introduces Landmark Crypto Regulatory Bill “CRPTO”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8xMzg5MTYvZGNnLWJhcnJ5LXNpbGJlcnQtc2VsbHMtZ3JheXNjYWxlLWV0aGVyZXVtLWNsYXNzaWMtdHJ1c3Qtc2hhcmVz0gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzEzODkxNi9kY2ctYmFycnktc2lsYmVydC1zZWxscy1ncmF5c2NhbGUtZXRoZXJldW0tY2xhc3NpYy10cnVzdC1zaGFyZXM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "DCG’s Barry Silbert Sells $755K Worth of Grayscale Ethereum Classic Trust Shares - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBarry Silbert, the founder and CEO of Digital Currency Group (DCG), has sold some of his Grayscale Ethereum Classic Trust (ETCG) shares, according to a recent SEC filing.\n\nDCG is one of the largest crypto conglomerates on the market and counts Grayscale Investments, the trust’s issuer, as one of its subsidiaries.\n\nAccording to the filing, Silbert has moved to liquidate nearly 120,000 ETCG shares, worth an aggregate market value of approximately $755,295 dollars. This also appears to be the first time Silbert has sold any of his ETCG shares, according to SEC filings.\n\nAD\n\nAD\n\nThe ETCG fund, which launched in 2017, allows investors to gain exposure to Ethereum Classic (ETC) through a brokerage account. ETC and Ethereum (ETH) used to be the same thing until 2016, when developers implemented a hard fork of the network to return millions worth of stolen funds to investors after a hack. The fork was notably backed by Ethereum co-founder Vitalik Buterin.\n\nThe ETCG sale represents a small portion of the fund’s $225 million assets under management and 14 million outstanding shares—of which Silbert is a 10% shareholder. He’s also listed as one of the fund’s directors.\n\nThe sale was brokered by New York-based firm Cannacord Genuity on April 28 on the OTCQX, the highest tier of over-the-counter (OTC) market for trading securities, according to the SEC filing.\n\nSilbert’s shares were originally purchased during two privately negotiated transactions over the 2017-2018 period. So far, he hasn’t made any official comments on the recent transaction.\n\nIt’s a somewhat surprising development to see the crypto permabull selling his ETCG shares. Silbert has been in the crosshairs over the past months, due to a $630 million dollar debt DCG-owned lending desk Genesis owes to Gemini, a crypto exchange and custodian owned by the Winklevoss twins.\n\nAD\n\nAD\n\nEarlier this week, the companies announced they had entered into a 30-day mediation process to settle the outstanding loan balance. “If DCG is unable to pay and/or restructure its debt, DCG risks defaulting on its obligations,” Gemini said in a statement."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ldGhlcmV1bS1kZXZlbG9wZXJzLW91dGxpbmUtcGxhbnMtZm9yLWRlbmN1bi1uZXR3b3JrLXVwZ3JhZGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum Developers Outline Plans for 'Dencun' Network Upgrade - Unchained - Unchained",
        "content": "The core feature of the Dencun upgrade is EIP-4844, or Proto-Danksharding, which will make Layer 2 transactions significantly cheaper.\n\nDencun will be the next major network upgrade after Shapella, and has the potential to lower transaction costs on Ethereum.\n\nIn a blog post published this week, Ethereum core developer Tim Beiko revealed the next set of major Ethereum Improvement Proposals (EIP) that have been tentatively included in the Dencun upgrade.\n\nDencun, a term coined by a combination of the star Deneb and Mexican city Cancun, follows a similar naming convention to Shapella, which was named after the Chinese city Shanghai and northern-constellation star Capella.\n\nThe upgrade will focus on bringing improvements and changes to Ethereum’s execution layer through four EIPs that have been decided upon so far. Just like most of the attention in the Shapella upgrade was centered around EIP-4895, which enabled validator withdrawals from the Beacon Chain, the focus of this upgrade will likely be EIP-4844, otherwise known as “Proto-Danksharding” or “The Surge.”\n\nThis EIP will introduce temporary “data blobs” to the Ethereum network, which Layer 2 networks can use to post the transaction/proof data currently stored elsewhere. The fact that blobs are store ephemerally means that gas costs will be significantly lower, which will lead to much cheaper Layer 2 transactions, explained Beiko.\n\n“While not quite as big as The Merge, EIP-4844 is a significant change to Ethereum: it introduces a whole new data layer to the network, which both the current consensus and execution layers must interact with,” he said.\n\nIntroducing EIP-4844 will also mean there is less room for other changes to the network, but developers have still included three other EIPs alongside it. These include EIP-1153, which improves blockspace availability, EIP-6475, that makes transaction formats forward-compatible, and EIP-6780, which deactivates the code used to terminate a smart contract.\n\nBeiko did not specify when this upgrade would be deployed, but said that the next update on Dencun’s finalized scope would likely be the first testnet fork announcement."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2V0aGVyZXVtLW5mdC13YXNoLXRyYWRlcy1hcHJpbC1jcnlwdG9zbGFtL9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2V0aGVyZXVtLW5mdC13YXNoLXRyYWRlcy1hcHJpbC1jcnlwdG9zbGFtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum had over US$635 mln in NFT wash trades in April, CryptoSlam reveals - Forkast News",
        "content": "Over US$635 million of Ethereum non-fungible token sales in April were wash trades, which made up nearly 60% of all NFT trades on the blockchain for the month, according to new data from CryptoSlam,\n\nThe new data also revealed wash trading activities on Solana, Binance, Polygon, Cardano, Flow and Arbitrum, which had been largely unknown until now.\n\nWash trades refer to an investor acting as both the buyer and seller of a financial instrument to generate misleading trading volume and potentially manipulate prices. The practice is illegal in U.S. securities markets.\n\nBlur marketplace’s point farming is the primary driver of Ethereum NFT wash trades, leading to US$3.4 billion worth of NFT trades being flagged as wash sales so far this year. Blur traders’ bids and listings are incentivized by the marketplace’s points — the platform’s loyalty system — fueling some traders’ reliance on bulk wash sales to maximize points, which is subsequently rewarded in the form of Blur’s utility token, $BLUR.\n\nIn March, over US$1.1 billion, or 66% of all NFT sales on Ethereum, were wash trades. However, the single highest wash trading day occurred on Feb. 20, days after the launch of $BLUR. Traders aggressively farmed points to earn more $BLUR token rewards, resulting in over 85% of the day’s sales volume, valued at US$295 million, being flagged as wash trades.\n\nMonthly sales and wash transactions on Ethereum in 2023\n\nFebruary, March, and April stand out as high points for wash trading on Ethereum, with a combined total value of over US$3.135 billion. At the peak of wash trading on March 4, 2023, daily NFT wash trades transactions on Ethereum reached 49,806 compared to 2,743 on April 16, 2022, the apex of $LOOKS token farming.\n\nSimilar to $BLUR token farming in 2023, traders in early 2022 were farming $LOOKS tokens at the then-new LooksRare marketplace. CryptoSlam’s data has revealed $LOOKS farming as the driving factor behind US$819 million in wash sales that took place on Jan. 19, 2022, the most successful day for wash trading ever. Over US$18 billion in wash trades were flagged in January and February 2022.\n\nThough the value of wash trading sales has decreased since last year, the number of transactions has grown nearly 20x, CryptoSlam data shows.\n\nThe top two wash-traded collections across all blockchains are Ethereum’s Terraforms and Meebits, with US$11.5 billion and US$9 billion in flagged trades, respectively. Standout NFTs from these collections include Terraforms #4206, which has been wash traded for 86,905.12 ETH (US$242.97 million), and Meebit #13824 for 29,453.9 ETH (US$99. 4 million).\n\nMeebit #13824 (left) and Terraform #4206 (right).\n\nHighlighting the extent of traders’ practices, CryptoSlam has uncovered US$31 billion in all-time wash trade sales volume on Ethereum, totaling 41% of the blockchain’s US$74 billion in sales. An additional US$330 million in wash trades is reflected across the other top 10 NFT blockchains, making up a much smaller percentage of their all-time sales.\n\nWash trading is expected to continue and possibly increase on Ethereum as traders use liquidity-providing tools like BenDAO, NFTfi and Blur’s new Blend lending protocol to pursue more platform rewards in Blur’s Season 2.\n\n1/ Introducing Blend: the Peer-to-Peer Perpetual Lending Protocol for NFTs.\n\n\n\nBuilt in collaboration with @danrobinson and @transmissions11 at @paradigm, Blend enables 10x higher yield opportunities than current DeFi protocols and unlocks greater liquidity for NFTs.\n\n\n\nHere’s how 👇 pic.twitter.com/uOFC6i3LSq — Blur (@blur_io) May 1, 2023\n\nWhile Ethereum owns the bulk of global wash sales due to $LOOKS and $BLUR token farming, it is expected to continue on other chains with a growing number of marketplaces adopting reward incentives.\n\n(Update: edits third paragraph to clarify wash trading defintion)"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZGFpbHljb2luLmNvbS9jYXJkYW5vcy1oeWRyYS12cy1saWdodG5pbmctbmV0d29yay1zaGFyZGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "How Cardano's Hydra Layer-2 Is Challenging Bitcoin Lightning Network and Ethereum Sharding - DailyCoin",
        "content": "Cardano released its Layer-2 scalability solution, Hydra.\n\nHydra introduces a novel scaling solution that challenges Bitcoin, Ethereum, and others.\n\nAccording to Charles Hoskinson, Cardano’s new solution could make it the fastest, most scalable network.\n\nCardano has long been vying for a spot among the top cryptocurrency projects. Now, with its scalability solution Hydra up and running, it has solidified its position as a major player in the industry, standing alongside its more established peers, Bitcoin and Ethereum.\n\nHydra, the Layer-2 solution from the Proof of Stake (POS) Chain, is one of the most highly anticipated upgrades. Now that it is here, people are excited to see it deliver Cardano’s promise of being the fastest and most scalable payment network in the world, challenging the likes of Bitcoin and Ethereum.\n\nWhat Is Hydra?\n\nThe Hydra Head Protocol or Hydra is Cardano’s open-source Layer-2 scalability solution that, according to Charles Hoskinson, would make Cardano the fastest payment network in the world.\n\nAnnounced in September 2019, after much anticipation, delays, and hurdles, Hydra finally made it to the Cardano main chain in May 2023, thanks to engineers from the Cardano Foundation and IOHK.\n\nHydra is an isomorphic scaling solution. This means it replicates Cardano’s functionality and security guarantees on an off-chain ledger network while maintaining communication between the two layers.\n\nCardano Hydra use case. Source: Hydra Head Protocol.\n\nIt operates almost similarly to state-channel solutions such as Bitcoin’s Lightning Network and Ethereum’s Raiden Network. Users can securely and instantly perform transactions on their private networks, in this case, Hydra heads, and settle the result on the main chain, enabling faster and cheaper transactions while keeping the integrity and security of the network.\n\nWhat’s unique about Hydra is that off-chain ledgers through Head nodes can act as special dApps for developers who look to scale their apps. With Hydra, developers can independently run on-chain scripts or software stack on their private nodes and securely publish the result on the main chain instantly and at a low price.\n\nHydra brings a solid solution, allowing Cardano to compete with Ethereum and Bitcoin.\n\nIn Contrast with Other Scalability Solutions\n\nBoth Bitcoin and Ethereum have long established themselves in the cryptocurrency world, with the latter powering a myriad of Layer-2 protocols. Additionally, Ethereum’s sharding and Bitcoin’s lightning network are some of the best solutions in the space, earning the networks a collective market cap of $807 billion.\n\nAlthough Cardano is often compared with Bitcoin and Ethereum, its string of delays and issues drew much criticism from the community, leading to slow growth evident with its $13 billion market cap. However, with Hydra in the mix, it can finally sit at the table with its solution.\n\nEthereum, Cardano, and Bitcoin Compared\n\nWhile Ethereum Sharding, Bitcoin Lightning Network, and Cardano’s Hydra solution may come from the same family or operate similarly, comparing or saying one is better wouldn’t be fair. Each scalability solution has its pros and cons and addresses different challenges.\n\nSharding is a Layer-1 solution that focuses on increasing the network’s capacity and increasing the overall transaction throughput of the network. It breaks the blockchain into shards that process transactions parallel to the main chain.\n\nHowever, according to Charles Hoskinson, Sharding is “very complex.” Because of this complexity, network security and performance drastically defer because it operates on the main chain. Additionally, it requires a lot of resources and can be expensive to implement.\n\nHydra, on the other hand, creates an independent off-chain ledger network that replicates the security and functionality of the Cardano chain, allowing it to maintain both security and performance without congesting the main chain. It doesn’t rely on soft or hard forks, making it inexpensive and straightforward to implement.\n\nConversely, Bitcoin Lightning Network is a Layer-2 solution on top of Bitcoin, which uses bi-directional off-chain payment channels between users, enabling fast, cheap, and scalable transactions.\n\nHowever, because it uses payment channels, it only supports asset transfer, unlike Hydra, which allows developers to run scripts and elaborate transactions instantly off-chain as it would on the main chain.\n\nOn the Flipside\n\nAn Ethereum founder accused Cardano Founder of contributing nothing to Ethereum.\n\nMany competitors called Cardano’s EUTXO design a security flaw; Hoskin replied that the model made it more secure.\n\nWhy You Should Care\n\nCardano’s Hydra solution brings competition to the space. The better the competition, the better the solutions, leading to greater adoption. Cardano’s new protocol could significantly elevate the network’s status in the cryptocurrency industry and attract more developers to build apps on the network.\n\nFAQs\n\nWhat is Hydra on Cardano? Hydra is Cardano’s Layer-2 scaling solution that creates independent off-chain ledgers with functionality, features, and security similar to the Cardano main chain. Is Hydra built on Cardano? Yes, Hydra is built on Cardano. It is a Layer-2 scaling solution that processes transactions on an off-chain ledger and settles the result on the main chain. Is Hydra a Layer-2? Yes, Hydra is a Layer-2 solution on Cardano. It operates on top of Cardano to maximize the throughput and functionality of the underlying blockchain. Is Cardano Layer-1 or Layer-2? In blockchain-speak, Layer-1 is the base blockchain where all network activity and transactions are validated and finalized. Cardano is Layer-1.\n\nRead about other blockchains’ developments:\n\nHow Flare’s New Blockchain APIs on Google Cloud Impact Web3\n\nRead what Charles Hoskinson has to say:\n\nCardano Founder Charles Hoskinson Responds to Jab by Ethereum Co-Founder"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tYW5kLWV0aC1mb3VuZGF0aW9uLXNlbGwtMzAtbWlsbGlvbi1pbi1ldGhlcmV1bS1hcy1ldGgtYWJvdXQtdG8tYnJlYWstMjAwMNIBbWh0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tYW5kLWV0aC1mb3VuZGF0aW9uLXNlbGwtMzAtbWlsbGlvbi1pbi1ldGhlcmV1bS1hcy1ldGgtYWJvdXQtdG8tYnJlYWstMjAwMD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Vitalik Buterin and ETH Foundation Sell $30 Million in Ethereum As ETH About to Break $2,000 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAccording to data shared by @lookonchain, an analytics platform that tracks large crypto transactions and transfers of \"Smart Money\" wallets, Vitalik Buterin sent nearly half a million worth of Ethereum to a major exchange.\n\nAfter he did that, the Ethereum Foundation did the same but transferred a lot more Ethereum to the same platform — nearly $30 million worth of it.\n\nIn the meantime, the second largest cryptocurrency, ETH, is trading at the $1,960 level. Santiment on-chain data company believes that ETH is on the cusp of breaking above $2,000.\n\nButerin and ETH Foundation sell ETH\n\nLookonchain shared that the vitalik.eth wallet was the first to move 200 Ethereum (worth about $400,000) to the U.S.-based Kraken exchange. Following Buterin's transaction, the Ethereum Foundation did the same but on a much bigger scale — they shifted 15,000 ETH to Kraken as well.\n\nTogether with Buterin's crypto, that makes $40,000,000 USD in fiat. The second transaction was also noticed and highlighted by the popular crypto tracker Whale Alert.\n\nIt seems that Buterin just sells Ethereum from time to time in more or less the same amounts. As reported by U.Today earlier, in the middle of February, he sold 210 ETH for roughly $325,000 in the USDC stablecoin. Curiously, that chunk of ETH was also sold on Kraken.\n\nBack then, Ethereum was trading at $1,545.\n\nOn March 13, he moved another 200 ETH to Kraken, selling it at the price of $1,656 per coin.\n\nEthereum on verge of breaking $2,000: Reasons\n\nSantiment data aggregator reported on Friday that ETH had reached an eight-month high in flows to crypto exchanges. The analytics team believes that this may be a sign of an upcoming volatility increase similar to what it was like after the collapse of FTX in early November and the Merge in mid-September.\n\nIn a tweet that followed, Santiment added that while \"sky-high active deposits\" of ETH to exchanges are the highest since November last year, ETH is now showing signs of decoupling from BTC and may be about to break above the $2,000 level.\n\n🚀 Updating our report on #Ethereum's sky-high active deposits, exchange addresses interacting on the network is now at its highest level since November, 2021. As expected, $ETH is showing decoupling signs and on the cusp of breaking $2k once again. https://t.co/zYjY7669yj https://t.co/dQlKsTVyt2 pic.twitter.com/2nMXOUGgYC — Santiment (@santimentfeed) May 5, 2023\n\nBesides, a record amount of ETH was burned at the end of this week, as U.Today reported. That was down to the meme coin season unwrapping at the moment — the majority of meme coins run on Ethereum and so are being actively moved with high ETH fees, providing a great opportunity to burn ETH and decrease the circulating supply."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8wNS90b3AtdHJhZGVyLXVwZGF0ZXMtb3V0bG9vay1vbi1iaXRjb2luLWFuZC1vbmUtbmV3LWV0aGVyZXVtLXJpdmFsLXNheXMtdGhpcy1jcnlwdG8tYXNzZXQtY2xhc3MtaXMtZ29pbmctdG8temVyby_SAZQBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDUvMDUvdG9wLXRyYWRlci11cGRhdGVzLW91dGxvb2stb24tYml0Y29pbi1hbmQtb25lLW5ldy1ldGhlcmV1bS1yaXZhbC1zYXlzLXRoaXMtY3J5cHRvLWFzc2V0LWNsYXNzLWlzLWdvaW5nLXRvLXplcm8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Top Trader Updates Outlook on Bitcoin and One New Ethereum Rival, Says This Crypto Asset Class Is Going to Zero - The Daily Hodl",
        "content": "A popular crypto strategist is updating his outlook on Bitcoin (BTC) and one Ethereum (ETH) rival as he warns memecoins are likely to collapse.\n\nPseudonymous analyst Altcoin Sherpa tells his 195,100 Twitter followers that Bitcoin continues to lack a clear upward or downward trend and remains trading sideways.\n\nAccording to his chart, Sherpa says Bitcoin has been chopping around in the $25,000 to $30,000 range for the past 48 days. The previous range Bitcoin chopped around in was between about $19,500 and $25,000 and that lasted 57 days.\n\n“BTC: The problem for most traders the last six months is that there hasn’t been a continuous trending environment like in 2020 and 2021 (for alts). Lots of chop overall and just a few trending weeks followed by more chop. Know yourself and where to trade.”\n\nBitcoin is trading for $29,305 at time of writing, up 1.5% during the past 24 hours.\n\nAlso on the trader’s radar is the new layer-1 blockchain Sui Network (SUI).\n\nBased on Fibonacci retracement levels, a method of technical analysis for determining an asset’s support and resistance levels, Sherpa believes SUI will revisit a lower range of $1.29. However, he warns if Bitcoin dips, SUI could drop down to $1.24.\n\n“SUI: Expecting range lows to come eventually around $1.29, but it’s going way lower if Bitcoin shits the bed IMO (In my opinion). Still, it looks like somewhat accumulation phase as long as BTC is stable.”\n\nSui Network is worth $1.31 at time of writing, down 1.9% during the past 24 hours.\n\nNext, the trader weighs in on skyrocketing Pepe (PEPE), a memecoin that launched last month. He warns Pepe and other meme tokens are likely going to collapse.\n\n“PEPE derivatives are going to moon, aka all the other memecoins right now. But be warned; these are all going to go to $0 and will be short lived. Full on casino over the next few weeks IMO (in my opinion), same story as it always is.”\n\nLastly, Altcoin Sherpa looks at layer-2 scaling solution Arbitrum (ARB).\n\nHe predicts Aribitrum will dip lower by looking at several Exponential Moving Averages (EMAs) and the Fibonacci retracement levels. Traders look at the EMA to determine whether an asset’s price is in a downtrend. If the price is below the EMA, then the asset is likely going to remain bearish.\n\n“ARB: Haven’t paid as much attention to this one lately, but I wouldn’t be surprised if it falls through and goes to the $1.15-$1.20 area again. This is still a great chain but new flavor of the month (SUI) + memecoin madness (PEPE) are sucking liquidity out of ‘normal’ coins.”\n\nArbitrum is worth $1.36 at time of writing, up 3% during the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Kartavaya Olya/Sol Invictus/monkographic"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1tZWRpYW4tZ2FzLWZlZS1oaXQtMTItbW9udGgtaGlnaC1hbWlkLW1lbWVjb2luLXJlc3VyZ2VuY2Uv0gFgaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLW1lZGlhbi1nYXMtZmVlLWhpdC0xMi1tb250aC1oaWdoLWFtaWQtbWVtZWNvaW4tcmVzdXJnZW5jZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum Median Gas Fee Hit 12-Month High Amid Memecoin Resurgence - CryptoPotato",
        "content": "In recent weeks, the Ethereum community has been grappling with an issue causing concern for many users – the rapidly increasing gas consumption on the network.\n\nGas fees are charged for processing transactions on the Ethereum blockchain, and they have been rising at an alarming rate.\n\nEthereum Gas Fee Hits 12-Month High\n\nAccording to data from Dune, shared by data scientist Hildobby, the median price of ETH gas, measured in gwei and averaged over seven days, has surged to 87, a level not seen in the past 12 months – since May 2022. The average transaction fee now hovers around $50, a significant increase from just a few months ago when it was less than $10.\n\nThe high gas fees have caused frustration among users, who find it increasingly expensive to perform even simple transactions on the network. Many small-scale users, such as decentralized application (dApp) developers, traders, and retail investors, are finding it difficult to participate in the Ethereum ecosystem due to the high cost of gas fees.\n\ntry to buy a ~$20 NFT on eth, and the gas is ~$40.\n\nsome ppl say the infra operators deserve to be paid. sure, but imaging paying visa $40 fee for buying a $20 digital good.. infra should be affordable. pic.twitter.com/5L4SYjT5af — 0xMQQ (@0xMQQ) April 18, 2023\n\nMemecoins Return\n\nThe issue is primarily due to the increasing demand for processing transactions on the network, as memecoins return to the market after being silent for almost two years. Over the past few weeks, memecoin trading has gained momentum, with most of the trading activities taking place on the Ethereum blockchain.\n\nOne such memecoin is PEPE, whose market cap jumped by more than 100x within the last two weeks after its launch in mid-April. Other memecoins that have recorded significant hype over the past few weeks include ArbDogeAI, WOJAK, and SHIBAI.\n\nAnother possible reason for the high ETH gas fee is the resurgence in NFT trading on the Ethereum blockchain. While such volumes declined significantly in April, perhaps due to the rebirth of memecoins, reports revealed that they reached $4.7 billion in Q1, 2023, a 137% from the previous year.\n\nFurthermore, data from the blockchain intelligence platform Glassnode revealed that gas consumption from NFT-related activities on Ethereum surged by 94% between January and February.\n\nThe Way Forward\n\nThe Ethereum community is actively working on solutions to address the issue, including implementing Ethereum Improvement Proposal (EIP) 4844. This proposal aims to reduce gas fees and transaction throughput by introducing a new type of transaction that accepts “blobs” of data.\n\nIn the meantime, users have been forced to adjust their strategies, with some opting to perform transactions during off-peak hours when gas fees are typically lower. Others have been switching to alternative blockchain networks that offer lower fees or opting for layer 2 scaling solutions such as Polygon to reduce the cost of transactions."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiygJodHRwczovL2ZpbmFuY2UueWFob28uY29tL25ld3MvcGVwZS1tZW1lLWNvaW4taHlzdGVyaWEtcHVzaGVzLTA5MzIzNzkzMS5odG1sP2d1Y2NvdW50ZXI9MSZndWNlX3JlZmVycmVyPWFIUjBjSE02THk5M2QzY3VaMjl2WjJ4bExtTnZiUzgmZ3VjZV9yZWZlcnJlcl9zaWc9QVFBQUFEZmxTYVYyUXFOVGNkbWgzYUpscE13VGRCazhIT1NVV2hVbnNUVUQxSlBYQXVTbzNGVUYxMGI3Nm4yQmNod0pOYWlDTnlpdXhEVVF2b3puZ3lXRGRNWnhrTUZ5UXJIa2RpTFVhRm1IQW1FeDRTRnhiNG9RQzlocU9vLXJTaUczTV9jRjN2dF8xZHIwY0VnRTFzMDlvbzV1azhyYzZxLTYxbXY4MmVqSnhiRHrSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "PEPE Meme Coin Hysteria Pushes Ethereum Gas Fees to 1-Year High - Yahoo Finance",
        "content": "Ethereum’s gas fees have surged above a one-year high as the demand for trading the PEPE meme coin continues to soar.\n\nThe average cost of a single transaction on Ethereum jumped above $15.82 on May 4.\n\nWhile Ethereum’s mean transaction fees have reached much higher levels of between $50 to $70 in 2021, things have been quiet since the market crashed in May 2022.\n\nDaily median gas price. Source: Etherscan .\n\nIt’s likely that excitement around meme coins, specifically the newly-launched PEPE, is responsible for the revival in gas fees.\n\nIn the last 24 hours, the trading volume for PEPE surpassed $150 million on Uniswap, higher than Wrapped Bitcoin (WBTC) and USDT stablecoin volumes.\n\nThe PEPE token also entered the top 100 largest cryptocurrencies by market capitalization on May 1, obtaining a valuation of over $500 million. The token has continued to surge since then, last trading at a market value of $879 million.\n\nFollowing the success of PEPE coin, numerous copycats have also emerged representing different internet memes.\n\nData from crypto analytics firm Nansen shows that the most active smart contracts on Ethereum are currently Uniswap trading pools for meme coins such as SPONGE, TURBO, BOB, and TRBNR.\n\nMost used DeFi contracts on Ethereum on May 5, 2023. Source: Nansen\n\nThe increased gas fees witnessed 9,392 in ETH burned over the last 24 hours, at par with one-year high levels.\n\nEthereum executed a hard fork in 2021 which meant that a portion of all Ethereum transactions were destroyed. Thus, as activity increases on the network, more ETH is destroyed.\n\nThe rise in Ethereum’s transaction fees has led to a rise in gas fees for Layer-2 transactions as well.\n\nAre Ethereum scaling solutions helping?\n\nThe gas fees for layer-2 transactions have also surged with mainnet fees as related data for layer-2 transactions are also posted in layer-1 blocks for security.\n\nThere are two kinds of layer-2 scaling solutions: zero-knowledge proofs and optimistic. Both use another technology called rollups, which batch transactions off of the mainnet into a single, smaller transaction before settling on the mainnet.\n\nStory continues\n\nNotably, zero-knowledge proof (ZK)-based rollups were hit relatively worse than optimistic rollups. The fees for swapping tokens on ZK-based scaling solutions like Polygon zkEVM, Starknet, and zkSync Era mainnet surged between $2 to $11.\n\nA zkSync Discord community member noted they had to pay $11 swap ETH to USDC, noting in amazement that “Is it gonna cost that much?”\n\nAnother user complained about $30 in fees for DeFi deposits on zkSync.\n\n$30 gas fee on Layer 2 $ZKS $ZKSYNC @zksync\n\nI don't understand, I thought layer 2 were made to reduce gas fees 😱😱 pic.twitter.com/Uz6k5p4bC5 — Kool Crypto ⚙️🛸 (@healthymofin) May 5, 2023\n\nAccording to L2 Fees data, the gas fees for sending ETH on Arbitrum One and Optimism, both of which are Optimistic rollup solutions, are between $0.2 to $0.6 for swap tokens, which is around ten times higher than the mean value."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtZGlwcGluZy1wcmljZXMtcmlzaW5nLW5lZ2F0aXZlLXNlbnRpbWVudHMtYW5kLWV2ZXJ5dGhpbmctaW4tYmV0d2Vlbi_SAWtodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tZXRoLWRpcHBpbmctcHJpY2VzLXJpc2luZy1uZWdhdGl2ZS1zZW50aW1lbnRzLWFuZC1ldmVyeXRoaW5nLWluLWJldHdlZW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Ethereum [ETH]: Dipping prices, rising negative sentiments and everything in between - AMBCrypto News",
        "content": "Ethereum Proof-of-Stake network experienced a drop in active validator count since the Shapella upgrade.\n\nETH’s value has since posted a double-digit decline.\n\nSince Ethereum’s [ETH] Shapella upgrade went live on 12 April, there has been a steep decline in active validator count on the proof-of-stake (POS) network, data from Glassnode revealed.\n\nRead Ethereum’s Price Prediction 2023-2024\n\nInformation obtained from the on-chain data provider put the active validator count on the network at 562,941 on 12 April. Just 24 hours after the Shanghai upgrade went live, this fell to 561,655, where it has since remained.\n\nObserved on a 30-day moving average, the total number of validators that voluntarily exited Ethereum’s validator pool since Shapella rose significantly by over 400%.\n\nThe continued decline in active validator count on the Ethereum POS network is due to a rally in the withdrawals of previously deposited ETH coins by some validators on the network.\n\nFollowing the Shapella upgrade, validators that had previously secured the network with more than 18 million ETH were free to initiate withdrawals, which some of them did. According to a Nansen dashboard, 10,675 validators were scheduled for full exit in the last hour at press time.\n\nETH prices take a plunge\n\nMany expected ETH’s value to dip significantly once Shapella went live due to increased withdrawals and sell-offs to make a profit by those who had initially staked their ETH coins. In contrast, the alt’s value rose momentarily after the upgrade.\n\nAccording to data from CoinMarketCap, ETH’s price jumped by 14% between 12 and 16 April. As of 16 April, the leading altcoin traded above $2000, after which the price descent began. Exchanging hands at $1,897.75 at press time, ETH’s price has since decreased by 11%.\n\nDespite the price fall, ETH whales that hold between 100,000 to 10,000,000 ETH coins have intensified accumulation. Per data from Santiment, since the Shapella, the count of these big whales increased by 2.5%.\n\nConversely, whales that hold between 1,000 and 100,000 ETH coins have taken a risk-averse approach and dumped some of their ETH holdings. Data from Santiment revealed that their number has gone down by 1% since Shapella.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nFurther, while the ephemeral jump in ETH’s value following the Shapella upgrade caused market sentiment to turn positive on 14 April, the price decline caused the alt’s weighted sentiment to return to negative territory, where it has since remained.\n\nAt press time, this was -1.172. With persistent negative sentiment lingering in the market, any significant spike in ETH’s price might be hard to come by."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZGlhbW9uZC1oYW5kcy1zZXQtbmV3LXJlY29yZC1hcy1ldGgtcHJpY2UtcmVjb25xdWVycy0yMDAw0gFaaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1kaWFtb25kLWhhbmRzLXNldC1uZXctcmVjb3JkLWFzLWV0aC1wcmljZS1yZWNvbnF1ZXJzLTIwMDA_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Diamond Hands Set New Record as ETH Price Reconquers $2,000 - U.Today",
        "content": "Advertisement\n\nExperts of Glassnode, a leading on-chain analytical firm, noticed an interesting pattern in Ethereum's (ETH) supply distribution. Six months after the FTX collapse, one crucial metric revisited historic highs. Speculators might not be as powerful as they seem to be.\n\nLong-term holders dominate Ethereum (ETH) supply\n\nOn-chain wallets that belong to long-term holders of Ethereum (ETH) are now responsible for 74% of its total available supply. \"Diamond hands\" accumulated a whopping 14,350,000 Ethers (ETH), latest Glassnode data says.\n\nAs the Long-Term Holder threshold of 155 days ages through the FTX failure, accumulated coins\n\nwhich have not been spent since are maturing to LTH status.\n\n\n\nThis has pushed the total supply held by Long-Term Holders to an ATH of 14.35M coins (74% of the circulating supply). pic.twitter.com/ea8bYUTqLB — glassnode (@glassnode) May 5, 2023\n\nThis impressive level has never been surpassed in the entire eight-year history of the second cryptocurrency. Besides growing confidence in bullish prospects for the ETH price, there is one more powerful catalyst that drives this upsurge.\n\nIn Glassnode, LTH metrics covers all coins that were not moved for at least 155 days. As such, in mid-May, Ethereum (ETH) wallets that were only active during the collapse of the FTX exchange will be mature enough to be included into this research.\n\nThe followers of the Glassnode account stressed that for Bitcoin (BTC), the largest cryptocurrency and the only token that exceeds Ethereum (ETH) by market cap, the long/short-term holder ratio looks just the same.\n\nAs U.Today reported yesterday, one more metric of the Ethereum (ETH) supply inches closer to multi-month highs. The number of new deposits hit an eight-month high, Santiment analysts noticed.\n\nEthereum (ETH) rejected at $2,000, meets aggressive bears\n\nWhile the Ethereum (ETH) community is generally optimistic about Ethereum's (ETH) prospects post-Shanghai, bulls are still failing to gain an upper hand.\n\nToday, in early morning hours, they briefly managed to push the Ethereum (ETH) price above the psychological level of $2,000 per coin. However, they met strong sellers who prevented ETH from growing higher.\n\nAs of press time, it is struggling to protect the $1,900 level on major spot exchanges. In the last 24 hours, the Ethereum (ETH) price lost almost 3%."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vdS50b2RheS9maXJzdC1tZW1lLWNvaW4tb24tbDItd2lsbC1zaGlmdC10aGlzLWVxdWlsaWJyaXVtLWV0aGVyZXVtLWV0aC12ZXRlcmFuLWNvbW1lbnRzLW9uLW5ldy1oeXBl0gFvaHR0cHM6Ly91LnRvZGF5L2ZpcnN0LW1lbWUtY29pbi1vbi1sMi13aWxsLXNoaWZ0LXRoaXMtZXF1aWxpYnJpdW0tZXRoZXJldW0tZXRoLXZldGVyYW4tY29tbWVudHMtb24tbmV3LWh5cGU_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "'First Meme Coin on L2 Will Shift This Equilibrium,' Ethereum (ETH) Veteran Comments on New Hype - U.Today",
        "content": "Advertisement\n\nSeasoned DeFi developer Kain Warwick recalled the popularity of Uniswap (UNI), which attracted FOMO-based high-risk traders, and stated that Ethereum-based L2 scalers might be on the eve of their own \"iPhone moment.\"\n\nWhy does crypto segment need meme coins on L2?\n\nOnce the first meme coin rallies on an Ethereum-based second-layer network, the audience will migrate outside of Ethereum (ETH). Driven by the expectations of enormous profits, newbie users will learn how to use cross-network bridges to move their value to new chains.\n\nThe first meme coin that blows up on L2 will shift this equilibrium. We've seen people learn to use uniswap to fomo into things, I think they will learn how to bridge to an L2 if some random thing is blowing up… https://t.co/sPslZvYtWA — kain.eth (@kaiynne) May 5, 2023\n\nWarwick shared this take commenting on a statement about meme coin traders' willingness to pay high fees, but not explore other blockchains like L2 networks Optimism (OP), Arbitrum (ARB) or alternative blockchains, including Avalanche (AVAX).\n\nHe recalled that some \"FOMO\"-motivated enthusiasts managed to migrate to Uniswap for the same reasons, i.e., to buy early-stage coins cheaper before they are listed on mainstream centralized exchanges.\n\nAs such, L2s and bridges to Ethereum (ETH) might onboard the next generation of traders once meme coins like Pepe (PEPE) start rallying there.\n\nYesterday, amid the euphoria around the Pepe (PEPE) listing on Binance (BNB), the Ethereum (ETH) network became almost unusable due to enormous fees.\n\nGame over for PEPE?\n\nYesterday, the average transaction fee for the Ethereum (ETH) network spiked above $30, which is the highest since the Terra (LUNA) ecosystem collapse in early May 2022.\n\nAs covered by U.Today previously, the global crypto community is captivated by the euphoria around new meme coins led by Pepe (PEPE), a frog coin launched three weeks ago.\n\nIn just 20 days, it rallied by over 10,000%. However, its Binance (BNB) listing might be interpreted as the top of its price movement. In the last 24 hours, PEPE lost over 25% on major exchanges."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWdhcy1mZWVzLWhpdC1yZWNvcmQtbGV2ZWxzLWFtaWQtcGVwZS1tZW1lLWNvaW4taHlwZS1mbGlwcy1zaGliLWRvZ2Uv0gFmaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tZ2FzLWZlZXMtaGl0LXJlY29yZC1sZXZlbHMtYW1pZC1wZXBlLW1lbWUtY29pbi1oeXBlLWZsaXBzLXNoaWItZG9nZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum Gas Fees Hit Record Levels Amid PEPE Meme Coin Hype; Flips SHIB, DOGE - CoinGape",
        "content": "Ethereum gas fees are again touching record levels as meme coins take over the crypto space by storm. The frog-themed meme coin PEPE hype has especially caused Ethereum gas fees to hit a yearly high.\n\nThe high gas fee is making transactions costly for users, while also pushing up prices amid demand for meme coins such as PEPE.\n\nadvertisement\n\nEthereum Gas Fees Reaches Yearly High\n\nAccording to data by Etherscan, the average gas prices reached 94 gwei and even hit a high of 184 gwei on May 5. The massive jump in Ethereum gas fees is due to the increase in demand for meme coins on the Ethereum network, making transaction costs higher.\n\nThe hype surrounding PEPE meme coin and profits made by investors by trading in the meme coin is causing most people to swap their crypto including other meme coins to PEPE through Uniswap. The average transaction cost on Uniswap has jumped to $32.60.\n\nAs per data, transactions on Uniswap alone have burned over 15,000 ETH in the last 7 days. Uniswap currently accounts for 35% of gas fees, becoming the top “Gas Guzzler” in the last few days.\n\nIn the last 24 hours, the trading volume for PEPE jumps over $150 million on Uniswap, surpassing Tether (USDT) stablecoin and wrapped BTC (WBTC).\n\nAlso Read: Top Exchange Lists Pepe Coin After 200% Rally, Will It Flip SHIB and DOGE?\n\nPEPE Price Skyrockets Over 600% in a Week\n\nPEPE price has skyrocketed over 600% in a week as whales and traders pour money into the frog-themed meme coin. The market cap has reached $848 million, entering the top 100 crypto list.\n\nPEPE price jumped 30% in the last 24 hours, with the price currently trading at $0.00000202. The 24-hour low and high are $0.00000151 and $0.00000232, respectively. Furthermore, the trading volume has increased by 150% in the last 24 hours, indicating an interest among traders.\n\nAlso Read: Coinbase Legal Chief Takes Pre-Emptive Strike Against US SEC"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMzg5NjEveW91LWNhbi1taW50LWEtZnJlZS1ldGhlcmV1bS1uZnQtZm9yLWtpbmctY2hhcmxlcy1jb3JvbmF0aW9u0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEzODk2MS95b3UtY2FuLW1pbnQtYS1mcmVlLWV0aGVyZXVtLW5mdC1mb3Ita2luZy1jaGFybGVzLWNvcm9uYXRpb24_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "You Can Mint a Free Ethereum NFT for King Charles’ Coronation - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHear ye, hear ye! Just in time for the coronation of King Charles III and Queen Camilla on May 6, the Evening Standard newspaper has teamed with digital artist Trevor Jones to launch a free collection of commemorative Ethereum NFT celebrating the event on Nifty Gateway.\n\nCreated in collaboration with Apollo NFT, “The Oath” can be claimed directly on Nifty Gateway or by using a QR code printed in the newspaper. The QR codes are also posted on billboards along Oxford Street, for those travelling to the capital to take part in the celebrations in person. But before you let the FOMO set in, the NFTs won’t be minted and delivered to collectors' wallets until May 7.\n\n“With the eyes of the world on London this weekend, we are extremely proud to collaborate with Trevor Jones and celebrate this iconic moment for our city,” Evening Standard CEO Charles Yardley said. “Trevor’s NFT depicts imagery representing centuries of tradition and history, in a format that represents how the modern world is democratising art for both artists and collectors.”\n\nAD\n\nAD\n\nThe Oath NFT began as a physical painting by Jones in his Edinburgh studio. The artwork depicts Saint Edward’s Crown, worn by Queen Elizabeth II in her 1953 coronation.\n\n“With Layer-2 in play now and the carbon footprint down 99.99%, there’s no longer an environmental issue with using the Ethereum blockchain,” Jones told Decrypt. “More importantly, however, I saw this as a fantastic opportunity to onboard new collectors into the NFT art scene, which is currently hitting quite the lows from the last couple of years.”\n\nLayer-2 refers to a protocol built on a blockchain like Immuntable X or the Bitcoin Lightning Network.\n\nThis looks incredible! @W1curates lighting up Oxford St., London with the NFT artwork 'The Oath' celebrating the King's #Coronation. Claim your free edition of the NFT here 👇 👑 https://t.co/n0uEBYTnAd In partnership with @EveningStandard & @ApolloNft #CoronationWeekend pic.twitter.com/w0hWHDhkqm — Trevor Jones 🎨 (@trevorjonesart) May 4, 2023\n\n“Dropping on Nifty Gateway meant that anyone could register an account simply with an email address and mint their first NFT artwork,” Jones said, adding that he wanted the process to be as simple as possible for collectors minting their first NFT.\n\nAD\n\nAD\n\nThe Evening Standard joins other media outlets making the leap into Web3, including TIME, GQ, and Playboy.\n\nThe Oath isn't the first NFT mint to commemorate the British royal family. In September, following the passing of Queen Elizabeth II, an NFT collection, QueenE by Web3 builders Fabio Sevá, Vinícius Rodrigues, Everton Matumoto, and the pseudonymous mladen.eth, was launched to celebrate the life of England’s longest (1952-2022) reigning monarch.\n\nNon-fungible tokens, NFTs, are cryptographically unique tokens linked to digital and physical content, providing proof of ownership, authenticity, or membership in a group. Previous collections by Jones include Bitcoin Angels, Man vs. Machine with rap icon Ice Cube, and Picasso’s Bull."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3LmNjbi5jb20vZXVyby1mb290YmFsbC1jbHViLWFjY2VwdHMtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Crypto Goal! Major Euro Football Club Now Accepts Bitcoin & Ethereum - CCN.com",
        "content": "By CCN.com: The beautiful game just got much prettier after European football giant Benfica announced they’d be accepting bitcoin and Ethereum payments. Now, fans of the Portuguese Primera Liga champions can pay for match tickets and club merchandise using cryptocurrency.\n\nEuro Elite Benfica Accept Bitcoin and Ethereum\n\nThis isn’t the first time the footballing elite has flirted with cryptocurrency, but it is the first time its been accepted as regular payment.\n\nIn the recent past, Italian champions Juventus played around with the idea of launching its own club token. Football supporters were even able to pay for match access with bitcoin during 2018’s World Cup in Russia – although that was a one-off.\n\nNow the transactional value of cryptocurrency can be employed in full around the Estádio da Luz – Benfica’s home ground. The sudden move comes courtesy of UTRUST, a crypto payments processing firm which also utilizes its own ETH-based token, UTK.\n\nAccording to Wednesday’s press release:\n\n“UTRUST’s core technology will allow Benfica to take advantage of the increased security and convenience of cryptocurrency payments while protecting the club from market volatility. It will also significantly reduce processing fees and eliminate inconvenient credit-card chargebacks and fraudulent payments.”\n\nBenfica CEO Domingos Soares de Oliveira said the decision to accept crypto payments came from a recognition that the club must “stay ahead of the curve,” adding:\n\n“[We] recognize that many of our supporters are now digital users first so we want to be ahead of the curve when it comes to accepting novel technologies.”\n\nFootball in Bed With Cryptocurrency?\n\nIt would have been difficult to imagine a more unlikely bedfellow for bitcoin than football, but no other popular industry has embraced crypto anywhere near as much.\n\nFormer Tottenham manager Harry Redknapp once pumped a cryptocurrency via his Twitter account. Footballing legend Ronaldinho even launched his own token. More names familiar to British and European football fans round up this list, which is growing by the month.\n\nIndeed, as recently as April, controversial cryptocurrency Bitcoin SV (BSV) signed a sponsorship deal with Scottish club Ayr United. The small seaside club carries the nickname of ‘The Honest Men.’ Make of that tidbit what you will.\n\nBenfica has a long, glorious history in European football and regularly fills out its 65,000 capacity stadium weekly. The club boasts 14 million followers worldwide and 7 million active fans across the internet and social media accounts.\n\nOnly bitcoin, Ethereum, and UTRUST’s UTK token will be accepted for payments to start."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3lvZGEtY29pbnMtc3VkZGVuLWNvbGxhcHNlLWhvdy1pbnZlc3RvcnMtbG9zdC1vdmVyLTEyOWstaW4tZXRoZXJldW0tdG8tYS1ydWctcHVsbC1zY2FtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Yoda coin's sudden collapse: how investors lost over $129K in Ethereum to a rug pull scam - CryptoSlate",
        "content": "YODA coin rug pulled and lost 100% of its value on May 5, as crypto sleuth PeckShieldAlert revealed.\n\nThe project deleted its Twitter account, and the scammer already transferred over 68 Ethereum (ETH), according to PeckShieldAlert’s tweet.\n\nThe rug pull\n\nAvid crypto collector @borovik.eth was one of the first ones to realize the pull. He tweeted a screenshot of Yoda Coin’s official account, which was inaccessible.\n\nCrypto Twitter then provided additional information about the suspended addresses in the comments. On-chain sleuth ZachXBT shared that the YodaCoin team also deactivated nine bot accounts with gold checkmarks.\n\nPeckShieldAlert monitored the scammers’ wallet movements and discovered that they moved over 68 ETH to the FixedFloat exchange. The amount equates to over $129,000 in ETH at the time of writing.\n\nMemecoin season\n\nEven though the crypto community’s thoughts on memecoins may vary, recent data revealed that they are, in fact, quite resilient. A CryptoSlate insight from April stated that memecoins:\n\n“Continue to defy expectations by thriving in the bear market, outperforming other cryptocurrencies and expanding their utility, attracting retail investors and newcomers to the crypto world.”\n\nPopular memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) have proven themselves to be quite profitable in the past. While their volatility has become mainstream, other memecoins have been surprising investors lately.\n\nMost recently, memecoin PEPE (PEPE) attracted the eyes of the crypto community when it soared over 90% within 24 hours on May 1. At the time of writing, PEPE continues its surge. The token recorded a 59.38% increase in the last 24 hours and a nearly 700% increase over the previous seven days.\n\nA few days later, the Turbo memecoin, created by ChatGPT, reached over a $30 million market cap within a week of its launch. Several crypto exchanges have also listed Turbo tokens as a tradable asset.\n\nAccording to CryptoSlate data, the memecoin market has 1.49% sector dominance with over a $17 billion market cap. The sector’s 24-hour volume sits at over $1.49 billion.\n\nMentioned in this article"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2V0aGVyZXVtLWdhcy1mZWVzLTEteWVhci1oaWdoLW1lbWVjb2luL9IBTGh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2V0aGVyZXVtLWdhcy1mZWVzLTEteWVhci1oaWdoLW1lbWVjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Ethereum Gas Fees Hit 1-Year High Amid Memecoin Renaissance - Ethereum World News",
        "content": "Summary:\n\nEtherscan data showed the average cost of Ethereum transactions rose as high as $15 on May 4, a 1-year high.\n\nGas fees on L2 networks also skyrocketed, particularly on chains built using zero-knowledge proofs like Polygon zkEVM and zkSync Era.\n\nCrypto participants believe the memecoin renaissance led by PEPE coin is the main reason behind expensive transaction costs on crypto’s largest altcoin blockchain.\n\nGas fees on Ethereum flew to their highest level since 2022 in the middle of a memecoin renaissance championed by the “Pepe the frog” themed altcoin, PEPE.\n\nThe cost of sending transactions rose as high as $15 on May 4, its highest point in over a year. Gas fees had previously stayed at lower levels in the months after Terra crashed and the crypto markets nosedived.\n\nPEPE Trading Propels Ethereum Gas Fees\n\nEthereum’s ecosystem is no stranger to memecoin mania as tokens like Dogecoin and Shiba Inu have drawn speculative traders before. It’s unclear whether the PEPE token will last as long as these OG memecoins after hitting a $1 billion market cap, a topic that Binance weighed in on after listing PEPE for spot trading today.\n\nBinance paused PEPE deposits shortly after citing technical difficulties.\n\n#Binance has postponed the listing of $FLOKI and $PEPE until May 5, 2023, 18:00 UTC.\n\n\n\nTrading will start at 18:00 UTC, as opposed to the original start time of May 5, 16:00 UTC.\n\n\n\nPlease note that deposits for both PEPE and FLOKI will resume at 15:30 UTC.https://t.co/pJieemoTyP — Binance (@binance) May 5, 2023\n\nThere are also indicators pointing to PEPE as the reason behind Ethereum’s pricey gas fees. PEPE holders traded $150 million in volume over the past 24 hours on the decentralized exchange Uniswap.\n\nIncreased interest in PEPE pushed the token into the top 100 cryptocurrencies by market cap. The token sits at #42 according to CoinMarketCap. Nansen data clocked several copycat tokens and increased trading activity tied to other memecoins on ETH’s chain.\n\nHigh Gas Fees Rock L2 Networks Too\n\nLayer 2 networks designed to reduce transaction costs experienced high gas fees as network demand shot up. Fees on layer 2 scaling solutions built using zero-knowledge proofs like Polygon zkEVM and zkSync Era were significantly higher than L2’s designed using optimistic rollups.\n\nPer L2 Fees data, the cost of a single transaction on zk rollups ranged between $2 to $11, rising as high as $30.\n\n$30 gas fee on Layer 2 $ZKS $ZKSYNC @zksync\n\nI don't understand, I thought layer 2 were made to reduce gas fees 😱😱 pic.twitter.com/Uz6k5p4bC5 — Kool Crypto ⚙️🛸 (@healthymofin) May 5, 2023\n\nUsers also flocked to Ethereum Virtual Machine-compatible chains like BNB Chain as memecoin mania continued."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vdS50b2RheS9wcm9taW5lbnQtaGVkZ2UtZnVuZC1ub3J0aC1yb2NrLWRpZ2l0YWwtZm91bmRlci1jYWxscy1ldGhlcmV1bS1ldGgtdW5xdWVzdGlvbmVkLWFyZW5hLWZvci1hbG1vc3TSAXRodHRwczovL3UudG9kYXkvcHJvbWluZW50LWhlZGdlLWZ1bmQtbm9ydGgtcm9jay1kaWdpdGFsLWZvdW5kZXItY2FsbHMtZXRoZXJldW0tZXRoLXVucXVlc3Rpb25lZC1hcmVuYS1mb3ItYWxtb3N0P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Prominent Hedge Fund North Rock Digital Founder Calls Ethereum (ETH) 'Unquestioned Arena for Almost All Large Players' - U.Today",
        "content": "Advertisement\n\nFormer Maverick Capital officer and founder of North Rock Digital Hal Press is sure that the current outstanding position of Ethereum (ETH) in Web3 is deeply rooted in years of experiments and development.\n\n\"Not accident\": North Rock Digital's Press on supremacy of post-Shanghai Ethereum (ETH)\n\nEthereum (ETH) became an \"unquestioned arena\" for all top-tier on-chain players in the segment. This only became possible thanks to years-long hard work of its developers and should not be attributed to short-term speculative catalysts. This statement was made by Hal Press, head of North Rock Digital asset manager.\n\nImportant to recognize what is happening in the Ethereum ecosystem recently is more than just a flash in the pan of retail deciding to speculate. This is the culmination of many years of the highest quality dev work in the space. Capped off with Shanghai last month, ETH is now… — Hal Press (@NorthRockLP) May 5, 2023\n\nPress praised Ethereum (ETH) developers high in his tweet yesterday, May 5, 2023. He also highlighted the role of the successful Shanghai upgrade in ETH supremacy.\n\nThe Shapella upgrade (which Shanghai is an integral part of) took place April 12, 2023. It made it possible to withdraw Ethers (ETH) from its proof-of-stake (PoS) deposit contract.\n\nMany experts called this update the most important milestone of Ethereum's (ETH) journey from proof of work toward the proof-of-stake consensus. It is also of paramount importance for ETH tokenomics as the second largest crypto asset.\n\nAs covered by U.Today previously, Press slammed Sui Network's (SUI) hotly anticipated presale campaign for being \"complete vaporware.\"\n\nShanghai makes Ethereum (ETH) stronger than ever before, analysts say\n\nPreviously, mainstream crypto enthusiasts were concerned about Shanghai activation as it could potentially trigger monstrous selling pressure. However, in Q1, 2022, a number of high-reputed analysts released their bullish predictions for the event.\n\nFor instance, Glassnode's team published a detailed report calculating the maximum potential damage for the Ethereum (ETH) price: It could not exceed 8% at worst due to limited withdrawal opportunities and mixed motivation of various groups of investors.\n\nAlso, blockchain veteran Chris Burniske opined that the opportunity to unstake Ether (ETH) from the deposit contract is a great derisking event for midterm strategies of investors with deposits of various sizes."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9sZWFybi9zZWN1cml0aWVzLXZzLWNvbW1vZGl0aWVzLXdoeS1pdC1tYXR0ZXJzLWZvci1jcnlwdG8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Securities vs. Commodities: What's the Difference and Why it Matters For Crypto - CoinDesk",
        "content": "The principal way in which issuers seek to avoid violating securities law is through decentralization. If a cryptocurrency is developed in such a way that a securities regulator could not identify a central, coordinated group responsible for driving up the value of the token, then the asset is less likely to be considered a security. That is one reason why decentralized finance (DeFi) projects take measures to decentralize the development of their projects and split up governance with decentralized autonomous organizations (DAOs), as well as involve mechanisms like proof-of-stake as a consensus mechanism. The argument being that if people are both investors as well as participate in the growth of the project, either by staking the coin and becoming validators, or voting in DAO decisions, they are no longer solely relying on the “third party” to produce returns that the Howey test requires."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbmpvdXJuYWwubmV0L25ld3MvZXRoLXJldGVzdHMtMmstaGVyZXMtd2h5LWV0aGVyZXVtLXByaWNlLWlzLXVwLXRvZGF5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Why did Ethereum price go up today - CoinJournal",
        "content": "Ethereum (ETH) is trading higher today as the crypto market cap bounces to $1.27 trillion.\n\nETH price rose to $2,008 while Bitcoin (BTC) price climbed to $29,800 looks to end the week stronger.\n\nGains for cryptocurrencies came as US equities ended the week higher, with regional bank stocks pummeled earlier in the week rebounding.\n\nOn Friday, the price of Ethereum rose over 6% within hours to break above $2,000, a key technical level that bulls seek to turn into support. On Saturday, Ethereum was trading around $1,966 and up 4% in the past 24 hours after rising to intraday highs of $2,008.\n\nEthereum isn’t the only crypto asset to see a price bump in the past day. Bitcoin, the benchmark cryptocurrency and digital gold, rose to near $29,800 as a 3% price increase took bulls to within the now highly coveted $30k level.\n\nBoth Ethereum and Bitcoin are looking to benefit from an uptick in investor sentiment, particularly with risk appetite back following recent dips.\n\nWhy did Ethereum price go up?\n\nThe total cryptocurrency market cap rose 1.5% to above $1.27 trillion as memecoin mania returned with Pepe (PEPE) and Floki Inu (FLOKI) prices surging after listing on Binance.\n\nA look across the broader market shows crypto prices rebounded as the US stock market ended the week higher, with the major indices all turning green after a four-day losing streak.\n\nThe S&P 500 closed 1.85% up, the Dow Jones Industrial Average added 546 points, or 1.65% and the Nasdaq closed 2.25% higher.\n\nThe positive returns for the market came as equities rebounded, led by shares of Apple (AAPL) that jumped to a nine-month high on the iPhone maker’s better-than-expected quarterly report. The market also saw regional bank stocks show some recovery after massive sell-off in the week, with PacWest shares among those to rebound after falling over 60% on Thursday.\n\nWhile crypto and other risky assets are likely to benefit from overall investor sentiment, the coming week will be key as the markets assess April’s CPI report.\n\nThe Federal Reserve Chair Jerome Powell hinted this week that the central bank could pause its interest rates hike. However, with this week’s strong jobs data, all eyes will be on the CPI data as investors evaluate the inflation indicator."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8wNi9ldGhlcmV1bS1jb21wZXRpdG9yLWF2YWxhbmNoZS1hdmF4LXBhcnRuZXJzLXdpdGgtY2hpbmVzZS10ZWNoLWdpYW50LWFsaWJhYmEtY2xvdWQtb24tbmV3LWNsb3VkdmVyc2UtcHJvamVjdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Ethereum Competitor Avalanche (AVAX) Partners With Chinese Tech Giant Alibaba Cloud on New ‘Cloudverse’ Project - The Daily Hodl",
        "content": "Chinese tech giant Alibaba Cloud is collaborating with Ethereum (ETH) rival Avalanche (AVAX) to venture into the metaverse.\n\nIn a new announcement, the layer-1 protocol says that it is partnering up with Alibaba Cloud to create Cloudverse, a virtual space for businesses and brands.\n\n“Alibaba Cloud announced that they are entering the metaverse – on Avalanche! With Cloudverse, Alibaba Cloud’s millions of clients can easily deploy custom metaverses and unlock new dimensions for consumers.”\n\nAccording to a blog post by Avalanche, Alibaba Cloud will provide the digital infrastructure while Avalanche, along with the Metaverse Union of Architects (MUA) decentralized autonomous organization (DAO), will provide metaverse-building solutions.\n\nAs stated by John Wu, president of Ava Labs,\n\n“Alibaba Cloud and Avalanche continue to change how enterprises can create value and seize the opportunities of Web3. Cloudverse powered by Avalanche offers millions of consumer-facing businesses a quick, low-overhead, one-stop gateway into Web3. We look forward to seeing how businesses expand into the Cloudverse – and to continuing to build the future with Alibaba Cloud.”\n\nAvalanche says that users will be able to launch their customized metaverse spaces as soon as a month after initial outreach.\n\nThe ETH challenger will also provide businesses on the Cloudverse support on visuals, meta-economics, interactive functions, events, and continued operations, according to the blog post.\n\nAvalanche and Alibaba Cloud initially formed a partnership in December 2022 when they struck a deal that would allow developers to spin up AVAX validator nodes through Alibaba’s services.\n\nAvalanche is trading for $17.41 at time of writing, a 2.2% gain during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3Mvd2hhdC10aGUtcmVjZW50LW1lbWUtY29pbi1wdW1wLW1lYW5zLWZvci1iaXRjb2luLWFuZC1ldGhlcmV1bS0yMDIzMDUwNzE0MDXSAX1odHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy93aGF0LXRoZS1yZWNlbnQtbWVtZS1jb2luLXB1bXAtbWVhbnMtZm9yLWJpdGNvaW4tYW5kLWV0aGVyZXVtLTIwMjMwNTA3MTQwNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "What the recent meme coin pump means for Bitcoin and Ethereum - FXStreet",
        "content": "Share:\n\nMeme coin price rallies typically signal a top in Bitcoin and Ethereum prices in close.\n\nExperts believe if PEPE and other meme coins in the ecosystem rally again, it could fuel capital rotation in Bitcoin and Ethereum.\n\nBaby Doge Coin, Dogelon Mars, and Wojak are among the top 10 meme coins by market cap currently rallying.\n\nMeme coins inspired by internet memes and Shiba-Inu-themed coins are currently rallying. After PEPE’s three-digit price rally over the past week, most meme coins have started yielding gains for holders.\n\nAlso read: Ethereum battles intense selling pressure from spike in ETH deposits to crypto exchanges\n\nMeme coin price rallies and what it means for BTC and ETH\n\n@00forrest, a crypto expert and trader, argues that meme coin price rallies typically precede a cycle peak in Bitcoin and Ethereum. PEPE, the meme coin inspired by PEPE the frog meme, recently yielded three-digit gains for holders over the past week before its recent pullback.\n\nAlongside PEPE, Shiba-Inu-themed meme coins like Baby Doge Coin (BabyDoge), Dogelon Mars (ELON), and Wojak (WOJAK) started their price rallies. The two meme coins rank in the top 10 in the category by market capitalization.\n\nTop 10 meme coins in the category by market capitalization\n\nPEPE’s trade volume exceeded that of Dogecoin, Shiba Inu and Baby Doge Coin over the past week with its massive price rally. The expert noted that meme coin peaks are correlated with Bitcoin and Ethereum peaks, as seen in the chart below:\n\nETH/USD 1W price chart\n\nThe analyst believes market participants are in the denial phase, and this could be the start of a brutal bear market. The meme coin price rally will likely catalyze capital rotation into other assets like Bitcoin and Ethereum.\n\nSo the data would suggest that the top is either in or near.\n\n\n\nMaybe $PEPE rallies again, and we get one last leg to $2400 - $2800 ETH.\n\n\n\nMaybe... pic.twitter.com/9MTNoyye1m — forrest.y00tstreet.eth (@00forrest) May 6, 2023\n\nWith the Bitcoin and Ethereum cycle tops, analysts believe that meme coin profits could rotate into cryptocurrencies in the top 10 crypto projects, blockchain gaming and NFTs."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvcGVwZS1jb2luLXNwaWtlcy1ldGgtZ2FzLWZlZS1oaXRzLXRvLTEteWVhci1oaWdoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Pepe Coin Spikes ETH Gas Fee Hits to 1-Year Highs - Watcher Guru",
        "content": "Pepe Coin (PEPE) is the latest craze to grasp the crypto sector. The token has gained as much as 665% in the last week and 585% in 14 days. The asset has led to many investors bowing down in FOMO (fear of missing out) of what many think is the new memecoin king. However, a parallel development has taken place thanks to the craze around the frog-themed crypto project. Demand for Pepe Coin (PEPE) has caused a surge in Ethereum (ETH) gas fees. Gas fee on the popular network has reached one-year highs due to increased transactions to buy PEPE.\n\nOn May 4, the average cost of a single Ethereum transaction increased above $15.82. Although Ethereum’s average transaction costs rose to between $50 and $70 in 2021, things have been relatively quiet since the market collapsed in May 2022.\n\nPEPE trade volume on Uniswap has topped $150 million over the past 24 hours, outpacing Wrapped Bitcoin (WBTC) and USDT stablecoin levels. On May 1, the PEPE token, with a market capitalization of nearly $500 million, also broke into the top 100 cryptocurrencies. The project is getting close to reaching a $1 billion market cap valuation.\n\nEthereum witnesses increased burns due to Pepe Coin\n\nDue to the higher gas prices, 9,392 ETH were burned during the last 24 hours, reaching a one-year high. In 2021, Ethereum underwent a hard fork, which leads to the burning of a portion of all Ethereum transactions. As a result, more ETH is destroyed on the network as activity rises. Moreover, gas fees for Layer-2 transactions have increased as a result of the increase in Ethereum’s transaction fees.\n\nNonetheless, PEPE’s rise, although meteoric, might be fueled by FOMO and the hopes of making a quick buck. The project does not have a lot of use cases, nor does it have a lot of liquidity. At press time, PEPE was trading at $0.00000208, up by 56% in the last 24 hours."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xMzkwMTAvbGlhbS1iaW5hbmNlLWxpc3RzLXBlcGUtbWVtZS1jb2luLW1hcmtldC1jYXAtaGl0cy0xLWJpbGxpb27SAVtodHRwczovL2RlY3J5cHQuY28vMTM5MDEwL2xpYW0tYmluYW5jZS1saXN0cy1wZXBlLW1lbWUtY29pbi1tYXJrZXQtY2FwLWhpdHMtMS1iaWxsaW9uP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Binance Lists PEPE as Meme Coin Market Cap Hits $1 Billion - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe world's largest crypto exchange by volume has just added two more meme coins to the casino.\n\nBinance today announced it would list both Pepecoin (PEPE) and Floki Inu (FLOKI) in the platform's so-called innovation zone.\n\nTo enter, traders must first answer two questions correctly regarding how much money they could lose trading in this zone (more or less than 50%?) and whose fault it would be if they do indeed face a \"total loss\" of funds.\n\nAD\n\nAD\n\nFLOKI has since soared 57% and PEPE has risen another 77%, pushing the frog-inspired token's market capitalization across the $1 billion mark. Still, both coins trade at far less than a penny, at press time.\n\nThe exchange has also provided another word of warning for prospective traders. \"Please note that, as of the time of writing, PEPE has no token utility or value support mechanism,\" reads the listing note on Binance. \"Also, there are signs that certain insiders or team members were able to buy 7% of the total token supply minutes after TGE [Token Generation Event].\"\n\nTrading for these two tokens kicks off today at 12pm ET. Interested parties can also trade both meme coins on margin against Tether's dollar-pegged stablecoin.\n\nWhat is PEPE?\n\nPEPE is the latest meme coin to soar in value and capture the crypto industry's attention. It's based on the artist Matt Furie's Pepe the Frog.\n\nOver the past week, the token has risen by a whopping 1,000%, per Coingecko. It's now the 45th-largest cryptocurrency by market capitalization, overtaking Fantom's native FTM token as well as The Sandbox's SAND token.\n\nAD\n\nAD\n\nBesides its meteoric price rise, the flurry of speculation has also sent gas fees on Ethereum soaring to 1-year highs.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGgtaGl0cy1yZWNvcmQtZGVmbGF0aW9uLWFzLW1lbWUtY29pbi1tYW5pYS1zdXBlcmNoYXJnZXMtYnVybi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "ETH Hits Record Deflation as Meme Coin Mania Supercharges Burn - DailyCoin",
        "content": "A record number of ETH has been burned in the past week.\n\nETH has never been as deflationary as now.\n\nETH deflation has been most likely supercharged by the meme coin mania led by PEPE.\n\nEthereum’s native currency, ETH, is frequently called “ultrasound money” due to its deflationary properties.\n\nIndeed, ETH has been consistently deflationary since Ethereum switched from a proof-of-work to a proof-of-stake consensus mechanism. And it’s been extra deflationary in the past week or so, thanks to the ongoing meme coin mania led by PEPE.\n\nETH Hits Record Deflation\n\nEthereum’s native currency ETH has been steadily going deflationary since merging the proof-of-work and proof-of-stake chains. However, in the past seven days alone it has burned around a significant portion of all ETH burned.\n\nAccording to data from Ultrasound Money, 33,200 ETH has been burned in the last week. This represents a whopping 21.5% of all ETH burned since the merge 232 days ago, which currently stands at 154,154 ETH. ETH has never been more deflationary than now.\n\nThe 33,200 burned ETH in the past week equals a 1.44% yearly deflation. If Ethereum still used proof-of-work, ETH’s supply would grow by 2.09%.\n\nAt current daily run rate ETH would deflate 2% annually. Sure these levels aren’t sustainable in a bear, but what happens when we get a bull? pic.twitter.com/3JW6tkpUUt — Hal Press (@NorthRockLP) May 5, 2023\n\nWhat’s even more impressive about these numbers is that crypto is currently in a bear market and there’s little economic activity going on.\n\nHowever, the meme coin mania that seemingly came out of nowhere is spurring the current ETH deflation.\n\nMeme Coins Supercharge ETH Burn\n\nIf there’s one thing meme coins are great at doing post-merge, it’s burning ETH and increasing its deflation.\n\nThe current meme coin mania has most likely supercharged the current ETH deflation. PEPE, a meme coin that surfaced just a few weeks ago, has pumped almost 3,000% and captured many hearts in the crypto space.\n\nPEPE is currently the 58th largest cryptocurrency with an almost $900 million market capitalization, according to data from CoinGecko.\n\nOther meme coins like WOJAK, CGPT, and WSB have also contributed to high gas fees and, in turn, larger ETH burn. In general, gas has increased significantly in the past few weeks, with people spending $20 and more on a single transaction.\n\nI downloaded 413,283 PEPE Uniswap transactions from @DuneAnalytics\n\n\n\nPEPE traders have burned ~5,300 ETH ($10M) in gas over the past 3 weeks 🤯\n\n\n\n1/🧵 pic.twitter.com/9lZxGGjtT5 — Alex (@thiccythot_) May 5, 2023\n\nOn the Flipside\n\nThe meme mania may be unsustainable due to a weak economic environment and the ongoing bear market. Once the meme craze ends, ETH burn will significantly subside until the next bull market or another meme mania.\n\nWhy You Should Care\n\nETH being deflationary is one of the most attractive properties of the asset. Investors should consider following the deflation/inflation curve of ETH to position themselves better.\n\nRead more about recent PEPE price action:\n\nPEPE Rips 69% to Hit New All-Time as Whales Buy Millions\n\nRead more about a TikTok star joining a new Snapmuse.io creator platform:\n\nMajor TikTok Star Joins New Snapmuse.io Creator Platform on Polygon"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9jYXJkYW5vLW5mdHMtZ3Jvdy1mcm9tLXN0cmVuZ3RoLXRvLXN0cmVuZ3RoLWVub3VnaC10by1mbGlwLWV0aGVyZXVtLWFuZC1zb2xhbmEv0gFpaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2NhcmRhbm8tbmZ0cy1ncm93LWZyb20tc3RyZW5ndGgtdG8tc3RyZW5ndGgtZW5vdWdoLXRvLWZsaXAtZXRoZXJldW0tYW5kLXNvbGFuYS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Cardano NFTs grow from strength to strength – enough to flip Ethereum and Solana? - AMBCrypto News",
        "content": "After a slow start to the year, Cardano NFTs have picked up momentum.\n\nDespite various milestones, collections under the blockchain have not matched up to their Ethereum counterparts.\n\nOver the last few years, the Non-Fungible Token (NFT) market has grown to become a billion-dollar industry. However, it seems like the sector has not reached its peak, as SkyQuest Technology predicted that the market value could surpass $122 billion by 2028.\n\nRealistic or not, here’s ADA’s market cap in ETH’s terms\n\nTwo undeniable contributors to the current market level are the Ethereum [ETH] blockchain and Solana [SOL]. However, these are not the only ones that have had significant input into the ecosystem.\n\nCardano [ADA] NFTs have also had a tremendous impact on the sector. DappRadar, in October 2022, reported that the Cardano NFTs had become the third-biggest protocol in the ecosystem.\n\nAt that time, Cardano had just completed its much-anticipated Vasil upgrade. The upgrade, which was meant to enhance block latency speed and efficiency on the blockchain, propelled an increase in Unique Active Wallets (UAW) on the blockchain. The report noted,\n\n“The Cardano marketplace JPG Store had a 13.66% growth in the number of unique active wallets in the last 30 days. Moreover, the NFT marketplace saw a 40% increase in trading volume, reaching $11.2 million.”\n\nThis metric shows the number of distinct addresses interacting with decentralized applications (dApps) under a protocol. In turn, this led to the NFT volume crossing $19 million within 30 days of the period.\n\nCardano NFTs: The journey to relevance\n\nCardano, known for its scalability and sustainability, entered the NFT space with CardanoKidz being the first collection. Although this collection started in a rookie way, as there was no real utility, it could still sell out using the ADA native token standard.\n\nThough several projects followed, Cardano has still not been able to flip Ethereum and Solana, the two prominent platforms in the NFT market.\n\nEthereum has long been the dominant player in the NFT space. However, its network congestion and high gas fees have caused some users to explore alternative platforms. Solana, on the other hand, has gained attention for its fast and low-cost transactions.\n\nHowever, Cardano’s foray into NFTs brings its own unique advantages, such as its focus on sustainability and the promise of interoperability. But it doesn’t just end there as here are three other unique features of Cardano NFTs:\n\n\n\nCardano NFTs can be created without the need for smart contracts.\n\nSince the blockchain is divided into the settlement and computational layers, fees can be very minimal.\n\nCardano NFTs allow a bunch of transfers of assets with multiple destinations but only one transaction fee.\n\nToday’s worth isn’t yesterday’s value\n\nHowever, it remains to be seen if these features can help Cardano NFTs outperform Ethereum and Solana and reshape the NFT landscape. But surely, their entry certainly adds more diversity and competition to the market.\n\nCoincidentally, there seems to have been a change in Cardano’s performance in the space. According to Santiment, the last quarter (Q4) of 2022 was not really an impressive season for the NFTs. And this lasted until mid-March of the new year.\n\nBut since that period, interest in Cardano NFTs has been massive. Based on on-chain data, the NFT trade volume reached a Year-To-Date (YTD) high of $16.98 million on 18 March. After another period of highs and lows, it was able to record a monthly high of 8.68 million on 2 May, despite only being in the first week.\n\nThis means that many traders now considered Cardano NFTs as one with potential, even as a lot of unique addresses seemed to have jumped ship.\n\nShares, developments, and prospect for the future\n\nMeanwhile, Cardano’s development arm Input Output was not taking any chances of losing out on the NFT market share. On 14 April, the group announced the launch of Lace.io, its first native wallet.\n\nLace, the new wallet platform from IOG, aims to redefine the #Web3 experience & make it accessible to everyone. Explore @lace_io’s pre-launch achievements, its core objectives, features, and journey now that it’s LIVE on mainnet.#LacePlatform #Cardano https://t.co/JnezJnudML — Input Output (@InputOutputHK) April 14, 2023\n\nAnd according to its blog post, the Lace wallet would allow users to send and receive Cardano digital assets. Thus, helping to boost Cardano’s presence in the NFT scene.\n\nHow much are 1,10,100 ADAs worth today?\n\nAlthough Cardano has been pushing toward increased adoption, it has not yet matched Ethereum’s hype. But many other collections have emerged including EarthNode, Mocossi Planet, and Clay Nation, among others. Also, JPG Store has been its largest marketplace, accounting for over 99% of the market share in the last 24 hours.\n\nIn conclusion, the rise of Cardano NFTs presents an intriguing prospect for the future of the digital collectibles market. Furthermore, its potential to challenge the dominance of Ethereum and Solana has positioned it as a promising alternative for NFT creators and collectors.\n\nHowever, the success of Cardano NFTs in flipping Ethereum and Solana ultimately depends on various factors, including network adoption, developer support, and user demand."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tZW1lY29pbi1oeXBlLWRyaXZlcy1iaXRjb2luLXRyYW5zYWN0aW9uLWZlZXMtdG8tbXVsdGkteWVhci1oaWdoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Memecoin hype drives Bitcoin transaction fees to multi-year highs - Cointelegraph",
        "content": "The ongoing trading frenzy of memecoins like Pepe Coin (PEPE) has triggered an unwanted consequence for Bitcoin (BTC) — driving its transaction costs to multi-year highs.\n\nBitcoin transaction fees surged in early May, reaching their highest point over the past two years, according to data from Crypto Fees.\n\nOn May 3, the total amount of fees paid on the Bitcoin blockchain reached $3.5 million, jumping about 400% from late April. The average Bitcoin transaction fee reached as much as $7.2, according to YCharts.\n\nTotal Bitcoin transaction fees between May 2021 and May 2023. Source: CryptoFees\n\nThe latest increase in BTC transaction fees is primarily attributed to a surge in Bitcoin activity involving BRC-20 transactions. According to data from Galaxy Research, 50% of all Bitcoin transactions on May 2 were related to BRC-20 transactions.\n\nModeled after Ethereum’s ERC-20 token standard, BRC-20 is an experimental token standard allowing users to issue and transfer fungible tokens on the Bitcoin blockchain. The standard was introduced in March 2023 by a pseudonymous on-chain analyst known as Domo.\n\nThe BRC-20 token standard has quickly become a major trend in the cryptocurrency industry, specifically amid the sharp growth of the PEPE memecoin. The token has rallied more than 600% over the past seven days, reaching its all-time high of $0.00000216 on May 5.\n\nPEPE 30-day price chart. Source: CoinGecko\n\nThe Bitcoin blockchain isn’t the only blockchain affected by the ongoing memecoin hype. Gas fees on the Ethereum blockchain have also been skyrocketing to new multi-month highs recently.\n\nOn May 2, ETH transaction fees hit an aggregate amount of more than $19 million, a level not seen since May 2022, according to Crypto Fees. The Ethereum blockchain remains the most expensive network in terms of transaction fees at the time of writing.\n\nRelated: Bitcoin miners have earned $50B from BTC block rewards, fees since 2010\n\nDespite the latest spike in Bitcoin transaction fees, the current BTC transaction cost is still far from all-time high levels. The highest Bitcoin transaction fees were recorded in April 2021, when the average BTC transaction cost almost reached $70 amid a major decline in the Bitcoin network hash rate. The previous highest point in BTC transaction fees was in 2017, with transaction costs surging above $60.\n\nMagazine: Asia Express: Justin Sun’s SUI-farming sins, PEPE’s wild run, 3AC’s oyster philosophy"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZGFpbHljb2luLmNvbS93aHktaHlkcmEtaW1wb3J0YW50LWNhcmRhbm9zLXNjYWxhYmlsaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Why Is Hydra Important for Cardano's Scalability? - DailyCoin",
        "content": "Cardano recently released its highly anticipated scaling solution Hydra.\n\nThe Layer-2 solution brings a novel infrastructure to the blockchain space that makes developing apps significantly scalable and efficient.\n\nHydra is still under development; however, it could propel Cardano’s adoption when completed.\n\nCardano has been pushing to compete with Ethereum since its inception in 2017; however, it has long needed scalability and practicality. With Hydra in the mix, the Proof-of-Stake network may have found the key to unlock its potential as an “Ethereum killer.”\n\nAfter much anticipation, Cardano’s novel Layer-2 solution Hydra has made its way onto the main chain, bringing a plethora of essential features. The protocol expects to play a critical role in the network’s adoption with its unparalleled speed and efficiency.\n\nHail Hydra\n\nCardano’s new scaling solution Hydra is a force to be reckoned with. The protocol builds upon Bitcoin’s iconic lightning network and adds heaps of functionality, security, and scalability.\n\nIt introduces a novel state channel framework that allows developers to instantly run scripts, complex transactions, and more off-chain while maintaining similar functionality and security to the Cardano main chain. This approach has been relatively challenging for most scaling solutions like sharding and zk-rollups, which struggle with performance and functionality.\n\nThanks to Hydra’s isomorphism, the ability to replicate the functionality and security of Cardano’s main chain, developers can now access a simple, low-cost, secure, and computationally inexpensive solution that enables them to scale up their decentralized protocols as if it were running on the Cardano main chain.\n\nWith Hydra, Web3 could soon welcome optimized and scalable dApps that rely on instant micropayments such as subscription-based content, in-app purchases, games, and more without congesting the main chain or raising network fees.\n\nLife Cycle of Hydra Head – Source: Hydra Head Protocol.\n\nHydra introduces a myriad of possibilities to Cardano. Another one of its many capabilities is customizability. Since Hydra nodes can be run independently, developers can customize their Hydra Heads to suit their dApps’ needs.\n\nFor instance, decentralized exchanges can operate independently on Hydra Heads, handle millions of transactions and traffic, and run complex consensus and governance models, while maintaining users’ security and network performance.\n\nHydra brings a solid solution with innovative features but is still under development. When completely developed, Charles Hoskinson, the founder of Cardano, shared that Hydra would make Cardano the fastest payment network in the world.\n\nWhat’s Next for Cardano?\n\nThere’s a lot in store for Hydra. It’s an open-source project with hundreds of developers worldwide working to improve it. Initially, Hydra aimed to shift 99% of all Cardano traffic off-chain to Hydra Heads. However, the Cardano Foundation deemed it “too ambitious” and moved on to a new goal – bringing Dapps off-chain.\n\nThe first generation of Hydra is set on being the number one dApp on Cardano by all available metrics, such as Total Value Locked (TVL), traffic, volume, and more. According to DefiLlama, the top dApp by TVL is Minswap, with over $52 million locked. Cardano has a collective TVL of $154 million, and Ethereum has $29.42 billion at press time.\n\nOn the Flipside\n\nCharles Hoskinson shared in an interview that Bitcoin lacks programmability and can only perform a limited set of tasks, such as pushing value around.\n\nCardano saw significant increases in financial and ecosystem metrics due to increased dApp transactions and the adoption of new stablecoins in Q1 2023.\n\nWhy You Should Care\n\nScalability is a big issue in the blockchain industry and one of the significant parts of the blockchain trilemma. Leading blockchains like Ethereum have struggled in the past with network congestion and high network fees, which can deter adoption.\n\nWith blockchain technology expected to take off, billions of users could likely adopt the technology, increasing the need for scaling solutions that can easily handle significant traffic, such as Hydra.\n\nFAQs\n\nWhat does Hydra do for Cardano? Hydra, or Hydra Head Protocol, is a Layer-2 isomorphic scaling solution that creates a network of off-chain ledgers with the security guarantees and functionality of the Cardano main chain. How does Cardano solve scalability? Cardano solves scalability in several ways, including its Hydra Head Protocol. The Hydra Layer-2 solution allows developers and users to instantly process transactions, scripts, metadata, and more as if on the Cardano chain and then settle the final result on the main chain. How fast is Cardano Hydra? Hydra is rumored to have a whopping one million TPS; however, Charles Hoskinson dismissed those rumors and explained that Hydra works to achieve a limitless number. Currently, the speed at which Hydra operates is being tested. What happened to the Hydra crypto? Announced in 2019, after many delays, the first generation of Hydra made it to the Cardano mainnet in April 2023.\n\nAre whales migrating to Cardano?\n\nCardano Whales Amass $218M in ADA Tokens Over Two Weeks\n\nRead more about Hydra:\n\nHow Cardano’s Hydra Layer-2 Is Challenging Bitcoin Lightning Network and Ethereum Sharding"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC0zLWNyeXB0b3MtZm9yLXRoZS1uZXh0LWJ1bGwtbWFya2V0LWNvbmZsdXgtY2Z4LWV0aGVyZXVtLWV0aC1hbmQtY29sbGF0ZXJhbC1uZXR3b3JrLWNvbHQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Top 3 Cryptos for the Next Bull Market: Conflux (CFX), Ethereum (ETH), and Collateral Network (COLT) - Analytics Insight",
        "content": "In this article, we’ll discuss the top 3 cryptos poised to lead the charge in the next bull market: Conflux (CFX), Ethereum (ETH), and Collateral Network (COLT). Among these projects, Collateral Network (COLT) is currently in the presale phase, offering early investors an opportunity to grab discounted COLT. Let’s dive into each of these projects and discover how they could potentially benefit from the next bull market.\n\n>>BUY COLT TOKENS NOW<<\n\nCollateral Network (COLT)\n\nCollateral Network (COLT) is a groundbreaking peer-to-peer lending platform that empowers individuals to borrow money using real-world assets as collateral. What sets Collateral Network (COLT) apart from other lending platforms is their reliance on a blockchain system to execute transactions without intermediaries.\n\nCollateral Network (COLT) goes a step further by tokenizing the assets into NFTs. This process allows loan collateral to be divided into multiple segments, enabling lenders to finance any number of these fragments as they desire.\n\nCollateral Network (COLT)’s approach not only expands the lending market to a broader array of potential lenders but also injects additional liquidity into the sector. As a result, Collateral Network (COLT) is poised to disrupt the trillion-dollar asset-backed lending industry.\n\nCOLT, the platform’s utility token, grants holders access to NFT auctions, exclusive discounts, and the opportunity to stake for extra rewards. As Collateral Network (COLT) continues gaining momentum and onboarding new users, demand for the COLT token is expected to rise.\n\nCOLT tokens can be purchased for a current price of $0.014 during phase 2 of the presale. Since more than 30 million tokens have already been sold, analysts anticipate that Collateral Network (COLT) tokens could reach $0.35 per token by the end of 2023.\n\nConflux (CFX)\n\nConflux (CFX) is a third-generation blockchain network focused on scalability, security, and decentralization. Conflux (CFX) uses a new consensus algorithm called Tree Graph to make it more efficient than other blockchains without sacrificing any of its core principles.\n\nIn addition to its strong fundamentals, Conflux (CFX)’s native token, CFX, has been performing exceptionally well on the market. The price of Conflux (CFX) has increased by more than 1,000% since the beginning of 2023.\n\nPart of this Conflux (CFX) price surge can be attributed to the fact that Hong Kong is opening back up to cryptocurrency. As a project based in China, Conflux (CFX) is particularly well-positioned to benefit from this new wave of crypto adoption.\n\nMoving forward, Conflux (CFX) is expected to build on its strong fundamentals and continue its impressive growth. Analysts anticipate that the price of Conflux (CFX) could surpass $0.80 by the end of 2023 — a potential 158%+ return.\n\nEthereum (ETH)\n\nLast but certainly not least, is Ethereum (ETH). As the second-largest cryptocurrency by market capitalization, Ethereum (ETH) is an obvious choice for any investor looking to diversify their crypto portfolio with a tried and true asset.\n\nWhat makes Ethereum (ETH) so attractive, is its strong and wide-reaching network of developers. With the help of Ethereum (ETH)’s expansive developer community, projects built on top of the platform can benefit from a wider array of resources — allowing for faster innovation and more secure code.\n\nWhile there have been attempts to challenge Ethereum (ETH)’s status as the leading smart contract platform, none have yet been able to unseat the king of dApps. This gives investors confidence that their investments in Ethereum (ETH)-based projects are likely safe from other competitors.\n\nLooking ahead, analysts anticipate that Ethereum (ETH) could reach $3,600 by the end of 2023 if the bull market continues. The $1,800 price mark should act as support, but if it breaks, Ethereum (ETH) could fall back down to $1,650.\n\nIf you wish to purchase the $COLT token for only $0.014, follow the links below and take advantage of this unique opportunity to earn an extra 40% purchase bonus on your investment!\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9tZW1lcy1nb25lLW1haW5zdHJlYW0tYS1jbG9zZXItbG9vay1hdC1ldGhlcmV1bS1iYXNlZC1tZW1lLWNvaW5zLXNoaWJhLWludS1mbG9raS1pbnUtYmlnLWV5ZXMtY29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Memes Gone Mainstream: A Closer Look At Ethereum-Based Meme Coins Shiba Inu, Floki Inu & Big Eyes Coin - Analytics Insight",
        "content": "Meme coins have captured the world’s attention, as they continue to soar in value following Elon Musk’s tweets and the enthusiasm of the crypto community. While Dogecoin (DOGE) is currently the most well-known meme coin, other meme coins such as Shiba Inu (SHIB), Floki Inu (FLOKI), and Big Eyes Coin (BIG) are also gaining significant traction.\n\nAlthough all three of these meme coins operate on the Ethereum blockchain, they differ in terms of their utility and marketing approach. Shiba Inu and Floki Inu primarily rely on their cute mascots and celebrity endorsements to generate interest and appeal to the community, while Big Eyes Coin emphasises its usefulness in the e-commerce industry and its cat-themed approach.\n\nLet’s take a closer look at these meme coins and how they are becoming a sensation in the crypto verse!\n\nShiba Inu & Floki Inu: The Crypto Dog Duo\n\nShiba Inu (SHIB) and Floki Inu (FLOKI) are two meme coins that have gained significant traction in the cryptocurrency world. Shiba Inu (SHIB) is a meme coin inspired by the famous Japanese dog breed and gained widespread attention after a tweet from Elon Musk in early 2021.\n\nIt has been dubbed the “Dogecoin Killer” due to its resemblance to Dogecoin. Shiba Inu (SHIB) has gained more popularity with the development of ShibaSwap, a decentralised exchange for SHIB tokens.\n\nOn the other hand, Floki Inu (FLOKI) is a newer meme coin that has been inspired by Elon Musk’s recent announcement that his new dog is named Floki. It is still in its early stages, but it has already attracted a considerable amount of interest and attention from crypto investors.\n\nBoth of these meme coins are ERC-20 tokens operating on the Ethereum blockchain, with a total supply of one quadrillion tokens each. They also share a common tokenomics feature where a certain percentage of each transaction fee is burned to decrease the total supply and potentially increase the value of the remaining tokens.\n\nBig Eyes Coin: The Feline Snatching the Spotlight from the Canines!\n\nThe presale of Big Eyes Coin has been incredibly successful, with many investors eager to get their hands on this exciting new cryptocurrency. The presale has already raised over $34 million, making it one of the most successful presales in recent memory.\n\nHowever, time is running out for investors who have yet to participate, as the presale will end on June 3rd. Despite this, there is still a chance for investors to get involved and potentially profit from Big Eyes Coin. By using the code END300, investors can receive a generous 300% bonus, making it an even more enticing opportunity.\n\nBig Eyes Coin is more than just a typical cryptocurrency. It aims to make a positive impact on the world by supporting ocean conservation efforts. The project has pledged to donate 5% of its total supply to help preserve the ocean’s health, which not only contributes to a better environment but also reinforces the cryptocurrency’s value.\n\nMoreover, the project’s team actively engages with its community by hosting social media contests and events that foster excitement and unity among supporters and investors.\n\nSo, don’t let this golden opportunity slide by, get your BIG tokens today and get a chance to join the millionaire club!\n\nFor all things Big Eyes Coin (BIG):\n\nPresale: https://buy1.bigeyes.space/?source=insight\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nOpenSea: https://opensea.io/collection/big-eyes-lootbox-cards\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMizAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLW1heS01LWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE1OTk5OTDSAdABaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9jcnlwdG9jdXJyZW5jeS1wcmljZS10b2RheS1pbi1pbmRpYS1tYXktNS1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNTk5OTkwL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Sees Gains As Sui Becomes Top Loser - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $29,000 and $18,00 marks, respectively, on early Friday morning. Other popular altcoins — including the likes of Dogecoin (DOGE), and Litecoin (LTC) — landed in the negative as overall prices saw minor losses across the board. Casper (CSPR) emerged to be the biggest gainer, seeing a 24-hour jump of over 3.04 per cent. Sui (SUI), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.20 trillion, registering a 24-hour gain of 0.14 per cent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $29,266.13 seeing a 24-hour gain of 0.62 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 25.45 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,899.59, marking a 24-hour loss of 0.13 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.65 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour loss of 0.73 percent as per CoinMarketCap data, currently priced at $0.07884. As per WazirX, Dogecoin price in India stood at Rs 6.8698.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 1.18 percent. At the time of writing, it was trading at $88.34. LTC price in India stood at Rs 7,567.23.\n\nRipple (XRP) price today\n\nXRP price stood at $0.4643, seeing a 24-hour gain of 0.10 percent. As per WazirX, Ripple price stood at Rs 40.0021.\n\nSolana (SOL) price today\n\nSolana price stood at $22.00, marking a 24-hour loss of 1.26 percent. As per WazirX, SOL price in India stood at Rs 1,930.00.\n\nTop crypto gainers today (May 5)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nCasper (CSPR)\n\nPrice: $0.06165\n\n24-hour gain: 3.04 percent\n\nInternet Computer (ICP)\n\nPrice: $6.00\n\n24-hour gain: 2.69 percent\n\nToncoin (TON)\n\nPrice: $2.09\n\n24-hour gain: 1.94 percent\n\nTrust Wallet Token (TWT)\n\nPrice: $1.18\n\n24-hour gain: 1.82 percent\n\nKava (KAVA)\n\nPrice: $0.7898\n\n24-hour gain: 1.69 percent\n\nTop crypto losers today (May 5)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nSui (SUI)\n\nPrice: $1.27\n\n24-hour loss: 9.58 percent\n\nStacks (STX)\n\nPrice: $0.7526\n\n24-hour loss: 5.45 percent\n\nOptimism (OP)\n\nPrice: $2.04\n\n24-hour loss: 4.82 percent\n\nInjective (INJ)\n\nPrice: $7.43\n\n24-hour loss: 4.56 percent\n\nMina (MINA)\n\nPrice: $0.6222\n\n24-hour loss: 4.51 percent\n\nWhat Crypto Exchanges Are Saying On Present Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin fluctuated between US$28,700 and US$29,000 on Thursday, but after the Federal Reserve announced an interest rate increase, the cryptocurrency saw a steady uptick, with bullish trends apparent. Currently, BTC is supported at US$28,800 and faces resistance at US$29,420. In contrast, Ethereum remained stable at US$1,900 during the last 24 hours. Investors are closely monitoring the U.S. employment data set to release today.”\n\nWazirX Vice President Rajagopal Menon said, “Crypto markets remain in a state of confusion as Bitcoin stays near $29,000 while investors assess recent central bank interest rate increases and ongoing bank crises. Data from CryptoQuant shows high selling pressure but also a high Coinbase and Korean premium, suggesting strong buying demand. On WazirX, Orchid (OXT) and Bakery Token (BAKE) have been the top gainers in the last 24 hours.”\n\nBuyUcoin CEO and India’s second-longest-running digital asset exchange Shivam Thakral said, “The crypto market quickly recovered from the latest rate hike of 25 basis points announced by the Fed. BTC is holding strong above the $29,000 mark while Ether is almost touching the $1900 level at the time of writing. The crypto market is witnessing restricted growth due to high inflation and other macroeconomic factors and the Jobs data on Friday will act as a key stimulant for the market momentum.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin said, “Bitcoin is currently trading at $29,286 while other major cryptocurrencies like BNB and ETH are trading at around $326 and $1,900 respectively. The crypto market remains in a consolidation phase as economic risks and the likelihood of a short-term Fed rate cut cycle increase. US Treasury markets are taking note, and if yields continue to trend downward, cryptocurrencies like Bitcoin could benefit from safe-haven demand as investors look for hard money alternatives to fiat currencies. Despite uncertainty about the global economic outlook, the potential for a short-term bitcoin price pump remains high.”\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtY2hhdGdwdC13aGF0LXdpbGwtYmUtZXRoZXJldW0tcHJpY2UtaW4tMjAyNS1oZXJlcy13aGF0LWl0LXNhaWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "We asked ChatGPT what will be Ethereum price in 2025; Here's what it said - Finbold - Finance in Bold",
        "content": "With the renewed interest in artificial intelligence (AI) sparked by the release of the text-based AI platform ChatGPT, the tool has proven exceptionally useful in multiple areas, including providing insights into the future price trends of assets on the cryptocurrency market, such as that of Ethereum (ETH).\n\nAfter dutifully reminding the reader that “investing in cryptocurrencies is risky” and that the actual price of Ethereum may be higher or lower than the estimates, ChatGPT has provided “some information on the possible Ethereum price range by 2025, based on ecosystem developments and upgrades, related news, community support, user base, and other factors.”\n\nIs $10,400 possible?\n\nAs some of the factors that could impact crypto asset’s price by 2025, ChatGPT singled out the “ongoing development and improvement of the Ethereum ecosystem, including upgrades to the Ethereum 2.0 protocol,” and “the growth of decentralized finance (DeFi) applications.”\n\nOn top of that, the AI tool pointed out the “adoption by major companies or financial institutions, or partnerships with other blockchain projects” as well as “the number of customers and developers building on the Ethereum blockchain” as further positive factors potentially driving its price up. Finally, as it explained:\n\nEthereum price prediction for 2025. Source: ChatGPT\n\nOther not-so-bullish predictions\n\nAt the same time, CoinPriceForecast is a lot less bullish on the price of Ethereum in 2025, predicting a price of $2,685 at the end of 2024, followed by $2,825 by mid-2025 and ending the year 2025 with $2,446, according to the most recent data retrieved by Finbold.\n\nEthereum price prediction for 2023, 2024, and 2025. Source: CoinPriceForecast\n\nInterestingly, the price prediction model over at PandaForecast trends more to the bearish side, targeting $2,045 in January 2025, $1,319 in June, and $1,752 in December 2025, with even its optimistic range seeing $2,224 at the year’s beginning and $2,084 at its conclusion.\n\nEthereum price analysis\n\nMeanwhile, Ethereum was at press time trading at the price of $1,901, which represents a very modest increase of 0.03% on the day, as well as a drop of 0.49% in the last seven days but still a 1.59% gain on its monthly chart, according to the data retrieved on May 5.\n\nEthereum 30-day price chart. Source: Finbold\n\nWhether the ChatGPT’s very optimistic prediction has a chance o f coming true will largely depend on future positive sentiment and developments directly connected to the Ethereum network, as well as the overall attitude on the wider crypto and macro landscapes.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vdHJhZGVyLW1ha2VzLTM4Njc1LXByb2ZpdC13aXRoLXBlcGUtdHVybmluZy0yLTEtZXRoZXJldW0taW50by0xLTcxLW1pbGxpb24tdXNpbmctbWVtZS1jb2luLWh5cGUv0gGIAWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS90cmFkZXItbWFrZXMtMzg2NzUtcHJvZml0LXdpdGgtcGVwZS10dXJuaW5nLTItMS1ldGhlcmV1bS1pbnRvLTEtNzEtbWlsbGlvbi11c2luZy1tZW1lLWNvaW4taHlwZS8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Trader Makes 38,675% Profit with Pepe, Turning 2.1 Ethereum into $1.71 Million Using Meme Coin Hype - Crypto News Flash",
        "content": "A trader netted a massive $1.7 million in profits by buying more than four trillion PEPE coins just before this massive rally.\n\nAmid the current price surge, PEPE is leading the memecoin fest leading it to become the 41st largest cryptocurrency by market cap.\n\nThe memecoin crypto space is currently bustling with activity Pepe (PEPE), the competitor to Dogecoin and Shiba Inu is making much noise. As per the latest report, a crypto trader has recently netted 38,675 percent profit by trading PEPE which is already up by more than 500 percent in just over the last two weeks.\n\nAs per the blockchain tracker LookonChain, the crypto trader purchased a total of four trillion PEPE memecoins at a price of 2.1 Ethereum, worth $4,140 back then. As it turns out, the trader has sold more than 75 percent of its PEPE coin holdings netting more than $1.705 million in profits just within a span of two weeks. The trader now holds a balance of less than one million in his kitty. Data from LookonChain notes:\n\nA SmartMoney bought 4 trillion PEPE at a cost of 2.1 ETH ($4,410) and made approximately $1.71 million! And this guy also traded a lot of MEME coins. The SmartMoney discovered PEPE and spent 2.1 ETH ($4,410) to buy four trillion PEPE six hours after PEPE was listed. After each price surge in PEPE, he sold part of PEPE instead of selling all of them. He sold a total of 3.27 trillion PEPE for $906,000 and currently holds 700 billion PEPE worth $808,000.\n\nThe PEPE coin rally\n\nThe PEPE Coin has been currently leading the rally in the memecoin space and has become the undisputed cryptocurrency among its peers. As of press time, PEPE is trading 128 percent up at a price of $0.00000365 with a market cap of over $1.4 billion. By its market cap, PEPE ranks as the 41st largest cryptocurrency.\n\nAs per the on-chain data tracker, the trader who mostly transacts on the Ethereum blockchain has netted triple-digit profits over the two-other lesser known memecoins. The data from LookonChain notes:\n\n“This smart money has transactions on almost every chain, and 97% of assets are on Ethereum. He also bought BULL at $0.00075, now at $0.0045, which increases 500%. And bought BABYPEPE at $0.00000000024, now at $0.00000000123, which increases 415%.”\n\nPEPE has once again triggered the memecoin fest and grabbed the limelight away from the top players such as Doegcoin (DOGE) and Shiba Inu (SHIB).\n\nRecently, there’s quite some interesting activity spotted with these two of the biggest memecoins. Over the last month, dormant whale address inactive for the last 9.3 years and holding millions of DOGE coins turned active once again.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy5vdXRsb29raW5kaWEuY29tL2J1c2luZXNzLXNwb3RsaWdodC9iaXRjb2luLWFuZC1ldGhlcmV1bS1hcmUtcmVjb3JkaW5nLWxvc3Nlcy10aGUtZW52aXJvbm1lbnRhbC1jb2luLWVjb3RlcnJhLXNvb24tdG8tYnJlYWstdGhlLTMtbWlsbGlvbi1tYXJrLW5ld3MtMjgzOTc50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Bitcoin And Ethereum Are Recording Losses – The Environmental Coin Ecoterra, Soon To Break The 3 Million Mark - Outlook India",
        "content": "Right now, Ecoterra’s presale is happening, and it's already raised over $2.8 million, and it's about to hit the $3 million mark very soon! And the best part? You can get ECOTERRA tokens for just $0.007, but the price is going to go up soon, so you need to act fast! Plus, with the team behind the project announcing that the coin will list for $0.01 in Q3 2023, early-bird investors could see huge returns."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy50aGVjb2lucmVwdWJsaWMuY29tLzIwMjMvMDUvMDUvY29sbGF0ZXJhbC1uZXR3b3JrLWNvbHQtZW1lcmdlcy1hcy1iZXR0ZXItb3Bwb3J0dW5pdHktdGhhbi1zdGFja3MtY3J5cHRvLWFuZC1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Collateral Network (COLT) Emerges As Better Opportunity Than Stacks Crypto And Ethereum - The Coin Republic",
        "content": "After the tumultuous market crash last year, 2023 has brought some relief to cryptocurrencies. Among them, Collateral Network (COLT), Stacks (STX), and Ethereum (ETH) are leading the way for bulls. In this article, we will analyze how a new project, Collateral Network, is leaving well-established cryptos like Stacks and Ethereum behind in growth rate.\n\n>>BUY COLT TOKENS NOW<<\n\nStacks Eyes To Tap Artificial Intelligence\n\nAs the hype around the integration of artificial intelligence into Web3 is growing, Stacks has also moved forward. Recently, an AI-powered developer platform, Replit, started featuring the Stacks layer for Bitcoin. After this development, verified Stacks “Repls” will be accessible to over 20 million users of Replit.\n\nThis will help developers learn how to build on the Stacks blockchain. The engineering resources available in the Stacks Replit profile will include code templates, the Stacks Connect start kit, and beginner tutorials. Although Stacks is trying to integrate new technologies into its blockchain, the growth has tumbled in the past few weeks. At the time of writing, Stacks (STX) is changing hands at $0.71.\n\nEthereum Launches ETHIndia Grant 2.0\n\nTo increase its adoption and network activity, Ethereum has launched the second season of the ETHIndia Grants program. Under ETHIndia, Ethereum will provide developers with up to $5,000 in equity-free grants to support their projects. Besides, Ethereum will also provide continuity grants or external funding to growth-oriented projects.\n\nEthereum, through this program, wants to encourage and incentivize developers to build projects in the areas of ZK tech, next-gen wallets, and more. The ETHIndia Grants 2.0 program has followed the launch of Ethereum’s Shanghai Upgrade. Notably, the market value of Ethereum has witnessed a rise after the rollout of the Shanghai Upgrade. At the time of writing, Ethereum (ETH) is available to trade at $1,887.34, registering an increase of 9% in the past month.\n\nDemand For Collateral Network Shoots Up\n\nAre you looking for a platform where you can unlock liquidity from your luxury watch, vintage car, fine wine, or any other valuable physical asset and borrow crypto?\n\nCollateral Network will be the go to place on the blockchain to achieve this. On Collateral Network, people will be able to borrow crypto by using their real world physical assets as collateral. This unique platform is set to disrupt the traditional lending market set to be worth $1721.38 billion by 2031 (source: allied market research).\n\nBorrowers seeking loans send their physical assets to Collateral Network. The company then evaluates the asset, mints an NFTs that represent the physical item and fractionalizes it. These asset-backed fractional NFTs are sold to investors to fund the loans.\n\nLenders on the platform are from all over the globe so borrowers now have access to global liquidity and can obtain loans at competitive rates, lenders in return earn a fixed weekly income.\n\nThe platform is permissionless so there will be no need to submit private documents like proof of income or credit history to secure a loan.\n\nCollateral Network’s presale is storming and COLT tokens are set to skyrocket by 3500% to $0.35 in the upcoming months. Just 38% of the total COLT supply will be released during the presale, and over 100 million tokens are already sold. At present, you can lock a COLT token at $0.014.\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\n\n\nDisclaimer: Any information written in this press release or sponsored post does not constitute investment advice. Thecoinrepublic.com does not, and will not endorse any information on any company or individual on this page. Readers are encouraged to make their own research and make any actions based on their own findings and not from any content written in this press release or sponsored post. Thecoinrepublic.com is and will not be responsible for any damage or loss caused directly or indirectly by the use of any content, product, or service mentioned in this press release or sponsored post."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vaW90YS1zaGltbWVyLW5ldHdvcmstYm9vbXMtd2l0aC0yMjAwMC1kYWlseS1hY3RpdmUtYWRkcmVzc2VzLWFuZC1iZXR0ZXItcGVyZm9ybWFuY2UtdGhhbi1ldGhlcmV1bS_SAYoBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL2lvdGEtc2hpbW1lci1uZXR3b3JrLWJvb21zLXdpdGgtMjIwMDAtZGFpbHktYWN0aXZlLWFkZHJlc3Nlcy1hbmQtYmV0dGVyLXBlcmZvcm1hbmNlLXRoYW4tZXRoZXJldW0vP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "IOTA: Shimmer Network Booms with 22,000 Daily Active Addresses and Better Performance than Ethereum - Crypto News Flash",
        "content": "The daily active addresses on the Shimmer Network saw a major boost with the start of the Treasures of Shimmer airdrop campaign.\n\nSince its launch 7 months ago, the Shimmer blockchain has delivered robust performance without any bugs or any other major issues.\n\nThe IOTA Shimmer network has gained popularity in just a few months of launch and is turning out to be one of the most preferred platforms for new projects to launch their services. In the latest development, IOTA co-founder Dominik Schiener took to Twitter to celebrate the milestone for the Shimmer Layer 1 network.\n\nReporting a massive growth in utility, Schiener said that the Shimmer blockchain now has 22,000 daily active addresses. This followed the airdrop campaign by Treasures of Shimmer. In the recent development, Web3 gaming experience IOTAHeroes has launched the Treasures of Shimmer Battle test on the ShimmerEVM network.\n\nSchiener said that the Shimmer ecosystem is flourishing and growing daily and that the native SMR token price will hit new highs very soon.\n\n22k daily active addresses just on the Shimmer L1 yesterday with the start of the Treasures of Shimmer airdrop campaign. The tech is amazing. The ecosystem is flourishing and growing daily. This is the way $SMR #Shimmer Imagine how SMR will fly once this hits mainnet. pic.twitter.com/H7utlU9e5y — Dominik Schiener (@DomSchiener) May 4, 2023\n\nThe Treasures of Shimmer kicked off earlier this week on May 3 and is a two-week-long incentive campaign that will reward projects and users for participating in the public testing of the ShimmerEVM chain, as well as the dApps deployed on it. Later, the participants will participate in the public testing of 1.3 million SMR tokens.\n\nThe Robust Performance of the Shimmer Network\n\nIn its report for the first quarter of the year 2023, the IOTA Foundation spoke about the success of the Shimmer Network attained in a very short period of time. Since its launch in late September 2022, IOTA’s staging network Shimmer operated successfully without any bugs or any other major issues.\n\nAs we know, both IOTA and the Shimmer networks are Layer-1 platforms that use the Tangle technology with DAG for transactions as well as data storage but differ in tokenization. Shimmer’s Stardust protocols also facilitate NFTs, customer tokens, and alias outputs on the Layer 1 network.\n\nNote that Shimmer is a staging network of the IOTA blockchain and serves as a testbed for testing new innovations before they make their way to the IOTA mainnet. The Stardust feature is currently limited only to Shimmer and might arrive on the IOTA blockchain in the future.\n\nAlso, while IOTA uses dust protection, Shimmer asks users to back up their stored data on the Tangle with the SMR tokens. Everyone is now eagerly awaiting the launch of the ShimmerEVM which will facilitate seamless transfer of assets between Shimmer and Ethereum.\n\nHowever, developers have currently launched the ShimmerEVM testnet a month ago. The Shimmer EVM testnet has reached a transaction milestone of approximately one million and has over 38,000 active wallet addresses, just a month after its launch. The platform has also successfully deployed over 2,200 smart contracts.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3RoZWN1cnJlbmN5YW5hbHl0aWNzLmNvbS9hbHRjb2lucy90aGUtY2FuY3VuLXVwZ3JhZGUtYm9vc3RpbmctdGhlLXBlcmZvcm1hbmNlLWFuZC1iZW5lZml0cy1vZi1ldGhlcmV1bS1iYXNlZC1wcm9qZWN0cy01NDA3M9IBhwFodHRwczovL3RoZWN1cnJlbmN5YW5hbHl0aWNzLmNvbS9hbHRjb2lucy90aGUtY2FuY3VuLXVwZ3JhZGUtYm9vc3RpbmctdGhlLXBlcmZvcm1hbmNlLWFuZC1iZW5lZml0cy1vZi1ldGhlcmV1bS1iYXNlZC1wcm9qZWN0cy01NDA3My9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "The Cancun Upgrade: Boosting the Performance and Benefits of Ethereum-Based Projects - The Currency Analytics",
        "content": "Ethereum, the second largest cryptocurrency by market capitalization, is gearing up for its next major upgrade, the Cancun upgrade. This upcoming upgrade is expected to boost the performance of the Ethereum network, making it more efficient and secure than ever before. As the Ethereum network undergoes this upgrade, it is predicted that Ethereum-based projects will also reap the benefits.\n\nOne of the projects that is set to benefit from the Cancun upgrade is Big Eyes Coin, an Ethereum-based project that has recently gained a lot of attention due to its successful presale. Big Eyes Coin is a unique deflationary token that employs a burn mechanism to increase the coin’s scarcity and ultimately drive up its value. With the upcoming Ethereum upgrade, Big Eyes Coin is expected to attract even more attention from the crypto community.\n\nAnother project that is poised to benefit from the Cancun upgrade is Robot Era, a crypto project that aims to compete with the leaders of the NFT gaming metaverse. Robot Era is a platform that allows users to build and customize their own robots, which can then be used in various games and applications. With the improved efficiency and security of the Ethereum network post-upgrade, Robot Era is expected to become a more attractive option for gamers and investors alike.\n\nThe Cancun upgrade is set to bring significant improvements to the Ethereum network, including improvements to transaction throughput, security, and overall performance. These improvements will not only benefit Big Eyes Coin and Robot Era, but also the entire Ethereum ecosystem. As more projects are built on top of Ethereum, the network’s performance and security become increasingly important.\n\nThe Ethereum network has been a leader in the blockchain space for years, and this upgrade shows the continued commitment of the Ethereum team to improving the network’s capabilities. As more and more projects are built on top of Ethereum, the network’s importance only continues to grow, and it is crucial that the network remains efficient and secure.\n\nOverall, the Cancun upgrade is a positive development for the Ethereum community, and it is expected to bring significant benefits to Ethereum-based projects, investors, and users alike. As the upgrade is implemented and the network’s capabilities continue to improve, we can expect to see even more innovation and growth in the Ethereum ecosystem in the coming months and years.\n\nIn conclusion, the Cancun upgrade is a highly anticipated event in the Ethereum community, as it promises to bring significant improvements to the network’s performance, security, and overall functionality. With these upgrades, Ethereum-based projects such as Big Eyes Coin and Robot Era are expected to see an increase in attention and adoption, as the network becomes more efficient and secure."
    }
]