[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wOS8xNi9ldGhlcmV1bS1kZXZlbG9wZXJzLXNsb3ctc3Rha2luZy1zb3VyY2Utb2YtcmVsaWFibGUtY3J5cHRvLXJldHVybnMv0gFmaHR0cHM6Ly9mb3J0dW5lLmNvbS8yMDIzLzA5LzE2L2V0aGVyZXVtLWRldmVsb3BlcnMtc2xvdy1zdGFraW5nLXNvdXJjZS1vZi1yZWxpYWJsZS1jcnlwdG8tcmV0dXJucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum developers approve change to slow down ‘staking’—despite reliable crypto returns - Fortune",
        "content": "One year after one of the most talked about software upgrades since the Y2K changeover more than two decades ago, crypto’s most important commercial highway risks becoming a victim of its own success.\n\nThe revamp of the Ethereum network, which was known as the Merge, turned out to be a seamless transition to a more energy-efficient system of ordering transactions on the blockchain. One of the incentives offered to participants is the ability to earn a yield on tokens used to help the network run. Surging demand for the so-called staking feature has now raised the prospect of the network bogging itself down.\n\nAs part of the staking process, the Ether tokens that underpin the network are “locked up” in digital wallets to help order transactions and to earn the yield. Already about 20% of all Ether in circulation, valued at about $41.5 billion, has been staked, according to data tracker Staking Rewards.\n\nIf the current pace continues, that amount would balloon to 50% by May and 100% by December 2024, according to a paper whose two authors include Tim Beiko, who coordinates Ethereum developers.\n\nWhat’s driving the demand is that staking has emerged as one of a few reliable ways to earn returns in crypto. Most token prices are still less than half the record highs reached in late 2021. Ether owners can currently earn a yield of around 4% by staking.\n\n“We all like up-only, but not when the safety of Ethereum is at stake,” the paper’s other author, who goes by Dapplion, said on X, the social platform formally known as Twitter.\n\nThe worst case scenario is that there won’t be any Ether available to actually make transactions on the network. At a minimum, it increases the strain on the part of the network used to order transactions.\n\nThat’s why Ethereum developers are working to slow the staking influx down. On Sept. 14, the developers agreed to cap the number of new validators, which operate the staking wallets, allowed to join the network every six minutes. The change will be tagged onto the next major Ethereum software upgrade later this year. With the so-called churn change, Ethereum won’t reach the theoretical point of 100% of all circulating Ether being staked for several years, according to the paper.\n\n“We want to slow it down a bit to buy us some time,” Matt Nelson, a product manager at Ethereum infrastructure builder Consensys, said in an interview.\n\nThe respite will allow developers to figure out longer-term solutions. With staking achieving “unprecedented success, beyond the original intended targets of stake rate,” the paper said, developers may look at adjusting validator rewards “to discourage staking past a certain point.”\n\nMost people don’t stake their Ether — and act as validators — directly. Instead, they give their tokens to various services, operated by the likes of Kraken, Lido and Coinbase Global Inc., that pool the tokens and share in the rewards. Lido, which issues Ether holders another token they can trade on exchanges while their coins are staked, has about a 33% market share, according to data service Dune.\n\n“A knock-on effect is that it enshrines current staking providers,” said Jim McDonald, chief technology officer at Attestant, one of the largest Ethereum staking providers."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdS50b2RheS9ndWlkZXMvZXRoZXJldW0tZ29lcmxpLXRlc3RuZXQtanVzdC1yZXBsYWNlZC1ieS1ob2xlc2t5LXdoYXQteW91LW5lZWQtdG8ta25vd9IBYWh0dHBzOi8vdS50b2RheS9ndWlkZXMvZXRoZXJldW0tZ29lcmxpLXRlc3RuZXQtanVzdC1yZXBsYWNlZC1ieS1ob2xlc2t5LXdoYXQteW91LW5lZWQtdG8ta25vdz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Goerli Testnet Just Replaced by Holesky: What You Need to Know - U.Today",
        "content": "Advertisement\n\nEthereum (ETH), the second largest blockchain and the most mainstream smart contracts platform, has accomplished a major milestone. The history of its most important testnet, Goerli, has come to an end.\n\nHere's why Ethereans decided to sunset Goerli in 2023 and what is special about Holesky, Goerli's hotly anticipated successor.\n\nEthereum replaces Goerli testnet by Holesky: Basics\n\nToday, Sept. 15, 2023, on the first anniversary of The Merge activation in mainnet, Ethereum (ETH) has ceased supporting its testnet, Goerli. Developers need to migrate toward Holesky, the first PoS-by-design testnet.\n\nHolesky (or Holešky, Holešovice) is an Ethereum (ETH) test network (testnet) activated on Sept. 15, 2023.\n\nHolesky replaces Goerli as a staking, infrastructure and protocol-developer testnet.\n\nFor dApp stress tests, smart contract experiments and other EVM-related procedures, developers should refer to Sepolia testnet.\n\nHolesky is the first-ever Ethereum (ETH) testnet launched on the top of the proof-of-stake (PoS) consensus.\n\nHolesky launches to address scalability issues of Goerli: the shortage of goETH testnet tokens, the low number of validators and so on.\n\nHolesky will have 1.46 million validators, which is almost twice as much as Ethereum (ETH) mainnet has.\n\nNew testnet support will be abandoned by 2028.\n\nAs such, with Holesky, Ethereum (ETH) developers will have a new sandbox environment in which to experiment with various features of the protocol.\n\nWhat is testnet?\n\nIn cryptocurrencies, a test network or testnet is an experimental distributed network that emulates the processes that happen on a cryptocurrency network, but with no real value transferred. Just as with main networks (mainnets), accounts can send tokens to each other, while validators confirm them by adding new blocks to the chain.\n\nUsers of a testnet get \"play\" tokens from faucets, a free-to-use mechanism created by Ethereum (ETH) enthusiasts. For instance, some faucets distribute free testnet Ethers for sharing Twitter accounts, connecting to Discord and so on.\n\nSuch networks are necessary for stress testing dApps without the risks of losing money. Every modern DeFi or wallet undergoes a testnet phase before mainnet deployment.\n\nRopsten, Rinkeby, Goerli, Sepolia: Crucial Ethereum (ETH) testnets\n\nEthereum (ETH), the second largest blockchain and the first programmable network (with smart contracts), used a couple of testnets during its eight-year history. Launched in 2016, Ropsten replaced Morden, the first-ever testnet for proof-of-work (PoW) Ethereum. Ropsten was a testbed of all major Ethereum (ETH) dApps we are using and the first testnet to be \"merged\" when Ethereum (ETH) tested the PoW-to-PoS transition.\n\nIn 2017, Ethereans launched Rinkeby, a testnet on the top of the Clique proof-of-authority (PoA) consensus mechanism, which is a modified version of proof of stake (Pos). It only interacted with the Go Ethereum (Geth) version of client software.\n\nAt the ETH Berlin Conference in 2018, Ethereum (ETH) developers unveiled Goerli, a multiclient Ethereum (ETH) testnet. It means that it could work with the versions of Ethereum (ETH) software written in various programming languages.\n\nFinally, in 2021, Ethereum Sepolia testnet was launched with an unlimited number of testnet tokens.\n\nIntroducing Holesky, very special Ethereum (ETH) testnet\n\nActivated today, Ethereum's Holesky is an attempt by core developers to address all the issues that somehow affected previous testnets and their usage by teams.\n\nHolesky: Highlights\n\nHolesky is the first long-standing public Ethereum testnet that is \"merged from genesis\"; this means that Holesky never had a proof-of-work (PoW) version. Not unlike its predecessors, Holesky draws its name from the Nádraží Holešovice subway station in Prague.\n\nHolesky works together with Sepolia; while the first testnet is designed to be a technical platform for experiments with staking designs, the general infrastructure of Ethereum (ETH) and protocol-level development ideas, Sepolia is a platform for testing smart contracts, decentralized applications and all EVM functionalities. Like all mainstream crypto testnets, Holesky will have its own set of validators, block explorer and ecosystem of faucets.\n\nHolesky: What was wrong with Goerli?\n\nHolesky goes live to replace Goerli, a major Ethereum (ETH) testnet since 2018. Holesky is designed to help Ethereum (ETH) testers avoid the disadvantages of earlier testnets. For instance, Ethereum Goerli users faced a shortage of GoETH test tokens and were even forced to purchase them for money, which is in contradiction of Ethereum (ETH) testnet rules. Holesky is unlikely to face similar issues.\n\nHolesky public testnet genesis file has been generated, and merged into main branch of https://t.co/JWKySOSvtU.\n\nLaunch date Sept/15, 2023, 14:00 UTC\n\nChain ID-17000 (zip code of Holešovice).\n\nThe genesis will have 1,460,000 validators. Our biggest public network to date. — Barnabas Busa (@BarnabasBusa) August 22, 2023\n\nAlso, it will have a previously unimaginable number of validators: 1.46 million entities will protect network integrity. This is more than Ethereum’s mainnet (700,000) and Goerli (512,000) have in all. This, in turn, will allow developers to mimic \"real-world\" Ethereum (ETH) operations closely.\n\nPer the creators of Holesky, they allocated over two billion HoleskyETH by the launch in order to make this quantity sufficient for all developers.\n\nHolesky: Specifications\n\nHolesky goes live with a set of specifications just like any other EVM ecosystem blockchain. Here's what future Holesky users should consider before getting connected to the network."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMTcvaXRzLWJlZW4tb25lLXllYXItc2luY2UtdGhlLWV0aGVyZXVtLW1lcmdlLWhlcmVzLWhvdy10aGUtbmV0d29yay1pcy1kb2luZy1vbi1pdHMtZ29hbHMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "It's been one year since the Ethereum merge. Here's how the network is doing on its goals. - CNBC",
        "content": "Despite ether's recent price action, the network has been thriving since the \"merge\" – and could just be getting started. A year ago Ethereum underwent a major technical transition that was meant to improve its security in an energy efficient way that many hoped would lead to higher price s and, separately, would open a new yield-generating opportunity for investors. The price of ether is down over the past six months, but it's still up 8% over the past year and nearly 35% year-to-date, according to Coin Metrics. With the crypto market as a whole suffering from low liquidity and volatility amid regulatory uncertainty, the incremental regulatory and technical developments in Bitcoin and Ethereum haven't been enough to push prices to new highs after the banking crisis-fueled rally earlier this year. Still, market participants are seeing and feeling the success of the Ethereum merge. \"ETH's transition to proof-of-stake created a more composable, cheaper and less energy-intensive network that currently yields stakers about 4%,\" said Matthew Sigel, head of digital assets research at VanEck. \"But with T-bills yielding 5% and the U.S. regulatory onslaught ongoing, investor and developer interest has been insufficient to pump the token much in recent months.\" \"Ethereum daily gas fees are languishing near 2023 lows and daily trading activity at 2-year lows,\" he added. \"We look forward to Ethereum protocol upgrade EIP-4844 in Q4, which should enable much cheaper transactions on Ethereum-compatible layer 2s and potentially catalyze wider adoption of stablecoin and loyalty applications.\" Here's how Ethereum is doing on some of its post-merge goals: Yields Ether's staking reward reference rate was 5.854% per annum on Sept. 15, 2022, according to Ethereum data provider Beaconchain. It spiked to about 8% after the fall of FTX and in May following JPMorgan's takeover of First Republic. Yields were last at 3.9%. The yield changes based on participation levels in staking and Ethereum's process of validating transactions. It is expected to fall as more stakers come onto the network. (For more on staking check out our guide here .) More validators The amount of staked ether has been rising steadily over the past year with investors keen to earn extra yield on their assets. While the merge gave investors the opportunity to earn yield – by locking up their funds – this year's Shanghai, also known as Shapella, upgrade gave them the ability to unstake their funds. The Shanghai upgrade was widely seen as an event that would bring more liquidity to Ethereum. \"While the market has been really stagnant across digital assets, staking has been one of the few areas that have seen constant growth in this period,\" said Andrew Ballinger, head of staking solutions at Canadian investment firm 3iQ. \"About a week after [Shanghai] happened in April, we started to see assets coming into the network to be staked outpacing assets being withdrawn,\" he added. \"That really demonstrates the immediate interest from people who were sitting on the sidelines, who hadn't been staking until this point to start doing so.\" The percentage of ether supply being staked has risen from 11.99% on Sept. 15, 2022, to 20.46% on Aug. 30 of this year. Burning fees and decreasing supply Ethereum has a mechanism programmed in to regulate the network's notoriously high transaction fees, called gas fees, by \"burning\" them. Everyday new ether is emitted into the market and if demand doesn't match the supply level, the price goes down. After the merge, investors expected there to be less supply in the market, and if demand stayed constant, that the price would rise. Since the merge, the supply of ether has fallen 0.248%, according to data provider Ultrasound Money . About 681,449 ETH have been issued while 981,427 have been burned. \"The ETH supply is now kind of dependent on the usage – the more usage, the more ETH that's burned,\" said Maria Shen, a general partner at Electric Capital. \"Right before the merge, the supply of ETH peaked, and now we are on a flat, deflationary supply curve.\" \"Whenever someone does a transaction, they pay a fee,\" she explained. \"Part of that fee is now being burned, and whenever you do that, the supply of Ethereum shrinks. So you have effectively a deflationary supply of ETH\" – meaning the supply over time will begin to decline as opposed to increase, which is historically what it's always done – \"as long as people keep using the network.\" The next upgrade The merge was just the first step in a series of upgrades that are planned to make improvements on Ethereum. The blockchain is the most popular among developers who are keen to build a new world of applications on this technology. But, in recent years, it has been hampered by its famously slow transaction times and egregious transaction fees. Those specific problems gave rise to alternatives like Solana and Cardano. If Ethereum can speed up transactions and solve the fee structure, it could become more competitive, Shen said. \"Those no longer become differentiating factors,\" she said. \"So those ecosystems will be forced to figure out other differentiating factors. \"A lot of them do scale in different ways with different types of trade offs, so that's one consideration: what are the trade offs that users are willing to make?\" she added. \"It's not just enough for something to be fast, you need something to be able to do it on the chain.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzE2L2NvdWxkLXRoaXMtbmV3LW1vdmUtZnJvbS1jYXRoaWUtd29vZC1hbmQtYXJrLWludmVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Could This New Move From Cathie Wood and Ark Invest Send Ethereum Soaring? - The Motley Fool",
        "content": "In what could be a big catalyst for Ethereum (ETH -0.54%), Cathie Wood's Ark Invest has filed an application for the first-ever spot Ethereum exchange-traded fund (ETF). This comes after a summer filled with twists and turns surrounding the launch and approval of the first-ever spot Bitcoin ETF.\n\nSo could this new ETF from Ark Invest send the price of Ethereum soaring? There are several different factors to consider.\n\nInstitutional demand\n\nLet's face it -- the launch of a spot Ethereum ETF probably means little for the seasoned crypto investor. Why would you go to the added step of buying an ETF (which comes with management fees), when you can already go to a cryptocurrency exchange like Coinbase Global and buy Ethereum directly? The only allure of a spot crypto ETF is if you want exposure to crypto, but without the risk or hassle of investing directly in crypto.\n\nThe big reason a spot Ethereum ETF is so bullish for the markets is because it signals pent-up institutional demand for the world's second-largest cryptocurrency. Many institutional investors are unwilling or unable to purchase crypto directly, due to the constraints placed on them. Do you really want your pension fund or university endowment dabbling in a volatile, poorly regulated industry with significant risk of loss?\n\nBut the picture changes when you take into account a market-traded financial instrument that has been approved by the Securities and Exchange Commission (SEC). According to the Ark Invest filing, the spot Ethereum ETF would trade on the CBOE BZX Exchange and custody its crypto assets with Coinbase. That essentially makes Ethereum \"safe\" (relatively speaking) for the world's biggest institutional investors. And that's where things get really exciting, because it could signal a tsunami of new money flowing into Ethereum. Theoretically, that new influx of money should boost Ethereum's price. It's just simple supply and demand.\n\nLessons from Bitcoin this summer\n\nAnd that, of course, brings us to what happened this summer, which was headlined by one big event: the decision by BlackRock, the world's biggest fund manager, to file for a spot Bitcoin ETF on June 15. That led to a flurry of follow-on filings from other institutional investors, a response by the SEC, and new adjustments to those filings in response to the SEC. Just about everyone -- including Ark Invest -- was trying to be first in line for the first-ever spot Bitcoin ETF.\n\nAnd the market responded accordingly. The Bitcoin rally in June was very real. On the date of the BlackRock ETF filing, Bitcoin was trading around $25,000. Thirty days later, it was trading near $30,000, and bullish sentiment was risiing. It seemed to be a matter of not if, but when, a new spot Bitcoin ETF would be approved. Finally, it looked like Bitcoin was about to go mainstream.\n\nGranted, the effect on Ethereum is not going to be as great as for Bitcoin, simply due to the fact that institutional investors still prefer Bitcoin to Ethereum. But there is almost certain to be a similar type of effect, given that Ethereum now accounts for roughly 20% of the entire market cap of the crypto market.\n\nThe heavy hand of the SEC\n\nSo what could possibly go wrong? There's a short answer: the SEC. There's something about a spot Bitcoin ETF that the SEC doesn't like. Despite the fact that the SEC has already approved futures-based Bitcoin ETFs, it doesn't seem to want to approve a spot Bitcoin ETF. So it's uncertain how long the approval process could take. Ark Invest, for example, originally filed its first spot Bitcoin ETF application back in 2021.\n\nAnd, in the case of Ethereum, there's an added wrinkle. That's because Ark Invest is essentially skipping a step here. Unlike with Bitcoin, no futures-based Ethereum ETF has yet been approved in the U.S., although several applications have been filed. So Ark Invest is skipping from no Ethereum ETF in the U.S. to spot Ethereum ETF without the intermediate step of a futures-based Ethereum ETF.\n\nThe big picture\n\nDespite these regulatory challenges, the big picture is that the decision by Ark Invest to file for a spot Ethereum ETF appears to signal that there's plenty of institutional demand for Ethereum. As crypto becomes more and more of a mainstream asset class for institutional investors, that's huge for Ethereum's future prospects. So buckle up: This could get interesting if Cathie Wood ever gets SEC approval for the first-ever spot Ethereum ETF."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tdW52ZWlscy1uZXctdGVzdG5ldC1jYWxsZWQtaG9sZXNreS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum unveils new testnet called 'Holešky' - crypto.news",
        "content": "Ethereum’s developers launched a new testnet that’s being touted as a promising alternative to the aging Goerli network.\n\nDubbed “Holešky,” the testnet was designed to facilitate staking, infrastructure, and protocol development.\n\nEthereum preps for future\n\nEthereum, the blockchain powering the world’s second-largest crypto by market cap, is continually evolving to meet the demands of a rapidly growing blockchain ecosystem. To keep pace with the ambitious roadmap, Ethereum developers have introduced a new testnet called “Holešky.”\n\nAt the core of the Holešky testnet launch is its unprecedented initial supply of 1.6 billion Holešky testnet Ether (HETH). This substantial allocation is provided to validators on Holešky’s inaugural day to kick start network operations.\n\nIn contrast, it’s worth noting that this token amount is ten times more than what the main Ethereum network currently holds. Ethereum developer Tim Beiko justified this allocation, stating that “devnets [are] regularly using 10B supply.” This move ensures that Holešky has ample resources to support the development and testing of new features.\n\nYou might also like: Ethereum developers on Goerli now have to pay for test ETH\n\nRetiring the Goerli testnet\n\nBefore Holešky emerged, the Goerli testnet was Ethereum’s primary platform for testing new staking, infrastructure, and protocol developments.\n\nConcerns began to surface in October when developers voiced their reservations about Goerli’s insufficient supply of Goerli ETH to meet testing requirements. Holešky’s generous HETH supply is expected to address this issue effectively.\n\nIn tandem with Holešky’s launch, Ethereum developers have been encouraging application developers to migrate from Goerli to Sepolia, a move that leaves only protocol developers on the old network. The Ethereum team has set its sights on deprecating Goerli in January 2024. Following deprecation, Goerli will receive another year of maintenance before being permanently shut down, as outlined in official documentation.\n\nThe advent of Holešky marks a critical juncture in Ethereum’s journey. The platform is poised to implement a slew of transformative features, including proto-danksharding, danksharding, and Verkle trees.\n\nThese innovations reduce transaction fees and make running a node more cost-effective. To ensure seamless integration into the mainnet, each feature will undergo rigorous testing on Holešky, underscoring the testnet’s pivotal role in Ethereum’s development pipeline.\n\nRelentless development\n\nEthereum’s commitment to innovation remains unwavering. Recent upgrades, including the Shanghai upgrade, have already introduced substantial scalability, security, and functionality improvements. Ethereum researcher Christine Kim affirms that Ethereum’s development community is far from complacent and is already plotting the next wave of enhancements. The blockchain’s execution layer (EL) and consensus layer (CL) are the focal points of these upcoming code changes.\n\nWhile Holešky gears up for pivotal infrastructure and protocol testing, Ethereum has also made strides in simplifying the process of launching tokens on its blockchain.\n\nEthereum developer Aram Mughalyan recently revealed a groundbreaking development. Using the OpenZeppelin Contract Wizard, Mughalyan demonstrated how anyone can create a new token on the Ethereum blockchain in under one minute. This streamlined process allows broader token innovation within the Ethereum ecosystem.\n\nYou might also like: Ethereum upgrade doubled energy efficiency rates, study reveals\n\nEther price analysis\n\nAccording to data from CoinGecko, the price of Ethereum (ETH) stands at $1,628; over the past seven days, the token has recorded a 0.07% increase. Ethereum’s market capitalization stands at more than $195 billion. On Sept. 11, ETH witnessed a dip to $1,530 before rebounding to its current valuation.\n\nThe introduction of the Holešky testnet and the simplification of token launches on Ethereum demonstrate the blockchain’s commitment to staying at the forefront of Web3 innovation. These developments pave the way for a more robust and accessible Ethereum ecosystem with exciting prospects.\n\nFollow Us on Google News"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWhvbGVza3ktdGVzdG5ldC1sYXVuY2gtZmxvcHMtcmVsYXVuY2gtaXMtZXhwZWN0ZWQtaW4tY29taW5nLXdlZWtzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Holesky testnet launch flops, relaunch is expected in coming weeks - CryptoSlate",
        "content": "Ethereum’s Holesky testnet experienced an error that will require another launch attempt, community members and developers said on Sept. 15.\n\nEthereum researcher Diederik Loerakker, aka protolambda, wrote that one developer entered certain data in the wrong part of the network’s genesis files. He said:\n\n“Someone put 0x686f77206d7563682069732074686520666973683f (“how much is the fish?”) as extra-data in the EL Holesky genesis.json, and not in the CL genesis.ssz.”\n\nThis resulted in a misconfiguration that caused the testnet to fail to launch, according to Loerakker. He added that other fork parameters are “rumored to mismatch” but did not provide further details of those issues.\n\nLoerakker added that Holesky did not experience issues related to network size, something that was considered before launch. In August, developers determined that Holesky could handle 1.4 million validators. In response, they introduced a large amount of Holesky ETH, amounting to 1.6 billion tokens.\n\nRelaunch expected in coming weeks\n\nThough developers will soon relaunch Holesky, the exact date of that event is still unclear. Nethermind, an Ethereum research and engineering group, said developers will relaunch Holesky in one week. That seemingly places the next attempt on Sept. 22.\n\nMeanwhile, Ethereum contributor and Sigma Prime member Michael Sproul has suggested in a GitHub pull request that Holesky should be relaunched on Sept. 28. That date is nearly two weeks later than the network’s first launch attempt.\n\nRegardless of delays, the issue does not affect Ethereum’s mainnet, which is responsible for transactions with real value. Beaconchain.eth acknowledged this, writing that the Holesky launch “didn’t go as expected, but that’s what testnets are here for.”\n\nAccording to Ethereum documentation, Holesky will supersede Ethereum’s Goerli testnet. Both testnets are intended for testing related to staking, validating, and core network upgrades. Another testnet called Sepolia, which is aimed at independent developers who want to test their own Ethereum-based apps, also exists.\n\nEach of these testnets relies on special testnet ETH that is freely available through faucets and which generally has no real market value."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTcvZXRoZXJldW1zLWhvbGVza3ktdGVzdG5ldC1mYWlscy10by1sYXVuY2gtaW4tcmFyZS10ZWNoLW1pc3N0ZXAtZm9yLXRoZS1ibG9ja2NoYWluL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTcvZXRoZXJldW1zLWhvbGVza3ktdGVzdG5ldC1mYWlscy10by1sYXVuY2gtaW4tcmFyZS10ZWNoLW1pc3N0ZXAtZm9yLXRoZS1ibG9ja2NoYWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum’s Holesky Testnet Fails to Launch, in Rare Tech Misstep for the Blockchain - CoinDesk",
        "content": "Holesky is also supposed to be critical for Ethereum’s next hard fork, Dencun, in which proto-danksharding, a technical feature aimed at scaling the blockchain, is supposed to go live. Jayanthi told CoinDesk that the set back in Holesky’s launch is not supposed to affect the timing of Dencun. “This won’t affect Dencun at all,” he said."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9iaXRjb2luLWV0aGVyZXVtLWRhaWx5LWFjdGl2ZS1hZGRyZXNzZXMtbGFnZ2luZy10eC1jb3VudC_SAWJodHRwczovL3d3dy5uZXdzYnRjLmNvbS9iaXRjb2luLW5ld3MvYml0Y29pbi1ldGhlcmV1bS1kYWlseS1hY3RpdmUtYWRkcmVzc2VzLWxhZ2dpbmctdHgtY291bnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Dominates Ethereum In Daily Active Addresses Despite Lagging In TX Count - NewsBTC",
        "content": "Ethereum might be the king of smart contracts and the world’s primary hub for decentralized finance (DeFi) and non-fungible tokens (NFTs) activity but onchain data suggests that Bitcoin is ahead in user engagement, interpreted by the number of daily active users, and network activity is at acceptable, healthy levels, reading from the number of daily transactions confirmed.\n\nBitcoin Leads Ethereum In Daily Active Addresses\n\nAccording to Artemis Terminal data on September 15, Bitcoin, despite being predominantly a transactional layer, enabling the peer-to-peer (P2P) transfer of value between addresses, has more daily active users than Ethereum.\n\nThis observation is even as Ethereum serves as a conduit of value since assets can be moved, just like in Bitcoin, and a smart contract platform for deploying trustless and automated decentralized applications (dapps). Some, like Uniswap, a decentralized exchange (DEX), process billions worth of transactions every month.\n\nOn September 15, Bitcoin had over 800,000 daily active addresses (DAA), more than twice those in Ethereum, which stood at slightly over 378,000. The only time there was a slight change was on September 13, when over 1 million addresses were activated on Ethereum.\n\nThen, the number of DAA on Bitcoin also fell to around 743,000. However, the DAA on Ethereum has fallen sharply while Bitcoin has maintained an upward trajectory since late August. During this time, Ethereum’s DAA has been fluctuating heavily, as evidenced by the rise and fall on Sep 13 and through to today.\n\nEthereum Processes Over 1 Million Transactions Everyday\n\nEthereum shines in the number of daily transactions processed. When writing on September 15, the smart contract platform had processed over 1 million transactions while Bitcoin lagged, confirming less than 600,000.\n\nEven at this level, Ethereum has processed less than half of what it did on September 13, when the network processed over 2.3 million transactions. On the other hand, Bitcoin’s daily transactions have been steady, while those of Ethereum have, on average, risen over the past three months, as Artemis Terminal data shows.\n\nDAA and daily transaction count are important metrics that on-chain analysts use to analyze the level of engagement and health of public blockchains.\n\nOver the past 18 months, activity has rapidly shrunk as asset prices fall in the crypto winter. Ethereum’s drop from around $5,000 in late November 2021 to as low as $1,500 in 2022 weighed negatively on DeFi and NFT activity.\n\nAccording to DeFiLlama, the total value locked (TVL) of DeFi protocols has stabilized below $50 billion, down from around $180 billion in 2021. Meanwhile, trading volume has crashed by over 90%, dragging the value of NFT-related projects, including Immutable X and ApeCoin. To illustrate, APE is down 96% from peaks.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xNi9uZXctY29pbmJhc2UtZXRoZXJldW0tbGF5ZXItMi1zdXJnZXMtdG8tbmV3LWFsbC10aW1lLWhpZ2gtaW4tZGFpbHktdHJhbnNhY3Rpb25zLW91dHBhY2luZy1hcmJpdHJ1bS1hbmQtb3B0aW1pc20v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "New Coinbase Ethereum Layer-2 Surges to New All-Time High in Daily Transactions, Outpacing Arbitrum and Optimism - The Daily Hodl",
        "content": "Coinbase’s new Ethereum (ETH) layer-2 scaling solution Base set a new all-time high in terms of daily transactions on Thursday.\n\nBase skyrocketed to more than 1.8 million transactions on September 14th, shattering its previous record of around 1.4 million, according to the project’s block explorer.\n\nThe new layer-2 project actually clocked more transactions that day than the combined total processed by its rivals Arbitrum (ARB) and Optimism (OP). Arbitrum saw around 500,000 transactions on Thursday and Optimism clocked roughly 378,000, according to their respective block explorers.\n\nBase officially launched last month and is powered by Optimism. Coinbase has previously said it hopes the project helps onboard over a billion people into the crypto economy.\n\nThe exchange has noted there are no plans to launch a network token associated with Base. The project is designed to be compatible with Ethereum, Ethereum layer-2s and alternative layer-1 blockchains.\n\nOP is worth $1.38 at time of writing. The 41st-ranked crypto asset by market cap is up 2.2% in the past 24 hours and more than 6.1% in the past seven days.\n\nARB is trading for $0.788 at time of writing. The 39th-ranked crypto asset by market cap is down more than 2.1% in the past day and more than 12.5% in the past week.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aWxsLWV0aGVyZXVtcy1wcmljZS10dXJuLXZvbGF0aWxlLXNvb24v0gFCaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3dpbGwtZXRoZXJldW1zLXByaWNlLXR1cm4tdm9sYXRpbGUtc29vbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Will Ethereum’s price turn volatile soon? - AMBCrypto News",
        "content": "Ethereum’s exchange supply declined.\n\nIts demand in the derivatives market was high, as its funding rate turned green.\n\nAfter months of less volatility, top cryptos like Ethereum [ETH] might see a change in trend. The possibility seemed likely as buying pressure on ETH was on the rise. If the increase in accumulation starts to show its effects, then the king of altcoins might soon reach the $1,800 mark again.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nBuying pressure on Ethereum is high\n\nSantiment’s 15 September tweet revealed an optimistic development that hinted at an increase in volatility in the crypto market. Reportedly, Ethereum’s exchange supply declined, as traders appeared content with their holdings.\n\nThe above development was accompanied by a rise in Tether’s [USDT] supply of exchanges. This was a positive outcome, as an increase in Tether’s supply could mean that investors might further increase accumulation.\n\n? #Bitcoin's & #Ethereum's exchange supply has resumed going lower as traders appear content #hodling. And the even better news is that #Tether is moving back on to exchanges, now at the highest level since March. This indicates more future buy interest. https://t.co/j5aviy3b5F pic.twitter.com/22b90022aB — Santiment (@santimentfeed) September 15, 2023\n\nA closer look at ETH’s on-chain performance suggested that investors were already stockpiling the token in hopes of a price rise in the near future. According to CryptoQuant, both ETH’s exchange reserve and net deposits on exchanges were dropping.\n\nMoreover, Ethereum’s supply outside of exchanges flipped its supply on exchanges. Supply held by top addresses also increased, suggesting that the whales were buying the token.\n\nEthereum’s investors can expect this\n\nUpon checking Ethereum’s metrics, a few other bullish signals were also revealed. For instance, over the last week, Ethereum’s funding rate turned green, meaning that it was in demand in the derivatives market.\n\nPositive sentiment around the token also remained relatively high, and its MVRV ratio improved, suggesting a possible price uptick.\n\nThough the metrics looked bullish, a look at ETH’s daily chart painted a different picture of what the token’s near-term future might look like. Most of the market indicators remained bearish on the king of altcoins and suggested that its price could go down further.\n\nThe Chaikin Money Flow (CMF) and Money Flow Index (MFI) registered downticks. Moreover, ETH’s Relative Strength Index (RSI) was resting below the neutral mark of 50.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAs per the Bollinger Bands, Ethereum’s price was in a less volatile zone, which decreased the chances of a price uptick in the near future. However, one indicator still remained in the buyers’ favor. ETH’s MACD pointed out that the bulls were still controlling the market.\n\nAccording to CoinMarketCap, ETH was up by nearly 0.2% in the last 24 hours. At the time of writing, it was trading at $1,635.63 with a market capitalization of over $196 billion."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aGF0LWRvZXMtcmlwcGxlLXhycC1uZWVkLXRvLWNhdGNoLXVwLXRvLWV0aGVyZXVtL9IBT2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aGF0LWRvZXMtcmlwcGxlLXhycC1uZWVkLXRvLWNhdGNoLXVwLXRvLWV0aGVyZXVtLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "What Does Ripple (XRP) Need to Catch up to Ethereum? - CryptoPotato",
        "content": "There’s been an interesting ongoing discussion among XRP aficionados on Twitter lately, with some laying arguments as to what the future of Ripple should look like so that it supports the company’s vision, as well as that of XRP holders.\n\nA community member, Yassin Mobarak, took it to X to comment:\n\nI’m sensing Ripple is shifting from reliance on XRP in cross-border payments to new use cases such as institutional custody of digital assets, derivatives, CBDCs, and carbon credit markets. Not saying that’s a bad strategy at all, but in order for XRP to prosper long-term, we cannot rely on just Ripple.\n\nIndeed, there have been multiple announcements recently related to Ripple. Just a few days ago, the company expanded its liquidity hub to two new countries – Brazil and Australia.\n\nBefore that, Ripple made headlines by revealing an acquisition of the well-known crypto-focused financial institution called Fortress Trust.\n\nCommenting on the matter was also a popular blockchain analyst, who said:\n\nWe cannot rely on Ripple. It’s the builders we should be focusing on. XRP ecosystem has approximately 1000 projects according to Ripple Markus Infanger at Apex. We need 100,000 active projects to even get close to ETH. If you love to focus on Ripple, shop for private equity that is sold on more than dozen platforms with competitive prices.\n\nIn essence, the expert argues that there’s a long way ahead if Ripple is to catch up to Ethereum in terms of development, but this in itself brought up another interesting argument by another user, who said:\n\nXRPL is not a SC-centered chain, you don’t need to keep acting like it is. Different use cases will create a different value."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW50cnVzdC5jb20vZXRoZXJldW0tbmV3cy9ldGhlcmV1bXMtaG9sZXNreS10ZXN0bmV0LWZhY2VzLWRlbGF5LWR1ZS10by1jb25maWd1cmF0aW9uLWVycm9y0gFsaHR0cHM6Ly93d3cuY29pbnRydXN0LmNvbS9ldGhlcmV1bS1uZXdzL2V0aGVyZXVtcy1ob2xlc2t5LXRlc3RuZXQtZmFjZXMtZGVsYXktZHVlLXRvLWNvbmZpZ3VyYXRpb24tZXJyb3IvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum’s Holesky Testnet Faces Delay Due to Configuration Error - CoinTrust",
        "content": "Ethereum’s Holesky testnet, initially anticipated to launch smoothly, has encountered an unexpected delay necessitating a second launch attempt, as revealed by community members and developers on September 15. Ethereum researcher Diederik Loerakker, known as protolambda, reported that an error had occurred when one developer placed certain data in an incorrect section of the network’s genesis files.\n\nLoerakker explained that “how much is the fish?” (encoded as 0x686f77206d7563682069732074686520666973683f) was mistakenly included as extra data in the EL Holesky genesis.json instead of the CL genesis.ssz. This configuration misstep resulted in a critical misalignment that prevented the testnet from successfully launching. While Loerakker hinted at potential discrepancies in other fork parameters, he refrained from disclosing further details regarding these issues.\n\nNotably, Loerakker emphasized that the problems with Holesky were not related to network size, a concern that had been carefully evaluated before the initial launch. In August, developers had determined that Holesky was capable of accommodating 1.4 million validators. In response, they allocated a substantial quantity of Holesky ETH, totaling 1.6 billion tokens.\n\nWhile developers are committed to relaunching Holesky, the exact date for this relaunch remains uncertain. Nethermind, a prominent Ethereum research and engineering group, announced plans to reintroduce Holesky within one week, potentially targeting September 22 for the subsequent attempt. Conversely, Ethereum contributor and Sigma Prime member Michael Sproul has proposed a relaunch date of September 28, nearly two weeks later than the initial launch date.\n\nDue to mismatching of some parameters, the holesky test network failed to start today. The Ethereum Holesky test network is scheduled to be officially launched today. It will be twice the size of the main network and will become the largest test network in Ethereum, with 1.46… — Wu Blockchain (@WuBlockchain) September 16, 2023\n\n\n\nIt is worth noting that despite the delays and challenges faced by the Holesky testnet, Ethereum’s mainnet remains unaffected. The mainnet continues to facilitate transactions with tangible value, distinguishing itself from the testnet environment. Beaconchain.eth acknowledged the Holesky launch setback, underlining the essential purpose of testnets as platforms for identifying and rectifying issues before they impact the main network.\n\nIn accordance with Ethereum’s documentation, Holesky testnet is expected to supersede Ethereum’s Goerli testnet. Both Holesky and Goerli serve as dedicated test environments for experimentation related to staking, validation processes, and core network upgrades. Additionally, there exists another testnet known as Sepolia, catering to independent developers keen on testing their Ethereum-based applications. These testnets rely on specialized testnet ETH that is freely obtainable through faucets and generally lacks real market value.\n\nIn summary, Ethereum’s Holesky testnet has encountered a setback necessitating a second launch attempt due to a configuration error in the genesis files. While the exact relaunch date remains uncertain, the Ethereum community remains committed to resolving these issues and further refining the network’s test environment. It is important to underscore that these challenges have no bearing on Ethereum’s robust and fully operational mainnet, which continues to support transactions of real value."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtbmV4dC1tb3ZlLWZvci1idGMtYXMtaXQtZmFjZXMtY3J1Y2lhbC1yZXNpc3RhbmNlLTIwMjMwOTE1MjAwNdIBnwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLW5leHQtbW92ZS1mb3ItYnRjLWFzLWl0LWZhY2VzLWNydWNpYWwtcmVzaXN0YW5jZS0yMDIzMDkxNTIwMDU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: CPI jump by was expected to stir the BTC price, and it has - FXStreet",
        "content": "Share:\n\nBitcoin price could test the $24,000 range, a 10% fall seems likely before upside potential actualizes.\n\nWith Ethereum’s 0.94 correlation with Bitcoin, ETH could follow BTC down 10% to test the $1,500 range.\n\nRipple price is due for a big move after bouncing from $0.4600 support and breaking a major trendline.\n\nBitcoin (BTC) price has reclaimed support above $26,000 and is now eyeing a breakout past $27,000. This could exit a multi-week range. The risk signal's nose-diving into the 60 range indicates there is a change in attitude. As such, it is likely that profit-taking pressure could present around $27,400 and $28,000. However, this climb seems poised as a step before tackling the psychological barrier at $30,000. If it manifests, the Ethereum (ETH) price could follow.\n\nAlso Read: Bitcoin open interest outperformed crypto markets amid BTC Spot ETF hype\n\nBitcoin price could fall before next move north\n\nBitcoin (BTC) price is trading with a bullish bias, but much remains in the balance considering there is currently no bullish fundamental to fuel a surge. Also, September has proven to be a bad month for BTC, thereby increasing the odds for a slump.\n\nAs Bitcoin price confronts the resistance presented by the downtrend line at $26,640, the odds of a pullback continue to increase as momentum fades. The falling Relative Strength Index (RSI) shows this, bolstered by the Stochastic RSI, which is at 94. This momentum indicator often moves very quickly from overbought to oversold or vice versa, and judging by its position, BTC is overbought.\n\nAccordingly, Bitcoin price could drop to the demand zone at around the $26,000 psychological level. In the dire case, the slump could see BTC breach the lower boundary of the demand zone at $24,843. The downtrend would be confirmed by a strong move under the last lower high of September 12 at $25,131.\n\nBTC/USDT 1-day chart\n\nConversely, increased buying momentum could see Bitcoin price breach the $26,640 resistance level, potentially going as far as the psychological $28,000 or higher, tagging the $29,020 roadblock. A strong move above this supplier congestion zone could clear the path into the $30,000 range.\n\nAlso Read: What to expect from Bitcoin price as $3.4 trillion stock options set to expire on Friday\n\nEthereum price could follow BTC 10% south\n\nEthereum (ETH) price found support at $1,552, bouncing 5% north to the current price of $1,619, and confronting resistance presented by the downtrend line at $1,624. Momentum is also waning for ETH, visible through the falling RSI. Aslump seems likely, and the Proof-of-Stake (PoS) token could drop 5% to $1,552 or 10% to the $1,500 psychological level.\n\nNotice its Stochastic RSI at 96, with an almost perfect track record of falling once it gets to this level. Every fall of the Stochastic RSI is mirrored by the price, therefore adding credence to the bearish thesis.\n\nETH/USDT 1-day chart\n\nOn the other hand, Ethereum price could shatter the $1,624 barricade and extend into the $1,682 resistance level. A decisive breach of the August 31 high marked by the $1,700 psychological level could clear the path for a possible reclamation of $1,791, a critical multi-month support that flipped into a resistance during the August 17 crash. This would denote a 10% rise up the ladder.\n\nAlso Read: Ethereum celebrates first anniversary of ETH Merge with 99.9% drop in energy usage\n\nRipple price bounces and shatters, what next?\n\nRipple (XRP) price boasts four successive green bars since September 12 after escaping from the suppression of the descending parallel channel. While the move is solid, confirmation for the uptrend will only happen after XRP breaks through the supply zone at $0.5373.\n\nA sustained uptrend steered by increasing buying pressure could see Ripple extend to the August 16 high at $0.6098 or in a highly bullish case escalate to the $0.6858 roadblock, close to the ambitious $0.7000 psychological level. This would indicate a 30% climb above the confirmation level.\n\nThe RSI is pointing north, supporting this outlook as it means momentum continues to rise. Similarly, the Stochastic RSI has some ground to cover before reaching its range high of 100, where it has been rejected multiple times before. ETH could correct once the Stochastic RSI tags this level.\n\nXRP/USDT 1-day chart\n\nMeanwhile, the risk of pullback remains strong considering this RSI is below 50, showing momentum, and therefore, price strength, remains low. A retracement back into the foothold of the descending parallel channel at $0.4600 could see XRP value continue dropping, likely to the range low of $0.4191 marked by the channel’s midline, or in the dire case, the support floor at $0.3562.\n\nAlso Read: Ripple (XRP) trading analysis: Bearish sentiment persists, eyes on key support"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtYnVzZC1oaXN0b3JpYy1kb3JtYW50LW1vdmVtZW50LXNwYXJrcy1zcGVjdWxhdGlvbtIBUmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtYnVzZC1oaXN0b3JpYy1kb3JtYW50LW1vdmVtZW50LXNwYXJrcy1zcGVjdWxhdGlvbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH), BUSD Historic Dormant Movement Sparks Speculation - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a new tweet, on-chain analytics firm Santiment notes that the second largest cryptocurrency, Ethereum (ETH), and Binance USD (BUSD) stablecoin are seeing dormant coin movements.\n\nAdvertisement\n\nSantiment observes that Ethereum and BUSD have had historic dormant movements this week. This is because the average age at which both tokens have been sitting in wallets has become much younger after massive stagnation. In this regard, that of BUSD fell by 378 days, while that of Ethereum fell by 26 days.\n\n🤔 The average age in which #Ethereum and #BinanceCoin tokens have been sitting in wallets both became much younger after massive stagnation. Do you believe both coincide with the #FTX liquidations and sell-offs that began this week? https://t.co/RyFfUbMe22 pic.twitter.com/KfRZPtCZn1 — Santiment (@santimentfeed) September 15, 2023\n\nIt is speculated that this historic dormant movement might be related to the FTX-triggered liquidations and sell-offs that began earlier in the week.\n\nFTX, which currently controls over $3.4 billion in crypto assets, has been granted permission to sell its crypto holdings by a U.S. judge.\n\nFTX will be allowed to sell off in weekly batches, with a first-week restriction of $50 million and following weekly limits of $100 million. However, BTC and ETH can only be sold after giving the creditors' committee, ad hoc committee and the U.S. trustee a 10-day notice.\n\nThis aside, in recent weeks, Ethereum has seen dormant ICO-era whale wallets come to life. In the past week, a dormant pre-mine address that held 185 ETH worth $302,096 revived after 8.1 years.\n\nBinance moving to end support for BUSD\n\nAs part of its gradual move to end support for the BUSD stablecoin by 2024, crypto exchange Binance moved to burn several idle Binance-pegged tokens this week.\n\nOn Sept. 14, Binance set fire to idle Binance-pegged tokens, namely TUSDOLD (BSC), BUSD on the MATIC network, BUSD both on the BSC and BNB networks and BUSD on the TRX network.\n\nIn August, Binance announced it would gradually end support for BUSD, urging users to convert the token to other crypto assets by February next year. Paxos stopped issuing the stablecoin in February following a regulatory crackdown on the BUSD token."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMTgvZXRoZXItdHJhZGluZy1hdC0yNy1kaXNjb3VudC10by1mYWlyLXZhbHVlLW5ldy1yZXNlYXJjaC1zaG93cy_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzE4L2V0aGVyLXRyYWRpbmctYXQtMjctZGlzY291bnQtdG8tZmFpci12YWx1ZS1uZXctcmVzZWFyY2gtc2hvd3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ether Trading at 27% Discount to Fair Value, New Research Shows - CoinDesk",
        "content": "Per the Metcalfe law (ML), the value of the network is directly linked and proportional to the square of the number of users it has. Ether enables users to transact on the Ethereum blockchain, earn interest, and participate in network security through staking, store non-fungible tokens and much more. Thus, ether's value proposition has long been closely tied to Ethereum's network usage."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xNi90ZXRoZXItdXNkdC1tb3ZlbWVudC1zaWduYWxzLWZ1dHVyZS1idXktaW50ZXJlc3QtYXMtYml0Y29pbi1hbmQtZXRoZXJldW0tc3VwcGx5LW9uLWV4Y2hhbmdlcy1kaXBzLXNhbnRpbWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Tether (USDT) Movement Signals ‘Future Buy Interest’ As Bitcoin and Ethereum Supply on Exchanges Dips: Santiment - The Daily Hodl",
        "content": "Troves of the top stablecoin USDT are moving back onto crypto exchanges, a potentially bullish indicator, according to the crypto analytics firm Santiment.\n\nSantiment notes 24.1% of USDT’s total supply now sits on exchanges, the highest level since March.\n\nThe analytics firm also notes that Bitcoin (BTC) and Ethereum’s (ETH) supply on exchanges has resumed going down, indicating traders are comfortable in HODLing the top two crypto assets.\n\nSantiment calls those two trends “a golden combination” which the firm says indicates “more future buy interest.”\n\nAdditionally, the analytics firm says Bitcoin has been witnessing its highest level of unique address activity since April, with an average of 1.1 million BTC addresses sending and receiving the asset per day.\n\nHowever, Santiment says that traders are seeing the recent Bitcoin rally as an opportunity to unload their BTC holdings at a small profit.\n\nSantiment is also keeping a close watch on the issue that defunct crypto exchange FTX may start selling its massive crypto holdings. According to the analytics firm, dormant Ethereum and Binance Coin (BNB) suddenly moved this week just amid news about FTX’s possible liquidation.\n\n“The average age in which Ethereum and Binance Coin tokens have been sitting in wallets both became much younger after massive stagnation. Do you believe both coincide with the FTX liquidations and sell-offs that began this week?”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tZGV2cy10by1yZWJvb3QtaG9sZXNreS10ZXN0bmV0LWFmdGVyLWJvdGNoZWQtbGF1bmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Ethereum devs to reboot Holesky testnet after botched launch - crypto.news",
        "content": "The Holesky testnet meant to celebrate Ethereum’s one-year anniversary of The Merge will be rebooted after configuration errors caused a network crash.\n\nEthereum engineers plan to relaunch the Holesky public testnet following issues with the network’s initial deployment on Sep. 15.\n\nThe testnet, which developers released at 10 a.m. ET, encountered “major problems” due to network misconfigurations, according to Galaxy researcher Christine Kim. Devs said Holeksy would be launched again soon, but no definite date was mentioned.\n\nhttps://twitter.com/beaconcha_in/status/1702689589666717918\n\nHolesky was set to join Goerli and Sepolia as Ethereum’s third testnet. Testnets allow developers to simulate upgrades and run applications intended for the main network or mainnet. They are akin to dress rehearsals for blockchain builders to fix bugs and test deployments.\n\nTim Beiko, an Ethereum Foundation contributor, said developers allocated 1.6 billion testnet Ether (ETH) as Holesky’s genesis token supply. The massive testnet ETH pool is likely to incentivize use of the network.\n\nhttps://twitter.com/TimBeiko/status/1692287180306276546\n\nEthereum testnets\n\nRegarding Ethereum testnets, there has been talk of sunsetting Goerli in early 2024. This possible outcome could place Holesky at the epicenter of developer activity on Ethereum and even networks compatible with Ethereum Virtual Machine (EVM)\n\nFurthermore, developers launched Holesky on the one-year anniversary of The Merge, Ethereum’s switch from Proof of Work (PoW) to Proof of Stake (PoS).\n\nThe Merge marked a massive structural upgrade for Ethereum, including changes to network participant roles and token emissions.\n\nAccording to on-chain data dashboard ultrasound.money, Ethereum net token supply reduced by 0.24% or 299,922 ETH. This means that ETH’s supply is deflationary in terms of how many new tokens enter circulation annually.\n\nThe Merge also introduced staking on Ethereum, which is locking up ETH in a smart contract to earn rewards or qualify as a network validator among other incentives. Per Coinbase data, nearly 25% of ETH’s supply is staked. It amounts to over 20 million ETH tokens.\n\nEthereum boasts a $40 billion staking market with protocols like Lido Finance dominating the space.\n\nYou might also like: Ethereum sees second-highest on-chain activity in history\n\nFollow Us on Google News"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0tbWVyZ2UtaXMtb25lLWhlcmUtYXJlLXRoZS1oaWdobGlnaHRzLXNvLWZhci_SAVZodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtLW1lcmdlLWlzLW9uZS1oZXJlLWFyZS10aGUtaGlnaGxpZ2h0cy1zby1mYXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Merge Is One: Here Are The Highlights So Far - NewsBTC",
        "content": "It has been a year since the Merge took place, and as expected, the world’s second largest cryptocurrency, Ethereum, has experienced many changes since then. What are some of them? Let’s take a look.\n\nOne Year In: How Has Ethereum Changed?\n\nAccording to a prominent figure in the Ethereum community, Sassal, 980,000 ETH have been burned since Ethereum transitioned from a proof-of-work (PoW) consensus to proof-of-stake (PoS).\n\nAhead of the Merge, Ethereum had implemented a significant upgrade known as the London hard fork. This introduced a fee-burning mechanism with transaction base fees being burned immediately after a transaction is processed.\n\nThis move was geared towards making Ether deflationary, considering that some tokens are removed permanently from circulation. Ethereum supply is down by 0.25% since the Merge took place.\n\nFurthermore, the Merge resulted in the network being secured by validators who stake their ETH as against Miners, who were the backbone of the network under the PoW consensus. In line with this, over 11.6 million ETH (since the Merge) has been staked to secure the network and also earn passive income in return.\n\nETH market cap at $196 billion on the weekend chart: TradingView.com\n\nThe top stakers include the staking platform Lido DAO which has a market share of 22.64%, according to data from Dune Analytics. Other top stakers include exchanges like Coinbase, Binance, and Kraken.\n\nMeanwhile, the number of validators on the network has significantly increased since the Merge, with 362,000 new validators joining the network.\n\nDown In Valuation But Not Value\n\nEthereum’s price has increased by close to 11% from a year ago. However, many may consider this insignificant for a token that hit an all-time high of $4,891 the previous year. Nevertheless, there are positives to take from the Merge, as Ethereum has undoubtedly become more valuable since it occurred despite the current bear market woes.\n\nA crypto analyst noted that ETH’s annual inflation rate has decreased since the Merge, and trading activity on Ethereum’s layer-2 chains has also increased significantly. That would suggest that more people are being onboarded into the Ethereum ecosystem.\n\nAccording to him, Ethereum’s fundamentals are also at an all-time high, as there are factors that show that the ecosystem is stable and healthy. One of them happens to be the fact that traditional financial (TradFi) institutions are taking an interest in ETH.\n\nCathie Wood’s ARK Invest recently filed to offer an Ethereum Spot ETF (a first of its kind). This is alongside other institutions that have filed to offer an Ethereum futures ETF (of which ARK Invest happens to be among them).\n\nFeatured image from WAYA Media\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9kaWQtZXRoZXJldW0tYWNjb21wbGlzaC1pdHMtb2JqZWN0aXZlcy1vbmUteWVhci1pbnRvLXRoZS1tZXJnZS_SAVlodHRwczovL2FtYmNyeXB0by5jb20vZGlkLWV0aGVyZXVtLWFjY29tcGxpc2gtaXRzLW9iamVjdGl2ZXMtb25lLXllYXItaW50by10aGUtbWVyZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Did Ethereum accomplish its objectives, one year into the Merge? - AMBCrypto News",
        "content": "Ethereum’s annual carbon footprint declined significantly since The Merge.\n\nEthereum became deflationary, but there was yet to be a big impact on ETH’s value.\n\nEthereum [ETH] maximalists and much of the crypto industry celebrated the one-year anniversary of The Merge, which marked a historic shift from the proof-of-work (PoW) consensus mechanism to the proof-of-stake (PoS).\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nA greener Ethereum\n\nIntended to cut down the exponentially increasing power consumption and build an environment-friendly image for the blockchain, the results have been nothing short of astounding.\n\nAs per data from Cambridge Bitcoin Electricity Consumption Index (CBECI), Ethereum’s annual electricity usage was 0.00731 terawatt-hours (TWh) at the time of publication, a staggering 99.9% drop since the Merge. For context, this was less than Bitcoin [BTC], whose annual consumption stood at 120.31 TWh.\n\nMoreover, Ethereum now draws less power than payment company PayPal and online steaming giant Netflix.\n\nConsequently, Ethereum’s annual carbon footprints have also reduced, falling by more than 99% to 2,659 tons of CO2, according to data by Crypto Carbon Ratings Institute.\n\nThe Merge was a watershed event in the brief history of Ethereum. Under the new PoS model, staked ETH, rather than expensive hardware, secures the network and validates transactions.\n\nBy eliminating the power-guzzling devices from the scope, which competed with each other to solve complex cryptographic problems, Ethereum seemed to have made a decisive shift to sustainability and scalability.\n\nIn the long run, it could boost Ethereum growth because investors will no longer have to cope with the stigma surrounding investments in non-eco-friendly technologies.\n\nEthereum goes into deflation\n\nWhile Ethereum clearly improved its green credentials, there was more to celebrate as far as the long-term economic outlook was concerned.\n\nAccording to ultrasound.money, the Ethereum network experienced deflation following the Merge, with a net supply reduction of roughly 300,000 ETH as of this writing. At the prevailing burn rates, the net supply was shrinking at an annual rate of 0.248%.\n\nThe significance of the Merge could be gauged by the fact that had the transition not taken place, ETH’s total supply would have increased by more than 3.8 million with an annual inflation rate of 3.16%.\n\nBefore transitioning to the PoS, miners guarding the Ethereum network were issued approximately 13,000 ETH/day, according to Ethereum.org. This was because the process of mining was an economically intensive activity, which historically required high levels of ETH issuance to sustain.\n\nHowever, after switching to the PoS, mining became redundant and only staking remained a valid means of block production. Furthermore, with the PoS mechanism, a set amount of ETH is burned for each transaction. This corresponds to the minimum amount required for a transaction to be considered valid, i.e. base fee.\n\nThe long-term projections painted a happy picture for ETH. The supply will reportedly hover around the 120 million mark until August 2024. After this, the supply would steadily start declining until an equilibrium is attained.\n\nStaking interest at its peak\n\nWhile the Merge was a game changer, some key aspects of the PoS transition had to wait until the completion of the Shapella upgrade. Foremost among them was the right granted to stakers to unlock their holdings at will.\n\nWith more freedom and renewed confidence in staking activity, more and more users came forward to lock their holdings in pursuit of rewards. As per the latest update by Glassnode, the total staked supply hit a fresh peak of 29.06 million. This represented a growth of 58% since the day of Shapella execution.\n\n? #Ethereum $ETH Total Value in the ETH 2.0 Deposit Contract just reached an ATH of 29,060,084 ETH View metric:https://t.co/SzbMPqvhlb pic.twitter.com/1LZvcNI1RO — glassnode alerts (@glassnodealerts) September 15, 2023\n\nThe increased interest in staking augured well for the security of the network.\n\nSome concerns linger\n\nAmidst the optimism and bullish sentiment, it was also necessary to examine the misses. Matt Cutler, CEO & Co-Founder of blockchain infra provider Blocknative, pointed out a few concerns around decentralization of Ethereum’s core infrastructure.\n\n“In the last 14 days, ~75% of the blocks on the Ethereum network were built by just three block builders – two of which widely recognized as vertically integrated Searcher/Builders). This seems less decentralized than the ecosystem aspires to be.”\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nFurthermore, if one looked at ETH’s price trajectory since the Merge, there has only been an 11% increase in value, according to data from CoinMarketCap.\n\nThis implied that, contrary to common perception, major technological improvements still do not put significant upward pressure on cryptos. The market continues to be driven by sentiment around the asset, rather than its fundamentals."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vYmxvZy5iaXRmaW5leC5jb20vbWVkaWEtcmVsZWFzZXMvYml0ZmluZXgtdW52ZWlscy1zdXBwb3J0LWZvci1mb3JrZWQtZXRoZXJldW0tcHJvb2Ytb2Ytd29yay1ldGh3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Bitfinex Unveils Support for Forked Ethereum Proof-of-Work (ETHW) - Bitfinex blog - Bitfinex",
        "content": "Bitfinex Unveils Support for Forked Ethereum Proof-of-Work (ETHW)\n\nROAD TOWN, British Virgin Islands, September 16 2022 – Bitfinex, a state-of-the-art digital token trading platform, will support the Ethereum Proof-of-Work fork as the exchange provides its user base with an optimal trading experience after the Merge.\n\nThe Ethereum Merge’s successful transition from proof of work to proof of stake, which took place this week, represents a monumental milestone in the evolution of the digital token economy. The Merge has also resulted in a forked, Proof-of-Work, Ethereum chain.\n\nETHW deposits and withdrawals are now open on Bitfinex after the token was listed on the platform on 15/09/22.\n\n“We are delighted to announce our support for Ethereum Proof-of-Work,” said Paolo Ardoino, CTO at Bitfinex. “As an exchange we always strive to provide our user base with a choice of digital tokens to trade and an optimal trading experience.”\n\nBitfinex customers with an Ethereum (ETH) balance in their account at the time of the Merge snapshot (Block 15537393) will have received forked Ethereum Proof-of-Work (ETHW) digital tokens.\n\nCustomers have been credited ETHW, and the ETHW:USD market will be open as of 15/09/22 at 9:15 PM UTC for trading. Deposits and withdrawals will commence for ETHW in the coming days. We shall update you accordingly.\n\nFinanced positions\n\nAs explained in a previous post, the following scenarios will apply for users who engage in peer-to-peer financing activities using ETH on the Bitfinex platform.\n\nCustomers with Margin short ETH positions will be debited an equivalent amount of the forked token from their margin wallet.\n\nCustomers with Margin long ETH positions will be credited an equivalent amount of the forked token to their margin wallet.\n\nCustomers who are lending their ETH will be credited an equivalent amount of the forked token to their wallet balance\n\n\n\nCustomers will have until October 15 2022 to settle their negative balances. A failure to timely settle negative balances may result in Bitfinex settling those balances at the prevailing market rates, as determined by Bitfinex in its sole discretion.\n\nYou can find more information relating to EthereumPoW at https://ethereumpow.org.\n\n*All users of www.bitfinex.com are subject to Bitfinex’s terms of service [Link to the TOS] (“TOS”). Please note that U.S. persons (as defined in the TOS), among other prohibited persons (as defined in the TOS), are strictly prohibited from directly or indirectly holding, owning or operating an Account (as defined in the TOS) on www.bitfinex.com.\n\n###\n\nAbout Bitfinex\n\nFounded in 2012, Bitfinex is a digital token trading platform offering state-of-the-art services for traders and global liquidity providers. In addition to a suite of advanced trading features and charting tools, Bitfinex provides access to peer-to-peer financing, an OTC market and margin trading for a wide selection of digital tokens. Bitfinex’s strategy focuses on providing unparalleled support, tools, and innovation for experienced traders and liquidity providers around the world. Visit www.bitfinex.com to learn more.\n\nMedia Contact for Bitfinex\n\nJoe Morgan\n\nSenior PR Manager\n\n[email protected]"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWRldmVsb3BlcnMtZGVidXQtbmV3LXRlc3RuZXQtaG9sZXNreS1vbi10aGUtbWVyZ2UtYW5uaXZlcnNhcnkv0gFgaHR0cHM6Ly96eWNyeXB0by5jb20vZXRoZXJldW0tZGV2ZWxvcGVycy1kZWJ1dC1uZXctdGVzdG5ldC1ob2xlc2t5LW9uLXRoZS1tZXJnZS1hbm5pdmVyc2FyeS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Developers Debut New Testnet Holesky On The ‘Merge’ Anniversary - ZyCrypto",
        "content": "Advertisement\n\nThe Ethereum blockchain has ushered in a new testnet called Holesky, one year after its monumental transition to a proof-of-stake consensus algorithm.\n\nThe newly launched test network, initially referred to as Holli, aims to enhance the main Ethereum network’s testing capabilities by making it twice as large.\n\nEnter, Holesky\n\nEthereum core developers on September 15 launched the Holesky test network.\n\nInitial blocks proposed on Holesky were seen today through a blockchain explorer created to monitor the new test net on beaconcha.in.\n\nTest networks are like duplicates of the original Ethereum blockchain, but developers use them for testing new applications and fixing bugs without influencing the mainnet.\n\nAdvertisement\n\nThe rollout of Holesky coincides with the first anniversary of the Ethereum Merge event. The Merge was executed on September 15, 2022 — an event that saw the Ethereum mainnet merging with the Beacon Chain. With the historic upgrade, Ethereum made a switch from its original proof-of-work mining system to a more energy-efficient proof-of-stake model.\n\nEthereum’s ecosystem presently has two main test networks: Goerli and Sepolia. However, now that Holesky introduced, Ethereum will wave goodbye to Goerli, in the first half of 2024. Holesky will then become Ethereum’s largest existing test net with at least 1.4 million validators, compared to the mainnet’s 700,000.\n\nOne of the distinguishing characteristics of Holesky is the envisioned provision of roughly 1.6 billion test network ether. Developers decided not to lower that figure to correspond to the Ethereum mainnet’s 120 million ETH supply. This significant supply is intended to fix obstacles developers encounter when procuring testnet ETH on the primary testnets. The huge amount of testnet ether will give Ethereum’s developer community easier access to testing smart contracts on Holesky.\n\nETH Price Unmoved\n\nThe price of the second-largest cryptocurrency by market cap, ether, remained relatively unstirred by the Holesky launch news.\n\nETH was currently trading just above $1,636, down slightly less than a percentage point over the past 24 hours. Bitcoin has behaved similarly, shedding 1.1% of its value during the same timeframe to change hands at $26,583.72."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ib3VuY2UtdG8tMmstb3ItbW9yZS1wYWluLWZvci1ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMv0gFXaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2JvdW5jZS10by0yay1vci1tb3JlLXBhaW4tZm9yLWV0aGVyZXVtLWV0aC1wcmljZS1hbmFseXNpcy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Bounce to $2K or More Pain for Ethereum? (ETH Price Analysis) - CryptoPotato",
        "content": "After facing rejection for several weeks and experiencing a series of bearish developments, the price of Ethereum reached a critical point near a pivotal support area. This includes the 61.8% Fibonacci retracement level.\n\nFortunately, the price returned from this crucial zone, providing hope amidst the prevailing bearish sentiment. This rebound also indicates the possibility of a temporary consolidation phase.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nEthereum’s price has been in a prolonged downtrend, breaking multiple support levels, including the crucial 100 and 200-day moving averages. As a result, Ethereum reached a multi-month low at $1,531. However, at this point, Ethereum’s price encountered a critical support zone, spanning the range between the 50% and 61.8% Fibonacci retracement levels.\n\nDespite this, market participants see this range as the final defense for Ethereum bulls. If the price drops below this threshold, it could increase the likelihood of a significant downward plunge.\n\nIn addition to these bearish signals, the 100-day moving average crossed below the 200-day moving average, forming a death cross event, which is a strong bearish signal. However, despite these bearish indicators, there is still hope that the price could find support and enter a consolidation phase, moving around the 200-day and 100-day moving averages.\n\nThe 4-Hour Chart\n\nShifting our focus to the 4-hour timeframe, we can see that Ethereum’s price underwent a consolidation phase between the $1.6K-$1.8K price range. During this period, a bearish flag pattern formed, and eventually, the price broke below the lower trendline of the flag, triggering a significant downward movement.\n\nHowever, as Ethereum approached the critical support level at $1.5K, buying pressure intensified, leading to a rebound. This resulted in a retracement towards the lower threshold of the broken flag, potentially forming a pullback. If this pullback occurs successfully, it could indicate the start of another downward phase, aiming to break below the $1.5K mark.\n\nOn the other hand, if the price fails to complete the pullback and instead breaks above the trendline, market participants may anticipate a surge toward the $1.7K resistance level. Therefore, it is crucial to closely monitor these price fluctuations, as the upcoming price action around these significant support and resistance levels will likely determine Ethereum’s mid-term trajectory.\n\nOn-chain Analysis\n\nBy Shayan\n\nThe provided chart displays the Taker Buy Sell Ratio metric, complemented by a 30-day simple moving average, alongside Ethereum’s price. This metric helps assess whether buyers or sellers are aggressively executing their orders. Positive values typically indicate bullish sentiment, while negative values are bearish indicators.\n\nHowever, Ethereum’s price has been on a downtrend recently, repeatedly facing rejection around the $2,000 resistance level. The metric has consistently remained negative for the past few months, reflecting a prevailing bearish sentiment in the ETH futures market.\n\nNevertheless, there has been a notable shift in this metric as it suddenly surged, bringing its value closer to the neutral 0 line. This surge suggests a potential change in sentiment among market participants, indicating a shift towards a more bullish stance.\n\nIf this metric continues its upward trajectory and enters positive territory, it could signal the beginning of a new phase characterized by bullish price action. In such a scenario, Ethereum’s price may experience an upsurge, potentially targeting higher resistance levels."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS9zb2xhbmFzLTEtbmZ0LW1hcmtldHBsYWNlLWJlYXRzLXdob2xlLW5mdC1pbmR1c3RyeS1vbi1ldGhlcmV1bdIBUmh0dHBzOi8vdS50b2RheS9zb2xhbmFzLTEtbmZ0LW1hcmtldHBsYWNlLWJlYXRzLXdob2xlLW5mdC1pbmR1c3RyeS1vbi1ldGhlcmV1bT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Solana's #1 NFT Marketplace Beats Whole NFT Industry on Ethereum - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSolana's leading NFT marketplace is making waves, boasting nearly as many daily traders as all Ethereum-based NFT platforms combined. This is not just a fluke; it is a testament to the unique synergy between Solana's user-friendly, cost-effective blockchain and the ever-popular world of NFTs.\n\nAdvertisement\n\nWhy is this a big deal? Solana's blockchain is not just fast; it is also incredibly accessible. Combine that with NFTs, which have a universal appeal, and you've got a recipe for mass adoption. While Ethereum's NFT marketplaces are still performing well, the sheer volume of activity on Solana's top NFT platform should make anyone sit up and take notice.\n\nNow, let's talk numbers. Solana's current total value locked (TVL) stands at approximately $306.8 million, according to DefiLlama. This robust DeFi landscape adds another layer of allure to Solana's NFT marketplace, making it a one-stop-shop for all things crypto.\n\nAs for Solana's price performance, the latest data shows that one SOL is valued at around $18. While this might not be its all-time high, the coin has shown resilience and potential for growth, especially considering the anti-FUD measures Solana influencers are taking in order to battle the effect of the upcoming FTX liquidation.\n\nBut let's not get carried away. Ethereum has its strengths, and its NFT marketplaces are far from obsolete. However, the rapid rise of Solana's NFT platform is a wake-up call. It is a vivid reminder that the crypto space is ever-evolving, and what's hot today might not be tomorrow.\n\nSo, what is the takeaway? Solana and its NFT marketplace are a force to be reckoned with. They have tapped into a formula that combines speed, low costs and mass appeal. And while Ethereum will continue to be a major player in the NFT scene, it might just have to share the spotlight with Solana for a while."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMi0wFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLXNlcHRlbWJlci0xNy1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNjMwMTQw0gHXAWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktaW4taW5kaWEtc2VwdGVtYmVyLTE3LWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE2MzAxNDAvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Sees Losses As Toncoin Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to remain above the $26,000 and $16,000 marks, respectively, on early Sunday morning. However, in terms of percentage-wise performance, BTC saw a loss of 0.25 per cent. Other popular altcoins — including the likes of Litecoin (LTC), Ripple (XRP) — landed in the negative as overall prices saw minor losses across the board. Toncoin (TON) emerged to be the biggest gainer, seeing a 24-hour jump of over 2.38 per cent. VeChain (VET), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.06 trillion, registering a 24-hour loss of 0.43 per cent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $26,532.19 seeing a 24-hour loss of 0.25 per cent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 22 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,628.74, marking a 24-hour loss of 0.75 per cent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.39 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour loss of 0.65 per cent as per CoinMarketCap data, currently priced at $0.06204. As per WazirX, Dogecoin price in India stood at Rs 5.3001.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 3.43 per cent. At the time of writing, it was trading at $63.93. LTC price in India stood at Rs 5,543.40.\n\nRipple (XRP) price today\n\nXRP price stood at $0.4969, seeing a 24-hour loss of 0.80 per cent. As per WazirX, Ripple price stood at Rs 42.7889.\n\nSolana (SOL) price today\n\nSolana price stood at $18.98, marking a 24-hour loss of 1.78 per cent. As per WazirX, SOL price in India stood at Rs 1,663.33.\n\nTop crypto gainers today (September 17)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nToncoin (TON)\n\nPrice: $2.38\n\n24-hour gain: 12.43 per cent\n\nMultiverseX (EGLD)\n\nPrice: $25.85\n\n24-hour gain: 3.41 per cent\n\nConflux (CFX)\n\nPrice: $0.1231\n\n24-hour gain: 2.47 per cent\n\nImmutable (IMX)\n\nPrice: $0.5333\n\n24-hour gain: 2.18 per cent\n\nRocket Pool (RPL)\n\nPrice: $22.80\n\n24-hour gain: 1.72 per cent\n\nTop crypto losers today (September 17)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nVeChain (VET)\n\nPrice: $0.01732\n\n24-hour loss: 5.88 per cent\n\nCompound (COMP)\n\nPrice: $39.05\n\n24-hour loss: 5.47 per cent\n\nOptimism (OP)\n\nPrice: $1.37\n\n24-hour loss: 3.92 per cent\n\nFilecoin (FIL)\n\nPrice: $3.29\n\n24-hour loss: 3.60 per cent\n\nAxie Infinity (AXS)\n\nPrice: $4.63\n\n24-hour loss: 3.47 per cent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbmN1bHR1cmUuY29tL2F1L2ZvcmVjYXN0L2V0aGVyZXVtLWNsYXNzaWMtZXRjLXByaWNlLXByZWRpY3Rpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Classic (ETC) Price Predictions 2023-2030 - Coin Culture",
        "content": "Ethereum (ETH) is one of the leading cryptocurrencies besides Bitcoin (BTC). Yet, another iteration of Ethereum asserts its authenticity, namely Ethereum Classic (ETC). Ethereum Classic remained loyal to the original blockchain following a hard fork triggered by network breaches in 2016. This article delves into Ethereum Classic (ETC) and Ethereum Classic (ETC) price predictions for 2023-2030.\n\nWhat is Ethereum Classic (ETC)?\n\nEthereum Classic (ETC) emerged in 2016 as a cryptocurrency through a hard fork, a permanent split, originating from Ethereum (ETH). Like the Ethereum network, the Ethereum Classic blockchain can support smart contracts and decentralised applications, and it upholds its distinct Ethereum Classic tokens.\n\nThe fork from Ethereum to Ethereum Classic was prompted by a significant hacking incident, an uncommon yet not unprecedented occurrence in crypto blockchains. This breach resulted in the loss of 3.6 million Ethereum tokens. The primary Ethereum blockchain responded by implementing updates to rectify the erroneous transactions. However, a segment of the original Ethereum community disagreed with this approach, leading to the creation of Ethereum Classic. It was built using the unmodified Ethereum ledger, which included the transactions from the hack.\n\nEthereum Classic stands apart because it preserves the original Ethereum blockchain. It employs the proof-of-work protocol to validate transactions, demanding substantial computational resources for ETC mining. While Ethereum Classic and Ethereum currently use the proof-of-work method, Ethereum is concurrently transitioning to a different consensus mechanism known as proof of stake.\n\nEthereum Classic’s native token is also named Ether, which can create confusion. However, their distinction lies in their ticker symbols: the new Ether is denoted as ETH, while Ethereum Classic’s token is represented as ETC. ETC has a circulating supply of 143,002,842 tokens, with a maximum supply of 230,000,000. Miners can earn ETC tokens by upholding and securing the network’s operations.\n\nEthereum Classic (ETC) Price History\n\nNow, let’s take a closer look at the price history of ETC. Note that while past performance should not be relied upon as an indicator of future outcomes, understanding the coin’s historical trends provides valuable context for making or interpreting Ethereum Classic price predictions.\n\nETC initially traded at $2.08 when the blockchain split in July 2016. Subsequently, its price declined to a low of $0.75 in November 2016. But it then embarked on a significant rally, reaching $46 by December 2017. After this surge, the price experienced a downturn, falling to $3.76 by December 2018.\n\nIn February 2020, ETC saw a resurgence, reaching $12.34, its highest level since 2018. The price dipped to $4.51 in March 2020 due to market anxiety related to the COVID-19 pandemic. Throughout the rest of the year, ETC traded within a range of $4 to $6.\n\nThe beginning of 2021 marked a favourable period for the crypto market, and ETC capitalised on increased participation. It achieved an all-time high of $176.16 on May 6, 2021, followed by a sharp decline during the market crash. ETC hit a low of $32.51 on June 22.\n\nOn August 15, 2021, Ethereum Classic reached $76.94, its highest level since the May decline. It reached $77.07 on September 6 but subsequently retreated, closing the year at $34.12.\n\nIn 2022, the crypto market faced various challenges, impacting ETC’s performance. It hovered around the $30 mark in January but rebounded to $52.17 in March. Subsequent market crashes led to a low of $12.60 on June 18. ETC then stabilised between $20 and $30 for several months. The collapse of the FTX exchange caused another market crash, with ETC reaching a low of $14.89 on December 19.\n\nBy year-end, it had recovered to $15.69, representing an annual decline of nearly 55%. Despite the losses, ETC outperformed the broader crypto market, which experienced a roughly 65% drop in 2022.\n\nSo far in 2023, the crypto market has seen some positive momentum, ETC has witnessed a price increase. Its peak occurred on February 4, with a high of $24.79. A subsequent decline, exacerbated by the Silvergate Bank’s collapse, caused ETC to drop to $16.25 on March 10. The crypto recovered partly due to growing interest in ETH driven by a new hard fork. As of April 13, Ethereum Classic was valued at approximately $22.55.\n\nDuring this period, just over 140.4 million ETC were in circulation out of a total supply of 210.7 billion. This gave the coin a market capitalisation of approximately $3.1 billion, ranking it the 23rd largest cryptocurrency by market cap.\n\nEthereum Classic Price Forecasts by Experts\n\nBefore delving into Ethereum Classic price predictions, note that price forecasts, especially for the inherently volatile cryptocurrency market, often prove inaccurate. Long-term crypto price predictions typically rely on algorithms that can swiftly change.\n\nCoincodex presents an optimistic short-term outlook for Ethereum Classic’s price, projecting a rise to $16.29 by September 9, 2023, marking a potential 6.48% increase from its current value. Their analysis is rooted in technical indicators, reflecting a bearish sentiment alongside a Fear & Greed index standing at 40. Coincodex’s projections suggest a substantial price surge to $36.25 in 2024. However, subsequent years may bring corrections, leading to a market price of $23.99 in 2025, followed by $16.83 in 2030, and a long-term estimate of $13.69 by 2040.\n\nRead more: CAKE Price Predictions 2023-2050: Is CAKE Token Worth Buying?\n\nWallet Investor adopts a pessimistic perspective on Ethereum Classic (ETC) as a long-term investment. According to their projections, ETC’s price could drop to $1.430 by 2024, indicating a substantial decline of approximately 90.69%.\n\nDigitalCoinPrice offers a bullish Ethereum Classic price forecast, envisioning ETC’s value reaching $33.69 by the end of 2023, representing a significant 119.19% surge from its current valuation. Their prediction is grounded in a comprehensive analysis of market dynamics and technical metrics, all pointing towards robust bullish tendencies for ETC. Digitalcoin Price further indicates that this bullish trajectory may persist over the long term, with maximum price targets of $69.93 in 2026, $115.05 in 2029, and an impressive $208.60 in 2032.\n\nGov Capital’s ETC price prediction places the coin’s price at approximately $52.95 on April 13th of the following year, with a subsequent rise to $225.01 in five years.\n\nForex Trading on YouTube highlights a crucial weekly support range for Ethereum Classic, with a lower boundary around $11.50 and an upper boundary near $14.50. The trader suggests that a breach of this support area could lead to a significant decline, potentially down to $8.\n\nEthereum Classic (ETC) Price Predictions 2023-2030\n\nThough Ethereum Classic price prediction had to make a tremendous effort to fork out of its origin and compete long and hard with its rival cryptocurrencies, it was not long before it would outperform during the last year. According to the technical analysis, most of Ethereum Classic’s competitors did not mesmerise the traders either. Let us check the data for the Ethereum Classic price forecast from 2023 to 2030.\n\nEthereum Classic Price Prediction 2023\n\nAccording to the ETC price prediction for 2023, Ethereum Classic’s price might exceed $30. By the end of the year, Ethereum Classic is expected to reach a minimum price level of $18.18. And the ETC coin can get a maximum level of $44.16.\n\nEthereum Classic Price Forecast 2024\n\nStating that a jaw-dropping possibility does not exist and that bulls will ride the crypto market, it is once again expected that the ETC coin will rule the crypto industry with an average price pegged around $44.67. This shows Ethereum Classic has the full potential to sustain and consistently grow even in adverse conditions.\n\nEthereum Classic Price Prediction 2025\n\n2025 might mark the benchmark year as the ETC price is predicted to surpass $50 by all means. Based on the ETC price prediction for 2025, the coin is estimated to reach the minimum price of $46.64 and the maximum price of $67.14 by the end of 2025.\n\nETC Token Price Prediction 2026\n\nAccording to the ETC price prediction 2026, the currency will remain bullish. Moreover, future innovations and integration might affect positive trends in the overall growth of the ETC ecosystem. By 2026, the price of the Ethereum Classic forecast may hit the max price of $85.83. On the other hand, based on Ethereum Classic predictions, it may correct towards $59.62.\n\nEthereum Classic Predictions 2027\n\nEthereum Classic might continue to trade across $90 over 2027 as per the Ethereum Classic price predictions. By the end of the year, the price of ETC is predicted to reach a minimum price level of $76.29. On the upside, the ETC coin might hit the maximum price level of $109.82.\n\nRead more: ONE Price Predictions 2023-2030: Will Harmony Hit $1?\n\nETC Coin Price Prediction 2028\n\nAs per the ETC forecast 2028, Ethereum Classic might trade at around $110 during 2028. By the end of the year, the price of Ethereum Classic is estimated to reach a minimum price level of $97.83. And on the upside, the ETC coin might get the maximum price level of $140.83.\n\nEthereum Classic Price Forecast 2029\n\nBased on ETC price prediction 2029, Ethereum Classic might hover around $150.90 during 2029. The price of Ethereum Classic might reach a minimum price level of $123.71. And on the positive side, the ETC price might reach the maximum level of $178.09.\n\nEthereum Classic Price Prediction 2030\n\nAccording to our Ethereum Classic price prediction 2030, the minimum price of ETC might achieve a significant height of $150 with an average price of Ethereum of $183.38. The maximum price of Ethereum Classic will be around $216.43, which is much more than the current price level, by the end of the year.\n\nIs Ethereum Classic (ETC) a Good Investment?\n\nThe distinction is quite evident when comparing the Ethereum blockchain to the Ethereum Classic blockchain. Ethereum has outperformed Ethereum Classic regarding price performance in recent years. Its strong price performance has driven increased user adoption, prompting merchants and service providers to expand their accepted deposit methods to include Ethereum. Some price predictions even suggest that Ethereum may surpass Bitcoin in terms of usage in gaming deals. So, should you consider selling Ethereum Classic and acquiring Ethereum instead?\n\nOn the other hand, Ethereum Classic has faced challenges, particularly as the optimism surrounding Bitcoin’s potential rise to $100K has given way to concerns about stability around $40K. Previously, the growth of Bitcoin was expected to bring stability to other cryptocurrencies, including Ethereum Classic, but this scenario has not materialised. Hence, many coins, including Ethereum Classic, have experienced a sustained decline.\n\nDespite the ongoing market difficulties, there remains the possibility of a market resurgence. Buying during market dips may present an opportunity for Ethereum Classic investors. As Bitcoin continues to make gains, there is a chance that Ethereum Classic could also surpass the $50 mark. However, the rise of this cryptocurrency is contingent on a rally in the market and stability in its value.\n\nRead more: BTT Price Predictions 2023-2030: Is BitTorrent a Good Investment?\n\nEthereum Classic (ETC) Price FAQs\n\nIs Ethereum Classic superior to Ethereum?\n\nIt’s challenging to compare definitively as both have strengths and weaknesses. Ethereum Classic can support smart contracts and dApps. In contrast, Ethereum enjoys more excellent investor support, and its functionality is more robust on the newer ETC blockchain. Both are prominent cryptocurrencies in the crypto world. It’s akin to asking whether wine or whiskey is better!\n\nDoes Ethereum Classic have a future?\n\nIndeed, there is potential. Based on historical data and past bullish price trends, we anticipate a bright future. This is particularly true because Ethereum, a pioneer of Smart Contracts, can benefit Ethereum Classic’s price prediction through established systems and partnerships.\n\nCould Ethereum Classic (ETC) face failure?\n\nThe fate of Ethereum Classic largely depends on the future average price of the ETC token. It’s crucial to conduct your due diligence. Financial resources, security, miner interest, and team stability can impact its stability. Mass adoption and prevailing market sentiments significantly influence the project’s longevity.\n\nCan the ETC token reach $1000?\n\nNo, according to our prediction model, there is no foreseeable scenario where the Ethereum Classic (ETC) token hits $1000 in the future. While ETC’s price may experience notable upward movements, achieving such a substantial milestone appears unlikely based on available data and prevailing market conditions."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vdGhlY3J5cHRvY3VycmVuY3lwb3N0Lm5ldC9taW5lLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Sep 2023 07:00:00 GMT",
        "title": "How to Mine Ethereum (ETH) from Home - The Cryptocurrency Post",
        "content": "Ethereum relies on mining to increase its circulating supply of coins. The process involves participants, called miners, who use the Proof of Work (PoW) method to create a new block by finding solutions to complex mathematical problems. However, Ethereum 2.0 made the switch to Proof of Stake (PoS) in 2022. The miner who solves each problem first gets rewarded for generating the new block.\n\nThe process of creating new coins on the Ethereum network requires the validation of each block by other nodes. This ensures the security and integrity of the blockchain. You have two options for participating in this process: staking or pool mining. This guide will show you how to optimize your mining strategy for maximum profitability.\n\nWhat is Ethereum Mining?\n\nThe process of creating new blocks on the Ethereum network is done by miners, who receive a reward of 2 ETH plus gas for each block they produce. The average time between blocks is about 15 seconds, which ensures a fast and secure ledger update. Miners can also earn a bonus for validating transactions and maintaining the network’s security.\n\nA miner who finds a valid solution to a mathematical challenge announces it to the rest of the network. The network participants then validate the solution and reach a consensus. If the majority (more than 50%) of them accept the solution as correct, the block containing the solution is appended to the blockchain. The miners then move on to a new challenge, and the cycle repeats.\n\nWhy Ethereum Miners are Important\n\nAs we explained in the previous section, Ethereum mining is the process of validating transactions and securing the network. This is especially important to prevent a common issue in decentralized systems: double spending.\n\nDouble spending occurs when some actors exploit the network’s vulnerabilities to duplicate transactions. This undermines the trust and value of cryptocurrency. That’s why Ethereum mining is essential for the network’s health and stability.\n\nBlockchain technology uses a system of linked blocks that have unique identifiers (hashes) and timestamps. These blocks also reference the previous block’s timestamp and hash, making it impossible to alter the order or time of transactions.\n\nThe hashrate is a measure of the computing power of the Ethereum network. The more miners join the network, the higher its hashrate becomes. This enhances the network’s security, as more participants are needed to validate transactions and make important decisions regarding the network’s governance and maintenance.\n\nThe security and growth of the Ethereum network rely on the work of miners who create new blocks for its blockchain. Miners deserve to receive block rewards, incentives, and other benefits for their contribution.\n\nEthereum Mining Limitations\n\nETH has a predetermined supply schedule that adds two new coins to the circulation for every block created on the network. The supply is independent of the number of users, transactions, or market price.\n\nThis could lead to ETH becoming an inflationary currency if the supply exceeds the demand. However, the current low issuance rate of 2 ETH/block may reduce this possibility.\n\nThe amount of ETH that is created for each new block on the Ethereum network has been changing over time. In 2017, the block reward was 5 ETH, but in 2019, it was reduced to 3 ETH, and in 2023 it was further reduced to 2 ETH. This shows that the supply of ETH is not constant, but rather decreasing gradually.\n\nUnlike Bitcoin, which has a fixed number of coins, ETH has a yearly supply limit of 18 million ETH. This makes it similar to fiat currency, which can be issued by governments. However, this also means that ETH may face inflation if the supply does not match the global economic conditions.\n\nTo avoid this, ETH introduced a fee-burning mechanism in July 2021 that reduces the number of coins in circulation.\n\nEthereum made the from a Proof of Work (PoW) to a Proof of Stake (PoS), a consensus mechanism that is cheaper and greener.\n\nThis change will lower the annual inflation rate from around 5% to less than 1% starting in 2022. This means that the total supply of ETH will not increase much under the new system, which could boost the value of ETH as the mining difficulty rises.\n\nTypes Of Ethereum Mining\n\nPool Mining\n\nMining pools are groups of miners who share their computing power to mine Ethereum more efficiently. They have a higher chance of finding blocks and earning mining rewards (ETH) than solo miners. The pool members split the rewards according to their contributions.\n\nHow to Stake Ethereum\n\nEthereum staking is a process that allows users to earn rewards by locking up their ETH and validating transactions on the network. There are different ways to stake ETH, depending on the user’s preferences and capabilities. Some of these ways are more secure, decentralized, and profitable than others.\n\nSome of these ways also require more technical skills, hardware, and trust from the user. For users who prefer convenience and simplicity, some services let them stake ETH without running their own node or holding their own keys. One of these services is Coinbase, a popular exchange that has a staking program for Ethereum. Another option is Ledger, a hardware wallet that supports Ethereum staking.\n\nWhat You Need to Begin Staking\n\nStaking Ethereum (ETH) is a way to earn rewards and support the network at the same time. You have different options for staking ETH, depending on how much control and responsibility you want to have.\n\nOne option is to stake ETH by yourself, which means you need to set up your own staking node and run the software on your own hardware. This way, you don’t have to share any personal data with a third-party service provider.\n\nIf you don’t want to stake your coins by yourself, you can also choose to outsource the staking operation to a professional service provider, who will stake on your behalf and share the rewards with you. This is called staking-as-a-service (SAAS) or pooled staking, and it can save you the time and hassle of running your own node and securing your coins.\n\nThis way, you don’t have to worry about running your own node or hardware. However, you will usually need to create an account with the service provider, which may require you to provide personal information or have a minimum balance.\n\nConclusion\n\nOne of the benefits of the Ethereum network is its high level of security, which is achieved by using a PoS consensus mechanism that rewards validators for acting honestly and penalizes them for acting maliciously. However, staking also involves some risks, such as the potential of slashing or losing some of your staked ETH if you violate the protocol rules."
    }
]