[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXJvbGx1cHMtc2F2ZS1nYXMtZmVlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Rollups saved Ethereum users a boatload of gas fees: Report - Blockworks",
        "content": "Ethereum transaction fees would be five times more expensive if not for layer-2 rollup networks like Optimism and Arbitrum.\n\nThat’s according to a recent report from blockchain infrastructure unit Chainstack. Aside from fees between 360% and 419% higher, transactions themselves would take nearly twice as long on average, Chainstack found.\n\nWait times would even stretch to 114 seconds compared to a block time of about 12 seconds (the minimum wait time if transactions are sent between blocks).\n\nRollups are designed to solve the blockchain trilemma — a tradeoff layer-1 networks must make between security, scalability and decentralization. Blockchains can only offer two of those elements at any one time, says Ethereum co-founder Vitalik Buterin, who popularized the concept laid out in 2016.\n\nEthereum, for example, is built with security and decentralization in mind. But it’s not totally scalable — transaction fees generally rise alongside user activity and can grow exponentially at times of peak demand.\n\nWith rollups, Ethereum is able to offload some of the pressure. There are two popular rollup solutions today: Optimistic rollups and zero-knowledge (zk) rollups.\n\nOptimistic rollups, such as Arbitrum and Optimism, process transactions off-chain and then post the data of the transaction back onto Ethereum as “calldata.” ZK rollups, such as Polygon zkEVM and zkSync Era, post all data on-chain but use cryptography to validate whether transactions are accurate without revealing the information itself.\n\nUsage of rollups has grown considerably over the past two years, with Arbitrium and Optimism often together handling more daily transactions than Ethereum mainnet.\n\n“… it’s clear how roll-up transactions have gone from representing a minor fraction of the network’s activity in 2021 to playing a vital part in Ethereum’s functioning by 2023,” Chainstack wrote.\n\nThe report added that the growing number of transactions illustrated the crucial functioning of rollups to Ethereum’s overall network efficiency.\n\nAlthough, Ethereum gas fees (currently about $1 on average) have seen a constant uptrend between 2021 and 2023 despite the popularity of rollups. But Chainstack reasoned that L2 networks have still served as a necessary and useful counterbalance.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1jb3JyZWN0aW9uLTE5MzAv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLWNvcnJlY3Rpb24tMTkzMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Hints At Potential Correction, Buy The Dip? - NewsBTC",
        "content": "Ethereum price struggled above $2,100. ETH is now moving lower and might continue to drop toward the $1,930 support in the near term.\n\nEthereum is consolidating and facing resistance near the $2,060 zone.\n\nThe price is trading below $2,080 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $2,065 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to move down if it breaks the $2,035 support zone.\n\nEthereum Price Drops Again\n\nEthereum price attempted a fresh increase above the $2,080 resistance zone. ETH even spiked above the $2,120 resistance zone, like Bitcoin. However, the bears were active above $2,120.\n\nA high was formed near $2,132 before the price started a fresh decline. There was a move below the $2,080 level. A low is formed near $2,037 and the price is now consolidating losses. It is struggling below the 23.6% Fib retracement level of the recent decline from the $2,132 swing high to the $2,037 low.\n\nEthereum is now trading below $2,080 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,065 zone. There is also a key bearish trend line forming with resistance near $2,065 on the hourly chart of ETH/USD.\n\nThe first key resistance is near the $2,100 level or the 61.8% Fib retracement level of the recent decline from the $2,132 swing high to the $2,037 low. A clear move above the $2,100 level could send the price toward the $2,120 resistance zone.\n\nSource: ETHUSD on TradingView.com\n\nThe next resistance is near $2,135, above which the price could aim for a move toward the $2,200 level. Any more gains could start a wave toward the $2,250 level.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $2,080 resistance, it could start a fresh decline. Initial support on the downside is near the $2,035 level.\n\nThe next key support is $2,000. A downside break below $2,000 might send Ether toward the $1,930 support. The key support is now at $1,900, below which there is a risk of a move toward the $1,840 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $2,035\n\nMajor Resistance Level – $2,080\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9ldGhlcmV1bS1hdmVyYWdlLWdhcy1mZWVzLXRvdWNoZWQtaGlnaGVzdC1sZXZlbC1pbi1zaXgtbW9udGhzLWthaWtvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Average Gas Fees Touched Highest Level in Six Months: Kaiko - CoinDesk",
        "content": "The chart of the day is presented by crypto.com, the leading crypto platform trusted by over 80 million users worldwide. Today's chart of the day shows that defi activity might be picking up. That's according to a recent report by Blockchain Analytics firm. Ko. This chart shows the average gas fees on Ethereum hitting their highest levels in six months earlier in November as activity on the network increased. The Analytics platform says gas usage has been led by Unis swap where meet tokens like rock and surging tokens like RLB and link have registered significant volumes. Ko added that trading bots like banana gun which allow users to trade tokens with a relatively user friendly interface on the messaging platform has also consumed significant amounts of gas. While whale activity has also increased uni prices are seeing a bit of a jump today. Uni is at around $6.20 up almost 4%. That's it for today's chart of the day. I'm Jen Sani. We will see you next time to unpack more of the data behind top news stories."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvZXRoZXJldW0tcHJpY2Utc3RydWdnbGluZy1yZXNpc3RhbmNlLXJldmVyc2FsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Struggling At Its $2100 Resistance -- Reversal In Sight? - CCN.com",
        "content": "Key Takeaways\n\nETH has underperformed compared to the general market.\n\nIt’s still on a lower high compared to April’s high.\n\nA reversal is in sight, but this can be bullish in the long run.\n\nThe cryptocurrency market has been surrounded by bullish sentiment from the start of the year, and we saw triple-digit growth all across the space. Bitcoin paved the way, and many altcoins followed, later surpassing it, especially recently from September, making explosive and parabolic rises.\n\nMeanwhile, the price of the largest altcoin – Ethereum, has been underperforming compared to many cryptocurrencies. It, too, saw a price appreciation but only 84% since the start of the year. Unlike many that have made new yearly highs, it stayed within its previous, completed in April of $2,150, and now, in November, it came just shy of it.\n\nFrom November 9, when it came to $2,124, we saw a choppy price action lasting 18 days. As the price struggles at these levels, is this an indication of a looming reversal?\n\nETH Price Analysis\n\nThe price of Ethereum fell to $920 on June 18 last year. This was the completion of the downtrend from the all-time high of $4,852, resulting in 82% depreciation. A recovery started as it did across the whole cryptocurrency market, but unlike many cryptocurrencies, the price of ETH didn’t make a lower low.\n\nInstead, it was on a continuous incline, initially coming to $2,000 on August 14 and later making a slightly higher high to around $2,150 on April 16, 2023. Its support level was ascending; the horizontal resistance around $2,100 formed an ascending flat triangle.\n\nThe last rise from October 11 was made from this ascending support at $1,530, but the price still found resistance at the same horizontal area instead of making another higher high. The flat zone proved to be strong, but if this whole ascending triangle structure was the starting formation of the larger bull phase, can we see a breakout to the upside?\n\nETH Price Prediction\n\nLooking at the wave structure, there is a possibility that the whole ascending triangle is the starting impulse wave from the next bull phase for Ethereum’s price. This is known as the leading diagonal pattern in the Elliott Wave theory.\n\nIf this count is correct, the price increase ended for now on the last interaction with the horizontal resistance around the $2,100 area. In that case, we are ready to see a first bull market correction that will establish the first macro higher low.\n\nMeasuring with the Fibonacci retracement tool at its optimal level, we have a price target of $1,380. This corresponds to the horizontal support area, but the price can fall even further until this possibility is invalidated.\n\nAll in all, the price of Ethereum has most likely ended its last uptrend from mid-October and will now make a reversal. If this turns out to be the correction we are expecting, it would mark the completion of the first two bullish waves and indicate the start of a larger uptrend at the beginning of 2024.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1mYWxscy1hcy1yZWd1bGF0b3J5LXdvcnJpZXMtYW5kLXBhdXNlLWluLWRhcHAtdXNlLWltcGFjdC1pbnZlc3Rvci1zZW50aW1lbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum price falls as regulatory worries and pause in DApp use impact investor sentiment - Cointelegraph",
        "content": "Ether (ETH) is struggling to maintain the $2,000 support as of Nov. 27, following its third unsuccessful attempt in 15 days to surpass the $2,100 mark. This downturn in Ether’s performance comes as the broader cryptocurrency market sentiment deteriorates.\n\nIt’s possible that recent developments, such as the United States Department of Justice (DOJ) signaling potential severe repercussions for Binance founder Changpeng “CZ” Zhao, have contributed to the negative outlook.\n\nIn a filing on Nov. 22 to a Seattle federal court, U.S. prosecutors sought a review and reversal of a judge’s decision permitting CZ to return to the United Arab Emirates on a $175 million bond. The DOJ argues that Zhao poses an “unacceptable risk of flight and nonappearance” if allowed to leave the U.S. pending sentencing.\n\nEthereum DApps and DeFi face new challenges\n\nThe recent $46 million KyberSwap exploit on Nov. 23 has further dampened demand for decentralized finance (DeFi) applications on Ethereum. Despite being previously audited by security experts, including a couple in 2023, the incident has heightened concerns about the safety of the overall DeFi industry. Fortunately for investors, the attacker expressed willingness to return some of the funds, yet the event underscored the sector’s vulnerabilities.\n\nAdditionally, investor confidence was shaken by a Nov. 21 blog post from Tether, the firm behind the Tether (USDT) stablecoin. The post announced the U.S. Secret Service’s recent integration into its platform and hinted at forthcoming involvement from the Federal Bureau of Investigation.\n\nThe lack of details in the announcement has led to speculation about an increasingly stringent regulatory landscape for cryptocurrencies, especially with Binance facing heightened scrutiny and Tether’s closer collaboration with authorities. These factors are likely contributing to Ether’s underperformance, with various on-chain and market indicators suggesting a decline in ETH demand.\n\nInvestors become cautious as ETH on-chain data reflects weakness\n\nEther exchange-traded products (ETPs) saw only $34 million of inflows in the last week, according to CoinShares. This figure is a modest 10% of the inflow seen by equivalent Bitcoin (BTC) crypto funds during the same period. The competition between the two assets for spot exchange-traded fund (ETF) approval in the U.S. makes this disparity particularly noteworthy.\n\nMoreover, the current seven-day average annualized yield of 4.2% on Ethereum staking is less appealing than the 5.25% return offered by traditional fixed-income assets. This disparity led to significant outflows of $349 million from Ethereum staking in the previous week, as reported by StakingRewards.\n\nHigh transaction costs continue to be challenging, with the seven-day average transaction fee at $7.40. This expense has adversely affected the demand for decentralized applications (DApps), leading to a 21.8% decline in DApps volume on the network in the last week, as per DappRadar.\n\nTop Ethereum Dapps by volume. Source: DappRadar\n\nNotably, while most Ethereum DeFi applications saw a significant drop in activity, competing chains like BNB Chain and Solana experienced an 11% increase and stable activity, respectively.\n\nRelated: Changpeng Zhao may not leave the US pending court review, says judge\n\nConsequently, Ethereum network protocol fees have decreased for four consecutive days, amounting to $5.4 million on Nov. 26, compared to a daily average of $10 million between Nov. 20 and Nov. 23, as reported by DefiLlama. This trend could potentially create a negative spiral, driving users toward competing chains in search of better yields.\n\nEther’s current price pullback on Nov. 27 reflects growing concerns over regulatory challenges and the potential impact of exploits and sanctions on stablecoins used in DeFi applications.\n\nThe increasing involvement of the DOJ and FBI with Tether elevates the systemic risk for liquidity pools and the entire oracle-based pricing mechanism. While there’s no immediate cause for panic selling or fears of a drop to $1,800, the lackluster demand from institutional investors, as indicated by ETP flows, is certainly not a positive sign for the market.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY3J5cHRvLm5ld3MveHJwLWFuZC1ldGhlcmV1bS1wcmljZXMtcHVsbC1iYWNrLWVtZXJnaW5nLWFsdGNvaW4tcmlzaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "XRP and Ethereum prices pull back, emerging altcoin rising - crypto.news",
        "content": "The broader crypto market is struggling to maintain momentum as major players like XRP (XRP) and Ethereum (ETH) pull back from recent highs. Bitcoin (BTC) remains range-bound under $38,000 as buyers and sellers battle it for supremacy.\n\nHowever, one emerging altcoin, TG.Casino (TGC) is defying the downtrend and gaining ground in its ongoing presale event.\n\nXRP struggles for momentum\n\nAt the time of writing, XRP is hovering just above the $0.60 level, having dropped 18% in the past two weeks.\n\nXRP is now trading around the same level it was during the first week of November, having formed a solid downward channel on the 4-hour chart.\n\nYou might also like: XRP analyst sees potential bottom, urges caution\n\nThe coin did see a brief spike on Nov. 22 but failed to break resistance at $0.63.\n\nSince then, XRP has been declining alongside broader crypto market weakness.\n\nTrading volumes have also dried up slightly, with daily volume down to $1.4 billion in the past 24 hours.\n\nOverall, the technical picture suggests that XRP could see further losses if bearish momentum continues.\n\nHowever, the fundamentals behind Ripple and XRP remain positive, especially now that the battle with the Securities and Exchange Commission (SEC) is all but finished.\n\nAs such, XRP bulls will be hoping for a break above $0.63 to signal a potential trend reversal to the upside.\n\nEthereum price slips\n\nEthereum has also pulled back over the last couple of days, with its price dropping below $2,050 at the time of writing.\n\nThe world’s second-largest cryptocurrency fell from highs of $2,130 last Friday and is now trading 4% below that level.\n\nYou might also like: Vitalik Buterin unveils major overhaul of Ethereum staking to enhance decentralization\n\nThis weakness in ETH’s price comes despite some positive on-chain metrics for Ethereum.\n\nAccording to DappRadar, Ethereum dapps had a total value locked (TVL) of $48.67 billion over the past 30 days, representing a 14% increase from the previous month.\n\nEthereum is also performing well in the non-fungible token (NFT) space, handling $498 million in transactions in November so far.\n\nDespite these vital metrics, the ETH price has declined amidst broader crypto market struggles.\n\nAnalysts and traders will be watching to see if ETH can regain the $2,100 level this week – or if further losses will materialize.\n\nTG.Casino nears $3m in presale milestone\n\nAs XRP and Ethereum struggle, one emerging altcoin has been defying the downtrend and gaining traction.\n\nTG.Casino is a new decentralized gambling platform built on Telegram that has seen significant interest during its ongoing presale phase.\n\nThe project has already raised over $2.9 million in just two months as retail investors appear to back its potential.\n\nTG.Casino offers various casino games in Telegram without needing KYC checks.\n\nPlayers can enjoy live casino games, slots, and even a fully-fledged sportsbook – all powered by the native TGC token.\n\nTGC holders also receive 25% cashback on losses when wagering with the token.\n\nTG.Casino also implements a buyback-and-burn mechanism, whereby a portion of the casino’s profits will be used to repurchase TGC from the open market once they’re listed on exchanges.\n\nAccording to TG.Casino’s whitepaper, some of these repurchased tokens will be distributed back to TGC holders, with the remaining portion being permanently burned to reduce the overall supply.\n\nThis mechanism aims to create deflationary pressure – potentially increasing its value over time.\n\nTG.Casino even offers staking rewards up to 194% APY, allowing TGC holders to earn passive income while enjoying the platform’s games.\n\nOverall, as major cryptocurrencies struggle, TG.Casino is gaining momentum and is free for exploration for users tracking the GambleFi space.\n\nVisit TG.Casino presale\n\nRead more: 5 casinos for betting Formula 1 races\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vd2h5LWV0aGVyZXVtLWlzLWEtZ3Jvd2luZy1iYXNlLWZvci1pbnN0aXR1dGlvbmFsLWNhcGl0YWwv0gFXaHR0cHM6Ly9lbmcuYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW0taXMtYS1ncm93aW5nLWJhc2UtZm9yLWluc3RpdHV0aW9uYWwtY2FwaXRhbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Why Ethereum is a growing base for institutional capital - AMBCrypto English",
        "content": "Institutional investors are buying a lot of ETH-related trusts.\n\nETH 2.0 seemed to have convinced these players of the project’s long-term potential.\n\nFunds flowing into Ethereum [ETH] trusts and ETFs have been increasing since the 23rd of November, according to data observed by AMBCrypto. At press time, the Ethereum Funds Holdings, provided by CryptoQuant, had increased to 3.17 million.\n\nThe increase in metric is a testament to the increasing demand by institutions for investments linked to the altcoin.\n\nBig players love the ETH play\n\nWoominkyu, a verified author on CryptoQuant Woominkyu also corroborated AMBCrypto’s examination of the market sentiment.\n\nHowever, Woominkyu went deep by looking at the effect of the inflow on ETH’s price action. The analyst, after checking the impact, noted that:\n\n“This surge, occurring as Ethereum’s price stabilizes between 1.8K and 1.9K USD, signals a growing interest from institutional investors. It reflects their strong belief in Ethereum’s long-term value and the market’s potential for growth.”\n\nFurthermore, the long-term bullish sentiment could also be linked to the optimism around a potential spot ETF approval. But besides that, there were other reasons. In fact, some were linked to the changes the blockchain made over the last year.\n\nTop of the list is Ethereum’s transition to Proof-of-Stake (PoS), popularly called the Merge. Consensys, in a blog post last year, envisioned the possible impact of the Merge on institutional inflow.\n\nOne of these includes improved security, meaning that institutional investors now have more confidence in the protocols’ ability to secure their funds.\n\nAnother factor talked about is the deflationary supply. The deflationary supply reduces the rise of seeing ETH go to zero. With respect to this, the Ethereum-powered software company mentioned:\n\n“For institutions, ETH may become a more attractive asset, as reduced supply may lead to an increase in value.”\n\nBelief is back\n\nThe Shapella upgrade, activated in April, also contributed to the faith these large investors have in Ethereum. The Total Value Locked (TVL) of Ethereum also aligned with the notion that more participants now trust the blockchain compared to 2022.\n\nAt press time, Ethereum’s TVL was $26.02 billion.\n\nThe TVL value mentioned represented a 19.31% increase in the last 30 days. Should the metric continue to increase, then both retail and institutions will look towards buying the coin for potential long-term gains.\n\nA close look at the Long-Term Holder Net Unrealized Profit and Loss (LTH-NUPL) showed that the market mood has moved from hope (orange) to optimism (yellow). The LTH-NUPL serves as an indicator to assess the behavior of long-term holders.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nSo, this movement means holders of the altcoin are no longer fearful. Rather, most now have the belief that ETH has great future potential.\n\nIf the ETH price moves past $2,000 in the coming weeks, then the LTH-NUPL will switch to the belief stage. At this point, a lot of accumulation may occur that could send ETH into an extended rally."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzExLzI4L3ZpdGFsaWstYnV0ZXJpbi1ldGhlcmV1bS1wcm9vZi1vZi1zdGFrZS1hcnRpZmljaWFsLWludGVsbGlnZW5jZS1haS1zcGFjZS10cmF2ZWwtYmxvY2tjaGFpbi_SAYUBaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8xMS8yOC92aXRhbGlrLWJ1dGVyaW4tZXRoZXJldW0tcHJvb2Ytb2Ytc3Rha2UtYXJ0aWZpY2lhbC1pbnRlbGxpZ2VuY2UtYWktc3BhY2UtdHJhdmVsLWJsb2NrY2hhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "It’s been a year since Ethereum completed its switch to proof of stake. Vitalik Buterin on what’s new, what’s next, and how he’s using AI - Fortune",
        "content": "In an exclusive interview with Fortune, Vitalik Buterin, the brains behind Ethereum, shares his thoughts on everything from blockchain technology to AI to the people who most inspire him.\n\nHe also discusses what’s happened since Ethereum’s transition from proof of work to proof of stake and how spending time in Antarctica could help prepare humans—maybe even him?—for interplanetary travel.\n\n(This interview has been edited for length and clarity.)\n\nWhat use cases for blockchain excite you the most?\n\nThere are a few different categories of blockchain applications that I think can be valuable, and I wrote about some of these in a blog post last year, but a summary would be: One, currency applications are valuable, especially in the developing world. And two, identity, reputation, and decentralized social applications are exciting due to their potential network effects and enhanced security.\n\nGoing into the specifics of one application, I’ve been using Farcaster a lot recently. There’s a lot of interest in creating alternative stuff to Twitter now—lots of people are either unhappy with various things that Elon does or people just realize that this is a monopoly and we need alternatives.\n\nSome of these have been on-chain. For example, my Farcaster account is connected to an Ethereum address, and if I lose my Farcaster key, I can use my Ethereum address to recover it. This is actually more secure than what centralized social media do, where they rely on phone numbers that can be hacked.\n\nOne of the big challenges in social media is how you tell who is a human and who is a bot. There’s just lots of incentives for malicious actors to just create 50,000 bots. The nice thing about Ethereum is that it already has this lively on-chain ecosystem where there are different ways of doing that.\n\nOne is you can verify just the existence of activity on an Ethereum account. To have activity, you need to pay transaction fees, so there’s a cost. You can make a few hundred fake accounts if you can pay a cost, but you can’t make a million of them.\n\nSecond, you can look at POAPs [proof-of-attendance protocols] that verify that you participated in various in-person or online events.\n\nThird, there are proof-of-personhood protocols, and there is proof of humanity like Worldcoin. There’s a Gitcoin passport that aggregates a lot of those. The ideal goal here is to do this in a way that lets people prove that they are people and not bots, but is also compatible with the goal of preserving people’s privacy.\n\nLast year, you experienced the milestone of transitioning Ethereum from proof of work to proof of stake. What are you focused on now, and then what’s next?\n\nAccount abstraction is definitely a big and important one. Another thing is obviously scalability. We have EIP-4844, also known as Proto-Danksharding, which is coming out very soon, which basically adds more data space on the blockchain—not transactions, but just blobs of data. The purpose of this is to enable greater scalability, specifically for layer-2 projects, our rollups.\n\nThen after EIP-4844 there is a longer-term road map of increasing that amount of space over time and then ongoing improvements to proof of stake in identifying ways that we can improve decentralization even further.\n\nWe talked a year ago about AI, the intersection of AI and blockchain, before the release of ChatGPT and all the hype around that. What are your current views on the AI industry?\n\nAI is obviously super important. It’s the sort of thing that’s hard to think about because it’s so hard to predict where it might go in the future. It’s massive gains in productivity, but also massive philosophical consequences just in terms of what the role of humans in this new world is going to be. The world that is controlled by AI has completely different goals from us in a way that’s difficult to detect at first—that could also lead to very bad things happening.\n\nIn terms of the intersection between AI and crypto, this is one of those things where people have tried really hard to find an answer. Unfortunately, part of the answer is just that the intersection is less than it seems. There are a few things like ZK ML [zero-knowledge machine learning], but it’s realistically a pretty small area.\n\nThere is the fact that AI’s rapid growth makes it much more important to solve certain problems, like proof of personhood, for example. Then there’s obviously the possibility of just crypto tokens being used by AIs. There is the possibility of crypto-based DAOs governing AIs and the process of training AIs.\n\nHave you read any books in the last year that have inspired you?\n\nIn the last year, I have definitely done less books and more reading blogs and things on the internet, things like podcasts and even science fiction. Maybe 10 years ago I read a lot of Austrian economics literature and things like Human Action: A Treatise on Economics, but also things like The Moon Is a Harsh Mistress, a novel by Robert A. Heinlein about a society that creates a civilization on the moon and tries to gain independence.\n\nMuch more recently, I watched some of The Three-Body Problem—I read part of the novel and I also watched part of the TV series, and I was fascinated by that because it presents its world view in a way that is totally different from things that we’re used to. There are aspects to the world view that I disagree with. There’s always this mentality that the world is super dangerous and basically the five big countries have to get together and figure things out, and no one else gets a seat at the table.\n\nThat’s not the kind of world that I want, and not the kind of mentality that I want to see get bigger. But there is this aspect of appreciating the vastness of the universe and how lucky humanity is to have been born—and how significant and how small we are at the same time.\n\nAre there people you admire, who inspire you?\n\nA lot of people. Akira Fuyuno has a blog called Samurai Novelist. It’s not a book, but his posts are so long, they’re basically like the equivalent of reading 10 books. He just does a very good job of making really important philosophical concepts understandable and talking about just all kinds of things in science and politics in deep ways. Other people have told me that my writing style is inspired by his.\n\nI kind of have to say Volodymyr Zelensky. I appreciate his soft-power leadership and his ability to be a figure who rallies and inspires people in that way—like, not just giving out the orders, but just being the face and rallying people behind the cause.\n\nThen there are Eliezer Yudkowsky and Scott Alexander—the two of them are kind of similar characters in a lot of ways. Also, within the Ethereum community, Justin Drake, Dankrad Feist, and Aya Miyaguchi, the foundation’s executive director, who’s really pushed the philosophy of subtraction—different people who have stepped up and made a piece of Ethereum their own and put their souls into making that piece as great as possible.\n\nYou’ve also mentioned Steve Wozniak. Can you tell us more about meeting him? And maybe a few other people who’ve impressed you?\n\nSteve Wozniak, he was just a genuinely fascinating guy who had really interesting hobbies and a lot of cool things that he was able to tell me about.\n\nFrom the government, Audrey Tang, Taiwan’s digital minister, she had all kinds of interesting ideas of her own. She has her own history of being involved in Taiwan’s democracy movement and then g0v [gov zero], which is trying to create a more democratic e-government infrastructure in Taiwan.\n\nThe likely new prime minister of Montenegro, Milojko Spajić, a.k.a. Mickey, I’ve met him and I’m also impressed by him. From what I can tell, it’s his dedication to making the country better and also just being a curious person who was willing to talk to me and willing to learn things about crypto.\n\nDo you use ChatGPT or any other AI tools?\n\nI’ve used ChatGPT. I’ve also used the Stability AI chat. I use that for a few things. One is asking specific questions that I want answers for; another one is for writing code. I find that the thing that ChatGPT is best at is writing code that uses APIs or libraries or tools that you did not really know about. It even sometimes can take natural language tasks and convert them.\n\nAlso, for a translation, ChatGPT often does better than even Google Translate for helping to learn languages. If I want to understand the grammar behind a particular sentence, it does a really good job of doing that. The things that it’s less good at are basically things where there aren’t many millions of examples to learn from.\n\nI use either Stable Diffusion or the various other AI drawing things to draw images. I use those images and things in, like, my posts and my slides quite a bit. That has been it so far, but I’m sure as AI gets better, I’ll use it in other places as well.\n\nIt definitely does increase my productivity by quite a bit.\n\nWhat’s your biggest dream?\n\nThat’s a good question. I feel like I’m not the sort of person to have one dream. I’m the sort of person to have a lot of dreams. I dream of a world where I can be more free and more open, and where the tools that we’re building in the crypto space can be a big part of actually making that happen. I have a dream of humanity as a whole really succeeding and ending disease and becoming a multiple-energy-area civilization.\n\nSpeaking of civilization, do you think in the future we can travel between planets? And would you take that ride to space?\n\nI think we’ll absolutely get there. I will not be the first one to go—I might be the hundredth person to go. Before we’re really ready to do space, we need to get better at doing Antarctica first. I think of Antarctica as being the tutorial ground of going into space, because it’s an environment that’s definitely somewhat harsh and you have zero infrastructure, but you still can breathe the air without wearing a helmet. Start with the simpler things. But I would definitely love to actually be a part of that myself at some point over the next few decades."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93YWtlLW9wZW4tc291cmNlLXRvb2xpbmctZXRoZXJldW0tMTQxNTAwODQxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Wake: New Open-Source Tooling on Ethereum to Stop Bugs - Yahoo Finance",
        "content": "Wake\n\nPrague, Czech Republic, Nov. 28, 2023 (GLOBE NEWSWIRE) -- Quicktake:\n\n\n\nWake is a Python-based Solidity development and testing framework with built-in vulnerability detectors. It was used in audits by Ackee Blockchain and is now being open-sourced and free to use for everyone.\n\nSecurity experts are on high alert, as history shows that hack risks increase as market activity rises. Open-source tooling like Wake empowers application builders to conduct swift and thorough checks for code vulnerabilities.\n\n\n\nBattlefield-proven audit tooling goes open-source\n\nAckee Blockchain, a team of smart contract auditors and creators of community tools, introduces Wake, a Python-based development and testing framework for Solidity and cross-chain fuzzing with a proven track record of stopping bugs.\n\nWake’s features include a development and testing framework, a fuzzer, vulnerability detectors, and printers.\n\nWake was previously used in smart contract audits performed by Ackee Blockchain for IPOR, Axelar, and Solady and helped the auditors find critical, high, and medium bugs. The firm has announced it will make the tool open-source to contribute to a safer blockchain space.\n\n\n\nSecurity experts on alert as market activity rises\n\nAs DeFi activity rises, hackers see more lucrative targets and grow emboldened. In bull markets, projects often rush to ship product updates, creating a high demand for experienced smart contract auditor services. In the peak of the 2021 bull market, projects were typically quoted three month+ audit wait times by reputable firms. They then face a difficult decision to delay launches amid frenzied “land grabs” or launch with hastily conducted audits, increasing security risks.\n\nAfter a week when crypto funds saw their highest inflows since the 2021 bull market and DeFi volumes rose by approximately 50%, security experts are on higher alert. Wake’s release is timely - it allows application developers to expertly test the smart contracts of DEXs or any protocol that plugs into their service or upon which they are reliant.\n\n\n\nStory continues\n\nDesigned to generate fewer false positives and reduce manual audit time\n\nOn top of being the testing framework, Wake allows users to run static analysis. It has a set of ready-to-use high-precision vulnerability and code quality detectors and ready-to-use printers for extracting and pretty-printing useful information such as smart contract control flow and inheritance graphs.\n\n“A common problem of static analysis tools is a high false-positives ratio requiring extra manual investigation time. Our philosophy is to include only the most precise detectors and reduce all noise that creates extra overhead,” - Josef Gattermayer, CEO and co-founder of Ackee Blockchain.\n\nWake underwent performance testing with other frameworks, namely Hardhat, Brownie, and Ape, on three different development chains – Anvil, Ganache, and Hardhat. Wake proved to be the fastest Python framework.\n\nThe new release of Wake allows the customization of detectors and printers. It also allows third parties to create and implement their custom printers and detectors. The newest version also introduced Github action for automatically executing detectors in a pipeline. “The low false-positive rate, fastest industry test execution, and ready-made GitHub action make Wake an ideal candidate for CI/CD integration in every project” - Josef Gattermayer, CEO and co-founder of Ackee Blockchain.\n\nWake powers Tools for Solidity, a popular Visual Studio Code Solidity extension that does syntax highlighting and detections from Wake vulnerability and code quality detectors and provides instant feedback to the developers using the extension access to all references of a symbol across the whole project.\n\n\n\nAbout Wake\n\nWake is a Python-based development and testing framework for Solidity and cross-chain fuzzing with a proven track record of stopping bugs created by Ackee Blockchain, which became possible thanks to a grant Ackee Blockchain received from Coinbase in 2022.\n\nTo learn more, please visit getwake.io.\n\nWebsite | Twitter | Telegram\n\n\n\nAbout Ackee Blockchain\n\nAckee Blockchain is a team of security researchers auditing top-tier protocols: Safe, 1inch, Axelar, LayerZero, Trader Joe, or CoW Protocol.\n\nAckee Blockchain is backed by the largest VC fund focused on blockchain and DeFi in Europe, RockawayX, and received grants from the Ethereum Foundation, Tezos Foundation, Coinbase, and Solana Foundation.\n\nAckee Blockchain’s mission is to build a stronger blockchain community by sharing knowledge: the team runs a free certification course School of Solidity, School of Solana and teaches at the Czech Technical University in Prague. This mission is also fulfilled in initiatives such as the ERC-7512 draft, developing the Wake toolkit, or the open-source fuzzer for Solana.\n\nWebsite | Twitter\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, or intended as investment advice, financial advice, or trading advice. It is strongly recommended that you practice due diligence (including consultation with a professional financial advisor) before investing in or trading securities and cryptocurrency.\n\nCONTACT: For media inquiries or further information, please contact Josef Gattermayer marketing(at)ackeeblockchain.com\n\n\n\n"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzI3L2RlY2lzaW9uLXRpbWUtZm9yLWV0aGVyZXVtLWltbWluZW50LXNheXMtY3J5cHRvLWFuYWx5c3QtYmVuamFtaW4tY293ZW4taGVyZXMtd2hhdC1oZS1tZWFucy_SAYABaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMjcvZGVjaXNpb24tdGltZS1mb3ItZXRoZXJldW0taW1taW5lbnQtc2F5cy1jcnlwdG8tYW5hbHlzdC1iZW5qYW1pbi1jb3dlbi1oZXJlcy13aGF0LWhlLW1lYW5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "‘Decision Time’ for Ethereum Imminent, Says Crypto Analyst Benjamin Cowen – Here’s What He Means - The Daily Hodl",
        "content": "A widely followed crypto analyst says that Ethereum (ETH) is fast approaching a major turning point that could see it collapse against Bitcoin (BTC).\n\nIn a new video update, crypto strategist Benjamin Cowen tells his 788,000 YouTube subscribers that the ETH/BTC ratio will reach a “decision time” as soon as early next week.\n\n“Decision time is soon, in my opinion, for the Ether/Bitcoin ratio. I think that within the next few weeks, it could be as early as next week, but I think within the next few weeks, we should have a major decision on which way the Ether/Bitcoin ratio is going to break.”\n\nCowen lays out what he believes will happen to the ETH/BTC ratio, which is currently sitting at 0.05498 BTC ($2,049) at time of writing.\n\n“My base view has been that Ethereum’s Bitcoin valuation is ultimately heading to about 0.03 BTC to 0.04 BTC, eventually. And from that level, it can potentially start to go back into an uptrend against Bitcoin. Now again not a popular view, but there’s no denying that it’s been in a downtrend at least since the merge…\n\nI anticipated that this is likely going to drop down even though technically it’s a descending wedge and a lot of descending wedges actually break up to the upside, but I said that it’s more likely to break to the downside because this is where the Bitcoin dominance goes higher, and a lot of the altcoin market just basically systematically bleeds back to Bitcoin.”\n\nCowen goes on to explain why the next few weeks are crucial for the second-largest digital asset by market cap.\n\n“So why is the next few weeks such a decision time for Ethereum against Bitcoin? Oftentimes [with] Ethereum, there’s this seasonality that can come but it doesn’t tend to occur until like mid-December or early January, where it’ll often gain some ground against Bitcoin, so we’re still a few weeks away from that.\n\nSo my argument is that we’re within a window of weakness for the Ether/Bitcoin pair that could last for the next, let’s call it three to five weeks. A window of weakness doesn’t mean that it can’t climb back up to 0.057 BTC or 0.058 BTC or even higher. I mean if you look at the bull market support band [it is] all the way up at 0.059 BTC, almost 0.06 BTC, so it’s certainly possible that it could climb back up to those levels.\n\nI’m not trying to suggest that it can’t, it certainly could, but the window of weakness I think will be over the next few weeks.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/VECTORY_NT"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdGVjaG5vZGUuZ2xvYmFsLzIwMjMvMTEvMjcvdGFpa29zLWRhdmlkLXdlaXNpZ2VyLW9uLXJldm9sdXRpb25pemluZy1ldGhlcmV1bS1zY2FsYWJpbGl0eS1xYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Taiko's David Weisiger on revolutionizing Ethereum scalability [Q&A] - TNGlobal - TechNode Global",
        "content": "In this TNGlobal Q&A, Taiko’s Head of Developer Relations, David Weisiger, offers deep insights into innovative approaches to scaling Ethereum via Layer 2 solutions. Weisiger, a seasoned software engineer with a rich history at GameStop working on the NFT marketplace, brings a unique perspective to Taiko’s mission. He elaborates on his decision to join the company, particularly driven its vision of minimal yet highly ambitious scaling of Ethereum. His commitment to contributing to the Ethereum ecosystem is evident in Taiko’s efforts to maintain a “pure Ethereum” approach with their scaling solutions, highlighting their dedication to open-source development and collaboration with the Ethereum Foundation’s PSE team.\n\nThe conversation delves into the technical aspects of Layer 1 and Layer 2 blockchain technologies, clarifying their roles in the Ethereum network. Weisiger explains how Layer 2, particularly in the wake of network congestion and high transaction costs experienced in 2020 and 2021, has emerged as a crucial element in Ethereum’s scalability roadmap, known as “The Surge.” He discusses the company’s approach to Layer 2 security, embracing multi-proofs and a minimal-change protocol to enhance auditability and reliability. Additionally, Weisiger touches on the broader implications of blockchain technology in the context of the global economy and geopolitical tensions, predicting significant developments in blockchain adoption and Ethereum scaling by 2024.\n\nTell us about your decision to join the Taiko team, and please describe how the company contributes to the ETH ecosystem.\n\nI already knew one of the co-founders from my time at GameStop working on the NFT marketplace as an engineer. Frankly, I joined because of the co-founders I interviewed, and I was sold on the highly ambitious and minimal scaling vision they had for Ethereum. To change as little as possible, and to simply scale Ethereum itself, no other changes–just “pure Ethereum”. Additionally, I wanted to work on technology that would benefit the entire Ethereum ecosystem, from our contributions to the EF’s PSE team to our completely open-source codebase.\n\nWhat is a Layer 1 and 2? And why is Layer 2 becoming more popular in recent years?\n\nEthereum is a Layer 1, it is the original blockchain we come to know as Ethereum which persists data and executes smart contracts. Layer 2 is a way of achieving scalability for Ethereum by representing more computation which happens off-chain into a compressed format, tapping into Ethereum as a permissionless data availability layer. This is because the cost of data storage on Ethereum is really expensive.\n\nL2s may scale the Ethereum L1 capacity by around 1,000 times and lower the transaction cost by a few 100 times. With the network congestion on the Ethereum network in 2020/2021 and high transaction costs during that period of time, it becomes very clear that L2 is the most important Ethereum scaling solution (Layer 2’s has been a central part of the Ethereum roadmap as part of “The Surge”). The concept of Layer 2 is always changing. We are challenging the traditional notion of what Layer 2 / Layer 3 is in our research and development of booster rollups.\n\nETH security is becoming an increasingly important topic so what has Taiko done to contribute and improve Layer 2?\n\nThere are several dimensions to security for Layer 2. One dimension is the proof system–in this case, we have agreed with Vitalik’s idea of utilizing multi-proofs. This means that we assume there is a bug in one implementation of a proof system so it’s best to rely on multiple systems instead of just one. Additionally, we strive to make a minimal amount of changes in our protocol and client, both to be fully Ethereum-equivalent and also to make it more auditable.\n\nAnother dimension (in the spirit of minimalism) is reducing trust assumptions wherever we can. The first area that comes to mind is the fully permissionless proposing (this is referred to as a “based rollup”) and fully permissionless proving.\n\nTaiko has contributed to the open-source development of the halo2 circuits along with others (mainly the EF’s PSE team) and also contributes by open-sourcing our entire stack. Developers can use our client, protocol, etc. easily as it’s all available and well-documented on GitHub.\n\nHow do you differentiate Taiko from other L2s?\n\nThe primary difference between Taiko and other L2s is that it is a based rollup, and fully permissionless to participate in. Anyone can propose a block or prove a block on our test net. Additionally, Taiko is Ethereum-equivalent, which means that we do not make any changes whatsoever to the developer environment–put more technically, Taiko fully implements the Ethereum Yellow Paper specifications (on the execution layer). Another difference is our innovative idea of utilizing booster rollups to natively scale Ethereum. Check out our CTO Brecht’s EthResearch post on it!\n\nWhat are some examples of how your company helps its community and partners with its scaling solutions?\n\nWe develop our code totally in the open and also do many discussions and educational sessions publicly as well. We also love chatting with teams in the space that are very related to our protocol such as MEV, re-staking, block building, ZK proving, DAOs, etc. We enjoy participating in discussions about this and offering our insights!\n\nThe best example is definitely our research and development though. We believe we have great scaling ideas for Ethereum that others can use in their rollups or however they see fit.\n\nWhere do you see the broader crypto market going into 2024?\n\n2024 will be a very interesting year. There is a lot of risk in the global economy, and the geopolitical tension adds more uncertainty to it. There are always two sides to a coin, on one side the risk would affect the amount of capital coming into the crypto market, on the flip side blockchain and crypto are created trying to solve this exact problem and there’ll be more use cases and demand for an alternative infrastructure to address the deglobalization. But one thing is sure, for the blockchain world to fulfill its mission and purpose, scaling is a must. And 2024 will be the year when Ethereum scaling becomes a reality and comes to fruition. I believe that no matter how the broader market is going to be, we’ll see major adoption of blockchain technology."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS92aXRhbGlrLWJ1dGVyaW5zLWRlZmVuc2l2ZS1hY2NlbGVyYXRpb25pc20tZml0cy1zcXVhcmVseS1pbnRvLXRoZS1ldGhvcy1vZi1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Vitalik Buterin's 'Defensive Accelerationism' Fits Squarely Into the Ethos of Ethereum - Unchained - Unchained",
        "content": "In a new essay, Ethereum’s creator splits the difference between “Effective Altruism” and “Effective Accelerationism” with a reiteration of crypto principles of both independence and democracy.\n\nFor a crypto veteran like me, the bull market between 2020 and 2022 was most notable for what was missing: Vitalik Buterin. The thoughtful, unassuming creator and intellectual figurehead of the Ethereum ecosystem was largely pushed out of headlines by bombastic, performative (and fraudulent) caricatures like Do Kwon and Sam Bankman-Fried.\n\nBut with such charlatans and their allies now discredited well beyond crypto circles, Buterin is back in a big way with a lengthy essay he published on Monday entitled “My techno-optimism.” Though the message is broad, it arrives as a specific response to the recent public rift at OpenAI. That fight was broadly driven by a split between “Effective Altruists,” or EAs – the group Sam Bankman-Fried allied with and helped fund – and “Effective Accelerationists,” or (e/acc), a far more free-market oriented faction that includes people like Marc Andreessen.\n\nIn the recent OpenAI leadership fight, the EAs seemingly took the role of techno-pessimists, trying to slow the spread of AI tools, while the “e/acc” faction backed Sam Altman’s focus on growth. But Buterin sees both sides as having “far too many plans to save the world that involve giving a small group of people extreme and opaque power and hoping that they use it wisely.” As I’ve written elsewhere, the two factions are branches of the same underlying Silicon Valley ideology, and both have deep conceptual flaws that ultimately sum out to authoritarianism.\n\nButerin’s response appears in many ways far more nuanced than the positions he is reacting to. He calls it “d/acc,” or “defensive accelerationism.”\n\nWhat is Defensive Accelerationism?\n\nButerin’s counterpoint leans most of all on decentralization and democratic decision-making in the management of human progress. Buterin says that “The ‘d’ stands for ‘defensive acceleration,’ or perhaps decentralized, or differential acceleration.” It could just as easily, based on Buterin’s ideas, stand for “democratic accelerationism.”\n\nVitalik argues that those various Ds are linked. A society that develops in a “defensive” way is a more just and fair one, because its decentralization discourages attacking others, in turn leaving democracy free to flourish – at the local or small-group level specifically. He uses the example of Switzerland, whose mountainous terrain historically helped it maintain a more horizontal and localized system of political power, since the various sub-national polities can’t easily attack each other, or be attacked.\n\nIn more contemporary technological terms, Buterin specifically emphasizes privacy and autonomy, as well as cybersecurity and “infosecurity” as key principles of development on “d/acc” lines. He fully endorses “a security-focused open-source movement, rather than closed and proprietary corporations and venture capital funds.” This seems a specific knock on the EAs, who have been resistant to making AI tech more accessible.\n\nOn a related note, Buterin seems viscerally repulsed by the “enthusiasm for military technology” among the effective accelerationist crowd. On this point, he accuses the e/accs of making the same egotistical mistake as the EAs: Supporting the advancement of military tech, Buterin writes, requires “believing that the dominant technological power will reliably be one of the good guys in most conflicts, now and in the future.”\n\nThe essay also explores other important topics, like pandemic preparedness, and lays out decentralized approaches. At a very high level, Buterin praises systems like prediction markets and X/Twitter’s “community notes” feature, specifically because they’re structured to usefully integrate feedback from any member of the public. No surprise, Buterin also emphasizes the value of blockchains and cryptocurrency in his notion of digital “defensive infrastructure,” for instance for their ability to prevent centralized “chokepoints” for data.\n\nButerin’s “D” does not, crucially, stand for “deceleration.” He opens the essay with a strong argument for technological progress as a boon to human well-being, and explicitly connects that to the beneficial potential of artificial intelligence. And though he also accepts the risk of superintelligence dominating human life, he thankfully gives short shrift to the sci-fi fantasies of destructive AI that seem to haunt the Effective Altruists and their “AI Doomer” allies. He’s far more concerned with the realistic, here-and-now threat of AI turning humans into passive “pets,” simply because the AIs will make objectively better decisions.\n\nA ‘Subspecies of e/acc’\n\nBut even given such risks, Buterin rejects the idea that any small group – like the OpenAI board – should control technological progress. Notably, this echoes close to a decade of Buterin’s own proactive efforts to reduce his own power over Ethereum. He rightly identifies reliance on central authority as an implicit element of contemporary Effective Altruism, and generally he seems to have the least affection for that set of ideas.\n\nButerin is more clearly allied with the “effective accelerationists,” and calls d/acc “a subspecies of e/acc – just one that is much more selective and intentional.” But he rightly pushes back against their most extremist tendency, too – their belief that unstructured “free markets” in themselves lead to human progress. Buterin’s objections here include the uncontroversial fact that “many markets have proven to be natural monopolies.” Following the e/acc free-market doctrine, he writes, seems likely to lead to a monopoly on artificial intelligence specifically, with disastrous implications for human freedom and flourishing.\n\nThere’s much more breadth and subtlety to Buterin’s dense disquisition – for instance, he includes transhumanist ideas like brain-computer interfaces in his idea of “defensive” technological development. But it’s not hard to see “d/acc” as a rebranding of the left-wing libertarianism that has come to define the political ethos of the Ethereum community. Buterin’s pitch also reflects the same basic optimism and openness that defines the actually-existing Ethereum community today.\n\n“I believe humanity is deeply good,” Vitalik writes in closing. “Yes, human beings are often mean, but we much more often show kindness and mercy, and work together for our common benefit.”\n\n“Two billion years from now, if the Earth or any part of the universe still bears the beauty of Earthly life, it will be human artifices like space travel and geoengineering that will have made it happen,” Buterin continues.\n\n“We need to build, and accelerate.”"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXNtYXJ0LWFjY291bnQtYWRvcHRpb24tcHJvcG9zYWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum 'smart account' adoption is low — the first rollup proposal wants to change that - Blockworks",
        "content": "The introduction of Ethereum Foundation’s ERC-4337 account abstraction standard earlier this year drew much attention, but adoption and retention are off to a slow start.\n\nExisting hardware wallets rely on a pair of keys. If those keys are compromised, so are tokens in the wallet. The ERC-4337 standard was instead intended as a new baseline for how users interact with crypto wallets services, including social recovery mechanisms and other multisig options.\n\nThe standard turns Ethereum accounts into “smart accounts,” which are much more flexible to suit the needs of wallet holders.\n\nAccording to data on BundleBear:\n\nWeekly retention for ERC-4337 smart wallets drops as low as 1% for accounts older than five weeks.\n\nAn average smart account only sends five user operations.\n\nRevenue for transaction “bundlers” is also low, currently less than $8,000 per week.\n\nRead more: What Are Smart Contract Wallets? A Beginner’s Guide\n\nAt the time of writing, daily active users are at around 3%, sixdegree data shows. Most smart account users today are on the Polygon network, making up over 66% of all smart account holders and almost all monthly new users by chain.\n\nDespite the low adoption rates on Ethereum, industry participants remain optimistic about the future of smart accounts and have been actively working on proposals to spur usage.\n\nJohn Rising, the co-founder of Stackup, an account abstraction infrastructure company, notes that many existing issues with ERC-4337 can be resolved with the first-ever Rollup Improvement Proposal, RIP-7560.\n\nThe existing ERC-4337 standard is considered a “semi-native+” smart account, where a user does not need a private key because the trustless relay network is designed to forward transactions to the blockchain.\n\nRising believes that the goal is to move towards a “native” smart account, where accounts would be able to specify their own validation logic, completely removing the need for a private key — something that RIP-7560 hopes to do.\n\n“ERC-4337 has always been intended as a stepping stone to native account abstraction. The account abstraction proposal, RIP-7560, is designed to be backwards compatible with ERC-4337,” Rising told Blockworks.\n\nFurther discussions around the proposal and its applicability must still be considered. Native account abstraction has drawn concerns over the complexity it adds, as it introduces consensus layer changes rather than just high-level infrastructure layer modifications.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1iZWFycy1wcmVzc2luZy0xOTIwL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1iZWFycy1wcmVzc2luZy0xOTIwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Bears Keep Pressing, Why ETH Price Might Revisit This Key Support - NewsBTC",
        "content": "Ethereum price is moving lower from $2,130. ETH is showing a few bearish signs and might decline toward the $1,920 support zone.\n\nEthereum is slowly moving lower below the $2,060 zone.\n\nThe price is trading below $2,060 and the 100-hourly Simple Moving Average.\n\nThere is a major bearish trend line forming with resistance near $2,040 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to move down toward the $1,920 support zone.\n\nEthereum Price Extends Decline\n\nEthereum price started a fresh decline after it struggled near $2,130. ETH formed a high at $2,132 and started a downward movement. There was a move below the $2,100 and $2,080 levels, like Bitcoin.\n\nThe price even spiked below the $2,000 support. A low was formed near $1,986 and the price is now consolidating losses. There was a minor recovery wave above the $2,020 level. Ether climbed above the 23.6% Fib retracement level of the recent drop from the $2,132 swing high to the $1,986 low.\n\nEthereum is now trading below $2,060 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,040 zone. There is also a major bearish trend line forming with resistance near $2,040 on the hourly chart of ETH/USD.\n\nThe first key resistance is near the $2,060 level or the 50% Fib retracement level of the recent drop from the $2,132 swing high to the $1,986 low. The next resistance sits at $2,100. A clear move above the $2,100 level could send the price toward the $2,135 resistance zone.\n\nSource: ETHUSD on TradingView.com\n\nThe next resistance is near $2,150, above which the price could aim for a move toward the $2,200 level. Any more gains could start a wave toward the $2,250 level.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $2,040 resistance, it could start a fresh decline. Initial support on the downside is near the $2,000 level.\n\nThe next key support is $1,985. A downside break below $1,985 might send Ether toward the $1,920 support. The key support is now at $1,885, below which there is a risk of a move toward the $1,820 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,985\n\nMajor Resistance Level – $2,040\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzI3L3RyYWRlci13YXJucy1jaGFpbmxpbmstbGluay1hdC1yaXNrLW9mLWNvcnJlY3Rpb24tdXBkYXRlcy1vdXRsb29rLW9uLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Trader Warns Chainlink (LINK) at Risk of Correction, Updates Outlook on Ethereum-Based Altcoin - The Daily Hodl",
        "content": "A closely followed crypto trader says that top blockchain oracle provider Chainlink (LINK) could be due for a sizeable correction.\n\nPseudonymous trader and analyst Rekt Capital tells his 371,000 followers on the social media platform X that in order to move higher, LINK needs to close above the $14.70 level.\n\n“Chainlink needs a similar weekly close like in early 2021 to rally higher.\n\nAt the moment, the price struggling to break the top of the red box which may soon act as resistance on a bounce.\n\nNeeds to reclaim the top of the red box to move higher.”\n\nAt time of writing, LINK is trading at $14.60 which is just slightly below the trader’s resistance level.\n\nRekt is also looking at the decentralized data service Ocean Protocol (OCEAN), which, like LINK, may be coming up against macro resistance.\n\nThe trader says that a monthly close above the $0.47 level would indicate that OCEAN has further to run.\n\n“Monthly close coming soon and OCEAN is at the range high resistance (red).\n\nMonthly close above red = bullish.\n\nOtherwise, any dips into the green region would be a retest of the range Low and part of consolidation within the green-red range.”\n\nAt time of writing, OCEAN is trading for $0.44.\n\nLooking at the interoperability chain Polkadot (DOT), Rekt Capital says the altcoin is inches away from entering a brand new longer-term uptrend as it slowly breaks above its downward resistance above the $5 mark.\n\n“Polkadot is on the cusp of confirming a new macro uptrend.”\n\nAt time of writing, DOT is worth $5.29.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9jYXJkYW5vLWhvc2tpbnNvbi1tb2Nrcy1ldGhlcmV1bS1idXRlcmluLXN0YWtpbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Cardano's Hoskinson Mocks Ethereum as Vitalik Buterin Admits to Staking Shortcomings - CCN.com",
        "content": "Key Takeaways\n\nCardano’s Charles Hoskinson has taken aim at Ethereum founder, Vitalik Buterin.\n\nEthereum isn’t giving Cardano enough credit, says Hoskinson.\n\nFans of the rival chains had only just argued about their competing scalability solutions.\n\nThe rivalry between Cardano and Ethereum continues to simmer as Cardano founder Charles Hoskinson took a sarcastic jab at Ethereum co-creator Vitalik Buterin over staking innovations.\n\nIn a recent interview with DeFi news outlet The Defiant, Buterin proposed redesigning Ethereum’s staking system to address centralization issues plaguing the network. The two camps and their supporters have only recently argued about blockchain scaling solutions, and whether Ethereum had copied Cardano’s Hydra.\n\nHoskinson Thinks Cardano Deserves Some Credit\n\nEthereum’s suggested changes involve adopting an unspent transaction output (UTXO) model similar to the one used by Cardano (and Bitcoin) for years. Yet Buterin did not acknowledge Cardano as a source of inspiration.\n\nThis omission did not sit well with Hoskinson, who has consistently championed Cardano’s staking architecture as superior. He posted on X sarcastically: “No worries, Ethereum 3 will have it all sorted.” His biting remark implies that while Ethereum scrambles to upgrade its staking design, Cardano already has a robust decentralized solution working for years.\n\nHoskinson later clarified that he was not trying to stoke hostilities, but expressed bewilderment that Cardano rarely gets recognition as an innovative ecosystem from Ethereum developers. “I am truly at a loss that Cardano can never be mentioned as an innovative ecosystem over on team E.”\n\n“[Vitalik] is rediscovering what we’ve been working on for almost a decade, and it’s like a new revelation,” he stated on X .\n\nA Longstanding Rivalry\n\nThe rivalry is fueled by both projects’ ambitions to lead the blockchain space as the preeminent smart contract platform. While Ethereum dominates in decentralized finance (DeFi) currently with over $25 billion locked , Cardano has been steadily gaining ground with its focus on scalability, efficiency, and decentralization.\n\nNo worries, Ethereum 3 will have it all sorted! https://t.co/Td0Hm58eic — Charles Hoskinson (@IOHK_Charles) November 24, 2023\n\nWhile both Cardano and Ethereum use proof-of-stake (PoS) consensus to achieve greater energy efficiency and scalability, their implementations differ significantly. Cardano’s Ouroboros PoS mechanism has been operational since the network launched in 2017. It utilizes peer-reviewed academic research to provide mathematical security guarantees, rivaling the assurances of Bitcoin’s power-hungry proof-of-work.\n\nIn contrast, Ethereum’s PoS beacon chain only went live in 2020 and its consensus layer merge was just completed in September 2022. Where Ethereum falls short (for many) is decentralization. Cardano engineered Ouroboros deliberately for decentralization, using mechanisms like stake pools that allow smaller players to participate in block production.\n\nThe two giants of crypto have had a long-standing rivalry since working together on Ethereum in its early days. Buterin and Hoskinson were both founders of Ethereum back in 2013 along with several others.\n\nHowever, creative differences soon emerged. Hoskinson left Ethereum in 2014 over disagreements on whether the platform should be a for-profit company. While Buterin envisioned a non-profit open ecosystem. Hoskinson went on to found IOHK and eventually launched Cardano as a competing smart contract platform."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tdHVybnMtZGVmbGF0aW9uYXJ5LWFzLXZhbGlkYXRvcnMtZXhpdC1hbmQtZGVmaS10cmFuc2FjdGlvbnMtZHJvcC01Ny_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum turns deflationary as validators exit and defi transactions drop 57% - crypto.news",
        "content": "Ethereum’s supply turns deflationary amid a decrease in validator participation and declining NFT and defi transactions.\n\nThe recent dynamics of Ethereum’s blockchain network signal a significant shift towards deflation, according to data from Glassnode. This is driven by a combination of reduced validator participation and increased network activity. A notable increase in validators exiting the Ethereum staking pool since October has contributed to a slowdown in the growth rate of ETH issuance. This trend correlates with the broader bullish sentiment across digital asset markets.\n\nThe growth rate of the #Ethereum validator set has slowed in recent weeks as an increasing number of validators voluntarily exit, slowing the rate of ETH issuance.\n\n\n\nAlongside increasing ETH burnt via EIP1559 due to growing network activity, the ETH supply has turned… pic.twitter.com/xMrQRe7opO — glassnode (@glassnode) November 28, 2023\n\nYou might also like: Spain enforces new crypto tax law for foreign asset declarations\n\nThe decreased validator participation leads to reduced ETH issuance, which, when combined with heightened network activity, results in increased ETH burn via EIP1559​​. Concurrently, a decline in NFT and defi transactions has been observed, with decreases of 3% and 57%, respectively, over the past four months.\n\nIn contrast, token transfers and stablecoins have seen a surge, with gas usage for tokens rising by 8.2% and stablecoin gas usage increasing by 19%. This suggests a shift towards longer-tail assets, reflecting growing market confidence​​.\n\nPost the London hardfork, Ethereum transitioned from a net inflationary state towards equilibrium and then deflation. Recently, the combination of declining issuance rates and increased volume of ETH burnt has turned the aggregate ETH supply deflationary once more. These developments underscore Ethereum’s responsiveness to market activity and adoption trends​​.\n\nRead more: Coinbase CEO thinks Binance settlement is good for crypto\n\nFollow Us on Google News"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8yOC9vbmUtb2YtbW9zdC1idWxsaXNoLWNoYXJ0cy1pdmUtc2Vlbi1leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS1kZXRhaWxzLWV0aGVyZXVtLW91dGxvb2stYXMtZXRoLXByaW50cy1uZXctcGF0dGVybi_SAZcBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMjgvb25lLW9mLW1vc3QtYnVsbGlzaC1jaGFydHMtaXZlLXNlZW4tZXgtZ29sZG1hbi1zYWNocy1leGVjdXRpdmUtZGV0YWlscy1ldGhlcmV1bS1vdXRsb29rLWFzLWV0aC1wcmludHMtbmV3LXBhdHRlcm4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "‘One of Most Bullish Charts I’ve Seen’ – Ex-Goldman Sachs Executive Details Ethereum Outlook As ETH Prints New Pattern - The Daily Hodl",
        "content": "Real Vision CEO Raoul Pal says that key indicators are flashing bullish for the smart contract platform Ethereum (ETH) as the altcoin remains above the $2,000 level.\n\nIn a new analysis, the former Goldman Sachs executive says that Ethereum’s price action continues to print bullish patterns.\n\n“The zoomed-out chart of Ethereum continues to be one of the most bullish I have seen.”\n\nAccording to the macro guru, Ethereum’s market structure is closely mirroring increasing market liquidity.\n\n“Fed net liquidity versus Ethereum: Ethereum, for example, is basically a pure play on liquidity.”\n\nIn the short term, Pal says that Ethereum is now potentially forming a bullish cup-and-handle pattern after having completed a bullish flag pattern. The investor says Ethereum will likely gain bullish steam if it closes above $2,150.\n\n“Speaking of Ethereum, we’re currently in the process of testing very important levels. We have been highlighting the bull flag chart pattern in Ethereum – which we recently cleared – for several weeks now and it looks like we could be forming a larger cup-and-handle pattern.\n\nA close above $2,150 would be very positive. Something to keep an eye on.”\n\nHe also says that he is long-term bullish on Ethereum after ETH broke out of a wedge pattern at the $2,087 level on the weekly chart.\n\n“If we zoom out using weekly data, Ethereum has already broken out from its near-perfect wedge pattern; it’s a very bullish chart.”\n\nEthereum is trading for $2,023 at time of writing, down 2.1% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGVjcnlwdC5jby8yMDc2OTIvYWktdHVybnMtbWFycy1ub3Qtc2FmZS1ldGhlcmV1bS1jcmVhdG9yLXZpdGFsaWstYnV0ZXJpbtIBV2h0dHBzOi8vZGVjcnlwdC5jby8yMDc2OTIvYWktdHVybnMtbWFycy1ub3Qtc2FmZS1ldGhlcmV1bS1jcmVhdG9yLXZpdGFsaWstYnV0ZXJpbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin: If AI Turns on Us 'Even Mars May Not Be Safe' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOn Monday, Ethereum creator Vitalik Buterin reflected on his own take on “techno-optimism,” inspired by Marc Andreessen, who opined about AI in his Techno-Optimist Manifesto in October. While Buterin agreed with Andreessen’s positive outlook, Buterin also noted the importance of how AI is developed and the technology's future direction.\n\nButerin acknowledged the existential risk of artificial intelligence, including causing the extinction of the human race.\n\n“This is an extreme claim: as much harm as the worst-case scenario of climate change, or an artificial pandemic or a nuclear war, might cause, there are many islands of civilization that would remain intact to pick up the pieces,” he said.\n\nAD\n\nAD\n\n“But a superintelligent AI, if it decides to turn against us, may well leave no survivors and end humanity for good,” Buterin said. “Even Mars may not be safe.”\n\nButerin pointed to a 2022 survey by AI Impacts, which said between 5% and 10% of participants believe humans face extinction from AI or from humans' failure to control AI, respectively. He said that a security-focused open-source movement is ideal for leading AI development rather than closed and proprietary corporations and venture capital funds.\n\n“If we want a future that is both superintelligent and \"human—one where human beings are not just pets, but actually retain meaningful agency over the world—then it feels like something like this is the most natural option,\" he said.\n\nWhat’s needed, Buterin continued, is the active human intention to choose its direction and outcome. “The formula of 'maximize profit' will not arrive at them automatically,” he said.\n\nButerin said he loves technology because it expands human potential, pointing to the history of innovations from hand tools to smartphones.\n\nAD\n\nAD\n\n“I believe that these things are deeply good, and that expanding humanity's reach even further to the planets and stars is deeply good, because I believe humanity is deeply good,” Buterin said.\n\nButerin said that while he believes transformative technology will lead to a brighter future for humanity, he rejects the notion that the world should stay how it is today, only with less greed and more public healthcare.\n\n“There are certain types of technology that much more reliably make the world better than other types of technology,” Buterin said. “There are certain types of technology that could, if developed, mitigate the negative impacts of other types of technology.”\n\nButerin cautioned about a rise in digital authoritarianism and surveillance technology used against those who defy or dissent against the government, controlled by a small cabal of technocrats. He said the majority of people would rather see highly advanced AI delayed by a decade rather than be monopolized by a single group.\n\n“My basic fear is that the same kinds of managerial technologies that allow OpenAI to serve over a hundred million customers with 500 employees will also allow a 500-person political elite, or even a 5-person board, to maintain an iron fist over an entire country,” he said.\n\nWhile Buterin said he is sympathetic to the effective acceleration (also known as \"e/acc\") movement, he has mixed feelings about its enthusiasm for military technology.\n\n“Enthusiasm about modern military technology as a force for good seems to require believing that the dominant technological power will reliably be one of the good guys in most conflicts, now and in the future,” he said, citing the idea that military technology is good because it's being built and controlled by America and America is good.\n\n“Does being an e/acc require being an America maximalist, betting everything on both the government's present and future morals and the country's future success?” he said.\n\nAD\n\nAD\n\nButerin cautioned against giving “extreme and opaque power” to a small group of people with the hope they will use it wisely, preferring instead a philosophy of \"d/acc\"—or defense, decentralization, democracy, and differential. This mindset, he said, could adapt to effective altruists, libertarians, pluralists, blockchain advocates, and solar and lunar punks.\n\n“A defense-favoring world is a better world, for many reasons,” Buterin said. “First of course is the direct benefit of safety: fewer people die, less economic value gets destroyed, less time is wasted on conflict.\n\n\"What is less appreciated though is that a defense-favoring world makes it easier for healthier, more open and more freedom-respecting forms of governance to thrive,\" he concluded.\n\nWhile he emphasized the need to build and accelerate, Buterin said society should regularly ask what we are accelerating towards. Buterin suggested that the 21st century may be \"the pivotal century\" for humanity that could decide the fate of humanity for millennia.\n\n“These are challenging problems,” Buterin said. “But I look forward to watching and participating in our species' grand collective effort to find the answers.”\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mb3VuZGF0aW9uLW1vdmVzLWJpZy1ldGgtbHVtcC1zZWxsLW9mZi1jb21pbmfSAUpodHRwczovL3UudG9kYXkvZXRoZXJldW0tZm91bmRhdGlvbi1tb3Zlcy1iaWctZXRoLWx1bXAtc2VsbC1vZmYtY29taW5nP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Foundation Moves Big ETH Lump – Sell-off Coming? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBlockchain sleuth @lookonchain reported that approximately an hour ago it spotted that the Ethereum Foundation had made a large crypto transfer, moving $2 million worth of ETH. This move was also noticed by another DLT tracker, @OnchainDataNerd, which reported it on its X app page.\n\nThis transaction happened right after the ETH price showed a marginal rise, which followed a recent drop of 4.23%. Still, Ethereum continues to hold above the key $2,000 level so far.\n\nEthereum Foundation moves 1,000 ETH\n\nIn its recent X post, Lookonchain stated that 1,000 ETH worth an impressive $2 million was moved by the Ethereum Foundation to a Safe multi-signature wallet \"0x4e6b.\" Safe is a type of wallet based on Ethereum chain.\n\nEarlier this year, according to data shared by @lookonchain, the Ethereum Foundation also transferred several similar lumps of ETH to the same multi-signature wallet – 1,000 ETH nearly three months ago and another 1,000 ETH almost half a year ago. The goal of these transactions remains unclear and has not been commented on by any Ethereum rep so far.\n\nHowever, the ETH community started jumping to conclusions. Today’s ETH transfer sparked a heated discussion under the @lookonchain post as ETH holders became intrigued as to the goal of this large Ethereum transaction.\n\nSome commentators believe the Ethereum team spearheaded by Vitalik Buterin is gradually selling its corporate ETH stash as they sent critiques to the Ethereum Foundation and its frontman, Vitalik. Several people in the comments wondered if the ETH price is going to fall further because of this.\n\nCardano founder criticizes Buterin and ETH staking redesign plan\n\nAs reported by U.Today over the weekend, Buterin recently gave an interview in Turkey, answering questions of the local ETH community. When asked about the road map for Ethereum, Buterin stated that something needs to be done about ETH staking since many users find its mechanism not so easy or convenient to use, pouring a lot of technical details on his audience.\n\nCardano founder Charles Hoskinson (who was also on the team who founded Ethereum together with Buterin) commented on that in a sarcastic tone, stating, \"No worries, Ethereum 3.0 will have it all sorted.\"\n\nEarlier, the Ethereum staking model was heavily criticized by Hoskinson since before the actual launch of updates that comprise Ethereum 2.0 and ensure the blockchain's shift from the proof-of-work to the proof-of-stake consensus algorithm, users were unable to unlock their ETH for several years.\n\nThe Ethereum Merge upgrade that allowed the chain to begin running on proof-of-stake was launched in September last year, and ETH was not allowed to be unstaked until the next upgrade, called Shanghai, at the start of this year.\n\nBack then, several times Hoskinson emphasized on X app that Cardano stakers are allowed to unstake their coins at any time they want, and even in order to stake their ADA, they do not have to move it from their wallets, unlike in the case of Ethereum. The Cardano founder, back then, called this a fundamental difference between the Cardano and Ethereum blockchains."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0td291bGQtdHJhZGUtYXQtdGhpcy1wcmljZS1pZi1ldGgtaGl0cy1pdHMtYWxsLXRpbWUtaGlnaC1tYXJrZXQtY2FwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum would trade at this price if ETH hits its all-time high market cap - Finbold - Finance in Bold",
        "content": "Cryptocurrency traders usually consider price the leading index for past analysis and future projections. However, tokenomics and supply inflation can drastically impact the price of any asset, and crypto investors can use the market cap as a demand index to evaluate these effects.\n\nIn this context, Finbold looked at Ethereum (ETH) tokenomics from a capitalization perspective. Public market data from cryptocurrency indexes can demonstrate the effects of increased supply inflation on Ethereum. We calculated the exact price ETH would trade if it ever hits the all-time high market cap.\n\nAn inflationary supply requires more demand to maintain its value over time. These two factors determine whether a cryptocurrency’s price rises or falls. Ethereum, with its unique tokenomics design, is a prime example of this dynamic.\n\nEthereum had an all-time high market cap of $575.899 billion on November 10, 2021, according to TradingView’s CRYPTOCAP index. Meanwhile, Ether traded for as high as $4,878 on the same day, as registered by Finbold. An inverse calculation suggests a circulating supply of around 118.06 million ETH at that time.\n\nCRYPTOCAP – ETH daily market capitalization. Source: TradingView\n\nEthereum supply inflation and its economic effects\n\nLet’s explore Ether’s supply inflation and its economic implications. Ethereum has a circulating supply of 118.619 million ETH as of the time of this writing. This results in a supply inflation of 559,000 ETH (0.5%) in two years.\n\nEthereum circulating supply data. Source: CoinMarketCap\n\nEssentially, the burning mechanism implemented in 2021 assisted in controlling the effective inflation caused by new Ethers issuance to reward staking validators.\n\nThe price projection also shows the effects of this tokenomics. In case the leading Web3 blockchain reaches its highest speculative demand of $575.899 billion market cap, ETH would trade at a proportionally lower price than the corresponding all-time high.\n\nConsidering the circulating supply on November 28, Ethereum would be priced at $4,855 per token at its highest capitalization. Interestingly, a loss of $23 (47%) from the previous price of $4,878 in 2021.\n\nHowever, this still indicates a potential 138% increase from the current price of $2,035.\n\nIt is important to understand that the forecast requires the same demand as 2021 for Ethereum. In this context, there are no guarantees that this demand will ever be seen again. On the other hand, it is also possible that a higher demand surges in the following years.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXByaWNlLW1heS1sb3NlLTItMDAwLWxldmVsLWFzLWV0aC1iZWNvbWVzLWRlZmxhdGlvbmFyeS1hZ2Fpbi1kdWUtdG8tdmFsaWRhdG9yLWV4aXQtMjAyMzExMjgxODU00gGbAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXByaWNlLW1heS1sb3NlLTItMDAwLWxldmVsLWFzLWV0aC1iZWNvbWVzLWRlZmxhdGlvbmFyeS1hZ2Fpbi1kdWUtdG8tdmFsaWRhdG9yLWV4aXQtMjAyMzExMjgxODU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum price may lose $2,000 level as ETH becomes deflationary again due to validator exit - FXStreet",
        "content": "Share:\n\nEthereum price, trading at $2,038 on Tuesday, will likely fall below the crucial support level amid waning bullishness.\n\nETH validators, for the first time since Shapella's hard fork, have begun exiting to the tune of 1,018 per day.\n\nETH issuance has also taken a hit and, for the first time since December 2022, has recently had its growth rate decreased by 0.5% per day.\n\nEthereum price has been affected by the Shanghai hardfork since even before it was activated. But since the upgrade, this week marks the first instance when the market is witnessing the fear of unstaking come to life.\n\nEthereum price could take a bearish turn\n\nEthereum price has been hovering around the $2,000 mark since the beginning of the month. Trading at $2,038 at the time of writing, the second-generation cryptocurrency has failed to breach the resistance of $2,124 for the second time this month. While it did manage to break out of the downtrend over the past week, it is still vulnerable to a decline below the $2,000 support level.\n\nThe Relative Strength Index (RSI) is a measure of the speed and change of price movement. According to the indicator, there is still room for ETH to bounce back and reinitiate bullish momentum, given it is sitting above the neutral line at 50.0. The Moving Average Convergence Divergence (MACD) indicator is also exhibiting the dominance of bearish momentum in the market presently, owing to the red bars on the histogram and the lack of a potential bullish crossover.\n\nThus, all the fingers point at a likely downtrend, which might see Ethereum price touching the lows of $1,900 or testing the support at $1,795.\n\nETH/USD 1-day chart\n\nBut if the broader market cues turn bullish and ETH bounces back from $2,000, it could make another attempt at breaching the resistance marked at $2,124. A rise through that level would invalidate the bearish thesis, opening ETH up to tagging $2,200.\n\nEthereum turns deflationary again\n\nThe chance of a bullish turn of events is both likely and unlikely. It's likely because ETH is deflationary once again. An asset being deflationary simply means that it no longer has an infinite supply but that it will reduce over time. This generally is a bullish event since low supply plus high demand equals a rise in price.\n\nBut the reason it could be unlikely in the case of Ethereum is that the conditions under which ETH is turning deflationary are unfavorable. According to blockchain analytics platform Glassnode, daily ETH issuance has experienced a slowdown. Over the last week, the growth rate of ETH issuance has slowed by up to 0.5% per day.\n\nEthereum daily issuance\n\nThis marks the first issuance decrease in nearly 12 months, and the reason behind it is the exit of validators. Unlike Bitcoin, Ethereum runs on the Proof of Stake consensus method, which requires node/block validators to stake ETH in order to qualify. Earlier, this staked ETH could not be withdrawn, but that feature was activated after the Shapella upgrade.\n\nSince then, on average, 380 validators have exited on a daily basis. But this figure shot up by 168% in just a month, rising to 1,018 validators.\n\nEthereum validators\n\nConsequently, the staked ETH has also noted a decline. The possibility of the validator exit could be due to one or more of these three possible reasons:\n\nInvestors are opting to change their staking setup, for example, by transferring stakes from CEXs (centralized exchanges) to Liquid Staking Providers (perhaps due to ongoing regulatory concerns).\n\nInvestors with access to US capital markets may be rotating capital toward safer assets, such as US treasuries, as interest rates remain elevated relative to ETH staking returns.\n\nInvestors may also be seeking greater liquidity for held ETH in anticipation of an imminent market uptrend rather than less liquid-staked ETH.\n\nNevertheless, this is not a good sign for Ethereum as the validators are the backbone of the network, and their exit could prove to be rather negative."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1lbGxpb3Qtd2F2ZS10aGVvcnktdG8tMzQwMC_SAVlodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtZWxsaW90LXdhdmUtdGhlb3J5LXRvLTM0MDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction As Elliott Wave Theory Hints Rally to $3400 - CoinGape",
        "content": "Ethereum Price Prediction: Amidst the recent downturn in the crypto market, the Ethereum price recovery took a breather after surging to a high of $2,137, experiencing a temporary drop to $1,900. Analyzing the daily chart, it appears this pullback might be part of a 4th wave correction within the Elliott Wave Theory, potentially setting the stage for a forthcoming 5th wave impulse.\n\nAlso Read: This Whale Astonishingly Becomes Largest Depositor On Ethereum L2 Blast Bridge\n\nadvertisement\n\nEthereum Price Prediction: Will $ETH Surpass $2500?\n\nA rising wedge pattern governs the current recovery trend\n\nA post-correction rally could set the ETH price for 18% surge\n\nThe intraday trading volume in Ether is $10.3 Billion, indicating a 66% gain.\n\nSource- Tradingview\n\nThe Elliott Wave Theory is a method used in technical analysis to predict future price movements by identifying patterns in market cycles.\n\nThe ongoing recovery of the Ethereum coin, kicking off in mid-October, aligns neatly with the Elliott Wave Theory’s framework. The first wave saw the ETH price peak at $1,656, followed by a second wave correction to $1,543.\n\nWith the broader market’s recovery, the altcoin surged in a third wave and reached a 7-month high at $2,137. Furthermore, the ETH price experienced a 4th wave correction in the third week of November, marked by a downward-sloping resistance trendline. This pullback assisted buyers in recuperating the exhausted bullish momentum for the next leap/\n\nOn November 22nd, while major altcoins attempted to recover from recent sell-offs, the Ethereum price notably broke out from the overhead trendline, potentially signaling the initiation of a 5th wave impulse.\n\nUsing the Fibonacci extension tool to project the 5th wave, it could potentially reach around 0.618 or $1.618 times (wave 1 + wave 3) against the wave 4 correction, implying a potential target of $2,380 or $2900 for Ethereum’s price.\n\nIs ETH Poised for Further Correction?\n\nSource- Tradingview\n\nWith an intraday 2% loss, the Ether price currently stands at $2,070. This dip raises questions about whether the price has genuinely entered the fifth wave. However, should the aforementioned bullish thesis hold true, a climb to $2,800 could spark a bullish breakout from a long-standing rising wedge pattern. Such a breakout might indicate a significant trend reversal, potentially strengthening the recovery outlook and aiming for an extended rally toward $3,400.\n\nRelative Strength Index: The formation of a higher low in the Ethereum price despite a lower low drop in RSI suggests a reverse bullish divergence in this momentum indicator. This accentuates sellers’ attempts but highlights the potential neglect of their influence .\n\nExponential Moving Average: The slopes of the 20 and 50-day EMA might provide initial support during intermittent pullbacks in the price"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcmV0dXJuLXRvLTQ4MDAtYXRoL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcmV0dXJuLXRvLTQ4MDAtYXRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Return To $4,800: Analyst Identifies Pattern To Trigger Rally To ATH - NewsBTC",
        "content": "The Ethereum price has been trading more than 50% below its all-time high of $4,800 for the better part of a year now with no sign of returning to its previous all-time high. However, this slow trend may not continue for much longer as a crypto analyst has identified a pattern that could trigger a rally to its previous highs.\n\nEthereum Stuck Inside A Bullish Triangle\n\nIn an analysis that was posted on TradingView, crypto analyst FieryTrading identified a unique pattern that the Ethereum price has been trading in for almost two years. This pattern is a bullish triangle pattern and it has persisted for more than one and a half years.\n\nLooking at the chart, the Ethereum price has not deviated from this bullish triangle and has not had any success breaking out of it. The triangle began toward mid-2022 when the Terra Network collapse triggered a crypto market-wide crash. Then even with multiple major recoveries since then, the altcoin’s price remains inside this triangle.\n\nThe lower end of this bullish triangle is at $887 which is the cycle low, and the upper end has been tracked at just above $2,100. Given this range, it suggests that for Ethereum to break out of this bullish triangle, it would have to clear the $2,200 resistance.\n\nWhat Happens If ETH Breaks Out Of This Pattern?\n\nAs the crypto analyst highlights, a breakout of this pattern would lead to a massive rally. The top of this breakout rally could eventually see the Ethereum price return to its 2021 all-time high levels, reaching above $4,800.\n\nETH price at $2,047 | Source: ETHUSD on Tradingview.com\n\n“In my eyes, a break out from this pattern might result in big gains for ETH, since it will burst through an area full of short-trade stop-losses which will be forced to buy back their positions,” FieryTrading said. A move to $4,800 would translate to a 130% increase from its current price levels.\n\nHowever, the crypto analyst explains that this could be more of a long-term performance, so it is possible that the cryptocurrency will not complete this move until at least the year 2024. But it paints a good, bullish picture for the altcoin going forward.\n\nOn its own this year, the Ethereum price has performed quite well, especially over the last 30 days. Data from CoinMarketCap shows that ETH’s price has risen 16.53% in one month to break above the $2,000 resistance which has now turned into support.\n\nEthereum remains the second-largest cryptocurrency with a market cap of approximately $250 billion.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9pbnN0aXR1dGlvbmFsLWludmVzdG9ycy1mbG9jay10by1ldGhlcmV1bS1ob2xkaW5ncy1zZWUtbm90YWJsZS11cHRpY2stYW1pZC1ldGYtaHlwZS1jcnlwdG9xdWFudC_SAX1odHRwczovL2NyeXB0b3BvdGF0by5jb20vaW5zdGl0dXRpb25hbC1pbnZlc3RvcnMtZmxvY2stdG8tZXRoZXJldW0taG9sZGluZ3Mtc2VlLW5vdGFibGUtdXB0aWNrLWFtaWQtZXRmLWh5cGUtY3J5cHRvcXVhbnQvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Institutional Investors Flock to Ethereum, Holdings See Notable Uptick Amid ETF Hype: CryptoQuant - CryptoPotato",
        "content": "The increased bullish sentiment has led to an approximately 15% increase in the price of Ether within a 30-day period. The fact that Ethereum is now trading above $2,000 suggests a growing focus on the asset, and this renewed optimism has propelled the year-to-date gain in ETH price to almost 70%.\n\nNew data suggest a surge in institutional holdings in the crypto asset.\n\nSurge in Institutional Ethereum Holdings\n\nAccording to CryptoQuant, there has been a notable uptick in institutional holdings of Ethereum, both through direct ownership and indirect channels such as trusts, ETFs, and funds, in November. This increase coincided with ETH’s price finding stability in the range of $1.8k to $1.9k.\n\nSuch a heightened institutional interest suggests a growing confidence among investors in Ethereum’s long-term value and the promising prospects for market expansion, according to the analysis.\n\n“It reflects their strong belief in Ethereum’s long-term value and the market’s potential for growth.”\n\nThe latest analysis also suggested that the growing appeal of Ethereum to institutional investors is reinforced by its ongoing technical advancements. The implementation of Ethereum 2.0 upgrades and the enhancement of smart contract functionalities have played a significant role in attracting institutional attention, underscoring the crypto-asset’s attractiveness as a long-term investment opportunity.\n\nEthereum ETF Hype\n\nThe buzz among institutional investors kicked off at the beginning of the month when the US Securities and Exchange Commission (SEC) acknowledged Grayscale Investment’s bid to transform its Ethereum trust into an ETF.\n\nThis SEC action stems from a specific court mandate instructing a review of Grayscale’s pending ETF applications. As of now, there is no official confirmation regarding the approval of a spot cryptocurrency ETF.\n\nMarket optimism surged when BlackRock, the world’s largest asset manager, formally submitted an application for a spot Ether ETF on November 9. This confirmation led to the Ether price breaking through the $2,000 resistance, marking a six-month high on the same date. BlackRock officially lodged the S-1 form with the SEC on November 16.\n\nExperts predict the SEC will approve a spot Bitcoin ETF in early 2024, and following this, approval for a spot Ether ETF is widely expected to follow quickly, according to various crypto analysts."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlLWlzLXdoZW4tZXRoZXJldW0tZXRoLW1pZ2h0LXJlYWNoLWl0cy1hdGgtYWdhaW4tdGhpcy1hbmFseXN0LWNoaXBzLWluL9IBZ2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlLWlzLXdoZW4tZXRoZXJldW0tZXRoLW1pZ2h0LXJlYWNoLWl0cy1hdGgtYWdhaW4tdGhpcy1hbmFseXN0LWNoaXBzLWluLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Here is When Ethereum (ETH) Might Reach Its ATH Again: This Analyst Chips in - CryptoPotato",
        "content": "TL;DR\n\nEthereum (ETH) is showing strong performance, currently trading around $2,000, with predictions of reaching its all-time high of over $4,800.\n\nAnalyst FieryTrading forecasts ETH to reach nearly $5,000 by early 2025, citing a long-term bullish pattern.\n\nThe same analyst predicts a significant rise for Cardano’s ADA, expecting it to exceed $35 by 2025 based on bullish market patterns.\n\n‘Big Gains for ETH’ on the Horizon?\n\nEthereum’s native cryptocurrency – Ether (ETH) – is another asset that has shown strong resilience following the devastating market crash in the second part of 2022. It currently trades at around $2,000 (per CoinGecko’s data), a 70% price increase compared to the first day of the ongoing year.\n\nSome analysts believe the current condition is just the beginning of an uptrend that could eventually take ETH to its all-time high of over $4,800. Such an individual is the one using the TradingView handle FieryTrading.\n\nAccording to them, the coin has been in a bullish mode for the past year and a half, suggesting a further surge in the following months.\n\n“As seen on the chart, ETH has been trading inside a bullish triangle pattern for over 1.5 years. In my eyes, a break out from this pattern might result in big gains for ETH since it will burst through an area full of short-trade stop-losses, which will be forced to buy back their positions,” the analyst argued.\n\nAccording to their analysis, Ether’s jump toward almost $5,000 is expected at the beginning of 2025. “With a stop below the recent swing low and a target around the current ATH, we can construct a very decent long-term trade for this big token,” FieryTrading concluded.\n\nThe Analyst’s Take on ADA\n\nApart from predicting ETH’s possible price trajectory, FieryTrading has also given their two cents on Cardano’s native token – ADA.\n\nThey believe the asset is poised for an astonishing increase toward $35 in two years based on certain parallel channels that hint about the beginning of a bull run:\n\n“Since the pattern has now been confirmed, we can take a look at the next bull-market top. Assuming that the bull-market top will be somewhere in 2025 and that ADA will continue to follow this pattern, we can make the assumption that ADA will top somewhere above $35.”"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9lLWFjYy1ldGhlcmV1bS1idXRlcmluLWVmZmVjdGl2ZS1hY2NlbGVyYXRpb25pc20v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "What is e/acc? Ethereum's Buterin Weighs in on Silicon Valley's Latest Trend: Effective Accelerationism - CCN.com",
        "content": "Key Takeaways\n\nEffective accelerationism has gained a following among Silicon Valley bigshots.\n\nAdvocates, including Marc Andreessen and YCombinator CEO Gary Tan, have added “e/acc” to their X handles.\n\nVitalik Buterin said he is sympathetic to the e/acc perspective but also criticized on several points.\n\nAs well as developing many of the digital innovations that shape the world today, Silicon Valley has also spawned a variety of philosophical movements over the years, often garnering mainstream attention after being picked up by influential tech bosses.\n\nIn the latest example of the phenomenon, business leaders, including YCombinator CEO Gary Tan and digital innovator-cum-venture capitalist Marc Andreessen, have endorsed a fiercely pro-AI techno-philosophy known as “effective accelerationism,” often shortened to e/acc. And now, Ethereum founder Vitalik Buterin has waded into the debate too.\n\nMarc Andreessen’s Techno-Optimism\n\nWriting in his personal blog on Monday, November 27, Buterin responded to Andreessen’s Techno-Optimist Manifesto , in which American businessman articulates his views on an idea that is fundamental to the intellectual culture of Silicon Valley: the notion of technology as a force for good that must be harnessed in the name of progress.\n\nA kind of polemic against what he perceives as a prevailing pessimistic discourse on technology, the views contained within Andreessen’s manifesto place it firmly in the accelerationist camp of political philosophies.\n\nTHE TECHNO-OPTIMIST MANIFESTO part 1 “You live in a deranged age — more deranged than usual, because despite great scientific and technological advances, man has not the faintest idea of who he is or what he is doing.”\n\n— Walker Percy “Our species is 300,000 years old. For the… — Marc Andreessen 🇺🇸 (@pmarca) October 16, 2023\n\nFor anyone familiar with his political and economic beliefs, Andreessen’s latest monologue is continuous with a long-running ideological project. Over the years, the influential technology investor had often spoken of his admiration for the works of Ray Kurzweil and the controversial father of accelerationism, Nick Land.\n\nThe addition of “effective,” however, is more recent.\n\nAlongside other prominent figures within the American technology sector, in 2023, Andreessen praised the pseudonymous internet personalities Beff Jezos and Bayes Lord, who coined the term e/acc in 2022.\n\ne/acc is the cultural framework of a more advanced civilization assembling itself from the future. — Beff Jezos — e/acc ⏩ (@BasedBeffJezos) November 28, 2023\n\nIn Land’s initial formulation, accelerationism posits that there is no way to resist or slow the “techno-capital machine,” which can only accelerate the inevitable advance of technology.\n\nInflected through a digital culture that draws as much from SciFi movies and 4Chan mythology as it does the realm of traditional academia, e/acc has moved the discussion forward somewhat.\n\nFrom the inevitability of the forward march of capitalism, proponents of the new theory embrace acceleration as much as possible, rejecting outright any attempts to curb technological progress.\n\nVitalik Buterin Cautions Against AI Risks\n\nWhile Buterin is sympathetic to Andreessen’s techno-optimism, the two men diverge on the issue of Artificial Intelligence (AI).\n\nAndreessen’s view can be summed up by his assertation that “any deceleration of AI will cost lives.” Arguing against the precautionary principle, the Silicon Valley investor rejects any attempt to constrain technological growth, stating that “there is no material problem […] that cannot be solved with more technology.”\n\nMeanwhile, although he broadly aligns with Andreessen’s criticism of anti-growth narratives, Buterin makes a point of distinguishing AI from other technologies. Observing that “AI is fundamentally different from other tech,” the Ethereum founder said it warrants a uniquely cautious approach.\n\nNew monster post: my own current perspective on the recent debates around techno-optimism, AI risks, and ways to avoid extreme centralization in the 21st century.https://t.co/6lN2fLBUUL pic.twitter.com/h5aIyFNCoh — vitalik.eth (@VitalikButerin) November 27, 2023\n\nButerin’s understanding of AI acknowledges that its capacity for self-improvement undermines the idea that any negative consequences can simply be countered with more advanced technology at a later date.\n\nMoreover, while the prospect of a Skynet-style superintelligence turning against humanity might seem outlandish in 2023, Buterin made the case that in the wrong hands, contemporary AI already poses a significant threat to human freedom:\n\n“My basic fear is that the same kinds of managerial technologies that allow OpenAI to serve over a hundred million customers with 500 employees will also allow a 500-person political elite, or even a 5-person board, to maintain an iron fist over an entire country. With modern surveillance to collect information, and modern AI to interpret it, there may be no place to hide.”\n\nConsidering the rapid pace of AI development in recent years, Buterin isn’t the only one who has voiced concerns.\n\nAround the world, most politicians and business leaders reject the hardline accelerationist stance and acknowledge that some checks and balances are needed. However, the question of what the appropriate level of restraint is remains contested.\n\nAmong AI developers, disagreement on the matter has created a growing rift between those who favor unbridled growth and those who support exercising restraint.\n\nOn one side, there are those like Emmett Shear, who lean toward moderation. Before his short-lived tenure as the CEO of OpenAI, Shear made it clear that he thought AI was evolving too quickly. “If we’re at a speed of 10 right now, a pause is reducing to 0. I think we should aim for a 1-2 instead,” he stated in September.\n\nNow, however, Altman is once again at the reigns. Newly empowered by a board shakeup that was one of the conditions of his return, Altman’s leadership, while unlikely to endorse a full-blown e/acc agenda, nonetheless signals that the techno-optimists are back in charge."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9pcy1ldGgtYWJvdXQtdG8tcGx1bmdlLWRlZXBlci1iZWxvdy0yay1ldGhlcmV1bS1wcmljZS1hbmFseXNpcy_SAVxodHRwczovL2NyeXB0b3BvdGF0by5jb20vaXMtZXRoLWFib3V0LXRvLXBsdW5nZS1kZWVwZXItYmVsb3ctMmstZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Is ETH About to Plunge Deeper Below $2K? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Technical Analysis\n\nBy TradingRage\n\nEthereum’s price has been on the rise for the past few months, breaking above several resistance levels. Yet, the market is currently consolidating around the $2,000 mark, failing to continue its bullish momentum.\n\nThe Daily Chart\n\nOn the daily timeframe, the price has been consolidating around the $2,000 level after getting rejected from the $2,150 area once earlier.\n\nYet, the $2,150 level has rejected the price once again, and the market is currently testing the $2,000 level, which has turned into a support now. If it is broken down, it would be likely that a double-top pattern forms and a deeper decline occurs.\n\nConsidering the fact that the relative strength index is still showing values above 50%, which means that the momentum is in favor of the buyers, a bearish reversal seems improbable.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour chart, the recent price range becomes more clear. The price has been forming a triangle which is a classical continuation pattern.\n\nTherefore, in case a breakout occurs to the upside, the market will likely begin another bullish wave. Yet, the relative strength index is demonstrating a bearish momentum at the moment, showing values below 50%. Therefore, a drop to the lower boundary of the pattern is expected first.\n\nSentiment Analysis\n\nBy TradingRage\n\nOpen Interest\n\nAnalyzing the futures market sentiment could provide beneficial insight for the short term.\n\nThis chart represents the Ethereum open interest, which measures the number of open perpetual futures contracts on a daily basis. Higher values typically result in high volatility and probable bearish reversals, while lower values indicate a more sustainable trend.\n\nCurrently, it is evident that the open interest has been on the rise. But, it has yet to reach the values last seen during the all-time highs range. As a result, while corrections are always possible, the futures market is still far from overheating, and the current bullish trend is likely to continue in the coming weeks."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2NyeXB0by9iZXN0LWV0aGVyZXVtLXdhbGxldHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "15 BEST Ethereum Wallets of 2023 - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vY29pbmdhcGUuY29tL2VkdWNhdGlvbi9ob3ctdG8tZWFybi1mcmVlLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "How To Earn Free Ethereum? A Step by Step Guide - CoinGape",
        "content": "Key Takeaways Explore ways you can earn free Ethereum via simple methods like referrals and maximize your profits.\n\nThere are several risk-free options to get free ETH like crypto sign up bonuses, referral rewards, crypto staking rewards, and airdrops.\n\nEthereum or ETH is one of the most popular cryptocurrencies to invest in the world. The coin is next to Bitcoin in terms of market capitalization, which depicts that the coin is wildly popular among crypto enthusiasts. Usually, one needs to shell out some cash to purchase Ethereum. However, there are several ways to score free Ethereum. In this guide, we will help you earn free Ethereum via simple methods and maximize your profits.\n\nEarning Free Ethereum Crypto enthusiasts can earn free Ethereum in their crypto wallets by leveraging multiple methods. Here we have curated trusted methods, like referrals, that are really simple and can be done numerous times to make a fortune.\n\n5 Ways to Earn Free Ethereum There’s nothing better than getting free Ethereum. But as you know, nothing in the world comes for absolutely free. Even in the crypto world, you will need to complete small tasks to get free ETH in your crypto wallets. Here we have shared step-by-step guides on popular ways of earning free ETH.\n\n1. Step-by-Step Guide To Earn Free Ethereum Via Sign-up Bonuses Several crypto wallets and exchange platforms, like BuyUCoin or AQRU.io offer free Ethereum, on joining as crypto signup bonuses program. You can use these offers to get free Ethereum. Here’s how you can earn free Ethereum via sign-up bonuses: Step 1: Sign up on a crypto platform like BuyUCoin or AQRU.io. Step 2: Verify your email to activate your account. Step 3: Login and go to the promotions section. Step 4: Follow the instructions on the platform to get free Ethereum by only signing-up.\n\n2. Step-by-Step Guide To Earn Free Ethereum Via Ethereum Staking Ethereum staking is one of the most popular methods of earning free Ethereum. However, in this method, one needs to already own at least 32 ETH to make more Ethereum by joining the staking pool. Here’s how you can earn free ETH by Ethereum Staking: Step 1: Firstly, you need to choose a secure crypto staking platform. Step 2: Log in or create an account on the selected staking platform. Step 3: Deposit your 32 ETH into the staking pool’s smart contract. Step 4: Follow platform instructions and start earning free ETH through Ethereum staking.\n\n3. Step-by-Step Guide To Earn Free Ethereum Via Ethereum Trading Another popular method to earn free Ethereum is through trading Ethereum. Like Ethereum Staking you need to have some Ethereum to start with Ethereum trading. You can choose any reliable crypto exchange platform for trading Ethereum and earn free ETHs by going through the following steps: Step 1: Make sure that you have some ETH in your wallet that you will be using for trading ETH. Step 2: Choose a popular crypto exchange platform like Binance or Coinbase. Step 3: Log in or create and verify your account on the chosen exchange. Step 4: Deposit Ethereum into your exchange account. Step 5: Start ETH trading and try to make free ETH out of it. However, do note that trading of Ethereum could be risky and you can end up incurring losses if you don’t place your bets right. The method is usually opted for by seasoned crypto enthusiasts who can predict crypto movements.\n\n4. Step-by-Step Guide To Earn Free Ethereum Via Referrals One of the simplest and easiest ways to make free Ethereum is through referrals. Several crypto platforms like crypto wallets or crypto exchanges offer free Ethereum or other crypto coins on successful referrals. Here’s how you can get free ETH through referrals: Step 1: Sign up on a crypto platform with a referral program. Step 2: Get your unique referral link from the platform’s referral program section. Step 3: Share the link with friends or on social media to get more users on the platform. Step 4: Earn free Ethereum when others sign up using your referral link. Step 5: Keep sharing and accumulating rewards through successful referrals.\n\n5. Step by Step Guide To Earn Free Ethereum Via Claiming Airdrops Last but not least, you can get free Ethereum tokens by claiming airdrops. Several companies keep organizing Ethereum airdrops and you can participate in any of them to stand a chance of winning free Ethereum. Here’s how you can get free Ethereum via claiming airdrops:\n\n\n\nStep 1: Stay informed about upcoming Ethereum airdrops by joining social media channels, forums, or new platforms where airdrop announcements are made. Step 2: Follow the instructions provided for each airdrop, which may include tasks like social media engagement or joining a crypto telegram group. Step 3: Submit the necessary information, such as your Ethereum wallet address, to receive the airdropped tokens. Step 4: Keep an eye on your wallet for the airdropped Ethereum tokens.\n\nConclusion Long story short, you can follow any of the methods mentioned above to get free Ethereum. These easy and simple methods will help you boost your overall Ethereum ownership as well as crypto wealth."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMipAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtNDAtMDAwLWluLXRoZS1jYXJkcy1mb3ItYnRjLWFzLXRoaXMtYnVsbGlzaC1jYWxsLWV4ZWN1dGVzLTIwMjMxMTI4MjEwMNIBqAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLTQwLTAwMC1pbi10aGUtY2FyZHMtZm9yLWJ0Yy1hcy10aGlzLWJ1bGxpc2gtY2FsbC1leGVjdXRlcy0yMDIzMTEyODIxMDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: $40,000 in the cards for BTC as this bullish call executes - FXStreet",
        "content": "Share:\n\nBitcoin price could run 5% north to test the $40,000 psychological level amid rising momentum and bullish RSI crossover.\n\nEthereum price coils up for a 5% move past the range high at $2,141 with the RSI mirroring Bitcoin momentum.\n\nRipple price eyes 10% gain to the supply barrier at $0.6582 but only if the $0.5981 support level holds.\n\nBitcoin (BTC) price is trading with a bullish bias, leading the broader market north with a price action characterized by higher highs. It points to growing volatility with forces such as the legal troubles of Binance and spot exchange-traded funds (ETFs) approvals chatter continuing to drive the market.\n\nEthereum (ETH) and Ripple (XRP) prices are also teasing with bullish biases, hinting at bullish moves depending on how the bulls play their hands.\n\nAlso Read: Bitcoin price gains might be sustainable with declining stablecoin dominance\n\nBitcoin could move north if RSI crossover is enough to go by\n\nBitcoin (BTC) price has breached the $38,008 resistance level, though not decisive just yet, to trade for $38,139 at the time of writing. There remains potential for a stretch to the range high at $38,414, or in a highly bullish case, a neck up to tag $40,000.\n\nThe Relative Strength Index (RSI) is moving north and is just about to cross above the signal line (yellow band). Historically, every time this crossover happens, BTC reacted with a bold move north, thereby qualifying the crossover as a buy signal.\n\nIn the same way, the Awesome Oscillator (AO) continues to hold in positive territory, showing that bulls still have control despite a strong bearish pull.\n\nBTC/USDT 1-day chart\n\nOn the other hand, increased selling pressure could see Bitcoin price fall back below the $38,008 support, or worse, test the $35,487 support. In a more dire case, the slump could see BTC lose the support confluence between the horizontal line and the 50-day Simple Moving Average (SMA) at $33,912. A break and close below this level would invalidate the bullish thesis, setting the tone for an extension south to the $30,000 psychological level.\n\nAlso Read: Bitcoin’s bull trend in question as spot ETF momentum fades\n\nEthereum price eyes a 5% climb\n\nEthereum (ETH) price eyes a 5% climb to test the $2,141 range high before a possible correction, with the bullish breaker still holding as a support zone. The immediate support is at $2,029, atop which ETH continues to sit. Like in the case for Bitcoin, the RSI is about to cross above the signal line, hinting at a possible move north.\n\nETH/USDT 1-day chart\n\nHowever, if sellers have their way, Ethereum price could fall into the supply zone turned bullish breaker, confirming the continuation of the move south by breaking and closing below the midline of this order block at $1,935.\n\nThe slump could extrapolate for Ethereum price to flip the bullish breaker back into a supply zone under the $1,864 support.\n\nAlso Read: Ethereum whale activity could pave way for ETH price to hit new yearly highs\n\nRipple price must hold above $0.5981 for 10% gain to play out\n\nRipple (XRP) is coiling up for a 10% move to the supply barrier stretching from $0.6582 to $0.7186, but it all depends on whether the $0.5981 support level holds. To confirm the uptrend, XRP must shatter the midline of the supply zone at $0.6857. In a highly bullish case, the $0.8000 psychological level could be tagged soon.\n\nXRP/USDT 1-day chart\n\nOn the other hand, if the bears dominate, selling pressure could send XRP price below $0.5981, thereby invalidating the bullish thesis. In an extended move south, Ripple price could test the 50-day SMA at $0.5853, with prospects for more losses past the 200 and 100-day SMAs at $0.5531 and $0.5480, respectively.\n\nAlso Read: XRP price to pull north as Ripple beckons financial institutions to adopt XRPL XRP token."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLXNheXMtYWktY291bGQtcG9zZS1leGlzdGVudGlhbC1yaXNr0gFRaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtcy12aXRhbGlrLWJ1dGVyaW4tc2F5cy1haS1jb3VsZC1wb3NlLWV4aXN0ZW50aWFsLXJpc2s_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Says AI Could Pose \"Existential Risk\" - U.Today",
        "content": "Advertisement\n\nVitalik Buterin, the co-founder of Ethereum, has issued a stark warning about artificial intelligence (AI).\n\nHe’s not grouping AI with usual tech advancements like smartphones or social media. Instead, Buterin places AI in a category of its own due to its potential to revolutionize society (much like the printing press or the wheel did).\n\nThe twist? AI might outsmart us all, potentially becoming the dominant force on Earth. It's a leap into uncharted territory.\n\nThe threat of superintelligent AI\n\nButerin’s concerns extend beyond typical tech fears. He cautions that a superintelligent AI could perceive humans as a threat, leading to catastrophic outcomes.\n\nAnd it’s not a distant future issue – AI is advancing rapidly. While we’d ideally want these superintelligent beings to be our allies, programming them to coexist with humans safely is a challenge we haven’t yet solved.\n\nThis might sound like sci-fi, but it’s a topic being taken seriously in tech circles. Rob Bensinger from MIRI illustrates diverse opinions on the AI threat level.\n\nIn a striking revelation, a 2022 survey among machine learning experts suggested a 5-10% chance of AI leading to human extinction.\n\nDespite sounding speculative, these concerns have been around for over a decade and warrant attention.\n\nEnvisioning the future with AI\n\nButerin also invites us to consider what life would be like in a world ruled by AI. He refers to Iain Banks's Culture series, where humans coexist with powerful AIs.\n\nThis imagined future offers longevity, health, and entertainment, but at a potential cost – humans may not be in control.\n\nThis prompts a crucial question about our future coexistence with AI: Will we be partners, or merely passengers in a world driven by machine intelligence?"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9ldGhlcmV1bS1pbW1pbmVudC1leHBsb3Npb24tb2YtbmV0d29yay1wcm9maXRhYmlsaXR5LXdpdGgtZWlwLTQ4NDQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum: Imminent explosion with EIP 4844 - Cointribune EN",
        "content": "Tue 28 Nov 2023 ▪ 3 min of reading ▪ by Fitah\n\nThe EIP 4844 or Proto-Danksharding is arguably one of the most significant updates for Ethereum, the world’s second-largest cryptocurrency. Highly anticipated by the community, its activation is planned for the first quarter of 2024. This update will enable a reduction in layer 2 (L2) transaction fees. Moreover, it will enhance the overall performance of Ethereum.\n\nReduction of Fees and Network Throughput Improvement\n\nThe EIP 4844 aims to reduce transaction fees on layer 2 (L2) solutions, potentially decreasing them by a factor of seven. The reduction of transaction fees will be accompanied by an increase in bandwidth on the network. According to expert Ryan Berckmans, the EIP 4844 should allow for the creation of a more efficient market for data storage. This is what he calls “blob market clearance,” which will notably increase Ethereum’s throughput by sixfold.\n\nEthereum's EIP 4844 data blobs launch in ~3 months to greatly reduce L2 fees\n\n\n\nBy now, many people know that blobs initially give us ~7x data bandwidth (iirc), which is huge but not enough for global ubiquity.\n\n\n\nWhat's less well known may be that\n\n\n\n1) blob gas doesn't compete with… — Ryan Berckmans ryanb.eth (@ryanberckmans) November 25, 2023 Ryan Berckmans, an ETH community member on Twitter\n\nThe upgrade won’t impact the gas costs of the main layer (L1), ensuring the stability of execution costs. Consequently, Ethereum’s profitability and throughput will increase by 600%. With the introduction of the EIP 4844, L2 solutions will evolve the Ethereum crypto network in an unprecedented way, as they will benefit from the upgrade and contribute to Ethereum’s scaling.\n\nExcellent Prospects in Sight for ETH Crypto\n\nThe expected improvements to the Ethereum ecosystem should strengthen its position in the crypto market. According to data, the network’s revenue growth over the last twelve months in the third quarter of 2023 was 10.32%. The quarterly growth rate of 12.57% during the same period highlights a robust upward trend.\n\nThe upgrade could further boost revenue growth due to increased network efficiency and reduced gas costs. Notably, the ETH crypto is priced close to its 52-week high, at 99.32% of its maximum value. This seems to indicate strong investor confidence. The next release of Ethereum’s financial results, set for February 1, 2024, will provide more insight into the financial impact of upcoming upgrades.\n\nIn the meantime, on the market, the price of Ethereum is facing a major resistance: the annual peak at $2,138. Since Friday, the second-largest cryptocurrency by market capitalization has indeed recorded a decline of 5.5%. Currently, the ETH crypto is back to the psychological area of $2,000.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvLm5ld3Mvdml0YWxpay1idXRlcmluLXVudmVpbHMtbWFqb3Itb3ZlcmhhdWwtb2YtZXRoZXJldW0tc3Rha2luZy10by1lbmhhbmNlLWRlY2VudHJhbGl6YXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Vitalik Buterin unveils major overhaul of Ethereum staking to enhance decentralization - crypto.news",
        "content": "Vitalik Buterin plans to overhaul ETH staking and has outlined the progression of Ethereum’s roadmap, particularly focusing on the forthcoming Dencun update.\n\nIn a recent interview with the NFT platform Defiant while in Turkey, Ethereum’s co-founder Vitalik Buterin addressed the issue of staking centralization in the Ethereum network.\n\nButerin underscored the importance of reforming Ethereum’s staking process to support more effective mining and staking pools, with the ultimate goal of boosting the platform’s decentralization.\n\nThe initiative is a response to the challenges of data availability in off-chain systems, which have been sluggish due to high demands in the short and medium term.\n\nYou might also like: Vitalik Buterin publishes article discussing dimensions of connectedness to Ethereum\n\nVitalik Buterin outlines Ethereum’s roadmap ahead\n\nButerin highlighted the upcoming Ethereum Improvement Proposal (EIP) 4844, known as Danksharding, which is expected to significantly increase the data map space to 16 Megabytes per slot. This upgrade is part of Ethereum’s continuous efforts to improve scalability and efficiency.\n\nButerin also proposed a new voting system for governing future changes on the Ethereum network. This system aims to provide a more democratic and less disruptive process, potentially eliminating the need for hard forks. This strategic move is in line with Ethereum’s ongoing evolution to address scalability challenges.\n\nSlated for early 2024, the Dencun upgrade is set to be a significant milestone in Ethereum’s development journey. This upgrade aims to play a pivotal role in improving Ethereum’s scalability, efficiency, and decentralization.\n\nEthereum chief lauds UTxO payment model\n\nDuring the interview, Buterin also delved into the potential adoption of the Unspent Transaction Output (UTxO) model, a system currently employed by blockchains like Bitcoin and Cardano. This exploration signifies Ethereum’s willingness to consider a variety of strategies to tackle the existing challenges in its network.\n\nUpon Buterin’s reference to UTxO, there was an immediate and humorous response from Cardano enthusiasts on the microblogging site X. Charles Hoskinson, the founder of Cardano, joined in with a satirical remark, quipping, “Ethereum 3 will solve it all,” in a light-hearted jab at the discussion.\n\nNo worries, Ethereum 3 will have it all sorted! https://t.co/Td0Hm58eic — Charles Hoskinson (@IOHK_Charles) November 24, 2023\n\nResponding to a comment, Hoskinson expressed his view that Cardano’s achievements would likely never be acknowledged as significant by Vitalik or the Ethereum team. He also suggested that Ethereum is only now discovering solutions that Cardano has been working on for years.\n\nFollow Us on Google News"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvbmV3LWV0aGVyZXVtLWwyLXByb3RvY29sLWJsYXN0LWZhY2VzLXNjcnV0aW55LWFzLXBhcmFkaWdtLXJhaXNlcy1jb25jZXJucy1oZXJlcy13aGF0LXlvdS1uZWVkLXRvLWtub3cuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "New Ethereum L2 Protocol Blast Faces Scrutiny as Paradigm Raises Concerns – Here's What You Need to Know - Cryptonews",
        "content": "New Ethereum L2 Protocol Blast Faces Scrutiny as Paradigm Raises Concerns – Here’s What You Need to Know\n\nSource: Adobe / lumerb\n\nBlast, the newly announced Ethereum (ETH) layer-2 scaling network led by the founder of top NFT marketplace Blur, has faced some controversy despite gaining notable traction.\n\nFor one, Paradigm, a prominent venture capital firm in the crypto space, has outlined numerous issues with the scaling solution while acknowledging its positive aspects.\n\nIn a Friday post on X (formerly Twitter), Paradigm’s Head of Research and General Partner Dan Robinson expressed reservations about Blast’s launch, noting that his comments represented the views of Paradigm.\n\nRobinson highlighted several issues with the announcement and execution of Blast, stating that the decision to launch the bridge before the layer-2 network and the three-month withdrawal restriction set an unfavorable precedent for other projects.\n\nThere are a lot of components of Blast that I’m excited about and would be interested in engaging with people on. That said, we at Paradigm think the announcement this week crossed lines in both messaging and execution. For example, we don’t agree with the decision to launch the… — Dan Robinson (@danrobinson) November 26, 2023\n\nHe further criticized what he perceived as marketing that undermined the work of a serious team.\n\nBlast positions itself as an Ethereum layer-2 network that offers native yield for Ethereum and stablecoins, allowing users to stake their funds and earn interest-like returns.\n\nThe network also promises rewards similar to those offered by Blur, attracting early adopters who lock up their funds in anticipation of potential airdrops.\n\nBlur has already distributed hundreds of millions of dollars worth of its BLUR token to NFT traders, surpassing former leader OpenSea in the process. This success has likely piqued the interest of crypto users.\n\nWhile users eagerly lock up their funds ahead of Blast’s network launch in 2024, the network itself is not yet live.\n\nThe funds cannot be withdrawn until the mainnet rollout expected in February, raising security concerns given the history of exploits involving network bridges in the crypto industry.\n\nSome traders and industry participants have even labeled Blast as a Ponzi scheme due to its rewards and referral model.\n\nBlast has garnered significant attention and locked over half a billion dollars worth of funds from users eager to earn yield and rewards\n\nBlast Co-Founder Addresses Controversy\n\n\n\nBlast and Blur co-founder Tieshun “Pacman” Roquerre responded to the criticisms in a Twitter thread on Friday, addressing what he referred to as misunderstandings surrounding Blast.\n\nRoquerre clarified that Paradigm, one of the investors in Blast’s $20 million seed round, had no role in Blast’s rollout plans.\n\nHe further revealed that Paradigm had requested changes to the launch, which Blast was considering, but emphasized that ultimate decisions would be made internally.\n\n1/ There's a meme going around that Blast is a ponzi. The yield that Blast provides users can feel too good to be true, so this meme is understandable. But to put it simply, the yield Blast provides comes (initially) from Lido and MakerDAO. Lido yield comes from ETH staking… — Pacman | Blur + Blast (@PacmanBlur) November 24, 2023\n\nRobinson, in his Sunday statement, commended Pacman and his team for the successful launch of Blur, which disrupted the NFT market and provided substantial rewards to users.\n\nHowever, he acknowledged that Paradigm and Blast disagreed on certain aspects of the rollout.\n\n“We invest in strong, independent founders who we don’t always agree with. But we understand that people may look to us to set an example on best practices in crypto.”\n\n“We don’t endorse these kinds of tactics and take our responsibility in the ecosystem seriously,” Robinson concluded."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tcGxhbnMtdG8tcmVkZXNpZ24tZXRoZXJldW0tc3Rha2luZy1wcmFpc2VzLXV0eG8uaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Plans to Redesign Ethereum Staking, Praises UTXO Payment Model - Cryptonews",
        "content": "Vitalik Buterin Plans to Redesign Ethereum Staking, Praises UTXO Payment Model\n\nIn a recent interview with the NFT platform Defiant during his visit to Turkey, Ethereum co-founder Vitalik Buterin tackled the issue of staking centralization within the Ethereum network.\n\nButerin highlighted the necessity to revamp Ethereum’s staking mechanism to foster healthier mining and staking pools, ultimately aiming to enhance the overall decentralization of the platform.\n\nThe proposed initiative comes as a response to the challenges posed by the sluggish movement of data availability in off-chain systems, primarily attributed to the high demands in the near-term and mid-term.\n\nVitalik Shares Dankshrading Details\n\n\n\nAddressing an imminent upgrade in the Ethereum ecosystem, Buterin shed light on EIP 4844, commonly known as Danksharding.\n\nThis upgrade is poised to enhance the data map space, increasing it to 16 Megabytes per slot. The post-upgrade phase will involve configuring parameters and attributes to refine Ethereum’s scalability and efficiency.\n\nIn a shift toward a more democratic and less disruptive process, Buterin proposed the implementation of a voting system to govern future changes on the Ethereum network, potentially eliminating the need for hard forks. This strategic move aligns with Ethereum’s continuous evolution to address scalability challenges.\n\nThe Dencun upgrade, a crucial element in Ethereum’s roadmap, is expected to go live in early 2024. This upgrade aims to play a pivotal role in improving Ethereum’s scalability, efficiency, and decentralization.\n\nEthereum Founder Praises UTxO Payment Model\n\n\n\nDuring the interview, Buterin also explored the possibility of adopting the Unspent Transaction Output (UTxO) approach, a model utilized by blockchains such as Bitcoin and Cardano. This consideration reflects Ethereum’s openness to diverse approaches in addressing existing challenges within its network.\n\nWhile Buterin’s proposals generated discussions within the crypto community, Cardano founder Charles Hoskinson responded with a touch of sarcasm, stating, “No worries, Ethereum 3 will have it all sorted.”"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby8yMDc0NDMvbWFnaWMtZWRlbi1jcm9zcy1jaGFpbi1uZnQtd2FsbGV0LWJpdGNvaW4tZXRoZXJldW0tc29sYW5hLXBvbHlnb27SAWFodHRwczovL2RlY3J5cHQuY28vMjA3NDQzL21hZ2ljLWVkZW4tY3Jvc3MtY2hhaW4tbmZ0LXdhbGxldC1iaXRjb2luLWV0aGVyZXVtLXNvbGFuYS1wb2x5Z29uP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Magic Eden Launches Cross-Chain NFT and Crypto Wallet for Bitcoin, Ethereum, Solana, and Polygon - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMagic Eden sees a crypto future that spans multiple blockchains—and is launching its crypto wallet browser extension in closed beta to support that aim, the firm behind the NFT marketplace announced Monday.\n\n“We believe in a multi-chain world for NFTs,” Magic Eden CEO and co-founder Jack Lu told Decrypt in an interview.\n\n“Up until today, for a user to really experience all the different products and features and great content that we have on every chain, they effectively have to download three wallets,” Lu said of the current challenges plaguing the wallet space that have led to user fragmentation on Magic Eden.\n\nAD\n\nAD\n\nThe marketplace’s crypto wallet is launching for the Google Chrome browser first, but a Safari browser version and mobile app are also in the works. The mobile app could come into fruition as soon as early 2024, Lu shared.\n\nThe wallet will be compatible with the four blockchains that Magic Eden currently supports on its NFT marketplace: Bitcoin, Ethereum, Solana, and Ethereum scaling network Polygon.\n\nThe initial Magic Eden wallet will be self-custodied, meaning users will have full control over their crypto assets and will have to keep a seed phrase—a lengthy passphrase consisting of many words—secure.\n\nBut if downloading three different crypto wallets to buy NFTs on Ethereum, Solana, and Bitcoin is frustrating and cumbersome for users, why still make them deal with seed phrases at all? Why not offer a Magic Eden-custodied wallet with a one-click email solution instead?\n\nLu said that holding your own crypto and NFTs is crucial to “the ethos of Web3.”\n\nAD\n\nAD\n\nIntroducing Magic Eden Wallet, a wallet made for Magic Eden users and cross-chain collectors. Beta version is now live and only available to a small group of early testers! Want to give it a try? You can get on the waiting list by downloading the extension and entering your… pic.twitter.com/5DsS5qhdlQ — Magic Eden 🪄 (@MagicEden) November 27, 2023\n\n“We very much want to live up to that,” Lu said of Magic Eden’s belief in Web3, a term which refers to a hypothesized next iteration of the internet that offers users decentralized ownership through crypto. “That’s why we wanted to stick to something self-custodial.”\n\nMagic Eden’s wallet promises a more user-friendly, cross-chain solution for crypto fans, allowing them to avoid bridging (transferring crypto from one chain to another) by doing cross-chain token swaps through the wallet.\n\nLu is also very much aware of the common issues that afflict crypto browser extensions. For instance, when users have multiple wallets installed—like MetaMask, Coinbase Wallet, Phantom, or the Ronin Wallet, for example—they can occasionally “fight” each other to connect to a website, simultaneously popping up at once and creating connection issues and confusion.\n\n“We're actually working pretty deeply right now to make sure that the wallets don't fight each other as much,” Lu said, citing Magic Eden’s work on its wallet with crypto tech firm Exodus.\n\nIn addition to cross-chain swaps, the Magic Eden wallet will also offer users the ability to buy crypto with fiat currency from within the wallet through a MoonPay integration, Lu said. The wallet will include NFT-focused features like cross-chain portfolio tracking, Bitcoin Ordinals support, and simultaneous connection to multiple blockchains.\n\n“I think self-custody and email login—and those seamless implementations—they're not mutually exclusive,” Lu told Decrypt of the wallet’s potential future. “There’s a lot of very exciting technologies that we're looking to tap into to make that onboarding experience much more smooth, much more familiar to the mainstream user.”\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1haS1wb3Nlcy1zZXJpb3VzLXRocmVhdC10by1odW1hbml0eXMtZG9taW5hbmNlLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin: AI Poses Serious Threat to Humanity's Dominance - Cryptonews",
        "content": "Ethereum Co-Founder Vitalik Buterin: AI Poses Serious Threat to Humanity’s Dominance\n\nEthereum co-founder Vitalik Buterin has issued a warning about the potential dangers of super-advanced artificial intelligence (AI) surpassing human intelligence and becoming the dominant species on Earth.\n\nIn a recent post on X (formerly Twitter), the Ethereum (ETH) mastermind emphasized that the control and intervention of humans in AI development will determine the outcome of this scenario.\n\nButerin argued that AI is fundamentally different from previous inventions such as social media, airplanes, and the printing press, as it has the capability to create a new type of “mind” that could be detrimental to human interests.\n\nHe expressed concern that superintelligent AI, if left unchecked, could view humans as a threat to its own survival and potentially lead to the extinction of humanity.\n\n“AI is […] a new type of mind that is rapidly gaining in intelligence, and it stands a serious chance of overtaking humans’ mental faculties and becoming the new apex species on the planet.”\n\nWhile acknowledging that the likelihood of such extreme outcomes is low, Buterin highlighted the need for humans to take precautions.\n\nAI risk 2: would a world with superintelligent AIs even be a world we would feel satisfied living in? On the instability of outcomes other than us being pets, and the failures of scifi to present realistic alternatives. pic.twitter.com/o9z8s6QAej — vitalik.eth (@VitalikButerin) November 27, 2023\n\nHe proposed the integration of brain-computer interfaces (BCI) as a means to give humans greater control over AI-based computation and cognition.\n\nBCIs establish a direct communication pathway between the brain and external devices, enabling humans to actively participate in decision-making processes.\n\nBy reducing the communication loop between humans and machines to milliseconds, BCIs would ensure that humans retain a level of meaningful agency over the world.\n\nButerin emphasized the importance of humans maintaining responsibility for high-level planning, thus minimizing the risk of AI acting in ways misaligned with human values.\n\n“We [can] reduce the incentive to offload high-level planning responsibility to the AI itself, and thereby reduce the chance that the AI does something totally unaligned with humanity’s values on its own.”\n\nButerin Highlights the Importance of AI Regulation\n\n\n\nButerin also stressed the significance of human intention in guiding AI towards beneficial outcomes for humanity.\n\nHe cautioned against prioritizing profit maximization, highlighting the need for conscious decision-making that aligns with human values and aspirations.\n\nIn his concluding remarks, Buterin praised the ingenuity and creative potential of humankind.\n\nHe emphasized that humans have continuously developed technology to enhance their abilities throughout history and expressed hope that human achievements, such as space travel and geoengineering, will contribute to the preservation and beauty of life on Earth and beyond.\n\n“Two billion years from now, if the Earth or any part of the universe still bears the beauty of Earthly life, it will be human artifices like space travel and geoengineering that will have made it happen.”"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMS8zNTk3MjM5NC9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi10aGlua3MtaWYtYWktdHVybnMtYWdhaW5zdC11cy1pdC1tYXktd2VsbC1sZWF2ZS1uby1zdXLSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzU5NzIzOTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Thinks If AI Turns Against Us, It May 'Well Leave No Survivors And En - Benzinga",
        "content": "Ethereum’s ETH/USD co-founder, Vitalik Buterin, on Monday shed light on his own version of “techno-optimism,” influenced by Marc Andreessen‘s Techno-Optimist Manifesto penned last October, in which Andreessen took a positive stance on AI’s future.\n\nWhat Happened: Buterin in a blog post said, \"This is an extreme claim: as much harm as the worst-case scenario of climate change, or an artificial pandemic or a nuclear war, might cause, there are many islands of civilization that would remain intact to pick up the pieces.\"\n\nHowever, the risks posed by a superintelligent AI that may turn against humanity could signify complete annihilation. \"But a superintelligent AI, if it decides to turn against us, may well leave no survivors and end humanity for good,\" he remarked, worrying that not even Mars could be a refuge.\n\nHe advocated for a future that preserves “human” traits and agency, stating, “If we want a future that is both superintelligent and ‘human’—one where human beings are not just pets, but actually retain meaningful agency over the world—then it feels like something like this is the most natural option.”\n\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\n\nWhy It Matters: Addressing concerns about the future evolution of Ethereum during an AMA on Farcaster, Buterin disclosed that two of his greatest fears were the stagnation of cryptocurrency and the potential dangers associated with AI.\n\nWhen questioned on what occupies his thoughts frequently, the influential developer cited, “AI-related issues,” specifically existential risks derived from it.\n\nPrice Action: At the time of writing, ETH was trading at $1,999, down 1.12% in the last 24 hours according to Benzinga Pro.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\nPhoto by TechCrunch on Flickr"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1yaXBwbGUtZXRoZXJldW0tdGVycmEtY2xhc3NpYy1hbWVyaWNhbi13cmFwLTI4LW5vdmVtYmVyLTIwMjMxMTI4MTkwOdIBmQFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9jcnlwdG9jdXJyZW5jaWVzLXByaWNlLXByZWRpY3Rpb24tcmlwcGxlLWV0aGVyZXVtLXRlcnJhLWNsYXNzaWMtYW1lcmljYW4td3JhcC0yOC1ub3ZlbWJlci0yMDIzMTEyODE5MDk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ripple, Ethereum & Terra Classic — American Wrap 28 November - FXStreet",
        "content": "Terra Luna Classic (LUNC) and Terra Classic USD (USTC) both tokens were trending among traders after noting a surge in their price. Santiment analysts believe these tokens are gaining popularity after their collapse, likely to see a revival.\n\nEthereum price has been affected by the Shanghai hardfork since even before it was activated. But since the upgrade, this week marks the first instance when the market is witnessing the fear of unstaking come to life.\n\nRipple (XRP) price is pulling higher after a prolonged slump, reinvigorating hope among XRP community members. It comes as November 30 draws near, when the market will finally find out what transpired between the US Securities & Exchange Commission (SEC) and Ripple behind closed doors.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS12aXRhbGlrLWJ1dGVyaW4tYWktc3VycGFzcy1odW1hbnMtYXBleC1zcGVjaWVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Vitalik Buterin: AI may surpass humans as the 'apex species' - Cointelegraph",
        "content": "Super-advanced artificial intelligence (AI), left unchecked, has a “serious chance” of surpassing humans to become the next “apex species” of the planet, according to Ethereum co-founder Vitalik Buterin.\n\nBut that will boil down to how humans potentially intervene with AI developments, he said.\n\nNew monster post: my own current perspective on the recent debates around techno-optimism, AI risks, and ways to avoid extreme centralization in the 21st century.https://t.co/6lN2fLBUUL pic.twitter.com/h5aIyFNCoh — vitalik.eth (@VitalikButerin) November 27, 2023\n\nIn a Nov. 27 blog post, Buterin, seen by some as a thought leader in the cryptocurrency space, argued AI is “fundamentally different” from other recent inventions — such as social media, contraception, airplanes, guns, the wheel, and the printing press — as AI can create a new type of “mind” that can turn against human interests, adding:\n\n“AI is [...] a new type of mind that is rapidly gaining in intelligence, and it stands a serious chance of overtaking humans’ mental faculties and becoming the new apex species on the planet.”\n\nButerin argued that, unlike climate change, a man-made pandemic or nuclear war, superintelligent AI could potentially end humanity and leave no survivors, particularly if it views humans as a threat to its survival.\n\n“One way in which AI gone wrong could make the world worse is (almost) the worst possible way: it could literally cause human extinction.”\n\n“Even Mars may not be safe,” Buterin added.\n\nButerin cited an August 2022 survey from over 4,270 machine learning researchers who estimated a 5–10% chance that AI would kill humanity.\n\nHowever, while Buterin stressed that claims of this nature are extreme, there are also ways for humans to prevail.\n\nBrain interfaces and techno-optimism\n\nButerin suggested integrating brain-computer interfaces (BCI) to offer humans more control over powerful forms of AI-based computation and cognition.\n\nA BCI is a communication pathway between the brain’s electrical activity and an external device, such as a computer or robotic limb.\n\nThis would reduce the two-way communication loop between man and machine from seconds to milliseconds and, more importantly, ensure humans retain some degree of “meaningful agency” over the world, Buterin said.\n\nA diagram depicting two possible feedback loops between humans and AI. Source: Vitalik.eth\n\nRelated: How AI is changing crypto: Hype vs. reality\n\nButerin suggested this route would be safer, as humans could be involved in each decision made by the AI machine.\n\n“We [can] reduce the incentive to offload high-level planning responsibility to the AI itself, and thereby reduce the chance that the AI does something totally unaligned with humanity’s values on its own.”\n\nThe Ethereum co-founder also suggested “active human intention” to take AI in a direction that benefits humanity, as maximizing profit doesn’t always lead humans down the most desirable pathway.\n\nButerin concluded that “we, humans, are the brightest star” in the universe, as we’ve developed technology to expand upon human potential for thousands of years, and hopefully many more to come:\n\n“Two billion years from now, if the Earth or any part of the universe still bears the beauty of Earthly life, it will be human artifices like space travel and geoengineering that will have made it happen.”\n\nMagazine: Real AI use cases in crypto, No. 1: The best money for AI is crypto"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vZ3VpZGVzL2Jlc3QtZXRoZXJldW0td2FsbGV0cy5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "11 Best Ethereum Wallets for Beginners in 2024 - Cryptonews",
        "content": "11 Best Ethereum Wallets for Beginners in 2024\n\nThis guide will give you a comprehensive overview of everything you need to know about the best Ethereum wallets for beginners – we also explain how Ethereum wallets work and how to use them.\n\nThe cryptocurrency ecosystem is a dynamic, fast-paced environment. Beginner traders can struggle to navigate the volatility and security requirements needed to engage in safe crypto trading. A user-friendly digital wallet can allow beginners to store their crypto assets such as Ethereum and Bitcoin safely.\n\nThis article dives into the top 11 best Ethereum wallets for beginners. We will help our readers understand how Ethereum wallets work and how they provide security to crypto assets. We will also explore what qualities separate the best Ethereum wallets from others and how users can easily use these wallets for themselves.\n\nThe Top 11 Ethereum Wallets\n\nAfter considering a multitude of factors such as security features, user-friendliness, fees, etc., we list the top 12 best wallets for Ethereum storage.\n\nBest Wallet – Overall, the best Ethereum wallet that provides a non-custodial Web3 app for Ethereum, Polygon, and BSC Mainnet, with Bitcoin coming soon. Users can access a DEX, portfolio management tools, market insights, and exclusive token airdrops on Best Wallet with NFT integration and high-security measures. YouHodler – Leading Ethereum wallet that lets you earn up to 4.5% annual percentage yield on ETH and up to 12% on stablecoins. If you need liquidity, use your ETH as collateral and borrow other cryptocurrencies or fiat. Ledger – One of the best hardware wallets, Ledger offers high security and also has a mobile app to allow trading, staking and lending. Its lack of open-source software has been criticized, however Trezor – Leading hardware wallet, Trezor is one of the absolute safest wallets around but does charge to purchase the physical wallet, while many others are available for free Binance – Connected to crypto’s top exchange, Binance, the Binance wallet supports almost 400 cryptos and allows for easy trading, although it is more vulnerable than other wallets on this list OKX – Linked to the leading exchange, the OKX wallet has excellent staking options for high APYs, as well as a range of DeFi services, but is not available in the US MetaMask – One of the most popular multi-chain wallets, MetaMask has more than 30 million users, cross-chain support, high levels of security and is perfect for beginners Trust Wallet – Another extremely popular choice, Trust Wallet is also backed by Binance, and supports 65 different blockchains, but does not employ cold storage Coinbase – Connected to the leading US-based exchange, the Coinbase wallet has a strong focus on security, and yielding and staking options but does not support some prominent tokens Exodus – The hot wallet has multi-chain support and an NFT marketplace, as well as supporting dApps and is compatible with Trezor – it does not feature 2FA, however MyEtherWallet – The open source wallet is compatible with multiple blcokchains and NFTs, but only supports ETH-based products\n\nReview the Best Ethereum Wallets For Beginners\n\nBeginner traders need to take into account the pros and cons of different types of wallets in order to choose the best Ethereum wallet for their needs. Let’s now review each wallet on our Ethereum wallets list.\n\n1. Best Wallet – Best Ethereum Wallet With Market Insights And Cutting-Edge Features Like NFT & DEX Integration\n\nOn the top of our list of the best Ethereum wallets is Best Wallet . As a cutting-edge, non-custodial wallet, it aims to revolutionize how we manage our digital assets.\n\nBest Wallet offers a single platform for all your tokens, including Ethereum, Polygon, or BSC Mainnet. Furthermore, plans to include the Bitcoin network and other blockchains are underway.\n\nInstead of relying on multiple platforms for market intelligence, Best Wallet offers Market Insights to provide real-time industry news, token sentiment, and event updates.\n\nMoreover, the ‘Upcoming Tokens’ feature lets users stay ahead by getting exclusive access to trending new tokens like Bitcoin Minetrix.\n\nThis lets them gain insights into these tokens before they hit the exchanges and helps them invest early to reap greater rewards.\n\nAlso, the Token Airdrops section will launch soon. This section will help users stay updated on the latest airdrops and allow them to earn free cryptos.\n\nAt the center of the Best Ecosystem is the BEST token. Users gain access to advanced tools, feeless swaps, and NFT drops.\n\nStaking BEST tokens promises exciting benefits, including zero gas fees and exclusive access to new project launches. The platform also offers an exclusive BEST token airdrop for early users of Best Wallet.\n\nThe platform also has a decentralized exchange integration. This DEX is designed to offer hassle-free trading.\n\nWith low fees, advanced market insights, and real-time analytics, users get a better trading experience. And the best part? There is no registration or KYC; you can just connect your wallet and start trading.\n\nNotably, the Best Wallet also supports NFTs. Users can organize, trade, and showcase their NFT collections.\n\nThe platform’s roadmap outlines a structured phase-wise release of features. Users can expect biometric security, multi-wallet support, in-app swaps, a dedicated crypto news feed, an NFT gallery, and innovative staking options in the coming phases.\n\nBest Wallet ensures top-notch security using advanced cryptography, multi-factor authentication, and biometric measures.\n\nInterested users can enter the Best Wallet Telegram channel for the latest updates. You can also check out the platform’s Linktree to get links to its other social media channels like X (Twitter) and Discord.\n\nPros\n\nCross-Chain Compatibility\n\nHolistic Security Framework\n\nUnified Trading Platform\n\nIncentive-driven Ecosystem\n\nCons\n\nPresently limited to only mobile devices. But has plans to launch a browser extension in the near future.\n\nType of Wallet Software Number of Supported Cryptos Ethereum, Polygon, BSC, and others. Fee to Buy ETH Depends on the third-party service providers. Mobile App Yes\n\nCryptoasset investing is highly volatile and unregulated in some EU countries. No consumer protection. Tax on profits may apply.\n\n2. YouHodler – Popular Ethereum Wallet That Comes With Up To 4.5% APY on ETH, Crypto Lending, And Multi-Chain Swaps\n\nYouHodler lets you trade your ETH coins to earn a profit or you can use them in YouHodler’s yield earning program and earn up to 4.5% APY. Stablecoins have one of the best APY of up to 12% for USDT and USDC. But to get this yield for stablecoins and ETH, you need to advance your levels by trading or holding a certain amount of funds in your account.\n\nThe Basic level APY is 2% for ETH and 6% for stablecoins, which is still competitive with other DeFi services and enough to offset the yearly inflation.\n\nThose who you want to diversify can swap your ETH for other coins, or you can directly buy cryptocurrencies within the YouHodler wallet. Other coins include Bitcoin, Ripple, Solana, Tron and Litecoin.\n\nIf you need instant liquidity, you can use your Ethereum as collateral and borrow cryptocurrencies or fiat currencies like EUR, USD, CHF and GBP and withdraw them if you need to with a 90% loan-to-value.\n\nTo keep your mind at ease, YouHodler is regulated in Switzerland and in some EU countries. The funds you keep in your YouHodler’s wallet are secured using the Ledger Vault technology with $150 million in pooled crime insurance. You can increase your wallet’s security by activating 2FA and biometrics.\n\nPros:\n\nSupports multiple cryptocurrencies\n\nUp to 4.5% yield on Ethereum\n\nCrypto loans with 90% LTV\n\nCrypto to fiat exchange\n\nCons:\n\nNot available for US residents\n\n$100 minimum crypto loan\n\nType of Wallet Hot Number of Supported Cryptos Ethereum, Polygon, BSC, and others Fee to Buy ETH No fees, only the spread between bid and ask prices Mobile App Yes\n\n3. Ledger – One of the Best Ethereum Hardware Wallets With High Security, In-App Staking and Swapping\n\nThe Ledger hardware wallet specializes in offering maximum security without compromising user experience. It utilizes a military-grade secure chip called the Secure Element to store the user’s private key. User authentication data is isolated from the internet, providing a high degree of safety.\n\nThe Ledger hardware wallet utilizes the Ledger Live app on desktop and mobile to provide a seamless user experience for crypto enthusiasts. Investors can manage over 5500 tokens using the app. This includes purchasing with a card, swapping via decentralized exchanges, sending and receiving, as well as staking supported coins, including Ethereum. The app also supports Ethereum-based NFTs.\n\nThere are three Ledger wallets to choose from: Ledger Nano S Plus, Ledger Nano X and Ledger Stax. Nano X offers Bluetooth compatibility, which makes it an excellent choice for smartphone users who want to authorize transactions wirelessly.\n\nPros\n\nMaximum security features\n\nMilitary-grade technology\n\nMillions of users\n\nHuge number of cryptos supported\n\nLedger Live to trade, stake and buy Ethereum\n\nCons\n\nNo open-source software\n\nType of Wallet Hardware Number of Supported Cryptos 5,500+ Fee to Buy ETH Variable Mobile App Yes (Ledger Live)\n\n4. Trezor – Security-Focused Hardware Wallet with Simple Functionality\n\nThe Trezor hardware cryptocurrency wallet is one of the most secure crypto wallets, protecting users from all kinds of malicious activities. Hardware wallets keep your seed phrase offline, thus reducing the chances of hacking and data theft.\n\nTrezor Model T, Trezor Model One and Trezor Safe 3 are the three models to choose from. The Trezor Model T is a more advanced wallet design, with wider crypto token support and more comprehensive security features. As a result, it is also significantly costlier than the Model One.\n\nUsers can connect to Trezor’s Suite app which provides several user-friendly features on desktop, mobile and in your browser. Investors can easily trade crypto assets without any additional fees, as you just pay whatever fees the exchange you’re trading on charges.\n\nPros\n\nExtremely secure hardware wallet\n\nComprehensive security features\n\nAbility to recover wallet\n\nMobile app to allow trading\n\nCons\n\nMissing some features of software wallets\n\nType of Wallet Hardware Number of Supported Cryptos 8,000 Fee to Buy ETH Variable Mobile App Yes\n\n5. Binance – Top Ethereum Wallet Linked to Leading CEX Binance\n\nThe Binance wallet is a secure crypto wallet for Ethereum, Binance Beacon Chain and Binance Smart Chain. Its biggest strength is its inherent connection with the Binance crypto exchange.\n\nBinance is the largest Bitcoin and altcoin crypto exchange in the world. It supports 385 different crypto assets and tokens on its platform. Binance’s reputation as the largest crypto exchange in the world allows users to trust its Ethereum wallet.\n\nUsers can operate the Binance crypto wallet as a web extension. The wallet extension is available for Google Chrome, Firefox, Brave and Edge.\n\nIt is user-friendly and allows users a wide range of crypto services. For example, users can send tokens through a QR code. This allows beginners to safely engage in crypto trading without making any costly errors.\n\nThe Binance wallet is also looking to launch a new swap feature. The swap feature will allow users to swap their tokens from the wallet without visiting any crypto exchange platforms. The swap feature would also employ DEX aggregators and market makers to ensure that the users can access tokens at low prices.\n\nDue to the wallet’s link with the Binance exchange, users can instantaneously transfer their crypto funds from the wallet to the exchange and trade to maximize their profits. Users can also take advantage of Binance’s NFT marketplace and stake-to-earn service.\n\nWhile the wallet’s connectivity to the Binance exchange has numerous advantages, it does make the wallet vulnerable to malicious activity.\n\nPros\n\nConnected to crypto’s top exchange, Binance\n\nAvailable as a web browser extension\n\nHuge number of cryptos\n\nLow fees\n\nCons\n\nSome vulnerability due to connection with Binance\n\nType of Wallet Software Number of Supported Cryptos 385 Fee to Buy ETH 0 Deposit Fee, 0.1% Trading Fee Mobile App Yes\n\n6. OKX – Multi-Platform Wallet with Excellent Yields\n\nThe OKX crypto wallet is one of the best Ethereum wallets which allows users an opportunity to access the entire Web3 ecosystem. Apart from secure and user-friendly storage, the OKX wallets offer its users a wide range of DeFi services.\n\nThe wallet is available on Android and iOS, as well as a Chrome extension.\n\nOKX offers comprehensive security to its users. It employs an effective KYT system to monitor fraudulent activity in its wallets. It utilizes over 200 million labels to improve to effectively protect users from any fraud risks.\n\nOKX is considered a universal wallet. It supports over 50+ decentralized networks and their native tokens such as Ethereum, Polygon and Bitcoin. OKX allows beginner users to gain a broad understanding of their investment through its Web3 dashboard.\n\nAnother big advantage that OKX users enjoy is the stake-to-earn service, which is rated among our best crypto staking platforms. It provides staking, farming and pooling services that can boost the portfolio performance of its users. For example, Ethereum investors can utilize the Lido protocol to earn an annual percentage yield of 4.38%.\n\nFurthermore, the OKX platform acts like a one-stop NFT aggregator, allowing users to create and trade NFTs on 11+ networks. Users can easily access some of the biggest NFT brands such as Wrapped Cryptopunks, Bored Ape Yatch Clud, etc.\n\nOKX’s swap feature utilizes over 10 networks and over 100 decentralized exchanges to allow users to swap their crypto tokens at the best prices. Beginner traders can struggle to compare the prices offered by various platforms on their own. However, OKX’s swap feature helps solve this problem.\n\nDespite the various advantages offered by OKX, it is not available to US investors due to compliance reasons.\n\nPros\n\nComprehensive security\n\nUniversal wallet supporting both DEXs and CEXs\n\nStake-to-earn offering high APYs\n\nNFT Marketplace\n\nCons\n\nNot available in the US\n\nType of Wallet Software Number of Supported Cryptos 350+ Fee to Buy ETH 0 Deposit Fee, Variable market maker/taker Mobile App Yes\n\n7. MetaMask – Most Popular Multi-Chain Wallet\n\nMetaMask is one of the most trusted Ethereum wallets in the world. Currently, over 30 million users trust MetaMask to secure their crypto assets. The wallet is available as a browser extension and as a mobile application as well.\n\nMetaMask is an extremely user-friendly crypto wallet that allows beginner users to buy, send, store and swap crypto assets such as Ethereum.\n\nThe wallet protects user data by ensuring that only users have custody of their private key. This prevents any third party from accessing the user’s account, making the MetaMask wallet self-custodial.\n\nUsers can purchase crypto tokens from a variety of networks such as Ethereum, Polygon, Celo, Binance Smart Chain, Fantom and Avalanche.\n\nMetaMask’s biggest strength is its ease of use in purchasing cryptocurrency. Users can choose from a wide variety of payment mechanisms such as credit/debit cards, Paypal, Apple Pay, Google Pay, bank transfers, etc. This makes Metamask ideal for beginner users.\n\nMetaMask’s only tradeoff is its lack of support to store Bitcoin as it is an Ethereum-based wallet.\n\nPros\n\nExtremely high user and industry trust levels\n\nMore than 30 million users\n\nBrowser extension and a mobile app\n\nSelf-custody\n\nHuge amount of cryptos supported\n\nCross-chain functionality\n\nCons\n\nCannot convert tokens to fiat\n\nType of Wallet Software Number of Supported Cryptos 500,000+ Fee to Buy ETH Depends on payment provider Mobile App Yes\n\n8. Trust Wallet – Popular Binance-Backed Ethereum Wallet\n\nTrust Wallet is another cryptocurrency wallet owned by Binance. It provides users easy access to a vast number of crypto assets. Trust Wallet supports more than 4.5 million crypto tokens and over 65 different blockchain networks.\n\nBeginner users can struggle to find the most profitable crypto assets. Trust Wallet’s expansive network allows users to invest in the best cryptocurrencies of their choice.\n\nTrust Wallet is a very user-friendly wallet that is available on both the Android Google play store and the iOS app store. It is also available as a browser extension.\n\nTrust Wallet also benefits from its strong link with Binance. Binance’s reputation allows over 25 million users to choose Trust Wallet as their best Ethereum wallet. It acts as a hot wallet that allows users to swap crypto assets and track prices from the wallet. It also allows beginner users to invest in art and NFT collectibles.\n\nHowever, Trust Wallet does not employ cold storage to further strengthen its security features.\n\nPros\n\nHuge number of cryptos supported\n\nMulti-chain support\n\nExtremely simple and user-friendly\n\nMobile app and browser extension\n\nNFT marketplace\n\nCons\n\nNo cold storage feature\n\nType of Wallet Software Number of Supported Cryptos 4.5 million Fee to Buy ETH 1% on in-app purchases Mobile App Yes\n\n9. Coinbase Wallet – Popular Self-Custody Ethereum Wallet\n\nThe Coinbase cryptocurrency wallet is a self-custody wallet, which allows users to secure their crypto tokens and NFT collectibles. The wallet’s ultimate selling point is its strong connection with the Coinbase exchange, the largest crypto exchange in the US.\n\nThe users can easily link their wallets to their Coinbase accounts. This allows users to easily buy, sell and store their crypto assets in a user-friendly manner.\n\nThe Coinbase wallet is fully self-custodial. This provides a strong layer of security between the secure wallet and the crypto exchange. It allows users to be in complete control of their private keys and safely access their wallets.\n\nThe Coinbase Wallet is considered an extremely secure wallet that employs industry-leading security features such as two-factor authentication, biometric authentication, PIN verification and cloud backups.\n\nThe wallet opens a wide range of crypto services to its users. Users can access DeFi liquidity pools, the crypto swap feature, the yielding and staking services, etc. Users can also become a part of DAOs and help shape the future of Web3.\n\nThe only disadvantage of Coinbase is that it does not support some popular tokens such as Bitcoin Cash and Ripple’s XRP.\n\nPros\n\nSelf-custody wallet\n\nNFT marketplace\n\nConnected to leading exchange Coinbase\n\nExcellent security features\n\nStaking services and other features\n\nCons\n\nSome leading cryptos not available\n\nType of Wallet Software Number of Supported Cryptos 100,000+ Fee to Buy ETH 0.5-3.99% Mobile App Yes\n\n10. Exodus – Best Desktop Ethereum Hot Wallet\n\nThe Exodus crypto wallet allows investors to securely manage over 260 crypto assets. Exodus wallets are available as mobile applications, web extensions, and desktop applications, allowing users the flexibility to choose the platform they are comfortable with.\n\nThe Exodus Web3 wallet is universal in nature and unlocks a wide variety of DeFi services to its users. It is a multi-chain wallet, supporting popular networks such as Ethereum, Binance Smart Chain, Solana, etc. Users can enjoy access to NFTs, decentralized applications and other crypto assets.\n\nUsers can purchase crypto tokens using the local currency with credit and debit cards and through Apply Pay.\n\nExodus wallets are also compatible with Trezor hardware wallets. Users can enjoy the right balance between Exodus’s intuitive user experience and Trezor’s comprehensive security. Investors can easily swap assets between Trezor and Exodus, thus utilizing a multi-layered approach to security.\n\nExodus wallets are self-custodial, i.e. the company does not store users’ private keys. This provides an additional layer of security to users.\n\nThe wallet’s drawbacks include a lack of two-factor authentication and open-source features.\n\nPros\n\nAvailable as a mobile app or browser extension\n\nMulti-chain support\n\nNFT marketplace\n\nDEXs and CEXs supported\n\nCons\n\nNo two-factor authentication\n\nType of Wallet Software Number of Supported Cryptos 260+ Fee to Buy ETH Third-party processing fees Mobile App Yes\n\n11. MyEtherWallet – Top Open-Source Ethereum Wallet\n\nMyEtherWallet is a popular crypto storage solution that provides users with a free, client-side user interface to transact Ethereum. It is fully open-source and is available as a web wallet, chrome extension and mobile application.\n\nMyEtherWallet is designed specifically to support Ethereum and is therefore ideal for ETH investment. It supports almost all Ethereum-compatible blockchains such as Ethereum Classic, Polygon, BNB Smart Chain, Optimism, Arbitrum, etc. Users can store ETH, ERC-20 tokens and Ethereum-based NFTs with MyEtherWallet.\n\nMEW’s new multi-chain wallet Enkrypt is set to offer support to a wider range of crypto assets and NFTs. It also has a broad crypto swap feature that lets users swap Ether for other tokens such as Bitcoin, Litecoin, Dogecoin, etc. MyEtherWallet has also partnered with Bity to convert Ether instantly to Euros or Swiss Francs. MyEtherWallet is also compatible with all major hardware wallets such as Trezor, and Ledger.\n\nThe only drawback to MEW is its lack of support for Ethereum-incompatible altcoins.\n\nPros\n\nMobile app and browser extension\n\nCross-chain support\n\nNFT Marketplace\n\nStrong security features\n\nCons\n\nOnly supports ETH-based tokens\n\nType of Wallet Software Number of Supported Cryptos Any ETH-compatible Fee to Buy ETH Customizable Mobile App Yes\n\nHow Do Ethereum Wallets Work?\n\nBeginner investors can easily choose the best Ethereum wallet from our list. However, it is imperative to understand how crypto wallets work to trust the allocation of your digital assets to them.\n\nEthereum wallets provide a secure, efficient and user-friendly mechanism to store ETH, NFTs and other crypto tokens and then later buy products with Ethereum if they so wish.\n\nCrypto wallets are not unlike regular cash wallets. They also allow users to digitally hold their assets, the key difference being that crypto assets are not physically stored in the wallet.\n\nCryptocurrencies are bits of data that are located on a blockchain. The wallets essentially store the user’s proof of ownership of crypto assets.\n\nETH tokens are stored in Ethereum’s Externally Owned Accounts (EOAs). Most Ethereum wallets allow users to generate a new Ethereum account. Traders do not need to use a previously generated Ethereum account.\n\nUsers operate their ETH tokens through two cryptographic keys: a private key and a public key.\n\nPublic Key: A public key can be intuitively visualized as a bank account number. Users can transfer ETH tokens from to others using their public key. Public keys are named so because users can publicly distribute this key to receive crypto assets from others.\n\nPrivate Key: A private key is an alpha-numeric passcode that proves a user’s ownership of an Ethereum account. Every Ethereum EOA has an associated private key. As the name suggests, a private key needs to be protected at all costs.\n\nIf a malicious actor gets hold of the key, they can easily claim possession of all the crypto assets associated with it. Due to the decentralized nature of blockchain technology, in most cases, users cannot even recover their accounts.\n\nA private key has another important use. Ethereum uses a user’s private key to cryptographically generate a digital signature. This digital signature is used to sign all outgoing crypto transactions. A malicious actor can use the private key to forge transactions.\n\nA wallet is primarily responsible for protecting this private key. Furthermore, a wallet can also generate multiple public keys. A public key is cryptographically derived from a private key. While the public key can be distributed, it can be used to track certain details about a user such as transaction history and account balance. Therefore, modern wallets generate a new public key after every transaction to protect a user’s privacy.\n\nA crypto wallet uses a seed phrase to authenticate the user’s ownership of the wallet. Therefore, it is imperative that users protect their seed phrases from ever being stolen. Users can also choose to store the phrase at multiple locations for surety.\n\nTypes of Ethereum Wallet\n\nWhile all wallets generally perform the same set of functions, there can be several key differences between them. A beginner user needs to understand the tradeoffs involved in order to choose the best Ethereum wallet.\n\nBased on the mode of availability, wallets are generally categorized into three categories: software wallets, hardware wallets and paper wallets.\n\nSoftware Wallet\n\nA software wallet is an application that allows users to store their crypto assets by digitally securing their private keys.\n\nA software wallet’s best feature is its accessibility. Users can access these applications on commonly used devices such as Android and iOS phones, personal computers and even web browsers. They do not require the purchase of any new equipment or device.\n\nSoftware wallets are commonly referred to as hot wallets. While those terms may be used interchangeably, a hot wallet is technically referred to as any wallet that is connected to the internet.\n\nSoftware wallets being connected to the internet results in a tradeoff between ease of use and security. Software wallets allow users to quickly purchase and sell crypto assets using their private keys. The best crypto apps can also often support a wider range of crypto tokens and provide seamless transactions. Furthermore, they provide a range of payment options such as credit/debit cards, Google Pay, Apple Pay and PayPal.\n\nWhile software wallets provide a bevy of advantages, they are considered less secure than hardware wallets. The connectivity to the internet can allow hackers and other malicious actors to gain access to a user’s private key.\n\nA software wallet can be further categorized into three categories: mobile wallets, desktop wallets and web wallets.\n\nMobile Wallet : As the name suggests, mobile wallets are applications that users can run on their Android or iOS platforms. Best Ethereum wallets such as Best Wallet offer these applications on both Google Play Store and Apple app store.\n\n: As the name suggests, mobile wallets are applications that users can run on their Android or iOS platforms. Best Ethereum wallets such as Best Wallet offer these applications on both Google Play Store and Apple app store. Desktop Wallet : Desktop wallets are wallet interfaces that users can download on their personal computers. Desktop applications store the private key on the computer’s local storage.\n\n: Desktop wallets are wallet interfaces that users can download on their personal computers. Desktop applications store the private key on the computer’s local storage. Web Wallet: Web wallets are one of the most popular kinds of software wallets. Users can usually search for these wallet services on the internet and add them as a web browser extension. While these wallets provide extremely user-friendly interfaces, they are considered the least secure. They can be subjected to keylogger hacks and distributed denial of service (DDOS) attacks.\n\nHardware Wallets\n\nHardware wallets are considered one of the most secure forms of crypto storage. These wallets are physical pieces of equipment that secure the private-public key pair. Users need to connect the equipment to a device such as a personal computer to operate the wallet.\n\nAn Ethereum hardware wallet is also referred to as a cold wallet. Cold wallets are defined as any crypto storage device that does not connect to the internet. The lack of internet connection ensures that malicious actors cannot steal the confidential information of the users. Software wallets are as secure as the platform they are operating on while hardware wallets provide additional multiple layers of security for users.\n\nHardware wallets can also provide additional security features. For example, modern cold wallets use security features such as a PIN code or a biometric scan that makes it impossible for a malicious actor to access the crypto tokens. Hardware wallets are also coming up with additional technology to replace seed phrases, thus eliminating the single point of failure.\n\nWhile hardware wallets are secure, they also have some key disadvantages. Most importantly, hardware wallets are considered to be less user-friendly than software wallets. These wallets need to be connected to another device such as a desktop to operate.\n\nHardware wallets are also considered significantly more expensive than software wallets – the price of a hardware wallet can usually range between $50 – $300 and can be a deal breaker for several users.\n\nPaper Wallets\n\nEthereum paper wallet involves crypto asset holders writing down their private-public key pair on a piece of paper. This is an old method of storage that is rarely used with the advent of modern crypto wallet technology.\n\nPaper wallets are a kind of cold wallet. However, unlike hardware wallets, they are considered unreliable and risky. Users with paper wallets require an interface to access the blockchain. Therefore, they often end up depending upon exchanges or software wallets, negating any advantage of cold storage.\n\nFurthermore, paper wallets are a massive single point of failure risk. The private key can be lost, stolen or destroyed, making it impossible for the user to ever access their crypto assets.\n\nHow to Find Safe Ethereum Wallets?\n\nThe primary function of an Ethereum wallet is to secure a user’s private key and the crypto assets allocated to it.\n\nInvestors, especially those just entering into crypto investment are always keen to know if cryptocurrency is safe to invest in and wallets are a necessary feature of participating in the space. However, there are several factors that a user can consider to choose the most secure Ethereum wallet.\n\nReputation of the Provider\n\nDue to the decentralized nature of crypto, scams and rug pulls are one of the biggest threats to the digital assets of a user.\n\nTherefore, considering the reputation of a wallet provider is the easiest step a user can take to trust the authenticity of the wallet.\n\nFor example, a wallet that is regulated by a leading regulatory body can generally be trusted. Similarly, providers with a strong track record of traditional financing can also be trusted with their crypto products.\n\nSecurity Features\n\nA good understanding of the various security features offered by crypto wallets can help users select the best wallet.\n\nHardware wallets are usually considered the most secure option. These wallets are not connected to the internet, preventing any malicious activity to access the user’s confidential data. They can also provide additional security features such as biometrics and a PIN code.\n\nOn the other hand, a software wallet can also be trusted if it provides comprehensive security features.\n\nTesting the Wallet\n\nTesting the wallet may be the best way to develop trust. Users can send a small amount of crypto assets using the wallet before trusting it for significant amounts. A number of Ethereum wallets also allow users to try out the wallet on the testnet using fake crypto assets.\n\nHow To Choose The Best Ethereum Wallet For You?\n\nThe choice for the best Ethereum wallet is a matter of personal choice and can differ from user to user. Here are the key factors that can help users make an informed choice.\n\nSecurity\n\nAs we have already discussed, a wallet’s primary role is to ensure the security of a user’s crypto assets. Therefore, users need to consider security as their top priority while selecting the Ethereum wallet. Beginners need to choose a wallet that is reputed and is certified by a regulatory body.\n\nBeginners are also susceptible to losing their private keys. Therefore, they need to choose a wallet with proper wallet recovery options such as seed phrase, two-factor authentication.\n\nRemember, it is possible to avoid paying tax on crypto if you simply keep it in your wallet and don’t sell it, but you want peace of mind that it will still be there when you return.\n\nSupported Coins\n\nBeginners can be overwhelmed by the wide variety of assets available in the crypto market. A high-quality wallet supports a large number of crypto tokens, thus allowing users to diversify their portfolios.\n\nMany top wallets are also universal in nature as they support more than one blockchain network.\n\nFees\n\nAnother important factor to consider is the fees required to purchase certain crypto assets through a wallet. Different wallets use different exchanges to allow users to purchase crypto tokens from the wallet interface. Hardware wallets can often partner with third-party services to offer crypto functionality to users.\n\nFees can be of various types such as processing fees, network fees, trading fees, withdrawal fees, etc. Hardware wallets also require users to purchase the device upfront which can be expensive.\n\nUser-Friendliness\n\nBeginners need to consider that the wallet they choose is user-friendly. The idea of user-friendliness can differ from user to user. Beginner users may prioritize the ability to operate their Ethereum wallets from their mobile phones. Proper customer support and a broad ecosystem can also make wallets like Best Wallet user-friendly.\n\nMost importantly, wallets must provide users with a clear user interface to buy, sell and store cryptocurrencies.\n\nFeatures\n\nUsers may prioritize the availability of certain features in their wallets. For example, NFT enthusiasts may prioritize that the wallet provides NFT support. Seasoned investors may require staking, farming and yield functionality in their wallets.\n\nType of Wallet and Mobile Availability\n\nUsers need to make a careful choice between hardware wallets and software wallets. Most beginners prefer the availability of mobile wallets. Therefore, they need to ensure that the wallet of their choice provides Android or iOS support.\n\nSeasoned investors may choose a multi-layered approach that involves both hot wallets and cold wallets. Such users usually store their assets in cold storage and transfer them to a hot wallet when they are looking to trade.\n\nHow to Get & Use A Ethereum Wallet – Step-by-Step\n\nBy now, a user has enough information to choose the best Ethereum wallet of their liking. Now, let’s go over how users can operate an Ethereum wallet seamlessly. We are taking the example of the Best Wallet due to its simplistic user interface.\n\nStep 1: Downloading the App\n\nTo start, visit the Play Store (for Android users) or the App Store (for iOS users). Search for “Best Wallet” and tap the ‘download’ icon. The Best Wallet app is free and designed for a quick installation process.\n\nStep 2: Account Registration\n\nAfter the installation, the app will guide you through the registration process. You have two options here:\n\nEnter an email address that you frequently use.\n\nUse the ‘Continue with Apple/Google’ feature for a seamless integration with an email already associated with your device.\n\nStep 3: Enhancing Security\n\nFor your account’s protection:\n\nThe app offers two-factor authentication (2FA). This will send a six-digit code to your device whenever you log in, adding an extra layer of security.\n\nSetting up a four-digit PIN is essential and cannot be skipped.\n\nFor those preferring quick access, you can activate a fingerprint login. This means no more PIN entries whenever you want to access your account.\n\nStep 4: Explore The Best Wallet Features\n\nOnce registered, you can explore all the Best Wallet features. This includes insights on emerging and popular tokens, purchasing cryptos via third-party applications, and trading on its decentralized exchange platform with vast cryptos.\n\nCrypto assets are a volatile investment product. Your capital is at risk.\n\nConclusion\n\nCrypto wallets are crucial in allowing users to succeed in the crypto ecosystem. The Best Wallet provides beginners with the perfect crypto storage solution by balancing security and user-friendliness.\n\nThe platform has a plan that shows features being released step by step. Soon, users will get features like fingerprint security, support for multiple wallets, swapping within the app, crypto news updates, an NFT gallery, and new ways to earn staking rewards for its users.\n\nCrypto assets are a volatile investment product. Your capital is at risk.\n\nFAQs\n\nWhich is the Best Ethereum Wallet?\n\nAfter considering a wide variety of factors, we believe that the Best Wallet is the best Ethereum wallet. They provide ease of use, uncompromising security, and a wide range of features.\n\nWhat is the Safest Ethereum Wallet?\n\nHardware wallets are usually considered more secure than software wallets due to the non-access to internet connectivity. However, Best Wallet software wallets provide a broad level of security using two-factor authentication.\n\nIs there an Official ETH Wallet?\n\nNo. The Ethereum Foundation does not have an official ETH wallet. Users can choose the best wallet according to their liking."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYm9sZC5jb20vY2FyZGFuby1mb3VuZGVyLXNsYW1zLWV0aGVyZXVtcy1zdGFraW5nLW92ZXJoYXVsLXBsYW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Cardano founder slams Ethereum's staking overhaul plans - Finbold - Finance in Bold",
        "content": "Not long after sharing the details regarding the decentralization of the Cardano (ADA) ecosystem, Charles Hoskinson, the founder of its blockchain development firm Input Output Global (IOG), has criticized Ethereum (ETH) plans for staking structure redesign shared by the platform’s co-founder Vitalik Buterin.\n\nAs it happens, Hoskinson took a jab at Ethereum as he commented on a video of Buterin admitting to the overly centralized nature of current staking on the platform and describing plans to redesign its staking operations in an X post shared by user Stake with Pride on November 24.\n\nNo worries, Ethereum 3 will have it all sorted! https://t.co/Td0Hm58eic — Charles Hoskinson (@IOHK_Charles) November 24, 2023\n\nFurthermore, responding to the comment noting that he was “fuelling hostility” with Ethereum, Hoskinson refuted such observations, arguing that Vitalik was “rediscovering what we’ve been working on for almost a decade, and it’s like a new revelation,” adding that it was “extraordinary that we never get a shout-out.”\n\nCardano vs. Ethereum decentralization\n\nAs a reminder, the Cardano founder had poked fun at Buterin and his ideas before as well, like in early October, when the Ethereum pioneer shared a post listing the advantages of suggested changes in staking design for users who do not have enough resources to stake on their own.\n\nMeanwhile, Hoskinson recently revealed Cardano’s upcoming moves toward the “full-blown” decentralized governance structure as it enters the Voltaire era in its roadmap, including through the movements of all repositories to a community-run project called Intersect, as Finbold reported on November 17.\n\nElsewhere, Cardano’s ADA token was at press time trading at the price of $0.381, which shows a decline of 2.50% on the day and a loss of 2.83% across the previous week while it still holds onto the gain of 30.08% on its monthly chart, according to the data on November 27.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L21hcmtldC1pbnNpZ2h0cy1leGFtaW5pbmctcmVjZW50LXRyZW5kcy1pbi1zaGliYS1pbnUtcmViZWwtc2F0b3NoaS1hbmQtZXRoZXJldW0tY2xhc3NpYy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Market Insights: Examining Recent Trends in Shiba Inu, Rebel Satoshi, and Ethereum Classic - Analytics Insight",
        "content": "TLDR\n\nShiba Inu’s Shibarium layer-2 network has recorded a sharp increase in network activity.\n\nEthereum Classic (ETC) has reacted negatively to news of Spot Ethereum ETFs.\n\nRebel Satoshi ($RBLZ) could become the next main meme coin project following its grand plans for creating wealth for its ecosystem.\n\nShiba Inu’s (SHIB) community is celebrating the rising network activity on its layer-2 network, Shibarium. Elsewhere, Ethereum Classic’s (ETC) volatility has risen sharply amid calls for Spot Ethereum ETF approvals. Yet, analysts wonder if Ethereum Classic’s growing network could spur a rally.\n\nStill, unconvinced investors have turned to Rebel Satoshi ($RBLZ) after it revealed a reward-filled ecosystem where decentralization is one of its core values. $RBLZ would grow by 30% by the next round of its presale. Yet, can it become a top ICO project? Let’s discuss.\n\nShibarium Makes Surprise Comeback\n\nShiba Inu’s (SHIB) popular layer-2 network, Shibarium, has recorded high transaction activity despite its recent decline. On November 21, Shibarium recorded 34,690 transactions, rising by 231% from $14,980 on November 20. The increase comes amid Shiba Inu’s continued token burns, which have failed to protect SHIB’s price.\n\nSHIB was trading at $0.000007954 on November 1. By November 20, SHIB’s value had jumped by 6.2% to $0.000008449.\n\nSince the launch of Shibarium, Shiba Inu’s (SHIB) team has embarked on more token burn events. Shiba Inu has also increased the burn rate significantly. Between November 20 and November 21, Shiba Inu burned 28.12 million tokens, a 47,872% increase from the previous day.\n\nShiba Inu’s (SHIB) team has already hinted at a possible price increase due to increased token burns. Yet, SHIB’s value has barely risen since the launch of Shbiarium. Analysts pin Shiba Inu’s (SHIB) recent performance on the expectation that spot Bitcoin ETFs will be approved soon. This could push SHIB up by 13.0% to $0.000009549.\n\nEthereum Classic’s Volatility Rises By Mid-November\n\nEthereum Classic (ETC) started the month of November on a bullish note. The excitement around possible spot Bitcoin ETFs was high, so investors increased their bullish holdings. This increased investor sentiment for projects like Ethereum Classic.\n\nAnalysts expected Ethereum Classic to capitalize on the growth, leading to an ETC rally. Yet, ETC’s value has steadily declined. ETC cost $17.78 on November 1. By November 10, ETC’s value rose by 16.8% to $20.78. However, ETC’s volatility skyrocketed, causing it to fall by 12.6% to $18.15.\n\nLike other popular network hard forks, Ethereum Classic’s (ETC) value tends to shoot up when Ethereum rallies. Furthermore, analysts expect Ethereum Classic’s price to rise after BlackRock unveiled its partnership with Ethereum. Still, analysts say Ethereum Classic will likely face increased competition from other top altcoins. This means ETC could fall by 8.8% to $16.54.\n\nRebel Satoshi Wows Investors with a Potential 30% Increase\n\nSatoshi Nakamoto built Bitcoin with a dream of a decentralized financial world. Yet, since 2008, many crypto projects have strayed far from this ideal. However, RebelSatoshi ($RBLZ) is leading the drive back to the foundational principles of blockchain technology.\n\nThe network is building an ecosystem that creates wealth easily and distributes it fairly through its community. Wealth generation on RebelSatoshi will happen through different means, including an NFT marketplace for trading valuable assets, coin staking, and a play-to-earn game.\n\n$RBLZ is the governance and membership token of Rebel Satoshi. It offers users special access to discounts, private events, and exclusive projects within the RebelSatoshi ecosystem. $RBLZ’s total supply is 250 million tokens. The network uses token burns to increase $RBLZ’s value via scarcity. RebelSatoshi aims to unite the silent majority to challenge centralization within the crypto community.\n\nSince the launch of its blockchain ICO, RebelSatoshi ($RBLZ) has sold over 10 million tokens. It is now in the Early Bird phase of its presale. $RBLZ current value is $0.010. By the next round, titled the “Rebel Round,” $RBLZ would rise to $0.013, jumping by 30%. $RBLZ would set the stage for further gains once it reaches $0.025 and is listed on decentralized exchanges.\n\nFor the latest updates and more information, be sure to visit the official Rebel Satoshi Presale Website or contact Rebel Red via Telegram\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2VtZXJnaW5nLWNyeXB0by10cmVuZHMtYS1ub3ZlbC10b2tlbi1jYXB0dXJlcy1pbnRlcmVzdC1hbWlkc3QtZXRoZXJldW0tZXRoLXByaWNlLWluY3JlYXNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Emerging Crypto Trends: A Novel Token Captures Interest Amidst Ethereum (ETH) Price Increase - Analytics Insight",
        "content": "Ethereum (ETH), the ringleader of top-performing altcoins, recently made waves by experiencing a notable 10% surge in its price, sparking keen investor interest. However, the market is also seeing another noteworthy contender that has been gaining prominence amid Ethereum’s impressive performance. Let’s delve into the reasons behind this growing attention!\n\n>>BUY SPCT TOKENS NOW<<\n\nETH Price Prediction: Fidelity’s Ethereum Spot ETF Application Sparks ETH Price Rally\n\nIn a significant development on November 18, Bitcoinsistemi.com reported that Fidelity, overseeing a colossal $4.5 trillion in assets, has applied for an Ethereum Spot ETF. This move elevates the total count of Ethereum Spot ETFs awaiting SEC review to seven.\n\nFollowing Fidelity’s move, the Ethereum token, ETH, witnessed a significant price pump. Between November 18 and November 28, ETH’s price rose by 10%, from $1,927 to $2,121. This performance has left investors pondering, “Should I buy Ethereum?” Investors are closely watching the ETH price prediction to gain insights into potential impacts on the value of Ethereum.\n\nBloomberg analysts predict SEC approval for Bitcoin Spot ETFs will significantly boost chances for ETH Spot ETF approvals. Bloomberg’s James Seyffart confidently predicts a 90% chance of SEC approving Bitcoin Spot ETFs by January 10, 2024. Looking ahead to Ethereum, the potential approval timelines for Ethereum Spot ETFs, if materialized, seem to converge around Q1 of 2024.\n\nAmong several things, Ethereum Spot ETFs would increase institutional investment, improve liquidity, and accelerate the development of Ethereum’s ecosystem. If approved, Ethereum (ETH) will experience a notable price surge. Based on this, the ETH price prediction shows that Ethereum’s price is likely to hit $3,582 by Q1 of 2024.\n\nVC Spectra (SPCT) Surges to Top of DeFi Crypto List with Remarkable 862.5% Increase\n\nAmidst Ethereum’s growing momentum, VC Spectra (SPCT) has swiftly ascended as a standout performer, captivating investors with its promising trajectory. Since its presale debut in July 2023, VC Spectra (SPCT) has solidified its position among the top DeFi coins, beckoning enthusiasts with the allure of substantial returns.\n\nFunctioning as a decentralized hedge fund, VC Spectra (SPCT) strategically allocates investments to high-quality blockchain projects. Token holders are rewarded with quarterly dividends directly correlated to the quantity of VC Spectra (SPCT) tokens they possess.\n\nThe current buzz surrounds VC Spectra (SPCT)’s Stage 5 presale, where tokens are being offered at an attractive $0.077. This marks a remarkable 862.5% surge from the initial launch price of $0.008. This meteoric price surge during its presale has positioned VC Spectra (SPCT) as one of the best DeFi tokens to watch out for.\n\nMore so, with VC Spectra (SPCT) gearing up to officially start trading on major exchanges in Q1 of 2024, market analysts predict a possible 100x increase in the token’s price.\n\nTo learn more about VC Spectra (SPCT) and its presale, visit:\n\nBuy Presale: https://invest.vcspectra.io/login\n\nWebsite: https://vcspectra.io\n\nTelegram: https://t.me/VCSpectra\n\nTwitter: https://twitter.com/spectravcfund\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNpdHlhbS5jb20vYml0Y29pbi1ldGhlcmV1bS1zb2xhbmEtYW5kLW90aGVycy1yZXZlcnNlLWFzLWNyeXB0by1tYXJrZXRzLWVuZC13ZWVrZW5kLWluLXRoZS1yZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Solana and others reverse as crypto markets end weekend in the red - CityAM - City A.M.",
        "content": "Bitcoin, Ethereum, Solana and others reverse as crypto markets end weekend in the red\n\nThe price of Bitcoin is down by roughly 1% since yesterday, while Ethereum has retreated by more than 2% this morning.\n\nThe market leader by market cap managed to sustain the key $37,000 threshold, despite this level being tested a few times over the weekend’s trading. Ethereum also continues to trade above $2,000.\n\nOther cryptocurrencies such as Solana, Chainlink and Polygon have dipped deeper into the red, even as the Fear and Greed Index is still anchored in Greed.\n\n\n\nFriday’s Crypto AM Daily\n\nIn the Markets\n\nTotal crypto market cap\n\n🔵 $1.42 trillion\n\n🔻 1.35%\n\nWhat Bitcoin did yesterday\n\n🔺 Daily high $37,819\n\n🔻 Daily low $37,166\n\nBitcoin market capitalisation\n\n🟠 BTC $731.793 billion\n\n🟡 Gold $13.299 trillion\n\n💳 Visa $522.16 billion\n\nBitcoin volume\n\nTotal spot trading volume $16.510 billion\n\n🔺 93.98%\n\nEthereum staking entry queue\n\n0 minutes\n\nSP500\n\n🔺 0.6%\n\nFTSE/JSE Top 40\n\n🔻0.04%\n\nFear and Greed Index\n\nBitcoin’s market dominance\n\n52.72\n\nRelative Strength Index (RSI)\n\n55\n\nValues of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price, while 30 or below indicates an oversold or undervalued condition.\n\n📣 What they said yesterday\n\nBut seriously folks, this a short and juicy tirade in which I say: (0) there will be superhuman AI in the future (1) they will be under our control (2) they will not dominate us nor kill us (3) they will mediate all of our interactions with the digital world (4) hence, they will need to be open platforms so that everyone can contribute to training and tuning them – Yann Lecun, machine learning scientist\n\nCrypto AM: Editor’s picks\n\nSam Altman retakes OpenAI throne – four days after being sacked\n\nKraken appoints crypto entrepreneur and fintech consultant Bivu Das to drive next chapter of UK growth story\n\nTransformBase initiative set for launch in November\n\nFCA’s new crypto advertising rules met with mixed industry response\n\nChatGPT urges crypto conference panel not to become over-reliant on AI\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LnNhbWFhLnR2LzIwODczNTIzMy1jcnlwdG9jdXJyZW5jeS1iaXRjb2luLWV0aGVyZXVtLWZsdWN0dWF0ZS1hbHRjb2lucy1zZWUtZGl2ZXJzZS10cmVuZHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Crypto prices today: Bitcoin, Ethereum, altcoins - 27 Nov, 2023 - Latest Updates - SAMAA",
        "content": "Photo: File\n\nCryptocurrency prices today show a mix of movements, as Bitcoin and Ether enter the final week of November with slight losses.\n\nBitcoin, which kicked off the month at $34,397, now trades at $37,238, reflecting a 1.24 percent loss on Monday, November 27.\n\nDespite this, November has proven profitable for the crypto sector, with Bitcoin's value growing from its starting point to the current range around $38,000.\n\nEther, the second-largest cryptocurrency, saw a 1.48 percent price drop on Monday and currently holds a value of $2,043.\n\nTo signal a bullish trend for Bitcoin, breaking and holding above $38,000 are considered crucial.\n\nFor Ether, it's essential to overcome the key resistance at $2,130 for a bullish scenario, and a solid close above this level could potentially drive the price higher.\n\nHowever, the majority of cryptocurrencies faced losses today, including Binance Coin, Ripple, Solana, Cardano, and Dogecoin.\n\nOthers like Tron, Chainlink, Polygon, Avalanche, Polkadot, Litecoin, Shiba Inu, and Bitcoin Cash also traded in the red.\n\nThe overall crypto market valuation dipped by 1.12 percent in the last 24 hours, now standing at $1.42 trillion, according to CoinMarketCap.\n\nDespite the declines, a select few cryptocurrencies recorded gains today, such as Leo, Cosmos, Uniswap, Binance USD, and Iota. Braintrust and Circuits of Value also saw modest gains.\n\nAxie Infinity (AXS) emerged as one of the highest gainers, jumping 15.9 percent in the last 24 hours.\n\nData from DappRadar indicates increased demand for the play-to-earn blockchain game in November, with a 30 percent rise in the number of wallets interacting with the game.\n\nAdditionally, in the decentralized finance (DeFi) space, dYdX is poised to unlock $500 million in tokens, marking its first significant emission."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vdGVjaHBvaW50LmFmcmljYS8yMDIzLzExLzI3L3N0ZXAtYXNpZGUtYml0Y29pbi1hbmQtZXRoZXItZ2FtZXN0b3AtbWVtZXMtaXMtdGhlLWNyeXB0by15b3UtY2FudC1hZmZvcmQtdG8tbWlzcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin | Ethereum | GameStop Memes - Techpoint Africa",
        "content": "Learn about the tempting financial potential that GameStop Memes offers in the middle of the rising Bitcoin and Ether Option activity.\n\nOpportunities emerge from the most unlikely tales in the world of cryptocurrencies. The growth of GameStop Memes (GSM), a coin inspired by the legendary Wall Street Memes narrative, is one such story that has enthralled the crypto market. As the notional open interest of active Bitcoin (BTC) and Ethereum (ETH) options contracts on Deribit reaches a mind-boggling $20.64 billion, now is the time to look into why GameStop Memes is a great investment opportunity in today's crypto scene.\n\nBitcoin And Ethereum Drive The Scene\n\nBefore we get into GameStop Memes, it's important to understand the context in which this crypto gem is set. The notionally open interest in Bitcoin and Ether options contracts has skyrocketed, according to Deribit, a large cryptocurrency exchange. As reported by Swiss-based Laevitas, this sum has already reached a mind-boggling $20.64 billion, virtually matching the peak set in November 2021, when Bitcoin was selling at an eye-popping $66,000.\n\nIt's worth noting that the current open interest in these contracts substantially outnumbers that of November 2021. With nearly twice the number of outstanding contracts, it's not just a triumph for Deribit, but also a strong indication of the cryptocurrency market's expansion and increased interest in options.\n\nWhere It All Began\n\nLet us now turn our attention to the show's main attraction - GameStop Memes. It all started in early 2021, when retail traders banded together to support GameStop, defying Wall Street's hegemony. This game-changing campaign demonstrated to the globe that the masses could, in fact, take on the financial system. GameStop Memes sprang from this maelstrom of events.\n\nGameStop Memes is here to carry on the tradition, representing the original GameStop movement's spirit of rebellion, solidarity, and humour. This token is about more than simply investing; it's about making a commitment to the future, about democratising finance and offering tools for financial empowerment and education.\n\nThe unique strategy of GameStop Memes distinguishes it in the enormous ocean of cryptocurrencies. It combines memes with finance to make investing more approachable and pleasurable. So, what makes GameStop Memes such an appealing investment potential in today's crypto environment? Let's look more closely:\n\nA Tribute To GameStop\n\nGameStop Memes celebrates the legendary GameStop movement. It is a sign of opposition to traditional structures that frequently exclude individuals. This homage keeps the communal spirit alive and well.\n\nCommunity-Driven Approach\n\nUnlike many cryptocurrencies, GameStop Memes places the community at the centre of its operations. It seeks to unite people all around the world with a common objective to democratise finances and provide resources for financial empowerment and education.\n\nSecure And Transparent\n\nIn the crypto realm, transparency and security are crucial. GameStop Memes achieves both by providing a safe environment for its users while retaining operational openness. This degree of confidence is priceless in the crypto world.\n\nInnovative Tokenomics\n\nGameStop Memes aren't only about making money in the near run. Its revolutionary tokenomics are intended to assure long-term involvement and stability. This emphasis on sustainability distinguishes it from many other speculative coins on the market.\n\nThe Takeaway\n\nGameStop Memes offers a once-in-a-lifetime opportunity to be a part of something bigger, something that celebrates the strength of the community and the lighter side of finance. While notional open interest in Bitcoin and Ether futures contracts on Deribit continues to rise, GameStop Memes serves as a timely reminder that the unexpected may frequently produce the most substantial returns in the crypto realm. Don't miss out on this revolutionary adventure, invest in GameStop Memes and become a part of the movement that is redefining financial rules.\n\nGameStop Memes\n\nWebsite: https://gamestmemes.com\n\nTwitter: https://twitter.com/GameStopMemes\n\nTelegram: https://t.me/GameStopMemes"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jaXR5YW0uY29tL3NldmVuLWRheXMtaW4tY3J5cHRvLWJpbmFuY2VzLTQtYmlsbGlvbi1jYXNlLWFuZC1maWRlbGl0eS1maWxlcy1mb3Itc3BvdC1ldGhlcmV1bS1ldGYtYXMtb3B0aW9ucy12b2x1bWVzLWdyb3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Nov 2023 08:00:00 GMT",
        "title": "Seven days in crypto: Binance's $4 BILLION case, and Fidelity files for spot Ethereum ETF as options volumes grow ... - City A.M.",
        "content": "Seven days in crypto: Binance’s $4 BILLION case, and Fidelity files for spot Ethereum ETF as options volumes grow\n\nData from CryptoCompare shows that the price of Bitcoin moved sideways throughout most of the past week, starting it at around $37,000 and seeing an initial sharp drop to $35,500, before recovering to now trade at $37,000 again.\n\nEthereum’s Ether, the second-largest cryptocurrency by market capitalization, moved in a similar way, starting the week at $2,000 and seeing a sharp drop to near $1,900 before recovering. After hitting a $2,100 high throughout the week, ETH has since dropped to $2,025.\n\nHeadlines in the cryptocurrency space over the past week were dominated by Binance agreeing to pay $4.3 billion to settle with a coalition of US regulators, in one of the largest corporate penalties in the history of the country after it was accused of breaking sanctions and money-transmitting laws.\n\nAs part of the settlement, its founder Changpeng Zhao, also known as CZ, will resign from his role as CEO and admit to felony criminal charges of money laundering. Binance will be under the supervision of an independent third-party compliance monitor for a five-year period, during which it will be obligated to report any suspicious transactions it processes.\n\nThe firm’s CEO, Zhao, will be succeeded by Richard Teng, the current Global Head of Regional Markets.\n\nToday, I stepped down as CEO of Binance. Admittedly, it was not easy to let go emotionally. But I know it is the right thing to do. I made mistakes, and I must take responsibility. This is best for our community, for Binance, and for myself.\n\n\n\nBinance is no longer a baby. It is… — CZ 🔶 BNB (@cz_binance) November 21, 2023\n\nProsecutors in the US have argued that CZ poses an “unacceptable risk of flight” and shouldn’t be allowed to leave the country ahead of his sentencing in February after he was released on a $175 million bond.\n\nOver the week, the US Securities and Exchange Commission (SEC) filed a lawsuit accusing Kraken, a major cryptocurrency exchange based in San Francisco, of breaking federal securities laws by operating without proper registration as a broker, clearing agency and dealer.\n\nThe SEC has alleged that Kraken has posed a “significant risk” by blending its corporate assets with customer crypto worth up to $33 billion, citing Kraken’s independent auditor. According to the lawsuit, Kraken has occasionally held “over $5 billion of its customers’ cash, and it also mixes some of its customers’ cash with some of its own.”\n\nThe lawsuit further states that Kraken has “sometimes covered operational costs directly from bank accounts containing customer cash”. Kraken responded to these allegations saying it spent fees it has already earned, and said it disagrees with the SEC’s complaint.\n\nThe SEC cannot continue ruling by enforcement. My statement on the Kraken lawsuit below: pic.twitter.com/J3qhzU624N — Senator Cynthia Lummis (@SenLummis) November 21, 2023\n\nThe SEC has identified several tokens, such as Algorand’s ALGO, Polygon’s MATIC, and NEAR, which it deems to be unregistered securities, and has stated that Kraken has actively promoted these tokens to investors. The filing seeks to permanently prohibit Kraken from functioning as an unregistered exchange. Kraken said it does not securities and plans to “vigorously defend” its position.\n\nOn top of this, Liechtenstein-based cryptocurrency trading platform Bittrex Global has announced that it will cease its operations and terminate all trading on its platform by December 4 due to numerous regulatory obstacles that have complicated its business operations.\n\nThese regulatory challenges encompassed the closure of its U.S. branch earlier this year following a $29 million settlement with the SEC over allegations of securities law violations. As the company begins to wind down, customers will be limited to withdrawing their funds from the platform.\n\nFidelity files for spot Ether ETF in the US\n\nMeanwhile, asset management giant Fidelity has filed a 19b-4 to launch a US-regulated spot Ether exchange-traded fund (ETF), the Fidelity Ethereum Fund, which would be listed by an exchange owned by Cboe Global Markets.\n\nSome crypto enthusiasts hold that crypto ETFs could exert a substantial influence on the crypto market by boosting accessibility, as these funds would allow investors to gain exposure to their underlying digital assets without having to manage their own private keys.\n\nThis past week also saw Deribit’s Bitcoin options open interest hit a record high above the $15 billion mark, overtaking BTC futures for the first time in a sign of the market’s “maturation and growing sophistication,” according to Deribit’s Chief Commercial Officer Luuk Strijers.\n\nAccording to CCData’s latest Exchange Review, the trading volume of options on the CME experienced a significant uptick, with BTC and ETH options setting new all-time highs. BTC options saw a 142% increase, reaching a trading volume of $1.75 billion, while ETH options rose by 107%, hitting a trading volume of $532 million.\n\nNotably, JPMorgan analysts led by Nikolaos Panigirtzoglou, have identified a potential outflow of $2.7 billion from the Grayscale Bitcoin Trust (GBTC) in the event of its conversion to a spot Bitcoin ETF, based on investors having so far this year been acquiring GBTC shares at a discount to the trust’s underlying BTC holdings.\n\nFrancisco Memoria is a content creator at CryptoCompare who’s in love with technology and focuses on helping people see the value digital currencies have. His work has been published in numerous reputable industry publications. Francisco holds various cryptocurrencies. Featured image via Unsplash."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmJsb2NremVpdC5jb20vdml0YWxpay1idXRlcmluLXRvLXJlZGVzaWduLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Vitalik Buterin To Redesign Ethereum From The Ground Up - Blockzeit",
        "content": "If there’s one person who is not happy with how Ethereum (ETH) turned out to be, that would be its co-founder, Vitalik Buterin. In a recent discussion, the Russian-Canadian programmer revealed he plans to redesign the network from the ground up to address some of its pressing flaws, especially in performance and staking.\n\nVitalik Buterin stated at the Devconnect in Turkey that he plans to redesign Ethereum staking and solve problems affecting performance. He recognizes the UTXO payment model and hopes to integrate private mempools, ERC-4337, code pre-compilation, ZK-EVMs and liquid staking in… — Wu Blockchain (@WuBlockchain) November 27, 2023\n\nThe Problem of Ethereum According to Vitalik Buterin\n\nVitalik Buterin unveiled his ambitious plan to reform the second-biggest crypto by market dominance during the Devconnect event in Turkey. The developer of Ether is apparently not pleased with how are things going within his brainchild with Gavin Wood, Charles Hoskinson, Anthony Di Iorio, and Joseph Lubin.\n\nThe soft-spoken crypto personality particularly cited concerns over the performance issues that have been a constant pain in the network’s side and the heavy reliance of its liquid staking in a Proof-of-Stake (PoS) model.\n\nThe Proposed Overhaul\n\nBased on the information shared by Wu Blockchain on the X platform, Buterin is looking to integrate private mempools to safeguard Ethereum users’ privacy and security. The feature will allow them to transact without exposing their reason for doing so to the public mempool. This way, miners will not be able to take a peek of their intentions and potentially exploit them.\n\nAdditionally, the infusion of ERC-4337 for account abstraction gives users the ability to deploy smart contracts to manage their accounts without giving up control over them when using applications. This also paves the way for their convenience in the implementation of multisig wallet functionalities.\n\nSpeaking of smart contracts, Buterin wants to make their deployment more efficient, faster, and cheaper. He said this could be accomplished through code precompilation, which preprocesses some elements of the cryptograph. For a basic illustration of the term, it repurposes input data to generate output which is, in turn, used as input again, and so the cycle goes.\n\nLastly, Buterin emphasized the need to rectify the liquid staking of ETH that’s now dangerously falling into the control of a few players. For context, the top five liquid stakers of Ethereum — Lido, Coinbase, Figment, Kraken, and Binance — have a combined 50% influence on the PoS chain. Among them, Lido accounts around a third of the pie.\n\nEthereum Now\n\nAs of this writing at 2:00 AM UTC time, Ethereum remains in the $2,024 range, only moving downward by 1.6% on the 24-hour timescale. A voluminous transaction was noted within this period nearly 30% as the coin hovered between a low of $1,988 to a high of $2,054."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiJ2h0dHBzOi8vc3RvY2thcHBzLmNvbS9hdS9ldGhlcmV1bS1hcHBzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Best Ethereum App in Australia 2024 - Stock Apps Australia - StockApps",
        "content": "Best Ethereum App in Australia 2024\n\nThe best Ethereum app should allow you to buy and trade Ethereum, exchange the crypto for other cryptocurrencies, and perform a range of trading strategies short positions, range trading, and scalping. The app should also have excellent technical indicators like the RSI signal, MYC, Moving Averages, and MACD. An Ethereum app should also allow users to store their Ethereum assets in secure cold wallets. Here, we explore the best Ethereum apps on the market to help you decide which one is best for you.\n\nBest Ethereum App Australia 2024 – List Crypto.com Metamask\n\nA Closer Look At The Best Ethereum Apps in 2024:\n\nBest Apps For Buying Ethereum (ETH)\n\nTo buy Ethereum, you will need an app that allows you to convert fiat currency into Ethereum or exchange Ethereum for another cryptocurrency. Most exchanges or online brokers play the middleman – helping millions of individuals purchase Ethereum and facilitate simple and complex trading strategies.\n\nCrypto.com\n\nCrypto.com is one of the most powerful trading platforms in the industry. With over 50 million users, a powerful and seamless trading environment, AI-powered trading features, and competitive fees, Crypto.com has sealed its brand as the best go-to trading app for beginners, pro-investors, and traders.\n\nKey Features\n\nInsurance:\n\nIn September 2021, Crypto.com announced an expansion to its already-impressive insurance program. The expansion meant that the company insured up to 750 million dollars for its users, making it one of the largest insurance schemes in the crypto industry.\n\nLeverage:\n\nCrypto.com supports leverage up to 10x for more than 50 pairs, including the ETH/USDT pairs. The leverage means that you can stake up to 10 times your Ethereum holding and enjoy ten times the winnings if the market goes in your direction.\n\nInvestment and Staking:\n\nUsers are allowed to partake in soft staking, ditto the CRO staking, which allows up to 1000 CROs. You can earn an APR of up to 8% and enjoy zero maker fees and fee rebates (your fees are transferred to your holdings, and you can use them to stake or trade) if you stake up to 50,000 CRO.\n\nSecurity:\n\nCrypto.com is licensed by the Australian Securities and Investments Commission, ASIC, to operate in Australia. It also holds licenses in other major regions like the United States, the UK, most parts of Europe, Asia, and other parts of the world. Crypto.com wallets are also secured with Tier 4 security layers. Crypto.com holds the highest security measure in the industry.\n\nFees:\n\nCrypto.com offers zero deposit fees. Withdrawal fees also vary, depending on your withdrawal options. You will also incur maker fees that vary depending on the coin you buy/trade and the coin’s liquidity within the exchange. Enjoy a minimum deposit of $1. It could be more, depending on your region. Bank transfer deposits have a minimum of $500.\n\nDemo trading:\n\nCrypto.com offers demo trading, also known as paper trading. With its paper trading feature, you can practice in a simulated trading environment without the risk of losing your investment.\n\nCrypto.com also offers a seamless and simple copy trading interface where traders can copy the trading strategies of other traders in the market.\n\nTrading Bots:\n\nCrypto.com allows you to trade Bitcoin, Ethereum, and other cryptocurrencies and instruments using automated bots. The bot feature will greatly enhance crypto day trading pros executing large volumes of small orders.\n\nPros: Crypto.com has a powerful user interface and deep liquidity pools that removes excessive spreads from orders.\n\nSupports a decent number of cryptocurrencies and tokens.\n\nSupports a decent number of cryptocurrencies and tokens. Excellent for storing your crypto assets and also trading and investments.\n\nExcellent for storing your crypto assets and also trading and investments. Supports paper trading.\n\nSupports paper trading. Crypto.com has a beautiful layout and architecture that makes trading a little bit easier.\n\nCrypto.com has a beautiful layout and architecture that makes trading a little bit easier. The platform the highest security-level layers in the industry. Only very few exchanges have Crypto.com’s intense security layers.\n\nThe platform the highest security-level layers in the industry. Only very few exchanges have Crypto.com’s intense security layers. Trading fees are competitive, albeit fluctuating.\n\nTrading fees are competitive, albeit fluctuating. Zero deposit fees. Cons: Trading fees fluctuate and can be confusing. Crypto.com has a long list of fees on the Fee Page, which can be excruciating to read, especially for beginner investors. If it’s any consolation, their fees are very competitive and one of the best in the market.\n\nYour money is at risk\n\nBest Apps For Storing Ethereum\n\nThe best Ethereum apps for storing coins are wallets dedicated to storing ETH and other cryptocurrencies. These apps are not necessarily trading apps but are used by people who buy and keep cryptocurrencies rather than trade frequently. Let’s explore the MetaMask wallet.\n\nMetaMask\n\nMetamask is one of the world’s most popular Ethereum apps with over 30 million global users. Since its inception, MetaMask has continued to break boundaries and set itself as the best Ethereum wallet mobile app and the go-to portal between users and Web3 or blockchain applications. Let’s explore why MetaMask is special.\n\nKey Features\n\nMetaMask is incredibly simple to use:\n\nMetaMask allows users to buy, sell, and swap tokens over its mobile application or browser extension. The wallet gives you a secure vault, token exchange capabilities, a token wallet, and safe login. It’s an all-in-one app that promotes Web 3 usage in a simple interface. The beginner-friendly interface helps you store and manage your tokens.\n\nInteract with blockchain applications:\n\nMetaMask is ever so important because most Web 3 applications sit on the Ethereum blockchain and its variants. MetaMask bridges metaverse explorers with blockchains by providing a seamless portal to buy and exchange Ethereum – Ethereum blockchain’s native token.\n\nMetaMask allows you securely access blockchain apps without giving up more than necessary data. The mobile app also supports NFT and DeFi applications such as opensea, giving you unlimited access to the DeFi world.\n\nMetaMask swap:\n\nMetaMask’s new Swap feature allows you to swap tokens at the most competitive prices. For example, MetaMask accesses liquidity information of DEX’s liquidity pools and DEX aggregators like UniSwap, AirSwap, Curve, 0XAPI, 1inch, and Paraswap. With such data, you can execute positions with DEXs with the largest liquidity and save money from spreads.\n\nThe gas fee on a swap is $0.0875% of the swap volume. For large swap volumes, MetaMask spreads your order over multiple DEXs to avoid slippage. Slippage occurs when you make large orders from a single exchange, and prices swing because the exchange isn’t liquid enough to immediately execute the order. Large swaps or positions often lead to slippage, but MetaMask saves you from slippage costs by spreading your order over multiple DEXs.\n\nSecurity:\n\nMetaMask has intensive security protocols, multi-layer security systems, and 2FA authentication to ensure consumer funds’ safety. MetaMask also has an open policy. That is, they disclose security breaches to the users immediately one is suspected. The transparency makes them the best place to buy Ethereum.\n\nMetaMask native ecosystem supports ETH and ETH-based tokens like the ERC-20 and ERC-721.\n\nPros: MetaMask is one of the most popular ETH wallets available.\n\nA swap fee of 0.875% is highly competitive, given that MetaMask exposes users to top DEXs with deep liquidity and minimizes spreads.\n\nA swap fee of 0.875% is highly competitive, given that MetaMask exposes users to top DEXs with deep liquidity and minimizes spreads. MetaMask is a safe and secure option for Australian investors and traders to keep their assets.\n\nMetaMask is a safe and secure option for Australian investors and traders to keep their assets. Supports Ethereum and all Ethereum variant tokens. With partnerships with DEXs, MetaMask also supports the swap or exchange of other tokens. The Swap feature has elevated MetaMask from a simple Ethereum storage to an all round exchange service provider and wallet.\n\nSupports Ethereum and all Ethereum variant tokens. With partnerships with DEXs, MetaMask also supports the swap or exchange of other tokens. The Swap feature has elevated MetaMask from a simple Ethereum storage to an all round exchange service provider and wallet. MetaMask has a simple user interface.\n\nMetaMask has a simple user interface. MetaMask is the gateway to most Web 3 applications, allowing you to securely purchase and swap Ethereum for the native tokens of these metaverses.\n\nMetaMask is the gateway to most Web 3 applications, allowing you to securely purchase and swap Ethereum for the native tokens of these metaverses. It has a secure data-protection program, disallowing Web 3 applications from accessing more data than they should.\n\nIt has a secure data-protection program, disallowing Web 3 applications from accessing more data than they should. The mobile application is seamless, easy to use, and beginner-friendly.\n\nThe mobile application is seamless, easy to use, and beginner-friendly. With MetaMask, you can execute large swaps without worrying about painful gas fees. Cons: While spreading your large order over different liquidity providers and DEXs, you may incur unwarranted fees each DEX charges on order execution. Spreads are not fixed and are entirely dependent on the market and the liquidity of the commodity.\n\nMetaMask supports Ethereum and its variants in its native ecosystem, while swaps are executed via a partnership with other companies. It begets the question of trust. Can you trust MetaMask to keep your data safe and not share unnecessary data with its partners? We think you can!\n\nYour money is at risk\n\nAre Crypto Apps Safe To Use?\n\nThe cryptocurrency industry has been the target of malicious groups. While they operate on autonomous and decentralized systems powered by blockchain networks, attackers often find loopholes in smart contracts and bridges, seizing unimaginable amounts of money from users’ wallets. It’s important to consider the security of your crypto apps before choosing an app to use. Ethereum and Bitcoin trading are the two most prominent coins, and we also have tons of tokens in the market. Investing or trading these coins comes with risk. Let’s explore the safety of crypto apps:\n\nBefore you choose a crypto app, ensure that the app has grade-A level security protocols and does not have a long history of breaches: Apps like Crypto.com and MetaMask, are considered extremely safe because of the safety and security measures they explore in keeping user assets.\n\nCold wallets:\n\nWhile it is easier to transfer funds in hot wallets, cold wallets offer the best security. A crypto wallet or app should store its assets in a cold wallet – inaccessible online to hackers. When your assets are securely stored in a vault, it means that hackers cannot access your wallet through the portal.\n\nLicenses:\n\nA licensed crypto app beats an unlicensed one. No matter how promising an app is, you are subject to malpractices like pump and dumps, rug pull, and hacks if it is unlicensed. Also, when a crypto app is unlicensed, users are not under any user-protection contract; hence, funds lost are dead and gone.\n\nUser reviews:\n\nBefore choosing an app, check out their reviews on PlayStore. It’s usually rare to see a crypto app with a 5-star review aggregate, but anywhere from 3.9 to 4.5 stars is good enough. Of course, the latter number is preferred.\n\nAustralian regulation\n\nThe Australian Securities and Investments Commission, ASIC, is the highest regulatory body for financial providers and financial asset collectors. It’s important to use an app that is licensed by the ASIC. First, the ASIC puts financial institutions through an extreme vetting process, ensuring they have excellent security protocols and insurance policies protecting users. When you visit an exchange’s ‘Security’ page, you see many industry lingoes. Some of these words and numbers are entirely impossible to decipher. An exchange can boast of a certain security feature, but it takes an expert to know real stuff from the shaft. An ASIC certification proves that an exchange or app is as secure as they claim they are.\n\nSecurity and privacy\n\nSecurity and privacy are two very important factors to consider before choosing an app. Let’s take a look at the security features and privacy factors you must consider:\n\n2FA: A crypto app should always support two-factor authentication. The more complex the layers of authentication, the better. Some apps won’t allow you to log into your account without authenticating your primary device. Other apps send codes to your email address and phone number. If an activity on your account raises suspicion, an app should be able to lock you out and request your private key before logging you back in. Other 2FA protocols include location – if you log in from an unusual location, a crypto app can log you out and request your private key before letting you gain access. Volume: If your withdrawal volume is disproportionate to your usual volume, an app’s AI can spot this as a scam and request that you provide your private keys. Cold storage: Cold storage removes your wallet from online. When your wallet and assets are on the blockchain, it is online and susceptible to attacks from malicious scammers. When your assets are offline, it is impossible for an attacker to steal them through online measures. Data sharing: Apps like MetaMaks partner with multiple exchanges to find the best liquidity when you want to swap cryptocurrencies. While the process ensures that you get the most competitive prices at any given time, it may mean that MetaMask and the other DEXs have to share information. MetaMask has explicitly stated in its website that it values user privacy and doesn’t share more-than-needed data; you may need to check the data privacy of other crypto apps to ensure that they do not share sensitive data with their partners.\n\nHow to spot a crypto app scam\n\nCrypto app scams have become a mainstay in the cryptocurrency industry. Scammers often employ different techniques to draw unsuspecting victims and siphon their funds. Let’s take a look at activities that scream scam in the crypto industry.\n\nA shabby-looking website: Scam websites often have the same layout because most scammers are impatient and use scripts of other scam websites to lure people into registering their accounts. A scam website will lack a good home page, won’t reveal the name of the founders of the project, and will have a poor layout. Websites like MetaMask, Binance, and Coinbase, are professionally built and have a simple layout. Leave the website immediately if the layout doesn’t appeal to your sense of safety. Promise mouth-watering returns: Scam websites often promise their users mouth-watering returns like 33% to 44% APY on staking and investments. Cryptocurrency investment can have great returns, but the market is volatile, and no exchange or broker can boast of constant positive returns on investment. A website that promises to double your investment in a few days is certainly a scam. Even established brokers like Crypto.com promise an 8% APY after about a year of holding. Does not require identity verification: Scammers want you to quickly get to the payment page, so they skip many important elements a crypto website should have. One of those elements is identity verification and proof of address. It is illegal to allow an entity to trade without verifying the entity’s identity. Any exchange or app that allows you to trade unverified is certainly not licensed by any major agency. You will be better off donating your funds to charity. No licenses: A crypto website that allows users worldwide to trade without proper licenses in trading regions is a scam site. Be careful! Scam sites are usually open to everyone in every country. Some of them are small time, so they do not fall under the radar of law enforcement; however, these websites can steal thousands and hundreds of thousands of dollars from unsuspecting victims. Spam calls and messages: Any website that claims that an expert will call you during the registration process is most likely a scam. First, a real website with good traffic won’t invest that much in telemarketing. The cryptocurrency space is volatile, and authentic sites avoid telemarketing at all costs. If a crypto exchange calls or sends messages advising you to invest more, you may be in a scam ecosystem.\n\nOther tips to consider include the following:\n\nNever open a link or button in an email from unverified sources. Opening unverified or malicious links can make your device vulnerable to security attacks, including cryptojacking (your device will be used to mine cryptocurrencies). Ensure that you visit the correct URL of popular crypto apps. For example, metamask.io can be cunningly delivered as metamasks.io. The former is the correct MetaMask website URL. The latter, if it exists, is a phony website dressed like the actual MetaMask site.\n\nTop Tips for Using Ethereum Apps Safely Never share your passphrase Under no circumstance should you ever share your private key or passphrase. With your passphrase, scammers can lock you out of your wallet and withdraw every penny you have. Passphrase security tips include: Do not store your passphrase online. Instead, store it in a physical security box. Do not share your passphrase with friends or family members. Use a reliable internet connection A reliable and secure internet connection allows you to explore cryptocurrency applications without exposing yourself to vulnerabilities. Before logging into your crypto wallet, follow these security steps: Do not use public online access: When you browse on public wifi, scammers can mirror your online activity and gain access to valuable information like your wallet address and password. If you want to log into your MetaMask, ensure you do so on a public and secured network. Auto-filling your wallet address might be a bad idea. If a thief steals any of your devices (mobile or laptop), he can gain access to some of your wallets if he logs in through your device. This is because apps like Google and Dashlane lets you autofill passwords and email addresses. Instead of auto-filling, you can set password-saver apps to request for your fingerprint or facial recognition before providing the password. Read user reviews before signing up User reviews give you practical data on how a wallet or an exchange works. If an exchange has poor customer service or has frequent glitches, many users will use the review section of PlayStore or Apple Store to express their displeasure. If a wallet generally has negative reviews, you should find another decent one for your Ethereum storing and trading needs. Store your ETH in a cold wallet after purchasing When you purchase Ethereum, ensure you store it in a cold wallet like MetaMask. A cold wallet is offline and protects your assets better. Can You Use Ethereum Apps To Buy Other Cryptos? Yes, you can use Ethereum apps to buy other cryptocurrencies. Dash2Trade - Best Upcoming Crypto App in Australia Dash2Trade is a powerful crypto analytics and social trading platform that provides trading signals that help its users make informed decisions. The D2T ecosystem, through its powerful algorithm, informs traders when to buy and sell. Dash2Trade has a powerful tracking tool that spots the performance of cryptocurrencies, including crypto presale information, social sentiment measurement on coins, and trending commodities, and utilizes the raw data to project informed decisions on coins. In the middle of the D2T ecosystem, we have D2T, a native token that will support the Dash2Trade ecosystem. D2T is on its third presale phase and has since raised over 6 million from the marked 8 million USD. Dash2Trade’s algorithm is explosive, and its value far surpasses trading bots. D2T is all-encompassing – a watchdog that constantly scrutinizes the crypto world and looks for loopholes for entry and exit. D2T will support all major cryptocurrencies and tokens, especially utility tokens, monitor presales, and exciting Web 3 projects, and interact with every DEX in the industry. D2t set out to raise over $8 million with its third presale but has since raised over $6 million. The figure shows impressive user adoption of the D2T ecosystem as a financial trigger and a wallet. Buy D2T Tokens Your money is at risk\n\nWhat Are The Advantages Of Using An App To Trade Ethereum?\n\nManage orders on the go\n\nA cryptocurrency app lets you manage your orders on the go. Wherever you are, you can access the market, check positions, and make trading decisions with your mobile phone. While all crypto exchanges and wallets have web applications and should work on a desktop website, a mobile application is an easy and seamless way to ensure that you can always track your orders wherever you are.\n\nA mobile application should seamlessly integrate with a wallet or an exchange's web application.\n\nEasy-to-use interface\n\nAn easy-to-use interface facilitates user understanding of cryptocurrency trading and the trading platform. A crypto wallet that has a complicated user interface is unfriendly for beginners and, sometimes, professional traders. Most cryptocurrency apps have basic features for trading, and other apps have a basic interface and pro interface for beginner and pro users, respectively.\n\nLow costs\n\nStoring Ethereum in a wallet comes at a low cost to users, especially giving the immense advantage of storing your digital asset in a cold wallet. Cold wallets like Crypto.com and MetaMask, allow you to store your Ethereum for free. However, you may incur service charges if you want to swap Ethereum for another currency or trade with your Ethereum.\n\nSocial trading\n\nSocial trading is a system where people interact and share trading strategies. Elements of social trading include social interaction and copy trading.\n\nFAQs\n\nWhich is the best Ethereum wallet? eToro is the best Ethereum wallet, if you consider trading; however, for integration with blockchain applications, MetaMask provides better value because it is integrated on the interface of almost all Web 3 apps.\n\nDoes Ethereum have an app? No, Ethereum does not have an app. Ethereum is a Blockchain that hosts many Web 3 ecosystems. Ethereum's native token is the ETH. We also have other variant tokens like the ERC-70\n\nCan you trade Ethereum for free? No. To trade Ethereum or other coins, you will incur service fees, spreads, withdrawal charges, and other fees. The fees you pay for trading vary from exchange to exchange.\n\nWhere to buy Ethereum in Australia? You can buy Ethereum with your MetaMask wallet. You can also buy Eth and other cryptocurrencies through exchanges like eToro, Crypto.com, Binance, and Coinbase."
    }
]