[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzODQ1L2JpdGNvaW4tdHJhbnNhY3Rpb24tY29zdHMtc3VycGFzcy10aG9zZS1vbi1ldGhlcmV1bS1hbWlkLW9yZGluYWxzLXJlc3VyZ2VuY2XSAXRodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjM4NDUvYml0Y29pbi10cmFuc2FjdGlvbi1jb3N0cy1zdXJwYXNzLXRob3NlLW9uLWV0aGVyZXVtLWFtaWQtb3JkaW5hbHMtcmVzdXJnZW5jZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin transaction costs surpass those on Ethereum amid Ordinals resurgence - The Block",
        "content": "Bitcoin BTC +5.88% 's 7-day average transaction fee has surpassed that of Ethereum's, according to The Block's Data Dashboard.\n\nIn the last week alone, Bitcoin's average transaction fee increased 48.4% from $8.59 on Nov. 12 to $12.75 on Nov. 19. Conversely, Ethereum's average transaction fee was $7.55 on Nov. 19.\n\n\"While both chains have seen an uptick in activity recently (and in turn fees), the recent resurgence of Ordinals minting and trading seems to have pushed Bitcoin to have an average transaction fee higher than Ethereum's,\" The Block research analyst Rebecca Stevens said.\n\nThe 7-day moving average of the average transaction fee on Bitcoin has surpassed that on Ethereum since Nov. 9, Stevens noted, adding that the gap is now much wider than when they briefly flipped in early October.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nBitcoin Ordinals\n\nBitcoin Ordinals are a type of non-fungible token recorded on the Bitcoin network. Several advancements throughout the past decade have made the minting of non-fungible tokens, along with their metadata, cheaper and easier on the Bitcoin network.\n\nSeptember saw a peak in Ordinals trading, followed by a slump in October, The Block previously reported. Startups specializing in Bitcoin Ordinals have seen venture capital interest, such as Taproot Wizards's $7.5 million seed raise on Nov. 16."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tb3JkaW5hbHMtZXRoZXJldW0tZmxpcHBlbmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ethereum won't flip Bitcoin anytime soon, but Ordinals could change that - Blockworks",
        "content": "Bitcoin block space looks set to be the hottest commodity in crypto.\n\nBitcoin once again occupies more than half the entire crypto market, having outperformed ether by nearly double so far in 2023. Now, the long-prophesied “flippening” of ether over bitcoin is even further in the future.\n\nThe market currently values Bitcoin three times higher than Ethereum. Bitcoin’s market cap, at $727 billion, has swelled by $400 billion in 2023 — a figure bigger than Mastercard’s entire stock valuation and about twice that of Netflix’s.\n\nEthereum’s valuation has grown by $100 billion, jumping from under $145 billion in January to nearly $245 billion today.\n\nSome anticipate that Ethereum’s market cap will one day eclipse Bitcoin’s, despite the latter’s half-decade head start.\n\nThings were looking good coming out of the 2019 bear market and into 2021’s explosive bull cycle. DeFi summer and NFT mania boosted interest in Ethereum, at times driving up fees for certain actions beyond $250.\n\nBitcoin‘s market value was 925% of Ethereum’s — $130 billion to $14 billion — at the end of 2019 (bottom of the bear market).\n\nThat figure had shrunk to under 200% by the end of 2021 (peak bull market).\n\nBitcoin’s market value is now 300% of Ethereum’s.\n\nThe Bitcoin rally has widened the gap\n\nThe case for flippening has recently taken a hit by a different flip: The Bitcoin network now rakes in more fees than Ethereum for the first time since December 2020.\n\nOver the past four days, Bitcoin users have paid miners about $40 million to have their transactions processed.\n\nEthereum users, meanwhile, forked out less than $27 million ether (most of those fees have been burned, slightly reducing Ethereum’s overall supply).\n\nLayer-2 Ethereum networks Arbitrum and Optimism haven’t bridged that gap as they each generate less than $200,000 in fees per day right now.\n\nThe fee-flippening (flee-pening?) is awkward when you consider the sheer amount of use cases supported by Ethereum. Decentralized exchanges, DAOs, memecoins, NFTs, stablecoins, DeFi and GameFi all run atop Ethereum.\n\nRead more: Ethereum’s Justin Drake is unconcerned despite ether’s middling year pricewise: Q&A\n\nBitcoin, on the other hand, had for the longest time mostly had one application — bitcoin transactions. But the rate of on-chain transactions had until recently sustained very little growth since 2015. Perhaps due to its “digital gold” narrative and the rising ubiquity of alternative cryptocurrencies.\n\nOver the past five years, Ethereum users have paid $17 billion in fees, Bitcoin users just $2.9 billion\n\nAll that changed with Ordinals — a protocol for inscribing individual units of bitcoin (BTC) with unique data to create digital collectibles, first launched in January.\n\nMusic, text, art, video and even code for browser-based DOOM clones have since been inscribed to Bitcoin, resulting in an on-chain collectibles market worth thousands of BTC. Bitcoin users trade Ordinals as Ethereum or Solana users would trade NFTs.\n\nToday, anywhere from around a third to one half of Bitcoin transactions contain Ordinals, driving up demand for blockspace as well as transaction fees. At times today, “medium priority” transactions went for around $11 compared to around $2.30 for the same on Ethereum (more priority generally means faster processing), although those prices have since come down.\n\nTron comes in third overall for monthly fees, mostly thanks to stablecoin Tether\n\nSo is Bitcoin netting more fees than Ethereum good for Bitcoin? Maybe not.\n\nSome Bitcoin insiders worry the network isn’t properly equipped to handle Ordinals and potential influxes of interest in its original use case, BTC payments.\n\nThe CryptoKitties incident in December 2017 — during which a NFT game grew so popular that it spectacularly clogged Ethereum — first showed that Ethereum probably couldn’t handle serving as the “World Computer” just yet.\n\nThen, the 2021 bull market saw NFT mint costs soar to $250 at times — a reminder of how necessary it was to port activity to smaller chains, including rollups. Still, memecoins and low quality token projects ratcheted up fees beyond $20 earlier this year, drastically reducing Ethereum’s usefulness for non-critical tasks.\n\nThe NFT craze of 2021 made Ethereum block space the hottest commodity in crypto. Even while tanking its utility.\n\nOrdinals may end up having the same effect on Bitcoin, especially if demand keeps up and the bull market truly hits.\n\nAt that point, it would seem reasonable to value Bitcoin and Ethereum more similarly. It might just take another run.\n\nUpdated Nov. 16, 2023 at 4:25 pm ET: Corrected reference to percentages in bullet points.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tcHJpY2UtcmV0cmVhdHMtYW1pZHN0LXN0cmF0ZWdpYy1tb3Zlcy1hbmQtbWFya2V0LWR5bmFtaWNzL9IBYWh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tcHJpY2UtcmV0cmVhdHMtYW1pZHN0LXN0cmF0ZWdpYy1tb3Zlcy1hbmQtbWFya2V0LWR5bmFtaWNzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Ethereum price retreats amidst strategic whale moves - AMBCrypto English",
        "content": "Two Ethereum whales sold off over 28,000 tokens.\n\nETH trades around $1,900 as the bull trend weakens further.\n\nThe price of Ethereum [ETH] has been undergoing a reversal over the last few days. Nevertheless, recent observations of whale activities suggest that these large wallets may be exploiting the current price range.\n\nEthereum on the move\n\nAs reported by LookonChain, an Ethereum whale sold off a substantial volume of ETH on 17th November, selling over 10,000 ETH.\n\nThe total value of this transaction amounted to $19.33 million, at $1,933 per token. Further analysis of the whale’s activity revealed this was not an isolated occurrence.\n\nPrevious reports indicated the sale of over 6,000 tokens, resulting in a $12 million transaction, took place some days ago. These actions have created an impression that the whale is selling off its holdings.\n\nAdditionally, another whale, initially holding a long position on ETH, has recently sold off its ETH holdings.\n\nThis particular whale acquired 12,048 ETH in October for $21.3 million, entering into long positions on Aave and Compound.\n\nAt the time of writing, the whale had sold its ETH for $23.4 million, using the proceeds to settle its debt. Is this a strategic profit-taking move, a market dump, or a combination?\n\nImpact on the Ethereum netflow?\n\nAMBCrypto’s examination of Ethereum movements across various exchanges revealed an interesting trend.\n\nDespite the moves from these whales, as mentioned earlier, there was a net outflow of ETH on 17th November. The netflow chart, as analyzed on CryptoQuant, showed that over 16,000 ETH left the exchanges, indicating a negative netflow during that period.\n\nHowever, as of this writing, there was a reversal in the netflow, with over 10,000 ETH flowing into exchanges.\n\nThis shift suggests that there is now an increase in the amount of ETH being deposited into exchanges, potentially for selling.\n\nWhales tapping into profit\n\nAMBCrypto analyzed the 60-day Market Value to Realized Value Ratio (MVRV) of Ethereum.\n\nThe analysis revealed potential motivations behind the observed market movements from the whales.\n\nAn initial examination of the Santiment chart indicated a rapid decline in MVRV attributed to the changing price trends. Around 9th November, the 60-day MVRV stood at over 25%.\n\nHowever, as of this writing, the MVRV had decreased significantly to around 7%.\n\nThis shift in MVRV suggests that the profit derived from the sales of ETH has experienced a substantial reduction, dropping from over 25% to the current 7%.\n\nRead Ethereum (ETH) Price Prediction 2023-24\n\nETH weakening bull run\n\nA review of the daily timeframe chart indicated that Ethereum continued to trend downward. At the time of this analysis, it reflected a 1.7% decrease in value, trading at around $1,920. This decline is underscored by the movement of its Relative Strength Index (RSI) line.\n\nThe RSI was situated in the overbought zone in the previous period, signifying a strong bull run. However, the current trend shows the RSI approaching the point of crossing below the neutral line, suggesting a weakening of the initial bull run."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW92ZXJ0YWtlcy1ldGhlcmV1bS10cmFuc2FjdGlvbi1mZWVzLTA1NDkyNjg4MS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Overtakes Ethereum in Transaction Fees on the Back of Renewed Ordinals Frenzy - Yahoo Finance",
        "content": "Bitcoin Overtakes Ethereum in Transaction Fees on the Back of Renewed Ordinals Frenzy\n\nBitcoin (BTC) has recently surpassed Ethereum (ETH) in terms of average daily transaction fees, signaling a notable shift in the fee landscape. On November 20, Bitcoin's average daily transaction fee reached $10.34, while Ethereum's average fee stood at $8.43.\n\nThe upswing in Bitcoin transaction fees is a result of heightened activity surrounding the Ordinals Protocol, which enables the creation of NFT-like assets and BRC-20 tokens on the Bitcoin network. After a period of relative dormancy in late September to October, Ordinals-based assets experienced a significant surge in late October, according to Dune Analytics.\n\nSince October 24, over 6 million Ordinal assets have been generated, leading to the redistribution of more than 800 BTC in fees (equivalent to $30 million) to the network. The momentum further escalated when ORDI, the second-largest BRC-20 token by market capitalization, was listed on Binance on November 7. This listing sparked increased buying activity of BRC-20 tokens, resulting in a price surge of slightly over 50% for the ORDI token.\n\nIn addition to the growing popularity of the Ordinals Protocol, the Taproot Wizards project, which is built on the Ordinals protocol, announced a seed funding round of $7.5 million on November 17.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzIwL2V0aGVyZXVtLWNvbnRpbnVlcy10by1yb2xsLWhvbGRpbmctYWJvdmUtMjAwMC10aGlzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Continues to Roll, Holding Above $2,000 This Weekend - The Motley Fool",
        "content": "Among the most-watched cryptocurrencies in the market, Ethereum's (ETH 2.51%) rise and fall over any given time period can influence the whole market. It's the second-largest digital asset by market capitalization, so its price swings over a given time frame have an outsized impact on the market overall.\n\nFor this reason, Ethereum's increase over this past weekend has stoked surging interest in the crypto sector. Ether has surged 5% since 4 p.m. ET on Friday (as of 12:30 p.m. ET today), holding steady above the key psychological level of $2,000 per token.\n\nGeopolitical concerns, which are driving uncertainty in the markets, in combination with a falling U.S. dollar have some investors looking to alternative assets such as crypto to safeguard their wealth. Unsurprisingly, Ethereum remains a top option for investors looking to combat currency-related risks from a ballooning U.S. budget deficit.\n\nAdditionally, recent reports indicate that Ethereum's circulating supply is at record lows. The circulating supply of a given token is the percentage of overall tokens available that actually circulate in the ecosystem. This could indicate that investors are viewing Ethereum more as an asset to hold in cold storage (offline) than a token to be traded, highlighting Ethereum's potential as a store of value.\n\nWhat does all this mean?\n\nInvestors have a myriad of concerns to contend with in this market. Heightened geopolitical risks as a result of the recent Israel-Palestine conflict, in addition to the ongoing Russia-Ukraine war, have stoked more defensive positioning from many institutional investors. Accordingly, for portfolio managers looking to spread out their alternative asset holdings across various asset classes such as crypto, Ethereum is going to hold some allure in this respect.\n\nIt's also worth thinking about Ethereum and other megacap cryptocurrencies as a perceived store of value. We haven't really seen how Ethereum has held up during a market crash, as it wasn't invented until after the global financial crisis (and most investors won't call the pandemic a true long-lived recession). With the actual circulating supply of Ethereum near all-time lows, any sort of material demand for these tokens could reasonably spark a further run-up in price.\n\nWhere to go from here\n\nOf course, when an asset like Ethereum (worth nearly $250 billion at the time of this writing) is less liquid than it's been historically, this low liquidity environment can also work in reverse. If we get some sort of bear market dynamic building, it's possible we could see Ethereum give up its recent gains as it has during previous cycles in 2022.\n\nThat said, the strength in crypto markets this year has been notable. As with other risk assets, investors appear to be looking through whatever pain could be on the horizon. And given the added value Ethereum holds as a perceived store of value, it's very possible this strong momentum can continue into 2024."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzIwL3NhbnRhbmRlci1wcml2YXRlLWJhbmstaW50cm9kdWNlcy1iaXRjb2luLWV0aGVyZXVtLXRyYWRpbmctZm9yLXN3aXNzLWNsaWVudHMv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMTEvMjAvc2FudGFuZGVyLXByaXZhdGUtYmFuay1pbnRyb2R1Y2VzLWJpdGNvaW4tZXRoZXJldW0tdHJhZGluZy1mb3Itc3dpc3MtY2xpZW50cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Santander Private Bank Introduces Bitcoin, Ethereum Trading for Clients in Switzerland - CoinDesk",
        "content": "“The Swiss regulation related to digital assets is one of the first and most advanced in the world, since it provides clarity and a comprehensive regulatory environment for our clients,” said John Whelan, head of crypto and digital assets at Santander, in an email. “As holding of crypto as an alternative asset class continues to expand, we expect that our clients prefer to rely on their existing financial institutions to be responsible for their assets.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8yMC8xMDAwMDAwMDAwLWluLWV0aGVyZXVtLWV0aC1sZWF2ZXMtY2VudHJhbGl6ZWQtY3J5cHRvLWV4Y2hhbmdlcy1pbi1qdXN0LXRocmVlLXdlZWtzLWludG90aGVibG9jay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "$1,000,000,000 in Ethereum (ETH) Leaves Centralized Crypto Exchanges in Just Three Weeks: IntoTheBlock - The Daily Hodl",
        "content": "A leading blockchain analytics firm says traders are moving Ethereum (ETH) out of centralized crypto exchanges en masse.\n\nIn a new report, IntoTheBlock says it is looking at Ethereum’s exchange netflows, which tracks the ETH moving in and out of centralized crypto exchanges by subtracting the amount of a coin’s withdrawals from its deposits.\n\nAccording to the intelligence firm, Ethereum witnessed $320 million in outflows last week, bringing the total amount of outflows to $1 billion in just three weeks.\n\nAt time of writing, Ethereum is trading for $2,007, up 1.75% in the last 24 hours.\n\nLooking at Bitcoin (BTC), IntoTheBlock says that the crypto king is flashing bullish signals on-chain as fresh capital appears to flow into BTC.\n\n“There are [growing] signs of new entrants buying Bitcoin. The percentage of active addresses that are newly created, as tracked through the New Adoption Rate indicator, reached a yearly high of 67.62% this week.\n\nBitcoin’s price has also held up strongly while smaller cap crypto-assets rise higher, suggesting inflows into both.”\n\nIntoTheBlock also notes that the amount of Bitcoin held by long-term holders set a new all-time high last week.\n\n“Addresses holding Bitcoin for over one year have historically been a bellwether for the progress in Bitcoin cycles. Hodlers tend to increase their Bitcoin holdings through bear markets and the beginning of bull markets and decrease them near previous all-time highs\n\nWith hodlers’ balance continuing to rise, it appears that investors in aggregate expect Bitcoin to push higher.”\n\nAt time of writing, Bitcoin is worth $37,326, up 1.70% in the past day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWV0aC1icmVhY2hlcy0yMDAwLXJlc2lzdGFuY2UtdGltZS10by1idXkuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction as ETH Breaches $2,000 Resistance – Time to Buy? - Cryptonews",
        "content": "Ethereum Price Prediction as ETH Breaches $2,000 Resistance – Time to Buy?\n\nEthereum (ETH), the cryptocurrency that powers the smart-contract-enabled Ethereum blockchain, has pushed back to the north of the $2,000 per token mark on Monday, extending its gains since last week’s near-$1,900 lows to above 6%.\n\nThe rally comes as the broader crypto market enjoys tailwinds on Monday from a weakening US dollar on bets the Fed’s tightening cycle is over and amid optimism about accelerated crypto adoption in South America in wake of Argentina’s election of pro-crypto/Bitcoin President Javier Milei.\n\nEther bulls will be looking to see whether the cryptocurrency can this weak break to the north of a short-term downtrend that has been capping its price since earlier monthly highs in the $2,100s.\n\nWith major asset managers like BlackRock and Fidelity moving to set up spot Ethereum ETFs, the Ether supply back in deflation thanks to a recent improvement in on-chain activity, and with the macro backdrop seemingly turning into more of a tailwind for crypto, Ether price predictions are likely to remain mostly bullish.\n\nPrice Prediction – Time to Buy Ether (ETH)?\n\n\n\nEther price predictions turned substantially more bullish earlier this month when ETH vaulted to the north of a downtrend that had been in play since the April yearly highs.\n\nThe bulls have lost momentum in the last week and a half amid profit-taking following ETH’s failure to break above the yearly highs in the $2,100s, but should this level break in the weeks ahead, the cryptocurrency is set up for strong gains.\n\nThat’s because, above the $2,150 area, there aren’t any notable levels of resistance all the way until around $3,500.\n\nIf a crypto “Santa rally” really gets going into the end of 2023, traders could be looking at quick 70% gains in the months ahead.\n\nThat being said, now is probably a good time to buy ETH, even though the cryptocurrency is close to yearly highs.\n\nEthereum remains the dominant blockchain utilized by the Decentralized Finance (DeFi), NFT and broader web3 sectors and Ethereum scaling protocols like Arbitrum, Polygon and Optimism are helping the blockchain retain its dominance against upcoming layer-1 rivals like Avalanche and Solana.\n\nWith upgrades in the coming years likely to address Ethereum scaling problems, the blockchain is expected to experience significant further adoption.\n\nThat means Ether is a prime candidate to continue performing well during the upcoming crypto bull market that is arguably already well underway.\n\nEther Alternative to Consider\n\n\n\nA fun new coin called Ether ETF Token ($ETHETF) is performing well alongside Ether and might be a good candidate to consider for risk-tolerant crypto investors looking to diversify their crypto holdings.\n\nThe token is designed to reward its holders based on news events relating to the upcoming expected approval of spot Ethereum ETFs in the US.\n\nThe token was last up around 15% in the last 24 hours, as per DEXTools, with a market cap of less than $1 million, suggesting plenty of room for potential upside should more investors pile into the token.\n\nFor what it’s worth, the token has $440,000 in locked liquidity and no concerning aspects to its smart contract, as per the DEXTools security audit, so investors shouldn’t be too fearful that the token is a scam.\n\nBuy ETHETF HereDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9jYXRoaWUtd29vZC1tYWtlcy1ib2xkLTYwMGstYml0Y29pbi1wcmljZS1iZXQtZXRoZXJldW0tYXQtYXJvdW5kLTJrLWV2ZXJsb2RnZS10by1leHBsb2RlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Cathie Wood Makes Bold $600K Bitcoin Price Bet, Ethereum at Around $2K, Everlodge to Explode? - CryptoPotato",
        "content": "Cathie Wood of Ark Invest predicted that Bitcoin (BTC) could surge to $600,000, and enthusiasts began accumulating this crypto.\n\nEthereum (ETH) also climbed above the $2,000 price range for the first time since April amid renewed interest. Everlodge (ELDG) is also making waves as it entered Stage 7 of its presale. To see how far each crypto can climb, we will be going over them individually.\n\nJoin the Everlodge presale and get a chance to win a luxury holiday to the Maldives\n\nBitcoin (BTC) to Spike to $600,000 According to Ark Invest CEO\n\nCathie Wood, CEO of Ark Invest, made a bold prediction that Bitcoin (BTC) can see a major price upswing to $600,000.\n\nWood discussed the potential of Bitcoin and the broader digital currency market, putting attention to an upcoming launch of new digital asset ETFs. This will take place through Ark Invest in collaboration with 21Shares. Moreover, Wood went over the anticipated approval of a spot Bitcoin ETF by the U.S. Securities and Exchange Commission (SEC).\n\nDuring the past week, the BTC crypto saw an upswing from $35,266.34 to $37,903.66. Now, the cryptocurrency corrected to around $37,100.\n\nEthereum (ETH) to Break Above $3,200 in Q1 2024\n\nEthereum (ETH) has climbed above the $2,000 price barrier during the week. At the time of this writing, the cryptocurrency is trading at slightly above $2,000.\n\nThere has been an increased euphoria surrounding the crypto, especially after the filing of the first Ethereum spot exchange-traded fund by global leading asset manager BlackRock.\n\nAs for the recent price performance, Ethereum saw an increase of 25% in the past 30 days. The crypto went up in value from $1,913.93 to a maximum point of $2,128.61.\n\nEverlodge (ELDG) to Democratize the Real Estate Market\n\nAside from Bitcoin and Ethereum, another crypto to watch is Everlodge. This is an upcoming real estate marketplace that is being developed to enable anyone globally the opportunity to access the otherwise illiquid market. The platform will make it accessible through fractional NFT ownership.\n\nEach property will get digitized and then split into smaller pieces worth just $100 each. This way, enthusiasts will be able to diversify their holdings whilst also retaining benefits.\n\nAs the property increases in value, the NFT could climb as well. Moreover, they can get rental income from properties, depending on their ownership percentage. ELDG is the native crypto, and it can be staked for passive income.\n\nDuring Stage 7 of the preamble that just started, the crypto trades at $0.025.\n\nFind out more about the Everlodge (ELDG) Presale\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWNyb3NzZXMtMjAwMC1hbWlkLWluY3JlYXNpbmctd2hhbGUtYWNjdW11bGF0aW9ucy_SAVNodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1jcm9zc2VzLTIwMDAtYW1pZC1pbmNyZWFzaW5nLXdoYWxlLWFjY3VtdWxhdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "ETH Price: Ethereum Crosses $2000 Amid Increasing Whale Accumulations - CoinGape",
        "content": "Ethereum is once again gaining significant traction in the world of cryptocurrencies as ETH whale accumulations appear to be on a gradual accumulation path for the first time over the past two months, according to data offered by Glassnode, a platform providing on-chain market metrics.\n\nFurthermore, over the past few hours, amid the price recovery experienced by cryptocurrency markets, the ETH price displayed notable gains, overtaking the $2000 mark as of writing.\n\nadvertisement\n\nHowever, with market resistance levels holding still, there’s a rising concern among significant crypto enthusiasts and whales, who hint towards a potential exit plan following two months of discreetly amassing cryptos.\n\nETH On-Chain Metrics: A Closer Look\n\nNotably, the on-chain data highlighted by a leading analyst aligns with an optimistic perspective of Ethereum’s price despite the constant price flux witnessed by the token over the past few days.\n\nFurthermore, an important trend accompanying the price flux is the sudden rise in non-exchange Ethereum balances and the accumulation of ETH. This pattern indicates that rather than responding with panic and quickly selling holdings on crypto exchanges, these significant stakeholders, also known as whales in the crypto segment, are choosing to gather more of the altcoin.\n\nMoreover, after a two-month interval, Ethereum addresses with a balance surpassing 10,000 tokens or $20 million have been discreetly on the rise. This upswing is reinforcing Ethereum’s present path as buyers gain confidence in sustaining momentum beyond the $2,000 threshold.\n\nAlso read: BCBS Report: Banks Invest $10.27 Billion in Crypto, XRP Emerges as Top Altcoin\n\nETH Price Evaluation\n\nAs of writing, the Ethereum price was marginally up by 3.65%, reaching $2,025.38 as of today. Furthermore, the twenty-four-hour trading volume also witnessed a substantial increase of 34.53% and stood at $9.80 billion while writing.\n\nThe aforementioned price surge also seems to come in alignment with the recent amassing of colossal amounts of ETH by whales.\n\nIf the bulls succeed in maintaining the price above the crucial threshold of $2,000, Ethereum might recover, gain momentum, and position itself for an impending breakout from its symmetrical triangle pattern. A successful breakout could propel the coin to challenge its resistance at $2,190 in the coming future.\n\nAlso read: Massive Institutional Buying Of BTC, ETH, XRP, SOL, ADA Continues"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vY2hhdGdwdC1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLW5vdi0xOS_SAUdodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL2NoYXRncHQtZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1ub3YtMTkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Here’s what ChatGPT expects from Ethereum for 2024 - AMBCrypto English",
        "content": "Disclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion.\n\nThe last seven days witnessed some significant developments amid the ongoing bull run.\n\nOn 15 November, asset management giant Blackrock’s spot Ethereum [ETH] exchange-traded fund (ETF) application officially made its way to the U.S. Securities and Exchange Commission’s (SEC) desk.\n\nThe same day, the SEC notified that it had delayed its decision to approve the rule change requested by Grayscale Investments to convert its Ethereum fund to Futures Ether ETF. The SEC now has until 1 January 2024 to make a decision. It was in September that the asset manager had filed for the change.\n\nThe anticipation around ETFs has certainly led to a wild price rally on the charts. It has, however, led many to question how far such developments could adversely affect the decentralized model of the underlying blockchain technology of the crypto market. This is the reason why AMBCrypto too has looked at what’s in the future for Ethereum.\n\nHow it began and subsequently split\n\nA child of Vitalik Buterin, the Ethereum blockchain network was first explored in a whitepaper in 2014. His colleagues on the project included Gavin Wood, Charles Hoskinson, Anthony Di Iorio, and Joseph Lubin.\n\nSubsequently, the team founded a Swiss non-profit foundation, the Ethereum Foundation (Stiftung Ethereum). The project was launched in 2015.\n\nEthereum was created with the goal of being scalable, programmable, secure, and decentralized. It natively supports smart contracts, a key component of decentralized apps. Smart contracts, in tandem with blockchain technology, enable a large number of decentralized finance (DeFi) applications.\n\nUsers can also generate and exchange non-fungible tokens (NFTs), which are tokens that can be linked to specific digital assets such as photos. Furthermore, several other cryptocurrencies use the ERC-20 token standard on top of the Ethereum blockchain and have used it for initial coin offerings.\n\nOnly a year after its launch, the project split into Ethereum and Ethereum Classic [ETC].\n\nWhat happened was that in 2016, a group of network participants gained majority control of the Ethereum blockchain to steal ether worth more than $50 million which had been raised for a project. Most of the Ethereum community opted to reverse the theft by invalidating the existing Ethereum blockchain and approving a blockchain with a revised history—Ethereum.\n\nHowever, a fraction of the community chose to maintain the original version of the Ethereum blockchain. The unaltered version of the blockchain permanently split to become Ethereum Classic.\n\nThe event came to be known as the Hard Fork.\n\nThe Merge and the Shapella\n\nEthereum initially employed the proof-of-work (PoW) consensus mechanism. It required energy-intensive computing referred to as mining to validate blocks.\n\nOwing to criticism around the mechanism’s environmental impact, the project transitioned to proof-of-stake (PoS) consensus mechanism in September 2022. The event came to be known as the Merge.\n\nIt is critical at this juncture that we understand what both these mechanisms are and how they differ.\n\nA consensus mechanism consists of the rules and protocols that govern how a blockchain network reaches an agreement on its state. The two most popular mechanisms are PoW and PoS.\n\nPoW requires the utilization of computational power by miners to solve challenging mathematical riddles and validate transactions. The first miner who solves the challenge receives fresh coins and transaction fees. Although it is though to be more secure and decentralized, it also uses a significant amount of energy and resources.\n\nInstead of requiring miners to solve problems, PoS requires validators to stake some of their coins as collateral. The network then chooses a validator at random to construct a new block depending on stake size and other parameters. The validator is compensated with transaction fees rather than fresh currencies.\n\nPoS is considered more scalable and energy-efficient than PoW.\n\nAt press time, a total of 28,195,445 ETH tokens were staked, valued at $55.6 billion.\n\nETH is the second-largest cryptocurrency in the world, with a market cap above $233 billion.\n\nA recent CoinGecko report put Ethereum as the top Layer-1 (L1) blockchain. Its total value locked (TVL) stood at $23.0 billion in October 2023.\n\nIn 2023, it reached its yearly peak TVL of $31.5 billion in April. This was shortly after the Merge.\n\nAt this point, we decided it’s a good time to solicit ChatGPT, the pioneering AI bot, for critical advice on these developments.\n\nChatGPT has proven to be valuable for traders and analysts. I spoke to ChatGPT about these development while touching a bit on ETH’s price.\n\nAt first, ChatGPT wasn’t able to provide any details. So I decided to educate and jailbreak it.\n\nWe then asked it about the impact of the Merge on Ethereum’s price.\n\nThe bot told me that the Merge catalyzed a surge in demand and confidence. Its response was not a departure from real-time data.\n\nIn April 2023, Ethereum’s Shanghai hard fork, also referred to as Shapella, got finalized. The upgrade allowed users to unstake their ETH tokens for the first time since December 2020.\n\nNotably, the Shapella is a combination of the Shanghai and Capella upgrade. The Shanghai upgrade takes place on the execution level, while Capella takes place on the consensus level.\n\nThe upgrade was the most significant development of the second-largest blockchain since the Merge.\n\nIs Ethereum a commodity or a security?\n\nSimilar to most cryptocurrencies, there has been a lot of debate over the fact whether Ethereum is a commodity or a security.\n\nIn a critical Uniswap court case, the judge ruled in August that ETH is a commodity. The SEC has shied away from doing so even if it hasn’t gone after ether like other tokens.\n\nRecently, Bloomberg analyst James Seyffart underlined the SEC’s unsaid stance over the issue.\n\nEven if SEC won’t explicitly claim ETH to be a commodity in the way that they do for Bitcoin. They have implicitly accepted its commodity status for years. Huge shoutout to @SGJohnsson who has been critical in forming some of my views on this topic. https://t.co/vLq2abeJNO — James Seyffart (@JSeyff) November 16, 2023\n\nHowever, we should also take note of any non-explicit classification so far. The stance of regulatory bodies has also evolved with years, with courts intervening time and again.\n\nI asked ChatGPT about Ethereum’s future performance\n\nEthereum has slowly emerged as one of the most prominent blockchain networks. As ideated, it supports a large number of L2 blockchains. The TVL of Ethereum-based L2 networks recently surged to an all-time high, surpassing $13.8 billion\n\n📈 The Total Value Locked (TVL) in all #Ethereum Layer 2 networks has surged to an all-time high, surpassing $13.8 billion. 🥇 @Arbitrum takes the lead with TVL of $7.5 billion.https://t.co/5mn1kjq991 pic.twitter.com/Vr4GOgVPGX — GN Crypto 🇺🇦 (@GNcrypto_news) November 16, 2023\n\nThanks to the recent bull run, ETH has been trading around the $2,000-mark for the past few days. At press time, ETH was exchanging hands at $1,986.50.\n\nWhile Ethereum’s Relative Strength Index (RSI) rested below the neutral 50-mark, its Money Flow Index (MFI) rested above it. It seemed that the bears and bulls are engaged in a tug of war in regard to ETH.\n\nWe then asked ChatGPT to predict Ethereum’s price towards the end of the first quarter in 2024.\n\nIt forecasted ETH’s price to git $7,000 by the end of Q1 2024. In essence, it expected ETH to surge more than 3x during the next five months — an extraordinary expectation, to be frank.\n\nNext, we asked it what it thinks of ETH’s price by the end of the next year.\n\nThe bot told me that it predicted ETH to reach $10,000 by the end of 2024. It expected the cryptocurrency to rise 5x over the next year.\n\nWhile it is a very high expectation, we shouldn’t outright dismiss it. We are yet to see the wider implications of the ETFs on the crypto market. It is quite possible it might lead to wider adoption, leading to a surge in token prices.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nConclusion\n\nFollowing the encounter with ChatGPT, I must admit that it may be a good idea to leverage its capabilities. As technology develops, so does its potential to revolutionize the cryptocurrency ecosystem.\n\nBesides, there has been a slow rate in the network growth of several crypto projects recently. But with ChatGPT available, crypto education and adoption could improve.\n\nMore importantly, you may want to take its “classic” response a little seriously.\n\nAs far as Ethereum’s price analysis and prediction are concerned, ChatGPT turned out to be a reliable ally. You only need to interact with it enough and it will guide you to the moon.\n\nWhile ChatGPT predicts ETH to hit the price of $10K by the end of 2024, its on-chart metrics don’t suggest a bull run."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzNjQ3L3RoZS1hY3RpdmUtc3VwcGx5LW9mLWJpdGNvaW4tYW5kLWV0aGVyZXVtLWlzLWF0LXJlY29yZC1sb3dz0gFjaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjYzNjQ3L3RoZS1hY3RpdmUtc3VwcGx5LW9mLWJpdGNvaW4tYW5kLWV0aGVyZXVtLWlzLWF0LXJlY29yZC1sb3dz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "The active supply of Bitcoin and Ethereum is at record lows - The Block",
        "content": "The percentage of tokens that have moved in the past year has fallen to record lows for both bitcoin and ether, according to data from The Block.\n\nAt its peak, over 59% of bitcoin's supply was active between March 2017 and 2018. However, in the past year, only 30.12% of bitcoin's supply has changed hands. Ether, which saw over 86% of its supply move between July 2016 and 2017, also hit a record low, with only 39.15% of its supply changing hands in the past year.\n\nFor bitcoin, the record low active supply comes ahead of the anticipated halving of block emission rewards, currently projected to occur in April of next year. The percentage of tokens that haven't been touched for three and five years are also at record lows, according to The Block's data.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nOnly 58.58% of the supply of bitcoin has changed hands in the past three years, compared to over 73% at its peak in late 2019, whereas the five-year active supply has fallen from a maximum of 83% to 70.13%. However, while the supply of inactive coins is higher than ever, transactions on the network are also near their peak."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaWctYmFuay1lbWJyYWNlcy1jcnlwdG8tc2FudGFuZGVyLTExNDg1NjUzOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Big Bank Embraces Crypto: Santander To Offer Bitcoin and Ethereum Trading - Yahoo Finance",
        "content": "Big Bank Embraces Crypto: Santander To Offer Bitcoin and Ethereum Trading\n\nSantander Private Banking International has announced it will now offer its high-net-worth clients in Switzerland the ability to trade and invest in Bitcoin and Ethereum.\n\nThe Spain-based financial services giant, which caters to over 210,000 wealthy clients worldwide, revealed in an internal memo seen by CoinDesk that the new crypto trading and custody services are being provided upon request to clients with accounts in Switzerland through their relationship managers.\n\nSantander said the crypto assets will be kept in a regulated custody model, with the bank storing private keys in a secure environment. Over the next few months, additional digital currencies that meet Santander's screening criteria will be added.\n\n\"As holding of crypto as an alternative asset class continues to expand, we expect that our clients prefer to rely on their existing financial institutions to be responsible for their assets,\" said John Whelan Head of Crypto Assets at Santander.\n\nHe also noted Switzerland's crypto regulations are among the most advanced globally, providing clarity for clients.\n\nSantander, which has been in business for over 160 years and counts 166 million customers, has taken a proactive stance on crypto. While risks exist, the bank seems to recognize the growing importance of digital assets in banking."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vc2hvdWxkLXlvdS1zdG9ja3BpbGUtZXRoZXJldW0td2hhdC10aGUtZGF0YS1zdWdnZXN0cy_SAVNodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL3Nob3VsZC15b3Utc3RvY2twaWxlLWV0aGVyZXVtLXdoYXQtdGhlLWRhdGEtc3VnZ2VzdHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Should you stockpile Ethereum? What the data suggests - AMBCrypto English",
        "content": "Whales sped up their Ethereum accumulation over the last month.\n\nETH was down by 4% last week, and indicators were bearish.\n\nEthereum [ETH] has been witnessing a considerable surge in demand over the past few weeks. The token’s demand kept increasing even when its price peaked during the last bull rally. However, ETH witnessed a correction of late as its weekly chart turned red.\n\nEthereum’s demand is skyrocketing\n\nIntoTheBlock posted a tweet on the 18th of November, which highlighted how Ethereum’s exchange outflow increased. For starters, exchange outflow is defined as the number of coins withdrawn from the exchange wallets.\n\nWhenever the metric rises, it indicates that the demand is increasing. As per the tweet, ETH recorded $320 million in exchange outflows this week.\n\nAdditionally, the token also witnessed an exchange outflow of more than $1 billion over the last three weeks, suggesting that buying pressure was high.\n\nETH recorded $320M in exchange outflows this week, and over $1B through the last three weeks! pic.twitter.com/g1xJfh5p9U — IntoTheBlock (@intotheblock) November 17, 2023\n\nThe fact that Ethereum’s demand was high was further proven when AMBCrypto checked Santiment’s chart. Our analysis found that ETH’s Supply on Exchanges dropped, while its Supply outside of Exchanges increased over the last month.\n\nNot only retail investors, but whales were also actively trading ETH, as evident from the rise in its whale transaction count. Whales’ confidence in ETH was also high as the token’s supply held by top addresses gained upward momentum in the recent past.\n\nEthereum is witnessing a price correction\n\nWhile the token’s demand increased over the past few weeks, ETH’s price plummeted as its value once again went under the $2,000 mark. As per CoinMarketCap, ETH was down by more than 4% in the last seven days.\n\nAt the time of writing, it was trading at $1,956.11 with a market capitalization of over $235 billion.\n\nAMBCrypto reported earlier that there was a possibility of this price decline. In fact, ETH’s price can plummet further until it tests a key support level of $1,700. Once the token tests the support level, it can then initiate a fresh bull rally.\n\nTherefore, this might be a good opportunity for investors to actually stockpile more tokens, as the chances of an uptrend in the weeks to follow seemed high.\n\nAMBCrypto then checked ETH’s daily chart to better understand what to expect from the token in the short term. Ethereum’s MACD displayed a bearish crossover. The token’s Relative Strength Index (RSI) also registered a downtick and took a sideways path.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nThis hinted at a few more slow-moving days.\n\nNonetheless, the Chaikin Money Flow (CMF) remained bullish as it went up."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vd2hhdC10by1leHBlY3QtZnJvbS1iaXRjb2luLWFuZC1ldGhlcmV1bS1hcy10aGUtYnVsbC1yYWxseS1lbmRzL9IBXmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vd2hhdC10by1leHBlY3QtZnJvbS1iaXRjb2luLWFuZC1ldGhlcmV1bS1hcy10aGUtYnVsbC1yYWxseS1lbmRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "What to expect from Bitcoin and Ethereum as the bull rally ends - AMBCrypto English",
        "content": "Bitcoin’s transaction volume has started to decline in the recent past.\n\nEthereum was down by over 4%, and the meme coins were following a similar trend.\n\nThe entire crypto market, including top coins like Bitcoin [BTC] and Ethereum [ETH], enjoyed a comfortable rally during the last few weeks. Most cryptos managed to register promising gains, allowing the capitalization of the overall crypto market to rise.\n\nUnfortunately, like all good things, this bull rally came to an end as well. Therefore, let’s take a look at the crypto market’s condition to see what the future holds as we enter the end of 2023.\n\nBitcoin’s performance looks robust\n\nAt the time of writing, the crypto market cap stood at $1.4 trillion. However, Santiment recently posted an analysis pointing out that the comfortable bull rally came to an end somewhere around the 12th of November.\n\n📊 #Crypto market caps have temporarily run out of steam after the huge 4-week rallies. In our mid-month November market report, we take a look at #Bitcoin's supply moving off exchanges, and how the crowd will impact prices the rest of the year: https://t.co/jhUT3OPulx pic.twitter.com/Pd46PH2Npj — Santiment (@santimentfeed) November 18, 2023\n\nSantiment’s latest report also highlighted how the king coin performed during the bull rally. To begin with, BTC’s price surged by nearly 30% last month.\n\nAs per Santiment’s report, over the last 30 days, key wallets holding between 10 – 10k BTC shed 50,882 bitcoins. Interestingly, after a comfortable rise in transaction volume, the metric started to decline at a time when BTC’s value continued to rise.\n\nLike transfer volume, Bitcoin’s MVRV ratio also increased over the past few weeks. Santiment’s report mentioned that the average trading returns for 365 days were still at +32%, implying that they may need to even out too close to 0% before another takeoff can happen.\n\nNonetheless, the fact that the dormant token movement has been quite active in the first part of November is encouraging.\n\nThis can be expected from Bitcoin\n\nLike Santiment’s report, AMBCrypto’s analysis also found that the possibility of Bitcoin’s price action slowing down was high. As per CoinMarketCap, BTC was already down by more than 15 in the last seven days.\n\nAt the time of writing, it was trading at $36,656.75 with a market cap of over $716 billion.\n\nIts trading volume also plummeted by 40%, suggesting a lower willingness of investors to trade the coin. BTC’s fear and greed index had a value of 69, meaning that the market was in a ‘greed’ position at press time. When this happens, it brings about the possibility of a price drop.\n\nAMBCrypto’s analysis of BTC’s daily chart pointed out that the MACD displayed a bearish crossover. The Relative Strength Index (RSI) also registered a downtick over the past few days.\n\nBitcoin’s Bollinger Bands suggested that the coin’s price entered a less volatile zone, minimizing the chances of an unprecedented surge. Nonetheless, the Chaikin Money Flow (CMF) rested above the neutral mark of zero — a hopeful sign.\n\nAltcoins also rallied substantially\n\nEthereum was not left out of last month’s rally. As per CoinMarketCap’s data, ETH’s price went up by more than 25% in the last 24 hours, allowing it to go above the $2,000 mark.\n\nAMBCrypto’s analysis of Santiment’s data revealed that ETH’s trading volume spiked each time its price went up. A positive signal for Ethereum was that its transaction count remained consistently up. When the token’s price crossed $2,000, its MVRV ratio also peaked.\n\nHowever, like BTC, ETH’s bull run also shows signs of ending, as its price dropped by more than 4% in just the last seven days. At the time of writing, it was trading at $1,959.51 with a market cap of over $235 billion.\n\nWhen AMBCrypto checked CryptoQuant’s data, it was revealed that selling sentiment in the market was dominant.\n\nBoth Ethereum’s Korea Premium and Funds Premium were red, meaning that Korean retail investors and investors in funds and trusts, including Grayscale, have relatively weak buying sentiment.\n\nEthereum’s number of transactions and transfer volume dropped as well — a worrying sign.\n\nInterestingly, while the token’s price dropped, its demand in the derivatives market increased. ETH’s Funding Rate was green, suggesting that investors were buying the token at a lower price at press time.\n\nAdditionally, its Taker Buy Sell Ratio was green as well, further showing that buying sentiment in the futures market was high. Therefore, the possibility of ETH continuing its downtrend seems likely in the days to come.\n\nHow are the meme coins faring?\n\nThe meme coin pack followed the king of altcoins as their values also plummeted in the recent past. For instance, Dogecoin [DOGE], the world’s largest meme coin, registered a value drop of nearly 7% in just the last 24 hours.\n\nIs your portfolio green? Check out the BTC Profit Calculator\n\nShiba Inu [SHIB] had a similar fate, as the token’s price also sank by more than 5% over the last seven days.\n\nConsidering all the aforementioned metrics and market conditions, one can conclude that the market might remain a little slow in the coming days."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vc29sYW5hLWFuZC1hdmFsYW5jaGUtZm9sbG93LWV0aGVyZXVtcy1sZWFkLXJlYXAtdGhlc2UtYmVuZWZpdHMv0gFdaHR0cHM6Ly9lbmcuYW1iY3J5cHRvLmNvbS9zb2xhbmEtYW5kLWF2YWxhbmNoZS1mb2xsb3ctZXRoZXJldW1zLWxlYWQtcmVhcC10aGVzZS1iZW5lZml0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Solana and Avalanche follow Ethereum’s lead, reap these benefits - AMBCrypto English",
        "content": "Solana and Avalanche witnessed a rise in staking.\n\nGrowth in the DeFi sector was observed for both chains even as price movement declined.\n\nIn the last few quarters, interest in Ethereum [ETH] staking has reached new heights. With multiple addresses joining the network to stake ETH, liquid staking protocols such as Lido [LDO] also prospered.\n\nHowever, recently, it was seen that interest in staking wasn’t just limited to Ethereum. Networks such as Solana [SOL] and Avalanche [AVAX] were slowly making their mark in this space as well.\n\nStaking on the rise\n\nSolana has a considerable portion of its available supply locked in staking, which means users hold and store their Solana coins in a special account to support the network.\n\nThis contrasts with Ethereum, where a smaller percentage of its circulating supply is used for staking.\n\nThe recent price increase of Solana may be largely influenced by this high level of staking activity, indicating strong community support and confidence in the Solana network.\n\nStaking is a way for crypto holders to earn rewards by actively participating in network security and operations, making their coins work for them. This difference in staking dynamics contributes to Solana’s recent surge in value.\n\nAn overview of the staking landscape. Solana actually has significantly more of it's circulating supply in staking, compared to Ethereum. This could largely be the biggest contributing factor to it's recent pump. pic.twitter.com/AMWZNDH2GL — ImNotTheWolf (@ImNotTheWolf) November 20, 2023\n\nHowever, it wasn’t just Solana that was seeing growth in this space.\n\nRecently, BenqiFinance on Avalanche experienced growth in liquid staking comparable to what Solana observed in the past month. More people staking on Avalanche is like a team getting stronger. It makes AVAX, the native coin, more secure.\n\nThis also attracts people to Avalanche, causing a surge in the token’s price.\n\nAn overview of the staking landscape. Solana actually has significantly more of it's circulating supply in staking, compared to Ethereum. This could largely be the biggest contributing factor to it's recent pump. pic.twitter.com/AMWZNDH2GL — ImNotTheWolf (@ImNotTheWolf) November 20, 2023\n\nGrowth in DeFi\n\nThere was also some growth in the DeFi sector. Notably, Solana’s exchanges had a big week, trading at $1.93 billion. This shows a lot of money moving on Solana’s blockchain.\n\nDEXes let people trade crypto directly without a middleman. The high volume means more interest and action in DeFi on Solana. This growth shows that people really like using Solana’s DEXes for crypto trading.\n\nAlong with the surge in Solana’s DEX volumes, Avalanche’s DEX volumes also grew. Coupled with that, the TVL on both Solana and Avalanche also rose.\n\nIs your portfolio green? Check out the SOL Profit Calculator\n\nA rising Total Value Locked (TVL) is good for Solana and Avalanche. It means more assets are locked into their networks. This boosts confidence in the platforms. Thus, higher TVL can attract more projects and users.\n\nDespite the protocol’s improvement in terms of staking and DeFi, the growth wasn’t reflected in the price. Over the last few weeks, the overall price of AVAX and SOL fell. At press time, SOL was trading at $9.544 and AVAX was trading at $22.36."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtc2Vlcy1pbnRyaWd1aW5nLXNoaWZ0LW9jY3VyaW5nLWFuYWx5c3QtZXhwbGFpbnMtd2hhdC1oYXBwZW5z0gFdaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1zZWVzLWludHJpZ3Vpbmctc2hpZnQtb2NjdXJpbmctYW5hbHlzdC1leHBsYWlucy13aGF0LWhhcHBlbnM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Sees Intriguing Shift Occuring, Analyst Explains What's Happening - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCryptocurrency analyst and trader Ali Martinez (known on the X social media platform as @ali_charts) has published a post about the second largest digital currency Ethereum, created by Vitalik Buterin as a native coin of the same-name blockchain platform.\n\nHe believes that ETH is currently seeing an \"intriguing shift\" taking place.\n\nMeanwhile, Ethereum reclaimed the $2,000 high over the weekend.\n\n\"Subtle yet intriguing ETH shift happening\"\n\nAli pointed out a \"subtle, yet intriguing\" development taking place for Ethereum; large ETH holders, also known within the crypto community as whales, have again started accumulating Ethereum slowly but surely. This slow purchase activity began for the first time in the past two months, per Ali's X post.\n\n#Ethereum | There's a subtle yet intriguing shift happening – $ETH whales seem to be on a slow accumulation path for the first time in two months! pic.twitter.com/LfvOG0sM3T — Ali (@ali_charts) November 20, 2023\n\nAccording to the Glassnode chart he shared, these are whales that hold 10,000 ETH or more in their wallets.\n\nOver the last 24 hours, Whale Alert crypto tracker, as if supporting this point, spotted two massive ETH transactions made from major exchange Bitfinex to unknown blockchain addresses — 21,229 ETH (worth $42,454,140) and 19,764 ETH (evaluated at $39,157,392). The latter ETH sum went to a new wallet, the above-mentioned source emphasized.\n\nBoth transactions look like purchases of ETH that had been withdrawn to cold wallets for long-term storage.\n\nWhales taking profit as ETH price surges\n\nIn the meantime, the Ethereum price managed to regain the $2,000 high over the weekend, now trading at the $2,023 level on the Bitstamp exchange. Thus, from Friday, Nov. 17, to today, Ethereum has demonstrated 6.10% growth.\n\nAs the ETH price has been rising, several whales decided to withdraw their profits over the weekend. According to Whale Alert data, there were three massive transactions, sending ETH to top exchanges Bitfinex and Coinbase.\n\nThe aforementioned blockchain sleuth spotted 18,373 ETH; 18,095 ETH and 15,000 ETH sent to be sold. The first two transactions are evaluated at slightly more than $35 million. The last of the three was worth $29,711,897."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY3J5cHRvLm5ld3MveC1hY2NvdW50LW9mLWV0aGVyZXVtLWwyLWxvb3ByaW5nLWhhY2tlZC1ieS1waGlzaGVycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "X account of Ethereum L2 Loopring hacked by phishers - crypto.news",
        "content": "Loopring’s X account remained compromised at press time, with the exploiters publishing multiple malicious links promoting a fake LRC airdrop.\n\nThe X page of Ethereum layer-2 network Loopring was compromised on Nov. 20, allowing phishing scammers to publish at least 10 tweets containing harmful links to an illegitimate airdrop for LRC, the project’s native token.\n\nAccording to blockchain security firm CertiK, the links redirected users to a known wallet drainer connected to other phishing campaigns. The exploit lasted all day and the Loopring team was yet to regain control of their account as of press time.\n\nIt’s unknown if LRC users or would-be airdrop claimants have suffered any losses. Loopring had over $98 million in total value locked when the project’s X account was hijacked, DefiLlama data showed.\n\n#CertiKSkynetAlert 🚨@loopringorg X account has been compromised and is posting phishing links\n\n\n\nThe sites posted contain a known wallet drainer.\n\n\n\nMultiple phishing sites have been postedhttps://t.co/B5VoQxRhoe — CertiK Alert (@CertiKAlert) November 20, 2023\n\nThe incident highlights a broader anti-security campaign in cyberspace targeting cryptocurrencies and blockchain-related projects. Analytics provider Dune also halted its platform due to a surge of inorganic traffic but swiftly resumed operations.\n\nYou might also like: Crypto whale losses over $24m in phishing scam\n\nPhishing scammers have launched attacks against several crypto platforms like NFT marketplace OpenSea and hard wallet maker Trezor. Decentralized social network Friend.Tech warned users against a group of scammers posing as crypto journalists, as crypto.news reported.\n\nNearly $27 million stolen by phishers in November 2023 also contributed to over $173 million in estimated losses incurred by cryptocurrency participants, with exploiters rarely returning the funds and instead opting to launder the proceeds through privacy protocols like Tornado Cash.\n\nProjects like JPEG’d have warned users to maintain vigilance against hackers while platforms like Binance and Tether reportedly assisted authorities in recovering millions of funds stolen from victims via crypto scams.\n\nFollow Us on Google News"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZGVjcnlwdC5jby8yMDY3MDUvYml0Y29pbi1ldGhlcmV1bS1uZWFyLXllYXJseS1oaWdocy1vbi1ldGYtaG9wZXPSAU9odHRwczovL2RlY3J5cHQuY28vMjA2NzA1L2JpdGNvaW4tZXRoZXJldW0tbmVhci15ZWFybHktaGlnaHMtb24tZXRmLWhvcGVzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum Hover Near Yearly Highs as ETF Hopes Stay Alive - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin was fast closing in on $38,000 per coin—a price it hasn't touched since April last year—on Monday.\n\nAt the time of writing, the biggest digital currency by market cap was priced at $37,710, according to CoinGecko.\n\nIt is currently up 2% in 24 hours and its price has climbed nearly 25% in 30 days.\n\nAD\n\nAD\n\nEthereum, the second-biggest digital asset, is up nearly 3% in the past day and is trading hands for $2,037 per coin. The asset broke above $2,000 for the first time since July last week.\n\nThere were only two times this year when ETH has been higher. The most recent was last week, when Wall Street titan BlackRock filed to list an Ethereum ETF on Nasdaq. In April, a few days after the network implemented its Shanghai/Shapella upgrade and—among other things—enabled the withdrawal of staked ETH.\n\nThe same keeps happening with Bitcoin: Any positive news surrounding the long-list of Bitcoin ETF applications the Securities and Exchange Commission has sitting on its desk leads to the price of the coin to go up.\n\nAn eight-day window to approve a Bitcoin ETF opened last week for the SEC but the regulator delayed giving a stamp of approval—or denial—to applications.\n\nThe rest of the crypto market was mixed on Monday. Major altcoins like Solana, Dogecoin, and Avalanche cooled their rallies and dipped in price.\n\nAD\n\nAD\n\nBut other smaller, albeit well-known coins and tokens, such as PancakeSwap and ApeCoin made impressive gains.\n\nPancakeSwap (CAKE), the native token behind the decentralized exchange, was trading for $2.67 by the time this article was published—an 8% jump over the day.\n\nWhile ApeCoin (APE) was also up nearly 8% in 24 hours, trading hands for $1.48. It's welcome news for APE holders, who in the past couple months have seen the token hit new laws. At one point in September, it was trading for $1.16 per token.\n\nThis time last month, an Apecoin community accelerator launched from Animoca Brands' Forj, an NFT creators platform.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzE5L2NyeXB0by13aGFsZXMtc2VsbC1vZmYtZXRoZXJldW0tZXRoLWJhc2VkLWFsdGNvaW4tYmVmb3JlLW1hc3NpdmUtNDAtY29ycmVjdGlvbi1vbi1jaGFpbi1kYXRhL9IBggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xOS9jcnlwdG8td2hhbGVzLXNlbGwtb2ZmLWV0aGVyZXVtLWV0aC1iYXNlZC1hbHRjb2luLWJlZm9yZS1tYXNzaXZlLTQwLWNvcnJlY3Rpb24tb24tY2hhaW4tZGF0YS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Crypto Whales Sell Off Ethereum (ETH)-Based Altcoin Before Massive 40% Correction: On-Chain Data - The Daily Hodl",
        "content": "Crypto whales sold off millions of dollars worth of yearn.finance on Saturday prior to YFI sharply correcting by over 40%, according to on-chain data.\n\nSpotted by blockchain-tracking firm Lookonchain, one wallet deposited the better part of $5.8 million worth of YFI to crypto exchanges, likely to be sold off on the open market.\n\n“Why did YFI suddenly plummet more than 40%?\n\nWallet ‘0x48f9’ transferred 446 YFI ($5.8 million) out, most of which was deposited to exchanges…\n\nAnd a whale was very lucky and sold 96 YFI for 636 ETH ($1.23 million) at a price of $12,893 before YFI plummeted.”\n\nBased on Lookonchain’s chart, YFI dropped to a low of $8,971 as the whales unloaded their holdings. The native asset of the yield-farming protocol has since bounced and is trading for $9,408 at time of writing, up over 2% in the last 24 hours.\n\nLookonchain also spotted a wallet associated with the investment fund behind the decentralized exchange (DEX) aggregator 1inch (1INCH) selling the recent rallies in Uniswap to offload its UNI tokens for $2.13 million.\n\nAccording to Lookonchain, the 1Inch Investment Fund sold its UNI tokens at a loss,\n\n“The 1inch Team Investment Fund wallet sold all 416,924 UNI for 2.13 million USDC at a price of $5.11…\n\n1inch spent 2 million USDC to buy 299,849 UNI at $6.67 on Feb 10, then provided liquidity on Uniswap.\n\nIt seems 1inch dumped all UNI at a loss!”\n\nAt time of writing, UNI is trading for $5.09, nearly the same price as when the 1inch Investment Fund sold its holdings.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8yMC9ldGhlcmV1bS1iYXNlZC1kZWNlbnRyYWxpemVkLWV4Y2hhbmdlLWR5ZHgtc3VmZmVycy05MDAwMDAwLWxvc3MtaW4tYW4tYWxsZWdlZC1tYXJrZXQtbWFuaXB1bGF0aW9uLWF0dGVtcHQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ethereum-Based Decentralized Exchange dYdX Suffers $9,000,000 Loss in an Alleged ‘Market Manipulation Attempt’ - The Daily Hodl",
        "content": "An Ethereum-based (ETH) decentralized exchange (DEX) has suffered millions of dollars in losses after an alleged market manipulation attempt by a rogue user.\n\nIn a new thread on the social media platform X, the DEX protocol dYdX says that $9 million from its insurance fund was used to fill gaps in liquidations processed in the recent yearn.finance (YFI) correction but notes that no customer funds were affected.\n\n“Last night about $9 million from the dYdX v3 insurance fund was used to fill gaps on liquidations processed in the YFI market. The v3 insurance fund remains well funded with $13.5 million in funds remaining. No user funds were affected and our team is working to investigate the event.”\n\nAccording to dYdX founder Antonio Juliano, the events that led to the $9 million loss were likely staged by a deep-pocketed bad actor.\n\n“Basically all of this was driven [by] one actor (traceable through on-chain fund movements)…\n\nThe actor was able to withdraw a good amount of USDC from dYdX right before the price crash. The YFI price crash in the spot market seems like an intentional effort by a single actor (unsure whether the same or different one) to target the large OI (open interest) on dYdX…\n\nThis information strongly makes me think this was an intentional market manipulation attempt by a well-capitalized actor(s) designed to drain funds from the dYdX insurance pool.”\n\nThe DEX protocol says it is now widening its margin requirements for its more illiquid trading pairs.\n\n“As an immediate measure, we have increased initial margin requirements for less liquid markets: EOS, ZRX, AAVE, ALGO, ICP, XMR, XTZ, ZEC, SUSHI, RUNE, SNX, ENJ, 1INCH, CELO, YFI, UMA, SUSHI. We will continue to monitor, but believe this to be an important first step.”\n\ndYdX is trading for $3.26 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/JLStock/Sensvector"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtZXRoLTIwMDAtcHJpY2UtcGl2b3QtYXNzZXQtY2hhbGxlbmdlcy1jcnVjaWFsLXRocmVzaG9sZC1hZ2FpbtIBW2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtZXRoLTIwMDAtcHJpY2UtcGl2b3QtYXNzZXQtY2hhbGxlbmdlcy1jcnVjaWFsLXRocmVzaG9sZC1hZ2Fpbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ethereum's (ETH) $2,000 Price Pivot: Asset Challenges Crucial Threshold Again - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAs Ethereum (ETH) approaches the pivotal $2,000 mark, investors are closely monitoring its potential to sustain or reverse the current momentum. The significance of the $2,000 level lies not just in its psychological impact but also as a technical indicator that has historically acted as both support and resistance.\n\nAdvertisement\n\nIn the current context, Ethereum's price resilience can be partially attributed to the network's decreasing supply. With the implementation of EIP-1559, a portion of transaction fees is \"burned,\" effectively removing ETH from circulation. Recent data shows a substantial amount of ETH being burned, with a yearly estimated burn rate of 1,273K ETH. This deflationary mechanism is juxtaposed against the supply growth of 0.35% per year, presenting a compelling narrative for scarcity-driven value appreciation.\n\nEthereum's supply dynamics are complemented by its ever-growing ecosystem, with DeFi and NFTs continuing to create demand for ETH. However, it is essential to consider that, while supply metrics are encouraging, demand must keep pace for a positive price action to be sustained. The overall state of the asset is strong, with fundamentals supported by continuous development and anticipation of the full transition to Ethereum 2.0.\n\nInvestors should consider Ethereum's broader role in the blockchain ecosystem, its technical advancements and the macroeconomic factors that influence the crypto market as a whole. As ETH retests the $2,000 threshold, its ability to hold above this level could be a bullish sign, yet any failure to do so might see the asset seeking support at lower levels. Therefore, investors would do well to keep a keen eye on market trends, on-chain metrics and global economic indicators that could influence Ethereum's trajectory.\n\nShiba Inu claws at key resistance\n\nThe meme coin Shiba Inu (SHIB) has been making headlines in the cryptocurrency market, not just for its community-driven initiatives but also for its price action, which has recently shown signs of rallying. The technical analysis of SHIB/USDT on the daily chart indicates that SHIB is currently testing a critical resistance level, which, if broken, could signal a bullish trend.\n\nAs of now, SHIB is hovering around the 0.00000850 mark. For SHIB to confirm a bullish breakout, it would need to consistently close above this level and maintain upward momentum. The coin has been making higher lows, which is a positive sign for investors looking for a potential uptrend continuation. Conversely, if SHIB fails to breach this resistance, it could see a retraction to lower support levels.\n\nThe broader sentiment in the crypto market, particularly around meme coins, can be fickle, heavily influenced by social media and market trends. Shiba Inu's strong community backing and the recent increase in burn rates have added a deflationary aspect to the token's economics, but the overall impact on price remains to be seen.\n\nInvestors are advised to keep a close eye on volume changes and market sentiment indicators to gauge the potential for SHIB's price movement. Shiba Inu's transition from a meme-based asset to one with actual utility is underway, as evidenced by partnerships like the one with The Manny Pacquiao Foundation, which aims to utilize the Shibarium blockchain for charity initiatives​​.\n\nThese developments paint a bullish picture for SHIB, suggesting that its current market price could offer a lucrative opportunity for investors eyeing the next bull run, with the ambitious target price of $0.01 being a focal point for the community​​.\n\nWhile the burn rate's direct impact on price remains a topic of debate, these concerted efforts by the SHIB community reflect a strategic approach to fostering both demand and long-term value for the token."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tcHJpY2UtZGlsZW1tYS1vci1idXktc2lnbmFsLWJlZm9yZS02MC1yYWxseS0yMDIzMTExOTEyMznSAXRodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1wcmljZS1kaWxlbW1hLW9yLWJ1eS1zaWduYWwtYmVmb3JlLTYwLXJhbGx5LTIwMjMxMTE5MTIzOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Ethereum price dilemma or buy signal before 60% rally - FXStreet",
        "content": "Share:\n\nEthereum price consolidates on the weekly chart inside an ascending triangle.\n\nA successful breakout from this setup forecasts a 43% upswing to $2,943.\n\nBut ETH could rally ahead and tag the MRI’s resistance level of $3,186.\n\nEthereum (ETH) price shows a tightening of the multi-month consolidation. A breakout from this sideways movement could trigger a volatile move to the upside.\n\nAlso read: Ethereum is a commodity, but SEC will not admit it, expert says amid ongoing ETF race\n\nEthereum price edges closer to breakout\n\nEthereum price has set up three higher lows and three roughly equal highs since June 2022. Connecting these swing points using trend lines, reveals an ascending triangle setup. A decisive weekly candlestick close above the triangle’s horizontal resistance level at $2,000 will signal a breakout.\n\nIn such a case, this technical formation forecasts a 43% rally to $2,943, obtained by measuring the distance between the first swing high and swing low to the breakout point of $2,000.\n\nCurrently, Ethereum price sits above the Momentum Reversal Indicator’s (MRI) resistance level of $1,936 and below the ascending triangle’s horizontal resistance level. From the looks of it, ETH seems to have flipped the $1,936 hurdle into a support floor.\n\nIf Bitcoin price does not crash wildly in the upcoming weeks, Ethereum price is set to break out and kickstart an upswing to $2,943. But this move is likely to face resistance around the $2,539 hurdle, which served as a critical support level in March 2022.\n\nWhile $2,943 is the theoretical target, ETH could rise higher and tag the next MRI resistance level of $3,186. This move would constitute a 60% gain.\n\nAlso read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC unfazed as the SEC engages exchanges for spot ETFs\n\nETH/USDT 1-week chart\n\nOn the other hand, if Ethereum price fails to stay above the $1,936 support level, it could trigger a correction down to the $1,795 support floor, where buyers could give the breakout another go.\n\nBut if this attempt fails and Ethereum price produces a weekly candlestick close below $1,547, it will create a lower low and invalidate the bullish thesis. In such a case, ETH could slide as low as $1,309.\n\nAlso read: BlackRock’s spot Ethereum ETF filing fails to catalyze ETH price sustained rally"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzIwL3RvcC1hbmFseXN0LXNheXMtdGhpcy1ibHVlLWNoaXAtZXRoZXJldW0tYmFzZWQtYWx0Y29pbi1hYm91dC10by1ib3VuY2UtaGFyZC1oZXJlcy1oaXMtb3V0bG9vay_SAYMBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMjAvdG9wLWFuYWx5c3Qtc2F5cy10aGlzLWJsdWUtY2hpcC1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWFib3V0LXRvLWJvdW5jZS1oYXJkLWhlcmVzLWhpcy1vdXRsb29rL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Top Analyst Says This Blue-Chip Ethereum-Based Altcoin About To ‘Bounce Hard’ – Here’s His Outlook - The Daily Hodl",
        "content": "A widely followed crypto analyst says that one blue-chip Ethereum-based (ETH) altcoin is gearing up for a bounce after a significant price drawdown.\n\nPseudonymous crypto trader The Flow Horse tells his 186,500 followers on the social media platform X that decentralized oracle provider Chainlink (LINK) looks set for a bullish continuation after retracing its gains earlier this month.\n\n“Rebought LINK, and looking to buy more. This pulled back 22% already, and even if it goes further to $12, I think we bounce hard. Open interest is completely cooked off and price remaining afloat.”\n\nChainlink is trading for $15.07 at time of writing, a 5.29% gain during the last 24 hours.\n\nMoving on to the artificial intelligence-focused altcoin Fetch.ai (FET), the crypto analyst says that as long the digital asset holds its current uptrend, he’ll be accumulating the coin on dips.\n\n“As long as FET holds the trend I am deploying on dips. Again, AI is the only narrative that is new.”\n\nFET is trading for $0.514 at time of writing, a 13.5% increase during the last day.\n\nAlthough the pseudonymous analyst is bullish on LINK and FET, he highlights that there doesn’t appear to be enough capital to keep all altcoins rallying for long and that many will eventually deflate.\n\n“One thing is pretty clear, there isn’t enough capital to keep floating alts for long. Just trying to passively index across different higher beta stuff [until they] hit a ceiling. You either pick winners or be willing to fade some stuff that is going to have a lot of air taken out.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGgtdGVzdGluZy0yay1idXQtaXMtYW5vdGhlci1jb3JyZWN0aW9uLWltbWluZW50LWV0aGVyZXVtLXByaWNlLWFuYWx5c2lzL9IBZ2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGgtdGVzdGluZy0yay1idXQtaXMtYW5vdGhlci1jb3JyZWN0aW9uLWltbWluZW50LWV0aGVyZXVtLXByaWNlLWFuYWx5c2lzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "ETH Testing $2K But is Another Correction Imminent? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Technical Analysis\n\nBy TradingRage\n\nEthereum’s price fell below the key $2,000 level once more, following weeks of aggressive rallying. Yet, a bullish continuation could not be written off yet, as the market is seemingly climbing back above the mentioned level.\n\nThe Daily Chart\n\nOn the daily chart, the price has been rejected decisively from the $2,150 resistance level and dropped below the $2,000 mark.\n\nThe Relative Strength Index has previously pointed to the probability of this correction with a clear overbought signal. At the moment, the market is once again testing the $2,000 resistance level and might be able to break back above soon. The price action’s near future heavily relies on the reaction to the $2,000 zone.\n\nThe 4-Hour Chart\n\nAs the 4-hour timeframe depicts, while the market has been trending downward, there is a lack of significant bearish momentum. This can be interpreted from both the Relative Strength Index failing to reach extremely low values as well as the formation of a bullish flag.\n\nThe flag is a classic continuation pattern and indicates that the market is likely in a correction phase rather than a complete bearish reversal. In this case, a bullish breakout above the flag would initiate the continuation higher.\n\nNeedless to say, if the flag breaks down, things can rapidly get ugly for Ethereum, and a deeper decline could be expected.\n\nSentiment Analysis\n\nBy TradingRage\n\nFunding Rates\n\nFollowing the recent increase in Ethereum’s price, market participants have become optimistic about the mid-term future of the market. This has led to considerable buying pressure in both the spot and futures markets.\n\nThis chart demonstrates the funding rates, which are one of the most insightful metrics when it comes to evaluating the futures market sentiment. Positive values show bullish sentiment, while negative ones are associated with bearish sentiment.\n\nIt is evident that the funding rates have been showing significantly high values over the last few weeks. Meanwhile, a decline has recently started with the correction in price. Extremely positive funding rates are typically witnessed when the price reaches a high and is about to pull back or reverse.\n\nThe reason for this phenomenon is that with high funding rates, the risk for a long liquidation cascade increases drastically. As a result, investors should be cautious as the recent drop in price might be the beginning of a larger bearish phase."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1leGNoYW5nZS1vdXRmbG93cy1leGNlZWQtMS1iaWxsaW9uLWluLTMtd2Vla3MtaW50b3RoZWJsb2NrLXJlcG9ydHMuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Exchange Outflows Exceed $1 Billion in 3 Weeks, IntoTheBlock Reports - Cryptonews",
        "content": "Ethereum Exchange Outflows Exceed $1 Billion in 3 Weeks, IntoTheBlock Reports\n\nA torrent of Ethereum has flowed out of centralized crypto exchanges and into private wallets over the past several weeks.\n\nETH recorded $320M in exchange outflows this week, and over $1B through the last three weeks! pic.twitter.com/g1xJfh5p9U — IntoTheBlock (@intotheblock) November 17, 2023\n\nAccording to blockchain analytics provider IntoTheBlock, Ethereum saw $320 million in exchange outflows just this week. Over the preceding three weeks, the total topped $1 billion.\n\nEthereum Exchange Outflows Inspire Long-Term Industry Confidence\n\n\n\nMassive exchange outflows frequently signal traders are moving assets into secure storage for an extended investment horizon rather than keeping them on an exchange for active trading. Some experts contend the withdrawals reflect improving sentiment around Ethereum’s long-term trajectory as investors choose storage over liquidation.\n\nEthereum is currently hovering around $2,019, up 0.40% over the last 24 hours according to TradingView.\n\nTrading volumes and volatility have also picked up recently across decentralized apps and protocols, driving up transaction fees on the network.\n\nMainstream Ethereum Access Through ETH ETFs\n\n\n\nIn parallel, more traditional finance players are looking to grant mainstream investors exposure to Ethereum’s price movements.\n\n👀🔥 Fidelity Follows BlackRock, Files For Spot Ethereum ETF – Where Next for Ether? Fidelity joins the Ethereum ETF race, filing for the Fidelity Ethereum Trust, following BlackRock's iShares Ethereum Trust filing.#CryptoNewshttps://t.co/mDt3roAkq0 — Cryptonews.com (@cryptonews) November 18, 2023\n\nAsset management powerhouse Fidelity is the latest to join the race for an exchange-traded fund (ETF) that would hold the underlying cryptocurrency rather than futures contracts. A Friday filing with Cboe Global Markets is seeking approval for the Fidelity Ethereum ETF.\n\nThis adds to a string of similar Ethereum ETF applications from competitors like BlackRock. But thus far, the Securities and Exchange Commission has punted decisions on Ethereum ETFs to 2024.\n\nIndustry analysts remain optimistic the regulator will eventually greenlight spot Ethereum ETFs, however, treating the asset similarly to Bitcoin.\n\nIn any case, if an ETF does go through, this will open the crypto up to the $7.4 trillion US ETF marketplace and could significantly expand access for regular investors beyond the hassles of directly holding cryptocurrencies."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtYnVsbGlzaC13aGFsZXMtY29taW5nLWJhY2std2l0aC1lbm9ybW91cy1sb25nc9IBT2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtYnVsbGlzaC13aGFsZXMtY29taW5nLWJhY2std2l0aC1lbm9ybW91cy1sb25ncz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Bullish Whales Coming Back With Enormous Longs - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nA recent flurry of activity by ETH whales has injected both curiosity and anticipation into the market. According to on-chain analytics from Lookonchain, one such whale has repositioned their holdings in a notable manner, selling 12,048 ETH worth approximately $23.4 million to repay debt, after initially acquiring it from Binance when ETH was trading around $1,768​​.\n\nAdvertisement\n\nThis whale, along with others, has utilized ETH as collateral on DeFi lending platforms such as Aave and Compound to borrow stablecoins, with the intention of purchasing even more ETH. This suggests a strategic vote of confidence in ETH's price appreciation potential. Additionally, the withdrawal of a hefty sum of 21,076 ETH, valued at $41.23 million, from Bitfinex by two new wallets indicates a trend of whales moving their funds to cold storage for long-term holding. This behavior typically results in decreased liquidity on exchanges and can potentially buoy the market price​​.\n\nIn a significant transaction, the aforementioned whale placed 7,324 ETH, equating to $14.3 million, as collateral on Compound to borrow $9 million USDT, which was subsequently transferred to Binance. This sequence of transactions is likely aimed at purchasing additional ETH, thus expanding the whale's position in the currency. Such actions reflect a bullish outlook, with these major players positioning themselves to benefit from anticipated price increases and potentially exerting upward pressure on ETH's value​​.\n\nThe strategic moves by ETH whales underscore a sustained bullish sentiment and a long-term investment perspective. With ETH maintaining support above the $1,970 mark, these investors are seizing opportunities to accumulate more of the cryptocurrency. However, the market remains vigilant, as extensive selling by these whales could prompt a market pullback if they choose to realize profits."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzM0NjYxL2NoYWluZ3B0LWludGVncmF0ZXMtd2l0aC1ldGhlcmV1bS1hbmQtcG9seWdvbi1lbmhhbmNpbmctaXRzLWNyb3NzLWNoYWluLWFpLWh1Yi_SAXZodHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8zNDY2MS9jaGFpbmdwdC1pbnRlZ3JhdGVzLXdpdGgtZXRoZXJldW0tYW5kLXBvbHlnb24tZW5oYW5jaW5nLWl0cy1jcm9zcy1jaGFpbi1haS1odWIv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "ChainGPT Integrates With Ethereum and Polygon, Enhancing Its Cross-Chain AI Hub - CoinCodex",
        "content": "Key Highlights:\n\nFollowing plans to build a cross-chain AI Hub, ChainGPT recently announced its integration of Chainlink CCIP across Ethereum and Polygon\n\nThe move follows ChainGPT's plans to improve the experiences within web3 AI.\n\nChainGPT, a renowned AI platform that seeks to bridge the gap between AI and Web3 is seeking to improve its cross-chain AI hub with Ethereum and Polygon.\n\nChainGPT has recently welcomed Ethereum and Polygon to its web3 AI ecosystem after its integration with Chainlink CCIP, an industry standard for secure interoperability between chains.\n\nChainGPT to Foster Cross-Chain Operations Within Its Crypto AI Hub\n\nAccording to a recent blog post from ChainGPT, the platform revealed that the integration will allow it to harness CCIP's arbitrary messaging functionality, thereby paving the way for cross-chain capabilities within the Crypto AI Hub.\n\nAs such, users can now effortlessly list, buy, and sell prompts across Ethereum and Polygon mainnets while they enjoy a more interconnected and streamlined experience.\n\nHeavy on security and efficiency, it appears that ChainGPT's decision to incorporate CCIP was rooted in Chainlink's unparalleled reputation for maintaining top-tier security and reliability in the Web3 industry.\n\nNotably, CCIP's affiliation with the Risk Management Network adds an extra layer of vigilance, continuously monitoring and verifying cross-chain operations to mitigate the risk of suspicious activities within ChainGPT's Crypto AI domain.\n\nArguably, this move reflects ChainGPT's commitment to bringing advanced and remarkable solutions to the web3 and AI industry. As the platform continues to pursue this goal, it has made plans to extend its reach to a diverse array of top EVM chains without deploying its native token directly on those chains.\n\nThis strategic integration eliminates additional liquidity costs while providing users with a broader spectrum of AI tools and solutions. Hence, its integration of the Ethereum Mainnet will see it leverage the network's improved scalability, security, speed, sustainability, and lots more to boost its operations.\n\nFurthermore, the seamless integration process offered by CCIP simplifies the developer experience, requiring only the integration of the CCIP Router on-chain to initiate the creation of secure cross-chain applications. In addition to this, CCIP's scalable architecture eliminates the need for developers to write custom code for chain-specific integrations, enabling users to interact with any blockchain through a unified interface.\n\nIlan Rakhmanov, CEO & Founder of ChainGPT commented on the integration saying;\n\n“With Chainlink CCIP, ChainGPT can expand its reach faster than ever without adding on the overhead of multi-chain expansion.”\n\nBeyond the immediate advantages, Chainlink CCIP proves to be future-proof. Its adaptability supports continuous updates, including the integration of new blockchains, advanced functionalities, and additional security measures. This forward-looking approach ensures that ChainGPT remains at the forefront of cross-chain innovation without incurring switching costs in the face of evolving requirements."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1kb2dlY29pbi1ldGhlcmV1bS1vcHRpbWlzbS1hc2lhbi13cmFwLTIwLW5vdmVtYmVyLTIwMjMxMTE5MjM0NdIBkwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9jcnlwdG9jdXJyZW5jaWVzLXByaWNlLXByZWRpY3Rpb24tZG9nZWNvaW4tZXRoZXJldW0tb3B0aW1pc20tYXNpYW4td3JhcC0yMC1ub3ZlbWJlci0yMDIzMTExOTIzNDU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Dogecoin, Ethereum & Optimism — Asian Wrap 20 November - FXStreet",
        "content": "Optimism (OP) price has shot up 64% in the last three weeks or so. This OP rally seems to be coming to a certain pause as multiple sell signals emerge on the daily chart.\n\nDogecoin (DOGE) price has broken free from its multi-month declining trend line that has defined the dominant bearish trend for nearly a year. The breakout, while pivotal, needs to clear one more critical hurdle before DOGE can take off.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzExLzIwL2NhcmRhbm8tZm91bmRlci1kZWJ1bmtzLXBhdGhvbG9naWNhbC1saWFyLWNsYWltcy1hcy1uZXctZXZpZGVuY2UtZnJvbS1ldGhlcmV1bS1kYXlzLWVtZXJnZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Cardano Founder Debunks “Pathological Liar” Claims As New Evidence from Ethereum Days Emerges - The Crypto Basic",
        "content": "Cardano founder Charles Hoskinson sought to clear the air after new evidence emerged about his past involvement with the Ethereum Foundation.\n\nCardano’s founder, Charles Hoskinson, has often been haunted by the experience he had in his early days in the blockchain ecosystem, especially while working on Ethereum.\n\nIn the latest development, the Cardano founder was compelled to speak in a 22-minute livestream in which he dispelled the rumors and provided clarity to listeners.\n\n- Advertisement -\n\nAt the heart of the current matter was a video and documentation shared by Steven Nerayoff. Nerayoff was an early Ethereum advisor who had access to essential communication within the team. In the documentation being sold as an NFT, Nerayoff shared previously private information on a troubling period in Ethereum’s history.\n\nAt the time, the Ethereum team wanted to restructure the project and called on Nerayoff for advice, leading to a lengthy call between the advisor and Ethereum’s co-founder, Vitalik Buterin. With or without Vitalik’s permission, Nerayoff recorded the call, which he now wants to monetize as an NFT.\n\nETHEREUM RESCUE & RESTRUCTURE PLAN:\n\nIn late 2014 Ethereum was in trouble. Vitalik Buterin asked Steven Nerayoff to do a full diagnostic assessment and recommendations on how to save Ethereum and restructure it for long term success. Over the early months of 2015 Steven and… pic.twitter.com/o7H0dwMhiy — Steven Nerayoff (@StevenNerayoff) November 16, 2023\n\n- Advertisement -\n\nNotably, Charles Hoskinson was among the major subjects of the call. A transcript of the call shows that Charles was mentioned 69 times, with Nerayoff speaking favorably of the entrepreneur’s involvement with Ethereum.\n\nNew Evidence Clarifies Charles Hoskinson’s Reputation with Ethereum\n\nSteven Nerayoff’s latest reveal suggests that Charles Hoskinson was a valuable member of the Ethereum Foundation. During the conversation with Vitalik Buterin, Nerayoff spoke highly favorably of Charles Hoskinson and urged the team to bring him back into the ranks, given his experience and strengths.\n\nReviewing this part of the conversation, Charles Hoskinson said in the recent livestream, “He [Nerayoff] was trying really hard to bring me back into the fold. At this juncture, I was already deep in the thick of things, starting Input Output [Cardano’s engineering arm].”\n\nAccording to Charles Hoskinson, Nerayoff’s documentation and call with Vitalik dispel three main accusations that were leveled against him by naysayers. The allegations include that ‘Charles is a pathological liar, never contributed to the crypto space, and constantly overstated his role in Ethereum’s early development.’\n\nThe Cardano founder, alluding to recent reports by crypto journalist Laura Shin, added that half-baked stories have helped foster those lies. However, such lies hold no water compared to Nerayoff’s independently released information.\n\nMeanwhile, Hoskinson reiterated his long-term commitment to building out Cardano and his reputation in the crypto space. He noted that he has been in cryptocurrency for over 10 years and has had no “class action lawsuit, legal issues.”\n\nAdditionally, the entrepreneur has sustained an impressive track record, having ‘built a $12 billion dollar valued blockchain, collaborated on over 200 academic research papers, and written a lot of code.’\n\n“You can disagree with the economic value of these things. [Yet] You can’t disagree with the fact that I’m here and I’ve been building things,” Charles Hoskinson added.\n\nNotably, Cardano (ADA) has consistently ranked among the top ten cryptocurrencies by market capitalization in recent years. At the same time, the blockchain has seen increased DeFi TVL in the past few months, underlining its continued growth."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9lcmMtNDQzNy1wcm9taXNlZC1hbi1ldGhlcmV1bS1yZXZvbHV0aW9uLWFkb3B0aW9uLWZpZ3VyZXMtdGVsbC1hLWRpZmZlcmVudC1zdG9yeS5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "ERC-4437 Promised an Ethereum Revolution—Adoption Figures Tell a Different Story - Cryptonews",
        "content": "ERC-4437 Promised an Ethereum Revolution—Adoption Figures Tell a Different Story\n\nData from November 14 shows that ERC-4437 has failed to gain meaningful traction among Ethereum developers and users in the months since its launch.\n\nWhen ERC-4437 was unveiled in March 2023, many in the Ethereum community were optimistic that these so-called “smart accounts” would alter user experiences on Ethereum-compatible blockchains for the better. By allowing assets to be controlled by smart contracts rather than externally owned accounts (EOAs), ERC-4437 was supposed to make transactions easier and more secure for everyday users.\n\nAdoption Falters Despite Ethereum Compatibility\n\n\n\nAccording to figures from BundleBear, an account abstraction data analytics platform, both usage and retention of these smart accounts have been underwhelming so far. Only 6.89% of initial smart accounts created have remained active for over six months. The average ERC-4437-enabled account has also only conducted five transactions in total.\n\nThe poor user engagement comes despite ERC-4437’s touted benefits of bypassing seed phrases and simplifying transactions. The standard was designed specifically to make Ethereum more user-friendly, but its sluggish pickup indicates those user experience goals have not yet materialized.\n\nIn addition, core infrastructure providers enabling the functionality have struggled to turn a profit. Bundlers, which allow smart accounts to operate on EVM chains, are largely running at a loss, even with some users accidentally overpaying gas fees.\n\nRetention is terrible. The one exception to this is CyberConnect, who had a lot of users return to claim an airdrop. Data: @0xBundleBear pic.twitter.com/TUzQQJYcp8 — John Rising (@johnrising_) November 13, 2023\n\nLooking at the data, ERC-4437 advocate John Rising described the adoption figures as “terrible.” After its enthusiastic launch and promotion, the standard has so far failed to deliver the promised advancements in Ethereum user experience.\n\nWill ERC-4437 Eventually Catch Fire on Ethereum?\n\n\n\nSome in the Ethereum community urge patience with ERC-4437. Jesse Pollak, protocol lead at Coinbase, argued adoption of new standards happens gradually before reaching an inflection point. The growth of ERC-4437 may seem slow now but could suddenly accelerate as more developers build supporting infrastructure.\n\nAugust 2023 saw the most active ERC-4437 wallets in a month, with over 420,000 across seven blockchains. While this number declined to 143,000 in October, it still indicates steady initial adoption. For a standard launched in 2023, Pollak contended ERC-4437 uptake remains healthy even if below initial expectations.\n\nThe coming months will be crucial in determining if ERC-4437 delivers on its promise to improve user experiences on Ethereum. For now, the reality is that adoption stays muted. But Ethereum’s history shows community standards like ERC-20 took time to gain traction too before transforming the ecosystem. ERC-4437 advocates are still betting this latest standard will eventually catch on in similar fashion."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9iaXRjb2lucy1kYWlseS10cmFuc2FjdGlvbi1mZWVzLXN1cnBhc3MtZXRoZXJldW1zLWZvci1maXJzdC10aW1lLXNpbmNlLTIwMjAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's Daily Transaction Fees Surpass Ethereum's for First Time Since 2020 - Unchained - Unchained",
        "content": "On-chain fees for Bitcoin transactions have surpassed those on Ethereum for the first time in three years.\n\nOptimism surrounding a potential spot Bitcoin ETF approval and the rising popularity of Bitcoin ordinals inscriptions has led to a rise in transaction fees on the network, which surpassed fees on Ethereum for the first time since 2020.\n\nAccording to data from Crypto Fees, Bitcoin transaction fees reached a daily high of $11.6 million, outpacing the $5.6 million in daily transaction fees recorded by Ethereum over the same period.\n\nHowever, on a weekly basis Ethereum transaction fees stands at around $8.3 million, while Bitcoin averaged $7 million in fees.\n\nRead more: BlackRock CEO Larry Fink Calls Bitcoin an ‘International Asset’ that Could ‘Revolutionize Finance’\n\nStill, the shift in daily metrics potentially implies a change in current market dynamics, especially when taking into account the factor at which Bitcoin fees have risen over the last few weeks.\n\nIn the last 24 hours, Bitcoin generated $11M in transaction fees. That is twice what Ethereum did, and up 20X from the amount it was generating two weeks ago. All it took was a little magic from the @TaprootWizards pic.twitter.com/zp6OOh0gUB — Mippo 🟪 (@MikeIppolito_) November 19, 2023\n\n“It gets even better when you look under the hood. Transaction fees (which need to grow for the network to be sustainable) are now 25% of miner revenue. That’s the highest it’s been in a long, long time,” said Michael Ippolito, co-founder of Blockworks, on X.\n\nRead more: Bitcoin Is Finishing Out 2023 as More Valuable Than the Rest of the Entire Crypto Ecosystem\n\nWhile some market participants attribute the surge in Bitcoin network activity to the price action surrounding a potential spot Bitcoin ETF approval on the horizon, others, including Ippolito, believe that a renewed interest in ordinal inscriptions was responsible for most of the activity.\n\nBREAKING: Ordinals inscriptions made up 57% of Bitcoin transactions in the past 24 hours driving up fees to a 5 month high of 205 sat/vB. Ordinals are the #1 use case on Bitcoin right now. pic.twitter.com/lVvNZIG2uV — Leonidas (@LeonidasNFT) November 9, 2023\n\nCongested mempools and high levels of transaction fees are usually a deterrent to user growth, but surprisingly, on-chain data shows that this hasn’t been the case this time around.\n\nData from IntoTheBlock shows that the Bitcoin adoption rate reached a yearly high of 67.62% last week."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jaXR5YW0uY29tL2NyeXB0by10cmFkaW5nLXZvbHVtZXMtc29hci1ibGFja3JvY2stZmlsZXMtdG8tbGF1bmNoLXNwb3QtZXRoZXJldW0tZXRmLXdoaWxlLXRldGhlci1nb2VzLWJpdGNvaW4tbWluaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Crypto trading volumes soar, BlackRock files to launch spot Ethereum ETF, while Tether goes Bitcoin mining - CityAM - City A.M.",
        "content": "Crypto trading volumes soar, BlackRock files to launch spot Ethereum ETF, while Tether goes Bitcoin mining\n\nData from CryptoCompare shows that the price of Bitcoin started last week with a sharp move downwards, dropping from around $37,000 to a low near $35,000, before recovering to now trade at $37,100 per coin.\n\nEthereum’s Ether, the second-largest cryptocurrency by market capitalisation, moved steadily upward throughout the past week, going from around $1,940 per coin to a peak near $2,050 before a small correction over the weekend brought ether down to $2,020 a token.\n\nEthereum’s price kept rising as BlackRock – the world’s largest asset manager – filed an application with the US Securities and Exchange Commission (SEC) for a spot Ether exchange-traded fund (ETF), the iShares Ethereum Trust.\n\nThe fund would aim to “reflect generally the performance of the price of Ether”, and would have Coinbase as the custodian for the ETH held by the fund. Ethereum’s price started climbing after BlackRock registered the iShares Ethereum trust with Delaware’s Division of Corporations a week ago.\n\nBlackRock has filed the S-1 prospectus for its Spot Ethereum ETF with the SEC, earlier this morning.\n\nThe filing, among other things, appoints Coinbase as the Custodian for the underlying ETH.\n\n\n\nThere appears to be no mention on whether the Trust will actively be staking the ETH… — Tree News (@News_Of_Alpha) November 16, 2023\n\nWhile the spot ETH ETF filing helped the price of Ether rise, a fake XRP ETF filing sparked a trading frenzy that saw the price of the cryptocurrency rise as much as 13% throughout the week, before BlackRock denied any involvement. XRP’s price then erased its gains, leading to over $7 million in liquidations.\n\nThe fake XRP ETF filing also appeared on Delaware’s website, and Delaware’s Department of Justice could now be looking into the fraudulent filing. It’s unclear how it ended up on the website.\n\nMeanwhile the cryptocurrency arm of the Chicago Board Options Exchange, Cboe Digital, is set to introduce margined Bitcoin and Ether futures contracts on January 11, following their their receipt of approval from the Commodity Futures Trading Commission (CFTC) in June.\n\nThe move will position Cboe Digital as the first regulated U.S. platform to provide both spot and leveraged derivatives on a single platform. Margined futures enable traders to utilize leverage to trade beyond their collateral, a feature not available with regular futures.\n\nCrypto market volume soars amid South Korean trading frenzy\n\nIn the last two months, the volume of the digital asset market has experienced a significant rise, largely driven by trading activity in Asia, particularly South Korea. According to CCData, South Korean exchanges have more than doubled their market share, increasing from 5.2% in January to 12.9% in November. The total trading volume also saw growth in October and November.\n\nThe firm’s recent Exchange Review report details that Upbit, a centralized exchange, witnessed a substantial increase in market share in October, accounting for 9.16% of the trading volume on these platforms.\n\nThis is the highest market share that the Korean cryptocurrency exchange has achieved since its inception, with local traders reportedly focusing on altcoins.\n\nMeanwhile cryptocurrency exchange giant OKX has started offering derivatives trading off of its platform, eliminating the counterparty risk of holding assets on an exchange, at a time in which it’s also introducing its own layer-2 blockchain called X1.\n\nPoloniex, a well-established cryptocurrency exchange, suffered a major security breach after hackers stole over $100 million worth of digital assets from its hot wallets and used some of the funds to pump the price of TRX, a cryptocurrency created by Poloniex investor Justin Sun.\n\nTether to spend $500 million on Bitcoin mining expansion\n\nLeading stablecoin issuer Tether has started venturing into the Bitcoin mining industry with a significant investment, aiming to become a global leader in the sector. Tether’s incoming CEO Paolo Ardoino has revealed the firm is investing $500 million over the next six months to strengthen its position in the sector.\n\nArdoino has revealed that Tether is establishing Bitcoin mining operations in Uruguay, Paraguay, and El Salvador. Each of these locations will have a power capacity ranging from 40 to 70 megawatts. The company’s objective is to increase its portion of the Bitcoin hashrate, which is the computational power that underpins the network, to 1%.\n\nMeanwhile, global banking giant JPMorgan has launched a new programmable payment option for its institutional clients using its proprietary blockchain platform JPM Coin.\n\nThe latest feature provides institutional clients with the ability to establish treasury operations that are programmable and operate in real-time, laying the groundwork for cutting-edge digital business models, according to JPMorgan.\n\nFrancisco Memoria is a content creator at CryptoCompare who’s in love with technology and focuses on helping people see the value digital currencies have. His work has been published in numerous reputable industry publications. Francisco holds various cryptocurrencies.\n\nFeatured image via Unsplash."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8venljcnlwdG8uY29tL3NhbnRhbmRlci10YWtlcy1ib2xkLWxlYXAtaW50by1jcnlwdG8tYml0Y29pbi1ldGhlcmV1bS10cmFkaW5nLW5vdy1hdmFpbGFibGUtZm9yLXN3aXNzLWFjY291bnQtaG9sZGVycy_SAYABaHR0cHM6Ly96eWNyeXB0by5jb20vc2FudGFuZGVyLXRha2VzLWJvbGQtbGVhcC1pbnRvLWNyeXB0by1iaXRjb2luLWV0aGVyZXVtLXRyYWRpbmctbm93LWF2YWlsYWJsZS1mb3Itc3dpc3MtYWNjb3VudC1ob2xkZXJzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Santander Takes Bold Leap Into Crypto: Bitcoin, Ethereum Trading Now Available For Swiss Account Holders - ZyCrypto",
        "content": "Advertisement\n\nSantander Private Banking International, the international arm of Spanish lender Banco Santander, has recently announced it is delving deeper into the crypto market. The bank has rolled out a new service allowing high-net-worth clients with Swiss accounts to invest in and trade Bitcoin (BTC) and Ethereum (ETH).\n\nExtending Crypto Services\n\nAffluent customers of Santander Private Banking International will now have access to trade bitcoin and ether. The rollout of the new crypto trading service will initially start with BTC and ETH only, with the banking behemoth planning to introduce other cryptocurrencies meeting its stringent screening standards in the coming months.\n\nAs per the report, the digital asset services will be available exclusively at customers’ request and facilitated through their designated relationship managers. The bank will store the private cryptographic keys of the tradable cryptocurrencies in a secure and regulated environment.\n\nThe move by Santander, a prominent banking institution with a history spanning more than 160 years and an extensive customer base of 166 million, represents a wider acceptance of cryptocurrencies in mainstream banking.\n\nJohn Whelan, head of crypto and digital assets at Santander, pointed at the progressiveness of Swiss crypto regulations while commenting on the development. Whelan explained:\n\nAdvertisement\n\n“The Swiss regulation related to digital assets is one of the first and most advanced in the world since it provides clarity and a comprehensive regulatory environment for our clients. As holding of crypto as an alternative asset class continues to expand, we expect that our clients prefer to rely on their existing financial institutions to be responsible for their assets.”\n\nMore Traditional Banks Are Embracing Crypto\n\nSantander’s push into digital asset trading is rather bold, as most multinational banks prefer dabbling in tokenization while avoiding direct exposure to open-access blockchains and crypto assets. The bank will likely benefit from Switzerland’s robust crypto regulatory outlook, overseen by the Swiss Financial Market Supervisory Authority (FINMA). Notably, Switzerland has been grabbing every chance to establish itself as a global leader in the cryptocurrency space.\n\nSantander’s foray into crypto services is a rising trend among banking institutions across the globe. German bank Commerzbank was the first full-service bank in the country to secure a crypto custody license from local regulators. Commerzbank’s move positions it to cater to the growing institutional interest in crypto assets among its clients.\n\nDr. Jörg Oliveri del Castillo-Schulz, chief operating officer of Commerzbank, stressed the bank’s commitment to applying the latest groundbreaking technologies while fully complying with local regulations.\n\nThe increasing involvement of banks in the cryptosphere is a pivotal moment that demonstrates a growing acceptance of digital assets within mainstream financial services."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9ldGhlcmV1bS1lcmMtNDMzNy1pcy1jb21pbmctc2lnbmlmaWNhbnQtYWR2YW50YWdlLWZvci1ldm0tcm9sbHVwcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ERC 4337: The Revolution of Rollups is Underway! - Cointribune EN",
        "content": "Mon 20 Nov 2023 ▪ 4 min of reading ▪ by Mikaia A.\n\nThere’s something new with Ethereum. In due time, the account abstraction related to rollups on the world’s most popular blockchain will become effective. Let’s dive in !\n\nThe Ethereum Foundation wants to revise the concept of rollups\n\nDecongesting Ethereum is the goal of the promoters of the layer 2 zkRollup technology which is behind Loopring (LRC), Hermez (HEZ), and ZKSync. Among all the existing solutions (or those under construction), Loopring would arrive with almost non-existent gas fees: 0.25% for the swap. That’s about a 90% reduction compared to ETH transaction fees on layer 1s.\n\nEven Hermez Network by Polygon doesn’t compete with Loopring on this point.\n\nLet 'er RIP! ✨\n\n\n\nNative Account Abstraction for rollups standardization that is https://t.co/hR0MU6inuh — erc4337 (@erc4337) November 18, 2023\n\nBased on the tweet by Alexander Forshat, a developer at the Ethereum Foundation, U°Today highlighted the imminent arrival of ERC 4337 at the level of Ethereum Virtual Machine rollups. For now, it is just a simple proposal. However, once effective, this account abstraction will facilitate the blurring of the line between accounts on Ethereum and smart contracts.\n\nThe title of Alexander Forshat’s proposal is: “Roadmap for Native Account Abstraction Introduction” (or Roadmap for the introduction of native account abstraction). It also goes by another name, “RIP-7560: Native Account Abstraction”.\n\nThe goal of this proposal is to make use, for the first time, of the concept of AA in the ecosystem of rollups. Using it would facilitate the integration of second-layer scaling solutions for Ethereum, the issuer of ETH cryptocurrency. And at the same time, it would endow on-chain Ethereum wallets with smart contract functionality.\n\nConditions to be respected\n\nOnce AA is enabled in EVM rollups, both L1 and L2 of Ethereum will have similar AA designs conducive to a “seamless ecosystem”. But before we get there, these changes will need to be made within smart contract accounts:\n\nadjusting the entry point address ;\n\nrewriting the validateUserOP function ;\n\ndeveloping transaction logics.\n\nAdditionally, some tweaks will be needed in the adjustment of Paymaster operations and the signature aggregation process.\n\nThis has sparked the interest of Ethereum enthusiasts, who have not hesitated to leave comments in the GitHub repository of the famous proposal. Alexander Forshat remains very optimistic about his proposal.\n\n“We believe that standardization and network effect are essential to the success of any account abstraction initiative, which is why we invite everyone to participate in creating the standard for native account abstraction that can be adopted by all layer 2 and layer 1 networks,” he said.\n\nNote that from a developmental perspective, the Ethereum developers have recently distinguished between Ethereum Research Concepts (ERC) and Ethereum Improvement Proposals (EIP).\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbmdhcGUuY29tL2JhbmNvLXNhbnRhbmRlci1vZmZlcnMtYml0Y29pbi1ldGhlcmV1bS10cmFkaW5nLWluLXN3aXR6ZXJsYW5kL9IBWGh0dHBzOi8vY29pbmdhcGUuY29tL2JhbmNvLXNhbnRhbmRlci1vZmZlcnMtYml0Y29pbi1ldGhlcmV1bS10cmFkaW5nLWluLXN3aXR6ZXJsYW5kL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Banco Santander Offers Bitcoin & Ethereum Trading In Switzerland - CoinGape",
        "content": "Banco Santander, a financial services giant, has made waves by revealing plans to provide Bitcoin and Ethereum trading options exclusively for high-wealth account holders in Switzerland.\n\nThough unconfirmed by the bank itself, an internal source has disclosed that clients choosing these services via Relationship Managers will have their assets protected in a regulated custody model, incorporating an extra security measure with the handling of private cryptographic keys.\n\nadvertisement\n\nWill FINMA Allow Santander to Operate on Cryptos?\n\nThe Swiss Financial Market Supervisory Authority (FINMA), the country’s financial regulatory authority, controls all aspects concerning crypto regulation and other digital asset services such as decentralized finance (DeFi).\n\nTo maintain the laws and regulations of the nation’s crypto rules, Santander may find it a bit easier to operate in Switzerland compared to other countries. As long as firms, fintech startups, exchanges, and banks have the license to operate under the guidelines of FINMA, Santander will not face any issues.\n\nWhile many retail banks are struggling to find a spot to fix their roots on crypto land, Santander has shown a great approach starting with Switzerland. Previously, the investment bank was registered under the French regulator as a crypto custodian.\n\nThe company has been granted digital asset service provider (DASP) certification by France’s Financial Market Supervisory Commission (AMF) to deliver the services it claims.\n\nAlso Read: Mastercard Taps Feedzai To Fortify Defense Against Crypto Frauds\n\nBitcoin, Ethereum Prices Reacts Positively\n\nBitcoin and Ethereum have been seen complementing each other. The largest crypto by market cap, Bitcoin price soared 2.23% to trade at $37,273.87, while the Ethereum price added 4.14% to $2,031.11 over the last 24 hours.\n\nThe rise of both could be driven by multitudinous reasons. The recent developments in the field of ETF are one of the reasons. Spot Bitcoin ETF, which is still under the scrutiny of the SEC is yet to be allotted to the 12 firms in the queue.\n\nThe recent announcement of Spot Ethereum ETF filling by BlackRock has created a spark in the market again. The news fuelled the prices of ETH, leading to an 8% rise in just 14 days.\n\nIf the applications are passed by the SEC, experts have predicted that both Bitcoin and Ethereum will see major price changes.\n\nAlso Read: Pepe Coin Soars As Devs Deposits Over 400 Bln PEPE To Binance"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLWFuZC1ldGhlcmV1bS1uZXR3b3Jrcy1zZWUtaGVpZ2h0ZW5lZC1mZWVzLWFzLWNyeXB0by11c2FnZS1zb2Fycy5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Networks See Heightened Fees as Crypto Usage Soars - Cryptonews",
        "content": "Bitcoin and Ethereum Networks See Heightened Fees as Crypto Usage Soars\n\nBitcoin (BTC) and Ethereum (ETH) networks have experienced a dramatic surge in transaction fees amid soaring crypto usage.\n\nAccording to data by BitInfoCharts, the average BTC transaction fee currently stands at around $10, up by more than 500% compared to less than $2 earlier this month.\n\nNotably, the average BTC fees reached as high as $18 on October 16 and 18, which coincided with a surge in the leading cryptocurrency and rising trading volume.\n\nLikewise, Ethereum gas fees has spiked to over 100 gwei, according to data by EtherScan.\n\nAs of now, it costs a user more than $60 to make a swap across the Ethereum network, around $110 to sell an NFT, and $20 to bridge assets.\n\nFurthermore, CryptoFees data shows that Bitcoin’s daily fees averaged $10.65 million from November 16 to November 18, surpassing Ethereum’s average fee of $6.9 million for the same period.\n\nRising Bitcoin Fees Attributed to Ordinals\n\n\n\nSome market analysts have attributed the recent surge in BTC transaction fees to the revival of Ordinal Inscriptions.\n\nThese digital assets, akin to NFTs but on BTC’s smallest denomination, satoshis, gained traction earlier this year, signaling Bitcoin’s venture into the NFT sector.\n\nWhile interest waned as the market evolved, a resurgence occurred as these assets expanded to other blockchain networks like Polygon and Litecoin.\n\nBREAKING: Ordinals inscriptions made up 57% of Bitcoin transactions in the past 24 hours driving up fees to a 5 month high of 205 sat/vB. Ordinals are the #1 use case on Bitcoin right now. pic.twitter.com/lVvNZIG2uV — Leonidas (@LeonidasNFT) November 9, 2023\n\nBack in May, the rising Ordinals popularity cuased a network congestion that led to an overwhelming 500,000 unconfirmed transactions and sent the average transaction fee through the roof.\n\nFollowing the incident, some Bitcoin developers even suggested releasing an upgrade to kill Ordinals.\n\nIn a Bitcoin developer forum, Bitcoin core developer Ali Sherief suggested introducing a runtime option to delete all non-standard Taproot transactions, including Ordinals and BRC-20 tokens.\n\nBitcoin Adoption on the Rise\n\n\n\nThe recent surge in BTC transaction fee comes amid growing adoption of the leading cryptocurrency.\n\nAccording to a report from IntoTheBlock, Bitcoin adoption has reached 67.62%, a new yearly high.\n\nThis uptick signifies a rise in newly created active addresses, indicating an influx of new market participants.\n\nFurthermore, the volume of BTC held by long-term investors hit an all-time high, with over 1 million addresses owning more than 1 unit of Bitcoin.\n\nBlockchain analytics firm Santiment has also supported these findings, noting an increase in smaller wallets with less than 1 BTC."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYnJhdmVuZXdjb2luLmNvbS9pbnNpZ2h0cy9jcnlwdG8tYXNzZXRzLXlvdS1jYW4tbWluZS1mcm9tLWEtaG9tZS1jb21wdXRlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Crypto you can mine from a home computer in 2024 - Brave New Coin",
        "content": "Crypto you can mine from a home computer in 2024\n\nWhile mining bitcoin on an individual computer is no longer viable, there are other cryptocurrencies that you can still mine at home if you’re prepared to put in the effort.\n\nUpdated 2nd December 2023. If the volatility of investing in cryptocurrencies is too much for you but you still want to benefit from the new economy, setting up a small cryptocurrency mining operation at home may be the right choice for you. Although the quoted returns are high, we warn against ‘cloud mining’, as every crypto cloud mining offer we’ve seen is a scam.\n\nWhat Crypto To Mine?\n\nThe easiest cryptocurrency to mine is one that doesn’t require you to build a massive crypto mining rig. Although it was initially possible to mine Bitcoin using laptops and desktops, the growing mining difficulty as well as the advent of Application Specific Integrated Circuit (ASICs) hardware created specifically for Bitcoin mining has made it all but impossible to profitably mine Bitcoin at home using the processing power of a PC or laptop computer. However, crypto mining from home is still an option for other popular cryptocurrencies in 2023. In this article, we will introduce many popular options — with some how-to instructions to help get you started.\n\nDogecoin (DOGE)\n\nMarket Cap: 9.7B Average Daily Volume: 200M-350M+\n\nThough the digital currency started out based on a meme, Dogecoin (DOGE) has been popularized by Elon Musk and has grown to be an altcoin with a substantial user base. DOGE is designed to add new coins each year as opposed to Bitcoin’s finite supply. This is an added incentive for anyone mining it.\n\nHow To Mine Dogecoin\n\nTo mine DOGE, first ensure you have a wallet to store your earnings. You can download the Dogecoin core wallet or look on the website for other suitable online wallets. When mining using your CPU, the software that works best is CPU miner. Mining in this manner is possible, albeit at a slow rate. To increase the mining speed, you can use graphic cards. AMD and Nvidia cards are your best bet (see below for details on building mining rigs). If you decide on GPU mining, then the software you should use is either the cgminer or cudaminer. Full instructions for mining Doge can be found here.\n\nWhile crypto mining as an individual is doable, it is advisable to sign up to a mining pool as you can take advantage of larger processing power and speeds and thus generate higher mining returns. An example of a mining pool that supports Dogecoin is MultiPool. Once mined, exchanges that trade Dogecoin include Binance and OKX. If you’re not an experienced trader, check our article on the best crypto trading bots, as many come with copy trading tools that mean you’ll be making the same trades as the experts do.\n\nCheck current Dogecoin Price\n\nEthereum Classic (ETC)\n\nMarket Cap: 2.5B Average Daily Volume: 70M-150M\n\nThe main goal of the Ethereum Classic project was to ensure the survival of the original Ethereum blockchain, to provide an alternative for people who strongly disagreed with the DAO bailout of Ethereum and the direction taken by the Ethereum Foundation. Mining standard Ethereum is no longer possible as the Ethereum blockchain moved to proof of stake in October 2022. This was good news for Ethereum Classic as the resources formally used for mining ETH can easily be applied to mining ETC.\n\nHow To Mine Ethereum Classic\n\nWhile ETC can be mined with ASIC machines, it can also still be mined on desktop machines. A full list of mining resources for Ethereum Classic can be found here. Once mined, exchanges that trade Ethereum Classic include HitBTC, Binance and Huobi Global.\n\nCheck current Ethereum Classic price\n\nMonero (XMR)\n\nMarket Cap: 3B Average Daily Volume: 40M-100M\n\nMonero (XMR) is a popular anonymous digital currency. Furthermore, this altcoin’s network was designed specifically to resist the development of Monero specific ASIC’s. Therefore, it is well-suited for mining with a home computer.\n\nHow To Mine Monero\n\nTo begin, you must first download a wallet to store your coins. It is recommended to use the official Monero GUI client. Following this, the next step is to download mining software that supports Monero such as MultiMiner. MultiMiner is among the easiest to use but there are also other mining options available online. Once mined, exchanges that trade Monero include Binance and Bitfinex.\n\nCheck current Monero Price\n\nZCash (ZEC)\n\nMarket Cap: 540M Average Daily Volume: 20M-40M\n\nLaunched in 2016, Zcash (ZEC) is a leading privacy-centric digital currency. For mining crypto at home, Zcash’s most important feature is that it employs the Equihash algorithm which is designed to be ASIC resistant. As a result, the home miner with a GPU can participate.\n\nHow To Mine ZCash\n\nBefore you can start mining Zcash, you will need to download the software that will control your hardware. Download the Zcash blockchain and set up your wallet. This will involve some waiting as the blockchain will need to download in its entirety on your node, and sync as well. Additionally, you will need to download the drivers for your graphics cards. Full instructions for mining Zcash can be found here.\n\nOnce mined, exchanges that trade Zcash include Binance, Huobi Global, and Bitfinex.\n\nCheck current Zcash Price\n\nRavencoin (RVN)\n\nMarket Cap: 250M Average Daily Volume: 5M-8M\n\nRavencoin (RVN) is a blockchain network optimized to move assets from one holder to another, such as tokens. Ravencoin is a fork of the Bitcoin code. It cites its main improvements over Bitcoin as a one-minute block reward time, a change in the number of coins released, but not the weighted distribution schedule, and the inclusion of capabilities for asset development and messaging. Ravencoin is open source.\n\nHow To Mine Ravencoin\n\nThe Ravencoin KAWPOW algorithm is designed to be ASIC resistant and can be mined using a consumer grade GPU. More details on mining Ravencoin are available here. Once mined, exchanges that trade Ravencoin include Binance, Huobi Global, and OKX.\n\nCheck current Ravencoin Price\n\nBitcoin Gold (BTG)\n\nMarket Cap: 238M Average Daily Volume: 1M-3M\n\nBitcoin Gold (BTG) was launched in 2017 as a fork of the original Bitcoin blockchain. Although it initially had a progressive roadmap aimed at extending the scalability and the development potential of Bitcoin (BTC), the project has fallen silent in recent years and has not updated its website roadmap or its Twitter feed since 2021. Nonetheless, BTG still has a respectable market cap and daily trading volumes, so anyone mining BTG will be easily able to find buyers.\n\nHow To Mine Bitcoin Gold\n\nBitcoin Gold uses Equihash-BTG, also known as Equihash(144,5) or Zhash and its price movements typically correlate quite closely with those of the original Bitcoin. Check here for more info on mining Bitcoin Gold. Once mined, exchanges that trade Bitcoin Gold include Binance, Bitfinex\n\nHitBTC and Huobi Global.\n\nCheck current Bitcoin Gold Price\n\nHorizen (ZEN)\n\nMarket Cap: 112M Average Daily Volume: 4M-6M\n\nLaunched in 2017, Horizen and its native cryptocurrency ZEN is a proof-of-work, equihash-based cryptocurrency and is mineable with a GPU. The project aims to ensure data integrity and privacy freedom by enabling real-world use cases within a secure interoperable blockchain ecosystem. In terms of price, like most alt-coins, ZEN tends to follow the overall price trend of Bitcoin and Ethereum. Its highest price was US$148 achieved in December 2021. It has a respectable market cap and liquid daily trading volume.\n\nHow To Mine Zen Coin\n\nMore information about mining ZEN can be found here. Once mined, exchanges that trade ZEN include Binance, HitBTC and Huobi Global.\n\nCheck current ZEN price\n\nBytecoin (BCN)\n\nMarket Cap: 6.8M Average Daily Volume: 5k-10k\n\nAnonymous cryptocurrency Bytecoin (BCN) is another altcoin that is easy to mine on your home computer. Solo mining has been designed to be an easy process for Bytecoin users.\n\nHow To Mine Bytecoin\n\nTo mine BCN you need to download the Bytecoin wallet and run the program on your computer. After the program is done syncing with Bytecoin’s blockchain, create a wallet for yourself. Then simply input the begin mining command and set your wallet address as the recipient. Solo mining works on Bytecoin’s network, but the process is slow and may not get you much revenue. To enhance earnings, you can join a mining pool that supports CPU mining. A good example is bytecoin-pool.org. You will also need to download compatible mining software such as xmrig.\n\nIt is also possible to mine Bytecoin using GPUs. To mine in this manner, you will need to download software that is compatible with GPU mining. While the set-up process here is more complex than with CPU mining, it does lead to a faster mining process. Once mined, exchanges that trade Bytecoin include HitBTC and Poloniex.\n\nCheck current Bytecoin price\n\nBeam (BEAM)\n\nMarket Cap: 9.7M Average Daily Volume: 100k-150k\n\nA MimbleWimble implementation, Beam (BEAM) is well-suited for home mining. It employs the Hashii algorithm that supports GPU mining.\n\nHow To Mine Beam\n\nTo get started, download the official Desktop Wallet, depending on the operating system on your computer, your antivirus may flag up the mining software as a harmful program. Exclude it from that designation or you will run into trouble in the mining process. Once the blockchain has downloaded and synced you are ready to start mining. You must first configure your settings. Turn on the “Run Local Node” feature and set the number of mining threads to a number greater than zero.\n\nIt is important to note that Beam’s infrastructure involves the use of expiring addresses to maximize privacy. However, you will require a permanent address to successfully recover your mining revenues or your tokens will be lost. To create a permanent address, navigate to the receive tab on the main dashboard of the software. You can create a new address and set it to never expire to use it for the mining set-up. Once mined, exchanges that trade Beam include Binance and Bitforex.\n\nCheck current Beam price\n\nVertcoin (VTC)\n\nMarket Cap: 6.6M Average Daily Volume: 30k-40k+\n\nLaunched in 2014, Vertcoin (VTC) is another popular choice among small miners. The digital currency is designed to stay true to the spirit of decentralization and financial sovereignty envisioned by Satoshi Nakamoto when he created Bitcoin. The project’s developers created the blockchain as a response to the growing influence ASICs were having on the Bitcoin blockchain and the mining ecosystem in general.\n\nHow to Mine Vertcoin\n\nThe algorithm employed with Vertcoin’s POW consensus mechanism is Lyra2RE and is designed to be ASIC-resistant while simultaneously supporting GPU and CPU mining. VTC is popular because it has a very simple mining process. It is a matter of one click as the project developers have created the architecture to support easy mining. To start mining, download the software here, and join a mining pool to maximize mining revenues. Once mined, exchanges that trade Vertcoin include Bittrex and UPBit.\n\nCheck current Vertcoin price\n\nGrin (GRIN)\n\nMarket Cap: 3.5M Average Daily Volume: 400k-500k\n\nGrin (GRIN) was launched in January 2019. The project is focused on privacy and scalability. Like Beam, the Grin blockchain employs the MimbleWimble algorithm to support transactional privacy. For the home miner, though, it is the blockchain’s ASIC-resistant POW algorithm that is most relevant. Moreover, the project developers have gone a step further to hard code a hard fork every six months to minimize the effects of any ASICS that may be developed specifically for its network.\n\nHow To Mine Grin\n\nTo get started with “GRINning”, download the blockchain from the official website to set up a node. Once you have successfully synced the blockchain, you must connect the node to your wallet. Creating your wallet is a simple matter of running a file in the directory. Once the wallet is live, you must then configure your graphics cards to work with the wallet. Finally, remember to set the software to the Cuckaroo POW, which is the version of the Grin network that supports GPU mining. Grin supports both CPU and GPU mining. However, if you decide to go the GPU way, purchase Nvidia cards because these are considered more effective. Moreover, you must have a minimum of 5.5 GB space to begin mining the coin. Once mined, exchanges that trade Grin include Bittrex and HitBTC.\n\nCheck current GRIN price\n\nAEON (AEON)\n\nMarket Cap: $1.3M Average Daily Volume: $50-$220+\n\nAEON was originally forked from Monero and based on the CryptoNote protocol. It uses the CryptoNight-Lite algorithm and ring signatures to make sure that transactions are untraceable.\n\nHow To Mine AEON\n\nAlthough AEON Is modelled after Monero, the project has chosen to forgo ASIC resistance. That said, AEON can still be mined with Windows CPUs, and AMB and Nvidia GPUs. More info on mining AEON can be found here. Once mined, Exchanges that trade AEON include Bittrex and HitBTC. Check current AEON price\n\nHow much money can you make GPU crypto mining at home?\n\nMining crypto at home with a CPU is possible with coins like Monero, Zcash and Byte, but it will be a slow process and the cost of electricity may be more than the value of the coins you can mine. For those who want to get more serious, crypto GPU mining is a realistic path. GPUs such as the NVIDIA GeForce RTX 3090 and GeForce RTX 3080 are popular options. The price of GPUs range from as low as $600 up to $2000 and more. The reason for the price differential is all about performance. For GPUs this relates to their maximum hashrate.\n\nIn simple terms, hashrate is the amount of power/speed/calculation that the GPU unit can apply to mining a cryptocurrency. The hashrate is expressed in ‘million hashes per second’. So 1MH/s is one million hashes per second. Lower-cost GPUs typically have lower hashrates. CPUs on desktops and laptops have lower hashrates still, and are measured in thousand hashes per second as opposed to millions – so TH/S.\n\nThe hashrate and revenue calculation\n\nHashrates.com is an excellent resource for calculating potential earnings. It displays hashrates for both CPUs and GPUs and an estimate on how much one could make per month applying that hashrate to mining cryptocurrency. For example, Hashrates.com says a GeForce RTX 3080 GPU can operate at 48MH/s and would earn $217 a month mining Ethereum. In comparison, an Intel i9-10900 can operate at 4KH/s and would produce around $9 worth of Monero over the same period. Two other factors influencing profitability are:\n\nThe market price of the coin you are mining. Cryptocurrency prices are highly volatile – so mining a crypto that is trending up will make you more money than one that is flat or trending down.\n\nThe cost of electricity. A basic rule of thumb for a GPU is the higher the hashrate it can produce, the more electricity it will use. The price of electricity worldwide is measured in kilowatt-hours.\n\n\n\nElectricity prices vary widely in the US. Source – Electricity prices vary widely in the US. Source – EnergyBot\n\nAccording to EnergyBot, the average price per kilowatt-hour in the U.S is currently 16.11 cents – but the price varies widely between states. The least expensive state is currently Idaho at 7.99 cents per kWh, and Hawaii is the most expensive at 43.18 cents. Worldwide, the lowest price electricity can be found in Burma, with many Arab states also offering very low rates.\n\nHow to scale up GPU mining – case study\n\nThe following case study was written by a professional GPU miner. In it they detail their real-world experience in GPU mining on a more commercial scale.\n\nThe technology set\n\nWe have 13 desktops that are low-cost Intel systems running Windows 10. The key here is finding motherboards that support 8 GPUs or more. Most run Z390 chipsets which are 8th/9th Gen Intel CPUs as the motherboards are readily available on Amazon. Speed is irrelevant as some systems run Celeron and some Intel i9 but mining will be 100% GPU dependent so no difference in speed. This is the area where you can cut corners to save on costs.\n\nWindows is not stable with more than 8 GPUs running. We utilize Windows to remote connect to each rig on our phones with Google Chrome. We do not recommend running anything larger because of stability and also because you would need Linux. All rigs run in an open frame with 120mm cooling fans to dissipate heat. The GPUs will thermal throttle down if not cooled or housed in a case.\n\nThe profitability equation\n\nEthereum has proven to be the most profitable crypto to mine per wattage. For a low-cost rig, 8 AMD RX580’s generate $20 per day before electricity. I recommended 8 – AMD 5700 XT’s because they use the same amount of electricity as the RX580s while generating 30% more profit. Electricity is your number one hurdle for profitability during a bear market. During a bull market it’s not really a factor. For example, the rigs above utilize $4 per day in electricity. During a bear market with all 13 machines operating, we were able to generate around $500 a month. During the current bull market the same 13 machines have done up to $17,000 per month – so the power price is not an issue. The problem with electricity is scaling and heat. The rigs use 1000 watts so they are essentially 1000 watt space heaters. The more rigs you utilize the more you will then need to cool your residence depending on your space and goals.\n\nCrypto mining by at-home miners is challenging as large-scale operations dominate the mining industry. However, by choosing the most profitable coins and running the latest (and most efficient) mining hardware, it is still possible to generate crypto mining profits in 2023.\n\nFurther Reading\n\nBest crypto interest rates 2023 – DeFi and CeFi\n\nHow to Earn Interest & Boost Yield With Bitcoin and Crypto"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMS8zNTg2NjU5Mi9iaXRjb2luLXN1cmdlcy1hZnRlci1qYXZpZXItbWlsZWktZWxlY3RlZC1wcmVzaWRlbnQtb2YtYXJnZW50aW5hLWV0aGVyZXVtLWRvZ2Vjb2luLXNlZW4taW7SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzU4NjY1OTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Surges After Javier Milei Elected President Of Argentina — Ethereum, Dogecoin Seen In Green: Anal - Benzinga",
        "content": "The cryptocurrency market gained momentum on Sunday evening after the news broke that Argentina today elected libertarian candidate Javier Milei, who is a staunch Bitcoin supporter as its new president.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EST) Bitcoin BTC/USD +2.31% $37,377 Ethereum ETH/USD +2.78% $2,005 Dogecoin DOGE/USD +2.33% $0.080\n\nWhat Happened: Milei has secured 56% of the tally, while Sergio Massa, his opponent trails behind with 44%, according to Bloomberg. Following Massa’s concession, Bitcoin has experienced a significant increase of nearly 3% in the past 24 hours, reaching $37,350.\n\nMilei has been openly critical of the country’s central bank, going as far as labeling it a scam and a “mechanism used by politicians to deceive the public through inflationary tax.” He believes that Bitcoin represents a pivotal shift towards returning control of money to its rightful creator, the private sector.\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Render +19.08% $3.41 Kaspa +15.37% $0.13 FTX Token +14.09% $3.41\n\nThe global crypto market cap currently stands at $1.39 trillion, reflecting a decrease of 1.49% in the past 24 hours.\n\nThe U.S. equity futures show a minimal change on Sunday evening as the market anticipates the shortened Thanksgiving holiday week. After three consecutive winning performances, the major averages are continuing their positive momentum. The futures linked to the Dow Jones Industrial Average have declined by 2 points, which is less than 0.1%. Similarly, S&P 500 futures have dipped by approximately 3 points, nearly 0.1%. Moreover, Nasdaq 100 futures have dropped by 34 points, equivalent to 0.2%.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes: Cryptocurrency analyst Michael Van de Poppe points out that Bitcoin is currently forming a clear range.\n\nThe resistance level to keep an eye on is $38,000, while for long entries, it is important to monitor the support level ranging from $33,000 to $34,500.According to his analysis, Bitcoin is expected to move slightly lower, possibly dipping just below $36,000. \"Needs to hold the trend.\"\n\nPseudonymous analyst Dave the Wave said that BTC’s current all-time high could see a new surge.\n\n\"Shorter-term volatility is always the most difficult to predict. Brace yourselves for this one. Even though daily momentum is down, weekly BTC momentum is still up. Technically, a push to the highs is possible, and with price still in the LGC buy zone [for longer-term investors].\"\n\nSantiment, a leading firm in on-chain data analytics for the crypto market, on Sunday, said that crypto market caps have experienced a temporary slowdown following the significant 4-week rallies.\n\nPhoto by Fernando Cortes on Shutterstock\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNpdHlhbS5jb20vcnVtb3Vycy1vZi1ldGhlcmV1bS1mcmF1ZC1iaWdnZXItdGhhbi1mdHgtd2hlcmVzLWJyZW5kYS1mcm9tLWJyaXN0b2wtd2hlbi13ZS1uZWVkLWhlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Rumours of Ethereum fraud 'bigger than FTX'? Where's Brenda from Bristol when we need her? - CityAM - City A.M.",
        "content": "Rumours of Ethereum fraud ‘bigger than FTX’? Where’s Brenda from Bristol when we need her?\n\nI’ll start with something for the meme lovers.\n\nDoes anyone remember Brenda from Bristol, who in response to a BBC interviewer’s question, asking her what she thought about Theresa May’s decision to call an early general election in 2017 only two years after the previous one in 2015, cried “You’re joking – not another one!”.\n\nNiche. But it’s worth a watch.\n\nWell, I found myself crying “Not another one!” in a Brenda-esque fashion last week, when I read the headline that former Ethereum lawyer, Steven Nerayoff, claims that he is aware of a massive fraud at the centre of the Ethereum network, apparently “bigger than the FTX fraud”, and perpetrated by none other than the Ethereum founders themselves.\n\nAs yet, we have no idea as to the veracity of these allegations. However, Sam Bankman-Fried’s guilty verdict earlier this month, and multiple other high-profile collapses and bankruptcies allegedly caused by an underlying fraud, have fuelled the crypto naysayers’ party line that the crypto world is comprised solely of scammers, fraudsters, and money launderers. “Fraud” and “crypto” are now inextricably linked in the minds of the public and in the press. A monumental fraud at the heart of Ethereum would add credence to the notion that crypto is or should be dead. Long live fiat.\n\nHowever, my response to that, continuing Brenda from Bristol’s line of thinking, remains: “Oh for God’s sake…honestly, I can’t stand this!”.\n\nFiat is still the preferred medium for most financial crime, including fraud. Fraud perpetrated by any means remains the most common crime experienced in England & Wales, with 1.15 million fraud and computer misuse offences recorded in our fair land between 2022/23, the highest it has ever been.\n\nLegislation slipping under the corporate radar\n\nCue the government’s latest efforts to tackle the fraud epidemic: the Economic Crime and Corporate Transparency Act 2023 (ECCT), which came into force on 26 October. It introduces two major changes in the law:\n\nA new offence of ‘failure to prevent fraud’; and An expansion of the scope of individuals whose criminal conduct can be attributed to a company for economic crime under the ‘identification principle’.\n\nWhilst the crypto industry has been understandably focusing on the latest regulatory developments in the UK, including the implementation of the financial promotions regime with respect to crypto assets on October 8 2023, and the publication of the final proposals for crypto and stablecoin regulation on October 30 2023, this piece of legislation may have slipped under the corporate crypto radar.\n\nBut under the ECCT, big industry players need to have implemented “reasonable” compliance procedures to prevent fraud, as a company can be found guilty of this offence where it failed to prevent fraud intended to benefit the company, committed by an “associated person”, defined widely as an employee, agent or subsidiary; an employee of a subsidiary; or a person who “otherwise performs services for or on behalf of the organisation”.\n\nWhy do I say ‘big’ industry players? Because the ECCT only applies to companies if it, and/or its group, meet two or more of the following criteria:\n\nMore than 250 employees; More than GBP 36m turnover; or More than GBP 18m in total assets.\n\nGetting your house in order\n\nI can hear a small and medium sized cheer from the small and medium sized crypto start-ups, who perhaps may not yet have the compliance wherewithal to ensure that it has implemented such reasonable procedures to prevent fraud, although such organisations should have already ensured that their compliance programmes have adequate and reasonable policies and procedures in place to prevent and detect other offences, including other ‘failure to prevent’ offences of bribery and facilitation of tax evasion.\n\nCrucially, large overseas crypto asset service providers may think that the legislation does not apply to them, particularly if they do not have a UK subsidiary. However, the jurisdictional reach of the ECCT is such, that even if a non-UK crypto asset service provider did not have any subsidiaries in the UK, the overseas company could still be liable for failing to prevent fraud if an associated person (e.g. an employee or a person performing services on behalf of the non-UK bank) committed fraud under UK law or targeted UK victims, with the intention ultimately to benefit the overseas company. This could capture a whole host of large overseas industry players who haven’t even set a corporate foot in the UK.\n\nThe organisation can defend itself if it has “reasonable procedures” in place to prevent fraud. Guidance is still awaited from the government as to what such ‘reasonable’ procedures might look like. But compliance officers will certainly need to conduct an appropriate fraud risk assessment and implement commensurately ‘reasonable’ procedures across their UK operations or those acting on behalf of the business in the UK, in addition to those for other failure to prevent’ offences, alongside, of course, its anti-money laundering and sanctions policies and procedures. And if all of this is news to you and you haven’t got a compliance officer yet…well you probably need to put an ad in the newspaper, stat.\n\nThe effect of the ECCT’s expansion of the ‘identification principle’ is that the actions of a wider group of people (defined as ‘senior managers’) can be attributed to the organisation for certain economic crimes, including fraud, theft, false accounting and concealing criminal property. The idea of this is to make it easier for authorities to pursue corporates for those offences, as well as the individuals concerned.\n\nFor fraud practitioners, this is all exciting stuff. For corporates caught by the legislation, not so much. But the hope will be that this legislation coupled with the full implementation of the crypto UK regulatory regime will reduce my need to shout “not another one!” a la Brenda from Bristol, and will allow the industry to thrive in the UK, as it should, without fraud being perceived as the driving force behind it.\n\nCharlotte Tregunna, Partner, Peters & Peters"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNpdHlhbS5jb20vc3Ryb25nLXN1bmRheS1uaWdodC10cmFkaW5nLXNlZXMtYml0Y29pbi1hbmQtZXRoZXJldW0tYmFjay1hYm92ZS1rZXktbGV2ZWxzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Strong Sunday night trading sees Bitcoin and Ethereum back above key levels - CityAM - City A.M.",
        "content": "Strong Sunday night trading sees Bitcoin and Ethereum back above key levels\n\nBitcoin is trading above $37,000 this morning while Ethereum is back above the key level of $2,000.\n\nMany of the large-caps are also in the green today, notably Chainlink, which has added 5% to its price overnight. Solana, Avalanche and Polkadot have each gained more than 2% in the last 24 hours.\n\nIt’s been a month of the Fear and Greed Index remaining firmly in “Greed” territory, as Bitcoin’s $37,000 level has repeatedly been tested with bulls taking the bait. Experts say investors are closely following the developments in the US, where the Securities and Exchange Commission is yet to make a decision on whether to approve any of the 12 Bitcoin spot-ETF applications on its desk.\n\nFriday’s Crypto AM Daily\n\nIn the Markets\n\nThe Bitcoin Economy\n\n*Data can be found at https://terminal.bytetree.com/\n\nTotal crypto market cap\n\n🔵 $1.41 trillion\n\n🔺 1.29%\n\nWhat Bitcoin did yesterday\n\n🔺 Daily high $37,504\n\n🔻 Daily low $36,393\n\nBitcoin market capitalisation\n\n🟠 BTC $728.119 billion\n\n🟡 Gold $13.074 trillion\n\n💳 Visa $512.43 billion\n\nBitcoin volume\n\nTotal spot trading volume $14.252 billion\n\n🔺 1.70%\n\nEthereum staking entry queue\n\n0 minutes\n\nSP500\n\n🔺 0.13%\n\nFTSE/JSE Top 40\n\n🔺0.30%\n\nFear and Greed Index\n\nBitcoin’s market dominance\n\n52.47\n\nRelative Strength Index (RSI)\n\n59\n\nValues of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price, while 30 or below indicates an oversold or undervalued condition.\n\n📣 What they said yesterday\n\nJUST IN: Sam Altman not returning to OpenAI and will be replaced by ex-Twitch CEO. pic.twitter.com/RdISxZjrvx — Watcher.Guru (@WatcherGuru) November 20, 2023\n\nCrypto AM: Editor’s picks\n\nKraken appoints crypto entrepreneur and fintech consultant Bivu Das to drive next chapter of UK growth story\n\nTransformBase initiative set for launch in November\n\nFCA’s new crypto advertising rules met with mixed industry response\n\nChatGPT urges crypto conference panel not to become over-reliant on AI\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nMPs are falling silent over potential of cryptocurrency\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL2Jsb2NrY2hhaW5yZXBvcnRlci5uZXQvZXRoZXJldW0tY3Jvc3Nlcy0yMDAwLWFzLXdoYWxlcy10cmlnZ2VyLXF1aWV0LWFjY3VtdWxhdGlvbi1hZnRlci10d28tbW9udGhzLWV0aC1wcmljZS1mYWNlcy1saXF1aWRhdGlvbi1jb25jZXJucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Crosses $2,000 as Whales Trigger Quiet Accumulation After Two Months: ETH Price Faces Liquidation ... - Blockchain Reporter",
        "content": "In recent hours, the market experienced a modest recovery, with Bitcoin’s price managing to climb above the $37,000 mark. In the wake of this development, Ethereum (ETH) also saw a significant increase, surpassing the $2,000 threshold, and is currently gearing up for a potential push beyond the $2,100 level. Nonetheless, as resistance levels are holding firm, there is a growing concern among large holders, or whales, who have been quietly accumulating assets for the first time in two months, hinting at a possible exit strategy.\n\nEthereum Triggers $12 Million In Short Liquidation\n\nOver the last 24 hours, ETH price made a surprising rebound and surged above $2,000. This has triggered massive liquidations on the chart, as revealed by Coinglass data. Nearly $12 million worth of short positions were liquidated after the price went against sellers’ bearish bets below $1,900, strengthening immediate support levels.\n\nInterestingly, on-chain data, as pointed out by a prominent analyst, supports a bullish view of Ethereum price. Lately, Ethereum’s price has been displaying a series of fluctuations, primarily heading in a downward direction. Although this might appear worrisome to the average observer, smart investors, particularly the significant players commonly referred to as ‘whales,’ perceive this as a valuable opportunity.\n\nA noteworthy pattern accompanying these price declines is the abrupt increase in non-exchange Ethereum balances and ETH accumulation. This trend signifies that instead of reacting with panic and hastily liquidating their holdings on exchanges, these prominent stakeholders are opting to accumulate more of the altcoin.\n\nFor the first time in two months, Ethereum addresses holding a balance exceeding 10,000 tokens or $20 million have been quietly increasing. This surge is strengthening Ethereum’s current trajectory as buyers grow more confident in maintaining momentum above the $2,000 mark.\n\nIntense Battle Between ETH Buyers And Sellers\n\nThe Ethereum long/short ratio is presently in the midst of a fierce struggle between bullish and bearish sentiments. There’s a rising possibility of ETH price facing liquidation if the bulls lose faith in breaching the $2,100 threshold. Recent data indicates that the long/short ratio stands at 0.9736, with buyers holding 49.3% of positions and sellers commanding 50.7% of positions.\n\nFurthermore, there seems to be declining interest among long-term whales as Ethereum’s price struggles to break past the $2,100 mark. Information from IntoTheBlock shows a decline in whale transactions, plummeting from a peak of $6.6 billion to approximately $2.2 billion.\n\nThe likelihood of a sudden drop in Ethereum’s price might not be substantial at this juncture, as BlackRock’s proposal for a spot ETH ETF seems to be having a positive influence, potentially keeping the altcoin’s price within an attractive buying range.\n\nHowever, the NVT (Network Value to Transactions) ratio has been on a somewhat ascending trajectory, currently standing at 78.83. This indicates that as the price of ETH surges, there is a concurrent rise in network value. However, in relation to this, Ethereum’s transaction activity has remained relatively subdued this week, suggesting that the ETH price may be approaching overvaluation and could be poised for a correction around the $2.1K peak.\n\nShould the bulls manage to uphold the price above the critical threshold of $2,000, Ethereum (ETH) will regain its momentum and position itself for an imminent breakout from its symmetrical triangle pattern. Upon a successful breakout, the coin is poised to make a move to challenge its resistance level at $2,190 in the coming hours.\n\nHowever, on the bearish side, if sellers dominate and Ethereum can’t surpass a key resistance level, its momentum might weaken, risking a drop to the $1,900 support if it breaks out of its current pattern."
    }
]