[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1jb3JyZWN0aW9uLTE2MDAv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLWNvcnJlY3Rpb24tMTYwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Price Saw Key Technical Correction, But 100 SMA Is Still Strong - NewsBTC",
        "content": "Ethereum price is attempting a recovery wave above the $1,620 level against the US Dollar. ETH could start a fresh decline if it stays below the 100 hourly SMA.\n\nEthereum is struggling to recover above the $1,690 and $1,700 levels.\n\nThe price is trading below $1,700 and the 100-hourly Simple Moving Average.\n\nThere was a break above a connecting bearish trend line with resistance near $1,670 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could resume its decline if it stays below the $1,700 level in the near term.\n\nEthereum Price Faces Hurdles\n\nEthereum’s price declined heavily below the $1,700 level. ETH tested the $1,520 zone and recently started a decent recovery wave, similar to Bitcoin.\n\nThere was a move above the $1,550 and $1,600 levels. The price climbed above the 50% Fib retracement level of the downward move from the $1,825 swing high to the $1,518 low. Besides, there was a break above a connecting bearish trend line with resistance near $1,670 on the hourly chart of ETH/USD.\n\nHowever, the bears are still active below the $1,680 level. Ether is also trading below $1,700 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $1,690 level. The next resistance is near $1,700 or the 100-hourly Simple Moving Average.\n\nSource: ETHUSD on TradingView.com\n\nThe 61.8% Fib retracement level of the downward move from the $1,825 swing high to the $1,518 low is also near the $1,700 zone. A close above the $1,700 level could start a decent increase in the near term. The next major resistance is near the $1,750 level. Any more gains might send the price toward the $1,820 resistance, above which the price could rise toward the $1,880 zone.\n\nFresh Decline in ETH?\n\nIf Ethereum fails to clear the $1,700 resistance, it could continue to move down. Initial support on the downside is near the $1,640 level.\n\nThe first major support is near the $1,600 zone. If the bulls fail to protect the $1,600 support, there could be more losses. The next major support is near the $1,550 support level. Any more losses might send the price toward the $1,520 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now near the 50 level.\n\nMajor Support Level – $1,600\n\nMajor Resistance Level – $1,700\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tMW0tdHJhbnNmZXItdG8tY29pbmJhc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Founder Transfers $1M to Coinbase: Major Sell Off Coming? - CCN.com",
        "content": "Key Takeaways\n\nEthereum co-founder Vitalik Buterin moved 600 ETH to Coinbase\n\nHis action follows a general market downturn as Ether’s value dropped by 10%\n\nETH price usually drops after a transfer by Buterin or the Ethereum Foundation\n\nThere is a chance that Buterin will attempt a significant sell off\n\nOn-chain data and blockchain security platform PeckShield showed that a wallet related to an Ethereum (ETH) co-founder Vitalik Buterin transmitted 600 ETH, worth $1 million, to Coinbase earlier today, August 21.\n\nThe reason for the transaction is still unknown, but transfers to exchange are typically understood to indicate a desire to sell.\n\nButerin’s transaction may increase selling pressure on Ethereum, whose price has recently declined.\n\nOn-chain detective Lookonchain revealed that on August 20, Vitalik.eth wallet withdrew 1,000 ETH – about $1.67 million – and refunded 251,000 RAI on the DeFi platform Maker.\n\nDubbed “vitalik.eth” wallet, which contains 3,993 ETH valued at $6.5 million as of publication time, was made seven years ago. According to the Arkham Intelligence dashboard , this wallet belonged to the co-founder of Ethereum.\n\nThere are also $84,000 worth of USD Coin (USDC) and $58,000 worth of Wrapped Ethereum (WETH) in the wallet.\n\nButerin has previously transferred assets to a cryptocurrency exchange as he sent 200 ETH to Kraken in March. Buterin also sold a number of unwanted altcoins (sh*tcoins) for 439.25 ETH.\n\nButerin’s Transaction Coincides with Crypto Market’s Recent Decline\n\nButerin’s move followed last week’s (August 17) flash fall in the cryptocurrency market, when the price of ETH dropped below $1700 for the first time since June and it’s still trading below that threshold.\n\nData from the blockchain analysis company Glassnode show that Ethereum owners fiercely hold their positions even as they quickly transfer assets among cryptocurrency exchanges.\n\nThe data aggregator reports that 14.88 million ETH are currently held on exchanges, a figure not seen since 2018.\n\nExchange outflows are typically interpreted as a positive sign that the asset is being retained for the long term.\n\n“Ethereum’s Transitions Vital For Success” – Buterin\n\nIn June, Buterin explained that the Ethereum blockchain “fails” outright in the absence of an adequate scaling infrastructure to lower transaction costs.\n\n“Ethereum fails because each transaction costs $3.75 ($82.48 if we have another bull run) and every product aiming for the mass market inevitably forgets about the chain and adopts centralized workarounds for everything,” he claimed .\n\nButerin then said that smart contract wallets represent another area of failure.\n\nHe explained that switching to smart contract wallets had certain drawbacks because managing several addresses at once presents challenges from the user experience perspective.\n\nTo effectively shift into an on-chain world with zero-knowledge rollups, Buterin said that wallets would need to secure data in addition to cryptographic assets.\n\n“In a ZK world, this is no longer true: the wallet is not just protecting authentication credentials, it’s also holding your data,” he added .\n\nFor the third and final shift, privacy, new identification, reputation, and social recovery mechanisms will be required.\n\nWithout the third shift, he claimed , “Ethereum fails because making all transactions (and POAPs, etc.) publicly visible for anyone to see is far too high a privacy sacrifice for many users and everyone moves onto centralized solutions that at least somewhat hide your data.”\n\nEthereum’s co-founder proposed using stealth addresses to alleviate this problem.\n\nA Turning Point for ETH\n\nEthereum is at a turning moment because the chart structure is so fragile. ETH price is expected to drop sharply if it brokes through the $1,600–$1,550 level.\n\nThe monthly average of Ethereum ($ETH) addresses that are currently active is lower than the annual average, indicating little on-chain activity.\n\nAccording to CoinMarketCap , at the time of writing, ETH was trading at $1,667.56, that represents a 0.36% fall over the last 24 hours."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1sYXllci0yLXRocm91Z2hwdXQtaGl0cy0wMzI2MzY0NzguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Layer 2 Throughput Hits Record High - Yahoo Finance",
        "content": "Activity across Layer 2 networks is booming, with combined L2 throughput outpacing the Ethereum mainnet by 400%.\n\nThe weekly average scaling throughput of Ethereum’s Layer 2 ecosystem surpassed 50 transactions per second (TPS) for the first time on Aug 15, hitting an all-time high of 50.83 TPS two days later, according to L2beat.\n\nEthereum Layer 2 Throughput Hits Record High\n\nThe milestone comes as zkSync Era has overtaken the Ethereum mainnet, with daily activity sitting at 12.2 TPS compared to 10.9 TPSfor Ethereum. Era processed a record high 13.44 TPS on Aug. 19.\n\nEmerging Layer 2 Networks\n\nA new breed of L2s is challenging the dominance of incumbents Arbitrum and Optimism.\n\nBase, the freshly launched L2 from the top U.S. exchange, Coinbase, is the second-most active layer 2 with 9.93 TPS after growing 50% over the past week. Activity on Base has been buoyed by the surging popularity of friend.tech, an app allowing users to trade tokens associated with public Twitter profiles.\n\nArbitrum ranks third with 6.2 TPS, followed by Starknet with 4.8 TPS, and Optimism with 4.2 TPS.\n\nHowever, Arbitrum and Optimism still command more than 80% of the nearly $10B in total value locked in Layer 2s, with $5.6B and $2.6B, respectively. zkSync comes in third with $408M, followed by dYdX with $339M, and Base with $237M.\n\nArbitrum Grants Program\n\nFacing new competition, the Arbitrum Foundation responded by launching its first grants program last month. The foundation said the new initiative is not intended to replace the grants programs operated by the Arbitrum DAO.\n\nThe first round of Foundation Grants will distribute funding to “decentralized applications and infrastructure” for both its flagship Arbitrum One and gaming-focused Arbitrum Nova networks. The categories include DeFi, gaming, NFT, social dApps, or user interface tooling and backend application infrastructure.\n\nThe foundation will progressively distribute funding based on key performance indicators and other milestones arranged with each applicant individually.\n\n“All grants issued through this program will serve to improve adoption, create stronger technical structures, and build amazing sustainable communities,” said the Arbitrum Foundation.\n\nRead the original post on The Defiant"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby93aHktZGlkLWV0aGVyZXVtLWNvLWZvdW5kZXItdml0YWxpay1idXRlcmluLXNlbmQtZG9sbGFyMW0td29ydGgtb2YtZXRoZXItdG8tY29pbmJhc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Why Did Ethereum Co-Founder Vitalik Buterin Send $1M Worth of Ether to Coinbase? - CoinDesk",
        "content": "Vital has moved some Ethereum about a $1 million worth Ethereum to coin base. What does this mean? Well, might indicate that he's willing to sell a little bit. He moved about 600 to coin base over the weekend. Vitals, public addresses for his Ethereum holdings are out there. Most people know where they are. They're visible on most uh either scans or like Blockchain explorers out there. And for good reason, right? He's probably the most central figure head in all crypto because he's uh the front man or the image of Ethereum ecosystem, which is the largest smart contract ecosystem and the second largest coin by market cap behind Bitcoin. So when people see vital or anyone else moving money uh with that big of a name out there, they start paying attention. Of course, we don't know if he sold this Ethereum and we also don't know the reasons behind it. Maybe he just wanted to get some more cushion for uh his US D bank account. Who knows Zach? I'll throw this one up to you. I don't look at this story and be like, oh, this is like a, a big ominous bad dark cloud story. I just think our boy is, you know, he's traveling all over around the world, he needs some money. Hey, man, I'm with you. I think big picture like this is the funny thing about crypto, right? You get to watch this stuff happen, you just get to see it. You're like, oh we know that this is a wallet associative of tal and you know, he chose to keep that in the public domain essentially. And now we can sort of see the the flows of money across uh the world into these exchange addresses, right? So it is just kind of a funny feature of crypto and I never, it never, it never gets dull to me that we can have these conversations based on, on chain activity and unchain activity alone, right? We don't know his intent. We don't know why we don't know what's, what's happening. We just know that we can watch this thing move from point A to point B and deduce, maybe that there's something uh animating that, right? And I think that's a really funny feature of crypto that we can talk about these things. Um without any other knowledge, aside from the fact that we just know one wallet interacted with another, and therefore we know this one happens to be vital and we can speculate on whatever the million dollars is gonna be for if it's for, you know, I don't know, getting more travel luggage. So he can go to different places around the world or not. But, yeah, I don't know. There's not much to say here. I don't know, is gonna, like, change people's price project like projections for Ethereum. Right? Or if it change, I don't think this indicates that like, vital is any less bullish on his creation. But it is just kind of a funny thing. Um, least blotter section of like Ethereum Daily News that you can, uh, I don't know, read with your morning coffee. Well, I say really quick before I hand it over to Wendy. Uh, the funny part about this is the Ethereum Foundation, which of course is a steward of a lot that happens in Ethereum does sell the top almost every single cycle. They have like successfully sold the top on Eth and they put that money back into the Treasury to support grants for Ethereum ecosystem. So it ends up, I think being a net positive. But a lot of people look at when the Ethereum Foundation sells and then sort of make a note about that. And this one, people, obviously not at the top. We're down about, you know, 50 plus percent from the top in 2021 2022. But people might be looking at this and be like, oh, maybe we're looking at like another lower point in the future. If Italic is selling Wendy, it's a one, it's one, literally $1 million. It's really not a lot of money, especially when you're looking at Crypto Whale Wall. It's like there's so many people that are moving around a lot more capital that are loaning it out doing things. I also want to reference a story from coin desk back in March or excuse me, May 17th of 2021 vital 6 billion in ship token says he doesn't want the power so vital has kind of been infamous of doing different things with his funds and wallets that have been tracked. So I don't think it's necessarily a big deal that he moved 1 million of worth to coin base. I think if it was going to be a very, very large amount, it probably would be done. OTC. Um but maybe he just wanted the, hey, maybe he wanted to bridge the funds over to base or to um friend who knows, who knows? Yeah, Wendy, this isn't the first time Vital has sold either. So I don't think this is gonna like do anything to the markets, but I wanted to ask all of you a question based on what said, what do we think if, if vital does cash out a million dollars here, what do we think he's gonna buy? What luxury luggage does vital buy. I love his luggage post. That's one of the better blogs out there is how vital lives out of a 40 liter backpack and here's how he does it. That one is a good piece of content. A lot of 40 liter backpacks. If we're talking a million dollars, I don't think it's that hungry. Maybe he's hungry. He gotta buy snacks. A lot of backpack. All right. Don't know. Don't know."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZGFpbHljb2luLmNvbS9ldm0tY2hhaW5zLXdoYXQtaXMtZXRoZXJldW0tdmlydHVhbC1tYWNoaW5lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "EVM Chains: What Is the Ethereum Virtual Machine? - DailyCoin",
        "content": "EVM Chains are the bread and butter of the crypto space. In select cryptocurrency camps, the Ethereum Virtual Machine (EVM) is considered a non-negotiable feature that emerging blockchains need to support to stay relevant and attract users.\n\nIf you sort the industry’s blockchains by TVL (Total Value Locked), 9 of the top 10 networks are EVM-compatible, with Solana (SOL) being the only exception to the rule.\n\nWhat exactly is the Ethereum Virtual Machine, and why is it so important?\n\nWhat Is the EVM (Ethereum Virtual Machine)?\n\nThe Ethereum Virtual Machine is a software environment that executes code and contracts on EVM networks. An easier way to think of it is to imagine a computer’s operating system. Regardless of whether you use an HP or Lenovo laptop, it’s easy to jump between the two because you’re ultimately communicating with the device through a Windows operating system.\n\nLet’s apply this concept to the world of blockchain technology. The Ethereum Virtual Machine means that whether you’re using Ethereum (ETH) or Polygon (MATIC), things look and feel more or less the same. For example, you don’t need to memorize the Arbitrum (ARB) whitepaper to use crypto wallets like MetaMask or a dex like Uniswap on the Arbitrum network.\n\nIf you’re confident using one EVM Chain, you’re confident using all of them.\n\nHow Does the Ethereum Virtual Machine Work?\n\nWhen you look closely at the EVM, you’ll find a complex system that runs tasks consistently. The Ethereum Virtual Machine is deterministic, meaning if you give it a specific task, it will always give the same result, no matter where it’s done or who does it.\n\nThis deterministic nature is crucial for the consensus mechanism of the EVM-based networks, ensuring all nodes harmoniously agree on the state of the blockchain.\n\nThe EVM operates on a unique set of instructions, allowing for the creation, deployment, and execution of smart contracts. These contracts, written primarily in a programming language called Solidity, are then compiled into bytecode. This bytecode is what the EVM reads, interprets, and executes.\n\nWhen you initiate a smart contract transaction, the EVM springs into action. It processes the transaction, calculates the necessary gas fees, and updates the blockchain’s state.\n\nAnother intriguing facet of the EVM is its Turing completeness, meaning it can perform any calculation that any other programmable computer can, provided it’s given enough time and memory.\n\nHow does this benefit the Ethereum blockchain? Well, it means that the EVM can execute any algorithm or program, granting Ethereum its iconic flexibility. This versatility helps developers create innovative smart contracts and Web 3 dApps (decentralized applications) on the Ethereum mainnet and other EVM chains.\n\nWhy Is EVM Compatibility so Important?\n\nIn an industry fraught with interoperability issues and complex bridging processes, EVM chains help to smooth the onboarding process and give users a sense of trust and familiarity with new networks.\n\nEVM compatibility means that a blockchain can run the EVM and execute Ethereum smart contracts. This makes it easy for blockchain developers to port over existing contracts and ERC-20 tokens to a cross-chain environment and deploy crucial dApps, like decentralized exchanges or NFT marketplaces.\n\nWith the rise of multiple blockchains, each with its unique strengths like faster transactions and lower transaction fees, the ability to communicate and interact between them is of paramount importance. EVM-compatible blockchains integrate more easily than non-EVM chains, enabling assets and data to flow between different chains.\n\nOn top of that, operating an EVM helps emerging chains leverage Ethereum’s existing tools and infrastructure. Being a pioneer in the smart contract space, Ethereum has a rich ecosystem of DApps. EVM compatibility allows other blockchains to tap into this established ecosystem, benefiting from tried-and-tested tools and services without reinventing the wheel.\n\nLooking at competing Layer-1 blockchains that don’t naturally support EVM compatibility, like Cardano (ADA), we see first-hand how difficult it is to onboard new users, especially in DeFi.\n\nDespite Cardano having powerful tech in its own right, the network struggles to attract a user base as large as EVM chains like the BSC, Polygon, and Arbitrum. Cardano developers need to be proficient in the network’s dedicated programming language, Haskell, while all EVM chains use the same languages, like Solidity and Vyper.\n\nWhat’s the Difference Between EVM-Equivalence and EVM-Compatibility?\n\nJust when you thought you’d understood everything, there’s another layer of definitions. In today’s rapidly evolving industry, some blockchain ecosystems insist that simply being EVM-compatible is no longer enough. Teams like Polygon aim for EVM equivalence within the Polygon Proof-of-Stake sidechain and zkEVM.\n\nIs there any difference between compatibility and equivalence?\n\nEVM-Compatibility\n\nEVM-Compatibility represents a blockchain’s ability to run the EVM and execute Ethereum-based smart contracts. An EVM-compatible blockchain can seamlessly integrate with Ethereum’s tools, protocols, and standards.\n\nDevelopers can deploy the same smart contracts across multiple EVM-compatible blockchains without major code modifications.\n\nEVM-Equivalence\n\nOn the other hand, EVM-Equivalence is a more profound alignment with the Ethereum ecosystem. An EVM-equivalent blockchain not only supports Ethereum’s smart contracts but also mirrors Ethereum’s state, account structures, and consensus mechanisms.\n\nIt’s like a twin of the Ethereum network, sharing its DNA but existing as a separate entity. EVM-equivalent blockchains can synchronize with Ethereum’s state and offer a near-identical environment for dApps and contracts.\n\nWhile EVM-Compatibility offers a bridge to the Ethereum ecosystem, allowing for smooth functionality and integration, EVM-Equivalence is like walking in Ethereum’s shoes, mirroring its every step.\n\nExamples Of EVM-Compatible Blockchains\n\nNow that we better understand what EVM Chains are let’s dive into a quick list of the top EVM-compatible blockchains in the crypto industry.\n\nBinance Smart Chain (BSC) – With more daily users than any other network, BNB Chain is easily the most popular EVM chain. It introduced thousands of people to DeFi for the first time and was the first major low-cost alternative to Ethereum.\n\n– With more daily users than any other network, BNB Chain is easily the most popular EVM chain. It introduced thousands of people to DeFi for the first time and was the first major low-cost alternative to Ethereum. Polygon – Polygon is a multi-chain scaling solution for Ethereum-compatible blockchains building various EVM-equivalent networks.\n\n– Polygon is a multi-chain scaling solution for Ethereum-compatible blockchains building various EVM-equivalent networks. Avalanche (AVAX) – Another popular Layer-1 network, Avalanche is a decentralized platform tailored for custom blockchain networks and subnets.\n\nArbitrum – Undoubtedly Ethereum’s most popular Layer-2 scaling solution Arbitrum boasts higher transaction throughput and lower gas fees than the Ethereum mainnet.\n\n– Undoubtedly Ethereum’s most popular Layer-2 scaling solution Arbitrum boasts higher transaction throughput and lower gas fees than the Ethereum mainnet. Optimism (OP) – The pioneers behind ‘rollup’ technology, Optimism was one of the first Ethereum Layer-2s. On top of being EVM-compatible, Optimism has one of the most committed approaches to decentralization among EVM chains.\n\n– The pioneers behind ‘rollup’ technology, Optimism was one of the first Ethereum Layer-2s. On top of being EVM-compatible, Optimism has one of the most committed approaches to decentralization among EVM chains. Fantom (FTM) – Unlike its rivals in this list, Fantom isn’t technically a blockchain. The Fantom network is a directed acyclic graph (DAG) designed for scalability.\n\n– Unlike its rivals in this list, Fantom isn’t technically a blockchain. The Fantom network is a directed acyclic graph (DAG) designed for scalability. Celo (CELO) – Originally designed as a simple payment network, Celo has blossomed into a fully-fledged and functional EVM chain with plenty of dApps and tools for the budding DeFi enthusiast.\n\nEVM Chain Pros and Cons\n\nAfter the invention of Bitcoin (BTC) itself, the Ethereum Virtual Machine (EVM) is arguably the biggest revolution in the blockchain landscape, serving as the backbone for a myriad of decentralized applications and platforms. Of course, it’s not without its faults.\n\nPros\n\nInteroperability – EVM-compatible chains can seamlessly interact with Ethereum-based code, allowing for smooth data and asset transfers between blockchains.\n\n– EVM-compatible chains can seamlessly interact with Ethereum-based code, allowing for smooth data and asset transfers between blockchains. Rich Developer Ecosystem – If you can build dApps on Ethereum, you can build dApps on any EVM chain. This means native Ethereum developers can spread their knowledge throughout the wider blockchain industry.\n\n– If you can build dApps on Ethereum, you can build dApps on any EVM chain. This means native Ethereum developers can spread their knowledge throughout the wider blockchain industry. Standardization – EVM chains provide a standardized environment, ensuring smart contracts behave consistently across different networks.\n\n– EVM chains provide a standardized environment, ensuring smart contracts behave consistently across different networks. Security – The EVM’s isolated environment ensures that smart contracts are executed securely, protecting the network from potential vulnerabilities and external threats.\n\n– The EVM’s isolated environment ensures that smart contracts are executed securely, protecting the network from potential vulnerabilities and external threats. Flexibility – The Ethereum Virtual Machine’s Turing completeness allows developers to craft intricate and versatile smart contracts, catering to various use cases and industries.\n\nCons\n\nScalability Issues – Even on separate networks like Avalanche and BNB Chain, EVM chains are vulnerable to gas spikes and network congestion. Competing networks like Solana and XRP charge consistent transaction costs regardless of network strain.\n\n– Even on separate networks like Avalanche and BNB Chain, EVM chains are vulnerable to gas spikes and network congestion. Competing networks like Solana and XRP charge consistent transaction costs regardless of network strain. Complexity – While the EVM offers immense flexibility, it also introduces complexity. Developers need to be well-versed in specific programming languages like Solidity and aware of decentralized development’s nuances.\n\n– While the EVM offers immense flexibility, it also introduces complexity. Developers need to be well-versed in specific programming languages like Solidity and aware of decentralized development’s nuances. Resource Intensity – Running and maintaining EVM nodes is resource-intensive and requires significant computational power and storage.\n\n– Running and maintaining EVM nodes is resource-intensive and requires significant computational power and storage. Learning Curve – For newcomers, the Ethereum Virtual Machine can present a steep learning curve, marking it difficult to come to terms with.\n\nOn the Flipside\n\nWhile networks like Solana and Cardano don’t natively support EVM-based programs, independent teams have created EVM networks like NEON and Milkomeda that settle transactions on their respective Layer-1.\n\nWhy This Matters\n\nIn the current climate of the crypto industry, running an Ethereum Virtual Machine is essential if teams want to bring users to their blockchain. Without being EVM-compatible, the barriers to entry are too inconvenient.\n\nAs we can see, Cardano is a Top 10 cryptocurrency by market cap, but it has far fewer DeFi applications and TVL statistics than relatively unknown EVM-chains like Kava and Pulsechain.\n\nFAQs"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8venljcnlwdG8uY29tL2NoYXJsZXMtaG9za2luc29uLXVwcy10aGUtYW50ZS1hcy1ldGhlcmV1bS1pcy1sYWJlbGxlZC1hLWNhcmRhbm8tYWRhLWNvcHljYXQv0gFmaHR0cHM6Ly96eWNyeXB0by5jb20vY2hhcmxlcy1ob3NraW5zb24tdXBzLXRoZS1hbnRlLWFzLWV0aGVyZXVtLWlzLWxhYmVsbGVkLWEtY2FyZGFuby1hZGEtY29weWNhdC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "Charles Hoskinson Ups the Ante as Ethereum Is Labelled A Cardano (ADA) Copycat - ZyCrypto",
        "content": "Advertisement\n\nCharles Hoskinson, the founder of Cardano and a co-founder of Ethereum, has a history of teasing Ethereum and its co-founder Vitalik Buterin, but now he has stepped things up a notch, it seems. A discussion broke out about which ecosystem is better after a question was posted on ‘X’ if Cardano would ever be an Ethereum competitor.\n\nOne user said that it was telling that Ethereum had to transition to a 2.0 version of what Cardano already is today. Another argued that Cardano followed Ethereum’s roadmap but was behind by years.\n\nAnd then came along an ‘X’ user who said he predicted Hoskinson would stop talking about Hydra and look towards things that Ethereum developers are doing, essentially copying from them. He added that Hoskinson would soon say that “Our plan was always that if it works on Ethereum, we can just copy it, and actually, rollups and data availability have always been the future of Cardano too”.\n\nHoskinson on Fire\n\nCharles Hoskinson swallowed the bait and said he felt sorry for people obsessed with their blockchain, saying, “We are living rent-free in the maxi minds. I pity them”.\n\nHe reminded the original poster that Hydra, one of the recent improvements to the popular blockchain, is live and evolving rapidly. Additionally, Hoskinson stated that Mithril is now operational, marking the initial move toward an enhanced ADA and light client approach. He explained that innovative transaction methods have been developed, including tiered pricing and Babel fees. Adding that, the concept of a roll-up strategy has been in place since the inception of Midnight four years ago.\n\nAdvertisement\n\nHe did not only defend Cardano but started to throw punches at Ethereum too, saying: “Meanwhile Ethereum has a dumpster fire of a consensus layer, has a terrible programming model that they can’t change, and are getting eaten alive by their own layer 2 ecosystem.”\n\nNo matter whose side you take, it is clear that Cardano is unfinished, and there is no dispute about that. Cardano’s development runs in stages and is now in the second last stage. While the current stage focuses on scaling and resource use, the final stage will see a fully decentralized community-governed ecosystem. Hoskinson thinks by then, Cardano will serve as a blueprint for other blockchains and be “substantially more decentralized than all cryptocurrencies on the market”."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1tb3Zlcy02MDAtZXRoLXRvLWNvaW5iYXNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin moves $1M of ETH to Coinbase - Cointelegraph",
        "content": "Blockchain sleuths have flagged the transfer of $1 million of Ether (ETH) belonging to a wallet controlled by Ethereum co-founder Vitalik Buterin as cryptocurrency markets remain depressed after widespread weekend losses.\n\nThe publicly labeled Ethereum wallet address vitalik.eth transferred 600 ETH on Aug. 21, with the address still holding over 3,900 ETH valued at $6.5 million as per data from Etherscan.\n\nBlockchain data analysis from Lookonchain also revealed that vitalik.eth repaid 251,000 Rai Reflex Index (RAI) tokens on Maker and withdrew 1,000 ETH, worth $1,67 million, hours before the movement of ETH to Coinbase.\n\nCointelegraph also had confirmation from blockchain analytics firm Nansen that Buterin had transfered the large sum after a test transaction of 0.1 ETH two days prior, while their analysts noted that the exchange Buterin used in the latest movement differed from previous instances on record:\n\n\"Based on the wallet’s history, ETH transfers in the past have typically been to Kraken. However, it’s hard to say what’s the purpose of the transfer so we aren’t able to offer much more insight.\"\n\nA number of prominent blockchain data aggregators and publications shared insights into the transfer of 600 ETH to United States-based cryptocurrency exchange Coinbase. The move caused a stir on social media in the hours after the transfer, with speculation around the transaction rife.\n\nButerin’s transaction comes as wider cryptocurrency markets remain fragile following a sharp correction over the weekend. Bitcoin (BTC) and ETH saw losses of 11% and 8%, respectively.\n\nRelated: Vitalik dumps $700K worth of shitcoins that he never asked for\n\nAs Cointelegraph has previously reported, Buterin has admitted to selling portions of his ETH holdings on separate occasions over the past five years and has also publicly dumped tokens he has received in unsolicited alt coin airdrops.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmV0ZnN0cmVhbS5jb20vYXJ0aWNsZXMvdmFsb3VyLWxhdW5jaGVzLWV0aGVyZXVtLXN0YWtpbmctZXRw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Valour launches ethereum staking ETP - ETF Stream",
        "content": "Valour has expanded its crypto exchange-traded product (ETP) suite with the launch of an ethereum sticking ETP.\n\nThe 1Valour Ethereum Physical Staking ETP (1VET) is listed on the Deutsche Boerse with a total expense ratio of 1.49%.\n\n1VET will allow investors to participate in the performance of ethereum while also benefitting from the potential yield income from staking.\n\nStaking is the process of depositing crypto assets on the blockchain to validate transactions, generating a premium that is returned to investors.\n\nValour did not state how much investors can expect to receive from staking proceeds but said it could implement a temporary or permanent” reduction in the management fee or an “adjustment to the digital asset entitlement”, the amount of ethereum an investor holds.\n\nIt is the firm’s second ethereum ETP after it launched the Valour Ethereum Zero in December 2021, which has a management fee of 0%.\n\nIt takes the number of ETPs in Valour’s crypto range to 13, having launched the Valour Bitcoin Carbon Neutral ETP (1VBT) in June.\n\nDomiciled in Jersey, GHCO will act as the market maker on the product."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8yMS9iYWQtYWN0b3JzLWRlcGxveWVkLW92ZXItNTAwLXNjYW0tY3J5cHRvLWFzc2V0cy1vbi1jb2luYmFzZXMtZXRoZXJldW0tbGF5ZXItMi1wcmlvci10by1sYXVuY2gtc3VydmVpbGxhbmNlLWZpcm0v0gGVAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzIxL2JhZC1hY3RvcnMtZGVwbG95ZWQtb3Zlci01MDAtc2NhbS1jcnlwdG8tYXNzZXRzLW9uLWNvaW5iYXNlcy1ldGhlcmV1bS1sYXllci0yLXByaW9yLXRvLWxhdW5jaC1zdXJ2ZWlsbGFuY2UtZmlybS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Bad Actors Deployed Over 500 Scam Crypto Assets on Coinbase’s Ethereum Layer-2 Prior to Launch: Surveillance Firm - The Daily Hodl",
        "content": "A crypto surveillance firm says black hat developers have placed hundreds of malicious tokens on Coinbase’s newly launched Ethereum (ETH) layer-2 chain.\n\nAccording to Solidus Labs, bad actors deployed more than 500 scam tokens on Base days after the blockchain debuted for developers on July 13th and before the network became available for the public on August 9th.\n\n“Roughly 300 of these scam tokens’ smart contracts contained hidden functions enabling their creators to mint an unlimited number of new coins; another 70 contracts contained obfuscated transaction fee modifiers; and more than 60 contained honeypots, blocking buyers from reselling their tokens altogether.”\n\nSolidus Labs says the scam tokens generated about $3.7 million worth of trading volume on Base’s decentralized exchanges (DEXs). The rogue assets drew in $2.7 million worth of buys, $700,000 worth of sales and $300,000 worth of wash sales that the fraudsters executed themselves.\n\nThe perpetrators managed to earn $2 million in profits from the scheme by removing all liquidity from their DEX pairs after a significant number of users invested and by minting and selling massive quantities of new coins.\n\nMalicious actors also placed soft rug pull crypto assets on the network ahead of the launch. In this type of social engineering attack, developers hype up the value of the crypto asset and then withdraw their funds, leaving existing investors with overwhelming sell pressure.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYXJ0aWNsZS9jcnlwdG9jdXJyZW5jeS9ldGhlcmV1bXMtcHJpY2Utc3VyZ2VzLTExLWFzLXRyYWRlcnMtYW50aWNpcGF0ZS1zZWMtYXBwcm92YWwtb2YtZXRoLWZ1dHVyZXMtZXRmLzg3NjYxLzHSAY4BaHR0cHM6Ly93d3cuZm9yYmVzaW5kaWEuY29tL2FtcC9hcnRpY2xlL2NyeXB0b2N1cnJlbmN5L2V0aGVyZXVtcy1wcmljZS1zdXJnZXMtMTEtYXMtdHJhZGVycy1hbnRpY2lwYXRlLXNlYy1hcHByb3ZhbC1vZi1ldGgtZnV0dXJlcy1ldGYvODc2NjEvMQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum's Price Surges 11% as Traders Anticipate SEC Approval of ETH Futures ETF - Forbes India",
        "content": "Image: Shutterstock\n\nIn a significant development within the crypto realm, Ethereum (ETH) has experienced a remarkable price surge of nearly 11%, according to Bloomberg’s report of August 17. The report cited multiple sources and suggested that the US Securities and Exchange Commission (SEC) will likely grant approval for applications related to Ethereum Futures Exchange-Traded Funds (ETFs).This sudden and substantial increase pushed Ethereum's price to around $1,700, marking an impressive 11% jump. The SEC's potential approval of ETH Futures ETFs will signify a notable shift in the regulatory body's stance towards digital assets, indicating a growing acceptance of cryptos within traditional financial systems.If the applications for these ETFs are approved, it would mark a milestone moment for the crypto market. This approval could signal a heightened recognition of digital assets by established financial institutions, potentially encouraging greater institutional participation and investment in the crypto sector.Recent market trends have been influenced by various factors, including Ethereum's 5% price decline as a response to the broader Bitcoin value downturn. Bitcoin's price drop triggered a cascading effect across the entire crypto market. Notably, other cryptos, such as Binance Coin and SUI, also experienced 5% and 10% declines, respectively.Despite these challenges, Ethereum's trading volume witnessed a remarkable surge of 185% within the span of just 24 hours. Hourly charts illustrated a concerted effort to reclaim Ethereum's price, with a series of green candles indicating renewed positive sentiment. This resurgence coincided with the news surrounding the SEC's potential approval of ETH Futures ETFs.As these events unfold, the crypto community remains vigilant and anticipatory. While an 11% upswing in Ethereum's value is seen as an encouraging advancement, it's crucial to maintain a cautious approach due to the inherent volatility of the crypto market. The crypto sector remains dynamic and fluid, requiring careful consideration and informed decision-making."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tY28tZm91bmRlci1idXRlcmluLW1vdmVkLTYwMC1ldGgtdG8tY29pbmJhc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum co-founder Buterin moved 600 ETH to Coinbase - crypto.news",
        "content": "In the early morning of Aug. 21, Ethereum (ETH) co-founder Vitalik Buterin sent 600 ETH, equivalent to over $1 million, to a Coinbase deposit address.\n\nWhile some may ask themselves if this indicates Buterin jumping ship, a deeper look into his wallets shows this is not true.\n\nThis transfer towards Coinbase follows a transaction processed two days earlier that increased his ETH balance by 1,000 ETH. It means that despite his transfer to Coinbase, his Ethereum holdings still increased compared to just a couple of days earlier.\n\nThe choice of exchange is unsurprising, given that data clearly shows he prefers Coinbase over other exchanges.\n\nYou might also like: Vitalik Buterin prefers Coinbase over other exchanges, analysis shows\n\nMoreover, Buterin’s publicly-known wallets currently hold a total of over 248,000 ETH — a number that increased by nearly 713 ETH compared to the beginning of August despite the value of those holdings falling.\n\nHis Ethereum holdings are also worth nearly $415 million, while the second most valuable asset on those wallets is Maker (MKR), worth only $544,000 or about $0.131 of his ETH holdings.\n\nIn conclusion, while Buterin has moved a significant amount of ETH to Coinbase with the likely intention to sell it for fiat, this amount pales compared to his total Ethereum exposure.\n\nFollow Us on Google News"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3ZpdGFsaWstYnV0ZXJpbi1zdGlycy1tYXJrZXQtdW5jZXJ0YWludHktd2l0aC0xLW1pbGxpb24tZXRoZXJldW0tdHJhbnNmZXItdG8tY29pbmJhc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Vitalik Buterin stirs market uncertainty with $1M Ethereum transfer to Coinbase - CryptoSlate",
        "content": "According to on-chain data, a wallet associated with Ethereum (ETH) co-founder Vitalik Buterin sent 600 Ether worth roughly $1 million to Coinbase earlier today.\n\nThe motive behind the transaction remains speculative as of press time. Usually, transfers to exchange are translated to mean an intention to sell. With Ethereum’s price recently struggling, Buterin’s transaction could further exert more selling pressure on the digital asset.\n\nMeanwhile, on-chain sleuth Lookonchain reported that Vitalik.eth wallet repaid 251,000 RAI on DeFi platform Maker and withdrew 1,000 ETH (around $1.67 million) on Aug. 20.\n\nThe wallet known as “vitalik.eth” was created seven years ago and contained 3,993 ETH, worth $6.5 million as of press time. CryptoSlate, using the Arkham Intelligence dashboard, confirmed that the wallet belonged to the Ethereum co-founder. Other digital assets in the wallet include $84,000 worth of USD Coin (USDC) and $58,000 worth of Wrapped Ethereum (WETH).\n\nThis is not the first time Buterin would transfer assets to a crypto exchange. Earlier in the year, the Ethereum co-founder sent 200 ETH to Kraken in March. Around the same period, Buterin dumped several unsolicited altcoins (sh*tcoins) for 439.25 ETH.\n\nETH price struggling\n\nButerin’s transaction is coming on the heels of last Thursday’s crypto market flash crash. Last week, ETH’s price fell below $1700 for the first time since June and continued to trade under the mark as of press time.\n\nAccording to CryptoSlate’s data, ETH traded at $1667 at the time of writing after a slight decline of 0.18% in the last 24 hours.\n\nHowever, data from blockchain analytical firm Glassnode shows that Ethereum holders are jealously guarding their holdings as they rapidly send their assets off crypto exchanges. According to the data aggregator, the amount of ETH held on exchanges is 14.88 million, a level not recorded since 2018.\n\nExchange outflows usually suggest a bullish sign that the asset is being held for its long-term benefit. Going by this, it means ETH holders are less concerned about its recent poor price performance.\n\nMentioned in this article"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aC1wcmljZS1oZWFkaW5nLXRvLTEwMDAtaWYtaXQtZHJvcHMtdW5kZXItdGhpcy1sZXZlbC13aWxsLWV0aGVyZXVtLWV0Zi1zYXZlL9IBZ2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aC1wcmljZS1oZWFkaW5nLXRvLTEwMDAtaWYtaXQtZHJvcHMtdW5kZXItdGhpcy1sZXZlbC13aWxsLWV0aGVyZXVtLWV0Zi1zYXZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "ETH Price Can See 45% Correction if Ethereum Falls Under This - CoinGape",
        "content": "The world’s second-largest cryptocurrency Ethereum (ETH) continues to show weakness with its price tanking by more than 10% over the last week and falling to $1,650 levels. ETH looks weak on the technical chart hinting at the possibility of another 45% correction from the current levels.\n\nPopular crypto analyst Ali Martinez writes: “Slipping beneath the $1,600 – $1,550 bracket for $ETH might set the stage for a significant 37% – 45% correction, targeting $1,000″.\n\nadvertisement\n\nThe Ethereum network fundamentals are showing signs of lagging, indicating a bearish trend. The monthly average of active Ethereum ($ETH) addresses is below the annual average, suggesting limited on-chain activity. This is a common indicator of diminished network health and utilization.\n\nWill Ethereum Futures ETF Save from the Possible Collapse?\n\nAfter Thursday’s price crash last week, the ETH price saw a partial recovery as reports emerged that the U.S. Securities and Exchange Commission would greenlight the Ethereum futures ETF. The Volatility Shares Ether futures ETF are likely to go live by October 12 as per the current schedule.\n\nBut despite the optimistic Bloomberg report, on-chain data indicates that Ethereum whales have not embraced the bullish sentiment. In fact, they have continued to offload their holdings, even following a modest price recovery observed on Friday after a significant sell-off.\n\nAs illustrated below, the group of Ethereum whales possessing 10,000 to 100,000 coins has been consistently selling on the market since mid-July. Clearly, during the period from July 14 to August 18, they reduced their ETH holdings by 1.12 million coins. Notably, this reduction in whale holdings by 4% aligns with the 18% decrease in ETH price during the same timeframe from July 14 to August 18.\n\nIt’s difficult to say whether the tides would turn in favor of Ethereum investors anytime soon. However, the arrival of Ethereum Futures ETF could certainly lead to growing institutional participation in the long term.\n\nFor now, it will be interesting to see if ETH manages to sustain above $1,600 levels."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdS50b2RheS9jYXJkYW5vLW5mdC1mbG9vci1wcmljZS1zb2Fycy1zdXJwYXNzaW5nLWV0aGVyZXVt0gFFaHR0cHM6Ly91LnRvZGF5L2NhcmRhbm8tbmZ0LWZsb29yLXByaWNlLXNvYXJzLXN1cnBhc3NpbmctZXRoZXJldW0_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Cardano NFT Floor Price Soars, Surpassing Ethereum - U.Today",
        "content": "The non-fungible token (NFT) market is witnessing a noteworthy shift, with Cardano's NFT floor price index currently standing at 22% higher than Ethereum's as per data shared by Stocktwits NFTs.\n\nAdvertisement\n\nThis comparison, based on the 7-day charts, reveals a growing interest in Cardano as a platform for NFT trading, although Ethereum has been historically dominant in this realm.\n\nHowever, despite the impressive growth in Cardano's NFT floor price, it continues to lag behind in terms of overall trading volume. According to recent data from CryptoSlam, Ethereum still dominates the market with a total trading volume of $13,279,162 and 11,197 buyers.\n\nIn contrast, Cardano ranks ninth with a trading volume of $180,637, although it has a considerable 1,555 buyers. This discrepancy points to the notion that Ethereum remains the most popular platform in terms of sheer trading volume while individual Cardano NFTs are gaining in value.\n\nSolana and Polygon come in second and third places with $1,601,313 and $1,235,318 in primary sales, respectively.\n\nThe Stocktwits NFTs' tweet further raises the question, \"Wen projects migrate to Cardano?\" hinting at the possible migration of projects from other platforms to Cardano in the future.\n\nSuch migrations could be a result of Cardano's NFT price surge and the potential benefits it offers as an NFT platform. However, it's essential to approach this shift with cautious optimism. Cardano shows promise in the NFT sector, but Ethereum's established foothold, backed by higher trading volumes and larger user bases, means it remains a significant player in the market."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8yMS92aXRhbGlrLWJ1dGVyaW4tc2VuZHMtNjAwLWV0aGVyZXVtLWV0aC13b3J0aC1vdmVyLTEwMDAwMDAtdG8tY29pbmJhc2UtYXMtY3J5cHRvLW1hcmtldHMtY29udGludWUtdG8tYmxlZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Sends 600 Ethereum (ETH) Worth Over $1,000,000 to Coinbase As Crypto Markets Continue To Bleed - The Daily Hodl",
        "content": "Ethereum (ETH) founder Vitalik Buterin has been spotted sending hundreds of ETH to a major US-based digital asset exchange.\n\nAccording to Ethereum blockchain tracker Etherscan, a wallet owned by Buterin shifted 600 ETH worth over $1 million to Coinbase, where it could potentially be sold on the open market.\n\nAccording to Etherscan, Buterin paid less than $0.50 in fees to complete the transaction.\n\nThe Ethereum founder has been turning heads this year amid a series of on-chain transactions.\n\nIn March, Buterin moved 200 ETH worth over $323,000 to a wallet of unknown origin. The ETH trove was subsequently moved to the crypto exchange Kraken where it could potentially be sold on the open market.\n\nOn March 11th, Blockchain security firm Peckshield also detected activity from Buterin’s wallet after the Ethereum founder sent 500 ETH to stablecoin-focused decentralized finance (DeFi) protocol Reflexer.\n\nPeckshield showed that Buterin used the 500 ETH as collateral to accumulate stablecoins to the tune of 378,500 USD Coin (USDC) and 50,000 Dai (DAI).\n\nEarlier this month, leading blockchain-monitoring firm Lookonchain spotted Buterin unloading troves of meme tokens. According to Lookonchain, Buterin sold $693,000 worth of Mops (MOPS), Cult DAO (CULT) and Shikoku (SHIK), which he received as gifts.\n\nThe Ethereum co-creator has a history of getting rid of the massive amounts of tokens often gifted to his address by smaller projects.\n\nAt time of writing, ETH is trading at $1,660.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcmlza3MtZHJvcHBpbmctdG8tMTAwMC1hbmFseXN0LXNheXMtc3VnZ2VzdGluZy1yZWFzb25z0gFXaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1yaXNrcy1kcm9wcGluZy10by0xMDAwLWFuYWx5c3Qtc2F5cy1zdWdnZXN0aW5nLXJlYXNvbnM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Risks Dropping to $1,000, Analyst Says, Suggesting Reasons - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCrypto trader and analyst Ali Martinez, who often shares his predictions and crypto charts on Twitter (now X app) has tweeted that he expects the second largest cryptocurrency Ethereum to face a risk of a heavy price correction.\n\nEthereum is currently experiencing a price decline, feeling the impact of the leading crypto Bitcoin, which is also trading in the red after a significant price drop.\n\nEthereum may face dropping to $1,000, Martinez believes\n\nAli Martinez has tweeted to share a screenshot of an ETH/USD chart from the Coinbase exchange with what looks like an Ascending Triangle pattern. Usually, it signifies the continuation of an upward trend. However, sometimes, it can indicate an upcoming reverse of the price movement.\n\nMartinez believes that should ETH slip under the $1,600-$1,550 level, this may create conditions for the further decline of the coin by a whopping 37%-45% correction with $1,000 as the main target.\n\n#Ethereum | Slipping beneath the $1,600 - $1,550 bracket for $ETH might set the stage for a significant 37% - 45% correction, targeting $1,000. pic.twitter.com/Xmo7Mgfux5 — Ali (@ali_charts) August 21, 2023\n\nEthereum signals bearish trend\n\nIn an earlier tweet, Martinez also spoke of negative prospects for the Ethereum price in the near future. He tweeted that since the fundamentals of the network are still pretty weak, this signals a bearish trend coming.\n\nIn particular, the average amount of monthly active Ethereum wallets has dropped earlier than the yearly average. This shows small on-chain activity on the network. The analyst added that this is a typical sign of \"weak network health and usage.\"\n\n#Ethereum network fundamentals are still lagging, signaling a bearish trend!\n\n\n\nThe monthly average of active $ETH addresses is lower than the yearly average, indicating little on-chain activity. This is a classic sign of weak network health and usage! pic.twitter.com/PPpiOY9Ofs — Ali (@ali_charts) August 20, 2023\n\nETH trading sideways\n\nEthereum has been declining stably since Aug. 9, but for a week it declined slowly and gradually. However, since Aug. 17, it lost a whole 9.72%, dropping from $1,800 to the $1,625 low.\n\nOn the same day, ETH staged a recovery of 4.33% in a single green candle. Since then it has been trading in a range, with the resistance being the $1,694 level and the support staying at $1,664.\n\nAt the time of this writing, Ethereum is changing hands at $1,671."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8yMS9pbnZlc3Rvci13aG8tY2FsbGVkLTIwMjItYm90dG9tLXNheXMtYml0Y29pbi1ldGhlcmV1bS1hbmQtc29sYW5hLW5vdC1tYWtpbmctbmV3LWxvd3MtaGVyZXMtd2h5L9IBhAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8yMS9pbnZlc3Rvci13aG8tY2FsbGVkLTIwMjItYm90dG9tLXNheXMtYml0Y29pbi1ldGhlcmV1bS1hbmQtc29sYW5hLW5vdC1tYWtpbmctbmV3LWxvd3MtaGVyZXMtd2h5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Investor Who Called 2022 Bottom Says Bitcoin, Ethereum and Solana Not Making New Lows – Here’s Why - The Daily Hodl",
        "content": "A widely followed investor who called the 2022 crypto market bottom says that Bitcoin (BTC), Ethereum (ETH) and Solana (SOL) are about as low as they will go.\n\nFormer ARK Invest executive Chris Burniske tells his 263,200 X followers that BTC, ETH and SOL are unlikely to make new lows this calendar year.\n\nHe warns of “bottom vultures,” or those who may be calling for lower prices but with no intention of going long anyway.\n\n“While 2019 is useful context, I don’t think BTC, ETH and SOL make new lows in ‘23 — 2022 was the low in my opinion.\n\nThat doesn’t mean we don’t take a punch, but if right, it means the long-term uptrend will continue into ‘24 & ‘25 — be wary of bottom vultures that’ll never buy.”\n\nBTC, ETH, SOL and the rest of the crypto markets have tumbled in the last seven days. Over the last week, BTC is down 12%, ETH 10.4%, and SOL 15.7% at time of writing, respectively.\n\nAccording to Burniske, a partner at venture capital firm Placeholder, decentralized finance (DeFi) helped pull crypto out of the last bear market. The investor says that a similar catalyst will have to pull crypto out of its current bear cycle.\n\nHe names Friend.Tech (FT), a new web3 social application built on the Coinbase-backed Ethereum layer-2 chain Base, is an example of what could spark the next bull cycle.\n\n“To pull us from the depths of the last bear, DeFi games were built to get the apes aping. It follows that social games, like FT, are the catalyst for the apes this cycle.\n\nApes always ape first — then, the rest of society comes later as follower apps clean up the experience.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Warm_Tail/Sensvector"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW1zLXZpdGFsaWstYnV0ZXJpbi1tb3Zlcy02MDAtZXRoLXRvLWNvaW5iYXNlLXdoYXRzLXRoZS1tb3RpdmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Moves 600 ETH to Coinbase, What's the Motive? - Watcher Guru",
        "content": "Vitalik Buterin is a co-founder of Ethereum, the second-largest cryptocurrency by market capitalization. During the recent market downtrend, numerous individuals transferred funds within the cryptocurrency ecosystem. Notably, Buterin moved a substantial amount of Ethereum [ETH] recently.\n\nOn-chain data revealed that Buterin orchestrated a transfer of 600 ETH, which held a value of approximately $1 million. The ETH was moved in a single transaction to the cryptocurrency exchange Coinbase.\n\nButerin’s move comes amidst a recent market slump\n\nThe nature of Buterin’s recent transaction is not yet known. Some speculation indicates he could be selling, leading certain people to point out this as the start of a dumping season.\n\nAlso read: Logan Paul’s CryptoZoo Investors Still Waiting on Refunds 8 Months Later\n\nSome analysts also point out that if Ethereum slips below the $1,600 to $1,550 support zone, it could open the door for a major correction of 37–45%, potentially targeting the $1,000 level. Breaking below key support might set the stage for significant downward momentum.\n\nThe movement also comes at a time when the price of ETH is not in its best shape. ETH is down from a 30-day high of $1,904 to a low of $1,551 and is currently trading at $1,673 at press time."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi10cmFuc2ZlcnMtNjAwLWV0aC10by1jb2luYmFzZS10aW1lLXRvLXNlbGzSAV9odHRwczovL3UudG9kYXkvZXRoZXJldW0tZm91bmRlci12aXRhbGlrLWJ1dGVyaW4tdHJhbnNmZXJzLTYwMC1ldGgtdG8tY29pbmJhc2UtdGltZS10by1zZWxsP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Transfers 600 ETH to Coinbase: Time to Sell? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a significant move today, Ethereum's visionary founder, Vitalik Buterin, transferred 600 ETH, equivalent to a staggering $1 million, to a deposit on the prominent crypto exchange, Coinbase. The action, revealed by crypto analytics platform PeckShiedAlert, has triggered a flurry of speculation across the crypto community.\n\nAdvertisement\n\nAdding depth to the narrative, esteemed on-chain tracker Lookonchain offers insights into Buterin's recent activities. According to their comprehensive analysis, Buterin embarked on a strategic financial maneuver. He began by settling his 251,000 RAI loan on the Maker protocol, followed by withdrawing 1,000 ETH. Notably, today's 600 ETH transfer to Coinbase constitutes a part of this larger series of transactions.\n\nSell signal or strategic play?\n\nDespite his track record as a pioneering figure in the blockchain realm, this event has cast a shadow of uncertainty. Crypto enthusiasts have widely interpreted Buterin's actions as a possible harbinger of an impending downturn.\n\nETH to USD by CoinMarketCap\n\nHistorically, insider selling or significant figures divesting from projects has been associated with an anticipation of market contractions. The Ethereum market, which has witnessed a downward trajectory since the start of today's trading session, has found itself under additional strain due to Buterin's recent move.\n\nAmid the speculation and market ripples, it is worth noting that Buterin's primary wallet, cryptically named \"vitalik.eth,\" maintains a holding of 3,935 Ethereum tokens, a stash valued at an impressive $6.57 million. This intriguing development leaves enthusiasts grappling with a pivotal question: does the transfer signal a step in the face of potential market shifts, or is it merely a strategic financial maneuver within Buterin's broader vision?"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xNTMxODQvZXRoLWxpbmtlZC1ldGhlcmV1bS1pY28tcGFydGljaXBhbnQtdml0YWxpay1idXRlcmluLWFyZS1tb3Zl0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzE1MzE4NC9ldGgtbGlua2VkLWV0aGVyZXVtLWljby1wYXJ0aWNpcGFudC12aXRhbGlrLWJ1dGVyaW4tYXJlLW1vdmU_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "ETH Linked to Ethereum ICO Participant, Vitalik Buterin Is on the Move - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOld digital money is on the move per on-chain data.\n\nEthereum co-founder Vitalik Buterin deposited 600 Ethereum worth around $1 million, to Coinbase on Monday, according to data from Ethereum network explorer, Etherscan.\n\nAnother dormant Ethereum address, which had bought ETH during Ethereum’s initial coin offering (ICO) in 2014, moved 191 ETH worth around $320,000 on August 20 to another address, according to Etherscan data.\n\nAD\n\nAD\n\nThe Ethereum Foundation, a non-profit organization responsible for developing and promoting the Ethereum platform, conducted the ICO between July 22, 2014, and September 4, 2014.\n\nThe Foundation raised a total of $18.3 million for 60 million ETH, at $0.305 per coin.\n\nAnalysts have also confirmed with Decrypt that it is unlikely that this second address belongs to Vitalik.\n\nThat address the ICO participant sent their ETH to later bought Unitbot (UNIBOT) and ApeCoin (APE) tokens.\n\nVitalik moves ETH\n\nOn-chain analytics firm Nansen confirmed the 600 ETH transfer from Vitalik’s wallet to Coinbase with Decrypt, adding that Vitaliak sent “a test transaction of 0.1 ETH two days ago.”\n\nAD\n\nAD\n\nHis transfer only accounts for around 0.01% of Ethereum's daily average trading volumes over 30 days of $6.3 billion, per CoinGecko data.\n\nOn-chain analytics firm Arkham data shows that Vitalik has moved around $3.6 million in ETH to exchanges including Kraken, Gemini, and Coinbase since the start of the year.\n\nNansen analysts said that the previous transfers have “typically been to Kraken.”\n\nToday’s transfer to Coinbase takes Vitalik’s total amount transferred to the exchange at $4.6 million.\n\nThe last time Vitalik transferred ETH to exchanges was between June 5 and 7, following which ETH witnessed a 14% drop, according to Coingecko data.\n\nHowever, in March, Vitalik’s transfer on exchanges coincided with the local bottom of around $1,400, suggesting that the effect on price after these movements is merely coincidental.\n\nMovement of ICO Participant wallet\n\nFollowing yesterday’s transfer, the address that received tokens from the ICO participant bought 100 UNIBOT tokens worth around $15,000, 10,000 APE tokens worth approximately $15,300, and transferred 15.8 ETH worth just over $26,000 to HitBTC exchange, data from Arkham shows.\n\nThe UNIBOT token is the native token for Unibot, a Telegram bot linked to the Uniswap exchange on Ethereum.\n\nAD\n\nAD\n\nApeCoin (APE) is an ERC-20 token based on the Bored Ape Yacht Club NFT that acts as the governance token within the ApeCoin DAO ecosystem.\n\nThe entity also transferred 1.5 ETH to U.S.-based crypto exchange Kraken. The remaining 152 ETH are sitting in another account.\n\nHowever, these are not isolated events.\n\nA month ago, an ICO whale address transferred $116 million worth of ETH to Kraken. In May, another Ethereum whale moved 4,032 ETH worth $7.4 million to the proof-of-stake contract."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vdS50b2RheS9wcmUtbWluZS1ldGhlcmV1bS13aGFsZS13YWtlcy11cC1hZnRlci04LXllYXJzLW9mLXNpbGVuY2XSAU1odHRwczovL3UudG9kYXkvcHJlLW1pbmUtZXRoZXJldW0td2hhbGUtd2FrZXMtdXAtYWZ0ZXItOC15ZWFycy1vZi1zaWxlbmNlP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "Pre-Mine Ethereum Whale Wakes Up After 8 Years of Silence - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn an unexpected development, Whale Alert, a renowned blockchain tracking platform, has unveiled that a long-dormant pre-mine Ethereum address, which lay asleep for a staggering 8.1 years, has been reactivated. The address, previously containing 191 Ethereum tokens with a valuation of approximately $317,724, has sprung to life, sending ripples of intrigue across the crypto space.\n\nAdvertisement\n\n💤 A dormant pre-mine address containing 191 #ETH (317,724 USD) has just been activated after 8.1 years!https://t.co/VJ7RgTzxz3 — Whale Alert (@whale_alert) August 19, 2023\n\nPre-mining is the practice of mining and distributing cryptocurrencies prior to their official launch. The resurgence of this sleeping whale address marks a rare event, one that last occurred nearly three weeks ago at the close of July. A case in point, an Ethereum ICO participant, who had maintained silence for eight years, orchestrated a substantial transfer of 641 ETH, currently valued at around $1.07 million.\n\nMajor bear alert\n\nThe crypto community remains divided over the significance of these reawakenings. The prevailing sentiment suggests that the resurgence may portend bearish market trends. This belief has garnered support from recent historical trends. For instance, following the previous instance of a similar whale reactivation in July, the ETH price plummeted by a staggering 20.42%.\n\nETH to USD by CoinMarketCap\n\nThe skeptics' position finds further validation in the months spanning from May to mid-July, during which weekly awakenings of such dormant wallets precipitated a 17.3% decline in the ETH price.\n\nAs the awakened whale navigates the current market landscape, the community should brace for potential fluctuations. All eyes are now fixated on the awakening whale and the cryptic tides it might usher in.\n\nIn this ever-evolving narrative of crypto trends, the reanimation of a pre-mine Ethereum whale after nearly a decade serves as a poignant reminder of the intricate interplay between early investors, market sentiment and the pulse of digital assets."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9jYXJkYW5vLW5mdC1mbG9vci1wcmljZS1za3lyb2NrZXRzLWV4Y2VlZGluZy1ldGhlcmV1bS1kYXRhL9IBWGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9jYXJkYW5vLW5mdC1mbG9vci1wcmljZS1za3lyb2NrZXRzLWV4Y2VlZGluZy1ldGhlcmV1bS1kYXRhLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Cardano NFT Floor Price Skyrockets, Exceeding Ethereum: Data - CryptoPotato",
        "content": "In recent years, the non-fungible token (NFT) space has expanded into a billion-dollar industry, with Ethereum traditionally leading the way as the dominant ecosystem. Cardano, on the other hand, faced criticism from numerous quarters, being labeled a “ghost chain” due to its absence of a DeFi and NFT economy. However, the NFT landscape is undergoing a shift.\n\nAccording to the weekly chart shared by Stocktwits NFTs, the Cardano NFT floor price index sits 22% above that of Ethereum.\n\nThe latest update by the platform demonstrated an increasing inclination towards Cardano as a hub for NFTs among market participants.\n\nA major factor that played a crucial role in uplifting the ecosystem is the Vasil upgrade which helped Cardano to become the third-largest NFT protocol behind Ethereum and Solana last September.\n\nVasil aims to improve block latency speed and efficiency on the blockchain, and its completion pushed the Unique Active Wallets (UAW) on the Cardano blockchain to new heights.\n\nOn the other hand, Ethereum’s dominance in the NFT space dwindled primarily because of its network congestion issues coupled with high gas fees that prompted some users to explore alternative platforms.\n\nWhile Cardano NFTs floor price may have exceeded Ethereum’s, the latter still commands position in terms of NFT sales volume over the last 24-hours.\n\nIn fact, data from CryptoSlam revealed that the latter’s sales account for a whopping $65 million while that of Cardano’s stands at $1.47 million."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi0xMDA5NTEyNTEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Sends $1M ETH to Coinbase - Yahoo Finance UK",
        "content": "Ethereum co-founder Vitalik Buterin deposited 600 ether (ETH), which is around $1 million worth of the cryptocurrency, to crypto exchange Coinbase on Monday, according to data from Ethereum blockchain scanning website, etherscan.\n\nThe move comes as ether, the second largest cryptocurrency by market capitalization suffered a 10% decline over the last seven days, amid a broad market downturn which saw traders witness $1 billion in liquidations. Ether has recovered slightly on Monday, trading in the green over the last 24 hours at $1,700.\n\nOn Sunday, Buterin repaid 250,000 RAI and withdrew $1.6 million worth of ether, according to on-chain tracker, lookonchain. RAI is a non-pegged stablecoin backed by ETH.\n\nIt is not clear why the Ethereum co-founder transferred the ether to centralized exchange Coinbase."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdS50b2RheS94cnAtb3V0cGVyZm9ybXMtc2hpYmEtaW51LWV0aGVyZXVtLWFuZC1jYXJkYW5vLXdpdGgtMTAtcHJpY2Utc3Bpa2XSAVZodHRwczovL3UudG9kYXkveHJwLW91dHBlcmZvcm1zLXNoaWJhLWludS1ldGhlcmV1bS1hbmQtY2FyZGFuby13aXRoLTEwLXByaWNlLXNwaWtlP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "XRP Outperforms Shiba Inu, Ethereum and Cardano with 10% Price Spike - U.Today",
        "content": "XRP, the digital asset affiliated with Ripple, witnessed a significant uptick, surging nearly 10% earlier today. As of recent metrics, XRP has settled at a 4.5% gain, still significantly outshining its rivals, including Bitcoin, Ethereum, and Cardano.\n\nAdvertisement\n\nBitcoin, for instance, barely moved with a 0.2% increase, while Ethereum slightly ascended by 0.4%. In contrast, Cardano, a notable contender in the crypto market, saw its price dip by 0.4%.\n\nHowever, when we zoom out to look at the seven-day performance, the narrative changes a bit. Over a week, XRP suffered a notable decline, shedding 14% of its value. In comparison, Ethereum's value decreased by 9.3% and BNB's by 9.9% over the week. Cardano's seven-day performance also indicated a drop but at a lesser rate of 7.5%.\n\nAs reported by U.Today, XRP recently lost roughly 40% in a single month, underperforming other top cryptocurrencies and erasing its gains that were added because of the favorable Ripple ruling.\n\nThe SEC is fighting back\n\nDespite its impressive short-term performance, XRP remains clouded by uncertainties surrounding the U.S. Securities and Exchange Commission (SEC) appeal against Ripple.\n\nThe appeal, recently submitted by the SEC, challenges a July court order. This order had decided that Ripple's sales and offers of XRP on cryptocurrency trading platforms didn't lead investors to anticipate profits dependent on others' efforts. Furthermore, it had ruled that XRP distributions as payment for services don't constitute an \"investment of money.\"\n\nThis appeal's central issues revolve around the classification of XRP's offers and sales. One court has already indicated a disagreement with the initial Ripple decision, but some prominent voices within the XRP community have downplayed the significance of such a move.\n\nThe court previously recognized that institutional sales fit the Howey criteria. However, distinctions have been drawn regarding the categorization of coins sold directly to institutional investors compared to retail investors in secondary markets."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzIxL2NyeXB0by1taW5lcnMtYXJlLWF0dGVtcHRpbmctdG8tZGl2ZXJzaWZ5LWludG8tb3RoZXItYnVzaW5lc3MtYXJlYXMtanBtb3JnYW4v0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDgvMjEvY3J5cHRvLW1pbmVycy1hcmUtYXR0ZW1wdGluZy10by1kaXZlcnNpZnktaW50by1vdGhlci1idXNpbmVzcy1hcmVhcy1qcG1vcmdhbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Crypto Miners Are Attempting to Diversify Into Other Business Areas: JPMorgan - CoinDesk",
        "content": "Bitcoin miners are also trying to diversify in terms of geography, with Russia emerging as one of the global leaders second to the U.S., in terms of bitcoin mining power consumption, the report added."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL3VzLWNyeXB0by1ldGgtZXRmLWFwcHJvdmFsLWNvaW5iYXNlLWZ1dHVyZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "US Crypto Revival: ETH ETF Approval Nears, Coinbase Futures Greenlit - Crypto Briefing",
        "content": "Key Takeaways The Coinbase app will add BTC and ETH futures soon.\n\nSEC may be ready to approve an Ethereum fund.\n\nSeven different funds were proposed to the SEC this month.\n\nShare this article URL Copied\n\nAfter months of regulatory hurdles, the US crypto industry finally enjoyed a week of progress. Coinbase got approval to offer futures trading in the US, and there is speculation that the SEC might allow an Ethereum ETF.\n\nOn Wednesday, Coinbase became the first crypto company allowed to offer leveraged and cash-settled Bitcoin and Ethereum futures to eligible US customers.\n\n“In the near future, customers can conveniently access futures via Coinbase Financial Markets,” shared Greg Tusar, Coinbase’s Institutional Product leader.\n\nAlthough futures have been available to brokers and market makers through the Coinbase Derivatives Exchange, this development will allow people to trade futures using the Coinbase interface.\n\nLater on Thursday, Bloomberg reported that the SEC may be ready to approve an Ethereum fund linked to Ether futures contracts. This would be a huge moment for companies looking to offer such investment products.\n\nThis month, seven different funds were proposed to the SEC, including Valkyrie, VanEck, Grayscale, Bitwise, ProShares, Roundhill, and Volatility Shares. The first on the list is Volatility Shares, with the SEC deciding by October 10.\n\nCoinbase shares are down 9% over the last seven days, according to Yahoo! Finance data."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvZXRoZXJldW0tbGF5ZXItMi1hcmJpdHJ1bS1zdXN0YWlucy1ncm93dGgtYW5kLXVzZXItaW5mbHV4LWZvbGxvd2luZy1hcmItYWlyZHJvcC10b3RhbC1hc3NldHMtcmVhY2gtNTc3LWJpbGxpb24tcmVwb3J0Lmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Layer-2 Arbitrum Sustains Growth and User Influx Following ARB Airdrop, Total Assets Reach $5.77 Billion ... - Cryptonews",
        "content": "Ethereum Layer-2 Arbitrum Sustains Growth and User Influx Following ARB Airdrop, Total Assets Reach $5.77 Billion: Report\n\nSource: Arbitrum\n\nPer Nansen’s Arbitrum Quarterly Report for Q2 2023, the Arbitrum (ARB) airdrop on March 23, 2023, led to a peak in users and transactions. Following the ARB airdrop, daily transactions and user numbers have consistently exceeded the chain’s past averages.\n\nArbitrum, an Ethereum rollup hosting asset valued at $5.77 billion, sustained robust growth in the previous quarter. Throughout Q2, Arbitrum maintained its momentum by enhancing its infrastructure and advancing its ecosystem.\n\nAfter the ARB airdrop incentives concluded and the airdrop resulted in a “sell-the-news” reaction for the native token and its associated ecosystem projects, noteworthy activity levels persisted, evident in transaction and user counts surpassing pre-airdrop figures.\n\nThe influx of new users underscores Arbitrum’s enduring strength and flourishing ecosystem.\n\nA group of “super airdrop hunters” who amassed ARB tokens using multiple Ethereum addresses contributed significantly to the selling pressure.\n\nThe ARB token experienced significant selling during the airdrop, causing its price to plummet from $10.29 to $1 in just a few hours.\n\nNansen’s report stated that the stability of Arbitrum after its Airdrop “points towards more organic activity” as new users have been increasing, even “surpassing Ethereum on certain days in Q2.”\n\nIn the second quarter of 2023, daily transactions and gas prices on Arbitrum One, one of the critical components of Arbitrum utilizing Arbitrum Rollup technology to enhance transaction throughput while maintaining security, remained steady, averaging 800k transactions.\n\nSource: Nansen\n\nThe quarter saw a consistent rise in transaction count compared to the previous quarter, indicating heightened activity since the airdrop. Daily active addresses on Arbitrum remained stable at approximately 200k throughout the quarter.\n\nConversely, there has been a gradual increase in the number of new wallets initiating transactions on Arbitrum since the beginning of the year. On specific days in Q2, this count surpassed Ethereum’s new wallet activity.\n\nArbitrum (ARB) Airdrop Spurs Price Surge and Ecosystem Growth Since March\n\nThe announcement of the Arbitrum (ARB) airdrop on March 16 led to a significant price increase in native tokens of projects within the Arbitrum ecosystem, including GMX (GMX), Magic (MAGIC), Gains Network (GNS), and Radiant Network (RDNT).\n\nThis surge was directly tied to the ARB airdrop, fueling growth in the Arbitrum ecosystem.\n\nThe price surge occurred mainly between the airdrop announcement and its execution on March 23.\n\nAs noted in a report, “Once the airdrop launched alongside the $ARB token introduction, ecosystem token prices began to decrease, following a typical ‘sell the news’ pattern.”\n\nThe Arbitrum airdrop allocated 1.1% of the total 12.75 billion ARB supply to the ecosystem’s DAOs. This allocation was crucial for a positive outlook on the Arbitrum ecosystem, as DAOs could leverage ARB incentives to encourage usage.\n\nHowever, the airdrop amounts for individual projects in the Arbitrum ecosystem were relatively smaller. Only GMX and MAGIC received allocations exceeding $10 million.\n\nMost projects received less than $500,000 worth of ARB tokens, which needed to be improved to incentivize liquidity across a large user base.\n\nWith the speculation surrounding the ARB airdrop subsiding, the growing number of new wallets implies increased organic engagement.\n\nDaily active users, transaction count, and on-chain value have all settled at levels higher than pre-airdrop figures.\n\nThe upward trends in gas fee expenditure and the establishment of new wallets further signify the growing utilization of the network."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8yMS9ldGhlcmV1bS1jcmVhdG9yLXZpdGFsaWstYnV0ZXJpbi1yZWNlaXZlcy10YWl3YW4tZW1wbG95bWVudC1nb2xkLWNhcmQtc2F5cy1yb2J1c3QtZXRoLWNvbW11bml0eS1pbi1jb3VudHJ5LXJlcG9ydC_SAZcBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDgvMjEvZXRoZXJldW0tY3JlYXRvci12aXRhbGlrLWJ1dGVyaW4tcmVjZWl2ZXMtdGFpd2FuLWVtcGxveW1lbnQtZ29sZC1jYXJkLXNheXMtcm9idXN0LWV0aC1jb21tdW5pdHktaW4tY291bnRyeS1yZXBvcnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Creator Vitalik Buterin Receives Taiwan Employment Gold Card, Says Robust ETH Community in Country: Report - The Daily Hodl",
        "content": "Ethereum (ETH) creator Vitalik Buterin has reportedly received a residency permit in Taiwan allowing him to live and work within the country for three years at a time.\n\nAccording to a report from local Taiwanese media, the country’s digital minister has confirmed that Buterin has obtained the Taiwan Employment Gold Card.\n\nThe program aims to attract foreign professionals and entrepreneurs to Taiwan by providing them with streamlined residency and visa procedures.\n\nSays Buterin,\n\n“I have been to Taiwan many times before, and I like it every time. We have a very good Ethereum community in Taiwan. It will be more convenient to have a gold card to come many times.”\n\nEarlier this year, Bloomberg reported that Taiwan was planning on making its top financial regulator, the Financial Supervisory Commission (FSC), the main overseer of the crypto asset industry. People familiar with the matter told Bloomberg that the FSC and Taiwanese politicians have been working with other government departments and speaking with representatives of the crypto industry to build a concrete plan for regulation.\n\nBloomberg reported that Binance Holdings, Matrixport Technologies and Woo Network LLC wrote a joint paper calling for friendlier crypto regulations that provided clarity for entities operating in Taiwan.\n\nSays the paper, written in Chinese,\n\n“From our observations, some markets that tried to regulate virtual assets under existing financial rules and categorizations experienced great difficulty as the rules lacked clarity and made it very confusing for business operators, authorities and customers.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/3d artwork wallpaper"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi91bmUtYmFsZWluZS1ldGhlcmV1bS12ZW5kLTQxLW0tZGV0aC1hdmFudC1sZS1rcmFjaC1kdS1tYXJjaGUtY3J5cHRvLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Ethereum whale sells $41m ETH before crypto market crash - Cointribune EN",
        "content": "Mon 21 Aug 2023 ▪ 3 min of reading ▪ by Fenelon L.\n\nOver the past week, the crypto market has suffered a significant fall, affecting all assets. The flagship altcoin, Ether, recorded a 10.31% drop on Thursday. Nevertheless, a clever whale managed to dodge the turbulence by liquidating a significant amount of ETH just before the crash.\n\nThe Ethereum whale’s winning strategy: Anticipation before the storm\n\nLast week saw a violent upheaval on the crypto market. The widespread crash resulted in a loss of around $1 billion of the market’s total capitalization. This tumultuous episode was largely triggered by SpaceX’s decision to liquidate its Bitcoin (BTC) holdings, worth an estimated $373 million.\n\nHowever, this news had a snowball effect, leading to a massive sell-off and causing a 12% reduction in the price of Bitcoin, in turn leading to a series of declines for ETH and other cryptos.\n\nFor example, ETH fell from $1,808 to $1,615. This trend was accentuated by the largest single liquidation on the ETH market, reaching almost $55.92 million in a single day. In total, liquidations on the ETH market reached some $308 million.\n\nIn the midst of all this turmoil, however, one Ethereum whale demonstrated a noteworthy strategic decision. According to Lookonchain, it sold 22,341 ETH worth around $41 million just before the market slowdown.\n\nThe whale was very smart and dumped 22,341 $ETH ($41M) before the market crashed.\n\n\n\nEven though he lost ~$1.7M this time, he successfully avoided the market crash.\n\n\n\nPerhaps he will buy $ETH back at a cheaper price in the future.\n\n\n\nFollow this smart whale.👇https://t.co/S4Wv8XRlhW pic.twitter.com/BcdzdpmbIA — Lookonchain (@lookonchain) August 18, 2023\n\nThis initiative was hailed by the analysis team as a smart move. Although it recorded losses of around $1.7 million, the stock managed to mitigate the effects of the widespread crash.\n\nDespite recent setbacks, Ethereum’s prospects are bright. The coming months look set to be good ones, buoyed by developments linked to Ether-futures ETFs in the USA. Indeed, the US SEC is preparing to approve the first Ether-future ETF on US territory.\n\nSeveral asset managers, such as Bitwise, ProShares, Grayscale, VanEck, and Valkyrie, have submitted applications to offer Ether-futures ETFs to US investors. Sources indicate that most of these applications could receive approval by October.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0yNjAwMC1ldGhlcmV1bS1yZXRhaW5zLTE2NzUtYWx0Y29pbnMtdHJhZGUtbWl4ZWQtMzk0ODI0LTIwMjMtMDgtMjHSAZcBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3Rva2VuL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWhvbGRzLTI2MDAwLWV0aGVyZXVtLXJldGFpbnMtMTY3NS1hbHRjb2lucy10cmFkZS1taXhlZC0zOTQ4MjQtMjAyMy0wOC0yMQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $26,000; Ethereum retains $1,675; Altcoins trade mixed - Business Today",
        "content": "Bitcoin dropped during the early trading session on Monday, while other top crypto assets were trading mixed. Bitcoin posted its worst weekly decline since the FTX crash in November 2022. The court battle between Grayscale and US regulators weighed on the crypto prices, while traders will be looking at macroeconomic cues due later this week.\n\n\n\nBitcoin continued to remain under selling pressure as the largest crypto token dropped further but managed barely to hold above $26,000-levels. Its largest peer, Ethereum, gained about half-a-per cent to hold above $1,675-mark. Price action in the altcoins was on the mixed side.\n\n\n\nBitcoin is currently priced around the $26,000 level. This may be because of widespread token selling by traders spurred by unrelated triggers like a lack of clarity in the Grayscale versus US SEC case for a Bitcoin ETF, SpaceX writing down the value of their Bitcoin reserves, and China’s Evergrande group filing for bankruptcy, said Edul Patel,Co-Founder & CEO at Mudrex.\n\n\n\n\"Meanwhile, Ethereum is maintaining a position above $1,600. Over the past 24 hours, altcoins Ripple, Litecoin, and Stellar have each grown in value by more than 3 per cent,\" he said.\n\n\n\nAll other top crypto tokens were trading mixed on Monday. Among the gainers, Litecoin surged more than 3 per cent, followed by XRP with posted similar gains. Tron and Toncoin gained as much as 2 per cent each. Among the losers, Solana and Shiba Inu shed 2 per cent each, while Dogecoin was down a per cent.\n\n\n\nThe global cryptocurrency market cap was trading flat, slightly up to $1.06 trillion-mark as it inched up less than half-a-per cent in the last 24 hours. However, the total trading volumes dropped almost 9 per cent to $22.04 billion.\n\n\n\n\n\nTech View by Giottus Crypto Platform\n\nCardano (ADA),trading at $0.27, is currently trying to reverse its decline from last week's decline. ADA managed to regain some of its losses over the weekend and is attempting a breakout from descending wedge. Its RSI levels (currently at 38) display positive divergence within the falling wedge pattern, which may increase the chances of a bullish reversal leading to an upside breakout.\n\n\n\n\n\nThe token can have a rally if it manages to break the key resistance level of $0.30 (its 50-day EMA). On the flip side, $0.23 is likely to be a strong support zone.\n\n\n\nMajor Levels:\n\nSupport: $0.25, $0.23\n\nResistance: $0.30, $0.32\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS92aXRhbGlrLWJ1dGVyaW4tdHJhbnNmZXJzLTEtbWxuLWluLWV0aC10by1jb2luYmFzZS10cmlnZ2VyaW5nLXNwZWN1bGF0aW9ucy_SAWVodHRwczovL2FtYmNyeXB0by5jb20vdml0YWxpay1idXRlcmluLXRyYW5zZmVycy0xLW1sbi1pbi1ldGgtdG8tY29pbmJhc2UtdHJpZ2dlcmluZy1zcGVjdWxhdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Vitalik Buterin transfers $1 mln in ETH to Coinbase, triggering speculations - AMBCrypto News",
        "content": "The transfer of ETH by Buterin or the Ethereum Foundation is usually followed by a fall in ETH’s price.\n\nThere is a possibility of Buterin going for a massive selloff.\n\nEthereum [ETH] co-founder Vitalik Buterin transferred 600 ETH worth $1 million to crypto exchange Coinbase [COIN] on 21 August.\n\nOn 20 August, Buterin had repaid 251,000 RAI and withdrew $1.6 million in ETH. RAI is an ETH-backed non-pegged stablecoin.\n\nThe move is surprising as the crypto market is witnessing a major slowdown again. The prices of Bitcoin [BTC] and ETH declined by more than 10% over the last week. At press time, BTC was trading at a little above $25,900 and ETH was trading at a little above $1,650.\n\nWhat the Ethereum transfer means amidst a bearish market…\n\nThe transfer of ETH tokens by Vitalik Buterin or the Ethereum Foundation is usually followed by a fall in ETH’s price. While we are yet to know the reason behind the recent transfer, there is a possibility of Buterin committing to another massive selloff. However, there is also the possibility of him making the transfer for a single-time sale only. Social media is rife with speculations.\n\nAnalysts and market experts now predict that Ethereum will tumble dramatically if its value falls below the key support level of $1,550-$1,600. The total market cap of the crypto industry fell more than 10% over the last seven days. At press time, the total crypto market cap stood at $1.05 trillion.\n\nAs far as Coinbase is concerned, it was facing regulatory scrutiny in the U.S. at the hands of the Securities and Exchange Commission (SEC). In early June, the regulator sued the exchange for allegedly violating securities law by acting as an unregistered broker-dealer.\n\nMeanwhile, COIN’s value on Nasdaq fell nearly 9% over the last week. At press time, it was trading at $73.9."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vdS50b2RheS9wb21lcmRvZ2UtcG9tZC1wcmUtc2FsZS1yZWFkeS10by13ZWxjb21lLW5ldy1pbnZlc3RvcnMtaW4tYXVndXN0LTIwMjMtd2hpbGUtZXRoZXJldW0tZXRoLWFuZC14cnDSAXRodHRwczovL3UudG9kYXkvcG9tZXJkb2dlLXBvbWQtcHJlLXNhbGUtcmVhZHktdG8td2VsY29tZS1uZXctaW52ZXN0b3JzLWluLWF1Z3VzdC0yMDIzLXdoaWxlLWV0aGVyZXVtLWV0aC1hbmQteHJwP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Pomerdoge (POMD) Pre-Sale Ready to Welcome New Investors in August, 2023 while Ethereum (ETH) and XRP Demonstrate Strong Performance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSome altecoins’ growth has sidelined well-established projects like Ripple (XRP) and Ethereum (ETH).\n\nSupporters of Pomerdoge (POMD) can take part in pre-sale and buy tokens here .\n\nEthereum (ETH) whales favor holding Ether for long-term\n\nThe latest data from Santiment has revealed that ETH whales are putting their faith in the Ethereum network. The data shows that the top 10 Ethereum addresses now hold about 35% of the total ETH supply. This number represents around 28 million Ethereum (ETH) tokens worth $51.6 billion.\n\nMoreover, these whales are more interested in holding Ethereum (ETH) tokens than selling them. They believe that Ethereum (ETH) can grow further in the coming times. However, this bullish sentiment is absent from Ethereum’s (ETH) price chart. The market value of Ethereum (ETH) has fallen by more than 2% over the past month, and is currently hovering at $1,848.70.\n\nXRP trading volume increases\n\nIn the past few weeks, several crypto exchanges have relisted XRP. The series of relisting started after the federal court ruled in favor of Ripple in the SEC lawsuit. The latest exchange to relist XRP is Gemini.\n\nCoinbase, Kraken, and Bitstamp had already relisted XRP. Subsequently, the trading volume of XRP has increased in recent weeks. Thus, the price of XRP has soared by around 33% in the past month. At press time, XRP is changing hands at $0.63. However, analysts have pointed out that the number of active addresses on the XRP network has declined slightly.\n\nPomerdoge (POMD) presale enters new phase\n\nThe popularity of play-to-earn (P2E) games has ballooned in recent times. A report has revealed that 40% gamers in the US, UK, and Indonesia are interested in trying blockchain games. This indicates an increase in global demand for blockchain games. A new P2E gaming platform, Pomerdoge , has entered the market with a unique business plan.\n\nThe platform has announced the to-be-launched P2E meme coin, Pomergame. This new P2E game will allow players to connect and play against other members, and earn rewards. It will also allow gamers to create their avatars, and upgrade them with custom in-game items.\n\nThe platform has planned to introduce the Pomerplace. It will function as a gaming arena as well as a marketplace. At Pomerplace, players will get a chance to battle against each other, and trade in-game assets with other gamers.\n\nBesides, Pomerdoge has announced launching 7,777 non-fungible tokens. These NFTs will also be launched during the presale, and only POMD holders will be allowed to purchase them. Pomerdoge has designed its native crypto, POMD, on the Ethereum blockchain. Cyberscope and Solidproof have audited the smart contract of the token. Additionally, there will be no sell or buy taxes on POMD transactions, helping investors make more profit.\n\nAt present, the platform’s presale is in stage 1, and POMD’s price has increased from $0.007 to $0.008.\n\nFind out more about the Pomerdoge (POMD) Presale Today\n\nWebsite: https://pomerdoge.com/"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktaW52ZXN0b3JzLXNob3VsZC1zdG9ja3BpbGUtYWx0Y29pbnMv0gFCaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3doeS1pbnZlc3RvcnMtc2hvdWxkLXN0b2NrcGlsZS1hbHRjb2lucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Why now is the best time to invest in altcoins - AMBCrypto News",
        "content": "Investors continued to accumulate more ETH as its supply outside of exchanges increased.\n\nXRP was up by more than 4% in the last 24 hours, and a few metrics were bullish.\n\nOver the last few days, the crypto market has witnessed a massive downfall. This caused most cryptos to shed their values by nearly double digits, including Ripple [XRP] and Ethereum [ETH]. While the market remained under bears’ influence, it has opened the right opportunity for investors to increase their accumulation.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nInterestingly, the latest data suggested that most altcoins were in the underbought zone, which can cause an uptick in buying pressure, in turn, changing the market condition around.\n\nA massive price correction\n\nThough there might have been multiple factors at play that caused the entire market to turn red, a major reason might have been SpaceX’s dump of Bitcoin [BTC] worth millions of dollars. Thanks to this, Ethereum went under the $1,600 mark for a short while.\n\nHowever, Santiment’s latest tweet revealed that several altcoins went into the underbought zone over the last few days. Not only were altcoins underbought, but the overall trading sentiment remained low.\n\n? Market caps have fallen considerably over the past week, and traders are very polarized. Many believe a quick recovery is coming, while others see this as just the beginning of the dump. But undeniably, average #crypto returns are in a mathematically historic opportunity zone. pic.twitter.com/oVlLQ6ZuB1 — Santiment (@santimentfeed) August 19, 2023\n\nAs per CoinMarketCap, the 24-hour trading volume dropped by more than 30%, reflecting investors’ reluctance to actively trade. However, while the market remains sluggish, it might be the right opportunity for investors to accumulate more before the market turns bullish. In fact, investors were already accumulating the king of altcoins.\n\nAs per Santiment, ETH’s supply on exchanges dropped substantially while its supply outside of exchanges increased. Additionally, whales’ confidence in the king of altcoins was high as the supply held by top addresses went up.\n\nAre Altcoins entering a bull rally?\n\nSurprisingly, while ETH’s price was still slow-moving, XRP, on the other hand, showed high volatility. According to CoinMarketCap, the altcoin was up by more than 4% in the last 24 hours, which was remarkable, considering the current market condition.\n\nAt press time, it was trading at $0.5288 with a market cap of over $27.9 billion. The recent price uptick helped XRP increase its MVRV Ratio slightly. Additionally, positive sentiment around the token was relatively high.\n\nNot only that, but ETH’s Relative Strength Index (RSI) was in an oversold zone, which is a bullish development. Moreover, CryptoQuant’s data revealed that ETH’s exchange reserve was declining, suggesting that buying pressure was increasing.\n\nHow much are 1,10,100 XRPs worth today\n\nThis happened while the market’s Fear and Greed index had a value of 34. When the metric’s value remains low, the chances of a price uptick increase. Therefore, investors might consider this a good opportunity to increase their accumulation to enjoy profits during the next bull run.\n\nHowever, taking into account the unpredictable nature of the crypto market, the possibility of a further downtrend can’t be ruled out."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC1jcnlwdG9zLW9mZmVyaW5nLWhpZ2gtZ3Jvd3RoLW9wcG9ydHVuaXRpZXMtaW4tMjAyMy1ldGhlcmV1bS1zaGliYS1pbnUtZXZlcmxvZGdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Top Cryptos Offering High Growth Opportunities in 2023: Ethereum, Shiba Inu, Everlodge - Analytics Insight",
        "content": "Investors are almost always on the lookout for opportunities that promise substantial gains. As the market trend unfolds in 2023, several cryptocurrencies are emerging as top contenders to offer high growth returns. Among these standouts are Ethereum (ETH), Shiba Inu (SHIB), and Everlodge (ELDG).\n\nSummary\n\nLedger users can now buy ETH with PayPal, sparking bullish predictions for Ethereum\n\nShibarium set to be a game-changer for Shiba Inu after development report\n\nExperts predict up to 20x rally for Everlodge, the new real estate gem in crypto\n\nJoin the Everlodge presale and win a luxury holiday to the Maldives\n\nEthereum (ETH) PayPal Purchase Now Available on Ledger\n\nEthereum (ETH), the pioneer of smart contracts, has maintained its position as the second-largest cryptocurrency. Despite the bearish crypto market, the Ethereum coin continues to reach significant milestones.\n\nFollowing announcements that former U.S. president, Donald Trump, holds $2.8 million in ETH, Ledger has made another bullish announcement. The hardware wallet provider has now made ETH purchases available via PayPal.\n\nToday, the Ethereum price is down by 0.75%, as the broader crypto market is in bear territory. Despite this, crypto experts are bullish about the price of Ethereum. Now trading at $1,822.9, Ethereum has been predicted to reach a 2023 high of $3,200 in a bull market.\n\nShibarium Development Report Sparks Shiba Inu (SHIB) Excitement\n\nFollowing reports that the Shiba Inu community will finally get a look at the Shibarium mainnet tomorrow, a team member has dropped an exciting report. According to the report, hundreds of projects are already building on the layer 2 network.\n\nCrypto experts are bullish about this report as it would finally add more utility to the Shiba Inu coin. The community is also celebrating the festival of fire with a huge Shiba Inu burn event. In the last 24 hours, hundreds of millions of SHIB tokens have been burnt.\n\nWith the growing excitement, crypto experts have given bullish predictions for the price of Shiba Inu. Now trading at $0.00000985 due to a market-wide downtrend, the Shiba Inu price has been projected to reach $0.000001250 this week.\n\nTraders Stack Up Everlogde (ELDG) Tokens Before Price Surge\n\nRegardless of the ongoing bearish trend, many crypto investors have been showing interest in Everlodge (ELDG) – a new project billed to transform real estate investment. These investors are now doubling down on Everlodge ahead of a surge that might result in a 35x gain in price.\n\nInvesting in vacation homes is traditionally reserved for the wealthy due to the hefty overhead costs connected with real estate. Everlodge is introducing a hybrid shared ownership model using blockchain and fractional NFTs to solve this problem.\n\nThe property marketplace will list luxury homes, hotels, and vacation apartments as fractional NFTs, giving investors the chance to buy fractions for as little as $100. The team will work with prominent hotel chains and premium real estate developers all around the world to secure the properties.\n\nThe idea of giving hundreds of thousands of investors the opportunity to invest in the timeshare industry is expected to drive up the price of ELDG. In the beta presale stage, the currency is now trading at $0.010 and is expected to climb 35x and trade as high as $0.35 when it launches.\n\nFind out more about the Everlodge (ELDG) Presale\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi0AFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWF1Z3VzdC0yMC1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNjI0MTYz0gHUAWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktaW4taW5kaWEtYXVndXN0LTIwLWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE2MjQxNjMvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Ethereum See Gains As Sui Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to remain above the $26,000 and $16,000 marks, respectively, on early Sunday morning. Other popular altcoins — including the likes of Litecoin (LTC), Solana (SOL) — landed in the positive as overall prices saw minor gains across the board. Sui (SUI) emerged to be the biggest gainer, seeing a 24-hour jump of over 10.15 per cent. XDC Network (XDC), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.06 trillion, registering a 24-hour gain of 0.77 per cent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $26,114.35 seeing a 24-hour gain of 0.64 per cent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 23 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,666.67, marking a 24-hour gain of 0.37 per cent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.49 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 0.39 per cent as per CoinMarketCap data, currently priced at $0.06397. As per WazirX, Dogecoin price in India stood at Rs 5.7400.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 0.29 per cent. At the time of writing, it was trading at $64.34. LTC price in India stood at Rs 5,843.84.\n\nRipple (XRP) price today\n\nXRP price stood at $0.5193, seeing a 24-hour gain of 2.64 per cent. As per WazirX, Ripple price stood at Rs 45.8701.\n\nSolana (SOL) price today\n\nSolana price stood at $21.75, marking a 24-hour gain of 1.25 per cent. As per WazirX, SOL price in India stood at Rs 1,921.00.\n\nTop crypto gainers today (August 20)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nSui (SUI)\n\nPrice: $0.5491\n\n24-hour gain: 10.15 per cent\n\nTHORChain (RUNE)\n\nPrice: $1.74\n\n24-hour gain: 8.98 per cent\n\nArweave (AR)\n\nPrice: $4.57\n\n24-hour gain: 6.90 per cent\n\nFantom (FTM)\n\nPrice: $0.2111\n\n24-hour gain: 4.69 per cent\n\nToncoin (TON)\n\nPrice: $1.35\n\n24-hour gain: 4.27 per cent\n\nTop crypto losers today (August 20)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nXDC Network (XDC)\n\nPrice: $0.05713\n\n24-hour loss: 2.38 per cent\n\nAkash Network (AKT)\n\nPrice: $1.41\n\n24-hour loss: 1.87 per cent\n\nUNUS SED LEO (LEO)\n\nPrice: $3.86\n\n24-hour loss: 1.60 per cent\n\nShiba Inu (SHIB)\n\nPrice: $0.000008434\n\n24-hour loss: 0.91 per cent\n\nQuant (QNT)\n\nPrice: $99.90\n\n24-hour loss: 0.83 per cent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL2V0aGVyZXVtLWxheWVyLTJzLXN1cmdlLXRyYW5zYWN0aW9uLW51bWJlcnMv0gFLaHR0cHM6Ly93d3cudHJvbndlZWtseS5jb20vZXRoZXJldW0tbGF5ZXItMnMtc3VyZ2UtdHJhbnNhY3Rpb24tbnVtYmVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 20 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Layer 2s Surge: Transaction Numbers Reach 3x Bull Market Peak - TronWeekly",
        "content": "The transaction numbers on Ethereum and its top Layer 2 (L2) solutions have surged to nearly three times higher than the previous bull market peak. This remarkable growth within the L2 ecosystem has not adversely affected the Ethereum mainnet, where transaction volumes have remained stable at approximately 1 million transactions per day.\n\nSpotlight on Ethereum Layer 2s\n\nAccording to the latest report by IntoTheBlock’s weekly newsletter, this week’s spotlight is on ETH’s Layer 2 scaling solutions. A detailed analysis of the competitive landscape within optimistic rollups and key metrics reveals their profound impacts on the broader Ethereum network.\n\nDespite consistent transaction levels, network fees for Bitcoin have experienced a 16.6% drop. On the other hand, ETH fees have risen by 2.6%, particularly in response to heightened market volatility.\n\nExchange netflows have seen a remarkable trend, with Bitcoin and ETH witnessing $400 million in outflows from centralized exchanges. It suggests a move by holders to secure their assets by retaining custody.\n\nEthereum L2 Activity Soars\n\nEthereum’s L2 solutions have rapidly gained traction over recent months, with new Layer 2s launching almost weekly. Coinbase’s Base L2, built on the Optimism infrastructure, has quickly attracted users, temporarily surpassing Optimism in daily transactions shortly after its launch.\n\nOptimism’s momentum is palpable, as its transactions reached an all-time high, surpassing those of Arbitrum for the first time in 2023. Sam Altman’s Worldcoin launch on the Optimism network significantly contributed to this surge.\n\nWhile the competition among Layer 2 solutions intensifies, ETH continues to reap benefits. The total number of transactions involving L2s has soared to three times the bull market peak, yet Ethereum’s mainnet remains resilient, maintaining its transaction volume of approximately 1 million transactions per day.\n\nArbitrum remains dominant in decentralized finance (DeFi), boasting financial applications’ highest liquidity and activity. Within a short span, Coinbase’s Base L2 has accumulated an impressive $170 million in total value locked (TVL), surpassing Cardano and Bitcoin.\n\nAn upcoming Ethereum upgrade, EIP-4844 (Dencun), is expected to reduce L2 transaction costs by 10x-100x drastically. Although the launch timeline is yet to be confirmed, Ethereum’s developers are gearing up for the Devnet 8 testnet, which will feature the proposed improvements.\n\nAmidst market volatility, Ethereum’s Layer 2 solutions have proven to be a bright spot. Optimism has seen remarkable adoption, Base has emerged as a rapidly growing chain, and Arbitrum continues to dominate DeFi.\n\nRelated Reading | Shiba Inu’s Quest For $0.01 Amidst the Whirlwind Adventure"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDgvMjEvdml0YWxpay1idXRlcmluLW1ha2VzLXByaWNlLWV0aGVyZXVtLW1vdmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Vitalik Buterin makes the price of Ethereum move - The Cryptonomist",
        "content": "Ethereum co-founder Vitalik Buterin has left the entire community bewildered after sending as much as 600 ETH to Coinbase: everyone is wondering the motivation for this move and what influence it will have on the crypto’s price.\n\nAt a time when the cryptocurrency landscape is no stranger to price fluctuations, regulatory uncertainties, and a turbulent market, Buterin’s action seems to carry significant weight.\n\nWill the weight of the action of Ethereum co-founder Vitalik Buterin have a negative influence on the price of ETH?\n\nAccording to data from the Ethereum blockchain explorer website, etherscan, Buterin’s transfer has attracted attention and raised questions about the motivations behind such a move.\n\nThe transfer coincided with a tumultuous period for ETH, the second largest cryptocurrency by market capitalization.\n\nOver the previous seven days, ETH had fallen 10%, reflecting a broader market decline that led traders to witness liquidations of about $1 billion on several digital assets.\n\nThe cryptocurrency community held its breath as prices fluctuated and investors looked for signs of stability amid uncertainty.\n\nDespite the current market disquiet, there was a breath of optimism on Monday as Ethereum managed to regain some of the lost ground.\n\nWith growth over the past 24 hours, the cryptocurrency’s value hovered around $1,700, signaling a tentative recovery.\n\nHowever, the abruptness of Buterin’s move has raised more questions than answers, particularly in light of another recent financial maneuver.\n\nEthereum: some keen observers had already noticed Vitalik Buterin’s activities, but how will the price react?\n\nOn the day just before the move, Sunday, Buterin’s activity had attracted the attention of keen observers.\n\nThe records of the on-chain tracer known as lookonchain revealed that he had repaid 250,000 RAI and simultaneously withdrawn a hefty sum of $1.6 million in Ether.\n\nRAI, an unanchored stablecoin backed by ETH, added another layer of mystery to the narrative.\n\nYet amid the uncertainty and speculation, one question looms large: why did Ethereum’s co-founder choose to transfer a considerable sum of Ether to the centralized exchange platform Coinbase?\n\nThe answer to this question remains unclear, and the cryptocurrency community continues to piece together the puzzle.\n\nPossible explanations\n\nOne plausible explanation revolves around the need for liquidity. Although Buterin is an influential figure in the blockchain space, he may have sought to leverage the liquidity available on Coinbase to obtain funding for various initiatives.\n\nIt is no secret that the cryptocurrency market can be unpredictable, and maintaining a certain level of liquidity can be beneficial, especially for someone actively involved in the industry.\n\nAlternatively, this move could reflect a strategic stance. By transferring a substantial amount of Ether to Coinbase, Buterin may have paved the way for future potential ventures.\n\nCoinbase, with its status as a leading crypto exchange platform, offers access to a wide range of resources, collaborations, and opportunities that could be leveraged for projects aimed at promoting the growth and adoption of Ethereum.\n\nIt is also worth considering the broader implications for the cryptocurrency market. The actions of prominent figures like Vitalik Buterin can often set the tone for market sentiment.\n\nObservers and investors closely follow such movements, looking for potential trends or patterns that could influence their own decisions.\n\nButerin’s move could signal his confidence in Coinbase’s security and services, potentially allaying concerns about the platform’s reliability after several security breaches that have affected the cryptocurrency industry.\n\nBottom line on the story\n\nIn light of this, as the cryptocurrency space continues to evolve, unexpected events such as these remind us of the complexity and intrigue that characterizes this nascent industry.\n\nThe lack of a clear explanation behind Buterin’s move only adds to the mystery, leaving room for speculation and interpretation.\n\nIn an industry marked by innovation and disruption, even seemingly ordinary transactions can carry underlying messages that shape the course of the cryptocurrency.\n\nIn conclusion, Vitalik Buterin’s recent transfer of more than $1 million in Ether to Coinbase has sparked curiosity and speculation within the cryptocurrency community.\n\nAs the co-founder of Ethereum, Buterin’s actions carry weight and significance, and the motivations behind such a transfer are open to interpretation.\n\nWhether it is a strategic move, a liquidity optimization strategy, or an indicator of broader market sentiment, the cryptocurrency world continues to observe and learn from the actions of its key players.\n\nAs the industry matures, unexpected moves like this one remind us that the landscape is constantly evolving and full of surprises."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3ZpdGFsaWstYnV0ZXJpbi10cmFuc2ZlcnMtNjAwLWV0aGVyLXRvLWNvaW5iYXNlLWFtaWQtcmlzaW5nLXNlbGxpbmctcHJlc3N1cmUtb24tZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Vitalik Buterin transfers 600 Ether to Coinbase amid rising selling pressure on Ethereum - Cryptopolitan",
        "content": "Ethereum co-founder Vitalik Buterin has made headlines once again with a significant transaction. Earlier today, Buterin transferred 600 Ether, valued at over $1 million, from his wallet to the popular cryptocurrency exchange Coinbase. The reasons behind this move remain unclear, but such transfers are often interpreted as a precursor to a sale.\n\nMoreover, this transfer comes when selling pressure on Ethereum has been increasing. Consequently, Buterin’s transaction may further contribute to the price downward pressure on the cryptocurrency.\n\nHowever, it is essential to note that Buterin has a history of moving funds to cryptocurrency exchanges. In March of this year, he contributed 200 ETH to the Kraken exchange. Around the same time, he sold 439.25 Ether in exchange for various alternative cryptocurrencies.\n\nAdditionally, on August 20, the “vitalik.eth” wallet reportedly returned 251,000 RAI on the DeFi platform Maker and withdrew 1,000 ETH, equivalent to about $1.67 million. This information comes from on-chain investigator Lookonchain. Significantly, the “vitalik.eth” wallet was created seven years ago and currently holds 3,993 ETH, or nearly $6.5 million. CryptoSlate, using the Arkham Intelligence dashboard, has verified that the wallet indeed belongs to the Ethereum co-founder.\n\nBesides Ether, the wallet also contains other assets. It holds USD Coin (USDC) valued at $84,000 and Wrapped Ethereum (WETH) valued at $58,000. Hence, Buterin’s recent transfer to Coinbase is not an isolated incident, but part of a broader pattern of transactions.\n\nButerin’s transaction follows closely after last Thursday’s flash crash in the crypto market. Last week, the price of ETH dropped below $1700 for the first time since June and has remained below that level as of this writing. Currently, ETH is trading with bullish sentiment, showing a price increase of 0.07% and trading at $1,674.79."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vYmxvY2t6ZWl0LmNvbS9iaXRjb2luLXNwYXJrcy1pY28tYS1nb2xkZW4tb3Bwb3J0dW5pdHktZm9yLWV0aGVyZXVtLWFuZC1zb2xhbmEtaW52ZXN0b3JzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 21 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Spark's ICO: A Golden Opportunity for Ethereum and Solana Investors - Blockzeit",
        "content": "Bitcoin Spark’s Initial Coin Offering (ICO) presents an enticing proposition for Ethereum and Solana investors. Bitcoin Spark offers investors an opportunity that mirrors Bitcoin’s early days when one BTC was going at $1. BTCS offers ETH and SOL investors a chance to participate in a project that could potentially reshape the cryptocurrency mining arena.\n\nBitcoin Spark (BTCS)\n\nBTCS strives to revolutionize mining, rewards, and consensus mechanisms in the blockchain world. A diversion from traditional cryptocurrencies, BTCS employs a unique Proof-of-Process (PoP) consensus mechanism, featuring merged PoS and PoW protocols. This innovative approach ensures fair rewards distribution and enhances network security, making it a potential game-changer in the crypto landscape. The BTCS ecosystem offers miners the opportunity to contribute processing power through an application, earn rewards, and participate in a secure and accessible mining process. With its focus on profitability, simplicity, and decentralization, Bitcoin Spark seeks to carve its path in the world of digital currencies outpacing Solana and Ethereum.\n\n\n\n\n\nBTCS is running an exciting ICO currently in phase two at $1.75, with a 15% bonus. Holders of phase two can witness their investment skyrocket by 657% at launch. Prospective investors can get assurance of a solid infrastructure and compliant systems through BTCS KYC certification and ContractWolf smart contracts audit.\n\nWhat to mine after Ethereum\n\nAfter Ethereum’s long-awaited merge, a switch to proof-of-stake occurred. Now that the energy-intensive PoW is discontinued, what next for Ethereum miners? Fortunately, there are several alternative cryptocurrencies that miners consider mining. However, when choosing a cryptocurrency to mine after Ethereum, consider factors such as the mining algorithm, hardware compatibility, potential profitability, and the project’s fundamentals. Bitcoin Spark tops the list of best cryptocurrencies to mine after Ethereum. Bitcoin Spark offers a unique Proof-of-Process consensus mechanism that combines elements of PoS and PoW. It aims to provide more accessibility and security for miners. The rewards are distributed fairly and in a nonlinear way to ensure that mining power doesn’t find its way into the hands of a few individuals. In addition, it provides an application where miners can rent out computational power to those in need. In such an arrangement, mining becomes possible and anyone can mine. If you’re interested in a new and innovative approach to mining, BTCS could be worth exploring. Other options include Dogecoin (DOGE), Litecoin (LTC), and Ethereum Classic (ETC) among others.\n\nIs Solana a good investment\n\nSolana has gained recognition for its cutting-edge blockchain technology that prioritizes rapid transaction speeds, scalable infrastructure, and minimal fees. What sets Solana apart is its distinctive methodology which distinguishes it from other platforms. The expansive Solana ecosystem encompasses a wide array of elements, ranging from NFTs and cryptocurrency wallets to dApps and DeFi solutions.\n\nWhile Solana presents a compelling case with its innovative technology and growing ecosystem, Bitcoin Spark’s strategic approach, improved tokenomics, and clear roadmap position it as a strong contender to surpass Solana’s success. The two projects will likely contribute to the industry’s growth and transformation, offering investors unique opportunities to participate in the ongoing crypto revolution. Moreover, with its innovative vision and promising trajectory, Bitcoin Spark could be poised to make a significant impact and potentially outpace Solana in the crypto market.\n\nFind more here:\n\nWebsite: https://bitcoinspark.org/\n\nBuy BTCS: https://network.bitcoinspark.org/register"
    }
]