[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTcvZXRoZXJldW1zLWxvc3Mtb2YtZmluYWxpdHktd2hhdC1oYXBwZW5lZC_SAVZodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzE3L2V0aGVyZXVtcy1sb3NzLW9mLWZpbmFsaXR5LXdoYXQtaGFwcGVuZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Ethereum Briefly Stopped Finalizing Transactions. What Happened? - CoinDesk",
        "content": "“Today’s incident has been a great fire drill. It looks like two or three issues came together (as is often the case). The chain recovered gracefully and we discovered a few other issues that could be improved to make Ethereum more resilient,” tweeted Marius van der Wijden, a developer at the Ethereum Foundation."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS93aHktZXRoZXJldW0taXMtZG9taW5hdGluZy1hZ2Fpbi1vdmVyLWRlZmktYWx0ZXJuYXRpdmVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Why Ethereum is so dominant — and why it's not going anywhere - DLNews",
        "content": "Ethereum’s share of value locked in DeFi protocols plunged from 90% in January 2021 to 49% in April 2022\n\nSince the collapse of Terra and the growth of “layer 2″ protocols, it now accounts for two-thirds of value locked in DeFi\n\nExperts say interest in alternative blockchains has dimmed amid rising rates, regulation, and improvements to Ethereum\n\nAs crypto took off, Ethereum became a victim of its own success.\n\nIn 2021, retail investors crowded into crypto, sending the global value of all cryptocurrencies to a whopping $3 trillion.\n\nTransactions soared on Ethereum, the first and most popular smart contract blockchain. But it became congested and expensive to use — the average trade cost about $20 in the first three months of the year; in May 2021, it almost topped $70.\n\nSeveral so-called “Ethereum killers” sprouted up in response. These independent blockchains — layer 1 blockchains in industry-speak — traded Ethereum’s decentralisation for speed and affordability. For a while, their bet paid off.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nNOW READ: Bitcoin fee surge spurs calls for changes to treat NFTs and meme coins as spam\n\nNow, things have changed. As Ethereum improves, and as the crypto industry girds for a war of attrition against rising interest rates and regulators emboldened by scandals, users and investors are choosing a faster, cheaper Ethereum over a multi-blockchain future.\n\n“I question why you would be building an L1 at all, when it’s going to be so hard to bridge customers from the Ethereum ecosystem,” an analyst at a crypto fund told DL News. The analyst asked for anonymity citing company media policy.\n\nConsolidation of DeFi\n\nAlthough the total value locked in Ethereum DeFi protocols grew more than sevenfold in 2021 to more than $110 billion, its share of the crypto market plummeted, from more than 90% to 55%. New, cheaper-to-use blockchains Terra, Binance Smart Chain, and Avalanche together accounted for one out of every five dollars locked in a DeFi protocol.\n\nJoin the community to get our latest stories and updates\n\nDeFi Llama all blockchains TVL chart Total value locked in Ethereum, blue, declined relative to alternative Layer 1 blockchains through April 2022. (DeFi Llama )\n\nBut multibillion-dollar scandals have destroyed or weakened competing blockchains in the years since. The poor design of Terra’s dollar-pegged stablecoin led to its spectacular collapse in May 2022.\n\nFTX was a prominent backer of Solana, which has yet to fully recover from the exchange’s bankruptcy. Harmony and Waves have also suffered from accusations of mismanagement and fraud.\n\nNOW READ: Waves founder Ivanov threatens investors burned in $530m DeFi debacle — ‘I’ll find you if I want to’\n\nPerhaps most importantly, Ethereum is getting better.\n\nInstead of seeking solutions elsewhere, some developers built separate Ethereum-based blockchains that batch and compress user transactions before appending them to the main Ethereum chain. These so-called “rollups,” or layer 2 blockchains, such as Arbitrum and Optimism, let users access Ethereum’s security and decentralisation at a fraction of the price.\n\n‘There’s a huge liquidity problem, because everyone’s money is still locked up in Ethereum’ — Tze Donn Ng, Tioga Capital\n\nLayer 2 blockchains built on top of Ethereum now handle more transactions than Ethereum itself.\n\nThere has been a “consolidation of DeFi onto Ethereum, where there’s the most liquidity,” according to Sebastien Guillemot co-founder and director at Paima Studios.\n\nWhen accounting for its rollups, Ethereum’s share of TVL has grown since April 2022, to more than two-thirds of the DeFi market.\n\nMove over\n\nVenture funds last year poured hundreds of millions into a pair of blockchains built using Move, a programming language developed by Meta’s Facebook during its attempt to create its own cryptocurrency. As many before them had, Aptos and Sui promised faster transactions at lower cost, luring funding from venture capital giant Andreessen Horowitz, among others.\n\n“Aptos and Sui got a lot of fanfare a while ago when they announced all the funding rounds,” Tze Donn Ng, an investment associate at Tioga Capital, told DL News.\n\nNOW READ: Sui launch throws market makers’ cut into spotlight: ‘No one really knows what the terms of the deal are’\n\nThe reason is multifaceted.\n\nFirst, there’s less innovation than meets the eye.\n\nDuring the bull market, tokens for newly launched protocols would surge in value the moment they began trading, Guillemot said.\n\nIn an attempt to ride this wave, developers launched clones of popular Ethereum applications on new blockchains, Guillemot said.\n\n“But now that we’re in a bear market and that’s not really an option, there’s not so much appetite for this, which has caused everyone to consolidate on platforms that do have active users,” he said.\n\nThe result? Fewer applications on new blockchains, and fewer reasons to go to those blockchains.\n\n“These new blockchains don’t have anything fundamentally interesting for users at the moment,” Tom Dunleavy, a former analyst at Messari, told DL News.\n\nThe ‘liquidity problem’\n\nThere’s another, deeper issue facing alternative smart contract blockchains. Network effects mean that, as Ethereum grows in popularity, it becomes an even more attractive place for new users. More users means more assets, which means deeper liquidity and an easier experience trading.\n\n“There’s a huge liquidity problem, because everyone’s money is still locked up in Ethereum,” Ng said.\n\nCreating a bridge between Ethereum and competing blockchains in order to allow Ethereum users to move their assets elsewhere likely won’t help the matter — not after a year in which bridges became prime targets for hackers.\n\nNOW READ: DeFi hackers stole $3.2bn last year amid 35% surge in ‘bridge’ exploits\n\nSaid Ng: “No one likes to bridge assets. They want native assets.”\n\nAnd as Ethereum transaction fees surge amid a craze in meme coin trading, rollups stand to benefit — enjoying tight integration with Ethereum but offering a cheaper and faster user experience.\n\nBut why did alternative blockchains succeed in the first place?\n\nThat success “was very much a function of the times,” the anonymous analyst told DL News.\n\n“It’s probably the same reason why loss-making businesses were able to SPAC for the last two-and-a-half years,” he said, referring to companies that went public via a merger with special-purpose acquisition companies.\n\n“All these terrible businesses that will never make a profit, they were able to SPAC because we were in such a low interest rate environment, money was flowing everywhere.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWRlZmxhdGlvbmFyeS1tb2RlbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "High Gas Fees Worth the Pain? Ethereum's Deflationary Model in Action - Blockworks",
        "content": "Using Ethereum is expensive.\n\nWhether it’s from trading on DeFi, flipping NFTs, or gambling with memecoins, transaction fees have been driven upward for months on the network. The rise extends to simply sending tokens from one wallet to another.\n\nWhile recent memecoin buffoonery has exacerbated the problem, ether (ETH) gas fees have been gradually climbing long before the more recent get-rich-quick PEPE craze, with previous perpetrators Uniswap and Blur elevating costs.\n\nBut it’s not all bad. New mechanisms introduced by EIP-1559 in 2021 brought in the burning of base fees, causing deflationary conditions for the network.\n\nThis fee model contributes to the narrative of Ethereum as “ultrasound money,” reducing the supply of ETH as on-chain activity drives demand. Adam Smith might have been on to something.\n\nIn theory, a reduction in supply should increase Ethereum’s value as an asset in the long term. Avi Felman, head of digital asset trading at GoldenTree Asset Management, and Jonah Van Bourg, Cumberland’s global head of trading, spoke to Blockworks on the 1000x podcast about their evolving investment thesis for Ethereum.\n\n“Even though 16 gwei is neutral gas levels for Ethereum,” Van Bourg says, “we’re consistently averaging 50 to 150 gwei.” As a result, ETH is highly deflationary at the moment, he says.\n\n“And even if it does eventually die down,” he says, “the ETH that’s being burned as a result of this activity is never coming back.”\n\nVan Bourg asks Felman, “What does it mean for price, and what does it mean for supply and demand of block space? Is there an investment thesis there?”\n\nEIP-1559 opened the monetary door\n\nFelman says the “best thing” Ethereum ever did for itself was the implementation of EIP-1559, which made ETH as an asset more attractive for investment.\n\n“It opened the door for so much institutional capital to come into this space,” he says.\n\n“I gave a talk last week at a conference that was filled with a lot of pension fund allocators, a lot of institutional allocators. I got an obscene amount of questions on it,” Felman says.\n\n“My job,” he says, was to “teach these guys about what crypto is, cuz these guys knew, when I say nothing, I mean literally nothing, about crypto.”\n\nFelman suggests Ethereum fee burns behave like traditional finance stock buybacks. Just as a company can buy back their own equity to indirectly increase value for shareholders, a fee burn can indirectly drive price action for anyone holding ETH. “If ETH annualizes out to $5 billion a year in burn fees, that’s a pretty substantial ‘buyback,’ right?”\n\n“And this is all during a bear market,” he adds.\n\n“That really hit home for a lot of people.”\n\nEthereum stands apart from other layer-1 protocols because of this formula, Felman says.\n\nOther layer-1s like Solana, he says, do not generate fees in the same way — and, importantly, do not burn fees to reduce supply. Alternative layer-1s as such do not “generate revenue for their shareholders in the same way that Ethereum does,” so “allocators are just way less likely to come in and buy it.”\n\n“Because all eyes are on Ethereum, because that’s where the speculative money is, because that’s where the market participants are, they’re able to charge those fees,” he says.\n\nFelman compares the current attractiveness of Ethereum to the appeal of living in New York. “Yes, Manhattan’s expensive, but it’s expensive for a reason — because everybody’s there, and everybody that you want to be around is already there.”\n\nAnd the beauty of proof of stake is that all of those fees that are burned and all the fees that are generated, Felman says, “are now paid back to owners of the asset.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzIyODI1L3ZpdGFsaWstYnV0ZXJpbi1uZXQtd29ydGgv0gFBaHR0cDovL2FtcC5jb2luY29kZXguY29tL2FydGljbGUvMjI4MjUvdml0YWxpay1idXRlcmluLW5ldC13b3J0aC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Net Worth 2023: How Rich Is the Founder of Ethereum? - CoinCodex",
        "content": "Ethereum co-founder Vitalik Buterin has an estimated net worth of more than $400 million, which takes into account one of his publicly known crypto wallets. However, Vitalik Buterin’s net worth could be much higher, as his investments and other crypto holdings are not publicly known.\n\nWho is Vitalik Buterin?\n\nVitalik Buterin is a Russian-Canadian computer programmer best known as a co-founder of the Ethereum network. Image source: Michael Ciaglo/Getty Images\n\nVitalik Buterin is a co-founder of Ethereum and one of the leading figures in the cryptocurrency and blockchain industry. He was born in 1994 in Russia, but spent most of his early life in Canada. Buterin developed an interest in Bitcoin at a young age and became involved in the cryptocurrency community while still in high school. In 2011 he co-founded Bitcoin Magazine, which has often been referred to as the first serious crypto publication.\n\nIn the 2013 whitepaper – called A Peer-to-Peer Electronic Cash System – he proposed the creation of Ethereum, a decentralized platform that would allow for the creation of smart contracts and decentralized applications (dApps).\n\nButerin's vision for the Ethereum blockchain was to create a decentralized platform that would allow developers to build and deploy dApps on top of it. He believed that this would allow for greater transparency and security, as well as the ability to build applications that were not controlled by any single entity. The Ethereum team raised 31,500 BTC in their ICO, and the mainnet officially launched in 2015. It has since become one of the leading blockchain platforms in the world, with a market capitalization of roughly $150 billion as of December 2022.\n\nButerin is a highly influential figure in the cryptocurrency and blockchain community and is frequently sought out for his insights and opinions on the industry. He has received numerous awards and accolades for his work, including the World Technology Award for Information Technology in 2014 and the Peter Thiel Fellowship in 2014. Buterin has also been recognized as one of the top 100 most influential people in the world by Time Magazine.\n\nWhat is Vitalik Buterin's net worth in 2023? Examining the Ethereum founder’s crypto wallet\n\nVitalik Buterin’s crypto wallet.\n\nVitalik Buterin has a crypto wallet that holds $440,259,570 in different types of coins and assets, as of May 17, 2023. There are also 4,163 NFTs in the wallet, although their exact value is unknown.\n\nETH is the only significant crypto holding in Vitalik Buterin’s wallet.\n\nIn total, Buterin’s wallet has 682 different types of coins and tokens. The vast majority of the wallet’s total funds is in Ethereum (ETH), with over $440 million.\n\nCryptocurrency Quantity Value in USD % of Tot. Assets Ethereum 244,001 ETH $440,282,744 ~99.9% 0xBitcoin 210,050 0xBTC $23,380 ~0.01% yfarm.finance 25 YFM $1,552 ~0.0004% Jetcoin 100,000 JET $261 ~0.0003% Pomi 2,000,000,000 POMI $120 ~0.0003%\n\nThe reason for the vast number of different types of digital currencies lies in the fact that random crypto holders are sending crypto funds to Buterin’s publicly known wallet address. This explains extremely low holdings for certain tokens, like less than one penny of Constitution DAO, or a couple of dollars of Meta Doge, for instance.\n\nAs mentioned earlier, pinpointing Vitalik Buterin’s net worth is virtually impossible due to the nature of private investments. However, an interesting exchange that happened on social media in November seems to suggest that Buterin’s crypto wallet holdings and real fortune seem to be aligned.\n\n$1b is still much more than I have — vitalik.eth (@VitalikButerin) November 9, 2022\n\nIn the immediate collapse of FTX, a Twitter user pointed out that Sam Bankman-Fried’s networth plunged to $1 billion, to which Buterin responded: “$1b is still much more than I have.”\n\nHow much Ethereum (ETH) does Vitalik have?\n\nButerin has 244,001 ETH in his wallet as of May 17, 2022, worth over $440 million. The highest number of Ethereum in Buterin’s wallet was 325,001 and was recorded in July 2021, per Etherscan data.\n\nVitalik Buterin held as much as $1.5 billion worth of ETH in his wallet last November.\n\nThe recent crypto downturn has had a notably negative impact on Vitalik’s net worth. At Ethereum’s peak value last November, Buterin had more than $1.5 billion worth of ETH in his cryptocurrency wallet.\n\nVitalik’s crypto ventures\n\nIn addition to Ethereum itself, Vitalik has been involved in a number of blockchain projects. Some of these include the L4 research group, which focuses on the scalability of blockchain technology, and the Plasma Group, which is working on ways to improve the scalability and security of Ethereum.\n\nButerin is also involved in other projects and initiatives, such as the Ethereum Foundation, which supports the development of Ethereum, and the Zcash Foundation, which supports the development of the Zcash (ZEC) privacy-focused cryptocurrency. On the whole, Buterin is a major contributor to the blockchain industry and is an advocate of decentralization, smart contracts, and open-source code.\n\nFinal thoughts: Vitalik Buterin controls the 31st-largest ETH address\n\nButerin is a well-known figure in the crypto space and is respected for his technical and philosophical contributions to the industry. He is widely regarded as one of the leading voices in the industry and his direct and deep involvement with Ethereum has made him one of the richest individuals in crypto.\n\nAccording to Etherscan’s list of the largest Ethereum account balances, Buterin is placed number 31st and accounts for roughly 0.203% of all ETH in circulation. This makes him one of the largest individual ETH owners, at least in terms of the amount of funds deposited into a single account.\n\nButerin’s crypto wallet holdings closely edge out the net worth of Justin Sun, another prominent crypto figure and the founder of the TRON cryptocurrency.\n\nOn a related note, give our article on Elon Musk's net worth a read if you want to find out how he became the first person in history to lose $200 billion."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzE3L2V0aGVyZXVtLWdhbWluZy1hbHRjb2luLXJhbGxpZXMtYWZ0ZXItcHJvamVjdC1nZXRzLXNwb3QtaW4tYXBwbGUtYXBwLXN0b3JlL9IBcGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzE3L2V0aGVyZXVtLWdhbWluZy1hbHRjb2luLXJhbGxpZXMtYWZ0ZXItcHJvamVjdC1nZXRzLXNwb3QtaW4tYXBwbGUtYXBwLXN0b3JlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Ethereum Gaming Altcoin Rallies After Project Gets Spot in Apple App Store - The Daily Hodl",
        "content": "An Ethereum-based (ETH) gaming altcoin is outshining crypto markets after being listed on tech giant Apple’s app store.\n\nIn a new announcement, prominent gaming metaverse Axie Infinity (AXS) says it’s expanding its global reach by joining forces with Apple to bring over its strategy-based card game to iPhone users in Latin America and East Asia.\n\n“We’re thrilled to announce that Axie Infinity: Origins is now available on iOS in select countries across [Latin America] and Asia!\n\nThis is [an] important step towards a world where anyone, anywhere can experience the magic of Axie on their preferred device. If you live in Argentina, Colombia, Peru, Mexico, Venezuela, Indonesia, Malaysia, or Vietnam, you can now download Origins for iOS from the AppStore.”\n\nThe game features digital pets called axies which players can collect in NFT (non-fungible token) form. According to Axie Infinity, this marks the first time ever that Apple has ever allowed outside NFTs to be usable in the Apple store.\n\n“Significantly, iOS Players will be able to use their NFT axies in this release. We believe this is the first time that Apple has agreed to make an externally-purchased NFT usable on the App Store.”\n\nNews of the collaboration sent AXS flying. The 56th-ranked crypto asset by market cap went from its 24-hour low of $6.76 up to $8.11, a 20% increase. AXS has since retraced and is trading for $7.25 at time of writing, a 6.1% increase during the last day, while most of the crypto markets are trading in the red.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/FOTOGRIN"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGVjcnlwdC5jby8xNDA0MjQvY3J5cHRvLWxlbmRlci1jb21wb3VuZC1kZXBsb3lzLWV0aGVyZXVtLWxheWVyLTItYXJiaXRydW3SAVhodHRwczovL2RlY3J5cHQuY28vMTQwNDI0L2NyeXB0by1sZW5kZXItY29tcG91bmQtZGVwbG95cy1ldGhlcmV1bS1sYXllci0yLWFyYml0cnVtP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Crypto Lender Compound Deploys on Ethereum Layer-2 Arbitrum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s getting cheaper to lend and borrow your idle cryptocurrencies.\n\nCompound Finance has announced that it’s deploying its latest iteration on the popular scaling solution Arbitrum.\n\nOne of the original decentralized finance (DeFi) products, Compound lets users lend and borrow various cryptocurrencies. The platform was also one of the first to experiment with so-called yield farming, distributing its native COMP token to the platform’s users back in 2020. The token currently trades at $34.7 at press time.\n\nAD\n\nAD\n\nArbitrum is the industry’s largest layer-2 scaling solution by total value locked (TVL), per data from L2 Beat. TVL refers to how much money is sloshing around in a given project or chain.\n\nCompared to other popular Ethereum scalers, like Optimism or zkSync, Arbitrum takes the cake at a whopping $5.8 billion.\n\nCompound III is live on @arbitrum! You can now use ARB, GMX, WETH, and WBTC as collateral to borrow USDC on Arbitrum. To view the new market, select Arbitrum from the market selector in the Compound interface or click the link below: https://t.co/uzVunF4qBT pic.twitter.com/DuBUqzpHWl — Compound Labs (@compoundfinance) May 16, 2023\n\nCompound’s deployment on Arbitrum is limited to just a few cryptocurrencies, such as Ethereum (ETH), Arbitrum, Wrapped Bitcoin (WBTC), and GMX (the token powering the eponymously-named decentralized exchange).\n\nThat’s because the project’s latest iteration, called V3, is optimized to manage risk by reducing the amount of long-tail crypto assets that can be lent and borrowed.\n\nAD\n\nAD\n\nEthereum layer-2 wars heat up\n\nThis year has turned into something of a layer-2 season with the launch of various governance tokens, and the first instance of zero knowledge-powered rollup solutions entering the scene.\n\nCompared to “optimistic” rollup solutions, like those on offer from Arbitrum and Optimism, zk-rollups leverage a much more complex bit of cryptography. Members of this market niche include Starknet, Polygon’s zkEVM, and zkSync. The collective TVL for just those three projects is $320 million.\n\nBoth solutions leverage rollups, which batch transactions off of the Ethereum mainnet (hence the term layer-2) and then convert those batched transactions into a small piece of data.\n\nThis smaller piece of data, called a proof, is what Ethereum ultimately validates. In this way, the mainnet remains relatively uncongested, keeping gas prices on the network low."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1wYXltZW50LWdpYW50LXZpc2EtZGVwbG95cy1maXJzdC1wYXltYXN0ZXItc21hcnQtY29udHJhY3Qtb24tZXRoLXRlc3RuZXTSAWVodHRwczovL3UudG9kYXkvZXRoZXJldW0tcGF5bWVudC1naWFudC12aXNhLWRlcGxveXMtZmlyc3QtcGF5bWFzdGVyLXNtYXJ0LWNvbnRyYWN0LW9uLWV0aC10ZXN0bmV0P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Ethereum: Payment Giant Visa Deploys First Paymaster Smart Contract on ETH Testnet - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nCuy Sheffield, head of crypto at payment giant Visa, made known on Twitter the deployment of Visa's first paymaster smart contract on the ETH Goerli testnet. This comes as Visa continues to research and experiment with account abstraction and ERC-4337.\n\nAdvertisement\n\n\"Excited to see Visa deploy our first paymaster smart contract on the testnet as we continue to research and experiment with account abstraction and ERC-4337,\" Sheffield tweeted.\n\nExcited to see Visa deploy our first paymaster smart contract on testnet as we continue to research and experiment with account abstraction and ERC-4337https://t.co/JJNWH2W2Ki https://t.co/RLRDx4yPXS — Cuy Sheffield (@cuysheffield) May 17, 2023\n\nRaj Parekh, CEO of Portal and previously at Visa Crypto, is excited about the recent advancement, saying: \"A Visa-powered paymaster could be a large driver of growth for the ecosystem.\"\n\nVisa previously proposed a system known as \"account abstraction,\" or AA, wherein smart contracts can be used to enable automated programmable payments on Ethereum.\n\nVisa publishes experiment findings\n\nVisa has published a report on its experiments with ERC4337 (Account Abstraction). On March 1, 2023, ERC-4337 was rolled out to the Ethereum mainnet, adding the ability for smart contracts to transact on behalf of the user.\n\nIn this experiment, Visa put together two prototypes that demonstrate potential use cases of a new Paymaster flow: first, using the Paymaster to facilitate the use of ERC20 tokens to pay for gas fees, and second, completely covering the gas fees for a transaction.\n\nIn the second experiment, a paymaster contract was setup that completely covers the gas fees for user txns. In their sample implementation, the user must be whitelisted to be sponsored (L30).\n\n\n\nContract link: https://t.co/NdH0xE2oLt. pic.twitter.com/rGaASN7P5s — cygaar (@0xCygaar) May 17, 2023\n\nIn line with this, the Visa team deployed experimental Visa Paymaster contracts on Ethereum's Goerli Testnet.\n\nIt demonstrated paying with ERC-20 tokens using ERC-4337 Paymaster via the first Visa Paymaster contract, wherein it explored whether a user can pay transaction fees with alternative tokens, such as a dollar stablecoin or, in the future, even a Central Bank Digital Currency (CBDC).\n\nAnother Visa Paymaster contract was deployed, which completely sponsors transaction fees per the second use case.\n\nIn a blog post, Visa explains its current experiment with account abstraction, intending to seek out how the current AA paradigm on Ethereum offers creative solutions for dealing with transaction fees. Can users pay Ethereum transaction fees with stablecoins or other ERC-20 tokens, or not pay them at all?\n\nIt believes the findings of its experiment may help further mainstream crypto adoption."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vd2l0aC1ldGgtcmVtYWluaW5nLWRvbWluYW50LWRvZXMtZXRjLWhhdmUtYS1mdXR1cmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "With ETH Remaining Dominant, Does ETC Have a Future? - Securities.io",
        "content": "Currently, the crypto industry is grappling with regulatory issues, with the US cracking down on crypto and the Securities and Exchange Commission (SEC) not wanting to clarify its stance on crypto regulations while the UK is pushing for crypto to be classified as gambling.\n\nWhile addressing these local issues, a more expansive situation unfolds. On a macroeconomic scale, the US government is anticipated to run out of cash on June 1. Paradoxically, this looming reality is predicted to bolster risk assets. In tandem with this broad economic context, the cryptocurrency market is experiencing a resurgence. The market capitalization has increased by 1.2%, pushing the total value up to $1.18 trillion, indicating a positive response to these macroeconomic events.\n\nWhile Bitcoin is trading just above $27,000, the second-largest cryptocurrency, Ethereum, is exchanging hands at $1,826. According to cryptocurrency data provider Kaiko, the correlation between Bitcoin and Ethereum prices has reached its lowest point since 2021, standing at 77%, which can potentially enhance trading activity within BTC and ETH pairs going forward.\n\nAmong altcoins, ETC is also in the green in USD but is in the red against BTC and ETH. Let's take a look at Ethereum Classic and if it has a future!\n\nClick here to learn how to buy Ethereum Classic (ETC) in just four steps.\n\nThe Distinction Between Ethereum & Ethereum Classic\n\nEthereum is a layer 1 blockchain that pioneered smart contracts, the self-executing programs that automatically carry out certain functions when predetermined conditions are met.\n\nFirst proposed in 2013 by Vitalik Buterin, Ethereum was designed to expand the utility of cryptocurrencies by allowing developers to create their own special applications called “decentralized applications,” or dApps.\n\nETH is the native token of the blockchain that is used for sending and receiving value globally without any third-party interference. The token powers the Ethereum ecosystem and is used to pay the gas fees, which refers to the amount of Ether that's needed to perform a certain function on the network, such as creating smart contracts, interacting with dApps, minting NFTs, and sending transactions.\n\nWhen it comes to Ethereum Classic (ETC), it was the result of the Ethereum network experiencing a hard fork in July 2016.\n\nThe original Ethereum blockchain was supposed to die out after the upgrade, but some users disagreed with the hard fork, arguing that immutability is one of the key points of blockchains and transactions shouldn't be reversed.\n\nThis split the chain into two and resulted in the creation of Ethereum Classic. When the separation first happened, those who held ETH at the time received the exact same amount of ETC tokens in their wallets for free.\n\nThe old chain, or Ethereum Classic, executed a number of upgrades to adopt a deflationary monetary policy with a hard cap of 210 million on the total number of ETC that will be created. This step was taken to make ETC more attractive than Ethereum and supposedly make it a better store of value as its tokens are scarcer. Ethereum, meanwhile, has no limit to how many Ether can enter circulation.\n\nThe key difference between the two has been their goals, specifically, Ethereum Classic's special focus on immutability and ‘Code is Law'.\n\nHowever, much like Ethereum, Ethereum Classic is a decentralized computing system that can run a wide variety of applications. Additionally, ETC is its native currency, which is used to power smart contracts and transactions on its network.\n\nUsers pay gas fees in ETC which is rewarded to miners who solve “proof of work” puzzles. While ETC can be mined using widely-available graphics processors, you'd need ASIC miners and specialized devices designed for crypto mining to be profitable.\n\nClick here if you wish to learn more about this: ETH vs ETC – What You Should Know?\n\nWhat's the Price Doing? ETH & ETC Performance\n\nIn 2014, ETH was launched through an ICO, during which the project raised over $16 million by selling some 50 million ETH tokens at a price of $0.31 per coin.\n\nBetween the period of 2014 and March 2017, the token's price remained range bound between $0.70 and $21. But when the bullish momentum resurfaced in the second half of the year, ETH price spiked above $100 for the very first time. In June 2017, Ether went to hit $414 before correcting only for the bullish momentum to regain strength about five months later that not only sent ETH's price to $1,418 but elevated almost every crypto token to new highs.\n\nThree years later, ETH retested its previous all-time high (ATH) price only for Eth's price to more than triple to set a new ATH of $4,880. Currently, the $220 billion market cap ETH is down 62.57% from this peak but up 52.33% in 2023 so far.\n\nIn contrast, ETC's price surged to a peak of $42 during the 2017 bull run before crashing to a low of $3 during the crypto-wide bear market. Amidst the bull market of 2021, ETC's price soared to a new peak of $167 but has since lost almost 89% of its value. ETC is only up 17.76% YTD.\n\nWhile ETC has managed to rally some against USD, it is struggling against other cryptos. ETC is down 1.40% against ETH and 1.34% against BTC in the past year, while ETH is up in the green by 0.05% against BTC during the same period.\n\nAs of writing, the 27th largest crypto with a $2.6 billion market cap, ETC, is trading at $18.62 while managing about $69 million in 24-hour trading volume compared to the $6.6 bln volume recorded by Ethereum during this period.\n\nWhile up 1.8% in the past 24 hours, the ETC price is down by over 15% in the past month and more than 12% in the past year. For ETC to continue seeing bulls, the price must stay above the $15 support. For now, ETC's price seems to be consolidating between $18 and $25 and could break on either side.\n\nThe token, however, has resistance near the 200-day EMA, reflecting the downward trend. More importantly, the volume of the cryptocurrency is decreasing, and fewer participants are active.\n\nClick here to learn all about investing in Ethereum (ETH).\n\nETH Continues to Improve, While ETC is Stagnant\n\nEthereum constantly goes through upgrades to make it more efficient. Ethereum 2.0, also known as “Serenity,” is a major upgrade that aims to make it faster and more scalable by migrating the network from proof-of-work (PoW) to proof-of-stake (PoS) consensus mechanisms.\n\nIn Dec. 2020, by launching Beacon Chain, Ethereum completed Phase 0 of ETH 2.0, which introduced staking to the network. The network users lock up their coins to become validators instead of using expensive, energy-intensive mining equipment.\n\nEach staker needs to lock up 32 ETH, or they can join a staking pool to combine their Ether with others to participate in creating new blocks on the Ethereum PoS blockchain.\n\nBeacon Chain was launched separately from the Ethereum blockchain, that's also responsible for transaction verification, staking rewards, and managing new Ethereum blockchains called “shard chains.”\n\nOn Sept. 15, 2022, Ethereum executed The Merge, marking the completion of its transition to the PoS system. Then in April 2023, with the Shapella upgrade, the network finally allowed for the unlocking of staked Ether.\n\nNext in line for Ethereum development is sharding, which creates multiple mini-blockchains. After this, further tweaks will be made to enhance the network's security.\n\nRecently, Ethereum reached a new milestone by locking away more than 20.5 million ETH, worth $37.4 billion, amidst the recent withdrawals. In addition to 18.28% of ETH supply being locked, a portion of gas fees is also being burned daily, which together makes ETH a deflationary asset.\n\nWith Ethereum's increasing popularity and adoption, the demand for ETH will likely rise while its supply continues to decline. This can potentially drive up ETH's price.\n\nOn the other hand, Ethereum Classic has no such plans to migrate to the PoS system and intends to keep traditional mining on its own blockchain. However, Ethereum Classic hasn't stopped its attempts to grow its network and join the latest trends of DeFi and NFT.\n\nSeveral projects have built on Ethereum Classic, namely Wrapped ETC, TurbineSwap, ghostNFT, Shiba Classic, ETCPlanets, SHP, Billionaire Boys Classic, ClassicHeroes, MVRSWood – Become Metaverse Degen Royalty, Matrixport, SoyFinance, Fusion, Nova USD Stablecoin, MonkeyDoo, ClassicDAO, ETCswap, Multichain, CoinRabbit, The Man Who Sold The World Metaverse, Canonical Wrapped Ether, Classic Rewards, Nft List, Lazy, ETC Bit Pixel, MoonLama, HENS, Token Factory, SwapCat, ETCZunks, and ETC HODL Contract.\n\nHowever, ETC's development and usage activity is nowhere near Ethereum, the most used blockchain and home to billions of dollars in assets.\n\nAccording to DeFi Llama, Ethereum Classic has less than $240k in total value locked (TVL), down from $1 million in August 2022, with HebeSwap accounting for over 94% of it. But ETC's TVL is immensely dwarfed by Ethreum's impressive $27.22 billion TVL, reflecting just how far behind the network is in the DeFi race.\n\nWhat Does the Future Hold?\n\nEthereum is a clear winner as Ethereum Classic has struggled to compete with Ethereum in every facet, be it market capitalization, developers, and network security since its creation.\n\nOn top of it all, throughout its history, Ethereum Classic has been subject to numerous “51% attacks,” also known as a double-spend attack. In such an attack, malicious actors control a majority of the mining power and, as a result, can spend coins they didn't actually own.\n\nWhile Ethereum Classic doesn't really have a thriving community, Barry Silbert, the CEO of Digital Currency Group, who was an early driving force behind ETC following the initial split, announced its plans to buy $50 million in shares of Grayscale's Ethereum Classic Trust (ETCG) in 2021. Currently, there are $218.6 million in assets under management (AUM) in the trust.\n\nDespite this, the future of Ethereum Classic (ETC) is uncertain due to the continued dominance of Ethereum (ETH). While ETC has a small community and offers a similar blockchain technology, it faces challenges in terms of market adoption and developer support.\n\nWith its larger network effects, extensive ecosystem, and ongoing development, ETH remains the preferred choice for most projects and investors. ETC's future depends on its ability to differentiate itself and attract users and developers, but it may struggle to compete effectively against ETH's established position in the market, as seen over the past many years.\n\nClick here to learn how to buy Ethereum (ETH) in just four steps."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZmluYW5jaWFsaXQubmV0L2Jsb2cvZmluYW5jaWFsLzIwMjMtZ29vZC10aW1lLWJ1eS1ldGhlcmV1bS1hbmQtaG93LWRvLWludmVzdG9ycy1mZWVsLWFib3V0LWl00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Is 2023 a good time to buy Ethereum, and how do investors feel about it? - Financial IT",
        "content": "Is 2023 a good time to buy Ethereum, and how do investors feel about it?\n\nCynthia Madison, at Content Creator\n\nCynthia Madison, at Content Creator\n\n18.05.2023 12:00 pm #Financial\n\nEthereum (ETH), the second largest cryptocurrency by market capitalisation after Bitcoin, accounts for almost 20% of the $1.1 trillion global crypto market, making it one of the safest long-term bets if you are looking to diversify your portfolio with digital currency. While last year was defined by market turbulence and 2023 is no short of political developments, economic events, and other unforeseen occurrences, jumping off the plane and panic selling or making irreversible changes to an investment portfolio is not the go-to method to prevent losses among seasoned investors. Historically, markets do eventually bounce back after downturns, meaning that those who overreacted and sold their assets can't benefit from market rebounds.\n\nBefore discovering where Ethereum is going in 2023 and what events are going to bring positive media exposure, it's worth mentioning last year's highlights. Many cryptocurrency owners were caught off-guard several times in 2022, more precisely when FTX filed for bankruptcy and Luna Crash collapsed and rushed to sell their assets to recover some of the money invested. 2023, however, started on a positive note with cryptocurrencies prices surging, and following a period of downturns and dips, Ethereum and other cryptocurrencies are finally witnessing a bullish momentum. Prices might recover slowly but hopefully surely, which is why it would make more sense now than three months ago to buy Ethereum .\n\nDespite the turbulence experienced last year in the cryptocurrency market, Ethereum remains one of the safest long-term bets for investors willing to weather the ups and downs of this volatile world. Let's discover the most important aspects impacting Ethereum this year so you can make informed decisions if you want to buy the dip.\n\nPhoto source: https://unsplash.com/photos/L2QB-rG5NM0\n\nIs it a good time to invest in Ethereum?\n\nAfter a bad year for the cryptocurrency market, 2023 started more positively. Ethereum prices have reached new highs in recent weeks, and coin issuance is once again deflationary, with 66,000 ETH reducing supply. This is due to the switch from Proof-of-Stake to Proof-of-Work in September 2022, when the long-awaited Merge upgrade is finally released. Owing to the new consensus mechanism, a fraction of Ethereum is being burned, turning it into a deflationary asset once again, after fluctuating between deflationary and inflationary over the years. This is good news for crypto enthusiasts looking for scarce virtual assets.\n\nA \"deflationary\" currency is one that sees its supply decrease over time, contrasting \"inflationary\" currencies, where the supply grows. Notably, deflationary currencies appeal to cryptocurrency enthusiasts, as they believe the scarcity will increase the value of their assets. Some cryptocurrencies' supply decreases over time, meaning their value grows if demand stays constant. Binance Coin (BNB), for instance, burns tokens quarterly to limit the supply and ensure a maximum of 200.000 coins. However, owing to burning events, the current BNB supply is lower.\n\nWhy are investors optimistic about Ethereum?\n\nSeveral things impact a cryptocurrency's price and must be considered when looking to add digital coins to your investment portfolio. Among the most important are the news and media exposure surrounding it. Whether now is a good time to buy the dip is debatable and depends on the investor. What's for sure is that Ethereum has gained quite a lot of good media exposure owing to the past upgrades that followed the highly anticipated merger of the Ethereum Mainnet and the Beacon Chain PoS system. Nevertheless, the impact of the Merge was not necessarily reflected in the cryptocurrency's value, but in a better global perception of the network, as it reduced energy consumption by more than 99.99%, according to Ethereum.org.\n\nThe Shanghai Upgrade, the next major event for Ethereum, will take place around April 12 and finally enable users to withdraw their staked ETH. Significant improvements like these may benefit the token's value thanks to improved scalability and efficiency for the network. Investors believe that the Ethereum price, which has recently risen, will skyrocket following this long-awaited upgrade.\n\nHow to approach Ethereum investments in the next period?\n\nThere are several types of investors, including those seeking to take advantage of market crashes to make investments at bargain prices, like billionaire Warren Buffet. On the other hand, sceptics are pessimistic about the revival of an asset when its value is low, so they choose to stay away from it.\n\nWhile it's true that Ethereum has yet to reach its all-time high of November 2021, this isn't a reflection of the future. This token, just like its counterparts, went through challenging situations. Even though nothing can guarantee that they ended just because 2023 started on a positive note, buying at a discount can be a smart move for those believing in the potential of digital currency.\n\nWhether Ethereum will experience similar returns again is uncertain. But since its price is two and a half times lower than its 2021 peak, investing in it at a bargain price is worth considering. Even if it doesn't see momentous returns, approaching its all-time high again could bring significant yield.\n\nFinal take\n\nDespite the turbulence experienced last year in the cryptocurrency market and the whole financial system, Ethereum remains one of the safest long-term bets for investors looking to diversify their investment portfolio with cryptocurrency. Those willing to weather the ups and downs of this volatile world may reap the benefits of patience in the bear market. However, nothing and no one can guarantee financial returns, especially in such volatile markets. Plus, investing in cryptocurrency requires thorough research on cryptocurrency options and a deep understanding of your long-term goals and risk tolerance. To establish the latter, consider your behavioural tendencies and what you would do when seeing your asset's value drop.\n\nEthereum has been having a good year so far, but only time can tell where it will be in the future. Ensure you are informed when you start investing in cryptocurrency, use common sense, and only spend money you can afford to lose."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9zb2xhbmEtc29sLXdlbGNvbWVzLWV0aGVyZXVtLWJpdGNvaW4tdXNlcnMtc2Vla2luZy1yZWZ1Z2UtZnJvbS1oaWdoLWZlZXMv0gFjaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3NvbGFuYS1zb2wtd2VsY29tZXMtZXRoZXJldW0tYml0Y29pbi11c2Vycy1zZWVraW5nLXJlZnVnZS1mcm9tLWhpZ2gtZmVlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Ethereum, Bitcoin users rush to Solana [SOL] as they seek… - AMBCrypto News",
        "content": "High transaction fees on Ethereum and Bitcoin have led to increased network activity on Solana.\n\nWhile network activity sees growth, other ecosystem metrics experience a decline.\n\nSolana saw an influx of new users as high transaction fees on Ethereum [ETH] and Bitcoin[BTC] drove new demand to the Layer 1 (L1) network, data from The Block showed.\n\nRead Solana’s [SOL] Price Prediction 2023-24\n\nOn the Ethereum network, the meme coin craze led by the unprecedented rally in the price, trading volume, and market capitalization of frog-themed Pepe (PEPE) situated a spike in transaction fees on the chain.\n\nAccording to data from Messari, average transaction fees rallied to a high of $27.61 on 9 May, its highest level since May 2022.\n\nAs for the Bitcoin network, the introduction of Ordinals and BRC-20 tokens led to a significant increase in network activity and fees on the chain.\n\nData from Messari further showed that the average transaction fees on the chain went as high as $30 on 8 May, its highest since April 2021.\n\nSOL emerges as the winner\n\nIntending to find blockchain networks that offer lower transaction fees, users have been moving away from Ethereum and Bitcoin.\n\nSolana emerged as a top contender in this quest, garnering increased attention and leading to a rise in the number of active addresses on its network. Data from The Block revealed a 113% increment in the count of daily active addresses on the chain.\n\nAssessed on a month-over-month (MoM) basis, Solana recorded a total of 7.72 million active addresses in April. Interestingly, with about two weeks left to go in May, the chain has already seen 7 million active addresses.\n\nAdditionally, data from The Block showed that new address count on the chain has grown significantly since the end of April.\n\nNew users flock in\n\nIn May, Solana witnessed the creation of 4.19 million new addresses, surpassing the count of 3.76 million new addresses that joined the network in April.\n\nThis surge in new address creation on the L1 network highlights the growing adoption of the platform amid high transaction fees on the Ethereum and Bitcoin networks.\n\nHowever, while Solana’s network activity has experienced growth since the end of April, data from Artemis revealed a decline in other ecosystem metrics.\n\nFor example, according to the on-chain data, the network’s total value locked (TVL) was on a downtrend since 19 April. At $269.78 million at press time, it has since fallen by 8%.\n\nRealistic or not, here’s SOL’s market cap in BTC terms\n\nLikewise, the decentralized exchanges (DEXes) housed within the L1 network suffered a drop in transaction volume since the month started. Per data from Artemis, DEX volume on Solana has plummeted by 66% since the beginning of May.\n\nRegarding the chain’s native coin SOL, trading at $20.73 at press time, its value declined by double digits (17%) in the last month."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA1LzE3L3R5cGVzLW9mLWNyeXB0b3MtdGhhdC1jb3VsZC1vdXRwZXJmb3JtLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "The 3 Types of Cryptos That Could Outperform Bitcoin This Year - The Motley Fool",
        "content": "Even with its recent pullback from the $30,000 price level, Bitcoin remains one of the top-performing cryptos of 2023. It is up 65% this year, and it's hard to find any large market-cap coins that can top this.\n\nBut savvy investors know it's best not to put all your eggs into one basket. If you are looking to diversify your crypto portfolio, here are three types of digital coins that could outperform Bitcoin this year.\n\n1. Potential Ethereum replacements\n\nWhile Ethereum (CRYPTO: ETH) continues to be the dominant Layer 1 blockchain in the crypto world, there are plenty of up-and-comers that hope to dethrone it. Three rivals that stand out are Solana, Aptos, and Fantom. Both Solana and Aptos are up more than 100% this year, and Fantom is not too far behind, at 93%.\n\nJudging from their performance, investors are not entirely convinced that Ethereum is going to retain its dominant role in so many key blockchain sectors, ranging from non-fungible tokens (NFTs) to decentralized finance (DeFi). While The Merge helped to improve the speed, efficiency, and scalability of the core Ethereum blockchain, these blockchain rivals are still much faster and cheaper. That has huge implications in areas such as DeFi, where users are looking for near-zero fees and near-instantaneous settlement of transactions.\n\nOf these Ethereum rivals, my personal pick is Solana, which has been out-innovating Ethereum of late. For example, Solana recently launched the first-ever mobile phone for a major blockchain network (the Saga) and has been exploring new initiatives to leverage all the hype and excitement around artificial intelligence, including a new plug-in for ChatGPT. For Solana to outperform Bitcoin, it will need to show that mobile crypto and crypto AI are sustainable, long-term growth catalysts.\n\n2. Scaling solutions for Ethereum\n\nIf you are looking for a less risky way to outperform Bitcoin, then blockchain scaling solutions for Ethereum could be the answer. Simply stated, these scaling solutions sit on top of the main blockchain and help Ethereum process transactions faster and cheaper.\n\nFor that reason, they are referred to as Layer 2 solutions (i.e., they are the second layer on top of the base Ethereum layer). Each scaling solution uses its own form of proprietary technology to accomplish its goals, so it can sometimes be difficult to differentiate among these different solutions.\n\nIf you buy into the idea that these Layer 2 coins are essential to the future success of Ethereum, then there are a few key prospects to target, including Immutable, Optimism, and Polygon. The name that's probably most familiar to investors will be Polygon, which has been making waves recently with new NFT initiatives, including a high-profile partnership with Nike to create an entirely new NFT marketplace for digital sneakers. However, if you are craving maximum upside potential, a better pick might be Immutable, which is up a mind-blowing 99% this year.\n\n3. Cryptos that help people stake on Ethereum\n\nLastly, there are a growing number of cryptos that help people stake on Ethereum. Now that Ethereum has transformed from a proof-of-work blockchain into proof of stake, this is tremendously important. Crypto staking is suddenly big business, and investors are always looking for ways to earn the highest staking rewards possible.\n\nThe two big names to watch here are Lido DAO, which is up 95% this year, and Rocket Pool, which is up 157% this year. Both emerged from relative obscurity after The Merge due to the popularity of staking, and both now currently rank in the Top 50 cryptos in terms of market capitalization.\n\nWhich of these is the best buy?\n\nThe common theme of all three categories of cryptos detailed above is that they somehow involve Ethereum. The first category, for example, includes all those capable of displacing Ethereum one day as the preeminent Layer 1 blockchain. The second category includes all digital currencies helping Ethereum scale bigger and faster. And the third category includes all cryptos that involve staking on Ethereum.\n\nSo if the prospect of picking winners and losers in niche areas of the blockchain space seems too daunting, the classic buy-and-hold crypto is Ethereum, which is up a not-too-shabby 52% this year.\n\nBut if you're looking for a little extra turbocharging for your portfolio, then my best picks would be Solana and Polygon. I'm long-term bullish on both of them, and I still regard both as best-in-class for their respective blockchain categories."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTcvZXRoZXJldW0tc3Rha2luZy1uZWVkcy1pdHMtaG9uZXN0LWxpYm9yL9IBWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTcvZXRoZXJldW0tc3Rha2luZy1uZWVkcy1pdHMtaG9uZXN0LWxpYm9yL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Ethereum Staking Needs Its (Honest) LIBOR - CoinDesk",
        "content": "A new staking rate could unlock the next generation of financial products while serving as a building block of Ethereum’s monetary policy. As such, CESR represents an important development in the evolution of the Ethereum ecosystem and a new frontier for innovation in the world of decentralized finance and beyond."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZGVjcnlwdC5jby8xNDA1OTkvbmZ0LWxlbmRpbmctcGxhdGZvcm0tYmxlbmQtc3VyZ2VzLXBhc3QtMTAwMDAwLWV0aGVyZXVtLXRvdGFsLXZvbHVtZdIBY2h0dHBzOi8vZGVjcnlwdC5jby8xNDA1OTkvbmZ0LWxlbmRpbmctcGxhdGZvcm0tYmxlbmQtc3VyZ2VzLXBhc3QtMTAwMDAwLWV0aGVyZXVtLXRvdGFsLXZvbHVtZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "NFT Lending Platform Blend Surges Past 100,000 Ethereum in Total Volume - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nNFT marketplace Blur is growing by leaps and bounds.\n\nWith the launch of Blend, Blur’s new lending platform, it’s hit yet another milestone.\n\nData per Dune, now shows that Blend has facilitated more than 100,000 ETH in total volume, or roughly $181 million, just 17 days since its launch.\n\nAD\n\nAD\n\nBlend lets users take out Ethereum loans by putting their NFTs up as collateral. They can then use this loan to purchase new NFTs on the Blur marketplace. In return, liquidity providers receive interest, a mechanism that’s spawned the “NFTfi” niche in crypto.\n\nTotal volume on Blend in ETH. Source: Dune .\n\nThough the project racked up more than 3,000 loans from 900 unique lenders, adding Bored Apes Yacht Club (BAYC) and Mutant Ape Yacht Clube (MAYC) collections on Monday fueled further enthusiasm among NFT collectors.\n\nThese collections were added to the four collections previously available, Azuki, Wrapped Cryptopunks, DeGods, and Miladys.\n\nBAYC and MAYC accounted for a total volume of 2,267 ETH on day one. On Wednesday, BAYC was the third-most traded collection on the platform with a volume of 3,082 ETH, just behind Azuki (4,616 ETH) and Wrapped Cryptopunks (2,260 ETH).\n\nAzuki remains the top collection in total volume, having exceeded 50,000 ETH, which is nearly half of the total volume since the service was created.\n\nAD\n\nAD\n\nCurrently, Blend does not take any fees from either borrowers or lenders. However, Blur has indicated that token holders could vote to implement fees after a 180-day period.\n\nBlur’s bumpy start\n\nLaunched just last fall, Blur quickly became the most popular NFT marketplace, representing nearly 59% of the total NFT transaction volume to date.\n\nHowever, some suspect the platform of harboring wash trading operations, especially amid the platform’s token launch.\n\nAccording to analyst Hildhobby, Blur indeed only accounted for 14,575 traders, compared to 46,353 on Opensea.\n\nAt the end of February, CryptoSlam, a platform for tracking NFT sales, announced that it would remove $577 million worth of Blur trades from its data due to \"market manipulation.\" The platform also said that it will filter future Blur trades on its platform through an updated algorithm that excludes what it sees as suspicious sales.\n\nNevertheless, the success of Blend only strengthens Blur's position, which seems set to establish itself in the long run as a major player in the NFT ecosystem."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1nZW5lc2lzLXdoYWxlLWVtZXJnZXPSATJodHRwczovL3UudG9kYXkvZXRoZXJldW0tZ2VuZXNpcy13aGFsZS1lbWVyZ2VzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Ethereum Genesis Whale Emerges - U.Today",
        "content": "In a surprising move, an Ethereum \"whale\" has come back to life after being dormant for over two years. The large investor, identified as an early participant in Ethereum's initial coin offering (ICO), staked 4,032 ETH, equivalent to approximately $7.4 million, according to data from Lookonchain.\n\nAdvertisement\n\nThis sizeable stake, made just hours ago, marks the whale's first activity in 2.4 years, stirring considerable excitement and speculation within the crypto community.\n\nThe whale, whose address was shared on Lookonchain's Twitter page, was a part of Ethereum's genesis – the network's inception phase when the Ethereum ICO took place.\n\nDuring the ICO, this investor received a staggering 60,000 ETH. Ethereum's genesis event was a public crowdsale that occurred in July and August 2014, where investors purchased ETH in exchange for Bitcoin.\n\nThe whale's Ethereum balance at the time of the tweet was 6.751 ETH, valued at approximately $12,288.33, based on Ethereum's current value. The whale's most recent transaction was recorded about six hours prior, and it's the same transaction in which the 4,032 ETH stake was made.\n\nWhether this activity is indicative of a larger trend among Ethereum ICO participants, or an isolated event, only time will tell."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9sZWFybi9ob3ctdG8tdXNlLWV0aGVyc2Nhbi1hbmQtb3RoZXItYmxvY2tjaGFpbi1leHBsb3JlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "How to Use Etherscan and Other Blockchain Explorers - CoinDesk",
        "content": "Etherscan also allows for the tagging of certain wallets – which is very useful when you need to follow the money. For example, it’s possible to track the wallet that drained balances from FTX accounts shortly after the exchange went bankrupt. You usually can’t see transfers from exchanges, which largely do not process trades on blockchains but instead on internal matching engines. It’s cheaper for exchanges to avoid the blockchain because they do not have to pay gas fees. That said, you can see some interesting information about exchanges, such as how much ETH crypto exchange Kraken holds in one of its wallets."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvY29tcGFueS9jaGF0Z3B0cy1ldGhlcmV1bS1ldGgtcHJpY2UtcHJlZGljdGlvbi1pcy0zNTAwLXdpbGwtaGVkZ2V1cC1oZHVwLWFuZC1zaGliYS1pbnUtc2hpYi1oaXQtMS_SAYMBaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9jb21wYW55L2NoYXRncHRzLWV0aGVyZXVtLWV0aC1wcmljZS1wcmVkaWN0aW9uLWlzLTM1MDAtd2lsbC1oZWRnZXVwLWhkdXAtYW5kLXNoaWJhLWludS1zaGliLWhpdC0xL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "ChatGPT’s Ethereum (ETH) Price Prediction is $3,500, Will HedgeUp (HDUP) and Shiba Inu (SHIB) Hit $1? - NewsBTC",
        "content": "Asking one of the most advanced A.I systems for its analysis on the future price of Ethereum (ETH), ChatGPT predicted a value of $3,500 by the end of 2023. However, the true question is if HedgeUp (HDUP) and Shiba Inu (SHIB) will hit $1 as that would mean a much larger ROI for investors.\n\nThe Bold Ethereum (ETH) Prediction – Is It Reliable?\n\nCan we trust that ChatGPT’s prediction of Ethereum (ETH) at $3,500 by 2023 is reliable? The question remains difficult to answer as the cryptocurrency market is unpredictable and subject to many external factors.\n\nThe success of Ethereum (ETH) is dependent on its network’s ability to progress, its adoption rate, and the demand by investors. It is also important to consider if Ethereum (ETH) can stay ahead of its competitors. Ethereum (ETH) is the second-largest cryptocurrency by market cap so its future success is certainly worth considering.\n\nEthereum (ETH) reaching $3,500 is possible as the ATH has been above that and if a bull run is expected Ethereum (ETH) could reach that price. Ethereum (ETH) recently upgraded and there is a growing demand for the Ethereum network, so the prediction of ChatGPT could be accurate and reliable.\n\nIt is also worth noting that Ethereum (ETH) has already seen an impressive increase in its price over the past few months and could continue to trend upward as more investors buy into cryptocurrencies.\n\nHedgeUp (HDUP) and Shiba Inu (SHIB) – An Analysis By Humans\n\nAlthough it’s interesting to use ChatGPT for price predictions, a more accurate analysis of HedgeUp (HDUP) and Shiba Inu (SHIB) must be done by humans. That’s because HedgeUp (HDUP) and Shiba Inu (SHIB) are unique cryptos that are new to the market and are still in their early stages.\n\nShiba Inu (SHIB) – Meme-Based Momentum?\n\nShiba Inu (SHIB) was created in 2020 and has been gaining a lot of attention recently due to its meme-based marketing campaign and its large community. Shiba Inu (SHIB) is currently trading at $0.000008743. So, Shiba Inu (SHIB) reaching $1 is unlikely. Shiba Inu (SHIB) does not have the fundamentals for sustainable growth. The only way Shiba Inu (SHIB) reaches $1 is if investors get lucky and it skyrockets for no obvious reason.\n\nHedgeUp (HDUP) – An Emerging Hero For Investors\n\nAs a more sound investment opportunity, HedgeUp (HDUP) has the potential to reach $1. This is because the platform is built on blockchain technology and uses NFTs. HedgeUp (HDUP) is also backed by physical alternative assets, like fine art, commodities, and collectibles. These investments are more likely to give consistent returns in the long run.\n\nSo, as early investors of HedgeUp (HDUP), as more people enter the platform, the price could rise dramatically and reach the $1 mark. The 30% presale bonus gives a headstart to early investors, so there could be a lot of growth potential.\n\nFind out more about the HedgeUp (HDUP) presale here:\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vZGFpbHljb2luLmNvbS9iZXN0LWNyb3NzLWNoYWluLWJyaWRnZXMtaW4tY3J5cHRvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Best Cross-Chain Bridges in Crypto - DailyCoin",
        "content": "Cross-chain bridges are an essential instrument in your DeFi toolbox. As the cryptocurrency industry expands at a dizzying rate, being able to shift your funds across different blockchain networks securely helps you explore new ecosystems easily.\n\nDespite what the maxis tell you, no one chain will rule them all. There are hundreds of different networks in the Web3 world, each with its unique identity and decentralized applications.\n\nStaying fixated on just one chain, like Bitcoin (BTC) or Ethereum (ETH), will significantly limit your opportunities within the crypto market. The need for interoperability between networks has never been higher.\n\nWhat exactly are cross-chain bridges, and why should I use them? Are blockchain bridges safe?\n\nIn this article, we’ll explain why bridging between blockchain ecosystems is such a valuable skill and why cross-chain interoperability is so important for the growth of the cryptocurrency industry.\n\nWhat Is a Cross-Chain Bridge?\n\nA cross-chain bridge is a blockchain-based application that allows users to transfer digital assets and data from one network to another. For example, you can bridge ETH tokens from the Ethereum mainnet to the Binance Smart Chain (BSC), which has lower gas fees.\n\nIn the true spirit of DeFi (decentralized finance), crypto bridges are permissionless, meaning anyone with a crypto wallet can access them and transfer tokens without being intercepted by centralized authorities.\n\nMost bridges use a ‘Lock and Release’ function, similar to how wrapped crypto assets like wBTC work.\n\nImagine each blockchain is an island. When you initiate a token transfer, you deposit cryptocurrency onto the bridge from one side. The bridge application locks your deposit into its wide liquidity pool and releases an equal number of the same tokens to your wallet on the destination chain, or new island.\n\nWhile it may sound surprising, the same token can exist simultaneously on multiple networks. An easier way to think of it is to imagine apps in a mobile phone. Underneath the hood are slight differences between the Twitter app on Android and the Twitter app on iOS. However, the average end user isn’t bothered by the technicalities.\n\nWhy Would I Want to Use a Cross-Chain Bridge?\n\nUsing various networks is a great way to learn about blockchain technology and its use cases. While the Ethereum network has far more dApps than other chains, every blockchain has its own thriving ecosystem, with exclusive applications, tokens, and NFTs.\n\nUser experience varies from chain to chain, with some networks being much more affordable than others. For example, the Ethereum blockchain is plagued with scalability issues. A token swap might cost upwards of $50 in transaction fees, while the same swap on Polygon would only cost you a few cents.\n\nBridging tokens to emerging chains is another excellent way to qualify for crypto airdrops. Sending a handful of ETH tokens and interacting with a handful of smart contracts on Arbitrum netted some users thousands of dollars worth of ARBI.\n\nBest Cross-Chain Bridges\n\nNow that you’re clued up on why bridging over to exciting new blockchains is worthwhile pursuit, let’s take a look at some of the best cross-chain bridges in crypto. While there are hundreds of directional bridges and cross-chain swaps, it’s essential to know what to look for.\n\nThe top cross-chain crypto bridges should provide the following:\n\nA good variety of networks and tokens.\n\nSecure transfer of assets.\n\nAn easy-to-use interface.\n\nLet’s see who made the list!\n\n1. Synapse\n\nThe Synapse Bridge is one of the most trusted cross-chain bridges in the crypto space. With a simplified UI that resembles a basic DEX (decentralized exchange) and over one million users, Synapse protocol is a popular choice for first-time bridges.\n\nThe platform offers a wide variety of ERC-20 token standards and EVM-compatible blockchain networks. What’s great about Synapse is that it also supports several popular stablecoins, like USDT and USDC.\n\nSynapse also converts a small percentage of your transfer to the destination chain’s native cryptocurrency. For example, when you bridge to the BSC, a smart contract in the dApp automatically provides you with a small amount of BNB to pay the first few gas fees as you explore the chain.\n\nKey Takeaways\n\nUser-friendly design.\n\nMillions of users.\n\nFast transfer of assets.\n\nOffers staking.\n\nSupported networks: Ethereum, Arbitrum, Avalanche, BNB Chain, Optimism, Polygon, Aurora, Boba, Canto, Cronos, DFK Chain, DogeChain, Fantom, Harmony, Klaytn, Metis, Moonbeam, Moonriver.\n\n2. Portal (Wormhole)\n\nThe Portal bridge is the epitome of interoperability. While most other bridges are limited to transfers between EVM-compatible networks, Portal takes things one step further.\n\nWith Portal, crypto enthusiasts can bridge digital assets between alternative Layer-1 blockchains that don’t use an EVM. These include popular PoS (Proof-of-Stake) chains like Aptos and NEAR. This gives experienced chain-hoppers greater flexibility than other cross-chain bridges and opens immense opportunities.\n\nIf that wasn’t enough, Portal also supports NFT bridging. Like wrapped tokens, tokens can be locked and minted on other chains. A famous example of this was when HGE.SOL, a Solana NFT whale, fractionalized and bridged 50 cryptopunks to the Solana blockchain.\n\nKey Takeaways\n\nSupports transfers between EVM and non-EVM networks.\n\nBridge ERC-721 tokens (NFTs).\n\nSupported networks: Acala, Algorand, Aptos, Arbitrum, Aurora, Avalanche, BNB Chain, Celo, Ethereum, Fantom, Injective, Karura, Klaytn, Moonbeam, NEAR, Oasis, Optimism, Polygon, SUI, Terra, XPLA.\n\n3. Multichain (formerly Anyswap)\n\nPreviously known as Anyswap, Multichain truly lives up to its old name. This cross-chain bridge offers the widest breadth of networks of any application in the crypto space.\n\nWithin Multichain’s spread of 92 different blockchains are the classic chains we all know and love, with a multitude of other networks most people haven’t even heard of.\n\nMultichain also supports NFT wrapping and bridging, as well as cross-chain swaps and staking services. If Multichain had one fault, its user experience is comparatively sluggish and unintuitive.\n\nKey Takeaways\n\nThe crypto industry’s range of integrated networks.\n\nNFT wrapping and bridging.\n\nPopular supported networks: Ethereum, BNB Chain, Polygon, Avalanche, Arbitrum, Fantom, Optimism, Cardano, Solana, Aptos, NEAR, Moonbeam, Cronos, Telos, Fuse, Litecoin, Bitcoin.\n\n4. Polygon Bridge\n\nWhile the Polygon bridge has far fewer integrations than other members of this prestigious list, it brings its own X factor. Designed by Polygon Labs, the Polygon Bridge is explicitly built for products and services within its native ecosystem.\n\nIt enables users to bridge cryptocurrencies like ETH, MATIC, and popular stablecoins between the Ethereum mainnet and the Polygon sidechain. Most importantly, it is the first official application with a bi-directional bridge to the Polygon zkEVM chain.\n\nLike everything built by Polygon Labs, the Polygon Bridge has been designed with simplicity and mass adoption in mind and boasted a beginner-friendly interface.\n\nKey Takeaways\n\nAccessible user interface.\n\nOfficial access to Polygon zkEVM.\n\nSupported networks: Ethereum, Polygon, Polygon zkEVM.\n\n5. Avalanche Bridge\n\nDesigned by AvaLabs and Core, the Avalanche Bridge serves various functions. Not only does it facilitate the transfer of assets between the Avalanche C-Chain and other networks like Bitcoin and Ethereum, but it’s also used internally within the Avalanche ecosystem.\n\nWhat many users don’t understand about Avalanche is that the network is comprised of three separate blockchains, X-Chain, P-Chain, and C-Chain. While most DeFi and NFT enthusiasts are only interested in the C-Chain, blockchain engineers often use the other two chains for development.\n\nAvalanche bridge developers expect to introduce further support for more ERC-20 tokens in the future.\n\nKey Takeaways\n\nOfficial bridge of the Avalanche Ecosystem.\n\nConnects users to internal Avalanche chains.\n\nSupported Chains: Bitcoin, Ethereum, Avalanche C-Chain, and other internal chains.\n\nWhat Happened to Binance Bridge?\n\nUntil recently, the Binance Bridge was one of the industry’s largest and most popular cross-chain bridges. It appears that the Binance Bridge is either currently unavailable or discontinued.\n\nThe most recent publication from Binance mentioning their bridge indicates that an updated V2 bridge was rolled out in March 2020. However, visiting the application encourages users to either transfer tokens internally through the Binance exchange or use an alternative platform.\n\nBinance recommends using AnySwap, which rebranded to Multichain in 2021.\n\nAre Crypto Bridges Safe?\n\nFor all the wonder and excitement that cross-chain bridges bring, there are some risks. Blockchain bridges are notoriously complicated at an architectural level, making them a common target for hacks and exploits. In fact, over $1.4 billion was stolen through crypto bridge hacks in 2022.\n\nBridge hacks are devastating, with some networks never truly recovering from a catastrophic attack. Since hackers drained the Harmony Horizon bridge and disappeared with over $100 million in crypto, the Harmony network has struggled to recapture its former glory.\n\nEven the most popular and reputable bridges are liable to make mistakes, and blockchain security audits always look good until a malicious hacker finds a chink in the code.\n\nTo keep yourself safe in the crypto space and protect your funds, you should always revoke any approvals confirmed in your wallet after using a bridge. This only takes a couple of seconds with sites like Revoke.cash, and might protect you from getting your entire crypto portfolio stolen in a bridge hack.\n\nOn the Flipside\n\nBridging tokens is a great way to explore dApps and NFT collections on different blockchain networks. However, the Web 3 world is plagued with user experience issues, making this a daunting and intimidating task for first-timers.\n\nBeyond that, bridge hacks are the most common exploit in the crypto space, so please revoke token approvals after bridging to protect your wallet’s integrity.\n\nWhy This Matters\n\nThe cryptocurrency industry is growing at a startling pace. The variety of innovative dApps, products, and services in a cross-chain world is staggering and opens a world of opportunity to those willing to explore emerging ecosystems. Many Ethereum NFT maximalists refused to buy DeGods because they couldn’t be bothered bridging to Solana. Today, they’re some of the most valuable NFTs in the market.\n\nFAQs"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLXVzZS1ldGhlcnNjYW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "How to Use Etherscan? - Watcher Guru",
        "content": "Unlocking the Power of Etherscan: A Step-by-Step Guide to Navigating the Platform\n\nAs the popularity of Ethereum continues to grow, so does the need for reliable and efficient tools to manage its transactions. One such tool is Etherscan, a powerful platform that allows users to explore and interact with the Ethereum blockchain in various ways.\n\nIn this step-by-step guide, we’ll take you through the basics of Etherscan, including how it works, how to use it, and how to unlock its full potential for your Ethereum transactions.\n\nSource: CNBC\n\nWhat is Etherscan, and How Does it Work?\n\nEtherscan is a blockchain explorer—a tool that allows users to explore and interact with the Ethereum blockchain. It provides a wide range of features, including the ability to search for transactions, view wallet addresses, and track the progress of smart contracts.\n\nThe platform is a window into the Ethereum network, providing users with a wealth of information about the blockchain and its transactions.\n\nAt its core, Etherscan works by querying the Ethereum network for information and displaying it in an easy-to-understand format. Users can search for transactions, wallet addresses, and smart contracts using a variety of search parameters, including transaction hash, contract address, and block number. Etherscan then retrieves the relevant data from the blockchain and presents it in a way that is easy to understand.\n\nHow Do I Learn to Use Etherscan?\n\nLearning to use Etherscan is relatively simple, and plenty of resources are available to help you get started.\n\nThe first step is to navigate to the Etherscan website and familiarize yourself with the different features and functions. The homepage provides a search bar that allows you to search for transactions, addresses, and contracts.\n\nOne of the best ways to learn how to use Etherscan is to explore the blockchain. Search for transactions and wallet addresses to see how they are recorded on the blockchain, and try to understand the different fields and parameters associated with each transaction.\n\nAnother helpful resource is the Etherscan API, which allows developers to build applications that interact with the Ethereum network. By using the API, developers can retrieve data on the Ethereum blockchain, such as transaction histories and contract information.\n\nSource: Phemex\n\nHow Do I Get My Money?\n\nIf you have Ethereum stored on Etherscan, you can withdraw it to an external wallet using the platform’s “Withdraw” function. To do this, you must have an Ethereum wallet address that you control. Navigate to your wallet on Etherscan and click the “Withdraw” button. Enter the amount of Ethereum you wish to withdraw and the address of your external wallet.\n\nOnce you have confirmed the withdrawal, Etherscan will send the Ethereum to your external wallet. Note that transaction fees may be associated with the withdrawal, which will be deducted from the total amount of Ethereum you receive.\n\nHow do I send ETH using Etherscan?\n\nSending Ethereum using Etherscan is also relatively simple. You must have an Ethereum wallet connected to Etherscan, such as MetaMask, to do this. Once you have connected your wallet, navigate to the “Send Ether and Tokens” page on Etherscan.\n\nInput the recipient’s Ethereum address, desired amount, and gas price to determine transaction speed on the network.\n\nOnce you have confirmed the transaction details, submit the transaction and wait for it to be confirmed on the Ethereum network. You can track the progress of your transaction using the transaction hash, which is a unique identifier for each transaction on the blockchain.\n\nSetting up an Account\n\nTo fully unlock the potential of this tool, it is recommended that you set up an account. This will allow you to save and track your favorite addresses and transactions and receive alerts when new transactions occur on the blockchain.\n\nTo set up an account, navigate to the Etherscan homepage and click the “Sign Up” button. Enter your email address and a secure password, and verify your account by following the instructions in the confirmation email.\n\nAfter setting up your account, explore Etherscan’s features: track smart contracts, view transactions, and monitor gas prices.\n\nUnderstanding the Different Features of Etherscan\n\nFirst, it provides diverse features for users to explore and interact with the Ethereum blockchain. Some of the most important features include the search engine, transaction ID, contract address, wallet address, and smart contracts.\n\nIts search engine lets users find transactions, addresses, and contracts easily. Transaction IDs and contract addresses provide unique identification on the blockchain.\n\nWallet addresses in Etherscan let users check balances and transaction histories for specific Ethereum wallets. Smart contracts are another key feature, enabling developers to build decentralized applications (dApps) on the Ethereum network.\n\nConclusion\n\nThis powerful tool provides users with a wealth of information about the Ethereum blockchain. Mastering Etherscan unveils Ethereum’s inner workings and maximizes transaction potential through insightful understanding.\n\nWhether you are a developer looking to build dApps on the Ethereum network or a casual user looking to explore the blockchain, Etherscan is an essential tool for anyone working with Ethereum. So why not try it today and see for yourself what this powerful platform can do?"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiImh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vZXJjLTY1NTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "ERC-6551: The new Ethereum standard unlocking fresh possibilities for NFTs - OKX",
        "content": "What is ERC-6551?\n\nERC-6551 Token Bound Accounts (TBA) is a new and innovative Ethereum standard that expands the functionality of NFTs by allowing them to operate as their own smart contract accounts. This exciting development, created by the Future Primitive team with contributions from Manifold and the token-bound developer community, brings newfound versatility and utility to NFTs, transforming them into powerful digital assets.\n\nIn 1992 JPEGs allowed us to view and transmit images to each other; in 2017, NFTs let us buy, sell and trade, but what's next for 2023? The answer could be ERC-6551, which will provide seamless interactions and functionality.\n\nERC-6551 was created to address a limitation on ERC-721 tokens. Before, ERC-721 tokens couldn't act as owners of other on-chain assets or perform actions like an Ethereum account. This limited their usefulness in the real world.\n\nTo overcome this, ERC-6551 introduces token-bound accounts (TBA) — unique smart contract accounts associated with each ERC-721 token. These accounts are created through a permissionless registry and come with all the capabilities of an Ethereum account, allowing for more practical and user-friendly interactions.\n\nStart now\n\nThe benefits of ERC-6551\n\nWhile the token standard is still new, since its release on May 7, 2023, it has offered a much-needed rewrite to NFTs, making them more dynamic and interactive.\n\nImproved capabilities: TBA can be used to engage with other smart contracts and dApps, opening up near endless possibilities for NFTs.\n\nTBA can be used to engage with other smart contracts and dApps, opening up near endless possibilities for NFTs. Greater interoperability: TBA is compatible with other Ethereum standards, which makes it easier for NFTs to be used across different platforms.\n\nTBA is compatible with other Ethereum standards, which makes it easier for NFTs to be used across different platforms. Enhanced user friendliness: The key to mass adoption is to keep both crypto natives and the crypto curious in mind. TBA makes it easier for users to manage their NFTs and can be accessed from any web3 wallet.\n\nThe limitations of ERC-6551\n\nWhile getting caught up in the excitement of a new token standard is normal, doing your own research to get the full picture is also essential. With that in mind, there are some limitations with ERC-6551.\n\nHigh gas fees: The gas fees associated with ERC-6551 can increase, especially during periods of network congestion. This can make it expensive to use ERC-6551 NFTs.\n\nThe gas fees associated with ERC-6551 can increase, especially during periods of network congestion. This can make it expensive to use ERC-6551 NFTs. Limited compatibility: While this new token standard is exciting, it's essential to know not all wallets and platforms support ERC-6551.\n\nWhile this new token standard is exciting, it's essential to know not all wallets and platforms support ERC-6551. Lack of awareness: ERC-6551 is a new standard and is not yet widely known. Only some users know of it and how to use it. What's next for ERC-6551\n\nERC-6551 unlocks new possibilities for NFTs, going beyond their conventional uses. For example, NFTs can now become repositories for in-game wearables and digital items, enhancing user immersion and familiarity. Additionally, PFP (Profile-for-Proof) projects can incentivize collectors by rewarding token bound account holders. Finally, having multiple token bound accounts and support for multiple chains further enhances the utility and stimulates innovation in the NFT ecosystem.\n\nStart now\n\nDisclaimer: THIS ARTICLE IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY. IT IS NOT INTENDED TO PROVIDE ANY INVESTMENT, TAX, OR LEGAL ADVICE, NOR SHOULD IT BE CONSIDERED AN OFFER TO PURCHASE OR SELL OR HOLD DIGITAL ASSETS. DIGITAL ASSET HOLDINGS, INCLUDING STABLECOINS, INVOLVE A HIGH DEGREE OF RISK, CAN FLUCTUATE GREATLY, AND CAN EVEN BECOME WORTHLESS. YOU SHOULD CAREFULLY CONSIDER WHETHER TRADING OR HOLDING DIGITAL ASSETS IS SUITABLE FOR YOU IN LIGHT OF YOUR FINANCIAL CONDITION. PLEASE CONSULT YOUR LEGAL/TAX/INVESTMENT PROFESSIONAL FOR QUESTIONS ABOUT YOUR SPECIFIC CIRCUMSTANCES."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmxlZGdlcmluc2lnaHRzLmNvbS9hdXN0cmFsaWFuLWNiZGMtZngtdHJhbnNhY3Rpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Australian CBDC trials execute first FX transaction - Ledger Insights",
        "content": "Yesterday, blockchain startup CANVAS announced the successful execution of its central bank digital currency (CBDC) trial in Australia, using the eAUD to test foreign exchange (FX) transactions.\n\nTokenized FX settlements hold significant benefits, including round-the-clock trading and instant payments. The test is part of a series of pilots conducted by the Reserve Bank of Australia and the Digital Finance Cooperative Research Center (DFCRC).\n\nDetails of the FX transaction\n\nDuring the trial, the eAUD was exchanged for the USDC stablecoin between DigitalIX and TAF Capital on an Ethereum layer 2 solution. This allowed the transaction to be settled instantaneously without sacrificing privacy, scalability, and regulatory compliance.\n\nAccording to the team, another crucial aspect of their solution is that participants always maintain control and custody of their assets.\n\nKey benefits\n\nThe test also demonstrated the advantages of tokenized settlements compared to traditional FX trading and international remittance networks, including 24/7 trading and atomic (instant) payments. This removes the counterparty risk.\n\n“The eAUD, as a CBDC, holds the potential to address crucial challenges in both FX and International Remittance Markets such as improving transaction times, reducing fees, and providing more open access,” said David Lavecky, CEO at CANVAS.\n\n“We believe that CBDCs, Digital Securities and Tokenized Assets will radically transform finance and markets over the next decade. Our use case demonstrates the benefits of using CBDCs in tokenized FX transactions and how our privacy focused Layer 2 blockchain provides improvements over traditional markets by eliminating market inefficiencies, errors, and settlement risks.”\n\nAustralia’s CBDC Pilots\n\nCANVAS’ project is one of 15 selected use cases in the Reserve Bank of Australia’s CBDC pilot. The list includes major names, such as Mastercard, which will explore the use of eAUD on a public blockchain, as well as others like Intuit, ANZ and Commonwealth Bank. It also involves a wide variety of applications, ranging from offline payments and CBDC custodial models to nature-based asset trading and livestock auctions.\n\nA Layer 2 Ethereum solution\n\nThe public Ethereum blockchain has benefits, such as decentralization and a large user base. However, transparency can be a disadvantage in payments and the core blockchain lacks scalability.\n\nHence, the CANVAS Connect blockchain used for the FX transaction is a Layer 2 ZK-Rolllup scalability solution based on Starkware’s StarkEx, which is used by DeFi platforms such as dYdX and the Sorare fantasy sports platform.\n\nCANVAS was keen to emphasize that it is privacy enabled. All that’s stored on the main Ethereum network is a transaction hash like a fingerprint. At the second layer, only the parties to the transaction can see the details by default. However, CANVAS confirmed permissioned access to the data for regulators and the government for AML purposes.\n\nUnsurprisingly the central bank is using a permissioned blockchain for its CBDC issuance. While StarkEx solutions can be permissioned, CANVAS Connect is an open network targeted at financial services and hence is designed to incorporate KYC and AML."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3doeS1ldGhlcmV1bS1wcmljZS1jb3VsZC1zdHJ1Z2dsZS1pbi10aGUtbmVhci1mdXR1cmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Why Ethereum Price Could Struggle in the Near Future? - Analytics Insight",
        "content": "Despite the recent surge, Ethereum price could still struggle in the short term\n\nEthereum is the second largest cryptocurrency in the world. It’s also one of the best altcoins, and went on a massive bull run in 2021 and increased by almost US$4,000 at its highest, reaching its current all-time high (ATH) of US$4,840. The coin has made new lows since then. At the time of writing, the live Ethereum price is US$1,823.23, (more than 60% down from its ATH).\n\nWith Ethereum Merge, many investors thought that 2023 could be an excellent year for ETH. As it meant to allow Ethereum to implement sharding, which, amongst other exciting improvements, will supercharge transaction speeds on the network. Here is why Ethereum price could struggle in the near future:\n\nGas prices and network issues\n\nEthereum’s high gas prices have always been a subject of discussion in the crypto sector. Over the last few days, due to the hype around memecoins, gas prices on the Ethereum network surged. The Ethereum network is experiencing problems caused by surging gas fees, the cost associated with transactions, including those performed by smart contracts.\n\nDevelopers have come out and explained the reasons as to why the issues on the network occurred. According to one of the developers, Potuz, “the Ethereum network experienced a 25-minute loss of finality due to several valid but untimely attestations being broadcast. This stressed consensus clients, especially those on weaker hardware, causing them to struggle while following the chain.”\n\nEthereum price prediction\n\nEthereum’s value decreased in 2022 to US$1,781, but most experts predict that the price will rebound in the future. Here’s a long term Ethereum price prediction from experts below:\n\nWallet Investor, an algorithm-based crypto-asset prediction website, projected that ETH’s price could grow to over US$10,000 in November 2023 and even reach US$16,391 by the end of 2025.\n\nThe same was said by DigitalCoin, which predicts that the ETH price will average around US$7,569 in 2025 before rising to US$16,858 in 2028.\n\nAccording to net, Ethereum is forecasted to reach an average price of US$18,213 in 2025.\n\nConclusion\n\nUndoubtedly, much of the crypto market is very bullish on Ethereum price prediction. The coin is an essential part of the industry and without it, many of the top applications and services that have risen to popularity in the last few years would not be here today.\n\nOf course, not everyone feels the same and there are plenty of reasons some investors will not touch ETH. You don’t necessarily have to agree with them, but you must hear them out. You should be fully aware of ETH’s pitfalls as well as its benefits.\n\nDespite these bullish fundamentals, Ethereum could still struggle in the short term. Recently, ETH tapped into the US$1800 resistance zone after a surge in buying activity. With prices looking extremely overextended, ETH will likely fall to between US$1775 and US$1925 in the coming days and weeks. From there, ETH could tumble even further if adverse macroeconomic conditions worsen.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hdXN0cmFsaWEtdXNlcy1jYmRjLWluLWZ4LXRyYW5zYWN0aW9uLXBpbG90LXRlc3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Australia marks first FX transaction using a CBDC as eAUD pilot continues - Cointelegraph",
        "content": "Australia has successfully made its first foreign exchange transaction using eAUD as part of a live pilot for the country’s potential central bank digital currency.\n\nIt comes amid a rising interest from countries around the world to learn about or launch central bank-issued digital currencies.\n\nBlockchain infrastructure provider Canvas said that on May 17, crypto fund managers DigitalX and TAF Capital traded eAUD against the stablecoin USD Coin (USDC).\n\nCanvas reported the transaction was settled instantly and touted it as a success over what it called the “slow, expensive and prone to errors” traditional FX and remittance networks.\n\nThe FX trade was part of a series of tests currently underway as the country explores possible use cases for a CBDC. The pilot program was launched by the Reserve Bank of Australia (RBA) in conjunction with the financial research institute Digital Finance Cooperative Research Centre (DFCRC).\n\nCanvas’ test explored use of eAUD in tokenized FX settlements, which could point toward the benefits of using the CBDC over fiat currencies and existing settlement platforms.\n\nWe’ll demonstrate the benefits of using CBDCs like eAUD in tokenized FX transactions using our privacy-focused Layer 2 Network and blockchain-based financial markets applications. Read more here https://t.co/RPjSF5B8s0 — CANVAS (@canvas_defi) March 6, 2023\n\nThe transaction was done on a decentralized app on Canvas’ “Connect” — an Ethereum layer 2 that uses StarkWare’s zero-knowledge (ZK) roll-up technology.\n\nCanvas CEO David Lavecky called the trade “historic” and added that the digital dollar could potentially address challenges in FX and remittance markets, such as “improving transaction times, reducing fees and providing more open access.”\n\nRelated: BIS issues comprehensive paper on offline CBDC payments\n\nAn April pilot test from Australia and New Zealand (ANZ) bank used the CBDC to trade carbon credits.\n\nANZ used eAUD to back its A$DC stablecoin to trade the credits on a public blockchain and reported the settlement happened “in near real-time.”\n\nOther use cases being tested include offline payments, distribution, custody, tax automation, use in “trusted Web3 commerce,” and even livestock auctions.\n\nThe pilot started on March 31 and is set to finish on May 31. A report assessing the various use cases is set to be published on June 30.\n\nMagazine: Here’s how Ethereum’s ZK-rollups can become interoperable"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGFpbHljb2luLmNvbS9jb2luYmFzZS1oYWx0cy1ldGgtc3Rha2luZy1yZXdhcmQtd2l0aGRyYXdhbHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Coinbase Halts ETH Staking Reward Withdrawals: Is SEC Action Related? - DailyCoin",
        "content": "Coinbase said on Tuesday that it had suspended ETH staking reward withdrawals.\n\nThe exchange said that the reason for the halt was a “technical issue.”\n\nThe U.S. SEC is likely to file an enforcement action against Coinbase in the coming weeks.\n\nThe current crypto bear market is one of the toughest in history. It’s especially tough for centralized crypto exchanges, which have seen tremendous regulatory pressures.\n\nThe environment is so fragile that centralized exchanges face scrutiny for everything they do. For example, Coinbase has just suspended ETH staking reward withdrawals amid its beef with the SEC.\n\nCoinbase Halts ETH Staking Reward Withdrawals\n\nCoinbase, the second-largest centralized crypto exchange in the world, announced on Tuesday that it had suspended ETH staking reward withdrawals.\n\nThe exchange said the halt was due to a “technical issue” the team had already identified. A fix will be deployed in the next 48-72 hours, and ETH staking reward withdrawals will be re-enabled.\n\nCoinbase status page. Source: status.coinbase.com.\n\nIt’s unclear what bug Coinbase is referring to. Moreover, bugs that prevent regular activity are usually solved as soon as possible. In Coinbase’s case, it will take up to three days.\n\nWhile it’s most likely that Coinbase is indeed experiencing a bug, it’s also possible that the exchange is preparing for potential regulatory action from the U.S. Securities and Exchange Commission (SEC).\n\nCan SEC Be Blamed for Halt?\n\nCoinbase received a Wells Notice from the SEC in March. Receiving a Wells Notice means the regulatory body plans to file an enforcement action against the receiver.\n\nOn Tuesday, Berenberg Capital Markets, a broker-dealer in the U.S., said that the SEC will likely file an enforcement action in the coming weeks. The enforcement action will probably be related to Coinbase’s staking services.\n\nThis is because other centralized exchanges like Kraken have already been ordered to shut down their staking services for selling unregistered securities.\n\nHowever, if Coinbase received such an order, the exchange pledged to go to court and fight back.\n\nOn the Flipside\n\nThe technical issues Coinbase is talking about might as well be actual technical issues that have nothing to do with upcoming SEC action.\n\nWhy You Should Care\n\nCoinbase is the second-largest crypto exchange in the world. However, users should always be aware of potential issues centralized exchanges might face and consider self-custody.\n\nRead more about Lido enabling stETH withdrawals:\n\nLido Enables stETH Withdrawals: See Who’s Withdrawing How Much\n\nRead more about Optimism’s upcoming Bedrock upgrade:\n\nOptimism Reveals Date for Bedrock Upgrade: Here’s What It Changes"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vdS50b2RheS95YWNodGlmeS15Y2h0LXByZS1zYWxlLWdhaW5zLXN0ZWFtLXRhcmdldHMtd2hhbGUtaG9sZGVycy1vZi1ldGhlcmV1bS1ldGgtc2hpYmEtaW51LXNoaWItY3J5cHRvc9IBc2h0dHBzOi8vdS50b2RheS95YWNodGlmeS15Y2h0LXByZS1zYWxlLWdhaW5zLXN0ZWFtLXRhcmdldHMtd2hhbGUtaG9sZGVycy1vZi1ldGhlcmV1bS1ldGgtc2hpYmEtaW51LXNoaWItY3J5cHRvcz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Yachtify (YCHT) Pre-Sale Gains Steam, Targets Whale Holders of Ethereum (ETH), Shiba Inu (SHIB) Cryptos - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nYachtify (YCHT), an innovative platform revolutionizing the yacht investment landscape, has all chances to trigger mass adoption amidst the recent turmoil in the crypto markets.\n\nThe platform's unique approach to fractional yacht ownership and attractive presale incentives are drawing investors to Yachtify (YCHT) for a more secure and promising investment experience.\n\nYachtify (YCHT) introduces alternative for altcoin fans\n\nAs the cryptocurrency market experiences turbulence with Ethereum whales panic selling and meme coins like SHIB facing price crashes, Yachtify (YCHT) emerges as a promising investment alternative. Offering unique benefits and features, YCHT is garnering significant attention in the crypto community.\n\nOne of the key advantages of Yachtify (YCHT) is its fractionalization of yacht ownership. This innovative approach allows investors to own a share of a luxury yacht without having to bear the full costs of ownership. Fractionalization democratizes access to the yachting lifestyle and provides a potential source of passive income through yacht chartering.\n\nCurrently, Yachtify (YCHT) is in its presale stage, offering an enticing pricing of just $0.12 per token. Investors who seize this early opportunity can enjoy a 30% bonus on their token purchases, making it an even more attractive proposition.\n\nSupporters of Yachtify (YCHT) can take part in pre-sale and buy tokens here .\n\nEthereum (ETH) whales are still confident\n\nRecently, Ethereum whales have initiated a massive sell-off, causing turmoil within the Ethereum community and concerns among investors. Two prominent Ethereum whales, identified as 0x6071 and 0x7641, sold a combined total of 19,090 ETH, amounting to roughly $35.7 million. This massive sell-off comes after the Ethereum Foundation offloaded 15,000 ETH ($29.7 million) to Kraken.\n\nThe considerable sales have triggered a wave of selling activity, resulting in a notable effect on Ethereum's price, which dropped from $1,900 to $1,850 in a matter of hours. As Ether currently hovers around the 50-day moving average, investor uncertainty and conjecture are on the rise. The latest moves by Vitalik Buterin and the Ethereum Foundation have left numerous individuals pondering the future of the cryptocurrency and the consequences of such extensive selling on the market.\n\nShiba Inu (SHIB) holders benefit from another phase of meme coin euphoria\n\nDespite the recent purchase of over 10.25 trillion Shiba Inu (SHIB) tokens by large buyers, the price of Shiba Inu (SHIB) continues to decline. The substantial volume of purchases failed to prevent an 8% drop in Shiba Inu (SHIB) price over the past week, marking the third consecutive week of decline.\n\nOne possible explanation for this paradox is the rise of the Pepe (PEPE) meme token, which gained incredible momentum and reached a $1.66 billion market cap within the same three weeks.\n\nIt appears that PEPE may have diverted liquidity from Shiba Inu (SHIB), contributing to its ongoing price drop.\n\nJoin Presale: https://buy.yachtify.market\n\nWebsite: https://yachtify.market\n\nTelegram: https://t.me/yachtify"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmJsb2NrY2hhaW4tY291bmNpbC5vcmcvYmxvY2tjaGFpbi9nYW5hY2hlLWJsb2NrY2hhaW4tYWxsLXlvdS1uZWVkLXRvLWtub3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Ganache Blockchain: All you need to Know - Blockchain Council",
        "content": "Difference between Ganache and Truffle\n\nGanache and Truffle are two popular tools developers use to make their lives easier when developing smart contracts. While both tools have unique features, they also have limitations, making it essential to understand when to use them.\n\nGanache: A Personal Blockchain for Testing Smart Contracts\n\nGanache is a personal Blockchain that allows developers to create a private Ethereum network to test their smart contracts. It offers all the functionalities of the leading Ethereum network without the costs associated with deploying and testing arrangements on the main network. Ganache provides developers with advanced mining controls and a built-in block explorer, making testing and inspecting smart contracts during development easier.\n\nHowever, Ganache has its limitations. Since it is a private network, it does not accurately mimic the actions of miners on the primary grid. This can cause issues when developers need to test the behavior of smart contracts that depend on miner actions. Additionally, the gas limit on the leading network is a moving target that can change, making it important to be mindful of the potential for issues when using exact numbers in Ganache.\n\nTruffle: A Developer Environment for Building Smart Contracts\n\nTruffle is a development environment, testing framework, and asset pipeline for Blockchains. It provides developers with a project structure, files, and directories, making deployment and testing much more accessible. Truffle also allows developers to spin up a smart contract project at the click of a button, streamlining the development process.\n\nOne of the main advantages of TruffleTruffle is that it is not limited in terms of the features it provides, as it simply provides a framework for developers to sculpt their projects. However, TruffleTruffle offers different control over Ganache’s Blockchain network, which can disadvantage developers who need a more customized testing environment.\n\nChoosing the Right Tool for Your Smart Contract Development\n\nUltimately, the choice between Ganache and Truffle depends on the needs of the developer and the requirements of the smart contract project. Developers who require a more customized testing environment with advanced mining controls may find that Ganache is the better option. On the other hand, developers who need a more streamlined development process with a robust project structure may find Truffle is the better choice. Understanding the differences and limitations of these tools is vital for making the right decision for your smart contract development needs.\n\nHow to get started with Ganache\n\nGanache is a popular smart contract development platform that simplifies the complex process of building smart contracts. This platform allows developers to test their smart contracts without spending Ether on the main Ethereum network. This article will provide a step-by-step guide on downloading, installing, and using Ganache to develop smart contracts.\n\nDownloading Ganache\n\nTo start using Ganache, go to the Truffle Suite website and search for the “Download” option for Ganache. Downloading a suitable file format compatible with your operating system is essential. The file versions for Ganache and the specific operating systems they are consistent with are as follows:\n\nWindows: Ganache-*.appx\n\nLinux: Ganache-*.AppImage\n\nMac: Ganache-*.dmg\n\nAfter downloading the file, double-click to launch the installation process. You can efficiently complete the installation procedure by following the on-screen instructions.\n\nConfiguring Ganache\n\nOnce the installation is complete, you can configure your local Blockchain by clicking the “QUICKSTART” button on the Ganache UI. This action will start a new Blockchain with ten accounts preloaded with 100 fake Ether each. Adjusting the settings allows you to set the network to suit your needs.\n\nUsing Ganache\n\nAfter configuring the local Blockchain, you can use Ganache to develop and test your smart contracts. The Ganache UI provides advanced mining controls, allowing you to mimic various mining scenarios to test your smart contracts. You can also inspect the current state of your Blockchain using the built-in block explorer.\n\nGoogle Analytics Tracking\n\nWhen downloading Ganache, you will be asked to confirm your decision to allow Google Analytics to track your activities. The development team can gather insightful data on how developers use Ganache by allowing Google Analytics tracking. This data helps the team identify areas that require improvement and make adjustments to enhance the platform’s performance.\n\nAnonymous Tracking\n\nIt is essential to note that account information and private keys are never shared during Google Analytics tracking. Therefore, the data collected is anonymous, and no personal information is shared with third parties.\n\nGanache simplifies innovative contract development by providing developers with a testing platform mimicking the Ethereum leading network. The platform’s user-friendly interface and advanced mining controls make it easy for developers to test and deploy their smart contracts. Developers can quickly build and deploy smart contracts by downloading, installing, and using Ganache.\n\nWhat to do after installing the Ganache?\n\nWhile we have already discussed the installation process in great detail, there are specific steps before you can enjoy the functionalities of this Blockchain thoroughly. You may know some of them as we discussed in brief about them in the installation itself; now we will delve into them in detail.\n\nDeveloping the workspace\n\nWhen you install Ganache, you can create a workspace to get started. When you open Ganache for the first time, you can create your custom workspace or use the default options for a one-click Blockchain. You can quickly start a one-click Blockchain by selecting the Ethereum or Corda network from the QUICKSTART drop-down option. Once you choose your preferred option, click the QUICKSTART button again to create your workspace. In your workspace, you can expect to find a user-friendly interface that allows you to test your smart contracts, execute commands, and explore blocks. It’s an easy way to get started with Blockchain testing!\n\nDifferent workspaces\n\nSeveral workspaces depend on the Blockchain you use to develop your application. Multiple options, like Ethereum, Corda, and Solidity, are among the most famous workspaces. In this section, we will discuss the Ethereum and Corda workspace in detail, as they are easy to understand and use for beginners.\n\nEthereum Workspace and its Settings\n\nWhen you create an Ethereum workspace on Ganache, you’ll see a bunch of information about the server. The default view shows all the accounts created and how much fake ETH each one has. There’s also a page showing all the blocks mined on the Blockchain, with details about the transactions and fees involved. The events page lists all the events that have been started since the workspace was created, and the transactions page shows all the transactions on the network. There’s also a page that shows the server logs, which can be helpful for debugging. And finally, there’s a contracts page that lists all the contracts included in the workspace. If you need to find a specific transaction or block, use the search box at the top of the UI.\n\nEthereum’s workspace settings\n\nThe Ethereum workspace on the Ganache Blockchain testing network has several necessary settings for developers.\n\nThe first one is called workspace, which allows you to name your workspace and see which Truffle projects are linked.\n\nAnother important setting is Accounts & Keys, which lets you create new accounts and specify whether to use a specific mnemonic or one created by Ganache.\n\nThe Advanced setting in Ganache allows developers to enable Google Analytics to track usage data.\n\nThe Server set provides information about the network connection, such as hostname, network ID, and port. It also lets developers choose whether to automatically mine each transaction in one block. It’s essential to make sure the Server settings match the Truffle configuration.\n\nThe About section details the current version of Ganache that is installed. The Chain setting allows developers to configure the newly created Blockchain by setting parameters such as gas price and limit. All of these settings can be accessed and customized by developers to fit their specific needs.\n\nCorda Workspace\n\nCreating a Corda workspace with Ganache Truffle’s testing Blockchain offers flexibility for developers. After creating a Corda workspace, you can find details about the nodes and notaries featured on the network. The nodes section outlines all the nodes and notaries featured on the web. The CorDapps section lists all the CorDapp jars installed on the network. The logs section outlines different logs for the Ganache server, notaries, and nodes, which helps debug. The transactions section presents a list of all the transactions that occurred in the Corda workspace. Lastly, the Shell section provides Corda CRaSH shell access to all nodes and notaries.\n\nCorda workspace settings\n\nThe Corda workspace settings in Ganache offer several features that allow developers to manage their Corda projects effectively.\n\nThe Workspace section allows developers to name their workspace and view details of the Corda projects associated with it.\n\nThe Nodes feature serves as a vital tool for managing nodes on the network, allowing developers to add, remove, or modify nodes as needed.\n\nThe Advanced section helps developers configure the default PostgreSQL port and toggle Google Analytics for usage metrics, enabling them to improve the Ganache Blockchain according to user behavior.\n\nThe Notaries feature in settings for the Corda workspace in Ganache is a valuable tool for managing notaries on the network.\n\nThe About section provides developers with comprehensive information about the version of Ganache currently installed on their system.\n\nSettings for Ganache\n\nNow, we will discuss how you can make specific configurations or changes in the ganache workspace to operate in other environments like Ethereum or Corda.\n\nGanache allows the configuration of testing environments by adjusting settings.\n\nThe Settings page can be accessed through the gear icon in the top right corner.\n\nNew workspaces prompt the settings screen.\n\nThe Settings page differs between Ethereum and Corda workspaces.\n\nChanges made to settings must be saved.\n\nImportance of Ganache Blockchain for Developers and its Future\n\nGanache is an effective Blockchain development tool that provides a local testing environment for developers. Developers widely use it to test, develop and deploy Blockchain applications without an entire Blockchain network.\n\nImportance of Ganache for Developers\n\nAs a developer, Ganache is a tool you must use when you frequently develop applications on the Blockchain. Thus, knowing the developer-friendly features will be essential in using them more efficiently.\n\nSimplifies Blockchain Development\n\nGanache provides an easy-to-use and simplified interface for developers to build, test and deploy Blockchain applications. It eliminates the need for complex setup and configurations, making it easier for developers to focus on their applications.\n\nCost-effective Solution\n\nDeveloping a real Blockchain network can be expensive due to transaction fees and gas costs. Ganache eliminates these costs by providing developers with a free and local testing environment.\n\nFaster Development Process\n\nWith Ganache, developers can quickly test and iterate their applications, speeding up the development process. It also provides real-time feedback on application performance, which helps developers to optimize their code.\n\nSupports Multiple Blockchains\n\nGanache supports multiple Blockchain networks, such as Ethereum and Corda, allowing developers to choose the Blockchain that suits their application needs.\n\nFuture of Ganache\n\nLearning about any tech takes a lot of time; thus, knowing if it has the potential to grow in the future can determine how much time you should spend learning about it or leaving it altogether. For now, the end of Ganache looks bright for the following reasons:\n\nContinued Development and Improvement\n\nGanache is an open-source project that is continuously being developed and improved. Its developer community constantly adds new features and functionality, making it a powerful tool for Blockchain development.\n\nIntegration with Other Tools\n\nGanache can be integrated with other Blockchain tools and platforms such as Truffle, Remix, and Metamask. This makes it easier for developers to use Ganache with their preferred devices.\n\nAdoption in Enterprise Solutions\n\nWith the increasing adoption of Blockchain technology in enterprise solutions, Ganache is expected to become a crucial tool for enterprise Blockchain development. Its ability to provide a cost-effective and easy-to-use testing environment for Blockchain applications makes it an attractive solution for businesses.\n\nAs a new developer, learning about Ganache can prove very beneficial for your career in Blockchain, as there is a need for developers who can quickly adapt to changing technology in the sphere. You can find a course on the Ganache and other vital tools in the Blockchain on our website at the Blockchain Council. As one of the most credible course providers on Blockchain, you will gain practical knowledge as you try to obtain new skills.\n\nConclusion\n\nGanache is a powerful tool for smart contract development that can significantly improve the speed and efficiency of the process. Its ability to provide an isolated personal Blockchain network for testing and its cost and time benefits makes it an attractive option for developers. Its flexibility in creating workspaces for Ethereum and Corda networks and their distinct functionalities and settings provide good value advantages.\n\nWith the availability of comprehensive guides and tutorials for using Ganache on Blockchain Council, developers can easily integrate it into their smart contract development workflow and reap its benefits. For new developers, learning about it will open a Darth of opportunities in the sphere and help them get their dream job.\n\nFrequently Asked Questions"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9zY2FsYWJpbGl0eS1tYWdpYy1vZi1ldGhlcmV1bS1lbmlnbWEtdW5sb2NraW5nLWZpbmFuY2lhbC13aXphcmRyeS1hbmQtZW5oYW5jaW5nLWRvZ2V0dGlzLWNyeXB0by1hZHZlbnR1cmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Scalability Magic of Ethereum Enigma: Unlocking Financial Wizardry and Enhancing Dogetti's Crypto Adventure - Analytics Insight",
        "content": "Can Ethereum Enigma’s novel scaling solutions assist the fintech sector in navigating cryptocurrency issues and providing respite from rising costs?\n\nIn the constantly shifting arenas of fintech and cryptocurrency, Ethereum Enigma stands out as a light of hope, providing breakthrough scaling solutions to address the industry’s critical concerns. With its forward-thinking attitude and commitment to innovation, Ethereum Enigma has established itself as an industry leader in the cryptocurrency space.\n\nIn this article, we will look at the distinctive traits and achievements of Ethereum Enigma, as well as how its offers may assist crypto professionals and users looking for up-to-date information. We will also discuss the success of the meme market, notably its leader Dogetti, its presale, and how Ethereum Enigma may impact it.\n\nEthereum Enigma: Unrevealing Scalability for Lightning-Fast and Cost-Efficient Ethereum Transactions\n\nEthereum Enigma is an organisation devoted to resolving the general scalability concerns that have plagued blockchain networks, specifically Ethereum. Ethereum Enigma has created solutions to improve scalability, increase transaction speeds, and minimise costs within the Ethereum ecosystem by leveraging cutting-edge technology and a team of professionals.\n\nEthereum Enigma improves the efficiency of Ethereum’s infrastructure by utilising sophisticated layer-2 technologies like state channels and plasma chains. These technologies enable off-chain processing, lessening the burden on the main blockchain and enabling quicker and more cost-effective transactions. Ethereum Enigma enables the finance sector to realise the full potential of decentralised apps and smart contracts by reducing congestion and enhancing scalability.\n\nEthereum Enigma’s solutions have been steadily applied, and their effect on the crypto community is growing. Ethereum Enigma, available internationally, has gained recognition for its effective implementation of layer-2 solutions, allowing users to experience quicker transaction speeds and lower prices. As the platform evolves, its solutions will likely reach a wider audience, revolutionising how we interact with cryptocurrencies.\n\nGet Ready to Meme Your Way to Crypto Gains with Dogetti\n\nDogetti, the crypto sensation that started as a meme, is here to bring fun and uniqueness to cryptocurrencies! This decentralised gem has quickly gained a passionate community of followers, adding a touch of playfulness to the often serious crypto market. With its lighthearted nature and growing popularity, Dogetti offers a refreshing break from the norm and invites users to enjoy a wild ride of memes, laughter, and potential gains, so if you’re ready to release your inner meme-loving investor, board in the Dogetti family and join the fun.\n\nDogetti’s presale is still going on and will end on June 20, 2023. Isn’t it a relief?\n\nYou have the opportunity of a lifetime to join the presale but wait, take advantage of the coupon code LAUNCHDETI to receive a 400% bonus on all your DETI purchases.\n\nEthereum Enigma’s Game-Changing Scalability Solutions: Unlocking Dogetti’s Potential in the Crypto Universe\n\nThe interoperability of Ethereum Enigma with popular cryptocurrencies like Dogetti is one of its most exciting features. Ethereum Enigma expands the potential of cryptocurrencies through seamless integration and interconnection, providing a holistic solution for customers seeking optimised experiences across different platforms. However, one can wonder how Ethereum Enigma could influence Dogetti.\n\nThe incorporation of Ethereum Enigma’s scaling solutions has the potential to have a significant influence on Dogetti and its consumers. Dogetti may benefit from increased scalability, faster transaction speeds, and lower costs by utilising Ethereum Enigma’s powerful layer-2 technologies.\n\nThese enhancements will lead to a more seamless and efficient user experience, attracting more people to engage with Dogetti’s cryptocurrency. Dogetti users now enjoy simplified experiences across numerous platforms thanks to Ethereum Enigma’s seamless integration capabilities, significantly increasing the scope and possibilities of this popular cryptocurrency.\n\nAs Ethereum Enigma continues to revolutionise the finance sector, the collaboration between Ethereum Enigma and Dogetti creates a symbiotic connection that accelerates Dogetti’s development and acceptance in the volatile crypto market.\n\nDogetti (DETI)\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzI1LW1pbi1ldGhlcmV1bS1jb2xkLXdhbGxldC1pc3N1ZS1wZWVrcy1icmllZmx5LWFzLWJpZy1leWVzLWNvaW5zLXN0YWdlLTMtcHJpY2UtcmV0dXJucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "25-Min Ethereum Cold Wallet Issue Peeks Briefly As Big Eyes Coin's Stage 3 Price Returns - Analytics Insight",
        "content": "On May 11, panic filled the air as the Ethereum mainnet pressed pause for about 25 minutes. Though brief, it left users and developers on the edge of their virtual seats. Amidst the brief chill, Big Eyes Coin emerges with a mischievous wink. The Big Eyes team has unveiled a delightful surprise for their devoted token holders: the return of its affordable $0.00017 price from Stage 3!\n\nEthereum’s Mainnet Briefly Froze For 25 Minutes!\n\nThe Ethereum mainnet, Beacon Chain, unexpectedly decided to take a breather on Friday. During this time, blocks were in the process but failed to go through. Users and developers were on edge, afraid of the risk of transactions being altered due to the issue.\n\nEthereum core developers swiftly took to the Twitterverse to announce that the blockchain wasn’t finalizing. After about 25 minutes, the Ethereum mainnet was finalizing blocks again. A clear reason behind the malfunction is still unknown.\n\nThe Beacon Chain is Ethereum’s original proof-of-stake blockchain, officially breaking ground on September 15, 2022.\n\nEthereum’s Enduring Popularity\n\nA similar issue to the recent mainnet crash arose on March 15, causing a delay in the Goerli Testnet version of Ethereum’s “Shapella” upgrade. However, the upgrade was successfully executed on the mainnet on April 12.\n\nDespite this, and a few other mishaps before this, how is Ethereum still so popular? Simple: Ethereum has the network effect and first-mover advantage hallmarks in its arsenal. The network effect essentially ensures Ethereum’s power as more cryptocurrency firms use its blockchain and follow its smart contract protocols. Meanwhile, the first-mover advantage refers to Ethereum’s edge by being the first to introduce a programmable blockchain that enables the development of decentralized applications (DApps) and smart contracts.\n\nBig Eyes Coin — Ethereum-Based Crypto\n\nEthereum has been the shining savior of crypto startups, including Big Eyes Coin. This decentralized meme project uses the Ethereum Request for Comment 20 (ERC-20) protocol, which solidifies its stance in the crypto industry, where it can promote affordability, transparency, and interoperability on its own.\n\nWhat is Big Eyes Coin?\n\nBig Eyes Coin (BIG), the emerging Ethereum-based meme project, has been hitting big goals since its first presale. Now on its 13th one, the BIG presale funds are at about $36.8 million. Due to this exceptional milestone and the plea of its community, Big Eyes Coin will officially close its presale journey on June 3! Less than a fortnight from that, this meme project will launch on Uniswap on June 15, 2023.\n\nIn a bold move to cement its position as more than just a passing meme coin, Big Eyes Coin reveals that it will launch its own Online Casino and Play-to-Earn (P2E) Games, scheduled for August 29, 2023. This groundbreaking initiative allows users to convert their crypto assets into Big Eyes tokens and enjoy an extensive selection of over 4,000 thrilling games.\n\nAnd, just recently, it announced that token holders can now trade and invest in BIG for only $0.00017. This generous offer lets users enjoy $BIG at a lower price!\n\nEthereum is an incredibly powerful cryptocurrency that houses a library of digital assets. But, as evidenced by its mainnet issue, it is not without challenges. Nevertheless, its slew of upgrades and potent community make it a powerful cryptocurrency. Inarguably, it helps lay a sturdy groundwork for platforms like Big Eyes Coin to soar high and unveil ingenious solutions to their cherished users.\n\nFor All Things Big Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nInstagram: https://www.instagram.com/BigEyesCoin/\n\nTwitter: https://twitter.com/BigEyesCoin\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2hvdy10by10cmFuc2Zvcm0tcGh5c2ljYWwtYXJ0LWludG8tbmZ0LWFydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "How To Transform Physical Art into NFT Art? - Analytics Insight",
        "content": "NFTs, or non-fungible tokens, are digital representations of unique and scarce assets that can be bought, sold, and traded on the blockchain. NFTs have become a popular way for artists to showcase and monetize their work and for collectors to own and appreciate digital art. But what if you have physical art that you want to turn into NFTs? How can you transform your paintings, sculptures, or drawings into digital assets that can be verified and valued on the blockchain?\n\nDigitize the artwork: Begin by digitizing the physical art using a high-resolution scanner or a professional photographer. Ensure that the digital image captures all the details and colors accurately.\n\nEdit and enhance the digital image: Use image editing software like Adobe Photoshop or GIMP to make any necessary adjustments to the digital image. This may include adjusting the brightness, contrast, and colors, and removing any imperfections or blemishes.\n\nChoose an NFT platform: Select a suitable NFT platform where you can mint and sell your NFTs. Popular NFT platforms include OpenSea, Rarible, SuperRare, and Foundation. Each platform has its guidelines and requirements, so familiarize yourself with the platform of your choice.\n\nSet up a digital wallet: Create a digital wallet compatible with the chosen NFT platform. Most NFT platforms operate on Ethereum, so you will need an Ethereum-compatible wallet like MetaMask or Trust Wallet. Follow the wallet provider’s instructions to set up and secure your wallet.\n\nMint the NFT: Once you have your digital wallet set up and connected to the NFT platform, you can proceed to mint your NFT. This typically involves providing details about the artwork, such as its title, and description, and attaching the digital image file. You may also set the desired price or choose an auction-style listing.\n\nPay the minting fees: Minting NFTs on most platforms requires paying a transaction fee, known as “gas fees,” in the native cryptocurrency (usually Ethereum). Confirm the transaction and pay the fees from your connected wallet. The fees cover the cost of storing the NFT on the blockchain.\n\nConfirm the minting process: Once the transaction is processed, the NFT will be minted and assigned a unique token ID on the blockchain. You’ll receive confirmation from the NFT platform, and the artwork will be publicly available for viewing and purchase.\n\nMarket and sell your NFT: Promote your NFT art through social media, art communities, and various online platforms. Utilize the features provided by the NFT platform, such as creating collections or participating in community events, to attract potential buyers. Engage with collectors and art enthusiasts to build interest in your NFT art."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMTctbWF5LWZpbmFsbHktZXRoLWJlYXJpc2gtZmxhZy1wYXR0ZXJuLWlzLWluLXBsYXktdGltZS10by1zZWxsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (17-May): Finally! ETH Bearish Flag Pattern is in Play. Time To Sell? - Bitcoinsensus",
        "content": "The ETH pattern we are tracking right now in the 15-minute timeframe is a bearish Flag Pattern.\n\nThe image above is a clear example of what a completed bearish Flag Pattern looks like. And in the coming days, we will be expecting the ETH price to begin to sell off as aggressively as this.\n\nIn this Ethereum analysis, we will be breaking down the key levels we are watching as well as the key resistance the ETH price must stay below for this bearish prediction to remain valid.\n\nNew KYC bonus campaign from Bybit! From now till 21st of May 2023\n\nSign up and fund your Bybit account with our Bybit link to get this offer!\n\nFor new Users: Deposit $100, complete your KYC, and get $40. For existing Users, who have not completed KYC yet: Have a balance of $50, complete your KYC and get $20\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHas The ETH Sell-Off Started?\n\nFinally! ETH Bearish Flag Pattern is in Play. Time To Sell? watch this key resistance level in the 15-minute timeframe\n\nThe Ethereum price has confirmed the start of a bearish flag sell-off in the 15-minute timeframe.\n\nIf this pattern plays out, there is a very high probability that we might see a more than -8% drop in the value of Ethereum in the coming days.\n\nThis bearish move can easily push the Altcoin price back to the $1,733 previous support level or even lower. So for now, are very bearish on the Ethereum price and we are currently looking for a price sell-off.\n\nThe Key Resistance To Watch For!\n\nFinally! ETH Bearish Flag Pattern is in Play. Time To Sell? watch this key resistance level in the 15-minute timeframe\n\nThe most important key resistance for this Bearish Flag Pattern playing out right now is the $1,836 previous highs in the 15-minute timeframe.\n\nAs far as the ETH price can respect and continue to trade below this $1,836 price level, we will remain bearish on Ethereum.\n\nHowever, if the ETH price manages to break above this $1,836 resistance level in the 15-minute timeframe, this would invalidate our bearish flag pattern.\n\nSo for now, we are watching this $1,836 key resistance closely to see how the ETH price reacts to it and if it would hold strong in the coming days.\n\nFinal Verdict!\n\nThe Ethereum bearish flag pattern is in play right now in the 15-minute timeframe. This is a bearish indication for Ethereum and there is a very high probability that we see a more than -8% dump in the value of ETH sooner or later.\n\nHowever, for this bearish prediction to remain valid, we need to see the ETH price continue to respect and trade below the $1,836 key resistance level.\n\nA price break above this 15-minute key resistance invalidates our bearish flag pattern.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0taGFyZHdhcmUtd2FsbGV0LWdpYW50LXJlbGVhc2VzLW5ldy11cGRhdGUtdGhhdC1taWdodC1leHBvc2Utc2VlZC1waHJhc2VzLWJld2FyZS1hbmQtc3RheS12aWdpbGFudC_SAZ8BaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL2JpdGNvaW4tYW5kLWV0aGVyZXVtLWhhcmR3YXJlLXdhbGxldC1naWFudC1yZWxlYXNlcy1uZXctdXBkYXRlLXRoYXQtbWlnaHQtZXhwb3NlLXNlZWQtcGhyYXNlcy1iZXdhcmUtYW5kLXN0YXktdmlnaWxhbnQvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Hardware Wallet Giant Releases New Update That Might Expose Seed Phrases – Beware and Stay Vigilant! - Crypto News Flash",
        "content": "While the Ledger Recover is completely optional, the company noted that those who opt-in will have their key phrases stored by 3 different parties on cryptographically-secure Hardware Security Modules.\n\nThe community was outraged by the update since Ledger has in the past been compromised leading to phishing attacks on users.\n\nThe Ledger hardware wallet is under harsh scrutiny after enabling a software update that could leak crucial security data. In the latest firmware update dubbed version 2.2.1, the Paris-based company announced a new feature called Ledger Recover to ostensibly help users backup their seed phrases with a third party through an ID-based system.\n\nAvailable in several markets – including the European market, Canada, the United States, and the United Kingdom -the software update has been dubbed controversial as Ledger had previously marketed its services as a non-sharing private key platform.\n\nAs a result, most of the Ledger Wallet users have been outraged by the firmware update, which could cause losses of billions of dollars. The Ledger hardware wallet has in the past been compromised exposing crucial customers’ data. The Ledger data breach led to a phishing attack on the affected users.\n\nWith the latest update, which is touted as optional, most Ledger users are skeptical of storing high amounts of digital assets in fear of backdoor attacks. Furthermore, it is only a matter of time before the third party sees phrase recovery companies are compromised leading to losses in billions of dollars.\n\nOne Twitter user @oklahodl1 shared a video of a Ledger Nano X being destroyed after the firmware update announcement. Several similar videos have emerged on different social media platforms as Ledger users urge others to ditch the hardware wallet.\n\nLedger in Defense\n\nAfter a huge uproar by the crypto community, Ledger has defended the firmware upgrade stating that it is optional. According to Ledger CTO, Charles Guillemet, the company remains focused on self-custody and will never have or create a backdoor on users’ wallets.\n\nLedger Recover is an optional subscription for users who want a backup of their Secret Recovery Phrase. You don’t have to use it, and can continue managing your recovery phrase yourself if that’s why you bought a Ledger,\n\nFurthermore, Guillemet noted that the sharing of users’ secret key phrases happens in a secure channel to the three different companies. Notably, the encrypted fragments are stored by three different parties on cryptographically-secure Hardware Security Modules.\n\nIf you choose to subscribe, Ledger Recover encrypts a version of your private key and splits it into three fragments (using Shamir Secret Sharing) – all of this happens on the Secure Element chip, so your Secret Recovery Phrase is not at risk. — Ledger (@Ledger) May 16, 2023\n\nThe company has fragmented the key phrases into three different third parties to help strengthen self-custody. Furthermore, the individual encrypted fragments are completely useless since they cannot access a wallet without users’ verification. “When you want to restore your keys, 2 of these 3rd parties will send back their fragments to your Ledger device (and not us as an organization), which will be able to reconstitute your Secret Recovery Phrase,” Ledger added.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMTcvY29pbmJhc2UtbGF1bmNoZXMtbGF5ZXJzd2FwLXprc3luYy1lcmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Coinbase launches Layerswap for zkSync Era - The Cryptonomist",
        "content": "With the new Layerswap solution, users of Coinbase and other leading crypto-exchanges will now be able to transfer funds to zkSync Era, the Layer-2 protocol that scales Ethereum with cutting-edge ZK technology.\n\nCoinbase, Kraken, KuCoin: traders can access zkSync Era thanks to Layerswap\n\nLayerswap announced its integration with zkSync Era, which will allow users to transfer funds from a variety of sources, including Coinbase, to zkSync Era in minutes.\n\nIn addition to Coinbase, Layerswap’s list of crypto-exchanges also includes KuCoin, Kraken, Binance.US, Huobi, Bittrex, Bitfinex, and others.\n\nHence, thanks to Layerswap’s new seamless solution, users will be able to make frictionless transfers of tokens such as ETH, USDC, LRC, from 17 exchanges to 16 networks, and transfers from 9 networks to CEXs, as well as cross-chain transfers.\n\nMoreover, with the new integration with zkSync Era, Layerswap aims to join the huge growth being experienced by the Layer 2 protocol scaling Ethereum with cutting-edge ZK technology.\n\nCoinbase and the connection to the zkSync Era ecosystem\n\nOverall, the zkSync Era project has been funded to the tune of $458 million by the Ethereum Foundation and other venture capitalists such as a16z, Dragonfly, Coinbase Ventures, Blockchain Capital, and others.\n\nSince its launch, zkSync Era has seen a huge surge in network activity, the highest that any Ethereum scaling solution has ever experienced in such a short period.\n\nAs Messari points out, zkSync Era’s growth in Q1 2023 was greater than even Polygon’s zkEVM in terms of TVL (or Total Value Locked in DeFi).\n\nIn the few weeks since the launch of@zksync's Era and @0xPolygon's zkEVM, the zkSync ecosystem has been growing at a rapid pace.\n\n\n\nAt the end of Q1, zkSync had nearly $200M in TVL across its ecosystem while Polygon’s zkEVM had seen little adoption in comparison. pic.twitter.com/FT5aGf1CQg — Messari (@MessariCrypto) May 14, 2023\n\nzkSync’s new Layer 2 scaling solution can scale Ethereum without compromising network security, offering fast, low-power transactions.\n\nNot only that, zkSync is also part of the rollup category, which are those blockchain innovations that allow a group of transactions that occur off-chain to be wrapped, validating only one transaction made in the main substrate.\n\nThe future airdrop of zkSync Era\n\nRecently, there has been an analysis of everything there is to know about a future airdrop of zkSync Era.\n\nFirst, it is worth mentioning that the zkSync technology was invented by Matter Labs, the company that set out to scale Ethereum through Zero-Knowledge proofs, so as to maintain the principles of freedom and decentralization.\n\nCurrently, there are two versions of zkSync, the 1.0 version called zkSync Lite and the 2.0 version called zkSync Era, which, unlike the former, offers the ability to implement smart contracts.\n\nThat said, in order to achieve a future airdrop of zkSync Era, it is deemed appropriate, for those who have not already done so, to transfer some of their ETH onto the two blockchains. Using MetaMask’s self-custodial crypto-wallet, it will be possible to transfer one’s ETH to zkSync Lite and zkSync Era."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmJsb2NremVpdC5jb20vaG93LWVpZ2VubGF5ZXItaXMtZ29pbmctdG8tcmV2b2x1dGlvbml6ZS1ibG9ja2NoYWluLXNlY3VyaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "How EigenLayer Is Going To Revolutionize Blockchain Security - Blockzeit",
        "content": "Blockchain technology has transformed the way we conduct transactions online. With the rise of decentralized finance, the security of these networks has become more important than ever. Enter EigenLayer or Eigen, a restaking protocol that is poised to change the way we think about blockchain security.\n\nWe've led the $50M Series A financing of @eigenlayer!\n\n\n\nFounder @sreeramkannan is a technical visionary who's revolutionizing our ecosystem.\n\n\n\nMore on our thesis. ↓ pic.twitter.com/ozO9F8PbDw — Blockchain Capital (@blockchaincap) March 28, 2023\n\nWhat is EigenLayer?\n\nAccording to its maker, EigenLabs, EigenLayer is a blockchain utilizing a protocol based on the security-as-a-service (SECaaS) concept. It rehypothecates or puts back to work staked Ethereum to provide security for other, newer projects. This means that the Ethereum network is being used to secure other projects, providing an added layer of security to the entire blockchain ecosystem.\n\nHow Does EigenLayer Work?\n\nThe Ethereum network uses a proof-of-stake consensus mechanism to secure the network. This means that validators can join the network by staking 32 ETH and they can earn an ETH-denominated yield as a reward according to Decrypt. However, if a validator fails to do its job or behaves maliciously, it will be penalized, and a portion of its staked ETH will be taken away.\n\nEigenLayer goes beyond staking Ethereum by reusing staked ETH to enhance security for other blockchain projects. This also enables stakers who participate to earn a higher yield and benefit from the success of multiple projects. Likewise, it makes it more convenient for developers to deploy their projects with the confidence that they are backed by a secure and reliable network.\n\nFor added context, there’s a total of 20 million Ethereum staked right now to keep its blockchain secure. This involves the participation of over 625,000 validators. As of writing, a unit of ETH is trading over $1,800.\n\nStatus of EigenLayer\n\nAs of March this year, the team behind this platform, EigenLabs, has already raised $50 million in a Series A round. The funding round was facilitated by Blockchain Capital, which is a venture firm focused on the blockchain industry.\n\nThe new protocol was praised by none other than Joseph Lubin, the co-founder of Ethereum. In his tweet, he stated that the work that EigenLabs is doing now puts them at the forefront of the “most exciting work” happening in the Ethereum blockchain. Additionally, he expressed his support to Sreeram Kannan, the founder of EigenLayer, and the rest of the team behind the new platform.\n\nThe Eigen Labs team is at the forefront of some of the most exciting work happening in Ethereum. @etherealvc is proud to have supported @sreeramkannan and the @eigenlayer team since inception. https://t.co/WP6qu5rW5z — Joseph Lubin (@ethereumJoseph) March 29, 2023\n\nBenefits of Restaking Early with EigenLayer\n\nSo far, there’s no definite timeframe for the launch of the EigenLayer Mainnet, but there are indications that it’s drawing near. With that, EigenLabs promises the following benefits to those who choose to restake their ETH to EigenLayer before its launch:\n\n1. Secured Spot\n\nBy restaking early, users can secure their place within the EigenLayer ecosystem and gain an advantage over those who wait to restake. This can help them maximize their staking opportunities and potentially earn greater rewards over time.\n\n2. Skip the Withdrawal Queue\n\nNative restakers identified by their 0x00 prefixes get to bypass the withdrawal queue and directly connect their validators to EigenLayer’s contracts, which could potentially streamline the process of withdrawing staked tokens.\n\n3. Maximize Staking Opportunities\n\nIt allows users to enjoy the earliest possible access to restaking on services that launch on EigenLayer. Some services may cap their initial restake amounts, so restaking early can help early adopters to take advantage of these more flexible opportunities.\n\n4. Access to Premium Services\n\nThose who choose to restake early with EigenLayer can take advantage of a variety of exclusive benefits, including access to curated working groups with EigenLabs, operators, modules, and other restakers. This will enable them to stay informed about the latest developments and network with other important players in the EigenLayer ecosystem.\n\nFinal Thoughts\n\nEigenLayer is an innovative protocol that promises to revolutionize the blockchain industry. By utilizing a restaking mechanism, it aims to provide an added layer of security to the entire blockchain ecosystem.\n\nWith its promising benefits, such as a secured spot, skipping the withdrawal queue, maximizing staking opportunities, and accessing premium services, early restakers can enjoy greater rewards over time. As the EigenLayer Mainnet launch draws near, restaking early could prove to be increasingly advantageous.\n\nOverall, EigenLayer is a project to watch out for, and it could potentially transform the way we think about blockchain security."
    }
]