[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMTMvaG93LXRoZS1zZWMtY291bGQtcmVzaGFwZS1ldGhlcmV1bXMtc3Rha2luZy1sYW5kc2NhcGUtZm9yLXRoZS1iZXR0ZXIv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMi8xMy9ob3ctdGhlLXNlYy1jb3VsZC1yZXNoYXBlLWV0aGVyZXVtcy1zdGFraW5nLWxhbmRzY2FwZS1mb3ItdGhlLWJldHRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "How the SEC Could Reshape Ethereum’s Staking Landscape for the Better - CoinDesk",
        "content": "How the SEC Could Reshape Ethereum’s Staking Landscape for the Better\n\nBy shutting down Kraken’s staking service, the SEC could shift power over Ethereum toward solo stakers and decentralized alternatives."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYmxvZy5rcmFrZW4uY29tL3Byb2R1Y3QvZXRoLWRlcG9zaXRzLWFuZC13aXRoZHJhd2Fscy1hdmFpbGFibGUtb24tYXJiaXRydW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "ETH deposits and withdrawals available on Arbitrum! - Kraken Blog",
        "content": "We’re thrilled to announce that Kraken now supports deposits and withdrawals of Ethereum (ETH) on Arbitrum!\n\nArbitrum is a Layer 2 (L2) blockchain protocol built on top of the Ethereum blockchain that allows Ethereum transactions to be processed more efficiently.\n\nBy increasing the amount of transactions Ethereum can process, as well as the speed with which it can process them, Arbitrum has the additional benefit of reducing transaction costs, known as gas fees, associated with using Ethereum and its various decentralized applications.\n\nArbitrum also allows developers to create and execute their own Ethereum-compatible smart contracts. These can be programmed to run decentralized applications that can interact with the broader Ethereum ecosystem without bogging down the main blockchain’s performance.\n\nFunding\n\nFunding is already live. You can transfer Ethereum (ETH) to your Kraken account by navigating to Funding, selecting ETH and in the drop-down box the desired deposit method (network): Arbitrum One Network.\n\nNote: ETH deposits and withdrawals on Abritrum via the Kraken Pro App and Kraken App won’t be available at launch.\n\nGot ETH (Ethereum) on Arbitrum and a Kraken account? ⤵️\n\nHere’s what you need to know about the assets: Ethereum (ETH) is a global, open-source platform for decentralized applications. Ethereum is a marketplace of financial services, games and apps that is trustless, decentralized and secure. ETH is the cryptocurrency powering the Ethereum network. It’s used to pay for transactions, as a store of value or peer-to-peer payment method, or as collateral to generate entirely different crypto tokens that run on Ethereum. Learn how to add ETH to your crypto portfolio with our Learn Center article How to Buy Ethereum (ETH). Ready to deposit but don’t have a Kraken account yet? Sign up today! Get started with Kraken Will Kraken make more assets available? Yes! But our policy is to never reveal any details until shortly before launch – including which assets we are considering. All of Kraken’s available tokens can be found here, and all future tokens will be announced on Kraken’s blog and social media profiles. Our client engagement specialists cannot answer any questions about which assets we may be making available in the future. Trade with caution There is no guarantee that a limit order will execute. There is also no guarantee a market order will execute at a certain price. The availability and liquidity of the particular digital asset will impact these types of orders.\n\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, stake or hold any cryptoasset or to engage in any specific trading strategy. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your cryptoassets and you should seek independent advice on your taxation position. Geographic restrictions may apply."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAyLzEzL21hY3JvLWd1cnUtcmFvdWwtcGFsLXByZWRpY3RzLTEwMDAwLWV0aGVyZXVtLWJ1dC1zYXlzLW90aGVyLWV0aC1yaXZhbHMtd2lsbC1vdXRwZXJmb3JtL9IBfGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAyLzEzL21hY3JvLWd1cnUtcmFvdWwtcGFsLXByZWRpY3RzLTEwMDAwLWV0aGVyZXVtLWJ1dC1zYXlzLW90aGVyLWV0aC1yaXZhbHMtd2lsbC1vdXRwZXJmb3JtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Macro Guru Raoul Pal Predicts $10,000 Ethereum – But Says Other ETH Rivals Will Outperform - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal says that Ethereum is destined to reach a five-figure price in the next crypto bull market, and that some of ETH’s biggest rivals will outperform.\n\nIn a new interview teaser with Altcoin Daily, Pal says that Ethereum will probably present the best risk-adjusted returns moving forward, but that plenty of other competing altcoin projects could still post higher gains.\n\n“ETH is the money of the internet. And I don’t think it’s going to lose that. But, that doesn’t mean it’s the best performer. Because we’re going to push use cases elsewhere for innovation.\n\nWe’ve got things like Sui coming. Aptos hasn’t been fully utilized yet. We need to see the network effects. Solana, I think they’re aiming for the broadest adoption by making it a consumer-friendly place, to onboard normies. That’s very powerful. If they get that right… and their work with people like Meta and stuff like that – Instagram – is very interesting. That’s super amazing.\n\nPolygon, amazing group, what are they doing? They’re onboarding a lot of people. They’ve got a lot of throughput, super interesting.\n\nSui hasn’t even come on to the market yet, and that is faster, incredible team, stuff like that, so there’s a lot going on here. But ETH is the easiest way because it’s probably got the least risk.”\n\nThe macro expert says that he has a rough price target of about $10,000 for ETH, though he’s not a fan of price predictions.\n\n“I hate doing it but, I don’t see any reason why it’s not above $10,000. I see no reason at all why it’s not above $10,000 so that’s a decent upside from here.”\n\nAt time of writing, ETH is trading for $1,525.\n\nO\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Susanitah/Vladimir Kazakov"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvZml2ZS1ldGZzLXdpdGgtZXhwb3N1cmUtdG8tZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 08:00:00 GMT",
        "title": "Five ETFs with Exposure to Ethereum - BSC NEWS",
        "content": "Disclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: The content in the above article is a press release, provided by a third party. Readers should do their own research before interacting or engaging with the mentioned companies and/or any related services. BSC News is neither directly nor indirectly responsible for any damage or loss caused or alleged to be caused by or in connection with the use of any content, goods or services mentioned in the above article.\n\nDisclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: This is a paid Ask Me Anything (AMA), BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement AMA for $2000 Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the AMA.\n\nDisclaimer: This article is exclusive BSC News Premium Content. Premium content is viewable without a membership for a limited time. After the limited time period expires, readers will need to either subscribe or hold a BSC News NFT to view Premium Content. Visit the BSC News NFT website, Discord, and Twitter to learn more about becoming a Premium member.\n\nDisclaimer: The content of this piece is the opinion of the writer. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research.\n\nDisclaimer: Disclaimer: This article is written by a visiting author. Opinions herein are those of the visiting author. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1kcm9wcy1rcmFrZW4tc2VjLXNldHRsZW1lbnQtMTEyOTExNTE0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Ethereum price drops 9% after Kraken's SEC settlement - Yahoo Finance UK",
        "content": "The crypto market did not respond well to the SEC's attack on crypto exchange Kraken as Ethereum fell on Monday. Photo: Dado Ruvic/Reuters (Dado Ruvic / reuters)\n\nEthereum (ETH-USD) dropped 9% in value on Monday, after crypto-exchange Kraken agreed to end its crypto staking for US customers and pay $30m (£24.9m) to settle a Security Exchange Commission (SEC) charge.\n\nThe crypto market did not respond well to the SEC's attack on Kraken, as the announcement brought an end to the climb of bitcoin (BTC-USD) and ethereum since the beginning of 2023.\n\nPaxos, which partners with Binance to issue the BUSD stablecoin (BUSD-USD), has also been told by a New York regulator to halt the minting of new coins, according to a Bloomberg report.\n\nThe global cryptocurrency market cap has digested the latest regulatory attacks on the industry by falling 1.6% in 24 hours to $1.05tn, according to Coingecko.\n\nADVERTISEMENT\n\nEthereum dropped 9% in the past seven days to $1,483, while bitcoin fell 6.2% to $21,537.\n\nWatch: US Senator: 'Digital assets will be as big as the internet itself' | The Crypto Mile\n\nThe decent into the red began in earnest last Thursday when SEC chair Gary Gensler announced he would be charging Kraken with failing to register the offer and sale of its \"staking as a service\" program.\n\nKraken, which is the third largest crypto-exchange in the world after Binance and Coinbase (COIN), had been offering staking services for at least half a dozen crypto tokens, including ethereum. The exchange advertised annual returns of as high as 21% on some staked instruments.\n\nRead more: Crypto live prices\n\nGensler said: \"Today the SEC charged Kraken for the unregistered offer and sale of securities through its staking-as-a-service program. Whether it’s through staking-as-a-service, lending, or other means, crypto intermediaries must provide the proper disclosures & safeguards required by our laws.\"\n\nGensler released a video to explain to the US public why the SEC is taking such a strict stance against platforms that offer staking services.\n\nToday @SECGov charged Kraken for the unregistered offer & sale of securities thru its staking-as-a-service program.\n\n\n\nWhether it’s through staking-as-a-service, lending, or other means, crypto intermediaries must provide the proper disclosures & safeguards required by our laws. — Gary Gensler (@GaryGensler) February 9, 2023\n\nWhat is 'staking' and how does it relate to Ethereum?\n\nIn the case of ethereum, the second largest cryptocurrency in the world, you need 32 ether to create your own staking node and receive \"staking rewards\" in the same currency. This is called Solo Staking.\n\nStory continues\n\nHowever, most people do not have 32 ethereum to create a node on their own. But, they can instead use a centralised cryptocurrency exchange that offer \"staking as a service\" options.\n\nIn this process they hand over their crypto tokens to the centralised crypto exchange where the tokens are then pooled together and used to help validate transactions on the blockchain. The exchange gets a percentage of the blockchain's staking reward, and so does the customer.\n\nRead more: What is the digital pound and when can you expect it?\n\nThe SEC wants crypto exchanges to register these financial instruments as securities before offering them to customers. This is because staking has risks that are not being articulated to the customer, the SEC said.\n\nOn Saturday Gensler told Andrew Sorkin of the New York Times: \"Investors need to know what Kraken, or any other exhange, is doing with these staked tokens, are they trading against the tokens, or borrowing against those tokens, are they using them for theur own purposes?\"\n\nReferring to November's implosion of the FTX cryptocurrency exchange, Gensler said: \"We have seen this in the crypto field before\".\n\nGensler has said on numerous occasions that the only digital asset that he believes is not a security is bitcoin, which he has conceded should be under the observation of the US Commodity Futures Trading Commission (CFTC).\n\nIn his interview with Sorkin, Gensler added: \"What kraken was doing was asking the American public for their coins, and saying that they will give them a return of between 4% and 21%.\"\n\nGensler cited the Howey Test which is used in the US to discern the difference between investing in a security or a commodity, like copper or wheat.\n\nHe said: \"The problem with Kraken was that they were not disclosing to the investing public the risks that they were entering into.\n\nRead more: Crypto: Will UK banks adopt CBDCs and stablecoins?\n\n\"We have a basic bargain in the United States since the 1930s, you can take whatever risk you want, companies like Kraken can offer investment contracts and investment schemes, but they have to have full, fair and truthful disclosure.\n\n\"This puts the investors in a better position, that's are basic bargain. Kraken where not compliing with that basic law.\"\n\nHe said that the charge against Kraken \"should put everyone on notice who operates in the crypto marketplace\".\n\nHe added: \"When these exchanges take you tokens to put them in staking pools and if that exchange goes bankrupt, the customer stands in line at the bankruptcy court.\n\n\"There is a saying in crypto, not your keys not your coins. Those other platforms who offer staking should take note of this and seek to come into compliance and do the proper disclosures, and registration and the like.\"\n\nWhat is a security?\n\nIn the US, a security is a tradable financial asset, including debt and equity securities (common stocks), and derivatives like forwards, futures, options, and swaps.\n\nThe Howey Test in the US is a method of differentiating between a security and a commodity.\n\nIt is is used to determine if a transaction qualifies as an \"investment contract\" and is subject to disclosure and registration requirements under the Securities Act of 1933 and the Securities Exchange Act of 1934.\n\nIt applies to any contract, scheme, or transaction and determines if there is an \"investment of money in a common enterprise with a reasonable expectation of profits to be derived from the efforts of others.\"\n\nThis is important for assessing blockchain and digital currency projects, as some cryptocurrencies and initial coin offerings (ICOs) may meet the test's definition of an \"investment contract.\"\n\nThe Financial Conduct Authority (FCA) is the national authority regulating financial markets in the UK, and its definition of \"security\" in the Handbook includes equities, debentures, alternative debentures, government and public securities, warrants, certificates, units, pension schemes, investments, and anything on the Official List.\n\nWatch: Kraken ending its crypto staking services for US customers, former SEC attorney weighs in\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tZG9uYXRlcy0yMjdrLXRvLWhlbHAtZWFydGhxdWFrZS12aWN0aW1zLWluLXR1cmtleS1zeXJpYdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Vitalik Buterin donates $227K to help earthquake victims in Turkey - Cointelegraph",
        "content": "Ethereum co-founder Vitalik Buterin has now made at least two substantial contributions to help the victims of last week’s devastating earthquake in Turkey and Syria.\n\nThe 7.8 magnitude earthquake struck on Feb. 6. Its death toll has now risen to 33,000 — one of the world’s worst in decades.\n\nOver the week, the Ethereum co-founder has been one of many actively donating Ether (ETH) to support relief efforts in Turkey. His latest donation was on Feb. 12 for 50 ETH, or approximately $77,000, sent to Anka Relief, according to blockchain security firm PeckShield.\n\nAnka thanked the Ethereum co-founder for his largesse and said that crypto donations had been flowing since the first day.\n\n“Since day 1 of the disaster, we witnessed donations piling in the wallets of a handful of major NGOs. Great that they have attracted and will be attracting more funds,” said the organization.\n\nWe want to thank @VitalikButerin for donating 50 ETH ~$75k to Anka Relief, a crypto aid fund & community to support Türkiye after the recent earthquakes. https://t.co/kGwXSGWL8J\n\n\n\nDive into the thread below to better understand our mission and ops\n\n\n\nhttps://t.co/92CkxevI5e — Anka Relief (@AnkaRelief) February 12, 2023\n\nAnka provided a list of crypto wallets than can be used for donations. The Web3 relief support organization has also spearheaded the Ukraine DAO project to raise crypto donations to support efforts in the besieged country.\n\nThe latest donation adds to another 99 ETH that Vitalik sent in support of earthquake victims. On Feb. 11 the vitalik.eth address sent around $150,000 worth of ETH to Ahbap, a nongovernmental and nonprofit organization dedicated to relief efforts in Turkey.\n\nAhbap has also provided several crypto addresses for various tokens it can accept as donations.\n\nTo date, it claims to have received $4.3 million in crypto donations, with stablecoins being the most popular tokens sent. According to Etherscan, the Ahbap wallet contains 409 ETH, worth $622,000 at the time of writing.\n\nOn Feb. 10, London’s Financial Times reported that crypto donations had been pouring in from across the globe. More than $10 million in crypto had been sent by companies, with Binance alone donating $5 million in support of Turkish relief efforts.\n\nBinance also announced $100 in BNB (BNB) airdrops to those in the hardest-hit areas last week.\n\nRelated: The Web3 community responds to Turkish–Syrian earthquake tragedy\n\nOn Feb. 7, just a day after the devastating quake, Cointelegraph reported how the Web3 community was coming together to arrange crypto donations for NGOs and support.\n\nIt is not the first time crypto has been used for earthquake relief donations. In 2015, Bitcoin donations were sent to relief organizations following a massive quake in Nepal."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2ludmVzdGluZy9iZXN0LWV0aGVyZXVtLWxheWVyLTItY3J5cHRvLXByb2plY3RzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "11 Best Layer 2 Crypto Projects To Check Out Post-Merge (2023) - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9jYW4tZXRoLXB1bGwtb2ZmLWEtc3Ryb25nLWJvdW5jZS1iYWNrLWFzLWV4Y2hhbmdlLWJhbGFuY2VzLXJlYWNoLTQteWVhci1sb3dzL9IBZ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9jYW4tZXRoLXB1bGwtb2ZmLWEtc3Ryb25nLWJvdW5jZS1iYWNrLWFzLWV4Y2hhbmdlLWJhbGFuY2VzLXJlYWNoLTQteWVhci1sb3dzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Can ETH pull off a strong bounce back as exchange balances reach 4-year lows? - AMBCrypto News",
        "content": "ETH bears are losing momentum after a strong pullback in the last few days.\n\nETH exchange balances reach 4-year lows as outflows continue.\n\nEthereum’s native cryptocurrency just concluded the week with a sizable bearish pullback. There is more directional uncertainty as a result, but multiple indicators and metrics may offer some much-needed clarity.\n\nHow much are 1,10,100 ETH worth today?\n\nFor perspective, ETH’s $1534 price tag represents a 9% pullback within the last five days.\n\nA couple of things to note about the price action- The pullback puts it within the 50% RSI level and the bears seem to have lost most of their momentum at this level. In addition, the outflows indicated by the MFI are leveling out.\n\nMore importantly, ETH’s 50-day Moving average recently crossed above the 200-day MA from below, forming a golden cross. The latter is a bullish sign, hence this may yield bullish expectations among investors.\n\nDo ETH bulls have a chance to regain dominance?\n\nSome of ETH’s on-chain metrics are leaning in favor of bullish expectations. The latest Glassnode alerts reveal that the cryptocurrency has been flowing out of exchanges. ETH’s balance on exchanges tanked to a 4-year low of 18,946,696.667 ETH.\n\n? #Ethereum $ETH Balance on Exchanges just reached a 4-year low of 18,946,696.667 ETH Previous 4-year low of 18,948,275.315 ETH was observed on 11 February 2023 View metric:https://t.co/1dCpD2ey8E pic.twitter.com/45yugPfDec — glassnode alerts (@glassnodealerts) February 12, 2023\n\nMost of the ETH flowing out of exchanges is likely headed into DeFi. This may explain the total value of ETH locked in ETH 2.0 deposit contracts just soared to a new ATH.\n\nThis is important because it confirms that ETH holders are more confident in allowing their coins to stay in DeFi. A sign of a favorable shift towards longer-term expectations.\n\n? #Ethereum $ETH Total Value in the ETH 2.0 Deposit Contract just reached an ATH of 15,792,103 ETH View metric:https://t.co/SzbMPqvhlb pic.twitter.com/Ydzv8JmVY5 — glassnode alerts (@glassnodealerts) February 12, 2023\n\nAssessing the level of ETH demand in the market\n\nThe supply of ETH held by the top 1% of addresses registered a slight increase in the last few days.\n\nMeanwhile, the number of ETH addresses holding over 1,000 coins grew slightly in the last three days as opposed to the downside registered since the start of February.\n\nThis confirms that the bears are no longer in control and the taps causing sell pressure are running dry. But what about the demand situation on the derivatives side of things?\n\nWe did see a drop in open interest in the second half of last week but it is now pivoting in favor of the upside. In other words, open interest is returning as the price is showing bullish signs.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe funding rate still has a downward trajectory, likely indicating a lack of strong demand. The above metrics and indicators point toward a possible bullish outcome.\n\nHowever, this is subject to the lack of more FUD potentially triggering another unexpected selloff."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vY3J5cHRvY3VycmVuY2llcy10by13YXRjaC13ZWVrLW9mLWZlYi0xMy03MTA4ODEx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrencies To Watch: Week of Feb. 13 - Investopedia",
        "content": "Keep an Eye on These Coins\n\nAfter hints that it was on the verge of breaking into a strong bullish season, the cryptocurrency market has fallen back again to reside in the red over the past week. Investors may be unhappy that the market has still failed to break resistance levels, but at least some tokens have been performing unusually well.\n\nThis week, we focus on Oasis Network (ROSE), Mina (MINA), Hedera (HBAR), Lido DAO (LDO), and Rocket Pool (RPL). In selecting these assets, we have considered several factors, including positive technical developments, significant news events, and noticeable changes in price.\n\n\n\nKey Takeaways Oasis Network’s ROSE token was one of the biggest gainers this week, with a price increase of 35%, probably thanks to stronger open interest.\n\nThe MINA coin also made a sizable jump, of 32%, likely due to improvements in decentralization and security at the Mina network.\n\nHBAR's price went up 21% after Dell joined its governing council. The network’s ecosystem also has been experiencing growth.\n\nThe LDO token's price increased by 16% amid rumors that the Securities and Exchange Commission (SEC) may ban staking services offered by centralized crypto platforms.\n\nThe Ethereum staking-focused RPL token also rose, by 15%, as the network’s Shanghai upgrade in March gets closer.\n\n\n\nOasis Network (ROSE)\n\nOne of the biggest gainers of the week, the ROSE token of the Oasis Network, possibly benefited from multiple developments within its ecosystem and network. The primary reason for the price bump of about 35% might be the fact that the team on Feb. 2 released its roadmap for 2023, which described launches and improvements. There has also been a sharp increase in open interest, reaching nearly $30 million at Oasis.\n\nOasis Network is a scalability and privacy-focused network built using the Cosmos software development kit (SDK), which is a set of software tools and programs used by developers to create applications. The ROSE token is now priced at around 0.072 cent after beginning last week at 0.055 cent (see chart below).\n\n\n\nROSE (TradingView)\n\nMina (MINA)\n\nMina (MINA) was the next big gainer this week, with the token rising by about 32% to trade at around 93 cents. (see chart below). The price might have been boosted by the launch in late January of a proof of concept that would allow anyone to run a web node on a browser. A proof of concept is an exercise in which work is focused on determining whether an idea can be turned into reality. The effort may eventually allow anyone to run a lightweight node to help run blockchain applications across Web3 and mobile devices.\n\nThe effort is a part of Mina’s overall ethos of increasing accessibility and being the “world’s lightest blockchain.” The network makes use of the novel zero-knowledge proofs technology to power its smart contracts.\n\n\n\nMINA (TradingView)\n\nHedera (HBAR)\n\nHeder’s HBAR price increased by roughly 21% after it said that Dell Technologies (DELL) would join the Hedera Governing Council. Dell will run its own node, build its own application, and help automate distributed ledger technology.\n\nHedera’s ecosystem has also posted growth in recent weeks, including the launch of a non-fungible token (NFT) series called Ashfall NFT. It also publicized the arrival of a metaverse fund valued at $1 million that focuses on Africa’s creative industry. The HBAR coin is now valued at about 0.081 cent, after being priced at 0.069 cent last week (see chart below).\n\nHBAR (TradingView)\n\nLido DAO (LDO)\n\nThe price of Lido DAO (LDO) gained by about 16% as users flocked to non-custodial means of staking Ether. Lido is a liquid staking platform for Ethereum and similar assets.\n\nCoinbase (COIN) CEO Brian Armstrong recently tweeted that the U.S. Securities and Exchange Commission may consider banning staking for retail investors. In reaction to that, crypto users have flocked to self-custodial ETH staking services. LDO now stands at about $2.27. It was priced at about $2.04 last week (see chart below).\n\n\n\nLDO (TradingView)\n\nRocket Pool (RPL)\n\nRocket Pool (RPL) advanced about 15% in price as Ethereum’s Shanghai upgrade in March approaches. The Shanghai upgrade for the Ethereum network is a hard fork that will let holders of ether (ETH), Ethereum's native token, unstake the assets for the first time, giving them greater access to their holdings. This week, the RPL token is valued at around $41.06 (see chart below).\n\nThe Shanghai upgrade will be a major milestone for the Rocket Pool network, which is a staking service for Ether that recently crossed $1 billion in total value locked in. Crypto users have increasingly locked funds into Ethereum and are eager to be able to unstake some of those assets."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ob3ctdG8tYnJpZGdlLXRvLWV0aGVyZXVtLWxheWVyLTJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "How to Bridge to Ethereum Layer 2s - Unchained - Unchained",
        "content": "Say goodbye to high gas fees and slow transactions. This step-by-step guide will show you how to bridge your assets and enjoy faster, cheaper, and more efficient transactions on the Ethereum network.\n\nEthereum suffers from a very good problem to have: it’s popular.\n\nBut with so many people using it and many applications being built upon it, users pay the price, literally. High network congestion drives up transaction costs and makes it difficult for the network to scale.\n\nThat’s where layer-2 blockchains come in.\n\nA layer–2 blockchain is a protocol built atop a layer-1 blockchain such as Ethereum. They borrow the L1’s security attributes and help reduce congestion (and fees) by ferrying transactions off the mainnet in bulk. After executing the transactions, L2s submit a compressed version of their blocks back to the mainnet.\n\nThus, L2 scaling solutions offer the security of Ethereum with fees that shouldn’t burn through your savings. They’re ideal for most regular users, who are overpaying for security they don’t practically need; L2s are less expensive and almost as secure as Ethereum. Here is how you can start using the L2 ecosystem.\n\nStep 1: Choose an L2 for You\n\nThe L2s operating on Ethereum today differ in how they commit to Ethereum. Users can make the most of L2s by understanding their benefits and associated tradeoffs:\n\nZK rollups: Zero-knowledge (ZK) rollups scale Ethereum by processing transactions off-chain and submitting a lightweight validity proof (calculated off-chain) on the Ethereum chain to finalize the transaction batch. Instead of a trash compactor, it’s a transaction compactor that frees up space on the network. One benefit of ZK rollups is that transactions finalize almost instantly. But users pay the price for this (though fees are still lower than they’d typically be on Ethereum). Two popular scaling solutions, StarkNet and Loopring , use ZK-STARKs and ZK-SNARKs, respectively. Polygon is also working on a ZK-based scaling solution called zkEVM .\n\nOptimistic rollups: Optimistic rollups work similarly to ZK rollups by batching transactions and executing them on the L2 instead of on Ethereum. However, to keep fees low, they assume transactions are valid unless someone proves otherwise. Other users can submit fraud proofs during a challenge period that lasts around a week. The downside is that transactions don’t become final until the challenge period ends, so users must wait to move their funds directly from the rollup back to Ethereum. Arbitrum and Optimism are two popular optimistic rollups on Ethereum.\n\n\n\n\n\n\n\n\n\nIn addition to L2s, there’s one other type of scaling solution worth knowing about:\n\nSidechains: Sidechains are not technically L2s because they do not inherit Ethereum’s security. Instead, they operate with separate validators and consensus processes but connect to the Ethereum chain via a two-way bridge. While very scalable, their bespoke security setups may leave them vulnerable to centralization. Polygon PoS is a popular sidechain.\n\nSelecting a specific scaling design can be overwhelming. In addition to factors such as throughput and fees, users must also consider ease of use and their comfort level with security. Bridging across all L2s follows similar steps, but we have used Arbitrum One to illustrate the steps below.\n\n\n\n\n\n\n\n\n\nStep 2: Set Up Your Ethereum Wallet\n\nBefore you can start using an L2, you must first set up your Ethereum wallet. MetaMask is the most popular online wallet for the Ethereum ecosystem, but you may also use others, such as WalletConnect. (The steps below will use MetaMask.)\n\nIf you haven’t already, install MetaMask on your preferred device and create a wallet by setting a password and securely copying the seed phrase. You now have an Ethereum account!\n\nNext, head into your MetaMask settings and add your destination network.\n\nNote that when you add another L2 network, Metamask will do so under the same public address. Add sufficient ETH into your Ethereum wallet to cover the desired amount and gas, which is the unit of transaction fees on the Ethereum network. The gas cost rises as traffic on the Ethereum network increases, and is known to cost anywhere between a few dollars and a few hundred dollars. Because the gas is unaffected by the value of the tokens you transfer, we’d advise transferring all the funds you expect to use on the L2 in one go. It’s the difference between paying a transaction fee just once or a similarly sized fee every time you transfer.\n\nStep 3: Start Bridging\n\nYou have two general choices for bridging. You can use the official gateway (in this case, Arbitrum) or select a third-party bridge such as Multichain or Celer. (Third-party bridges sometimes offer competitive fees and broader network options.) Gas fluctuates frequently, so double-check gas charges before submitting the transaction to ensure you pay the expected amount. If gas gets too high, you can either wait for it to cool down or pay the premium. Once final, the transaction becomes immutable.\n\nAn Arbitrum transaction sample\n\nArbitrum vs. Ethereum fee comparison\n\nStep 4: Verify the Transaction on Etherscan\n\nEtherscan is a blockchain explorer. Since the genesis block, it has stored all publicly available information like gas, block time, and transaction hash for all Ethereum transactions. To make sure your transaction went to the L2, enter the address.\n\nEtherscan sample\n\nStep 5: Use the L2\n\nLayer–2 networks are brimming with activity these days. From DeFi to the metaverse, nearly every mainstream application on Ethereum is compatible with leading L2s such as Arbitrum and Optimism. Trade tokens on Uniswap, buy NFTs on OpenSea, or do whatever you would otherwise use Ethereum for — only with cheaper transactions.\n\nDapps on Arbitrum | Source: DefiLlama\n\nPro tip: If you like to try out new or experimental applications, keep in mind that they could be malicious or untested. Minimize the risk of losing your funds by spreading them across multiple addresses.\n\nYou can manage multiple addresses on MetaMask\n\nStep 6: Head Back to Ethereum\n\nMoving funds back to Ethereum is optional. Some users secure their L2 earnings by sending them to Ethereum, while others never return. If you do choose to bridge back to Ethereum, follow the same steps as before, this time with the L2 as the sender chain.\n\nConclusion\n\nLayer-2 scaling solutions can be nearly as secure as Ethereum at a fraction of the cost. Users can make the most of L2s by finding a rollup design that suits their needs.\n\nL2s are so crucial to the Ethereum ecosystem that an entire phase of the Ethereum improvement roadmap is dedicated to making them more efficient and economical. Dubbed “the Surge,” this next phase will boost the utility of L2s by enabling transactions to become final in under a second."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vbWVkaXVtLmRhdGFkcml2ZW5pbnZlc3Rvci5jb20vdGhlLWV0aGVyZXVtLXNoYW5naGFpLXVwZ3JhZGUtaW1wYWN0LWFuZC1hbmFseXNpcy0yMzMyNDYyZmYzNDXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 12:30:46 GMT",
        "title": "The Ethereum Shanghai Upgrade: Impact and Analysis - DataDrivenInvestor",
        "content": "The Ethereum Shanghai Upgrade: Impact and Analysis | Photo by Michael Förtsch on Unsplash\n\nMember-only story\n\nEthereum Gets an Upgrade: What You Need to Know\n\nThe Ethereum Shanghai Upgrade: Impact and Analysis\n\nExploring the Potential Impacts of the Shanghai Upgrade Smart Finance · Follow Published in DataDrivenInvestor · 7 min read · Feb 12, 2023 -- 1 Share\n\nHey, fellow finance enthusiasts!\n\nAre you ready for the next big thing in the Ethereum world?\n\nGet ready for the Shanghai Upgrade, set to take place in March this year. This upcoming network upgrade has the potential to take Ethereum to new heights and change the game for crypto investors.\n\nBut, what exactly is this upgrade, and how will it impact the Ethereum price?\n\nLast September, the long-awaited merger of the Beacon Chain with Ethereum (The Merge) was finally accomplished, and it was a huge moment for the crypto community. This upgrade was highly anticipated for years and set the foundation for Ethereum 2.0 a fully scalable Layer1 blockchain for the Web3. Despite the switch to Proof of Stake (PoS) consensus algorithm, Ethereum still needs more scalability.\n\nThis is where the Shanghai Upgrade comes in. This upgrade will pave the way for introducing sharding, which will finally make Ethereum scalable. The Hard Fork is scheduled for mid-March and will allow Ethereum validators and investors to withdraw their staked Ethereum (ETH) from the Beacon Chain for the first time since its introduction in December 2020.\n\nWith around 16.4 million ETH, or approximately one-seventh of all Ethereum, currently locked on the Beacon Chain, worth a total of $26 billion, the Hard Fork has the potential to have massive implications for the entire Ethereum ecosystem and, ultimately, the price of ETH.\n\nGet Ready to Unlock the Power of Ethereum’s Shanghai Upgrade!\n\nThe world of cryptocurrency and blockchain technology is constantly evolving, and the latest update from the Ethereum community is no exception. The Ethereum Shanghai Upgrade is a big step forward for the future of the Ethereum network, and it’s about to make a big impact.\n\nAt the heart of the Ethereum Shanghai Upgrade is EIP-4895, a proposal that will unlock the 16.4 million ETH that’s currently locked up on the Ethereum network. This move will…"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY3J5cHRvLm5ld3MvYWF2ZS1kZXBsb3lzLWRhaS1zdGFibGVjb2luLWNvbXBldGl0b3Itb24tZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Aave deploys DAI stablecoin competitor on Ethereum - crypto.news",
        "content": "Aave has launched its algorithmic stablecoin, GHO, backed by multiple crypto assets, including ethereum (ETH). GHO will be an alternative to DAI, a stablecoin minted by MakerDAO.\n\nAave’s GHO is live\n\nAfter more than one year in development, Aave, the world’s second-largest decentralized finance (DeFi) protocol, has launched GHO (pronounced “go”), an overcollateralized decentralized algorithmic stablecoin on Ethereum.\n\nOn July 15, Aave said DeFi market participants could mint the GHO stablecoin by depositing supported collateral assets into the Aave Protocol V3 on Ethereum.\n\nLet's GHO! Congrats to the @AaveAave community on the Mainnet Launch. https://t.co/vI7JbMLYb4 — GHO (@GHOAave) July 15, 2023\n\nUnlike popular stablecoins like tether (USDT), issued by centralized entities, the GHO algorithmic stablecoin will be issued and managed by AaveDAO, a decentralized autonomous organization.\n\nIn correspondence with Bloomberg, Stani Kulechov, founder and CEO of Aave, said revenue generated by GHO will be allocated to the project’s community contributors, including security experts, developers, and others.\n\nThe Aave team says all GHO transactions will be handled by self-executing smart contracts, with transaction data, reserves, and other key information regarding the stablecoin verifiable on-chain, underscoring the project’s transparency.\n\nCrypto, DeFi, and stablecoins\n\nDespite the transparency offered by decentralized stablecoins, their centralized counterparts still dominate the market. The collapse of UST, a Terra algorithmic stablecoin project last year, proved that the so-called decentralized stablecoins are not immune to the risks of manipulation and de-pegging.\n\nMarkerDAO’s DAI, which managed to recover from a de-peg event in March, is the world’s largest algorithmic stablecoin, with a market cap of $4.27 billion.\n\nAt the time of writing, GHO trades at $0.993870 with a total supply of 2,267,933 GHO, according to CoinGecko.\n\nWhether Aave’s GHO stablecoin will gain traction and potentially overtake DAI or USDT remains to be seen.\n\nFollow Us on Google News"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMi8xMy9jb2luLWJ1cmVhdS1wcmVkaWN0cy1ldGhlcmV1bS1mbGlwcGVuaW5nLW5leHQtYnVsbC1jeWNsZS1zYXlzLW9uZS1hbHRjb2luLXN0aWxsLWhhcy1tYWpvci11cHNpZGUv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAyLzEzL2NvaW4tYnVyZWF1LXByZWRpY3RzLWV0aGVyZXVtLWZsaXBwZW5pbmctbmV4dC1idWxsLWN5Y2xlLXNheXMtb25lLWFsdGNvaW4tc3RpbGwtaGFzLW1ham9yLXVwc2lkZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Coin Bureau Predicts Ethereum Flippening Next Bull Cycle, Says One Altcoin Still Has Major Upside - The Daily Hodl",
        "content": "Guy Turner from Coin Bureau is keeping a close eye on Ethereum (ETH) and one other altcoin, predicting that the crypto assets have much more to rise.\n\nIn a new interview on the CryptoBusy podcast, Turner says that he believes Ethereum will eventually usurp Bitcoin (BTC) and become the leading crypto by market cap.\n\nHowever, Turner notes that such an event wouldn’t be as significant as most people believe.\n\n“I guess the important thing about whether the flippening happens or not is that it isn’t a big deal. I think a lot of maxis on either side of the fence tend to get worked up about it and stuff.\n\nThey have different roles. They’re doing different things, so [if] ETH flips BTC or doesn’t, it’s not really a big deal as far as I’m concerned.\n\nI personally think it will probably happen given the just continued growth of Ethereum’s ecosystem and how many people I think in the future will be using it. And it will be one of those things you’ll be using without really realizing it.”\n\nTurner says he only envisions Ethereum growing due to its versatility and constant upgrades.\n\n“I can only see Ethereum growing. I mean, it’s got so much market share at the moment. It is constantly evolving, constantly finding new things, and we’ve already got this whole layer-2 ecosystem system built on top of it already. I really do feel that Ethereum is going to be the base layer, the base chain.”\n\nThe crypto analyst is also closely watching interoperable blockchain ecosystem Cosmos (ATOM), saying that the digital asset has yet to fulfill its potential.\n\n“I still think ATOM has a long way to go… ATOM, in the last bull market, as I remember, I don’t think it fulfilled its potential yet by any means.”\n\nEthereum is trading for $1,524 at time of writing while ATOM is worth $13.48.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/tykcartoon"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMTMvYXJiaXRydW0tYmFzZWQtZ214LXN1cnBhc3NlZC1ldGhlcmV1bS1ibG9ja2NoYWluLWluLWRhaWx5LWZlZXMtb3Zlci13ZWVrZW5kL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMTMvYXJiaXRydW0tYmFzZWQtZ214LXN1cnBhc3NlZC1ldGhlcmV1bS1ibG9ja2NoYWluLWluLWRhaWx5LWZlZXMtb3Zlci13ZWVrZW5kL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Arbitrum-Based GMX Surpassed Ethereum Blockchain in Daily Fees Over Weekend - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAyLzEzL2JpdGNvaW4tcmVhZHktZm9yLW5ldy1sZWctdXAtYXMtZXRoZXJldW0tZmxhc2hlcy1wZXJmZWN0LXByaWNlLXBhdHRlcm4tcG9wdWxhci1hbmFseXN0L9IBfGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAyLzEzL2JpdGNvaW4tcmVhZHktZm9yLW5ldy1sZWctdXAtYXMtZXRoZXJldW0tZmxhc2hlcy1wZXJmZWN0LXByaWNlLXBhdHRlcm4tcG9wdWxhci1hbmFseXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Ready for New Leg Up As Ethereum Flashes ‘Perfect’ Price Pattern: Popular Analyst - The Daily Hodl",
        "content": "A crypto analyst who correctly called the 2018 market bottom for Bitcoin says BTC could be gearing up for fresh rallies as Ethereum (ETH) flashes a bullish signal.\n\nPseudonymous analyst Smart Contracter tells his 220,300 Twitter followers that Bitcoin has likely completed its corrective period and could now be ready for a burst to the upside.\n\n“Honestly think that is the low for BTC, aiming for another leg up on daily to $25,500 from here.”\n\nSmart Contracter is a popular practitioner of Elliott Wave theory, a technical analysis approach that aims to predict future price action by following crowd psychology that tends to manifest in waves. According to the theory, a bullish asset undergoes a five-wave rally, where waves one, three and five are impulse surges and waves two and four are corrective periods.\n\nLooking at the analyst’s chart, he appears to predict the end of wave four with wave five currently underway. At time of writing, Bitcoin is worth $21,821.\n\nAs for Ethereum, the crypto strategist believes that ETH bulls have managed to successfully defend the uptrend line of an ascending channel.\n\n“Perfect base channel retest on ETH daily.\n\nSend.”\n\nThe crypto strategist is also watching the price action of peer-to-peer payments network Litecoin (LTC). According to Smart Contracter, Litecoin is flashing bullish signals against Bitcoin (LTC/BTC) after the pair took out multiple resistances on the lower timeframe.\n\n“LTC so far one of the first of the majors to recover.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/SF Textitle Design"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tY28tZm91bmRlci1kaWRudC1leHBlY3QtbmZ0cy10by1iZS10aGlzLXN1Y2Nlc3NmdWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 08:00:00 GMT",
        "title": "Ethereum co-founder didn't expect NFTs to be this successful - crypto.news",
        "content": "Vitalik Buterin, the co-founder of Ethereum, in a recent podcast, revealed that he didn’t expect non-fungible tokens (NFTs) to be as successful as it is at the moment.\n\nI didn’t expect NFTs to be this successful\n\nButerin, often the face of Ethereum and one of the six co-founders of the smart contracting platform, remains impressed at how the NFT industry has been gaining traction in recent years.\n\nIn his assessment, the co-founder said that among the many ideas he had projected to take root, Ethereum excluded the concept of creating non-fungible assets that can be transferred on-chain, representing value.\n\nHe said:\n\n“NFTs are probably the one thing that I did not predict, by the way. If you look at the list of applications that were in the Ethereum Whitepaper, and you look at the applications that are popular today, the big thing that’s in the second list and not the first is NFTs.”\n\nInstead, Vitalik had foreseen smart contracts shaping finance, resulting in the current spark in decentralized finance, and other fortes.\n\nAt the moment, decentralized finance protocols, including Lido Finance, MakerDAO, and Uniswap, are among the top dApps with billions in total value locked (TVL).\n\nUniswap, for example, has dominated the decentralized swapping of tokens, recently introducing the support of NFTs. During the interview, Vitalik said the launch of Uniswap in late 2018 ushered in the era of DeFi. By early 2020, DeFi TVL rose to above $1b for the first time.\n\nOther noteworthy applications in DeFi include MakerDAO, which was reported to be one of the most active DAOs, together with Optimism DAO. The protocol has impacted how users can lend and borrow digital assets without including the services of a third party.\n\nAs an industry, DeFi protocols control over $48b of different assets in protocols launched in several blockchains, including in Ethereum, the BNB Chain, Cardano, Polygon, and others.\n\nNFTs are core to crypto\n\nAmid the expansion of DeFi, gaming, metaverse, and other applications in Ethereum and smart contracting platforms is the rise of NFTs. NFTs allow users to create unique assets which, like fungible tokens, can be transferred in public chains. In Ethereum, NFTs mostly comply with the ERC-721 standard. However, depending on what its creators want, it can be designed to adopt other NFT standards, including ERC 1155.\n\nNFTs have found application in various spheres, including DeFi. For instance, Uniswap v3 uses liquidity NFTs, while gaming and metaverse platforms integrate NFTs to reward players.\n\nFollow Us on Google News"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93b3JtaG9sZS1oYWNrZXItbW92ZXMtYW5vdGhlci00Nm0tb2Ytc3RvbGVuLWZ1bmRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Wormhole hacker moves another $46M of stolen funds - Cointelegraph",
        "content": "The ill-gotten crypto from one of the industry’s largest exploits is on the move again, with on-chain data showing another $46 million of stolen funds has just shifted from the hacker’s wallet.\n\nThe Wormhole attack was the third-largest crypto hack in 2022, resulting from an exploit of Wormhole’s token bridge in February 2022. Around $321 million of Wrapped ETH (wETH) was stolen.\n\nAccording to blockchain security firm PeckShield, the hacker’s associated wallet has become active once again, moving $46 million worth of crypto assets.\n\nThis was made up of around 24,400 Lido Finance-wrapped Ethereum staking token (wstETH), worth approximately $41.4 million, and 3,000 Rocket Pool Ethereum staking token (rETH), worth about $5 million, which was moved to MakerDAO.\n\nThe hacker appears to be seeking yield or arbitrage opportunities on their stolen loot as the assets were exchanged for 16.6 million DAI, PeckShield reported.\n\nThe MakerDAO stablecoin was then used to buy 9,750 ETH priced at around $1,537 and 1,000 stETH. These were then wrapped back into 9,700 wstETH.\n\nOn Feb. 10, an on-chain sleuth observed that the hacker was “buying the dip.”\n\nHowever, the price of Ether (ETH) has since fallen below those levels over the past few hours. At the time of writing, ETH was down 2.6% on the day at $1,505, according to CoinGecko.\n\nAt the time of the transfers, stETH prices depegged from Ethereum and climbed as high as $1,570. At time of writing, they were trading 2.4% higher than ETH at $1,541. Furthermore, wstETH also had depegged and risen to $1,676, 11.3% higher than the underlying asset.\n\nRelated: Crypto exploit losses in January see nearly 93% year-on-year decline\n\nThe latest funds movement comes only a few weeks after the hacker moved another $155 million worth of Ethereum to a decentralized exchange.\n\nOn Jan. 24, 95,630 ETH was sent to the OpenOcean DEX and then subsequently converted into ETH-pegged assets, including Lido’s stETH and wstETH."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy95ZXJlcS1nZW8tdG9rZW4tZGVzaWduZWQtZXRoZXJldW0tMDAwMDAwNjg5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Yereq Geo Token, designed on the Ethereum network, the Ultimate Solution for EV Charging Services. - Yahoo Finance",
        "content": "Yereq Geo Energy\n\nYEREQ GEO is a decentralized platform. A cryptocurrency with multiple uses in the EV (Electric Vehicle) sector, the YEREQ GEO Token was created on the Ethereum network.\n\nSAN FRANCISCO, CA, Feb. 13, 2023 (GLOBE NEWSWIRE) -- In the latest development, Yereq Geo Token, designed on the Ethereum network, is the ultimate solution for EV charging services. It is utilized as a payment method for EV charging services and a system of rewards for EV charging station operators who are crucial to the expansion of the sharing EV economy.\n\n\n\nCharging as a Service\n\nWith the YEREQ GEO app, you must have a phone to start charging your EV immediately. The application instantly creates a guest account and bills the service using the balance in your token. It offers a quick and convenient option to charge your EV without the need for membership accounts or credit cards.\n\n\n\n\n\nYEREQ GEO app\n\n\n\n\n\nUsers can connect directly to charging stations and make payments using YEREQ GEO Energy Tokens thanks to the platform's mobile app, which is the first EV charging software in the world to support its own cryptocurrency token.\n\nA platform at the forefront of the electric vehicle (EV) sector, YEREQ GEO Energy provides distinctive solutions and a reliable investment initiative. As a useful addition to the cryptocurrency industry and a platform to observe in the years to come. The platform combines technology and conventional assets.\n\n\n\n\n\nGeorge E. Bingham, CEO of YEREQ GEO Energy Inc.\n\nGeorge E. Bingham, a leader who brings his expertise to help YEREQ GEO Energy to be the next multi-Billion-dollar brand in the renewable energy sector. Mr. Bingham has built multiple number one organizations and several of the fastest growing organizations in the nation. He has held multiple titles such as CEO, Presidential Director, Diamond and Pearl Distributor and Executive Vice President. Mr. Bingham has owned a hydrogen generator, which was specifically designed to increase engine efficiency and fuel economy while reducing pollutants. Mr. Bingham has a background in real estate, contract law and insurance and volunteers, and helps families in need to succeed in today’s economy. His number one goal is to give, not just receive.\n\nStory continues\n\nAbout YEREQ Geo\n\nYEREQ, a deflationary and decentralized token, will be accepted as payment for EV charging online. For the YEREQ EV Charging ecosystem, which was created to aid in the construction of EV Charging stations across the USA, the YEREQ token serves as the main support and utility token. As a blockchain node network for YEREQ tokens consumption depending on kilowatts used to charge an electric car, each EV charger contains its own software and hardware.\n\nMedia Contact\n\nWebsite: https://www.yereqgeo.energy\n\n\n\nCONTACT: Wes Rustin Yereq Geo Energy LLC support at yereqgeo.com\n\n\n\n"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1kb25hdGVzLTE1MC1ldGgtdG8taGVscC1lYXJ0aHF1YWtlLXZpY3RpbXMtaW4tdHVya2l5ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Donates 150 ETH to Help Earthquake Victims in Türkiye - DailyCoin",
        "content": "Buterin, considered the youngest crypto billionaire, has been active in philanthropy over the last few years.\n\nFor example, Buterin donated at least $5 million to various Ukrainian charities and NGOs since the country got invaded almost a year ago.\n\nOn top of that, Buterin made some of his donations to Ukraine using Tornado Cash. This Ethereum-based mixer was banned by the U.S. Treasury Department’s Office of Foreign Assets Control (OFAC).\n\nButerin has also donated to various medical causes. For example, the Ethereum co-founder donated $9.4 million in USDC to the University of Maryland last year to fund a research initiative that could prevent future pandemics.\n\nOne of the more memorable of Buterin’s donations is the $100 million in USDC he donated to CryptoRelief, India’s COVID-19 relief fund. Buterin got the $100 million after someone sent him one billion Shiba Inu (SHIB) tokens.\n\nButerin later received the $100 million donation back from CryptoRelief because it would be faster and more efficient for him to deploy the funds elsewhere in the biotechnology and medical space."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pbmZ1cmEtaXMtdG8tYmxhbWUtZm9yLW1ldGFtYXNrLXMtdmlvbGF0aW9uLW9mLXRoZS1jcnlwdG8tc3Bpcml00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Infura is to blame for MetaMask's violation of the crypto spirit - Cointelegraph",
        "content": "Censorship resistance is the foundation of crypto, so for many cryptocurrency purists, the Nov. 23 announcement by ConsenSys, the New York-based company behind the leading Ethereum browser wallet, informing its 20 million MetaMask users that their IP and wallet addresses would be collected was simply a gross violation of the crypto spirit.\n\nIn the weeks that followed, ConsenSys first reacted by saying the data collected would only be retained for seven days and then that it had updated the MetaMask features to allow users to opt out of Infura. However, the question remains: Have they done enough to establish crypto resistance?\n\nWhile many may be OK with MetaMask tracking users’ wallets and IP addresses, many more of us are not because blockchain is supposed to be about decentralization and giving people the power to control their data and their finances without intermediaries — such as banks and governments.\n\nRelated: Are we still mad at MetaMask and ConsenSys for snooping on us?\n\nFor the sake of a healthy debate, let’s say we are fine with MetaMask tracking users’ wallets and IP addresses in certain acceptable instances. Those reasons could be in the case of a malicious attack. The information gathered by the Infura protocol could help track down the criminals involved.\n\nPerhaps, more importantly for ConsenSys, the “spying” could have more to do with official regulations, such as Know Your Customer laws, Anti-Money Laundering laws and financing terrorism.\n\nHowever, the reasoning behind the decision to “spy” or end MetaMask user privacy features is highly concerning — and even a bit frightening — because it clearly contravenes the crypto spirit.\n\nControl and ownership back to users\n\nThe crypto spirit centers on putting people back in control of their assets so they can do what they with them and when they wish and have ownership over their data so they can participate in the decentralized economy, such as the machine economy, by monetizing their information.\n\nInfura is mainly to blame for violating the crypto spirit by tracking users’ IP and Ether (ETH) wallet addresses while advising MetaMask’s users to spin up a whole new Ethereum node or to use a different node provider if they are so concerned over lnfura’s intrusions.\n\nSo MetaMask says \"Just don't use Infura\" - so let's see how easy MetaMask makes it to \"not use Infura\".\n\n\n\nPart 1 - Installation:\n\n\n\nThe first two screens are straight forward here. They seem to provide a clear privacy policy, that's good. pic.twitter.com/9HqLo4h18U — Chase Wright (mysticryuujin.eth ) (@mysticryuujin) November 25, 2022\n\nSuppose Infura (or any other API provider) holds users’ IP and ETH addresses. In that case, it can quickly locate the user’s home and tie it back to all the ETH assets and on-chain transactions users have made. That is quite scary.\n\nContradictory intrusions\n\nThat raised a fascinating debate among the crypto community. While the Ethereum blockchain provides censorship resistance, API providers such as Infura, which provide access to the Ethereum blockchain, are not obligated contradictorily to be censorship resistant.\n\nThat represents a considerable risk for users of MetaMask or, for that fact, any other wallet, such as these Ethereum API nodes, because it makes them vulnerable to censorship without any prior notification or warning.\n\nRelated: Coinbase is fighting back as the SEC closes in on Tornado Cash\n\nAnd then came Alchemy and MyEtherWallet, which tried to “cash in on MetaMask users’ concerns,” only to surface as two crypto wallet solutions that also track user data.\n\nIt is true that anyone can send Bitcoin (BTC) to anyone — even if the police or government doesn’t approve. However, if BTC were not censorship-resistant, those authorities could seize or block that Bitcoin. Crypto was created with censorship resistance in mind because we need and cherish our right to privacy.\n\nIt is also ironic. Blockchain developers have racked their brains to design the chain to be censorship resistant. However, the API node provider “hijacks” the original intention and silently changes it, and all the while, the potential victims — users — are not informed of the modifications.\n\nIn light of Infura’s violations of the “crypto spirit,” here are two considerations.\n\nCrypto enthusiasts should continue monitoring API providers and notifying communities when they behave unethically\n\nMonitoring from the public is required, as done by the two whistleblowers via their Twitter accounts.\n\nMetaMask and other wallets must inform users immediately and clarify the terms of their privacy. For example, they should tell users they are using Infura, which does not ensure their privacy 100%. That, arguably, was not done properly or in a sufficiently overt manner in November.\n\nBuilders of decentralized applications (DApps) should be responsible for notifying people that an API node in use is not secure or censorship-resistant to raise awareness.\n\nWhat type of technology can address this concern soundly?\n\nAPI node-as-a-service makes it simple for non-tech users to spin up API nodes for their wallets. That should be as easy for both users and developers alike as purchasing a VPN service.\n\nIn math we trust. Technology always fights for freedom on behalf of people. Ethereum co-founder Vitalik Buterin recently posted an “Incomplete Guide to Stealth Addresses,” which does not require new technology. However, if implemented on Ethereum, they partially address the privacy violation concerns raised by Infura. People can still locate a user’s house using Infura, but not their on-chain transactions or assets.\n\nRaullen Chai is the co-founder and CEO of IoTeX. He previously worked for companies including Google, Uber and Oracle. He holds a Ph.D. from the University of Waterloo, where his research focused on designing and analyzing lightweight ciphers and authentication protocols for the Internet of Things. At Google, he led security initiatives for its technical infrastructure, including the mitigation of SSL attacks, privacy-preserving SSL offloading and enabling certificate transparency for all Google services. He was also the founding engineer of Google Cloud Load Balancer.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vY3J5cHRvY3VycmVuY3kvc3RvcnkvZXRoZXJldW0tY28tZm91bmRlci12aXRhbGlrLWJ1dGVyaW4tb2ZmZXJzLWFpZC1vZi0yMjcwMDAtMjMzNDIzOS0yMDIzLTAyLTEz0gF-aHR0cHM6Ly93d3cuaW5kaWF0b2RheS5pbi9hbXAvY3J5cHRvY3VycmVuY3kvc3RvcnkvZXRoZXJldW0tY28tZm91bmRlci12aXRhbGlrLWJ1dGVyaW4tb2ZmZXJzLWFpZC1vZi0yMjcwMDAtMjMzNDIzOS0yMDIzLTAyLTEz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin offers aid for earthquake victims in Turkey - India Today",
        "content": "At least two significant donations from Ethereum co-founder Vitalik Buterin have been made to aid those harmed by last week's deadly earthquakes in Turkey and Syria.\n\nIn the early morning of 6 February, an earthquake of 7.8 magnitude was recorded due to which the deathtoll surpassed the 33,000 figure mark, and thus motivated crypto industry to offer help.\n\nadvertisement\n\nHow much has the Ethereum founder donated?\n\nOn 11 February, the vitalik.eth address sent around $150,000 worth of ETH to Ahbap, a non-governmental and non-profit organisation dedicated to relief efforts in Turkey.\n\nOn 12 February, Buterin made his most recent donation of 50 ETH, or roughly $77,000 to Anka relief. According to blockchain security firm PeckShield, the donations were directed to Anka Relief, a Web3 relief support group that also organised the Ukraine DAO project. The latest donation adds to another 99 ETH that Vitalik sent in support of earthquake victims.\n\nWhile highlighting the current support by Buterin, Anka praised the efforts of the Ethereum co-founder for his generosity and said “Since day one of the disaster, we have witnessed donations piling in the wallets of a handful of major NGOs. Great that they have attracted and will be attracting more funds.”\n\nIn the wake of continuous help from the crypto industry, a report from Etherscan, a blockchain explorer for the Ethereum network, suggests that the Ahbap wallet contains 409 ETH worth $622,000. It further claimed to have received $4.3 million in crypto donations, with stablecoins topping the chart.\n\nCrypto industry offering help\n\nThe Financial Times of London reported late last week that donations in cryptocurrency have been flooding in from all across the world. Companies had sent more than $10 million in cryptocurrency, with Binance alone offering $5 million to help the nation.\n\nPrior to this, cryptocurrencies have also been used for earthquake relief donations and to help with war efforts in Ukraine. The devastating earthquake in Nepal in 2015 marked the maximum support in the form of donations in Bitcoin to relief organisations."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYW1iY3J5cHRvLmNvbS93b3JtaG9sZS1oYWNrZXItbW92ZXMtNDYtbWlsbGlvbi1vZi1zdG9sZW4tZnVuZHMv0gFLaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3dvcm1ob2xlLWhhY2tlci1tb3Zlcy00Ni1taWxsaW9uLW9mLXN0b2xlbi1mdW5kcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Wormhole hacker moves $46 million of stolen funds - AMBCrypto News",
        "content": "$46 million of stolen Wormhole funds has just been transferred from the hacker’s wallet.\n\nWormhole’s token bridge was exploited in February 2022.\n\nThe stolen crypto from one of the industry’s largest exploits is on the move once more, with on-chain data revealing that another $46 million in stolen funds has just been transferred from the hacker’s wallet.\n\nWormhole’s token bridge was exploited in February 2022, resulting in the third-largest crypto hack last year. Wrapped ETH (wETH) worth approximately $321 million was stolen in the attack.\n\nAccording to blockchain security firm PeckShield, the hacker’s associated wallet has again gotten active, transferring $46 million in cryptocurrency.\n\nThis consisted of approximately 24,400 Lido Finance-wrapped Ethereum staking token (wstETH) worth around $41.4 million and 3,000 Rocket Pool Ethereum staking token (rETH) worth around $5 million that was transferred to MakerDAO.\n\nThe analysis\n\nAccording to PeckShield, the hacker appears to be looking for yield or arbitrage opportunities on their stolen loot, as the assets were exchanged for 16.6 million DAI.\n\nThe MakerDAO stablecoin was then used to purchase 9,750 ETH and 1,000 stETH, then wrapped into 9,700 wstETH.\n\nLast week, an on-chain sleuth noticed the hacker “buying the dip.” Over the last few hours, the price of Ethereum has, however, fallen below those levels. According to CoinMarketCap, the Ethereum token was trading down 2.6% on the day at $1,505 at the time of writing.\n\nstETH prices depegged from Ethereum and climbed as high as $1,570 at the time of the transfers. At $1,541, they are currently trading 2.4% higher than ETH. Besides, wstETH has depegged and is now worth $1,676, or 11.3% more than the underlying asset.\n\nThe latest transfer of these hacked funds comes just a few weeks after the hacker sent another $155 million in Ethereum to a decentralized exchange last month.\n\n95,630 ETH was sent to the OpenOcean DEX and then converted into ETH-pegged assets such as Lido’s stETH and wstETH."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2NyeXB0b2N1cnJlbmN5L3N0b3J5L2NyeXB0b2N1cnJlbmN5LXByaWNlLWluLWluZGlhLTEzLWZlYnJ1YXJ5LTIwMjMtYml0Y29pbi11cC0wMDUtZXRoZXJldW0tZG93bi0wOTItbWFya2V0LXRyYWRlZC1taXhlZC0yMzMzOTY0LTIwMjMtMDItMTPSAakBaHR0cHM6Ly93d3cuaW5kaWF0b2RheS5pbi9hbXAvY3J5cHRvY3VycmVuY3kvc3RvcnkvY3J5cHRvY3VycmVuY3ktcHJpY2UtaW4taW5kaWEtMTMtZmVicnVhcnktMjAyMy1iaXRjb2luLXVwLTAwNS1ldGhlcmV1bS1kb3duLTA5Mi1tYXJrZXQtdHJhZGVkLW1peGVkLTIzMzM5NjQtMjAyMy0wMi0xMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrency price in India 13 February 2023: Bitcoin up 0.05% & Ethereum down 0.92%, market traded mixed - India Today",
        "content": "Top cryptocurrencies on 13 February traded mixed. The value of Bitcoin went up slightly by 0.05 percent to trade at $21,815.03, highlighting lows from its $23,000 mark from previous weeks. On this, Co-Founder and CEO of Unocoin, Mr. Sathvik Vishwanath said, \"Sell momentum amplifies the decline, resulting in a 13 percent drop in intraday trading volume totaling $15.1 billion. The 200-day EMA provides some stability to the market as it nears the $21,500 mark.\"\n\nadvertisement\n\nHe continued, \"If the price breaks below this level, further declines may occur with the next support level at $20,600.\"\n\nThe global crypto market cap plunged 0.49 percent to stand at $1.01T from its 1.09T of the previous week. The value of the total crypto market volume saw an increase of 24.59 percent to $$41.87B.\n\nAs of (0930 IST), the price of Ethereum noticed a fall by 0.92 percent to stand at $1,518.18. Amid the market fluctuations, XRP's value sank 2.59 percent to $0.372043. This reduction was further witnessed in Polygon by 1.65 percent to $1.22. The price of Cardano dropped by 1.04 percent to $0.362333. However, Solana managed to remain profitable by a 1.19 increase to $20.91 in the 24 hours.\n\nBNB and Monero also witnessed gains of 1.70 percent to $312.41 and 0.08 percent to $161.50, respectively. On the other hand, Avalache dropped by 1.96 percent to $17.54.\n\nTop gainers and losers of today\n\nAccording to CoinMarketCap, the top gainers were Render Token, Stacks, Ziliqa, and Internet computer. Contrarily, the top losers were, Hedera, Frax Share, Optimism and Fantom.\n\nMeme coins in the red\n\nShiba Inu was down by 0.23 percent to $0.000013. The market fluctuation negatively impacted the value of Dogecoin by 0.18 percent to a $0.081789 decrease. Dogelon Mars dipped slightly by 0.35 percent to $3.59e-7.\n\nMetaverse tokens suffer losses\n\nOn Monday, Decentraland tumbled 5.31 percent to $0.649091. The value of Axie Infinity and The Sandbox recorded lows of 5.09 percent to $9.70 and 5.40 percent to $0.695379, respectively."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMivAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWZlYnJ1YXJ5LTEzLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLXJlbmRlci10b2tlbi1nYWluZXItbG9zZXItMTU4MTc2MNIBwAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWZlYnJ1YXJ5LTEzLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLXJlbmRlci10b2tlbi1nYWluZXItbG9zZXItMTU4MTc2MC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Fails To Pick Up Steam As Global Market Cap Continues To Slide - ABP Live",
        "content": "The global crypto market cap stands on the verge of losing the $1 trillion mark, as prices of top coins saw more losses than gains early Monday morning. Bitcoin (BTC), the world’s oldest crypto, failed to rise above the $22,000 mark over the weekend. Other popular altcoins — including the likes of Dogecoin (DOGE), Ripple (XRP), Solana (SOL), and Litecoin (LTC) — saw a mix of reds and greens across the board. The Render Token (RNDR) became the top gainer, with a 24-hour jump of over 13 percent.\n\nThe global crypto market cap stood at $1.01 trillion at the time of writing, registering a 24-hour dip of 0.49 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $21,828.45, registering a 24-hour gain of 0.09 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 18.75 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,518.99, marking a 24-hour dip of 0.88 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.32 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour loss of 0.17 percent, as per CoinMarketCap data, currently priced at $0.08179. As per WazirX, Dogecoin price in India stood at Rs 7.29.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour dip of 0.16 percent. At the time of writing, it was trading at $93.07. LTC price in India stood at Rs 7,900.\n\nRipple (XRP) price today\n\nXRP price stood at $0.373, seeing a 24-hour loss of 2.27 percent. As per WazirX, Ripple price stood at Rs 32.40.\n\nSolana (SOL) price today\n\nSolana price stood at $20.93, marking a 24-hour gain of 1.16 percent. As per WazirX, SOL price in India stood at Rs 1,956.40.\n\nTop crypto gainers today (February 13)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nRender Token (RNDR)\n\nPrice: $1.62\n\n24-hour gain: 13.87 percent\n\nStacks (STX)\n\nPrice: $0.3141\n\n24-hour gain: 9.21 percent\n\nZiliqa (ZIL)\n\nPrice: $0.03058\n\n24-hour gain: 9.18 percent\n\nInternet Computer (ICP)\n\nPrice: $5.64\n\n24-hour gain: 8.16 percent\n\nOasis Network (ROSE)\n\nPrice: $0.07401\n\n24-hour gain: 5.27 percent\n\nTop crypto losers today (February 13)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nHedera (HBAR)\n\nPrice: $0.08466\n\n24-hour loss: 8.63 percent\n\nMina (MINA)\n\nPrice: $1.00\n\n24-hour loss: 8.55 percent\n\nOptimism (OP)\n\nPrice: $2.28\n\n24-hour loss: 7.53 percent\n\nFantom (FTM)\n\nPrice: $0.4354\n\n24-hour loss: 7.50 percent\n\nThe Graph (GRT)\n\nPrice: $0.1538\n\n24-hour loss: 6.93 percent\n\nWhat crypto exchanges are saying about the current market scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Most cryptocurrencies experienced a decline over the weekend. Bitcoin's value dipped below $22,000 following the US-based Kraken crypto exchange's decision to halt its staking service and pay a $30 million fine to the SEC for not registering the service. The current trading price of Bitcoin, near its support level of $21,770, is bearish, and if the trend continues, it could fall to $21,500 by the end of the week. Currently, Bitcoin does not show any signs of a midterm price recovery.”\n\nWazirX Vice President Rajagopal Menon said, “The Crypto market is feeling the impact of global regulations. Liquid staking token prices surged after the US Securities and Exchange Commission (SEC) and crypto exchange Kraken reached a settlement which clarified that staking as a technical service will continue in the US but with more transparency around tokens going into the staking pool, to prevent fund misuse. Bitcoin’s price fell due to the SEC verdict that Kraken will cease its US operations. Ethereum’s price went down by almost 1.6 percent.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin said, “Bitcoin price drops below $21,750, downtrend could continue with potential to reach $21,200. If the price breaks below this level, further declines may occur with the next support level at $20,600. Despite the current decline, with support from the 200-day EMA, there may be an opportunity for another top if the market holds above $20,300.”\n\nKunji founder Anurag Dixit offered his take, “Over the weekend, there was significant growth observed in certain subsectors of the cryptocurrency market. However, the US Security and Exchange Commission (SEC) is currently investigating and charging Paxos for their involvement with the BUSD stablecoin, which highlights the increased regulatory scrutiny that the industry may face in the coming year. Despite the challenging global regulatory environment, there seems to be a shift in the commentary surrounding cryptocurrency regulations in India. Previously, there had been some suggestions to ban cryptocurrencies, but recent comments from Finance Minister Nirmala Sitharaman indicate a more accommodating stance. It is expected that the regulation of cryptocurrencies will eventually be a coordinated effort by governments worldwide. However, India's initial stance during the G20 summit was to ban cryptocurrencies, as opposed to exploring the possibility of a coordinated regulatory framework.\"\n\nShivam Thakral, the CEO of BuyUCoin, said, “The crypto market had a busy weekend as BTC is looking for a new support level. The macroeconomic factors are swinging the prices across the crypto market which include regulatory uncertainty and higher-than-expected December consumer prices. BTC is trading close to the $22,000 level while ETH is exchanging hands at the $1,516 level. The next FOMC meeting is the next big event for the digital asset market for which investors are eagerly waiting.”\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tYnV0ZXJpbi1kb25hdGVzLXRvLXF1YWtlLXZpY3RpbXMv0gFFaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9ldGhlcmV1bS1idXRlcmluLWRvbmF0ZXMtdG8tcXVha2UtdmljdGltcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 11:27:44 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Donates $150,000 To Victims Of Turkey, Syria Earthquake - Bitcoinist",
        "content": "Vitalik Buterin, co-founder of Ethereum, has shown his kindness and support for individuals affected by the recent earthquake in Turkey and Syria by making a sizeable donation.\n\nAccording to numerous news sources, Buterin gave approximately $150,000 worth of Ether to Ahbap Earthquake Support to assist with the recent natural disaster in the two countries.\n\nEthereum Co-Founder Reaches Out To Help\n\nVitalik transmitted a total of 99 ETH, or approximately $150,000, from his wallet address “vitalik.eth” to a wallet branded “Ahbap Yardm,” according to Etherscan transaction data.\n\nButerin’s generous contribution is sure to have a positive impact on the organization’s efforts to aid victims of the tragedy.\n\nThe contribution also highlights the increasing adoption of cryptocurrencies as a means of charitable assistance.\n\nEthereum co-founder Vitalik Buterin. Image: Bitcoinik\n\nCrypto’s Important Role During A Disaster\n\nNatural calamities make it harder for people to obtain funds for necessities such as medical supplies and food through standard banking services. Cryptocurrencies, such as Ethereum, will make the process of acquiring funds significantly simpler and quicker.\n\nChangpeng Zhao, CEO of Binance, stated in a press statement that the recent earthquakes in Turkey and Syria have had a catastrophic effect on so many individuals and communities.\n\n“We hope that our efforts will bring some relief to those affected. We are also calling on our industry peers to once again come together to offer support in these times of crisis,” Zhao said.\n\nOn Monday, the lives of millions of people in Turkey and Syria were irrevocably altered as a result of two tremors that occurred in quick succession and sent shockwaves across hundreds of miles.\n\nThe magnitudes of the earthquakes were 7.8 and 7.5 on the Richter scale, separated by nine hours, and they were the region’s strongest in nearly a hundred years.\n\nQuake Claims 25,000 Lives\n\nAs of Saturday, the number of deaths in the two countries has topped 25,000, making the earthquakes the worst in the globe in more than a decade.\n\nImage: Rami Al Sayed/AFP Via Getty Images\n\nThis week’s fatalities in Turkey and Syria eclipsed Japan’s 2011 Fukushima disaster, in which an earthquake of magnitude 9.0 caused a tsunami that claimed the lives of more than 18,400 people.\n\n“We are facing one of the biggest catastrophes not only of the history of the Turkish Republic but also of … the world,” President Recep Tayyip Erdogan, president of Turkey, said Tuesday.\n\nIn the aftermath of the earthquake, Chainalysis, a blockchain analytics startup, estimates that more than $5 million in Ethereum and other cryptocurrency donations were sent to Turkey and Syria.\n\nCrypto total market cap at $971 billion on the weekend chart | Chart: TradingView.com\n\nBinance Gives Out $5 Million In Total Donations\n\nElliptic, a competitor of Chainalysis, has verified these computations. Numerous crypto companies have guaranteed over $10 million in crypto tokens, as uncovered by the startups. Binance offered a total of $5 million in donated funds.\n\nButerin gave about $1 billion worth of Ethereum and other cryptocurrencies to various charities in May 2021, including those providing aid to victims of COVID-19 and the Indian earthquake.\n\n-Featured image from Sky News"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDIvMTMvZXRoZXJldW0tY3J5cHRvLWRvbmF0aW9ucy10dXJrZXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "Ethereum: crypto donations for Turkey - The Cryptonomist",
        "content": "Ethereum co-founder Vitalik Buterin has donated hundreds of ETH crypto to help victims of the 7.8-magnitude earthquake in Turkey. Buterin reportedly made two substantial contributions of relatively 50 ETH to Anka Relief and 99 ETH to the Ahbap organization.\n\nEthereum: Vitalik Buterin and his two crypto donations to help earthquake victims in Turkey\n\nVitalik Buterin, the young Russian co-founder of the second-largest crypto by market capitalization, provided Ethereum (ETH) donations to help victims of the devastating 7.8-magnitude earthquake that occurred in Turkey and Syria on the night of 5-6 February.\n\nThese were two substantial contributions that Buterin reportedly made. The first occurred on 11 February to the non-governmental and non-profit organization dedicated to relief efforts in Turkey, Ahbap.\n\nThe amount of that donation was 99 ETH, about $150,000, and at the time of writing, Ahbap’s Ethereum wallet contains a total of 409 ETH, the equivalent of $622,000.\n\nJUST IN: #Ethereum founder Vitalik Buterin donates 99 $ETH ($150,000) to support victims of the Turkey-Syria earthquake. — Watcher.Guru (@WatcherGuru) February 11, 2023\n\nWhereas, the second donation that occurred yesterday is worth 50 ETH, equivalent to about $75,000, to Anka Relief.\n\n🇹🇷 We want to thank @VitalikButerin for donating 50 ETH ~$75k to Anka Relief, a crypto aid fund & community to support Türkiye after the recent earthquakes. https://t.co/kGwXSGWL8J Dive into the thread below to better understand our mission and ops👇 🔗 https://t.co/92CkxevI5e — Anka Relief (@AnkaRelief) February 12, 2023\n\nEthereum co-founder Vitalik Buterin has donated hundreds of ETH crypto to help victims of the 7.8-magnitude earthquake in Turkey. Buterin reportedly made two substantial contributions of relatively 50 ETH to Anka Relief and 99 ETH to the Ahbap organization.\n\nEthereum: Vitalik Buterin and his two crypto donations to help earthquake victims in Turkey\n\nVitalik Buterin, the young Russian co-founder of the second-largest crypto by market capitalization. Provided Ethereum (ETH) donations to help victims of the devastating 7.8-magnitude earthquake that occurred in Turkey and Syria on the night of 5-6 February.\n\nThese were two substantial contributions that Buterin reportedly made. The first occurred on 11 February to the non-governmental and non-profit organization dedicated to relief efforts in Turkey, Ahbap.\n\nThe amount of that donation was 99 ETH, about $150,000, and at the time of writing, Ahbap’s Ethereum wallet contains a total of 409 ETH, the equivalent of $622,000.\n\nJUST IN: #Ethereum founder Vitalik Buterin donates 99 $ETH ($150,000) to support victims of the Turkey-Syria earthquake. — Watcher.Guru (@WatcherGuru) February 11, 2023\n\nWhereas, the second donation that occurred yesterday is worth 50 ETH, equivalent to about $75,000, to Anka Relief.\n\n🇹🇷 We want to thank @VitalikButerin for donating 50 ETH ~$75k to Anka Relief, a crypto aid fund & community to support Türkiye after the recent earthquakes. https://t.co/kGwXSGWL8J Dive into the thread below to better understand our mission and ops👇 🔗 https://t.co/92CkxevI5e — Anka Relief (@AnkaRelief) February 12, 2023\n\nDelve into the thread below to better understand our mission and operations.”\n\nIn his roundup of tweets, Anka also stated that cryptocurrency donations have been piling up since the first day the related cryptocurrency address was published.\n\nNot just Ethereum: AVAX, USDT, TRX and crypto-exchanges are also providing donations\n\nOver the past week, millions of crypto donations have moved to support humanitarian efforts for the earthquake, whose toll unfortunately to date, appears to have exceeded 39,000 victims.\n\nAmong the many, Avalanche (AVAX) and Tether (USDT) have also provided donations. And indeed, the Avalanche Foundation has donated as much as $1 million in AVAX tokens to the Haluklevent organization, inviting others to join the effort as well.\n\nOn the other hand, Tether (USDT) has promised to help Turkey with a 5 million TRY donation.\n\nJoining the ranks when it comes to relief or donations, were also cryptocurrency trading platforms such as Gate.io, Binance, Bitfinex, Bitget, ByBit and BitMEX.\n\nAnd finally, Justin Sun, founder of TRON, also donated $1 million in TRX from the Huobi Global crypto-exchange.\n\nETH price dump of 6% in last 24 hours\n\nAt the time of writing, ETH is registering a 6% price dump in the last 24 hours. Looking at the chart, there is a clear jump from $1535 to $1500 and then recovering, although not completely, to $1519.\n\nQuite normal situation when looking at the Ethereum price chart in the last month, where the swings have remained within a low of $1500 to a high of $1700.\n\nSpecifically, last week ETH started at $1626, while on 9 February it dropped to $1540 and then to the current prices.\n\nAnd yet, just this past week, news has been circulating that the adoption of Ethereum and Bitcoin should increase due in part to the new school in Dubai that will accept crypto payments for its tuition.\n\nThis new school is a concrete example that Dubai is serious about making crypto mainstream as payment systems and about wanting to integrate blockchain technology organically.\n\nDelve into the thread below to better understand our mission and operations.”\n\nIn his roundup of tweets, Anka also stated that cryptocurrency donations have been piling up since the first day the related cryptocurrency address was published.\n\nNot just Ethereum: AVAX, USDT, TRX and crypto-exchanges are also providing donations\n\nOver the past week, millions of crypto donations have moved to support humanitarian efforts for the earthquake, whose toll unfortunately to date, appears to have exceeded 39,000 victims.\n\nAmong the many, Avalanche (AVAX) and Tether (USDT) have also provided donations. And indeed, the Avalanche Foundation has donated as much as $1 million in AVAX tokens to the Haluklevent organization, inviting others to join the effort as well.\n\nOn the other hand, Tether (USDT) has promised to help Turkey with a 5 million TRY donation.\n\nJoining the ranks when it comes to relief or donations, were also cryptocurrency trading platforms such as Gate.io, Binance, Bitfinex, Bitget, ByBit and BitMEX.\n\nAnd finally, Justin Sun, founder of TRON, also donated $1 million in TRX from the Huobi Global crypto-exchange.\n\nETH price dump of 6% in last 24 hours\n\nAt the time of writing, ETH is registering a 6% price dump in the last 24 hours. Looking at the chart, there is a clear jump from $1535 to $1500 and then recovering, although not completely, to $1519.\n\nQuite normal situation when looking at the Ethereum price chart in the last month, where the swings have remained within a low of $1500 to a high of $1700.\n\nSpecifically, last week ETH started at $1626, while on 9 February it dropped to $1540 and then to the current prices.\n\nAnd yet, just this past week, news has been circulating that the adoption of Ethereum and Bitcoin should increase due in part to the new school in Dubai that will accept crypto payments for its tuition.\n\nThis new school is a concrete example that Dubai is serious about making crypto mainstream as payment systems and about wanting to integrate blockchain technology organically."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYmxvY2t6ZWl0LmNvbS9ldGhlcmV1bXMtbmV4dC11cGdyYWRlLXNoYW5naGFpLWlzLWl0LXRpbWUtdG8tc2VsbC1vci1ob2RsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 08:00:00 GMT",
        "title": "Ethereum's Next Upgrade: Shanghai, Is It Time to Sell or HODL? - Blockzeit",
        "content": "Discover the exciting news of the upcoming Ethereum next upgrade, Shanghai. What could be in store for investors in this upcoming milestone?\n\nEthereum, the world’s second-largest cryptocurrency by market capitalization, is about to undergo its next major upgrade, known as the “Shanghai upgrade”.\n\nThe upgrade is highly anticipated, and for good reason: it will allow for the withdrawal of staked Ethereum. This means that Ethereum holders will soon be able to take their assets off the Ethereum blockchain and do with them as they please.\n\nBut what does this mean for the Ethereum market? Will the ability to withdraw Ethereum cause a massive sell-off, or will holders continue to HODL their assets, confident in Ethereum’s long-term potential?\n\nLet’s explore it in this article.\n\nThe Merge Upgrade\n\nThe last time Ethereum underwent a significant upgrade was September’s “The Merge”, when Ethereum transitioned from Proof of Work to Proof of Stake. This upgrade hit all major news sites – and for good reason. The Merge signified a massive accomplishment with Ethereum’s roadmap.\n\nThe Merge source: Cryptonewz\n\nThis upgrade was a massive technical achievement, but one important functionality needed to be included: withdrawals. This has left many Ethereum holders with staked assets that they cannot access. But the Shanghai upgrade will change all of that, finally allowing for the withdrawal of staked Ethereum. The exact date for the upgrade has not been set yet, but it is expected to take place next month with speculated massive implications for the currency’s price.\n\nEthereum Shanghai Upgrade\n\nAlthough the Shanghai upgrade is not as technically challenging as The Merge, it is still highly impactful.\n\nNot only is it an important milestone in the development of Ethereum, but its ramifications will be felt across the entire cryptocurrency market. Some people predict that the ability to withdraw Ethereum will lead to a massive sell-off, as people cash in on their staked assets.\n\nNext year the Shanghai Hardfork for #Ethereum is slated to take place on March. 15,3 Mio #ETH will be unlocked. So can this cause a MASS SELL-OFF event for Ethereum, the leading Smart contract platform????????? pic.twitter.com/vCAOaUSN8l — CryptoMo (@CryptoMo) December 19, 2022\n\nHowever, the argument holds for price increases as well. Staking will become attractive for investors due to its increased liquidity. This can potentially improve its demand, driving up Ethereum prices.\n\nSo, what should Ethereum holders do? The answer to this question is definitely not an easy one.\n\nMore importantly, this event should be seen as a giant win for the entire crypto industry. The Shanghai upgrade enables ETH investors to react accordingly to market demands and reduces artificial factors that affect Ethereum. The choice is ultimately up to each individual, and it is important to do your own research and make an informed decision.\n\nFinal Thoughts\n\nThe upcoming Ethereum’s next upgrade is sure to have a significant impact on the Ethereum market and the cryptocurrency market as a whole. Regardless of your decision, it’s important to keep your eyes peeled on the future developments of this significant moment in cryptocurrency history.\n\nStay tuned for more crypto news."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYnVzaW5lc3Nwb3N0Lm5nL2Vjb25vbXkvMTEtd2F5cy10by1tYWtlLW1vbmV5LXdpdGgtZXRoZXJldW0taW4tbmlnZXJpYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Feb 2023 08:00:00 GMT",
        "title": "11 Ways To Make Money With Ethereum in Nigeria - Business Post Nigeria",
        "content": "You’re probably familiar with Bitcoin, but have you heard of Ethereum? Ethereum is a decentralised platform for building and running applications and is quickly becoming one of the hottest investment opportunities in the crypto space. If you’re looking for ways to make money with Ethereum in Nigeria, you’ve come to the right place. In this blog post, we’ll explore 11 ways to get started and make the most of your investment.\n\nImagine this: You’re scrolling through your social media feed, and you come across a post from a friend who made a ton of money with Ethereum. They tell you about this fantastic platform they used to invest in decentralised applications and make a fortune. You’re intrigued but also a bit sceptical – you’ve heard of cryptocurrencies, but you have no idea how they work.\n\nThat’s exactly how I felt when I first heard about Ethereum. But, being the curious person I am, I decided to do some research and learn all about it. And let me tell you, I was blown away by what I discovered. Ethereum is a game-changer, and I want to share everything I learned with you.\n\nIn this article, I’ll break down Ethereum in a way that’s easy to understand so you, too, can take advantage of its potential to make money. Whether you’re a beginner or just looking to expand your investment portfolio, this article is for you. So, sit back, grab a cup of coffee, water, tea or anything you want, and get ready to learn about the fantastic world of Ethereum and the different ways you can make money from it!\n\nOverview of Ethereum\n\nEthereum is a pretty cool platform. It’s decentralised, which means it’s not controlled by any government or corporation. It’s also open-source, which means anyone can use and build on it. Basically, it’s a platform for creating and running smart contracts and decentralised apps (dApps).\n\nSo what are smart contracts? Think of them as computer programs that automatically execute when certain conditions are met. For example, you could use a smart contract to automate the exchange of money, property, or other assets between two parties. No need for a middleman!\n\nEthereum uses its own cryptocurrency called Ether (ETH) to power its network and execute transactions. And to keep everything secure, it uses a consensus mechanism called Proof of Stake, which is more energy-efficient than other methods.\n\nIn terms of dApps, Ethereum is a pretty big deal. It’s home to many decentralised apps, from games and social media to financial applications. And you can even create decentralised organisations (DAOs) that run on code rather than relying on a central authority.\n\nSo, that’s Ethereum in a nutshell! It’s a pretty innovative platform helping shape a more decentralised and open internet.\n\nSo, how can you make money from this cutting-edge cryptocurrency? Let’s find out.\n\nWays To Earn Passive Income In Nigeria With Ethereum\n\n1. Trading Ethereum:\n\nOne of the most straightforward ways to make money with Ethereum is trading. The basic idea is to buy low and sell high. You’ll need to find a reputable crypto exchange that supports Ethereum., and create an account. From there, you can buy Ethereum using Nigerian Naira (NGN) or another cryptocurrency and hold onto it until you think the price will go up. Then, you can sell it for a profit.\n\nKeep in mind that the cryptocurrency market is highly volatile, and prices can change quickly. It’s important to understand market trends and do your research before making any trades. Consider using stop-loss orders to minimise your risk and protect your investment.\n\nTo get the most out of your investment, you must sell your Ethereum on the best crypto trading platform, Breet app. Breet is an OTC crypto trading app in Nigeria where you can convert Ethereum to Naira and withdraw your funds directly to your Naira bank account within seconds for no extra charge. Get started by downloading Breet today, and enjoy a seamless trading experience.\n\n2. Staking Ethereum:\n\nStaking is another way to make money with Ethereum, and it’s a lot less risky than trading. Staking means holding onto your Ethereum and helping to secure the network by participating in consensus. In return, you’ll earn rewards in the form of new Ethereum. The more Ethereum you stake, the more you’ll earn.\n\nTo start staking, you’ll need a minimum amount of Ethereum in a wallet that supports staking. You can choose a staking provider or use a decentralised platform like Rocket Pool or Stakefish. Staking is an excellent option if you’re looking for long-term investment and passive income.\n\n3. Participating in decentralised Finance (DeFi):\n\nDecentralised finance, or DeFi, is a growing sector of the Ethereum ecosystem that allows you to earn interest and yield on your Ethereum and other cryptocurrencies. DeFi protocols like Aave, Compound and Yearn Finance allow you to deposit your Ethereum and earn interest, similar to a savings account. You can also earn yield by providing liquidity to DeFi exchanges, such as Uniswap or Balancer.\n\nDeFi is a high-risk, high-reward opportunity, so it’s essential to do your research and understand the risks involved. Make sure to only invest what you can afford to lose and consider using stop-loss orders to protect your investment.\n\n4. Crypto Lending:\n\nCrypto lending is another way to earn passive income with Ethereum. You can lend your Ethereum to borrowers and earn interest on your loan. This can be a great option if you have a large amount of Ethereum that you don’t need to sell right away.\n\nSeveral platforms offer crypto lending services, such as Nexo, BlockFi, and Celsius. Keep in mind that crypto lending is a relatively new and untested market, so it’s essential to do your research and understand the risks involved.\n\n5. Mining Ethereum:\n\nMining is the process of creating new Ethereum by solving complex mathematical problems. The more computing power you have, the more Ethereum you can mine. You’ll need to set up a mining rig, which can be an expensive investment, but the rewards can be substantial.\n\nKeep in mind that mining is a highly competitive field, and the cost of electricity and hardware can be significant. You’ll need to do a cost-benefit analysis to determine if mining is a good investment for you.\n\n6. Participating in Ethereum-based prediction markets:\n\nEthereum-based prediction markets, such as Augur and Gnosis, allow you to bet on the outcome of events and earn rewards based on your accuracy. You can participate in prediction markets by creating a market, placing bets, and earning rewards based on the outcome. This is a great option if you have knowledge or expertise in a particular field or market.\n\n7. Creating NFTs (Non-Fungible Tokens):\n\nNFTs are unique digital assets that can be bought, sold, and traded on the Ethereum blockchain. If you’re an artist, musician or have another creative talent, you can monetise your work by creating NFTs. You can sell your NFTs on platforms like OpenSea, Rarible, or SuperRare.\n\n8. Earning passive income through yield farming:\n\nYield farming is a process of earning passive income by depositing Ethereum and other cryptocurrencies in liquidity pools and earning rewards for providing liquidity to decentralised exchanges. This is a high-risk, high-reward opportunity for those familiar with the DeFi space. Several yield farming platforms, such as Binance Smart Chain, allow you to earn rewards for providing liquidity.\n\n9. Investing in Ethereum-based startups:\n\nAnother way to make money with Ethereum is by investing in Ethereum-based startups. This can be a high-risk, high-reward opportunity, as startup investments are generally considered speculative. However, if you do your research and invest in a promising startup, you could see significant returns on your investment.\n\n10. Earning Ethereum through content creation:\n\nIf you have a talent for writing, video production, or other forms of content creation, you can earn Ethereum by creating and sharing your content on various platforms. Some platforms allow you to earn rewards in the form of cryptocurrency for creating and sharing valuable content with the community.\n\n11. Earning Ethereum through affiliate marketing:\n\nFinally, you can earn Ethereum through affiliate marketing. This involves promoting products or services and earning commissions for every sale made through your unique affiliate link. Several Ethereum-based affiliate marketing platforms, such as Refersion, allow you to earn Ethereum for your marketing efforts.\n\nConclusion\n\nIn conclusion, there are plenty of ways to make cash with Ethereum in Nigeria. Whether you’re into trading, staking, DeFi, or something else entirely, there’s a way for you to get in on the action. The key is to do your research and understand the risks involved with any investment. But with the right mindset and effort, you can make the most of your Ethereum investment and grow your wealth over time. So, get out there and start exploring the opportunities!"
    }
]