[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL25vY3R1cm5lLXByaXZhdGUtYWNjb3VudHMtdG8tZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Nocturne brings private accounts to Ethereum - Blockworks",
        "content": "Nocturne, a protocol that enables private accounts on Ethereum, has launched its first version on mainnet.\n\nThe protocol is designed so that users are able to deposit or receive funds privately on what Vitalik Buterin calls stealth addresses.\n\nThis means that users can generate a secret spending and viewing key, which can then be used to create multiple meta-addresses that can be used to interact with other accounts.\n\nThese addresses are held within Nocturne smart contracts and are intended to be used to trade what the company refers to as ‘hot assets,’ or crypto assets that are not designed to be held.\n\nAccording to Nocturne, its smart accounts will be compatible with DeFi protocols that “represent state via output tokens.” This means that it will only be compatible with tokens that are made valuable from a previous input — or tokens where a user must deposit collateral in order to mint the token.\n\nSuch tokens could include Uniswap liquidity tokens, Aave’s aTokens, and Compound’s cTokens.\n\nThere are plans to later extend smart account compatibility to arbitrary protocols with the help of zero-knowledge technology, which can prove ownership of assets without revealing the details of the assets owned themselves, Nocturne notes.\n\nLuke Tchang, CEO and co-founder of Nocturne, noted in a press release reviewed by Blockworks that the company is moving away from simply being a ‘privacy tool.’\n\n“Privacy should be embedded at the account layer and the v1 launch is the first step in making this possible,” Tchang said. “Our goal is to ensure that everyone, from individual users to large institutions, can transact securely without exposing their financial history to the world.”\n\nUsers who wish to access Nocturne v1 can do so through a private vault user interface. The current capabilities of the interface are limited to deposits, transfer of tokens to burner addresses, and private swapping and staking, the company said.\n\nFuture versions of the protocol include the migration of a ‘proof-of-innocence’ protocol that can prove transactions are verified without revealing any information about the user’s identity and further usability and functionality of Nocturne wallets by enabling compatibility with arbitrary smart contracts.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYmxvY2tnZWVrcy5jb20vZ3VpZGVzL2V0aGVyZXVtLXZzLWF2YWxhbmNoZS10aGUtdWx0aW1hdGUtYmF0dGxlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum vs Avalanche: The Ultimate Battle - Blockgeeks",
        "content": "In this blog post, we delve into the clash between two heavyweights in the cryptocurrency world: Ethereum vs Avalanche.\n\nEthereum, with its smart contract functionality, has long been at the forefront of blockchain innovation in the world of cryptocurrency. Its efficient transactions and ability to handle many transactions make it a popular choice for users. Additionally, Ethereum’s smart contract capabilities have paved the way for the rise of NFTs. But don’t underestimate the rising star – Avalanche. This newer blockchain network promises efficient transactions, with low fees and high scalability, making it a formidable contender for many cryptocurrency transactions.\n\nBoth Ethereum and Avalanche have their own native tokens – ETH and AVAX respectively – fueling their respective cryptocurrency networks. These platforms operate on a platform chain architecture and also support the creation and trading of NFTs. While Ethereum, the leading cryptocurrency in the market, boasts a larger user base and an established ecosystem, Avalanche is gaining ground as a strong contender. With its former Elrond validators and platform chain approach, Avalanche is emerging as a potential winner in the growing market of NFTs.\n\nSo buckle up as we embark on this thrilling journey of speed, where the pos winner will be determined by the system!\n\nComparison of Ethereum vs Avalanche\n\nScalability\n\nEthereum, the former elrond system, faces scalability challenges that hinder its speed and place it behind other blockchain platforms in the race to be the winner. This is primarily due to ethereum v2’s current consensus mechanism, which results in slower transaction speeds on the chain. However, there are efforts to address the scalability issue in Ethereum’s chain speed through the development of Layer 2 solutions like Optimism and Elrond.\n\nOn the other hand, Ethereum v2 and Elrond take a different approach to scalability by implementing their own chain. Avalanche, on the other hand, takes a different approach to scalability. It utilizes a unique consensus protocol called Avalanche consensus, which enables high throughput and fast confirmation times. This makes it an ideal choice for projects that are built on the ethereum v2 chain or the elrond chain. This means that transactions can be processed quickly and efficiently on the Avalanche network, a chain that utilizes the Elrond protocol. As a result, Avalanche has become an attractive alternative to Ethereum for applications requiring high transaction volumes in the elrond chain.\n\nInteroperability\n\nInteroperability, including elrond, is essential for facilitating smooth communication and data exchange across various blockchains or networks. Ethereum and Elrond have made significant strides in achieving interoperability through projects like Polkadot, Cosmos, Chainlink, and Elrond. These projects allow Ethereum to connect with other blockchains like Elrond and share information effectively.\n\nAvalanche, a blockchain platform, also recognizes the importance of interoperability and supports it through the use of bridges. This allows for seamless connectivity between Avalanche and other chains.\n\nDecentralization\n\nDecentralization is a fundamental principle of blockchain technology that ensures no single entity, including elrond, has complete control over the network. In terms of decentralization, both Ethereum and Avalanche have their own approaches.\n\nEthereum currently follows a proof-of-Stake (PoS) consensus algorithm where stakers validate transactions on the Ethereum chain.\n\nAvalanche takes a hybrid approach by combining Proof of Stake (PoS) with elements of Byzantine fault tolerance (BFT) to create a chain. This combination aims to achieve both security and decentralization on the network chain. By utilizing the Avalanche chain hybrid consensus mechanism, Avalanche strives to maintain a robust and decentralized ecosystem.\n\nThe level of decentralization achieved by both blockchain platforms has implications for their resilience against attacks and censorship resistance. A more decentralized network, often referred to as a chain, is generally considered to be more secure and less susceptible to manipulation.\n\nHow Ethereum Works\n\nEthereum is a decentralized virtual machine that powers the world of cryptocurrencies through its blockchain chain. It operates as a platform for executing smart contracts and running decentralized applications (dApps) on the chain. Let’s take a closer look at how Ethereum works.\n\nEthereum Network: A Decentralized Virtual Machine\n\nAt its core, Ethereum functions as a decentralized virtual machine. It provides developers with the infrastructure to build and deploy smart contracts, which are self-executing agreements written in code. These smart contracts enable the creation of dApps that can perform various functions without the need for intermediaries.\n\nStoring Transactions and Smart Contract Interactions\n\nOne of Ethereum‘s key features is its blockchain, which serves as a digital ledger that records all transactions and interactions with smart contracts. The blockchain stores a complete history of every transaction made on the network, making it transparent and immutable.\n\nWhen someone initiates a transaction or interacts with a smart contract on the Ethereum network, this information is added to a block. Each block contains a unique identifier called a hash and is linked to the previous blocks, forming an unbroken chain of transactions known as the Ethereum blockchain.\n\nSolidity: The Language of Smart Contracts\n\nTo create smart contracts on Ethereum, developers use Solidity programming language. Solidity allows them to write code that defines the rules and conditions for executing these contracts. Once deployed on the network, these smart contracts become accessible to anyone with an internet connection.\n\nSolidity offers powerful features like inheritance, libraries, and interfaces that make it easier for developers to build complex applications on top of Ethereum. It also includes built-in security measures to protect against common vulnerabilities like reentrancy attacks or integer overflows.\n\nGas Fees: Prioritizing Transactions\n\nTo prevent network congestion and prioritize transactions, Ethereum relies on gas fees. Gas is essentially the fuel required to execute operations within the Ethereum Virtual Machine (EVM). Every operation in an EVM consumes a certain amount of gas, and users must pay these fees to have their transactions processed.\n\nGas fees serve two purposes: incentivizing miners to include transactions in blocks and preventing malicious actors from spamming the network. By attaching a higher gas fee to their transactions, users can ensure that their transactions are prioritized by miners and processed faster.\n\nThe Contract Chain: Enabling Interoperability\n\nWith the upcoming Ethereum 2.0 upgrade, Ethereum is set to introduce significant improvements, including the introduction of shard chains. These shard chains will enhance scalability by dividing the network’s workload among multiple chains.\n\nOne of these shard chains is called the “contract chain,” which will focus specifically on executing smart contracts. This separation allows for greater efficiency and parallel processing of contract execution, enabling Ethereum to handle a larger number of transactions and dApps simultaneously.\n\nHow Avalanche Works\n\nAvalanche is an innovative blockchain platform that operates on a directed acyclic graph (DAG) structure known as the Avalanche protocol. This unique consensus mechanism allows for high scalability, parallel processing of transactions, and fast finality.\n\nMultiple Subnets for Parallel Processing\n\nOne of the key features of Avalanche is its ability to support multiple subnets within the network. These subnets enable parallel processing of transactions, which means that multiple transactions can be validated simultaneously. This greatly enhances the scalability of the network and ensures that it can handle a large number of transactions efficiently.\n\nRepeated Voting Rounds for Consensus\n\nValidators in the Avalanche network reach consensus through repeated voting rounds. During each round, validators vote on valid transactions and proposals. The voting process continues until a threshold is reached, at which point finality is achieved. This means that once a transaction has been confirmed by the network, it cannot be reversed or altered.\n\nThe repeated voting rounds allow for quick finality, ensuring that transactions are settled rapidly and reducing the risk of double-spending or other malicious activities. It also provides security against attacks such as 51% attacks, where a single entity controls more than half of the network’s computing power.\n\nScalability without Compromising Security or Decentralization\n\nAvalanche’s consensus mechanism enables high scalability without compromising security or decentralization. By allowing parallel processing and quick finality, it can handle a large number of transactions per second while maintaining the integrity and security of the network.\n\nThis scalability makes Avalanche well-suited for applications that require high throughput and low latency, such as decentralized finance (DeFi), gaming platforms, and supply chain management systems.\n\nFurthermore, Avalanche employs a robust system for selecting validators to participate in the consensus process. Validators are chosen based on their stake in the network, ensuring that those with a significant investment have an incentive to act honestly and maintain the integrity of the network.\n\nUse Cases and Applications\n\nAvalanche’s unique consensus mechanism opens up a wide range of possibilities for blockchain applications. Its high scalability and fast finality make it ideal for use cases that require quick settlement of transactions, such as micropayments, real-time gaming, and decentralized exchanges.\n\nMoreover, Avalanche’s ability to support multiple subnets allows for the creation of specialized networks tailored to specific use cases. For example, developers can create subnets dedicated to DeFi applications or supply chain management systems, each with its own set of validators and rules.\n\nToken Comparison between Ethereum vs Avalanche\n\nIn the world of cryptocurrencies, tokens play a crucial role in facilitating transactions and powering decentralized applications (dApps). Two prominent blockchain networks that utilize their native tokens are Ethereum and Avalanche. Let’s compare these tokens to understand their unique features and benefits.\n\nEthereum’s Utility Token: ETH\n\nEthereum, often referred to as the pioneer of smart contract platforms, has its native token called ETH. This token serves a dual purpose within the Ethereum ecosystem. Firstly, it acts as a utility token for transaction fees on the network. Whenever users perform any action on Ethereum, such as executing a smart contract or transferring funds, they need to pay transaction fees in ETH.\n\nSecondly, ETH also functions as a store of value. Similar to how people invest in traditional assets like gold or stocks, individuals can hold ETH as an investment with the expectation that its value will appreciate over time. The market capitalization of ETH is substantial due to its longer existence and wider adoption compared to other cryptocurrencies.\n\nAvalanche’s Native Token: AVAX\n\nOn the other hand, Avalanche introduces its native token known as AVAX. Just like ETH on Ethereum, AVAX is used for transaction fees within the Avalanche network. Users must pay AVAX when conducting any activity on this blockchain platform.\n\nHowever, AVAX goes beyond being just a utility token for transactions. It also plays an essential role in staking and governance participation within the Avalanche ecosystem. Staking involves locking up AVAX tokens to support network security and consensus mechanisms while earning rewards in return. Holders of AVAX have voting rights regarding protocol upgrades and changes through governance participation.\n\nMarket Capitalization Comparison\n\nWhen comparing market capitalizations between these two tokens, it is clear that ETH currently holds a larger share than AVAX due to its longer history and broader user base. However, it’s important to note that market capitalization alone does not determine the value or potential of a token. Both ETH and AVAX have unique characteristics and cater to different ecosystems.\n\nFactors Influencing Value\n\nThe value of ETH is influenced by various factors, including the demand for dApps built on the Ethereum platform. As more developers and users adopt Ethereum for creating decentralized applications, the demand for ETH increases, potentially driving up its value. Market sentiment, technological advancements, and regulatory developments can also impact the value of ETH.\n\nOn the other hand, AVAX’s value is closely tied to the growth and expansion of the Avalanche ecosystem. The success of new projects launching on Avalanche, increased adoption by developers and users, and improvements in network scalability can all contribute to an increase in AVAX’s value over time.\n\nFee Comparison between Ethereum and Avalanche\n\nEthereum, one of the most popular blockchain platforms, has faced a significant challenge. This limitation is primarily due to its limited scalability. However, Avalanche aims to address this issue by offering low transaction fees even during peak usage, leveraging its scalable architecture.\n\nEthereum’s High Transaction Fees\n\nDuring times of high demand on the Ethereum network, users have experienced exorbitant transaction fees. This can be attributed to the network’s limited scalability, which leads to congestion and increased competition for block space. As a result, users often find themselves paying hefty fees just to complete their transactions in a timely manner.\n\nAvalanche’s Low Transaction Fees\n\nAvalanche sets itself apart from Ethereum by providing low transaction fees even during periods of high network activity. Its scalable architecture allows for faster processing times and higher throughput, ensuring that transactions can be executed at a lower cost. This makes Avalanche an attractive option for users who are seeking cost-effective blockchain solutions.\n\nFactors Affecting Fee Structure\n\nThe fee structure on both Ethereum and Avalanche varies based on several factors. These factors include network demand and the gas optimization techniques employed by developers.\n\nOn Ethereum, gas fees are determined by the complexity of smart contracts and the amount of computational resources required to execute them. During times of heavy traffic, these fees can skyrocket as users compete for block space.\n\nAvalanche also utilizes gas fees but with a different approach. It employs a unique consensus mechanism called Avalanche consensus, which allows for sub-second finality without sacrificing security or decentralization. This efficient consensus mechanism contributes to lower transaction costs on the platform.\n\nCost-Effectiveness of Avalanche\n\nWith its low transaction fees even during peak usage, Avalanche offers a cost-effective alternative to Ethereum. Users who are looking for affordable blockchain solutions can benefit from Avalanche’s scalable architecture and efficient fee structure.\n\nBy choosing Avalanche over Ethereum, users can save significantly on transaction fees, especially during times of high network congestion. This cost-effectiveness makes Avalanche an appealing option for individuals and businesses alike.\n\nDeFi Comparison between Ethereum and Avalanche\n\nWe discussed how Ethereum has established itself as a pioneer in the world of blockchain and DeFi, with a wide range of applications and a large developer community. On the other hand, Avalanche offers faster transaction speeds and lower fees, making it an attractive alternative for users looking for efficiency.\n\nWhile Ethereum remains dominant in terms of adoption and ecosystem maturity, Avalanche’s innovative consensus mechanism and interoperability features make it a promising contender. It provides an environment that enables developers to build scalable DeFi applications without compromising on security or decentralization.\n\nAs you consider which platform to choose for your DeFi needs, it’s important to evaluate your specific requirements. If you prioritize network effects, extensive developer support, and a wide range of existing DeFi projects, Ethereum may be the right choice for you. However, if speed, low fees, and scalability are your primary concerns, then Avalanche might offer a more suitable solution.\n\nUltimately, both platforms have their strengths and weaknesses. It’s crucial to stay informed about new developments in this rapidly evolving space. Keep exploring different options as technology progresses to find the best fit for your needs. Happy investing!\n\nNote: This conclusion is written with conversational tone using personal pronouns (you), active voice sentences, idiomatic expressions (“stay informed,” “happy investing”), short paragraphs/sentences.\n\nFAQs\n\nWhat is the difference between Ethereum and Avalanche?\n\nEthereum and Avalanche are both blockchain platforms, but they differ in several key aspects. Here’s a breakdown of their differences:\n\nConsensus Mechanism : Ethereum currently uses a proof-of-work (PoW) consensus mechanism, while Avalanche utilizes a novel consensus protocol called Avalanche Consensus, which is based on a variation of proof-of-stake (PoS).\n\nScalability: Ethereum has faced scalability challenges due to network congestion and high gas fees during peak usage. On the other hand, Avalanche claims to offer significantly higher scalability with its sub-second transaction finality and ability to process thousands of transactions per second.\n\nSmart Contract Functionality : Ethereum is renowned for its robust smart contract capabilities, enabling developers to build decentralized applications (DApps) on its platform. Similarly, Avalanche supports smart contracts through its EVM-compatible virtual machine called “Avalanche Contract Chain.”\n\nInteroperability : While Ethereum primarily focuses on its own ecosystem, Avalanche aims to provide interoperability by connecting different blockchains. It offers tools like the “Bridge” feature that enables assets to be transferred between different chains.\n\nDevelopment Community: Ethereum has an established and large development community with numerous projects built on top of it. Although still growing, Avalanche’s development community is smaller but expanding rapidly.\n\nWhich blockchain platform should I choose: Ethereum or Avalanche?\n\nChoosing between Ethereum and Avalanche depends on your specific requirements and goals. Consider the following factors:\n\nUse Case: Evaluate whether your project requires high scalability or extensive smart contract functionality. If you prioritize scalability or need fast transaction finality, Avalanche might be a better fit. However, if your project heavily relies on existing Ethereum-based infrastructure or requires complex smart contracts, sticking with Ethereum could be more suitable. Costs: Take into account transaction fees (gas fees) associated with each platform. At times, Ethereum gas fees can be substantial during periods of high network activity. Avalanche claims to offer lower transaction fees due to its consensus mechanism and scalability features. Community Support: Consider the development community behind each platform. Ethereum has a mature ecosystem with numerous resources, libraries, and developer tools available. Avalanche’s community is growing but may have fewer resources and support options. Interoperability Needs: If you require interoperability between different blockchains or assets, Avalanche’s focus on cross-chain compatibility might be advantageous for your project.\n\nUltimately, it’s recommended to conduct thorough research, consider your specific requirements, and potentially consult with experts before making a decision.\n\nHow do I get started with Ethereum or Avalanche?\n\nTo get started with Ethereum or Avalanche:\n\nEthereum: Visit the official Ethereum website (ethereum.org) to learn more about the platform and access developer resources. You can download an Ethereum-compatible wallet like MetaMask or MyEtherWallet to store ETH and interact with DApps. Explore online tutorials and documentation to understand smart contract development using Solidity. Avalanche: Visit the official Avalanche website (avalabs.org) for comprehensive information about the platform’s features and capabilities. To interact with Avalanche, you can set up an account on a compatible wallet like MetaMask or Trust Wallet that supports the Avalanche network by adding it as a custom RPC network using the appropriate settings provided by Avalanche documentation.\n\nRemember to exercise caution when dealing with cryptocurrencies and ensure you follow best practices for securing your digital assets.\n\nCan I transfer assets between Ethereum and Avalanche?\n\nYes!"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdS50b2RheS8xLWJpbGxpb24td29ydGgtb2YtZXRoZXJldW0tZXRoLXRva2Vucy1leGl0ZWQtY3J5cHRvLWV4Y2hhbmdlcy1pbi13ZWVrc9IBW2h0dHBzOi8vdS50b2RheS8xLWJpbGxpb24td29ydGgtb2YtZXRoZXJldW0tZXRoLXRva2Vucy1leGl0ZWQtY3J5cHRvLWV4Y2hhbmdlcy1pbi13ZWVrcz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "$1 Billion Worth of Ethereum (ETH) Tokens Exited Crypto Exchanges in Weeks - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to the on-chain analytics firm IntoTheBlock, Ethereum, the second largest cryptocurrency by market value, has seen significant outflows from exchanges in recent weeks. Over $1 billion in ETH has been removed from crypto exchanges within this said period.\n\nAdvertisement\n\nETH recorded $320M in exchange outflows this week, and over $1B through the last three weeks! pic.twitter.com/g1xJfh5p9U — IntoTheBlock (@intotheblock) November 17, 2023\n\nEthereum has seen $320 million in exchange outflows this week and more than $1 billion in the previous three weeks. Exchange outflows frequently indicate that investors are moving funds from centralized exchanges to private wallets.\n\nOne prominent argument for increased exchange outflows is that long-term investors are removing assets to keep them for a longer period. This can be viewed as a vote of confidence in the long-term prospects of the cryptocurrency.\n\nETH was down 1.39% in the last 24 hours to $1,938 at the time of writing. According to IntoTheBlock, Ethereum fees have risen in tandem with market volatility and DeFi volumes.\n\nFidelity files for Ethereum ETF\n\nAccording to Bloomberg analyst James Seyffart, money management behemoth Fidelity has entered the spot Ethereum ETF competition by filing a 19b-4 with CBOE.\n\nFidelity will be the seventh entity to file for an Ethereum spot ETF, according to Seyffart.\n\nAccording to a Friday filing, Fidelity is looking to launch an exchange-traded fund that owns Ethereum's ETH, joining rival BlackRock in the crypto adoption push.\n\nThe Fidelity Ethereum Fund would be listed on a Cboe Global Markets exchange, but the SEC must decide whether to authorize the Ethereum ETF, as it would for others, including one from BlackRock.\n\nIn the latest development, the Securities and Exchange Commission delayed making a decision this week on whether to approve the Hashdex Nasdaq Ethereum ETF, which seeks to hold both spot Ethereum and futures contracts.\n\nThe SEC stated that it needed additional time to act and that it would make a decision by Jan. 1, 2024."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzNTQ0L3NlYy1kZWxheXMtaGFzaGRleC1uYXNkYXEtZXRoZXJldW0tZXRmLWFwcGxpY2F0aW9uLXRvLW5leHQteWVhctIBZ2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI2MzU0NC9zZWMtZGVsYXlzLWhhc2hkZXgtbmFzZGFxLWV0aGVyZXVtLWV0Zi1hcHBsaWNhdGlvbi10by1uZXh0LXllYXI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "SEC delays Hashdex Nasdaq Ethereum ETF application to next year - The Block",
        "content": "The Securities and Exchange Commission delayed making a decision this week on whether to approve the Hashdex Nasdaq Ethereum ETH +2.62% ETF, which wants to hold both spot ether and futures contracts.\n\nThe SEC said it needed more time to take action on the change and said it would make a decision on whether to approve, disapprove or \"institute proceedings to determine whether to disapprove,\" by Jan 1, 2024. On Thursday, the agency also delayed a decision on whether to convert an application for a Hashdex bitcoin futures ETF application.\n\n\"The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein,\" the SEC said in a filing dated Nov. 15.\n\nThe Nasdaq stock exchange filed with the SEC to list the Hashdex Nasdaq Ethereum ETF back in September. The fund is managed and controlled by Toroso Investments, which is registered as a commodity pool operator with the Commodity Futures Trading Commission and member of the National Futures Association.\n\n\"Instead of holding 100% spot Ether, which could make it more susceptible to price manipulation in the spot market, the Fund will hold a mix of Spot Ether, Ether Futures Contracts, and cash,\" Nasdaq said in the 19b-4 form in September.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nSEC's history with ether ETFs\n\nThe SEC has approved of an ether futures-like ETF before, but not a spot ether ETF — or a mixed one. Last month, nine futures-based products were approved at the same time, marking their debut.\n\nFirms have recently made a push for spot ether ETFs, including Grayscale's bid to convert its Ethereum trust to a spot ether ETF last month and BlackRock's move this past week to file for a spot ether ETF.\n\nThis comes as multiple firms, including Fidelity, Grayscale and BlackRock are also waiting to see if a spot bitcoin ETF will be approved by the SEC anytime soon."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ibGFja3JvY2stZmlsZXMtc3BvdC1ldGhlcmV1bS1ldGYtMDUyNTIzNjUwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Files for Spot Ethereum ETF After Registering Entity in Delaware - Yahoo Finance",
        "content": "BlackRock Files for Spot Ethereum ETF After Registering Entity in Delaware\n\nBlackRock, the largest global asset manager, has officially submitted a filing to the United States Securities and Exchange Commission (SEC) for an exchange-traded fund (ETF) focused on Ethereum. The proposed ETF, known as iShares Ethereum Trust, seeks to mirror the performance of Ethereum's price, as stated in the Form S-1 filed by iShares, a brand associated with BlackRock's ETF products.\n\nThis recent filing follows BlackRock's registration of the entity iShares Ethereum Trust with the Delaware Department of State Division of Corporations. Furthermore, Nasdaq's filing for the ETF confirms BlackRock's participation in a spot Ether ETF.\n\nCoinbase Custody Trust Company has been selected as the custodian for BlackRock's proposed spot Ether ETF, aligning with the custodian choice for its planned spot Bitcoin ETF. The ETF will utilize the CME CF Bitcoin Reference Rate from CF Benchmarks, a Kraken subsidiary, as its benchmark.\n\nThe announcement of this news led to a nearly 2% increase in the price of Ether (ETH), reaching approximately $2,080.\n\nIn a previous filing, BlackRock submitted an application for the iShares Bitcoin spot ETF in June, and the SEC's decision is still pending.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9zb2xhbmEtZXRoZXJldW0taW50ZXJvcGVyYWJpbGl0eS13ZWIzLWRhcHBzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Solana-Ethereum Interoperability: The Best of Both Worlds for Web3 dApps - CCN.com",
        "content": "Key Takeaways\n\nAdvanced developer tools and a thriving community make Ethereum an attractive option for building dApps.\n\nMeanwhile, Solana offers lower fees and faster transactions.\n\nNeon EVM enables Ethereum dApps to settle transactions on Solana.\n\nInteroperability promises to remove friction for users.\n\nWhen Solana was first conceived, supporters expected it to usurp Ethereum’s throne as the world’s preeminent smart contract platform. But these days, the Ethereum-killer narrative has given way to a focus on blockchain interoperability.\n\nMore than just a buzzword, interoperability is central to a Web3 philosophy committed to the free flow of information and value. It is also the driving force behind an increasingly connected ecosystem of decentralized apps (dApps) and services.\n\nThe dApp Developers Dilemma\n\nWith a headstart of several years, by the time the Solana mainnet launched, Ethereum already benefited from a strong network effect. Today, not only does it boast the most active developer community, but a powerful suite of dev tools and an established user base make Ethereum the go-to choice for most dApp builders.\n\nThat being said, the blockchain still has its drawbacks.\n\nCompared to Solana, Ethereum is slow, clunky and expensive. Sidechains and Layer 2s can scale capacity, but each has its trade-offs.\n\nIn 2023, rising interest in Solana’s potential has even seen its native token SOL significantly outperform ETH. As Ark Invest CEO Cathie Woods put it recently, “Ether was faster and cheaper than Bitcoin in the day — that’s how we got Ether. Solana is even faster and [more] cost-effective.”\n\nBringing Solana’s Power To Ethereum Developers\n\nLooking to create an Ethereum-like development environment on Solana, NeonEVM beta-launch occurred earlier this year, allowing Ethereum smart contracts to run on Solana for the first time.\n\n“Right now, Ethereum is the biggest ecosystem in the market,” CTO Andrey Falaleev said in an interview. “But without efficiency, it will not grow – there will be no evolution.”\n\nFrom a developer’s perspective, NeonEVM approximates the native Ethereum Virtual Machine (EVM). But the efficiency boost comes from Solana, with its superior transaction speed and lower gas fees.\n\nNeonEVM was designed to combine the best of Solana and Ethereum\n\nBy creating what Falaleev called “one world of communication,” the new platform allows two otherwise disconnected ecosystems can grow together.\n\nYet, if interoperability was just a matter of translation, a code compiler like Solang would be sufficient. To realize the full potential of Ethereum compatibility, NeonEVM needs a way to bridge assets from one blockchain to the other.\n\nInteroperability For A Frictionless User Experience\n\nTo port tokens from Ethereum, NeonEVM tapped deBridge. The latter is a decentralized interoperability layer that can transfer data and all manner of different tokens between various blockchains.\n\nThe most simple model for cross-chain bridges sees assets locked at one end while minting their wrapped equivalent at the other. But deBridge’s solution is a far more dynamic and general-purpose protocol for cross-chain transport and messaging.\n\nAs CEO Alex Smirnov explained to CCN, deBridge “allows any projects or any token holders to bridge any asset from other ecosystems to Neon.” For NeonEVM-based dApps, that means users don’t need to hold the network’s native token – NEON – but can pay gas fees in the transaction token.\n\nThe deBridge ecosystem is now seeing its highest daily volumes ever, much of it being passed between Ethereum and @Solana . It's only natural we should have Spaces with @ZetaMarkets and @SquadsProtocol 🔥 See you there in an hour👋https://t.co/gR2yPNSl1A — deBridge (@deBridgeFinance) November 16, 2023\n\nBecause solutions like NeonEVM and DeBridge increasingly abstract away the moving parts, “users can interact with any new data without the need to think about the underlying infrastructure, and even without the need to think about switching wallets or switching networks,” Smirnov observed.\n\nWith Web3 technologies seemingly on the cusp of mainstream adoption, this emerging multichain environment demonstrates the true power of interoperability: its potential to transform the experience of everyday dApp users."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2ZpZGVsaXR5LWZpbGVzLWZvci1zcG90LWV0aGVyZXVtLWV0Zi10cmFpbGluZy1ibGFja3JvY2tzLWxlYWQtYnktdHdvLWRheXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Fidelity files for spot Ethereum ETF, trailing BlackRock's lead by two days - CryptoSlate",
        "content": "Fidelity Investments has filed for a spot Ethereum exchange-traded fund (ETF), as seen in a filing with the Securities and Exchange Commission (SEC) on Nov. 17.\n\nCboe BZX submitted a 19b-4 filing describing a proposed rule change that would allow it to list and trade shares of Fidelity’s planned fund. The new Ethereum proposal closely resembles Fidelity’s spot Bitcoin ETF proposal, submitted to the SEC in late June.\n\nBoth Fidelity filings follow similar applications from the company’s main competitor, BlackRock. BlackRock submitted an S-1 filing for its spot Ethereum ETF just days ago, on Nov. 15, and applied for its spot Bitcoin ETF months earlier in June.\n\nThe close timing between the competing filings may be explained by each asset manager’s exceptionally high standing. BlackRock is the largest asset manager in the world, with $9 trillion in assets under management. Fidelity, on the other hand, is the third largest asset manager in the world, with $4.2 trillion in assets under management.\n\nOther firms have pending applications\n\nSeveral other asset managers have also applied for their own spot Bitcoin ETFs and spot Ethereum ETFs following the above high-profile filings.\n\nThe SEC is expected to approve or reject a Bitcoin ETF by Jan. 10, 2024. That decision concerns a spot Bitcoin application from ARK Invest, which submitted its application in May — about one month before BlackRock submitted its more influential filing. The SEC could apply its decision to other pending ETF applications, many of which are intentionally similar to one another, in order to meet expected requirements.\n\nThough the SEC will evaluate any spot Ethereum ETFs separately from spot Bitcoin ETFs, the approval of one type of fund may pave the way for the other.\n\nIt should be noted that although the SEC has not yet approved any Bitcoin or Ethereum spot ETF, it has approved futures ETFs of both types in recent months and years."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZmlkZWxpdHktZmlsZXMtZm9yLXNwb3QtZXRoZXJldW0tZXRmLXdpdGgtc2Vj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Fidelity Files for Spot Ethereum ETF with SEC - Watcher Guru",
        "content": "$4.5 trillion asset manager Fidelity has officially filed for a Spot Ethereum ETF. The move follows asset manager BlackRock, who filed their Ethereum ETF application last week. The official SEC filing recognizes Fidelity as responsible for the Trust’s Ether, while Delaware Trust company is the Trustee.\n\nIf approved, Fidelity will provide Spot Ethereum ETF services to its clients. Thus, new institutional clients can open the gates to the cryptocurrency market.\n\nJUST IN: $4.5 trillion asset manager Fidelity files for Spot Ethereum ETF. November 17, 2023\n\nAccording to the Registration Statement, each Share will represent a fractional\n\nundivided beneficial interest in the Fidelity ETH Fund’s net assets. The Trust’s assets will consist of ETH held by the New York Department of Financial Services on behalf of the Fidelity Ethereum Fund.\n\nSpot ETFs dramatically broaden access to crypto for average investors, which has been a growing mission amongst asset managers like BlackRock, Grayscale, and others for months. However, the SEC has been avidly battling against it. Bitcoin and Ethereum are two of the top cryptocurrencies on the market in terms of trade volume and value. Similarly to Bitcoin, Ethereum may see a large value jump in the next 24 hours following the news of Fidelity’s application.\n\nAlso Read: Fidelity Labels Bitcoin Most Secure and Decentralized Crypto\n\nFidelity has been outspoken in its praise for Ethereum. The firm’s Director of Research, Chris Kuiper, recently discussed how the digital asset has started to gain ground and how it could continue to grow in the coming years. Fidelity’s Spot Ethereum ETF application further shares the firm’s optimism that ETH will be in the future of mass transactions."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZGVjcnlwdC5jby8yMDY1NzkvZmlkZWxpdHktZXRoZXJldW0tZnVuZC1zcG90LWV0aC1ldGbSAUNodHRwczovL2RlY3J5cHQuY28vMjA2NTc5L2ZpZGVsaXR5LWV0aGVyZXVtLWZ1bmQtc3BvdC1ldGgtZXRmP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Fidelity Joins BlackRock in Race for Ethereum ETF - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFinancial services giant Fidelity Investments is seeking regulatory approval to launch an exchange-traded fund (ETF) that would hold the Ethereum cryptocurrency, according to a Thursday filing with the Securities and Exchange Commission. The filing comes a day after BlackRock submitted its own Ethereum ETF application.\n\nThe proposed Fidelity Ethereum Fund would track the price of Ethereum, the native token of the Ethereum blockchain network. The ETF's shares would trade on the Cboe BZX Exchange under the ticker symbol ETHF.\n\nFidelity said the ETF aims \"to seek to track the performance of Ether, as measured by the performance of the Fidelity Ethereum Index.\" The index represents the U.S. dollar price of ether based on trading activity across major ether trading platforms.\n\nAD\n\nAD\n\n\"They are the seventh filer for spot Ethereum,\" Jaymes Seyffart, ETF research analyst, wrote on Twitter, noting earlier filings by BlackRock, Grayscale, 21Shares/ARK, VanEck, and Hashdex.\n\nBlackRock is the most notable applicant, bringing with it the scale and expertise necessary to manage more than $9.4 trillion in assets. Hashdex joined the fray in August.\n\nThe filing comes as the SEC has faced mounting pressure to approve a spot bitcoin ETF after approving futures-based bitcoin ETFs last year. Cryptocurrency proponents argue that a spot ETF would provide a safer way for mainstream investors to gain exposure to digital assets.\n\nLate Friday, the SEC announced that it was delaying its decision on two spot Bitcoin ETFs—from Franklin Templeton and Global X—after pushing back Hashdex earlier this week.\n\n\"Heretofore, U.S. retail investors have lacked a U.S. regulated, U.S. exchange-traded vehicle to gain exposure to [Ethereum],\" Fidelity said in its proposal. \"Meanwhile, investors in other countries... are able to use more traditional exchange-listed and traded products.\"\n\nAD\n\nAD\n\nThe proposed Ethereum ETF would face regulatory hurdles similar to previous attempts at bitcoin ETFs. The SEC has typically required surveillance-sharing agreements between an ETF's listing exchange and the underlying spot market for an asset. It remains unclear if the SEC views the ether futures market, which launched in 2021, as mature enough to meet that standard.\n\nFidelity, which manages over $11 trillion in customer assets, has been growing its cryptocurrency business. The firm launched institutional cryptocurrency trading and custody services in 2018. Rival asset managers including Invesco and Galaxy Digital have also filed for crypto ETFs this year.\n\nThis story was drafted with Decrypt AI from sources referenced in the text, and fact-checked by Ryan Ozawa."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vYmxvY2tvbm9taS5jb20vYmxhY2tyb2NrLWZpbGVzLWZvci1ldGhlcmV1bS1ldGYtaGVyZXMtd2hhdC13ZS1rbm93L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Blackrock Files for Ethereum ETF: Here's What We Know - Blockonomi",
        "content": "Asset management giant BlackRock made waves this week by filing for regulatory approval of a spot Ethereum exchange-traded fund (ETF). The proposed ETF, titled iShares Ethereum Trust, aims to give investors direct exposure to ether, the native cryptocurrency of the Ethereum blockchain.\n\nKeypoints\n\nBlackRock has filed for a spot Ethereum ETF with the SEC, seeking to provide direct exposure to ether. This comes after it filed for a spot bitcoin ETF in June.\n\nThe Ethereum ETF will be called the iShares Ethereum Trust and listed on Nasdaq if approved. The bitcoin ETF is called iShares Bitcoin Trust.\n\nCoinbase Custody will hold the Ethereum ETF’s ether, similar to BlackRock’s proposed bitcoin ETF.\n\nBlackRock joining the crypto ETF race shows growing institutional interest in direct cryptocurrency exposure.\n\nThe crypto industry hopes BlackRock’s Ethereum ETF filing could improve chances of regulatory approval after a court ruled the SEC was wrong to reject a spot bitcoin ETF.\n\nThe filing with the Securities and Exchange Commission (SEC) comes just months after BlackRock sought approval for a spot bitcoin ETF called iShares Bitcoin Trust. Both filings represent a major bet on crypto by the world’s largest asset manager.\n\nBlackRock’s push into crypto ETFs signals growing confidence that the SEC will finally approve such products. The regulator has long rejected spot crypto ETFs over concerns about potential fraud and manipulation, instead approving only futures-based products.\n\nBut a landmark federal court ruling in August said the SEC was wrong to reject a spot bitcoin ETF proposed by Grayscale Investments. The decision gave the industry renewed optimism that physical crypto ETFs would soon get the green light.\n\nNow all eyes are on how regulators respond to BlackRock’s filings. Approval would allow mainstream investors easy access to crypto returns without direct custody challenges. It would also boost confidence in the maturing crypto asset class.\n\nBlackRock has selected Coinbase Custody to hold the proposed Ethereum ETF’s ether reserves. Coinbase will also custodian the bitcoin if BlackRock’s bitcoin ETF is approved. The ETFs will use CF Benchmarks’ reference rates as benchmarks.\n\nThe filings pit BlackRock against rivals like Grayscale, Valkyrie and Invesco in the race for first-mover advantage in crypto ETFs. While Grayscale and others focus solely on digital assets, BlackRock’s size and influence could make it a formidable competitor.\n\nThe moves expand BlackRock’s growing crypto footprint. The firm began trading bitcoin futures last year and recently invested in Coinbase. CEO Larry Fink says BlackRock is studying digital currencies and the metaverse.\n\nWith over $8 trillion in assets under management, BlackRock can singlehandedly drive mainstream adoption. Its backing of crypto ETFs gives individual investors a safer route to gain exposure without direct ownership. For a cautious Wall Street firm, it’s an incremental but important step into the world of digital assets."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY3J5cHRvLm5ld3MvZmlkZWxpdHktaW52ZXN0bWVudHMtZmxvYXRzLWV0aGVyZXVtLWV0Zi1hcHBsaWNhdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Fidelity Investments floats fresh Ethereum ETF application - crypto.news",
        "content": "Fidelity Investments filed for a spot Ethereum (ETH) exchange-traded fund (ETF) with the U.S. Securities and Exchange Commission (SEC) to list and trade shares of the Fidelity Ethereum Fund on the Cboe BZX Exchange.\n\nFidelity and BlackRock await SEC greenlight\n\nAccording to its filing, the fund is a spot exchange-traded fund (ETF) that would hold Ethereum’s ether (ETH).\n\nThe ETF, if approved, will trade in compliance with the Cboe BZX Rule. Fidelity’s Ether ETF push comes after BlackRock’s Ethereum ETF filing. It is believed that ETFs could make it far easier for the average person to invest money in a crypto-linked asset.\n\nSecuring approval of a spot Ethereum ETF would represent a major win for crypto investors in the U.S., as regulators in the region are yet to approve any spot crypto ETF. Fidelity Investments has reportedly expressed confidence in securing regulatory approval, as it has cited an excerpt from the ruling in the Grayscale versus SEC legal battle.\n\nIn Fidelity’s filing, submitted on Nov. 17, to the SEC, they seek approval to list and trade shares of the Fidelity Ethereum Fund on the Cboe BZX Exchange.\n\nAccording to the Registration Statement, each share is set to represent a fractional undivided beneficial interest in the Trust’s net assets, predominantly comprising ETH held by the Custodian on behalf of the Trust.\n\nThis move places Fidelity among seven contenders, including BlackRock, Hashdex, Grayscale, and VanEck, vying for approval for a spot Ethereum ETF.\n\nFidelity has highlighted the absence of a low-risk option for US citizens to engage with ETH and digital assets, pointing to the lack of US-regulated exchange-traded vehicles.\n\nIt also draws a comparison with Europe, where investors have access to products on regulated exchanges, providing exposure to various spot crypto assets. Fidelity argues that this disparity underscores the necessity for a similar avenue for US investors.\n\nAccording to the proposal, Fidelity aims to confront issues related to fraudulent and manipulative practices.\n\nYou might also like: US SEC accepts Blackrocks Spot Bitcoin ETF application\n\nSEC rejects spot crypto ETFs\n\nIn a court ruling, the U.S. securities regulator has faced criticism for rejecting Grayscale Investments’ application to establish a spot Bitcoin exchange-traded fund (ETF).\n\nThe court ruled that the dreaded regulator had not adequately justified its denial of Grayscale’s product and mandated a reconsideration of the decision. This verdict holds the potential to open the door for the first-ever product of its kind, allowing investors exposure to the digital asset without the need to acquire the currency.\n\nPost the court’s favorable decision, Grayscale is pressing the SEC for swift approval of its ETF proposal. The SEC’s decision not to challenge its August court defeat regarding Grayscale’s application further enhances the prospects for the spot Bitcoin ETF approval.\n\nGrayscale is operationally poised to convert its Bitcoin Trust into an ETF upon SEC approval. The court’s final verdict is yet to be determined, creating uncertainty about the SEC’s approach to Grayscale’s application and other ETF filings from financial giants like BlackRock and others.\n\nExpressing skepticism, BitGo CEO Mike Belshe expressed doubts over the imminent approval of a spot Bitcoin ETF in the US.\n\nHe attributes this skepticism to unresolved market structure issues and predicts additional rejections by the U.S. Securities and Exchange Commission (SEC) for spot Bitcoin ETFs. While there is a general belief among market experts that approval is on the horizon after Grayscale’s legal victory, Belshe warns of a challenging road ahead for Bitcoin ETFs.\n\nRead more: Grayscales Spot Bitcoin ETF encounters further setback\n\nFollow Us on Google News"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzNjI2L2ZpZGVsaXR5LWZpbGVzLWZvci1zcG90LWV0aGVyZXVtLWV0Zi1zYXlzLWFwcHJvdmFsLXdvdWxkLWJlLW1ham9yLXdpbi1mb3ItdXMtaW52ZXN0b3Jz0gF-aHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjYzNjI2L2ZpZGVsaXR5LWZpbGVzLWZvci1zcG90LWV0aGVyZXVtLWV0Zi1zYXlzLWFwcHJvdmFsLXdvdWxkLWJlLW1ham9yLXdpbi1mb3ItdXMtaW52ZXN0b3Jz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Fidelity files for spot Ethereum ETF, says approval would be 'major win' for US investors - The Block",
        "content": "Asset management giant Fidelity has filed for a spot ether ETF, in the footsteps of its spot bitcoin ETF application.\n\n\"To this point, approval of a Spot ETH ETP would represent a major win for the protection of U.S. investors in the crypto asset space,\" the filing states, claiming that investors are facing significant risk without such products as they seek alternative, riskier ways to get exposure.\n\nThe filing noted the recent Grayscale court ruling where the court said the SEC had failed to find a coherent reason why it should reject spot crypto ETFs when it had allowed futures-based products.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nIn June, Fidelity filed for a spot bitcoin ETF, shortly after BlackRock entered the race. The Block broke the news ahead of the filing."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mb3VuZGF0aW9uLXNoaWZ0cy1taWxsaW9ucy1pbi1ldGgtYmVmb3JlLTYtcHJpY2UtZGVjbGluZdIBVWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mb3VuZGF0aW9uLXNoaWZ0cy1taWxsaW9ucy1pbi1ldGgtYmVmb3JlLTYtcHJpY2UtZGVjbGluZT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Foundation Shifts Millions in ETH Before 6% Price Decline - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to on-chain data, the Ethereum Foundation made a significant ETH move in recent hours.\n\nAdvertisement\n\nOn-chain analytics firm Lookonchain reports that the ETH Foundation moved 1,200 ETH worth $2.36 million to the grant provider wallet.\n\nIn the past month, the specific wallet \"Grant Provider\" swapped over 1,700 ETH for $2.7 million in USDC with the intention of selling.\n\nThe Ethereum Foundation wallet transferred 1,200 $ETH ($2.36M) to the Grant Provider wallet and 75 $ETH ($148K) to the wallet \"0x180c\" 2 hours ago.https://t.co/124yqXLQ3e pic.twitter.com/WTJuh3T4Qt — Lookonchain (@lookonchain) November 17, 2023\n\nThe Ethereum Foundation also made other moves, transferring 75 ETH worth $148,000 to the wallet \"0x180c\" in recent hours, per Lookonchain.\n\nIn a similar vein, Arkham Intelligence reports a significant ETH move by the Ethereum Foundation, with wallet 0x9eE transferring 1066 ETH to a new multisig wallet.\n\nThough many possibilities remain as regards the move, it is uncertain what the real motive of the transfer is.\n\nEthereum, the second-largest cryptocurrency, saw seesaw price action in the past day, reaching highs of $2,100 before retracing back to $1,909.\n\nAt the time of writing, ETH was still trading below $2,000 and was down 6% in the last 24 hours to trade at $1,951.\n\nIn a positive development, BlackRock, the world's largest asset manager, has filed an S-1 form with the United States Securities and Exchange Commission (SEC) for its iShares Ethereum Trust, a spot Ether exchange-traded fund (ETF).\n\nThe price of Ethereum initially increased in response to the filing but subsequently returned to its previous levels."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLW5hbWUtc2VydmljZS1kZWNyaWVzLXVuc3RvcHBhYmxlLWRvbWFpbnMtcGF0ZW50LWFzLWEtdGhyZWF0LXRvLW9wZW4tc291cmNlLWV0aG9zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Name Service decries Unstoppable Domains patent as a threat to open-source ethos - CryptoSlate",
        "content": "Nick Johnson, the lead developer of Ethereum Name Service (ENS), accused Unstoppable Domains of patenting its open-source innovation regarding “Resolving Blockchain Domain” in a Nov. 16 open letter posted on social media platform X (formerly Twitter).\n\nJohnson asserted that Unstoppable Domains’ patent was solely based on ENS-developed innovations without any unique contributions from the rival firm.\n\nUnstoppable Domains ‘anti-open innovation’ activities\n\nJohnson further explained how Unstoppable Domains’ patenting efforts contradict the principles of open innovation, citing how the rival firm made a recent “application for reserving names akin to a ‘Sunrise Phase’ that has been common to the Domain Name Service (DNS) world for many years.”\n\nOn the other hand, ENS has refrained from patenting its innovations despite being a leader in the space, saying its works are “under open-source licenses” and “publicly available for anyone to implement.”\n\nJohnson emphasized the need for Unstoppable Domains to commit legally to donating its first patent under an “unconditional and irrevocable patent pledge,” saying, “Press releases are not legally binding.” Failure to do this, Johnson warned that “ENS Labs stands ready to challenge this patent, which we believe is entirely derivative of our inventions; a position we are able and willing to demonstrate.”\n\nHe concluded that the letter was necessary to “emphasize the importance of permissionless innovation and open standards in the web3 ecosystem and to request [Unstoppable Domains] cooperation in ensuring web3 naming continues to be a place for innovation.”\n\nUnstoppable Domains responds\n\nIn response, Matthew Gould, the founder of Unstoppable Domains, highlighted his firm’s commitment to driving advancements in web3 naming standards. He emphasized the critical role of collaborative efforts and discussions in navigating the industry’s evolving landscape.\n\nMeanwhile, Johnson proposed that Unstoppable Domains should extend the openness of their patent licensing beyond ENS, citing models such as patent non-aggression pacts used by companies like IBM.\n\nHowever, Gould broadened the scope of the discussion, pointing out the broader industry implications, noting that the focus on Unstoppable Domains could easily shift to patents or trademarks from companies in different regions later.\n\nGould reiterated the necessity for a proactive forum for discussion, inviting ENS to join the Web3 Domain Alliance to foster an environment conducive to open dialogue and collaboration in shaping the future of web3 naming standards."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2ZpZGVsaXR5LWZpbGVzLWV0aGVyZXVtLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Fidelity jumps aboard the spot ETH ETF train - Blockworks",
        "content": "Fidelity filed a 19b-4 application with the Securities and Exchange Commission late Friday for an ethereum ETF.\n\nAccording to the filing, the proposed rule change names the fund the Fidelity Ethereum Fund. The 19b-4 was filed with CBOE.\n\nA 19b-4 is a rule change form required by the SEC.\n\n“The investment objective of the Trust is to seek to track the performance of ETH, as measured by the performance of the Fidelity Ethereum Index…In seeking to achieve its investment objective, the Trust will hold ETH,” the filing said.\n\nFidelity’s proposed ETH fund comes a week after BlackRock also filed a 19b-4 for an ether ETF. Since then, BlackRock has submitted an S-1 with the SEC, paving the way for the Commission to make a decision on the fund. BlackRock’s fund would be listed on Nasdaq.\n\nRead more: SEC delays yet another bitcoin ETF rule change\n\nFidelity is also in the running for a spot bitcoin ETF, having re-upped its bid for that fund back in June. The SEC has yet to make a decision on whether it will greenlight any spot bitcoin ETFs, having recently delayed a few with November deadlines, including Franklin Templeton, Hashdex and Global X.\n\nBlackRock is also in the running for a spot bitcoin ETF, which has led many to believe that the SEC is considering greenlighting the ETFs. BlackRock has a long history of approvals with the SEC.\n\nIn October, the Depository Trust and Clearing Corporation listed BlackRock’s proposed ETF on its site, leading eagle-eyed ETF watchers to believe that the asset manager was close to receiving regulatory approval.\n\nHowever, the DTCC later told Blockworks that the move was not indicative of a pending approval.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcm9sbHVwcy1ub3ctaGF2ZS10aGVpci1vd24tZXJjLTQzMzfSAURodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLXJvbGx1cHMtbm93LWhhdmUtdGhlaXItb3duLWVyYy00MzM3P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Rollups Now Have Their Own ERC 4337 - U.Today",
        "content": "Advertisement\n\nIn Ethereum (ETH) mainnet, account abstraction is designed to blur the line between on-chain accounts and smart contracts. A similar groundbreaking development is to arrive to EVM rollups as a detailed rollup improvement proposal is out.\n\nThis proposal might change game in Ethereum-based rollups\n\nAlexander Forshtat, a software developer of Ethereum Foundation, published a proposal dubbed Roadmap for Native Account Abstraction Introduction or RIP-7560: Native Account Abstraction. It is the first attempt to employ the concept of AA within the ecosystem of rollups, i.e., second-layer scaling solutions for Ethereum (ETH).\n\nLet 'er RIP! ✨\n\n\n\nNative Account Abstraction for rollups standardization that is https://t.co/hR0MU6inuh — erc4337 (@erc4337) November 18, 2023\n\nThe activation of AA in EVM rollups is a crucial step for the Ethereum (ETH) segment of Web3. Its L1 and L2s should have similar AA designs to establish a \"continuous ecosystem.\"\n\nThe implementation of AA in rollups would require three changes in smart contract accounts: EntryPoint address adjustment, validateUserOp function rewrite and some advances in transaction logics.\n\nSome changes are also required to adjust Paymaster operations and the signature aggregation process. Validation code rules, staking and reputation systems in rollups will look like in the post-ERC 4337 Ethereum (ETH) mainnet.\n\nIn the last two days, Ethereum (ETH) enthusiasts have already submitted a number of comments in the project's GitHub repository.\n\nNative account abstraction standard to land in all L1s and L2s\n\nThe author of the proposal is optimistic about the prospects of its development and adoption as well as its potential role in Ethereum's (ETH) evolution:\n\nWe believe standardization and network effect are critical to the success of any Account Abstraction initiatives, so we are inviting everyone to participate in the creation of the Native Account Abstraction standard that can be adopted by all Layer-2 and Layer-1 networks.\n\nAs covered by U.Today previously, ERC 4337 \"Account Abstraction\" was activated on the Ethereum (ETH) mainnet in March 2023.\n\nWith account abstraction, Ethereum (ETH) on-chain wallets (externally-owned accounts) can be equipped with smart contracts functionality.\n\nThe new class of accounts — smart contract accounts — unlocks new opportunities for real-world applications on Ethereum (ETH)."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtZXRoLXJhbGx5LXByZWx1ZGUtdG8tZnVydGhlci1nYWlucy1hcy1wcmljZS1leGNlZWRzLTIwMDAtYWdhaW7SAVxodHRwczovL3UudG9kYXkvZXRoZXJldW1zLWV0aC1yYWxseS1wcmVsdWRlLXRvLWZ1cnRoZXItZ2FpbnMtYXMtcHJpY2UtZXhjZWVkcy0yMDAwLWFnYWluP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum's (ETH) Rally: Prelude to Further Gains as Price Exceeds $2,000 Again - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum has once again crossed the $2,000 threshold, a level it has not seen since April 2023. This resurgence in value is not just a number on a chart; it reflects broader sentiment and the movements of significant players on the market – whales. As the second largest digital asset gained bullish strength, partly fueled by the buzz around BlackRock's potential spot Ethereum ETF, market optimism has grown for a sustained rise in the near term​​.\n\nWhale activity has been particularly noteworthy, with a spike in transactions to their highest levels in seven months, indicating a flurry of activity among these large capital players​​. This is significant because whale behaviors often prelude broader market trends; when they move, the market watches closely. While some whales have booked profits in the wake of the rally, others have gone on a buying spree, picking up 3,200 ETH coins following the price surge​​​​.\n\nOne whale, previously inactive for nearly three years, transferred a staggering 26,406 ETH to crypto exchange Bitfinex, realizing a profit of nearly $50 million​​. Another smart whale moved 25,700 ETH to Binance just before the rally, netting gains of $1.5 million as the price pumped​​.\n\nHowever, not all actions by whales suggest a bullish continuation. Some whale investors have been unstaking their ETH and sending them to exchanges to lock in gains, a move that could be interpreted as preparation for a potential downturn​​. Also, a noticeable spike in exchange-related addresses could indicate that some whales are transferring their holdings to book profits, possibly hinting at a cautionary stance toward the immediate future of the market​​.\n\nEthereum still aims upward\n\nSolana (SOL) has been a standout performer in recent market activity, displaying robust momentum that has seen its price secure a position well above the $60 mark. This formidable strength in price action is not without its underlying factors, and market analysts are closely monitoring the potential for a surge beyond the $70 threshold.\n\nSolana's ascent can be partly attributed to the broader market's return to risk-on sentiment, where investors are gravitating toward assets with solid fundamentals and strong use cases. Furthermore, technical indicators on the daily chart are signaling a bullish trend, with SOL consistently making higher lows and higher highs – a classic sign of a sustained uptrend.\n\nThe chart reveals a potential support level at the $60 mark, which has recently transitioned from a resistance level to a support level following its breakout. This is a bullish indicator, as what was once a ceiling for price is now a floor, suggesting that SOL has the backing of buyers at this new price point.\n\nAs for when the rally might lose steam, traders are eyeing the Relative Strength Index (RSI) and trading volume for clues. The RSI is currently in a healthy range, neither overbought nor oversold, which typically provides room for further price appreciation. However, should the RSI approach overbought territory, above 70, the likelihood of a reversal could increase as the asset may be considered overextended.\n\nCardano's bullish trend still here\n\nCardano (ADA) has been showcasing a bullish trend, as evidenced by its recent breakout, which suggests the potential for a notable price increase. The asset has experienced an impressive surge in trading volume, a strong indicator of increased buying interest and market confidence​​.\n\nThe ADA/USDT daily chart on Binance highlights ADA's significant uptrend. Currently navigating around $0.3690, ADA's price stands well above both the 50-day and 100-day moving averages. These key indicators underscore the asset's robust bullish momentum and point toward a continuation of the upward movement​​.\n\nThe surge in trading volume accompanying ADA's rally is a critical factor supporting optimistic market sentiment. This increased activity is not just reflective of growing investor confidence but also reinforces the likelihood of ADA's continued rise. Analysts project a 20% leap from current levels, aiming for a price point near $0.44, assuming support levels hold firm and bullish sentiment remains intact​​.\n\nHowever, the inherently volatile nature of the cryptocurrency market suggests that a pullback is always within the realm of possibility. Should ADA encounter resistance or face profit-taking activities, especially around the $0.38 to $0.40 range, we might see a temporary retracement before further gains​​."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9jYW4tZXRoZXJldW0tcHJpY2UtcmVhY2gtMzAwMC1hZnRlci1ibGFja3JvY2stZXRmLWFwcHJvdmFsLTEzODkyODTSAV5odHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vY2FuLWV0aGVyZXVtLXByaWNlLXJlYWNoLTMwMDAtYWZ0ZXItYmxhY2tyb2NrLWV0Zi1hcHByb3ZhbC8xMzg5Mjg0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Can Ethereum (ETH) Price Reach $3,000 after Blackrock ETF Approval? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tdG9wcy1lc2ctcmFua2luZy1hZ2Fpbi13aGlsZS1iaXRjb2luLWNvbnRpbnVlcy10by1zdHJ1Z2dsZS_SAWJodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL2V0aGVyZXVtLXRvcHMtZXNnLXJhbmtpbmctYWdhaW4td2hpbGUtYml0Y29pbi1jb250aW51ZXMtdG8tc3RydWdnbGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum tops ESG ranking again while Bitcoin continues to struggle - AMBCrypto English",
        "content": "Ethereum outperformed other cryptos with a total score of 78.\n\nBitcoin’s low score of 7 on environmental parameters impacted its overall ranking.\n\nProof-of-stake (PoS) blockchain Ethereum [ETH] stood first in the latest institutional-grade ESG (Environmental, Social, Governance) ranking released by crypto market data provider CCData.\n\nEthereum becomes investment-friendly\n\nEthereum was followed by popular altcoin projects like Solana [SOL], Polkadot [DOT], and Binance Coin [BNB]. Interestingly, the world’s largest crypto asset Bitcoin [BTC] was languishing in the 26th position out of the 40 assets that were evaluated.\n\nLaunched in partnership with the Crypto Carbon Ratings Institute (CCRI), the ESG benchmark assesses some of the most liquid assets of the market across key environmental, social, and governance parameters.\n\nEthereum outperformed other cryptos with a total score of 78. The asset scored above 28 on the social parameter, the highest on the list, while also doing well on the environmental and governance indices.\n\nEthereum, along with Solana, Polkadot, and Binance Coin earned the perfect “AA” grade. This was a significant improvement from the previous rankings where only Ethereum scored the AA grade.\n\nBitcoin’s green credentials not up to the mark\n\nBitcoin, on the other hand, could only manage a score of 57.37. The crypto’s low score of 7 on the environmental parameter significantly impacted the final score. In fact, this was the lowest rating of any of the assets surveyed.\n\nUnsurprisingly, high energy consumption continues to damage Bitcoin’s green credentials. The proof-of-work (PoW) mechanism makes the network a big power guzzler, resulting in more greenhouse emissions.\n\nWhy ESG rankings matter\n\nIn recent years, there has been a growing recognition of the importance of ESG factors in investment decision-making. Projects that effectively manage ESG risks and opportunities are more likely to generate sustainable returns over time.\n\nMoreover, regulatory frameworks are also integrating ESG factors into their requirements. With the regulatory climate in some jurisdictions heating up, it made perfect sense for cryptos to concentrate on improving them."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ldGhnYXRlLXdoby1pcy1zdGV2ZW4tbmVyYXlvZmYtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Who is Steven Nerayoff and What Does ETHgate Recording Mean for Ethereum and Buterin? - CCN.com",
        "content": "Key Takeaways\n\nFormer Ethereum advisor Steven Nerayoff has promised to expose fraud and corruption he claims took place during Ethereum’s formative years.\n\nIn his latest revelation, Nerayoff has released a recording of a conversation he had with Vitalik Buterin in 2015.\n\nThe recording has sparked fresh interest in the “ETHgate” conspiracy theory.\n\nIn recent months, the former Ethereum advisor Steven Nerayoff has promoted allegations that Ethereum received preferential treatment from regulators, fueling a conspiracy theory known as ETHgate.\n\nClaiming to have evidence of corruption that implicates Ethereum founder Vitalik Buterin, on Thursday, November 16, Neyaroff published a recording of a conversation the two men had in 2015. The recording is certainly interesting, but is there any substance to Nerayoff’s allegations?\n\nNerayoff Releases Long-Awaited ETHgate Recording\n\nAccording to Nerayoff, the recording in question originates from a meeting he held with Buterin after he received requests to assess Ethereum’s long-term viability and potential restructuring.\n\nA qualified attorney who has founded and led several digital technology startups since 1998, Nerayoff’s advice to Buterin was stark: “Virtually everybody needs to go,” he told the Ethereum founder. The restructuring he proposed would have entailed replacing most of the project’s leaders, commissioning an independent audit of accounts, and establishing a new, for-profit entity funded by venture capital investments to direct Ethereum’s development.\n\nETHEREUM RESCUE & RESTRUCTURE PLAN:\n\nIn late 2014 Ethereum was in trouble. Vitalik Buterin asked Steven Nerayoff to do a full diagnostic assessment and recommendations on how to save Ethereum and restructure it for long term success. Over the early months of 2015 Steven and… pic.twitter.com/o7H0dwMhiy — Steven Nerayoff (@StevenNerayoff) November 16, 2023\n\nOver the course of more than 3 hours, he proceeded to warn Buterin that Ethereum’s initial fundraising and subsequent distribution of ETH landed it on some shady legal ground. “I am fairly convinced that securities laws and these other laws have been tripped,” he remarked at one point.\n\nEthereum Fraud Claims Still Unsubstantiated\n\nWhile it proves he warned Buterin about potential legal trouble, the ETHgate recording isn’t quite the bombshell Nerayoff promised. Previously, he implied that he had evidence of a backroom deal with the Securities and Exchange Commission (SEC) deal that helped Ethereum skirt regulatory scrutiny.\n\nIn one post on X, he even suggested that Buterin and Joseph Lubin, another key contributor in Ethereum’s early days, were responsible for fraud that is “1000x bigger than SBF,” an accusation he has repeated on numerous occasions.\n\nCommenting on the recorded conversation with Buterin, the former Ethereum advisor noted that it “isn’t directly related to the fraud but will illuminate a lot of what was really happening.” He has also hinted at a potential lawsuit, suggesting another reason for playing his cards close to his chest.\n\nFor now, Nerayoff’s claims remain unsubstantiated. After saying he had evidence that could prove Buterin broke the law, all he has demonstrated so far is that the two men disagreed on what Ethereum should look like.\n\nTakeaways:\n\n1) @StevenNerayoff was charged with criminal extortion in 2019 by the US Department of Justice. This is another one of his attempts to shake someone down for profit.\n\n2) @StevenNerayoff had no intention of helping Vitalik, he was setting him up from the beginning. — Christopher Bischof (@UKECB) November 17, 2023\n\nWhile his supporters view him as an important whistleblower helping to expose corruption at Ethereum and US Federal agencies, critics have questioned his motives, often pointing to his previous arrest for criminal extortion to raise doubts about his character.\n\nIlluminating Ethereum’s Difficult Start\n\nAt the very least, Nerayoff’s latest disclosure sheds light on a rocky period of Ethereum’s development.\n\nCharles Hoskinson, who had left Ethereum by 2015 after falling out with fellow co-founders, is often mentioned in the recording. Like Nerayoff, he disagreed with Buterin’s vision for Ethereum, and would ultimately go on to launch Cardano as a rival platform.\n\nAfter all this time, however, Hoskinson appears to have moved on. He tends to make light of ETHgate, but in his assessment of Nerayoff’s recording, Hoskinson said it revealed an uncomfortable truth about how close Buterin and his allies came to not being able to finish what they started. “But they did, and the rest is history,” he emphasized.\n\nStriking a conciliatory tone, he said “it’s a shame that things have been so profoundly and deeply personal for so long,” while steering clear of Nerayoff’s more bombastic rhetoric.\n\nSo what next for ETHgate? As someone involved with Ethereum at a high level during its early years, Steven Nerayoff’s endorsement has given the conspiracy theory a degree of credibility. Yet the whole thing often feels desperate.\n\nAt worst, the focus on speculation and absence of concrete evidence distracts from other concerns, such as the identity of Ethereum’s earliest backers, who could potentially still excerpt control over the network today.\n\nRather than being grounded in facts, ETHgate is mostly fueled by SEC haters and disgruntled XRP supporters, often peddling misinformation to further their agendas. That doesn’t mean the rumors and charges are true. But as Hoskinson cautioned: “Don’t believe just because somebody wrote a book or released a transcript that you now know everything.”"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2luc2lnaHRzL2JpdGNvaW4tb3V0c3RyaXBzLWV0aGVyZXVtLWluLWRhaWx5LXRyYW5zYWN0aW9uLWZlZXMtZm9yLWZpcnN0LXRpbWUtc2luY2UtMjAyMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin outstrips Ethereum in daily transaction fees for first time since 2020 - CryptoSlate",
        "content": "Quick Take\n\nBitcoin transaction fees have eclipsed Ethereum’s on a single-day basis, reaching a notable $11.6 million, a feat not seen since late 2020, according to Cryptofees.\n\nThis surprising surge is attributed to an increasing inscription frenzy. Comparatively, Ethereum’s daily transaction fees rest at a slightly inferior $8.5 million. However, when projected onto a seven-day scope, Ethereum retains its dominance by generating an average of $9 million in transaction fees, outpacing Bitcoin’s $5.5 million average, according to Cryptofees.\n\nName 1 Day Fees 7 Day Avg. Fees Bitcoin $11,630,637.52 $5,555,761.45 Ethereum $8,445,996.89 $9,090,537.34\n\nSource: Cryptofees\n\nIt is pivotal to understand that while these markers denote a slight paradigm shift in daily metrics, Ethereum still maintains an upper hand in the weekly comparison. This emerging trend warrants further observation to decipher potential long-term implications on the digital currency dynamics."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8yMDY0NjcvZXRoZXJldW0tc29sYW5hLXNlbGwtb2ZmLWRvZ2UtdXAtNC1wZXJjZW500gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzIwNjQ2Ny9ldGhlcmV1bS1zb2xhbmEtc2VsbC1vZmYtZG9nZS11cC00LXBlcmNlbnQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "DOGE Go Up: Ethereum and Solana Hit Hard By Sell-Off—But Dogecoin Makes Gains - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto market took a hit Friday morning Eastern Time, with all major digital assets except for Dogecoin (DOGE) down significantly. Ethereum (ETF), XRP, and Solana (SOL) have all seen significant losses in the past day.\n\nAt the time of writing, the original meme coin was trading for $0.08, a 4% increase over the past 24-hour period. And over the week, the asset, which was once Elon Musk's favorite cryptocurrency, has gained more than 10% in value, according to CoinGecko.\n\nIn the past day, $2.7 billion worth of DOGE has changed hands. The only times the meme coin's volume has been higher in 2023 were around the time that Musk changed the Twitter logo to a Shiba Inu in April and a Dogecoin developer teased at a new development in February.\n\nAD\n\nAD\n\nAs of 9.30am ET, it the best-performing top digital currency, CoinGecko data shows.\n\nElsewhere, though, major assets were hit by a sell-off. ETH lost its $2,000 per coin level it hit last week. As of this writing, it has shed more than 4% of its value and was trading for $1,941.\n\nBitcoin, the biggest digital asset by market cap, was still trading above $36,000—only slightly—but had taken a 2% 24-hour hit.\n\nIn the past day, Bitcoin's dominance slid slightly to 51%, impacting overall market sentiment​​. Stablecoins dominated the trading volume in the past 24 hours, accounting for 89% of the total crypto market's trading volume​​.\n\nAnd SOL, which had been on a big run, was down over 9%, trading hands for $56.82 per coin.\n\nAD\n\nAD\n\nXRP was also a big loser—having lost over 5% in the past day, the asset was trading for $0.59 Friday morning.\n\nAnd Avalanche (AVAX), which yesterday surged on news that banking giant J.P. Morgan used the blockchain to tokenize portfolios, lost more than 10% of its value. It was trading for $20.97 by the time this story was published.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzE4L3VzLXNlYy1kZWxheXMtZGVjaXNpb25zLW9uLW11bHRpcGxlLWJpdGNvaW4tYnRjLWFuZC1ldGhlcmV1bS1ldGgtZXRmLWFwcGxpY2F0aW9ucy_SAXdodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xOC91cy1zZWMtZGVsYXlzLWRlY2lzaW9ucy1vbi1tdWx0aXBsZS1iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoLWV0Zi1hcHBsaWNhdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "US SEC Delays Decisions on Multiple Bitcoin (BTC) and Ethereum (ETH) ETF Applications - The Daily Hodl",
        "content": "The U.S. Securities and Exchange Commission (SEC) is delaying its decisions on several Bitcoin (BTC) and Ethereum (ETH) exchange-traded fund (ETF) applications until next year.\n\nIn new filings, the regulatory agency says that it will be delaying its decisions on applications filed by asset management firm Hashdex to create a mixed spot and futures Ethereum ETF and convert a Bitcoin futures ETF into a spot market one.\n\nThe SEC says it will also be pushing back its decision on crypto firm Grayscale’s bid for an ETH futures ETF.\n\nIn the statements, the SEC says that it needs more time to consider the proposed changes and is extending the original deadline of November 17th to January 1st, 2024.\n\n“The Commission is extending [the] 45-day time period. The Commission finds it appropriate to designate a longer period within which to take action on the proposed rule change so that it has sufficient time to consider the proposed rule change and the issues raised therein.\n\nAccordingly, the Commission, pursuant to Section 19(b)(2) of the Act, designates January 1, 2024, as the date by which the Commission shall either approve or disapprove or institute proceedings to determine whether to disapprove, the proposed rule change.”\n\nAccording to the documents, all three applications were originally filed on October 3rd, 2023.\n\nEarlier this week, BlackRock – the largest investment firm in the world with over $8 trillion in assets under its management – filed an application with the SEC to create a spot market Ethereum ETF.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYm9sZC5jb20vZ29vZ2xlLWJhcmQtcHJlZGljdHMtZXRoZXJldW0tcHJpY2UtZm9yLXN0YXJ0LW9mLTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Google Bard predicts Ethereum price for start of 2024 - Finbold - Finance in Bold",
        "content": "Amidst continuous advances in the sphere of artificial intelligence (AI), including Google Bard, the technology has already demonstrated its potential in multiple industries, including offering insights into the cryptocurrency market trends and deducing trends in the price of assets like Ethereum (ETH).\n\nWith this in mind, Finbold has asked Alphabet’s (NYSE: GOOGL) AI platform for an analysis of the possible price of Ethereum at the start of 2024, taking into account its current price trends and historical movements, possible spot exchange-traded fund (ETF) approval, and other factors.\n\nBard’s estimates for Ethereum\n\nAccording to Bard, a “potential price range for Ethereum at the start of 2024 could be between $2,500 and $4,500,” which suggests “the possibility of continued upward momentum driven by technical indicators, ETF approval, community support, institutional interest, and network developments.”\n\nHowever, the AI chatbot also recommends caution as “the cryptocurrency market is inherently volatile and subject to external factors that could impact the price,” adding that the “actual price of Ethereum at the start of 2024 could be significantly higher or lower than the proposed range.”\n\nFactors at play\n\nAmong the main factors involved in the future price of Ethereum, the AI tool singled out its previous price movements that “have been characterized by periods of both significant growth and sharp declines,” including from the all-time high (ATH) of $4,891.70 in 2021.\n\nFurthermore, Bard noted that approving a spot ETH ETF “would make it easier for institutional investors to gain exposure to Ethereum, potentially boosting demand and driving up the price,” as well as highlighted “a strong and active community of developers and users” paving the way to “long-term sustainability.”\n\nOn top of that, it pointed out that:\n\n“Several technical indicators suggest that Ethereum may be in the early stages of a bullish trend. For instance, the Moving Average Convergence Divergence (MACD) indicator is showing a bullish crossover, indicating that the upward momentum may continue.”\n\nFinally, the chatbot referred to a survey of cryptocurrency experts from October 2023, which “revealed an average price prediction of $3,026 for Ethereum at the end of 2023 and $7,184 at the end of 2024,” suggesting a general consensus among experts about Ethereum’s long-term potential.\n\nEthereum price analysis\n\nAs things stand, the second-largest crypto asset by market cap is currently changing hands at the price of $1,957.28, down 4.07% on the day and dropping 6.89% across the week while still holding onto the gain of 24.13% in the last month, as per data on November 17.\n\nEthereum price chart. Source: Finbold\n\nIndeed, Bard’s current predictions regarding Ethereum’s price at the year’s turn are rather optimistic, seeing it at 27.73% or even 129.91% higher price than at the time of publication, pushed by positive sentiment around it and in the crypto sphere in general.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vdS50b2RheS9zcG90LWV0aGVyZXVtLWV0Zi1wcm9wb3NhbC1kZWxheWVkLWJ5LXNlY9IBPWh0dHBzOi8vdS50b2RheS9zcG90LWV0aGVyZXVtLWV0Zi1wcm9wb3NhbC1kZWxheWVkLWJ5LXNlYz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Spot Ethereum ETF Proposal Delayed by SEC - U.Today",
        "content": "The U.S. Securities and Exchange Commission (SEC) has postponed its decision on the Hashdex Nasdaq Ethereum ETF application until 2024.\n\nAdvertisement\n\nThe delay follows closely on the heels of another recent postponement. As reported by U.Today, the SEC has also deferred Hashdex’s Bitcoin ETF conversion attempt.\n\nThe race for a spot Ethereum ETF\n\nSurprisingly, there is a notable race to launch a spot Ethereum ETF. BlackRock, the top manager, has recently entered the fray by officially filing for a spot Ethereum ETF with the formidable regulator.\n\nThe product, which is aimed at mirroring the performance of Ether's price, comes after BlackRock's June filing for a spot Bitcoin ETF.\n\nThis development indicates that investment behemoths of the likes of BlackRock are becoming increasingly comfortable with the second-largest cryptocurrency despite its murky regulatory status.\n\nIn various instances, SEC Chair Gensler has refrained from categorically stating whether Ether is considered a security under U.S. law.\n\nFor instance, during an April congressional hearing, Gensler did not give a direct answer when questioned about Ether's status as a security. In earlier statements, Gensler had suggested that Ether might be considered a security, especially following Ethereum's transition to a proof-of-stake consensus mechanism\n\nExpectations for SEC approval in 2024\n\nJames Seyffart, an analyst with Bloomberg Intelligence, believes Ethereum has effectively attained the status of a commodity, although the SEC has not formally acknowledged it as such.\n\nDespite the lack of explicit recognition from Gensler and his agency, Seyffart argues that the Bitcoin rival deserves the same spotlight as the crypto king.\n\nHe, along with other industry experts, anticipates that the SEC will likely treat Ethereum more like Bitcoin and approve spot Ethereum ETFs in 2024. This upbeat prediction is based on the regulator's past actions and Ethereum's growing recognition in the financial world."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1wb2ludHMtYS1yYWxseS10by0yMjAwL9IBVWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1wb2ludHMtYS1yYWxseS10by0yMjAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction As Health Retracement May Fuel a Rally to $2200 - CoinGape",
        "content": "Ethereum Price Prediction: The altcoins market is experiencing a phase of correction amid resistance faced by Bitcoin at the $38,000 level. Ethereum, the second-largest cryptocurrency by market capitalization, has not been exempt from this trend as It recently underwent a sharp reversal from the $2,136 mark. The coin price witnessed a 10.7% drop in its market value over the past week, bringing it to the current trading price of approximately $1,945. Will this correction be extended further?\n\nAlso Read: Bitcoin (BTC) Topples Ethereum in Transaction Fees After 3 Years\n\nadvertisement\n\nWill ETH Price Revist $1700?\n\nThe $1900 and $1830 are strong support amid the current correction.\n\nThe Ethereum price is prevented from a major downfall until the two trendlines are intact.\n\nThe intraday trading volume in Ether is $12.6 Billion, indicating a 16% gain.\n\nSource- Tradingview\n\nThe Ethereum price showed notable growth in October and early November, rising from $1,522 to a high of $2,137, marking a 41% increase. This bullish recovery was significant as it surged above the crucial daily Exponential Moving Averages (EMA) of 20, 50, 100, and 200, reflecting an early sign of trend reversal.\n\nHowever, after forming a local top at around $2,137, the coin entered a minor correction phase. Currently trading at $1,341, the buyers are trying to sustain above the 32.8% Fibonacci retracement level.\n\nUntil the price is still above the 50% retracement level($1830), the overall bullish trend may still be intact. If the ETH price sustains above the $1,830 mark, it could potentially rebound strongly, and continue its bullish trajectory to $2,240, which corresponds to the resistance level of a rising wedge pattern.\n\nA breakout above this barrier could signify a robust bullish trend ahead.\n\nIs ETH Poised for Further Correction?\n\nThe Ethereum price movement is currently confined within the converging trendlines of a wedge pattern, suggesting a potential for a slow yet steady recovery. However, as the price approaches the upper trendline of the wedge, there may be an increase in selling pressure, particularly around the $2200 mark. Historical trends indicate that retests of this upper trendline often lead to significant corrections, potentially driving the price down to the lower trendline of the wedge, which could mean a correction towards the $1,700 level.\n\nExponential Moving Average (EMA): The 20-day EMA is providing dynamic support to the declining Ethereum price.\n\nMoving Average Convergence Divergence (MACD): A bearish crossover between the MACD line and its signal line suggests a correction sentiment in the market."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmZvcmV4Y3J1bmNoLmNvbS9jcnlwdG9jdXJyZW5jeS9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction - Forecast for 2021, 2022, 2025 & 2030 - Forex Crunch",
        "content": "Ethereum Price Prediction\n\nThe price of Ethereum has seen huge boosts over the last couple of years. Just one year ago, one Ethereum was worth less than $400. Today, Ethereum has a market value of over $2,500, even crossing the $4,000 mark only a few months ago. And the trend is that the Ethereum stock price will continue to rise on average.\n\nThis article focuses on our Ethereum price prediction. We arrived at reliable conclusions through a study of the history of Ethereum’s price over the years, a fundamental analysis of its price trajectory, and a collation of expert opinions.\n\nOur Ethereum forecast looks into the future to help investors make smart investment decisions. By looking at the Ethereum price chart, we are able to determine the price of Ethereum within the coming decade.\n\nEthereum Price Prediction 2021\n\nBitcoin may be the godfather of cryptocurrencies, but Ethereum is that young prodigy who has high potentials of outdoing and outclassing its master. So much is the faith experts have in Ethereum that Billy Bambrough, a senior contributor on crypto and blockchain at Forbes, believes that “Bitcoin Could Be Left In The Dust By Ethereum In 2021″\u009d.\n\nThe price of Ethereum currently sits at just over $2,400 per Ether. This is a little over half of Ethereum’s highest ever price. The recent bear market saw prices crash all across the cryptocurrency market, and Ethereum was no exception. However, Ethereum has been recovering steadily over the last two weeks and prices are looking up once again.\n\nWith these points in mind, found below are our Ethereum forecasts for a variety of upcoming timeframes:\n\nOne Month – The past few days have seen Ethereum consolidate after a bullish push. Once this area has been surpassed, expect to see Ethereum head towards the $4000 level over the next month.\n\n– The past few days have seen Ethereum consolidate after a bullish push. Once this area has been surpassed, expect to see Ethereum head towards the $4000 level over the next month. Three Months – It’s likely that Ethereum will head towards May’s highs over the next three months, which could prove to be a solid resistance level. We predict that these levels will be broken, seeing Ethereum head towards the $4800 level.\n\n– It’s likely that Ethereum will head towards May’s highs over the next three months, which could prove to be a solid resistance level. We predict that these levels will be broken, seeing Ethereum head towards the $4800 level. Start of 2022 – As this will be new territory for Ethereum, the sky is really the limit for this crypto. We believe that a valuation of $5000 per coin is likely by the beginning of 2022, providing a solid base for further momentum.\n\nEthereum Price History – the Story of 2021 So Far\n\nEthereum started the year with a modest price tag of $770 on January 1, 2021. By the end of January 2021, the price of Ethereum had nearly doubled and was at $1,400. This was great for investors, and despite occasional dips, the price of Ethereum continued to rise on aggregate.\n\nSometime around the middle of February, Ethereum reached an all-time high value of nearly $2,000. One week later, it dropped to around $1,500. On April 1, Ethereum finally broke the $2,000 mark, starting the day on a price tag of $2,100.\n\nThe price of Ethereum continued to experience a steady rise for most of April. By the middle of April, Ethereum had reached another milestone. On April 1, two weeks after breaking past $2,000 for the first time, Ethereum broke past $2,500. This set a new ATH.\n\nEthereum first broke past the $3,000 threshold on May 2, 2021. This was during the last bull run that saw prices soar all across the cryptocurrency market. Ethereum went as high as $4,000 per coin during this same period and reached an all-time high of over $4,300 on May 12, 2021. The onset of the bear market brought the price of Ethereum crashing down.\n\nHowever, the market has been recovering lately, as has the price of Ethereum. This keeps us optimistic that our $3,000 Ethereum forecast is most likely to become a reality. And this is most likely going to happen before the end of August.\n\nEthereum Price Forecast\n\nTaking a look at the growth trajectory of Ethereum so far in 2021, it is not hard to see why we envision sustained increments in the price of Ethereum. The current Ethereum price is only a shadow of its price peaks, meaning Ethereum can become much more valuable with time.\n\nMany experts share this sentiment. Billy Bambrough of Forbes believes that Ethereum will someday become more valuable than Bitcoin. This might seem far-fetched to the casual observer, but many experts believe this to be a possibility.\n\nAccording to a Finder panel, Ethereum will end the year as a better investment than Bitcoin. Returns on investment in Ethereum are expected to exceed those on Bitcoin by 35% in 2021. This panel predicts the price of Ethereum to hover around $17,000 by the end of 2021.\n\nWe are inclined to agree with the panel’s optimism, although our research and analysis predicts that Ethereum will be valued at around $5000 by the end of 2021. It’s unlikely that Ethereum will not experience some struggles over the upcoming months, as rumours surrounding crypto regulation and taxation begin to heat up.\n\nHowever, the signs do seem to point towards some great gains for Ethereum over the next year. The uptake of Ethereum’s technology over 2022 could see the coin push past the $5000 level and head higher. Furthermore, as more companies adopt smart contracts and utilise Ethereum’s platform, the valuation will increase more – and our analysis leads us to believe that Ethereum could be valued at over $8000 by the end of 2022.\n\nEthereum Price Prediction Long Term Outlook\n\nWe expect Ethereum to break through the $4,000 threshold again within the next three months. A $5,000 Ether price tag is also very realistic within this period. The end of the year often sees a rise in general cryptocurrency prices and this year will be no different.\n\nEthereum remains Bitcoin’s closest competitor in the cryptocurrency market. The Ethereum blockchain utility token offers value that even Bitcoin doesn’t. For example, the Ethereum blockchain is an open-source platform, as opposed to the bitcoin blockchain. The implication of this is its benefit for developers.\n\nDevelopers can deploy immutable and permanent decentralised applications on the Ethereum blockchain. Users can also interact with these applications. This means applications like games and NFT marketplaces can be programmed on the Ethereum blockchain. Combine these with the fact that Ethereum also has smart contract functionality and you can see why a $5,000 price for Ethereum is well within reach in the next three months.\n\nLet us visualize further in the future and discuss Ethereum price estimates for 2022. As is to be expected, every year sees its fair share of bull and bear runs. The coming year will not be an exception. While the price of Ethereum in 2022 will see inevitable ups and downs, there will be an aggregate increase in value. We predict unprecedented growth in the value of Ethereum in 2022. There are two reasons for this.\n\nGas Fees and Blockchain Transition\n\nFirst is the increasing popularity of cryptocurrencies in general. The last year has seen a surge in both the number of cryptocurrencies on the market and the value of most of these cryptocurrencies. Some cryptocurrencies have experienced double, triple, and even quadruple-digit growth in market value.\n\nThe second and more important reason for the unprecedented growth we foresee in Ethereum’s market value is the coming of Ethereum 2.0. Because of the high gas fees that currently plague the Ethereum network, Ethereum’s founders are working hard to release a new version of Ethereum. This version is set to be released in 2022.\n\nEthereum 2.0 will mark the transition of the Ethereum blockchain from a Proof of Work mechanism to a Proof of Stake mechanism. This means significantly lesser gas fees, more token utility, and invariably, a surge in Ethereum’s market value.\n\nCombining the above points, our Ethereum price prediction 2025 puts the crypto’s value at $15,000. The next four years should see Ethereum’s platform rise in popularity, as the use case for this cryptocurrency is much stronger than others. If more entities adopt Ethereum, there’s every reason to believe this valuation could be met.\n\nLooking further into the future, our Ethereum price prediction 2030 has Ethereum’s value reaching the $50,000 mark. Numerous analysts predict even higher values than this, although we are erring on the side of caution as nobody knows the outcome of the rumoured taxation laws. What we can be sure of is that Ethereum’s price looks set to showcase some serious bullish momentum over the next five to ten years – and beyond!\n\nEthereum Price Chart\n\nEthereum has experienced price swings like every other cryptocurrency in the market. However, unlike many other cryptocurrencies, Ethereum has been able to guarantee investors and speculators an aggregate growth in value, and a proof of it could be if we put a context of an Ethereum 5-year forecast as well.\n\nThe chart below reflects Ethereum price live. This price chart details the movement of Ethereum’s market value over the last year.\n\nEthereum price chart | Image source: CoinCodex\n\nConclusion\n\nAs you may already know, Ethereum has emerged as one of the world’s most profitable cryptocurrencies. It is also arguably the most commercially successful cryptocurrency of the year so far.\n\nWith its price currently sitting at around $2500, Ethereum has managed to gain almost a 300% increase in its market value in less than 8 months. This is laudable, considering that this year brought one of crypto’s worst bear markets.\n\nExperts forecast has shown a progressive increase in the price of Ethereum for the rest of the year, following its recovering pace after a bear run which saw a huge price crash across every cryptocurrency market. Ethereum’s growth will be further bolstered in 2022 when Ethereum 2.0 is released. There is no denying that Ethereum can only get bigger from this point.\n\nFAQs"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2V0aGVyZXVtLW5ld3MvZXRoZXJldW0taW5zaWRlci1ldGgtZm91bmRlcnMtZnJhdWQv0gFOaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vZXRoZXJldW0tbmV3cy9ldGhlcmV1bS1pbnNpZGVyLWV0aC1mb3VuZGVycy1mcmF1ZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Whistleblower Reveals When Proof Of ETH Founders’ Fraud Will Be Released - NewsBTC",
        "content": "Amid the ongoing Ethereum scandal, former Ethereum advisor and attorney Steven Nerayoff has recently revealed how he plans on sharing proof of Ethereum founders’ fraud activities in the early days of the cryptocurrency asset.\n\nEthereum Founders’ Fraudulent Acts To Be In Lawsuit\n\nFollowing an X (formerly Twitter) post by a user Heidi from Crytotips, the crypto enthusiast was seen trying to underscore the lack of authenticity from Nerayoff’s claims. According to her, his accusations were a no-brainer due to the disclosure lacking proof of his accusations.\n\nHowever, Nerayoff in response to the video, asserted that he never claimed his accusations were going to be in the disclosure highlighting the crypto enthusiast’s lack of proper research. He further added that he is going to reveal the fraudulent acts of the founders in his lawsuit.\n\nNerayoff had always noted that his recording was not actually linked to his accusations but rather his involvement with Vitalik Buterin. “The recording isn’t directly related to the fraud but will illuminate a lot of what was happening & show my involvement. The fraud will be in the lawsuit,” Nerayoff stated.\n\nFurthermore, the crypto expert also pointed out Nerayoff’s accusations towards federal agencies. According to her, the former advisor was a little paranoid with his accusations.\n\nDuring an X space, Nerayoff accused some high federal agencies of fabricating evidence against him in order to take him out. These include the SEC, FBI, and the DOJ.\n\nTotal crypto market cap currently at $1.3 trillion. Chart: TradingView.com\n\nNonetheless, in response to that, Nerayoff has asserted that this was actually proven and publicly filed. “The paranoia about the agencies? Well, that’s actually proven & publicly filed,” Nerayoff stated.\n\nCrypto Asset Is Not Decentralized From The Onset\n\nIt appears Nerayoff’s claims about ETH not being decentralized from the early days are authentic.\n\nThe post also saw the crypto enthusiast pointing out Nerayoff’s claims of ETH not being decentralized from the beginning. According to her, cryptocurrencies are not expected to be decentralized from the start and only the core team members know about a crypto asset from the start.\n\nIf the expert is right then this basically means Will Hinman’s speech in 2017, about the asset being decentralized from the start was inaccurate.\n\nDuring the early days of the asset, Hinman asserted the decentralized nature of ETH, when it was considered as a security by the SEC. According to him, ETH was too decentralized to be considered a security.\n\nSo far, both founders still have not responded to Nerayoff’s accusations. Nerayoff believes that their silence is due to the evidence he has against them.\n\n“Vitalik & Lubin are vicious if they have leverage. Lubin said to me in July 2018 about a network “It’s a centralized piece of sh*t” right after the Hinman speech! They stay silent because I’ll drop more receipts,” Nerayoff stated.\n\nFeatured image from Pixabay\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS13aGFsZXMtZHVtcC1ob2xkaW5ncy1zZWMtZGVsYXlzLXNwb3QtZXRmLXJ1bGluZ3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Whales Dump Holdings as SEC Delays Spot ETF Rulings - DailyCoin",
        "content": "Whales are dumping large ETH holdings.\n\nThe wave of mass selling follows the SEC’s recent decision to delay ETF applications.\n\nEthereum faces significant sell pressure.\n\nLast week, a wave of excitement swept through the Ethereum community as BlackRock threw its hat in the ring to launch a spot Ethereum ETF product. But this excitement appears to be waning as the U.S. SEC has delayed its decision on earlier applications.\n\nOn-chain data suggests whales are dumping their holdings in response to the blow from the SEC.\n\nEthereum Whales Throw in the Towel\n\nOn November 15, the SEC announced it would defer its decision on Ethereum ETF applications from Grayscale and Hashdex until January 1, 2024. The agency asserted it needed more time to arrive at its decision.\n\nThe SEC’s history of delaying spot ETF products has meant that the announcement was met with little surprise, but some whales are getting fed up with the wait.\n\nLookonchain, a crypto smart money tracker, has reported whale selling and exchange deposits of 42.9k ETH ($82.9 million) in the past two days. The most recent instance on Friday, November 17, saw a whale send 19.3k ETH (worth approximately $37.16 million) to Binance, contributing to the mounting selling pressure.\n\nAmid the whale selling, ETH is trading at $1,942 per CoinMarketCap data at the time of writing, representing a 1.19% decline over the past 24 hours.\n\nWhat a Spot ETF Approval Means for Crypto Users\n\nSpot ETFs are considered bullish for the nascent crypto market by many in the industry. The reason for this conviction is the potential for trillions of dollars from institutional and traditional investors to flow into the crypto market.\n\nBlackRock’s involvement in June 2023 and Grayscale’s legal victory in August 2023 raised hopes for the near approval of a U.S. spot crypto ETF.\n\nOn the Flipside\n\nAside from whale selling, Ethereum has recently come under fire from a former advisor.\n\nETH is still up 23.8% in the past 30 days.\n\nWhy This Matters\n\nRecent whale selling suggests a shift in market sentiment and puts significant selling pressure on Ethereum.\n\nRead this to learn more about the BlackRock ETF excitement:\n\nBlackRock Eyes Spot Ethereum ETF – ETH Price Soars Past $2K\n\n\n\nLearn about POLS, a token that has taken the Polygon network by storm:\n\nWhat Is POLS and Why Is It Sending Polygon Fees to the Moon?"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xNy90cmFkZXItcHJlZGljdHMtb25lLWV0aGVyZXVtLWNvbXBldGl0b3ItdG8tcGx1bmdlLWJ5LWRvdWJsZS1kaWdpdHMtdXBkYXRlcy1vdXRsb29rLW9uLWRvZ2Vjb2luLWFuZC1wb2x5Z29uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Trader Predicts One Ethereum Competitor To Plunge by Double Digits, Updates Outlook on Dogecoin and Polygon - The Daily Hodl",
        "content": "A popular crypto analyst is predicting that one Ethereum (ETH) competitor is on the verge of a massive collapse.\n\nPseudonymous trader Altcoin Sherpa tells his 197,900 followers on the social media platform X that Avalanche (AVAX) could decline by more than 22% from its current value.\n\n“AVAX: really key level for this one in my opinion. I don’t see AVAX holding it unless Bitcoin (BTC) looks better. Not saying to short, but I think this current level seems important. Expecting a bit lower personally, like $16.”\n\nThe trader’s chart suggests AVAX will pull back after crossing a key resistance level at $21.17 based on a historical pattern.\n\nAVAX is trading for $20.60 at time of writing, down 9.4% in the last 24 hours.\n\nNext, the trader weighs in on Dogecoin (DOGE), and he says the memecoin is on the cusp of printing a bullish price pattern.\n\n“DOGE: interesting moves the last few days. I think this is a key level. We’re about to see if it can make a higher high [price]. If we see that plus a higher low formed, I think we see a bullish market structure.\n\nThat said, I still don’t think DOGE is as good as it was in previous cycles due to MC (market capitalization). Would probably look for other memes down the risk curve.”\n\nDogecoin is trading for $0.0819 at time of writing, up 6% in the last 24 hours.\n\nLastly, the trader says that the blockchain scaling solution Polygon (MATIC) will likely retrace to a key Fibonacci level and then bounce.\n\n“MATIC: decent entry coming up here at $0.75 in my opinion.”\n\nPolygon is trading for $0.80 at time of writing, down 9.7% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Salamahin/Atelier Sommerland"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8xNy9maWRlbGl0eS13YW50cy10by1jcmVhdGUtYW4tZXRoZXItZXRmLWpvaW5pbmctYmxhY2tyb2NrLWluLWRvdWJsaW5nLWRvd24tb24tY3J5cHRvL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8xNy9maWRlbGl0eS13YW50cy10by1jcmVhdGUtYW4tZXRoZXItZXRmLWpvaW5pbmctYmxhY2tyb2NrLWluLWRvdWJsaW5nLWRvd24tb24tY3J5cHRvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Fidelity Wants to Create an Ether ETF, Joining BlackRock in Doubling Down on Crypto - CoinDesk",
        "content": "Fidelity Wants to Create an Ether ETF, Joining BlackRock in Doubling Down on Crypto\n\nFidelity, BlackRock and other financial firms want to list BTC and ETH ETFs, which could make it easier for investors to invest in crypto.\n\nBy Nick Baker Nov 17, 2023 at 10:46 p.m. UTC"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tYnRjLXRvcHBsZXMtZXRoZXJldW0taW4tdHJhbnNhY3Rpb24tZmVlcy1hZnRlci0zLXllYXJzL9IBWGh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tYnRjLXRvcHBsZXMtZXRoZXJldW0taW4tdHJhbnNhY3Rpb24tZmVlcy1hZnRlci0zLXllYXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Topples Ethereum in Transaction Fees After 3 Years - CoinGape",
        "content": "In an unexpected turn of events, Bitcoin (BTC) has recaptured the lead in daily cryptocurrency transaction fees, topping Ethereum (ETH) for the first time in three years.\n\nBitcoin (BTC) Finally Dominates Ethereum in Fees\n\nRecent data indicates that the Bitcoin (BTC) daily transaction fees have surged to $11.63 million, surpassing Ethereum’s $8.44 million over the same period. This reversal of fortunes marks a departure from the trend observed three years ago when Ethereum surpassed Bitcoin in transaction fees.\n\nadvertisement\n\nEthereum’s ability to support a diverse range of Decentralized Applications (DApps) made it the preferred choice for users engaging in Decentralized Finance (DeFi), Non-Fungible Tokens (NFTs) and new monetary evolution that encompasses smart contracts. This versatility propelled Ethereum to the forefront, positioning it as a multifaceted platform compared to Bitcoin, which primarily served as a digital currency.\n\nRecent developments, however, have seen Bitcoin experience a remarkable surge in average transaction fees, reclaiming its status as the transaction fee leader. Starting from the beginning of November, Bitcoin’s fees have escalated significantly, reaching $18.69 per transaction on Nov. 16. This surge represents a staggering nearly 1,000% increase from the fee recorded on Nov. 1.\n\nIn addition to transaction fees, Bitcoin has also made strides in the realm of NFTs. Recent reports also indicates that Bitcoin’s Ordinals inscriptions are outperforming Ethereum in NFT sales, signaling a broader diversification of use cases for the world’s leading cryptocurrency.\n\nImplications for Bitcoin Miners\n\nAs Bitcoin’s transaction fees reclaim the spotlight, the implications for miners are significant. The surge in fees provides a much-needed boost to miners’ revenue streams, especially in the face of reduced block rewards. Higher transaction fees are poised to play a crucial role in offsetting the impact of the upcoming halving and ensuring the continued viability of the Bitcoin mining ecosystem.\n\nThe recent surge in Bitcoin transaction fees, although posing some inconvenience for users, is seen as a positive development by experts who recognize its role in strengthening the network’s security. As the crypto market continues to evolve, the competition between Bitcoin and Ethereum remains dynamic, with each blockchain platform vying for dominance in the rapidly expanding world of DeFi and NFTs."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8xOC90b3AtdHJhZGVyLXNheXMtZXRoZXJldW0tYmFzZWQtYWx0Y29pbi1wcmltZWQtdG8tc3VyZ2UtYnktb3Zlci0yMzAtdXBkYXRlcy1vdXRsb29rLW9uLXNvbGFuYS1hbmQtZG9nZWNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Top Trader Says Ethereum-Based Altcoin Primed To Surge by Over 230%, Updates Outlook on Solana and Dogecoin - The Daily Hodl",
        "content": "A widely followed cryptocurrency trader and analyst is expressing bullish sentiment on a top-50 altcoin that’s currently under the radar.\n\nThe trader pseudonymously known as Bluntz tells his 228,900 followers on the X social media platform that the native asset of the liquid staking solution Lido DAO (LDO) is “going to turbo send” and revisit the record high of $7.30 – an increase of approximately 230% from the current level.\n\nAccording to Bluntz, LDO has managed to flip multiple resistance levels to support zones, an indication of bullish momentum.\n\n“There’s only so many support-resistance flips we can do before it just marks up and leaves those prior highs in the dust.”\n\nAt time of writing, LDO is trading at $2.16.\n\nTurning to the smart contract protocol Solana (SOL), Bluntz says that the altcoin may be gearing up to print a new 2023 high after witnessing a deep corrective move yesterday.\n\n“Liquidations in [the last] 48 hrs have been larger than any of the dips [during] the entire run-up.\n\nAllocated into to spot just in case, no leverage for now.”\n\nLooking at the trader’s chart, he seems to predict that Solana may rally all the way up to about $76. At time of writing, SOL is worth $57.33.\n\nOn the largest memecoin by market cap, the pseudonymous analyst says that Dogecoin (DOGE) has broken out of a multi-week consolidation range and looks poised for a big run-up.\n\n“I have seen these range breaks lead to big moves on all sorts of coins all week.”\n\nBased on the trader’s chart, he appears to predict that DOGE will rally close to $0.13. At time of writing, DOGE is worth $0.084.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS9iaXRjb2luLXN1cnBhc3Nlcy1ldGhlcmV1bS1pbi1mZWVzLWZpcnN0LXRpbWUtaW4teWVhcnPSAUpodHRwczovL3UudG9kYXkvYml0Y29pbi1zdXJwYXNzZXMtZXRoZXJldW0taW4tZmVlcy1maXJzdC10aW1lLWluLXllYXJzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Surpasses Ethereum in Fees First Time in Years - U.Today",
        "content": "Advertisement\n\nBitcoin has reclaimed its position as the leader in daily cryptocurrency transaction fees, surpassing Ethereum for the first time in three years. According to the most recent data, Bitcoin's daily fees reached $11.63 million. For comparison, Ethereum recorded only $8.44 million over the same period of time.\n\nTaking Ethereum's crown\n\nThree years ago, Ethereum surpassed Bitcoin in terms of transaction fees, a development attributed to its versatile blockchain platform, which enabled a diverse range of decentralized applications (dApps).\n\nThis versatility attracted significant user activity, particularly in the burgeoning field of decentralized finance (DeFi) and non-fungible tokens (NFTs), leading to higher transaction fees on the Ethereum network.\n\nThis period of dominance positioned Ethereum as a multifaceted platform compared to Bitcoin, which primarily functions as a digital currency.\n\nGame-changer?\n\nRecently, Bitcoin has experienced a sharp increase in average transaction fees. Starting from the beginning of November, fees have escalated significantly, with the fee on Nov. 16 reaching $18.69 per transaction. This surge represents a nearly 1,000% increase from the fee recorded on Nov. 1.\n\nSome experts view this rise in transaction fees as a positive development. They argue that higher fees contribute to the sustainability of the Bitcoin network, especially in the context of diminishing block rewards for miners.\n\nThe recent increase in Bitcoin's transaction fees comes at a critical time for Bitcoin miners, who have faced one of their least profitable years.\n\nThe upcoming Bitcoin halving, scheduled for next spring, will further reduce the block subsidy from 6.25 BTC to 3.125 BTC. In this scenario, higher transaction fees could become a more significant portion of miners' revenue, potentially accounting for 20%-30% of the block reward.\n\nThis shift toward fee revenue is seen as crucial for the long-term sustainability of Bitcoin's mining and transaction verification process.\n\nIt should be noted that Bitcoin's Ordinals inscriptions are now outperforming Ethereum in NFT sales."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtcy1laWdlbmxheWVyLWdlYXJzLXVwLWZvci1tYWlubmV0LXBoYXNlLXR3by1pbi0yMDI0L9IBVWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtcy1laWdlbmxheWVyLWdlYXJzLXVwLWZvci1tYWlubmV0LXBoYXNlLXR3by1pbi0yMDI0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum's EigenLayer Gears Up for Mainnet Phase Two in 2024 - CoinGape",
        "content": "EigenLayer, a player in the Ethereum re-staking arena, is gearing up to launch its mainnet’s second phase in the first half of 2024. This pivotal update stands to reshape the landscape by allowing users to delegate their staked Ethereum (ETH) to operators of EigenDA.\n\nConsequently, this move will facilitate rollups, a form of secondary scaling solutions, to efficiently integrate with it. EigenLayer’s initiative is to leverage staked ether and other liquid staking tokens, bolstering blockchain and data scaling services, including EigenDA.\n\nadvertisement\n\nEigenLayer’s Advancements\n\nFollowing the limited utility phase that marked EigenLayer’s initial foray into the Ethereum mainnet, the upcoming phase promises significant enhancements. The test network activation of this phase has already started, laying the groundwork for operator registration and the commencement of EigenDA verification.\n\nEigenDA, as the first service actively validated (AVS) on EigenLayer, is expected to reduce transaction fees for rollups. This development could greatly benefit decentralized applications, particularly in gaming and social media, where high transaction costs have been a hurdle.\n\nThe Rise of Liquid Restaked Tokens (LRT)\n\nThe landscape is further enriched by the emergence of Liquid Restaked Tokens (LRT), designed to simplify the staking process. By depositing in an LRT protocol, users can bypass the complexities of direct staking via Eigenlayer, albeit at a fee. However, this also necessitates governance to select operators and manage risks, thereby creating new governance tokens and potential airdrops.\n\nThe growth in LRT protocols, such as Ether Fi, Stader Labs, Genesis LRT, and others, heralds a new era in Ethereum staking. With LRTs, users may anticipate earning from Ethereum staking yield, Eigenlayer restaking rewards, and LRT protocol token emissions, cumulatively amounting to a potential 25% APY on ETH.\n\nRead Also: Ethe­reum’s New Staking Solution Aims to Improve Security and Scalability"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbmdhcGUuY29tL2JyZWFraW5nLWZpZGVsaXR5LWludmVzdG1lbnRzLWZpbGVzLWZvci1ldGhlcmV1bS1zcG90LWV0Zi_SAVNodHRwczovL2NvaW5nYXBlLmNvbS9icmVha2luZy1maWRlbGl0eS1pbnZlc3RtZW50cy1maWxlcy1mb3ItZXRoZXJldW0tc3BvdC1ldGYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Spot ETF: Fidelity Investments Files for Ethereum Spot ETF - CoinGape",
        "content": "American investment management firm Fidelity Investments has applied to list its Ethereum spot Exchange Traded Fund (ETF) product with the Securities and Exchange Commission (SEC). With this filing, Fidelity Investments now ranks as the 7th asset manager making a move for the product in the United States.\n\nOther asset managers that have filed to list Ethereum spot ETFs include VanEck, Ark Invest and 21Shares, Hashdex and Nasdaq, Grayscale, Invesco and Galaxy Digital, and BlackRock respectively.\n\nadvertisement\n\nThe Fidelity Ethereum ETF\n\nPer Form 19b-4 lodged with the SEC, the Fidelity Ethereum ETF is dubbed the “Fidelity Ethereum Fund” and is billed to track the performance of Ethereum. The firm said the ETF, if approved, will trade in compliance with the BZX Rule.\n\nThe filing positions Fidelity Investments at the forefront of the crypto ETF revolution, noting that this move is designed to truly safeguard the interest of investors in the United States.\n\nFidelity Investments used the Ethereum ETF to expand the general argument proponents of related products have put forth hinting at the fact that the absence of a regulated avenue to embrace crypto predisposes investors in an undue way.\n\nFidelity Investments is confident in securing approval as it cited an excerpt from the ruling in the Grayscale versus SEC legal brawl. With the SEC denying Grayscale’s request to convert its renowned Bitcoin Trust into a full-fledged Bitcoin Exchange Traded Fund product, the court ruled that the SEC has no basis for the denial as futures tied to BTC had already been approved.\n\nThe verdict ordered a review of the SEC decision and recent reports confirmed that the SEC and Grayscale and in consultation about the product.\n\nFidelity Investments Boosting the ETF Approval Sentiment\n\nFidelity Investments is a big name when it comes to institutional embrace of crypto. The firm is among the top firms with hopes to gain approval for its spot Bitcoin ETF product filed back in June.\n\nAfter the filing, the ETF, dubbed the “Wise Origin Bitcoin Trust” has also been updated to address crucial concerns gleaned from feedback from the markets regulator. With Fidelity’s influence in the market, as it boasts about $4.5 trillion in Assets Under Management (AUM) and ample resources, many believe its application will be sanctioned by the SEC.\n\nBlackRock also holds this influence and the presence of both firms has contributed to projections that the approval odds for a spot Bitcoin ETF by January now sitting at 90%"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tc3BvdC1ldGYtYmxhY2tyb2NrL9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tc3BvdC1ldGYtYmxhY2tyb2NrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ETF Race: BlackRock Wants An Ether Spot ETF - NewsBTC",
        "content": "BlackRock has joined the Ethereum Spot ETF race as the asset management company has officially applied to the US SEC and is currently waiting for approval.\n\nBlackRock Files For An Ethereum Spot ETF\n\nFollowing its Spot Bitcoin ETF filing, BlackRock, an American investment company has taken the proactive step by filing an Ethereum Spot Exchange Traded Fund (ETF) with the United States Securities and Exchange Commission (SEC).\n\nThe asset management company submitted the application on November 15, however, BlackRock has stated it formed the Trust as early as November 9.\n\nAccording to BlackRock, the iShares Ethereum Trust would be used to facilitate the ownership of Ether through the issuance of shares, allowing investors to own a fractional undivided beneficial interest in the net assets of the Trust.\n\n“The Trust was formed as a Delaware statutory trust on November 9, 2023. The purpose of the Trust is to own ether transferred to the Trust in exchange for Shares issued by the Trust. Each Share represents a fractional undivided beneficial interest in the net assets of the Trust. The assets of the Trust consist primarily of ether held by the Ether Custodian on behalf of the Trust,” BlackRock said in its filing.\n\nPresently, the US SEC has not approved any Ethereum Spot ETF filing as well as Spot Bitcoin ETF applications. The regulatory body has delayed multiple applications to be reviewed from January 2024.\n\nThe crypto community has remained enthusiastic that the regulatory agency would eventually approve the pending ETF applications, as this could significantly push the growth and development of the crypto ecosystem as well as the cryptocurrencies involved.\n\nEthereum Price Surges\n\nThe price of Ethereum is on the rise following BlackRock’s Ethereum ETF filing. The cryptocurrency’s price climbed almost 2% moving to $2,080 at some point following the announcement of the filing.\n\nThe sharp reaction has caused a stir in the cryptocurrency community, as investors gear up for a potential bull run if the US SEC gives its official authorization of Ethereum Spot ETFs.\n\nThe price of Bitcoin has also been growing steadily as new companies apply for Spot Bitcoin ETFs. Currently, Bitcoin’s price is trading at $36,408, while ETH is down from its initial surge and trading at $1,952.\n\nThe crypto ecosystem is presently watching closely for more updates on the US SEC’s ETF filing approvals and the price changes that follow them.\n\nETH price falls to $1,945 | Source: ETHUSD on Tradingview.com\n\nFeatured image from Bitcoin News, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvY291bnRkb3duLXRvLWV0aGVyZXVtLWV4cG9zZS1pbnNpZGVyLXByb21pc2VzLXByb29mLW9mLXZpdGFsaWstYnV0ZXJpbnMtYWxsZWdlZC1mcmF1ZC1pbi00OC1ob3Vycy5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Insider Exposing Vitalik Buterin Fraud in 48 Hours - Cryptonews",
        "content": "Countdown to Ethereum Exposé: Insider Promises Proof of Vitalik Buterin’s Alleged Fraud in 48 Hours\n\n\n\n\n\nAn insider with intimate knowledge of Ethereum’s origins has promised to soon reveal alleged fraudulent activities by co-founder Vitalik Buterin. Steven Nerayoff, an early player in Ethereum’s history, announced on November 12 that he would disclose proof within the following 4-5 days concerning misconduct claims against Buterin and fellow co-founder Joe Lubin.\n\nNerayoff has been increasingly vocal in recent weeks regarding accusations that he says eclipse even the scandal involving crypto exchange FTX. Through posts on the social media platform X, Nerayoff revealed the imminent release of evidence supporting his long-running allegations of fraud by Ethereum’s founders.\n\nVitalik Buterin In the Crosshairs\n\n\n\n“Should be within 48 hours hopefully less. Logistics, setting up smart NFTs, etc.,” Nerayoff stated about the impending reveal.\n\nHis online communications have focused heavily on Buterin, implying his extensive involvement in the purported misconduct.\n\n“Is Vitalik the savior they bill him as to make Ethereum scale or is he the reason it never scaled? Decide for yourselves,” Nerayoff posted.\n\nThe recording is about saving the Ethereum Foundation not directly on the fraud but it’s illuminating in many areas…Ethereum Insider Ready For Battle: ETH Founders' Fraud Proof Coming In 4-5 Days | https://t.co/7fm1OlyQcm https://t.co/XtSz8T8gtm — Steven Nerayoff (@StevenNerayoff) November 12, 2023\n\nHe went on to directly question Buterin’s innovations related to Ethereum, bluntly stating the co-founder did not actually invent anything. Nerayoff even accused Buterin and Lubin of intentionally promoting fraudulent initial coin offerings on Ethereum’s network, severely hindering the entire cryptocurrency industry.\n\nFraud Allegations Loom\n\n\n\n“Their focus was merely to issue hundreds or thousands of fraudulent ICOs fleecing people,” Nerayoff declared.\n\nHe additionally asserted that revenue from facilitating ICOs was the primary business model early on for Lubin’s company ConsenSys.\n\nThe insider also disputed the viability of Buterin’s original Ethereum white paper, instead crediting Gavin Wood’s subsequent technical specifications for enabling Ethereum’s initial growth.\n\n“His [Buterin’s] white paper was unworkable. Gavin fixed it in his yellow paper & he’s the reason 1.0 got out the door. Vitalik is the reason 2.0 never got out the door,” Nerayoff stated.\n\nShould be within 48 hours hopefully less. Logistics, setting up Smart NFTs, etc. — Steven Nerayoff (@StevenNerayoff) November 14, 2023\n\nPositioning himself as a whistleblower, Nerayoff wants to expose what he claims is a decade of corruption.\n\n“I am only doing it to reveal the truth but then others will have to untangle the rest of the 10 years of corruption. I know this much, the Free Pass is going to cost somebody something,” he said.\n\nNerayoff also pointed to the lack of lawsuits or public denials as support for his allegations’ validity.\n\n“If I was clean I’d simply say no,” he commented about the lack of rebuttals from Buterin and others.\n\nWith his bombshell revelations looming, Nerayoff says he has been contacted by many related parties since first speaking out.\n\n“I made sure this story would go public & not dependent on me by giving info for major press before I came forward. Notice not a single denial or even answers to basic questions of impropriety from anyone. Makes one question how deep & wide this goes,” he stated.\n\nThe price of Ethereum’s native cryptocurrency ether has failed to break through its 2022 highs amid Nerayoff’s accusations and the impending release of his purported evidence. The crypto community awaits the latest chapter in this story, as the Ethereum insider’s promised exposé draws near."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8venljcnlwdG8uY29tL2JpdGNvaW4tb3V0cGFjZXMtZXRoZXJldW0taW4tdHJhbnNhY3Rpb24tZmVlcy1mb3ItZmlyc3QtdGltZS1pbi0zLXllYXJzLW9uLXNwb3QtZXRmLWV4Y2l0ZW1lbnQv0gF4aHR0cHM6Ly96eWNyeXB0by5jb20vYml0Y29pbi1vdXRwYWNlcy1ldGhlcmV1bS1pbi10cmFuc2FjdGlvbi1mZWVzLWZvci1maXJzdC10aW1lLWluLTMteWVhcnMtb24tc3BvdC1ldGYtZXhjaXRlbWVudC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Outpaces Ethereum In Transaction Fees For First Time In 3 Years On Spot ETF Excitement - ZyCrypto",
        "content": "Advertisement\n\nThe possibility of a spot Bitcoin exchange-traded fund (ETF) hitting the United States market has boosted demand for the crypto king, causing a spike in transaction costs while showering miners of BTC with extra revenue.\n\nBitcoin is now leading the charge in daily transaction fees, usurping ether for the first time in three years ahead of an all-important halving event.\n\nStealing Ether’s Crown\n\nRoughly three years ago, ether toppled its big brother, bitcoin, in terms of transaction fees owing to its multifaceted blockchain network, which supported a wide range of decentralized applications. This utility of the world’s largest programmable blockchain drew considerable user activity, specifically in the fast-growing sector of decentralized finance (DeFi) yield farming and non-fungible token (NFT) trading, which resulted in significantly higher transaction fees on the Ethereum network.\n\nThis period of ethereum being king seems to have ended as Bitcoin’s daily total fees, which users pay to miners, have surged to $11.63 million on Nov 16, as per data from CryptoFees. For comparison, Ethereum registered only $8.44 million during the same timeframe. The average transaction fee on Bitcoin has shot above $18.69, which marks an almost 1,000% increase from the fee seen on Nov. 1.\n\nAs for the price, one bitcoin is now worth $36,527. The premier crypto has been surging on the anticipation that the SEC is close to approving one of several Bitcoin ETFs filed by Wall Street titans like BlackRock. This likely buoyed investor sentiment — as BTC prices nearly crossed the $38,000 mark.\n\nAdvertisement\n\nImplications For Bitcoin Miners\n\nThe surging transaction fees, although a pain for Bitcoin users are considered a positive development by some market pundits. They contend that the higher fees strengthen the security of the Bitcoin blockchain.\n\nMoreover, the significantly expensive transactional activity is a boon to the beleaguered miners who secure and maintain the Bitcoin network as they are rewarded in BTC fees for processing users’ transactions.\n\nThis is particularly important for the miners as Bitcoin’s quadrennial halving event scheduled for April 2024 draws closer, slashing block rewards for the industry by 50%."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9maWRlbGl0eS1mb2xsb3dzLWJsYWNrcm9jay1maWxlcy1mb3Itc3BvdC1ldGhlcmV1bS1ldGYtd2hlcmUtbmV4dC1mb3ItZXRoZXItZXRoLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Fidelity Follows BlackRock, Files For Spot Ethereum ETF - Where Next for Ether (ETH)? - Cryptonews",
        "content": "Fidelity Follows BlackRock, Files For Spot Ethereum ETF – Where Next for Ether (ETH)?\n\nAsset management giant Fidelity just filed a 19b-4 with the Chicago Board Options Exchange (CBOE) to set up a spot Ethereum exchange-traded fund (ETF) called the Fidelity Ethereum Trust, just one day after BlackRock filed to set up the iShares Ethereum Trust, its own spot Ethereum ETF.\n\nThe latest move to offer a spot Ethereum ETF to investors comes as major asset managers double down on bets that cryptocurrencies have a bright future, and that their new proposed crypto investment vehicles will gain quick approval in the US.\n\nBoth asset managers plus a dozen others filed to set up spot Bitcoin ETFs back in June, with many analysts betting that these applications will gain approval as soon as January.\n\nFidelity manages over $4.5 trillion in investor funds, whilst BlackRock manages over $8 trillion, making it the largest asset manager in the world.\n\nEther (ETH), the official name of the cryptocurrency that powers the Ethereum network (though many also wrongly refer to the cryptocurrency itself as Ethereum), was relatively unmoved by the news of Fidelity’s approval.\n\nETH was last changing hands just above $1,950, having dipped over 4% this week as traders take profit in wake of the cryptocurrency’s recent failure to break above its yearly highs in the $2,100s.\n\nWhere Next for Ether (ETH)?\n\n\n\nDespite its recent pullback, ETH is still up an impressive 28% versus its October lows.\n\nThe cryptocurrency has been a beneficiary of a broader market rally driven by 1) optimism about expected near-term spot Bitcoin ETFs and 2) an improvement in the macro backdrop as investors bet the Fed’s tightening cycle is over, with US stock rallying and US bond yields and the dollar dumping this month.\n\nMore recently, ETH has been supported by the news that major asset managers are looking to set up their own spot Ethereum ETFs.\n\nBut this news hasn’t resulted in a lasting market pump.\n\nIndeed, Ether’s 28% gains since mid-October look weak when compared to Bitcoin’s 45% gain over the same time period.\n\nEther’s continued underperformance is difficult to understand in wake of the recent improvement in on-chain activity that has turned the Ether supply deflationary once again, as shown in data presented by Glassnode.\n\nPerhaps investors are still worried about the poor demand that recently launched Ether futures ETFs attracted in the US, and assuming that this might translate into poor demand for spot Ethereum ETFs.\n\nBut with the outlook for the broader market looking up and Ether chart analysis looking bullish, Ether price risks are likely strongly tilted to the upside.\n\nIf Ether can break to the north of the hugely important support-turned-resistance $2,150 area, then the door is open (technically speaking) to a quick rally back towards the next major level around $3,600.\n\nNarratives around spot ETFs, a bullish macro backdrop and Ether deflation could all offer more support to the cryptocurrency in the coming months.\n\nAnd if long-term US government bond yields fall below Ether token staking returns (currently around 4%), which is highly likely if the Fed starts cutting interest rates, Ether could get another bullish narrative (i.e. the hunt for yield)."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vbnVsbHR4LmNvbS9ldGhlcmV1bS11c2Vycy1mYWNlLTIxOS1pbmNyZWFzZS1pbi1mZWVzLWFpLWNyeXB0by1wb2lzZWQtZm9yLXNpZ25pZmljYW50LXVwdHJlbmQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Users Face 219% Increase in Fees; AI Crypto Poised for Significant Uptrend - NullTX",
        "content": "InQubeta (QUBE) and Ethereum (ETH) are two of the top altcoins to buy now thanks to the exponential growth both projects are expected to enjoy in 2024 and beyond. Ethereum prices have surged 31% in the past month, but not without creating some controversy as fees rise by 219%.\n\nThat’s always one of the issues cryptocurrency users often find themselves dealing with during price breakouts. Bitcoin (BTC) fees have grown even more in recent weeks, with users paying as much as $16 to transfer BTC. High fees defeat the purpose of cryptocurrencies since many were initially designed to help people avoid the high fees associated with traditional money transfers.\n\nInQubeta has also enjoyed substantial growth since its presale started, earning early investors 130%, and those who buy tokens now get to earn 90% profits before tokens are launched on exchanges.\n\nInQubeta (QUBE) emerges as one of the top altcoins to buy now\n\nInQubeta takes on traditional investment avenues by creating an easier way to invest in artificial intelligence (AI). It uses its Ethereum-built blockchain to create an investment process that involves ERC20 coins, fractionalization, and smart contracts.\n\nInQubeta’s link to AI has helped propel its presale success as it raises over $4.9 million in token sales. Companies that help to advance artificial intelligence have been a favorite of investors for the past decade as investments in the space grow exponentially.\n\nMore than $1.5 trillion is anticipated to be guided into the AI space by 2030, and InQubeta is positioned to help direct some of these funds to startups in its ecosystem.\n\nHere’s what investing looks like on the InQubeta ecosystem:\n\nAI start-ups are evaluated before getting access to InQubeta’s network\n\nThese companies develop ERC20 coins with investment opportunities minted into them. These tokens are then added to the ERC20 token list on the marketplace\n\nwith investment opportunities minted into them. These tokens are then added to the on the marketplace Investors are provided with all the information they need to make informed decisions on the marketplace, and purchases are made with QUBE\n\nInvestors get custody of their NFTs and they can be resold on the marketplace anytime they choose\n\nInQubeta investors don’t have to invest in AI startups to earn considerable profits. Holding on to QUBE or staking may earn just as much. Tokens are drastically undervalued at their current price of $0.0161, and some projections have QUBE prices reaching a dollar once tokens are available on exchanges.\n\nThe supply of QUBE being capped at 1.5 billion means it also has to build a market capitalization of $1.5 billion for tokens to be priced at a dollar. That’s a feat many expect the project to accomplish in the coming years since meme coins like Dogecoin (DOGE) and Shiba Inu (SHIB) have built up exponentially larger market shares. This means a $1,000 investment in QUBE could be worth over $62,000 by this time next year. No other altcoin is expected to enjoy that much growth during the same period.\n\nEthereum’s high fees become a hot topic again\n\nEthereum transaction fees are once again at ridiculous levels as its prices have surged 30% in the past month. The uptick in fees has led to users paying exorbitant fees, with the average Gwei prices reaching 227. This surge in fees has a considerable impact on the cost of network operations.\n\nToken swaps now cost up to $160, while more complex trades, like those that involve NFTs, can cost as much as $270. These fees price out users who make small trades since they cannot justify spending so much on fees for their small purchases.\n\nDevelopers will have to come up with a better solution to keep fees reasonable regardless of how much prices grow to avoid stifling the development of new applications and the ecosystem’s growth.\n\nSummary\n\nQUBE and ETH are top altcoins to buy now as projections have both projects enjoying exponential growth in 2024. QUBE will likely enjoy more growth as predictions have its prices rising as much as 100x when released on exchanges.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nDisclosure: This is a sponsored press release. Please do your research before buying any cryptocurrency or investing in any projects. Read the full disclosure here.\n\nPhoto by Kanchanara on Unsplash"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiowFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLXN0YWduYXRlcy1zdWItMzYtNTAwLWFzLXNlY3MtZWlnaHQtZGF5LXdpbmRvdy1jbG9zZXMtMjAyMzExMTcxOTA10gGnAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLXN0YWduYXRlcy1zdWItMzYtNTAwLWFzLXNlY3MtZWlnaHQtZGF5LXdpbmRvdy1jbG9zZXMtMjAyMzExMTcxOTA1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC stagnates sub-$36,500 as SEC’s eight-day window closes - FXStreet",
        "content": "Share:\n\nBitcoin price remains under the $36,500 level as the absence of momentum leaves BTC susceptible to a slump.\n\nEthereum price risks at least 5% slump to the $1,864 level if it loses critical support at $1,935.\n\nRipple price risks a 10% drop to the late October lows if the support at $0.5981 gives way.\n\nBitcoin (BTC) price remains steadfast below the $36,500 level as the US Securities and Exchange Commission (SEC) misses its target. Nevertheless, a new development concerning the sane has equally not done anything for BTC, with ETF specialist Erica Balchunas saying the financial regulator wants ETFs to do cash creats.\n\nMeanwhile, both Ethereum (ETH) and Ripple (XRP) are losing ground as profit taking escalates.\n\nAlso Read: SEC allegedly wants spot Bitcoin ETFs to do cash creates, not crypto, after possible meet-up with exchanges\n\nBitcoin price likely to drop\n\nBitcoin (BTC) price remains trapped under the $36,500 level as hope for a spot BTC ETF approval in 2023 wears thin. All indicators show that momentum is waning due to multiple sell-signals in play. This leaves the king of cryptocurrency susceptible to a fall.\n\nUnless sidelined investors enter the fold, Bitcoin price could lose the support offered by the ascending trendline at $35,410. The ensuing selling pressure would then likely plunge BTC to $34,000.\n\nFurther, south, the slump could see Bitcoin price extend below the $32,000 mark before a test of the bullish breaker extending from $30,126 to $31,524. A break and close below the midline of this order block at $30,824 is likely to send BTC to the forecasted $30,000 psychological level.\n\nBTC/USDT 1-day chart\n\nOn the other hand, increased buying pressure could see Bitcoin price confirm its move north above the supply zone extending from $36,276 to $37,301 by decisively closing above the $36,788 level. Past this level, the likely move would be to clear the $37,972 barrier before an extension to the $40,000 psychological level.\n\nAlso Read: Bitcoin price hit $38,000 despite US financial regulator’s decision to delay two BTC ETF decisions\n\nEthereum price losing $1,935 support will be detrimental to ETH holders\n\nEthereum (ETH) price is testing the critical support at $1,935, and losing this level could send the largest altcoin by trading volume to the depths of $1,864, 5% below current levels.\n\nIn a more dire case, the fall could extend toward the $1,800 psychological level with the next support level likely to present itself around the $1,753 mark.\n\nETH/USDT 1-day chart\n\nConversely, if the $1,935 mean threshold and ultimately the order block spanning from $1,864 to $2,004 holds as a support level, Ethereum price could pull north, restoring above the ascending trendline at $2,029.\n\nIn a highly bullish case, the gains could extend to the $2,136 range high, with such a move constituting a 10% climb above current levels.\n\nAlso Read: Ethereum is a commodity, but SEC will not admit it, expert says amid ongoing ETF race\n\nRipple price extends fall with 10% pullback possibly in the cards\n\nRipple (XRP) price could fall 10% below the $0.5981 support level to test the $0.5392 support, as the remittance token continues to extend its losses after breaking out of the symmetrical triangle.\n\nThe Relative Strength Index (RSI) shows momentum is falling as it nosedives south, mirrored by the Awesome Oscillator (AO), whose histogram bars are soaked in red and edging south. This adds credence to the bearish thesis.\n\nXRP/USDT 1-day chart\n\nOn the flip side, a re-entry by sidelined investors and late bloomers could see Ripple price correct, pulling north and potentially restoring above the lower boundary of the triangle at $0.6603. In a highly bullish case, the gains could extrapolate past the $0.0700 psychological level, balancing out the inefficiency represented by the Fair Value Gap (FVG) at $0.7512 with the potential to hit the $0.8000 psychological level.\n\nAlso Read: XRP price fails to show parity with Ripple’s important victory over SEC, 5% pullback seems likely"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvcHl0aC1haXJkcm9wLWV0aGVyZXVtLXNvbGFuYS1hbmQtYXB0b3Mtc2V0LXRvLWJlbmVmaXQtZnJvbS1uZXctcGxhdGZvcm0tbGF1bmNoLWhlcmVzLWhvdy10by1jaGVjay1lbGlnaWJpbGl0eS5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Pyth Airdrop: Ethereum, Solana, and Aptos Set to Benefit from New Platform Launch – Here's How to Check Eligibility - Cryptonews",
        "content": "Pyth Airdrop: Ethereum, Solana, and Aptos Set to Benefit from New Platform Launch – Here’s How to Check Eligibility\n\nDeFi oracle network Pyth has announced the launch of its airdrop campaign, which will distribute approximately 255 million PYTH tokens to its users and community members.\n\nIn a recent post on X (formerly Twitter), the project said the airdrop is set to commence on November 20 at 2:00 pm UTC.\n\n“The Claim Process will be available for 90 days,” the announcement read. “The Airdrop Claim Page will be active until Feb 18, 2024.”\n\nThe Claim Process for the Pyth Network Retrospective Airdrop will open on Monday, Nov 20 at 2 PM UTC. Stay tuned for more details on instructions on how the Claim Process works. Additionally, the Claim Process will be available for 90 days. The Airdrop Claim Page will be active… — Pyth Network 🔮 (@PythNetwork) November 16, 2023\n\nMore than 90,000 wallets will be eligible to participate in the campaign.\n\nThese include users of decentralized applications (dapps) that rely on Pyth network data across 27 blockchains, including Ethereum, Solana, Aptos, Polygon, Arbitrum, Avalanche, and Optimism, as well as holders of Pyth NFTs and Pyth Network Discord administrators.\n\nPyth has opened an eligibility check page where DeFi users can verify their potential eligibility and find out the amount of PYTH tokens they are set to receive.\n\nIt’s important to note that certain legal restrictions apply, and residents of the United States, the United Kingdom, North Korea, Ukraine, Cuba, Syria, Iran, Yemen, South Sudan, the Democratic Republic of the Congo, and eight other nations and territories will be ineligible to participate by default.\n\nThe native token of Pyth, PYTH, will have an initial circulating supply of 1.5 billion tokens, as stated by the network.\n\nAn additional 8.5 billion PYTH tokens will be unlocked over a period of six to 42 months following the platform’s launch.\n\nOracle Networks Play a Crucial Role in Connecting Blockchains\n\n\n\nDeFi oracle networks like Pyth play a crucial role in connecting blockchains with real-world data sources, enabling smart contracts to execute based on external events and data.\n\nThese networks have the potential to automate various processes, such as ordering products when inventory levels drop, executing agreements based on stock and commodity prices, and tracking carbon emissions for taxation purposes.\n\nOracle networks are vital for integrating the crypto market with traditional financial markets and implementing smart contracts in traditional businesses.\n\nHowever, it’s worth noting that oracle networks can also be vulnerable to exploitation.\n\nIn the past, a hacker manipulated the oracle-reported price of the MNGO token, resulting in a $100 million loss for the decentralized exchange Mango Markets.\n\nDespite this risk, Pyth has managed to establish itself as the fourth-largest oracle network in terms of total value secured, according to DeFi Llama.\n\nThe project’s chief competitor is Chainlink, a leading decentralized oracle network that ensures smart contracts can access real-world data.\n\nBack in August, Bloomberg reported that a large group of team members at Jump Crypto had jumped ship to start Douro Labs, where they now help develop the Pyth network."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYm9sZC5jb20vY2hhdGdwdC1waWNrcy0zLWxvdy1mZWUtZXRoZXJldW0ta2lsbGVycy10by1idXktYXMtZXRoLWdhcy1mZWVzLXN1cmdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "ChatGPT picks 3 low-fee 'Ethereum killers' to buy as ETH gas fees surge - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) gas fees have consistently increased in the last month, driving developers, investors, and cryptocurrency users to look for layer-1 blockchain alternatives.\n\nAs observed, Ethereum average gas fees went from $1.5 on October 15, registered by BitInfoCharts, to the last recorded average of $6.35 on November 17. Notably, users paid $6.9 million in ETH gas fees on a single day, according to data from CryptoQuant.\n\nEthereum average transaction fee historical chart. Source: BitInfoCharts\n\nIn the past, these high-fee scenarios have driven demand and liquidity toward alternative layer-1 blockchain with a similar proposition to Ethereum and lower gas fees. With that in mind, Finbold turned once again to ChatGPT to get insights into possible good picks for this context.\n\nBNB Chain (BNB)\n\nChatGPT’s first pick was the BNB Chain (BNB) a layer-1 blockchain created by the cryptocurrency exchange Binance. Interestingly, BNB’s price is up 14.66% in the last month, since Ethereum gas fees started increasing. At the time of publication, Binance’s native token is trading at $242.13.\n\nBNB 1-month price chart. Source: Finbold\n\n“Binance Smart Chain is known for its low transaction fees and fast confirmation times. It operates in parallel with Binance Chain but adds smart contract functionality. BNB is the native cryptocurrency of Binance Smart Chain and can be used to pay for transaction fees and participate in various decentralized applications (DApps). Binance Smart Chain’s architecture prioritizes high throughput and low fees, making it an attractive option for users seeking alternatives to Ethereum.” — ChatGPT\n\nSolana (SOL)\n\nNotably, Solana (SOL) was one of the best-performing cryptocurrencies of the year and is ChatGPT’s second pick for more efficient gas fees. Its native token, SOL, is trading at $56.13 by press time, with fantastic monthly gains of 136%.\n\nSOL 1-month price chart. Source: Finbold\n\n“Solana has gained attention for its high throughput and low transaction costs. It uses a unique consensus mechanism called Proof of History (PoH) to improve scalability and reduce transaction confirmation times. Solana aims to provide a fast and cost-effective platform for decentralized applications. Its growing ecosystem includes various projects and decentralized exchanges (DEXs) that leverage its performance advantages over Ethereum.” — ChatGPT\n\nCardano (ADA)\n\nMeanwhile, Cardano (ADA), ChatGPT’s third pick, is the second-best performer among the three low-fee “Ethereum killers.” The native token ADA is priced at $0.36 with 46% gains in the last 30 days.\n\nADA 1-month price chart. Source: Finbold\n\nNevertheless, it is important to say that other factors, such as security, scalability, decentralization, and adoption, must be considered when evaluating each of these mentioned projects.\n\nThere are no guarantees that any of these layer-1 blockchains will be able to conquer any meaningful share of Ethereum’s capitalization and total value locked on DeFi, despite offering a more efficient alternative for gas fees and network scalability.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtcy1iaWctbW9tZW50LWFmdGVyLWJsYWNrcm9jay1maWRlbGl0eS1zZWVrcy1zZWMtZ3JlZW5saWdodC1mb3Itc3BvdC1ldGhlci1ldGYv0gFvaHR0cHM6Ly96eWNyeXB0by5jb20vZXRoZXJldW1zLWJpZy1tb21lbnQtYWZ0ZXItYmxhY2tyb2NrLWZpZGVsaXR5LXNlZWtzLXNlYy1ncmVlbmxpZ2h0LWZvci1zcG90LWV0aGVyLWV0Zi8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ethereum’s Big Moment: After BlackRock, Fidelity Seeks SEC Greenlight For Spot Ether ETF - ZyCrypto",
        "content": "Advertisement\n\nFinancial services behemoth Fidelity Investments is seeking SEC approval to create its exchange-traded fund (ETF) that would hold ETH, the native token of the Ethereum network. Fidelity’s application comes a day after BlackRock filed an S-1 form with the SEC for its spot Ethereum ETF.\n\nSEC Receives Fidelity’s Spot Ether ETF Application\n\nFidelity has joined BlackRock in the race for a spot-based ether ETF.\n\nIn a Nov. 17 filing with the U.S. Securities and Exchange Commission (SEC), Fidelity said the ETF aims to “track the performance of Ether, as measured by the performance of the Fidelity Ethereum Index.” The index symbolizes the U.S. dollar price of ETH based on trading activity across major ether trading platforms.\n\n“According to the Registration Statement, each Share will represent a fractional undivided beneficial interest in the Trust’s net assets. The Trust’s assets will consist of ETH held by the Custodian on behalf of the Trust,” the filing reads.\n\nThe Fidelity Ethereum fund’s shares would trade on the Cboe BZX Exchange under the ticker symbol ETHF.\n\nAdvertisement\n\n“They are the seventh filer for spot Ethereum,” Bloomberg Intelligence analyst James Seyffart posited on the X platform, citing previous filings from BlackRock, Grayscale, Ark Invest, Invesco & Galaxy, VanEck, and Hashdex.\n\nWhy ETF Approval Would Be A Big Deal\n\nCrypto enthusiasts keenly await an SEC approval of one or more ETF applications as the SEC has been reluctant to approve one, often citing possible market manipulation as the biggest risk factor.\n\nAccording to optimists, ETFs that hold BTC or ETH, the market’s largest cryptocurrencies, could drastically shake up the crypto market as they could ease mainstream investors’ path into digital assets.\n\nFidelity noted in the filing that U.S. investors lack a “regulated, U.S. exchange-traded vehicle to gain exposure to ETH”. The giant financial firm further argued that existing venues for gaining exposure to the token entail encountering counter-party risk, legal uncertainty, and technical risk. “Meanwhile, investors in other countries… are able to use more traditional exchange-listed and traded products,” Fidelity continued.\n\nTo this end, Fidelity believes approval of a spot ether ETF would represent a “major win for the protection of U.S. investors in the crypto asset space.”\n\nFidelity submitted paperwork for a spot Bitcoin ETF in June, shortly after BlackRock took the big leap."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9ibGFja3JvY2stZmlsZXMtZm9yLXNwb3QtZXRoZXJldW0tZXRmLXRvLWZ1cnRoZXItY3J5cHRvLXB1c2gvYXJ0aWNsZXNob3cvMTA1Mjc3Nzc5LmNtc9IBjQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9ibGFja3JvY2stZmlsZXMtZm9yLXNwb3QtZXRoZXJldW0tZXRmLXRvLWZ1cnRoZXItY3J5cHRvLXB1c2gvYW1wX2FydGljbGVzaG93LzEwNTI3Nzc3OS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "BlackRock files for spot ethereum ETF to further crypto push - The Economic Times",
        "content": "Asset management giant BlackRock on Thursday officially filed for a spot ethereum exchange-traded fund ( ETF ), doubling down on its cryptocurrency bets amid investor optimism about the approval of such investment vehicles.The iShares Ethereum Trust, which was registered last week and will be listed on Nasdaq if approved, will give investors access to ether - the second most popular cryptocurrency - without directly owning it.BlackRock is proposing to convert the trust to a \"spot\" ETF, which means it will own ether instead of futures products tied to the crypto token.While futures-based crypto ETFs have previously been approved by the U.S. Securities and Exchange Commission (SEC), the regulator has long contended that the spot crypto market is prone to fraud and manipulation.But in August, a federal appeals court ruled that the SEC was wrong to reject an application from digital asset manager Grayscale Investments to create a spot bitcoin ETF.The landmark victory for Grayscale has prompted a wave of enthusiasm among companies that filed for such investment vehicles in recent months, and has helped restore some faith in the crypto industry after it was shaken by several high-profile collapses last year.BlackRock dipped its toes in the crypto space with its filing for a spot bitcoin ETF in June. Its latest filing indicates that the Wall Street behemoth is aiming to move beyond bitcoin, the world's most popular cryptocurrency.The company will be vying with crypto natives such as Grayscale and Valkyrie and traditional finance giants like Invesco for market share.Coinbase Custody, a unit of crypto exchange Coinbase, will hold the proposed ETF's ether in custody. The company is also the proposed custodian of BlackRock's bitcoin ETF.BlackRock did not immediately respond to a request seeking additional comment."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzE4LzMtdGhpbmdzLXlvdS1zaG91bGQta25vdy1iZWZvcmUtc3Rha2luZy1jcnlwdG8tZm9yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "3 Things You Should Know Before Staking Crypto For Passive Income - The Motley Fool",
        "content": "While crypto staking has existed for years, it really only became mainstream with investors during the past year. This coincided with the transformation of Ethereum (ETH 2.43%) into a proof-of-stake blockchain as part of The Merge. Suddenly, people began asking what crypto staking was, and how they could make money from it. As a result, crypto staking went from something only the early blockchain and crypto pioneers were doing to something the average investor on Main Street was doing.\n\nWhat makes crypto staking so unique is that it is both a technical process that involves the inner workings of a blockchain, and a form of financial investment. At times, this duality can be confusing for investors, who may only be thinking of crypto staking as a form of passive income. With that in mind, here are three things to keep in mind before staking your crypto.\n\nA flawed analogy?\n\nThe classic analogy is that crypto staking is much like depositing your funds in a high-yield savings account. You are depositing your cryptocurrency with a blockchain, much like depositing your dollars with a bank. And, in exchange for doing so, you are paid a specified reward rate, usually expressed in terms of an annual percentage yield (APY). For most cryptos, these APYs range from 2% to 10%. For example, on Coinbase Global (COIN 2.72%), you can currently earn 3.35% on your Ethereum holdings.\n\nBut this analogy has several flaws. For one, blockchains are not banks. That means your deposit is not guaranteed by anyone, and certainly not by the Federal Deposit Insurance Corporation. That helps to explain why APYs for some cryptos can be as high as 45% -- think of this as a risk premium for depositing your funds with a potentially unreliable blockchain counterparty.\n\nMoreover, when you stake your crypto, you are paid rewards in the form of the cryptocurrency you deposited, and not in dollars. Thus, when you compare APYs, you need to be thinking in terms of how much crypto your investment is yielding, and not how many dollars it is yielding.\n\nFinally, keep in mind that staking usually requires you to \"lock up\" your crypto for a specified period of time, during which you will not have access to it. This might not seem like a big deal at first, especially if you are a long-term investor, but what if your crypto starts to lose value while it's locked up? When you get your crypto back at the end of the staking period, it may have lost significant value. The math here can be brutal. If your crypto loses even 10% of its value over a 12-month period, and you are earning a 5% APY, it's hard to see how you're going to make a profit on this investment.\n\nDifferent types of staking\n\nConfusing matters further is that there are different types of staking.​​ One form of staking requires you to operate a node on the blockchain network and use your own computer hardware to validate transactions on the blockchain. But this is neither easy nor passive. If you want to become a validator on the Ethereum blockchain, for example, you need to make a minimum investment of 32 ETH (worth almost $64,000 at today's prices) and have the suitable tech hardware to run a blockchain node 24/7.\n\nThat's not what most people are talking about when they talk about crypto staking as a form of passive income. Instead, they are usually talking about staking crypto via a cryptocurrency exchange such as Coinbase. This process is much easier -- it usually only requires a few clicks online, and you're ready to go. As long as you already own the cryptocurrency you want to stake, you just tell the crypto exchange how much you want to stake and for how long, and everything else is done for you.\n\nFor more advanced investors, there's also a form of staking your crypto without the need for a cryptocurrency exchange at all. Instead, you hold funds in your own blockchain wallet and use a third-party staking service. Typically called liquid staking, this process can reduce some of the risks of staking, since you can pull out your crypto at any time. Moreover, the staking rewards can be a bit higher, because there is no intermediary (like a crypto exchange) taking a cut of your rewards.\n\nRegulatory concerns\n\nFinally, there's the pesky little matter of the Securities and Exchange Commission, which has decided that there's something about crypto staking that it does not like. In February, it went after cryptocurrency exchange Kraken for offering staking services to customers. Then, in June, it went after Coinbase. So there's currently a bit of uncertainty about the future of crypto staking.\n\nThe good news, if you want to call it that, is that the SEC is not so much opposed to the concept of staking, as it is to the way staking is pitched to retail investors. If you read the official SEC statement about Kraken, this becomes clear. For example, the SEC said that Kraken did not do a good enough job of explaining potential risks to customers.\n\nCaveat emptor\n\nThat's why I made a big deal about the flawed analogy to a high-yield bank savings account. If you are thinking about crypto staking as just crypto's version of a savings account, then it's easy to see how you might be in for a rude surprise. Unlike with a savings account, you can actually lose money on your staked crypto. So, certainly, before you get involved with crypto staking, make sure you do your due diligence and understand the risks."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8yMDY0NzUvc29tZW9uZS1qdXN0LXBhaWQtNDAway1ldGhlcmV1bS1uZnQtdml0YWxpay1qZXN0ZXLSAVJodHRwczovL2RlY3J5cHQuY28vMjA2NDc1L3NvbWVvbmUtanVzdC1wYWlkLTQwMGstZXRoZXJldW0tbmZ0LXZpdGFsaWstamVzdGVyP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Someone Just Paid $400K for This Ethereum NFT of Vitalik as a Jester - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn NFT painting of Ethereum co-founder Vitalik Buterin dressed as a jester has sold for 200 ETH, equivalent to $392,308 at the time of sale, on the secondary market—injecting another glimmer of hope into the long-sluggish NFT ecosystem.\n\nThe digital painting, a one-of-one NFT titled “EthBoy” made by the crypto artists Trevor Jones and the late, pseudonymous Alotta Money, broke records when it first sold at auction in November 2020 for a whopping 260 ETH, making it at the time the most expensive NFT artwork ever sold. Based on fluctuations in the price of ETH over the intervening years, though, the value of that sale—about $140,000 at the time—pales in comparison to that of this week’s resale.\n\nWhen \"EthBoy\" was first minted, it entered an NFT ecosystem very different to today’s. Crypto art and PFP NFTs consistently broke sale records on their ascent to the eventual crescendo of the 2021 NFT bull run.\n\nAD\n\nAD\n\nCritically, also, the novel medium was so eagerly embraced by traditional artists like Jones (a painter by trade), due to its prioritization of creator royalties—fees, typically between 2.5% and 10%, that were then mandatorily tacked on to any secondary sales of an NFT, and given to the piece’s creator.\n\nGm! Ethboy just sold on secondary for 200 ETH! 🤯 pic.twitter.com/QpqoBu2RTM — Trevor Jones 🎨 (@trevorjonesart) November 16, 2023\n\nIn the last year, creator fees have become the focal point of an escalating crisis in the struggling NFT ecosystem. Once considered a key incentive for artists enforced by all major NFT marketplaces, the fees have now become optional at major platforms like OpenSea, which have struggled mightily to attract customers and keep revenue steady amidst the current bear market.\n\nThough \"EthBoy\" was sold this week via the OpenSea marketplace, it does appear that the NFT’s new owner opted—of their own accord—to pay the work’s creator fee, despite not being obligated to do so. The 10% creator royalty of 20 ETH, automatically paid to Async Art, the platform that coordinated the piece’s creation, constituted what’s essentially a $39,230 tip.\n\nWhen \"EthBoy\" was first minted, its creators—then intent on demonstrating the unique selling points of on-chain art sales—committed to sharing one third of creator fees generated by the artwork’s future sales with the piece’s first buyer, in perpetuity.\n\nAD\n\nAD\n\nThat first owner, the pseudonymous MaxStealth, has held on to \"EthBoy\" since 2020. In addition to the base revenue they collected yesterday from the work’s sale, they should thus also soon be receiving just over $13,000 worth of ETH as their portion of the creator fee. It’s an enticing, but potentially soon to be outdated, taste of the NFT art market’s economic potential.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL3ByZXNzLXJlbGVhc2VzL2V0aGVyZXVtLWZvcmVjYXN0ZWQtdG8tcmVhY2gtNS04ay1ieS0yMDI1LWlucXViZXRhcy1idWxsaXNoLWZvcmVjYXN0LWV4cGxhaW5lZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Forecasted to Reach $5.8K by 2025; InQubeta's Bullish Forecast Explained - NewsBTC",
        "content": "InQubeta (QUBE) and Ethereum (ETH) are two of the best coins to invest in right now as both projects are projected to enjoy exponential growth in the coming years. Financial firm Finder recently released projections that had ETH prices reaching $5,824 by 2025. The forecast also anticipates prices will reach $14,411 by 2030.\n\nQUBE predictions are even more impressive with some projections expecting prices to grow as much as 100x by 2025 as the new DeFi project opens up access to artificial intelligence (AI) investments with its crowdfunding approach.\n\nEarly InQubeta investors have already earned 130% returns on their capital and they will be up a total of 440% by the time tokens launch on exchanges. Newcomers to its presale can still earn 90% returns on their investment before the event ends.\n\nBest coins to invest in: InQubeta (QUBE) poised to lead altcoins in growth\n\nInQubeta’s blockchain is hosted on the Ethereum network and it enjoys its transparency, security, and functionality. This allows AI companies fundraising on the platform to mint investment opportunities into non-fungible tokens that are sold on its NFT marketplace.\n\nInQubeta’s link to AI and its small token supply at 1.5 billion gives it comparable growth potential to where Bitcoin (BTC) was a decade ago as it helps to advance artificial intelligence by directing capital to companies in the space. Investments in AI have risen exponentially in the past several years and more than $1.5 trillion is anticipated to be poured into the technology by 2030.\n\nAI is on course to shake up the world and it will open new opportunities for investors to earn huge returns on their investments. Governments worldwide are already passing regulations to help limit the disruption the technology causes as it becomes apparent it will be the next major revolution.\n\nMany would say the AI revolution is already moving full steam ahead as some of the most complex AI concepts like autonomous cars and humanoid robots are now a reality. Thanks to InQubeta, investors who don’t have access to mainstream investment avenues can now be part of the AI revolution.\n\nDecentralized finance meets artificial intelligence\n\nSmart contracts, ERC20 coins, and fractionalization come together to create an inventive investment process on the InQubeta network. Stocks don’t exist here, but ERC20 coins (non-fungible tokens) perform the same duties.\n\nThese tokens are made by startups looking for capital and sold on the NFT marketplace to those looking to invest in AI. Some tokens give other rewards like exclusive access to items developed.\n\nInvestment opportunities can be purchased with QUBE on the NFT marketplace and any tokens bought can be resold whenever.\n\nInvesting in InQubeta\n\nQUBE is currently priced at $0.0161 but could reach a dollar by 2025 if its market share reaches $1.5 billion. That’s not some unsurmountable milestone in the cryptocurrency space given the fact that meme coins with no real value or purpose like Dogecoin (DOGE) have raised over $9 billion despite the many issues plaguing their networks.\n\nEthereum (ETH) fails to keep up with Bitcoin\n\nEthereum price charts have historically mimicked BTC charts, but the second most popular crypto hasn’t been able to keep up with its older sibling during its current bull run. Still, ETH prices have risen 34% in the past 30 days and Finder’s projections have prices reaching $5,800 by 2024.\n\nWhile its anticipated growth won’t keep up with QUBE, it will allow investors to almost triple their investment in a few years.\n\nSummary\n\nInQubeta and Ethereum are two of the best coins to invest in right now thanks to their impressive projections. QUBE is expected to see more growth than ETH, thanks to how undervalued tokens currently are, the project’s creative way of advancing AI, and the $1.5 trillion projected to be guided into the space by 2030.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of NewsBTC. NewsBTC does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNpdHlhbS5jb20vdGhlLWRyYXdkb3duLWFmdGVyLXRoZS1yZWJvdW5kLWJpdGNvaW4tZXRoZXJldW0tY2FyZGFuby1zb2xhbmEtcG9seWdvbi1hbmQtcG9sa2Fkb3Qtc2VsbC1vZmYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "The drawdown after the rebound: Bitcoin, Ethereum, Cardano, Solana, Polygon and Polkadot sell-off - CityAM - City A.M.",
        "content": "The drawdown after the rebound: Bitcoin, Ethereum, Cardano, Solana, Polygon and Polkadot sell-off\n\nCrypto markets have seen some volatility this week, with the price of Bitcoin dipping and spiking in the last few days. Following yesterday’s rally of 5%+, the market leader is down more than 3% on the day.\n\nEthereum is down almost 4%, trading a notch below the threshold of $2,000. Next-generation cryptos such as Solana, Polygon and Polkadot saw deeper drawdowns overnight.\n\nYesterday’s Crypto AM Daily\n\nIn the Markets\n\nThe Bitcoin Economy\n\n*Data can be found at https://terminal.bytetree.com/\n\nTotal crypto market cap\n\n🔵 $1.39 trillion\n\n🔻 3.47%\n\nWhat Bitcoin did yesterday\n\n🔺 Daily high $37,907\n\n🔻 Daily low $35,561\n\nBitcoin market capitalisation\n\n🟠 BTC $709.361 billion\n\n🟡 Gold $13.199 trillion\n\n💳 Visa $510.39 billion\n\nBitcoin volume\n\nTotal spot trading volume $26.223 billion\n\n🔻 7.98%\n\nEthereum staking entry queue\n\n0 minutes\n\nSP500\n\n🔺 0.12%\n\nFTSE/JSE Top 40\n\n🔻0.19%\n\nFear and Greed Index\n\nBitcoin’s market dominance\n\n52.23\n\nRelative Strength Index (RSI)\n\n57.01\n\nValues of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price, while 30 or below indicates an oversold or undervalued condition.\n\n📣 What they said yesterday\n\n“Our core remit is how to redesign the infrastructure on how to move money.” Umar Farooq, Financial Institution Payments Global Head, JP Morgan, commenting on its Onyx blockchain.\n\nCrypto AM: Editor’s picks\n\nKraken appoints crypto entrepreneur and fintech consultant Bivu Das to drive next chapter of UK growth story\n\nTransformBase initiative set for launch in November\n\nFCA’s new crypto advertising rules met with mixed industry response\n\nChatGPT urges crypto conference panel not to become over-reliant on AI\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nMPs are falling silent over potential of cryptocurrency\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3dpbGwtYW4tZXRoZXJldW0tZXRmLWhhcHBlbi1zb29uLWV4cGxvcmUtNS1jb2lucy10by1pbnZlc3QtaW4tYmVmb3JlLWl0LWhhcHBlbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Will an Ethereum ETF Happen Soon? Explore 5 Coins to Invest in Before it Happens - Analytics Insight",
        "content": "In a significant move echoing the recent Bitcoin ETF momentum, BlackRock, the world’s leading asset manager, has officially sought approval for an Ethereum Exchange-Traded Fund (ETF).\n\nThis development could mark the inception of the first-ever Ethereum ETF in the United States, opening avenues for investors to engage with Ethereum’s market without direct cryptocurrency ownership.\n\nThe ETF, if approved by the US Securities and Exchange Commission (SEC), would precisely track Ethereum’s spot price, offering investors a direct stake in Ethereum’s value rather than in companies associated with the Ethereum ecosystem.\n\nIn response to this news, the price of Ethereum (ETH) experienced a rapid surge, reaching its highest point this year at around $2,133, reminiscent of the Bitcoin rally following BlackRock’s filing for a spot Bitcoin ETF in June.\n\nLet’s dig a bit deeper…\n\n>>> Buy The Best Coin Now<<<\n\nThere Are No Guarantees About ETH ETF Approval & 5 Promising Tokens to Invest In\n\nWhile anticipation surrounds the Ethereum ETF filing, certainty remains elusive. In stark contrast to the optimistic expectations for Bitcoin spot ETFs’ approval by Q1 2024, the fate of spot-based Ethereum ETFs is less assured.\n\nBloomberg ETF analyst James Seffart places a 90% likelihood on Bitcoin ETF approval by January 10, 2024, signalling a positive trend.\n\nHowever, Ethereum’s regulatory standing introduces complexity. The SEC’s 240-day evaluation period pushes any potential Ethereum ETF release to late 2024, and the ambiguous categorization of ETH as a potential security adds an additional layer of uncertainty.\n\nAs the industry advocates for clearer regulatory guidelines, understanding Ethereum’s SEC status becomes a pivotal determinant in shaping the ETF landscape.\n\n>>> Buy The Best Coin Now<<<\n\nBitcoin ETF (BTCETF) – Milestone Crusher – $740,000 In Less Than 10 Days!\n\nHave you explored the latest entrant into the crypto – Bitcoin ETF Token? Positioned as one of the most promising projects, BTCETF strategically aligns with Bitcoin’s price fluctuations and the anticipated SEC approval of a Bitcoin ETF.\n\nThe project’s roadmap links its trajectory to Bitcoin’s potential surge and the market-shifting impact of an ETF approval.\n\nEven in the face of Bitcoin’s decline, gains from BTCETF remain probable, with industry experts projecting a substantial Bitcoin valuation of $135,000 by 2025.\n\n>>> Buy Bitcoin ETF Now<<<\n\nFurthermore, the imminent prospect of an ETF approval signals a potential influx of billions or trillions into the market, offering BTCETF exponential growth possibilities.\n\nWith projections foreseeing remarkable gains, coupled with passive income opportunities through staking and a deflationary mechanism ensuring price stability, Bitcoin ETF Token emerges as a compelling investment choice.\n\nSeize the moment as BTCETF navigates through its presale stages, having already raised over $740k, and stay ahead of the impending price surge.\n\n>>> Buy Bitcoin ETF Now<<<\n\nBitcoin Minetrix (BTCMTX) – Mining Will Become Accessible to Everyone\n\nEnter the realm of decentralized Bitcoin mining with Bitcoin Minetrix. Currently navigating a successful presale that has amassed an impressive $3.8 million in just over a month, the project stands as a testament to its innovative use case and robust community interest.\n\nBitcoin Minetrix seeks to democratize Bitcoin mining, historically an exclusive domain requiring expensive hardware and technical expertise.\n\nUnlike its predecessors, the platform’s cloud mining solution opens the doors to mass adoption. Users simply need an Ethereum-compatible wallet and $BTCMTX tokens to embark on their mining journey, exchanging tokens for Bitcoin mining credits and subsequently earning free Bitcoin.\n\nEarly birds can secure their stake at the current discounted presale rate of $0.0116, but that price is already set to increase in the next 48 hours as the token moves to the next stage.\n\nSeize the opportunity for a pioneering entry into decentralized Bitcoin mining with Bitcoin Minetrix.\n\n>>> Buy Bitcoin Minetrix Now<<<\n\nMeme Kombat ($MK) – Raked In $1.7 Million in Funding\n\nUnleash the power of memes with Meme Kombat, the latest entrant in the thriving meme coin arena, poised to secure Tier-1 cryptocurrency exchange listings.\n\nUnlike its counterparts, Meme Kombat ventures beyond mere hype, amalgamating three booming industries—crypto, gaming, and gambling.\n\nEngage in thrilling battles featuring favorites like Pepe and Shiba Inu, with AI determining unpredictable and unbiased outcomes.\n\nThe platform, exclusively built on the Ethereum blockchain, introduces a dynamic gaming experience centered around iconic meme characters.\n\nParticipants stand to earn native $MK tokens through victories, challenges, and strategic betting on other players’ battles.\n\nExcitingly, Meme Kombat offers a presale staking option, boasting an impressive APY of over 720%. The project has already garnered over $1.7 million in funding.\n\n>>> Buy Meme Kombat Now<<<\n\nTG.Casino ($TGC) – 260% Staking APY & 25% Loss Cashback\n\nEmbark on a revolutionary journey with TG.Casino, a project set to redefine the landscape of crypto gambling on Telegram.\n\nCapitalizing on the booming trend of crypto casinos, TG.Casino promises seamless, rapid, and discreet gaming experiences.\n\n>>> Buy TG Casino Now<<<\n\nFocused on anonymity, licensing, and security, this Telegram Casino elevates your gaming escapades by linking your wallet effortlessly.\n\nThe native token, TGC, not only unlocks exclusive games but also offers enticing perks, including a generous 260% staking APY and a remarkable 25% loss cashback. With an impressive $2 million raised in its presale, act swiftly to maximize your gains in this innovative gaming venture.\n\n>>> Buy The Best Coin Now<<<\n\nSolana (SOL) – Now Backed by BitBoy Crypto\n\nThis resilient blockchain platform, seamlessly integrated into web2 giants like Visa and Shopify, positions itself as a frontrunner.\n\nPriced at over $50, the anticipation among crypto enthusiasts is palpable, envisioning Solana’s ascendancy to its pinnacle at $240.\n\nWith whispers circulating about SOL potentially becoming the next cryptocurrency to gain an ETF after Ethereum, Solana stands as a compelling investment choice in the current market climate.\n\n>>> Buy The Best Coin Now<<<\n\nThe Conclusion\n\nThe recent filing for an Ethereum Exchange-Traded Fund (ETF) by BlackRock mirrors the Bitcoin ETF momentum, signaling a transformative era for crypto enthusiasts.\n\nWhile Ethereum’s ETF approval hangs in uncertainty, the other project’s we discussed offer more clarity at the moment. Most of them are expected to pump at least 10X in the next quartal.\n\nSo, head on to their websites and do your own research, but remember, time is the key to the highest returns possible.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9ldGhlcmV1bS1ldGgtYWltcy1mb3ItMjUwMC1pbnF1YmV0YS1xdWJlLWNhdGNoZXMtd2hhbGVzLWV5ZS13aXRoLW92ZXItNC05bS1yYWlzZWQv0gF6aHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL2V0aGVyZXVtLWV0aC1haW1zLWZvci0yNTAwLWlucXViZXRhLXF1YmUtY2F0Y2hlcy13aGFsZXMtZXllLXdpdGgtb3Zlci00LTltLXJhaXNlZC8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ($ETH) Aims for $2,500; InQubeta ($QUBE) Catches Whales’ Eye with Over $4.9M Raised - Crypto News Flash",
        "content": "In the dynamic world of cryptocurrencies, staying informed about the best cryptos to buy now is crucial for investors. As Ethereum (ETH) sets its sights on the $2,500 mark, another contender is rapidly gaining attention. InQubeta (QUBE), a relatively new player in the crypto space, has made a splash with over $4.9 million raised in its presale, drawing the interest of big investors or ‘whales’.\n\nThe buzz around InQubeta and Ethereum’s consistent upward trajectory underscores the ever-changing landscape of cryptocurrency investments. Let’s take a look at these developments.\n\nEthereum’s Steady Journey\n\nEthereum has been a reliable player in the crypto scene for a while. Many see ETH as one of the best coins to invest in. Its track record reflects strength and potential for future growth.\n\nThe recent focus on Ethereum 2.0 is turning heads, promising better scalability and a more eco-friendly approach, which adds another layer to its appeal to investors. The $2,500 mark is not just a number; it symbolizes the continuous trust and confidence in Ethereum as a leading cryptocurrency.\n\nInQubeta (QUBE) – The Rising Star\n\nEthereum has been steadily moving forward. But these days, all eyes are turning toward InQubeta (QUBE). It’s not just the impressive $4.9 million it pulled in so far in its presale that’s grabbing attention, but the unique value it’s bringing into play. InQubeta isn’t your average crypto project. It’s on a mission to combine AI with blockchain technology.\n\nInQubeta is one of the new DeFi projects this year that are getting the attention of industry insiders and investors alike. At its core is a marketplace that serves as a bridge connecting AI startups and investors. Here, AI startups can mint and sell non-fungible tokens (NFTs) that represent rewards or equity in their company, and investors can purchase them using QUBE tokens.\n\nInQubeta (QUBE) is shaking things up in the blockchain world, aiming to make transactions faster and more efficient. That’s a big deal when you’re on the hunt for the best crypto to invest in. But it’s not just about speed. What makes InQubeta stand out is its commitment to making the process of participating in the growth of the AI sector easier and more accessible. It’s all about building a sustainable and user-friendly ecosystem, ticking the right boxes for investors looking beyond short-term gains in the crypto space. You can learn more about this project by joining their growing community on X (formerly Twitter).\n\nWhy Whales Are Watching\n\nWhales are big-time investors who own a lot of digital currency. The way these whales move in the market, like buying or selling a lot of crypto, can give everyone else a hint about where the trends might be heading.\n\nInterestingly, InQubeta (QUBE) has grabbed the attention of these big-time investors. This kind of interest from them is a big deal: it shows they believe in InQubeta’s potential, especially considering it’s still in the early stages and has already picked up quite a bit of momentum. Many of them believe that QUBE is the best cryptocurrency to invest in right now.\n\nEthereum is like the reliable old friend, known for being stable and having technology that’s been around the block. On the other hand, InQubeta (QUBE) is the new kid, bringing some exciting new ideas and ways of doing things in the world of blockchain and crypto transactions.\n\nFinal Thoughts\n\nThe crypto world is always on the move, offering plenty of chances for those looking for the best crypto investment. Ethereum is gunning for that $2,500 mark, and InQubeta (QUBE) has turned heads with its big fundraising win in its ongoing presale. These are just a couple of examples that show how lively and ever-changing this space is. If you’re thinking about the best crypto to invest in, staying updated on these kinds of trends is important.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\n."
    }
]