[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2RvZ2Vjb2luLWZsaXBzLWV0aGVyZXVtLXRyYW5zYWN0aW9uLWNvdW500gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Dogecoin Proves It's a Serious Blockchain, Flips Ethereum Transaction Count - Blockworks",
        "content": "Dogecoin is undergoing a surge in network spam so dramatic that it’s now processing more transactions than the Ethereum blockchain.\n\nOver the past week, the memecoin network handled more than 7.9 million transactions, up nearly 11% on Ethereum’s 7.2 million and more than double Bitcoin’s count.\n\nNot bad for a chain that has handled only 30,000 daily transactions on average since 2015 — less than 5% of Ethereum’s.\n\nThe culprit is Bitcoin Ordinals. Or more precisely, opportunistic crypto fans eager to capitalize on the inscriptions hype.\n\nBitcoin Ordinals aren’t exactly the same as the NFTs you might find on Ethereum or Solana. Those non-fungible tokens are minted via smart contract and adhere to their own token standards enforced by wallets, marketplaces and other key infrastructure across Web3.\n\nOrdinals are instead defined by data “inscribed” into individual satoshis (sats for short). Sats are BTC’s smallest denomination: 0.00000001 BTC currently worth $0.00027. A craft developer recently figured out how to forever imbue sats with special properties, such as enough data to render a JPEG or DOOM clone.\n\nBRC-20 tokens — a play on Ethereum’s ERC-20 standard for run-of-the-mill tokens — quickly followed Ordinals. Hype for Bitcoin-powered altcoins and collectible sats triggered a renaissance for blockspace demand, driving up fees while pushing transaction counts and mempool backlogs to record highs.\n\nIf we consider Ordinals in the same genre of digital asset as Bored Apes, Bitcoin is now the number-two blockchain for NFTs behind Ethereum.\n\nDogecoin’s transaction count exploded past other prominent blockchains over the past few weeks\n\nDoge see, Doge do\n\nDue to similarities between Bitcoin and Dogecoin (a code fork of a code fork of Bitcoin), it didn’t take long for developers to code methods for minting Dogecoin tokens in much the same way as Ordinals and BRC-20s — except with a “D” instead of a “B.”\n\nBut Bitcoiners have multiple platforms on which traders can swap Ordinals and BRC-20s, including crypto exchange wallets. Dogecoin doesn’t.\n\nBitcoin’s BRC-20s in particular have been helped by an experimental token standard, something akin to Ethereum’s ERC-20s.\n\nThe standard set enough technical parameters so that infrastructure (wallets, marketplaces and the like) can facilitate trading and whatnot without running into headaches, like duplicate listings and overtly broken code.\n\nBRC-20 and Ordinals individually have recently made up more than half of all Bitcoin transactions, and it’s unclear just how many DRC-20-related transactions are flowing through Dogecoin right now. No tools have been built to sort DRC-20 outputs from others, which makes it difficult to quantify exactly how many Dogecoin tokens are being minted every minute.\n\nIn any case, it’s surely an impressive chunk. Multiple DRC-20 token transactions are found in practically every single block right now (which occur every one minute on average). They are easy to spot, as they usually come with a 0.001 DOGE fee attached ($0.000071).\n\nPseudonymous Dogecoin developer inevitable360 told Blockworks that they classify DRC-20 transactions like these as spam because anyone can clone or replicate the exact same token.\n\nUnlike Bitcoin and Ethereum, there is no DRC-20 token standard for Dogecoin. So, many tokens are being minted under the same name, making it practically impossible to form a legitimate market around them.\n\nThere’s still legitimate Dogecoin activity alongside speculators minting Dogecoin tokens via the one or two wallets that support them in their current form (which have been caught boosting fees to apparently profit from the hype).\n\nThe median transaction value is nearly 77 DOGE ($5.46). If DRC-20s were truly the overwhelming majority, then that figure would be far lower.\n\nBitcoin Ordinals already have their own marketplaces\n\nIt might be spam, but it’s honest work\n\nFor what it’s worth, much of the recent Bitcoin activity has also been labeled spam: effectively worthless transactions with no reason to exist but to exist; abundant purely because creation is cheap and the potential payoff is large.\n\nGranted: Ethereum layer-2 networks such as Arbitrum and Optimism are each processing tons of transactions. More than a million per day for the former, in fact. If we add those in with Ethereum, then the blockchain dominates Dogecoin by far.\n\nEthereum fees are also high right now. High enough to apparently dissuade a portion of useless trade, particularly NFTs. But there’s something to be said for Dogecoin in this instance.\n\nMany deride Dogecoin as a joke carefully crafted to trap crypto newbies into gambling on memecoins during bull runs.\n\nThere may be some element of truth to that. But historically, Dogecoin has served as a lucrative alternative for bitcoin miners at times when mining BTC was simply not profitable. An unsung hero, in those cases.\n\nDogecoin is also merge-minable with Litecoin, allowing miners to share hash rate between the two to provide some element of flexibility in support of a multichain future. It just so happens that right now, there appears to be more activity tied to DRC-20 speculation today than that tied to the use of Ethereum mainnet overall.\n\nAnd Dogecoin still has lower median fees: $0.00096 compared to Ethereum’s $3.13 — no doubt an uncomfortable fact for many ETH fans.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS9yZXN0YWtpbmctbGlrZS1haS1ldGhlcmV1bS10cmVuZC1uZXR3b3JrLXN0YWJpbGl0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "'Treat restaking like AI': Ethereum's emerging trend sparks concerns about network stability - DLNews",
        "content": "Restaking is an upcoming blockchain feature that will allow users to double-stake their Ether on other protocols or even different chains.\n\nEthereum co-founder Vitalik Buterin has expressed concerns about restaking’s potential impacts on the network’s stability.\n\nEigenLayer, the company behind restaking, shares Buterin’s concerns and says its restaking models are safe.\n\nThe eagerly-awaited protocol of “restaking”, led by a company called EigenLayer, has stirred concerns over the practice’s potential impact on Ethereum’s stability. While EigenLayer says its restaking models will pose low risks, the company also acknowledges broader concerns surrounding the upcoming innovation.\n\nStaking is the practice of committing funds to secure the Ethereum network while earning rewards. Restaking is a novel “primitive” — a blockchain feature — that will allow users to recommit their staked Ether — using the so-called liquid staking tokens like Lido’s stETH — on other decentralised applications on Ethereum and other blockchains.\n\nBut in a recent post, Ethereum’s co-founder Vitalik Buterin has raised concerns about “overloading” Ethereum with complex and poorly-designed restaking models.\n\nNOW READ: Ether staking surge helps small players chip at Lido’s dominance: ‘A good thing’ for DeFi\n\nStay ahead of the game with our weekly newsletters Subscribe\n\n“We should [...] preserve the chain’s minimalism, support uses of restaking that do not look like slippery slopes to extending the role of Ethereum consensus” Buterin said in his post.\n\nRestaking as a fully-fledged protocol is currently being developed by US company EigenLayer, which raised $50 million in a Series A round in March. It has recently deployed the protocol on Ethereum’s testnet, the mock version of the blockchain.\n\nEthereum's total value locked, a metric for investor deposits in DeFi\n\nRestaking presents a tantalising prospect for investors, as it not only offers users Ethereum’s standard staking yields but also additional rewards upon restaking.\n\nIt can also open up opportunities for developers. Restaking allows for “easier creation of bridges, oracles and other services backed by the same primitives as staked Ether,” Marc-Thomas Arjoon, research associate at crypto asset management firm CoinShares, told DL News.\n\nJoin the community to get our latest stories and updates\n\n“A new blockchain can even tap into this marketplace instead of bootstrapping its own validator set, which is difficult and expensive,” Arjoon said.\n\nNOW READ: VanEck sees Ether soaring 27-fold to $51,000. Or, it could sink to $300\n\nBut there is also a growing concern that restaking could introduce significant risks.\n\nSpinning up new price oracles, bridges, and even chains that depend on the security of restaked Ether could potentially weaken Ethereum’s security. Any issue within one part of the system could cause a ripple effect on these added layers that are built on restaking, especially if they’re not meticulously designed.\n\n“I would advocate for EigenLayer to treat restaking like AI and develop a strong internal ‘alignment’ culture and team,” Justin Drake, a researcher at Ethereum Foundation, told DL News. Drake is one of the two researchers who reviewed Buterin’s post prior to publication.\n\n“Like AI, restaking has the potential to unlock awesome services and reshape the ecosystem. Also like AI, restaking likely introduces systemic risks that are hard yet essential to tackle.”\n\nEigenLayer’s founder Sreeram Kannan told DL News that he “fully agrees” with Drake’s assessment and said he’s “glad Vitalik is urging caution in restaking protocols so that the low-risk use cases are cultivated without going over to the high risk ones.”\n\nHigh risks of subjective slashing\n\nButerin’s primary concern, which he labels as “high risk”, revolves around the possibility that the deposits of restakers might be “slashed” if they breach the rules of another protocol. Such an event — if it impacts too many stakers — could have serious cascading effects on Ethereum.\n\n“Slashing” refers to taking away some Ether from validators who either act maliciously, like trying to cheat the system, or don’t do their job correctly, like being offline when they should be checking transactions. It’s a way Ethereum keeps its system safe by punishing those who don’t follow the rules.\n\nArjoon said that in cases of mass slashing, the security of the Ethereum network could be at jeopardy since stakers may be “force-exited due to having less than the minimum required,” which is 32 Ether.\n\nNOW READ: DeFi protocol in $3m scam was ‘Certik audited’\n\nSuch a mass exit would require a major action to mitigate the risks of reduced network security.\n\n“The risk of subjective slashing is that if the large group of other nodes lie, then honest stakers may be slashed. This may require forking of Ethereum to save honest nodes,” Kannan told DL News. Forking refers to creating a new version of the blockchain, which requires consensus of the Ethereum community.\n\nThe @eigenlayer trust flow: how does EigenLayer drive open innovation beyond the smart contract layer? pic.twitter.com/LviWZ7pCiZ — Brianna (bri.eth/acc) 🦇🔊 (@zkBri) May 25, 2023\n\nBut Kannan told DL News that EigenLayer doesn’t pose such high risks since “the set of use-cases we have been considering compatible for EigenLayer are all based on either objective attributability or no slashing.”\n\n“All of them will be low risk in Vitalik’s classification,” he said.\n\nEthereum’s social layer and ‘bailouts’\n\nIf the high risks come to pass, Buterin and others suggest, Ethereum’s community — social layer or layer 0 as it’s often called — may need to mobilise to address a major crisis, echoing past events — a situation that many would prefer not to see repeated.\n\nEthereum’s design as an open-source project affords its community a critical role in its governance and development through social consensus.\n\n“I see Vitalik’s post as an invitation for the community to recalibrate the cost-benefit analysis around the use of the social layer for application layer interventions,” Drake told DL News.\n\nSo the question is, how much of Ethereum’s social consensus — the people power — must be expended for technical troubles?\n\nThat question became especially relevant in the DAO hack in 2016, which saw $50 million in Ether stolen. The response efforts culminated in a hard fork — creating a new version of the Ethereum blockchain in which the hack was reversed.\n\nNOW READ: MakerDAO members set to approve controversial ‘whistleblower bounty’ to enforce anonymity\n\nMany view that move as a bailout because it intervened in what would otherwise have been the natural consequences of the hack, restoring funds to DAO token holders as if the hack had never occurred.\n\n“A bailout — as done for The DAO in 2016 — provides a one-off short-term relief,” Drake said. But avoiding such situations can benefit us more in the long run, as it builds trust and fairness, he added.\n\nThe DAO hack, and the subsequent action taken by leading Ethereum figures, led to a split in the Ethereum community, with those opposed to the hard fork continuing to support the original, un-forked chain, which came to be known as Ethereum Classic.\n\nEthereum Classic's total value locked, a metric for investor deposits in DeFi\n\nThere’s little appetite left among the community to engage in another bailout of that sort.\n\n“Social consensus is necessary to fix consensus bugs and vulnerabilities. It is also useful to incorporate consensus-layer innovations like proof-of-stake, EIP-1559, and dankscaling,” Drake told DL News.\n\n“Despite its necessity and utility, it is wise to minimise dependency on social consensus,” he said. “Indeed, social consensus is an expensive tool.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LnNpbXBsaWxlYXJuLmNvbS90dXRvcmlhbHMvYmxvY2tjaGFpbi10dXRvcmlhbC93aGF0LWlzLXNvbGlkaXR5LXByb2dyYW1taW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "What Is Solidity Programming in Ethereum - Simplilearn",
        "content": "Dapps otherwise referred to as Decentralized Applications are applications built on the open-source, peer-to-peer network of Ethereum Blockchain which uses smart contracts and front-end user interfaces to create decentralized platforms.\n\nDeveloping a Dapp, like any other app, requires programming and executing code on the system. Solidity programming stands apart from the other programming languages and is the programming language of choice in Ethereum.\n\nSolidity is a brand-new programming language developed by Ethereum, the second-largest cryptocurrency market by capitalization.\n\nSo if you are interested in exploring more about Solidity Programming and its concepts, then you are at the right place. In this tutorial on Solidity Programming, you will cover various important components of Solidity Programming.\n\nEnhance your programming prowess with Simplilearn's cutting-edge computer programming courses. Get started today!\n\nWhat is Solidity Programming?\n\nSolidity is an object-oriented programming language created specifically by the Ethereum Network team for constructing and designing smart contracts on Blockchain platforms.\n\nIt's used to create smart contracts that implement business logic and generate a chain of transaction records in the blockchain system.\n\nIt acts as a tool for creating machine-level code and compiling it on the Ethereum Virtual Machine (EVM).\n\nIt has a lot of similarities with C and C++ and is pretty simple to learn and understand. For example, a “main” in C is equivalent to a “contract” in Solidity.\n\nLike other programming languages, Solidity programming also has variables, functions, classes, arithmetic operations, string manipulation, and many other concepts.\n\nEvolution of Solidity Programming Solidity is a relatively new language that is rapidly growing. Solidity is currently the core language on Ethereum and other private blockchains operating on competing platforms, such as Monax and its Hyperledger Burrow blockchain which uses Tendermint for consensus.\n\nSWIFT has created a proof of concept that runs on Burrow and uses Solidity.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program What are EVM and Smart Contracts? EVM or Ethereum Virtual Machine The Ethereum Virtual Machine (EVM) provides a runtime environment for Ethereum smart contracts.\n\nIt is primarily concerned with ensuring the security and execution of untrusted programs through the use of an international network of public nodes.\n\nEVM is specialized in preventing Denial-of-Service attacks and certifies that the programs do not have access to each other's state, as well as establishing communication, with no possible interference. Smart Contracts Smart contracts refer to high-level program codes compiled into EVM before being posted to the Ethereum blockchain for execution.\n\nIt enables you to conduct trustworthy transactions without the involvement of a third party; these transactions are traceable and irreversible.\n\nProgramming languages commonly used to create and write smart contracts are Serpent, Solidity, Mutan, and LLL.\n\nData Types of Solidity Programming It supports all the common data types seen in other OOP languages, such as, Boolean - The Boolean data type returns ‘1' when the condition is true and ‘0' when it is false, depending on the status of the condition.\n\nInteger - You can sign or unsign integer values in Solidity. It also supports runtime exceptions and the ‘uint8' and ‘uint256' keywords.\n\nString - Single or double quotes can denote a string.\n\nModifier - Before executing the code for a smart contract, a modifier often verifies that any condition is rational.\n\nArray - The syntax of Solidity programming is like that of other OOP languages, and it supports both single and multidimensional arrays. Apart from that, Solidity programming allows you to \"Map\" data structures with enums, operators, and hash values to return values stored in specific storage places.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program How to Get Started With Solidity Programming? Version Pragma Pragmas are directives to the compiler about how to handle the code. Every line of solidity source code should begin with a \"version pragma,\" which specifies which version of the solidity compiler to use.\n\nThis prevents the code from being incompatible with future compiler versions that may introduce changes. The Contract Keyword The contract keyword declares a contract that encapsulates the code. State/Declare Variables State variables are written on the Ethereum Blockchain and are permanently maintained in contract storage.\n\nThe line uint public var1 declares a state variable of type uint named var1 (unsigned integer of 256 bits), it is very similar to adding a slot in a database. A Function Declaration This is a function named “set” of access modifier type public which takes a variable a and variable b of data type uint as a parameter.\n\nThis was an example of a simple smart contract that updates the value of var1 and var2. Anyone with access to the Ethereum blockchain can use the set function to change the value of var1 and var2.\n\nBy adding the values of the variables var1 and var2, it can calculate the variable sum.\n\nIt will retrieve and print the value of the state variable sum using the “get” function.\n\nHow to Execute the Code You can execute a Solidity Program in two ways - Offline Mode Online Mode Offline Mode To operate a Solidity smart contract in Offline mode, it must meet three conditions and follow four essential actions: Conditions Download and install node.js. Install Truffle globally. Install ganache-cli. Actions Create a truffle project and set up a development network for it. Develop and deploy a smart contract for it. From the Truffle console, interact with the smart contract. Create tests to evaluate Solidity's primary features. Online Mode In the Online Mode, the Remix IDE is typically used to compile and run Solidity smart contracts. Remix IDE\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program Advantages of Solidity Programming Apart from the primary functionality of Solidity Programming, there are many other features provided by Solidity programming that cause it to have an edge over other Ethereum based languages. Apart from fundamental data types, Solidity programming also allows complex data types and member variables.\n\nIt provides an Application Binary Interface (ABI) to enable type safety. If the compiler discovers a data type mismatch for any variable, the ABI generates an error.\n\nIt refers to the ‘Natural Language Specification,' which is used to turn user-centric specifications into language that machines can understand. Decipher the global craze surrounding Blockchain with the Blockchain Certification Training Course. Get trained today."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LmdvYmFua2luZ3JhdGVzLmNvbS9pbnZlc3RpbmcvY3J5cHRvL2V0aGVyZXVtLTItMC_SAUFodHRwczovL3d3dy5nb2JhbmtpbmdyYXRlcy5jb20vaW52ZXN0aW5nL2NyeXB0by9ldGhlcmV1bS0yLTAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "What Is Ethereum 2.0? What You Should Know - GOBankingRates",
        "content": "What Is Ethereum 2.0? What You Should Know\n\nCapuski / Getty Images\n\nEthereum 2.0 was the next level of blockchain technology and cryptography. Though Eth2 is no longer the terminology used, Ethereum isn’t sitting idle. Ethereum, however, isn’t sitting idle. It’s altering its state as time goes on.\n\nIs Ethereum 2.0 Ever Coming Out?\n\nEthereum 2.0 — referred to as the Ethereum upgrades — consisted of three core steps, two of which were completed. The third step was deemed no longer necessary as other technology was developed faster than expected. While the Ethereum 2.0 upgrades no longer carry the name, the Ethereum ecosystem still has a long-term roadmap in place: Innovations to the ecosystem are making it more scalable, secure and sustainable.\n\nEthereum 2.0 consisted of three core steps, two of which were completed:\n\nLaunch of the Beacon Chain — complete The Ethereum Merge — complete Ethereum Sharding — replaced by layer 2 rollups\n\nStep 1: Ethereum Beacon Chain\n\nThe Beacon Chain was the first stage of migrating Ethereum from a proof-of-work mechanism to proof-of-stake. It was a test to ensure PoS was a sustainable way forward for Ethereum’s blockchain before its introduction to the ecosystem. When the test proved successful, the PoS mechanism worked alongside the previous PoW system as the next phase began developing.\n\nStep 2: Ethereum Merge\n\nThe Ethereum Merge followed the introduction of the Beacon Chain and combined the blockchain data collected since Ethereum’s inception with the data collected on the Beacon Chain, creating one mechanism dedicated to the PoS consensus.\n\nInvesting for Everyone\n\nBefore the Merge, PoS and PoW co-existed, but the purpose of the Merge was to eliminate the need for PoW. The overarching goal is to end energy-intensive mining. Additional benefits include reduced environmental damage, increased scale usability and improved security.\n\nWhile PoW still exists, it has been altered so that it’s no longer profitable for miners to use it. Post-Merge, it’s estimated that the amount of energy used for Ethereum decreased by 99.95%. Using Bitcoin’s energy consumption as a comparison, estimated to be around 150 terawatt-hours per year — equivalent to the amount of electricity Argentina expends annually — the Ethereum Merge works as a far more energy-efficient monetary system.\n\nStep 3: Ethereum Sharding — Layer 2 Rollups\n\nThe last step of the original Ethereum upgrades roadmap, Sharding has been dropped from the roadmap thanks to the quick development of another tool of scalability: layer 2 rollups. While the previous stages focused on security and sustainability, Ethereum Sharding was designed to concentrate on scalability and encourage network participation.\n\nLayer 2 rollups are a different approach to scalability. It refers to taking hundreds of transactions completed on layer 2 — a secondary blockchain of Ethereum — and “rolling up” or bundling them into one transaction on layer 1, which is Ethereum’s base blockchain. This process has been able to provide scaling without the step of sharding.\n\nWhat Is Sharding? Sharding divides data into smaller subsets, making it easier for a network to handle. This isn’t a new concept — it’s an ideal frequently shared in the computer science industry and seeks to reduce transaction times and network congestion on the blockchain. The belief is that increasing data availability removes the need for expensive computing hardware. Therefore, anyone with a regular phone or laptop will be able to contribute to securing the network.\n\nInvesting for Everyone\n\nEthereum’s New Roadmap\n\nWhile Ethereum 2.0 is no longer the accepted term, that doesn’t mean Ethereum has stopped developing. ETH now breaks its roadmap into four categories:\n\nCheaper transactions: The current effort to reduce fees is focused on reducing data storage costs through Proto-Danksharding — moving data from Ethereum to temporary storage. Extra security: Planned improvements to Ethereum’s security include increasing liquidity, protecting users from spam attacks and from failures in the network, hardware and software. Better user experience: Ethereum is aiming to make itself easier to use through protection for lost or stolen wallet keys and making nodes more accessible for the less tech-savvy. Future proofing: To keep itself both relevant and reliable, Ethereum is developing upgrades to protect the network from anticipated future threats.\n\nOther Effects of the Ethereum 2.0 Upgrade\n\nEthereum 2.0, while it was called that, brought up a number of questions beyond the basics outlined in its roadmap.\n\nWill Ethereum 2.0 Be a New Coin?\n\nThere is no new coin or crypto resulting from Ethereum 2.0 upgrades. One of the main reasons developers changed the wording from “Ethereum 2.0” to “Ethereum upgrades” is to avoid that confusion.\n\nThose holding ethereum, or ETH, do not need to take any action. ETH can still be used in the same manner as always: trading, staking, exchanging and other usual functions.\n\nBinance issued a warning that anyone asking users to buy “ETH2” tokens may be a scammer. Any contact suggesting funds need to be sent to an unknown third party should be ignored. Crypto scams are prevalent, and holders of digital assets must remain skeptical of suspicious activity.\n\nInvesting for Everyone\n\nDid Ethereum 2.0 Reduce Gas Fees?\n\nThe Merge was not expected to reduce gas fees in any meaningful way. However, as Ethereum updates continue, lower gas fees — and quicker transactions — are expected to follow.\n\nDid Ethereum 2.0 Replace Ethereum?\n\nThe move to Ethereum 2.0 does not affect the ethereum that people currently hold. Each ethereum token is no different from before, and the Ethereum blockchain was upgraded, not replaced.\n\nEthereum 2.0 was simply an upgrade that gave the community of ethereum holders the option to earn yield from the proof-of-stake model. Participants can receive a percentage reward in exchange for using their ethereum to secure the network.\n\nIn fact, some analysts predict that the upgrades will increase ETH’s price in the long term, though that remains to be seen.\n\nInsiders Weigh In on Ethereum 2.0\n\nA key Ethereum researcher, Justin Drake, told Time that Ethereum 2.0 “dramatically increases the security of Ethereum.” In his words, the upgrade will make it far more challenging to make any attacks on the Ethereum ecosystem.\n\nCo-founder of Ethereum, Vitalik Buterin, also made his feelings known following the successful Merge. He took to Twitter in September 2022, proclaiming that the event will cut “worldwide electricity consumption by 0.2%.”\n\nFinal Take\n\nEthereum’s 2.0 upgrades promised to create positive results and appear to be succeeding so far. Decreasing Ethereum’s energy consumption by 99.95% is a significant step toward ensuring cryptocurrency’s place in an environmentally conscious future.\n\nWhile ethereum is still far from its previous peaks, that isn’t necessarily a reflection on the upgrades — cryptocurrency as a whole remains in a bear market for the time being. Once the market turns, Ethereum could be a focus of interest for investors and crypto technology enthusiasts alike.\n\nInvesting for Everyone\n\nBefore making any investment decisions, remember that the cryptocurrency market is volatile. It may be a good idea to consult with a financial professional before investing in any crypto assets.\n\nFAQ Here are some questions people ask about the Ethereum 2.0 upgrades. Is Ethereum 2.0 the final upgrade? No – the Ethereum upgrades are a continual process. The major steps of the Beacon Chain and the Ethereum Merge are now complete. More upgrades occurred in April 2023, and further upgrades such as staking withdrawals are expected later this year.\n\nIs ethereum a good investment? As far as cryptocurrency goes, ethereum is one of the better investments because of its continuous development and wider use cases. However, the price ethereum will command in the future is unknown. Finder, a fintech specialist, estimates ethereum will be worth $14,814 by late 2030. For now, while crypto as a whole has not yet left its bear market, recent upward moves may show promising signs for the future.\n\nWhen did the Ethereum Merge happen? The Ethereum Merge was completed on Sept. 15, 2022, solidifying the move to PoS consensus.\n\nIs it better to buy ethereum or ethereum 2.0? There is no way to buy ETH2 because it is the same as ETH. Ethereum's upgrades did not and will not result in a new token. In fact, anyone attempting to sell ETH2 tokens is probably a scammer – or got scammed themselves.\n\nHere are some questions people ask about the Ethereum 2.0 upgrades.\n\nChris Ozarowski and Amber Barkley contributed to the reporting for this article.\n\nInformation is accurate as of May 26, 2023, and is subject to change."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9uby1ldGgtdG8tdHJhZGUtZXRoZXJldW0tZXhjaGFuZ2UtYmFsYW5jZS1kcm9wcy10by1hLTUteWVhci1sb3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "No ETH to trade? Ethereum exchange balance drops to a 5-year low - Cointelegraph",
        "content": "The balance of available Ether (ETH) across crypto exchanges dropped to a five-year low on May 26, bringing the total amount of Ether held on exchanges to 17.86 million. A drastic decline in the exchange supply of ETH like this has not been seen since April 2018.\n\nAccording to Glassnode data, only 14.85% of the total Ether supply is currently held on centralized exchanges, compared with the 25–26% of supply held during the 2021 bull run.\n\nThe decline in Ether exchange balances. Source: Glassnode\n\nThe drop in ETH supply began in September 2022, dropping significantly after the FTX crisis in November. Apart from a decline in the exchange balance, Ethereum wallet addresses holding more than 100 ETH have also declined to a six-month low.\n\nTwo significant events could have influenced the decline in ETH balances on centralized exchanges in the recent past. The first is the collapse of the FTX crypto exchange, prompting many to move their crypto assets from exchange wallets to self-custody wallets; the second, and most important, is the Shapella upgrade.\n\nShapella made way for thousands of validators to withdraw their staked ETH. However, contrary to popular belief, a minority of validators decided to unstake, while the majority only withdrew their staking rewards.\n\nThe movement of assets away from exchanges is considered a bullish sign, indicating traders are not looking to sell at the current price. In Ethereum’s case, re-staking ETH is the most apparent reason for the declining exchange supply.\n\nRelated: Ethereum price metrics hint that ETH might not sell off after the Shapella hard fork\n\nMajor crypto exchanges like Binance, Bitfinex, Kraken and others that supported the Shapella upgrade saw a significant outflow of ETH from their exchange wallets, leading to the current balance decline.\n\nETH withdrawal from crypto exchanges. Source: Nansen\n\nAs Cointelegraph reported earlier, in the week after the Shapella upgrade, the amount of ETH being staked surpassed the amount of ETH being withdrawn. Another report from Glassnode estimated that less than 1% of staked ETH was expected to be sold. Thus, a significant chunk of ETH moving away from centralized exchanges returned to staking.\n\nMagazine: 2023 is a make-or-break year for blockchain gaming: Play-to-own"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjYvZXRoZXItYmFsYW5jZS1vbi1leGNoYW5nZXMtbmVhcnMtYWxsLXRpbWUtbG93L9IBXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjYvZXRoZXItYmFsYW5jZS1vbi1leGNoYW5nZXMtbmVhcnMtYWxsLXRpbWUtbG93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Ether Balance on Exchanges Nears All-Time Low - CoinDesk",
        "content": "This article was written and edited by CoinDesk journalists with the sole purpose of informing the reader with accurate information. If you click on a link from Glassnode, CoinDesk may earn a commission. For more, see our Ethics Policy."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vZXRoZXJldW0tZGlmZmljdWx0eS1ib21i0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "What's Ethereum Difficulty Bomb? - OKX",
        "content": "Vitalik Buterin, the mastermind behind Ethereum, envisioned a genuinely decentralized global computer for everyday use using blockchain technology. Inspired by the Bitcoin network but seeing its limitations, he created Ethereum. Buterin built the Ethereum blockchain with a ticking time explosive called the Ethereum Difficulty Bomb.\n\nThere are many stages in the roadmap to building a supercomputer. Even though the end goal is clear, sometimes, Ethereum developers need to develop new tech from scratch to advance to the next stage. The Ethereum Difficulty Bomb was an internal mechanism to encourage ETH core developers to push through to the Merge. The Merge is where Ethereum finally progressed from a proof of work (POW) consensus mechanism to proof of stake (POS). This article explains the Ethereum Difficulty Bomb, how it benefitted the ETH blockchain, and the future of Ethereum upgrades post the Merge. But before we dive into our main topic, we need to cover the origins of Ethereum.\n\nOrigins of the Ethereum blockchain\n\nIn 2013, Buterin launched the Ethereum whitepaper. He proposed an alternative blockchain to Bitcoin that goes beyond transaction-only capabilities. Branding Ethereum as the first ¨altcoin¨. From conception to launching the genesis block took two years. Ethereum officially launched in July 2015.\n\nIn between, the project attracted a series of crypto legends to the founding team. One was Charles Hoskinskins, who served as a Chief Executive before leaving in 2014 to start Cardano (ADA). Another was Gavin Wood, who served as the Chief Technology Officer for the Ethereum network. Gavin left Ethereum in 2016 to start Polkadot (DOT).\n\nWhile the above may describe some interpersonal issues between the founding forefathers of Ethereum, the network's blockchain also faced technical issues.\n\nProblems with Ethereum 1.0 network\n\nThe first version of the Ethereum design was similar to Bitcoin, except that it could execute smart contracts. The network used PoW consensus mechanisms to validate transactions. Proof of work consensus mechanics is energy intensive and requires a lot of hash rate to process transactions. The network soon ran into several scaling issues as it gained popularity.\n\nIn its initial simplistic design, the Ethereum mainnet nearly buckled under the pressure. Enthusiastic users piled on smart contract activities such as initial coin offerings (ICOs), decentralized finance (DeFi) platforms, and NFTs, which led to significant network congestion.\n\nTwo years later, by the end of 2017, Ethereum faced the following challenges: High gas fees, Low transactions per second (TPS), and high energy consumption (see the chart below). These challenges in scaling the Ethereum blockchain bring us to the discussion of our main topic.\n\nThe Ethereum difficulty bomb\n\nReturning to the vision of building a global supercomputer, the cofounders of Ethereum anticipated the challenges the network would face when onboarding more users. By folly or ingenuity, they ingrained the Ethereum Difficulty Bomb protocol in block no.200000 of the network.\n\nThe Ethereum difficulty bomb had the sole purpose of exponentially increasing the difficulty of mining Ethereum. Since proof of work requires solving computational puzzles to process transactions, the difficulty bomb protocol would make these puzzles nearly impossible.\n\nEthereum developers engineered the protocol so that mining a block would eventually become too expensive and consume so much energy that no one would want to mine it. Hence bringing forth the Ethereum' ice-age. The idea was to start a chain reaction that would accelerate the developers to speed up the network's transition to proof of stake.\n\nWhile this may seem counterintuitive at first glance, triggering the difficulty bomb presented several benefits for the network.\n\nBenefits of the Ethereum difficulty bomb\n\nBesides purposefully lighting up a fire under Ethereum developers to speed up the transition to proof of stake, the difficulty bomb also had the following intended consequences:\n\nIncreasing the difficulty in solving puzzles encouraged cryptocurrency miners to move away from energy-intensive proof of work consensus mechanisms.\n\nIt also discouraged Ethereum blockchain forks. As a result of puzzles ultimately becoming impossible to solve, no miner could profitably continue using the proof of work network once the whole blockchain had transitioned to proof of stake.\n\nUltimately, the protocol sped up the transition process, forcing miners to upgrade their nodes on time. However, achieving the feat required overcoming a few hurdles.\n\nDelaying the Ethereum difficulty bomb\n\nTransitioning to proof of stake took Ethereum a total of seven years to achieve. According to its initial set-up, around September 2015, at block 200,000, the difficulty bomb triggered, increasing the difficulty exponentially. However, its effects only became apparent about a year later, in November 2017.\n\nEthereum developers scrambled as the time frame to proof of stake narrowed. As proof of work mining became more complex, processing transaction fees on the network also required higher gas fees. Responding to the ETH communities’ complaints about expensive transaction fees, they conducted a series of updates which improved the network. These upgrades pushed back the date of the Merger and delayed the difficulty bomb.\n\nEthereum underwent a total of six upgrades, and they are as follows:\n\n2017: Byzantium update\n\nThe Byzantium hard fork implementation, made Ethereum lighter, faster, and more secure. Additionally, it created the framework for the eventual switch to the proof of stake consensus mechanism.\n\n2019: Constantinople update\n\nLike the Byzantium update, the Constantinople hard fork implementation increased efficiency and speed. It also lowered the gas fees on the network.\n\n2020: Muir Glacier update\n\nThe Muir Glacier network upgrade effectively delayed the difficulty bomb for another 4,000,000 blocks or approximately 611 days, buying Ethereum developers another year.\n\n2021: London update\n\nThe London Hard Fork introduced new improvements to the network. Similarly to the Byzantium and Constantinople upgrades, its purpose was to make some preparations before the release of Ethereum 2.0.\n\n2021: Arrow Glacier update\n\nArrow Glacier delayed the network's difficulty bomb, allowing developers more time to prepare Ethereum 2.0.\n\n2022: Gray Glacier\n\nThe Gray Glacier was the last delay. Its sole purpose was to postpone the bomb's detonation by another 100 days.\n\nThe Merge: transitioning from PoW to PoS\n\nIn September 2022, the much-anticipated event of transitioning from proof of work to a proof of stake network finally occurred. ETH developers successfully brought about the new version of Ethereum, also referred to as Ethereum 2.0. Ethereum 2.0 uses proof of stake consensus mechanisms to validate transactions.\n\nThe staking process entails locking up 32 Ethereum tokens in return for participating in the network's consensus and validation measures. Users who stake their tokens are known as validators and receive rewards through fees paid in ETH.\n\nThe transition could not have come at a better time, as the focus on global climate change intensified. By doing away with the proof of work consensus mechanism, Ethereum 2.0 will result in a 99.95% reduction in Ethereum's energy consumption. The transition to proof of stake also removed the need for the Ethereum difficulty bomb, as computational power is no longer needed to process transactions.\n\nThe Ethereum Merge was a huge stepping stone for the Ethereum blockchain to become the supercomputer that Buterin imagined. But while it accomplished a lot, it is only the beginning of the blockchain's roadmap.\n\nFuture of Ethereum upgrades\n\nSo now that the Ethereum blockchain is free from the existential threat of the difficulty bomb, what comes next post-Merge? Last year, Buterin commented that the network would only be 55% completed after the Merger. He also shared the roadmap for the upcoming upgrades that stand in the way of the blockchain becoming the first global supercomputer. They are as follows:\n\nThe Shanghai upgrade\n\nThe Shanghai upgrade’s most notable change is to allow validators to withdraw their staked ETH tokens. It will also upgrade some network parts to improve scaling, efficiency and speed. Speculators predict that this event could prompt a mass liquidation or lead to a surge in new users.\n\nThe Surge\n\nAfter the Shanghai upgrade, the Surge will occur. It entails implementing ¨sharding¨. Sharding is splitting the blockchain into smaller chains called shards. The upgrade will improve the network’s scalability, gas costs, and transaction speeds.\n\nThe Verge\n\nAfter the Surge, the Verge will occur. The Verge upgrade aims to optimise storage on the Ethereum blockchain. It will implement ¨Verkle Trees¨, a structure that seeks to reduce the amount of data network validators must keep on their machines. Ultimately, this will also help make Ethereum more scalable.\n\nThe Purge\n\nAfter the Verge, the Purge will occur. As implied by its name, this upgrade will help ¨purge¨ or reduce the space required to store ETH on a hard drive. This stage aims to support freeing up space so more developers can easily build on the blockchain.\n\nThe Scourge\n\nAfter the Purge, the Scourge will occur. The Scourge is aimed at providing censorship resistance and avoiding centralisation. The upgrade will ensure reliable and fair credibility-neutral transaction inclusion on the Ethereum blockchain.\n\nThe Splurge\n\nFinally, the Splurge will occur. This upgrade will comprise a series of smaller updates to ensure the Ethereum network functions properly after the previous four significant updates. It will combine several upgrade suggestions that didn't fit the other upgrades and put the finishing touches on the plan for enhancing the blockchain.\n\nThe new Ethereum\n\nIn the last few years, Ethereum has upgraded its blockchain multiple times. Protocols that used to plague the network, such as the Ethereum difficulty bomb, are no longer relevant in the new network. With all of these upgrades, Buterin says that Ethereum will be able to process 100,000 transactions per second (TPS).\n\nThat will put Ethereum miles ahead of Visa and Mastercard, which can only process around 24000 TPS and 5000 TPS. As of now, there’s no concrete schedule for these upgrades, but we can expect completion by about 2025.\n\nFAQs\n\nWhy is ETH difficulty increasing?\n\nETH difficulty has stopped increasing. Since the Ethereum blockchain moved from POW to POS in 2022, the difficulty rate has remained 1.00.\n\nWhat is the Ethereum difficulty bomb?\n\nThe Ethereum difficulty bomb is a protocol ingrained in the blockchain’s network to exponentially increase the difficulty in mining ETH when using a proof of work mechanism. Its purpose was to speed up the network’s transition to proof of stake and discourage the forking of the network.\n\nWhy Ethereum needed a difficulty bomb?\n\nEthereum needed a difficulty bomb for several reasons, but the main one was to force miners to switch over to proof of stake by disincentivising the proof of work mechanism.\n\nWhat is the use of a difficulty bomb?\n\nIn the Ethereum network, the difficulty bomb was programmed to increase mining difficulty starting at block 200,000. It increased the block time necessary for completing puzzle solutions. It also caused lower ETH payouts for proof of work miners."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8xNDI1MDcvZXRoZXJldW0tYml0Y29pbi1iYWxhbmNlcy1leGNoYW5nZXMtZWRnZXMtNS15ZWFyLWxvd3PSAVVodHRwczovL2RlY3J5cHQuY28vMTQyNTA3L2V0aGVyZXVtLWJpdGNvaW4tYmFsYW5jZXMtZXhjaGFuZ2VzLWVkZ2VzLTUteWVhci1sb3dzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Ethereum, Bitcoin Balances on Exchanges Edges Toward 5-Year Low - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe amount of Ethereum on centralized exchanges has nearly hit a five-year low, per data from Glassnode.\n\nWith 17.8 million ETH on exchanges, the sum represents 14.85% of the network’s total token supply.\n\nThough large, it’s significantly less than the peak value of 30% reached in the summer of 2020.\n\nAD\n\nAD\n\nVolatile cryptocurrencies, like Bitcoin and Ethereum, leaving centralized exchanges are sometimes seen as a bullish sentiment among investors. Conversely, an influx of cryptocurrencies to exchange is viewed as bearish, as it suggests that investors are moving to these platforms to sell off some of their holdings.\n\nEthereum balance on exchanges. Source: Glassnode .\n\nBitcoin’s stats show much of the same, with the cryptocurrency’s exchange balance dropping to levels not seen since March 2018 at just above 2.23 million BTC.\n\nWhy are investors leaving exchanges?\n\nA closer look at the data reveals that the majority of the decline came in November and December 2022 following the FTX collapse. The stacked balance metric from Glassnode, which shows the individual balance on each exchange, confirms that a significant portion of the decline came from FTX.\n\nAn exodus followed shortly across other major exchanges such as Binance, Kraken, and Coinbase likely due to the contagion fears that spread across the market. This was also seen in the steep spike in sales for hardware wallet providers such as Ledger and Trezor.\n\nThe latest decline in Ethereum balances on exchanges in May also coincides with a rise in staking. The amount of staked ETH surged from 19.3 million before the Shapella upgrade to 21.2 million, rising vertically since the start of May, per Nansen data.\n\nAD\n\nAD\n\nBitcoin’s exchange balance did not decline alongside ETH during the same period, further suggesting that staking played a role in exchange withdrawals."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8venljcnlwdG8uY29tL3Zpc2EtZXhwbG9yZXMtdGhlLXBvdGVudGlhbC1vZi1zbWFydC1jb250cmFjdHMtZm9yLXBheW1lbnRzLXdpdGgtZXRoZXJldW0v0gFjaHR0cHM6Ly96eWNyeXB0by5jb20vdmlzYS1leHBsb3Jlcy10aGUtcG90ZW50aWFsLW9mLXNtYXJ0LWNvbnRyYWN0cy1mb3ItcGF5bWVudHMtd2l0aC1ldGhlcmV1bS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "VISA Explores the Potential of Smart Contracts for Payments with Ethereum - ZyCrypto",
        "content": "Advertisement\n\nGlobal financial services behemoth VISA recently shared a range of significant milestones in its ongoing pursuit of digital asset payments and seamless crypto onboarding.\n\nIn a blog titled “Rethinking Digital Transactions with Account Abstraction” earlier this week, the firm disclosed it is now exploring how gas fees can be redesigned using Account Abstraction on the Ethereum blockchain, enabling secure and automatic payments for self-custodial wallets. It then added that it is deeply engaged in studying Ethereum’s proposal ERC-4337 for digital payments.\n\nRolled out on the Ethereum mainnet in early March, ERC-4337 is a key component of VISA’s exploration, as it adds the ability for smart contracts to transact on behalf of the user.\n\nThe firm also noted that it has successfully deployed two sets of Paymaster contracts on the Ethereum Goerli testnet, a move aimed at showcasing the potential for redesigning gas fees on the blockchain to improve user convenience. Mustafa Bedawala of Visa’s crypto department observed that the firm’s first paymaster contract is focused on investigating whether users can pay transaction fees with alternative tokens, like dollar stablecoins or, potentially, CBDCs apart from ETH.\n\n“To transact on the Ethereum blockchain today, a user needs to acquire ETH to pay for gas fees; similarly, to transact on Polygon blockchain, a user needs to acquire the native token MATIC. Is there a solution that eliminates the need to accumulate a different range of native blockchain tokens solely for the purpose of paying for gas?” wrote Visa.\n\nAdvertisement\n\nThe other paymaster contract is aimed at completely covering gas fees for user transactions, addressing a major pain point in the crypto space.\n\n“Account Abstraction offers a solution by allowing users to bypass these costs if a third party, such as a fintech wallet provider, is willing to cover them. In this case, the wallet provider or dApps can act as Paymasters, covering gas fees for users and significantly reducing friction. The ERC-4337 Paymaster concept can be a potential way to incentivize user adoption by making it free for users to transact through their wallet platform,” the firm added.\n\nEthereum co-founder Vitalik Buterin has previously expressed his longstanding interest in gas fees Account Abstraction, calling it a dream of the Ethereum developer community. Buterin recommends the use of social recovery wallets and multi-signature wallets for crypto investors to achieve self-custody of their assets.\n\nThus, with the imminent implementation of ERC-4337 and the emergence of smart contract wallets, wallet security, as well as payments, are expected to improve significantly for VISA users opening doors to wider adoption of cryptocurrencies."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWJhbGFuY2Utb24tY3J5cHRvLWV4Y2hhbmdlcy1mZWxsLTUteXItbG93LWV0aC1wcmljZS10by1yaXNlLW9yLWZhbGwv0gFmaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tYmFsYW5jZS1vbi1jcnlwdG8tZXhjaGFuZ2VzLWZlbGwtNS15ci1sb3ctZXRoLXByaWNlLXRvLXJpc2Utb3ItZmFsbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Ethereum Balance On Crypto Exchanges Fell 5-Yr Low, ETH Price To Rise Or Fall? - CoinGape",
        "content": "Ethereum (ETH) balance on the crypto exchanges has reached a new five-year low. ETH withdrawals from exchanges outpaced in 2023 as investors anticipate massive upside movement in ETH price. The move is triggered by an increase in ETH staking, which has surprisingly increased after the Shanghai upgrade on April 12. Will ETH price rise or fall under these conditions?\n\nEthereum Balance on Exchanges Drops to 16 Million Ether\n\nCryptoQuant data indicates that the total amount of ETH held in the crypto exchanges has dropped to critical levels. ETH on exchanges now stands at almost 16 million, reaching levels not recorded since July 2018. It has declined 50% since the all-time high.\n\nadvertisement\n\nEthereum reserves on crypto exchanges have decreased since mid-2020 but the rate of decline picked pace in September 2022 as the Ethereum network transitioned to proof-of-stake (PoS) with the Merge upgrade.\n\nEtherscan data shows 22.98 million ETH worth $41 million is currently staked on the Beacon Chain.\n\nAlso Read: Binance Suspends Crypto Deposits As Multichain CEO Remains Missing\n\nWill Ethereum Price Fall Below $1700?\n\nTypically, low exchange reserves indicate less selling pressure and bullish momentum. Low supply in the market will cause ETH price to rise.\n\nETH price is up by small 0.5% in the past 24 hrs, with the price currently trading above the $1800 level. The 24-hour low and high are $1782 and $1817, respectively. The volatility remains lower and trading volumes has declined after the upgrade, bringing stability to ETH price.\n\nAlso Read: Ethereum Client Releases Major Upgrade To End PoW Support, ETH Price Jumps\n\nEarlier, as reported by CoinGape Markets, defending the $1700 support is must for ETH bulls. Losing this support will signal a continuation of the correction and price may crash to $1400. From the local top at $2138, price got rejected at trendline resistance of wedge pattern and is currently at a crucial support range of $1740-$1714."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3Lm5mdGN1bHR1cmUuY29tL25mdC1uZXdzL2JpdGNvaW4tZW1lcmdlcy1hcy1zZWNvbmQtbGFyZ2VzdC1uZnQtYmxvY2tjaGFpbi1jaGFsbGVuZ2luZy1ldGhlcmV1bXMtZG9taW5hbmNlL9IBe2h0dHBzOi8vd3d3Lm5mdGN1bHR1cmUuY29tL25mdC1uZXdzL2JpdGNvaW4tZW1lcmdlcy1hcy1zZWNvbmQtbGFyZ2VzdC1uZnQtYmxvY2tjaGFpbi1jaGFsbGVuZ2luZy1ldGhlcmV1bXMtZG9taW5hbmNlLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Bitcoin Emerges as Second-Largest NFT Blockchain, Challenging Ethereum’s Dominance - NFT Culture",
        "content": "The year 2023 is shaping up to be a defining moment for Bitcoin Ordinals, as the world’s first blockchain solidifies its position in the NFT market. While Ethereum has long held the top spot in terms of market capitalization, Bitcoin is now steadily climbing the ranks, vying to become the leading NFT blockchain. In fact, it has already secured the second position, demonstrating a rapid rise in popularity.\n\nBitcoin’s NFT Sales Surge\n\nBitcoin has made significant strides in the NFT space, as reported by the NFT industry data aggregator CryptoSlam. It has not only secured a spot among the top ten all-time NFT blockchains by sales volume but has also witnessed a remarkable surge in revenue over the past month. During this period, Bitcoin’s NFT sales volume surpassed that of its competitors, including Solana, with an impressive $169 million. Although Ethereum still holds the top spot with around $393 million, Bitcoin’s ascent is undeniable.\n\nBitcoin’s success in the NFT market is not solely attributed to uncategorized Ordinals. Various organized collection efforts have found success on the blockchain, notably Space Pepes and Bitcoin Frogs. These collections alone generated substantial sales volumes of $12 million and $9.6 million, respectively, in the past 30 days. Major brands and historical projects have also found a home on the Bitcoin blockchain, solidifying its position among the top NFT sales leaders.\n\nChallenging Ethereum’s Dominance\n\nWhile Ethereum’s position as the leading NFT blockchain is formidable, Bitcoin is gradually closing the gap. Ethereum has processed a staggering $390 million worth of on-chain NFT transactions in the last 30 days, while Bitcoin is approaching half that figure. This remarkable progress is a testament to the explosive popularity of Ordinals, which have transformed Bitcoin into a hub for art, movies, collectibles, tickets, and even video games.\n\nUnderstanding Bitcoin Ordinals and Inscriptions\n\nBitcoin’s Ordinals protocol, developed by Casey Rodamor, assigns serial numbers to individual satoshis, the smallest unit of bitcoin. These serial numbers, similar to speciality serial numbers on dollar bills, have driven tremendous transaction fees to miners. Ordinals have become so influential that NFT traders have co-opted the term, referring to NFTs inscribed on a satoshi as “ordinals” or “inscriptions.” Additionally, Bitcoin’s BRC-20 standard enables the creation of tokens attached to Ordinals, opening up possibilities for DeFi, tokenization, and experimentation directly on Bitcoin.\n\nWill the Bitcoin Boom continue?\n\nWhile Bitcoin’s ascent in the NFT market is impressive, surpassing Ethereum will require significant trading activity. Ethereum’s 38 million NFT transactions since inception dwarf Bitcoin’s 320,000. However, with the growing popularity of Ordinals, the number of Bitcoin NFTs continues to spike month after month. The concept of a “flippening,” where Bitcoin overtakes Ethereum as the leading NFT blockchain, might not be as far-fetched as it seems.\n\nBitcoin is emerging as a powerful contender in the NFT market, challenging Ethereum’s dominance. With its Ordinals gaining traction and a diverse range of collections finding success on the blockchain, Bitcoin has become the second-largest NFT blockchain. While Ethereum remains the frontrunner, the rapid rise of Bitcoin in NFT sales volume and its innovative use of Ordinals and inscriptions highlight its potential to reshape the NFT landscape. The future holds exciting possibilities for Bitcoin as it continues to make waves in the NFT space."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8yNy90b3AtY3J5cHRvLWFuYWx5c3Qtc2F5cy1vbmUtY2F0YWx5c3Qtd2lsbC1rZWVwLWxpdGVjb2luLXByb3BwZWQtdXAtdXBkYXRlcy1vdXRsb29rLW9uLWJpdGNvaW4tYW5kLWV0aGVyZXVtL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8yNy90b3AtY3J5cHRvLWFuYWx5c3Qtc2F5cy1vbmUtY2F0YWx5c3Qtd2lsbC1rZWVwLWxpdGVjb2luLXByb3BwZWQtdXAtdXBkYXRlcy1vdXRsb29rLW9uLWJpdGNvaW4tYW5kLWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Top Crypto Analyst Says One Catalyst Will Keep Litecoin ‘Propped Up’, Updates Outlook on Bitcoin and Ethereum - The Daily Hodl",
        "content": "A popular crypto trader is weighing in on the prospects of Litecoin (LTC), Bitcoin (BTC) and Ethereum (ETH) moving forward.\n\nStarting with Litecoin, the pseudonymous analyst Bluntz tells his 223,000 Twitter followers that the 14th-largest crypto asset by market cap is consolidating in readiness for what could be a breakout.\n\nAccording to Bluntz, the upcoming halving of Litecoin is likely to keep the altcoin bullish. Litecoin’s third halving is expected to occur in about two months.\n\n“Solid high timeframe contraction happening on LTC. I think the halving narrative keeps this one propped up.”\n\nLooking at the chart, it appears that the analyst is predicting a symmetrical triangle breakout for Litecoin en route toward his target above $110.\n\nLitecoin is trading at $86.96 at time of writing.\n\nTurning to Bitcoin and Ethereum, the pseudonymous analyst says that the two leading crypto assets could trade in a range for a while before breaking down. However, Bluntz says that the plunge could take some time.\n\n“So far, lows holding on both BTC and ETH.\n\nWouldn’t be surprised to see a more longer drawn-out channel/bear flag play out here, doesn’t quite look like a breakdown is imminent just yet.”\n\nBitcoin and Ethereum are trading at $26,471 and $1,814, respectively, at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWxpcXVpZGF0aW9ucy1tYWtlLTIwMDAtYS1waXBlLWRyZWFtL9IBTGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aWxsLWxpcXVpZGF0aW9ucy1tYWtlLTIwMDAtYS1waXBlLWRyZWFtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Ethereum: Will liquidations make $2000 a pipe dream - AMBCrypto News",
        "content": "Ethereum’s long positions face record-high liquidations, surpassing $58 million in May.\n\nDespite a slight price increase, Ethereum remains in a bearish trend around the $1,830 price range.\n\nEthereum’s [ETH] price has been trapped within the $1,800 price range for quite some time, but lately, we’ve witnessed a glimmer of hope with a modest surge. Unfortunately, even this slight upward movement hasn’t proven sufficient to safeguard certain traders’ positions from being forcefully liquidated.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nEthereum long liquidations hit monthly high\n\nGlassnode Alerts reported that the Mean Liquidated Volume in Ethereum Futures Contracts’ Long Positions peaked on 27 May. According to the observed chart, the average amount of Ethereum Futures Long Liquidations exceeded 32,000 ETH, equivalent to over $58 million at the press time valuation. This made it one of the highest ETH Futures Liquidations in May.\n\nIn futures contracts, the mean liquidated volume signifies the average number of contracts forcefully closed or liquidated due to traders’ inability to fulfill margin requirements. When engaging in long positions for Ethereum futures contracts, traders are speculating on the price of ETH increasing.\n\nHowever, if ETH falls below a specific threshold, traders’ accounts may lack sufficient funds to cover the losses, resulting in the unfortunate event of liquidation.\n\nEthereum’s 24-hour liquidation map\n\nExamining the Ethereum liquidation within a 24-hour timeframe revealed a notable amount of liquidation activity. According to CoinGlass, ETH experienced liquidations totaling $8.42 million in the past 24 hours.\n\nFurther analysis indicated that long positions witnessed liquidations amounting to $2.48 million, whereas short positions faced liquidations totaling $5.94 million.\n\nAs of this writing, long positions accounted for over $600,000 in liquidations, while short positions stood at over $500,000. Taking a broader perspective by examining the ETH liquidation chart, it becomes evident that long positions experienced more liquidations in May when compared to short positions.\n\nHow much are 1,10,100 ETHs worth today?\n\nObserving price swings in a daily timeframe\n\nAnalyzing Ethereum’s daily timeframe chart revealed a 1.26% increase in value at the close of trade on May 26. As of this writing, Ethereum was trading around $1,830, exhibiting a minor upward trend of less than 1%. Although ETH remained within a bearish trend, it was showing signs of weakening due to the recent modest growth it has experienced.\n\nNotably, the Relative Strength Index (RSI) line indicated that ETH was approaching the threshold of transitioning to a bullish trend."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2JyaWRnZS1hc3NldHMtZXRoZXJldW0tbWFpbm5ldC16a3N5bmMtZXJhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "How to Bridge Assets from Ethereum mainnet to zkSync Era? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The Ethereum mainnet is a widely used blockchain network for a variety of decentralized applications. The mainnet, on the other hand, has been engulfed by problems such as high gas fees and slow transaction times. To address these issues, the zkSync Era network was developed as a layer 2 solution that provides faster and less expensive transactions. This article will go over how to bridge assets from the Ethereum mainnet to the zkSync Era network.\n\nWhat is zkSync Era?\n\nZkSync Era is an Ethereum Layer-2 scaling solution that employs zero-knowledge (ZK) proofs to achieve high throughput and low fees. It is a general-purpose zk-rollup platform with virtually full EVM compatibility implemented in its zk-friendly proprietary virtual machine. It employs standard Web3 API and retains important EVM capabilities like as smart contract composability while offering novel notions such as native account abstraction.\n\nBecause it is the first public release of an EVM-compatible rollup protected by zero-knowledge proofs, ZKSync Era is a huge step when it comes to Ethereum scalability. Although ZKSync Era is still in its formative stages, it has the potential to become a major player in the Ethereum scaling ecosystem.\n\nWhat is the difference between zkSync and zkSync Era?\n\nBoth zkSync and zkSync Era are Layer 2 protocols that leverage zero-knowledge rollups to deliver scalable and low-cost Ethereum transactions. There are, however, some distinctions between the two:\n\nMatter Labs’ zkSync Era is a user-centric zk rollup platform, whereas zkSync is a ZK rollup protocol.\n\nWhile zkSync has been around since 2020, zkSync Era is already active on the Ethereum mainnet.\n\nzkSync Era is the first zkEVM-compatible protocol to hit mainnet, which means it supports smart contracts written in Solidity, Ethereum’s most popular programming language. zkSync also supports smart contracts, however, it is not intended particularly for the EVM.\n\nzkSync Era is designed to resemble Ethereum but with reduced costs. zkSync is similarly intended to minimize Ethereum’s congestion and scale its essential ideals to unlock the full potential of blockchain technology, but it is not intended to look and feel like Ethereum.\n\nzkSync Era is a layer 2 protocol that uses zero-knowledge cryptography to scale Ethereum’s security and values. zkSync is a layer 2 solution for exchanging Ether and ERC20 tokens that bills itself as an Ethereum scaling and privacy engine.\n\nBenefits of zkSync Era\n\nBefore we get into the process of bridging assets, let’s go over the advantages of using the zkSync Era network. The zkSync Era network is a layer 2 solution that uses zero-knowledge proofs to make transactions faster and cheaper.\n\nTransactions on the zkSync Era network frequently cost less than a penny in gas fees, making it an appealing option for users looking to save money on transactions. Furthermore, the zkSync Era network is more scalable than the Ethereum mainnet, supporting thousands of transactions per second.\n\nBridge Assets from Ethereum mainnet to zkSync Era: Choosing a Bridge\n\nA cross-chain bridge is required to connect assets from the Ethereum mainnet to the zkSync Era network. There are several bridges available. For example, Orbiter Finance is a decentralized exchange (DEX) that allows users to transfer ETH, USDC, USDT, and DAI to the zkSync network from Ethereum and other networks. Their platform provides quick and inexpensive cross-chain swaps and is one of the few DEXs that supports stablecoin transfers.\n\nHow to Bridge Assets from Ethereum mainnet to zkSync Era\n\nFollow these steps to bridge assets from the Ethereum mainnet to the zkSync Era network using Orbiter Finance:\n\nConnect your MetaMask wallet to the Orbiter Finance website.\n\nSelect the network to which you wish to send tokens (Ethereum, Polygon, Arbitrum, Loopring, Optimism, and ten more).\n\nChoose the token to bridge from your network to zkSync and enter the amount.\n\nExamine and approve the transaction.\n\nOther Options\n\nWhile Orbiter Finance is the most well-known zkSync cross-chain bridge, there are other options. The zkSync Era Bridge, for example, is an official bridge that enables users to transfer funds between the Ethereum mainnet and the zkSync Era network. Other DEXs, such as Synapse and Stargate, also provide traditional bridges.\n\nConclusion\n\nBridging assets from the Ethereum mainnet to the zkSync Era network is a straightforward process that can be accomplished with the help of a secure cross-chain DEX such as Orbiter Finance or any other. The zkSync Era network is faster and cheaper than the Ethereum mainnet, making it an appealing option for users looking to save money on transactions. You can easily bridge your assets to the zkSync Era network and reap its benefits by following the steps outlined in this how to bridge assets from Ethereum mainnet to zkSync Era article.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ldGhlcmV1bS1sMnMtYXJlLWFib3V0LXRvLWJlLXRoZS1ob3QtbmV3LXRoaW5nLWluLW5mdHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Ethereum L2s Are About to Be the Hot New Thing in NFTs - Unchained - Unchained",
        "content": "Episode 498\n\nIt’s in the name: mint.fun. Co-founder Luke Miles joins the show to talk about his platform’s efforts to make NFTs more discoverable, accessible and fun. He also shares his on-the-ground perspectives on emerging trends in the NFT space – everything from Bitcoin Ordinals to the rise of Ethereum L2s as NFT hot spots. With last cycle’s NFT mania in the rearview, what’s next?\n\nListen to the episode on Apple Podcasts, Spotify, Overcast, Podcast Addict, Pocket Casts, Stitcher, Castbox, Google Podcasts, TuneIn, Amazon Music, or on your favorite podcast platform.\n\nShow highlights:\n\nwhat mint.fun is and what problems it solves for NFT users\n\nhow it is different from popular NFT marketplaces such as OpenSea and Blur\n\nwhy mint.fun is also launching on Ethereum layer 2s\n\nLuke’s thoughts on the current state of the NFT market\n\nwhy the narrative has shifted from PFP projects delivering a roadmap to the ‘single creator narrative’\n\nthe difference between open-edition mints and limited editions\n\nwhy NFTs on layer 2s are “about to have a moment,” according to Luke\n\nwhether mint.fun will launch on other blockchains\n\nwhat Luke thinks of Ordinals and the BRC-20 mania\n\nThank you to our sponsors!\n\nGuest\n\nLinks"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hMTZ6LXJlbGVhc2VzLWFub255bW91cy12b3Rpbmctc3lzdGVtLWZvci1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "a16z releases anonymous voting system for Ethereum - Cointelegraph",
        "content": "Venture capital fund Andreessen Horowitz, also known as A16z, has released a Solidity library that can be used for anonymous voting on Ethereum. Called “Cicada,” the library prevents an individual voter’s choice from being known before polling ends. When combined with zero-knowledge group membership systems like Semaphore, it can also make the identity of the voter permanently unknowable, according to a May 24 blog post from A16z engineer Michael Zhu.\n\nExcited to announce Cicada: a new building block for private on-chain voting. https://t.co/hxE4KL4Se6 — moodle zoup (@moodlezoup) May 24, 2023\n\nCicada relies on time-lock puzzles, a type of cryptography that allows users to encrypt secret values that can only be decrypted after a specific period of time has passed, Zhu stated.\n\nThese puzzles have been around since 1996. But before 2019, they would have required users to reveal their secret values once the time period had passed. In voting systems, this could have caused problems with users submitting votes and then going offline, preventing all the votes from being countable.\n\nIn 2019, the concept of “homomorphic” time-lock puzzles was proposed by cryptographers Giulio Malavolta and Aravind Thyagarajan. This allowed the puzzles to be added together to produce a final puzzle that was much easier to solve than the sum of the individual puzzles. The solution to the final puzzle reveals only the sum of the individual values without revealing the individual values making up this sum.\n\nAccording to the A16z post, Cicada uses these homomorphic puzzles, allowing votes to be counted even if users go offline.\n\nWhen attempting to transfer Malavolta and Thyagarajan’s system to the blockchain, A16z researchers ran into an obstacle to creating a fair voting system: Each choice needed to be encoded as a boolean value of “1” or “0.” This meant that attackers could try to increase their voting power by incorrectly encoding the vote — by encoding “100” as their value, for example.\n\nTo solve this problem, Cicada requires voters to submit a zero-knowledge proof of ballot validity along with each ballot, the post said. The proof shows that the vote was encoded correctly, but without revealing the contents of the vote.\n\nRelated: Anchorage Digital opens up DeFi voting for custody clients\n\nCicada only prevents votes from being known while the poll is being conducted. Once the “poll has closed” or the time-lock period has passed, any person can determine the contents of a vote by brute-forcing the solution to the puzzle. However, A16z suggested that this problem can be solved by combining Cicada with zero-knowledge group membership systems like Semaphore, Semacaulk or zero-knowledge state proofs. In this case, brute forcing the puzzle will only reveal that the vote was cast by an eligible voter but will not reveal the credentials used to prove the voter’s eligibility.\n\nAs an example, Zhu provided a link to a sample contract produced using Cicada that also relies on Semaphore to prove voter eligibility.\n\nVoting systems have long been a component of decentralized autonomous organizations (DAOs), the governing bodies that often manage blockchain apps. But in most cases, DAOs use tokens to represent votes, which means that individual users can have an outsized influence if they hold a large number of tokens. For example, on May 22, an attacker took control of Tornado Cash by casting extra votes on a malicious proposal, using it to drain all of the governance contract’s funds. The attacker later offered to give back control to users.\n\nWaves founder Sasha Ivanov has argued that DAOs must move to a more democratic voting system if governance attacks like these are to be avoided."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8xNDI0OTMvYml0Y29pbi1ldGhlcmV1bS1ob2xkLWdyb3VuZC0zLTViLW9wdGlvbnMtZXhwaXJ5LWV2ZW500gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzE0MjQ5My9iaXRjb2luLWV0aGVyZXVtLWhvbGQtZ3JvdW5kLTMtNWItb3B0aW9ucy1leHBpcnktZXZlbnQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Hold Ground as $3.5 Billion in Options Expire - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum have held steady as billions worth of options contracts expired this morning.\n\nThe leading cryptocurrency rose 1% early Friday morning, while ETH jumped 1.6%.\n\nBitcoin is now trading at $26,509, down 11% over the past 30 days. Over that same period, the second-largest cryptocurrency by market cap has dropped 4.6%.\n\nAD\n\nAD\n\nToday, Bitcoin options on Deribit expired this morning with a notional value of $2.26 billion and $1.25 billion for Ethereum, inducing uncertainty in the market.\n\nNotional value refers to the total number of outstanding option orders in the market that have yet to expire.\n\nThe Bitcoin options market had a put-to-call ratio of 0.44. Similarly, for ETH, every put option had two call open options opened. This suggests that traders mostly held bullish positions, which is likely why the price reacted negatively before the expiry.\n\nAn option call contract is a financial derivative that gives the holder the right, but not the obligation, to buy a specific asset—in this case, Bitcoin—at a predetermined price. A put option gives the holder the right to sell.\n\nWhen an investor purchases a call option, they are essentially betting that the price of the underlying asset will rise above the strike price before the option expires. The strike price represents the pre-determined price at which the option is bought.\n\nAD\n\nAD\n\nFor instance, a May call option for a strike price of $27,000 would mean that for the buyer to turn a profit, the price must be higher than $27,000 at its expiration.\n\nUsually, the market has a tendency to fluctuate toward maximum pain point close to option expiration. The max pain point for today’s expiration event was $27,000 for Bitcoin and $1,800 for Ethereum, roughly current prices.\n\nThe maximum pain point for Bitcoin May options contract on Deribit. Source: Deribit\n\nThe maximum pain point in the options market refers to the price level when options buyers will incur maximum losses.\n\nBitcoin, Ethereum low liquidity takes hold\n\nIt was expected that the current low-liquidity market conditions would have exacerbated the impact of the options expiration event.\n\nBitcoin’s liquidity dried up in Q2 2023 due to events such as the end of Binance’s zero-fee trading program, the banking crises, and macroeconomic issues like the ongoing debt-ceiling debate in the United States.\n\nCo-founder of crypto research outlet Jarvis Labs Ben Lilly measured the decline in liquidity using the cumulative volume delta (CVD) metric for spot and futures markets. CVD measures the cumulative change in the volume of buy and sell orders as the price moves.\n\nIt’s used to analyze the flow of volume and can provide insights into the strength or weakness of a trend or price movement.\n\nLilly found that the spot CVD has declined dramatically since mid-April, indicating that traders are not showing any interest in driving the prices higher or lower.\n\nAD\n\nAD\n\nAdding to the options expiration event, Lilly added that once May contracts expire, the market’s attention will turn toward June, which are currently showing a maximum pain level of $24,000 for Bitcoin and $1,600 for Ethereum.\n\n“Once this unwind for May takes place and contracts expire, we’re now looking at June and the structure should be changing, which points to a pullback toward $24,000,” wrote Lilly.\n\nBiyond Capital’s lead trader Nathan Batchelor echoed the above analysis.\n\n“In low volume, low liquidity trading conditions such as now it is also possible the options actions could drive price volatility,” he told Decrypt. “Most of the high volume puts are seen around $25,250 so be careful of more downside on Friday if $25,850 is breached.”\n\nDeribit analysts agreed with the possibility of a bout of volatility based on the historically low reading of short-term implied volatility, which preceded a market rally in January 2023.\n\nImplied volatility is a measure of the market's expectation of the future volatility or price fluctuations of an underlying asset.\n\nDeribit’s chief commercial officer Luuk Strijers told Decrypt that while the previous instance resulted in an upside, it “could have been a market crash as well.”\n\nHe expects the short-term volatility to rise and reduce the difference with long-term implied volatility to reinstate the sentiment that “lower volatility in Bitcoin is here to stay” before traders can confidently begin long-term accumulation or distribution.\n\nAD\n\nAD\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NvbGFuYS1tZXRhcGxleC1mZWVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Will Solana's Metaplex Fees Push Developers Back to Ethereum? - Blockworks",
        "content": "One of the biggest selling points of Solana’s ecosystem is its low cost of utility for NFTs, especially when compared to its gas guzzling rival, Ethereum.\n\nBut even on the svelte blockchain platform, development still requires funding.\n\nIn an effort to cover some of these costs, dominant Solana NFT protocol Metaplex introduced a controversial network fee in its “Token Metadata immutability plan,” resulting in angry calls for forks and general discontent among its community.\n\nFollowing the backlash, Metaplex promptly back-pedaled from initial plans, removing some, but not all of the proposed fees. The company stated via Twitter that updates, verifications, freezes and thaws would remain free as costs “could prohibit important and emergent use cases.”\n\nCo-hosts Garrett Harper and Santiago Santos discussed the fee furor and the possibility that it might draw some developers back to Ethereum in a Blockworks interview on the Empire podcast.\n\nMetaplex as a public good\n\nHarper notes that Metaplex “spun out of Solana Labs,” raising $46 million, which he estimates is the third-largest raise in Solana’s ecosystem from an individual project.\n\n“I think people thought, in general, this was gonna be a public good.”\n\nVirtually all Solana NFTs — around 99.9% according to a company blog post — adopted the Metaplex standard, Harper says, “but the issue is now that they’re adding fees on top of this, people are like, okay, we’re gonna have to fork this.”\n\nProblem being, that’s not really a feasible solution, Harper explains. “They have a license where it says it’s open source, but you can’t actually fork it” to alleviate the fee problem.\n\nStephen Hess, the CEO of Metaplex, previously told Blockworks that “​​it’s acceptable under the license for anyone to fork Metaplex programs even for a competitive use case, provided the fork isn’t removing, replacing or modifying the fees.”\n\n“Now it’s used by all these NFTs. It’s adopted by the exchanges and also wallets,” Harper says.\n\n“It’s actually a lot of work to build and maintain the code,” he says, suggesting the company needs at least some fees to sustain a viable business model.\n\nIn a follow-up tweet, the company explains that proceeds from creator fees “will be used to fund dev work on the Token Metadata immutability roadmap as well as the broader suite of Metaplex programs (Candy Machine, Auction House, Compressed NFTs) and dev tools (SDKs, Amman, Umi, Solita).”\n\nWill fees hinder development?\n\nHarper explains that one of the problems for Solana, when compared to Ethereum, is that it lacks protocol standards like ERC-20 and ERC-721. “So today, the program’s just set by Metaplex and that’s what’s become the standard.”\n\nSantos wonders if the fee introduction might hinder NFT development on the competing platform. Such a move, he says, “degrades the interest in the broader Solana ecosystem of onboarding users.”\n\n“But at the same time, public goods need to be funded in some capacity.”\n\n“You’re adding the taxation layer on top of it,” Santos says, which “adds another layer of difficulty when you’re trying to tell projects and users that they’re gonna be taxed for something that they’re usually not used to being taxed on in other ecosystems like Ethereum.”\n\n“It becomes an even greater problem of competition and really low barriers to entry,” he says. “If you’re a new NFT project, this actually changes the landscape of it.”\n\n“One of the cool things about Solana,” Santos observes, is that “they do move so fast, and that’s one of their core advantages. But you can see an issue in scenarios like this where that can actually be a bad thing.”\n\nWhile Ethereum’s mainnet development moves at a much slower pace than Solana’s, layer-2 developments offer low-cost and rapidly evolving solutions, which “allows Ethereum to still innovate in a very quick way without having to do that at the protocol level,” Santos says.\n\n“And with that, you’re not gonna have issues with this.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8xNDI2MjcvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tZm91cnRoLWZsYXQtd2Vlay10cm9uLXRldGhlci1zdXJnZdIBZmh0dHBzOi8vZGVjcnlwdC5jby8xNDI2MjcvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tZm91cnRoLWZsYXQtd2Vlay10cm9uLXRldGhlci1zdXJnZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum See Fourth Flat Week as TRON and Tether Surge - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt was the fourth consecutive week of flat prices. A generally slow news cycle meant that market leaders Bitcoin and Ethereum remained where they were last weekend.\n\nBitcoin depreciated a nominal 0.5% and currently trades at $26,815, while Ethereum rose 1% over the seven days and now enters the weekend at $1,829.\n\nOn Monday, an AI-generated photo depicting a fabricated explosion at the Pentagon briefly caused a selloff in stocks and Bitcoin.\n\nAD\n\nAD\n\nMarkets were decidedly flat across the board, with no top thirty cryptocurrency posting significant gains except TRON, which rallied 8% to $0.076778.\n\nTRON’s rally this week appears to have been driven by the climbing market capitalization of the U.S. dollar-pegged stablecoin Tether (USTD), as the latter inches towards overtaking its all-time high of $83.2 billion, set in May last year.\n\nAccording to CoinGecko, Tether may set a new high watermark any day now.\n\nTRON and USDT’s joint rally appears to be linked to the fact that the majority of USDT, approximately $46 billion, is issued on Tron, surpassing the $36 billion on Ethereum. Recent data shows a steep rise in USDT on the TRON network throughout 2023 so far.\n\nThe biggest losses among cryptocurrencies this week were posted by Internet Computer (ICP), which fell 6% to $4.88, and Lido DAO (LDO), which dropped 7.1% to $1.96.\n\nAD\n\nAD\n\nCoin politics\n\nCrypto is already a major talking point in Bitcoin-friendly Florida Governor Ron DeSantis’s campaign as he gets ready to run as the GOP’s candidate in next year’s U.S. presidential elections.\n\nDeSantis headlined an otherwise disastrous Twitter Spaces the day he announced his candidacy and told his host, Twitter/Tesla CEO Elon Musk, that Biden’s administration “[has] it out for Bitcoin, and if it continues for another four years, they’ll probably end up killing it.”\n\nOn Tuesday, The International Organization of Securities Commissions (IOSCO) released a report outlining policy recommendations for global crypto regulation as part of the public consultation process.\n\nIn a nod to the fall of FTX, the IOSCO recommendations warn regulators about crypto companies \"combining certain functions in a single legal entity or group of affiliated entities,” such as one entity running exchanges, trading firms, and custody businesses under one roof.\n\nOn Thursday, watchdog the European Systemic Risk Board (ESRB) released a report concluding that the industry’s economic impact is minimal, but advising vigilance and policymaking that monitors leveraged trading and the industry’s financial contagion risks.\n\nThat same day, the European Securities and Markets Authority (ESMA) and National Competent Authorities (NCAs) issued a statement saying that cryptocurrencies must be clearly labeled as unregulated and both investors and investment firms should understand the financial risks involved in trading them."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLWV0aC1wcmljZS1wcmVkaWN0aW9uLXdoeS1hcmUtYW5hbHlzdHMtY29uZmlkZW50LW9uLXhycC1hbmQtdHJhZGVjdXJ2ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction: Why Are Analysts Confident on XRP and Tradecurve? - Analytics Insight",
        "content": "As the cryptocurrency market continues to evolve, Ethereum (ETH), XRP, and Tradecurve have captured the attention of analysts and investors. With Ethereum’s prominence, XRP’s unique features, and Tradecurve’s disruptive potential, confidence in these digital assets is growing.\n\n>>BUY TCRV TOKENS NOW<<\n\nEthereum (ETH) Price Prediction\n\nEthereum has long been the second-largest player in the crypto space, pioneering the concept of smart contracts and decentralized applications. Its token, ETH, is intrinsically tied to these operations, powering the transactions and creations on its blockchain.\n\nRecently, Ethereum price action has formed a falling wedge pattern, indicating a potential for breakout. However, the journey towards bullishness seems to be at the mercy of Bitcoin (BTC) due to Ethereum’s correlation with it.\n\nPresently, selling pressure from the 50-day EMA at $1,841 has increased, which could lead the Ethereum price to break below the immediate support confluence between the lower boundary of the downtrend line and the 100-day EMA at $1,768. Subsequently, Ethereum could experience a drop to the 200-day EMA at $1,686. Here, buyer momentum may provoke a rebound.\n\nRecent Developments: XRP’s Resilience and Flexibility\n\nXRP, also known as XRP Ledger, presents a distinct set of characteristics that make it an intriguing digital asset. With a current live price of $0.466627, XRP holds a significant market position, ranking sixth in terms of market capitalization.\n\nThe XRP Ledger, in operation since 2012, has demonstrated reliability in bridging traditional finance with blockchain technology. It offers a low-cost, fast, and scalable blockchain solution, enabling transactions to settle within seconds.\n\nXRP’s resilience and flexibility have been highlighted in recent news. Despite challenges faced by the cryptocurrency market, XRP has maintained its position and showcased its potential for long-term growth. Additionally, XRP’s role in facilitating cross-border transactions and its potential integration with central bank digital currencies (CBDCs) further bolstered its appeal.\n\nWith the growing interest in decentralized finance (DeFi), XRP’s unique features and scalability make it an attractive option for users seeking efficient and cost-effective transactions.\n\nThe recent developments in the XRP ecosystem highlight its resilience and adaptability in the evolving crypto landscape. Analysts remain optimistic about XRP’s future, predicting sustained growth and continued innovation within the XRP ecosystem.\n\nTradecurve (TCRV): Disrupting the Trading Landscape\n\nLike XRP and Ethereum, Tradecurve is emerging as a disruptive force in the cryptocurrency market. With its innovative approach to decentralized trading, Tradecurve aims to transform the way assets are traded. By leveraging blockchain technology, Tradecurve provides a secure, transparent, and efficient platform for users to engage in trading activities. The decentralized nature of Tradecurve eliminates the need for intermediaries and reduces transaction\n\nOne of the standout features of Tradecurve is its permissionless platform that allows users to connect their wallets, deposit cryptocurrencies, and trade freely without the need for extensive Know Your Customer (KYC) requirements. This enables traders to maintain their privacy while engaging in various trading activities\n\nAlso, as Tradecurve prepares for its launch, it is currently conducting a presale to raise funds and generate support for its vision. With a total fixed supply of 1.8 billion TCRV tokens, the presale offers an opportunity for early adopters to acquire tokens at a discounted price. Moreover, the surge in its presale is 50x, while the launch is 100x.\n\nFinally, tradecurve presents an exciting opportunity for traders and investors looking for a platform that combines the best aspects of centralized and decentralized exchanges. With its unique features, emphasis on privacy, and anticipated price surge during the presale and launch, Tradecurve has garnered significant attention within the crypto community.\n\nFor more information about TCRV presale tokens:\n\nWebsite: https://tradecurve.io/\n\nBuy presale: https://app.tradecurve.io/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nTelegram: https://t.me/tradecurve_official\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1wZXBlLWJpdGNvaW4tZXRoZXJldW0tYW1lcmljYW4td3JhcC0yNi1tYXktMjAyMzA1MjYxOTA30gGMAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1wZXBlLWJpdGNvaW4tZXRoZXJldW0tYW1lcmljYW4td3JhcC0yNi1tYXktMjAyMzA1MjYxOTA3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: PEPE, Bitcoin & Ethereum – American Wrap 26 May - FXStreet",
        "content": "Ethereum (ETH) price is working on its recovery after it dipped to a two-week low on Thursday. While Bitcoin price has failed to make a similar move and head back above $26,500, Ethereum is outpacing Bitcoin and has been able to push above $1,800. One hurdle is in the way now. The green ascending trendline must be overtaken again by bulls before heading to $1,875.\n\nBitcoin price declined in response to April's US core Personal Consumption Expenditures (PCE) inflation data, which came higher than anticipated. The knee-jerk reaction from market participants increased the selling pressure on the asset, pushing it below $26,400. However, Bitcoin price has managed to return to pre-data levels minutes after the release.\n\nPEPE (PEPE) price is entering the very last possible stage before finally determining whether bulls or bears have the winning hand in this poker game showdown. Analyzing the performances of past sessions and taking into account the Relative Strength Index (RSI), it would appear that the bears will win the game. Expect a breakdown soon of the green ascending trendline and price action heading to $0.0010000 if that is indeed the outcome.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1zdGF5cy1iZWxvdy0yNjUwMC1ldGhlcmV1bS1yZWdhaW5zLTE4MDAtcG9seWdvbi11cC00LTM4MjkxNS0yMDIzLTA1LTI20gGVAWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuaW4vYW1wL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1zdGF5cy1iZWxvdy0yNjUwMC1ldGhlcmV1bS1yZWdhaW5zLTE4MDAtcG9seWdvbi11cC00LTM4MjkxNS0yMDIzLTA1LTI2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin stays below $26,500; Ethereum regains $1,800; Polygon up 4% - Business Today",
        "content": "Bitcoin rose on Friday, but a few altcoins were down. The crypto traders continued to to track negotiations about the US debt ceiling. US lawmakers reported progress in the discussions, although whether they and the Biden Administration reach an agreement remains uncertain.\n\n\n\nBitcoin was back in green on Friday as the largest crypto token gained more than a per cent but remained below $26,500-mark. However, its largest peer, Ethereum, jumped about 2 per cent to regain the $1,800-levels. Price action in the altcoin was mixed during the early trade.\n\n\n\nCrypto markets have traded sideways in the last 24 hours. The slight increase could be attributed to positive weekly unemployment data in the US. The crypto fear and greed index fell by 2 points since yesterday, but remains in the neutral zone with 49 points, said Parth Chaturvedi, Investments Lead, CoinSwitch Ventures.\n\n\n\n\"In other news, OpenAI’s CEO Sam Altman’s crypto project Worldcoin—a decentralized open-source protocol—has raised $115 million dollars in a Series C funding round. Such fundings are uncommon when institutional fundings have declined during a bear market phase,\" he said.\n\n\n\nTop crypto tokens were trading mixed on Friday. Among the gainers, Polygon rose 4 per cent, followed by Litecoin's 3 per cent gains. Avalanche, Dogecoin and Shiba Inu were up about a per cent each. XRP topped among the losers, with a per cent fall, while Cardano was down a per cent.\n\n\n\nThe global cryptocurrency market cap was trading higher, rising up to $1.11 trillion-mark as it dropped as much as 3 per cent in the last 24 hours. However, the total trading volumes tanled about 26 per cent to $28 billion.\n\n\n\nThe leading crypto had been maintaining a steady position, but recently slipped below its crucial support level of $26,500. The uncertain macroeconomic climate has contributed to a decline in the crypto market, fueled by concerns surrounding inflation, crypto regulations, and the ongoing debt ceiling stalemate, said CoinDCX Research Team.\n\n\n\n\"In a positive turn of events, Bitcoin's sell-side risk ratio has reached an all-time low. This development indicates that investors have shown reluctance to sell their Bitcoins within the current price range, regardless of whether it would result in profit or loss,\" he added.\n\n\n\nImage: Crypto-chart-price\n\n\n\nTech View by Giottus Crypto Platform\n\nEthereum (ETH) has experienced a notable breakdown this week, breaching the 200-day moving average. This breach of support signifies strong selling pressure and a possible return to $1,750 level though it is holding above $1,800 currently.\n\n\n\nChart-ETH\n\n\n\nThe RSI, at 43.2, also had a sharp fall reflecting selling pressure in the market. If ETH is unable to break through the $1,850 barrier, the price may continue to dip. The most recent low ($1,775) serves as an early support level, with $1,735 providing the next line of defence.\n\n\n\nMajor Levels\n\nSupport: $1,775, $1,735\n\nResistance: $1,850, $1,900\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGFpbHljb2luLmNvbS9jYXJkYW5vLW1vcmUtZGVjZW50cmFsaXplZC1hbGwtY3J5cHRvLWNoYXJsZXMtaG9za2luc29uLXN1bW1lci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "“Cardano Will Be More Decentralized Than All Crypto”: Charles Hoskinson on Summer Expectations - DailyCoin",
        "content": "Charles Hoskinson addresses what’s coming to the network this summer.\n\nThe Cardano founder adds that by this summer the chain could surpass Bitcoin, Ethereum, and every other cryptocurrency.\n\nHoskinson also shares how Cardano plans to tackle the ongoing regulatory turmoil.\n\nCardano is emerging as a powerhouse in the crypto industry, cementing itself as a pioneering force to be reckoned with. This year, the Proof-of-Stake chain has exhibited remarkable growth, fueled by the release of new protocols, updates, and proposals that have the crypto community hooked.\n\nAs the network approaches its final development stages with the highly anticipated Voltaire update, Cardano’s founder Charles Hoskinson has shared some exciting news about what lies ahead for the network in the summer.\n\nIn a video update released on Thursday, May 25, Cardano founder Charles Hoskinson shed light on the latest developments within the ecosystem. Hoskinson touched on various topics with an optimistic outlook, unveiling the potential of a “Cardano Summer” in the next few weeks.\n\nOne of the key highlights of Hoskinson’s address was the CIP-1694 proposal. It is a ground-breaking revision of Cardano’s on-chain governance infrastructure scheduled to be integrated into the upcoming Voltaire update. The proposal can potentially reshape the Cardano ecosystem into a government, allowing any user to submit a governance action.\n\nHoskinson eagerly shared that the development team has been progressing at “blinding speeds” to finalize CIP-1694, which is expected to be released in the next few weeks. In parallel, Cardano is also conducting a series of workshops worldwide, engaging its vibrant community and equipping them with a deeper understanding of the new protocol.\n\nLooking ahead, Hoskinson asserted his firm belief that once CIP-1694 goes live following the community vote and hard fork, the network will become “more decentralized than all crypto,” including competitors Bitcoin and Ethereum. The founder added that the achievement would serve as a resounding “wake-up call” to Bitcoin maximalists and others who have dismissed Cardano’s research-oriented approach as mere “academic waste.”\n\nThe Cardano Founder delved into other updates, including the launch of Genesis and Eclipse detection following CIP-1694. Hoskinson added that by summer, Cardano would be a complete end-to-end network that would behave the way he envisioned and intended for it to be used.\n\nBeyond this, Hoskinson also addressed the ongoing regulatory turmoil, sharing how the development team is tackling the issue and laying the foundation for a better regulatory framework.\n\nQuantifying Cardano’s Decentralization\n\nHoskinson introduced the development team’s ongoing effort to measure and quantify decentralization using the Edinburgh Decentralization Index, which plans to leverage metrics such as the Herfindahl-Hirschman, Gini, and Nakamoto coefficients. These metrics would provide valuable insights into Cardano’s level of decentralization, further cementing its position in the crypto industry.\n\nThe Cardano founder also highlighted the potential impact of these metrics on governments and regulatory bodies worldwide. By using these indicators to assess decentralization, policy-makers could formulate informed regulations and differentiate between cryptocurrencies as either commodities or protocols based on their decentralization.\n\nHoskinson emphasized that major regulatory bodies, such as MiCA and those in the United States, could adopt these metrics once they are complete, fostering a more nuanced and optimized regulatory framework.\n\nOn the Flipside\n\nCardano is currently the 7th largest network by market cap.\n\nCardano has made an impressive ascent in DeFi TVL rankings, claiming the 17th spot with a total value locked (TVL) of $163.16 million , at press time.\n\n, A report published in December 2022 by Santiment highlighted Cardano as the top protocol in terms of development activity.\n\nWhy This Matters\n\nCardano is one of the top cryptocurrencies in the market with a vibrant community. The network has often shown its unwavering commitment to innovation and progress. Summer 2023 could be revolutionary for the crypto community regarding decentralization. Many are eagerly awaiting the realization of Hoskinson’s summer expectation. If it succeeds, it would undoubtedly pave the way for a more inclusive and resilient future in the crypto industry.\n\nFind out what Charles Hoskinson had to say about the Ledger controversy:\n\nCardano Founder Charles Hoskinson Reacts to Ledger Controversy: “Don’t Break Social Contracts”\n\nWill Cardano reach $1?\n\nCardano’s Road to $1: DeFi TVL Tripled, SNEK Soars 200%, and Whale Interest Burgeons"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2J1aWxkaW5nLWEtc3Ryb25nLWNyeXB0by1wb3J0Zm9saW8tc3RhcnRzLXdpdGgtYml0Y29pbi1ldGhlcmV1bS1hbmQtYXZvcmFrLWFpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Building a strong crypto portfolio starts with Bitcoin, Ethereum, and Avorak AI - Analytics Insight",
        "content": "In crypto, as is with any investment, it is important to diversify your portfolio. Several analysts suggest that building a strong crypto portfolio starts with Bitcoin (BTC), Ethereum (ETH), and Avorak AI (AVRK).\n\nWhy you should hold Bitcoin\n\nWith several banks collapsing and the FED raising interest rates, the traditional financial systems are clearly unstable, and this could lead to cryptocurrencies becoming increasingly popular. Bitcoin (BTC) is the largest and most valuable cryptocurrency by market cap. It is also the first-ever cryptocurrency and has already seen massive worldwide adoption. Bitcoin (BTC) has a maximum supply of 21 million, and more than 19 million are already in circulation. And by laws of demand and supply, BTC is expected to increase in value over time. Additionally, Bitcoin is nearly a year away from its halving event, which is usually a catalyst for a spike in its value.\n\nWhat’s next for Ethereum?\n\nAfter Ethereum’s recent Shapella upgrade, many in the crypto community wonder what is next for the world’s second-largest cryptocurrency. It can seem like Ethereum is always in a state of development, and that is because its team is working on what they call Ethereum 2.0. Opponents of Ethereum have often criticized the network’s scalability, pointing to its high transaction costs, slow speeds, and energy usage. Ethereum 2.0 aims to provide a more scalable network by offering safer, faster, cheaper, and more energy-efficient transactions. Analysts suggest that Ethereum’s developmental success could see its value increase significantly.\n\nAvorak AI (AVRK): Better for 100x\n\nAvorak is a new AI crypto project running on the BNB Smart Chain. The project includes a suite of AI products and services that can streamline human-led processes. For example, Avorak’s digital assistants and chatbots can enhance customer service by providing accurate and immediate answers to customers’ queries. The Avorak Trade bot can optimize the trading of any asset, including crypto, fiat, and stocks. The bot uses AI algorithms to analyze market trends, provide predictions on future prices, and find the best possible trades. The trade can be easily programmed to automate trades on multiple exchanges.\n\nAvorak’s suite of AI solutions can be used in many fields, including content creation, data analytics, online shopping, and security. AVRK is Avorak’s native utility token and functions as a credit for accessing the Avorak AI services. AVRK can be staked or traded on various centralized and decentralized exchanges once the project goes live. Avorak also distributes a share of its profits to AVRK holders through its revenue feedback system. There is a maximum supply of 40 million AVRK, and Avorak AI has burn mechanics that ensure continuous deflation of the AVRK token.\n\nEvery cryptocurrency investor seeks to find a 100X gem, that is, a coin that will skyrocket in value and turn a small investment into a fortune. Well, AVRK provides just that. Avorak has an ongoing ICO (initial coin offering) event, selling AVRK at a comparatively low price and offering a number of advantages to its investors. AI crypto is expected to generate substantial profits in 2023, and several analysts believe Avorak AI could lead this bull run once it’s launched.\n\nFor more information on Avorak AI:\n\nWebsite: https://avorak.ai\n\nBuy AVRK: https://invest.avorak.ai/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V4cGVydHMtc2F5LWJ1eS1iaXRjb2luLWV0aGVyZXVtLWFuZC10cmFkZWN1cnZlLWluLW1heS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Experts say buy Bitcoin, Ethereum and Tradecurve in May - Analytics Insight",
        "content": "With just one week left of May, crypto investors are trying to optimize their portfolios for the next month. Although much of the market remains turbulent, experts believe Bitcoin, Ethereum, and Tradecurve will continue to lead the market, with Tradecurve already selling over 60% of its second presale round.\n\n>>BUY TCRV TOKENS NOW<<\n\nEthereum Pushes Towards $2k After Late Month Recovery\n\nEthereum’s recent upgrade has made the project more popular than ever. More individuals staked Ethereum at the end of April than the entirety of March, which was a huge milestone for the project. Now one month later Ethereum’s popularity continues to rise, with $6.7 billion worth of Ethereum transactions taking place daily.\n\nEarly in May, Ethereum surged to over $2k before declining to $1,748. However, Ethereum is back on the rise with a 2.18% price increase in the last week. At the time of writing, Ethereum was trading at $1,853, with experts predicting it to hit $2k by the end of the month.\n\nWith the Ethereum ecosystem growing faster than ever, analysts predict that Ethereum could surge above $2k in June, with bullish experts predicting that Ethereum could hit $2.3k by the end of Q2.\n\nBitcoin Up Following Debt Crisis Updates\n\nFollowing news that the Biden administration had solved the debt crisis, Bitcoin increased by 1.54%, with one Bitcoin trading at $27,325 at the time of writing. This increase marks a rise of 1.26% in the last seven days, though Bitcoin remains below the $28k barrier.\n\nDespite the price of Bitcoin remaining stagnant for the past month, Bitcoins daily trading volume remains extremely high, averaging over $13 billion a day. With an influx of new investors and Bitcoin ordinals starting to gain traction, analysts are confident that Bitcoin will begin to rally by the end of May.\n\nWhile price predictions vary, most analysts are confident that Bitcoin will rise above $30k in the next month, which would likely trigger a market wide rally, driving up the value of Ethereum and Tradecurve in the process.\n\nAnalysts Believe Tradecurve Could Be The Next Big Exchange\n\nWhile Ethereum and Bitcoin are expected to increase between 5 to 10%, Tradecurve is expected to increase 50x during its presale, having already risen by 20% after its first presale round sold out.\n\nTradecurve’s development was inspired by recent developments in the crypto market and in particular, growing uncertainty regarding the transparency of centralized exchanges. The development team noticed that while decentralized alternatives are available, these too have flaws with limited assets and a high level of complexity.\n\nTradecurve offers a hybrid exchange that combines the benefits of both decentralized and centralized alternatives while also removing their disadvantages. Using Tradecurve, investors can buy crypto and traditional assets anonymously, without ever needing to pass KYC checks.\n\nInstead, the platform works like decentralized exchanges where investors can connect their external wallets, buy assets and disconnect. Furthermore, Tradecurve also resolves the complexity of decentralized exchanges with its metaverse trading academy where investors can learn how to trade and use the Tradecurve platform.\n\nMore advanced traders will also have the chance to build on their education with AI and automated trading subscriptions as well as a copy trading subscription, where traders can learn directly from the market’s best traders.\n\nTradecurve tokens, which will play an important role in the project’s ecosystem, are currently selling for $0.012 per token during the project’s presale. With less than 40% of its round 2 supply left, TCRV tokens are expected to increase to $0.015 by the end of the month, offering a 50% ROI for bullish investors.\n\nFor more information about TCRV presale tokens:\n\nWebsite: https://tradecurve.io/\n\nBuy presale: https://app.tradecurve.io/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nTelegram: https://t.me/tradecurve_official\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vcHVuY2huZy5jb20vbWlzc2VkLW91dC1vbi1ldGhlcmV1bS1ldGgtd2hlbi1pdC13YXMtYmVsb3ctMTAwMC1qb2luLXRoZS1jcnlwdG8tZWxpdGUtd2l0aC1pbnF1YmV0YS1xdWJlLXByZXNhbGUv0gF7aHR0cHM6Ly9wdW5jaG5nLmNvbS9taXNzZWQtb3V0LW9uLWV0aGVyZXVtLWV0aC13aGVuLWl0LXdhcy1iZWxvdy0xMDAwLWpvaW4tdGhlLWNyeXB0by1lbGl0ZS13aXRoLWlucXViZXRhLXF1YmUtcHJlc2FsZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Missed Out On Ethereum (ETH) When It was Below $1000? Join The Crypto Elite With InQubeta (QUBE) Presale - Punch Newspapers",
        "content": "If you are conversant with the crypto space, you’ve likely heard about the incredible rise of Ethereum (ETH). It’s no news that those who invested in Ethereum early have had their share of massive returns. However, if you missed out on the opportunity to invest in ETH while it was below $1000, InQubeta (QUBE) offers you the chance to become a crypto elite through its presales.\n\nWhile Ethereum has grown above the $1000 price mark, QUBE is currently the best crypto for beginners and experts seeking to scale in the crypto space. Considering the future of AI technology, the innovative strategy adopted by InQubeta to support AI start-ups makes it a promising digital asset. This article explores the benefits early investors can gain from participating in the InQubeta presale if they had missed out on Ethereum.\n\nInQubeta (QUBE) Sets To Raise New Generation of Crypto Elite\n\nThe emergence of the InQubeta cryptocurrency has been a blessing to investors and AI start-ups alike. As the world’s first cryptocurrency to support investment in AI start-ups, InQubeta seeks to revolutionize the world and make life easier. The project is built on the ERC20 Ethereum blockchain, and InQubeta aims to be a more lucrative and sustainable investment platform for everyone.\n\nInvestors seeking to join the crypto elite should consider InQubeta the best crypto to invest in while its presale is on. QUBE tokens are selling at $0.007, and savvy investors should rush in to make purchases before the price surges in the next stage. With its presale prices, investors can access a 5% bonus of QUBE tokens when they purchase with the promo code BETA5.\n\nThe InQubeta Stage 2 presale is also known as the Beta Stage. In this stage, InQubeta seeks to launch the Beta Staking Dapp and the Beta InQubeta Swap to enable investors to increase revenue and easily exchange QUBE tokens. With the NFT investment marketplace also in this stage, investors can easily purchase NFTs to support a particular AI start-up. InQubeta NFTs allow for fractional investment, enabling investors to make flexible investments according to personal budgets. This is an exciting opportunity for everyone to earn a substantial income with their investment.\n\nAs it offers numerous investment opportunities, InQubeta stands out as the best crypto for beginners looking to enter the cryptocurrency space and experts looking to diversify their existing portfolios. Investors seeking extra passive income can join the InQubeta staking pool using the ERC20 QUBE token.\n\nAs a DeFi crypto, every QUBE token holder can participate in the InQubeta ecosystem’s decision-making process. This automatically makes the QUBE token result-driven, as constructive contributions will help skyrocket crypto growth. By jumping on the QUBE presale, investors who purchase QUBE tokens are expected to reap substantial rewards soon.\n\nVisit InQubeta Presale\n\nEthereum (ETH) Thrilled Users With Wide Adoption\n\nEthereum is a DeFi crypto powered by ETH, its native currency, to enhance peer-to-peer transactions within the platform. As a secured blockchain, many developers use Ethereum to build decentralized applications in the crypto space. Unlike before, ETH now uses the Proof-of-Stake (PoS) consensus mechanism to reduce energy consumption.\n\nWith its wide application in the crypto space, Ethereum is one of the most popular blockchains on the market. Users can easily access ETH on major exchanges like Binance, CoinMarketCap, and others. As the second-largest crypto by market cap, ETH can be swapped with thousands of other cryptos.\n\nFinal Thoughts\n\nWhile Ethereum is ranked among the top cryptos, investors who bought it early are now enjoying the benefits of its enhanced features, and as a leading crypto investment. However, if you missed the ETH opportunity, don’t worry, as InQubeta presents another fantastic opportunity to hit a massive return and join the crypto elite. InQubeta aims to be the best crypto in the space right now, and investors can earn more by supporting any AI start-ups they choose. Jump on the ongoing presale to record your highest returns.\n\nJoin InQubeta Communities\n\nKeywords: InQubeta, QUBE, Ethereum, ETH, best crypto, DeFi crypto, ERC20, best crypto for beginners"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2Nhbi1ibG9ja2NoYWluLXRlY2hub2xvZ3ktYmUtdXNlZC1mb3ItcnVyYWwtZGV2ZWxvcG1lbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Can Blockchain Technology be Used for Rural Development? - Analytics Insight",
        "content": "Explore the impact of leveraging blockchain technology for empowering rural development\n\nIn recent years, blockchain technology has gained significant attention for its potential to revolutionize various sectors. While often associated with cryptocurrencies, the underlying technology offers much more. One promising application lies in rural development, where blockchain can empower marginalized communities by enhancing transparency, efficiency, and trust. This article explores the transformative potential of blockchain technology for rural development and presents a compelling example of its successful implementation.\n\nBlockchain for Transparent Land Governance:\n\nLand governance is a critical aspect of rural development, as it directly impacts access to resources and livelihoods. Unfortunately, many rural areas suffer from insecure land tenure systems, leading to disputes, corruption, and exclusion. Blockchain technology can address these challenges by providing transparent and immutable land registries. Through decentralized finance and tamper-proof databases, land ownership records can be securely stored, ensuring trust among stakeholders. For instance, Bitland, a blockchain-based land registry in Ghana, has successfully enabled small-scale farmers to secure their land rights, reducing disputes and unlocking access to credit and other development opportunities.\n\nEnhancing Supply Chain Management\n\nBlockchain technology can transform the supply chain management of agricultural products, benefiting both farmers and consumers. By creating a transparent and immutable record of every stage of the supply chain, from production to distribution, blockchain ensures that the quality and authenticity of products can be verified. This is particularly crucial for rural communities that heavily rely on agriculture as their primary source of income. For example, coffee farmers in remote regions can use blockchain to track the journey of their coffee beans, ensuring fair prices and minimizing the risk of fraud throughout the supply chain. This not only improves the farmers’ income but also assures consumers of the product’s origin and quality.\n\nSmart Contracts and Agricultural Insurance\n\nSmart contracts, powered by blockchain technology, enable the automation and execution of agreements without intermediaries. In the context of empowering rural development, smart contracts can streamline agricultural insurance processes. By using predefined conditions and triggers, smart contracts can automatically trigger insurance payouts when specific events, such as crop failure due to adverse weather conditions, occur. This eliminates the need for manual claims processing and reduces administrative costs, making agricultural insurance more accessible and affordable for farmers in rural areas. Such initiatives have the potential to safeguard farmers’ livelihoods and foster sustainable agricultural practices.\n\nFinancial Inclusion and Microfinance:\n\nAccess to financial services is a crucial driver of rural development, yet many rural communities lack formal banking infrastructure. Blockchain technology can facilitate financial inclusion by enabling secure and low-cost transactions without the need for traditional banks. By leveraging mobile devices and digital identities, blockchain-based platforms empower rural populations to access microfinance services, make payments, and build credit histories. The BanQu project in Kenya exemplifies this potential, offering a blockchain-based platform that enables smallholder farmers to create a verifiable economic identity, access loans, and improve their economic prospects.\n\nCase Study: Blockchain-based Supply Chain for Rwandan Coffee\n\nOne notable example of blockchain technology’s impact on rural development is the partnership between the Rwandan government, technology company Bext360, and the coffee industry. Through a blockchain-based supply chain platform, coffee farmers in Rwanda can trace the entire journey of their beans, from harvest to export. This has significantly improved transparency and accountability in the supply chain, ensuring fair prices for farmers and enhancing the reputation of Rwandan coffee in international markets. By directly connecting farmers to buyers and facilitating instant payments, blockchain technology has empowered rural coffee farmers, contributing to poverty reduction and sustainable economic growth in the region.\n\nIn Conclusion\n\nBlockchain technology holds immense promise for rural development, offering innovative solutions to address the challenges faced by marginalized communities. By providing transparent and immutable records, blockchain can enhance land governance, empowering farmers with secure land rights. Furthermore, blockchain can revolutionize agricultural supply chains, enabling fair compensation for farmers and connecting them directly with consumers. Lastly, by promoting financial inclusion and microfinance, blockchain can empower rural populations to access vital financial services. As we explore the vast potential of blockchain technology, it is crucial to ensure its responsible implementation, bridging the digital divide and creating a more equitable future for rural communities worldwide.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vYml0Y29pbmlzdC5jb20vaXMtZXRoLTItMC1iZXR0ZXItdGhhbi1ldGhlcmV1bS1jbGFzc2ljLWV4cGVydHMtYXJlLWJ1bGxpc2gtb24tdHJhZGVjdXJ2ZS_SAWVodHRwczovL2JpdGNvaW5pc3QuY29tL2lzLWV0aC0yLTAtYmV0dGVyLXRoYW4tZXRoZXJldW0tY2xhc3NpYy1leHBlcnRzLWFyZS1idWxsaXNoLW9uLXRyYWRlY3VydmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 18:50:25 GMT",
        "title": "Is ETH 2.0 Better Than Ethereum Classic, Experts Are Bullish On Tradecurve | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum has undergone a series of updates in the last year to make it significantly more practical than Ethereum Classic. These updates have helped Ethereum attract thousands of new investors and catch the attention of global news reporters.\n\nWhile recent headlines have focused on Ethereum’s success, experts have become bullish on Tradecurve, which is expected to hit a new all-time high at the end of May.\n\n>>BUY TCRV TOKENS NOW<<\n\nEthereum 2.0 Continues To Pioneer Web 3 Despite Its Flaws\n\nThe Ethereum merger to create Ethereum 2.0 occurred in September 2022, when Ethereum was trading at $1361. Many analysts predicted that this upgrade would take Ethereum’s value to new highs, though following the merger, growth remained low. In fact, Ethereum’s price fell below $1300 just one month later. However, eight months on, Ethereum has increased in price by over $500 to $1,822, and experts are more bullish on Ethereum than ever before.\n\nThat being said, Ethereum 2.0 isn’t all it was promised to be. At the time of launch, it was promised that throughput would increase to over 100.000 transactions per second (TPS). Though as of May 2023, TPS is just 30. Gas fees are also still a problem throughout the market, with some transactions costing investors over $100 in ETH to make. This has also caused gas wars and prevented some investors from getting involved in new NFT projects.\n\nNonetheless, Ethereum 2.0 offers higher returns than Ethereum Classic, is significantly more eco-friendly, and remains the third most traded cryptocurrency in the world, with an average daily trading volume of $6 billion.\n\nEthereum Classic Offers Good Benefits But Is It Outdated?\n\nAlthough not as popular as Ethereum, Ethereum Classic still has a number of benefits. Firstly, it’s completely immutable. This means transactions cannot be altered or deleted and makes Ethereum Classic a reliable and secure platform for transferring digital assets.\n\nSecondly, Ethereum Classics technology has a strong track record. It’s based on the original Ethereum blockchain, which makes Ethereum Classic a great option for users looking for stability and reliability.\n\nLastly, there have been no hard forks or major upgrades to Ethereum Classic since 2016, limiting potential disruption. This makes Ethereum Classic a more stable and predictable platform.\n\nAt the time of writing, Ethereum Classic was priced at just $18.03, a 7.27% decrease in the last month. Overall, Ethereum Classic’s growth has remained slow, decreasing in value by 16.39% in the last year causing many investors to forget about the project.\n\nWhy Are Experts Bullish On Tradecurve\n\nSince the start of its presale, Tradecurve has offered better returns than both Ethereum 2.0 and Ethereum Classic, increasing in price by 20%. With an additional price rise predicted in the next week, crypto experts are extremely bullish on the project’s growth.\n\nTradecurve has set the ambitious goal of becoming a top 3 global exchange in the next few years, offering a decentralized alternative to many of the world’s most popular investment platforms. With Tradecurve, investors will be able to purchase traditional assets like stocks and commodities using cryptocurrency.\n\nThe Tradecurve platform is one of the first to let individuals use crypto as collateral to trade derivatives, without the need to complete intrusive KYC checks. This is not just appealing to investors who wish to trade anonymously, but also to the growing number of investors who are questioning the integrity of centralized exchanges.\n\nThe Tradecurve ecosystem will also include a trading academy, AI and algorithmic trading services, and copy trading subscriptions to help investors learn more complex trading strategies. TCRV token holders will be eligible for discounts on their subscriptions and will also be able to upgrade their account to VIP status.\n\nOne TCRV token is currently selling for $0.012, with many experts comparing the Tradecurve presale to the ICO of Binance due to its current growth and huge potential to revolutionize the exchange market with its hybrid platform.\n\nFor more information about TCRV presale tokens:\n\nWebsite: https://tradecurve.io/\n\nBuy presale: https://app.tradecurve.io/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nTelegram: https://t.me/tradecurve_official\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of Bitcoinist. Bitcoinist does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5vdXRsb29raW5kaWEuY29tL2J1c2luZXNzLXNwb3RsaWdodC9iaWctZXllcy1jb2luLWlzLW9uZS1vZi10aGUtYmVzdC1tZW1lLWNvaW5zLW9mLTIwMjMtb3V0c2hpbmluZy1ldGhlcmV1bS1wZXBlY29pbi1uZXdzLTI4OTg1M9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Big Eyes Coin, The Best Meme Coin of 2023, Surpassing Ethereum, Pepecoin - Outlook India",
        "content": "Big Eyes Coin, with its adorable cat-themed design, has captured the attention and affection of many crypto enthusiasts in this exciting meme season. As the clock ticks down to the end of its presale on June 3rd, investors are rushing to secure BIG tokens, particularly with the coin selling at its Stage 3 price of $0.00017, a revert from its current price of $0.00053 from Stage 13. The token is set to launch on June 15th, primarily on Uniswap, but there are speculations that it might also be available on other prominent crypto exchanges such as KuCoin, OKX, or Binance."
    }
]