[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vYmxvY2tvbm9taS5jb20vaW50by10aGUtbmV4dC1jaGFwdGVyLWV0aGVyZXVtcy1wcm90by1kYW5rc2hhcmRpbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Into The Next Chapter: Ethereum's Proto-Danksharding - Blockonomi",
        "content": "Following the successful Shanghai (Shapella) upgrade, Ethereum developers are moving to the next stage. The coming milestone Cancun-Deneb is part of Etherem’s sharding roadmap and is focused on one of the most anticipated network issues – Ethereum’s gas fee.\n\nDuring the latest bi-weekly call, all-core devs highlighted that the key focus was now EIP-4844, or proto-danksharding, a feature essential to the network’s rollup-centric roadmap. Proto-danksharding introduces a new transaction type to reduce user transaction costs on layer-2 rollups.\n\nA New Level of Ethereum\n\nProto-darksharding, also known as the Surge, targets a minimum of 100,000 transactions per second or more. This upgrade to EIP-4844 (Danksharding) is said to make layer-2 more efficient by reducing costs and scaling.\n\nThereby, the upgrade will boost the speed of the network higher. It is expected to take place in 2023.\n\nCancun also aims to deactivate the SELFDESTRUCT opcode to make way for statelessness. The EIP-1153 proposal, which proposes new, cost-effective ways to temporarily store data in Ethereum smart contracts, was previously excluded from Shapella but is now being considered.\n\nThe Ethereum Virtual Machine (EVM) Object Format (EOF), originally part of Shanghai, was also discussed but was deemed a poor match for the Cancun plan. However, it was agreed that EOF should be the focus of the next major upgrade, called Prague.\n\nDespite all the hype surrounding Shanghai, the upgrade will not necessarily affect the network’s performance. Shanghai expectedly had a significant impact on those with ETH staked on Ethereum.\n\nUndoubtedly, after the aforementioned update, a first wave of withdrawals was observed. Remarkably, on the following day, there were already 44,150 withdrawals made. It is worth mentioning, though, that most of these transactions are aimed at reclaiming the accrued rewards.\n\nSubsequently, around April 20, a second wave of withdrawals occurred, resulting in over 100,000 ETH being withdrawn. These withdrawals were regarded as “major” by Nansen since they impacted the amount of ETH required to operate a validating node.\n\nLastly, between April 24 and 25, a third wave of withdrawals was identified, resulting in 240,000 ETH being withdrawn. However, during this period, approximately 80,000 ETH were also deposited.\n\nDespite the withdrawals, new ETH continued to be deposited into staking, and as a result, more than 18 million ETH are still deposited in staking on Ethereum.\n\nMore Ether Staked\n\nAccording to the latest data, unlocking staked ETH encourages more individuals to participate in Ethereum staking. Shanghai has stimulated institutional staking on Ethereum, resulting in significant inflows of ETH for institutional staking providers.\n\nThe total amount of ETH over the last month reached 224,000 ETH, deposited by staking service providers, including Bitcoin Suisse, Figment, Kiln, Staked.us, and Stakefishs. Institutional investors are also drawn to the attractive rewards of staking Ether while speculating on higher prices in the future.\n\nLido has shown remarkable growth since its inception. In February, the protocol recorded a deposit of 150,000 ETH in a single day. It has nearly 5.9 million ETH deposited in staking, making it the king of staking on Ethereum.\n\nHowever, Lido has not yet updated its protocol to support withdrawals, and the opening of withdrawals is expected to be a significant event for Ethereum staking.\n\nExperts in the cryptocurrency industry have expressed divergent views about the upgrade’s potential impact on Ether’s price.\n\nBut Ethereum hasn’t seen any significant price movements since Shanghai was implemented. The second largest cryptocurrency trades at approximately $1,914, almost the same level as before the upgrade.\n\nWhile some analysts anticipate that the increased supply could result in a selling frenzy, others believe it might become a psychological battle where market whales punish traders for overselling. However, it remains to be seen how the upgrade will affect the price of Ether in the coming weeks."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS13aGFsZS1wb3B1bGF0aW9uLWRyb3BzLWFmdGVyLXNoYXBlbGxhLXdpbGwtZXRoLXByaWNlLXNpbmstdG9v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Ether whale population drops after Shapella — Will ETH price sink too? - Cointelegraph",
        "content": "The share of Ether held by so-called whale addresses has dropped since Ethereum's Shapella upgrade in mid April, suggesting that large investors may be leaning bearish in the near term.\n\nETH whale population shrinks post-Shapella\n\nThe amount of Ether (ETH) held by addresses with 1,000-10,000 ETH, or \"whales,\" was over 14.033 million ETH on May 1, according to Glassnode data. In comparison, the count was 14.167 million ETH on April 12, when Shapella went live on Ethereum.\n\nEther whale net position change. Source: Glassnode\n\nInterestingly, a week before the Shapella upgrade, the Ether whale cohort held 14.303 million ETH, the highest amount in 2023.\n\n\"Shrimps\" only ones buying ETH since Shapella\n\nEther's price is down over 3.5% since the Shapella upgrade — suggesting that several whales may have indeed \"sold the news.\"\n\nInterestingly, other address cohorts also showed a decline, including sharks (100-1,000 ETH), fishes (10-100 ETH), crabs (1-10 ETH) and even mega-whales (10,000+ ETH).\n\nOnly shrimps (<1 ETH) accumulated during the period, with their net position slightly increasing from 1.79 million ETH on April 12 to 1.80 million ETH on May 1.\n\nEther shrimp net position change. Source: TradingView\n\nShapella enabled investors to withdraw ETH locked via staking, which some argued would increase selling pressure.\n\nSince the Shapella upgrade, investors have withdrawn over 1.97 million ETH worth around $3.6 billion, according to Beaconcha.in. Nevertheless, no major changes in cryptocurrency exchanges' ETH balances have been seen to date.\n\nEther whales vs. shrimps\n\nHistorically, fewer Ether whales typically means heightened downside risk for the ETH price.\n\nWhale activity typically acts as a leading market indicator. So, rich investors accumulating typically precedes a price rise and vice versa.\n\nThe price-to-whale positive correlation existed until March 2020, as shown in the chart below. Afterward, retail mania took over alongside the Federal Reserve's quantitative easing, and the correlation snapped.\n\nEther whale net position change. Source: Glassnode\n\nNotably, ETH rallied from $110 in March 2020 to over $4,950 in November 2021 despite the declining number of whales. The inverse correlation continued throughout the price downtrend to around $850 in June 2022.\n\nBut since then, whale holdings have risen by nearly 1 million ETH. Meanwhile, ETH's price has more than doubled to around $1,850, hinting at a possible return of the price-to-whale correlation, which would be a bullish sign for Ether.\n\nWhere can the ETH price go next?\n\nThe $2,000 level is an important psychological resistance level for ETH/USD that bulls have been unable to break despite multiple attempts in 2023.\n\nRelated: Ethereum price outlook weakens, but ETH derivatives suggest $1.6K is unlikely\n\nOn the daily chart, ETH/USD holds above the short-term support provided by its 50-day exponential moving average (EMA), near $1,840. A successful rebound from here opens $2,000-$2,125 as the next upside target range in the second quarter.\n\nETH/USD daily price chart, with the 50-day EMA in red and 200-day EMA in blue. Source: TradingView\n\nConversely, a break below the 50-day EMA risks sending ETH toward its 200-day EMA near $1,670, down about 10% from current price levels.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8xMzg1MzYvcGhhbnRvbS1zb2xhbmEtd2FsbGV0LWV0aGVyZXVtLXBvbHlnb24tc3VwcG9ydNIBTmh0dHBzOi8vZGVjcnlwdC5jby8xMzg1MzYvcGhhbnRvbS1zb2xhbmEtd2FsbGV0LWV0aGVyZXVtLXBvbHlnb24tc3VwcG9ydD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Phantom Solana Wallet Adds Ethereum and Polygon Support - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSelf-custodial wallet Phantom announced today that simultaneous support for Ethereum and Polygon networks is live on its mobile app and browser wallets, widening users' access to dApps across the Web3 landscape, including Magic Eden, Uniswap, Aave, blur, and OpenSea.\n\nThe popular Solana wallet first announced support for rival blockchains Ethereum and Polygon in November, with the aim of providing the ability to interact with the three largest blockchains for digital collectibles in one place.\n\n\"We are dedicated to leveraging our expertise from the Solana ecosystem to drive innovation in the wallet space... in order to deliver the most versatile and user-friendly experience across all platforms,\" Phantom CEO Brandon Millman tells Decrypt, especially \"the three most prominent ecosystems: Ethereum, Polygon, and Solana.\"\n\nAD\n\nAD\n\nThe company says the new features will simplify managing multiple accounts and assets across blockchains, removing the requirement to switch between wallets and adding the ability to import existing MetaMask, Solana, and EVM wallets.\n\n\"As crypto continues to go multichain, our wallet stands out as the premier choice for users,\" Millman said.\n\nInitially launched in March 2021, Phantom launched its iOS wallet in January 2022 after raising $109 million in funding. This was followed by the launch of an Android version of the Phantom wallet in April of last year.\n\n1/ Phantom multichain is rolling out today! 🥳 Now you can use @ethereum, @0xPolygon, and @solana without switching wallets. With support for multiple secret recovery phrases, it’s easy to import all of your wallets in seconds. Compatible everywhere with a MetaMask button. pic.twitter.com/wbvwmZ1ZlJ — Phantom (@phantom) May 1, 2023\n\nThe Phantom wallet has onboarded over 100,000 users since its Ethereum and Polygon support beta last fall, the company says.\n\nAD\n\nAD\n\nAside from broadening its user base with these additions, Phantom has also stepped up its security measures in light of a rise in phishing and scam attacks on NFT holders, including Kevin Rose and Seth Green. In January, Phantom said it had scanned over 85 million transactions and blocked over 18,000 wallet-draining transactions.\n\nFuture plans, Phantom said, are the introduction of instant NFT sales and the development of a bridge to enable the transfer of assets between the Solana and Ethereum networks.\n\n“We believe that the future of digital asset management lies in cross-chain interoperability,” Brandon Millman, co-founder, and CEO of Phantom, said in a statement. “We’re committed to providing our users with the tools and resources they need to easily navigate and transact across various blockchain networks.”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLWJyaWRnZS1mcm9tLXNvbGFuYS10by1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "How to Bridge From Solana to Ethereum - Watcher Guru",
        "content": "Solana has advanced significantly in the DeFi, NFT, and Web3 markets since its launch in April 2019. Hundreds of projects are currently underway in Solana, and more are soon to follow.\n\nAccording to Solana’s website, “low cost, forever” is the company’s main selling proposition. The network is engaged in direct competition with several blockchains, including Ethereum. Even though there is competition between different blockchains, users would want to bridge from Solana to the Ethereum network. Before we dive into the detailed steps on how to bridge, let us understand what is bridging.\n\nBridging in a nutshell\n\nBridging is nothing but the process of transferring tokens or coins from one blockchain to another one. This is essential as there exist multiple blockchains with each one having their native tokens or coins. The bridge helps to move the assets from one blockchain to another, making the process easier. The process exists in general, especially for cryptocurrencies that don’t have cross-chain support. Bridging is possible through cross-chain bridges and sidechains, etc.\n\nInteroperability between Solana and Ethereum is a fascinating breakthrough in the field of blockchains. It allows users to effortlessly transfer assets between the Solana and Ethereum networks.\n\nNow that we have a basic understanding of bridging, let us focus on how to bridge from Solana to Ethereum.\n\nHow to bridge from Solana to Ethereum with Allbridge\n\nThere are a few options to look into while bridging from Solana to Ethereum. Let us look at how to do it with Allbridge. Allbridge helps to connect EVM networks like Polgon, and Ethereum with non-EVM chains like Solana, Fantom, and Near.\n\nFollow the steps below to bridge your tokens from Solana to Ethereum:\n\nGo to Allbridge.\n\nConnect your Solley, Phantom, or Exodus wallet.\n\nChoose the option from Solana to Ethereum.\n\nType in the address, select the number of tokens, and click on send to finalize the transaction.\n\nHow to Bridge From Solana To Ethereum using Portal\n\nPreviously known as Wormhole Bridge, Portal Bridge is another good option to go for to move assets between these blockchains. The portal also has better liquidity for various tokens. Here is how you can bridge tokens using Portal Bridge.\n\nVisit the Portal Bridge website.\n\nConnect your Ethereum and Solana wallets.\n\nChoose the token that you want to bridge from SOL and ETH networks.\n\nType in the number of tokens that you want to transfer.\n\nDouble-check and confirm the transaction.\n\nUsing a CEX\n\nWhile the above two options are available, it is also possible to do bridging using a CEX. But doing so also comes with the security risks of a CEX, which one should be wary of. Follow the steps below to bridge tokens from SOL to the ETH network.\n\nOpen your CEX account.\n\nGo to your wallet and transfer ETH from your wallet.\n\nOnce you receive the assets, convert your crypto to a native token, like SOL.\n\nWithdraw your SOL and then send it to your Solana wallet.\n\nWhile it is always better to use portals like Allbridge and Portal, CEX can also be considered as an option to do so. However, CEXs include the necessity to do KYC and submit personal information."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS12dWxuZXJhYmlsaXR5LTE4MDAv0gFLaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXZ1bG5lcmFiaWxpdHktMTgwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Indicators Show Vulnerability to Bigger Correction - NewsBTC",
        "content": "Ethereum price started a fresh decline from the $1,940 resistance against the US Dollar. ETH retested $1,825 and is showing a few bearish signs.\n\nEthereum struggled to settle above the $1,925 and $1,940 resistance levels.\n\nThe price is trading below $1,880 and the 100-hourly Simple Moving Average.\n\nThere was a break below a key bullish trend line with support near $1,895 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to move down if it clears the $1,800 support zone.\n\nEthereum Price Drops Again\n\nEthereum’s price started a fresh increase above the $1,850 zone. ETH struggled to settle above the $1,925 and $1,940 resistance levels, similar to Bitcoin at $29,500.\n\nA high was formed near $1,939 and the price started a fresh decline. There was a sharp decline below the $1,900 and $1,880 levels. Besides, there was a break below a key bullish trend line with support near $1,895 on the hourly chart of ETH/USD.\n\nA low is formed near $1,825 and the price is now consolidating losses. Ether price is now trading below $1,880 and the 100-hourly Simple Moving Average.\n\nImmediate resistance is near the $1,850 level. It is close to the 23.6% Fib retracement level of the recent decline from the $1,939 swing high to the $1,825 low. The next major resistance seems to be forming near $1,900 and the 100-hourly Simple Moving Average.\n\nSource: ETHUSD on TradingView.com\n\nThe 50% Fib retracement level of the recent decline from the $1,939 swing high to the $1,825 low is also near the $1,900 level. A close above the $1,900 level might start a fresh increase. In the stated case, the price could rise toward the $1,940 resistance. Any more gains could send Ether toward the $2,000 resistance.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,900 resistance, it could continue to move down. Initial support on the downside is near the $1,825 level.\n\nThe next major support is near the $1,800 zone, below which ether price might drop toward the $1,740 support zone. Any more losses may perhaps take the price toward $1,700 in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is now gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is well below the 50 level.\n\nMajor Support Level – $1,800\n\nMajor Resistance Level – $1,900\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGFpbHljb2luLmNvbS9jYXJkYW5vLWZvdW5kZXItY2hhcmxlcy1ob3NraW5zb24tcmVzcG9uZHMtdG8tamFiLWJ5LWV0aGVyZXVtLWNvLWZvdW5kZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Cardano Founder Charles Hoskinson Responds to Jab by Ethereum Co-Founder - DailyCoin",
        "content": "Charles Hoskinson is once again in another controversy.\n\nThis time, an Ethereum co-founder accuses Hoskinson of contributing nothing to Ethereum.\n\nCrypto Twitter and Hoskinson reacted to the accusations.\n\nCharles Hoskinson is known to take shots at people on the internet with his controversial takes. However, this time the Cardano founder is on the other side of criticism, targeted for his contributions to Ethereum.\n\nFabian Vogelsteller, an Ethereum co-founder, accused Hoskinson of building “literally nothing for Ethereum.” While the founder supposedly meant no harm, his words garnered quite a reaction on Twitter, even from Hoskinson himself.\n\nCharles Hoskinson Built Nothing?\n\nOn April 29, Fabian Vogelsteller stirred quite the controversy after tweeting a post about Ethereum Foundation members who built their blockchains. The post featured images of Ethereum founder Vitalik Buterin, Cardano Founder Charles Hoskinson, Polkadot Founder Gavin Woods, and Lukso Founder Fabian Vogelsteller with their net worths.\n\nThe post didn’t sit well with Vogelsteller, who took it upon himself to correct it. He suggested Charles Hoskinson should be removed from the picture because he was never really a founder of Ethereum and was just at the right place at the right time.\n\nTo correct this picture a little bit:@VitalikButerin is the ethereum founder, so he doesn’t count. @IOHK_Charles was never really a founder of ethereum. He built literally nothing for ethereum that I am aware of. He was just early on at the right place, at the time, hanging… https://t.co/zHFV4zLANR — Fabian Vogelsteller (@feindura) April 29, 2023\n\nWhile Vogelsteller clarified he meant no offense with his words, he buttressed that he had been involved in Ethereum long before it was formed and knows very well who contributed what and when.\n\nIn response to Vogelsteller’s accusations, many on Crypto Twitter quickly came to Hoskinson’s defense, flooding his post with memes and replies. Some took jabs at the Lukso founder, and others shared proof of the Cardano Founder donning an Ethereum shirt and spreading the word.\n\nAfter things got out of hand, Hoskinson chimed in with his casual sarcasm.\n\nThanks Fabian. Glad to get your opinion on my worth and contributions. I suppose Switzerland just materialized out of the ether. Also given my profound incompetence, I'd love to meet the people behind Cardano. Pretty cool project to just somehow self manifest — Charles Hoskinson (@IOHK_Charles) April 30, 2023\n\nThe Cardano founder sarcastically thanked Vogelsteller for his comments while hinting at Switzerland and Cardano. Notably, Hoskinson registered the Ethereum Foundation in Switzerland and served as CEO before leaving to build IOG and Cardano in 2015 and 2017, respectively.\n\nThe rowdy founder left Ethereum when his vision did not align with Buterin.\n\nSoon after Hoskinson’s reply, Vogelsteller again explained he meant no offense to the Cardano Founder’s work or skills. Instead, he meant Hoskinson did nothing based purely on code contributions. He added he didn’t plan to instigate blockchain drama.\n\nTo which the Cardano founder has yet to respond.\n\nOn the Flipside\n\nIn March, Hoskinson shared that Crypto Twitter and cryptocurrency media content spread FUD instead of constructive information.\n\nWhy You Should Care\n\nCardano Founder Charles Hoskinson is one of the most influential figures in the Crypto community. Controversies related to the rowdy founder often reach a considerable audience. Vogelstellar could likely be using the controversy as a marketing ploy to generate interest in his project, Lukso.\n\nFAQs\n\nDid Charles Hoskinson work on Ethereum? Charles Hoskinson joined Ethereum in 2013 as one of the five founders with Vitalik Buterin, Gavin Wood, Anthony Di Iorio, Amir Chetrit, and Jeffrey Wilcke. He served as the CEO for a short period, after which he left in 2014. When did Charles Hoskinson leave Ethereum? Charles Hoskinson left Ethereum in 2014 over a dispute with Vitalik Buterin on whether the project should be for-profit or non-profit. Hoskinson believed Ethereum should take the commercial route and become like Google, whereas Buterin believed the project should be modeled after Mozilla, a non-profit organization. Hoskinson went on to form IOHK and Cardano. Will Cardano ever replace Ethereum? Ethereum is a long-established network and powers a wide range of Layer-2 products, giving it the second-largest market capitalization of $227 billion. In contrast, Cardano has taken an intentionally slow, dev-focused approach to its blockchain. Despite being heralded for its consistency, the project has drawn scrutiny for falling behind, which is evident in the poor growth of its market cap. At $13 billion, Cardano has a long way to go in replacing Ethereum. What is Charles Hoskinson saying about Cardano? Charles Hoskinson believes Cardano still has a lot of building to do and is about 85% complete. He explains that many delays and issues surrounding Cardano can be attributed to focusing on the wrong technology and being too ambitious with its roadmap. Hoskinson plans to expand Cardano’s reach in West Africa, with Ghana as a prime focus.\n\nRead more about Charles Hoskinson’s other controversies:\n\nCharles Hoskinson Calls Competition ‘Ignorant’ on Cardano Security\n\nMajor auction house Sotheby’s released a new NFT Marketplace:\n\nSotheby’s Launches New NFT Marketplace on Ethereum and Polygon"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDUvMDEvY2FyZGFuby1mb3VuZGVyLXJlc3BvbmRzLXRvLWNyaXRpY2lzbS1vZi1idWlsZGluZy1ub3RoaW5nLWZvci1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Cardano Founder Responds to Criticism of 'Building Nothing for Ethereum' - The Crypto Basic",
        "content": "Ethereum (ETH) Co-founder Clashes with Cardano Founder Over His Work at Ethereum.\n\nThe founder of the LUKSO network had insinuated that Cardano founder Hoskinson did not contribute to Ethereum.\n\nCharles Hoskinson, the founder of Cardano and co-founder of Ethereum, recently had a clash of words with Fabian Vogelsteller, another Ethereum co-founder and founder of the LUKSO blockchain. Vogelsteller had recently indicated that Hoskinson made no meaningful contributions to Ethereum.\n\n- Advertisement -\n\nNotably, three of Ethereum’s co-founders, Hoskinson, Vogelsteller, and Gavin Wood, left Ethereum and launched their respective networks. Responding to a two-year-old tweet that compared the progress of these networks, Vogelsteller noted that the comparison is only between LUKSO, the chain he founded, and Gavin Wood’s Polkadot network.\n\nTo correct this picture a little bit:@VitalikButerin is the ethereum founder, so he doesn’t count. @IOHK_Charles was never really a founder of ethereum. He built literally nothing for ethereum that I am aware of. He was just early on at the right place, at the time, hanging… https://t.co/zHFV4zLANR — Fabian Vogelsteller (@feindura) April 29, 2023\n\nHe stressed that Hoskinson cannot be regarded as an Ethereum co-founder because “He built literally nothing for Ethereum that I am aware of.” According to Vogelsteller, Hoskinson was only fortunate to be at the right place at the right time “hanging out.”\n\n- Advertisement -\n\nTo buttress his point, Vogelsteller argued that he had been involved in Ethereum long before the network was formed and is fully aware of who made valuable contributions to the launch. He mentioned that the primary work that birthed the network was done before 2014, when most of the “co-founders” were onboard.\n\nHoskinson Responds\n\nResponding to Vogelsteller, Hoskinson employed his usual tactic of sarcasm, expressing gratitude to Vogelsteller for his comments. “[…] given my profound incompetence, I’d love to meet the people behind Cardano. Pretty cool project to just somehow self-manifest,” Hoskinson sarcastically remarked.\n\n“I suppose Switzerland just materialized out of the ether,” he said.\n\nThanks Fabian. Glad to get your opinion on my worth and contributions. I suppose Switzerland just materialized out of the ether. Also given my profound incompetence, I'd love to meet the people behind Cardano. Pretty cool project to just somehow self manifest — Charles Hoskinson (@IOHK_Charles) April 30, 2023\n\nIt bears mentioning that Hoskinson is regarded as one of the biggest contributors to Ethereum, helping to launch the Ethereum Foundation and the ICO in June 2014, which raised 31,000 BTC.\n\nHoskinson registered the Foundation in Switzerland and served as CEO briefly before leaving to form IOHK in 2015 and Cardano in 2017. Hoskinson left due to disagreement on whether Ethereum should be for-profit or non-profit. He had argued that the project should be for-profit, while Vitalik Buterin disagreed. While there are reports that Hoskinson left willingly, others claim Buterin fired him.\n\nThe recent incident with Vogelsteller is not the first public disagreement between two Ethereum co-founders, as Hoskinson and Buterin had also thrown subtle jabs at each other in the past. Last December, as The Crypto Basic reported, Hoskinson sarcastically swiped at Buterin over his comments on Elon Musk’s search for a new Twitter CEO."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vZm9ya2FzdC5uZXdzL3doYXQtaXMtbGF5ZXItMy1rZXktdG8tYmxvY2tjaGFpbi1mdXR1cmUv0gFCaHR0cHM6Ly9mb3JrYXN0Lm5ld3Mvd2hhdC1pcy1sYXllci0zLWtleS10by1ibG9ja2NoYWluLWZ1dHVyZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "What is layer 3, and why is it key to blockchain’s future - Forkast News",
        "content": "In stark contrast to the last two years, 2023 has the opportunity to lay a new foundation for the evolution of blockchain. That’s because this year will be defined by the application layer of the blockchain that will open a whole host of new scaling solutions. At this layer, the Web3 community has an opportunity to focus on refining both the underlying technology that powers the blockchain and the way it approaches much-needed solutions to some of the most insidious problems that the crypto industry faces. In this way, layer 3s are set to help drive new innovation and mass adoption.\n\nWhat exactly are layer 3s?\n\nLayer 1s are characterized as the foundational blockchains like Bitcoin and Ethereum that have their own native cryptocurrency used to reward those who work to secure the network itself. L2s are protocols built on top of L1s designed to increase transaction speed and mitigate scaling difficulties of layer 1s while leveraging the security of the base chain. For example, Arbitrum is an L2 created to improve Ethereum’s speed of processing transactions as well as overall flexibility and scalability, and it has given birth to a broad range of DeFi protocols. Layer 3s, on the other hand, offer even higher levels of customizability. At this layer, developers can carry out customized designs that L2s cannot easily achieve, especially for lower-cost execution and privacy-preserving functionalities.\n\nHow L3s can lower cost and improve scalability\n\nWhile L2s are currently being used for general-purpose scaling, L3s enable customized scaling and realize important functionalities — such as privacy — that L2s can’t effortlessly achieve on their own. L3s increase computation speeds and scalability of single applications by not having to share ZK-circuits with other applications on a single chain.\n\nThe Ethereum multi-layer architecture was first proposed by the StarkWare team in Ethereum multi-layer architecture. The current L2 serves as a general-purpose scaling, while L3 accomplishes customized scaling. For example, an L3, which adopts customized circuits depending on the demand of a specific decentralized application, can achieve better performance. Another example is Validium as L3. This design provides higher levels of throughput at a relatively low cost for decentralized apps by avoiding pushing compressed data to the L1 and utilizing validators to secure the digital asset. L3s can be employed as low-cost and high-performance scaling solutions that allow projects to have more choices for potential solutions, depending on their particular use cases.\n\nCurrent barriers to L3 adoption\n\nLayer 3s are just now emerging, and as such there are several issues and barriers that need to be overcome to bring them to the next level. One of the main challenges is the lack of standardized infrastructure for L3s. Since L3s are built on top of L2s, they require a standard infrastructure to operate efficiently. Without this standardization, L3s may not be able to achieve their full potential, making it harder for developers to build applications on top of them.\n\nAnother challenge is the need for more development in ZK-rollup technology, which is the underlying technology for L3s. ZK-rollups have the potential to significantly improve the efficiency and scalability of L3s, but more work needs to be done to optimize this technology and make it more accessible to developers.\n\nThe Web3 ecosystem is actively working on developing new and improved zero-knowledge technologies and infrastructure for layer 3s. By standardizing infrastructure and continuing to innovate in ZK technology, we can overcome these small challenges facing L3s and bring them to the forefront of blockchain scaling solutions, driving innovation and widespread adoption across every industry.\n\nWhat does the future of L3s look like?\n\nWhile L2s offer a general-purpose scaling platform today and function as the most cost-effective solution for now, the future belongs to a multi-layered network — one that can provide even more cost optimization and efficiency across the board.\n\nToday, L3s are still in their very early stages. As we know, the underlying technologies of L3s are closely tied to ZK-rollups. Therefore, exploring ZK technology will be essential to the development of L3s. That means that, as the Web3 ecosystem continues to focus on building out new and improved ZK technologies, more refined and elegant L3s will come to the fore.\n\nThese new solutions are uniquely poised to make scaling easier and more cost-effective than they have ever been, while simultaneously offering more customized functionalities than ever before. As a result, L3s will enable the whole industry to drive innovation forward — something that will help imbue blockchain with more use cases across every industry, leading to an inevitable increase in widespread adoption."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9kby15b3UtbmVlZC10by10aGluay10d2ljZS1iZWZvcmUtcmVzdGFraW5nLXlvdXItYXNzZXRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Do You Need to Think Twice Before Restaking Your Assets? - Unchained - Unchained",
        "content": "Episode 488\n\nStaking in Ethereum is increasingly harder to understand. Experts Sreeram Kannan and Konstantin Lomashuk go deep into all things staking, and how to understand the risks."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1jb25jbHVkZXMtYXByaWwtd2l0aC1hLW5ldy1hdGgtZm9yLWV0aC0yLTAtZGVwb3NpdC1jb250cmFjdHMv0gFgaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWNvbmNsdWRlcy1hcHJpbC13aXRoLWEtbmV3LWF0aC1mb3ItZXRoLTItMC1kZXBvc2l0LWNvbnRyYWN0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Ethereum concludes April with a new ATH for ETH 2.0 deposit contracts - AMBCrypto News",
        "content": "Ethereum staking and deposit contracts soar to new ATHs.\n\nETH struggles to regain bullish momentum as whales sell pressure prevails.\n\nNow is a good time to assess Ethereum and its native coin’s performance as April comes to its conclusion. ETH managed to push to a new YTD high during mid-month but investors’ confidence has dwindled since.\n\nHowever, there is one aspect of the network that may rejuvenate investors’ interest.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nAlthough ETH’s price action has been affected by shifting market dynamics, there is one area in which Ethereum has maintained a more pleasing performance.\n\nAccording to a recent Glassnode report, ETH 2.0 deposit contracts have been experiencing robust growth and recently reached a new all-time high.\n\n? #Ethereum $ETH Total Value in the ETH 2.0 Deposit Contract just reached an ATH of 18,868,062 ETH View metric:https://t.co/SzbMPqvhlb pic.twitter.com/B9sqXP3t8s — glassnode alerts (@glassnodealerts) April 30, 2023\n\nBut what does it mean for the network? Well, the higher deposit contracts reflect more confidence in the network.\n\nIt also reflects the growing amount of ETH staked. The total value of ETH staked stood at slightly over 19 million ETH and was at a new all-time high (ATH), at the time of writing.\n\nUnderstanding the lack of price correlation\n\nAlthough ETH staked and deposit contracts have reached new highs, ETH’s price action has not necessarily reaped the benefits. This is largely because the cryptocurrency has experienced outflows since the second week of April.\n\nAs a result, its price tanked by a significant margin. ETH’s $1918 press time price represented a 10.8% discount from its current 2023 high.\n\nSo why is ETH still holding back? Well, part of the reason is that whales have been trimming their balances. Addresses holding over 1000 ETH have contributed to selling pressure since the second week of April.\n\nPrecisely, the selling pressure from whales continued especially in the second half of April. As a result, bullish expectations were curtailed, and sell pressure was fueled by leveraged long liquidations. This brings us to the question of- What to expect in the first half of May.\n\nRealistic or not, here’s Ethereum market cap in BTC’s terms\n\nWe observed a slight recovery in open interest in the last five days, as well as an increase in demand for leverage.\n\nThe recovery suggests that the market condition is improving gradually, but it also indicates low demand. As noted earlier, ETH whales are still selling. This means the bulls may still not show off their strength until the whales cease selling and contribute to bullish volumes."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tb3JlLXRwcy1sZXNzLWdhcy1ldGhlcmV1bS1sYXllci0yLXN0YXJrbmV0LW91dGxpbmVzLXBlcmZvcm1hbmNlLXVwZ3JhZGVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "More TPS, less gas: Ethereum L2 Starknet outlines performance upgrades - Cointelegraph",
        "content": "Layer-2 blockchain protocols have been in the spotlight in 2023, bringing major performance improvements to a variety of platforms and services operating in the Ethereum ecosystem.\n\nZero-knowledge (ZK) proofs have been key in the roll-out of a variety of layer 2s, with the technology pioneered by the decentralized scaling network Starknet. StarkWare, the technology firm behind the scaling platform, has outlined plans to further improve its layer-2 network to meet an expected increase in users and developers through the rest of the year.\n\nCointelegraph caught up with Eli Ben-Sasson, president and co-founder of StarkWare, to unpack key points set out in a 2023 roadmap for Starknet. Chief among a list of to-dos is performance improvements that are centered around higher throughput and reduced latency of Starknet’s network.\n\nBen-Sasson highlighted the focus on performance upgrades that are expected to deliver significantly higher transactions per second (TPS) than on Ethereum’s mainnet at lower gas costs:\n\n“The most important thing is for builders and developers to have high throughput so that they can really build. Starknet is about increasing the computational abilities of Ethereum and we just want to provide this raw power to the hands of developers.”\n\nStarknet v0.12.0 is expected to be released in the next month and is the culmination of a six-month sprint that involves transitioning Starknet’s development stack to a Rust-based Sequencer as well as an open-source project that has built a Rust-Cairo virtual machine.\n\nStarkWare open-sourced its programming language compiler Cairo early in 2023, with the language aimed at driving the development of ZK-rollup and validity-proof-powered decentralized applications (DApps).\n\nRelated: Privacy, scaling drives use cases for zero-knowledge technology\n\nBen-Sasson added that Starknet continues to chase an ambitious target of processing at least 10 times the throughput of Ethereum at a tenth of the cost. He highlighted StarkEx’s ability to deliver significant TPS on the decentralized exchange dYdX. StarkEx is another layer-2 scaling engine developed by StarkWare.\n\nAt times, dYdX processes up to 54 transactions per second, while the average TPS of Ethereum is around 10–12. Ben-Sasson also noted that these dYdX transactions are roughly four to five times larger than those on Ethereum, which bodes well for the improved scaling capabilities of Starknet in the near future:\n\n“We’re often experiencing practical TPS or gas usage that is orders of magnitude greater than what Ethereum can deal with. I’m very confident that this will also be replicated on Starknet.”\n\nPerformance improvements have been prioritized as a result of developer and user feedback highlighting delays in transaction processing on Starknet. The next port of call is the reduction of transaction costs, which will be addressed by targeting the cost of storing data on Ethereum’s mainnet.\n\n“We’re going to roll out Volition, which allows users to opt as to whether they want their data on or off-chain and this will be part of the base layer of the Starknet system.”\n\nBen-Sasson said the release of off-chain data availability will complement Ethereum’s in-development improvement proposal “Proto-Danksharding” Ethereum Improvement Proposal (EIP) 4844, which will introduce a new type of transaction that carries binary large objects or “blobs.” The EIP fundamentally aims to provide cheaper transactions.\n\nStarknet is also aiming to deliver faster finality further down the 2023 roadmap, which will produce shorter and fixed interval block times on the network. This will be carried out with the introduction of a fee market to prioritize Starknet’s network resources on users’ willingness to pay for transactions, inspired by conventional market systems:\n\n“Market mechanisms are a very good way to solve this. Blockchain didn’t invent this — blockchains adopted this from just the conventional world. That’s how you prioritize resources and allow users to signal this.”\n\nA number of Ethereum layer-2 protocols have begun rolling out ZK-rollups to further improve efforts to provide faster and cheaper transactions to the smart contract blockchain network. This includes the likes of Polygon and ConsenSys.\n\nMagazine: Here’s how Ethereum’s ZK-rollups can become interoperable"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLWVhcm4tZnJlZS1ldGhlcmV1bS1pbi0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "How to Earn Free Ethereum in 2023? - Watcher Guru",
        "content": "Ethereum, the second-most popular cryptocurrency after Bitcoin, has gained immense popularity recently. Because of this, many people wonder, “How do I earn free Ethereum in 2023?”\n\nWhile most people are familiar with buying and selling Ethereum, few know that they can earn it for free.\n\nYes, you heard it right!\n\nYou can earn free Ethereum in 2023 by participating in various programs and activities.\n\nThe idea of earning free Ethereum may seem too good to be true, but it is not. Many crypto exchanges and blockchain networks are offering free Ethereum to attract users.\n\nYou can earn Ethereum by watching videos, completing tasks, playing games, and more.\n\nIn this article, we will explore the various ways to earn free Ethereum and help you understand its risks and limitations.\n\nSource: Bitcoinist\n\nIs It Too Good to Be True? Understanding the Risks and Limitations\n\nBefore we dive into the popular methods of earning free Ethereum, it is essential to understand their risks and limitations.\n\nFirstly, earning free Ethereum does not mean you are making a passive income. It is more of a one-time reward for completing a task or participating in a program. Therefore, it would help if you did not consider it a means of earning a regular income.\n\nSecondly, there are always risks associated with cryptocurrency exchanges and blockchain networks. While some are legitimate and trustworthy, others may not be. It is essential to do your research and make informed investment decisions.\n\nLastly, some programs may require you to provide your email address or other personal information. It is crucial to read the terms and conditions and understand how your data will be used.\n\nPopular Methods to Earn Free Ethereum in 2023\n\nNow that we have discussed the risks and limitations let us move on to the popular methods of earning free Ethereum in 2023.\n\nWatch Videos\n\nMany blockchain networks and crypto exchanges offer free Ethereum for watching videos. These videos are usually related to cryptocurrency and blockchain technology.\n\nYou can earn anywhere between a few cents and a few dollars for watching these videos. While it may not be substantial, it is an easy way to earn free Ethereum.\n\nComplete Tasks\n\nCompleting tasks is another popular way to earn free Ethereum.\n\nYou can participate in bounty programs, complete specific tasks like marketing, content creation, or bug reporting, and receive Ethereum as a reward.\n\nBlockchain startups and companies looking to promote their products and services usually offer these programs.\n\nPlay Games\n\nBlockchain-based games are becoming increasingly popular, and some offer free Ethereum rewards. You can earn Ethereum by playing games, participating in tournaments, or completing challenges. While it may not be substantial, it is a fun way to earn free Ethereum.\n\nSource: CNBC\n\nParticipate in Airdrops\n\nAirdrops are when a blockchain network or crypto exchange offers free cryptocurrencies to its users.\n\nYou usually need to hold a specific cryptocurrency or participate in a specific program to participate in an airdrop.\n\nAirdrops can be an excellent way to earn free Ethereum, but it is essential to research the program’s legitimacy before participating.\n\nHow Do I Participate in The Free Crypto Giveaway in 2023?\n\nMany blockchain networks and crypto exchanges will offer free Ethereum in 2023 as a giveaway program.\n\nTo participate, you must sign up for the program and complete specific tasks, such as referring friends or completing surveys.\n\nReading the terms and conditions and understanding the program’s rules is crucial. Some programs may require holding a specific cryptocurrency or meeting other requirements.\n\nMining Ethereum on Your Phone: Is It Worth It?\n\nMining Ethereum on your phone is another way to earn free Ethereum.\n\nHowever, mining on a computer or specialized mining rig is not as profitable. Mining on your phone can drain your battery and may not be worth the rewards.\n\nMoreover, mining requires a lot of computational power, and phone mining may be insufficient. It is essential to do your research and understand the risks and limitations before mining Ethereum on your phone.\n\nConclusion: Earning Free Ethereum in 2023 is Great, But It’s Important to Do Your Research\n\nIn conclusion, earning free Ethereum in 2023 is a great way to participate in crypto and earn rewards for completing tasks. There are various ways to earn free Ethereum, such as by watching videos, completing tasks, playing games, and participating in airdrops.\n\nHowever, it is crucial to understand its risks and limitations before participating in any program or activity.\n\nEarning free Ethereum is a fun way to participate in crypto and earn rewards for completing tasks. However, it is essential to understand its risks and limitations. It is not a means of earning a regular income; it is crucial to research and make informed investment decisions."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGFpbHljb2luLmNvbS9zb3RoZWJ5cy1uZXctbmZ0LW1hcmtldHBsYWNlLWV0aGVyZXVtLWFuZC1wb2x5Z29uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Sotheby's Launches New NFT Marketplace on Ethereum and Polygon - DailyCoin",
        "content": "In light of the rise of NFT marketplaces cutting creator rebates, Sotheby’s has released a new NFT marketplace.\n\nSotheby’s takes an artists-first approach by enforcing royalties via Ethereum and Polygon smart contracts.\n\nSotheby’s, the iconic auction house famous for selling curated art pieces, including rare CryptoPunks, is again making waves in the NFT sector.\n\nAfter repeatedly selling some of the most expensive jpegs in history, the art house seeks to scale up with an NFT marketplace that empowers users, collectors, and artists.\n\nGiven the rising popularity of ‘no royalty’ and ‘reduced creator rebates’ stances among popular NFT marketplaces such as Blur, OpenSea, and LooksRare, Sotheby’s new platform doubles down on standing out with its artist-first approach.\n\nSotheby’s Artist-First NFT Marketplace\n\n279-year-old British-American auction house Sotheby’s has rolled out its new on-chain marketplace that enables digital art collectors to trade curated NFTs hand-picked by the art house’s specialists.\n\nThe new NFT marketplace fully features on-chain peer-to-peer transactions executed on the Ethereum and Polygon blockchains, allowing users to pay in ETH or MATIC. Additionally, it showcases all the essentials that leading NFT marketplaces offer except for when it comes to royalties.\n\nIn a press release, Sotheby’s shared:\n\n“Sotheby’s commitment to honoring artist royalties comes amidst a larger debate about royalties within the NFT community and signals Sotheby’s artist-first ethos as one of the only major NFT marketplaces committed to artist resale royalties.”\n\nMany notable platforms, such as OpenSea and Blur, are cutting creators out of the equation with their trader-first approach. On the other hand, Sotheby’s stands out with its artist-first approach and ensures creators are paid for their work.\n\nMany on Twitter celebrated the launch as a big step for artists.\n\nSotheby’s NFT marketplace will debut with a select group of artists rotating every few months. The platform will feature works from 13 artists, including Tyler Hobbs, XCOPY, Diana Sinclair, Pindar van Arman, and others.\n\nOn The Flipside\n\nSotheby’s has announced that it would auction off NFTs from the Grails collection, part of now-defunct hedge fund 3AC’s asset portfolio.\n\nMarketplaces like Blur account for over half of the trading volume generated by NFT traders. This, in turn, has prompted leading NFT marketplaces like OpenSea to follow suit and cut rebates to stay relevant.\n\nWhy You Should Care\n\nSotheby’s is one of the oldest auction houses in the world. The auction house took a big step when it embraced Web3 in 2021, but this time it took an even more significant step by staying committed to artist royalties when many NFT marketplaces are rolling back on supporting creator royalties.\n\nRead how Jack Dorsey’s ventures are shaking up Web3:\n\nJack Dorsey Goes All In. Could Bluesky and His Bitcoin Mining Chip Revolutionize Web3?\n\nRead how OpenSea Dethroned Blur:\n\nOpenSea Pro Dethrones Blur in Daily Users – Here’s How"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZm9ya2FzdC5uZXdzL3NvdGhlYnlzLWxhdW5jaGVzLW5mdC1tYXJrZXRwbGFjZS1mb3ItdHJhbnNhY3Rpb25zLW9uLWV0aGVyZXVtLXBvbHlnb24tbmV0d29ya3Mv0gFpaHR0cHM6Ly9mb3JrYXN0Lm5ld3Mvc290aGVieXMtbGF1bmNoZXMtbmZ0LW1hcmtldHBsYWNlLWZvci10cmFuc2FjdGlvbnMtb24tZXRoZXJldW0tcG9seWdvbi1uZXR3b3Jrcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Sotheby’s launches NFT marketplace for transactions on Ethereum, Polygon networks - Forkast News",
        "content": "Sotheby’s, which accounts for 24% of global art auction sales, has launched an online secondary marketplace for its curated non-fungible tokens (NFTs) as the 279-year-old auction house for fine art expands its push into digital assets.\n\nSee related article: Sotheby’s to auction off NFTs owned by defunct hedge fund Three Arrows Capital\n\nFast facts\n\nSotheby’s tweeted on Monday that its new NFT marketplace, built by its Sotheby’s Metaverse unit, will feature a rotating, curated selection of artists hand-picked by Sotheby’s specialists, and collectors can make transactions on its platform.\n\n“Fully on-chain peer-to-peer transactions will be executed on the Ethereum and Polygon blockchains,” Sotheby’s said in the tweet, adding that artist resale royalties will be “honored directly on-chain through marketplace smart contracts.”\n\nThe secondary marketplace will host NFT artwork on rotation, featuring works from digital artists, including XCOPY, Tyler Hobbs and Claire Silver, the company said.\n\nSotheby’s is an early adopter of cryptocurrency in the auction world. In July 2021, the company sold a 101.38-carat diamond for HK$95.1 million (US$12.1 million) in an unspecified cryptocurrency at an auction in Hong Kong.\n\nLast month, Sotheby’s said it will hold sales of the so-called “Grails” art collection, which consists of NFT artwork that belongs to the bankrupt crypto hedge fund Three Arrows Capital, during its Marquee Sale Week at Sotheby’s New York starting May 19.\n\nSee related article: Why I’m excited about commercial IP NFTs"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8xMzg0OTgveW91LWNhbi1ub3ctdXNlLXlvdXItanBlZ3MtYm9ycm93LWV0aGVyZXVtLW5mdC1tYXJrZXRwbGFjZS1ibHVy0gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzEzODQ5OC95b3UtY2FuLW5vdy11c2UteW91ci1qcGVncy1ib3Jyb3ctZXRoZXJldW0tbmZ0LW1hcmtldHBsYWNlLWJsdXI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "You Can Now Use Your JPEGs to Borrow Ethereum on NFT Marketplace Blur - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe NFT-backed loan market is gaining steam, with total loan value to date recently topping $1 billion across various protocols—and now the current largest Ethereum NFT marketplace by trading volume is getting in on the action, too.\n\nToday, NFT marketplace Blur announced the creation of Blend, a peer-to-peer perpetual lending protocol based around NFT assets. Short for “Blur Lending,” Blend lets NFT collectors take loans out on their existing assets, and also lets liquidity providers earn interest by loaning out ETH with the NFT serving as collateral.\n\nUnlike some lending protocols, Blend does not have set timeframes for loans to be repaid. Instead, they’re perpetual, which means that they continue to accrue interest until repaid, or until the lender triggers a refinancing auction. This allows another lender to take over the loan, if desired, otherwise a liquidation auction can be triggered for the NFT collateral.\n\nAD\n\nAD\n\nFurthermore, the loans do not rely on oracles, or external, off-chain data sources. That means that a loan on Blend will not look at NFT pricing data across marketplaces, which is used by some lending protocols (like BendDAO) to determine liquidation criteria.\n\nIn a tweet thread, Blur wrote that Blend \"enables 10x higher yield opportunities than current DeFi protocols and unlocks greater liquidity for NFTs.\" Blend currently has no fees for borrowers or lenders, but BLUR token holders can vote to enable fees after 180 days.\n\nBlur teased in a tweet thread that it will launch two “huge new products” today built around Blend. Full details on how the protocol works are listed in the official white paper.\n\n1/ Introducing Blend: the Peer-to-Peer Perpetual Lending Protocol for NFTs. Built in collaboration with @danrobinson and @transmissions11 at @paradigm, Blend enables 10x higher yield opportunities than current DeFi protocols and unlocks greater liquidity for NFTs. Here’s how 👇 pic.twitter.com/uOFC6i3LSq — Blur (@blur_io) May 1, 2023\n\nThe protocol was built in collaboration with Dan Robinson and the pseudonymous Transmissions11 from crypto venture capital firm, Paradigm, which led Blur’s own $11 million seed funding round back in March 2022.\n\nAD\n\nAD\n\nBlur launched last fall as an upstart rival to the then-leading NFT marketplace OpenSea, with plans to offer token rewards to incentivize traders. The platform took the lead in the NFT space in terms of total trading volume this February after Blur’s initial token airdrop, as high-volume traders rapidly flipped assets to earn BLUR token allotments.\n\nWhile the trading hype has fallen since February, Blur remains on top in terms of trading volume.\n\nOver the past week, Blur has commanded about 58% of NFT trading volume across marketplaces, per data from Dune, racking up about $98.5 million worth of trades. However, OpenSea still leads in terms of total trades, with about 47% share via nearly 80,000 trades.\n\nThe NFT lending market recently topped the $1 billion mark and continues to grow, with lending protocol NFTfi leading the charge with over $406 million worth of loans to date. BendDAO is second with about $308 million worth, per data from Dune."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZGVjcnlwdC5jby8xMzg1MzIvc3BvcnRzLWlsbHVzdHJhdGVkLWJveC1vZmZpY2UtbmZ0LXRpY2tldHPSAUlodHRwczovL2RlY3J5cHQuY28vMTM4NTMyL3Nwb3J0cy1pbGx1c3RyYXRlZC1ib3gtb2ZmaWNlLW5mdC10aWNrZXRzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Sports Illustrated Embraces Ethereum for NFT Event Tickets - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSports Illustrated Tickets (SI Tickets) today announced Box Office, a new NFT ticketing platform built on Polygon, an Ethereum scaling network. The move marks the storied sports media brand's entry into primary ticket sales alongside its SI Tickets secondary marketplace that launched in 2021.\n\nBox Office is now part of SI Tickets, the online marketplace that resells tickets to major events across sports, concerts, and theater. SI Tickets is a division of the overall Sports Illustrated magazine and media brand.\n\nInstead of catering to the biggest events in sports and music, Box Office welcomes ticket listings from smaller community events that typically might otherwise appear on ticketing sites such as Eventbrite or DICE.\n\nAD\n\nAD\n\n“We're not here to compete against Ticketmaster, SeatGeek, or AXS. We're going after the self-service event market,” SI Tickets CEO David Lane told Decrypt.\n\n“We’re trying to create the first mass-market adoption of NFT ticketing,” he continued, “so that everyone from a 15-year-old to a 90-year-old can buy their first NFT ticket without having to go through a crypto tutorial on blockchain, or have to get a wallet and understand any aspects of it.”\n\nBox Office was built with Ethereum software studio ConsenSys.\n\nBox Office’s NFT tickets will be found inside the SI Tickets mobile app. In addition to granting entry, event organizers can also equip tickets with content such as photo and video highlights, collectibles, personalized messages, promotional offers, and loyalty rewards to engage with fans. Content can be recorded and uploaded before, during, and after an event.\n\nTickets for an upcoming Texas youth football championship game—set to seat up to 2,000 fans—will be listed on Box Office, for example. In addition to youth sports, Box Office expects to list both free and paid tickets from partnered music venues, nightclubs, business conferences, private parties, fitness and yoga studios, comedy clubs, religious retreats, and charity organizers.\n\nAD\n\nAD\n\n“As the global economy continues to recover from the pandemic, we expect that live events, concerts, and sporting events will regain their pre-pandemic popularity,” Johnna Powell, global co-head of ConsenSys NFT, said in a statement to Decrypt. “The combination of these factors suggests that consumer demand for NFT event ticketing will increase in the coming years.”\n\nLane claims SI’s Box Office has a 20% lower fee structure than Eventbrite. Fans can also transfer their tickets to NFT marketplaces and other secondary ticket platforms such as Vivid Seats, SeatGeek, and Stubhub to resell their Box Office NFT tickets.\n\nSports Illustrated is offering a 50-50 revenue split on resales with event organizers and performers, and will do so by tracking the on-chain data of Box Office transactions.\n\n“You always get paid when your ticket sells, but you don't participate in the resale of that on the secondary market—but that's what changes here,” Lane said.\n\n“We’re splitting 50-50 with our partners. They’re gonna get 50% of the resale revenue,” he added. “For the events that have resale value, this is one of the great advantages of NFT ticketing. That's why I really do believe that this will become the standard as we go forward.”\n\nUsers who purchase a ticket on Box Office will also receive a $10 bonus for buying tickets to any of the 250,000 major events listed on the SI Tickets secondary marketplace, whose A-list events will appear alongside Box Office events in the same app.\n\n“Your event is going to be listed on our site next to the biggest sports, concerts, and theater events in the area,” Lane said. “[Organizers] are no longer relegated to a hyperlocal Eventbrite-type of landing page. You're literally alongside Taylor Swift, Billy Joel, and the Knicks. It gives great visibility to any event that wants to partner with us.”\n\nThe NFL has offered free virtual commemorative NFT ticket stubs on Ticketmaster since 2021 for fans who purchased traditional tickets to attend games, while MLB’s partnership with Candy Digital also includes commemorative NFT tickets. Ticketmaster introduced an Ethereum NFT token-gating feature in March for artists to give their NFT-holding fans early access to tickets.\n\nAD\n\nAD\n\n“[Box Office] is really about mass adoption of NFT ticketing—not novelty, niche, limited quantity drops,” Lane said. “This is something that everybody can use. It's applicable to every type of event. We expect this is going to be the entry point for millions to be able to enter blockchain and get their first NFT ticket.”\n\nEditor's note: This story was updated after publication to clarify that Sports Illustrated Tickets (SI Tickets) is a division of Sports Illustrated."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGFpbHljb2luLmNvbS9jdXJ2ZS10ZXN0cy1uZXctc3RhYmxlY29pbi1jcnZ1c2QtYWhlYWQtb2YtZXRoZXJldW0tbWFpbm5ldC1sYXVuY2gv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Curve Tests New Stablecoin crvUSD Ahead of Ethereum Mainnet Launch - DailyCoin",
        "content": "Curve has deployed crvUSD smart contracts on the Ethereum Sepolia testnet.\n\ncrvUSD will be backed by various crypto assets.\n\nThe new stablecoin will use a novel lending-liquidating AMM algorithm.\n\nThe current bear market in the crypto industry has made multiple companies bankrupt, and stablecoins lose their pegs. These incidents have shown that the perfect stablecoin has yet to be created.\n\nHowever, this might change soon as Curve, a decentralized finance platform, is preparing to launch its own decentralized stablecoin crvUSD.\n\nCurve Tests New Stablecoin crvUSD\n\nCurve, one of the oldest and most battle-tested decentralized finance (DeFi) platforms, is about to launch its new stablecoin crvUSD.\n\nThe platform deployed the smart contracts for crvUSD on the Sepolia testnet on Tuesday in preparation for launch on Ethereum mainnet.\n\ncrvUSD is a decentralized stablecoin that will be pegged to the U.S. dollar and overcollateralized by various crypto assets. This approach is almost identical to how DAI, another decentralized stablecoin created by Maker, works.\n\nHowever, there are specific differences between the two. crvUSD will use a lending-liquidating AMM algorithm, or LLAMMA, which works by converting between the provided collateral and the stablecoin, depending on which is higher and which is lower.\n\nFor example, if the price of the collateral in the form of ETH is high, users’ deposits are comprised solely of ETH. If the collateral depreciates, LLAMMA converts some of it to the stablecoin, helping better manage collateralization risks.\n\nCurve is the largest decentralized exchange in terms of total value locked (TVL). It currently has a TVL of $4.29 billion and is deployed on 12 different blockchains, according to data from DefiLlama.\n\nOn the Flipside\n\nIt will be tough for crvUSD to outcompete MakerDAO’s DAI, which currently has a market capitalization of $4.71 billion.\n\nWhy You Should Care\n\nUSDC and USDT, the two dominant centralized stablecoins in the market, have both depegged during the current crypto bear market. A new decentralized stablecoin might prove to be vital for the market.\n\nRead more about Circle CEO’s thoughts on stablecoins in the U.S.:\n\nCircle CEO: U.S. Needs Stablecoin Legislation to Combat de-Dollarization\n\nRead more about Polygon’s partnership with Google Cloud:\n\nPolygon Labs Partners with Google Cloud to Drive Ecosystem Growth"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtY3JhY2tkb3duLW9uLWNyeXB0by1zdGFraW5nLWluLXRoZS11cy1jb3VsZC1ib29zdC1kZWNlbnRyYWxpemF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "SEC crackdown on crypto staking in the US could boost decentralization - Cointelegraph",
        "content": "The Ethereum network underwent the successful Shapella hard fork on April 12, allowing validators to withdraw their long-staked Ether (ETH) from the Beacon Chain after three years. In the first week of withdrawals, more than a million ETH was unstaked by validators.\n\nHowever, from the second week onward, the number of ETH staked was higher than that of ETH withdrawn, indicating that validators are re-staking most of their ETH back into mining pools.\n\nStaking is temporarily locking tokens on a network that uses a proof-of-stake (PoS) consensus mechanism. In a PoS network like Ethereum, users who wish to support the blockchain by validating new transactions and adding new blocks must “stake” a certain amount of cryptocurrency. In return, they receive rewards.\n\nStaking ensures that a blockchain is only updated with valid data and transactions. Participants wanting to increase their chances of validating new transactions offer to stake large amounts of cryptocurrency as insurance.\n\nEther being re-staked is a big positive for the Ethereum network, but its future in the United States remains uncertain. Ethereum staking is getting tricky for many U.S.-based validators as staking service providers, particularly centralized exchanges, are fighting a regulatory battle with the Securities and Exchange Commission (SEC).\n\nIn February, Kraken crypto exchange settled with the SEC for $30 million and closed its staking services for U.S clients. The SEC claimed that the service qualified as a security and that Kraken must obtain the necessary license to operate.\n\nToday we charged Kraken with failing to register the offer and sale of their crypto asset staking-as-a-service program, whereby investors transfer crypto assets to Kraken for staking in exchange for advertised annual investment returns of as much as 21 percent. — U.S. Securities and Exchange Commission (@SECGov) February 9, 2023\n\nKraken withdrew its validator nodes for U.S. clients just a day before the Shapella upgrade to comply with SEC orders. The shutdown triggered an industry-wide debate on the future of staking services in the United States. Coinbase — one of the first crypto exchanges to go public in the U.S. — also provides staking services and is trying to force the SEC to answer a petition it filed regarding guidance for cryptocurrencies.\n\nCoinbase CEO Brian Armstrong claimed that the SEC’s efforts to curtail staking service providers would prohibit retail staking in the United States. This might force many crypto platforms and staking service providers to move to offshore locations. At a time when the SEC is proactive in its enforcement action against crypto-staking services, the future of ETH staking looks shaky in the United States.\n\nMagazine: Whatever happened to EOS? Community shoots for unlikely comeback\n\nStephenie Lord Eisert, senior director of law enforcement at crypto intelligence firm Merkel Science, told Cointelegraph that cryptocurrencies are a global entity. Thus, a clampdown by one particular jurisdiction would only force service providers to move elsewhere.\n\n“The proposed ban on crypto staking will not protect investors from fraud or scams. Instead, it will create a regulatory void that will be exploited by bad actors. Rather than banning centralized staking providers, regulators should focus on addressing the lack of guidance around both centralized and decentralized staking options,” she said.\n\nStaking-as-a-service under threat in the U.S.\n\nThe U.S. is home to the majority of node operators on the Ethereum blockchain. Of the 9,849 active nodes, 5,214 are in the U.S., followed by 1,679 in Germany and 277 in Japan. The latest data from Etherscan indicates that node operators in the U.S. declined by 20% in the past week.\n\nETH nodes by country. Source: Etherscan\n\nWilliam Kraus, a partner at FisherBroyles law firm, told Cointelegraph that the SEC’s enforcement against Kraken shows the commission’s position on staking-as-a-service.\n\nHe added that this could prompt U.S. providers to respond in several ways, with some eliminating the service altogether, while others might implement changes to how they provide the service or publicly describe it. Some providers might decide not to change anything. However, the settlement has lessened ambiguity about staking, and providers must carefully consider the SEC’s position going forward, he said, adding:\n\n“The U.S. certainly has not banned staking-as-a-service. Instead, the Kraken settlement establishes that the SEC considers at least some forms of staking to fall under its jurisdiction. The market response remains to be seen, but we can reasonably expect fewer, and perhaps more limited, offerings of staking-as-a-service to retail consumers in the U.S.”\n\nDanny Talwar, head of tax at Koinly, told Cointelegraph that centralized staking providers account for almost a quarter of all staked ETH, with Coinbase (11.4%), Kraken (6.9%), and Binance (5.2%) leading the way.\n\nTalwar said that if the SEC moves on with its enforcement action, staking service providers will be forced to look outside the U.S. to offer their services.\n\n“If offshore exchanges with no Know Your Customer or Anti-Money Laundering compliance end up being major beneficiaries of the SEC cracking down on regulated, domestic, centralized exchanges, ‘consumer protection’ may be the least likely outcome,” he said.\n\nThe rise of decentralized staking\n\nWhile U.S. regulators are clamping down on staking services, crypto proponents are trying to convince regulators that high-yield lending interests offered by centralized entities and staking rewards on the Ethereum blockchain are not the same.\n\nStaking crypto on a blockchain like Ethereum contributes to daily transaction verification. Thus, Ethereum staking differs from lending rewards like those offered by BlockFi and Celsius.\n\nOn the other hand, the SEC is looking to brand all kinds of staking services under a standard banner, Konstantin Boyko-Romanovsky, CEO of staking service provider Allnodes, told Cointelegraph.\n\nBoyko-Romanovsky said prohibiting centralized exchanges from offering staking services would further enhance decentralization. He also noted that the government’s approach might stifle adoption as many newcomers to crypto in the U.S. rely on centralized entities such as Coinbase for staking services.\n\nHe noted that staking pools might become more popular among retail stakers, explaining:\n\n“Staking pools will probably experience an increase in participation from the United States, as the concept of staking pools democratizes access to staking opportunities and associated rewards. However, it is difficult to predict the exact extent of this potential influx, as it will depend on various factors such as mainstream acceptance and adoption, regulatory policies, scalability and ongoing innovation.”\n\nHe added that those interested in staking will likely find alternative means. “The focus of the regulatory bodies should be on creating precise and clear definitions for new and innovative concepts, such as staking. It would likely benefit customers more than attempting to force crypto instruments into existing fiat currency molds,” he said.\n\nRecent: What the Gensler hearing means for US crypto regulation and policy\n\nThe troubles of centralized staking services might work in favor of decentralized staking services and staking pools. After Kraken’s withdrawal of U.S-based validator nodes, most of these validators moved to Lido Finance, a decentralized staking pool service provider.\n\nAs @krakenfx ETH withdrawals where allowed, most of that went predictably into @LidoFinance. pic.twitter.com/Ud8vuvsvAT — Seraphim (@MacroMate8) April 26, 2023\n\nWhile it may help decentralization, the SEC’s stance on crypto staking could mean trouble for U.S.-based service providers. However, it remains to be seen whether firms like Coinbase uproot and move abroad, abandon significant market share in the domestic market, or make efforts to comply with SEC guidance and U.S. securities laws."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy50aGVibG9jay5jby9wb3N0LzIyOTAzOS9jdXJ2ZS1maW5hbmNlcy1jcnZ1c2Qtc3RhYmxlY29pbi1kZXBsb3llZC1vbi1zZXBvbGlhLXRlc3RuZXQtYWhlYWQtb2YtZXRoZXJldW0tbWFpbm5ldC1sYXVuY2jSAYUBaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjI5MDM5L2N1cnZlLWZpbmFuY2VzLWNydnVzZC1zdGFibGVjb2luLWRlcGxveWVkLW9uLXNlcG9saWEtdGVzdG5ldC1haGVhZC1vZi1ldGhlcmV1bS1tYWlubmV0LWxhdW5jaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Curve Finance's crvUSD stablecoin deployed on Sepolia testnet - The Block",
        "content": "The developers of decentralized exchange Curve Finance deployed smart contracts for decentralized stablecoin crvUSD on the Sepolia testnet today.\n\nSepolia serves as one of the two main testnets employed by Ethereum developers for testing code prior to mainnet deployment. Specifically, this code was deployed for the purpose of testing the token's verification on Ethereum block explorer Etherscan, according to a comment made on GitHub.\n\nCreated in 2020, Curve is the largest decentralized exchange focused on swapping stablecoins with reduced slippage and minimal fees. It has more than $4.2 billion locked on its platform across its markets that run over 12 blockchains. The Sepolia deployment signals that the team is getting closer toward a mainnet release of its platform and stablecoin.\n\nThe stablecoin's design\n\nCurve founder Michael Egorov initially revealed that the team was working on developing a native stablecoin in July 2022. Subsequently, in November 2022, Curve developers published its white paper and initial code.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe stablecoin will be pegged to the U.S. dollar and feature a token design akin to that of MakerDAO's DAI stablecoin. That means it will be overcollateralized by supported crypto assets exceeding the value of the crvUSD users wish to mint.\n\nAdditionally, the stablecoin will rely on a new algorithm called Lending-Liquidating AMM (LLAMMA). This continuously liquidates and automatically deposits collateral to manage the risk associated with the stablecoin, while maintaining its peg to the U.S. dollar, according to its whitepaper.\n\nBeing developed by one of the most-widely used DeFi protocols — one that's heavily focused on stablecoins — crvUSD has a chance at finding adoption. But it will enter a highly competitive field, currently dominated by centralized stablecoins like USDT and USDC, which account for $81 billion and $30 billion respectively, of the $131.2 billion total stablecoin market. DAI, the closest stablecoin in design to crvUSD, has a $4.7 billion market capitalization."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vbnVsbHR4LmNvbS9ldGhlcmV1bS1wcmljZS1hbmFseXNpcy1wcmVkaWN0aW9uLW1heS0xc3QtZXRoLXJvbGxzLWJhY2staW5zaWRlLWNoYW5uZWwtYXMtdXBwZXItYm91bmRhcnktc3RvcHMtcmVjb3Zlcnkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Analysis & Prediction (May 1st) – ETH Rolls Back Inside Channel as Upper Boundary Stops Recovery - NullTX",
        "content": "Following several gains earlier this month, Ethereum flipped a four-month channel and marked a new high in a year. Failed to sustain momentum and rolled back inside the channel. What happened?\n\nEthereum has been mirroring Bitcoin’s pattern for some weeks now. The correlating price actions made the second-largest crypto by market cap reach a new milestone in the past week.\n\nLooking back to what happened earlier this month, when the price surged through $1.9k to $2k in two days with a series of gains, ETH tested $2,150 as a ten-month high and fell off after it entered an oversold area.\n\nIt sits above $1,790 and traded in the channel for a week. A sudden spike occurred yesterday and the price retested the $1,950 level around the upper boundary of the channel as resistance. A second retest around that price level led to a rejection earlier today.\n\nThe bulls are trying to return but the bears are creating a strong wall around the crucial $2,000 level. If this level continues to pose a threat to buying pressure, ETH may face a serious hurdle to overcome it. That could trigger selling pressure if it finds the crucial level difficult to reclaim.\n\nIn this case, the lower boundary of the channel would be the next selling target before the price can pick up again. ETH will need to surpass the previous resistance level to claim more highs. It lost 3% over the past 24 hours.\n\nETH’s Key Level To Watch\n\nThe immediate $1,948 and $2,030 resistance levels are important areas of interest for the buyers in the next leg up. Reclaiming them should skyrocket the price to $2,160 and $2,304 in the future.\n\nAs ETH pinned weekly support at $1,788.4, a breakdown from there could sink the price to $1,722.9 in the coming weeks. The $1.678.9 and $1,590.5 levels are the next to watch for more decrease.\n\nKey Resistance Levels: $1,948, $2,030, $2,160\n\nKey Support Levels: $1,788.4, $1,722.9, $1,678.9\n\nSpot Price: $1,894\n\nTrend: Bearish\n\nVolatility: Moderate\n\nDisclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any services.\n\nImage Source: forplayday/123RF // Image Effects by Colorcinch"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NoYXRncHQtcHJlZGljdHMtZnV0dXJlLWV0aGVyZXVtLXByaWNlLXRoZS01LWNyeXB0b3MtaXQtcmVjb21tZW5kcy1vdmVyLWV0aC1pbi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "ChatGPT Predicts Future Ethereum Price - the 5 cryptos it recommends over ETH in 2023 - Analytics Insight",
        "content": "Ethereum (ETH), one of the two biggest cryptocurrencies in the world, thanks to numerous factors, experienced value growth in the last few weeks. The latest information shows us that ETH has managed to reach a value of around $1917, so investors are wondering if now is a good time to invest in this crypto, or if some other cryptos are a better choice than ETH.\n\nThe opinions of crypto experts on this topic vary, some are convinced of the further progress of this crypto, while others believe that ETH could experience losses in the future, so they prefer to suggest other cryptos over ETH. That’s why we looked for additional help on this topic and asked ChatGPT for advice!\n\nAccording to ChatGPT, at the moment, there are 5 better investment options than Ethereum, and these are:\n\nBut before we start discussing these 5 cryptos, let’s see what ChatGPT says about the future of Ethereum.\n\nEthereum (ETH)\n\nIf you ask ChatGPT to tell you something about Ethereum, you will get the answer that although ETH is one of the most popular cryptocurrencies in the world, its further development can’t be predicted with absolute certainty.\n\nWhat ChatGPT has to offer is a price prediction that shows possible maximum, average, and minimum values for this crypto:\n\nYEAR MINIMUM PRICE AVERAGE PRICE MAXIMUM PRICE 2023 $1,522.72 $1,913.50 $2,304.28 2024 $2,106.91 $2,522.97 $2,939.04 2025 $2,789.54 $3,703.15 $4,617.71 2026 $4,210.58 $5,410.66 $6,610.75 2027 $6,589.96 $7,647.70 $8,705.44 2028 $8,265.39 $11,403.27 $14,541.15 2029 $13,266.21 $17,630.26 $21,994.32 2030 $20,647.23 $23,611.22 $26,575.21\n\nAccording to the information that ChatGPT gave us, ETH may reach a value of over $2000 by the end of the year, but there is a possibility that its value will fall to around $1522. ChatGPT therefore, like most crypto experts, does not have a crystal clear picture of the further future of Ethereum, but says that there are some fantastic alternatives to ETH. There are several other crypto projects that require smaller investment, and at the same time, show much greater chances for great success and huge gains already this year!\n\nAiDoge (Ai)\n\nThe newly launched AiDoge (Ai) is one of the cryptos that ChatGPT recommends over ETH, considering that this crypto project managed to raise more than $200,000 in just a few days! AiDoge (Ai) presale is on fire, there are more and more early investors who want to take the opportunity to invest in Ai token for only $0.000026. Of course, the good price of Ai tokens is only one of the reasons for such great interest from investors.\n\nWhat makes AiDoge a good choice is that this revolutionary platform, using AI technology, provides the best AI-driven meme generation experience! Using AI, AiDoge makes creating memes fast, simple and unique. Your only task is to provide text prompts, and after that, AiDoge will deliver relevant and engaging memes!\n\n>>>Buy AiDoge Now<<<\n\nAfter they are created, the memes will be seen on the Public Wall, where other users can upvote or downvote them, and depending on the ranking of your meme, you can be additionally rewarded.\n\nWith the native Ai token, you will have the opportunity to purchase credits that you can later spend on generating memes, the opportunity for staking (which will bring you daily credit rewards with a bunch of other benefits), and also the chance to vote. AiDoge makes memes accessible to all, rewards top memes with Ai tokens, and gives you a chance to get a big return on your investment, judging by the excellent predictions this crypto has for the future. So listen to ChatGPT and invest in Ai token rather than ETH.\n\n>>>Buy AiDoge Now<<<\n\nDeeLance (DLANCE)\n\nDeeLance, with its DLANCE token, is a platform that provides the lowest fees for freelancers and employers, does not charge withdrawal costs, and provides complete ownership. Judging by ChatGPT, DeeLance is one of the best crypto projects at the moment!\n\nDeeLance has so far raised more than an incredible $500,000, and ChatGPT assures us that the number of DLANCE investors will continue to grow, because the number of freelancers and those looking for workers online is increasing, and therefore, huge gains are predicted for this crypto. Invest in DLANCE before the next price increase, because it shows a higher chance of progress than ETH.\n\n>>>Buy DeeLance Now<<<\n\nMetropoly (METRO)\n\nWhen it comes to investing, what ChatGPT recommends is a combination of real estate and crypto, and the Metropoly platform makes that possible. By owning its native METRO token, you will get the opportunity to invest in real estate with only $100, you will be freed from complicated bureaucratic processes, and even more importantly: you will get a chance for a great return on your investment.\n\nMETRO has much more positive predictions than ETH, so invest in it ASAP, while its price is only $0.09!\n\n>>>Buy Metropoly Now<<<\n\nEcoterra (ECOTERRA)\n\nChatGPT suggests that all eco-conscious investors should join the Ecoterra (ECOTERRA) presale and invest in the most promising green crypto at a price of only $0.007! Ecoterra gives users the chance to earn ECOTERRA tokens by recycling, but also to profit from early investment, considering that ECOTERRA could pump in price up to 30X! Certainly, ECOTERRA will give you much more than ETH!\n\n>>>Buy Ecoterra Now<<<\n\nRobotEra (TARO)\n\nThe last crypto that ChatGPT recommends over ETH is the best metaverse crypto: RobotEra (TARO). RobotEra provides much more than the simple P2E experience that we are used to because it provides the possibility for selling NFTs, mining, staking TARO coins, and many other earning options. The first presale stage is ending soon, so hurry up and buy TARO for only 0.020 USDT.\n\n>>>Buy RobotEra Now<<<\n\nConclusion\n\nETH is gaining in value, but according to information provided by ChatGPT, 5 other cryptos are set for bigger gains in the next period. So, listen to this “AI crypto expert”, and grab Ai, DLANCE, METRO, ECOTERRA, and TARO, before their prices explode!\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS0yLW1heS1iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXNvbGFuYS1zaGliYS1pbnUtcG9seWdvbi0xNjU0MTI0MS5odG3SAYsBaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL3Bob3Rvcy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktMi1tYXktYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1zb2xhbmEtc2hpYmEtaW51LXBvbHlnb24tMTY1NDEyNDEuaHRtL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin hovering below $28k, Ethereum and most other tokens slide - CNBCTV18",
        "content": "1 / 7\n\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, fell two percent to $27,975. Its market value stood at $542.2 billion. The trade volume was at $16.9 billion.\n\n2 / 7\n\n\"BTC’s market capitalisation dominance seems to be on the rise again, reaching June 2020 levels, even though liquidity continues to be a challenge. The US Banking system came under further stress as JP Morgan acquired First Republic Bank. Meanwhile, the BTC network continued to work like clockwork and set a new record for the number of daily transactions processed,\" said Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch.\n\n3 / 7\n\nEthereum | The second largest virtual currency, Ethererum or Ether, fell nearly a percent to $1,825.6 with a market capitalisation of $220 billion. The trade volume of Ethereum was $7.6 billion in the last 24 hours.\n\n4 / 7\n\nDogecoin | Meme-based virtual currency, Dogecoin, fell 0.4 percent on Tuesday. Its market value stood at $10.9 billion. The trade volume was at $277.6 million.\n\n5 / 7\n\nShiba Inu | Shiba Inu fell 0.8 percent with a market capitalisation of $5.8 billion. The trade volume was $116.8 million in the last 24 hours.\n\n6 / 7\n\nSolana | Solana fell 1.7 percent to $21.9 with a market capitalisation of $8.6 billion. The trade volume of Solana was $347.1 million in the last 24 hours.\n\n7 / 7"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90aGlyZC1yb3VuZC1vZi1ldGhlcmV1bS13aXRoZHJhd2Fscy1wcmVkaWN0cy1iaWctZXllcy1jb2lucy1icmlnaHQtZnV0dXJlLXdoaWxlLXRvbmNvaW4tcmVjZWl2ZXMtY3JhenktYnV6ei_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Third Round Of Ethereum Withdrawals Predicts Big Eyes Coin's Bright Future While Toncoin Receives Crazy Buzz! - Analytics Insight",
        "content": "The world of cryptocurrency is always evolving, and the trend of meme coins shows no signs of slowing down. Among the pioneers of meme coins are Dogecoin and Shiba Inu, but there is a new player in town: Big Eyes Coin.\n\nWhat sets Big Eyes Coin apart is its intention to operate on the upgraded Ethereum network, which has caught the attention of many crypto enthusiasts. According to Nansen data, the third round of ETH withdrawals almost equaling deposits indicates a shift in the community’s perception of Ethereum-based tokens.\n\nAs a consequence of this news, the crypto community is taking notice of the potential of Ethereum-based tokens, as evidenced by the recent shift in perceptions and increased ETH withdrawals. Investors are anxiously placing their bets on the imminent debut of this meme coin since many are anticipating a successful launch for Big Eyes Coin due to its innovative use of the Ethereum network’s enhancements and the growing popularity of meme coins.\n\nAs the excitement for meme coin season and alt season intensifies, Big Eyes Coin is the coin to watch. But before diving headlong into this emerging crypto community, let us tell you all you need to know about the newest crypto sensation, the Big Eyes Coin!\n\nBig Eyes Coin – Is This Financial Cat Truly Worth It?\n\nSimple answer -YES! But let’s reflect on some objectivity, shall we? Big Eyes Coin is a promising new meme coin set to operate on the Ethereum network, using the latest upgrades, including the Shapella upgrade, to ensure top-notch performance and efficiency. Even in its presale stages, Big Eyes Coin already stands out from other cryptocurrencies with its unique and innovative features.\n\nBig Eyes Coin has been generating a lot of buzz among investors and enthusiasts during its ongoing presale. Many seek to discover the next meme coin to skyrocket their profits 100x. This token offers unique features that distinguish it from other cryptocurrencies, including meme coin utility that provides practical uses beyond speculative trading. From a charitable heart to a safe body to guard its community, the BIG token has it all!\n\nAdditionally, the Big Eyes Coin team aims to compete with the success of popular meme coins like Dogecoin and Shiba Inu. This compassionate crypto understands the importance of creating a cryptocurrency that appeals to investors and meme coin enthusiasts. The token is designed to be user-friendly and accessible while offering features that set it apart from other meme coins. If you’re looking for a new meme coin with exciting potential and a strong community behind it, then keep your eyes on the Big Eyes Coin -and you might want to hurry the thought process because this coin is all set to conclude its presale on 3rd June 2023!\n\nWhat’s The Buzz Around Toncoin’s Technical Score?\n\nInvestors Observer’s research has given Toncoin a strong long-term technical score of 94, based on the cryptocurrency’s historical trading patterns, causing all the buzz around this crypto. The proprietary scoring system considers recent price movement over several months to a year, as well as the coin’s support and resistance levels and its position relative to long-term averages. This score is particularly valuable for buy-and-hold investors seeking steady growth when allocating assets.\n\nFor All Things Big Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdG9rZW5wb3N0LmNvbS9QaGFudG9tLVNvbGFuYS1XYWxsZXQtQWRkcy1FdGhlcmV1bS1hbmQtUG9seWdvbi1TdXBwb3J0LTk5MDPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Phantom Solana Wallet Adds Ethereum and Polygon Support - TOKENPOST",
        "content": "Phantom Solana Wallet Adds Ethereum and Polygon Support\n\nPhantom, a self-custodial wallet, has added simultaneous support for Ethereum and Polygon networks to its mobile app and browser wallets. With this update, users can now access dApps across the Web3 landscape, including Uniswap, Aave, blur, OpenSea, and Magic Eden.\n\nThe company aims to simplify managing multiple accounts and assets across blockchains, removing the requirement to switch between wallets and adding the ability to import existing MetaMask, Solana, and EVM wallets.\n\nPhantom first announced support for Ethereum and Polygon in November 2021, with the goal of providing the ability to interact with the three largest blockchains for digital collectibles in one place. According to the company, the new features will simplify managing multiple accounts and assets across blockchains.\n\nPhantom CEO Brandon Millman said the company is dedicated to leveraging its expertise from the Solana ecosystem to drive innovation in the wallet space to deliver the most versatile and user-friendly experience across all platforms, especially the three most prominent ecosystems: Ethereum, Polygon, and Solana.\n\n\"As crypto continues to go multichain, our wallet stands out as the premier choice for users,\" Millman added.\n\nThe Phantom wallet has onboarded over 100,000 users since its Ethereum and Polygon support beta last fall, the company says. In addition to broadening its user base, Phantom has stepped up its security measures in light of a rise in phishing and scam attacks on NFT holders. In January, Phantom said it had scanned over 85 million transactions and blocked over 18,000 wallet-draining transactions.\n\nPhantom's future plans include the introduction of instant NFT sales and the development of a bridge to enable the transfer of assets between the Solana and Ethereum networks. The company believes that the future of digital asset management lies in cross-chain interoperability and is committed to providing its users with the tools and resources they need to easily navigate and transact across various blockchain networks.\n\n\"We believe that the future of digital asset management lies in cross-chain interoperability. We're committed to providing our users with the tools and resources they need to easily navigate and transact across various blockchain networks,\" Co-Founder and CEO Brandon Millman said in a statement.\n\nTokenPost | [email protected]"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL3doYXQtaXMtaW1tdXRhYmxlLWV4cGxhaW5lZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "What is Immutable, explained - Cointelegraph",
        "content": "What is Immutable, and why is it important for blockchain gaming? Immutable is a game development platform that simplifies building Web3 games on the Ethereum blockchain. Headquartered in Sydney and co-founded in 2018 by James Ferguson, Robbie Ferguson and Alex Connolly, this leading Web3 gaming platform is focused on a mission to bring digital ownership to players by making it easy to build Web3 games for mainstream adoption. Immutable is funded and backed by prominent crypto VC funds and transformational tech investors like Bitkraft Ventures, King River Capital, AirTree, Temasek, Coinbase and more. The Immutable platform empowers gaming studios and developers with a powerful suite of products, delivering clear solutions that amplify their capabilities and transform the way they create, launch and distribute games. Its pre-built solutions designed for ease of use enable developers to launch their games faster without compromising on either security or the gaming experience, thereby solving two major blockchain gaming industry-wide issues. Additionally, builders receive Web3 guidance, live support for their communities and access to Immutable’s extensive gaming ecosystem. Immutable has also been at the forefront of enabling zero-knowledge (ZK) scaling solutions for Ethereum and offers multiple ZK-based scaling options, including Immutable X, a rollup based on StarkWare technology, and Immutable zkEVM, powered by Polygon. Immutable Games, its own gaming studio, is a global player in Web3 game development and pioneered the world’s first blockbuster nonfungible token (NFT) trading-card game Gods Unchained. It is currently building the highly anticipated mobile role-playing game (RPG) Guild of Guardians while also partnering with third-party game developers on games such as MetalCore, Infinite Victory and Shardbound. Related: A beginner’s guide on blockchain layer-2 scaling solutions\n\nHow does Immutable work, and what problem does it solve? Immutable is a complete end-to-end development platform for building and scaling Web3 games on Ethereum, with industry-leading security and frictionless developer and gaming experiences. Immutable use zero-knowledge Rollups (ZK-rollups) to achieve layer-2 scalability. ZK-rollups fuse an array of hundreds of transactions off-chain and then send them to Ethereum as a single transaction, allowing faster validation of transactions and thereby ensuring gas fees are kept to a minimum. In March 2023, Immutable announced its second scaling solution, Immutable zkEVM, for games alongside the existing Immutable X, a ZK-rollup powered by StarkWare. Set to fully launch later in 2023, this new EVM-compatible ZK-rollup will be powered by Polygon technology with full Immutable platform support to help make Web3 games faster, straightforward to develop and less risky from development to launch. The partnership between Immutable and Polygon, along with the creation of Immutable zkEVM, solves many problems for Web3 game development. Here’s how: One-stop gaming solution: Immutable’s platform with zkEVM tech offers Ethereum Virtual Machine (EVM) compatibility, low cost, massive scale and Ethereum security all while providing direct integration into Immutable’s full-stack gaming platform. This provides developers with a suite of solutions needed to succeed.\n\nNetwork effects: Developers can access the combined network of Immutable and Polygon to get access to gamers, tools and funding.\n\nReduced development costs: For existing games, the opportunity to migrate existing smart contracts to the Immutable zkEVM environment is provided via Immutable’s smart contract templates.\n\nEnhanced gameplay mechanics: From staking and crafting to advanced functionalities, including dynamic NFTs that equip other NFTs are possible with Immutable zkEVM.\n\nSeamless interoperability: With Immutable zkEVM, game developers can create games that are seamlessly interoperable with other games or platforms in the Ethereum ecosystem, enabling broader access and economies of scale.\n\nSecure gaming environment: Immutable’s quality control measures are designed to protect gaming studios and users from malicious activity, poorly designed contracts or validators, and conserve the chain’s bandwidth for gaming-specific activities.\n\nWhat are the key features of Immutable? Immutable aims to provide a fast, secure and cost-effective solution for decentralized applications (DApps) while solving numerous issues around scalability and gaming. The key features and technologies of the Immutable platform include: Enterprise-grade security with massive scalability The integration of zero-knowledge proofs into the Immutable platform allows for a substantial decrease in transaction costs and an increase in the number of transactions per second (TPS) compared to traditional Ethereum platforms. At the same time, the technology guarantees the confidentiality of sensitive information while permitting the verification of statements. The largest ecosystem in Web3 gaming Immutable offers access to a growing ecosystem of over 1 million players and $2 billion in investor funding for games building on Immutable, along with over 150 well-known titles that have selected Immutable as their gaming platform. Frictionless user experiences The full suite of Immutable products and vetted smart contract templates have been created specifically to reduce onboarding complexities, generate native gameplay experiences, and empower game studios with the tools they need to provide delightful Web3 experiences to their communities. Game-centric development platform Immutable has five years of experience building and scaling some of the promising Web3 games, such as Illuvium, Gods Unchained and Guild of Guardians. Drawing from this, it has used that expertise to ensure game developers have a one-stop-shop platform containing everything they need to achieve mainstream adoption.\n\nWhat are IMX and Immutable Marketplace? Immutable uses a decentralized governance system via IMX as the native utility token on the Immutable platform. The IMX token is an ERC-20 token with a total token supply of 2 billion. Incentives among traders, creators and markets are balanced by the IMX token, ensuring rewards go to pro-network activities on Immutable. The Immutable white paper describes three core uses of IMX: fees, staking and governance. Immutable has its own marketplace as the default home for trading NFTs on the protocol. The Immutable Marketplace supports Ethereum wallets without the need to switch networks. NFTs are free to mint for users on the Immutable Marketplace, and since there is only a 2% sell-on fee, it is a low-cost avenue for launching new collections with near-zero gas fees. Apart from its own marketplace, Immutable’s Orderbook and Marketplace Network facilitates partnerships with 10 leading NFT marketplaces, such as GameStop, Token Trove, OKK, etc. Thanks to the power of the orderbook, games and marketplaces building on the Immutable platform experience doubled liquidity as evidenced by the fact that half of all trades on Immutable are filled on non-origin marketplaces. In November 2022, Immutable partnered with GameStop, the leading global video game retailer, to integrate its global orderbook into the GameStop NFT marketplace. This will bring current and upcoming projects on Immutable to GameStop, including Gods Unchained, Guild of Guardians, Ember Sword, Playco, GreenPark Sports, Illuvium and many others."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYmxvY2tjaGFpbm1hZ2F6aW5lLm5ldC9ldmVyeXRoaW5nLXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtYmxvY2tjaGFpbi1zaXplL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Everything You Need To Know About Blockchain Size - Blockchain Magazine",
        "content": "Are you curious about the size of a blockchain? We’ll go through all there is to know about blockchain size, including its limits and if it can cause problems in the future. Blockchain is well-known for its ability to transform the world around us. It provides immutability, transparency, and unrivalled security that no other technology\n\nAre you curious about the size of a blockchain? We’ll go through all there is to know about blockchain size, including its limits and if it can cause problems in the future. Blockchain is well-known for its ability to transform the world around us. It provides immutability, transparency, and unrivalled security that no other technology has previously been able to provide. After all, it affects how we define processes, store data, and investigate the security of the network on which the program runs.\n\nHowever, there is one major issue: blockchain block size. Let’s take a look at how the blockchain works to get a better grasp of the issue.\n\nThere is no centralized authority in any blockchain network. The network’s decentralization is aided by peer participation. A copy of the ledger is kept by each peer (where all transactions are stored). This means that if a new transaction occurs, the ledger on each node will be updated. The one-of-a-kind solution enables enterprises to build decentralized networks capable of solving previously unsolvable problems.\n\nThe Size of the Blockchain Ledger Is a Major Issue\n\nHowever, blockchain is not without flaws. Because there are just a few peers linked to the network, the blockchain block size was not as large at first. The bitcoin blockchain, for example, was 614 MB in size in 2012. However, the bitcoin blockchain has already expanded to 250K MB in size. Each peer/node is responsible for around 250 GB of data. This leads to difficulty with the size of the bitcoin blockchain.\n\nThe same issue affects other blockchain networks as well. Ethereum’s blockchain has already surpassed 1 TB in size.\n\n3/Inclusive accountability. Key blockchain idea: a widely shared distributed ledger, achieving “inclusive accountability” Total size of fast new L1’s is 750-2000GB. Cardano is sub 20GB (<1%). Anyone can run a node and verify the chain New L1s struggle with it or don’t care pic.twitter.com/58VdXQfn1m — ADA whale (@cardano_whale) December 25, 2021\n\nWhat is the limit to the size of a blockchain?\n\nThe bitcoin blockchain ledger has increased from 150 GB to 250 GB in the last two years. That’s nearly 50 gigabytes every year. By 2030, the size of a blockchain ledger might potentially exceed 1 TB. However, not every node needs to download the entire blockchain to become operational. Some people join the blockchain network to make transactions rather than to validate them.\n\nSome nodes are referred to as “full nodes.” Full nodes are necessary for individuals who want to participate in the ongoing transaction’s validation. This requires them to download the entire 250 GB blockchain data set, which includes block headers and transactions.\n\nFurthermore, the current size limit for bitcoin blockchains is 1 MB. Some of the space inside this limit, however, is unusable. As a result, you’ll have to deal with the bitcoin blockchain size restriction as is. The issue of Ethereum’s blockchain ledger size was more serious than that of bitcoin. A bitcoin investor, Alistair Milne, expressed concern about the scale of the Ethereum ledger compared to bitcoin. Ethereum is expanding at three times the rate of bitcoins, according to a picture he shared.\n\nHowever, this isn’t entirely true, as Ethereum also provides ways to interact with the ledger. Pruning is a notion that allows nodes to work without having to download the entire blockchain data.\n\nDoes the size of a blockchain matter?\n\nYes, the size of a blockchain ledger is important. Blockchain is a relatively new technology that is expected to gain in popularity in the future years. Because Bitcoin is first-generation blockchain technology, it is not without flaws. It has issues with scalability and size. Scalability is becoming a challenge as the blockchain grows in size. It has been one of bitcoin’s most serious problems. To temporarily address the issue, they implemented the SegWit2x hard fork to increase block size (at the granular level) and improve bitcoin’s scalability and performance.\n\nThe size of the ledger is expected to grow significantly, with estimations of 6.5 TB by January 2023. It will necessitate the purchase of larger disk space in order to participate in the network. However, Moore’s law predicts that hard disk storage prices will fall over time, allowing you to purchase less expensive storage. The biggest issue emerges when the rate at which the blockchain grows outpaces the rate at which storage becomes cheaper.\n\nIt will be difficult for enthusiasts to contribute their skills or ideas to the network. Contributors will have to pay thousands of dollars to get their nodes up and operating, which may or may not be worthwhile.\n\nWhat Are the Consequences of a Large Blockchain Size?\n\nWe live in a world where transactions are king. Non-cash payments in the billions are made every day. The rate of growth of transactions is quadratic. However, with cryptocurrencies such as bitcoin, Ethereum, NEO, and others, we’re seeing a shift in how non-traditional channels are used to conduct transactions.\n\nCompared to Visa or other forms of transactions, bitcoin does not now have to account for many transactions. However, if bitcoin is utilized for every transaction, each block might consume up to 2.4 terabytes, not to mention the fact that blockchain can generate one block every ten minutes. In other words, 2.4 terabytes of data will be added to the blockchain size every 10 minutes. 350 GB is added daily, and 127 TB is added yearly. This also implies that there is no limit on the number of ledgers.\n\nAlso, read – Is Blockchain a Hoax For Corporate? Experts Opinion\n\nThe issue limit creates new issues. These figures give cause for alarm. Furthermore, miners will take longer to solve a block because the block size will grow exponentially, leading to slower transactions. On the contrary, cheap hardware is our only hope in the foreseeable future. Terabytes of storage will not be a problem, and computing power will continue to rise rapidly, making transaction validation much easier.\n\nWhat Impact Will It Have on Blockchain-Based Projects?\n\nIs the problem affecting startups that are developing applications on Ethereum and bitcoin? It all relies on how the two blockchain technologies progress over time. Startups should not be concerned with their scale at this time. The Ethereum blockchain already has pruning, which reduces the amount of blockchain data required by a complete node. Bitcoin, on the other hand, does not yet allow pruning. The whole node status will be lost if someone prunes the bitcoin.\n\nConclusion\n\nThe size of the blockchain isn’t the most pressing issue that needs to be addressed. In fact, the main focus right now is on scalability and transaction speed. So, what are your thoughts on the scale of blockchain ledgers, such as bitcoin and Ethereum? There is also a slew of other blockchain projects to conserve space and make it as efficient as possible."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLWNsYXNzaWMtZXRjLWZhbnRvbS1mdG0tZmFsbGluZy1iZWhpbmQtYXMtc3Bhcmtsby1zcHJrLWdhaW5zLW1vcmUtdm9sdW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Ethereum Classic (ETC), Fantom (FTM), Falling Behind As Sparklo (SPRK) Gains More Volume - Analytics Insight",
        "content": "The blockchain space is a fast-paced one. With several new tokens and projects launched daily, it is intense competition for new and old projects to stay relevant. Project teams and founders are trying hard to hold on to what they already have, even more so now, as the market looks very gloomy.\n\nInvestors are looking for solid new projects that can give them huge profits in the short term and have the potential for more significant growth in the long term. Ethereum Classic (ETC) and Fantom (FTM) were once a perfect fit for that description, but a new competitor, Sparklo (SPRK), is rising to the occasion.\n\nSparklo (SPRK) Bringing Hope For Investors\n\nSparklo is a new blockchain program that promises to create an alternative-investment platform where traders and investors would meet to invest, fractionally or whole, and trade metals like Gold, Silver, and Platinum bars.\n\nSparklo’s innovative idea will usher in a new age of trading in the metal and cryptocurrency market. Early investors would enjoy top-of-the-shelf benefits like early access to new products and discounts from jewelry stores. Most top traders know that investing early in solid projects like Sparklo is where huge profits lie.\n\nThe Sparklo team has dedicated its liquidity to being locked for 100 years after being audited by Interfi Network. The presale price of Sparklo is only $0.017, and buyers will also get a 30% bonus on all buys. This offer will end on May 5.\n\n>>>> BUY SPARKLO TOKENS <<<\n\nEthereum Classic (ETC) Loses Momentum\n\nEthereum Classic (ETC) launched in July 2016 as a hard fork of Ethereum. It functions primarily as a smart contract network, hosting and supporting decentralized applications (DApps). Ethereum Classic (ETC) aimed to solve existing problems in the Ethereum main network.\n\nUnlike Ethereum, Ethereum Classic (ETC) does not plan to change its mining algorithm to a proof-of-stake (PoS). Users of the Ethereum Classic (ETC) network also pay transaction fees just like Ethereum, and the fees are collected by the miners based on the proof-of-work(PoW) mining algorithm.\n\nEthereum Classic (ETC) is trading at $19.52 instead of a monthly high of $23.12, staging a 7.1% decline in value in the last seven days.\n\nFantom (FTM) Weekly Decline Finally Got To An End?\n\nFantom (FTM) is a smart contract platform that provides developers with decentralized finance services with its algorithm. Fantom (FTM) aims to scale up the transaction speed of smart contract platforms.\n\nOne of Fantom’s (FTM) prominent features is its efficiency in processing transactions, boasting thousands of transactions per second. It is also cost-effective, charging only a fraction of a cent per transaction, making Fantom (FTM) a highly scalable network but cheaper.\n\nFantom (FTM) is trading at $0.427, a 5.48% decline in 7 days. Last week, Fantom (FTM) co-founder Andre Conje announced that the foundation had launched its crypto bank. The banks aim to offer individualized services to crypto users where they can store, trade and spend cryptocurrencies.\n\nFind out more about the presale:\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zb3RoZWJ5LXMtYXVjdGlvbi1ob3VzZS1sYXVuY2hlcy1vbi1jaGFpbi1zZWNvbmRhcnktbmZ0LW1hcmtldHBsYWNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Sotheby's auction house launches on-chain secondary NFT marketplace - Cointelegraph",
        "content": "Luxury auction house Sotheby’s has announced the addition of a new on-chain marketplace that allows digital art collectors to purchase secondary NFTs.\n\nWhile many pre-existing NFT marketplaces already host peer-to-peer sales of digital artworks, the auction house is attempting to separate itself by offering a “rotating, curated selection of leading artists hand-picked by Sotheby’s specialists.”\n\nThe next evolution of #SothebysMetaverse is here! The most trusted and dynamic destination to collect, buy and sell remarkable digital works.\n\n\n\nExplore: https://t.co/hZvYIkO3xx pic.twitter.com/dCkaCKlXVm — Sotheby's Metaverse (@Sothebysverse) May 1, 2023\n\nAll NFT sales on the Sotheby's Metaverse platform occur by way of smart contracts that allow digital art collectors to pay for their art and collectibles with the choice of Ether (ETH) or Polygon (MATIC).\n\nSotheby’s also noted it would honor artist royalties through smart contracts on the secondary sales platform and will automatically pay artists according to the royalty rate they choose to select.\n\nAccording to a Sotheby’s May 1 announcement on Twitter, the platform will launch featuring works from 13 prominent digital artists, including the pseudonymous artist XCOPY, Claire Silver, Tyler Hobbs and Hackatao.\n\n\"Casco Viejo\" generative artwork by IX Shells. Source: Sotheby's.\n\nThe 279-year-old British-American clearing house made its first appearance on the NFT scene in April 2021, when it auctioned off the work of a pseudonymous digital artist known as Pak. Since then the art house has conducted a number of record-breaking digital art sales.\n\nRelated: Snow Crash manuscript that coined the term ‘metaverse’ to be auctioned by Sotheby’s\n\nOn June 11, 2021, Sotheby’s sold a rare CryptoPunk known as “Covid Alien” for a staggering $11.8 million.\n\nMoments ago in our #London saleroom, an extremely rare “Alien” CryptoPunk #7523 from the collection of @sillytuna sold for $11.8M as part of our #NativelyDigital NFT auction – setting a new world auction record for a single CryptoPunk. pic.twitter.com/PDVUSttI3o — Sotheby's (@Sothebys) June 10, 2021\n\nJust three months later on Sept. 10, Sotheby’s facilitated an action of 101 Bored Ape NFTs that cleared a total of $24 million.\n\nIn November 2021 Sotheby’s conducted the largest NFT charity auction in history, auctioning off 140 rare NFTs to raise funds for the nonprofit healthcare organization Sostento.\n\nMagazine: 4 out of 10 NFT sales are fake: Learn to spot the signs of wash trading"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2lzLWRvZ2V0dGktZGVzdGluZWQtdG8tcmVhY2gtZXRoZXJldW0tYW5kLXBvbHlnb25zLWxldmVsLW9mLXN1Y2Nlc3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Is Dogetti Destined to Reach Ethereum and Polygon's Level of Success? - Analytics Insight",
        "content": "The new meme coin, Dogetti (DETI), has already made its mark on the crypto world, with its upcoming launch date creating a frenzy among investors. In this article, we will discuss the reasons behind DETI’s fast-rising popularity and compare the token with two other successful altcoins, Ethereum and Polygon. The question on everyone’s mind is, will Dogetti follow in the footsteps of these altcoins and achieve the same level of success?\n\nDogetti’s Announces Launch Date!\n\nDogetti (DETI) has officially secured a launch date, on the 20th of June. The good news has pushed investors to amass large amounts of DETI tokens before the token’s value skyrockets.\n\nDogetti is quickly earning its place among crypto top meme coins, but why are we comparing it to altcoins like Ethereum and Polygon? Since the beginning of Dogetti’s presale, the token has stood out compared to other popular meme coins. While Dogecoin still stands on top, it has no real-world utility.\n\nDogetti offers everything that a meme coin should such as community values and funny mascots. Still, they also plan to bring utility to the industry through a site swap, DogettiSwap, and an NFT. The team has successfully raised over $941,223 in presale funds, and with all the hype and FOMO leading up to the launch date, DETI’s value is likely to show massive returns upon its launch!\n\nEthereum’s Incredible ICO!\n\nWhat do Ethereum (ETH) and Dogetti have in common? Well aside from bestowing the industry with amazing utility, both of these assets are known for their successful presale. ETH’s presale took place from July to September 2014, during which ETH was exchanged for Bitcoin. Within the first day of the sale, more than $2.2 million worth of ETH was sold!\n\nInvestors who exchanged their Bitcoin for ETH at a ratio of 2,000 ETH to 1 BTC made a profit of over $60 million, with the value of ETH rising to 1,337 ETH per BTC by the end of the sale. The ICO raised a total of $18.30 million, with ETH priced at $0.03 per token, and a total of 72 million tokens were launched.\n\nAnother Admirable Presale!\n\nPolygon’s (MATIC) is another great example of a coin that had a huge presale success. The token sale was one of the first to take place at Binance Launchpad back in April 2019. The project sold 1.9 billion MATIC tokens, which was 19% of the coin’s total supply. They were able to reach their target, which was $5M! During the sale, 1 MATIC was priced at roughly $0.00263, and it was denominated in BNB. Since then, Polygon has been performing incredibly well, achieving the best ROIs of all tokens introduced through Binance Launchpad! It’s impressive to see the success of the project and the hard work that went into making it a success.\n\nAll in all, DETI has quickly become a popular meme coin due to its upcoming launch date and utility through DogettiSwap and NFTs. When compared to successful altcoins such as Ethereum and Polygon, Dogetti shares similarities in terms of their successful presales and potential for utility in the industry. While it is difficult to predict the future success of Dogetti with 100% accuracy, the hype and FOMO leading up to its launch suggest that it will likely follow in the footsteps of these altcoins and achieve great levels of success!\n\nInterested in joining the Dogetti Family? Learn more through the links below.\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDUvMDEvZ2FyeS1nZW5zbGVyLWJhY2tsYXNoLWFzLW9sZC1taXQtdmlkZW8tc3VyZmFjZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Gary Gensler Faces Backlash As Old MIT Video Surfaces - Crypto Times",
        "content": "The skeletons in SEC chairman Gary Gensler’s closet are back to haunt him. A clip dated to the fall of 2018 recorded by a student of the “Blockchain and Money” course whose professor was none other than our own Chairman Gensler is trending because of Gary’s point of view on crypto in 2018.\n\nIn all the notes and videos of the blockchain course, Gensler can be heard saying Ethereum is “Not a security” at MIT as a professor, which resurfaced online again. He is seen talking with students that Ethereum is sufficiently decentralized that will not consider it as a security.\n\nAnd another one… – The below clip is from a Fall 2018 Graduate MIT course called \"Blockchain and Money\"\n\n\n\nGary Gensler – the current President of the SEC, was the professor.\n\n\n\nOnce again, I will let the below video speak for itself.\n\n\n\nLecture 6: Smart Contracts and… pic.twitter.com/hsTvJ82XmM — zk-🦈 (@ZK_shark) April 28, 2023\n\nAfter this video surfaced, the cryptocurrency community was outraged, believing that the chairman had abused his power and authority by using it to suppress crypto speculation. As a result, many individuals began calling for his resignation from the chairman position and started seeing him as a butcher of crypto innovations.\n\nEarlier, U.S. Representative Warren Davidson introduced legislation to terminate Gary Gensler and restructure the SEC by citing the “long series of abuses”, including inappropriately providing a short comment period to crypto companies, unlawful ESG disclosure mandates on the market, and so on. Such an unlawful and anti-crypto stance has led many crypto firms to deport from outside the country.\n\nIn another event, Gary Gensler was slammed by Representative McHenry for not answering whether Ethereum, $ETH, is a commodity or a security. While two different federal agencies, CFTC and SEC, are juggling to implement securities laws on all crypto assets, bursting during Congress hearing clearly shows that they have no concrete evidence to support their arguments.\n\nFrom the beginning, the SEC has been dubious about cryptocurrencies, repeatedly calling them securities. However, their habit of regulation by enforcement has been exposed with time. Before everything falls apart, the U.S. regulatory authority and government should leave their biased opinions and people like Gary Gensler behind to embrace crypto space.\n\nFurthermore, XRP token holders may benefit from the revelations of Gensler’s past in the ongoing legal battle between the SEC and Ripple after his fumble at the Congress Committee Hearing. In 2020, the SEC filed a lawsuit against Ripple for allegedly selling unregistered XRP “securities”.\n\nAlso Read: SEC and Ripple Both File Motions for Summary Judgment\n\nWhile there is no doubt that some level of regulation is necessary for the crypto industry, the methods employed by Gary Gensler and the SEC can be seen as nothing short of butchering the space. Their approach has caused significant harm to crypto investors and industries alike, with many feeling that their actions are overly aggressive and unnecessary. If the SEC continues down this path, it could have dire consequences for the future of crypto."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC10cmVuZGluZy1jcnlwdG9zLXRvLWJ1eS1pbi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 May 2023 07:00:00 GMT",
        "title": "Top Trending Cryptos to Buy In 2023 - Analytics Insight",
        "content": "The trillion dollar crypto market is made up of thousands of cryptocurrencies, so it can take a lot of work for investors to find the ones that will bring them significant gains, especially if they are new to the crypto world.\n\nSo where should investors start? Well, it’s always a good sign when a token is trending, meaning that it has caught the eye of a lot of people. That’s why, today, we will explore the top five trending crypto tokens in 2023 that are worth buying.\n\n>>BUY COLT TOKENS NOW<<\n\nTrending Cryptocurrencies in 2023\n\nIn our search for the top trending crypto tokens, we have singled out the following five as the best ones that have fantastic growth potential:\n\nCollateral Network – First Web3 Peer-To-Peer Lending Platform for Real-World Assets on the Blockchain Solana – Energy-Efficient, High-Performance Blockchain Platform for Smart Contracts Arbitrum – Affordable, Ethereum-Based Scaling System Ethereum – One of the Biggest Decentralized Blockchains for Creating and Building DApps and Smart Contracts Optimism – Scalable, Layer 2 Blockchain on the Ethereum Mainnet\n\nNow, let’s cover our top five picks in more detail and see what each offers.\n\nCollateral Network (COLT)\n\nCollateral Network is the first Web3-based decentralized lending platform that enables people to use their real-world assets as collateral and borrow money against them on the blockchain. Currently, in its presale phase, experts believe that it will revolutionize the crowdlending industry, and investors have had their eyes peeled on the upcoming token.\n\nThe existing lending protocols on the blockchain only lend against digital assets like cryptocurrencies and NFTs, which are highly volatile and risky for lenders and borrowers.\n\nWell, that’s precisely where the Collateral Network steps in, enabling borrowers to obtain crypto loans against tangible assets.\n\nBorrowers can put up their real estate, watches, collectibles, and other valuable assets as collateral and unlock funds they need.\n\nCOLT Is the utility token of the platform and provides holders with many benefits.\n\nBorrowers that are token holders can use the COLT token to get and the more tokens they hold, the lower the interest rate will be.\n\nOn the other hand, lenders that are token holders can use their tokens to get discounts on trading fees in the marketplace.\n\nThe key benefit is the COLT token holders only auctions where the community get the opportunity to buy distressed assets at below market value.\n\nOverall, the Collateral Network’s future looks promising, as experts believe that the token has a 3500% growth potential, expecting its initial price of $0.01 to reach $0.35 during its presale.\n\nThe platform plans on listing on major DEX and CEX, experts say that the token will rise 100x when it lists.\n\nSolana (SOL)\n\nThe Solana blockchain platform was launched in 2020 by Solana Labs. It uses a proof-of-stake mechanism to offer users energy-efficient and scalable smart contract functionality.\n\nIn essence, the goal of the Solana platform is to provide the most censorship-resistant network in the world. The platform’s founder, Anatoly Yakovenko, devised a system called proof-of-history which allows blockchain nodes to validate numerous transactions simultaneously. This makes the platform able to complete transactions much faster.\n\nAdditionally, the Solana platform’s native token is SOL, which investors can also buy in smaller denominations that are called Lamports. Also, investors can stake SOL coins to make the transaction process faster and more efficient. Also, SOL holders can vote on changes that the Solana developers suggest.\n\nExperts praise Solana for its ability to handle high-traffic network volumes, which enterprise-level applications use. Additionally, users can design applications on Solana from the start due to the vast ecosystem of connected services it offers.\n\nThe high scalability of Solana helps keep transaction costs low, which results in lower fees for users.\n\nThere are many things that people can use the Solana network for, including creating DeFis, lending protocols, NFT marketplaces, games, and Web3 apps.\n\nToken Details Name Solana Symbol SOL Network Solana (SOL) Total Supply 539,312,705 Accepted Currencies USDT\n\nArbitrum (ARB)\n\nArbitrum is a layer 2 scaling software that sits on top of the base layer, i.e., the Ethereum blockchain and serves to make Ethereum transactions faster and cheaper.\n\nIt provides the same security as Ethereum and uses its proprietary software stack called Nitro to power its solutions. Additionally, the Nitro next-generation rollup architecture enables Arbitrum to provide 7x more output than Ethereum and lower fees.\n\nThe Abitrum solution announced the launch of its new ARB token on March 23rd, 2023. ARB tokens will allow token holders to vote about important Arbitrum decisions on the Arbitrum DAO (decentralized autonomous organization). Also, token holders will be the ones to elect the Arbitrum Security Council.\n\nIn essence, Arbitrum is designed to enable developers to run unmodified Ethereum Virtual Machine contracts and transactions on a second layer while still getting the excellent security of the Ethereum layer 1.\n\nToken Details Name Arbitrum Symbol ARB Network Ethereum (ETH) Total Supply 10,000,000,000 Accepted Currencies BTC, ETH, DOT, LINK, VET, USDC, CRO\n\nEthereum (ETH)\n\nEthereum is an open-source, decentralized blockchain that securely runs application code or smart contracts. It is used to build apps, hold assets, perform transactions, and communicate.\n\nEthereum gives its users full ownership and transparency into transaction data. Also, all transactions on Ethereum are paid for using its native token, Ether, which is the second-biggest cryptocurrency on the market, only falling short of Bitcoin.\n\nThe Ethereum network is permissionless and has decentralized governance. Its decentralized payment system is used across many industries, including finance, gaming, web browsing, advertising, and supply chain management.\n\nUsers can create two types of accounts in Ethereum: Externally Owned Accounts (EOA) and Contract Accounts.\n\nEOAs are controlled by a private key and have no associated code. Also, EOA users can send transactions. On the other hand, contract accounts have an associated code that executes when it gets a transaction from EOA. Additionally, since EOAs must always originate all contracts, contract accounts can’t start transactions independently.\n\nToken Details Name Ether Symbol ETH Network Ethereum (ETH) Total Supply 120,214,447\n\nOptimism (OP)\n\nOptimism is an extension of Ethereum, i.e It is a layer 2 blockchain on the Ethereum mainnet. It provides faster and more affordable scaling of Ethereum apps while providing the secure environment of the Ethereum mainnet.\n\nOptimism consists of many companies, communities, and citizens working together to build a better and more sustainable future for Ethereum.\n\nOptimism is an open-source rollup that is MIT licensed. The Optimism blockchain is specifically designed to align with Ethereum so that developers can start creating and innovating on Optimism immediately without needing to learn new skills.\n\nOn Optimism, users can do all the same things as on Ethereum, but faster and significantly cheaper, including interacting with DeFi apps and buying, selling, collecting, and minting NFTs.\n\nAdditionally, Optimism has its own native token, OP, which token holders can use to vote on important decisions regarding the platform or trade with others.\n\nToken Details Name Optimism Symbol OP Network Ethereum (ETH) Total Supply 4,294,967,296\n\nConclusion\n\nCryptocurrencies are becoming increasingly popular as various industries use them for everyday operations. So, it’s no wonder they attract many investors looking to increase their gains.\n\nOf course, there are numerous cryptocurrencies available in today’s market. However, out of all of them, Collateral Network might be the most impressive, our number one pick from our top trending cryptos list.\n\nCollateral Network has a fantastic system that will provide exclusive benefits to its token holders, regardless of whether they are borrowers or lenders. In essence, it shows great promise as the world’s first lending marketplace for real-world assets on the blockchain.\n\nAnd experts believe that this token will increase 35x in price, delivering 3500% for its token holders.\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vaW5zaWRlYml0Y29pbnMuY29tL25ld3MvZXRoZXJldW0tZXRoLXByaWNlLXByZWRpY3Rpb24tbWFyY2gtMTXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 15:16:22 GMT",
        "title": "Ethereum (ETH) Price Prediction (March 15) - InsideBitcoins.com - Inside Bitcoins",
        "content": "Don’t invest unless prepared to lose all the money you invest. This is a high-risk investment, you shouldn’t expect to be protected if something goes wrong.\n\nJoin Our Telegram channel to stay up to date on breaking news coverage\n\nEthereum is an open-source decentralized blockchain network, with a native token Ether (ETH). The Ethereum blockchain is a platform for several other digital assets and enables the implementation of decentralized smart contracts through Ether.\n\nUsually, digital asset price movement fluctuates. Often, several investors and traders take advantage of this fact to make profits during their trade sessions. The same principle applies to Ethereum.\n\nHowever, crypto investors and traders are always advised to exercise caution as the token price can be very volatile.\n\nPast And Present Trend Of Ethereum (ETH) Price\n\nThere have been multiple price fluctuations to recall in the price of Ethereum since the blockchain’s launch in July 2015. After the launch of Ethereum, the token remained under the $1 price mark for nearly the remaining part of the year.\n\nHowever, on March 4, 2016, Ethereum displayed a major surge over the $10 level, reaching a short-lived price of $10.03. Following this was notable growth in its popularity, eventually bringing its price to approximately $100 in May 2017.\n\n2017 proved a very positive year for Ethereum, as the token kept making multiple bullish moves. At the end of the year, Ethereum was already trading at a price just above the $770 mark. But its price surge didn’t end there, as it climbed further to $1,000 during the first week of the following year.\n\nHowever, the broader market crash in the same year affected the token, seeing its price fall below the $100 price mark toward the end of the year. Notably, the market crash also affected the price of Bitcoin at the time.\n\nFollowing this massive drop was a continuous and gradual surge in its price from 2019 to 2021. On November 16, 2021, Ether eventually reached its all-time high of $4,891.70, per data from CoinMarketCap.\n\nLaunching into 2022, several tokens saw their prices dip significantly, and Ether was no exception. This 2023, ETH has declined by less than -60% from its all-time high in November 2021, with a current trading price of just over the $1,650 mark at the time of writing.\n\nEthereum (ETH) Price Prediction Based On Technical Indicators\n\nThe chart shows that Ethereum has maintained some bullish moves in the last four days. Its MACD (Moving Average Convergence/Divergence) stands above its signal line, indicating that its upward trend will likely continue.\n\nThe histogram bar currently shows a bold green bar for the day, which also signifies a possibility of a bullish move. Moreover, ETH is trading above its 50-day and 200-day simple moving averages today, indicating a short and long-term bullish signal.\n\nThe market has support levels at the $1,575, $1,503, and $$1,417 price marks, according to the chart, while its major resistance level stands at $1,700. The price of Ethereum is currently around this resistance level, with a possibility of reaching a new high in the coming days.\n\nExperts’ Long And Short-Term Ethereum (ETH) Price Prediction\n\nCrypto experts often predict the possible price of virtual tokens. New and existing crypto investors can leverage these pieces of information as an investment guide. Some of these predictions span from 2023 to 2030\n\nHere are some forecasts of Ethereum price from some digital asset experts.\n\nCryptoPredictions Price Prediction\n\nBased on the forecast of CryptoPredictions, the maximum price of Ethereum in the remaining part of 2023 will be $2,117.339, with a minimum price of $1,392.236. According to the expert, the token will trade between the $1,100 and $1,600 price marks from 2024 to 2025.\n\nCoincodex Ethereum (ETH) Price Prediction\n\nData from Coincodex, according to its tech sector growth, shows the price of Ethereum will stand between $4,484 and $40,444 throughout 2026. By 2027, the crypto analyst expects that the price of the token should increase by 2,072.74%.\n\nEthereum (ETH) Price Prediction From ICOcreed\n\nBased on the predictions from ICOcreed, Ethereum will continuously increase over time. Data from the expert reveals that the price of ETH will surpass the $10K price mark in 2027, with a minimum price of $5,751.\n\nICOcreed’s long-term Ethereum price prediction for 2028 shows that the token will hit a maximum price of over $14,600 before the end of the year. In 2029 and 2030, ICOcreed expects the price of ETH to go beyond the $22,100 and $32,300 price levels in the last month of both years.\n\nFactors That Could Influence The Price Of Ethereum (ETH)\n\nThe factors below will likely increase or drop the price of Ethereum over time.\n\nThe Ethereum 2.0 Upgrade\n\nThe news about Ethereum 2.0 upgrade has been one of the major driving forces behind the token’s price. The upgrade aims at improving the overall Ethereum blockchain with additional features and equipment, such as the new virtual machine called the eWASM. The upgrade promises improved privacy and an ecosystem for a better trading experience on the network.\n\nThe Broader Market Forces\n\nEthereum is a decentralized finance digital asset, just like several other tokens. This means it is not backed by central banks that act on regular currency markets or gold. As such, its price movements are fully a function of the market forces, such as supply, demand, crypto traders’ sentiments, etc.\n\nThe Price of Bitcoin\n\nBitcoin, the world’s largest cryptocurrency, can drive the broader digital currency market, which also includes the price of Ethereum. As its price drops, the market takes a bearish turn and vice versa."
    }
]