[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3BvbHlnb24temtldm0tbGl2ZS1vbi1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Polygon's zkEVM Goes Live on Ethereum Mainnet - Blockworks",
        "content": "The options for layer-2 scaling are expanding as Polygon launches its long-awaited zkEVM technology on Ethereum mainnet today.\n\nThe zero-knowledge Ethereum Virtual Machine is a technology that can execute smart contract transactions in a way that can prove the information is executed correctly without revealing the information itself on Ethereum’s mainnet, thereby bundling more transactions in less mainnet blockspace.\n\nSandeep Nailwal, the co-founder and chief operating officer of Polygon, told Blockworks this type of technology is considered the “holy grail of scaling.”\n\n“With the power of mathematics…you can compute something off-chain on layer-2, then verify everything back on Ethereum in a very succinct way in a very short amount of time,” Nailwal said.\n\nPolygon’s launch on Ethereum comes just days after Matter Labs zkSync Era opened to the public on Ethereum mainnet.\n\nSimilar to zkSync’s offering, the Polygon zkEVM’s code is open-source, but under an AGPL v3 license.\n\n“That means that not only current repositories, but all future modifications and distributions as well, will remain open source, ensuring the code cannot be used for proprietary purposes,” Nailwal said.\n\nNailwal notes that Polygon zkEVM is EVM equivalent, whereas zkSync’s offering is EVM compatible.\n\nAccording to the framework laid out by Ethereum co-founder Vitalik Buterin in August 2022, zkSync Era is classified as a “Type-4 (high-level-language equivalent),” and there are advantages and disadvantages of various approaches to bringing the EVM to a zero-knowledge rollup. The merits of various tradeoffs are an ongoing topic of debate.\n\nLike zkSync Era, and the current crop of optimistic rollups, the Polygon zkEVM is not yet decentralized, but eventually, Nailwal hopes that Polygon’s new offering will take that step.\n\n“Everything is in the hands of the community,” he said.\n\nSecurity comes first\n\nIn addition to three internal audits, Nailwal notes that Polygon’s zkEVM has also gone through two rounds of external security audits from blockchain cybersecurity companies Hexens and Spearbit.\n\nOngoing, continuous audits are expected for the next three to four months following mainnet launch and a multi-million dollar bounty program will also be in place, he said.\n\nThe emphasis on security was also central to zkSync Era’s mainnet release, but Polygon said that Matter Labs had shared audits that cover their smart contracts and sequencer, not their prover.\n\n“This raises serious questions about security, at least until a full audit is released. The prover for Polygon zkEVM, meanwhile, has been audited, and is open-source,” Brendan Farmer, Polygon Zero co-founder, told Blockworks.\n\nA spokesperson for zkSync told Blockworks that the prover had been audited by Halborn Security, and pointed to the blockchain’s documentation, which notes that a recently completed review has not yet been published.\n\nEven conscientious security measures can leave gaps, however, and Nailwal notes that he does not wish users to bring millions of dollars to the zkEVM immediately.\n\n“Zk is new technology…so we [want] people [to be] as cautious as possible,” he said.\n\nDrawing on the example of the recent Euler Finance attacks, Nailwal cautioned that interacting with smart contracts is not without risk.\n\n“Euler, after running for two years, a bug was found — this can happen any day, on any smart contract-based application.” he said.\n\nZkEVMs are sure to be compared to their optimistic rollup counterparts — the most successful to-date being Optimism and Arbitrum.\n\n“Arbitrum took one and a half years before people actually started bringing in money,” Nailwal said. “So we don’t expect people to bring a lot of money [initially].”\n\nUpdated March 28, 2023 at 2:58 pm ET: After initial publication, Polygon announced the zkEVM prover would also be available under the AGPL v3 license, along with the rest of the codebase.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmJpdHJhdGVzLmNvbS9uZXdzL3AvZXRoZXJldW1zLXJvbGUtaW4tdGhlLWdyb3d0aC1vZi10aGUtaW50ZXJuZXQtb2YtdGhpbmdzLWlvdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's Role in the Growth of the Internet of Things (IoT) - Bitrates",
        "content": "Ethereum is a blockchain-based platform that enables the creation of smart contracts, decentralized applications, and autonomous organizations.\n\nThe Internet of Things (IoT) refers to the growing network of physical devices embedded with sensors, software, and connectivity that allows them to collect and exchange data.\n\nEthereum's secure and transparent smart contract technology is contributing to the growth of the IoT by enabling secure and efficient data exchange, decentralized data management and storage, and cost-effective transactions. As the IoT continues to expand, the integration of Ethereum's blockchain technology can provide new opportunities for innovation and growth, creating new possibilities for businesses and individuals alike.\n\nBenefits of Ethereum in the IoT\n\nEthereum's smart contract technology provides a secure and transparent platform for data exchange in the IoT. By using smart contracts, data can be exchanged and verified without the need for intermediaries, reducing the risk of fraud and improving transparency. This can be particularly beneficial in industries such as healthcare and finance, where secure and reliable data exchange is critical. With Ethereum, the data exchanged can be verified and recorded immutably on the blockchain, creating an auditable record of all transactions.\n\nThe efficient and cost-effective transactions enabled by Ethereum's blockchain technology are also beneficial in the IoT. By using cryptocurrency payments, transactions can be conducted more quickly and cheaply than traditional payment methods, reducing transaction fees and enabling cross-border transactions. This can be particularly useful in industries such as logistics and supply chain management, where real-time transactions are necessary for efficient operations.\n\nDecentralized data management and storage is another benefit of Ethereum in the IoT. By using Ethereum's decentralized network, data can be stored and managed in a secure and transparent manner without the need for a centralized authority. This can be particularly beneficial in industries such as energy management, where decentralized data management can enable more efficient and sustainable use of resources. With Ethereum, the data can be verified and accessed in real time, enabling more effective decision-making and improving overall operational efficiency.\n\nUse Cases of Ethereum in the IoT\n\nEthereum has numerous use cases in smart homes and energy management. By leveraging Ethereum's smart contract technology, smart homes can be automated and controlled using decentralized applications (dApps). Ethereum's decentralized network can also enable peer-to-peer energy trading, where users can buy and sell excess energy in a secure and transparent manner, promoting sustainable energy practices.\n\nIn supply chain management, Ethereum's blockchain technology can be used to ensure transparency and traceability throughout the supply chain. With Ethereum, transactions can be recorded immutably on the blockchain, creating an auditable record of the entire supply chain process. This can reduce the risk of fraud and enable more efficient and secure supply chain management.\n\nThe gambling industry is another use case for Ethereum in the IoT. Ethereum's blockchain technology can be used to ensure fair and transparent gameplay, creating trust and transparency between players and game developers. It is important to find reliable gaming platforms, to ensure fairness. If you’re interested, here’s Mercury News' list of the best Ethereum casinos online. Additionally, decentralized gaming platforms powered by Ethereum can also enable the creation of unique in-game assets, allowing players to own and trade digital assets securely and transparently.\n\nIn the healthcare industry, Ethereum can be used to create secure and transparent systems for data management and sharing. With Ethereum, patients can own and control their medical data, allowing for more efficient and secure sharing of medical information between healthcare providers. This can improve patient outcomes and reduce costs associated with healthcare data management. Overall, the use of Ethereum in the IoT has the potential to revolutionize various industries, enabling more efficient and secure operations and creating new opportunities for innovation and growth.\n\nChallenges and Solutions for Ethereum and the IoT\n\nOne of the major challenges facing Ethereum in the IoT is scalability and performance issues. As the number of devices connected to the IoT increases, the demand for processing power and storage capacity also increases. Ethereum's current architecture may not be able to handle the scale and speed required for efficient IoT operations. However, there are solutions being developed to address this challenge, such as sharding, a technique that partitions the Ethereum blockchain into smaller shards, enabling faster transaction processing and greater scalability.\n\nAnother challenge facing Ethereum in the IoT is interoperability. Different devices and networks may use different protocols and standards, making it difficult for them to communicate and share data effectively. This can create data silos and reduce the efficiency of IoT operations. However, there are solutions being developed to address this challenge, such as the creation of industry-wide standards for IoT devices and networks. Additionally, the development of decentralized networks and interoperability protocols, such as the Interledger Protocol (ILP), can enable more seamless communication and data exchange between different networks.\n\nTo address scalability and performance issues, Ethereum is exploring solutions such as sharding, layer-two solutions, and optimizations to improve its network's performance. For interoperability challenges, Ethereum is collaborating with other blockchain networks and working towards creating common standards and protocols.\n\nAdditionally, the Ethereum community is actively working on developing tools and frameworks that can make it easier to integrate IoT devices with the Ethereum network. As the Ethereum network and IoT continue to evolve, we can expect to see further innovations and solutions to address these challenges, enabling greater interoperability and scalability for the IoT.\n\nTo Sum up the Information\n\nEthereum's blockchain technology has numerous benefits and use cases in the Internet of Things (IoT), including secure data exchange, efficient transactions, and decentralized data management. The use of Ethereum in various industries, such as healthcare, supply chain management, and smart homes, has the potential to revolutionize these industries and enable more efficient and sustainable operations.\n\nHowever, there are also challenges to be addressed, such as scalability and interoperability issues. By embracing innovation and new technologies, the potential impact of Ethereum on the IoT is significant, and we can expect to see continued growth and development in this space. Overall, the use of Ethereum in the IoT represents a new era of innovation and opportunity for industries and individuals alike."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzAzLzI3L3BvbHlnb24tbGF1bmNoZXMtaG9seS1ncmFpbC16a2V2bS1tYWlubmV0LWJldGEtbWFzcy1zY2FsZS1jb3N0LXNhdmluZ3MtdG8tZXRoZXJldW0tdHJhbnNhY3Rpb25zL9IBigFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzAzLzI3L3BvbHlnb24tbGF1bmNoZXMtaG9seS1ncmFpbC16a2V2bS1tYWlubmV0LWJldGEtbWFzcy1zY2FsZS1jb3N0LXNhdmluZ3MtdG8tZXRoZXJldW0tdHJhbnNhY3Rpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Polygon launches ‘holy grail’ zkEVM mainnet beta that aims to increase scale and decrease cost of Ethereum transactions - Fortune",
        "content": "With the launch of its zkEVM mainnet beta on Monday, Polygon is bringing to life what’s for years been described as the “holy grail” of blockchain infrastructure, the cofounder of the layer-2 scaling solution told Fortune.\n\nThrough the use of zero-knowledge proofs, which allow a user to prove certain statements without revealing the actual data used, Polygon cofounder Mihailo Bjelic said zkEVM will provide massive possibilities for scaling the number of transactions on the blockchain while also incorporating the security and established ecosystem that the Ethereum network has built up over years.\n\nAmbitiously, Bjelic compared the zkEVM’s forthcoming impact on crypto to the effect OpenAI’s ChatGPT has had on artificial intelligence in recent months.\n\nBuilding on Ethereum’s execution layer, or EVM, was important for the Polygon team because it’s already the most popular blockchain for decentralized applications.\n\n“If you have a solution that satisfies these two first features, security and scalability, but completely changes user experience, developer experience, you have to build the whole ecosystem from scratch. That’s a humongous task,” Bjelic explained.\n\nThe technology is complicated, and as such, Bjelic said the Polygon team originally thought it might take three to five years to finish the project. Through some cryptographic breakthroughs and a lot of passion, especially from technical lead Jordi Baylina, the team finished in just over a year, he said.\n\nPolygon has partnered with important companies like Starbucks and Instagram in the past, and Bjelic said zkEVM would be a great fit for them and other companies or Web3 organizations. By adopting the zkEVM mainnet beta, users could in some cases pay 10 or 20 times less for the same number of transactions.\n\nSeveral companies have already committed to using the zkEVM mainnet beta, and on the first day of launch, Bjelic said he expects thousands of users to start using it for dozens of applications.\n\nVitalik Buterin, the founder of Ethereum, executed the first symbolic transaction via a livestream on Monday, which Bjelic said goes to show just how significant the tech is. Buterin appeared to agree.\n\nAlthough scaling was always on his mind since the beginning of Ethereum, he said during the livestream, during the last bull run it became clear how expensive it was to use the Ethereum mainnet. This is a problem that zkEVM will help to solve, along with enabling mass scaling for Ethereum, which will help with the onboarding of new users, Buterin said.\n\n“I feel very happy and excited for what’s to come,” Buterin said. “The whole zkEVM thing is something that we’ve all dreamed about and talked about for a long time.”\n\nAs for Bjelic, in the face of regulatory uncertainty and investors’ uneasiness tied to problems in the economy and banking sectors, he hopes zkEVM will bring some buzz back to Web3.\n\n“I think there is potential for zkEVM to again reignite this excitement about Web3,” he said, “and I think we really need that now.”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAzLzI2L2EtYnVsbC1tYXJrZXQtaXMtY29taW5nLW9uZS1jcnlwdG8tdG8tYnV5LW5vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "A Bull Market Is Coming: One Crypto to Buy Now - The Motley Fool",
        "content": "It's no secret that the crypto market has been struggling over the past year. The entire sector has lost nearly two-thirds of its value since late 2021, with its market cap dropping from a staggering $3 trillion to around $1.19 trillion.\n\nMany investors are also concerned that a recession is looming. If that happens, this crypto winter could drag on even longer.\n\nThe good news, though, is that a bull market is coming eventually. And there's one investment you may want to load up on now before prices surge: Ethereum (ETH 1.41%).\n\nWhy Ethereum is well-positioned for a bull market\n\nLaunched in 2015, Ethereum has proven that it can withstand market volatility. It's faced countless downturns over the past several years, including a particularly severe slump in 2018 when its price fell by a whopping 94%.\n\nWhile past performance doesn't predict future returns, Ethereum's long history is more promising than that of many other cryptocurrencies. Currently, its price is down by roughly 64% from its peak, which is far from the worst it's seen.\n\nEthereum's position in the crypto market also gives it a clear advantage. It's the primary blockchain for decentralized applications ranging from NFT marketplaces to DeFi projects to the metaverse. If any of those applications gain widespread usage, Ethereum will be in a great position to benefit from it.\n\nFinally, Ethereum developers have proven that they're committed to improving the blockchain. Last year, The Merge went off without a hitch, successfully moving the network to a proof-of-stake protocol and vastly reducing its energy usage. And future updates will aim to reduce transaction times and fees, making the blockchain faster and more affordable for users.\n\nIs crypto a smart buy right now?\n\nWhen the entire market is shaky, it can be nerve-wracking to invest anywhere -- let alone in an industry that's famous for its volatility. Before investing in Ethereum, it's important to consider whether you're willing to take on the risk involved in buying cryptocurrency.\n\nIt's almost guaranteed that the stock market will recover from this downturn. After all, the market has existed for many decades and recovered from dozens of slumps during that time. Sooner or later, this bear market will give way to a bull market.\n\nBut crypto is still in its infancy, so there are no promises that this sector will survive over the long haul.\n\nIf the crypto market thrives, Ethereum may be a fantastic buy right now. Because prices are lower, you can stock up at a discount and then reap the rewards when the market recovers. But if crypto doesn't succeed over time, even the strongest investments may fail.\n\nBefore you buy, think about whether that's a risk you're willing to take. When in doubt, ask yourself which scenario you'd regret more: investing now and losing money if crypto fails, or not investing and missing out on potentially lucrative returns if crypto succeeds.\n\nThere's no right or wrong answer here, as your risk tolerance is personal. But it's important to understand the potential downsides involved when investing in crypto, as there are never any guarantees in this sector.\n\nWeighing risk versus reward\n\nEthereum is in a unique position, as it's a strong investment in a speculative industry. The blockchain has several distinct advantages and is well-diversified across many different niches within the crypto space -- from NFTs to DeFi to the metaverse, and more.\n\nBut because crypto is still speculative, Ethereum's long-term success may hinge on whether the sector, as a whole, survives. Because nobody knows what the future holds for crypto, Ethereum is still a risky investment.\n\nWhile there are serious risks to consider, it remains one of the strongest players in the field. And if there's one cryptocurrency I'm keeping in my portfolio for the long haul, it's Ethereum."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGVjcnlwdC5jby8xMjQ2MjMvZHlkeC1yZXZlYWxzLWxhdW5jaC1kYXRlLW1vdmUtZXRoZXJldW0tdG8tY29zbW9z0gFQaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNDYyMy9keWR4LXJldmVhbHMtbGF1bmNoLWRhdGUtbW92ZS1ldGhlcmV1bS10by1jb3Ntb3M_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "dYdX Reveals Launch Date for Move From Ethereum to Cosmos - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\ndYdX announced the launch of its V4 private testnet this Tuesday, taking a significant step that will see the decentralized derivatives exchange (DEX) leave Ethereum.\n\nBy the end of September, the platform will be fully running on Cosmos.\n\nThe network allows developer teams to spin up their own native blockchains using the Cosmos Software Development Kit (SDK) according to their own preferences. Though distinct, each independent Cosmos-based blockchain can interact with one another.\n\nAD\n\nAD\n\nThe private testnet for dYdX is set to launch this Tuesday and run for two to three weeks. After that, a public testnet will be launched by the end of July.\n\nThe platform cited the lack of scalability on Ethereum as the main reason for the move.\n\n\"We reached a point where Ethereum couldn't process the transactions fast enough,\" dYdX’s marketing lead Nathan Cha told Decrypt at this year’s Paris Blockchain Week.\n\nThis is the second project to announce its migration from Ethereum to Cosmos. SushiSwap is also making the same move after the project acquired the Cosmos-based trading platform Vortex Protocol last month.\n\nThe teams explored various options, including Solana and layer-2 solutions. \"We came to the conclusion that Cosmos was the better option because we can customize the blockchain to our needs,” said Cha. “Now we can handle transactions at a faster pace.\"\n\nAD\n\nAD\n\ndYdX and centralized exchanges\n\nLaunched in 2017 by Antonio Juliano, who previously worked at Coinbase and Uber as a software engineer, dYdX currently has roughly $341.5 million in total value locked (TVL), per DeFi Llama.\n\nTVL is a metric used to measure how much money is sloshing around in a given DeFi protocol. Lido Finance, a liquid staking protocol, currently has the largest TVL at a whopping $10.4 billion.\n\nThough decentralized exchanges like Uniswap, Curve, and dYdX are steadily growing, they still only account for a small share of transactions compared to their centralized counterparts. Trading volume over the past day, Uniswap has facilitated more than $642 million in orders. Binance has processed more than $4.28 billion in trades over the same period.\n\nContrary to expectations at the time, the collapse of FTX last November did not significantly change this proportion.\n\n\"After FTX, we saw a 20-30% increase in trading volume, but only for a short time,\" David Gogel, Vice President of the dYdX Foundation, told Decrypt. \"The companies that benefited the most from the FTX case are other centralized exchanges. People don't really know about self-custody, and there's still a lot of work to do to educate them. It's a complicated journey.\""
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8yNi9iaXRjb2luLWFuZC1ldGhlcmV1bS1pbnZlc3RvcnMtYXJlLW5vdC1mbGluY2hpbmctdXMtcHJlc3N1cmUtb24tY3J5cHRvLXdpbGwtYmFja2ZpcmUtY2hyaXMtYnVybmlza2Uv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzI2L2JpdGNvaW4tYW5kLWV0aGVyZXVtLWludmVzdG9ycy1hcmUtbm90LWZsaW5jaGluZy11cy1wcmVzc3VyZS1vbi1jcnlwdG8td2lsbC1iYWNrZmlyZS1jaHJpcy1idXJuaXNrZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Investors Are Not Flinching, US Pressure on Crypto Will Backfire: Chris Burniske - The Daily Hodl",
        "content": "A venture capitalist who correctly called the 2022 crypto bottom says investors in Bitcoin (BTC), Ethereum (ETH) and the broader digital asset market are not batting an eye over the US government’s latest enforcement actions against key players in the industry.\n\nIn a new CNBC interview, Chris Burniske says the US government’s crackdown on crypto-related activities including the serving of Wells Notice to digital asset exchange Coinbase are not driving investors away from the crypto markets.\n\nAccording to the Placeholder partner, the regulatory pressure on the industry will ultimately strengthen the conviction of crypto investors and pull in more people into Bitcoin.\n\n“You have Bitcoin chugging along, Ethereum chugging along. Basically, these protocols don’t care. Last year, combined, they settled over $20 trillion in value. Bitcoin, you’ve got an all-time high of holders right now, where 68% of holders have not sold or moved their Bitcoin for over a year. So you have these people who are not flinching, in spite of all these regulatory pressure.\n\nIn fact, I would say, as we’ve seen since the SVB [Silicon Valley Bank] collapse, they’re shifting even more into Bitcoin. So this is where I think you’ll see the strategy from the government ultimately backfire.”\n\nBurniske also highlights that Bitcoin was created for “moments like this,” when confidence in the traditional banking system is beginning to sour.\n\n“[Bitcoin] is an alternative to the existing system. Ethereum, as well, operates an internet-native financial system. These are means for consumers to make a different choice, or at the very least, diversify. There’s no solvency risk. There’s algorithmic supply. It’s not going to be caught up in the same contagion we see right now in the traditional system, and so that’s valuable for consumers to be educated about.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE-2"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiKmh0dHBzOi8vdGhlZGVmaWFudC5pby9wb2x5Z29uLXprZXZtLWxhdW5jaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Polygon to Deliver Zero-Knowledge Powered Rollup - The Defiant - DeFi News",
        "content": "Layer 2 Sets March 27 Launch Date for Ethereum Scaling Offering\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nPolygon, the Layer 2 blockchain, plans to deliver an Ethereum-compatible rollup powered by zero-knowledge proofs on March 27, the development team said on Tuesday.\n\nThe offering, which is called a zkEVM, is expected to offer enhanced privacy features and validate transactions faster than other Ethereum scaling solutions. Unlike other L2s powered by zero-knowledge proofs, developers will easily be able to deploy code written for Ethereum on Polygon’s offering.\n\n‘Intense and Inspiring’\n\n“After more than a year of intense and inspiring research, development, and testing, we are incredibly proud to launch the first-ever zkEVM mainnet,” Mihailo Bjelic, Polygon’s co-founder, said onTwitter.\n\nThe DeFi community is counting on rollups to scale Ethereum, which, despite its ubiquity, has proven ill equipped to handle the workload for decentralized finance. Rollups work by bundling together transactions on a Layer 2 network before submitting the bundle to Ethereum’s mainnet for processing. In other words, this innovation may be crucial in enabling Ethereum to fulfill its promise.\n\nWhat Is Polygon? A Step-by-Step Guide to One of DeFi Most Popular Blockchains\n\nArbitrum and Optimism, the top Layer 2 networks by total value locked, both use optimistic rollups. Optimistic rollups offer easy compatibility with the Ethereum Virtual Machine (EVM), Ethereum’s core smart contract engine — meaning developers can easily port their from Ethereum’s mainnet to Layer 2.\n\nRollups powered by zero-knowledge proofs have long been touted as the holy grail for Ethereum scaling due to their improved performance and faster settlement compared to optimistic rollups.\n\nNext Bull Cycle\n\n“[ZkEVMs] will definitely help scale Ethereum to support more transactions in the future and will be a sorely needed addition to support the next bull cycle,” Bobby Ong, co-founder of CoinGecko, told The Defiant.\n\nOng added that the teams that are earliest to secure zkEVM market share will enjoy a significant first-mover advantage over their competitors.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nHowever, existing solutions are not compatible with the EVM, meaning developers historically have needed to build code from scratch to deploy it on ZK-rollups.\n\nBut on July 20, 2022, Scroll, Polygon, and Matter Labs all announced they were developing rollups secured by zero-knowledge proofs, or zkEVMs. Consensys, the blockchain software company chaired by Ethereum co-founder, Joseph Lubin, also revealed it was working on a zkEVM in November.\n\nWhile Polygon is the first team to publicly reveal a date for the launch of its zkEVM, Scroll has outpaced its rivals in terms of testnet adoption.\n\nDriven by Speculation\n\nMore than 900,000 unique wallets have interacted with the testnet for Scroll’s zkEVM, compared to 544,309 for Matter Labs’ zkSync 2.0 testnet, 85,166 for Polygon, and nearly 20,000 for Consensys, according to Messari.\n\nHowever, the high levels of testnet activity for Scroll and zkSync 2.0 may be driven by speculation that the projects may airdrop native tokens to early adopters in the future.\n\nZero-knowledge proofs are a privacy-preserving encryption method that was pioneered in the 1980s but struggled to find product-market-fit until Zcoin and Zcash leveraged the technology for privacy coins in 2016."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1zZWVzLXNvbWUtd2hhbGUtYW5kLXJldGFpbC1kZW1hbmQtYnV0LWhlcmVzLXRoZS1pc3N1ZS_SAVlodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tc2Vlcy1zb21lLXdoYWxlLWFuZC1yZXRhaWwtZGVtYW5kLWJ1dC1oZXJlcy10aGUtaXNzdWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Ethereum sees some whale and retail demand, but here’s the issue - AMBCrypto News",
        "content": "ETH sees demand from whales and retail investors but in low volumes.\n\nETH TVL in Ethereum 2.0 soars to new ATH.\n\nThe Ethereum network’s next major upgrade dubbed Shanghai is less than a month away. Major network upgrades usually attract some investor interest days before the actual date of the event. Now, the question is- Will the same scenario play out for ETH?\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nRecent data reveals that ETH is experiencing noteworthy demand, especially from retail investors. There are currently over 23.3 million addresses holding at least 0.01 ETH and those addresses are currently at an 8-month high.\n\nThis confirms that retail buyers have been accumulating, perhaps in anticipation of some upside as the Shanghai countdown narrows.\n\nBut how does this match up to the level of demand from the whales or institutional buyers? A quick glance at the state of addresses holding over 1,000 and over 10,000 ETH reveals that they have been adding to their balances in the last seven days. This confirms that larger addresses or whales have also been accumulating the king alt.\n\nThings also look favorable for Ethereum on the DeFi front. The network’s TVL data revealed that the total value locked in ETH 2.0 deposit contracts has been growing. It recently reached a new all-time high (ATH) of 17.06 million ETH. It confirms that Ethereum 2.0 is still on a healthy growth trajectory.\n\n? #Ethereum $ETH Total Value in the ETH 2.0 Deposit Contract just reached an ATH of 17,061,207 ETH View metric:https://t.co/SzbMPqvhlb pic.twitter.com/eHxVwDn43i — glassnode alerts (@glassnodealerts) March 25, 2023\n\nSo, if the whales and retail segment are buying, why is ETH’s price not experiencing a massive rally?\n\nExchange flows may provide a reasonable answer. The volume of ETH flowing in and out of exchanges is down notably in the last seven days. It implies that the prevailing volumes are weaker, hence a lower impact on price action.\n\nHowever, the latest Glassnode readings revealed that the ETH exchange outflow volume was almost double the exchange inflow volume.\n\nThese flows were responsible for curtailing ETH’s downside on Saturday (25 March) and a 3.6% uptick within the last 24 hours to its $1778 press time price.\n\nHow many are 1,10,100 ETHs worth today?\n\nAlthough ETH is currently demonstrating some bullish signs, investors should note that the volumes are still low. The cryptocurrency has been stuck in a saturated performance for the last few days. Capitulation is still a likely outcome that may lead to a resurgence of sell pressure in the next few days.\n\nInvestors should watch for whether ETH demand will continue increasing in the next few days. This would give insights into what to expect."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jZnRjLWNhbGxzLWV0aC1hLWNvbW1vZGl0eS1pbi1iaW5hbmNlLXN1aXQtaGlnaGxpZ2h0aW5nLXRoZS1jb21wbGV4aXR5LW9mLWNsYXNzaWZpY2F0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "CFTC calls ETH a commodity in Binance suit, highlighting the complexity of classification - Cointelegraph",
        "content": "The United States Commodity Futures Trading Commission filed suit against Binance on March 27 for violations of the Commodities Exchange Act and CFTC regulations. Those violations included transactions with Ether (ETH), according to the suit. This claim, at first glance, touched on a notable point of contention between the CFTC and Securities and Exchange Commission.\n\nThe CFTC claimed in its suit that Binance engaged in transactions with “digital assets that are commodities including bitcoin (BTC), ether (ETH), and litecoin (LTC) for persons in the United States.” That was not a new position for the agency. The CFTC claimed ETH was a commodity in its suit against FTX in December, and Chair Rostin Behnam stated his opinion that ETH and stablecoins were commodities as recently as March 8 in a Senate hearing.\n\nThe CFTC position on ETH was fairly uncontroversial before the Ethereum Merge. After Ethereum moved to a proof-of-stake consensus mechanism, SEC Chair Gary Gensler commented on staking coins, saying that “from the coin’s perspective, […] that’s another indicia that under the Howey test, the investing public is anticipating profits based on the efforts of others.”\n\nGensler’s comment brought on a slow wave of reactions. In February, for example, Ethereum co-founder and crypto entrepreneur Joseph Lubin told Cointelegraph, “Staking is not a security,” and it would be a “terrible path for the U.S.” to make it so. He added that he thought the U.S. courts would agree with him and that “there would be a tremendous outcry from not just the crypto community but different politicians and certain regulators” if ETH were classified as a security.\n\nRelated: CFTC head looks to new Congress for action on crypto regulation\n\nThe CFTC case against Binance does not rest on the nature of ETH as much as the nature of Binance products, however, limiting its applicability to the larger argument.\n\n“In this particular case, ETH is being treated as a ‘commodity’ rather than a ‘security,’” Timothy Cradle, director of regulatory affairs at Blockchain Intelligence Group, told Cointelegraph. “The complaint references securities as they relate to swaps.” Cradle added:\n\n“The economics of an offering including ETH could still change the definition applied to the token. For example, ETH staking could still be construed as an investment contract, and as such a security.”\n\nSome transactions, such as mixed swaps involving ETH, could be subject to regulation by both the SEC and CFTC, Cradle said, but that “would not necessarily define ETH itself as a security as mixed swaps also include commodities and currencies.”\n\nThis more complex approach to regulation would not necessarily imply cooperation between the two agencies. Yankun Guo, a partner at law firm Ice Miller, said of the situation in a statement to Cointelegraph:\n\n“It shows that both the multifaceted nature of how tokens function and how they are used can cause them to fall under multiple agencies’ jurisdictions. […] I wouldn’t be surprised to see a similar lawsuit by the SEC naming all the same tokens except BTC as securities.”\n\nSilver lining\n\n\n\nThe CFTC suit against Binance states that ETH is a commodity\n\n\n\nTask failed successfully pic.twitter.com/8HiF8LUOoi — sassal.eth (@sassal0x) March 27, 2023\n\nMagazine: Can you trust crypto exchanges after the collapse of FTX?"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdS50b2RheS80MTAtdHJpbGxpb24tc2hpYmEtaW51LXNoaWItYnVybi1ieS1ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLW1pZ2h0LWJlLWJpZ2dlc3Qtb2YtYWxsLXRpbWUtZGV0YWlsc9IBdmh0dHBzOi8vdS50b2RheS80MTAtdHJpbGxpb24tc2hpYmEtaW51LXNoaWItYnVybi1ieS1ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLW1pZ2h0LWJlLWJpZ2dlc3Qtb2YtYWxsLXRpbWUtZGV0YWlscz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "410 Trillion Shiba Inu (SHIB) Burn by Ethereum's Vitalik Buterin Might Be Biggest of All Time: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nConor Grogan, a director at Coinbase, recently took to Twitter to provide a list of the most expensive crypto-transactions-by-chain that he was aware of. According to the list he supplied, the Ethereum network's $4.4 billion move between Binance wallets on May 7, 2022, took the top spot.\n\nAdvertisement\n\nDid not include transactions to burn addresses; if I did, @VitalikButerin burn of $7B in SHIB would probably be #1 of all time\n\n\n\nNote: Cardano, Solana, Avalanche, Optimism, and others not included due to challenges navigating blockchain infrastructure there (Wen @ArkhamIntel?) pic.twitter.com/WXXeeNtqhp — Conor (@jconorgrogan) March 26, 2023\n\nIn the second spot, there was a $1.94 billion move by Binance to cold storage on Feb. 22.\n\nIn June 2018, Tron founder Justin Sun made a huge $1.46 billion transfer to the Huobi exchange. This took fourth place. Then in April 2020, $1.1 billion worth BTC moved from Bitfinex for the refill of its exchange hot wallet.\n\nAmong these noteworthy transactions is a transfer of $65.53 million worth of XRP from Bitso to Bithumb.\n\nWhile all of these transactions have a place in history, none stands out compared to Ethereum co-creator Vitalik Buterin's massive 410 trillion Shiba Inu burn.\n\nGrogan stated that if transactions to burn addresses are taken into consideration, Vitalik Buterin's $7 billion might be the biggest of all time. This even surpasses the $4.4 billion ETH move between Binance wallets previously stated. Grogan also says he did not include $13 billion worth of BETH burned back on June 7, 2022, in the list he provided for lack of clarity on the transaction.\n\nVitalik Buterin's massive 410 trillion SHIB burn\n\nIn May 2021, Ethereum co-creator Vitalik Buterin burned 90% of his SHIB holdings, totaling around $7 billion, saying he did not want to be a locus of power of that kind. Buterin had been unwillingly gifted half of SHIB's total supply.\n\nA stash of over 410 trillion tokens was sent to a dead blockchain address in a single transaction, removing them from circulation.\n\nThe remaining 10% was earmarked for charitable causes by the Ethereum co-creator."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9udmlkaWEtc2F5cy1jcnlwdG8tYWRkcy1ub3RoaW5nLTE4NTcxMzU1Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Nvidia Says Crypto Adds Nothing to Society, Despite Profiting From Mining - Yahoo Finance",
        "content": "Computer hardware manufacturer Nvidia has profited off of the cryptocurrency mining industry in recent years—but now CTO Michael Kagan has reportedly said that crypto does not “bring anything useful for society,” according to The Guardian.\n\nInstead, Kagan hopes that NVIDIA products are used for artificial intelligence (AI) development rather than crypto mining.\n\n“All this crypto stuff, it needed parallel processing, and [Nvidia] is the best so people just programmed it to use for this purpose,” Kagan said. “They bought a lot of stuff, and then eventually it collapsed, because it doesn’t bring anything useful for society. AI does.”\n\nNvidia Hackers Are Selling Ethereum GPU Mining Workaround\n\nWhile Kagan argues that the crypto industry has “collapsed,” Bitcoin and Ethereum, the two largest cryptocurrencies by market cap, have regained value in recent months. Bitcoin is up 17% in the past month, and Ethereum is up 7% per CoinGecko data.\n\nThe emerging Web3 gaming industry has also seen substantial venture capital funding in recent months. But Kagan simply doesn’t believe that crypto has merit.\n\n“I never believed that [crypto] is something that will do something good for humanity,” he added. “You know, people do crazy things, but they buy your stuff, you sell them stuff. But you don’t redirect the company to support whatever it is.”\n\nKagan did not immediately respond to Decrypt’s request for comment.\n\nNvidia has a historically mixed relationship with crypto. Before Ethereum’s move to a more energy-efficient proof-of-stake model in September 2022, there was a high demand for powerful graphics cards (GPUs) as Ethereum miners used them to mine token rewards via the original proof-of-work model.\n\nCombined with a pandemic-related chip shortage, the cost of GPUs skyrocketed and it became near-impossible for gamers to buy the latest generation of graphics cards.\n\nIn an effort to deter crypto miners, Nvidia first tried to force hashrate limitations on its products—for which hackers found a workaround. Later, the company released special products designed for crypto miners, such as the Nvidia Cmp Hx, a chip which NVIDIA’s website states is “designed for professional mining operations.”\n\nStory continues\n\nSEC Fines Nvidia $5.5M for Not Disclosing Crypto Mining Impact on Gaming Business\n\nDespite Kagan’s dislike for crypto, Nvidia has profited off of the industry for years. The firm’s PC original equipment manufacturer (OEM) revenue jumped 200% in 2017, with Nvidia writing that the spike was “due primarily to strong demand for GPU products targeted for use in cryptocurrency mining.”\n\nLast year, Nvidia paid the U.S. Securities and Exchange Commission (SEC) $5.5 million in fines for failing to disclose that its gaming GPUs also saw success because crypto miners were buying up those products en masse as well."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL252aWRpYS1zYXlzLWNyeXB0by1hZGRzLW5vdGhpbmctdXNlZnVsLXRvLXNvY2lldHktYWZ0ZXItYmlsbGlvbnMtaW4tbWluaW5nLXNhbGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Nvidia says 'crypto adds nothing useful to society' after billions in mining sales - CryptoSlate",
        "content": "Nvidia’s Chief Technology Officer, Michael Kagan, has expressed a negative view on cryptocurrencies, stating that they do not “bring anything useful for society,” whereas “AI does.”\n\nCrypto isn’t ‘useful for society’\n\nAccording to Kagan, AI applications such as the chatbot ChatGPT have more value than mining crypto. Kagan’s comments are not too surprising given that Nvidia has a history of distancing itself from the crypto community, such as limiting the ability of its graphics cards to mine Ethereum in 2021.\n\nKagan doubled down on his anti-crypto stance, stating that he has never believed in blockchain technology.\n\n“I never believed that [crypto] is something that will do something good for humanity.”\n\nNvidia’s recent crypto past\n\nHowever, Nvidia’s success in the stock market over the past two years does seem to have a correlation to the crypto industry. In 2021, prior to The Merge, Nvidia released a graphics chip (CMP) that was optimized for Ethereum mining while limiting gaming-focused graphics cards. However, the chips failed to impress as sales were ‘nominal’ and collapsed 77% in the third quarter of 2022.\n\nIn addition, Nvidia was fined $5.5 million in May 2022 by the SEC for failing to disclose the number of GPUs sold for mining. The SEC alleged that Nvidia knew the cards were being used for mining but failed to reveal the information, which, they said, misled investors regarding the growth of the business. Given that the majority of Nvidia cards were used to mine Ethereum, which moved to proof-of-stake at the end of 2022, it is a fair criticism as demand for cards dissipated post-Merge.\n\nLeading up to the Ethereum Merge, which took place on Sept. 15, 2022, revenue for Nvidia gaming GPUs (which mostly still worked for crypto mining following community workarounds) fell to $1.57 billion, down from $3.2 billion the year prior. Thus, as demand for Ethereum miners fell, so did Nvidia’s sales. In fact, if you look at the Nvidia share price relative to the price of Ethereum, both reached all-time highs within a week of each other before declining significantly.\n\nInterestingly, Nvidia’s CEO, Jensen Huang, also said back in 2017 that “cryptocurrency and blockchain are here to stay. The market need for it is going to grow, and over time it will become quite large.”\n\nIt appears that now Ethereum has moved to proof-of-stake, and its CMP chips failed to take off; the company has all but completely turned its back on crypto, in line with Kagan’s statements. The company’s focus is on AI research and gaming, with major clients like Microsoft, Amazon, and Oracle purchasing over 36,000 of Nvidia’s AI-focused processors."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMjQ2MzEvcG9seWdvbi1sYXVuY2hlcy1maW5hbC1tYWlubmV0LXprZXZtLXNvbHV0aW9uLXNjYWxlLWV0aGVyZXVt0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNDYzMS9wb2x5Z29uLWxhdW5jaGVzLWZpbmFsLW1haW5uZXQtemtldm0tc29sdXRpb24tc2NhbGUtZXRoZXJldW0_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Polygon Launches Final Mainnet for zkEVM Solution to Scale Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAnother day, another zkEVM launch.\n\nPolygon today announced the final mainnet for its zkEVM product after the product’s testnet launch last October.\n\n“zkEVM can be recognized as the ‘holy grail’ of blockchain scaling,” Polygon’s co-founder Mihailo Bjelic told Decrypt. “It offers simultaneously three very important features. First is scalability. The second one is security. And the third one is EVM equivalency, or EVM compatibility. All three are equally important.”\n\nAD\n\nAD\n\nThe launch comes just days after zkSync launched its scaling solution, joining the competition to make Ethereum faster.\n\nWhat is zkEVM?\n\nzkEVM technologies batch transactions on so-called rollups into a zero-knowledge proof, hence the “zk,” and then execute those proofs on Ethereum. By reducing transactions into small pieces of data, this technology helps keep Ethereum relatively unclogged with activity.\n\nAs mentioned by Bjelic, these proofs are also easily compatible with the Ethereum Virtual Machine, making it easier for developers to simply move projects written using Solidity—Ethereum’s programming language—over to the networks.\n\nGiven the complexity of the code in play, the Polygon co-founder has also urged caution for users onboarding to the scaling solution.\n\n“This is bleeding edge technology that is deployed on mainnet for the first time and made available to everyone,” he said. “We definitely advise caution and not moving large amounts of funds to it. Give it time, basically, to become a little bit more battle-tested and mature.”\n\nAD\n\nAD\n\nThat doesn’t mean that the network is by any means untested, insisted Bjelic.\n\nIt’s already been through a comprehensive auditing cycle, both internally and externally. The team has also already identified several bugs and “made many improvements” to the network since its testnet launched last October.\n\n“Like any code, especially complex code like this one, it still needs time to fully mature. Here's why the label name is Beta,” he told Decrypt.\n\nBesides various crypto-native projects, including MetaMask and Lens Protocol, Telefónica Tech is also joining Polygon’s zkEVM Beta. The telco’s digital transformation subsidiary is turning to Polygon for its traceability and notarization solution called TrustOS."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtd2hhbGVzLXBsYXktc2h5LWd1eS1haGVhZC1vZi1zaGFuZ2hhaS11cGdyYWRlL9IBVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtd2hhbGVzLXBsYXktc2h5LWd1eS1haGVhZC1vZi1zaGFuZ2hhaS11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Ethereum [ETH] whales play ‘shy guy’ ahead of Shanghai Upgrade - AMBCrypto News",
        "content": "Holders of 10,000 to 1,000,000 ETH coins have reduced their holdings in the last month.\n\nLong-held ETH coins change hands as the Shanghai Upgrade draws closer.\n\nAhead of the 12 April date set for the Shanghai Upgrade, on-chain data revealed a gradual decline in Ether [ETH] holdings for whales that hold between 10,000 to 1,000,000 ETH coins.\n\nAccording to data from on-chain data provider Santiment, this cohort of investors held 1298 ETH tokens at press time. In fact, on 23 March, their collective ETH holdings fell to the lowest level in the last month. 30 days ago, this group of ETH investors held 1313 ETH coins.\n\nRead Ethereum [ETH] Price Prediction 2023-24\n\nConversely, ETH whales that hold between 10 to 10,000 ETH coins have intensified their Ether holdings during the same period, data from Santiment showed.\n\nHolding 358,100 ETH coins at press time, this group of ETH investors increased their holdings by 1% in the last month. As a result, they currently hold 28.87% of the total supply of the leading altcoin.\n\nLong-held Ether coins see action\n\nA further assessment of ETH’s on-chain performance in the last month revealed a slump in its Mean Coin Age and Mean Dollar Invested Age metrics on 22 March.\n\nPer Santiment Academy, Mean Coin Age refers to the average age of all coins/tokens on the blockchain. In contrast, Mean Dollar Invested Age refers to the average age of all coins/tokens on the blockchain weighted by the purchase price.\n\nA rise in an asset’s Mean Coin Age points to a network-wide accumulation of that token. On the other hand, when an asset’s Mean Dollar Invested Age increases, “it means that the locations of where the investments lie are becoming more and more dormant over time.”\n\nWhile it is normal for an asset’s Mean Dollar Invested Age to increase on most days, if it continues to rise for an extended period, it may suggest stagnancy on the coin’s network, making it difficult for the price to grow.\n\nThe brief decline in ETH’s Mean Coin Age and Mean Dollar Invested Age on 22 March indicated that long-held ETH coins changed hands, signaling a momentary drop in accumulation.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nA look at ETH’s exchange activity revealed a spike in the coin’s supply outside of exchanges on that day. This meant that while long-held ETH coins changed addresses, they were not sold. In fact, they have moved off exchanges and could have been staked.\n\nAt press time, the total value of ETH staked was 17.86 million ETH coins, having grown by 4% in the last month, according to data from Glassnode. During the same period, the total number of validators on the proof-of-stake network rallied by 4.2%."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tc2VuZHMtaGlkZGVuLW1lc3NhZ2UtMTgwMTQyNjM3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Sends Hidden Message in First Polygon zkEVM Transaction - Yahoo Finance",
        "content": "Polygon launched the long-awaited mainnet for its new Polygon zkEVM network today, and to mark the occasion, the core developers of the sidechain invited Ethereum creator Vitalik Buterin to send out the very first transaction—and he included a hidden message.\n\nButerin appeared on a livestreamed event to mark the occasion, and while building the transaction, he included the following message converted into hex code: “A few million constraints for man, unconstrained scalability for mankind.”\n\nFurthermore, Buterin repeatedly set the Ethereum network transaction gas limit to 69,042, potentially referencing one meme number (69) and nearly another one (420) as well. Polygon Labs Head of Growth Sanket Shah tweeted that the gas limit number made the Ethereum creator a “man of culture.”\n\n.@VitalikButerin did the symbolic first ever transaction on @0xPolygon #zkEVM and it has a message on it \"Millions of constraints for man, unconstrained scalability for mankind\" Goose bumps!! https://t.co/HLNiVyRLie pic.twitter.com/Ue0C1CuDTd — Sandeep Nailwal | sandeep. polygon 💜 (@sandeepnailwal) March 27, 2023\n\n“And just like that, Vitalik Buterin has completed the first transaction on the newly deployed Polygon zkEVM chain,” Polygon Labs President Ryan Wyatt tweeted this morning. “This is a big moment for scaling decentralized protocols to handle our growth.”\n\nPolygon zkEVM is billed as a next-generation blockchain network that enables faster and cheaper transactions that Ethereum’s own mainnet can handle.\n\n.@VitalikButerin sent the transaction on Polygon zkEVM He is a man of culture. Ensure that the gas limit is 69042 pic.twitter.com/Eh0ebi7giA — sanket.polygon | polygon zkEVM on 27th March (@sourcex44) March 27, 2023\n\nUnlike previous layer-2 and sidechain networks, a zkEVM pairs zero-knowledge rollups—which bundle together loads of transactions and execute those proofs onto Ethereum—with full compatibility with the Ethereum Virtual Machine. That means that it’s a native complement to Ethereum and that smart contracts, which contain the code that powers decentralized protocols and software, can be easily moved over to the zkEVM network.\n\nStory continues\n\nPolygon Launches Final Mainnet for zkEVM Solution to Scale Ethereum\n\n“zkEVM can be recognized as the ‘holy grail’ of blockchain scaling,” Polygon’s co-founder Mihailo Bjelic told Decrypt ahead of today’s launch.\n\nIt’s not the only zkEVM network out there, however: others are in development, and rival zkSync launched its own mainnet last week ahead of Polygon’s previously-announced move."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1hcmUtc3RlYWx0aC1hZGRyZXNzZXPSAT1odHRwczovL2RlY3J5cHQuY28vcmVzb3VyY2VzL3doYXQtYXJlLXN0ZWFsdGgtYWRkcmVzc2VzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "What Are Stealth Addresses? - Decrypt",
        "content": "In brief Stealth addresses provide more privacy for transactions on Ethereum.\n\nThe system offers a method of privacy similar to generating a new address for each transaction but without the hassle of manually creating those addresses each time.\n\nA stealth address can be thought of as a wallet address that is cryptographically tied to the recipient's public address, but that is only revealed to the parties transacting.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nStealth addresses provide privacy for transactions on Ethereum. While it’s impossible to completely hide a blockchain transaction, stealth addresses can, at the very least, conceal the recipient's identity. And in doing so, offer an added layer of protection for anyone who doesn't want the transaction data overtly tied to them.\n\nOn a distributed ledger (a public record of transactions), anyone can view details of a transaction such as the date, the amount, and the wallets or the entities involved. They can search the specific transaction ID or hash on a block explorer, such as etherscan for Ethereum or Blockstream for Bitcoin.\n\nThat said, attempts to enhance privacy in the Ethereum ecosystem aren't without challenges both from a regulatory and technical standpoint. Case in point: the obstacles with Tornado Cash in 2019 (OFAC sanctions aside). Ethereum co-founder Vitalik Buterin noted that the virtual currency mixer is only able to hide ETH or major ERC-20s tokens. This leaves a gap for other widely-used assets native to the Ethereum protocol such as POAPs, NFTs, and ENS names. Hence the reason for stealth addresses.\n\nAD\n\nAD\n\nStealth addresses can conceal the recipient's identity.\n\nProposed by Buterin in a recent blog post, a \"stealth address system\" would offer enhanced privacy protections for users, regardless of how small the transaction size or the asset in question.\n\nHow do stealth addresses work?\n\nParaphrasing Buterin, this is how stealth addresses work:\n\nEither the recipient (let’s call them “Bob”) or the sender (“Alice”) can generate a stealth address for the transaction. However, only the recipient, Bob, can control the transaction. Another way to think of a stealth address is as a wallet address that is cryptographically tied to Bob’s public address, but that is only revealed to the parties transacting.\n\nTo conceal their identity, Bob first needs to generate a secret “spending key,” which is then used to create a stealth \"meta-address.\" The meta-address is then shared with the sender (Alice), who performs a computation to generate a stealth address that belongs to Bob.\n\nAlice can then send any assets she wants to Bob. When Alice sends assets to the stealth address, she also publishes some extra cryptographic data on-chain (called an ephemeral pubkey) that helps Bob find the assets. Bob scans the chain for this cryptographic data; if he finds any, he uses his spending key to claim the assets.\n\nAD\n\nAD\n\nOverall, this system offers a method of privacy similar to that of generating a new address for each transaction, but without the hassle of manually create those addresses each time. Along with sharing the meta-address with Alice, Bob can register it on ENS (Ethereum Name Service) as the stealth meta-address for something like bob.eth. In that scenario, and assuming Alice knows Bob owns bob.eth, Alice can then look up his stealth meta-address on ENS.\n\nChallenges and limitations with stealth addresses\n\nWhile the idea is still fairly embryonic, Buterin stated that the technology would be fairly easy to implement. But there are still several issues to solve; most notably, gas fees. As a newly-generated stealth address would contain no ETH, the owner of said address wouldn't be able to send any assets from it (to pay for gas fees) without first transferring ETH from another address. But by doing so, the transaction data would reflect on-chain data, thus defeating the purpose of it being anonymous.\n\nAnother long-term solution that Buterin proposed would be to use Zero-Knowledge Proofs, despite also being somewhat costly due to the extra gas required. Other potential pathways would be to use specialized transaction aggregators—something where users can pay for multiple transactions at once and then spend these prepaid transactions whenever necessary.\n\nIn his closing thoughts, Buterin stated that supporting stealth addresses would also require significant changes to the functionality of Ethereum-based wallets, and suggests that wallet developers should start working towards a multi-address model that is able to properly encrypt and decrypt transaction data along with create a new address for each application or new addresses for privacy-related reasons as well.\n\nAnd while not perfect, stealth addresses are another tool to help increase the overall privacy in the Ethereum network and thus solve one of the bigger remaining challenges for the ecosystem to scale."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ob2xkZXJzLW1pZ2h0LWJlLWVsYXRlZC10by1rbm93LXRoaXMtYWJvdXQtZXhjaGFuZ2UtYmFsYW5jZS_SAV9odHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0taG9sZGVycy1taWdodC1iZS1lbGF0ZWQtdG8ta25vdy10aGlzLWFib3V0LWV4Y2hhbmdlLWJhbGFuY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Ethereum holders might be elated to know this about exchange balance - AMBCrypto News",
        "content": "Ethereum exchange balance hit a five-year low as more holders moved their assets to self-custody options and DeFi platforms.\n\nThe decline in exchange balance can be attributed to factors such as the rise of DeFi, the switch to PoS, and the downturn in the crypto market.\n\nThe beginning of the year ushered in a whirlwind of events that significantly influenced the crypto industry, with Ethereum being (ETH) no exception.\n\nThe current state of affairs, including the SEC’s regulatory crackdown and potential bank runs, has undoubtedly left ETH holders feeling disillusioned. However, other factors might be responsible for the dwindling ETH exchange balance.\n\nRead Ethereum [ETH] Price Prediction 2023-24\n\nEthereum exchange balance declines\n\nIn 2022, the FTX crash sent shockwaves through the crypto world, causing many holders to question the safety of keeping their assets on exchanges.\n\nThe incident sparked a renewed interest in self-custody to secure crypto holdings. However, while Ethereum experienced a decrease in exchange balances in the months following the crash, this trend can be attributed to other factors beyond fear of exchange insecurity.\n\nEthereum exchange netflow flashes negative\n\nAccording to a recent Glassnode chart from Glassnode alerts, the balance of Ethereum held on exchanges has been steadily decreasing.\n\nAs of this writing, the exchange balance had reached a five-year low, hovering just above $18 million. This trend indicates that more ETH holders are opting for alternative storage methods rather than leaving their assets on exchanges.\n\nIn addition, a closer examination of Ethereum’s exchange netflow reveals that the outflow of ETH from exchanges has exceeded the inflow, with few exceptions of inflow spikes.\n\nCurrently, the netflow of ETH on exchanges remains negative, with outflow continuing to dominate. At the time of writing, the netflow had surpassed 11,000 ETH already, highlighting the ongoing trend of ETH holders moving their assets away from exchanges.\n\nPossible reasons for declining exchange balance\n\nOne possible factor is the rise of decentralized finance (DeFi) platforms built on the Ethereum network. Many holders have moved their funds from centralized exchanges to DeFi protocols to earn higher yields.\n\nThe yields come through liquidity provision, staking, or other forms of participation in decentralized finance. Also, ETH stakes account for 15% of the coins in circulation per staking rewards.\n\nIt is also possible that some holders took a more long-term investment approach by holding their assets in personal wallets. It is a means of storing value and avoiding short-term trading risks.\n\nAlso, the crypto market experienced a downturn in the latter half of 2022. The downturn may have led some holders to move their assets off exchanges and into personal wallets.\n\nDaily timeframe move and 365-day MVRV\n\nDespite experiencing a decent price run, Ethereum (ETH) had yet to regain the price zone it dropped back in May. As of this writing, it was trading at approximately $1,740 and had sustained losses for two consecutive days. However, ETH had maintained a support level of around $1,732 and $1,630, previously resistance levels.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nThe 365-day Market Value to Realized Value ratio (MVRV) revealed that for most of the period being analyzed, ETH was trading below zero.\n\nHowever, as of this writing, the MVRV had surpassed the zero line and currently sat at 13.60%. This indicated that, on average, the holders of ETH were now profitable, given the price at which they acquired their coins."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldWwtanVtcHMtMzUtYXMtZXVsZXItZmluYW5jZS1oYWNrZXItcmV0dXJucy1hbm90aGVyLTEwMG0td29ydGgtb2YtZXRoZXJldW0v0gFpaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V1bC1qdW1wcy0zNS1hcy1ldWxlci1maW5hbmNlLWhhY2tlci1yZXR1cm5zLWFub3RoZXItMTAwbS13b3J0aC1vZi1ldGhlcmV1bS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "EUL Jumps 35% as Euler Finance Hacker Returns Another $100M Worth of Ethereum - CryptoPotato",
        "content": "The hacker behind the largest DeFi exploit of 2023 continues to demonstrate controversial behavior, as this time, they returned the majority of the funds stolen from Euler Finance.\n\nIn two separate transactions, the perpetrator sent back over $100 million worth of ETH to the protocol.\n\nCryptoPotato reported the flash loan attack, which took place earlier in March, that saw $198 million worth of USDC, staked ether, wrapped BTC, and DAI siphoned off the DeFi lending protocol. Later reports suggested that this vulnerability was evident for over eight months before the exploit.\n\nThe team behind the project offered the attacker a $20 million bounty, which they rejected, and started laundering portions of the proceeds via TornadoCash.\n\nInterestingly, the perpetrator returned some funds to an Euler user who complained on Twitter. Shortly after, the attacker also sent back some ether to the DeFi protocol, while reports suggested that they could be linked to the notorious Lazarus Group.\n\nFurther on-chain data from this weekend show that the hacker made two separate transactions returning over $104 million worth of ETH to Euler Finance.\n\nThe first was carried out on March 25, in which they sent back 51,000 ETH. The second, which happened hours later, saw the return of another 7,737 ETH.\n\nThe decision to return the majority of the funds positively affected the protocol’s native EUL token, which is up by more than 35% on a 24-hour scale."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMisQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iZWFycy1pbi10aGUtY3J5cHRvLW1hcmtldC1oYXZlLXN0YXJ0ZWQtdG8tZmVhci1ldGhlcmV1bS1ldGgtYW5kLXJlbnEtZmluYW5jZS1yZW5xLWFuZC10aGVpci1zdHJlbmd0aC1jYW4tcmV2ZXJzZS1hbnktYmVhci1tYXJrZXQtcG9zc2liaWxpdGllcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bears in the crypto market have started to fear Ethereum (ETH) and RenQ Finance (RENQ) and their strength can ... - Analytics Insight",
        "content": "Bears in the crypto market have been a force to be reckoned with, causing market downturns and bearish trends. However, with the rise of Ethereum (ETH) and RenQ Finance (RENQ), many crypto experts believe that the bear market may be coming to an end. In this article, we will explore why bears in the crypto market are starting to fear ETH and RENQ, and how these two cryptocurrencies could potentially reverse any bear market possibilities.\n\nThe Strength of Ethereum (ETH)\n\nEthereum (ETH) has been one of the most talked-about cryptocurrencies in recent times. ETH is a decentralized, open-source blockchain that allows developers to build decentralized applications (dApps) on top of it. ETH has become the go-to platform for developers looking to create smart contracts and dApps, making it one of the most widely adopted cryptocurrencies in the market.\n\nOne of the main reasons why bears in the crypto market are starting to fear ETH is because of its strong fundamentals. The network has a large and active developer community, with constant updates and improvements being made to the platform. Additionally, ETH has a wide range of use cases, from decentralized finance (DeFi) to non-fungible tokens (NFTs) and gaming.\n\nMoreover, ETH’s price has been on a steady rise. As of March 26, 2023, ETH’s price is around $1,775, with a market cap of $217 billion. With such a strong market capitalization and steady growth, bears in the crypto market are starting to worry that ETH could reverse any bearish trends.\n\nThe Strength of RenQ Finance (RENQ)\n\nRenQ Finance (RENQ) is a relatively new player in the crypto market, but it has quickly gained attention from investors due to its unique approach to decentralized finance (DeFi) and cross-chain interoperability. RENQ is designed to provide a decentralized platform for users to exchange assets across different blockchains, making it easier for users to move assets from one blockchain to another.\n\nRENQ’s unique approach to DeFi has caught the attention of many investors, and the cryptocurrency has been on a steady rise in recent months. As of March 26, 2023, RenQ Finance’s presale has raised over $3.4 million with a price of $0.03 per RENQ token. With such a strong response to the presale, bears in the crypto market are starting to fear that RENQ could also reverse any bearish trends.\n\nThe Potential for a Market Reversal\n\nWith the strength of ETH and RENQ, many crypto experts believe that a market reversal could be on the horizon. The fundamentals of these two cryptocurrencies are strong, and their market capitalizations and steady growth are proof that investors have faith in them.\n\nMoreover, the crypto market has been known to be volatile, and a sudden surge in demand for ETH and RENQ could potentially lead to a market reversal. The crypto market is also heavily influenced by market sentiment, and if investors start to feel bullish about ETH and RENQ, it could lead to a surge in demand and potentially reverse any bearish trends.\n\nConclusion\n\nThe crypto market has seen its fair share of bearish trends, causing worry among investors. However, with the impressive performance of Ethereum (ETH) and RenQ Finance (RENQ), crypto experts are optimistic that a market reversal is possible. ETH and RENQ have shown strong fundamentals, high market capitalizations, and consistent growth, indicating that investors have a great deal of confidence in these two cryptocurrencies.\n\nWhile the crypto market is always unpredictable, the potential for a market reversal is certainly there, and investors should keep a close eye on ETH and RENQ as they navigate the market.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmRhaWx5bWFpbC5jby51ay9zY2llbmNldGVjaC9hcnRpY2xlLTExOTA2ODI1L0NyeXB0b2N1cnJlbmNpZXMtbm90LXVzZWZ1bC1zb2NpZXR5LXNheXMtTnZpZGlhLmh0bWzSAXFodHRwczovL3d3dy5kYWlseW1haWwuY28udWsvc2NpZW5jZXRlY2gvYXJ0aWNsZS0xMTkwNjgyNS9hbXAvQ3J5cHRvY3VycmVuY2llcy1ub3QtdXNlZnVsLXNvY2lldHktc2F5cy1OdmlkaWEuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Cryptocurrencies are not 'useful to society', says Nvidia - Daily Mail",
        "content": "READ MORE: Crypto mining is worse for the environment than beef production\n\nFrom Bitcoin to Ethereum, cryptocurrencies have been hailed as the new way to pay for products and services online.\n\nBut according to one expert, they do not 'bring anything useful for society', despite using up massive amounts of processing power.\n\nMichael Kagan, chief technology officer at chipmaker Nvidia, has said cryptocurrencies will never 'do something good for humanity'.\n\nThe expert has citied artificial intelligence (AI) – including chatbot ChatGPT – as being of more use to the public and a better use of energy than 'crypto mining'.\n\nCryptocurrencies perform mining to generate new coins and verify transactions, but it's more environmentally costly than beef production, a recent study found.\n\nCryptocurrencies such as Bitcoin are the internet's version of money - unique pieces of digital property that can be transferred from one person to another\n\nKagan told the Guardian that the development of chatbots along the lines of ChatGPT was a more worthwhile act than crypto mining.\n\nWhat is crypto mining? People create Bitcoins and other cryptocurrencies through what is known as mining. Mining is the process of solving complex math problems using computers running Bitcoin software. These mining puzzles get increasingly harder as more Bitcoins enter circulation. Each time a puzzle is solved, a new groups of transactions - known as blocks - are added to the blockchain (the shared transaction record). Miners are rewarded by being issued with bitcoin. Advertisement\n\nChatGPT, created by San Francisco-based company OpenAI, has been trained on a massive amount of text so it can generate human-like answers to questions.\n\nSince its release in November, it's been used to write essays, prescribe antibiotics, fool job recruiters and even come up with beer recipes.\n\n'With ChatGPT, everybody can now create his own machine, his own programme,' Kagan said.\n\n'You just tell it what to do, and it will and if it doesn't work the way you want it to, you tell it \"I want something different\".'\n\nIn comparison, crypto is not 'something that will do something good for humanity', Kagan said.\n\nCryptocurrencies are the internet's version of money – unique pieces of digital code that can be transferred from one person to another.\n\nMining, meanwhile, lets people earn cryptocurrencies by solving computational problems that verify transactions in the currency.\n\n'All this crypto stuff, it needed parallel processing, and [Nvidia] is the best, so people just programmed it to use for this purpose,' Kagan said.\n\nBitcoin is the world's most popular cryptocurrency, but others include Ethereum and Litecoin (file photo)\n\nPictured, a data centre of BitRiver company providing services for cryptocurrency mining in the city of Bratsk in Irkutsk Region, Russia March 2, 2021. The cryptocurrency is 'mined' by high-powered computers that solve computational maths puzzles, the complexity of which require huge amounts of energy\n\nREAD MORE - Bitcoin mining uses more energy than beef production Climate damages attributable to Bitcoin mining averaged more than beef production and the mining of multiple precious metals put together Advertisement\n\n'They bought a lot of stuff, and then eventually it collapsed, because it doesn't bring anything useful for society. AI does.'\n\nHis comments came despite Nvidia selling graphics processing units (GPUs) for use in crypto mining, although the company released software back in 2021 that deliberately biased against the practice.\n\nInstead, the US company likes to focus on providing its chips to the gaming sector, helping render graphics and images by performing rapid mathematical calculations.\n\nIt's also rapidly expanding into fields such as AU and provides its GPUs to smart vehicles and robotics – including the likes of Tesla and Amazon.\n\n'[GPU] users are constantly discovering new applications for them, from weather simulation and gene sequencing to deep learning and robotics,' Matt Wuebbling, global head of GeForce marketing at Nvidia, previously told the Guardian.\n\n'Mining cryptocurrency is one of them.'\n\nEarlier this month, Microsoft said it had recently purchased tens of thousands of Nvidia AI-focused GPUs to power the workload of OpenAI, the company behind ChatGPT.\n\nMicrosoft is an investor in the company and the two are engaged in a partnership aimed towards accelerating 'AI breakthroughs'.\n\nChatGPT is a large language model that has been trained on a massive amount of text data, allowing it to generate eerily human-like text in response to a given prompt\n\nOpenAI has has already launched a more powerful second version of the tool called GPT-4, which is so advanced it could be 'harmful'.\n\n'GPT-4 and successor models have the potential to significantly influence society in both beneficial and harmful ways,' the company said.\n\nIts success has created a panic at Google, which fears that its days as the world's number one search engine could soon come to an end.\n\nGoogle scrambled to come up its own equivalent chat bot, called Bard, to be released in the 'coming weeks'.\n\nUnfortunately for Google, Bard presented incorrect information as fact in a Twitter video, instantly wiping £100 billion from the tech giant's value."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3RlY2guaGluZHVzdGFudGltZXMuY29tL3RlY2gvbmV3cy9jcnlwdG8tc3VycHJpc2UtZXRoZXJldW0tZm91bmRlci12aXRhbGlrLWJ1dGVyaW4tYmFja2luZy16YW1iaWEtcy1iaWQtdG8tYmUtYWZyaWNhLXMtdGVjaC1odWItNzE2NDgzNjg5MzU0MTQuaHRtbNIBnwFodHRwczovL3RlY2guaGluZHVzdGFudGltZXMuY29tL2FtcC90ZWNoL25ld3MvY3J5cHRvLXN1cnByaXNlLWV0aGVyZXVtLWZvdW5kZXItdml0YWxpay1idXRlcmluLWJhY2tpbmctemFtYmlhLXMtYmlkLXRvLWJlLWFmcmljYS1zLXRlY2gtaHViLTcxNjQ4MzY4OTM1NDE0Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Crypto surprise! Ethereum founder Vitalik Buterin backing Zambia's bid to be Africa's tech hub - HT Tech",
        "content": "Zambia may be better known for mining copper than crypto, but a group of young entrepreneurs are looking to reinvent the country as an African technology hub -- with support from Ethereum co-creator Vitalik Buterin.\n\nStartup founders from the southern African country and abroad are talking to the government about creating the regulatory and business environment that would attract more tech firms and capital. The group is in the process of organizing a conference in Lusaka, the capital, in May to draft detailed policy proposals that they believe will see Zambia succeed where previous African tech hubs have stuttered.\n\n“Ultimately it comes down to being welcoming,” said Mwiya Musokotwane, an early champion of the project and the son of Finance Minister Situmbeko Musokotwane. “If the policy doesn't really live up to people's expectations, noone's going to be there.”\n\nButerin, who helped create the world's second largest cryptocurrency in 2013, expressed his support in a virtual meeting with Zambian President Hakainde Hichilema earlier this year. That followed a 2019 visit to the country as a guest of Mwiya, who wanted him to view a new charter city outside Lusaka that is also positioning itself to attract businesses.\n\n“I was impressed by everyone I met's willingness to go and do big things,” the crypto pioneer said in an interview.\n\nThe talks are a further sign of Africa's recent and burgeoning role as a hotbed for startups, particularly in the fintech and e-commerce sectors. Businesses providing financial services to the continent's millions of unbanked yet online people are attracting the attention of foreign investors particularly from the U.S., and African firms raised a record $5 billion in 2021.\n\nCompanies including Nigerian payments firm Flutterwave Inc., whose latest $250 million fund-raising round valued it at more than $3 billion, are also interested in growing a presence in Zambia, Mwiya Musokotwane said.\n\nEmployment Drive\n\nFor Hichilema, attracting tech firms could be a means of delivering on one of his key election pledges -- boosting employment. More than one in four Zambians under the age of 24 have no income, according to data from the International Labour Organization, and the ratio has been worsening since 2013. The President's commitment to resolving the issue played a major role in his August election victory after five previous failed attempts.\n\nHe has since created the Ministry of Technology and Science as part of a drive to support the sector and help ease dependence on copper, which accounts for 75% of export earnings. The government is eager to consult with entrepreneurs on attractive policies for the tech industry, including tax incentives, according to Jito Kayumba, Hichilema's special assistant for economic and development affairs and a former director at Kukula Capital, which invests in young Zambian companies.\n\n“We want to have a much more open-minded approach,” Kayumba said in an interview from Lusaka. “You can't milk a cow that isn't fully developed.”\n\nEarly Mover\n\nPerseus Mlambo, originally from neighboring Zimbabwe, was one of the early movers. He started payments platform Zazu Africa Ltd. in Zambia five years ago, a firm that now accounts for half of Mastercard Inc. transactions in the country.\n\nHe went on to raise $3 million last year from investors led by U.S. fund Tiger Global LP for a new venture called Union54, a firm that allows companies to issue their own debit cards without going through a bank. Tiger, the investor firm of billionaire Chase Coleman, has also backed Flutterwave and been involved in talks on the Zambia hub.\n\n“Copper is old and boring,” Mlambo said in an interview from Belluno, north of Venice, Italy. Governments “risk missing the proverbial boat by over-investing in extractives and under-investing in software. Tech uplifts multitudes of people and the barrier to entry is very, very low.”\n\nBut ultimately the success of the project will come down to legislation.\n\nZambia must improve the ease and cost of getting work permits, according to Malawi-born Wiza Jalakasi, vice-president of global developer relations at Chipper Cash, another Africa-focused fintech startup. And Mlambo said he's been waiting for a residence permit to be approved since September.\n\nStill, the nation that's changed the ruling party three times in thirty years already has progressive financial services regulation, making it attractive, Jalakasi said.\n\n“It's not the biggest market in the region, but you can test things very easily,” he said. “That's only going to get better with time as these policies are implemented.”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8venljcnlwdG8uY29tL3BvbHlnb25zLXprZXZtLW1haW5uZXQtYmV0YS1nb2VzLWxpdmUtdW5sb2NraW5nLWxpbWl0bGVzcy1wb3NzaWJpbGl0aWVzLWZvci1ldGhlcmV1bS1jb21wYXRpYmxlLWRhcHBzL9IBf2h0dHBzOi8venljcnlwdG8uY29tL3BvbHlnb25zLXprZXZtLW1haW5uZXQtYmV0YS1nb2VzLWxpdmUtdW5sb2NraW5nLWxpbWl0bGVzcy1wb3NzaWJpbGl0aWVzLWZvci1ldGhlcmV1bS1jb21wYXRpYmxlLWRhcHBzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Polygon’s zkEVM Mainnet Beta Goes Live, Unlocking Limitless Possibilities for Ethereum-Compatible DApps - ZyCrypto",
        "content": "Advertisement\n\nPolygon, formerly Matic Network, has announced its much-anticipated mainnet beta launch of its zero-knowledge Ethereum Virtual Machine (zkEVM). This development is expected to improve the scalability of decentralized applications (dApps) built on the Polygon network while enhancing its overall performance.\n\nAccording to the official blog post, the Polygon zkEVM will allow the integration of a layer 2 scaling solution to the Ethereum network. This is made possible through the implementation of zero-knowledge proofs, a technique that enables the validation of data without revealing the data itself.\n\nThe zkEVM mainnet beta launch will also bring increased security and privacy to dApps on the Polygon network. With this launch, Polygon will provide developers with a more efficient, cost-effective, and scalable infrastructure to build their decentralized applications.\n\nUnderstanding the Ethereum scaling technology\n\nPolygon zkEVM comes with several exciting features, such as instant finality, gas efficiency, and low transaction fees. These features will significantly enhance the user experience for developers, making it easy for them to build dApps that can handle a large volume of transactions without compromising on speed or security.\n\nAdditionally, the Polygon zkEVM is compatible with existing Ethereum developer tools such as Metamask, Remix, and Truffle, making it easy for developers to get started with the technology. This compatibility also means that developers can easily migrate their Ethereum dApps to the Polygon network without hassle.\n\nAdvertisement\n\nThe Polygon team has been working tirelessly to enhance the scalability and efficiency of its network. The launch of the Polygon zkEVM mainnet beta is a significant step towards creating a more scalable and accessible infrastructure for decentralized applications, which comes at a time when the Ethereum network is facing significant scalability challenges due to its limited transaction processing capacity. As more dApps are built on the network, the need for scalable solutions becomes more pressing. With this launch, Polygon is offering a solution that could help alleviate some of these challenges.\n\nPolygon’s MATIC token seems stuck in a rut as it continues to face a price stalemate amidst the broader bearish trend in the crypto market. Despite the community’s usual fervour that often triggers a significant surge in the price of MATIC, the digital asset was spotted trading at a meagre $1.03 at the time of writing.\n\nThe coin had incurred a loss of 6.22% over the last 24 hours and plummeted by more than 12.2% over the past seven days. It nonetheless preserves its status of being a target of big investors while inspiring hope that the launch of the zkEVM will serve as a major catalyst, positioning Polygon as the go-to blockchain for mainstream Web 2.0 companies."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaWctZXllcy1jb2luLWNvbW11bml0eS1wcmVwYXJlcy1mb3ItYm9uYW56YS1hcy1sYXVuY2gtbmVhcnMtYml0Y29pbi1ldGhlcmV1bS1jb250aW51ZS10by11cHRyZW5kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Big Eyes Coin Community Prepares For Bonanza As Launch Nears, Bitcoin & Ethereum Continue To Uptrend! - Analytics Insight",
        "content": "Crypto Soothsayers have predicted that the Big Eyes Coin is all set to break more records as the BIG community prepares for the official launch. When it comes to breaking records, Big Eyes Coin made headlines as it knocked the ball out of the park by hosting the most successful presale in recent history. Amidst terrible turbulence in the crypto market and a storm of volatility, Big Eyes Coin has successfully managed to raise $32 million! Based on these statistics, crypto investors are confidently placing their bets on Big Eyes Coin as they believe that this meme coin will soon come neck-to-neck with crypto giants like Bitcoin & Ethereum. Let’s learn more about this coin’s achievements till yet and why it is the safest and smartest investment option in the crypto market!\n\nBig Eyes Coin Presale – A Financial Gain Opportunity You Shouldn’t Miss!\n\nWithout a doubt, Big Eyes Coin has managed to captivate the hearts of most investors due to its generosity. This is also one of the major reasons why the Big Eyes Coin presale is turning out to be a sensational success. The BIG cat deeply cares about the financial gains of its community thus to ensure that every investor gets equal financial growth opportunities, it regularly gives out rewards and promo codes. From the magnificent loot boxes that can give up to a 1000% ROI to bonus codes that give a 250% bonus for free! – yep you read that right. Since the BIG launch is dawning upon us, this cute crypto kitty doesn’t want anyone to miss the chance to become an overnight millionaire which is why it has launched a very limited-time promo code BULLRUN250. This promo code allows you to get a 250% complimentary bonus upon the purchase of the BIG coins or loot boxes!\n\nIn addition to this, the Big Eyes Coin is also one of the few cryptos that deeply care about the well-being of their owners outside the crypto-verse as well. This is why the BIG cat has announced that 5% of the total generated revenue would go straight to charity wallets which will then be sent out for the well-being of the ocean. This all-rounder crypto is definitely off to a great start as investors are flocking to hoard this token and we can’t blame them as these off-furs are irresistible! Get your Big Eyes tokens now before the coin officially launches or you will miss out on the chance to gain massive presale benefits!\n\nBitcoin & Ethereum Regain Their Former Glory!\n\nThe rainbow is finally out after a long stormy winter night in the crypto town as most cryptos are once again hustling and bustling. The cryptos are chirping once again and are showing the world why they are the best investment options as the bullish trends restore in the crypto world. Among the loudest chirping ones are Bitcoin & Ethereum aka the king and queen of the crypto world. Despite hitting the rock bottom in the previous months, the crypto king and queen are back to their former glory as they continue to register massive gains over time. In the past seven days, Bitcoin registered 8.40% gains and ramped up its value to over $28,000 and maintains its top spot in the crypto chain, while Ethereum registered 5.67% gains in the last seven days and has increased its value to just above $1800 while maintaining the second spot from the top!\n\nKnow More About Big Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGVjcnlwdC5jby8xMjQ1OTgvbmZ0LXRyYWRlci1hY2NpZGVudGFsbHktYnVybnMtMTI5ay1jcnlwdG9wdW5r0gFNaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNDU5OC9uZnQtdHJhZGVyLWFjY2lkZW50YWxseS1idXJucy0xMjlrLWNyeXB0b3B1bms_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "NFT Trader Accidentally Burns $129K CryptoPunk - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn NFT trader was devastated Friday to discover that a CryptoPunk he purchased for 77 Ethereum went up in smoke after he accidentally sent the pricy piece of digital art to a burn address.\n\nToday I accidentally burned a @cryptopunksnfts trying to wrap punk 685. I was so focused on following the instructions exactly, that I slipped up, destroying a third of of my net worth in a single transaction. @yugalabs please sell me the @v1punks 685 as a consolation. 🙏🏼 pic.twitter.com/jHoTGvlc7j — Brandon Riley (@vitalitygrowth) March 25, 2023\n\nAD\n\nAD\n\nBurn addresses, which are digital wallets that don’t have a private key, are one-way gateways that can only receive assets like cryptocurrencies and NFTs. As a result, the NFT was permanently removed from circulation, preventing it from ever being traded or owned again.\n\nBrandon Riley, who purchased CryptoPunk #685 two weeks ago, said he made an error when attempting to wrap the NFT to take a loan against it on Twitter. He told Decrypt he planned on posting CryptoPunk #685 to NFTfi.com, where he could earn a yield of around 7% per year.\n\nI would just like to make one thing clear. I was not wrapping this punk to sell it on Blur. It was to be my “forever punk”. The number is exact reverse of my ape. I was only wrapping it because I needed to borrow some liquidity from it. — Brandon Riley (@vitalitygrowth) March 24, 2023\n\nCryptoPunk #685 was worth approximately $129,000 in Ethereum when it was acquired by Riley, according to the Ethereum block explorer Etherscan.\n\nOriginally created in 2017, CryptoPunks is widely viewed as a “blue chip” collection, on par with the likes of Yuga Labs’ Bored Ape Yacht Club. With a market capitalization of over $1 billion, the cheapest CryptoPunk is worth just over $109,000, according to NFT Price Floor.\n\nHowever, CryptoPunks were created before ERC-721 was established as a token standard for NFTs, making them incompatible with some marketplaces and applications designed for decentralized finance—such as NFTfi.com.\n\nAD\n\nAD\n\nUsing a guide he found online, Riley tried to wrap his punk as an ERC-721 token, creating a new digital token that proved he owned CryptoPunk #685 but would be compatible with NFTfi.com. But by inputting the wrong address, CryptoPunk #685 is now forever gone.\n\nThis is truly a devastating mistake for me.💔 But I did this myself, and it is no one’s fault but my own. Both the beauty and the curse of self-custody. Stay safe out there everyone, and please be way more careful than I was. Thank you to so many of you for the kind words. 🙏🏼 — Brandon Riley (@vitalitygrowth) March 25, 2023\n\nRiley’s unfavorable situation is indicative of issues that many face in the digital assets industry due to the often complex and irreversible nature of transactions. And because there are no financial intermediaries involved, there’s nothing Riley can do to get his lost CryptoPunk back, which he described as “both the beauty and the curse of self-custody.”\n\nOne Twitter user named NFToga pointed out that the guide used by Riley has since been updated, including language that specifically warns people not to send CryptoPunks to wallets formatted as burn addresses.\n\nAsking for some form of a reprieve, Riley asked Yuga Labs—which purchased the IP to CryptoPunks from Larva Labs last year—if he could buy the v1 version of CryptoPunk #685. CryptoPunks v2 was released after a bug was found in the original collection's smart contract.\n\nIn the original Cryptopunks smart contract, there was a code error that caused Ethereum to be allocated to the buyer instead of the seller when a purchase was made. In other words, a buyer was immediately refunded for their purchase and was able to keep the Punk. /2 — CryptoPunks ᵛ¹ (@v1punks) March 28, 2022\n\nRiley said that he has not yet from Yuga Labs after tagging them in his posts on Twitter, and Yuga Labs did not immediately respond to requests for comment from Decrypt.\n\nAD\n\nAD\n\nSometimes, NFTs aren’t burned by accident, but rather as a way of making a statement. Last month, Jason Williams burned BAYC # 1626—worth $169,000 at the time—to symbolically shift the asset’s underlying network from Ethereum to Bitcoin in the form of an Inscription made through Ordinals."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMinwFodHRwczovL21pbnRnZW5pZS5saXZlbWludC5jb20vbmV3cy9wZXJzb25hbC1maW5hbmNlL2FyZS10aGUtd2luZHMtb2YtY2hhbmdlLWJsb3dpbmctZm9yLWNyeXB0b3MtaW4taW5kaWEtYXMtYml0Y29pbi1zcGlrZXMtNjUtdGhpcy15ZWFyLWV0aC00Ni0xNTE2Nzk3MzA4Nzg1MTnSAaMBaHR0cHM6Ly9taW50Z2VuaWUubGl2ZW1pbnQuY29tL2FtcC9uZXdzL3BlcnNvbmFsLWZpbmFuY2UvYXJlLXRoZS13aW5kcy1vZi1jaGFuZ2UtYmxvd2luZy1mb3ItY3J5cHRvcy1pbi1pbmRpYS1hcy1iaXRjb2luLXNwaWtlcy02NS10aGlzLXllYXItZXRoLTQ2LTE1MTY3OTczMDg3ODUxOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Are the winds of change blowing for cryptos as Bitcoin spikes 65% this year, ETH 46%? - MintGenie",
        "content": "Despite a high rate of tax on crypto , declining trading volumes and recently imposed money laundering provisions , India’s crypto sector still manages to garner an increasing interest of investors.\n\nThere are a number of reasons that explain this conundrum. This Calendar year is turning out to be relatively good for cryptocurrencies. Investors heaved a sigh of relief after bitcoin's price hit a 9-month high recently after the Silicon Valley Bank's collapse.\n\n“The collapse fuelled the rise in crypto prices because the belief in centralised banking systems was affected. As the flaws in the existing systems become more evident, the crypto sector will continue to have a revival,” says Avinash Shekhar, Founder & CEO, TaxNodes.\n\nSome experts have called this trend an affirmation of ‘reverse relationship’ between fiat currencies and blockchain-generated currencies.\n\nTo explain in simpler words: while banking system is undergoing a turmoil with the collapse of two US-based regional banks (Silicon Valley Bank and Signature Bank), blockchain- generated currencies are getting a much-needed boost at the same time.\n\n“In a truly remarkable decoupling from traditional finance, Bitcoin price has been soaring since the banking crisis started unfolding. Medium-size and regional banks in the US are under pressure due to fast rising interest rates and a run-on deposits, while industry observers are of the view that Bitcoin’s fixed supply schedule offers a unique hedge against the current macro environment,” says Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch.\n\nBitcoin has been rising considerably since the start of this year. Bitcoins prices rose from $16,625 (on Jan 1) to $27,493 (on Mar 24), reporting an increase of 65.37 percent in fewer than three months. Trading volumes spiked by 182 percent during this period.\n\nEthereum prices also rose considerably from $1,201 (on Jan 1) to $1,752 (Mar 24), reporting an increase of 45.87 percent. The ETH trading volumes during this period rose by 356 percent, CoinMarketCap data shows.\n\nBTC trading Volume\n\n(Source: CoinMarketCap)\n\nCoinswitch’s Parth Chaturvedi also confirms a similar trend. “Trading volumes across asset classes is a function of prices and usually increasing prices attract more trading volume. We have witnessed a similar trend in crypto trading volumes, since the beginning of the year, when prices started moving higher. We continue to onboard new domestic users and are also seeing existing users come back with renewed interest as crypto as an asset class is helping in portfolio diversification,” says Mr Chaturvedi.\n\n“The rally in bitcoin and other crypto prices will certainly add a positive outlook for cryptos for long-term investors,” adds Shekhar from TaxNodes.\n\nPolkadot conference\n\nNow since cryptocurrencies are made on blockchain technology, India’s large IT population and ever-growing tech infrastructure can turn things to its advantage, assert industry experts.\n\n“Due to government policies and increased market awareness, there has been a decoupling of cryptocurrency from blockchain. This shift in focus presents India with a unique opportunity to become a powerhouse of blockchain innovation, given its large IT competent population. This trend is a testimony to the shifting interests in the technology, and we can expect to witness more eastward movement of blockchains in the near future,” says Gaurav Mehta, Founder of Catax — Simple Crypto Taxes.\n\nAn upcoming global blockchain conference next month by Polkadot blockchain platform is seen as a validation of India’s growing importance in the blockchain technology.\n\nPolkadot blockchain platform is hosting first global conference in India in the first week of April in run up to its foray into India.\n\nWhile talking about the conference, Rishant (Rish) Kumar, Growth Lead, APAC, KILT Protocol said that India is an important hub for blockchain innovation.\n\nThis global conference can be seen by crypto optimists as one of the key events in the annals of blockchain industry and its growing significance in India.\n\nIt’s technology, stupid!\n\nExperts argue that the blockchain technology is revolutionary and its innovative use cases and implications continue to unfold. And the confusion happens when the entire focus of investors revolves around crypto prices instead of viewing blockchain in its entirety.\n\n“Despite its immense potential, the public at large has predominantly focused on the oasis of cryptocurrency, attracted by the promise of quick returns and libertarian ideals. As a result, blockchain technology has received less attention and remained outside of mainstream discourse and implementation,” says Mr Mehta from Catax.\n\nHowever, in view of the extreme volatility witnessed in the past, investors are advised to be wary before getting too bullish on cryptocurrencies.\n\nAfter all, despite the recently reported increase in bitcoin prices, this cryptocurrency still trades nearly 60 percent lower than its all-time high of $68,789.\n\n“Investors are finding merit in Bitcoin’s function as a store of value against monetary debasement, and the next few months will be crucial in supporting this narrative,” Parth Chaturvedi signs off.\n\nSo far, it may be a good year for cryptocurrencies, but what does the future hold for them — only a crystal ball reader can predict."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaXRjb2luLWV0aGVyZXVtLWJvdW5jZS1iYW5rLWZvbGxvd2luZy1mZWRzLWludGVyZXN0LXJhdGUtaGlrZS1iaWctZXllcy1jb2luLWpvaW5zLXRoZS1idWxsLXJ1bi13aXRoLTI1MC1ib251cy1jb2RlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin & Ethereum Bounce Bank Following Fed's Interest Rate Hike – Big Eyes Coin Joins The Bull Run With 250 ... - Analytics Insight",
        "content": "The cryptocurrency market rebounded to $1.18 trillion after an overnight growth of 2.18%, following a sharp dip to $1.12 trillion the previous day in the aftermath of the US Federal Reserve raising interest rates by 0.25% for the ninth consecutive time.\n\nThe latest hike in interest rates has drawn concerns among traders that it could add to the current financial turmoil triggered by a string of bank closures and acquisitions in the US and Europe.\n\nThe crisis around the banking sector, however, has benefited the cryptocurrency industry with prices of Bitcoin (BTC) and Ethereum (ETH) rallying toward new highs as depositors were switching to digital assets from traditional banking.\n\nIn the meme coin space, Big Eyes Coin (BIG) joined the latest bull run with its latest bonus code which offers traders and BIG holders heavy returns ahead of its live launch.\n\nBitcoin – Pushback to $30,000 After Brief Drop\n\nBitcoin (BTC) resumed its pushback toward the $30,000 mark after the hike in interest rates by the US Federal Reserve caused a dip in BTC’s price to as low as $26,760. However, a fightback by investors pushed Bitcoin’s price above the $28,000 mark once again to continue its 70% upward movement experienced since the beginning of 2023.\n\nAt the time of writing, Bitcoin had risen by 2.24% in the past 24 hours to trade at $28,268.25, a slight downward correction from its 24-hour high of $28,729.84.\n\nEthereum – The Surge to August 2022 High\n\nEthereum (ETH) outperformed Bitcoin for a second straight day in terms of percentage points after ETH surged to its highest price since August last year after posting $1,853.89. Similar to Bitcoin, Ethereum’s price dipped to $1,717.77 following the interest rate hikes but made a far better reversal than BTC after a 4% rise ensured ETH traded above the $1,800 mark once again.\n\nAt the time of writing, Ethereum was trading $1,818.04 with a weekly upward movement of 5.73% while holding a market capitalization of $222 billion, and a 24-hour trading volume of $10.8 billion.\n\nBig Eyes Coin – New 250% Bonus Code as the Bull Market Returns\n\nBig Eyes Coin (BIG) is the latest cryptocurrency in the meme coin space with the goal of shifting wealth into the Decentralized Finance (DeFi) ecosystem. Built on the Ethereum blockchain, the ERC-20 meme token is owned by its community and self-propagates using Non-Fungible Tokens (NFTs), which offer its holders access to more content and events.\n\nThe project launched its Initial Coin Offer (ICO) in August last year and has so far raised over $32 million in presale tokens and plans to go live on the market after stage 15 and reaches its $50 million presale target.\n\nAfter a series of successful giveaways, Big Eyes Coin has joined the bull market with the launch of its latest bonus code, BULLRUN250 which offers crypto users a massive 250% bonus for a purchase of BIG tokens or Loot Boxes. For example, if a user enters the BULLRUN250 bonus code when purchasing a Cute Box loot box, the user gets a potential return of $5,000 and $250 in BIG tokens. The 250% bonus code will run for a limited time only as the project nears its live launch.\n\nBig Eyes Coin Loot Boxes offers its community a maximum ROI of 5000% per loot box and features the Saver Tin, Cute Box, Kitty Vault, Super Saiyan Box, and Excali-Paw Master Chest. Each loot box carries a maximum return of $500, $5000, $25,000, $100,000, and $1,000,000 worth of BIG tokens, respectively.\n\nFind out more about Big Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vYml0Y29pbmlzdC5jb20vc2hpYmEtaW51LWtleS10YWtlYXdheXMtc2hpYmFyaXVtLWRvY3Mv0gFCaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9zaGliYS1pbnUta2V5LXRha2Vhd2F5cy1zaGliYXJpdW0tZG9jcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Shiba Inu: These Are The Key Takeaways From Shibarium Docs - Bitcoinist",
        "content": "The documentation for Shibarium, the layer-2 technology of Shiba Inu, was published by the developers two days ago, revealing more details about how it works. Among other things, the documents describe how the Shibarium Proof-of-Stake and the Ethereum Shibarium Bridge relate to each other.\n\nWhile Shibarium’s Proof of Stake (PoS) chain uses side chains to process transactions, the bridge enables a bidirectional transaction environment between Shibarium and Ethereum. Moreover, the documents reveal that the PoS algorithm requires users to stake their BONE tokens.\n\nWhy yes, you are correct. ✅$BONE 🍖 is the gas for #SHIBARIUM. 😉 pic.twitter.com/r0UuVyoITq — Shib Dream * Shiba Inu News * Shib Army Social 💎 (@theshibdream) March 26, 2023\n\nFurther, the platform’s blockchain technology allows users to create programmable tokens and smart contracts that are used in a variety of applications such as initial coin offerings (ICOs) of fungible tokens and non-fungible tokens (NFTs). Transaction fees are expected to be less than $0.01.\n\nSHIB Influencer Lucie pointed out other key takeaways from the documentation in several tweets. One important cornerstone is the Shibarium Staking Manager.\n\nAs Lucie writes, proof-of-security consensus is ensured by having Shibarium perform all proof-of-concept and deployment verification operations on the Ethereum smart contract, leaving the computationally intensive tasks to layer-2.\n\nStakeholders can take on the role of validator, delegate, or observer to report fraud. This is where the Stake Manager comes in, which is the primary contract for validation-related activities such as managing stakes, distributing rewards and verifying signatures.\n\n“Only one role, either validator or delegator, can be assigned to a single Ethereum address as a design choice. Using NFT ID as the source of ownership ensures that changes in ownership and signer will not impact the system,” Lucie further explained.\n\nAn important insight from the documentation also relates to the burn mechanism. When users make a transaction, a fee is incurred that is divided into two parts: the base fee (70%) and the priority fee (30%). The latter is paid to the validator, while the base fee is burned.\n\n“Once a certain amount of BONE ($25,000) is accumulated in the burn contract, users can start the burn process from Shibarium. Once this process starts, accumulated BONE are sent to Ethereum’s L1, where an automated swap for SHIB takes place, and this amount gets burned calling its contract function,” Lucie further elaborates.\n\nThe All-In One Shiba Inu Wallet For Shibarium\n\nUnification, the developer of Shibarium, has also announced an all-in-one wallet for the layer-2 technology and Shiba Inu. The wallet will enable two-way asset transfers between the first and second layer, staking/delegating, and will include a Shibaswap integration.\n\nThe project has also already been highlighted in Shibarium documentation and further publicized by Ringoshi Toitsu, a pseudonymous Unification Validator operator.\n\n#Unification has built a revolutionary new 'Shibarium POS Chain' exclusively for $SHIB, as described in #Shibarium documentation. This game-changing innovation offers a seamless wallet app, two-way asset transfers between L1 & L2, staking/delegating, & #Shibaswap integration. pic.twitter.com/yUhdHgucJW — Ringoshi Tōitsu (@RingoshiToitsu) March 26, 2023\n\nAt press time, Shiba Inu was trading at $0.00001051, continuing its downtrend that persists since the beginning of February 2023.\n\nFeatured image from Analytics Insight, chart from TradingView.com"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2V0aGVyZXVtLWNvLWZvdW5kZXItZmlyc3QtdHJhbnNhY3Rpb24tcG9seWdvbi16a2V2bS1iZXRhLWxpdmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin initiates first transaction as Polygon zkEVM Mainnet Beta goes live - Cryptopolitan",
        "content": "Polygon, a leading Ethereum scaling platform, announced the public launch of its zero-knowledge Ethereum Virtual Machine (zkEVM) beta Monday. This release is anticipated to be one of the most sought-after blockchain trends in 2023 and reflects Polygon’s commitment to open-source values by making all aspects of zkEVM code available to developers for study and collaboration. As part of its launch celebration, Vitalik Buterin, Ethereum’s co-founder, was granted the honor of initiating the first transaction on zkEVM, live-streamed at ETHGlobal at 4:30 p.m. Central European Time (10:30 a.m. ET).\n\n.@VitalikButerin did the symbolic first ever transaction on @0xPolygon #zkEVM and it has a message on it\n\n\n\n\"Millions of constraints for man, unconstrained scalability for mankind\"\n\n\n\nGoose bumps!! https://t.co/HLNiVyRLie pic.twitter.com/Ue0C1CuDTd — Sandeep Nailwal | sandeep. polygon 💜 (@sandeepnailwal) March 27, 2023\n\nVitalik Buterin recently demonstrated the success of his zkEVM transaction, sending 0.005 ETH to a random address with a cheeky message referencing Neil Armstrong’s famous first words upon walking on the moon: “A few million constraints for man, unconstrained scalability for mankind.” This sparked an industry-wide race to create and launch zkEVMs, with Polygon ultimately asserting their victory by publicly announcing that over 50 companies had agreed to build on the Polygon zkEVM technology. However, Buterin himself warned in a blog post back in August that different versions of zkEVMs come with various trade-offs, such as speed versus the degree of compatibility with the Ethereum Virtual Machine. “In general, it’s healthy for the space that all of these types are being explored,” he wrote.\n\nPolygon’s zkEVM is now available to users, but co-founder Sandeep Nailwal has stressed that caution should still be exercised as the technology is in its early days. To ensure user safety, Polygon has reiterated its commitment to exploring zero-knowledge technology for its main chain, the Polygon POS chain. Nailwal believes that this technology is the future of Ethereum and expects to see most large web3 applications built on zero-knowledge-proven layer 2 chains within the next 18 to 24 months."
    }
]