[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy80LXJlYXNvbnMtZXRoZXJldW0tcHJpY2UtY2FudC1icmVhay0xLTk3MNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "4 reasons why the Ether price can't break $1,970 - Cointelegraph",
        "content": "Ether’s price faced resistance after hitting the $1,970 level on July 3. A number of factors capped the rally, including higher odds of more interest rate hikes in the coming months and a tighter regulatory cryptocurrency environment.\n\nMacro headwinds from the Fed\n\nBesides the external factors, the Ethereum network has faced withdrawals from its smart contract applications, which also put the June rally in check.\n\nInvestors now question whether tailwinds from requests for a spot Bitcoin (BTC) exchange-traded fund have faded, opening room for an Ether (ETH) correction down to the $1,700 level last seen on June 16.\n\nThe recent macroeconomic events may provide some hints, including the fact that the gross domestic product grew in the United States by an annualized 2% rate in the first quarter, Germany’s Consumer Price Index increased 6.8% in June versus the previous year, and China’s Caixin Global purchasing managers’ index reported activity expansion.\n\nThus, strong economic indicators have heightened investors’ expectations of further tightening measures from the U.S. Federal Reserve.\n\nFed Chair Jerome Powell’s suggestion of two more interest rate hikes in 2023, coupled with the increasing cost of capital and higher returns on fixed-income investments, have diminished interest in cryptocurrencies.\n\nOn the regulatory front, the most pressing news and events included:\n\nJune 28: European Union lawmakers moved ahead with the controversial Data Act, imposing requirements for smart contracts, including kill switches, that allow them to be safely terminated and rules for providing shareable data.\n\nEuropean Union lawmakers moved ahead with the controversial Data Act, imposing requirements for smart contracts, including kill switches, that allow them to be safely terminated and rules for providing shareable data. July 4: Binance Australia had its corporate offices searched by local authorities, part of an ongoing probe of its derivatives business, whose license was shut down in April 2023.\n\nTVL nears three-year lows as network demand falls\n\nThe Ethereum network is likely facing its own challenges, particularly after co-founder Vitalik Buterin stated on June 29 that he does not stake all of his Ether due to the complexities associated with multisignature wallets.\n\nEthereum network total smart contract deposits in ETH terms. Source: DefiLlama\n\nThe total value locked (TVL), which measures the deposits locked in Ethereum’s smart contracts, reached its lowest level since August 2020. The indicator declined by 3.1% to 13.7 million Ether in the 30 days leading up to July 4, according to DefiLlama.\n\nA lower TVL means either investors are losing interest in the network’s smart contract use or have moved to layer-2 alternatives in search of lower transaction fees. Either way, the potential demand for the Ethereum network is negatively impacted, which is being interpreted as bearish.\n\nETH price gains fueled by leveraged longs\n\nAnalyzing the positions of professional traders in ETH derivatives is crucial to determining the likelihood of Ether’s price surpassing the $1,970 resistance level.\n\nThere are occasional methodological discrepancies between different exchanges, so readers should monitor changes instead of absolute figures.\n\nETH top traders' futures long-to-short ratio. Source: CoinGlass\n\nDespite Ether trading within a narrow range of $1,815 to $1,975 since June 22, professional traders have increased their leveraged long positions in futures, as indicated by the long-to-short ratio.\n\nAt crypto exchange Binance, the long-to-short ratio sharply increased, from 1.14 on June 20 to 1.30 on July 4. Similarly, at OKX, the long-to-short ratio increased from 0.76 on June 20 to a 2.25 peak on July 4, favoring leveraged longs.\n\nTo exclude externalities that might have solely impacted Ether futures, one should analyze the ETH options markets. The 25% delta skew indicator compares similar call (buy) and put (sell) options and will turn positive when fear is prevalent because the protective put option premium is higher than the call options.\n\nEther 30-day 25% delta skew. Source: Laevitas\n\nThe skew indicator will move above 8% if traders fear an Ether price crash. On the other hand, generalized excitement reflects a negative 8% skew.\n\nAs displayed above, the delta skew flirted with moderate optimism between July 3 and July 4 but was unable to sustain such a level. Presently, the negative 2% metric displays a balanced demand for call and put options.\n\nRelated: The Supreme Court could stop the SEC’s war on crypto\n\nETH at $1,700 might be distant, but so is $2,000\n\nConsidering these four reasons — namely, increased leverage long-to-short ratio, declining TVL, potential interest rate increases and tighter cryptocurrency regulation — ETH bears are in a better position to hold back the positive price impact coming from the Bitcoin ETF saga.\n\nAlthough these factors may not be sufficient to drive ETH’s price down to $1,700, they present significant obstacles for ETH bulls. Notably, the previous attempt to break $2,000 on April 13 lasted less than a week. Therefore, in the short term, bears have better odds of successfully defending the $1,970 resistance.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMDcvYXZhaWwtbGF1bmNoZXMtZGF0YS1hdHRlc3RhdGlvbi1icmlkZ2UtdG8tZXRoZXJldW0v0gFgaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNy8wNy9hdmFpbC1sYXVuY2hlcy1kYXRhLWF0dGVzdGF0aW9uLWJyaWRnZS10by1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Avail, Spun Out of Polygon, Launches Data Attestation Bridge to Ethereum - CoinDesk",
        "content": "Avail, Spun Out of Polygon, Launches Data Attestation Bridge to Ethereum\n\nThe new tech, on testnet, represents a step forward in Avail's plan to help secondary networks in the Ethereum ecosystem to speed up their processing – by giving them an alternate way to store the data, and verify its existence and availability, besides storing it on the main blockchain.\n\nBy Margaux Nijkerk Jul 7, 2023 at 12:00 p.m. UTC"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ldGhlcmV1bS1iaXRjb2luLWNob29zZS1kaWZmZXJlbnQtdHJhZGUtb2Zmcy1idXQtYm90aC1hcmUtdmFsdWJlLXZpdGFsaWstYnV0ZXJpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Ethereum, Bitcoin Choose Different Tradeoffs But Both Are Valuable -- Vitalik Buterin - CCN.com",
        "content": "Key Takeaways\n\nVitalik Buterin highlights the pros and cons between Bitcoin and Ethereum.\n\nEthereum co-founder highlights both BTC and ETH’s “core commitments to values” during Twitter Space.\n\nButerin also notes that Bitcoin and Ethereum don’t execute privacy very well.\n\nVitalik Buterin highlighted fundamental differences between the core design of Bitcoin and its smart contract pioneering predecessor Ethereum having trade-offs during a widely-tuned-into Twitter Space on July 6 .\n\nButerin, who co-founded Ethereum alongside eight other influential cryptocurrency developers, spoke at length with Bitcoin advocates Eric Wall and Udi Wertheimer about the technical and cultural nuances of either protocol.\n\n“I think they’re definitely different experiments in terms of the culture and unavoidable trade offs that they’re making and that’s something that I’ve only really come to realize over time.”\n\nButerin believes there is great value in Bitcoin and Ethereum continuing to co-exist, while admitting he had separated the technical and cultural aspects as best he could\n\n“When I was starting with Ethereum I was looking at them as a kind of technical\n\nsystems and cultural systems somewhat separately. I had my beliefs on culture, that maximalism is crazy.”\n\nButerin said he had focused on taking a system from Bitcoin, which was fairly basic, and creating a more programmable system that mirrors “how computers evolved”.\n\nFundamental System Choices\n\nWith technological and cultural aspects intermingled in the development of both Bitcoin and Ethereum, Buterin highlighted the inevitable trade-offs of these systems.\n\n“There are points at which you have to make certain choices. Like if you make a system that supports more functionality, then any kind of functionality that you support ends up having risks, right?\n\nButerin said that extensive functionality requires protocol complexity, but functionality itself can introduce risks to a blockchain system.\n\n“That’s an example of something that we saw during the last few years.”\n\nProof-of-Work vs Proof-of-Stake\n\nEthereum, which originally employed Bitcoin’s proof-of-work consensus algorithm, shifted to proof-of-stake consensus in 2022 during the highly anticipated Merge.\n\nThe change in its core consensus protocol saw stakers introduced as the new ‘miners’ of the network. Staking 32 ETH is required to be a validator, which then receives rewards for processing transactions and maintaining the network.\n\nThe change also caused a split within the Ethereum community as Buterin highlighted, referring to the Ethereum DAO fork of 2016 which caused a fork in the chain, leaving ETH as we know it today and Ethereum Classic (ETC) as two separate chains.\n\n“A lot of the people who were in favor of a more purist approach toward immutability ended up\n\ngoing to Ethereum Classic and people who are much stronger proof of work proponents.”\n\nValuable Experiments\n\nButerin believes that many of the “subtle choices” made by both protocols in terms of functionality end up providing value and continue to co exist.\n\n“There’s just like a lot of these subtle choices that both platforms have made that like really go beyond the question of being general purpose or not trying to be general purpose?”\n\nHighlighting a plethora of differences between Bitcoin and Ethereum which ended up in either protocols “choosing different trade offs” down the line.\n\n“The result of all this is that we have these two different experiments that seem to me to be valuable. I’m happy that they’re both continuing to exist.”\n\nButerin added that both protocols can also be considered “more honorable” than “overinflated” scams that the cryptocurrency space has been littered with over the years.\n\n“I do think that there is a kind of core commitment to values in there that I think is valuable for the space to actually provide something that matters to people.”\n\nAnother central theme emphasized by Buterin was the need for blockchain to move beyond its current limitations by prioritizing scalability:\n\n“We need to find ways to scale up blockchain systems to handle a larger number of transactions without sacrificing security or decentralization.”\n\nThis sentiment echoes the growing consensus within the industry, as developers and innovators strive to enhance the capabilities of blockchain networks."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2Jhcm5icmlkZ2Utc2VjLWRhb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "'SEC investigation' leads Ethereum DeFi protocol BarnBridge to order halt - Blockworks",
        "content": "DeFi protocol BarnBridge says it has drawn attention of the US Securities and Exchange Commission (SEC), although has stopped short of explaining exactly what for.\n\nIn a Discord screenshot, later tweeted by BarnBridge’s official handle, elected legal counsel Douglas Park said the DAO and associated individuals were under SEC investigation.\n\n“Because the SEC’s investigation is ongoing and non-public, I am limited in the information that I will share publicly,” Park said. The update was later confirmed by BarnBridge CEO Tyler Ward.\n\nBarnBridge products, powered by Ethereum, focus on tokenizing risk exposure. They aim to provide crypto users new ways to hedge their positions. Blockworks has reached out to BarnBridge for comment.\n\nIn a bid to reduce further legal liability, BarnBridge is shutting all existing liquidity pools (deployed to Ethereum, Arbitrum and Optimism) while restricting the creation of new ones, per the statement. About $1.2 million is currently in those pools.\n\nAll work on BarnBridge products should also cease, Park warned, adding that individuals would no longer be compensated for any work related to the project “until further notice.”\n\nLoading Tweet..\n\nBarnBridge DAO, which is governed by BOND token holders, recently elected to retain Park as legal counsel in a Snapshot vote on Monday. BOND is down almost 10% following the investigation disclosure.\n\nBarnBridge co-founder Tyler Ward tweeted Friday that he is leaving crypto.\n\nLoading Tweet..\n\nThe development is the latest in a string of actions taken against crypto firms, including within the DeFi sector.\n\nThe Commodities Futures Trading Commission last year targeted margin-focused DeFi platform Ooki DAO, a case which it won by default judgment in June. Experts say that outcome only has limited power to set precedent.\n\nLast month, the SEC labeled a number of cryptocurrencies securities including algorand (ALGO), decentraland (MANA), polygon (MATIC) and dash (DASH) as part of cases filed against crypto exchanges Coinbase and Binance.\n\nIntercontinental Exchange-owned Bakkt delisted solana (SOL), MATIC and cardano (ADA) shortly after. Crypto-friendly neobank Revolut followed suit for US users.\n\nUpdate, July 7, 2023 at 1:05 pm ET: Added tweet from BarnBridge co-founder.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL25ldy1lcmMtMjAtdG9rZW4tdm1weC10cmlnZ2Vycy1ldGhlcmV1bS1idXJuLXNwaWtlLWNvbnN1bWVzLTNtLWluLWdhcy1mZWVzLWluLTI0LWhvdXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "New ERC-20 token VMPX triggers Ethereum burn spike, consumes $3M in gas fees in 24 hours - CryptoSlate",
        "content": "VMPX, a newly launched ERC-20 token, is responsible for over 30% of all Ethereum (ETH) burns in the last 24 hours, according to data from Ultrasound.money.\n\nSoftware engineer 0xCygaar first called attention to the project, claiming its minting contract had no purpose except to increase the network’s overall gas usage.\n\n“The top ETH gas guzzler is this contract where users make validators run useless/unnecessary code just to increase overall gas usage. People are literally burning their money to increase gas fees for everyone else.”\n\nQedk, a smart contract engineer at Polygon (MATIC), confirmed this, adding that the ERC-20 token would make users spend more gas if they want to mint more tokens.\n\nAccording to tweets from the project founder, Jack Levin, VMPX is the first ever BRC-20 token linked to Ethereum’s ERC-20 token. The project’s website states that its supply is 108.62 million but fails to provide additional information about its utility.\n\nVMPX consumed nearly $3M in gas fees\n\nMeanwhile, Etherscan data shows that the VMPX mint contract consumed over 1,500 ETH, around $3 million, in gas fees during the last 24 hours. This represents around 30% of all the gas fees spent during the period, above those generated by the Uniswap (UNI) decentralized exchange.\n\nHarrison, the co-founder of PopPunk, pointed out that those who minted the token paid gas fees as high as 1.36ETH.\n\nEigenPhi, a DeFi data platform, corroborated Harrison’s statement, adding that an average mint transaction of VMPX was 0.167ETH, around $317 per tx.\n\nThis high network activity saw Ethereum network fees jump to as high as 76.3 Gwei during the reporting period, according to Ultrasound.money.\n\nA representative from Push Protocol, the Ethereum messaging service, told CryptoSlate:\n\nGas fees still play a vital role in interacting with Ethereum and is probably one of the reason projects are moving to L2s or prefering off-chain yet verifiable executions.”\n\nMentioned in this article"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8xNDc2NjIvYml0Y29pbi1icmMtMjAtdG9rZW5zLW5vdy1tb3Zpbmctb3Zlci1ldGhlcmV1bdIBTmh0dHBzOi8vZGVjcnlwdC5jby8xNDc2NjIvYml0Y29pbi1icmMtMjAtdG9rZW5zLW5vdy1tb3Zpbmctb3Zlci1ldGhlcmV1bT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin BRC-20 Tokens Are Now Moving Over to Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSix months after launching a protocol that lets people mint NFT-like media assets on the Bitcoin blockchain, the Ordinals space is rapidly evolving. Not only are new products springing up one after another, but the Ordinals-based BRC-20 tokens are now expanding onto none other than Ethereum, the dominant NFT and token ecosystem.\n\nTwo of the largest BRC-20 tokens on the market, ORDI and OXBT, have partnered with Emblem—a tool that lets users store tokens across blockchains without need for a bridge—to release BRC-20 Curated Collections.\n\n“This should be considered a day in which BRC-20s began exploring what their asset class is,” said Jake Gallen, who is in charge of NFT strategy and product at Emblem.\n\nAD\n\nAD\n\n⬛️🟧 $ORDI and $OXBT MEGATHREAD 🟧⬛️ 🚀 VAULTING IS NOW LIVE 🚀 🔸 How to Mint\n\n🔸 Where to Trade\n\n🔸 Vaulting Mechanics\n\n🔸 Details, Info, Integrations, and Partnerships pic.twitter.com/AANoZjTVxs — Emblem Vault (@EmblemVault) July 6, 2023\n\nBRC-20 tokens use the Ordinals protocol to generate what are effectively fungible tokens built on top of the Bitcoin blockchain. Broadly, they’ve been used thus far to create a wide variety of meme tokens, with the total market cap of all BRC-20s briefly nearing $1 billion in May before falling sharply since.\n\nGallen told Decrypt that the BRC-20 Curated Collections are important “because we can now test what type of asset BRC-20s are most closely related to.” He’s looking forward to “how the community views them,” and whether they want to trade them like fungible tokens “or want some variety.”\n\nHe teamed with Adam McBride, colleague and self-proclaimed NFT archaeologist, to share a video deep dive earlier this week about the collection launch. An official launch was pegged for next week, but the functionality is already live and the resulting NFTs are being traded on the OpenSea and Blur marketplaces.\n\nAccording to McBride, the innovation at play with the new partnership is to sidestep traditional cross-chain bridges. He explained that “before, users would send their BRC-20s to a Bitcoin wallet, which then would mint new ERC-20s on Ethereum.”\n\nAD\n\nAD\n\nEmblem’s solution, created in-house, is to create specialized vaults. Before Ordinals, Emblem vaults were used to transfer digital artwork minted on other Bitcoin-related protocols (like Counterparty) over to Ethereum, where they were newly minted as ERC-721 NFTs. The Rare Pepe collection is a prominent example.\n\nIn this case, with Ordinals-based BRC-20 tokens, users send their ORDI or OXBT to a vault which stores the private keys and holds the tokens. Then, using a single ERC-721 token, users will mint their Bitcoin-based NFT on Ethereum.\n\nIn essence, “the BRC-20 sits inside a Taproot wallet, which sits inside an NFT,” said Gallen, explaining that “the NFT (which is an ERC-721 token) is the one doing all the traveling.”\n\n“I’m super excited to see how the Ethereum marketplace will react to this,” said McBride. “This will bring a level of ownership which is far more superior than what already exists, unlocking a bunch of use cases like farming, lending, and other stuff that is built out on Ethereum smart contracts.”\n\nThe creator of BRC-20s and ORDI in particular, pseudonymous on-chain data enthusiast Domo, did not reply to a request for comment. According to Gallen, however, Domo “is really excited to get to show his creation to Ethereum,” adding that “getting those tokens to OpenSea and Blur is huge.”\n\nGallen told Decrypt that the Emblem team has interacted more with ORDI builders than holders, whereas they are in direct contact with the OXBT community—led by the pseudonymous BitGod—since it is more ETH-native, \"so the interest in ETH-denominated trading is much higher.\"\n\nNonetheless, Gallen said that Emblem’s team “believes Bitcoin can equal or overtake Ethereum in NFT trading volume, but with its own culture and style.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS11c2Vycy1idXJuaW5nLWV0aC1taW50LTAzNTc1NzI2NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Users Have Been Burning ETH To Mint VMPX Tokens - Yahoo Finance",
        "content": "The smart contracts that account for the highest transaction fees on Ethereum are generally household names, so an unknown project topping the charts is an unusual event.\n\nThat’s what happened this week when users racing to use a smart contract to mint a token called VMPX pushed gas prices on Ethereum to their highest levels since May.\n\nEthereum Users Have Been Burning ETH To Mint VMPX Tokens\n\nVMPX is an asset designed to connect the Bitcoin and Ethereum blockchains, according to Jack Levin, the founder of the XEN ecosystem, a token with ties to VMPX.\n\n“We’re developing one of the first bridges between the world's largest crypto ecosystems, Bitcoin and Ethereum,” he told The Defiant, adding that holders will be able to stake VMPX in order to earn fees when people transfer assets between the two blockchains.\n\nVMPX led all contracts in terms of burned ETH as of July 6, putting it ahead of typical gas guzzlers like Uniswap and the USDT stablecoin.\n\nEthereum Users Have Been Burning ETH To Mint VMPX Tokens\n\n$90M Burned\n\nProjects in the XEN ecosystem have spiked gas before.\n\nXENTorrent, another project in the ecosystem, accounted for 11% of gas usage in April. XEN also pushed ETH to become a deflationary asset in October 2022.\n\n“I think in total, we burned about $90 million dollars worth of ETH so far,” Levin said.\n\nXEN is an outlier as a project — while most crypto ventures tend to at least have some affiliation with a specific blockchain to begin with, XEN has been multichain from the start.\n\nIn fact, across major blockchains like Avalanche, Polygon, BNB Chain, and Fantom, XEN is either the number one or number two token in terms of how many addresses have sent or received it.\n\nThis week’s mint was for a version of VMPX on Ethereum. A version of VMPX using the emerging Bitcoin standard called BRC-20 already exists and has a $7.8M market capitalization, according to BitX, an exchange and data provider.\n\nLevin said that he wanted to expand XEN to Bitcoin, but it wasn’t feasible due to the blockchain’s design. “We thought okay, we need to launch a XEN-like product, but it cannot be called XEN because it will not have the same economics,” he said.\n\nStory continues\n\nSimulated PoW\n\nLevin said that they wrote the code for VMPX’s launch on Ethereum, to mimic how Bitcoin’s Proof-of-Work system works.\n\nLike many projects in crypto, XEN and VMPX, are experimental, with utility that isn’t entirely clear. Levin likened XEN to a currency in a game like Monopoly board game.\n\n“It’s like a marketing token that gets you crypto without you needing to buy it from anyone,” he said. “You come to the smart contract and mint it yourself.”\n\nNotably, XEN doesn’t have a “premine,” a preset amount of tokens allocated to investors and early contributors. “We wanted to go back to the roots of Bitcoin creation, which never had to raise any money,” Levin said."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8wNi9hbmFseXN0LXVwZGF0ZXMtYml0Y29pbi1hbmQtZXRoZXJldW0tcHJpY2UtdGFyZ2V0cy1wcmVkaWN0cy1jb21pbmctMTgtbW9udGhzLXdpbGwtYmUtYW4tYWJzb2x1dGUtcGxlYXN1cmUv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzA2L2FuYWx5c3QtdXBkYXRlcy1iaXRjb2luLWFuZC1ldGhlcmV1bS1wcmljZS10YXJnZXRzLXByZWRpY3RzLWNvbWluZy0xOC1tb250aHMtd2lsbC1iZS1hbi1hYnNvbHV0ZS1wbGVhc3VyZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Analyst Updates Bitcoin and Ethereum Price Targets, Predicts Coming 18 Months Will Be an ‘Absolute Pleasure’ - The Daily Hodl",
        "content": "The anonymous host of InvestAnswers is laying out bullish price targets for Bitcoin (BTC) and Ethereum (ETH).\n\nIn a new video, the host tells his 445,000 YouTube subscribers that he wouldn’t be “surprised” if Bitcoin reaches $42,000 by April 2024.\n\nHis prediction is based on the behavior of the options market. According to InvestAnswers, the demand for Bitcoin’s call options is higher than that of put options and this is “very bullish.”\n\nCall options are contracts that give the holder the right to buy an underlying asset at a specific price on or before a specific date while put options give the holder the right to sell an underlying asset at a specific price on or before a specific date.\n\n“December 29, 2023 – and you can see here a huge amount of action at the $45,000 level…\n\nOne thing I do want to cast your eye on is to put-call ratio – 0.39. So a lot more calls are being bought than puts, which is very bullish.\n\nBut look at the amount of price action even there at $45,000, $44,000, $43,000, etc.\n\nI said many times before I would not be surprised if we saw $42,000 by April 2024 at the time of the halving. According to the [chart below], we could be there by Christmas – $45,000+. Again if these options actions’ players are correct…”\n\nBitcoin is trading at $30,560 at time of writing.\n\nTurning to Ethereum, the pseudonymous analyst says that the put-call ratio of the second-largest crypto asset by market is sending an “extremely bullish” signal.\n\n“You can see a lot of call demand again at $2,500 for ETH, same date December 29, 2023.\n\nBut cast your eyes on the put-call ratio – 0.21. That is extremely bullish. Nobody, pretty much nobody, is buying puts on Ethereum. Everybody expects it to go north at $2,000, up to $2,500 on average by Christmas. Some people have bets up there around $6,500 too.\n\nSo either way things happen fast, we don’t know when. But the next five months will be fun guaranteed. And the next year after that. So we’re going to have a year and a half of absolute pleasure here.”\n\nEthereum is trading at $1,913 at time of writing.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DreamStudio"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vYWZ0ZXItYml0Y29pbnMtaGFyZC1mb3Jrcy1ldGhlcmV1bS1jbGFzc2ljLWV0Yy1lbmpveXMtYW4tdXB0cmVuZC1hbWlkc3QtcmlzaW5nLW1vbWVudHVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "After Bitcoin's Hard Forks, Ethereum Classic (ETC) Enjoys an Uptrend Amidst Rising Momentum - Securities.io",
        "content": "The cryptocurrency market traded lower on Wednesday, with Bitcoin going as low as $30,235 and Ether under $1,900. However, Thursday started on a bullish note, with Bitcoin surging to $31,480 and Ether jumping to almost $1,960 before retracing a bit.\n\nAs of writing, BTC is trading at $31,220, and Ether is at $1,940, according to CoinGecko.\n\nThe volatility started the day prior after the release of the minutes from June’s Federal Open Market Committee (FOMC) meeting that showed that almost all Fed officials “judged that additional increases in the target federal funds rate during 2023 would be appropriate.”\n\nWith some Fed officially even favoring a rate hike in June, this hawkish tone put pressure on not just crypto but also stocks ahead of the June jobs report scheduled for release on Friday.\n\nRecent stress tests on banks showing that they are well-positioned to weather a severe recession and continue lending to qualified households may also propel FOMC to aggressively raise rates to bring down inflation without casting the US economy into recession.\n\nThe decline in Bitcoin price started during the July 4 holiday in the US, which resulted in July Bitcoin futures prices trading weaker in early trading on Wednesday, according to Kitco senior technical analyst Jim Wyckoff.\n\n“The current pause and choppy trading at higher price levels is not bearish and suggests the bulls are storing up energy for another push higher in the near term,” he said. “The bulls have the firm overall near-term technical advantage.”\n\nOn the upside, Bitcoin has resistance around $34.4k, so if BTC does continue upwards, we can at least see it test $35k in the near future. Going higher would see a strong resistance zone around $37k, breaking which can see the price seek liquidity around $48k. But such spikes in price also increase the likelihood of a correction. This means testing the support levels below $30k.\n\nBullishness in the Market\n\nWhile the crypto sector started the day in the mix, derivatives markets have been signaling bullishness. Futures open interest (OI) for Bitcoin is now north of $12 billion, up from $10.4 billion at the beginning of June, albeit a bit lower than $13.4 billion on June 29, according to on-chain analytics firm Glassnode.\n\nCrypto data provider CCData also revealed that institutional investors have been busy trading crypto futures, so much so that the Chicago Mercantile Exchange (CME) saw its best June for Bitcoin futures volumes, rising an astounding 28.6% to $37.9 billion. Eth-based instruments also saw a 10.8% increase, with over 97,000 ETH Futures contracts traded in June.\n\nThe USD value of the volume traded also jumped substantially, with BTC- and ETH-backed products collectively recording a 24.6% pump, with $46.8 billion changing hands — the highest number since May 2022.\n\nBitcoin has been enjoying gains since last month, when it first surged above $31k in mid-June following multiple spot Bitcoin ETF filings, and has remained mostly stable despite the positive investor sentiment. The unveiling of a quantitative easing program in China is another positive, while the crypto market sees increased regulatory clarity in Singapore, Korea, and Thailand.\n\nInterestingly, Prime Minister contender Pita Limjaroenrat, the leader of Thailand’s Move Forward Party, has been found to hold crypto, according to disclosures filed. His thousands of dollars worth of crypto is split between BTC, ETH, BNB, and ADA.\n\nAmidst this, late on Wednesday, Larry Fink, the CEO of the $8.5 trillion asset manager BlackRock, gave the catalyst for the latest price action when he said in an interview that crypto “could revolutionize finance.”\n\n“We believe that if we can create more tokenization of assets and securities – that’s what bitcoin is — it could revolutionize finance,” said Fink, adding: “Instead of investing in gold as a hedge against inflation, a hedge against the onerous problems of any one country, or the devaluation of your currency whatever country you’re in, let’s be clear, bitcoin is an international asset, it’s not based on any one currency and so it can represent an asset that people can play as an alternative.”\n\nAs Bitcoin made attempts at recovery, altcoins experienced a sell-off, with Kaspa down the most among the top 100 cryptocurrencies by 8.3% in the past 24 hours. Radix, Fantom, Stellar, Gate, Woo Network, and Mina also recorded losses.\n\nMajor Forks Enjoying an Uptrend\n\nWhen it comes to the 24-hour gainers, the likes of FSX (8.6%), SOL (7.6%), CMOP (5.3%), PEPE (5.1%), Neo (4.2%), Monero (3.7%), and Maker (3%) are enjoying the greens. This has the total crypto market cap up by 2% to $1.256 trillion. However, it is the popular forks of the majors, Bitcoin and Ethereum, that are leading these performers.\n\nBitcoin fork Bitcoin Cash (BCH) has been enjoying an uptrend for the past 15 days. During this period, the digital asset has rallied 180%. BCH is also up 11.5% against USD on Thursday to now trade at $295.60. BCH is also up 8.8% against BTC, and its trading volume soaring by 143.9% to $1.18 bln from a day ago.\n\nThese gains came as Bitcoin became the center of institutional attention as well as increasing BCH trading volumes on South Korean exchanges. Additionally, the launch of Citadel Securities, Fidelity Digital Assets, and Charles Schwab-backed EDX Markets, which supports BCH along with BTC, ETH, and LTC, contributed to the uptrend.\n\nThe price action led traders betting against Bitcoin cash to lose the highest amount in over two years as BCH surged to the $320 level last week. According to Coinalyze data, shorts and longs cumulatively lost over $25 million on BCH-tracked futures, which may also have contributed to the sudden spike.\n\nThis week, funding rates have fallen negative across all exchanges that list BCH futures, indicating that short traders are willing to pay long traders to remain in their positions.\n\nBCH wasn’t alone, though. Another Bitcoin fork, Bitcoin SV’s (BSV) price, also jumped by 125% between June 20 and July 1. BSV is up 9.5% against USD and is currently trading at just above $46, while its trading volume increased by 12.30% to $40.6 mln. BSV is also in the green by 6.9% against BTC.\n\nJust like Bitcoin forks are enjoying an uptrend, Ethereum’s fork Ethereum Classic (ETC) has also started rising in value.\n\nEthereum Classic (ETC) Joins In\n\nETC is the 26th largest cryptocurrency, with a market cap of $2.8 billion. And at the time of writing, ETC has been trading at $19.81, up 4.1% against USD, 1.6% against BTC, and 2.38% against ETH. During this period, the trading volume for the altcoin only increased by 0.3% to $140 million.\n\nIn the past week, the price of ETC has recorded 9% gains and 15.5% in the last two weeks. However, 2023 wasn’t really a good year for this altcoin as ETC only registered gains of 25.73% so far this year. While the price did rise, the price has been stuck in the $15 to $24 range during this time.\n\nOver this past year, ETC jumped 31.2% while losing 88.14% of its value since hitting its all-time high (ATH) at $167 in May 2021.\n\nBesides the general positive momentum in the broad crypto market, ETC price may be rising in line with ETH, which is up 62% year-to-date (YTD), much like how BCH and BSV jumped alongside BTC. However, compared to Bitcoin’s 86.42% upside in 2023, BCH has rallied 205.7% and BSV 10.23%.\n\nETC is the native cryptocurrency of Ethereum Classic, a blockchain project that was created when the second-largest crypto, Ethereum’s blockchain, split into two separate chains in 2016. The split was due to a disagreement among members of its community regarding how to handle the massive hack on a decentralized Ethereum-based platform called “The DAO.”\n\nA year after Ethereum was launched, the network saw one of its most successful ICOs, The DAO, which accumulated 11 million ETH from over 18,000 investors, and even got hacked. Many community members proposed rolling back the Ethereum blockchain to rescue the affected investors, while others argued that doing so would set the wrong precedent for future bailouts. The majority of the community voted to restore the lost funds through a hard fork, which split the chain into two separate networks.\n\nAfter the fork, the old chain became known as Ethereum Classic, which has a relatively small community and believes in the principle that “Code is Law.” When the split happened, those who held ETH received the exact same amount of ETC in their wallets for free. During the bull run of 2017, ETC’s price went to hit its then peak of $42, only to crash as low as $3 during the following crypto-wide bear market.\n\nUnlike Ethereum, which doesn’t have a hard cap on how many native tokens will be created, Ethereum Classic made changes to its monetary policy to be deflationary, meaning the number of tokens created decreases over time to make it a better store of value. ETC’s supply is capped at 210.7 million, and its block reward declines by 20% every 5 million blocks.\n\nHowever, Ethereum Classic remains a security concern. In August 2020, the blockchain suffered three 51% attacks in August 2020 with Terry Culver, CEO of ETC Labs, said at the time that the threat of 51% attacks on Proof of Work blockchains is a “universal problem” and introduced a series of “defensive mining measures.”\n\nWhile ETC’s price continues to see bursts of momentum whenever bullish sentiments return to the crypto market, Ethereum Classic continues to struggle with adoption. Much like how Bitcoin hard forks’ activity and usage level is nowhere near the crypto king, ETC doesn’t enjoy a considerable use case or user base either.\n\nThat said, ETC closed off June with a 13% increase in price, and if Ethereum Classic manages to keep up with this momentum, it can surge even more in July. On the other hand, if selling pressure prevails instead, the ETC price could drop to the $18 level.\n\nClick here to learn how to buy Ethereum Classic (ETC) in just four steps."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0td2hhbGUtdHJhbnNmZXJzLXRvLWV4Y2hhbmdlL9IBT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0td2hhbGUtdHJhbnNmZXJzLXRvLWV4Y2hhbmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Whale Transfers Over 25,000 ETH To Exchange: Massive Dip On The Horizon? - NewsBTC",
        "content": "Ethereum’s price seems to have been following Bitcoin’s, but recent large transactions suggest it may soon move independently.\n\nWhale Alert reported a sum of 25,264 ETH, roughly valued at around $48 million, was moved from an unidentified wallet to the leading cryptocurrency exchange, Coinbase.\n\nAnalyzing The Potential Impact\n\nWhile these large transfers can, on occasion, herald an upcoming uptrend, they can also imply a short-term surge in volatility. Particularly, such movements can be used to discern possible price sentiment changes.\n\nIn addition to the 25,264 ETH transferred, another substantial transaction of 30,000 ETH was also noted. This amount was relocated from an anonymous wallet to OKEX, another prominent crypto exchange.\n\nNotably, as with any financial market, the crypto industry is impacted by many factors, with ‘whale’ movements being just one of them. While they can potentially influence price sentiment, other elements, such as broader market trends, global economic indicators, and investor sentiment, should also be considered for a holistic market understanding.\n\nEthereum Latest Price Action\n\nThiese Ethereum transactions come at a time when ETH has been trading between an intra-day high of $1,957.35 and an intra-day low of $1,872.94. At the time of writing, Ethereum has only seen a slight decline of 1.4% in the past day, with a market price of $1,884.\n\nThis modest plunge indicates whales might not have moved or sold just a small amount of the ETH deposited. Notably, a ‘whale’ in cryptocurrency refers to an individual or entity holding a large amount of a cryptocurrency.\n\nThis individual or entity has the potential to influence the market due to the sizeable volume of its holdings. When such transfers occur, they can create waves in the market and often signal potential price shifts.\n\nOver the past week, Ethereum has seen more than a $3 billion surge in its market capitalization. The second largest asset by market cap has surged from the $223 billion seen last Thursday to $226 billion. ETH’s daily trading volume has also surged significantly in the same period.\n\nEthereum’s daily trading volume has soared from $6 billion last week to above $12 billion over the past 24 hours.\n\nFeatured image from Shutterstock, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY3J5cHRvLm5ld3MvcGlrYW1vb24tYS1ibG9ja2NoYWluLWdhbWUtb24tZXRoZXJldW0tcmFpc2VzLTMtNm0tZmluYWwtaWNvLXBoYXNlLWluLXByb2dyZXNzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Pikamoon, a blockchain game on Ethereum, raises $3.6m, final ICO phase in progress - crypto.news",
        "content": "Dubai, United Arab Emirates, July 11, 2023, Chainwire\n\nPikamoon, an Ethereum blockchain game, has raised $3.6 million in its ongoing initial coin offering (ICO) to bring more value to the Ethereum ecosystem and possibly revolutionize the blockchain gaming space.\n\nPikamoon would launch a metaverse game integrating an earning model that allows players to withdraw their in-game rewards directly to their wallet or bank account without needing a third party.\n\nPikamoon focuses on becoming a realistic metaverse game where players can get a 360-degree experience of the growing virtual space through gameplay, visuals, and decentralized finance (DeFi) features. Drawing inspiration from games like Fortnite, Pokemon, and FIFA, the Ethereum game prepares to blend non-fungible tokens (NFTs), video gaming, and metaverse entertainment.\n\nThe Pikamoon game is built on Unity, a game development technology, to create the visuals and architecture needed to give players an immersive experience.\n\nYou might also like: Ethereum sees major developments as analysts show optimism\n\nAdditionally, Pikamoon is built across Ethereum and MultiversX (formerly Elrond) blockchains. While Ethereum provides scalability, MultiversX complements it by providing efficiency and ensuring the game is environmentally friendly by reducing carbon emissions generated by transactions. This dual blockchain feature ensures that the Pikamoon ecosystem can cater to legions of gamers without lag.\n\nGaming enthusiasts and smart investors are convinced Pikamoon is the future of gaming, and this is evident in how fast phase one and phase two of the crowdfund sold out. In the first phase, one PIKA sold for $0.0002, which increased to $0.0004 in the second phase, and now in the third and last phase, one PIKA is selling for $0.0006 and selling out faster.\n\nNotable partners of this Ethereum-based game include future-thinking web3 brands such as Ethereum, Transak, Cryptonews.com, Kevuru Games, and MultiversX. This line-up of industry leaders further reinforces the project’s credibility, reaffirming that the team is committed to building the best gaming projects.\n\nPikamoon allows investors to enter what is strategically seen as a vast metaverse market and gaming on Ethereum. A core feature of the PIKA token is its deflationary nature. Whenever a sell or transfer transaction occurs in the Pikamoon ecosystem, 0.5% of the tokens are burned.\n\nThe ongoing presale employs ethereum (ETH) as its primary currency. Due to this, it is gaining popularity among the Ethereum community. The smooth integration with Ethereum streamlines the investment process for enthusiastic investors and enhances the entire Ethereum ecosystem.\n\nAbout Pikamoon\n\nPikamoon makes metaverse gameplay exciting and rewarding for players of all age groups. The Pikamoon’s metaverse, the Pikaverse, offers players endless opportunities to explore, battle, trade, and earn a living within the game. It operates on Ethereum and MultiversX blockchains, ensuring smooth and glitch-free gameplay for every player. Similarly, Pikamoon’s unique earning model allows players to easily monetize gameplay, solidifying its place as one of the best metaverse games on the market.\n\nFind out more about Pikamoon (PIKA)\n\nWebsite | Where to purchase PIKA | Twitter | Telegram\n\nContact\n\nFounder\n\nNick Evans\n\nPikamoon\n\n[email protected]\n\nRead more: Solana surpasses Ethereum in 24h NFT sales\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9hbmFseXN0LWJlbmphbWluLWNvd2VuLXNoYXJlcy1teXN0ZXJpb3VzLWV0aGVyZXVtLWNoYXJ00gFLaHR0cHM6Ly91LnRvZGF5L2FuYWx5c3QtYmVuamFtaW4tY293ZW4tc2hhcmVzLW15c3RlcmlvdXMtZXRoZXJldW0tY2hhcnQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Analyst Benjamin Cowen Shares Mysterious Ethereum Chart - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nNoted cryptocurrency analyst Benjamin Cowen recently shared a cryptic chart that has sparked debate among his followers. The chart, which appears to be a reverse representation of the Ethereum (ETH) to Bitcoin (BTC) pair, has left followers pondering its significance.\n\nAdvertisement\n\nIn the Twitter post, Cowen, well-known for his incisive crypto analyses, did not explicitly mention the chart's name. However, he posed a simple question to his followers: \"Is this bullish or bearish?\" The enigmatic chart and the question have since provoked considerable speculation within the community.\n\nThe crux of the debate revolves around the interpretation of the ETH/BTC chart. A bullish ETH/BTC chart implies that Ethereum's value is set to appreciate against Bitcoin. In contrast, a bearish chart suggests that Bitcoin will outperform Ethereum. In the broader perspective, a bullish ETH/BTC chart could also be indicative of an impending surge of volatility on the crypto market.\n\nOver the past weeks, the ETH/BTC chart has shown a downward trend, which could indicate that Bitcoin has been outperforming Ethereum in the crypto race. However, this trend seems to be flattening out, which could potentially suggest a changing dynamic between the two leading cryptocurrencies.\n\nWhile the intention behind Cowen's post remains a mystery, it has undeniably succeeded in generating discussion and speculation among crypto enthusiasts. The ETH/BTC pair has long been viewed as an important metric in the crypto space, providing insight into the relative performance of the two largest cryptocurrencies.\n\nIn case of a breakthrough on ETH/BTC, we might see a surge of volatility on the cryptocurrency market, especially in the DeFi and NFT sectors. For now, however, the performance of the crypto market remains suppressed."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL3Jpc2luZy1ldGhlcmV1bS1nYXMtZmVlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "The Unseen Gas Guzzlers: A Deep Dive into Rising Ethereum Gas Fees - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum, the world’s second-largest cryptocurrency by market capitalization, has been experiencing a significant increase in gas fees. The reason behind this surge has been a mystery to many until recently, when a Twitter user named Cygaar [@0xCygaar] shed some light on the issue. Let’s take a look at this Ethereum Gas fee article in more detail.\n\nThe Top ETH Gas Guzzler\n\nhttps://twitter.com/0xCygaar/status/1676699126682075136?s=20\n\nAccording to Cygaar, the primary culprit behind the high gas fees is a specific contract where users are making validators run useless or unnecessary code. This action, in turn, increases the overall gas usage on the Ethereum network. The contract in question has been identified as the top ETH gas guzzler, contributing significantly to the high transaction fees.\n\nAn Introduction to Ethereum Gas Fees\n\nEthereum gas fees are the costs required to perform any operation on the Ethereum network. These operations can range from simple transactions, like sending Ether (ETH) from one address to another, to more complex interactions with smart contracts.\n\nThe concept of gas in Ethereum is similar to the fuel in your car. Just like you need fuel to drive your car a certain distance, you need gas to perform operations on the Ethereum network. The more complex the operation, the more gas it requires.\n\nThe gas fee is determined by two factors: the amount of gas required for the operation (Gas Used) and the price you’re willing to pay per unit of gas (Gas Price).\n\nLet’s consider a simple example to illustrate this:\n\nSuppose you want to send some ETH to a friend. This is a simple operation and let’s say it requires 21,000 units of gas (this is the actual amount of gas required for a standard ETH transfer).\n\nNow, you need to set a gas price, which is the amount of ETH you’re willing to pay for each unit of gas. The gas price is usually set in ‘gwei’, where 1 ETH = 1,000,000,000 gwei. Let’s say you set a gas price of 20 gwei.\n\nThe total gas fee for your transaction would be calculated as follows:\n\nTotal Gas Fee = Gas Used x Gas Price\n\nSo in this case, the total gas fee would be:\n\nTotal Gas Fee = 21,000 (Gas Used) x 20 (Gas Price) = 420,000 gwei or 0.00042 ETH\n\nThis is the amount you would pay to send ETH to your friend. Note that if the Ethereum network is busy, you might need to set a higher gas price to get your transaction processed quickly. Conversely, if the network is not very busy, you might be able to get away with a lower gas price.\n\nUnderstanding Gas Fees Calculation in Ethereum\n\nThe high gas fees have a direct impact on the users of the Ethereum network. People are essentially burning their money to increase gas fees for everyone else. This situation is not only detrimental to individual users but also to the overall health and sustainability of the Ethereum network.\n\nIn Ethereum, the cost of a transaction (the “gas fee”) is determined by two factors: the amount of computational work that needs to be done (the “gas used”) and the price per unit of gas (the “gas price”).\n\nGas Used: Every operation that occurs in the Ethereum network, from simple transfers to complex smart contract interactions, requires a certain amount of computational work. This work is measured in “gas.” For example, a simple ETH transfer requires 21,000 units of gas.\n\nEvery operation that occurs in the Ethereum network, from simple transfers to complex smart contract interactions, requires a certain amount of computational work. This work is measured in “gas.” For example, a simple ETH transfer requires 21,000 units of gas. Gas Price: The gas price is the amount of ETH that the transaction sender is willing to pay for each unit of gas. It’s usually measured in “gwei,” where 1 ETH = 1,000,000,000 (one billion) gwei. The gas price is set by the sender but ultimately determined by supply and demand in the network. If the network is busy, you might need to pay a higher gas price to incentivize miners to include your transaction in the next block.\n\nThe total gas fee is calculated as follows:\n\nTotal Gas Fee = Gas Used x Gas Price\n\nThe Impact of Unnecessary Code Execution\n\nNow, let’s consider a smart contract that includes unnecessary code. For simplicity, let’s say this unnecessary code doubles the computational work required for the contract execution, increasing the gas used from 21,000 to 42,000 units.\n\nIf we assume a gas price of 100 gwei, the gas fee for a normal transaction would be:\n\nNormal Gas Fee = 21,000 (Gas Used) x 100 (Gas Price) = 2,100,000 gwei or 0.0021 ETH\n\nHowever, with the unnecessary code, the gas fee would be:\n\nIncreased Gas Fee = 42,000 (Gas Used) x 100 (Gas Price) = 4,200,000 gwei or 0.0042 ETH\n\nAs you can see, the inclusion of unnecessary code in the contract has effectively doubled the gas fee. This is a simplified example, but it illustrates how inefficient code can lead to higher transaction costs on the Ethereum network. In reality, the impact could be even more significant, especially during periods of high network congestion.\n\nThe execution of unnecessary code by validators not only increases the gas usage but also puts an additional load on the Ethereum network. This unnecessary load leads to congestion, slowing down transaction processing times and causing a spike in gas fees.\n\nThe Economics of Ethereum Gas Fees and the Role of Unnecessary Code\n\nIn the Ethereum network, every operation that takes place, from simple transactions to complex smart contract interactions, requires computational resources. These resources are not unlimited and are provided by nodes or validators in the network. The cost for these resources is paid in “gas,” and the price of gas is determined by supply and demand dynamics. When a specific contract makes validators run useless or unnecessary code, it artificially inflates the demand for computational resources.\n\nThis unnecessary demand puts a strain on the network, causing congestion. As more and more resources are requested, the available supply decreases, leading to an increase in gas prices. This is similar to traffic congestion on a highway; the more cars (or in this case, transactions) there are, the slower the traffic moves, and the longer it takes to reach the destination. In the context of Ethereum, this means that users have to pay higher fees to get their transactions processed faster. Therefore, by making validators execute unnecessary code, users are effectively driving up the demand and, consequently, the price of gas, leading to higher transaction fees for everyone on the network.\n\nThe Call for a Solution\n\nThe revelation by Cygaar has sparked a conversation about the need for a solution to this problem. It’s clear that the Ethereum network needs to find a way to prevent the execution of unnecessary code to maintain its efficiency and keep gas fees at a reasonable level. The community is now looking towards Ethereum’s developers for a solution that can address this issue and ensure the network’s long-term sustainability.\n\nSo, the high gas fees on the Ethereum network are a pressing issue that needs immediate attention. The revelation by Cygaar has shed light on a significant contributing factor, and it’s now up to the Ethereum community to find a solution.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2F2YWlsLWJyaWRnZS1kYXRhLWF2YWlsYWJpbGl0eS1ldGhlcmV1bS1yb2xsdXBz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Avail offers to bridge the data availability gap for Ethereum rollups - Blockworks",
        "content": "Polygon spin-off Avail unveiled its data attestation bridge to Ethereum, Friday, as it seeks to carve out a niche in Ethereum’s rollup-centric scaling roadmap.\n\nLayer-2 rollups currently use Ethereum mainnet for posting their transaction data, which represents the majority of the transaction cost to users. These costs are expected to come down significantly following the next Ethereum upgrade “Dencun” later this year, which will implement EIP-4844.\n\nFurther scaling gains should be found higher up the stack, on layer-3 networks envisioned such as Arbitrum Orbit, or zkSync’s hyperchains. That’s where Avail’s solution will likely come in, Anurag Arjun, Avail’s co-founder, told Blockworks in an interview.\n\n“With computation with something like [zero-knowledge proofs], you are able to compress proofs, you’re able to do recursive proofs and make it small, but with data, you cannot do it,” Arjun said.\n\nRight now, some early attempts make use of what are known as data availability committees (DACs), but in the future Avail or Celestia could provide a better alternative because they use a technique known as data availability sampling (DAS). Ethereum’s own implementation of DAS is still likely years away.\n\n“By enabling rollup constructions to run in validium, optimistic chains, and volition modes, we are not only reducing costs but also paving the way for a more inclusive and efficient layer-2 and layer-3 ecosystem,” Arjun said in a statement.\n\nThere are some trade-offs in terms of security, but for the kinds of use cases that are most likely to require layer-3s, the cost, performance, and privacy concerns will make off-chain data availability options worth it, according to zkSync co-founder Alex Gluchowski.\n\n“It’s very cheap, but you only have a partial inheritance of Ethereum security,” Gluchowski said.\n\nAvail opted to become an independent company outside of the Polygon product suite so that it could service all kinds of rollups, not only those from Polygon.\n\n“We wanted it to be more credibly neutral in that aspect because Avail is a general purpose base layer,” Arjun told Blockworks.\n\nThe transition, completed about three months ago, saw Arjun leave his operational role at Polygon, which will now be one customer of many for the new firm.\n\nPolygon’s PoS chain, which Polygon recently announced would morph into a zkEVM validium, will initially make use of its own validator set to provide data availability, but it could also use Avail in the future, Arjun said.\n\nAvail is built using Polkadot’s Substrate technology due to its use of nominated proof-of-stake (nPOS) and tendency to facilitate wide distribution of stake.\n\nArjun observed from his experience with Tendermint consensus used by the Polygon PoS chain that there is a concentration of stake with a majority controlled by eight to 10 validators.\n\nA new staking token, AVAIL, will facilitate a permissionless validator set of up to 1,000 validators.\n\nOther than that, there is no connection to the Polkadot ecosystem. They may be able to help Polkadot build zk rollups on a Polkadot parachain using Avail, Arjun said, but this idea is very new and will require a lot of further development.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1uZnQtcm95YWx0aWVzLWhpdC10d28teWVhci1sb3ctYXMtYm9yZWQtYXBlLWZsb29yLXByaWNlLWZhbGxzLWJlbG93LTMwLWV0aNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Ethereum NFT royalties hit 2-year low as Bored Ape floor price falls below 30 ETH - Cointelegraph",
        "content": "Royalties earned by nonfungible token (NFT) projects have reached their lowest point in two years, according to a report from blockchain analytics firm Nansen.\n\nData shared with Cointelegraph highlights the low point for NFT royalties before the impact of a recent drop in the floor price of Bored Ape Yacht Club (BAYC) NFTs, as well as the controversy surrounding the launch of the Azuki Elementals collection.\n\nApril 2022 saw the peak of NFT royalties, with creators bagging an estimated $75.7 million in a single week. According to Nansen’s data, BAYC creator Yuga Labs has earned a total of $165.5 million in royalties across its portfolio of NFT collections.\n\nRelated: Planet of the Bored Apes: BAYC’s success morphs into ecosystem\n\nRTFKT has earned a total of $79.9 million in royalties from its collections, which include the likes of CloneX. Azuki has scored $58.2 million from its zuki, Beanz, Elemental Beansa and Elementals collections.\n\nProof, the studio behind Moonbirds, netted $35 million in revenues, while Doodles has made $27.4 million from its Doodles, Space Doodles, Genesis Box and Dooplicato collections. Pudgy Penguins’s revenue amounts to $8.3 million across its Pudgy Penguins, Lil Pudgys and Pudgy Rods drops.\n\nNansen highlights the importance of NFT royalties as an indicator of a studio’s financial foundation for ongoing development, given their role in generating revenue.\n\nNFT marketplace OpenSea was primarily responsible for distributing royalty payments to NFT projects until 2023. The report notes that this trend changed once rival marketplace Blur implemented a policy that required a minimum of 0.5% royalties unless projects opted out or enforced full percentages.\n\nOpenSea gave buyers the choice to pay royalties unless projects had opted out or imposed a specific percentage:\n\n“Currently, OpenSea and Blur are on par with each other when it comes to the royalties paid through their respective marketplaces, with more royalties paid on Blur when the trading volume surges.”\n\nTotal royalties paid to NFT projects. Source: Nansen NFT trends dashboard\n\nNansen’s data also reveals that the top 10 NFT collections have earned over $345 million in royalties. Yuga Labs’ $150 million in royalties accounts for 44% of the top 10. Interestingly, just 20 NFT projects have earned over $10 million in royalties to date.\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzA3L2FuYWx5c3QtcHJlZGljdHMtcmFsbGllcy1mb3ItYml0Y29pbi1jYXNoLWxpdGVjb2luLXBlcGUtYW5kLW9uZS1ldGhlcmV1bS1yaXZhbC_SAXRodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8wNy9hbmFseXN0LXByZWRpY3RzLXJhbGxpZXMtZm9yLWJpdGNvaW4tY2FzaC1saXRlY29pbi1wZXBlLWFuZC1vbmUtZXRoZXJldW0tcml2YWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Analyst Predicts Rallies for Bitcoin Cash, Litecoin, Pepe and One Ethereum Rival - The Daily Hodl",
        "content": "A widely followed crypto analyst is predicting rallies for Bitcoin Cash (BCH), Litecoin (LTC), meme asset Pepe (PEPE) and one Ethereum (ETH) competitor.\n\nPseudonymous crypto trader Kaleo tells his 593,100 Twitter followers that he believes that the Bitcoin (BTC)-hard fork BCH will continue the rally it sparked last month that saw it go around the $106 level to a peak of $321.89 on June 30th, a 202% increase.\n\n“Have a good feeling BCH is far from done.”\n\nBitcoin Cash has since retraced and is trading for $283 at time of writing.\n\nThe strategist then turns his attention toward Litecoin, saying that he’d “punt” the crypto asset once it lands somewhere between the $95 to $105 range, but says the altcoin could rally back up to the $110 area due to hype surrounding its upcoming halving date in August.\n\n“I’m a fan of punting on LTC in the $95-$105 range after the pullback off HTF [high time frame] resistance. With hype around the halving coming up only a month away, I think there’s potential we could see a decent squeeze at a reclaim of $110+ on the HTF bearish trend break.”\n\nFurthermore, Kaleo’s charts indicate that he believes the LTC/BTC pair will skyrocket above $0.0040. At time of writing, it is valued at $0.003432 while Litecoin is trading for $97.30.\n\nMoving on to the popular meme asset PEPE, Kaleo says he’s “seeing some movements on the front lines,” and that he envisions the altcoin going back up to the $0.0000036 range, a price it hasn’t seen since early June.\n\nPEPE is trading for $0.000002 at time of writing.\n\nThe trader concludes his analysis by saying that smart contract platform Solana (SOL) is ready to burst over the $20 price tag.\n\nSOL is trading for $19.75 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1jaGFydHMtcmVmbGVjdC13ZWFrbmVzcy1idXQtaW5mbG93LXRvLWxzZGZpLWNvdWxkLXByZXZlbnQtYW4tZXRoLXNlbGwtb2Zm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Ether price charts reflect weakness, but inflow to LSDFi could prevent an ETH sell-off - Cointelegraph",
        "content": "Ether has been on a downward trend, with the $2,000 level forming a crucial resistance level in recent months.\n\nWhile Bitcoin (BTC) recorded 11.94% gains, moving past $30,000 in June after BlackRock filed an application for an exchange-traded fund with the Securities and Exchange Commission in the United States, the upside in Ether (ETH) stayed around 3.16%.\n\nIn the first week of July, buyers attempted to move the price past crucial resistance at around $1,900. However, a failed breakout exposed the price to further correction.\n\nThe Ethereum network also witnessed a decline in activity, evident in the one-year-low levels in total transaction fees. The price of leading nonfungible token (NFT) collections on Ethereum plummeted, while decentralized finance (DeFi) activity stalled due to low yields.\n\nThe 7-day moving average of total transaction fees paid on Ethereum. Source: Glassnode\n\nHowever, the downside may be limited, as the demand for liquid staking derivatives (LSDs) like Lido’s stETH continues to grow, rising faster than investors are moving to sell.\n\nLSD activity is on the rise\n\nWhile the primary use cases on Ethereum of NFT trading and DeFi activity suffered a downturn in June, the LSD narrative continued to grow.\n\nOn-chain analytics firm Glassnode wrote in its latest report that deposits to the staking contract have “been higher, or equal in scale to exchange inflows since Shanghai went live,” suggesting that more ETH is being moved toward staking than selling on exchanges.\n\nEthereum exchange inflows (pink) versus staking deposits (blue). Source: Glassnode\n\nThe total ETH deposited in staking contracts is 19.7% compared to the centralized exchange balance of around 12.8%. LSD platforms captured most of the inflow, followed by independent validators and staking-as-a-service clients.\n\nEther staking deposits increased significantly after the Shanghai upgrade in April, as confidence increased with active redemptions. Among LSD platforms, Lido led the sector, followed by Rocket Pool and Frax.\n\nThe weekly inflows of ETH staking deposits by category. Source: Dune\n\nGlassnode’s report also suggested that the network has “yet to see an appreciable influx of new holders,” as the number of new addresses holding Lido’s stETH has been “more or less unchanged” year-to-date.\n\nCurrently, 20% of Ether’s total supply is staked with validators compared to over 40% for most other proof-of-stake blockchains like Solana (SOL), Cosmos (ATOM) and Avalanche (AVAX), indicating room for growth.\n\nWith annual DeFi yields hovering around 1-3% for ETH on Aave and Yearn.finance and between 3-5% for stablecoins, LSD derivatives offer a base rate of 4% with an opportunity to earn additional yields by using their liquidity in DeFi applications.\n\nGlassnode’s report said that LSD derivatives “have seen increased activity within different DeFi protocols, with Lido’s stETH being the most significant.”\n\nAdditionally, LSD tokenholders are also exhibiting a shift from providing liquidity on DEXs like Curve and Balancer to chasing higher yields on lending protocols like Compound and Aave. Glassnode’s analysts wrote, “This leveraged staking position is estimated to amplify yield by 3x.”\n\nThe LSD sector appears to be the current hotspot for DeFi players looking to maximize their yield.\n\nRelated: Rapid growth in DeFi-focused Ethereum liquid staking derivatives platforms raises eyebrows\n\nEther price analysis\n\nETH recorded a positive breakout from a bullish ascending channel pattern with a target of $3,000 earlier this week. However, the trend reversed quickly, as Bitcoin dropped to $30,000 after expectations of a rate hike by the U.S. Federal Reserve rose and sellers gained an upper hand.\n\nTechnically, the price can take two paths from here: find support at the base of the ascending triangle around $1,790 before making a break for the $1,900 resistance level again, or a continued drop toward the long-term resistance and support level of $1,700.\n\nA breakdown below $1,700 would give sellers a chance to target the 200-day weekly moving average at around $1,575.\n\nETH/USD daily price chart. Source: TradingView\n\nThe ETH/BTC pair also shows that Ether has room for more downside toward the 200-day moving average at 0.0574 BTC and the long-term resistance and support level at 0.0538 BTC.\n\nETH/BTC weekly price chart. Source: TradingView\n\nEther had a failed positive breakout in early July, exposing the price to further downside to around $1,700. However, a surge in the LSD narrative with higher yields than the DeFi sector is providing a cushion for any future downside, suggesting that the price will likely establish bullish support.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tdWx0aWNoYWluLW1wYy1icmlkZ2Utc2Vlcy1taWxsaW9ucy1pbi1vdXRmbG93cy1leHBsb2l0LWZlYXJlZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Multichain MPC bridge sees $100M+ outflows, sparking fears of exploit - Cointelegraph",
        "content": "Abnormally large outflows from the Multichain MPC bridge platform are sparking fears of a multimillion-dollar exploit.\n\nOn July 6, observers noticed that approximately $102 million worth of crypto had been withdrawn from Multichain’s Fantom bridge on the Ethereum side, as well as $666,000 from Dogechain and $5 million from Moonriver.\n\nMultichain likely hacked. Exit all multichain assets. Good idea to revoke approvals to multichain bridge if you had any — Curve Finance (@CurveFinance) July 6, 2023\n\nOn July 6, 7,214 Wrapped Ether (WETH) tokens worth $13.6 million, 1,024 Wrapped Bitcoin (WBTC) worth $31 million and $58 million worth of USD Coin (USDC) were withdrawn from the Fantom bridge’s Ethereum smart contract — approximately $102 million in cryptocurrency in total.\n\nJuly 6 withdrawals from the Multichain Fantom Bridge contract on Ethereum. Source: Blockchain data\n\nIn addition, the Dogechain bridge’s Ethereum contract saw a withdrawal of $666,000, which represented more than 86% of its total deposits, leaving only around $100,000 worth of assets remaining in the bridge. A total of $5,872,661 worth of USDC and Tether (USDT) were withdrawn from the Multichain Moonriver bridge contracts on Ethereum, leaving only around $700,000 remaining on it.\n\nSeveral on-chain sleuths took to Twitter to label the event as a possible exploit. Blockchain security firm PeckShield tagged the Multichain team in a post showing the Fantom bridge transactions, saying, “you may want to take a look.”\n\nThis led one commenter to remark that it looks like “another massive hack.” On-chain investigator Spreek posted the Dogechain transactions with the comment, “dogechain multichain drained.”\n\nCointelegraph could not confirm by the time of publication whether the contracts were “drained” or whether a large amount of funds were simply withdrawn by users.\n\nCointelegraph reached out to the Multichain team on their Discord channel but did not get a response by publication.\n\nIn a later tweet, Multichain told its Twitter followers that the movements were abnormal and the team “is not sure what happened and is currently investigating.”\n\nThe lockup assets on the Multichain MPC address have been moved to an unknown address abnormally.\n\nThe team is not sure what happened and is currently investigating.\n\n\n\nIt is recommended that all users suspend the use of Multichain services and revoke all contract approvals… — Multichain (Previously Anyswap) (@MultichainOrg) July 6, 2023\n\nRelated: Poly Network urges users to withdraw after exploit affects 57 crypto assets\n\nMultichain is a multi-party computation (MPC) bridging network. When a user wants to bridge assets from one chain to another, the Multichain network first confirms that the assets have been locked on the first chain and then mints derivative assets on the second chain.\n\nWhen a withdrawal is made, the network goes through this process in reverse: it first confirms that the derivative coins have been destroyed on the second chain, then releases the assets backing them on the first chain.\n\nThe Multichain team claims that the cryptographic keys controlling this process are split into multiple shards and distributed throughout the network. This should theoretically prevent any single person or group from being able to make unauthorized withdrawals.\n\nMultichain has been suffering from unspecified technical problems over the past few weeks. On May 31, the team announced that its CEO had gone missing and it was experiencing “multiple issues due to unforeseeable circumstances,” leading to delayed transactions. On July 5, Binance halted withdrawals of some Multichain derivative tokens due to the network failing to process transactions in a timely manner.\n\nAsia Express: HK crypto ETFs on fire, Binance warns on Maverick FOMO, Poly hack\n\nUpdate July 7, 12:41 am UTC: This article has been updated to include the most recent Twitter post and update from Multichain."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb2luYmFzZS1jb25vci1ncm9nYW4tdW5jb3ZlcnMtdGhvdXNhbmRzLWxvc3QtZXRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Crypto's Indiana Jones? Coinbase exec helps recover $322K of once-lost crypto - Cointelegraph",
        "content": "It’s not every day that one suddenly becomes $322,000 richer — but for one lucky crypto investor, this is exactly what happened in the late hours of July 5.\n\nIn a recent Twitter thread, Conor Grogan, director of product strategy & business operations at Coinbase, explained how he uncovered hundreds of thousands worth of dormant crypto and even managed to contact its unaware owner.\n\nI found $322k for a stranger who previously lost their life savings in a hack pic.twitter.com/K1gUqEkAPh — Conor (@jconorgrogan) July 5, 2023\n\nWhen the Ethereum blockchain forked in 2016, Ethereum Classic (ETC) was created. Any investor who held the now-standard Ether (ETH) on-chain was airdropped an identical amount of ETC. Many never touched these new funds, said Grogan.\n\n“Forgetting you have funds on chain (or not keeping track of airdrops) is common,” Grogan said, sharing how he’d recovered six-figure amounts for investors in the past. In a subsequent screenshot, Grogan said he once notified a Twitter user of 23 ETH that had been sitting untouched.\n\nGrogan informed a Twitter user that he’d discovered 23 ETH for them. Source: Twitter\n\nTracking down these wallets is no small task. To start, Grogan said he trawled through the “ETC rich list,” searching for accounts that had never touched their ETC. After tracking down roughly 20 addresses with more than $250,000 worth of ETC, he combed through each, looking for ways to get in touch.\n\nGrogan said he ran into many “dead ends” with most of the wallets before finally stumbling upon an address with the prefix “0x475.“ Interestingly, the wallet contained a cryptocurrency called eosDAC (EOSDAC), which was airdropped to Ethereum holders in 2018.\n\nLeveraging the new information, Grogan said the airdrop amount and snapshot date allowed him to connect with the holder’s EOS wallet.\n\n“As it turns out, this EOS wallet has quite the history!” Grogan said.\n\nThis allowed Grogan to finally track down the legal name associated with the 0x475 ETH address — after poring over legal documents.\n\nIn an unusually heartwarming conclusion, Grogan managed to get in touch with the owner and inform them of their long-lost riches.\n\nThe wallet owner’s response to Grogan — unaware the funds had ever existed. Source: Twitter\n\n“Hopefully I made his day,” said Grogan.\n\nMagazine: Tornado Cash 2.0 — The race to build safe and legal coin mixers"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tb3JkaW5hbHMtcmV2aXZlZC1kZXZlbG9wZXJzLW9uLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Vitalik Buterin says Ordinals have revived 'builder culture' on Bitcoin - Cointelegraph",
        "content": "The advent of Bitcoin (BTC) Ordinals signals the “organic return of builder culture” to the network, according to Ethereum co-founder Vitalik Buterin.\n\nButerin made the comments in a July 7 Twitter Space where he spoke at length with Bitcoin proponents Eric Wall and Udi Wertheimer about what Bitcoin developers could learn from Ethereum devs.\n\nButerin praised Ordinals and the BRC-20 token standard, which he sees as a rejection of “stagnant” politics in the Bitcoin ecosystem.\n\n“Ordinals are starting to bring back a culture of actually doing things. It feels like there's real pushback to the laser-eye movement, which is good,” Buterin said.\n\nThe nearly two-hour-long conversation centered around the issue of scalability. Wall claimed that Bitcoin’s Lightning Network can’t scale for future users and fails “frequently” when processing “even medium-sized payments.”\n\nIn response, Buterin suggested the best approach would be to focus on implementing different types of layer-2 solutions and look for ways to make the Bitcoin base layer more efficient.\n\n“I think focusing on rollups is good, and so is being open to ZK-snark-based scaling solutions.”\n\nWertheimer believed the introduction of zero-knowledge rollups could create an interesting side effect.\n\n“If we adopted rollups for Bitcoin, we actually get an execution environment too […] We can do smart contracts,” Wertheimer said.\n\nWall and Wertheimer — two key figures behind the Ordinals project Taproot Wizards — are outspoken exponents of Ordinals and routinely advocate for building increased functionality on top of the Bitcoin network.\n\nRelated: Bitcoin miners raked $184M in fees in Q2, surpassing all of 2022\n\nTheir stance has drawn criticism from more fundamentalist Bitcoiners who claim NFTs and smart contracts on Bitcoin dilute its supposed primary function as a peer-to-peer cash network.\n\nSuch critics include Jan3 CEO Samson Mow, who believes Ordinals waste block space that could otherwise be dedicated to Bitcoin payments.\n\nWall noted these criticisms and explained that Bitcoin could be used as a “proof system” for zero-knowledge proofs, which wouldn’t congest the network.\n\n“My perspective is that we [Bitcoiners] always wanted to do DeFi adjacent things, but we just wanted the Bitcoin base layer to just act as sort of a judge or an arbiter of that computation and not have to run the computation on-chain,” Wall said.\n\n“We shouldn’t necessarily just be thinking about second layers as a way to make payments, but I think we could also think about them [as a way of doing] expressive things.”\n\nThe discussion yielded fresh controversy in the Bitcoin community, with Wertheimer slamming Mow and Blockstream CEO Adam Beck for being dismissive of the conversation with Buterin.\n\nThese 2 laser-eye clowns have been running blockstream into the ground for the last decade\n\n\n\nIn 10 years that company couldn’t come up with a single successful product\n\n\n\nTheir joke of a blockchain processes 3 txs a day\n\n\n\nAnd they think they have nothing to learn from ethereum pic.twitter.com/mp7we9Lvxq — Udi Wertheimer (@udiWertheimer) July 6, 2023\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1iZWxvdy0zMDUwMC1ldGhlcmV1bS1ob2xkcy0xOTAwLXBvbHlnb24tc2hlZHMtNS0zODg0MjItMjAyMy0wNy0wNtIBkAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2FtcC9jcnlwdG8vdG9rZW4vc3RvcnkvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tYmVsb3ctMzA1MDAtZXRoZXJldW0taG9sZHMtMTkwMC1wb2x5Z29uLXNoZWRzLTUtMzg4NDIyLTIwMjMtMDctMDY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin below $30,500; Ethereum holds $1,900; Polygon sheds 5% - Business Today",
        "content": "Bitcoin and other top crypto tokens were down on Thursday after the release of June Federal Reserve minutes, which suggested more tightening coming in if the central bank feels the need. Investors took some profit off the table even as the sentiments remained firm.\n\n\n\nBitcoin continued to weaken further on Thursday. The largest crypto token dropped another per cent to slip below $30,500-mark. Its largest peer, Ethereum, also bled about a per cent but managed to hold $1,900-level. However, price action in other altcoins was majorly on the downside.\n\n\n\nFollowing the release of the Federal Open Market Committee (FOMC) minutes, Bitcoin experienced a decline. However, it maintained stability above the $30,400 after the optimistic remarks made by the CEO of BlackRock on Bitcoin, said Edul Patel, Co-founder and CEO at Mudrex.\n\n\n\n\"Although Bitcoin briefly surged above $31,000 earlier this week, it has been consolidating above $30,000 as the bullish momentum weakened. Nevertheless, Bitcoin remains in close proximity to the $31,000 level, which serves as a significant resistance point to monitor in the near term,\" he said.\n\n\n\nBarring a few exceptions, all other top crypto tokens were trading lower on Thursday. Polygon dropped about 5 per cent, while Polkadot, Cardano, XRP and Dogecoin declined 3 per cent each. Litecoin was down 2 per cent. Among the gainers, Solana rose about a per cent, while Bitcoin Cash and Tron were also seen in green.\n\n\n\nThe global cryptocurrency market cap was trading lower, dropping below the $1.2 trillion-mark as it declined more than a per cent in the last 24 hours. However, the total trading volumes surged about 11 per cent to $32.08 billion.\n\n\n\nThere has been slight selling pressure in the crypto market in the last 24 hours. The crypto fear and greed index is down by 5 points but remains in the greed zone with a score of 56/100. BTC observed a little dip as its dominance has increased slightly in the process and is currently around 51.36 per cent, said Shubham Hudda, Senior Manager, CoinSwitch Markets Desk.\n\n\n\n\"Simultaneously, Polygon saw another day of positive news yesterday. The company and Jump.trade -- an NFT marketplace—have announced that they will be working alongside Flipkart to onboard over 1.1 million web3 wallets and provide its users with exclusive features like brand loyalty programs, limited-edition NFT drops,\" he said.\n\n\n\n\n\nTech View by WazirX Trade Desk\n\nFilecoin(FIL) is a decentralized storage platform designed with the objective of preserving and safeguarding crucial information that holds significance for humanity. The Filecoin network attains remarkable economies of scale through its inclusivity, enabling individuals from around the globe to partake as storage providers.\n\n\n\n\n\nThe FIL/USDT price has been mostly closing in the green for the past 3 to 4 weeks. On the weekly time-frame the trend has broken above the descending triangle pattern. The weekly RSI has emerged out of the oversold zone. The next resistance is expected at $5.1 and the next support is expected at the $3 level.\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vbWlsa3JvYWQuY29tL2d1aWRlL21ldGEtdHJhbnNhY3Rpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Crypto Meta Transactions - Milk Road",
        "content": "Outside of scalability, one of the biggest things holding crypto back is usability. Right now, there’s a massive barrier-to-entry for everyday users looking to access decentralized applications on Ethereum.\n\nIt’s the need to pay gas, the fuel that powers transactions on the Ethereum network.\n\nDon’t get me wrong either, there’s a fundamental need for transaction fees in the network to properly secure the network. But with this, in order to use any applications, users have to hold ether to pay for gas.\n\nThis isn’t a problem for most experienced Ethereum users. However, for new users, this presents a serious barrier-to-entry. The need to pay gas when interacting with dApps requires every user to go out and buy ether. While this is great in terms of price action and network economics, it does create some friction as users likely have to acquire the asset through a fiat on-ramp. This generally means completing KYC on major exchanges, like FTX, linking your bank account or debit card, providing your social security number, and uploading a selfie.\n\nThe need for users to have ether to access DeFi applications and other dApps creates a considerable amount of friction in terms of accessibility and usability. Even then, once users have Ether in their wallet, they may be required to have some knowledge about gas prices, especially when the network is congested. In short, the need for paying gas (i.e. transaction fees) presents a significant barrier-to-entry for driving mass adoption.\n\nThe answer to this problem? Meta transactions.\n\nMeta Transactions Enable Gasless Transactions\n\nIn essence, meta transactions allow users to interact with a public blockchain without paying a transaction fee. This leads to a more seamless UX as users no longer have to understand the inner workings of public blockchains and market dynamics for transaction fees.\n\nAt its core, meta transactions are nearly identical to regular network transactions but with the addition of a proxy contract, also known as a relayer. With meta transactions, users still use their signature to send and authenticate transactions. The difference is, once this happens, the transaction is now managed by the relayer who pays the gas and sends the transaction to the receiving address.\n\nBy leveraging meta transactions, developers can significantly streamline the user experience for their applications. Ultimately, this feature brings the ecosystem closer to a frictionless user experience when accessing web 3.0 and DeFi.\n\nThe Two Types Of Meta Transactions\n\nCentralized Relays\n\nWe’ve seen some applications deploy a single relayer or a select few relayers to facilitate meta transactions within their contracts. Given Decentralized Finance (DeFi) and the notion of trustless transactions, centralized relayers contradict the movement as a centralized relayer acts as a single point of failure for the network. In other words, developers can censor transactions or if the relayer goes down, the application may go down with it.\n\nWhile this is the easiest way for application developers to integrate meta transactions, it does go against the ethos of decentralized networks.\n\nDecentralized Relays\n\nIt goes without saying that in a decentralized network, decentralized relays are the ideal solution. Decentralized relayers could watch the transaction pool and act as secondary miners. However, they would still suffer from a synchronization problem. With meta transactions, a relayer can only process one transaction at a time where each relayer will only pick the most profitable transaction. This would result in a saturation of miners competing for the most profitable transactions, where only one of the miners would succeed while all others would fail and lose money on their attempt.\n\nWhile decentralized relayers are the penultimate solution, they do present some problems in terms of incentivization schemes and a lack of synchronization among miners. Luckily for us, the Ethereum community is filled with brilliant people who love to solve challenging problems like these.\n\nWho’s Pioneering Meta Transactions?\n\nThe most well-established initiative pioneering meta transaction is Open Zepplin’s Gas Station Network (GSN). The GSN is an open-sourced community-driven effort comprised of a consortium of different crypto projects pushing for mass adoption. The GSN is an open-sourced SDK creating a decentralized and trustless mechanism for leveraging meta transactions for any Ethereum application. With the GSN, relays will take care of paying for verified transactions, allowing users to quickly onboard and easily access their favorite dApp.\n\nHow Does It Work?\n\nThe Gas Station Network consists of relayers, also known as gas stations. Gas stations can accept etherless transactions from users, filling them with gas by signing them, and then returning the transactions to the users and relaying them to the network. With this architecture, trust can be minimized in a decentralized fashion. A single open-source smart contract, called the RelayHub, acts as a registrar for relays and facilitates transactions between the relays and smart contracts.\n\nThe RelayHub holds small deposits from dApps and developers in order to compensate relayers for processing transactions. Relayers are required to stake ETH in the RelayHub when they register to prevent certain DoS and other censorship attacks. With this, honest relays can earn transaction fees while malicious relays can have their stake slashed.\n\nFrom the user’s perspective, everything from selecting a relayer and the delivery of the transaction to the network is done transparently, autonomously and in a timely manner. Ultimately, this leaves users with a seamless UX when interacting with their favorite applications.\n\nConclusion\n\nMeta transactions significantly abstract the complexities of gas away from the user. As a result, dApp onboarding is made easy and users can begin enjoying the massive benefits that web 3.0 applications provide. Over the next few years, it will come as no surprise if meta transactions become common practice when developing new decentralized applications.\n\nMore importantly, meta transactions may be the key to driving more adoption to DeFi applications. Being able to hold Dai and access emerging DeFi applications without ever having to worry about holding Ether or paying gas will likely be a major factor when it comes to mass adoption.\n\nFor more detailed information surrounding meta transactions, feel free to visit the gas station network website or read up on Austin Griffith’s Medium post about meta transactions.\n\nAdditional Resources"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbmdhcGUuY29tL2hvdy1iaXRjb2luLWV0aGVyZXVtLXByaWNlLW1vdmUtYXMtdXMtdW5lbXBsb3ltZW50LXJhdGUtYW5kLW5vbmZhcm0tcGF5cm9sbC1mYWxsL9IBamh0dHBzOi8vY29pbmdhcGUuY29tL2hvdy1iaXRjb2luLWV0aGVyZXVtLXByaWNlLW1vdmUtYXMtdXMtdW5lbXBsb3ltZW50LXJhdGUtYW5kLW5vbmZhcm0tcGF5cm9sbC1mYWxsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "How Bitcoin, Ethereum Price Move As US Unemployment Rate and Nonfarm Payroll Fall? - CoinGape",
        "content": "The U.S. Bureau of Labor Statistics on July 7 released nonfarm payrolls (NFP) and unemployment rate data for June. The NFP came in at 209K for June, below market forecasts of 225K. It is the lowest reading since December 2020, but remains more than twice the 70k-100k needed per month to keep up with growth in the working-age population. The nonfarm payrolls came in at 306k last month.\n\nMeanwhile, the unemployment rate came in line with market expectations at 3.6% but decreased as compared to May’s seven-month high of 3.7%. The jobs data indicate an anticipated economic slowdown in the U.S., while the Federal Reserve can continue raising interest rates to combat inflation.\n\nadvertisement\n\nWhile the US dollar index (DXY) fell below 102.75, which signals the crypto market will rise and Bitcoin could regain above $31k, the tight labor market is bearish for the economy. Also, job creation is positive, but reliance on government jobs for 28% of additions suggests a lack of robust private sector growth. This comes after the strong ADP Employment data showed 497,000 new jobs in June.\n\nOverall, the macro outlook remains challenging for Bitcoin, with treasury yields rising rapidly and volatility returning to the crypto and stock markets. The CME FedWatch tool indicates a nearly 90% probability of a 25 bps rate hike during the July FOMC meeting.\n\nKeep in mind +209k jobs is still a good (not great) number, but the re-acceleration in nominal wage growth, flat LFPR, and falling unemployment rate represent a RESILIENT AND DYNAMIC LABOR MARKET. — Caleb Franzen (@CalebFranzen) July 7, 2023\n\nAlso Read: Professor Edward Kim Unveils Terra Luna Classic’s AI Chain “Block Entropy”\n\nBitcoin and Ethereum Prices Rise\n\nBitcoin and Ethereum prices are increasing due to the US dollar weakness after the recent jobs reports. Both BTC and ETH jumped 1% after the nonfarm payrolls and unemployment rate data.\n\nBTC price currently trades at $30400, up 2% from the intraday low of $29,777. The 24-hour high for Bitcoin is $31463. Meanwhile, ETH price currently trades at $1871, up 1% in the past 24 hours.\n\nAlso Read: US Fed Powell, ECB Lagarde Aggressively Hawkish, Can Bitcoin Price Still Hit $35000?"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9zdGFya25ldC10YWtlcy1iYWJ5LXN0ZXBzLXRvLWVtZXJnZS1hcy1hLXJvYnVzdC1ldGhlcmV1bS1zY2FsaW5nLXNvbHV0aW9uL9IB2QFodHRwczovL2FtYmNyeXB0by5jb20vc3RhcmtuZXQtdGFrZXMtYmFieS1zdGVwcy10by1lbWVyZ2UtYXMtYS1yb2J1c3QtZXRoZXJldW0tc2NhbGluZy1zb2x1dGlvbi8_dXRtX3NvdXJjZT1yc3MmdXRtX21lZGl1bT1yc3MmdXRtX2NhbXBhaWduPXN0YXJrbmV0LXRha2VzLWJhYnktc3RlcHMtdG8tZW1lcmdlLWFzLWEtcm9idXN0LWV0aGVyZXVtLXNjYWxpbmctc29sdXRpb24mYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Starknet takes baby steps to emerge as a robust Ethereum scaling solution - AMBCrypto News",
        "content": "Assets worth more than $65 million have been deposited on Starknet.\n\nStarknet still suffered with poor transaction throughput.\n\nLaunched in 2021, Ethereum’s [ETH] layer-2 solution (L2) Starknet has grabbed a lot of eyeballs in the first half of 2023. Though still in its infancy, the zero-knowledge rollup (zk-rollup) witnessed significant activity.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nDeposits on the rise\n\nAccording to blockchain analytics firm Nansen, more than 500,000 wallets have bridged over to Starknet, depositing assets worth more than $65 million. As evident from the graph below, ETH was the most bridged asset, equating to nearly 75% of the total value bridged (TVB).\n\nUsers port their assets to take advantage of the speed and cost-effectiveness of a L2 technology. The StarkGate bridge is used to port assets in the case of Starknet. Each supported token is associated with an L1 and L2 bridge contract that communicates via Starknet’s messaging mechanism.\n\nStarkware, the firm which developed Starknet, has set limitations involving the deposit amount and total value locked in the L1 bridge contract. An increase in deposit caps in mid-March resulted in the sharp jump in deposits. As of this writing, ETH had the maximum cap of 80,000 among all assets.\n\nNansen also emphasized the age breakdown of depositing wallets, shedding light on some intriguing aspects of Starknet’s demand. As revealed below, nearly 75% of these wallets were created in the last one year, with a significant 41% being in the age-band of 3-12 months. This indicated that Starknet’s demand was driven by newer market participants.\n\nStill early days\n\nWhen compared with other L2 solutions, Starknet was still in its nascent stage. According to a Dune dashboard, deposits on Starknet were still considerably less as compared to established players like Arbitrum [ARB] and Optimism [OP] and even trailed the recently launched zk-rollup zkSync Era.\n\nOne reason behind the poor growth rate could be the low transactions processed per second (TPS). Data from Dune highlighted that while Ethereum mainnet handled 11 TPS on average, the number of transactions on Starknet was less than one, a significant low for a rollup.\n\nHowever, Starknet was looking to address this issue through the upcoming version 0.12.0. The upgrade is expected to reduce block execution time, thus significantly improving throughput and latency."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZGVjcnlwdC5jby8xNDc1MjUvb3BlbnNlYS1hZGRzLXN1cHBvcnQtem9yYXMtZXRoZXJldW0tbGF5ZXItMi1uZXR3b3Jr0gFTaHR0cHM6Ly9kZWNyeXB0LmNvLzE0NzUyNS9vcGVuc2VhLWFkZHMtc3VwcG9ydC16b3Jhcy1ldGhlcmV1bS1sYXllci0yLW5ldHdvcms_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "OpenSea Now Supports NFTs on Zora's Ethereum Layer-2 Network - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nZora, the NFT minting platform that recently launched its own Ethereum layer-2 scaling network to facilitate faster and cheaper minting of on-chain artwork, will now be supported by NFT marketplace OpenSea, both companies announced Friday.\n\nThe news means that art pieces minted on Zora’s network can now be bought and sold on OpenSea, and that OpenSea’s suite of NFT-related tools will now be able to mint assets on Zora's scaling network. The Zora Network is built on the tech stack of existing scaling network, Optimism.\n\nOpenSea is only the latest of more than 45 NFT platforms, including Sound, Gallery, and Rainbow, that support the new Zora network. OpenSea is a mainstay of the NFT industry that has historically accounted for the majority of organic NFT trading volume, although it was surpassed earlier this year by rival Blur and its tokenized trading incentives.\n\nAD\n\nAD\n\nZora was founded in 2020 as a service that offered artists the infrastructure to sell on-chain, digital tokens tied to physical artwork and items. It has since pivoted to building an open-source protocol designed to allow any users to mint and sell NFTs, as well as build boutique NFT marketplaces.\n\nThe company’s move in June from the Ethereum mainnet to a layer-2 scaling solution has made minting 25 times cheaper, Zora CEO and co-founder Jacob Horne previously told Decrypt.\n\n“L2s have been around for a year now—mainnet Optimism has existed, Arbitrum has existed—but have skewed towards DeFi and a financial use case,” he said at the time. “I think the ecosystem and the market is ready for a network that’s purpose-built for art and media, and really leaning into all the interesting experimental things you can do when you have a network like that.”\n\nSince launching the Zora network two weeks ago, the company says it has facilitated over 70,000 mints and onboarded more than 50,000 collectors onto its own chain.\n\nAD\n\nAD"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kZWZpLWNpcmN1aXQtYnJlYWtlci1jb3VsZC1jdXQtaGFjay1sb3NzZXMtYnktc2V2ZW50eS1wZXJjZW500gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "ETH DeFi 'circuit breaker' could cut hack losses by 70% — Developer - Cointelegraph",
        "content": "A decentralized finance (DeFi) “circuit breaker” could have prevented billions of dollars worth of crypto from being stolen from DeFi protocols in 2022, according to the developer of the newly published ERC-7265 proposal.\n\nA new Ethereum request for comment (ERC) was published on GitHub on July 3. In it, the lead developer Diyahir Campos proposed a standard for a DeFi “circuit breaker.” It essentially aims to set a standard for a smart contract that can halt suspiciously large token outflows from a DeFi protocol.\n\n1/ Announcing ERC 7265: Circuit Breaker\n\n\n\nWe are fixing the biggest problem with DeFi Security - lack of response time to mitigate hacks.\n\n\n\nBuilt by @Diyahir @tcb_00 @real_philogyhttps://t.co/4KQDYEK2H7 — Meir Bank (@MeirBank) July 3, 2023\n\nLast year was the single biggest year for crypto hacks, with at least $3.1 billion stolen from DeFi protocols — and cross-chain bridges accounted for 65% of that.\n\nSpeaking to Cointelegraph, Campos said circuit breakers could have prevented billions in losses.\n\n“The ones that weren’t rugs, you could probably save 70% of the money [...] with minimal impact to users.”\n\nCampos revealed he was one of the many that lost funds in the $195 million Euler Finance attack in March, which led to contagion impacting 11 other protocols.\n\n“Actually, I was one of the depositors in the Euler hack,” he said.\n\n3/ Our data analysis shows that DeFi Guardian could have saved more than 50% of losses from the recent @eulerfinance hack.\n\n\n\nInstead of draining the entire TVL of Euler within moments, the Euler hacker would have been rate limited, saving tens of millions of dollars for users. pic.twitter.com/Nuck06iQIo — Meir Bank (@MeirBank) June 1, 2023\n\n“From that experience, I’m looking at the TVL [total value locked] charts and the transactions that happened, and really it begged the question:”\n\n“Why would you ever let 100% of your TVL leave in 10 seconds or five blocks?”\n\nA typical DeFi protocol would see around 20% of total value locked entering or leaving a project in a day.\n\n“Once you start talking 30% or 40%, that's when you really start separating exploits versus daily usage,” said Campos.\n\nThe proposed standard has not been without controversy. DeFi researcher Chris Blec was among the skeptics on Twitter concerned the circuit breaker could be used for potentially nefarious purposes.\n\nOh dear Lord. What is this nonsense?\n\n\n\nGiving DeFi devs a protocol-level method that allows them to freeze your money forever?\n\n\n\nWHAT COULD POSSIBLY GO WRONG???\n\n\n\n(h/t @DefiantNews) pic.twitter.com/RofYYv9Nud — Chris Blec (@ChrisBlec) July 6, 2023\n\nCampos said the circuit breaker isn’t suitable for every DeFi protocol and doesn’t guarantee a protocol is safe. He noted the circuit breaker would be an “opt-in thing” for DeFi projects.\n\nHe also believes that a well-designed circuit breaker must strike a balance between protecting users and preventing “false positives,” as it would be extremely disruptive whenever the breaker trips.\n\nRelated: Multichain MPC bridge sees $100M+ outflows, sparking fears of exploit\n\nHowever, a circuit breaker would be useless in cases of internal rug pulls, as it could simply be deactivated by the team controlling the protocol.\n\nA quick exploration of the power of circuit breakers in DeFi and their limitations in preventing costly hacks https://t.co/bZKeWJyUkI — Diyahir (@Diyahir) June 27, 2023\n\nCampos is a smart contract developer at Hydrogen Labs. He said work began on the proposed standard during an April hackathon in Tokyo alongside Meir Banks, the co-founder of Hydrogen Labs.\n\nThe idea for the DeFi circuit breaker was inspired by similar circuit breakers that have been used by global stock exchanges for decades.\n\n“In DeFi, we aren’t trying to calm the markets, which is the intention of the [New York Stock Exchange’s circuit breaker] rather we want to prevent hack losses,” wrote Campos in a June 27 blog post.\n\nOther developers working on the standard include Philippe Dumonet, founder and CEO of DeReg and Blagoj Dimovski, co-founder and former chief technology officer of Diagonal Fiance.\n\nCampos said the standard is still being shaped at this stage, but is confident it will be ready “within months,” which would put it in “a really good stage” to be integrated into protocols.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMDcvc2hpYmEtaW51LWJhc2VkLXNoaWJhcml1bS1ibG9ja2NoYWluLWV4cGVjdGVkLXRvLWdvLWxpdmUtaW4tYXVndXN0L9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMDcvc2hpYmEtaW51LWJhc2VkLXNoaWJhcml1bS1ibG9ja2NoYWluLWV4cGVjdGVkLXRvLWdvLWxpdmUtaW4tYXVndXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Shiba Inu-Based Shibarium Blockchain Expected to Go Live in August - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2ZiaS1yYWlkZWQta3Jha2VuLWNlby1qZXNzZS1wb3dlbGwtaG9tZS_SAU1odHRwczovL2VuLmV0aGVyZXVtd29ybGRuZXdzLmNvbS9mYmktcmFpZGVkLWtyYWtlbi1jZW8tamVzc2UtcG93ZWxsLWhvbWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "FBI Reportedly Raided Kraken CEO Jesse Powell’s Home Over Hacking Accusation - Ethereum World News",
        "content": "The FBI reportedly carried out a search at the residence of Kraken founder and CEO Jesse Powell.\n\nThe March 2023 search was over claims that Powell hacked and stalked a non-profit organization.\n\nThe FBI and federal prosecutors in California have been looking into Powell since September 2022.\n\nThe investigation is not related to Powell’s crypto business and has not led to any formal charges yet.\n\nThe Federal Bureau of Investigation reportedly carried out a search at the residence of Jesse Powell, the man behind Kraken, the second-largest crypto exchange in the United States. People familiar with the matter revealed that the FBI’s raid was not in connection with Powell’s cryptocurrency business but related to his non-profit ventures.\n\nKraken CEO Was Under Investigation Since Last Fall\n\nAccording to a report by the New York Times, the FBI searched Jesse Powell’s residence in Los Angeles’ Brentwood area in March this year. Documents viewed by NYT revealed that federal agents seized electronic devices from the Kraken CEO’s home during the search. The search was reportedly over accusations against Powell of hacking and cyber-stalking a non-profit.\n\nThe Verge Center for the Arts, which was founded by Jesse Powell, accused him of interfering with its computer accounts and blocking access to emails and other online communications. The FBI and federal prosecutors in California have reportedly been looking into Powell since last fall. No formal charges have been filed against the Kraken founder yet.\n\nNews of the FBI’s search and investigation was confirmed by Jesse Powell’s lawyer Brandon Fox, who added that Powell had not done anything wrong. A spokeswoman from Kraken told NYT that the FBI’s investigation of Verge was not related to the crypto exchange in any manner. According to her, the crypto firm had no reason to believe that the investigation involved any other potential issues. At the time of writing, there was no official statement from Jesse Powell regarding the recent developments."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiKGh0dHBzOi8vd3d3LmxjeC5jb20vdGhlLWhpc3Rvcnktb2YtbmZ0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "The History of NFTs - LCX",
        "content": "NFTs have had a substantial impact on business growth and mainstream media. In recent years, the introduction of these digital-assets has caused considerable disruption in the field of digital art. Many people are drawn in by the history of NFTs: one-of-a-kind digital-assets and the thoughtfulness that led to their development.\n\nA Brief History of NFTs\n\nFor an understanding of the origins of NFTs, first examine the evolution of blockchain technology. In 2008, a mysterious person or collective group of individuals known as Satoshi Nakamoto introduced Bitcoin, the first decentralized digital currency in the world. Implementing blockchain, a distributed database technology that requires reliability, safety, and immutability, this innovative innovation ensured accountability, protection, and rigidity.\n\nThe history of NFT began in 2014 with the creation of the first NFT, Quantum, by Kevin McCoy. In 2017, however, the world became aware of non-fungible tokens. During this time, numerous distinct NFT collections arose on the Ethereum blockchain. The failures in NFT trade and ownership transfer on earlier blockchain networks delayed the growth and evolution of NFTs. By facilitating token development, programming, storage, and trading, the Ethereum blockchain provides a trustworthy solution to NFT problems. As a consequence, Ethereum supported simpler onboarding and reduced the barriers to entry for NFTs.\n\nThe Emergence of Digital Assets\n\nPrior to 2021, two prominent factors played a significant role in driving up prices and boosting general interest in. A cursory review of the history of NFTs would reveal that the global epidemic of COVID and highly valuable NFT artwork sales were significant driving forces. The COVID-19 pandemic encouraged a greater number of individuals to interact with communities of NFT users on Twitter and other channels where NFT had achieved a dominant position. Beeple, a digital artist, sold an NFT at auction for $69 million, constituting a significant milestone in the history of non-fungible tokens. Additionally, Beeple was the first digital artist to partner with a significant auction house for the sale of NFTs. The exceptional value of Beeple’s digital artwork sparked interest in non-fungible tokens.\n\nIn addition to Beeple’s $69 million sale, the annals of non-fungible tokens include numerous other sales of high-value NFTs. Edward Snowden, for example, created the NFT’s Stay Free and sold it for $5 million. Consequently, a CryptoPunks NFT was auctioned for approximately $11 million. In 2021, “Right-click and Save As Guy” by XCopy was another popular NFT that sold for $7 million. Through 2021, digital art and mementos will play a crucial role in propelling the popularity and evolution of NFTs.\n\nFurthermore, several fresh uses of NFTs acquired traction in this field in order to attract attention to NFTs. For instance, the brief background on non-fungible tokens would emphasize popular NFT-based simulated environments such as Decentraland and NFT-based blockchain games like Axie Infinity. A further significant event in the history of NFTs is the association of well-known brands with NFTs. Numerous reputable businesses wish to initiate NFT initiatives in order to adjust to web3 technology and emerging trends. Taco Bell and Coca-Cola are two prominent examples of large corporations that utilize NFTs. In addition, other well-known brands, including Adidas, Nike, Gucci, Louis Vuitton, and Hot Wheels, have demonstrated a keen interest in non-fungible tokens."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2F2YWxhbmNoZS1hbmQtZG9nZW1peWFnaS1sZXZlcmFnaW5nLWV0aGVyZXVtcy1ncm93dGgtbW9kZWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "Avalanche and DogeMiyagi: Leveraging Ethereum's Growth Model - Analytics Insight",
        "content": "Is it Safe to Buy ETH Now? – Analysing Ethereum, Avalanche, and DogeMiyagi\n\nThe crypto market has been buzzing with the remarkable performance of Ethereum (ETH), which witnessed a staggering 61% surge in the first half of this year. As traders anticipate the continuation of this rally, a crucial question arises: is it safe to buy ETH NOW? In this article, we will delve into the growth potential of Ethereum, analyse it as a model for newer projects like Avalanche (AVAX) and DogeMiyagi (MIYAGI), and provide insights to aid readers in their crypto investment decisions. Our goal is to offer news, education, and updates on the crypto market, all while maintaining an informative yet comical tone.\n\nEthereum – The Leading Smart-Contract Blockchain\n\nEthereum experienced a staggering 61% surge during the year’s initial half, prompting traders to speculate on the possibility of this rally extending into the latter half. In an intriguing move observed in late June, an investor made a notable transaction involving approximately 63,250 “bull call spreads” linked to ether, with an expiration date of December 29. This intricate manoeuvre consisted of selling a call option at the $2,500 strike price, generating funds that partially facilitated the acquisition of a call option at the $1,900 strike.\n\nNotably, the overall strategy came at an initial cost of $10 million, as the trading entity expended more to purchase the $1,900 call than it received from selling the $2,500 call. This particular strategy allows the call buyer to secure protection against price rallies while the call seller obtains an upfront premium from the buyer.\n\nThe phenomenal growth of Ethereum sets a benchmark for newer projects like Avalanche and DogeMiyagi. These projects aim to leverage Ethereum’s success and address its limitations, ultimately striving for its unique value propositions.\n\nAvalanche: Rising from Crypto Winter with Promising Future\n\nDuring the crypto winter, Avalanche faced significant setbacks, experiencing a similar growth trajectory as the now-defunct Terra (LUNA) before reaching its peak at an all-time high of $146.22 over a year ago. Although currently down by more than 87% from that pinnacle, AVAX holders have demonstrated resilience by disregarding the losses and embracing the promising future that awaits the protocol.\n\nThe latest data indicates that many AVAX holders are in an unfavourable financial position, signifying losses.\n\nHowever, despite this prevailing circumstance among the majority of holders, the steady progress of the protocol serves to assuage investor concerns across the entire spectrum.\n\nDogeMiyagi: Memes, NFTs, Community for Crypto Success\n\nAmong the emerging meme coin projects, DogeMiyagi distinguishes itself by presenting an innovative approach to cryptocurrency. Incorporating elements of the beloved Karate Kid franchise and meme culture, DogeMiyagi succeeds in cultivating a unified community of enthusiastic investors. This dynamic project introduces NFTs and offers enticing rewards and engaging giveaways, fostering an immersive and captivating experience.\n\nThe core of DogeMiyagi lies a strong emphasis on community involvement, facilitated by a decentralised autonomous organisation (DAO). This unique framework ensures that every community member has a voice in shaping the project’s trajectory, and users reap benefits as the project progresses; leveraging the Ethereum network enhances transparency, security, and sustainability.\n\nAvalanche and DogeMiyagi: Learning from Ethereum’s Growth Model to Propel Success\n\nAvalanche and DogeMiyagi can leverage Ethereum as a growth model in several ways. Firstly, they can learn from Ethereum’s success in establishing itself as the world’s largest smart-contract blockchain. By studying Ethereum’s approach to scalability, security, and developer community engagement, Avalanche and DogeMiyagi can enhance their protocols to attract more users and developers.\n\nSecondly, Avalanche and DogeMiyagi can draw inspiration from Ethereum’s vibrant ecosystem of decentralised applications (DApps) and tokenised assets. They can explore similar use cases and develop innovative features that provide value to their respective communities. This includes the integration of NFTs (non-fungible tokens) and the creation of platforms that facilitate seamless token swaps and decentralised finance (DeFi) activities.\n\nFurthermore, Ethereum’s extensive network effects can serve as a guiding principle for Avalanche and DogeMiyagi. By fostering strong partnerships, building strategic alliances, and collaborating with other projects in the blockchain industry, they can create synergies that benefit all participants. This cooperative approach can help accelerate adoption and increase the overall value proposition of Avalanche and DogeMiyagi, mirroring Ethereum’s growth trajectory.\n\nOverall, by studying and applying the growth model of Ethereum, Avalanche and DogeMiyagi can position themselves as promising projects in the crypto market, attracting investors, developers, and users seeking the next big opportunity in the ever-evolving blockchain space.\n\nDogeMiyagi:\n\nWebsite: https://dogemiyagi.com\n\nTwitter: https://twitter.com/_Dogemiyagi_\n\nTelegram: https://t.me/dogemiyagi\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hcy1ldGhlcmV1bS1ldGgtcHJpY2Utc3RhZ25hdGVzLW9uLWNoYWluLWFuYWx5dGljcy1wcmVkaWN0LTE4MC1zcGlrZS1mb3ItaW5xdWJldGEtcXViZS1hbmQtZW9zLWVvcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 07:00:00 GMT",
        "title": "As Ethereum (ETH) Price Stagnates, On-Chain Analytics Predict 180% Spike For InQubeta (QUBE) and Eos (EOS) - Analytics Insight",
        "content": "The recent crackdown by the SEC, particularly targeting cryptocurrency exchanges Binance and Coinbase, has labeled altcoins like Cardano and Polygon as securities. This regulatory classification has had a detrimental effect on these tokens’ prices, causing them to suffer significant declines. Furthermore, Revolut, a prominent European exchange and payments company, has delisted these altcoins from its US operations, further adding to the downward pressure on their prices.\n\nIn stark contrast to the challenges faced by Cardano and Polygon, InQubeta has displayed resilience and made substantial gains during this period of regulatory uncertainty. This AI-focused token has emerged as a promising investment opportunity, attracting attention from investors looking for long-term growth potential.\n\nWhy Qube Is Poised To Hit 100x By 2024\n\nInQubeta’s native token offers several features and utilities that position it for substantial growth in the coming years:\n\nFractional Investment Opportunities: The token serves as a utility for investors to invest in AI startups through fractionalized investment opportunities, allowing for greater accessibility and diversification. Deflationary Mechanism: InQubeta is a deflationary token with a 2% buy and sell tax that goes into a burn wallet, reducing the total token supply over time. Additionally, a 5% sell tax contributes to a dedicated reward pool, incentivizing long-term holding. Built on Ethereum: InQubeta is built on the Ethereum blockchain, leveraging the strength and established ecosystem of one of the most renowned blockchain platforms. This provides stability, security, and compatibility with various decentralized applications. Staking Rewards: Users can stake their InQubeta tokens to earn rewards, further incentivizing participation and engagement within the InQubeta ecosystem. Governance and Decision-Making: InQubeta token holders have the opportunity to participate in the governance process, where they can propose ideas, vote on proposals, and influence the future direction of the platform and its projects.\n\nDon’t Miss Out On The Biggest Presale In Crypto\n\nInQubeta has achieved major milestones with its ongoing presale that has gained strong interest and support within the crypto community. So far, the presale has raised over $900,000 in just a few weeks, indicating a high level of interest in the project.\n\nSome of the reasons for this is due to the minimal entry fee of $50 for participants. The low fee has attracted retail investors seeking to become a part of an AI ecosystem with massive potential. It also ensures that QUBE token is well distributed and decentralized thus limiting the influence of whales taking over its blockchain network.\n\nInQubeta’s presale also accepts popular cryptocurrencies such as Bitcoin (BTC), Tether (USDT), Ethereum (ETH), Binance Coin (BNB), and more, providing convenience and accessibility for investors.\n\nBottom Line\n\nWhile Cardano and Polygon face challenges due to increased regulatory scrutiny, InQubeta has demonstrated resilience and the potential for significant growth. Investors should consider participating in the ongoing presale, which has already shown strong interest and raised substantial funds. With its unique utilities, deflationary mechanism, association with Ethereum, staking rewards, and governance features, InQubeta is well positioned to achieve a potential 100x increase in its price by 2024. As the crypto market continues to evolve, identifying promising opportunities like InQubeta can be instrumental in maximizing investment returns and capitalizing on the future potential of the AI industry.\n\nVisit InQubeta Presale\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vYml0Y29pbmlzdC5jb20vdW5pc3dhcC12NC1sYXVuY2gtaGluZ2VzLW9uLWV0aGVyZXVtLWNhbmN1bi11cGdyYWRlL9IBT2h0dHBzOi8vYml0Y29pbmlzdC5jb20vdW5pc3dhcC12NC1sYXVuY2gtaGluZ2VzLW9uLWV0aGVyZXVtLWNhbmN1bi11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Jul 2023 22:05:30 GMT",
        "title": "Uniswap v4: Launch Hinges On Ethereum's Upcoming Cancun Upgrade - Bitcoinist",
        "content": "The crypto community eagerly awaits a new product as Uniswap Foundation tentatively hints at a timeline for the debut of the Uniswap version 4 protocol. This launch is supported by two pivotal milestones: the implementation of Ethereum’s Cancun upgrade and the subsequent completion of a security audit.\n\nA Waiting Game: Uniswap v4 And Ethereum’s Cancun Upgrade\n\nErin Koen, who holds the reins as the Governance Lead at the Uniswap Foundation, shared insights on the awaited rollout of Uniswap’s v4 protocol. According to Koen, the definitive timeline for the v4 launch is targeted for later in the year, but this projection is not without contingencies.\n\nOne milestone that stands as a prerequisite to the v4 launch is the completion of the much-anticipated Cancun upgrade of the Ethereum platform, currently earmarked to conclude by the end of September.\n\nFollowing the Cancun upgrade, a security audit remains a stage in the process. This stage isn’t a minor formality but an evaluation that ensures the new protocol is secure. Such an audit, Koen explained, can span up to four months.\n\nThe foundation is committed, Koen added, to taking the necessary time for this audit to uphold the security and integrity of the Uniswap ecosystem, emphasizing that user safety remains a top priority. Therefore, while the v4 launch is on the horizon, these significant milestones must first be met.\n\nUniswap v4, with its draft code made public on June 13, signifies a paradigm shift towards a modular exchange structure. Central to this transition are “hooks,” smart contracts that allow customizations in Uniswap’s liquidity pools, such as fees, on-chain limit orders, and bespoke on-chain oracles.\n\nUniswap v4 also debuts a novel “flash accounting” system designed to lower fees for liquidity providers. A departure from the v3 model, where assets were transferred into and out of pools post each swap; the v4 model will transfer only net balances.\n\nThis system, known as “transient storage,” will become operational after integrating the proposed EIP-1153 change in Ethereum’s protocol during the Cancun upgrade. The Uniswap team believes this mechanism would reduce transaction costs on the new product.\n\nRoad Ahead: Next Steps For Uniswap v4\n\nKoen highlighted the imminent ‘protocol code frozen’ stage of v4’s development process. This stage incorporates the EIP-1153 into the v4 code, making the launch subject to the successful inclusion of EIP-1153 into the Cancun upgrade.\n\nAs the Ethereum community awaits the Cancun upgrade, anticipation mounts for what the next iteration of Uniswap will bring. It is a critical moment for the DeFi space, as these advancements could reshape the landscape and bring about a new era of decentralized exchanges.\n\nMeanwhile, over the past 24 hours, Uniswap governance token UNI has been moving sideways 0.4% with a market price of $5.39 at the time of writing.\n\nFeatured image from Shutterstock, Chart from TradingView"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3doby1vd25zLXRoZS1tb3N0LWV0aC1rZXktZXRoLXBsYXllcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Who Owns the Most ETH? Meet the Key Players in Ethereum's Ecosystem - Cryptopolitan",
        "content": "One intriguing aspect of Ethereum‘s ecosystem is who owns the most ETH. Understanding the ownership distribution of this digital asset can provide insights into the dynamics of Ethereum’s economy and the influence wielded by different individuals and entities. However, determining the exact ownership of ETH can be a complex task, considering the decentralized nature of cryptocurrencies and the potential anonymity of holders.\n\nThis guide will examine the prominent figures and entities associated with significant ETH holdings. While the ownership landscape may evolve, the information provided will offer valuable insights into the key players in Ethereum’s ecosystem.\n\n9 out of the 10 Ethereum Whale addresses aren’t individuals\n\nLooking at the distribution of ETH across the Ethereum network on Etherscan, it is interesting to note that a significant portion of the largest holders are not individual entities. Among the top accounts by ETH balance, only 1 out of the top 10 belongs to respective owners. The largest holder of Ethereum is the Eth2 Deposit contract, which holds a substantial amount of ETH. Following closely is Wrapped Ether.\n\nAbout half of the top 50 Ethereum whales have yet to be publicly identified. Apart from the non-individual holders, several prominent exchanges also have a substantial stake in Ethereum. Binance, a leading cryptocurrency exchange, holds considerable ETH across multiple wallets. Other well-known exchanges like Bitfinex, Kraken, and the Gemini contract also have significant positions among the top holders of Ethereum.\n\nThis distribution of ETH ownership showcases the diverse ecosystem surrounding Ethereum, with a combination of institutional investors, decentralized applications, and exchange platforms playing a role in its network. It highlights various entities’ growing interest and participation in Ethereum’s ecosystem and its potential as a leading blockchain platform.\n\nVitalik Buterin\n\nVitalik Buterin, the brilliant mind behind Ethereum, holds a prominent position in the cryptocurrency community. As one of the co-founders of Ethereum, Buterin has played a pivotal role in shaping the platform’s vision and development. While Buterin’s influence extends far beyond his personal ETH holdings, exploring his involvement in Ethereum’s ownership landscape is still interesting.\n\nIn October 2018, Buterin took a bold step by publicly disclosing his personal ETH wallet address via Twitter, inviting transparency and scrutiny into his holdings. This address (tagged Vb) currently holds just 55.58 ETH, valued at around $109k. Buterin moved over 325,000 ETH into a new contract (Vb3). The contract has about 244,000 ETH, valued at about $479 million. Another of his wallets, ‘Vitalik.eth’, holds 4,119 ETH, valued at around $8 million.\n\nIt is worth noting that Buterin has made significant contributions to the Ethereum community by championing the platform’s development, promoting decentralization, and advocating for innovative use cases. In addition, Buterin has demonstrated his commitment to the broader crypto ecosystem by actively engaging in philanthropic endeavors. He donated over 16,000 ETH to charitable causes, alongside various meme coins, which amounted to a donation worth over $1 billion. The contributions exemplify his dedication to the positive impact that cryptocurrencies can have on society.\n\nWhile Buterin may not be at the top of the list regarding ETH holdings, his influence, and contributions to Ethereum’s success cannot be understated. His vision and technical expertise have propelled Ethereum to become a leading blockchain platform, fostering innovation and attracting a vibrant community of developers and entrepreneurs.\n\nPrivate User\n\nExamining the top 5 addresses on Etherscan reveals an interesting observation. Among them, one private address stands out, sparking speculation that it may belong to Joseph Lubin, the co-founder of Ethereum and the Ethereum software company ConsenSys. This private address holds a significant amount of 1,493,000 ETH. It would position him as the most significant ETH holder if it is associated with Lubin.\n\nLubin has chosen not to reveal the exact quantity of ETH he holds. Previous estimates by Forbes from 2018 suggested that Lubin’s ETH ownership could range between 5% and 10% of the total circulating supply at that time. Joseph Lubin’s contributions to the early development and growth of Ethereum have been instrumental in establishing it as a decentralized platform capable of executing smart contracts.\n\nEth2 Deposit Contract: The Largest ETH Holder\n\nWithin the Ethereum ecosystem, one entity stands out as the largest holder of ETH—the Eth2 Deposit Contract. While it may not represent an individual or a traditional entity in the typical sense, its position is the primary staking contract for Ethereum’s Proof of Stake protocol.\n\nETH holders stake their tokens in the Eth2 Deposit Contract, participating in the PoS consensus and supporting the network’s operations.\n\nAt the time of the provided information, the Eth2 Deposit Contract holds a substantial balance of 25.97 million ETH, valued at approximately $50 billion. It represents 21.6% of the total ETH supply and underscores the importance of staking Ethereum.\n\nIt’s important to note that the Eth2 Deposit Contract is a smart contract address not owned or controlled by a single individual or entity. Instead, it serves as a mechanism for users to lock their ETH as collateral and participate in the PoS consensus. The funds in the contract are intended to be returned to the users once they unstake their tokens.\n\nThe significance of the Eth2 Deposit Contract’s ETH holdings goes beyond its sheer quantity. As a key component of Ethereum’s transition to PoS, it represents ETH holders’ collective participation and commitment to the network’s evolution. Users actively contribute to the network’s security by staking their tokens and earning rewards for their involvement.\n\nWrapped Ether (WETH): Enabling Usability on Ethereum-based DApps\n\nEthereum, with its native cryptocurrency ETH, revolutionized the blockchain landscape by enabling the execution of smart contracts. However, the standard form of ETH, known as Ether, does not conform to the ERC-20 standard. This lack of compatibility with ERC-20-based DApps limited its direct use and integration within the Ethereum ecosystem.\n\nWETH is an ERC-20 token that represents a 1:1 representation of ETH. It bridges the native ETH and ERC-20-compliant tokens, allowing users to interact with a broader array of Ethereum-based DApps seamlessly. Wrapping ETH involves locking a specific amount of ETH in a smart contract and minting an equivalent amount of WETH. This WETH can be freely transferred and traded on decentralized exchanges (DEXs) and other platforms supporting ERC-20 tokens. When users want to convert their WETH back into ETH, they can simply “unwrap” it by redeeming their WETH for the corresponding amount of ETH held in the smart contract.\n\nThe WETH smart contract is the second largest holder of ETH. The contract holds 3 million ETH, worth about $6 billion. The ETH constitutes about 2.8% of the total ETH in circulation. However, you should note that the exact figure constantly changes as users wrap and unwrap ETH.\n\nBinance and Other Centralized Exchanges (CEXs)\n\nCentralized exchanges (CEXs) play a significant role in facilitating the trading and storage of digital assets, including ETH. These platforms act as intermediaries, connecting buyers and sellers and providing liquidity for various cryptocurrencies, including Ethereum.\n\nWhile centralized exchanges provide convenience and liquidity, they operate under a centralized model, meaning users entrust their assets to the platform. This differs from decentralized exchanges, which allow users to retain control of their private keys and trade directly from their wallets. However, centralized exchanges often offer additional features, such as fiat on-ramps, advanced trading tools, and enhanced liquidity, making them a popular choice for many traders and investors.\n\nIt’s essential to exercise caution and consider factors such as security, reputation, and regulatory compliance when choosing a centralized exchange for trading and storing ETH. Researching and selecting reputable exchanges with a strong security and customer support track record can help mitigate potential risks associated with centralized custody.\n\nHere is a quick breakdown of the top CEX wallets holding ETH, as tagged on Etherscan at press time:\n\nPosition CEX Wallet Balance Percentage 3 Binance 7 1,996,008 1.66% 4 Kraken 13 1,598,923 1.33% 7 Binance 8 1,070,814 0.89% 8 Binance: Binance-Peg Tokens 589,999 0.49% 9 Bitfinex 19 450,118 0.37% 10 Bitfinex: MultiSig 3 428,053 0.36% 11 Gemini 3 409,498 0.34% 17 Bitfinex 20 275,000 0.23% 42 Bithumb 12 170,000 0.14% 47 Binance 28 159,998 0.13% 50 OKX 6 150,0000 0.12%\n\nHere are some other notable mentions in the top 50:\n\nArbitrum: Bridge\n\nThe Arbitrum ETH Bridge is a critical component of the Arbitrum network, a layer-2 scaling solution for Ethereum. It facilitates the seamless transfer of Ethereum (ETH) and ERC-20 tokens between the Ethereum mainnet and the Arbitrum network, enhancing scalability and reducing transaction costs.\n\nBuilt by Offchain Labs, Arbitrum utilizes Optimistic Rollup technology to process transactions off-chain, resulting in increased throughput and reduced congestion on the Ethereum mainnet. The Arbitrum ETH Bridge connects the mainnet and the Arbitrum network, allowing users to transfer their ETH and tokens between the two environments.\n\nUsing the Arbitrum ETH Bridge typically involves depositing ETH or ERC-20 tokens from the Ethereum mainnet onto the Arbitrum network. This transfer locks the assets on the mainnet while creating a corresponding representation on Arbitrum. Users can then utilize these assets within the Arbitrum network for various decentralized applications (DApps) and smart contracts, taking advantage of the improved scalability and lower fees Arbitrum provides.\n\nWhen users wish to move their assets back to the Ethereum mainnet, they can initiate a withdrawal from the Arbitrum network to the mainnet via the Arbitrum ETH Bridge. This process unlocks the assets on Arbitrum and transfers them back to the Ethereum mainnet, making them available for use in the Ethereum ecosystem.\n\nThis Arbitrum bridge contract holds 1.16 million ETH, worth about $2.27 billion. However, you should note that the exact figure constantly changes as users move ETH into and out of the Arbitrum contract.\n\nEthDev\n\nAn address tagged as “ETH DEV” from the Ethereum Foundation is among the top 20 Ethereum holders. It is essential to note that the Ethereum Foundation itself holds a significant amount of ETH due to its involvement in developing and promoting the Ethereum platform.\n\nThe Ethereum Foundation, the organization behind Ethereum, has accumulated ETH over the years through various means, such as fundraising events, grants, and contributions. These holdings support the ongoing development of the Ethereum ecosystem, fund projects, and ensure the platform’s long-term sustainability.\n\nThe EthDev wallet holds 318,272 ETH, worth about $622 million.\n\nHowever, it’s worth mentioning that the Ethereum network operates in a decentralized manner, and the ownership and distribution of Ether are not publicly disclosed for individual wallets or addresses.\n\nOther wallets identified on EtherScan with substantial ETH include:\n\nPolkadot: MultiSig with 306,276.63 ETH.\n\nzkSync Era: Diamond Proxy with 297,942.66 ETH.\n\nBitDao: Treasury with 264,946.63 ETH.\n\nCompound: cETH Token with 251,726.65 ETH.\n\nPolygon (Matic): Ether Bridge with 221,499.78 ETH\n\nLido: Curve Liquidity Farming Pool Contract with 213,857.51 ETH\n\nConclusion\n\nDetermining the exact ownership of the most Ether (ETH) can be challenging due to the decentralized nature of the Ethereum network. However, by examining various sources and available data, we can identify some prominent entities and individuals who hold significant amounts of ETH.\n\nThe ownership of ETH is diverse, involving a combination of entities such as development funds, decentralized finance protocols, early investors, individual holders, and exchanges. As Ethereum continues to evolve and gain prominence in the blockchain ecosystem, the distribution of ETH ownership may undergo further shifts.\n\nWith the dynamic cryptocurrency market, ETH’s ownership landscape will likely evolve as new entities and individuals participate in the Ethereum network."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDcvMDcvY3J5cHRvLWFuYWx5c2lzLXRyYWRlY3VydmUtcW50LXZzLWV0Yy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Crypto Analysis: Tradecurve, QNT Vs. ETC - The Cryptonomist",
        "content": "SPONSORED POST*\n\nCryptocurrencies began July with a reinvigorated bullish momentum, sparking interest from investors. Tradecurve (TCRV), Quant (QNT), and Ethereum Classic (ETC) are among the top digital assets that have captured the interest of investors. However, among these three leading altcoins, which would offer the better returns in the next bull market?\n\nHow High Can Quant (QNT) Go On This Uptrend?\n\nIn early 2023 when the cryptocurrency market was on a huge price bounce, Quant (QNT) recorded minimal gains. On the flip side, the second quarter losses hugely affected the price of Quant (QNT) as it lost more than 30% of its value. The losses of Quant (QNT) were a result of the Securities and Exchange Commission’s (SEC) classification as a security.\n\nHowever, Quant (QNT) appears to have shrugged off the SEC’s effect. With things changing, Quant (QNT) is now on a bull run. Over the last two weeks, the price of Quant (QNT) has increased by 13% to reach a high of $110. However, with cases like these usually drawn out like XRP’s case, experts are only fairly bullish about Quant (QNT) predicting a high of $120-$125 in the third quarter.\n\nCan Ethereum Classic (ETC) Continue Its Meteoric Rise\n\nSince the Ethereum migration when Ethereum Classic (ETC) received a hoard of miners, the crypto has been cast into the spotlight. Ethereum Classic (ETC) has been one of the top-performing cryptos, gaining 14% over the weekend. In the last two weeks, the price of Ethereum Classic (ETC) has increased by more than 50% – from under $14 to trading as high as $20.4 today.\n\nEthereum Classic (ETC) currently trades at $19.94, just above the $19.3 support level. Ethereum Classic (ETC) bulls would need to act at this price zone to force an uptrend. Unlike Quant (QNT), crypto analysts are more bullish about Ethereum Classic (ETC), largely because of the growth of the network. For the end of the year, analysts have predicted that Ethereum Classic (ETC) could trade between $29.19 to $43.79, representing a 50% – 125% price rise.\n\nTradecurve (TCRV) Jumps 80%, Onchain Metrics Point to More Gains\n\nTradecurve (TCRV) is another altcoin that caught the attention of investors in June. Last month, the price of Tradecurve (TCRV) increased by a remarkable 80%, making it one of the best-performing cryptos. However, Tradecurve (TCRV) is still showing bullish signs and analysts predict that a 40% price rise could happen this week to send Tradecurve (TCRV) from $0.018 above $0.025.\n\nThe bullish sentiment of Tradecurve (TCRV) comes from it being a one-of-a-kind platform that could revamp the DeFi sector. Tradecurve (TCRV) is building a platform to give DeFi users access to trade assets from one of the biggest global markets – the OTC derivatives market valued at $632 trillion.\n\nThis will allow users to trade stocks, forex, commodities, options, ETFs, and others from a single account. It is this liquidity that makes experts bullish about Tradecurve (TCRV) predicting it could yield 50x returns by the end of 2023\n\nTo find more information about Tradecurve and the TCRV token, visit the links below:\n\nClick Here For the Website\n\nClick Here To Buy TCRV Presale Tokens\n\nFollow Us Twitter\n\nJoin Our Community on Telegram\n\n*This article was paid for Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL2V0aGVyZXVtLW5ldHdvcmstZXhwZXJpZW5jaW5nLXF1aWV0LXN1cmdlL9IBSWh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL2V0aGVyZXVtLW5ldHdvcmstZXhwZXJpZW5jaW5nLXF1aWV0LXN1cmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Network Experiences Quiet Surge In Growth Signals Potential Market Cap Boom - TronWeekly",
        "content": "Santiment, a renowned blockchain analytics firm, took to Twitter to highlight an intriguing observation regarding Ethereum’s network growth. According to their tweet, this growth has steadily increased, albeit with minimal fanfare.\n\n📈 #Ethereum's network growth has somewhat quietly been on the rise. New addresses are being created at an increased pace, which is a signal for eventual market cap growth. We'll monitor this #bullish divergence as $ETH ranges just below $1,900. https://t.co/TpiOUGgYGl pic.twitter.com/B0SrlrsrmB — Santiment (@santimentfeed) July 6, 2023\n\nNotably, a surge in the creation of new addresses has caught their attention, which they consider to be a promising sign of future market capitalization expansion.\n\nThis bullish divergence has piqued the interest of market observers who are closely monitoring Ethereum’s progress as it hovers just below the $1,900 mark.\n\nInterestingly, Ethereum’s price movement has been closely tied to that of Bitcoin in recent times. However, recent notable transactions suggest that Ethereum may soon break away from this correlation and establish its independent trajectory.\n\nWhale Alert, a platform that tracks large cryptocurrency transactions, reported a substantial transfer of 25,264 ETH, valued at approximately $48 million. The funds were moved from an undisclosed wallet to Coinbase, a leading cryptocurrency exchange.\n\nWhile such significant transfers can sometimes signal an impending uptrend, they can also introduce short-term volatility into the market. These movements often serve as indicators of possible changes in price sentiment.\n\nIt is worth noting that alongside the aforementioned transfer, another substantial transaction involving 30,000 ETH was also recorded. This sizable amount was transferred from an anonymous wallet, adding further intrigue to the unfolding Ethereum landscape.\n\nEthereum Price Analysis\n\nAccording to the latest data from CoinMarketcap, ETH is currently trading at $1,853.13, with a decline in both daily and weekly charts. As per the data, in 24 hours, the coin decreased by 3%, while in the seven-day chart, there was a 2.70% decline.\n\nSource: CoinMarketcap\n\nDue to various factors, ETH’s price rally was halted after reaching the $1,970 level on July 3. These include the possibility of more interest rate hikes and stricter regulations in the cryptocurrency market.\n\nThe Ethereum network also experienced withdrawals from its smart contract applications, which affected the June rally. Investors are now questioning whether the demand for a Bitcoin exchange-traded fund has diminished, potentially leading to a correction in ETH’s price.\n\nRegulatory developments, such as the European Union’s Data Act and Binance Australia’s derivatives business investigation, have contributed to the challenging environment.\n\nThe Ethereum network’s total value locked (TVL) has decreased, indicating a decline in investor interest or a shift to layer-2 alternatives.\n\nSource: DefiLlama\n\nProfessional traders have increased their leveraged long positions in Ether futures, but other indicators suggest a balanced demand for call-and-put options. Overall, these factors present significant obstacles for Ethereum bulls in breaking the $1,970 resistance level.\n\nRelated Reading | Bitcoin: BlackRock’s Fink Addresses Crypto Benefits"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDcvMDcvbWV0YW1hc2stZXRoZXJldW0td2FsbGV0LWNoYW5nZXMtbG9vay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "MetaMask: Ethereum wallet changes its look - The Cryptonomist",
        "content": "MetaMask, the most popular Ethereum software wallet, has changed its look by updating its user interface following some negative feedback from the community.\n\nThe extension now becomes cleaner and tidier, able to cope with the demands of the web3 audience.\n\nLet’s look at all the details together.\n\nEthereum software wallet: MetaMask extension updates user interface\n\nMetaMask, the software wallet for Ethereum developed by the company Consensys, announced yesterday that it has made some changes to its user interface in order to meet the needs of its community.\n\n🦊MetaMask v10.33 is here!\n\n\n\nWith a cleaner layout, more intuitive site connections, network and account selection, foxing with web3 got easier. Your feedback inspired us to improve, enabling a simpler web3 journey.\n\n\n\nWe hope you enjoy it!\n\n🔗https://t.co/tW2nucHkzs pic.twitter.com/g0JsZSLybX — MetaMask 🦊🫰 (@MetaMask) July 6, 2023\n\nIn version 10.33, the fox mask has swapped the sorting of some features, effectively changing its look by making it sharper and neater.\n\nFirst, information about account name, connection status, and network selection have all been included within a single top row, reducing the visual noise previously experienced by users.\n\nNow everything you need to operate in DeFi is at your fingertips in the top area of the extension.\n\nConnection status in particular is now more apparent, so you can more easily manage access with the various dApps and know in real time what you are about to connect to.\n\nA common “problem” with the previous version of the MetaMask Ethereum wallet was that the global menu navigation was embedded with the account selection and was confusing to a large part of the community.\n\nInstead, now the account avatar is placed next to the name so that you have a clear visual association with your identity.\n\nIn addition, with the new update the problem of “token-network” matching has been solved: when, for example, logging into the Avalanche network, instead of the token “AVAX” it would still read “ETH,” which was quite confusing for newbies.\n\nInstead, now each network is correctly associated with its respective token.\n\nOne final adjustment to the user interface of the Ethereum wallet concerns the “portfolio” entry, now added directly to the main MetaMask dashboard.\n\nThe hope is that with this update Consensys may have simplified the user experience of its flagship product, prompting positive feedback and consequently increasing the number of downloads to the extension.\n\nHardware wallet vs software wallet\n\nDespite the updated user interface of MetaMask, the main Ethereum wallet, the ongoing debate between those who prefer software version crypto wallets and those who prefer hardware wallets remains alive.\n\nIndeed, MetaMask, as a downloadable extension for Chrome, Ios and Android, suffers from all the security issues related to software wallets.\n\nIn particular, when MetaMask is downloaded (as well as all software wallets), the private keys of the account are kept internally in the device (the computer) on which the installation takes place, in a folder that can easily fall victim to hack attacks.\n\nThere are many cases where users have experienced breaches of their wallet with associated loss of all funds, typically due to a malware attack.\n\nEven if you download a good antivirus and take all the precautions in the world, you need to be aware that this vulnerability unfortunately cannot be fixed.\n\nA different matter applies to hardware wallets such as Ledger, Trezor, Bitbox and Coldcard where the private key storage is within the device itself (the flash drive to be clear).\n\nBy using these wallets in offline mode and removing the hardware every time we have finished our transactions, it will be much more difficult (if not impossible) to be robbed by malicious parties.\n\nObviously, this type of wallet is more complex than the software wallets: for a user who performs dozens of transactions a day, it might be more inconvenient as there is trivially a pin to enter to approve any transaction.\n\nThere is also to consider that the device has to be guarded away from the seed phrase, as if a thief happens to come in and take away both the hardware and the seed, we can kiss our cryptocurrencies goodbye.\n\nSame goes for natural disasters such as fires, floods, and earthquakes: if you lose both components at the same time, you are screwed.\n\nIn any case, assuming that the custody of the device and the seed phrase is done properly, we can conclude that the hardware versions turn out to be significantly more secure than their software counterparts.\n\nAs much as software wallets for Ethereum, such as MetaMask, may be extremely more “convenient” and straightforward for those beginning to approach the DeFi world, the hardware versions are definitely the most tamper-proof.\n\nHowever, we can take advantage of the convenience of operating via MetaMask with the security of hardware wallets by simply connecting one’s device to the extension."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNy8wNy9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1hcHBsYXVkcy1iaXRjb2luLW9yZGluYWxzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Co-founder Vitalik Buterin Applauds Bitcoin Ordinals - The Coin Republic",
        "content": "Vitalik Buterin, during a July 7, 2023, Twitter Space, spoke about Bitcoin Ordinals stating it brought back the ‘builder culture’ back. The Ethereum co-founder was speaking with Bitcoin proponent Eric Wall and Udi Wertheimer and praised the new developments in the Bitcoin blockchain.\n\nVitalik Buterin Praises Bitcoin Ordinals\n\nThe Ethereum co-founder thinks that since the inception of Bitcoin Ordinals, there has been a revival of the builder culture over the network. He also praised the new BRC-20 token standard. Buterin sees the new standard as rejecting political stagnancy in the Bitcoin ecosystem.\n\nEver since the Ordinals arrived, argued Buterin, the builder culture responsible for exciting developments and innovations is back on the network. Furthermore, he said “there’s real pushback to the laser-eye movement, which is good.” The conversation with the host lasted a couple of hours and was primarily centered around scalability issues.\n\nWall argued that the praised Bitcoin’s Lightning network, which facilitates faster transactions, cannot be scaled up for future users. Also, the system fails frequently even when a medium-sized payment is being processed. Unless these issues could be adequately addressed, achieving scalability would be different.\n\nIn response, the Ethereum co-founder suggested an approach; he said the best practice would be to emphasize implementing different types of layer-2 solutions. Also, the network should try to make Bitcoin’s base layer more efficient.\n\n“I think focusing on rollups is good, and so is being open to ZK-snark-based solutions.” – Buterin.\n\nAnother host, Wertheimer, suggested that introducing zero-knowledge rollups would inadvertently create stimulating side effects for the blockchain. Continuing Buterin’s suggestion, he said adopting rollups for Bitcoin could lead to an execution environment that could be used to test smart contracts.\n\nWall and Wertheimer have been key figures behind the Taproot Wizards, Ordinal project. They are outspoken exponents of Ordinals and are known to frequently advocate building increased functionality on top of the Bitcoin network.\n\nFundamental Bitcoinists, on many occasions, have criticized their stance. They have argued that including Non-Fungible Tokens (NFTs) and smart contracts on the network could deviate the network from its primary function– a peer-to-peer (P2P) cash network.\n\nSamson Mow, Jan3 CEO, believes Ordinals waste the block space in the blockchain, which could otherwise be used as a dedicated space for Bitcoin payment. Wall is aware of the critics and explained that Bitcoin could be a proof system for zero-knowledge proofs, and how this scenario shall avoid network congestion.\n\nFurther in the interview, Wall argued the Bitcoin community has always tried to do things similar to a decentralized finance ecosystem. But most members wanted the Bitcoin base layer to act as “sort of a judge or an arbiter of that computation and not have to run the computation on-chain.”\n\nThese 2 laser-eye clowns have been running blockstream into the ground for the last decade\n\n\n\nIn 10 years that company couldn’t come up with a single successful product\n\n\n\nTheir joke of a blockchain processes 3 txs a day\n\n\n\nAnd they think they have nothing to learn from ethereum pic.twitter.com/mp7we9Lvxq — Udi Wertheimer (@udiWertheimer) July 6, 2023\n\nThe discussion between the greats of the crypto community sparked a new controversy in the Bitcoin community where Wertheimer criticized Mow and Adam Beck, the CEO of Blockstream, for being unenthusiastic about the outcomes of the conversation with Buterin.\n\nBitcoin Ordinals inscriptions, which were launched in 2023, have garnered much interest from the community. Also, the 2021’s Taproot upgrade has become a turning point as it provided more utilities to the Bitcoin blockchain. The BRC-20 token standard, often referred to as being similar to Ethereum’s ERC-20 token standard, brought in the capabilities for fungible tokens on the blockchain."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbmNoYXB0ZXIuY29tL3VuaXN3YXAtdW5pLXY0LWxhdW5jaC1kZXBlbmRlbnQtb24tZXRoZXJldW1zLWV0aC1jYW5jdW4tdXBncmFkZS_SAVxodHRwczovL2NvaW5jaGFwdGVyLmNvbS91bmlzd2FwLXVuaS12NC1sYXVuY2gtZGVwZW5kZW50LW9uLWV0aGVyZXVtcy1ldGgtY2FuY3VuLXVwZ3JhZGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Uniswap (UNI) V4 Launch Dependent on Ethereum’s (ETH) Cancun Upgrade - CoinChapter",
        "content": "Key Takeaways:\n\nDecentralized exchanges (DEX) Uniswap plans to launch its much-awaited V4 version\n\nHowever, the launch will come only after Ethereum (ETH) completes its Cancun upgrade\n\nAccording to reports, the ETH Cancun upgrade is due at the end of September\n\nUniswap (UNI) will launch its V4 version after Ethereum’s Cancun upgrade\n\nYEREVAN (CoinChapter.com) — Uniswap (UNI), one of the leading decentralized exchanges (DEX), eagerly awaits the implementation of the Cancun-Deneb (Dencun) upgrade on the Ethereum (ETH) blockchain to launch its highly anticipated version 4 (V4).\n\nUniswap V4 aims to enhance user experience, provide advanced features, and address existing limitations. However, according to Erin Koen, head of the Governance Lead at the Uniswap Foundation, its successful launch hinges on the timely deployment of the Cancun upgrade.\n\nThe current version of Uniswap, V3, has gained significant popularity. It offered unique features such as concentrated liquidity and the ability to provide greater capital efficiency for liquidity providers. It also focused on maximizing capital efficiency compared to the previous V2 version.\n\nNevertheless, the Uniswap team envisions even more powerful capabilities with the upcoming V4 release.\n\nBesides, after the completion of the Cancun upgrade, another crucial step in the process is to conduct a thorough security audit. This stage holds significant importance as it serves to evaluate and ensure the robustness and security of the new protocol.\n\nAccording to The Block, which cited Koen, Uniswap will not rush through the audit to ensure that the integrity and security of its ecosystem are not compromised.\n\nUniswap v4 a massive upgrade\n\nThe launch of Uniswap v4 will come as a huge upgrade to the largest decentralized exchange protocol for Ethereum. It boasts of a total value locked (TVL) of around $4 billion, according to DefiLlama.\n\nUniswap v4’s draft code went live on June 13, ushering in a new era for the DEx protocol. This transition is centered around the implementation of “hooks,” which are smart contracts that allow customization of how pools, swaps, fees, and LP positions interact in Uniswap v4. These include options for fees, on-chain limit orders, and personalized on-chain oracles.\n\n“Uniswap v4’s architecture reduces costs and ensures efficiency. It introduces a new “singleton” contract, where all pools live within a single smart contract. We believe the combination of hooks and singleton architecture creates an incredibly powerful platform ⸺ fast, safe pool customization and efficient routing across many pools,” the company announced in a blog post last month.\n\nThe upgrade also introduces an innovative “flash accounting” system that aims to reduce fees for liquidity providers. Unlike the v3 model, which involved transferring assets in and out of pools after each swap, the v4 model will only transfer net balances, developers have clarified.\n\nThis adjustment ensures a more efficient and streamlined approach to managing liquidity within the protocol.\n\nSince news of the upgrade hit the newsstands, investors have been waiting to see how it will impact the UNI token price. The UNI is the native cryptocurrency of the Uniswap ecosystem.\n\nLast month, after Uniswap v4’s draft code went live, Wintermute Trading accumulated over $4 million worth of UNI tokens.\n\nA large crypto whale has accumulated over $4 million worth of UNI tokens\n\nThis development led many to speculate that the upgrade will send the UNI price soaring. At the time of writing, the UNI coin price in the market is around $5.5. This is still significantly down from its all-time high of nearly $50 in May 2021.\n\nEthereum Cancun upgrade coming in September\n\nThe Ethereum Cancun upgrade is due at the end of September 2023. This development comes months after Ethereum (ETH) network completed its Shanghai upgrade earlier this year.\n\nThe upcoming upgrade will improve the scalability, security, and usability of the Ethereum network. To achieve this, it will implement several improvements, including the introduction of Proto-Danksharding to the network.\n\nPéter Szilágyi, an Ethereum core developer, has emphasized the significance of Proto-Danksharding, stating that it should be the central focus of the upgrade.\n\nAccording to the company, Proto-Danksharding serves as an intermediary upgrade aimed at scaling rollups on the Ethereum network. It comes as a crucial step towards enhancing Ethereum’s scalability and transaction speed.\n\nIn addition, the Ethereum Cancun upgrade is likely to incorporate several other Ethereum Improvement Proposals (EIPs). These may include EIPs 4758, 6046, and 6190, which involve the removal of the SELFDESTRUCT function, along with EIP-663, which allows for unlimited SWAP and DUP instructions.\n\nThe much-awaited upgrade may also introduce other potential features, such as EIP-5920, which relates to the PAY opcode, and EIP-1153, which introduces the concept of transient storage.\n\nWill the Cancun upgrade impact Ethereum (ETH) price?\n\nEthereum (ETH) remains the second-largest cryptocurrency after Bitcoin (BTC), with a market cap of over $220 billion. At the peak of the crypto rally in late 2021, its price surged significantly to reach an all-time high (ATH) of $4,891. At the time, Bitcoin also peaked at more than $68,000.\n\nBut then immediately came the downdraft. Inflation rates went up, creating FUD among investors amid speculations that the Federal Reserve would hike borrowing costs in 2022. As a result, traders drifted away from cryptos to safer, traditional assets.\n\nBitcoin, Ethereum, and a host of leading tokens tanked, sending the crypto market into an overall slump.\n\nSince January this year, ETH has made slight gains, adding over 50% to its price. However, it remains well below its peak of November 2021.\n\nWhile writing, ETH exchanges hands at $1,860, according to CoinMarketCap.\n\nEthereum (ETH) price has tanked since November 2021, except for a slight surge in April last year. Graph Credit: CoinMarketCap\n\nMeanwhile, although it is impossible to ascertain, the Cancun upgrade has the potential to serve as a significant catalyst for Ethereum’s price. By improving the scalability, security, and usability of the network, the upgrade may attract a larger user and developer base to the Ethereum ecosystem.\n\nIt is typical for network upgrades to reflect positively on the token’s price. Long-term investors will be looking to see if they can regain their losses, while more recent ones will hope to make quick short-term profits."
    }
]