[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tY2FuY3VuLXVwZ3JhZGUtZXhwbGFpbmVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Cancun Upgrade Explained - Watcher Guru",
        "content": "The Ethereum network has made the switch from proof-of-work mining to proof-of-stake mining. The transition was completed successfully on September 15, 2022. Additionally, the blockchain went through some major changes as validators replaced miners.\n\nRecently, the much-awaited Shapella upgrade went live, allowing these speakers to withdraw their staked Ethereum 2.0. Additionally, with numerous developments on the Ethereum blockchain, let us learn about ETH a bit more.\n\nAlso read: How to Get a New Bitcoin Address on Cash App?\n\nEthereum in a nutshell\n\nVitalik Buterin built the decentralized blockchain platform Ethereum in 2015, along with the Ethereum Foundation, to support the development and execution of smart contracts and decentralized applications (dApps). Additionally, it has developed to become one of the biggest and most popular cryptocurrencies in the world. Ethereum is distinguished from Bitcoin by its programmability.\n\nThe blockchain has grown to accommodate a wide range of applications. Developers on the ETH network can design decentralized applications by using smart contracts, which are self-executing contracts with predefined rules. Additionally, over time, ETH has grown to be the second-largest cryptocurrency in the world.\n\nAlso read: How to Add MidJourney to my Discord Server?\n\nSource: CNN\n\nEthereum Cancun upgrade explained\n\nThe upcoming Cancun upgrade for the Ethereum blockchain represents a major milestone focused on boosting scalability and security.\n\nAlso dubbed the “Dencun” upgrade, Cancun will introduce 5 Ethereum Improvement Proposals (EIPs) designed to increase network throughput and reduce transaction costs.\n\nAt its core, Cancun looks to improve the network’s transactions per second (TPS) to support more usage while retaining decentralization. This aligns with the “Surge” phase of Ethereum’s phased roadmap.\n\nKey changes include EIP-4844 which enhances data availability across Ethereum shards to scale the network. EIP-1153 aims to lower data storage costs to optimize block space usage.\n\nAdditionally, EIP-4788 exposes Beacon chain data to execution layers to strengthen bridges, while EIP-5656 adds a new memory copying instruction to enable more efficient data structures.\n\nAlso read: Will ETH Go Up?\n\nRounding out the upgrades, EIP-6780 alters the SELFDESTRUCT function to limit potential smart contract disruptions.\n\nIn total, the Cancun EIPs constitute foundational improvements to Ethereum’s technical capabilities and security primitives. Researchers tentatively target full implementation in October 2023.\n\nBy boosting throughput and reducing the viability of attacks, the upgrade promises to make the network an even more attractive ecosystem for developers and users over the long term."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5yaWFpbnRlbC5jb20vYXJ0aWNsZS8yYzl6dmY1M2QxamhuZmI4bzYzbmsvaW52ZXN0bWVudHMvZnV0dXJlcy1ldGZzLXRpZWQtdG8tZXRoZXJldW0taGl0LXRoZS11LXMtbWFya2V0LWZvci10aGUtZmlyc3QtdGltZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Futures ETFs Tied to Ethereum Hit the U.S. Market for the First Time - RIAIntel.com",
        "content": "This week, investment managers Bitwise, Proshares, and VanEck all separately launched six futures-based ETFs, the first in the U.S., tied to ethereum, the world’s second most popular cryptocurrency. Grayscale Investments also asked the Securities and Exchange Commission to let it convert the Grayscale Ethereum Trust, the largest ethereum investment product in the world, to a spot ether ETF. The product has $5 billion in assets under management.\n\nThe launches come as the SEC continues to deliberate on the future of a spot bitcoin ETF. Over the last few years, the SEC has denied more than 30 spot bitcoin applications. The SEC also filed lawsuits against Coinbase and Binance, two of the world’s largest crypto exchanges, this year.\n\nEven though the regulatory uncertainty has caused many advisors to stay away from crypto, investment vehicles like ETFs can provide a more secure and compliant way for advisors to gain exposure to bitcoin and Ethereum on behalf of their clients.\n\n“What these ETFs do is they take those features and package them up into a ticker that’s accessible to everyday investors, to financial advisors in a brokerage account,” said Matt Hougan, CIO of Bitwise, during a webinar on Tuesday hosted by the Digital Assets Council of Financial Professionals. “Large institutional investors are not going to pull out their phone and download an app and put a billion dollars to work. They’re going to work in a regulated market.”\n\n[Like this article? Subscribe to RIA Intel’s’ thrice-weekly newsletter.]\n\nBitcoin and Ethereum are the only two cryptocurrencies that the SEC has specifically said were not a security.\n\nLast year, a record $3.82 billion was lost to investment fraud, the bulk of which is tied to cryptocurrency-related scams, including the collapse of FTX and other high-profile crypto exchanges. Of that amount, $2.57 billion was lost specifically to cryptocurrency investment scams last year, according to an analysis done by investment fraud law firm Carlson Law.\n\n“In the past, you really only had two options when you bought digital assets: either you left them on an exchange or custodian, taking counterparty risk, or you sent them to an offline wallet and self-custodied them,” Kyle DaCruz, director of digital asset products at VanEck said. “As we’ve seen over the last year, the space is still new and developing. And as with the blow-ups with FTX, perhaps if investors have the opportunity to get exposure to these assets through an ETF or ETF wrapper, they would not have maybe left as much on the exchanges.”\n\nTrading volume of the new ETFs remained relatively low with less than $2 million in trading volumes across the six funds on the first day. Bloomberg analyst Eric Balchunas said on X, formerly known as Twitter, that Monday’s trading volumes were underwhelming but average for a normal ETF launch. In comparison, the first Bitcoin futures ETF was one of the most-traded ETF debuts, with $984 million in volume and $570 million in assets."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1wbHVuZ2VzLXRvLTE2MDAv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXBsdW5nZXMtdG8tMTYwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Price Plunges to $1,600: Can Bulls Save the Day? - NewsBTC",
        "content": "Ethereum price trimmed all gains and revisited $1,580 against the US dollar. ETH could continue to move down if it settles below the $1,600 support.\n\nEthereum started a fresh decline below the $1,650 support.\n\nThe price is trading below $1,665 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $1,645 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could start a fresh increase if it clears the $1,650 and $1,665 resistance levels.\n\nEthereum Price Revisits Support\n\nEthereum’s price failed to stay above the $1,665 level and moved into a bearish zone. ETH extended its decline below the $1,650 level, like Bitcoin.\n\nThe decline was such that the price even spiked below the $1,600 on Kraken. The price retested the key support at $1,585. A low was formed near $1,585 and the price is now attempting a fresh increase. There was a move above the $1,620 level.\n\nEther climbed above the 23.6% Fib retracement level of the downward move from the $1,743 swing high to the $1,585 low. Ethereum is now trading below $1,665 and the 100-hourly Simple Moving Average.\n\nOn the upside, the price might face resistance near the $1,650 level. There is also a key bearish trend line forming with resistance near $1,645 on the hourly chart of ETH/USD. The next major resistance is $1,665 and the 100-hourly Simple Moving Average.\n\nSource: ETHUSD on TradingView.com\n\nThe 50% Fib retracement level of the downward move from the $1,743 swing high to the $1,585 low is also near the $1,665 level. A clear move above the $1,665 resistance zone could set the pace for a fresh increase. In the stated case, the price could visit the $1,700 resistance. The next key resistance might be $1,750. Any more gains might open the doors for a move toward $1,820.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,665 resistance, it could continue to move down. Initial support on the downside is near the $1,620 level. The next key support is $1,600.\n\nA downside break below the $1,600 support might start another strong bearish wave. In the stated case, the price could even trade below the $1,585 level. In the stated case, Ether could visit the $1,540 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,600\n\nMajor Resistance Level – $1,665\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3ZpdGFsaWstY29uc2lkZXJzLWltcGxpY2F0aW9ucy1vZi1hZGRpbmctemstZXZtLW90aGVyLWZlYXR1cmVzLXRvLWV0aGVyZXVtLW1haW5uZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Vitalik considers implications of adding ZK-EVM, other features to Ethereum mainnet - CryptoSlate",
        "content": "Ethereum founder Vitalik Buterin recently wrote an in-depth blog post exploring the question of which features should become official parts of the Ethereum protocol versus being built on top of it. This has been an ongoing debate as the network evolves.\n\nIn the early days, Buterin explains, Ethereum strove to keep its base layer as simple and minimalist as possible. This aligned with the Unix philosophy of creating uncomplicated, flexible software. The goal was for Ethereum to provide a solid foundation for decentralized applications, with most functionality implemented through smart contracts built on top.\n\nOver time, however, some have questioned whether more features should be directly enshrined in the core protocol. But what does “enshrining” mean? Buterin defines it as making something intrinsic to the official Ethereum specification that client developers must implement. The alternative, “de-enshrining,” means removing a feature from the base layer and pushing it out to be handled by smart contracts instead.\n\nPros and Cons of Enshrining Features\n\nButerin analyzes the pros and cons of enshrining several potential features. Enshrining can provide efficiency gains, more robust security, and censorship resistance. But it also risks making transactions more expensive, over-complicating governance, and reducing flexibility to meet unanticipated user needs down the road.\n\nButerin uses account abstraction as a case study to analyze this debate. Earlier proposals like EIP-86 tried to make transactions just simple VM calls, minimizing protocol complexity but increasing miner responsibilities. More recent proposals like ERC-4337 still start outside the protocol but may later enshrine components for efficiency and security.\n\nButerin explores enshrining several other potential features:\n\nZK-EVMs: Could improve efficiency and allow leveraging Ethereum’s governance to manage bugs, but challenges around supporting diverse ZK technologies remain.\n\nProposer-builder separation: Could reduce trust assumptions, but extra-protocol approaches already exist.\n\nPrivate mempools: No current encryption technology seems robust enough to enshrine, but valuable to build at the application layer.\n\nLiquid staking: Could reduce centralization risks and open more staking options, but challenges around governance remain.\n\nMore precompiles: This could improve efficiency, but risks over-complicating the protocol and low usage of past precompiles.\n\nEnshrining features can provide efficiency, security, and censorship resistance. But it can also over-extend the protocol’s governance and make it too rigid for unanticipated user needs.\n\nHow the community may be fractured on enshrining.\n\nWithin the Ethereum community, differing perspectives emerge on this question. Pragmatists may prioritize enshrining features that offer clear benefits to users today, even if complex to govern. In contrast, purists argue that radically minimizing the base layer preserves Ethereum’s vision as a decentralized application platform.\n\nBusinesses and institutions want features that support their use cases quickly enshrined, while decentralization advocates worry that risks unaccountable control by privileged groups. Developers desire expanded base layer functionality to ease app building, but security researchers warn enshrinement may lock in suboptimal technical choices.\n\nAs Buterin thoughtfully lays out, navigating these tradeoffs will only grow more complex as expectations of Ethereum diversify and scale. However, discussing core principles helps anchor the conversation as progress compels reassessment. The full blog post “Should Ethereum be okay with enshrining more things in the protocol?” is well worth the read.\n\nUltimately, Ethereum’s open “soft forking” process allows continued evolution based on emerging community priorities. Buterin’s post thus provides a valuable framework to weigh options and build alignment as Ethereum marches toward its ambitious vision."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzY0MjQ5Nzg2LTQ3ZTItNDlkYi05ODliLTg4NzAzMTdkNDViM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ether futures ETFs fizzle on US debut - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Exchange traded funds myFT Digest -- delivered directly to your inbox.\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nThe hotly anticipated rollout of exchange traded funds linked to ether, the world’s second-largest cryptocurrency, in the US has turned into a damp squib, with modest investor interest.\n\nNine ETFs holding futures contracts based on ether — the token of the Ethereum blockchain on which most “smart contracts” are written — debuted on the same day after regulators expedited the approval process to sidestep a potential US government shutdown, now averted.\n\nHowever the funds saw combined trading volume of just $6.6mn on Monday, according to data from AB Bernstein. This was a pale shadow of the $1bn of assets that the ProShares Bitcoin Strategy ETF (BITO) garnered on its first two days of trading in October 2021 when it became the first US ETF trading in futures contracts linked to bitcoin, the largest cryptocurrency.\n\n“The ether futures ETFs opened to a rather tame start on Monday. Total trading volume was $6.6mn which was a disappointing start,” said Gautam Chhugani, senior analyst, global digital assets at Bernstein, who believed media attention was focused on the impending trial of FTX founder Sam Bankman-Fried in New York.\n\nChhugani believed the lacklustre launch was “not surprising, given the continued weak retail sentiment” towards cryptocurrencies, whereas BITO launched at the peak of a digital bull market.\n\n“Like any listed security, success or failure cannot be measured on the first days of trading with market sentiment and the macro environment all having a bearing on performance,” said Bradley Duke, chief strategist at ETC Group, a provider of crypto exchange traded products.\n\nDespite rallying 10 per cent last week in anticipation of the wave of launches, the price of ether is still down 64 per cent from its peak in November 2021.\n\nIt fell 4 per cent to $1,663 on Monday as the launches underwhelmed — although as the ETFs are futures products, rather than investing in the “physical” spot cryptocurrency, purchases do not have any direct impact on the price.\n\nBitcoin is also down by 57 per cent from the highs it briefly touched in November 2021 as cryptocurrencies have proved to be procyclical “high beta” assets.\n\nThe bulk of the trading that did take place was in the pre-existing Valkyrie Bitcoin Strategy ETF (BTF), which changed its name to add “and Ether” on Tuesday, when it broadened out to incorporate both cryptocurrencies.\n\nBTF traded $4.6mn, according to Bernstein. The liveliest of the newly launched ETFs was the ProShares Ether Strategy ETF (EETH), which saw turnover of $879,000, ahead of the VanEck Ethereum Strategy ETF (EFUT), at $516,000.\n\nNevertheless, Chhugani argued that, if and when more retail investors do return to crypto there will be “wide availability of fair, secure and regulated products that help them attain crypto exposure without worrying about losing their savings from fraudulent exchanges”.\n\nDave Weisberger, chief executive and co-founder of CoinRoutes, an algorithmic trading platform for the digital asset industry, believed the funds would be popular with financial advisers, who cannot invest client money in crypto itself, but can do so via ETFs.\n\nEther is reasonably popular in Europe, where ETPs investing in both crypto futures and the physical spot currencies are permitted in many jurisdictions. The 13 pure ether ETPs available on the continent have combined assets of €1.1bn, according to data from TrackInsight, compared to €2.6bn in 20 bitcoin ETPs.\n\nOverall, ether has a market capitalisation of $200bn, compared to $535bn for bitcoin and $83bn for tether, the third-largest cryptocurrency.\n\nThe launches come as the US ETF industry remains barred from what is sees as the crown jewel of the crypto firmament — spot bitcoin funds.\n\nThe Securities and Exchange Commission has refused to allow the launch of spot bitcoin ETFs, citing fears of fraud and manipulation on the unregulated exchanges on which the digital tokens trade, concerns that it does not have about futures contracts listed on the Chicago Mercantile Exchange, a regulated venue.\n\nThe SEC has thus far maintained this stance despite losing a court case to crypto manager Grayscale, which sued over the regulator’s refusal to let it convert its $17.4bn Bitcoin Trust (GBTC), a private fund, into an ETF, in August.\n\nAfter that defeat, one school of thought was that the SEC might satisfy the court’s ruling — and equalise its treatment of spot and futures bitcoin ETFs — by retroactively axing BITO and its sister bitcoin futures ETFs.\n\nThe regulator’s willingness to allow ether futures ETFs would appear to have put that idea to bed.\n\nAlongside Grayscale, 10 other managers, including BlackRock, Fidelity, Ark Invest, WisdomTree, VanEck and Valkyrie, have outstanding filings in place to launch spot bitcoin ETFs.\n\nChhugani believed a “distinct shift” was now evident in the SEC’s stance towards crypto ETFs, with applicants “seeing a more engaged SEC being responsive, unlike the past”.\n\nHe believed the first such bitcoin ETFs would be approved sometime around early January.\n\nSpot ether ETFs may follow not long after, with Ark and VanEck among the groups to have filed to launch products. Grayscale has also filed to convert its existing $5bn Ethereum Trust (ETHE) into an ETF.\n\n“What is clear is that, like bitcoin, the listing of these ethereum futures ETFs is ultimately paving the way for a spot ethereum ETF in the US,” said Duke."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvZXRoZXJldW0tdXB0b2Jlci1ob2xkLWRlc3BpdGUtZXRoLWZ1dHVyZXMtbGF1bmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Uptober on Hold Despite ETH Futures Launch: Is $2000 Possible? - CCN.com",
        "content": "Key Takeaways\n\nETH ETF launch was unsuccessful as low trading volume\n\nPrice makes a downturn, decreasing by 6.7%.\n\nChart analysis shows bearish signs.\n\nOn Monday, September 2, three U.S. investment firms, ProShares, VanEck, and Bitwise Asset Management, introduced futures-based ETFs linked to Ether, the world’s second most valuable cryptocurrency. These six newly launched funds offered investors their first opportunity to invest in Ether-based exchange-traded products.\n\nHowever, the launch of these ETFs didn’t seem to generate significant investor interest, and the ETH spot price has declined by 6.77% since then. While these ETH futures ETFs were expected to fuel a substantial price increase, they instead had a negative impact on the price.\n\nNevertheless, ETH has been in an uptrend since September 11. So, was this decline just a minor setback with $2,000 in its sights, or is it an early indicator that it lacks the strength to sustain its upward trajectory?\n\nETH Futures ETF’s botch\n\nOn the debut day, the combined trading volumes of these ETFs reached $1.92 million. Notably, the ProShares Ether Strategy ETF had the highest trading volume at $878,560, according to data from LSEG .\n\nIn an informative X thread , Vetle Lunde, a Senior Analyst at K33Research, shared some statistics about the underwhelming launch day for futures-based ETH ETFs.\n\nHe focused on trading volumes and made comparisons with similar product launches, particularly BITI and BITO, which are ProShares Bitcoin ETF products.\n\nIn his initial chart, he highlighted that ProShares dominated the trading volume, accounting for the majority of the first-day trading volume, which totaled $1.96 million across EETH (Ether Strategy ETF) and BETE (Bitcoin & Ether Equal Weight Strategy ETF). VanEck’s EFUT, which launched slightly ahead of its competitors, followed suit.\n\nIn his following chart, Vetle Lunde compared the day-one volumes of ETH ETFs with ProShares’ Bitcoin Future ETF products. The initial volumes for the ETH ETFs were considerably lower than those of BITO ($1.01B) and BITI ($7.21M) at their respective launches. The ETH ETFs’ day-one volumes represented only 0.19% of BITO’s launch volume and 27% of BITI’s launch volume.\n\nIn summary, he acknowledged the differences in market conditions during the BITO and BITI launches but still characterized the launch of ETH ETFs as uneventful.\n\nETH Price Analysis\n\nIn our previous analysis of ETH, we discussed the macro view, highlighting two potential scenarios. One possibility was that the price had initiated a new uptrend by breaking out from the descending resistance level.\n\nThe alternative scenario considered the increase from September 11 as a corrective move, suggesting that a new downturn might commence as the price faced rejection at the $1,760 resistance level.\n\nToday, we witnessed a 6.7% decline, measuring from yesterday’s high to today’s lowest point of $1,641. To support a potential move towards $2,000, the price needs to form a complete five-wave pattern starting from September 11.\n\nDespite briefly achieving a higher high yesterday, it faced a sharp rejection and is currently testing the September 18 high, which is considered to be the first wave of this pattern.\n\nCurrent Pattern May Be Invalid\n\nAccording to the Elliott Wave theory, it appears that the current pattern may be invalid. First, the assumed wave 3 fell slightly short of its optimum length, but it is still somewhat longer than wave 1, which adheres to Elliott Wave rules.\n\nWave 4 is typically a consolidative correction, often observed as a sideways movement and should not overlap with wave 2 territory. While it did produce a minor wick on the 4-hour chart, the candle close remained above wave 2. However, given that all three rules are currently stretched, it increasingly resembles a corrective move from September 11.\n\nThis could suggest that another downward trend has begun, with the price of ETH potentially heading below its September 11 low and below $1,500. The key determinant of the future outlook is how the price behaves around the $1,660 level. If it manages to stay above and starts moving upward, it could signal the start of an impulse wave.\n\nOn the other hand, if the descending move continues, it would indicate that sellers have regained control, potentially leading to a lower low.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vbWFya2V0cHVsc2UuY29tL25ld3NmZWVkL2V0aGVyZXVtLXVuYWJsZS10by1yYWxseS1hcy1uZXctZnV0dXJlLWV0ZnMtdm9sdW1lcy1kaXNhcHBvaW50L2Vtb3lh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum: Unable to rally as new future ETFs volumes disappoint - MarketPulse",
        "content": "Cryptos struggle as relentless Treasury selloff continues; 10-year yield rises 5.2bps to 4.731%\n\nProshares Ethereum ETF (EETH) traded only 21,000 shares\n\nVanEck’s Ethereum Strategy ETF (EFUT) traded only 29,000 shares\n\nOver the past several months the focus in the cryptoverse has been on whether the SEC will approve a spot Bitcoin ETF. Hampered by SEC delays, sentiment for cryptos have struggled immensely, especially given the chaos sparked by the bond market.\n\nSentiment could be improving given the SEC has just approved a handful of Ether futures ETFs. Bitcoin future ETFs already exist, but the SEC decision to give approval to Ethereum is somewhat news considering it has always been thought as a bigger risk to getting the security tag.\n\nEthereum posted a nice rally to start the week following the ETF launches done by Valkyrie, VanEck, Proshares, and Bitwise. The massive Ethereum ETF launch was to make sure everyone had a fair chance, which is what not happened a couple years ago for Bitcoin when BITO launched alone and dominated the ETF market share.\n\nEthereum Daily Chart\n\nEthereum’s Monday pump was faded on both disappointing ETF trading volumes and as prices quickly respected a confluence of resistance from the 50- and 200-day SMA. The death cross that formed at the end of August saw bearishness tentatively exhausted after making a low at $1531 on September 11th.\n\nEthereum could start attracting more interest once price closes above the $1810 level. Ethereum’s more diversified blockchain ecosystem has yet to trigger a gamechanger for the use-case argument for cryptos, but optimism remains that some of its products and offerings are driving the majority of the interest. If bearishness resumes, downside targets include $1510, which is the 50% retracement of the 2022 low to 2023 high move.\n\nContent is for general information purposes only. It is not investment advice or a solution to buy or sell securities. Opinions are the authors; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. If you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services, Inc., please access the RSS feed or contact us at info@marketpulse.com. Visit https://www.marketpulse.com/ to find out more about the beat of the global markets. © 2023 OANDA Business Information & Services Inc."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3QvZXRoZXJldW0tZnV0dXJlcy1ldGZzLWdldC1vZmYtdG8tZGlzYXBwb2ludGluZy1zdGFydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum futures ETFs get off to 'disappointing' start - DLNews",
        "content": "New Ethereum futures ETFs attracted less than $2 million in trading volume on day one.\n\nHalf VanEck’s Ethereum ETF’s trading volume came in the very first minute after its launch.\n\nThe volumes pale in comparison to the Bitcoin futures launch. ProShares’s BITO did $200 million inside 15 minutes on its launch.\n\nHappy Tuesday!\n\nSix Ethereum futures exchange-traded funds got off to a slow start after launching on Monday. The funds attracted just under $2 million in trading volume.\n\nLet’s dig in.\n\nETF(lop)\n\nInvestors have yet to warm to Ethereum futures ETFs.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nThe launch of six Ethereum futures ETFs in the US on Monday was “disappointing,” said K33 Research’s Vetle Lund.\n\nThe “shallow flows depict a hollow market and a deficient demand for Ethereum exposure,” he added.\n\nFutures ETFs trade on the future value of an asset whereas spot ETFs trade on the current value of an asset.\n\nSo far, no crypto spot ETFs have been approved by US regulators, but several big financial firms like BlackRock and Fidelity have applied to launch them.\n\nJoin the community to get our latest stories and updates\n\nProShares’s EETH and VanEck’s EFUT were the most popular Ethereum-only funds, respectively registering around $850,000 and $500,000 in trading volume.\n\nNearly 50% of EFUT’s volumes occurred during its first minute of trading, Lund said.\n\nETH ETF Launch Ethereum futures ETF day one trading volume ($) (TradingView/K33 Research)\n\nIn a similar fashion to Bitcoin futures ETFs, ProShares looks likely to lead the way when it comes to Ethereum.\n\nWhile Monday’s launch mirrored Bitcoin’s 2021 debut in that sense, it was entirely different when it comes to volume.\n\nBitcoin futures ETFs clocked up over $1 billion in trading volume in just two days — ProShares’s BITO did $200 million in the first 15 minutes.\n\nProShares’s BITO, which broke records, launched at the height of the bull market in 2021 — a “more opportune environment,” as Lund put it.\n\nBitcoin is also just more popular among, especially among those with a casual interest in cryptocurrency, said Bloomberg Intelligence ETF analyst Eric Balachunas.\n\nThe slow interest in the futures ETFs could be a prelude to price action.\n\nA futures ETF can result in synthetic trading activity without actually impacting spot supply, according to crypto market makers QCP Capital.\n\nBasically, traders are buying futures contracts, speculating on the price at a future date, and don’t have to hold Ethereum — unlike buying a spot product which holds the underlying asset and therefore effects spot supply.\n\n“We would even go further to say a futures-only ETF is arguably detrimental to spot price,” the QCP Capital said, adding that it “potentially directs demand away from the spot market into a synthetic market.”\n\nCrypto market movers\n\nBitcoin is back below $28,000 after it fell 2.3% in the last day. Volatility is expected to increase according to Coinbase and Bitfinex.\n\nEthereum was unaffected by the ETF launches on Monday, it dropped 3.8% in line with the broader crypto market.\n\nWhat we’re reading\n\nAdam Morgan McCarthy is DL News’ London-based Markets Correspondent. Got a tip? Reach out at adam@dlnews.com."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vZXRoZXJldW0tZnV0dXJlcy1ldGZzLXN0b3JtLXRoZS11cy1tYXJrZXQtYnV0LWluaXRpYWwtZW50aHVzaWFzbS1hcHBlYXJzLW11dGVkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Futures ETFs Storm the US Market, But Initial Enthusiasm Appears Muted - Securities.io",
        "content": "As Bitcoin surged past $28,000 on Monday to trade above its 200-day moving average, Ether also rallied to $1,740. However, since then, the prices have fallen as traders took profit, and the US 10-year yield spurged to its highest level in over 16 years.\n\nAt the time of writing, the second-largest cryptocurrency with a market cap of $198.4 billion has been trading at $1,649 while managing $12.45 bln in volume, which is up 9% from a day ago. Despite this, ETH's price has faced challenges recently.\n\nIn the past 24 hours, ETH's price has dropped by 4.7%. Not only against USD, but ETH's price is also down against BTC, currently sitting at 0.0601, down from its Nov. 2021 high of 0.081246. ETHBTC has actually been on a downtrend for the past year, when it was at 0.077 in late Oct. 2022.\n\nHowever, ETH's price in USD is still up about 38% in 2023 so far, with the crypto asset gaining 27.6% over the past year. That said, it has lost over 66% of its value since hitting an all-time high (ATH) at $4,880 in Nov. 2021.\n\nAs the bullish sentiment spreads across the broader market and the crypto fear and greed index turns neutral with a reading of 50/100, risk-tolerant investors are exiting their ETH positions. They are moving their coins into exchange-hosted wallets, potentially to sell. As per Cryptoquant data, the total ETH deposited in exchange wallets has risen to 14.70 million ETH, an increase from 14.57 million coins on Sept. 24.\n\nIf we take a look at Global In/Out of Money Around Price (GIOM) data, 3.3 million addresses bought 3.37 million Ethereum coins at an average price of $1,802, presenting a significant sell-wall at this level. Technically, ETH has an important resistance present at the $1,725 (Fib 0.382) level.\n\nOn the other hand, 7.26 million addresses had bought 14.92 million ETH coins at the minimum price of $1,535. So, if ETH moves downwards and loses its support level at $1,650, it can drop below the first $1,550 and then $1,500.\n\nMoreover, last week, around 2,500 ETH worth just over $4 million, tied to last year's exploit of the bankrupt crypto exchange FTX, started moving for the first time in nearly a year. Of these, 700 ETH were transferred using the Thorchain Router, and about 1,200 were moved through the privacy wallet Railgun, while another 550 were sitting in an intermediate wallet. Also, there is still 12,500 ETH in the original wallet.\n\nClick here to learn all about investing in Ethereum.\n\nA Slew of Ether Futures ETF Enters the Market\n\nThe latest price action came after Ether futures exchange-traded funds (ETFs) made their way into the US market for the very first time. In a recent note, QCP Capital said, “a futures-only ETF is arguably detrimental to spot price – as it potentially directs demand away from the spot market into a synthetic market.”\n\nHowever, the much-hyped Ether Futures ETFs failed to capture the interest of investors.\n\nOn Monday, investment firms VanEck, Bitwise, Valkyrie, ProShares, and Kelly collectively debuted a total of nine ETFs on the Chicago Board Options Exchange (CBOE). Of these funds, only five hold exclusively Ether futures, while the others track a mixture of Bitcoin and Ether futures contracts.\n\nVanEck's Ethereum Strategy ETF (EFUT) kicked off trading yesterday, while Valkyrie debuted its Bitcoin and Ether Strategy ETF (BTF). Bitwise, too, was in the fray as it rolled out its Bitwise Ethereum Strategy ETF (AETH) and Bitwise Bitcoin and Ether Equal Weight Strategy ETF (BTOP). Meanwhile, Proshares launched three funds: the Bitcoin and Ether Strategy ETF (BETH), the Bitcoin and Ether Equal Strategy ETF (BETE), and the Ether Strategy Fund (EETH). Brazilian fund manager Hashdex also launched its Ether Strategy ETF (EX).\n\nHowever, despite the excitement surrounding these launches, the nine funds got off to a slow start, with low volumes reported on their first day of trading. As of 11:25 am ET, they had traded less than $2 million in total, according to Bloomberg Intelligence analyst Eric Bulchunas, who described the volume as “meh” on Twitter.\n\nAmong all the Ether futures ETFs, Valkyrie's BTF was leading the race with around $787,000 worth of shares trading hands by that time.\n\nWhile Ether futures ETF only started trading now, the first Bitcoin futures ETF started trading on the New York Stock Exchange back in 2021. Compared to Ether's performance, at the time, the ProShares Bitcoin Strategy ETF (BITO) traded nearly $1 billion in shares on its debut day and almost broke records. However, it's worth noting that BITO's launch was during the height of the bull run when Bitcoin was trading around $65,000, a lot higher than it is currently trading at.\n\nEven then, Balchunas noted that compared to a regular traditional finance (TradFi) ETF launch, the volume witnessed was actually “quite a lot.” He further explained that the SEC scheduled the launch of all the products on the same day to prevent any one fund from gaining market domination.\n\nAmidst this, Volatility Shares, a financial firm offering a range of ETF products, canceled its plans to list Eth futures ETFs, saying that it “didn't see an opportunity” at this time with further plans to be decided.\n\nAll of these crypto funds track the future price of the digital rather than the asset itself. Investors are currently awaiting a Spot crypto ETF, which will allow them to gain exposure to the cryptocurrency itself without needing to hold the actual asset.\n\nIn the past few months, several high-profile TradFi players, including BlackRock, have filed for a Bitcoin Spot ETF on which the SEC has yet to make a decision. Market participants are hopeful that we can get approval next year, but that remains to be seen.\n\nRecently, four US lawmakers called on the US Securities and Exchange Commission (SEC) to immediately approve spot Bitcoin ETF after a federal judge last month undermined the agency's decision to reject converting the Grayscale Bitcoin Trust (GBTC) into an ETF.\n\nClick here to learn all about buying Ethereum (ETH).\n\nGrayscale Applied for a Spot Ether ETF\n\nAs a series of Ether futures ETFs made their way into the US market, asset manager Grayscale now intends to convert its Ethereum Trust into an ETF.\n\nNYSE Arca filed a 19b-4 with the SEC to convert the Grayscale Ethereum Trust (ETHE) into a spot Ethereum ETF. “As we file to convert ETHE to an ETF, the natural next step in the product's evolution, we recognize this as an important moment to bring Ethereum even further into the US regulatory perimeter,” said Grayscale CEO Michael Sonnenshein in a statement.\n\nAs per the press release, ETHE's conversion into a spot ETF has always been the “final stage” of the Trust's intended lifecycle ever since its launch in 2019. Much like Grayscale's Bitcoin fund, the company's Ethereum trust is the largest Ethereum investment vehicle worldwide. After all, ETHE currently comprises 2.5% of all circulating ETH.\n\nAs of writing, ETHE shares are trading at a 30% discount to the underlying ether held by the fund. Following the announcement, shares for ETHE spiked over 6%. With ETH currently trading at $1,665, the total value of the fund's ETH holdings amounts to about $5 billion, while its shares total to just $3.6 billion.\n\nThis is because, currently, ETHE shares are not redeemable for the underlying ETH, which would be changed under the ETF structure.\n\nLast month, Grayscale also filed for a futures Ethereum ETF, which is backed by cash-settled futures contracts rather than actual ETH. A futures contract is an agreement to buy or sell an asset, here ETH, at a later date at a predetermined price.\n\nGrayscale's latest application to convert ETHE into an ETF comes while the company battles to convert the Grayscale Bitcoin Trust (GBTC) into a spot Bitcoin ETF. Back in August, the company did secure a major court victory over the SEC as the court found that the securities regulator was being “arbitrary and capricious” toward Grayscale in denying its spot Bitcoin ETF application while permitting alternative futures Bitcoin ETFs. Since then, GBTC's share discount has narrowed from 25% to 20%.\n\nTokenization & Staking on Ethereum Gains Traction\n\nAmidst all the heightened activity around Ethereum ETF, the tokenization trend on Ethereum continues to gather steam. This week, UBS Asset Management launched its inaugural live pilot of a tokenized Variable Capital Company (VCC) fund, representing a legal entity for investment funds in Singapore introduced in January 2020 to enhance the city-state's position as a hub for fund management activities.\n\nThe asset management division of Switzerland's largest financial holding will leverage its in-house tokenization service called UBS Tokenize to initiate a controlled pilot of a tokenized money market fund on Ethereum and let the firm facilitate fund subscriptions and redemptions.\n\nThe pilot is part of the broader Monetary Authority of Singapore (MAS)-led VCC umbrella initiative called Project Guardian, which aims to tokenize various real-world assets.\n\n“This is a key milestone in understanding the tokenization of funds, building on UBS's expertise in tokenizing bonds and structured products,” said Thomas Kaegi, Head of UBS Asset Management, Singapore and Southeast Asia.\n\nIn this initiative, UBS will collaborate with TradFi institutions and fintech providers to gain insights into enhancing market liquidity and providing better market access for their clients.\n\nThe UBS Tokenize platform was recently also used to issue digital structured notes by Bank of China Investment (BOCI), amounting to CNH 200 million ($27.3 million), on the Ethereum blockchain.\n\nBesides tokenization, staking is also gaining traction on Ethereum, with about 30.5 million coins staked on the network. Back in April, the Shapella upgrade went live, which finally allowed the withdrawals of ETH, making investors more confident with locking up their coins in Ethereum's deposit contract.\n\nStaking has made Ethereum one of the hottest money-making opportunities. While the market is going through a crypto winter, staking has created the ability for participants to earn rewards on their holdings and weather the storm until asset prices start rallying.\n\nHowever, Ethereum co-founder Vitalik Buterin recently expressed worries regarding DAOs like Lido exerting a monopoly over the selection of node operators in liquidity staking pools. “With the DAO approach, if a single such staking token dominates, that leads to a single, potentially attackable governance gadget controlling a very large portion of all Ethereum validators,” Buterin said in a Sept. 30 blog post.\n\nTo address this issue, Buterin encouraged ecosystem participants to utilize a variety of liquid staking providers.\n\nEthereum Protocol Improvements\n\nWhile all this development is taking place, developers continue to work on making Ethereum more efficient. Last week, Ethereum developers were successful in their second attempt to launch the new Holesky test network, which is to help developers test some ambitious scaling plans for the main blockchain. The new testnet will also allow twice as many validators to join the network compared to the mainnet.\n\nHolesky is of significance because it will be important for Ethereum's upcoming hard fork, Dencun, where proto-danksharding is supposed to go live. As part of EIP-4844, Proto-danksharding is aimed at reducing the cost of rollups, which batch transactions and data off-chain and submit computational proof to the main Ethereum blockchain. The expected launch date for proto-danksharding is yet to be decided, though development and testing are ongoing.\n\nButerin recently also commented on Ethereum's philosophy, which started off as minimalistic but has since changed. Discussing the possibility of integrating more advanced features directly into the Ethereum protocol, Buterin said it is not limited to Layer 2 structures but also includes other functionalities such as privacy, usernames, advanced cryptography, account safety, censorship resistance, frontrunning protection, and digital asset exchange, among others.\n\nHe did caution that too much enshrining, which is integrating advanced features and functionalities directly into the Ethereum protocol, can also bring problems in the long run in terms of overcomplications and including features only popular in the short term.\n\nConcluding Thoughts\n\nETH is currently in the red, but if the bulls persist, we could see it continue first toward $1,800 and then $2,000. Not to mention, this price action is happening as we enter October, historically one of its strongest months. However, the macro environment remains the major driving force, and with investors worried that the Federal Reserve would keep interest rates high for longer, which are at their highest level since 2001, to tame inflation, risk-averseness will continue to rule the markets."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mdXR1cmVzLWV0Zi1zY2FycmVkLWJ5LWxvdy10cmFkaW5nLXZvbHVtZS1hdC1sYXVuY2gtcG9zc2libGUtcmVhc29uc9IBYWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mdXR1cmVzLWV0Zi1zY2FycmVkLWJ5LWxvdy10cmFkaW5nLXZvbHVtZS1hdC1sYXVuY2gtcG9zc2libGUtcmVhc29ucz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Futures ETF Scarred by Low Trading Volume at Launch, Possible Reasons - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe much anticipated Ethereum Futures Exchange Traded Fund (ETF) failed to meet many traders' expectations as multiple variants of the product went live on Monday. According to insights shared by Eric Balchunas, a senior ETF analyst for Bloomberg, the cumulative trading volume for the ETFs on the first trading day was just below $2 million.\n\nAdvertisement\n\nPretty meh volume for the Ether Futures ETFs as a group, a little under $2m, about normal for a new ETF but vs $BITO (which did $200m in first 15min) it is low. Tight race bt VanEck and ProShares in the single eth lane. pic.twitter.com/F9AHtrVcVf — Eric Balchunas (@EricBalchunas) October 2, 2023\n\nAfter the Securities and Exchange Commission (SEC) greenlighted many of the ETF proposals from the likes of VanEck, ProShares, Valkyrie and Bitwise, among others, U.S. stock exchanges welcomed multiple launches earlier this week.\n\nPer the data shared, the combination of Bitcoin and Ethereum Futures ETFs from Valkyrie had the highest trading volume, which was pegged at about $787,376 as of 11:15 a.m. on Monday. The same low trading volume characterized the offerings from ProShares, whose Ethereum Futures ETF saw just a meager $284,112 traded overall.\n\nWhile the fact that such a product is available for mainstream investors to gain exposure to the crypto space, Balchunas pointed out the poor volume when compared to the more than $200 million the first-ever Bitcoin Futures ETF recorded within the first 15 minutes after it went live.\n\nPotential reason for scarred volume\n\nThe industry has been quite emphatic about the SEC approving a crypto ETF product. While the market regulator has always been keen on the futures variant, what the industry wants the most is the spot ETF versions of both Bitcoin and Ethereum.\n\nWith multiple ETF applications filed with the SEC at this time, the regulator is facing pressures from the industry, compounded by the legal victory handed to Grayscale with respect to the product as well as pressure from lawmakers, who believe the time to approve a Bitcoin ETF is now.\n\nWith the Ethereum Futures ETF now live, expectation abounds for the SEC to approve more Bitcoin spot ETFs in the near term."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vc21hcnRlcmV1bS5jb20vMTkwMjY0LzYtcmVhc29ucy13aHktZXRoZXJldW0taXMtdGhlLWJlc3QtYmxvY2tjaGFpbi1mb3ItZ2FtaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "6 Reasons Why Ethereum Is The Best Blockchain For Gaming - Smartereum",
        "content": "Ethereum is the most popular blockchain used by developers creating decentralized apps (dApps). According to DappRadar, there are nearly 700 different games currently running on Ethereum, suggesting that creators prefer the Ethereum blockchain to other options.\n\nCryptoKitties, Axie Infinity, Decentraland, and The Sandbox are some of the world’s most popular blockchain games running on the Ethereum network. These games achieved impressive figures at their respective peaks, becoming so popular that they congested the Ethereum network. For instance, the most expensive CryptoKitty, Dragon, sold for 600 ETH, about $170,000 at the time. CryptoKitties also accounted for over 12% of all Ethereum transactions in December 2017. For Axie Infinity, the game’s publisher had to increase the transaction fee to 5.25% from 4.25%, in response to heavy demand from players.\n\nEven though there are hundreds of games on the Ethereum blockchain, many more developers are still deploying projects on the blockchain. The following are the most common reasons developers prefer Ethereum:\n\nSmart Contracts\n\nThe Ethereum network supports smart contracts, which are essential tools for blockchain games. These contracts self-execute depending on specific conditions and according to predetermined rules. The self-execution takes a lot of worry off developers, allowing them to design complex games and run them smoothly for their audiences. For instance, developers can use smart contracts to ensure that a game’s reward system incentivizes players as soon as they qualify. Using smart contracts also helps to verify ownership of in-game assets for easy acquisition or exchange.\n\nFlexibility\n\nEthereum’s flexibility enables developers to create games tailored to specific audiences. It also allows game companies to add exciting features to their titles and update them for better gameplay, or to address feedback from the gaming community.\n\nFurthermore, flexibility helps developers modify their games to support Ether tokens, as well as any other assets compatible with Ethereum. In addition to blockchain games, online casinos enjoy this flexibility as they allow their customers to make gambling deposits using Ether tokens. Ethereum casinos are user-friendly, offer attractive bonuses, and ensure anonymity on public platforms.\n\nUsers often only need an email address to open an account. Players can create accounts and immediately begin making deposits and withdrawals, skipping most of the cumbersome steps typically required by other platforms (source: https://cryptonews.com/news/best-ethereum-casinos.htm).\n\nCommunity Support\n\nDevelopers creating titles on the Ethereum blockchain have access to an active community of creators from regions all over the world. This community helps new developers to easily connect with others and find solutions to major problems. The support also creates an opportunity for experienced developers to bounce ideas off each other or mentor newbies. Through community support, developers can get all the coding and testing assistance needed to develop the most engaging and profitable titles.\n\nScalability\n\nMany blockchain platforms have scalability issues that make it challenging to handle many gamers running simultaneous transactions. This can be detrimental for games that achieve global success and attract many players. Fortunately, Ethereum can handle thousands of transactions through several solutions on the network, including sharding. This solution basically splits the network into smaller parts for easy management and transaction processing. In addition to sharding, there are several layer-2 networks and sidechains that solve Ethereum’s scalability problems, making the blockchain one of the most suitable networks for gaming.\n\nLow Transaction Fees\n\nMany Ethereum games are affordable because of the network’s low transaction fees. Players who want to enjoy their favorite titles can buy in-game assets or trade NFTs without worrying about losing money on transactions. This is an advantage directly tied to scalability because solutions that allow the network to quickly handle a large number of transactions also keep fees low since transaction processing is easier. Another advantage of low transaction fees is the cost-effectiveness for new developers who may not have the resources to invest heavily in their projects.\n\nInteroperability\n\nEthereum’s interoperability allows several blockchains to communicate easily. Interoperability enables different games to combine resources across chains so players can enjoy more exciting in-game options. Ethereum interoperability standards, including ERC-20 and ERC-721, help developers define rules for creating and issuing tokens, and promote collaboration between gaming projects. In addition, these standards help compatible wallets connect with multiple games such that a player can integrate any existing wallet and fund gaming accounts to purchase assets or NFTs."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tZnV0dXJlcy1ldGZzLW9uLWNtZS1iZWdpbi13aXRoLWxpZ2h0LXRyYWRpbmctdm9sdW1lcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Ethereum futures ETFs on CME begin with light trading volumes - crypto.news",
        "content": "In a stark contrast of trading volumes, the debut of Ethereum futures ETFs on CME witnessed a modest start, with trading activity in the first 15 minutes hovering below $2 million. This pales in comparison to their Bitcoin-based counterparts, which boasted volumes a hundred times greater.\n\nBloomberg analyst Eric Balchunas suggests that these numbers are common for new ETFs but relatively low for Ethereum (ETH), given its market size.\n\nAccording to Balchunas, the top performer was Valkyrie’s ETF, based on a combination of the first and second-largest cryptocurrencies by market capitalization, with a trading volume of $787,000.\n\nVanEck’s Ethereum futures-only ETF had a modest volume of just over $300,000.\n\nPretty meh volume for the Ether Futures ETFs as a group, a little under $2m, about normal for a new ETF but vs $BITO (which did $200m in first 15min) it is low. Tight race bt VanEck and ProShares in the single eth lane. pic.twitter.com/F9AHtrVcVf — Eric Balchunas (@EricBalchunas) October 2, 2023\n\nIn total, the turnover for six exchange-traded funds based only on Ethereum futures at the end of the day reached to $1.92 million, including $879,000 for the ProShares Ether Strategy ETF.\n\nThe six new funds by ProShares, VanEck and Bitwise Asset Management allow investors to take positions in exchange-traded products based on ether for the first time. The six funds saw trading volumes total only $1.92 million in their first day of trading, according to data from… https://t.co/ASebNWJHO6 — Wu Blockchain (@WuBlockchain) October 3, 2023\n\nBloomberg pointed out that compared to two years ago when Bitcoin ETF trading began, the current bear market has made the competition tougher.\n\nRoxanne Islam, deputy research director at VettaFi, suggests that the subdued interest in Ethereum-based futures ETFs is because investors are anticipating spot versions, primarily Bitcoin (BTC), possibly in early 2024.\n\nHowever, the US Securities and Exchange Commission (SEC) has been postponing the consideration of applications for a spot Bitcoin ETF.\n\nIn early September, the regulator extended its evaluation timeline for several spot Bitcoin ETF applications. It has also postponed its decision on ARK 21Shares’ Bitcoin ETF application to next year.\n\nFollow Us on Google News"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8wNC9jcnlwdG8tYW5hbHlzdC1zYXlzLW9uZS1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWZsYXNoaW5nLWEtYmVhcmlzaC1zaWduYWwtdXBkYXRlcy1vdXRsb29rLW9uLWJpdGNvaW4v0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzA0L2NyeXB0by1hbmFseXN0LXNheXMtb25lLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tZmxhc2hpbmctYS1iZWFyaXNoLXNpZ25hbC11cGRhdGVzLW91dGxvb2stb24tYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Crypto Analyst Says One Ethereum-Based Altcoin Flashing a Bearish Signal, Updates Outlook on Bitcoin - The Daily Hodl",
        "content": "A crypto analyst thinks indications of a bearish signal are being displayed by one Ethereum (ETH)-based altcoin.\n\nAli Martinez tells his 30,800 followers on the social media platform X that the native asset of the decentralized oracle network Chainlink (LINK) could be primed for a brief correction.\n\nCiting data from crypto analytics firm Santiment, Martinez points out that the last two times LINK’s 30-day market value to realized value (MVRV) passed 19%, the asset endured steep corrections. LINK’s MVRV recently hit 20%.\n\nMVRV is the ratio of an asset’s current market cap divided by its realized capitalization – i.e. the value of all measured LINK at the price they were bought. MVRV 30-Day is a timebound metric that only analyzes that ratio among tokens that have moved at least once in the past 30 days. Traders use the metric to detect overbought or oversold conditions.\n\nMartinez, however, believes that LINK will still hit higher highs after a brief correction. The 19th-ranked crypto asset by market cap is trading at $7.40 at time of writing.\n\nThe analyst also looks at Bitcoin (BTC), examining the top crypto asset’s Relative Strength Index (RSI), a widely used momentum indicator that aims to determine if an asset is overbought or oversold.\n\nSays Martinez,\n\n“Notice that each time the RSI on BTC 4-hour chart hits or surpasses 74.21, BTC tends to retrace. The RSI on the 4-hour chart recently hit 82.83!”\n\nThe RSI indicator scales from 0 to 100. A reading of below 30 is typically considered bullish while a reading of over 70 is typically considered to be a bearish sign.\n\nBTC is trading at $27,362 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvd2lsbC1ldGhlcmV1bS1nby11cNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Will Ethereum Go Up? - Watcher Guru",
        "content": "Will Ethereum’s Blockchain with Smart Contracts Functionality Revolutionize the Crypto Market?\n\nThe crypto market has been buzzing with excitement and speculation surrounding the future of Ethereum and its blockchain with smart contract functionality.\n\nAs the second-largest cryptocurrency by market cap, ETH has gained significant attention for its potential to revolutionize various industries.\n\nExplore Ethereum’s smart contracts, 2023 price predictions, and investment potential in this article.\n\nRead more: Top 2 Cryptocurrencies To Watch in October 2023\n\nSource: CNBC\n\nUnderstanding Ethereum and its Blockchain\n\nETH is a decentralized blockchain platform that enables the creation and execution of smart contracts.\n\nUnlike Bitcoin, Ethereum’s blockchain fosters dApps and smart contracts, expanding its utility beyond digital currency.\n\nAlso read: New Bill Proposes Centralized Record of Crypto Transactions\n\nWhat are Smart Contracts?\n\nSmart contracts are self-executing contracts with the terms of the agreement directly written into code. These agreements automatically execute when predefined conditions are met, eliminating the need for intermediaries and ensuring transparency and trust in transactions.\n\nEthereum’s blockchain supports smart contracts, empowering developers to create decentralized applications for diverse industries.\n\nThe Transition from Proof of Work (PoW) to Proof of Stake (PoS)\n\nCurrently, Ethereum’s blockchain operates on a Proof of Work (PoW) consensus mechanism, where miners compete to solve complex mathematical problems to validate transactions and secure the network.\n\nHowever, ETH is undergoing a significant upgrade known as ETH 2.0, which introduces a transition from PoW to Proof of Stake (PoS) consensus.\n\nValidators in PoS secure the network by staking Ether (ETH) to validate transactions.\n\nThis transition aims to improve scalability, energy efficiency, and security while reducing the reliance on mining for network consensus.\n\nSource: MARCA\n\nEthereum Price Prediction for 2023\n\nThe price of ETH has been subject to significant volatility, influenced by various factors such as market sentiment, technological developments, and regulatory changes.\n\nPredicting cryptocurrency prices, including ETH, is challenging, but analysts offer potential price ranges.\n\nShort-Term Ethereum Price Analysis\n\nIn the past 30 days, ETH has experienced fluctuations in its price.\n\nTechnical analysis suggests that the price of ETH may range between $1,100 and $2,000 for the rest of 2023.\n\nHowever, it is essential to consider that market sentiment and external factors can influence short-term price movements.\n\nEthereum’s Potential Highs and Lows in 2023\n\nBased on market analysis and expert opinions, here are the potential price ranges for ETH in 2023:\n\nMinimum Price: $1,100\n\nAverage Price: $1,550\n\nMaximum Price: $2,000\n\nIt is crucial to note that these price predictions are speculative and should not be considered as financial advice.\n\nThe cryptocurrency market is highly volatile, and prices can fluctuate significantly quickly.\n\nIs Ethereum a Good Investment?\n\nInvesting in Ethereum or any cryptocurrency carries risks and should be cautiously approached.\n\nBefore investing, conducting thorough research, understanding the technology and market dynamics, and assessing your risk tolerance is essential.\n\nSource: Reuters\n\nPotential Upsides of Investing in Ethereum\n\nTechnological Innovation: Ethereum’s blockchain with smart contracts functionality offers immense potential for innovation across industries, including finance, healthcare, supply chain management, and more.\n\nEthereum’s blockchain with smart contracts functionality offers immense potential for innovation across industries, including finance, healthcare, supply chain management, and more. Market Dominance: As the second-largest cryptocurrency by market cap, Ethereum has established itself as a leading player in the blockchain industry, garnering significant attention and adoption.\n\nAs the second-largest cryptocurrency by market cap, Ethereum has established itself as a leading player in the blockchain industry, garnering significant attention and adoption. Ethereum 2.0 Upgrade: The transition from PoW to PoS consensus through Ethereum 2.0 aims to address scalability and energy efficiency concerns, potentially enhancing the network’s capabilities and value proposition.\n\nRisks and Challenges of Investing in Ethereum\n\nMarket Volatility: The cryptocurrency market is highly volatile, and prices can experience significant fluctuations in a short period.\n\n\n\nInvestors should be prepared for potential price volatility and be aware of the risks involved.\n\nThe cryptocurrency market is highly volatile, and prices can experience significant fluctuations in a short period. Investors should be prepared for potential price volatility and be aware of the risks involved. Regulatory Uncertainty: The regulatory landscape for cryptocurrencies is still evolving, with potential regulation changes that could impact the market and investor sentiment.\n\nThe regulatory landscape for cryptocurrencies is still evolving, with potential regulation changes that could impact the market and investor sentiment. Competition: Ethereum faces competition from other blockchain platforms that offer similar functionalities, such as Cardano, Solana, and Polkadot.\n\n\n\nConsidering the competitive landscape and potential impact on Ethereum’s market position is important.\n\nThe Future of Ethereum’s Blockchain with Smart Contracts Functionality\n\nEthereum’s evolving blockchain, with smart contracts, can revolutionize industries and spark innovation.\n\nEthereum 2.0’s shift to PoS improves scalability and energy efficiency, solidifying its position as a top blockchain.\n\nHowever, monitoring market developments, technological advancements, and regulatory changes that may impact Ethereum’s future trajectory is crucial.\n\nInvesting in cryptocurrencies is risky. Assess your risk tolerance and research before deciding.\n\nIn conclusion, Ethereum’s blockchain with smart contracts functionality has the potential to revolutionize the crypto market and various industries.\n\nPrice predictions for 2023 vary ($1,100-$2,000). Invest in Ethereum cautiously due to market volatility and risks.\n\nConducting thorough research and seeking professional advice is essential for making informed investment decisions in cryptocurrency.\n\nDisclaimer: The information provided in this article is for informational purposes only and should not be considered financial advice. Investing in cryptocurrencies carries risks, and individuals should conduct their own research and consult with a financial advisor before making any investment decisions."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS10cmltcy1nYWlucy0xNjIwL9IBSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS10cmltcy1nYWlucy0xNjIwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Price Trims Gains But Here’s Why ETH Could Start Fresh Rally - NewsBTC",
        "content": "Ethereum price corrected gains from the $1,750 zone against the US dollar. ETH is holding the key $1,620 support and might start a fresh rally.\n\nEthereum is correcting gains from the $1,755 high.\n\nThe price is trading below $1,700 and the 100-hourly Simple Moving Average.\n\nThere was a break below a connecting bullish trend line with support near $1,690 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could start a fresh increase unless there is a close below the $1,620 support.\n\nEthereum Price Corrects Gains\n\nEthereum’s price extended its increase above the $1,720 level. ETH even spiked above the $1,750 resistance zone before the bears appeared, like Bitcoin.\n\nA high was formed near $1,755 before there was a downside correction. There was a move below the $1,700 support level and the 100-hourly Simple Moving Average. The price declined below the 50% Fib retracement level of the upward move from the $1,583 swing low to the $1,755 high.\n\nBesides, there was a break below a connecting bullish trend line with support near $1,690 on the hourly chart of ETH/USD. Ethereum is now trading below $1,700 and the 100-hourly Simple Moving Average.\n\nHowever, the price is still above the 61.8% Fib retracement level of the upward move from the $1,583 swing low to the $1,755 high. On the upside, the price might face resistance near the $1,670 level and the 100-hourly Simple Moving Average.\n\nSource: ETHUSD on TradingView.com\n\nThe next major resistance is $1,700. A clear move above the $1,700 resistance zone could set the pace for a fresh increase. In the stated case, the price could visit the $1,750 resistance. The next key resistance might be $1,820. Any more gains might open the doors for a move toward $1,880.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,700 resistance, it could continue to move down. Initial support on the downside is near the $1,650 level. The next key support is $1,620.\n\nA downside break below the $1,620 support might start another strong bearish wave. In the stated case, there could be a drop toward the $1,580 level. Any more losses might call for a test of $1,550.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,620\n\nMajor Resistance Level – $1,700\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tY3J5cHRvLWRydWctY2FydGVsLXRpZXMv0gFLaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1jcnlwdG8tZHJ1Zy1jYXJ0ZWwtdGllcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Crypto Drug Cartel Ties: On-chain Investigator Drags Ethereum Into The Mess - NewsBTC",
        "content": "An on-chain crypto investigator took to social media to expose the supposed black truth behind Justin Sun’s Tron but has thrown Ethereum in the mix, alleging that the cryptocurrency is backed by the CCP and may harbor crypto wallet addresses by Fentanyl traffickers.\n\nOn-Chain Detective Unveils Potential Tron Ponzi Scheme\n\nAn X (formerly Twitter) user going by the username @BoringSleuth has gained the attention of the crypto community after uncovering potential evidence of Tron allegedly being a Ponzi scheme governed by one of the world’s largest crypto criminal drug cartels.\n\n“I showed and told the World that Tron $TRX was a massive Ponzi, run by a part of the largest criminal Cartel in the World, and connected to the CCP,” BoringSleuth said.\n\nI showed and told the World that Tron $TRX was a massive Ponzi, ran by a part of the largest criminal Cartel in the World, and connected to the CCP. Today, the DOJ charged 8 CCP companies with illegal drug production, distribution, and sales around Fentanyl. Over half of their… https://t.co/Yjbnv2fgPN pic.twitter.com/do4JLiAgLh — TruthLabs 🫡 (@BoringSleuth) October 4, 2023\n\nBoringSleuth disclosed that the United States Department of Justice (DOJ) has sanctioned eight Chinese Communist Party (CCP) companies for allegedly operating a clandestine drug production and distribution sales network around Fentanyl.\n\nThe crypto investigator revealed that more than half of the wallets owned by these companies were traced back to Tron and the remainder allegedly being on the Ethereum blockchain.\n\nAfter analyzing the original sales of the TRX token, BoringSleuth stated that he had reviewed the top 20 cryptocurrency wallets in Tron’s original token sale list to decipher the owners of the wallets and how much TRX supply these wallets have acquired.\n\nAccording to the investigator, out of the 20 wallets, 17 were created and owned by the infamous criminal organization disguised to represent genuine investors. He revealed that the criminal organization was connected to the CCP, and 98% of Tron’s total token supply was received by these 17 wallets.\n\nThe on-chain investigator also mentioned that cryptocurrency exchanges like Huobi Global, and cryptocurrencies like Shiba Inu may also be linked to the CCP and Wanxiang, a Chinese multinational conglomerate and the team that funded Ethereum Foundation wallets and Ethereum’s Founder, Vitalik Buterin.\n\nETH prie falls back to mid $1,600s | Source: ETHUSD on Tradingview.com\n\nInvestigations Cast Shadows On Ethereum\n\nThe crypto industry has experienced a series of Ponzi schemes and rug pulls for years now, causing investors and regulators to be wary of crypto exchanges and organizations in the space.\n\nWhile Tron is faced with speculations of being a well-orchestrated Ponzi scheme and having connections with the CCP, the revelation that Ethereum, the world’s second-largest cryptocurrency may be backed by the CCP and connected to companies involved in drug trafficking has left the crypto community in a paradox.\n\nAccording to BoringSleuth, the CCP is allegedly supporting Ethereum and other blockchains as well as multiple Decentralized Exchanges (DEX) and Centralized Exchanges (CEX) in the crypto space.\n\nThe crypto investigator utilized a previous transaction that saw the CCP receiving 133,700 ether on a single Genesis Block address owned by the party, as a reference to a connection between Ethereum and the CCP.\n\nBoringSleuth has also stated a potential connection between Ethereum’s Founders and the CCP, which he said he would be revealing in detail soon.\n\nThe allegations faced by Tron and Ethereum come amid the increasing scrutiny of China’s role in the cryptocurrency landscape. Although the crypto X community is presently reeling from the on-chain investigator’s hypothesis, no concrete evidence linking Ethereum to the CCP has emerged, leaving the allegations in the realm of speculation.\n\nFeatured image from Medium, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZXhjbHVzaXZlOi10aW0tZHJhcGVyLXJlZmxlY3RzLW9uLWJpdGNvaW4tZXRmLWFzLWdyYXlzY2FsZS1hbm5vdW5jZXMtbmV3LWV0aGVyZXVtLWZ1bmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "EXCLUSIVE: Tim Draper Reflects On Bitcoin ETF As Grayscale Announces New Ethereum Fund - Nasdaq",
        "content": "A Bitcoin (CRYPTO: BTC) ETF is looking very likely, with the world's leading crypto asset manager, Grayscale, as a possible front-runner to be approved by the SEC. In the meantime, Grayscale is lengthening its lead by applying to convert the Grayscale Ethereum Trust (ETHE) to a spot Ethereum exchange-traded fund (ETF).\n\nGrayscale will be speaking at Benzinga's Future of Digital Assets event on Nov. 14 in NYC.\n\nThe Grayscale Ethereum Trust represents 2.5% of all ETH in circulation and is the largest ETH investment vehicle in the world. Grayscale stated that the ETHE trust has always been on the path to becoming an ETF. Currently, the Ethereum underlying the trust is discounted at 30%, but the ETH would be worth $5.14 billion at full market value.\n\nShares of ETHE spiked 6.15% in value following the announcement of the spot Ethereum ETF.\n\nTim Draper, a prominent investor and entrepreneur known for successful investments in companies such as Tesla, Skype, and Coinbase, gave Benzinga exclusive comments on the Grayscale spot BTC ETF application. To Draper, approval seems to be a matter of time: \"I am surprised it has taken so long. I'm not sure why the SEC approved futures and not spot trading. It seems capricious,\" Draper said.\n\nHe expects the availability of a spot Bitcoin ETF to encourage more adoption and investments in BTC.\n\n\"It will allow more people to participate in this new global, open, transparent, frictionless economy provided by Bitcoin and its blockchain. It will bring more light on the unbanked who can use Bitcoin to participate in the global economy,\" Draper said.\n\nAlso Read: Bitcoin's 'Fake Pump Seems Over:' Crypto Analyst Capo Predicts Price Drop To $12K\n\nOne month ago, Circuit Judge Neomi Rao wrote a DC Circuit Court of Appeals opinion that favored Grayscale's application to convert the Grayscale Bitcoin Trust (GBTC) into a more accessible Exchange Traded Fund (ETF). Rao's opinion said, in part, \"The Commission failed to adequately explain why it approved the listing of two Bitcoin futures ETPs but not Grayscale's proposed Bitcoin ETP. In the absence of a coherent explanation, this unlike regulatory treatment of like products is unlawful. We therefore grant Grayscale's petition for review and vacate the Commission's order.\"\n\nOther applicants for a spot BTC ETF include ARK Investment, BlackRock, Bitwise, Fidelity/Wise Origin, GlobalX, Invesco Galaxy Bitcoin ETF, VanEck, and WisdomTree.\n\nInvestor, author, and Forbes contributor Clem Chambers said: \"It seems unlikely that there will be much of a gap between applicants if a BTC ETF is cleared… To me it's anyone's guess when it will be approved, but if the SEC had its way there will be no ETF unless they think it will be a negative for Bitcoin and crypto.\"\n\nThe legal victory in DC compels the US Securities and Exchange Commission (SEC) to revisit the Grayscale application for a spot BTC ETF after rejecting it.\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart welcomed the news by raising the odds of the SEC approving a spot Bitcoin ETF to 75% by the end of 2023 and 95% by the end of 2024.\n\nFind out more about Bitcoin and its history. Join Benzinga's Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions, and institutional adoption in the crypto space. Secure early bird discounted tickets now! What's more, use BZCRYPTO code to get 20% OFF.\n\nNow Read: Binance CEO Changpeng Zhao Faces Class Action Lawsuit Over Alleged Misconduct That Led To FTX's Collapse\n\nPhoto: Web Summit on Flickr\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZmluYm9sZC5jb20vYWktZm9yZWNhc3RzLWV0aGVyZXVtLXByaWNlLWZvci10aGUtZW5kLW9mLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "AI forecasts Ethereum price for the end of 2023 - Finbold - Finance in Bold",
        "content": "Although the general sentiment for the global crypto market remains floating between bearish to neutral, September ended slightly positive for most cryptocurrencies, including for the leading layer-1 blockchain for Web3, DeFi, and DApps: Ethereum (ETH).\n\nEthereum’s landscape has changed a lot in the last few years, which most supporters see with enthusiasm for long-term projections to the second-largest cryptocurrency by market cap.\n\nFrom the implementation of a burning mechanism for a portion of gas fees to the migration for a more efficient consensus algorithm with the Proof-of-Stake (PoS), the Ethereum Network has grown in value for its users and investors.\n\nIn this context, Finbold has checked what the expected outcome for ETH is — price regarding. Data retrieved on October 4, from CoinCodex‘s AI-powered price prediction algorithms shows a positive forecast for Ethereum from now to December 31, 2023.\n\nNotably, the artificial intelligence sets a price of $2,553.14 for ETH by the end of 2023. This forecast represents an increase superior to 50% in Ethereum’s price from the CoinCodex index’s current price of $1,653.12.\n\nEthereum price forecast for the end of 2023. Source: CoinCodex\n\nETH price forecast for 2024\n\nDespite seeing a favorable bull market for ETH for the next months, the AI’s short-term perception is still considering “It’s now a bad time to buy Ethereum”. This happens due to 19 out of 30 green days for the leading Web3 asset, with two major price resistances at $1,650 and $1,805 with the 50-day and the 200-day SMAs, respectively.\n\nNevertheless, the artificial intelligence predicts Ethereum to reach $3,243 in the next six months, for close to 100% in gains from current prices at the time of publication. Additionally, CoinCodex‘s price prediction algorithms also believe ETH will be trading as high as $5,000 a year from now.\n\nAll things considered, this forecast mostly considers technical analysis indicators and general market sentiment, and can not be considered in a vacuum. The ability of Ethereum’s price to meet the above prediction will deeply depend on further developments, news, and macroeconomics that are yet to come.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8xMC8wNC9hLXNwb3QtZXRoLWV0Zi1yZXByZXNlbnRzLXRoZS1kYXduLW9mLWluc3RpdHV0aW9uYWwtbGlxdWlkLXN0YWtpbmcv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzEwLzA0L2Etc3BvdC1ldGgtZXRmLXJlcHJlc2VudHMtdGhlLWRhd24tb2YtaW5zdGl0dXRpb25hbC1saXF1aWQtc3Rha2luZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "A Spot ETH ETF Represents the Dawn of Institutional Liquid Staking - CoinDesk",
        "content": "Why is there excitement over an ETH ETF? The answer lies in the resounding demand from investors seeking to integrate digital assets into their portfolios. While investors are hungry for these opportunities, current offerings fall short. U.S. investors eyeing a spot bitcoin ETF have to look beyond American shores."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtZXRoLWRldmFzdGF0aW5nLXBsdW5nZS13aGF0LWhhcHBlbmVk0gFCaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtcy1ldGgtZGV2YXN0YXRpbmctcGx1bmdlLXdoYXQtaGFwcGVuZWQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum's (ETH) Devastating Plunge: What Happened? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, has experienced a devastating plunge in its price. After a promising surge, the asset is currently trading at $1,663.44, leaving investors and traders scratching their heads.\n\nThe market showed a surge in open interest, which is generally a sign of bullish behavior. Bulls seemed to be pushing the price of Ethereum upward, especially after its recent surge. However, this move appears to have been premature. The asset failed to establish any serious support levels, which are crucial for maintaining upward momentum.\n\nThe lack of strong support levels has made Ethereum vulnerable to a sharp reversal, which is what we are witnessing now. The asset had no cushion to fall back on, leading to a devastating plunge. This situation serves as a cautionary tale for traders to not solely rely on open interest as an indicator of bullish behavior. It is essential to consider other factors like support levels, volume and market sentiment before making investment decisions.\n\nSolana stays strong\n\nThe cryptocurrency market has recently experienced a substantial drop, with many assets losing up to 5% of their value in the last 24 hours. However, Solana (SOL) has managed to sidestep this fate, maintaining a relatively stable price. As of the latest data, Solana is trading at approximately $24.07, showing resilience in a bearish market.\n\nThe most plausible explanation for Solana's stability is the lack of bearish selling pressure. While other assets have been subjected to massive sell-offs, Solana has managed to move sideways, indicating that bears have been effectively sidelined.\n\nThis lack of bearish activity is particularly noteworthy given the asset's recent performance. Solana has been one of the standout cryptocurrencies of the year, and its ability to withstand market pressures suggests a strong underlying asset and community support.\n\nThe absence of a significant price drop on Solana could also be attributed to its increasing dominance over Ethereum in some use cases, which has likely contributed to its resilience. The asset has been gaining traction for its lower transaction fees and faster processing times, making it an attractive alternative to Ethereum for certain applications.\n\nPrice analysis indicates that Solana is holding its ground well. The asset has not shown any significant downward movement, and the trading volume suggests that there is still interest in holding rather than selling. This could be a strong signal for potential investors looking for assets that can withstand market volatility.\n\nCardano faces significant resistance\n\nAs of the most recent data, Cardano (ADA) is trading at approximately $0.2629. The asset is currently facing a significant resistance level at the 50 EMA, which has become a battleground for both bulls and bears. While the bulls are striving to push ADA's price above this critical level, the bears are equally determined to pull it back down.\n\nThe Relative Strength Index (RSI) is nearing the overbought zone, indicating that the asset might be overvalued in the short term. This could lead to a potential pullback if the bulls fail to sustain the upward momentum. Additionally, trading volumes have not been particularly strong, further suggesting that the bulls are losing their grip on the market.\n\nThe ascending trend that ADA has been following recently is not gaining any substantial ground for growth. This lack of momentum is a concerning sign for those hoping for a bullish trend continuation. If ADA fails to break above the 50 EMA resistance level convincingly, we could see a reversal that might push the asset back to its local lows.\n\nGiven current market conditions, traders and investors should exercise caution and closely monitor ADA's price action around the 50 EMA level. A decisive break above or below this point could set the tone for ADA's price trajectory in the coming weeks."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1mdXR1cmVzLWV0ZnMtbGF1bmNoLWxvdy12b2x1bWUtdHJhZGluZy1maXJzdC1kYXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum futures ETFs garner lukewarm reception on first day of trading - Cointelegraph",
        "content": "The rush of excitement that accompanied the launch of nine new Ethereum futures exchange-traded funds (ETFs) appears to have yielded little in the way of investment dollars in comparison.\n\nOn Oct. 2, nine new ETF products, which are designed to track futures contracts tied to the value of Ethereum’s native currency Ether (ETH), arrived on the market. Of these funds, only five hold exclusively Ether futures, while the other four track a mixture of Bitcoin (BTC) and ETH futures contracts.\n\n“Pretty meh day of volume,” wrote senior Bloomberg ETF analyst Eric Balchunas on X (formerly Twitter) on Oct. 2.\n\nUnprecedented day today with multiple ETFs all launching at same time. No clear winner has emerged, all of them were pretty average, lower than I would have predicted, but its a long run and remember, these hold futures (ETF investors much prefer physical to derivatives) https://t.co/fKGOv8T7pP — Eric Balchunas (@EricBalchunas) October 2, 2023\n\nIn total, all nine ETFs witnessed less than $2 million worth of trading volume as of midday Eastern Time on the first day of trading.\n\nThe most popular of the futures ETF products was Valkyrie’s Bitcoin Strategy ETF, which tracks a combination of Bitcoin and Ether, racking up a total of $882,000 worth of volume.\n\nIt’s worth noting that it had already been trading as a Bitcoin-only futures ETF since Oct. 2021 but adjusted its strategy to include ETH.\n\nThe first-day trading volume of Ether ETFs paled compared with that of ProShares Bitcoin Strategy ETF, which debuted in October 2021 during a roaring market for crypto assets. It witnessed more than $1 billion in trading volume on its first day.\n\nRelated: VanEck Ethereum Strategy ETF set for CBOE listing\n\nHowever, Balchunas noted that compared to a regular traditional finance ETF launch, the volume witnessed was actually “quite a lot,” though investors tend to prefer spot ETF products over futures.\n\nBalchunas explained that all of the products were scheduled for launch on the same day as the SEC wanted to prevent any one fund from gaining market domination.\n\nMeanwhile, while a range of United States firms jostled for pole position in the nascent Ether futures market, ETF firm Volatility Shares canceled its plans to list a similar product, saying that it “didn’t see an opportunity” at the current time.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzA0L3RoaXMtZXRoZXJldW0tYmFzZWQtYWx0Y29pbi13aWxsLWV4cGxvZGUtMTAwLWFmdGVyLWZpbmFsLWNvcnJlY3Rpb24tc2F5cy1taWNoYWVsLXZhbi1kZS1wb3BwZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "This Ethereum-Based Altcoin Will Explode 100% After 'Final Correction', Says Michaël van de Poppe - The Daily Hodl",
        "content": "An Ethereum-based (ETH) altcoin is likely facing a final leg to the downside before it doubles in price, according to a popular crypto analyst.\n\nCrypto strategist Michaël van de Poppe tells his 668,000 followers on the social media platform X that the decentralized oracle provider Chainlink (LINK) is due for a final correction and a subsequent breakout.\n\nAccording to van de Poppe, 2024 should be a significant year for Chainlink that sees it land somewhere in the $12-$15 range.\n\n“The final correction for Chainlink before we’ll break out of this range.\n\nThe markets are still heating up for a big breakout, and if cycles do take place, 2024 is going to be a big year for LINK.\n\nExpecting to see some retests around $7 to be bought, before $12-15.”\n\nLINK Is trading for $7.67 at time of writing. A surge to van de Poppe’s predicted price range would represent a 56% to 95% increase.\n\nThe crypto trader goes on to note that while altcoins had a substantial correction, Bitcoin (BTC) is consolidating. However, van de Poppe expects “trendy coins” to continue showing momentum despite the altcoin correction as long as BTC consolidates.\n\nLastly, van de Poppe says that the top crypto asset by market cap could rally to $30,000 as long as it can successfully retest the $26,700-$26,900 range.\n\n“Few levels of importance for Bitcoin here. Holding above $27,200 would be substantial for upwards continuation, but preferably is a retest at $26,700-26,900 before we’ll continue the rally to $30,000. Sentiment flipped quite fast.”\n\nBitcoin is trading for $27,426 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Dotted Yeti/Sensvector"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ldGhlcmV1bS1mdXR1cmVzLWV0ZnMtc2VlLWF2ZXJhZ2UtZmlyc3QtZGF5LXRyYWRpbmctdm9sdW1lcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Futures ETFs See 'Average' First Day Trading Volumes - Unchained - Unchained",
        "content": "The excitement surrounding Ethereum Futures ETFs launching for the first time in the U.S. didn’t quite translate into dollars traded.\n\nNine new ETH futures exchange traded funds (ETFs) started trading for the first time in the U.S. on Oct. 2, but recorded just $2 million in total trading volume combined on the widely anticipated day one.\n\nInvestment firms ProShares, VanEck, Bitwise, Valkyrie, Kelly, and Volshares launched their ETH futures ETFs on the Chicago Board Options Exchange (CBOE). The funds track futures contracts tied to the value of ETH, five of which hold ETH futures exclusively, while the other four track BTC and ETH futures.\n\nUnprecedented day today with multiple ETFs all launching at same time. No clear winner has emerged, all of them were pretty average, lower than I would have predicted, but its a long run and remember, these hold futures (ETF investors much prefer physical to derivatives) https://t.co/fKGOv8T7pP — Eric Balchunas (@EricBalchunas) October 2, 2023\n\nBloomberg ETF analyst Eric Balchunas noted that the trading volumes were “pretty average” and lower than he would have predicted, but said that it was still too early to declare one issuer a winner.\n\nAfter day one, that fund would be Valkyrie’s BTF, which tracks both BTC and ETH futures, and recorded $882,000 worth of trading volume on Monday. Coming in second was VanEck’s EFUT which recorded $312,000 in trading volume.\n\nThe response to the Ethereum futures ETFs is also significantly lower than what was observed on the first trading day of the first Bitcoin futures ETF – ProShares’ Bitcoin Strategy ETF (BITO) – which saw $1 billion in trading volume on its first day, marking the second-highest trading volume in ETF launch history.\n\nIt is worth noting, however, that at the time of BITO’s launch in 2021, Bitcoin was trading at more than $66,000. Both Bitcoin and Ethereum are now trading far lower than their bull market prices – at the time of writing, Bitcoin was trading at $27,600 and Ethereum was trading at $1,660."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYW4tdW5jZXJ0YWluLWZ1dHVyZS1mb3ItZXRoZXJldW0tYW5hbHlzdHMtc2hhcmUtdGhlaXItZXRoLXByZWRpY3Rpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "An Uncertain Future for Ethereum: Analysts Share Their ETH Predictions - BSC NEWS",
        "content": "Explore varied analyst predictions on Ethereum's future. Will ETH regain its peak or plummet in the volatile crypto market?\n\nSummary:\n\nEthereum, the second-largest cryptocurrency, experiences notable price fluctuations, prompting varied expert predictions.\n\nAnalyst Ali Martinez warns of a potential drop to $1200, citing holder losses and weak buying support.\n\nCrediBULL Crypto forecasts a bullish future for ETH, especially in Q4 2023, backed by positive crypto developments.\n\nGareth Soloway predicted a possible decline to $650, though this did not materialize as of June 2023.\n\nTyler Winklevoss optimistically suggests Ethereum could skyrocket to a staggering $75,000 in the future.\n\nEthereum (ETH) has consistently held its ground as a formidable player in the cryptocurrency market. With a staggering market capitalization of $200.68 Billion, it stands as the second-largest cryptocurrency in the blockchain industry, tailing only behind the renowned Bitcoin.\n\nThe asset, in the limelight of market speculation due to its market dominance, has witnessed a rollercoaster of price fluctuations, sparking various predictions from analysts across the globe.\n\nEthereum's journey began with a whitepaper in 2013, described by Vitalik Buterin. The subsequent year saw Buterin and his team secure $18.3 million in Bitcoin through an online public crowd sale, selling over 60 million Ether at $0.311 per unit during the Initial Coin Offering (ICO). The astounding annualized return on investment (ROI) since then has been over 270%, nearly quadrupling investments yearly since its inception in 2014.\n\nGiven Ethereum's historical relevance and impact on the crypto market—dominating it by 18.36% according to CoinMarketCap data, analysts have ventured into predicting its future price movement, especially considering its peak trading at over $4800 in November 2021.\n\nETH Market dominance. Source\n\nAs of the time of writing, 1 ETH stands at $1666.90, prompting several future price speculations. Here’s a look at some of the notable predictions from key individuals in the crypto space:\n\nAli Martinez: A Cautious Perspective\n\nAli Martinez, a notable analyst in the crypto space, expressed his concerns on September 6, when ETH fell below $1680.\n\nLabeling this price range as a “cause for concern,” Martinez warned of a potentially significant price correction to as low as $1200.\n\n#Ethereum below $1,680 is a cause for concern, as it may pave the way for a significant $ETH correction down to $1,200. pic.twitter.com/4XwoxGaofK — Ali (@ali_charts) September 6, 2023\n\nHis predictions, rooted in data from blockchain analytics provider IntoTheBlock, highlighted a concerning number of ETH holders experiencing losses, particularly between the price range of $1,633 to $1,681.\n\nMartinez warned of Ethereum's vulnerability to time capitulation without near-future growth catalysts, potentially leading to a flash crash and a surge in unprofitable addresses among ETH holders.\n\nFast-track to the time of writing, ETH has yet to reach the $1200 level since September 6.\n\nCrediBULL Crypto: Bullish on the Horizon\n\nContrastingly, CrediBULL Crypto envisions a bullish future for ETH, anticipating a market pump in the last quarter of 2023.\n\nThis optimism is backed by positive developments in the crypto space, such as the ETH Futures ETF approval, which he confirmed in response to a user’s post on X.\n\n💯💯💯 been saying this for months. — CrediBULL Crypto (@CredibleCrypto) September 28, 2023\n\nCrediBULL has maintained a bullish stance on ETH despite acknowledging potential short-term bearishness.\n\nHe expects ETH to be one of the first altcoins to follow Bitcoin’s lead should the latter asset witness a significant increase, stating, “I am very bullish on ETH/USD and expect it to be one of the first alts that follows $BTC's lead to the upside.”\n\nWhile I haven't commented on $ETH in a while because my focus right now is $BTC (as I expect it to lead), I think it's worth pointing out that on this latest dip we hit the HTF zone that I previously said would be a \"fantastic buy\" if we get there back in May- and my opinion on… https://t.co/I6g1Tl0Z8F pic.twitter.com/hMyZcskJQL — CrediBULL Crypto (@CredibleCrypto) August 22, 2023\n\nGareth Soloway: A Cautious Optimist\n\nGareth Soloway, a master trader and analyst known for his accurate predictions, had suggested that ETH might plummet to as low as $650.\n\nDespite this, he remains a long-term believer in the asset. During a YouTube interview in December 2022, he highlighted that if ETH broke the $885 to $890 range in June 2023, it could potentially find no major support until dropping to about $650.\n\nHowever, as of June 2023, Ethereum did not reach these predicted levels.\n\nTyler Winklevoss: A Lofty Prediction\n\nTyler Winklevoss, a prominent American investor and founder of the Gemini cryptocurrency exchange, presented a highly optimistic future for Ethereum, predicting it could soar as high as $75,000, according to the Altcoin Daily’s calculation during an interview.\n\nIn the 2020 YouTube interview, he likened Ethereum to “digital oil” and suggested its potential for significant future growth.\n\nNavigating Through the Predictions\n\nThe future of Ethereum, as seen, is painted with several ideologies by different analysts. From cautious perspectives foreseeing potential crashes to optimistic outlooks predicting bullish runs, the predictions are as varied as they are numerous. With its inherent volatility, the crypto market makes any prediction subject to numerous variables and uncertainties.\n\nInvestors and spectators alike must approach these predictions with a discerning eye, understanding that while expert opinions provide insightful perspectives, the cryptocurrency market remains notoriously difficult to predict accurately. Always conduct thorough research before making investment decisions in the ever-fluctuating world of cryptocurrency."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLW9jdG9iZXItNNIBPWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLW9jdG9iZXItND9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for October 4 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBuyers are slightly losing the initiative as some coins have come back to the red zone.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nThe rate of Ethereum (ETH) has joined the list of falling coins, going down by almost 1% over the last 24 hours.\n\nImage by TradingView\n\nOn the hourly chart, the rate of ETH is looking bearish as the price is coming back to the recently formed support level of $1,625. If the daily candle closes near it, the breakout may lead to a further drop to the $1,600 zone soon.\n\nImage by TradingView\n\nA similar picture can be seen on the daily time frame as the bar is about to close below the interim level of $1,637. If that happens, the drop is likely to continue to the $1,600 zone shortly.\n\nImage by TradingView\n\nOn the weekly chart, the rate of Ethereum (ETH) has failed to keep rising after a bullish candle, which means that the main altcoin is not ready yet to rise. In this case, there is a high chance to see a test of the support of $1,542 soon.\n\nEthereum is trading at $1,634 at press time."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZmluYm9sZC5jb20vdG9wLTMtY3J5cHRvLXByaWNlLXByZWRpY3Rpb25zLWJpdGNvaW4tZXRoZXJldW0teHJwLWZvcmVjYXN0cy1mb3Itb2N0b2Jlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Top 3 Crypto Price Predictions: Bitcoin, Ethereum, XRP Forecasts for October - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nOctober is shaping up to be an eventful month for the crypto market, with prices showing increased volatility in recent weeks.\n\nMajor cryptocurrencies like Bitcoin, Ethereum, and XRP could face uncertain conditions that could significantly impact their value.\n\nThis article will provide price predictions for these three cryptos before highlighting one brand-new altcoin that could be poised to surge in October.\n\nBitcoin Faces Resistance at $28k – But Could Push Higher\n\nFirst up is Bitcoin (BTC), which has had a wild ride in 2023 and is up 65% year-to-date (YTD).\n\nAt the time of writing, Bitcoin is trading at $27,530 and appears to be forming higher highs and lower highs on the daily price chart – indicating a strong uptrend.\n\nHowever, this uptrend could be challenged, with BTC rejecting the resistance zone at $28,000 on October 2.\n\nThis resistance zone was also tested on August 29, suggesting it is a significant barrier to Bitcoin’s upward momentum.\n\nThe good news for BTC bulls is that price has yet to react aggressively to this level, meaning the current pullback may only be temporary.\n\nIn the last day, BTC’s price has been trading sideways on the daily chart, yet zooming in to the 4-hour time frame reveals that the bullish momentum may be resuming on a smaller scale.\n\nThis hints that Bitcoin could be poised to test $28,000 once more in the near term.\n\nNotably, crypto experts at Changelly expect the average Bitcoin price to be $30,633 in October, with the minimum price forecast at $26.966.\n\nSupporting this is an analyst’s post on the Binance Feed, stating that BTC must settle above $28,500 if it has any chance of hitting $30,000 by the end of the month.\n\nIf BTC hits this key threshold, it would represent a gain of 8.80% from today’s price.\n\nEthereum ETF Launch Fails to Excite as ETH Faces Downside Pressure\n\nEthereum (ETH) could also be set for an exciting October, mainly due to the recent launch of nine ETH futures ETFs.\n\nAlthough these ETFs saw muted volume on their first day of trading, this could change as more institutional investors begin to allocate resources to them.\n\nUnfortunately for ETH bulls, the launch of futures ETFs didn’t positively affect the token’s value, which is down 6% since Sunday’s high.\n\nETH is currently trading around $1,647 and has breached a minor support zone at $1,650.\n\nAnalysts from AMBCrypto have previously forecast Ethereum’s average price for 2023 will be $2,190 – which indicates that ETH could be in for significant upside potential in the weeks ahead if their forecast holds true.\n\nThis sentiment was reinforced by YouTube analyst Crypto World, who told his audience of 139,000 subscribers that ETH could return to $1,740 if the price bounced from its current level.\n\nHowever, with ETH having posted two bearish daily closes in a row and heading for a third, this outlook may be challenged sooner rather than later.\n\nETH is still up 37% YTD, yet trading volume has dropped 27% in the past day, potentially indicating investor sentiment around the token could be waning.\n\nAll things considered, the coming weeks will be crucial in determining whether ETH can regain its bullish momentum and head back above $1,740 by the end of October.\n\nXRP Builds Momentum After SEC Rejection, But Gains Prove Short-Lived\n\nLastly, XRP (XRP) is also a token to watch in October, given the latest news regarding Ripple Labs’ long-running legal battle with the SEC.\n\nOn October 3, Judge Analisa Torres denied the SEC’s motion to appeal July’s favorable ruling in what was seen as a major victory for Ripple Labs.\n\nAlthough Ripple Labs and the SEC will still be going to trial in April 2024 regarding other issues, the momentum appears to be on Ripple Labs’ side.\n\nSurprisingly, this announcement didn’t significantly affect the price of XRP, which only rose around 7% on the news.\n\nXRP has now given back a significant portion of these gains, with price rejecting the minor resistance zone at $0.540.\n\nHowever, many in the crypto community are still bullish on the token’s prospects.\n\nXRP Whale, a crypto commentator on Twitter, asked his followers, “Who’s ready for $5?” indicating that he believes there’s tremendous upside for XRP.\n\nThis sentiment was reinforced by a YouTube video from NCashOfficial, who laid out a pathway for XRP to hit between $25 and $45 in the coming years.\n\nAlthough these bullish predictions certainly catch the eye, October is likely to be more muted for XRP as the token finds its feet – with a price target of $0.065 being a more likely outcome.\n\nWhich Other Cryptos Could Post Gains in October?\n\nAlthough Bitcoin, Ethereum, and XRP will likely be three of the most talked-about cryptocurrencies this month, other altcoins could be poised for growth.\n\nOne altcoin gaining traction in this regard is Bitcoin Minetrix, which has raised over $450,000 during its ongoing presale phase.\n\nBitcoin Minetrix Presale Builds Momentum as Stake-to-Mine Mechanism Grips Investors\n\nBitcoin Minetrix (BTCMTX) is an innovative platform that lets users earn Bitcoin through a staking model called “Stake-to-Mine.”\n\nThis model allows participation in the crypto mining space without the need for expensive hardware or advanced technical knowledge.\n\nBitcoin Minetrix’s team is conducting a presale before the project’s official launch, with BTCMTX tokens on offer for $0.011.\n\nThe presale will be split into ten stages, each with its own price point – meaning those who invest early will be rewarded with a more favorable rate for acquiring BTCMTX tokens.\n\nMany analysts are bullish on Bitcoin Minetrix’s potential, including YouTuber Michael Wrubel, who highlighted the developers’ comprehensive roadmap as a strong indicator of the project’s long-term success.\n\nBitcoin Minetrix’s potential is also evidenced by the strong response from the social media community, with hundreds of people following the project’s X (formerly Twitter) account over the past week.\n\nGiven that Bitcoin Minetrix solves the major issues plaguing traditional cloud mining systems, like a lack of user control and transparency, it’s no surprise that the project is garnering early attention.\n\nWith BTCMTX tokens expected to debut on several major exchanges before the end of the year, Bitcoin Minetrix could be another project worth watching in the near term.\n\nVisit Bitcoin Minetrix Presale"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmJpdGNvaW5tYXJrZXRqb3VybmFsLmNvbS9ibG9ja2NoYWluLW1vc3QtZGFpbHktYWN0aXZlLWRldmVsb3BlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Top Blockchains With the Most Daily Active Developers (DADs) - Bitcoin Market Journal",
        "content": "At Bitcoin Market Journal, we talk a lot about Daily Active Users (DAUs), and today, we’ll look at a different type of daily active user: the developer.\n\nThese are the people actively creating the blockchains we use. And they are just as important to growth as the end-user. Developer contributions directly impact crypto projects’ valuation, stability, and future.\n\nIn this article, we’re going to cover some of the central questions about DAD and its importance for investors:\n\nWho are daily active developers?\n\nWhat role do they play in blockchain ecosystems?\n\nWhat can crypto investors learn from a fundamental analysis of DAD metrics?\n\nHow do the numbers and growth in daily active developers compare with that of daily active users regarding the overall value of the blockchain?\n\nWhat are Daily Active Developers?\n\nIn simple terms, anyone actively involved in the regular development and maintenance of software in the blockchain space is called a daily active developer (DAD). The term can be used to refer to both individual developers and developer teams.\n\nElectric Capital, compiler of the blockchain Developer Reports, looks at blockchain projects from the perspective of open-source commits to projects through platforms like Github. In other words, “active developers” are actively making and publishing changes to the blockchain’s code.\n\nDADs come from diverse backgrounds and work in various capacities from all over the globe. We can broadly divide DADs into the following categories:\n\nCore Development Teams : The major cryptocurrencies have underlying blockchain protocols. The development and maintenance of these protocols are handled by teams of software developers, engineers, and data scientists. They are typically at the forefront of innovation in the blockchain space.\n\n: The major cryptocurrencies have underlying blockchain protocols. The development and maintenance of these protocols are handled by teams of software developers, engineers, and data scientists. They are typically at the forefront of innovation in the blockchain space. Independent Contributors : Open-source development plays a crucial role in crypto. Outside core teams, thousands of independent developers and blockchain enthusiasts contribute their time and expertise to improve specific features or look for bug fixes in crypto projects, often voluntarily.\n\n: Open-source development plays a crucial role in crypto. Outside core teams, thousands of independent developers and blockchain enthusiasts contribute their time and expertise to improve specific features or look for bug fixes in crypto projects, often voluntarily. Startups and Service Providers : Employees of blockchain-based startups and major companies also fall under the definition of daily active developers. They are usually involved in developing wallet services, dApps, smart contracts, and other crypto projects.\n\n: Employees of blockchain-based startups and major companies also fall under the definition of daily active developers. They are usually involved in developing wallet services, dApps, smart contracts, and other crypto projects. Academic Researchers: Universities and research institutions also play a defining role in crypto. Various protocols and blockchains often start as research projects involving professors and students in an academic setting. For example, the Zcash crypto project started at Johns Hopkins University in 2013.\n\nWhat Do Active Developers Do?\n\nDADs are the brains behind blockchains. The blockchain ecosystem wouldn’t exist without the contributions of these developers. They are the ones who develop a blockchain protocol codebase from scratch, creating core functionalities and features.\n\nYou need active developers to test the code, fix bugs, optimize performance, improve security, patch out vulnerabilities, provide community support, offer technical assistance, create documentation, and conduct other forms of routine maintenance.\n\nEverything in the crypto sphere relies on developer output, from protocol hard forks and upgrades to new smart contracts and dapps. Many senior DADs also work in crypto governance roles. Vitalik Buterin, the co-creator of Ethereum, is an excellent example of this.\n\nWhy Measure Daily Active Developers?\n\nCrypto investors can glean valuable insights by closely examining the active developers behind a particular blockchain, project, or app. Here are some key performance indicators that tell us a blockchain project is getting traction:\n\nDeveloper Interest : When many developers consistently flock to a protocol, it is usually a good indicator of the project’s long-term viability. For example, due to its large number of developers, Ethereum is widely expected to overtake bitcoin at some point and become the world’s most valuable crypto – an event dubbed “the flippening.”\n\n: When many developers consistently flock to a protocol, it is usually a good indicator of the project’s long-term viability. For example, due to its large number of developers, Ethereum is widely expected to overtake bitcoin at some point and become the world’s most valuable crypto – an event dubbed “the flippening.” Not surprisingly, Ethereum has consistently ranked at the top of the pile in daily active developers. At 5,946 in June 2023, it has nearly three times as many total developers as the next-highest project (Polkadot). High levels of developer interest are usually an indicator of the stability, maturity, and long-term viability of a blockchain project.\n\nCompetitive Advantage : Skilled talent is needed in any IT field. The same is also true in crypto, especially during growth markets like 2022. There is extreme competition between various projects and companies for talented developers. If a project retains or increases its DAD counts, it is usually a sign of its advantage over its competitors.\n\n: Skilled talent is needed in any IT field. The same is also true in crypto, especially during growth markets like 2022. There is extreme competition between various projects and companies for talented developers. If a project retains or increases its DAD counts, it is usually a sign of its advantage over its competitors. Again, Ethereum leaves all other blockchain projects in the dust here. The number of full-time developers at Ethereum has increased by 35% since 2021, indicating high activity levels across its ecosystem. More DADs improve a project’s ability to polish existing features, innovate, and gain a competitive advantage.\n\nCommunity Support and Engagement : Hype often plays a critical role in the early stages of a crypto project. It is useful to increase awareness among users and eventually develop a community around the project. Having many active developers, especially those who actively post on social media about the project, is a good sign.\n\n: Hype often plays a critical role in the early stages of a crypto project. It is useful to increase awareness among users and eventually develop a community around the project. Having many active developers, especially those who actively post on social media about the project, is a good sign. Constant interaction between users and developers can also contribute to the evolution of the project. It creates feedback loops that allow developers to find problems faster and figure out essential features for improved user experience.\n\nDADs as an Investor Valuation Metric\n\nThe market price, token supply, token ownership, market cap, and daily active users are all valuable metrics for evaluating cryptocurrencies. However, these metrics are largely focused on the demand side of the equation.\n\nA balanced assessment of crypto requires an in-depth understanding of the supply side as well. Supply metrics from a crypto POV include tokenomics, governance, security, bug hunting, smart contract support, cross-chain interoperability, and more.\n\nAll this requires massive volumes of software code. The number of available developers will determine a project’s ability to manage these responsibilities and complete critical tasks quickly.\n\nIn short, the contributions from DADs affect cryptocurrency valuation in the following ways:\n\nProject Health : The size of a project’s developer community can tell you a lot about what people in the know think about its viability and prospects. A higher number of DADs indicate that the crypto is healthy and vibrant.\n\n: The size of a project’s developer community can tell you a lot about what people in the know think about its viability and prospects. A higher number of DADs indicate that the crypto is healthy and vibrant. Stability and Security : The codebase of cryptocurrencies is constantly threatened by hackers and cybercriminals looking for flaws and vulnerabilities. Having more hands on deck for patching, bug fixing, and code reviews helps improve the stability and minimize the security risks of crypto.\n\n: The codebase of cryptocurrencies is constantly threatened by hackers and cybercriminals looking for flaws and vulnerabilities. Having more hands on deck for patching, bug fixing, and code reviews helps improve the stability and minimize the security risks of crypto. Innovation and Adaptability : Crypto projects must continue. They must constantly improve and evolve, adding new features and use cases to drive user adoption. A higher DAD count indicates that the crypto is more likely to succeed.\n\n: Crypto projects must continue. They must constantly improve and evolve, adding new features and use cases to drive user adoption. A higher DAD count indicates that the crypto is more likely to succeed. Trust and Market Perception: For insights, seasoned investors and crypto users look at the developer community behind cryptos. A strong and active DAD community helps build trust and confidence in the project among users, investors, and other stakeholders. Solana, which has been under pressure due to its connection with FTX, is a good example.\n\nThe Relationship Between DADs and Users\n\nThe “network effect” is an economic concept where the value of a network increases exponentially as more people use it. It has played a critical role in many industries in recent years, including social media and e-commerce platforms.\n\nIn crypto, the rise of most tokens can be attributed to the network effect. It involves a close relationship between developers and users through several dynamic stages:\n\nThe User Adoption Stage : The process starts with creating the initial codebase of the project. The development team then markets the project among potential users by publishing whitepapers, social media, airdrops, influencers, and bounty programs.\n\n: The process starts with creating the initial codebase of the project. The development team then markets the project among potential users by publishing whitepapers, social media, airdrops, influencers, and bounty programs. Community engagement is critical here. Developers often engage in forum discussions, conduct AMA sessions, and answer queries on social media handles to interact with their audience and increase awareness about the project.\n\nCommunity Building : In the second stage, the continued interaction between developers and users helps amplify the network effect in several ways. It increases trust in the project and helps it gain credibility. High engagement levels eventually lead to strong communities that market the crypto to other potential users.\n\n: In the second stage, the continued interaction between developers and users helps amplify the network effect in several ways. It increases trust in the project and helps it gain credibility. High engagement levels eventually lead to strong communities that market the crypto to other potential users. Feedback Loops and Value Generation : When developers constantly interact with users, the result is a mutually beneficial exchange of information. Support from developers helps the project become more user-friendly, increasing its adoption rate.\n\n: When developers constantly interact with users, the result is a mutually beneficial exchange of information. Support from developers helps the project become more user-friendly, increasing its adoption rate. Developers also gain valuable feedback and constructive criticism from daily users of the crypto/project. They can use these insights to improve the codebase further, identify potential security threats early, and generate more user value.\n\nWhen a team consistently delivers exciting new features, quality-of-life improvements, and bug fixes to a software project, you will generally see a steady uptick in active users. Having more DADs can help crypto attract more daily active users.\n\nBitcoin, NEAR, Ethereum, and BNB are all on top of our list of blockchains with the most daily active users. These are also crypto ecosystems with hundreds of full-time developers, according to the latest figures from DeveloperReport.com.\n\nEmerging Ecosystems and Small Chains\n\nSince 2020, the crypto market has launched hundreds of new blockchain projects, including Layer-1 protocols. While most of these have faded into obscurity, several notable exceptions exist.\n\nFrom a daily active developer count perspective, three stand out as of this writing: Sui, Aptos, and Osmosis. The Sui Network recorded a 444% increase in its full-time developer count in 2023, coinciding with the launch of its token in April 2023.\n\nAptos has been around since early 2022, increasing its DAD count by 191%. Launched in June 2021, Osmosis has increased its total developer count by 296% over two years. All three projects have between 200 and 300 total developers as of this writing.\n\nTo put things in perspective, other established blockchains have clocked a decline in developer counts since the beginning of the bear market in 2022 – examples include Algorand (-63%), Avalanche (-57%), and NEAR (-51%).\n\nAptos and Sui have received millions of dollars in funding from major investors like a16z, Binance Labs, Accel Partners, Tiger Global, and Multicoin Capital. Similarly, Osmosis Labs counts Paradigm and Ethereal Ventures among its main backers.\n\nIn market cap, Aptos is ranked 36, Sui is 88, and Osmosis is much lower at 157. And yet, these emerging blockchain ecosystems manage to attract both investors and developers, indicating considerable future growth potential.\n\nThey highlight the importance of looking beyond price and market cap when researching new crypto investments. Factors like investor funding activity and rising developer counts often hint at the future growth potential of emerging ecosystems.\n\nInvestor Takeaway\n\nThe spectacular market crash in 2022 resulted in $2 trillion in crypto losses. Major tokens like Bitcoin and Ethereum lost over 60% of their peak valuation. And yet, we only saw a marginal decrease in daily active developer counts between 2022 and 2023.\n\nMore crucially, the developers contributing over 80% of the code commits for years are still actively involved in crypto. Most developers are in crypto for the long haul, boding well for the industry's long-term growth.\n\nAs crypto winter leads to spring, this is another reason investors need to include DADs as a metric for fundamental research in crypto.\n\nDevelopers are the architects of crypto’s fundamental infrastructure. They build and maintain the codebase, interact with users, and help in community growth. Development and innovation are necessary for growth in crypto, and developers are the bellwether for both.\n\nSubscribe to Bitcoin Market Journal to learn about the metrics that make blockchain and crypto the most valuable assets."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtYnRjLWNvdWxkLXNoYXR0ZXItMjgtMjAwLWR1cmluZy1uZXh0LXJ1bi0yMDIzMTAwNDE5MjjSAZcBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLXJpcHBsZS1idGMtY291bGQtc2hhdHRlci0yOC0yMDAtZHVyaW5nLW5leHQtcnVuLTIwMjMxMDA0MTkyOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC, ETH, XRP move around as market volatility resumes - FXStreet",
        "content": "Share:\n\nBitcoin price has a chance at the $30,000 psychological level if it overcomes the $28,200 barrier.\n\nEthereum price could extend the fall with a pending sell signal about to execute. Traders should watch for $1,585 level.\n\nRipple price coils up and could breach the $0.5604 hurdle in the next lift-off.\n\nBitcoin (BTC) price is showing that volatility could be coming back to the market, with the same case going for Ethereum (ETH) price as the two giants recently recorded tight consolidation. Meanwhile, Ripple (XRP) price is trying to overcome a crucial hurdle, standing at a crossroads in a make-or-break moment for holders.\n\nAlso Read: Bitcoin bull market awaits as US faces 'bear steepener' – Arthur Hayes\n\nBitcoin price needs to clear $28,200 first\n\nBitcoin (BTC) price is sitting on strong support downward, presented by the 100-day Exponential Moving Average (EMA) at $27,331 and the confluence between the 50- and 200-day EMAs around the $26,988 level.\n\nThe odds still favor the upside, with the Relative Strength Index (RSI) above 50 and the Awesome Oscillators (AO) histograms still green in the positive territory.\n\nThe level to beat at this point is the $28,200 hurdle, which has proven formidable since the August 17 crash. A break and close above it would give Bitcoin price a chance at contending with the previous range low at $28,708.\n\nReclaiming above levels last seen pre-Evergrande catastrophe and SpaceX rumors, would make $30,000 psychological level plausible, potentially even going as high as the $31,172 range high.\n\nBTC/USDT 1-day chart\n\nConversely, if Bitcoin price folds and closes below the critical support at $26,988, it could invalidate the bullish outlook, potentially dropping to the September 25 lows around the psychological $26,000, or in the dire case, extend the losses to the range low at $25,140. Such a move would constitute an 8% fall below current levels.\n\nAlso Read: Bitcoin price will likely hit $22,800 before 2024 should it follow its nine-year pattern\n\nEthereum price is not done with the downtrend\n\nEthereum (ETH) price could extend the ongoing slump and test the demand zone at the $1,600 psychological level. This view is reinforced by the RSI about to execute a sell signal by crossing below the signal line (yellow) band.\n\nA break and close below the midline of this order block (ranging between $1,600 and $1,571) at $1,585 would confirm a downtrend, bringing the $1,552 range low in sight. The AO histogram bars are already turning red, suggesting bears are having their say.\n\nETH/USDT 1-day chart\n\nOn the flip side, if Ethereum price can flip the 50-day EMA back to a support floor at $1,667, prospects for more gain would revitalized, confirmed by a decisive candlestick close above the 200-day EMA at $1,731. ETH could target the supply zone at $1,733 from here.\n\nAlso Read: Ethereum ETFs fail to live up to hype: combined trading volume amounts to just $1.7 million\n\nRipple price readies for a steep climb\n\nRipple (XRP) price continues along an ascending trendline, invigorated by a positive development in the SEC vs. Ripple case. The RSI position above 50 spurs optimism and could make another move north soon as momentum grows.\n\nThe AO histogram bars support this stance, and Ripple price could shatter the $0.5604 level soon. A break and close above this level would set the tone for XRP to target the supply zone between the $0.6146 and $0.6432 range.\n\nXRP/USDT 1-day chart\n\nOn the other hand, profit booking could cut the rally short, sending Ripple price below the support offered by the ascending trendline at $0.5199, its confluence with the 200 EMA. A decisive candlestick close below the $0.5000 psychological level would invalidate the bullish outlook.\n\nAlso Read: Ripple victory over SEC reaffirmed as Judge Torres denies regulator’s motion to appeal"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMDQvdGhlLXByb3RvY29sLXdoaWNoLWV0aGVyZXVtLWxheWVyLTItcHJvamVjdC1pc250LWNvbXBldGluZy10by1sYW5kLWNlbG8v0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8xMC8wNC90aGUtcHJvdG9jb2wtd2hpY2gtZXRoZXJldW0tbGF5ZXItMi1wcm9qZWN0LWlzbnQtY29tcGV0aW5nLXRvLWxhbmQtY2Vsby9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "The Protocol: Which Ethereum Layer-2 Project ISN’T Competing to Land Celo? - CoinDesk",
        "content": "BLOCKCHAIN BAKE-OFF! In July, when the smart-contracts blockchain Celo proposed to ditch its independent “layer-1” status in favor of becoming a layer 2 network atop Ethereum, the people behind the project may have had little inkling of just how popular they would become. Now there’s suddenly a burst of competition among veteran layer-2 teams to supply the technology for Celo’s new system. The migration initially was supposed to rely on Optimism’s OP Stack software kit, which served as the template not only for Coinbase’s new Base blockchain but also the Binance-incubated BNB Chain’s new opBNB network. Then last month, Polygon injected itself into the mix, offering up its Polygon Chain Development Kit, known as Polygon CDK, as an alternative. As of last week, there’s yet another suitor to host Celo: Matter Labs, the creators of another rollup, zkSync, as well as the ZK Stack open-source software, which can be used to create new “hyperchains” on Ethereum. “The modular and open-sourced ZK Stack is the optimal L2 stack for Celo’s transition to Ethereum,” according to the Matter Labs proposal. “We hope to trigger an honest, open discussion amongst the Celo and zkSync communities regarding the tradeoffs between the ZK Stack, the OP Stack, Polygon CDK and other options.” Coming in the depths of crypto winter, the episode offers a reminder of the intensity of the consolidation trend, with the various networks scrambling to find fresh business."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9vcHRpbWlzbS1uZXR3b3JrLWxhdW5jaGVzLXRlc3RuZXQtZmF1bHQtcHJvb2Ytc3lzdGVtLXB1cnN1aXQtZGVjZW50cmFsaXphdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Optimism network launches testnet fault-proof system in pursuit of decentralization - Cointelegraph",
        "content": "OP Labs, the developer of the Optimism network, launched a testnet version of its fault-proof system, according to an Oct. 3 blog post. Once it completes testing, it will allow for “a more decentralized and efficient Superchain,” the post stated. The new system is currently deployed to the Optimism Goerli network.\n\nOptimism Goerli block explorer. Source: Etherscan\n\nCurrently, OP Stack-based networks use centralized sequencers to bundle transactions and submit them to Ethereum. Users cannot submit fraud proofs to block the sequencer if it submits incorrect data, creating the possibility of fraudulent transactions being confirmed if an attacker can control it. L2Beat has warned of this risk in its report on Optimism, stating, “users need to trust block Proposer to submit correct L1 state roots.”\n\nOP Stack-based networks like Optimism and Base are intended to be optimistic rollups — a type of layer 2 that relies on Ethereum for its security. In a January 2021 essay, Ethereum co-founder Vitalik Buterin argued that optimistic rollups must allow users to submit fraud proofs to block fraudulent withdrawals to Ethereum. Otherwise, they’re not truly decentralized.\n\nIn November 2022, Buterin claimed that some rollups could have “training wheels” that keep them temporarily centralized while they work on a fraud-proof system but argued that they should work toward decentralization.\n\nOP Labs claims the new fault-proof system will help fulfill the goal of decentralization for OP Stack networks: “The system is designed to eventually enable secure bridging without central fallback.”\n\nRelated: BNB Smart Chain Optimism-powered layer-2 opBNB hits mainnet\n\nIn addition, it claimed the new system is modular, allowing each network to develop its own system for preventing fraud. It consists of three separate components: a fault-proof program (FPP), a fault-proof virtual machine (FPVM) and a “dispute game protocol.” Because these three components can be implemented separately, it opens up the possibility for each network to “custom-build a fault proof system.”\n\nAccording to the post, this will create more diversity in the Optimism Superchain, ultimately making the whole ecosystem more secure. A network could even decide to use zero-knowledge proofs (ZK-proofs) as a type of fraud-proof, the team stated. ZK-proofs are generally utilized in zero-knowledge rollups, but not Optimistic ones.\n\nOP Labs has been trying to build an interconnected web of blockchain networks called the “Superchain.” To accomplish this, it created the OP Stack, a set of software tools that can be used to create custom blockchain networks. Avail network has created “OpEVM” software designed to accomplish the same objective while using Avail as the base layer instead of Ethereum. Polygon’s ZK Supernets and zero-knowledge Ethereum Virtual Machine Hyperchain are other examples of Superchain competitors.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2ZpbmJvbGQuY29tL2xhdW5jaHBhZC14eXotdHJhZGluZy1zaWduYWxzLWdyb3VwLXByZWRpY3RzLWV0aGVyZXVtLXByaWNlLWNyYXNoLWhlcmVzLXRoZS1iZXN0LWNyeXB0b3MtdG8tYnV5LWR1cmluZy10aGUtZGlwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Launchpad.xyz Trading Signals Group Predicts Ethereum Price Crash, Here's The Best Cryptos To Buy During The Dip - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nThe crypto market has experienced a relatively underwhelming couple of months, with Bitcoin stuck between $25-$32K since March. While many other top cryptos have followed a similar path, Launchpad XYZ’s Telegram signals group has been on a tear. It has made numerous 10-30x trading calls and protected its community from market dips.\n\nIts profitable calls have been widely celebrated, yet the most lucrative trade may be buying its native token, $LPX, currently in presale.\n\nLaunchpad XYZ Telegram Group Warns of Upcoming Ethereum Crash\n\nAlthough the Launchpad XYZ platform is renowned for its profitable calls on emerging cryptos, its analytics tools also warn investors of impending market risk.\n\nA recent Launchpad XYZ Telegram community update warned that Ethereum’s price could be about to crash. The analytics platform leverages several cutting-edge tools to forecast the market’s next move, then prompts Telegram members with signals to help boost their profitability.\n\nFollowing its recent call, investors could short or sell Ethereum, helping protect from losses and even profit.\n\nAnother notable call the team made was a buy signal for a meme coin called ELON 2.0. Following the signal, the token rocketed in price, netting some investors a 29x profit.\n\nIt also made early calls on ECHOES and WAGIEBOT, which pumped 10x and 11x, respectively.\n\nThere are endless examples of Launchpad XYZ making such calls. The community can attest to this in its trading success room on its presale Telegram channel.\n\nOne of the exciting things about Launchpad XYZ is that users can buy a lifetime membership for a low fee.\n\nThe project is currently in its presale, and those who buy $50 worth of $LPX get a free NFT and lifetime access to the signals group. In comparison, many other signal providers charge over $50 monthly, with much less proven success.\n\nAnother benefit to the $LPX token is that it holds notable upside potential since it powers the Launchpad XYZ ecosystem. Users require it to pay for pioneering tools like an AI trading assistant, a trading terminal, decision-making frameworks, a learning platform, and much more.\n\nThe platform is one of the best ways for users to find new emerging projects before they explode. This provides significant demand for the $LPX token, potentially bolstering its price.\n\nVisit Launchpad XYZ\n\nBesides the $LPX token, three other promising cryptos to buy now are Bitcoin Minetrix, Meme Kombat, and TG Casino.\n\nBitcoin Minetrix Lets Users Easily Mine Bitcoin By Staking on Ethereum\n\nAlthough the broader crypto market looks bleak, Bitcoin Minetrix ($BTCMTX) is one of the most promising cryptocurrencies, boasting a groundbreaking use case that has captured the attention of investors and prominent analysts.\n\nThe project facilitates Bitcoin cloud mining, with users simply staking the $BTCMTX token on its Ethereum-based protocol. Essentially, users stake $BTCMTX, receive cloud mining credits, and burn them in exchange for Bitcoin cloud mining power, resulting in free Bitcoin.\n\nAs well as that, presale investors can earn free $BTCMTX tokens right away by selecting the “Buy and Stake” option when purchasing the presale.\n\nIts compelling use case provides a no-fuss, no-expertise-needed way for anyone to begin mining Bitcoin on the Ethereum blockchain. Also, incorporating the decentralized $BTCMTX token solidifies the project’s transparency and security, eliminating the risk of cloud mining scams, which are common in the industry.\n\nTop analysts have weighed in with their predictions for the project. YouTuber Jacob Bury called it the next 10x potential presale, noting that it mines Bitcoin for you as its main advantage.\n\nSince users require $BTCMTX to begin earning Bitcoin, this provides massive demand potential, which translates to upside potential. Furthermore, staking bolsters its supply-side tokenomics since most tokens will be locked in the platform’s smart contract.\n\nAs such, investors looking to buy the Bitcoin Minetrix token for a low price should not wait, as it could explode once it goes live on exchanges.\n\nVisit Bitcoin Minetrix Presale\n\nP2E Staking Coin Meme Kombat Lets Users Wager on Meme Character Battles and Offers 112% Staking APY\n\nAnother project illustrating massive upside potential is Meme Kombat ($MK). With the fall of Pepe and other top meme coins like Dogecoin and Shiba Inu, there is a gap in the market for the next meme coin king.\n\nMeme Kombat wants to fight for the crown, hoping to win over investors with added utility and generous community rewards.\n\nThe project blurs the line between P2E and meme coins, enabling users to wager $MK on battles between meme characters. There are numerous game modes, including player vs. player and multiple player vs. game options. It leverages traditional odds mechanics to provide fair and engaging gambling.\n\nIts other core feature is its staking mechanism, offering a fixed 112% annual percentage yield (APY). This is well above the market average, with Ethereum staking offering just 4% APY. Moreover, given its viral meme coin allure and utility-driven tokenomics, Meme Kombat likely holds significantly higher upside potential.\n\nDespite just launching, the presale has already raised over $230K. With its next goal at $1 million, investors looking to secure a low price should act fast. Presale investors can also begin staking and compounding their holdings right away.\n\nVisit Meme Kombat Presale\n\nAnonymous Telegram-Based Casino TG Casino Raises $360K at Presale and Offers 1,176% Staking APY\n\nThe popularity of crypto casinos has been booming recently. Therefore, traders are punting on the next one to explode, and TG Casino ($TGC) has proved a favorite.\n\nTG Casino is a Telegram-based casino offering KYC-free, secure, and private gambling on hundreds of games and events. The project is one of the first Telegram-based casinos to be fully licensed and regulated, providing investors with peace of mind that they are engaging with a legitimate and reputable platform.\n\nIt has just launched its native $TGC token in presale and has raised over $360K in under a week. The presale’s goal is to reach just $1 million, which it will hit very soon.\n\nTG Casino’s token offers holders a range of benefits, like rewards, exclusive access to games and rooms, and an impressive staking APY of 1,176%.\n\nFurthermore, presale buyers will receive additional rewards following its exchange launch, and those who invest over $5K will be deemed “high rollers,” receiving exclusive NFTs and other benefits.\n\nOn top of that, the $TGC token looks primed to explode. Besides its ecosystem utility, TG Casino’s buyback mechanism could bolster its price. It will repurchase $TGC tokens with a portion of the platform’s revenue, then 60% will be allocated to staking rewards, and 40% will be burned.\n\nThis adds buying pressure to the token while alleviating supply through burning, hinting at long-term potential.\n\nYet, with the presale selling fast, investors are running out of time to secure $TGC at a fixed price.\n\nVisit TG Casino Presale"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzA0L3Bvb3Itd2Vlay1mb3ItZXRoZXItcHJvbXB0cy1yZXNlYXJjaC1maXJtLXRvLXJldmVyc2Utb3V0bG9vay1hZHZpc2UtZmF2b3JpbmctYml0Y29pbi1pbnN0ZWFkL9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzA0L3Bvb3Itd2Vlay1mb3ItZXRoZXItcHJvbXB0cy1yZXNlYXJjaC1maXJtLXRvLXJldmVyc2Utb3V0bG9vay1hZHZpc2UtZmF2b3JpbmctYml0Y29pbi1pbnN0ZWFkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Poor Week for Ether Prompts Research Firm to Reverse Outlook, Advise Favoring Bitcoin Instead - CoinDesk",
        "content": "“We will likely see stabilization and modest recovery in the short term should BTC improve,” Enigma head of research Joe Edwards wrote. “If we do indeed see momentum drop into November and prices in general start trailing downwards, expect to see ETH move outsizedly to the downside as part of that move towards ETH-BTC 0.05.”"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8xMC8wMy8yNzU0MjMyLzAvZW4vSW50cm9kdWNpbmctRHVtYi1Nb25leS1UaGUtR2FtZS1DaGFuZ2luZy1DcnlwdG8tUHJvamVjdC1vbi10aGUtRXRoZXJldW0tQ2hhaW4uaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Introducing Dumb Money: The Game-Changing Crypto Project on the Ethereum Chain - GlobeNewswire",
        "content": "CALIFORNIA CITY, CA, Oct. 03, 2023 (GLOBE NEWSWIRE) -- In a world where traditional finance has left many feeling like mere spectators, a group of passionate individuals decided it was time to take matters into their own hands. Inspired by the GameStop saga that captivated the world, they proudly embraced the label of \"APE\" and embarked on a mission to reshape the financial landscape. Today, Dumb Money, a crypto project on the Ethereum Chain, is unveiled to the public, poised to revolutionize the way investments are perceived.\n\n\n\n\n\nThe GameStop saga served as a rallying point for a new generation of investors who chose to be called \"APES.\" This term gained fame in the crypto world, symbolizing a united community's strength against conventional markets. Drawing inspiration from this movement, some of these \"APES\" from Reddit and GameStop decided to code their own project Dumb Money ($GME) , a symbol of community unity against traditional financial systems.\n\n\n\n\n\n\n\nAs part of this revolutionary journey, Dumb Money is proud to announce the launch of the DumbMoney Movie, an event that promises to make waves on Twitter. The community behind Dumb Money believes that their collective strength will propel them to new heights of popularity and connection within the crypto world.\n\n\n\n\n\n\n\nDumb Money's mission is clear: to bring together every \"APE\" on Earth, gather all the \"degens,\" and elevate everyone together. This community is here to disrupt the system and turn the financial market on its head. Imagine sharing stories of massive gains from $GME, not from traditional stocks, but from the Ethereum blockchain. It's a thrilling vision, and Dumb Money aims to make it a reality.\n\n\n\n\n\n\n\nWith an experienced and passionate team, dedicated moderators, professional developers and a community that lives by the mantra of ‘HODL’, Dumb Money is well on its way to the moon and beyond.\n\n\n\n\n\n\n\nFor more information and to get involved, please visit the official resources:\n\n\n\n\n\nWebsite: https://www.dumbmoneytoken.vip\n\nTelegram: https://t.me/DumbMoneyERC\n\nTwitter: https://twitter.com/DumbMoneyERC\n\n\n\n\n\n\n\n\n\nDisclaimer:\n\n\n\nThe information provided in this release is not investment advice, financial advice, or trading advice. It is recommended that you practice due diligence (including consultation with a professional financial advisor) before investing or trading securities and cryptocurrency.\n\n--"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LmZvb2wuY29tL3RoZS1hc2NlbnQvY3J5cHRvY3VycmVuY3kvbmZ0LW1hcmtldHBsYWNlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Best NFT Marketplaces for March 2024 - The Motley Fool",
        "content": "Here's a recap of the top NFT marketplaces right now.\n\n1. OpenSea\n\nOpenSea is the leader in NFT sales. OpenSea has all sorts of digital assets available on its platform, and it's free to sign up and browse the extensive offerings. It also supports artists and creators and has an easy-to-use process if you want to create your own NFT (known as \"minting\").\n\nThe marketplace supports more than 150 different payment tokens, so the platform's name is appropriate. For an introduction to the NFT world, OpenSea is a great place to start.\n\n2. Axie Marketplace\n\nAxie Marketplace is the online shop for the video game Axie Infinity. Axies are mythical creatures that can be bought and trained and then pitted against other players' Axies to earn rewards. On Axie Marketplace, players can buy new Axies, as well as entire lands and other items, as NFTs for use within the game.\n\nAxie Infinity tokens (called Axie Shards) are built on the Ethereum blockchain. As such, they can be bought and sold on a variety of other NFT marketplaces, as well as on some cryptocurrency exchanges such as Coinbase Global (NASDAQ:COIN).\n\n3. Larva Labs/CryptoPunks\n\nLarva Labs is best known for the viral CryptoPunks NFT project. They were originally given away for free back in 2017, but some CryptoPunks have sold for millions of dollars since then. Larva Labs has other digital art projects going such as Autoglyphs, as well as other Ethereum blockchain-based app development projects.\n\nLarva Labs' CryptoPunks NFTs are sold out, but they can be bid on and bought from various third-party marketplaces. Nevertheless, Larva Labs' various projects are worth keeping tabs on -- including the Meebits, which can be bid on directly from the company's built-in marketplace.\n\n4. NBA Top Shot Marketplace\n\nNBA Top Shot is the National Basketball Association and Women's National Basketball Association's foray into the NFT world. On its marketplace, collectible moments (video clips and play highlights) and art can be purchased from the world's premier basketball leagues.\n\nThe NBA built it as a closed marketplace (you can only buy and sell on Top Shot) using the Flow blockchain built by Dapper Labs. It's easy to sign up and buy directly on the Top Shot marketplace website. Collectible moments can be purchased for as little as a few dollars.\n\n5. Rarible\n\nRarible is another large marketplace for all sorts of NFTs, similar to OpenSea. All kinds of art, videos, collectibles, and music can be bought, sold, or created on the platform. However, unlike OpenSea, you'll need to use the marketplace's own token Rarible (CRYPTO:RARI) to buy and sell on the marketplace. Rarible is built on the Ethereum blockchain (although artwork can be managed on OpenSea as well using Rarible tokens).\n\nThe company has partnered with some notable companies. Yum! Brands' (NYSE:YUM) Taco Bell has listed art on Rarible, and cloud software giant Adobe (NASDAQ:ADBE) recently partnered with Rarible to help secure NFT artists' and creators' work.\n\n6. SuperRare\n\nSimilar to Rarible, SuperRare is also building a marketplace for digital creators. The site includes art, videos, and 3D images, but collectors can purchase artwork using Ethereum.\n\nSuperRare recently announced its own token of the same name based on the Ethereum blockchain. The tokens will be used to find and curate new talent for the marketplace. Like Rarible, SuperRare NFTs can also be bought and sold on OpenSea.\n\n7. Foundation\n\nFoundation.app was designed as a simple, no-frills way to bid on digital art. Sales are made using Ethereum. Since the marketplace's launch in early 2021, it has sold more than $100 million of NFTs.\n\nArtists are invited to the platform by the Foundation community, and buyers simply need a crypto wallet funded with Ethereum to start making purchases. If you're looking for a quick and easy way to start creating your own NFTs, Foundation probably isn't the best place to begin, but the marketplace has plenty of artwork that can be perused in a simple format.\n\n8. Nifty Gateway\n\nNifty Gateway has facilitated the sale of some of the most popular digital artists such as Beeple and singer/musician Grimes. It's an art curation platform powered by the crypto exchange Gemini (controlled by the Winklevoss twins). The NFTs, known as Nifties, are built on Ethereum.\n\nBesides being a curated platform, Nifty Gateway also hosts any NFTs purchased -- meaning the NFTs aren't stored in your own wallet but are actually stored for you by Nifty Gateway and Gemini. While that may not work for NFT collectors who want more flexibility with their art investments, Nifty purchases and sales also can be made in fiat currency (e.g., U.S. dollars) without making a cryptocurrency purchase first.\n\n9. Mintable\n\nMintable, backed by billionaire Mark Cuban, aims to be an open marketplace similar to OpenSea. To participate in buying and selling NFTs on Mintable, you'll need Ethereum. The platform also supports minting of NFTs for creators of all types (from photographers to musicians) who want to sell their work as a digital asset.\n\nAn aspiring NFT collector or creator will need to purchase Ethereum from a crypto exchange first, then connect their wallet to Mintable to facilitate bidding and buying on the marketplace.\n\n10. Theta Drop\n\nTheta is a blockchain platform built for the decentralized distribution of video and TV on the internet. The NFT marketplace Theta Drop made its debut in 2021 with the World Poker Tour's digital collectibles. The World Poker Tour was an early adopter of ThetaTV and uses the platform to stream content.\n\nTheta utilizes its own blockchain technology. To participate in the Theta Drop NFT marketplace, you'll need to purchase Theta Token (CRYPTO:THETA). Various crypto exchanges such as Binance support Theta, and the tokens and NFTs purchased with them can be stored in a crypto wallet, as well as in Theta's own crypto wallet app."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY3J5cHRvdHZwbHVzLmNvbS8yMDIzLzEwL3ZpdGFsaWtzLWZvdXItbGVzc29ucy1vbi10aGUtZnV0dXJlLW9mLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Vitalik's Four Lessons on the Future of Ethereum - CryptoTvplus",
        "content": "Vitalik Buterin has cautioned the Web3 community, especially those focused on Ethereum, on the future of the blockchain he co-founded.\n\nEthereum is a decentralized global software platform often referred to as “the world’s programmable blockchain.” It positions itself as an electronic, programmable network with a built-in Turing-complete programming language.\n\nThanks to its programmability, numerous applications worth billions of dollars have been built on the platform. As a result, the protocol has undergone several evolutions, implementing a series of proposals.\n\nOn the flip side, there has been a surge of curiosity surrounding integrating features like privacy, advanced cryptography, account safety, censorship resistance, frontrunning protection, and more into the core protocol.\n\nTo approach this aspect carefully, Vitalik imparted four fundamental lessons that should shape the inclusion of additional utilities within the layer one blockchain.\n\nEnshrining features mitigate centralization risks elsewhere\n\nAccording to Vitalik, embedding certain features outside the Ethereum core offers the advantage of minimizing the likelihood of centralization. Simplifying the base protocol allows for increased flexibility.\n\nNonetheless, he cautioned about the potential risks of centralization within the external ecosystem, often due to elevated fixed costs. Despite these risks, it remains beneficial in reducing de facto centralization.\n\nPossibility of straining protocol trust and governance\n\nAnother lesson pointed out by the co-founder is that when too much is added to the Ethereum core, there is a likelihood that it will be overwhelmed due to overload.\n\nThe effect of this is that trust and governance of the protocol can be affected, potentially weakening Ethereum’s credibility.\n\nToo much load can increase in protocol complexity\n\nThe third reflection of Vitalik is that when too much is given to the Ethereum core, it can also result in a more complex protocol. “Protocol complexity is a systemic risk, and adding too many features in-protocol increases that risk,” he said.\n\nHe provided an example of how the implementation of Precompiles on the Ethereum blockchain has fallen short of expected usefulness over the years. Precompiles are contracts implemented on the Ethereum blockchain via client code, instead of EVM smart contract code.\n\nClient code refers to the code running on Ethereum clients or nodes, which are software implementations that interact with the Ethereum blockchain. They are mostly written in programming languages like JavaScript, Python, or Go.\n\nEVM (Ethereum Virtual Machine) smart contract code, on the other hand, is the code that defines the behavior of smart contracts on the Ethereum blockchain. EVM smart contract code is written in Solidity or other programming languages that can be compiled into bytecode\n\nUnpredictable user needs\n\nVitalik also added that the reason behind treading cautiously on the Ethereum core is that enshrined features may not align with users’ actual needs, which can change over time, potentially becoming underutilized.\n\nVitalik suggested a middle road, where the protocol enshrines specific pieces to address key challenges without being overly opinionated.\n\n“Rather than enshrining a full liquid staking system, enshrine changing staking penalty rules to make trustless liquid staking more viable; rather than enshrining more precompiles, enshrine EVM-MAX and/or SIMD to make a wider class of operations simpler to implement efficiently; and rather than enshrining the whole concept of rollups, we could simply enshrine EVM verification.”\n\nUltimately, he said that the debate over what to enshrine in the protocol and what to leave to other layers will continue to evolve as the blockchain ecosystem advances and user needs become clearer."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bS10YWtlcy10aGUtbGVhZC1vdmVyLWJpdGNvaW4tc3BvdGxpZ2h0LW9uLTMtbmV3LWVyYy0yMC10b2tlbnMtcG9pc2VkLWZvci1vY3RvYmVyLXN1Y2Nlc3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Takes the Lead Over Bitcoin: Spotlight on 3 New ERC-20 Tokens Poised for October Success - Analytics Insight",
        "content": "Ethereum ($ETH) recovers and takes the lead over Bitcoin ($BTC)!\n\nThe fact is that in recent days, Ethereum ($ETH) is slowly breaking the downward trend, and is slowly returning “to the starting road”. Things are looking good for Ethereum ($ETH), and many crypto experts, guided by the recent increase in the value of this crypto, believe that in the coming period, $ETH could even surpass Bitcoin ($BTC)!\n\nWhat drives crypto experts to position $ETH above $BTC is that Ethereum, in their opinion, has a much higher utility value, but also a much higher potential for further upgrading.\n\nThe opposite group of crypto experts will still position Bitcoin above Ethereum, and the main argument for that is that, in their opinion, Ethereum lost its ability to be decentralized due to the transition to the proof-of-stake consensus mechanism.\n\nSo who should you listen to, experts who believe in the success of Ethereum or those who have hopes for Bitcoin’s success? The advice is to look at the situation realistically and based on the available information, judge for yourself what is a better investment.\n\n>>> Buy The Best Coin Now<<<\n\nThe value of Bitcoin ($BTC) is currently hovering around $27,132, and by the end of the year, this crypto could reach a maximum value of around $27,604.54, in the best-case scenario. As for Ethereum ($ETH), this crypto could reach a value of $2,000 in the same period, which, you will admit, compared to its current value of $1,679.51, is a really good result.\n\nHowever, even though Ethereum is slowly threatening to take the lead over Bitcoin, the fact that crypto experts are not convinced that the victory of $ETH over $BTC will happen brings uncertainty and doubt among crypto users, who now simply do not know what to do and whose advice to follow.\n\nPrecisely because of these differing opinions, users prefer to invest in coins that experts agree will explode in price very quickly, which are set for big gains, and which at the same time do not require huge investments. At this moment, the entire crypto world has put the spotlight on 3 new ERC-20 tokens poised for October success, namely Bitcoin Minetrix ($BTCMTX), Meme Kombat ($MK) and Chancer ($CHANCER).\n\n>>> Buy The Best Coin Now<<<\n\nBitcoin Minetrix ($BTCMTX): A new, innovative ERC-20 token which is an ideal choice for October!\n\nCrypto experts are convinced that investing in the young Bitcoin Minetrix ($BTCMTX) is the ideal choice for October because this innovative cryptocurrency brings a handful of benefits to users!\n\nBitcoin Minterix ($BTCNMTX), primarily aims to simplify the process of mining Bitcoin in the cloud, which users accepted with great delight. This is supported by the fantastic success of Bitcoin Minetrix presale and more than $265,000 raised so far, which certainly confirms that!\n\nThe Bitcoin Minetrix platform allows users to easily and simply buy $BTCMTX tokens, and just as easily stake them to earn cloud mining credits. What also affects the growing interest in $BTCMTX is that users have the opportunity to generate passive income, which means that the Bitcoin Minetrix platform offers a fantastic opportunity: for earning through mining but also for phenomenal rewards!\n\nIt is predicted that Bitcoin Minetrix ($BTCMTX) will continue to flourish even during “Uptober”, so it would be best to grab it as soon as possible, while it can be bought at a great price of only $0.011 per token!\n\n>>> Buy Bitcoin Minetrix Now<<<\n\nMeme Kombat ($MK): a new exciting crypto project you shouldn’t miss!\n\nAnother young crypto project for which crypto experts have positive predictions, and which shows huge chances for success in October (much higher than Ethereum and Bitcoin), is Meme Kombat ($MK).\n\n>>> Buy Meme Kombat Now<<<\n\nMeme Kombat ($MK) managed to position itself as extremely promising in record time, because by combining memes, artificial intelligence, and blockchain technology, it provides users with a comprehensive and unique gaming experience, and allows them to simultaneously “stake, play and get rewards”.\n\nA particularly interesting feature of the Meme Kombat ($MK) ecosystem is the Battle Arena, and to enjoy everything this Battle Arena has to offer, the only thing required is the possession of a native $MK token. By owning the $MK token, you will not only be able to experience all that the Meme Kombat ecosystem has to offer, but you will also make a wise crypto-related step, considering that the $MK token is set for huge gains (some of the crypto influencers believe potentially even 100x). So, jump into the Meme Kombat ecosystem ASAP, and grab $MK coin while its price is only $1,667!\n\n>>> Buy Meme Kombat Now<<<\n\nChancer ($CHANCER): Another new ERC-20 token that arouses the user’s interest.\n\nChancer ($CHANCER) is another new ERC-20 token that arouses users’ interest, but it must be noted that crypto experts, despite the solid start of this coin’s “career”, do not have high hopes for its success, at least not during October.\n\n>>> Buy The Best Coin Now<<<\n\nChancer ($CHANCER) presale is taking place solidly, however, although this crypto project has a clear and concrete vision, unfortunately, there is little chance that $CHANCER will explode in price in the future and realize some significant gains.\n\nThe Chancer platform indeed provides users with a fair and transparent betting experience, but the fact is that, although the very start of the $CHANCER token presale seemed promising, over time that interest decreased. Users have massively reoriented themselves to crypto projects that offer more from the very start, such as the projects we talked about a little while ago.\n\n>>> Buy The Best Coin Now<<<\n\nConclusion\n\nThere are chances that Ethereum will take the lead over Bitcoin, but that does not mean that $ETH should be your first choice because there are far more promising cryptos that require less investment and promise much more! If you are looking for “the next big thing”, be sure to pay attention to young and promising coins that are poised for October’s success. Don’t miss out on Bitcoin Minetrix ($BTCMTX) and Meme Kombat ($MK) and grab them while the price is this good!\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi92aXRhbGlrLWJ1dGVyaW4tZGV0aGVyZXVtLWFsZXJ0ZS1zdXItdW4tZXZlbnR1ZWwtZGVyYXBhZ2UtZGVzLWRhby0yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Ethereum and Systemic Crisis: Vitalik Warns Against DAOs - Cointribune EN",
        "content": "Tue 03 Oct 2023 ▪ 4 min of reading ▪ by Mikaia A.\n\nVitalik Buterin, who had recently engaged in extensive discussions about the possibility of integrating even more features into Ethereum, has once again made waves in the cryptosphere. In his view, Ethereum staking pool operator DAOs could be the source of a major systemic crisis. Let’s take a closer look!\n\nConcerns Over Ethereum’s DAOs\n\nIn a recent publication, Vitalik Buterin advocated at length for the potential integration of more advanced features directly into Ethereum. This may contradict the fundamental philosophy of blockchain, which emphasizes minimal complexity. However, it won’t prevent the deployment of layer 2 applications and solutions on Ethereum.\n\nDans un récent article de blog, Vitalik Buterin, cofondateur d'Ethereum, met en garde contre les vulnérabilités possibles aux attaques lorsque les pools de liquidité adoptent l'approche DAO. https://t.co/N9iH88BAwY — Cointelegraph France (@FRCointelegraph) October 1, 2023 Cointelegraph France\n\n“Vitalik Buterin, co-founder of Ethereum, warns that when DAOs control node operators in staking pools, they could become an ‘attackable governance gadget’ if a single staking token becomes dominant.”\n\nAccording to Cointelegraph, Vitalik has a solution to reduce the chances of such a danger associated with the current DAO approach to node operator governance. Note that these decentralized autonomous organizations also manage the funds of ETH pools.\n\nHere is the opinion of Ethereum’s co-founder:\n\n“Each version of staked ETH needs to have some mechanism determining who can be the underlying node operators. It can’t be unrestricted, because then attackers would join and amplify their attacks with users’ funds. Currently, the top two are Lido, which has a DAO whitelisting node operators, and Rocket Pool, which allows anyone to run a node if they put down 8 ETH (ie. 1/4 of the capital) as a deposit. These two approaches have different risks: the Rocket Pool approach allows attackers to 51% attack the network, and force users to pay most of the costs. With the DAO approach, if a single such staking token dominates, that leads to a single, potentially attackable governance gadget controlling a very large portion of all Ethereum validators. To the credit of protocols like Lido, they have implemented safeguards against this, but one layer of defense may not be enough.”\n\nSpeaking of such an attack, we have Curve Finance, which paid a heavy price for a vulnerability in its pools. The crypto community, as well as Ethereum developers, would not want a similar incident to recur.\n\nFears of Ethereum Centralization\n\nEthereum’s shift from Proof-of-Work (PoW) to Proof-of-Stake (PoS) has completely changed the landscape across the ecosystem. The Merge has indeed made the blockchain more environmentally friendly.\n\nIf in 2022, Ethereum’s energy consumption ranged from 90 to 115 terawatt-hours, The Merge has nearly reduced it to zero: 0.03 kilowatt-hours per transaction. Perhaps the research commissioned by the European Union on this subject will confirm (or not) the accuracy of these figures.\n\nThe Shapella update, successfully implemented by the Ethereum team in April, has revised the ETH staking process. Liquid staking providers like Rocket Pool and Lido, mentioned earlier, are among the major beneficiaries of this mini-revolution.\n\nWhen analysts tackled Ethereum’s centralization issues, many pointed fingers at Lido, which currently holds 72% of all staked ETH tokens.\n\nIs this Vitalik Buterin’s goal, as he did not overlook this pseudo-centralization of Ethereum in his recent exposition? The integration of additional features into the blockchain could address this situation. And concerning this security matter, Vitalik has already announced, in another blog post, the creation of secure ETH wallets.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiuAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iZXN0LWNyeXB0b2N1cnJlbmN5LWNvaW5zLWd1aWRlLXRvLXRoZS10b3AtY3J5cHRvLXByb2plY3QtYW5kLW5ldy1leGNpdGluZy1jb2lucy13aXRoLXNoaWJhLWludS1taW5hLXByb3RvY29sLWRvZ2Vjb2luLWV0aGVyZXVtLWFwZW1heC1zb2xhbmEtYW5kLW1vcmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Best Cryptocurrency Coins | Guide to the Top Crypto Project and New Exciting Coins with Shiba Inu, Mina Protocol ... - Analytics Insight",
        "content": "The year 2023 is pulsating with the rhythm of cryptocurrency innovation. As the landscape expands, certain projects and tokens are emerging as luminaries, illuminating the path for crypto enthusiasts. Among the newest recruits, ApeMax takes the spotlight, enthralling the crypto community with its boost features and a growing crypto presale.\n\nDefinitive List of Best Crypto Coins for 2023:\n\nAs we navigate 2023, myriad cryptocurrencies are seizing attention, but a select few emerge as distinct leaders. Here’s a curated list of crypto coins and blockchains turning heads this year:\n\nEthereum: Holding its status as the beacon for decentralized applications (DApps) and smart contracts, Ethereum is an immutable presence in the crypto cosmos. ApeMax: Gaining accolades for its “Boost-to-Earn” mechanism, ApeMax is stirring conversations and boasting a fast developing crypto presale. Bitcoin: The progenitor of decentralized digital currencies, Bitcoin’s legacy as a crypto titan remains unchallenged. Solana: Its emphasis on high-speed transactions and scalability has catapulted Solana to the top echelons of crypto projects. Shiba Inu: Transcending its meme coin origins, Shiba Inu’s consistent evolution keeps it in the spotlight. Mina Protocol: Lauded for its compact and efficient blockchain solution, Mina Protocol is a name to watch. Dogecoin: Embracing its meme coin roots, Dogecoin continues to thrive, powered by its global recognition as the top dog in the meme coin space.\n\nSpotlight on ApeMax: The 2023 Crypto Marvel\n\nApeMax is not just another name in the vast crypto roster; it’s something new and unique. As a meme coin, it fuses humor with a revolutionary Boost-to-Earn staking mechanism. This decentralized protocol allows token holders to not only stake but also to showcase which are their favorite staking entities, potentially earning rewards in a decentralized environment.\n\n>> Learn More about ApeMax Here <<\n\nSetting the bar high, ApeMax introduces immediate self-custody during its presale, a rarity in the crypto world. This means participants have instant access to their tokens, paving the way for real-time staking and possible rewards. Such a novel and transparent model is positioning ApeMax as a trailblazer in the crypto realm.\n\nThe Pulse of Crypto Trends in 2023:\n\nCrypto trends in 2023 can be bucketed into several categories. Below are 3 distinct emerging trends affecting the world of blockchain:\n\nSmart Contract Stalwarts: Ethereum, Solana, and Cardano remain the pillars for decentralized applications, propelling the NFT, GameFi, and DeFi sectors. Concurrently, side chains and Layer 2 solutions are ushering in fresh competition.\n\nMeme Coins & Their Evolution: While Dogecoin, Shiba Inu, and Pepe Coin bask in their meme coin glory, the meme coin space continues to evolve. With Dogecoin’s technology-driven advancements and Shiba Inu’s Layer 2 prowess, the meme coin genre remains electrifying. ApeMax, one of the newest young entrants, adds a zesty twist, adding its unique style to the meme coin arena.\n\nZero-Knowledge Innovations: The rise of ZKSync, StarkNet, and Mina Protocol signal a shift towards addressing Ethereum’s gas fee concerns. These Layer 2 solutions focus on bolstering transaction efficiency and cost-effectiveness, priming the blockchain for possible broader adoption.\n\nConcluding Thoughts:\n\n2023’s cryptocurrency landscape presents an invigorating blend of legacy coins and cutting-edge newcomers. While enduring superstars like Ethereum retain their gravitational pull, newcomers like ApeMax herald the dawn of innovative crypto concepts. Crypto engagement requires vigilance, ample independent due diligence and a deep understanding of the risks present in all cryptocurrencies. While cryptocurrencies are a hub of innovation, they are equally fraught with volatility and risks. This piece isn’t financial advice. The particularities of crypto entails that it may not be everyone’s cup of tea. For ApeMax enthusiasts, it’s pivotal to note that acquisition restrictions exist in specific geographies. The ineligible places include countries such as the USA and Canada amongst several others. A thorough perusal of the ApeMax official website is essential to determine region-specific guidelines and eligibility requirements before making any acquisition decisions.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90b3AtMTAtY3J5cHRvLXByaWNlcy1mb3Itb2N0b2Jlci0zLTIwMjMtZXRoZXJldW0tYml0Y29pbi1hbmQtcGVwZS1jb2luLWV4cGVyaWVuY2UtZGVjbGluZXMtb24tb2N0b2Jlci0zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "Top 10 Crypto Prices for October 3, 2023: Ethereum, Bitcoin, and Pepe Coin Experience Declines on October 3 - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMTAvMDQvdml0YWxpay1idXRlcmluLW9wZW5seS1yZWZsZWN0cy1mdXR1cmUtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Vitalik Buterin openly reflects on the future of Ethereum: should the protocol add more functionality? - The Cryptonomist",
        "content": "In a post published on 30th September on his personal blog, Vitalik Buterin addressed some very sensitive issues, the main topic being the future of Ethereum.\n\nIn his speech, we find reflections on the challenges and opportunities facing the Ethereum community, especially in the areas of ZK-EVM rollups, liquid staking and private mempools.\n\nThe gist of the discussion can be summed up in a very precise question that Vitalik posed at the beginning of his blog: does it make sense to add more functionality to the protocol or is it better to aim for a minimalist structure?\n\nObserving the changes in the blockchain landscape over the last few years, Vitalik has come up with 5 important lessons that reflect the modus operandi with which this question should be approached, and which we should all take inspiration from.\n\nLet’s look at the details together.\n\nVitalik Buterin and philosophical reflections on Ethereum’s past and future\n\nVitalik Buterin, a prominent figure in the world of blockchain, published a post on his personal blog a few days ago in which he discusses some philosophical topics about the future of Ethereum and its community.\n\nThe founder of the world’s most famous smart contract development platform began the post by reflecting on the priorities the protocol set for itself in its early years, which now seem to have changed with the evolution of society and the entire decentralised ecosystem on which Ethereum orbits.\n\nIn fact, in the beginning, the ultimate goal of his blockchain was to make the backbone as simple as possible and to make the maximum effort to build as many applications on top of it as possible.\n\nIn 2013, Vitalik and his initial team’s idea was to build a virtual machine that would be operated through a blockchain check, which would essentially result in a call to the machine itself.\n\nIn recent years, however, there has been a strong interest in the community to include as much functionality as possible in the main protocol, without leaving it to the rest of the world to solve the challenges that have arisen over the years.\n\nAmong these, we now find narratives that focus more on the mere issue of scalability that has always plagued Ethereum’s global computer, but we also find user needs that range from the simple exchange of digital resources to issues of privacy, account security, resistance to censorship and even advanced cryptography.\n\nThe basic question that Vitalik Buterin poses in the published text is therefore this:\n\nShould the Ethereum protocol include more features?\n\nLet us try to be more specific by reporting Vitalik’s thoughts on Zk-EVM rollups, private mempools and liquid staking.\n\nShould Ethereum build more functionality into the protocol? The challenge of ZK-EVM rollups\n\nLooking at each of Vitalik Buterin’s thoughts on the future of Ethereum and whether or not the protocol structure should be enshrined by adding or removing functionality, we can see the following.\n\nStarting with the topic of ZK EVM rollups, which are increasingly present as L1 scaling structures that use off-chain computation tests to offload the main chain, Vitalik addresses the controversy surrounding the possibility of running into bugs in ZK code.\n\nIn fact, many ZK projects have a “safety board” that can be consulted in the event of bugs in the test systems. The doubt concerns how these roll-up networks should handle the level of trust in the test systems and in the safety board.\n\nThe way forward seems to be to give less and less power to these bodies, which are made up of people who think outside the blockchain information.\n\nThere are plans to start supporting “quasi-EVM” versions with custom code tested by other systems, which can act as a hybrid for these complications.\n\nIn conclusion, the consecration of ZK EVMs holds both promise and challenges: for now, the underlying technology is immature and requires exceptional human control.\n\nMore complex designs could be added as the technology develops.\n\nPrivate Mempools and Liquid Staking\n\nLet’s turn to the topic of private mempools: With the increasing notoriety of MEV bots on Ethereum, Vitalik Buterin and the entire community started thinking about alternative solutions to avoid the damage caused by attacks such as frontrunning transactions.\n\nAs the pools are currently public and visible to everyone, an MEV can easily be ‘corrupted’ by paying more fees than necessary and choosing the order in which it wants the Tx to be executed in order to gain financial advantage at the expense of the end user.\n\nTo solve this problem (which actually also has benefits for DEXs, such as lower price spreads and stability of lending protocols), some developers have come up with a kind of private mempool that can keep users’ transactions encrypted until they are added to a blockchain, thus reducing the profit opportunities for MEVs.\n\nThe problem, however, is that such schemes require a special kind of encryption: which, to put it simply, must be self-decrypting once the transaction is actually irrevocably accepted.\n\nUnfortunately, there is no single solution that is reliable enough to be practically accepted at Layer 1.\n\nTherefore, consecrating anti-frontrunning functionality at layer 1 seems a difficult proposition, at least until delayed encryption is perfected. Again, the complexity of Ethereum’s structure is viewed positively, but we still need time and compromises.\n\nFinally, on the liquid stakes front, Vitalik Buterin’s thoughts are related to the risk of future centralisation that Ethereum could suffer from given the growth of certain protocols such as Lido and RocketPool.\n\nIn the short term, the most immediate solution is to convince the community to use a variety of providers so that no single entity gets too big.\n\nThe experiment has already failed, as several providers have appealed to stakers, without success, trying to eliminate part of Lido’s marketshare, which to date amounts to 32%.\n\nSince moral pressure has not worked, Vitalik leaves the door open to the simple creation of a fungible ETH staking token in the protocol, possession of which would grant governance access to choose who manages the nodes.\n\nThere are actually other, more complex ways to address the risk of centralisation of the system, such as committees of random depositors voting off-chain to decide the management of nodes, but this would undermine the concept of collective power.\n\nAs ideas and concerns about this sensitive issue grow, Vitalik concludes by simply saying that the way forward is not all black or all white, but that there is the possibility of “sanctioning some things and leaving other things to the users”.\n\nVitalik Buterin’s 5 conclusions from his reflections on the future of Ethereum\n\nAt the end of his post, Vitalik Buterin draws some conclusions based on his previous observations about the future of Ethereum and the doubts about whether or not to include as much functionality as possible in the protocol.\n\nBelow we summarise 5 interesting lines of thought from Vitalik:\n\n1- In order to understand whether the consecration is right or not, it is necessary to be aware of the fact that blockchains are social systems and not personal computing platforms.\n\nThinking along these lines can help to provide answers to the challenges that arise in the future.\n\n2- Consecration of functions can help avoid the risks of centralisation in other parts of the stack. However, too much consecration can strain the trust and governance of the protocol and compromise Ethereum’s neutrality.\n\n3- A cross between minimal consecration and full consecration of all functionalities may be the right way forward as the technology evolves. This is especially true for liquid staking.\n\n4- Dedication may prove counterproductive in the long run, as user needs are unpredictable. Features that we consider essential today may not be widely used in the years to come.\n\n5- It could be highly beneficial to simplify or even eliminate certain functionalities, such as pre-calculations that optimise contracts to save time and gas prices."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMTAvMDMvY2xhc2gtY3J5cHRvLWZvdW5kZXItc29sYW5hLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 03 Oct 2023 07:00:00 GMT",
        "title": "The clash between crypto founder: Solana accuses Ethereum - The Cryptonomist",
        "content": "A few days ago, Anatoly Yakovenko, founder of the Solana crypto project, strongly criticised Ethereum for creating a social hierarchy that seems to benefit the upper-middle class at the expense of the working masses.\n\nThe accusations are mainly related to Vitalik Buterin’s concept of centralising the validators of the chain, as the access requirements are limiting for the lower classes.\n\nIn fact, in order to join the group of independent validators, it is necessary to have at least 32 ETH, or about 53,000 dollars at the current exchange rate.\n\nVitalik had previously praised Solana’s developer community, calling them “serious” and saying that the project could survive for years to come.\n\nLet’s look at all the details together.\n\nLatest news from the crypto world: Solana’s founder thinks Ethereum is only for the upper middle class\n\nThe latest news from the crypto world is about the clash between Ethereum and Solana, specifically Anatoly Yakovenko and some heavy accusations made 2 days ago on X (formerly Twitter).\n\nThe founder of the Solana blockchain, born in 2018 with the nickname “Ethereum Killer”, stated that although the rival network was conceived as the engine of a decentralised economy open to all, so far it has turned out to be a tool dedicated exclusively to the upper middle class.\n\nIn the published text, words such as “oppression” and “stateless digital domain” can be read, highlighting the most negative aspects of the world’s second most capitalised crypto project after bitcoin.\n\nHere is the original tweet.\n\nIn the grand theatre of economic transformation, Ethereum presents itself not as a harbinger of genuine revolution, but merely as a novel spectacle of bourgeois upheaval. As the petite bourgeoisie revel in this digital carnival, the visage of oppression subtly transforms, yet its… — toly 🇺🇸 (@aeyakovenko) October 1, 2023\n\nThe core of Anatoly Yakovenko’s speech concerns the strict requirements needed to become an autonomous validator within the Ethereum protocol, which act as an access barrier for the poorer masses.\n\nIn fact, it is common knowledge that in order to access Ethereum stakes as a validator, one must block a minimum of 32 ETH, which at the current price of the cryptocurrency is equivalent to over $53,000.\n\nAs of today, we can count a total of approximately 126,000 Ethereum addresses holding at least 32 ETH. With a total of 245.9 million unique addresses on the network, we can conclude that only 0.05% of all addresses can participate in the validation of network blocks.\n\nAs the more experienced in the industry probably know, there are alternative ways to participate in Ethereum staking (not validation), such as using third-party services like Lido, Rocket Pool, Frax and Stakewise, where the minimum requirements are more affordable and in everyone’s pocket.\n\nThe problem is that the trend towards liquid staking (LSD) platforms is only helping to further centralise the chain, with Lido having a market share of over 32% in coin staking.\n\nThis narrative has been echoed in recent weeks by many representatives of these platforms who are looking for a solution to limit the power of Lido and the richer middle class masses.\n\nAdd to this the fact that Ethereum has always been defined as a chain for the rich, as the commission costs to execute a TX are much higher than its current competitors.\n\nSolana vs. Ethereum: comparing the two blockchain networks\n\nThe harsh words of the founder of the Solana crypto project make even more delicate a competitive relationship that has been going on for years, with the two blockchains fighting for market supremacy.\n\nTo tell the truth, it is mainly Solana and its exponents who have centred the narrative of the “L1 killer” as a marketing tool to attract new traffic to the network, followed by the “Ethereum fan boy” who has responded punctually in tone on social media to remind them of their superiority.\n\nVitalik Buterin, on the other hand, has never shown any rivalry with Solana, even going so far as to praise the community of crypto network developers as a group of “serious and smart people”.\n\nIn June 2023, Vitalik himself expressed his solidarity with the repressive actions of the US federal authorities, who were trying hard to define SOL as a security, suggesting that he would be happy to see the blockchain landscape expand in favour of other competitors such as Solana.\n\nThe one comment I'll make is that I feel bad that @solana and other projects are getting hit in this way. They don't deserve it, and if ethereum ends up \"winning\" through all other blockchains getting kicked off exchanges, that's not an honorable way to win, and in the long term… — vitalik.eth (@VitalikButerin) June 30, 2023\n\nIf we look at the data of both networks, it is easy to see that Ethereum is the most used in all areas: from the number of active addresses, to the volume moved on-chain, to the number of dApps built on it.\n\nOn Ethereum, for example, we can count a number of active addresses of 12.65 million in September 2023 against Solana’s 6.13 million, as well as three times the volume generated on-chain.\n\nAll this is not due to a better technology or a more functional blockchain architecture, but simply to the fact that Ethereum is a historical chain, born long before its “rival”, which has gained public legitimacy as the main blockchain engine of the DeFi and NFT market, given and also taking into account the stress tests it has been able to face.\n\nSolana, despite being cheaper, faster and accessible to everyone, still suffers from some problems related to the synchronisation of nodes and it happens very often that it goes down for a few minutes/hours. And let’s not forget the beating it took immediately after the collapse of FTX in November 2022, which was the project’s main backer.\n\nA struggle for supremacy or a silly narrative?\n\nReturning to Anatoly Yakovenko’s talk, we feel it is worthwhile to provide some food for thought regarding the future of the decentralised network landscape in the coming years.\n\nAs investors and supporters of each other’s projects wage war on each other on social media, they come up with complex techniques to generate FUD, it is important to realise that no one here cares about the “war for supremacy”.\n\nIf one or the other blockchain were to disappear in the next few years, it would be detrimental to the entire cryptographic industry.\n\nWhat really matters is that the industry as a whole grows to a market that can satisfy both sides.\n\nWe are not here to make political propaganda or to start a war between rich and poor.\n\nWe are here to support a world that in its broader background sees the participation of a long series of protocols and networks that contribute to creating a parallel economy that fully expresses the concept of financial freedom, disconnected from financial intermediation and bank control."
    }
]