[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wcmVtaWVyLWxlYWd1ZS1nZXRzLWV0aGVyZXVtLWJhc2VkLWRpZ2l0YWwtY2FyZHMtd2l0aC1zb3JhcmUtcGFydG5lcnNoaXDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Premier League gets Ethereum-based digital cards with Sorare partnership - Cointelegraph",
        "content": "Blockchain-powered fantasy sports firm Sorare has sealed a deal with the English Premier League to mint Ethereum-based digital player cards on its platform.\n\nSorare has driven an interesting use case for Ethereum-based fantasy sports and digital card trading in recent years, offering fans the ability to mint, collect and trade various player cards with other users across a variety of nonfungible token (NFT) marketplaces.\n\nCointelegraph reached out to Sorare to clarify details of their latest deal, bringing the Premier League to the fingertips of football fans. While the partnership was officially announced on January 30, a Sorare spokesperson said discussions between the league and the company had been ongoing for a lengthy period.\n\nPremier League player cards are available on Sorare’s platform, with some “super rare” cards already valued at over $100 or more.\n\nSorare began to make moves within the Premier League network in 2019, signing West Ham United as its first English club as a partner of its platform. Cointelegraph has learned that the League and Sorare have agreed to a four-year deal, with the value of the partnership undisclosed for contractual reasons.\n\nRelated: Web3 projects aim to create engagement between fans and sports leagues\n\nThe company spokesperson also broke down the deal’s structure, with Sorare making an upfront downpayment to the league for licensing rights. From there, digital card sales result in a percentage split between Sorare and the Premier League.\n\nSorare mints digital cards of players from the Premier League on the Ethereum blockchain. The platform has long used ERC-721 token standard for its NFT player cards, which fans can collect and trade and use to play on the platform’s free-to-play fantasy sports league.\n\nThe Premier League digital cards will be available for initial purchase on Sorare before being available for trading on compatible marketplaces like OpenSea. The fantasy sports platform continues to be a proponent for connecting fans, players and organizations with blockchain technology:\n\n“For Sorare, this underlying technology is the means, not the ends, to connecting users with their favourite clubs, and we welcome it powering the next generation of sports fandom and entertainment.”\n\nNFTs, including digital trading cards and highlights from various sporting codes, have become popular collectibles in recent years. NBA Top Shots exploded in popularity in 2021, while the football world has continued to see synergies with blockchain-based platforms."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vcm1pLm9yZy9jcnlwdG9jdXJyZW5jeXMtZW5lcmd5LWNvbnN1bXB0aW9uLXByb2JsZW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Cryptocurrency’s Energy Consumption Problem - Rocky Mountain Institute",
        "content": "Shares\n\nCryptocurrency’s Energy Consumption Problem\n\nWhat has been done and what still needs to be done to decarbonize crypto.\n\nCryptocurrency has an energy consumption problem. Bitcoin alone is estimated to consume 127 terawatt-hours (TWh) a year — more than many countries, including Norway. In the United States, cryptocurrency activity is estimated to emit from 25 to 50 million tons of CO 2 each year, on par with the annual emissions from diesel fuel used by US railroads.\n\nDecarbonizing the crypto industry thus remains essential to achieving a safe climate future. Yet, while RMI is proud to have played a role in initial decarbonization efforts in the crypto industry, moving forward, we will focus on decarbonizing the grid rather than crypto transactions.\n\nIn this article, we reflect on the state of the crypto industry: what work has been done so far, the challenges of decarbonizing crypto, and how RMI will continue to pursue this goal as part of our larger effort to decarbonize global supply chains.\n\nProgress to Date\n\nAs exorbitant electricity consumption from crypto mining became a public concern, RMI’s first step was to act as a co-convener of the Crypto Climate Accord (CCA), along with our partners Energy Web, the Alliance for Innovative Regulation (AIR), and the World Economic Forum. The CCA serves as a “private sector-led initiative focused on decarbonizing the cryptocurrency and blockchain industry,” where solutions and technologies for crypto decarbonization are created collaboratively among players across the web3 and crypto space.\n\nAs part of the CCA, RMI spearheaded the development of the CCA Accounting Guidance, a foundational guide to allocating emissions for the crypto industry. The guidance highlights the importance of a consequential accounting approach and the use of marginal emissions rates as a key to understanding crypto’s emissions impact. The guidance further supports the need to gauge grid impact rather than average emissions when assessing emissions impact.\n\nThis initial work was followed by participating in a roundtable during the drafting of the Crypto Climate Impact Accounting Framework, developed by the Crypto Carbon Ratings Institute (CCRI) and South Pole. This framework sought to define a methodology for allocating GHG emissions for crypto transactions and holdings. Because institutional investors hold an outsized stake of the crypto market, allocating emissions for these activities is vital to pressure both investors and crypto industry leaders to change their current practices.\n\nChallenges with Crypto Decarbonization\n\nProof-of-work energy usage\n\nWith lawmakers increasingly looking at the effects of Bitcoin mining, from both an environmental and grid-resiliency perspective, lowering energy usage of this crypto currency is a must. Bitcoin is the only major currency that uses proof-of-work mining. The large energy usage associated with proof-of-work mining is an inevitable consequence of the fundamental nature of its algorithms.\n\nEthereum moved to a far less energy intensive proof-of-stake consensus mechanism, reducing that network’s electrical usage by over 99.9 percent. (Here’s a discussion of the difference between proof-of-work and proof-of-stake.) A single transaction on Ethereum’s proof-of-stake network is now similar to the electrical usage of a Mastercard transaction. As a result, when we speak of the emissions impact of “crypto,” we are now largely speaking about the emissions impact of Bitcoin.\n\nTo mitigate crypto industry emissions, RMI supports the “Change the Code, Not the Climate” campaign, launched by Greenpeace and the Environmental Working Group, intended to motivate Bitcoin to move away from proof-of-work and toward a less energy-intensive consensus mechanism.\n\nA co-benefit of Bitcoin changing its consensus mechanism would be to mitigate Bitcoin’s significant e-waste problem. As proof-of-stake and other low energy protocols require less computing power and no specialized equipment, Bitcoin ditching proof-of-work would mean the network would require far less hardware — an additional win for the climate.\n\nPrice volatility\n\nIn addition to energy usage and e-waste, the price volatility associated with Bitcoin and other cryptocurrencies is a cause for concern. When prices are high, Bitcoin miners may be willing to power their operations with clean electricity. But as the price of Bitcoin comes down, smaller profit margins mean industry players are likely to seek out the cheapest electricity possible, which may not always be the cleanest. Digiconimist currently estimates a “cost percentage” of Bitcoin mining, which shows that miners spend a majority of their income on electricity.\n\nFurthermore, there are attempts to use Bitcoin for demand response on power grids, with Texas’ ERCOT being the prime example. There are concerns, however, about the ability of Bitcoin miners to be relied upon for these services. If prices are too high, miners won’t prioritize limiting power usage, putting increased pressure on a grid that has experienced significant stress in recent years.\n\nElectricity procurement\n\nWith emissions on the scale of entire countries, it is imperative for Bitcoin mining, in the absence of changing to a low-energy consensus mechanism, to be powered by new renewable energy, rather than drawing from existing renewable capacity. Because of the flexibility of Bitcoin’s load, or its ability to be mined anywhere in order to balance energy supply and demand, miners who are conscious about their footprint should be able to contract renewable energy to power their operations. Unfortunately, as public data from Greenpeace shows, this is not currently the case. Bitcoin miners are largely contracting energy from fossil sources and claims of sustainability tend to be based on being co-located near renewables.\n\nSome Bitcoin miners may not have direct control over their electricity usage if their mining computers are contracted out to larger data centers. This, combined with the fact that miners are not longstanding businesses with well-established credit, may make it difficult to dictate their electricity supply. In order to drive further renewable energy generation, rather than take credit for an existing portion of renewable capacity, Bitcoin miners must contract renewable energy directly.\n\nBut while energy usage remains high in Bitcoin mining, it is imperative that this energy is clean, sustainable, and additional. To ensure this, RMI developed the Renewable Energy (RE) Emissions Score, designed to assess the material impact of renewable energy procurement. By measuring the emissions impact, as well as the value provided by off-takers of renewable energy, the RE Emissions Score will allow any company, not just Bitcoin miners, to make meaningful claims about renewable energy procurement, prioritizing investment in high emissions areas and low-cost renewable projects. If Bitcoin mining is to continue, it must be powered by additional renewables so that it does not inadvertently increase required grid capacity and lead to more fossil generation.\n\nThe RE Emissions Score was born out of a need to allow Bitcoin miners to make quantifiable claims of renewable energy use and investment, but its implications are much wider. Any company currently procuring renewable energy can use this approach to show its commitment to total grid decarbonization. Focusing on the decarbonization of the grid as a whole is vital to any strategy for reducing crypto emissions.\n\nMoving Forward\n\nThe climate effects of crypto, especially Bitcoin, are no secret. With an extremely large appetite for energy, crypto has the potential to serve as an impediment to climate progress. Price volatility has hampered climate action in the space, and without proactive procurement by miners, regulatory pressure is inevitable. Campaigns such as the CCA show an interest in addressing these issues within the community. Participating organizations cannot afford to allow these pledges to be mere words, they must act. Guidance on measuring emissions, such as the CCA Accounting Guidance and the Crypto Climate Impact Accounting Framework, are vital first steps toward allowing industry participants to understand their own climate impact and take action to reduce it. The dictum applies: you can’t manage what you can’t measure.\n\nUntil such a time that a less energy-intensive consensus mechanism for bitcoin is developed and available, current Bitcoin mining operations should be powered by additional, renewable energy. The RE Emissions Score provides miners with the means to help ensure that contracted power is renewable and additional, which will be necessary to decarbonize US electricity grids by 2035.\n\nThough our direct engagement with crypto is coming to a close, RMI’s work to decarbonize the grid and transform the global energy system will continue."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmF4aW9zLmNvbS8yMDIzLzAxLzMxL3RocmVzaG9sZC1uZXR3b3JrLWJpdGNvaW4tZXRoZXJldW0tYnJpZGdl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Threshold Network launches a trust-minimized bitcoin bridge - Axios",
        "content": "The Threshold Network has announced plans for a new decentralized bitcoin bridge to Ethereum, allowing the original cryptocurrency to be used on the largest programmable blockchain. Why it matters: As holders of the oldest and most valuable cryptocurrency, many bitcoin investors want to use it to earn yield in decentralized finance (DeFi), something they can't do on the Bitcoin blockchain. But they also want to avoid the counterparty risk of trusting a single company to provide a bitcoin derivative that works on Ethereum.\n\nTrusted bridges, like Wormhole and the Ronin bridge for Axie Infinity, led to some of the worst losses in 2022.\n\nDriving the news: Bitcoin can only be used in DeFi using some kind of derivative, copies of real bitcoin secured for that purpose on the original blockchain.\n\nOne casualty of the FTX failure has been the Ren Protocol, one of the more trustless ways to bridge bitcoin to other blockchains.\n\nBefore FTX fell, there were over 4,000 BTC on Ren. Now, there's a little over 400.\n\nOf note: Most of the bitcoin bridged to other blockchains takes the form of wrapped bitcoin (WBTC); 176,547 BTC ($4 billion) have been bridged using the fully trusted system created by the custody firm, BitGo.\n\nWhat they're saying: \"Bitcoin is the most pristine digital asset, and if you want to make your bitcoin into a productive yield-bearing asset you shouldn't have to send that to an opaque liquidity provider,\" MacLane Wilkison, CEO of NuCypher, tells Axios in an interview.\n\nThe Threshold protocol was created via a merger between open source protocols made by NuCypher and the Keep Network.\n\nWhat we're watching: Threshold has launched a new version of tBTC, its more decentralized approach to bridging bitcoin from the original blockchain to Ethereum (for now, with others to come).\n\nThe new version protects users by breaking operations up into two parts: minters and guardians.\n\nHow it works: Guardians are stakers of Threshold's token, T, who control a series of bitcoin wallets that can be used to mint tBTC on Ethereum.\n\nA user sends their bitcoin to a wallet and indicates what Ethereum address the tBTC should be minted to.\n\nIf more than 51 of 100 guardians approve the mint, then it goes to the minters to mint the tBTC that corresponds to the actual bitcoin deposited.\n\nMinters are a small group of blue chip DAOs (decentralized autonomous organizations) on the Ethereum blockchain, including Curve DAO, Yearn.Finance, Aave, Synthetix, Connext, Alchemix and Euler.\n\nare a small group of blue chip DAOs (decentralized autonomous organizations) on the Ethereum blockchain, including Curve DAO, Yearn.Finance, Aave, Synthetix, Connext, Alchemix and Euler. They maintain a three hour cooling off period between a mint and issuing tBTC. If nothing seems awry, they approve creating the tBTC.\n\nThe main threat minters are watching for are mints that don't have matching bitcoin in the Threshold wallets.\n\nThe system has been designed to prevent such a malicious mint, but they are using minters at first as a safeguard. Eventually, the plan is to retire this backstop.\n\nWhat's next: A bitcoin-backed stablecoin called thUSD.\n\nBe smart: This new version is not trustless. It is trust minimized. By creating a large set of minters, it makes it very hard (but theoretically not impossible) to abuse minting powers.\n\nFlashback: The original version of tBTC launched in 2020. While it hasn't had major issues, it was held back by capital inefficiency.\n\nThe market cap of tBTC has been in the low millions since mid-2022.\n\nThe bottom line: \"With no viable alternatives in the market, there is no time to waste in meeting the urgent demand for a decentralized Bitcoin-to-Ethereum bridge,” Keep founder and Threshold contributor Matt Luongo said in a statement."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzMxL3NvY2lhbC10b2tlbi1wcm9qZWN0LXJhbGx5LXNodXRzLWV0aGVyZXVtLXNpZGVjaGFpbi1zdHJhbmRpbmctdXNlcnMtY3J5cHRvLWFzc2V0cy_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDEvMzEvc29jaWFsLXRva2VuLXByb2plY3QtcmFsbHktc2h1dHMtZXRoZXJldW0tc2lkZWNoYWluLXN0cmFuZGluZy11c2Vycy1jcnlwdG8tYXNzZXRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Social Token Project Rally Shuts Ethereum Sidechain, Stranding Users’ Crypto Assets - CoinDesk",
        "content": "“Since NFTs on the Rally sidechain are not transferable to mainnet, these will not be accessible once the site shuts down,” Rally said in an email reviewed by CoinDesk. It further said the site “will no longer be supported” beyond Tuesday."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8zMC9pcy1zb2xhbmEtZm9sbG93aW5nLWV0aGVyZXVtcy1lYXJseS1kYXlzLXRvcC10cmFkZXItY29tcGFyZXMtc29sLWFuZC1ldGgtdXBkYXRlcy1zdGFuY2Utb24tY3J5cHRvLW1hcmtldHMv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAxLzMwL2lzLXNvbGFuYS1mb2xsb3dpbmctZXRoZXJldW1zLWVhcmx5LWRheXMtdG9wLXRyYWRlci1jb21wYXJlcy1zb2wtYW5kLWV0aC11cGRhdGVzLXN0YW5jZS1vbi1jcnlwdG8tbWFya2V0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Is Solana Following Ethereum’s Early Days? Top Trader Compares SOL and ETH, Updates Stance on Crypto Markets - The Daily Hodl",
        "content": "A trader who continues to build a large following with his timely altcoin calls says that one of Ethereum’s biggest competitors may be following ETH‘s early stages of growth.\n\nPseudonymous trader Cantering Clark shares a chart with his 159,000 Twitter followers showing uncanny similarities between the price action of Solana (SOL) today and Ethereum’s in 2018.\n\n“Early ETH vs SOL.”\n\nThe trader’s chart shows both assets bouncing off a support level mutiple times, then collapsing through it before making a lower low and then a rebound.\n\nFrom its 2018 low, Ethereum ultimately rallied 5,777% to its all-time high, from $83 to $4,878. With Solana’s recent low of $8, a similar move for SOL would suggest a rally to roughly to $462 before the next bear market.\n\nLooking at the rest of crypto markets, Cantering Clark says that the “January effect,” referring to cypto’s tendency to rally at the beginning of the year, is likely over. He predicts a correction in the near term, potentially triggered by poor earnings reports or other macroeconomic announcements.\n\n“The January effect is done. Historically big months like this follow with some mean reversion, and what better way to start the next month with a gamut of events: FOMC and earnings for Amazon, Apple, Google, Meta, Exxon, Pfizer, Merck…\n\nIf I had to guess.\n\nTake it back to 20k area, and chop people up left and right before continuing.”\n\nThe trader says BTC lacks a lot of liquidity between $23,000 and about $21,000 which could mean price falls rather quickly until the next major level.\n\n“I don’t really care to do anything aggressive while Bitcoin is at the top of the range.\n\nFlipping 25k might change my mind.\n\nThere are some really imbalanced areas that price likes to revisit and could cut through like butter.\n\nEyes on anchored yearly vwap (volume weighted average price) and Jan 23rd low.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Shacil/WhiteBarbie"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDEvMzAvZXRoZXJldW0tMi0wLW5ldy1ibG9ja2NoYWluLXZlcnNpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Ethereum 2.0: What Exactly is this New Blockchain Version? - Crypto Times",
        "content": "Ethereum — the second most popular blockchain after Bitcoin — has continually deduced methods to update its network to become better than its predecessor and major rival.\n\nAnd after a long wait, the upgraded version launched in mid-September 2022 called “Ethereum Merge”. Originally referred to as Ethereum 2.0, the merge is an upgraded version of the Ethereum network that now uses proof-of-stake consensus.\n\nThe upgrade will allow Ethereum to scale its transaction throughput, enable new applications to drive greater utility on-chain, and further reduce cost. Let’s understand how this revolutionary Merge upgrade will gear up to be future-proof to follow mass adoption.\n\nWhat is Ethereum 2.0?\n\nEthereum 2.0 is simply an upgrade to Ethereum’s network. It is a multi-phased project that intends to make the blockchain network faster, cheaper, more accessible, more secure, and more effective.\n\nThis upgrade heralded the switch of Ethereum’s consensus mechanism from the Proof-of-Work (PoW) model to the Proof-of-Stake (PoS) model, and brought about “Sharding.” Sharding is reportedly the last phase of the Ethereum 2.0 transition which should be finalized by 2023.\n\nThe transition from Ethereum 1.0 to 2.0 was always in the works, and not a random event. To be honest, you hardly find any unplanned incident in the crypto space. Even the rising platform Xbitcoincapex.app (which recently made headlines in several crypto media websites) admits that no events go unprepared for in the ecosystem.\n\nIt commenced in December 2020 with the launch of the Beacon Chain, which introduced staking and PoS to the Ethereum network. Using the proof-of-stake (PoS) model over the proof-of-work (PoW) model was a major game changer for the network.\n\nNormally, with the PoW model — which was the primary consensus method used by all networks, as started by Bitcoin — miners use their sophisticated computing power to decipher complicated equations and validate blocks, which are then added to the blockchain. Each block had to be proven unique to prohibit duplication of transactions. This process rendered the whole PoW process expensive, in terms of financial resources and time to undergo.\n\nIn addition, blockchain mining utilizes a lot of electricity which isn’t environmentally friendly. Then there’s the issue of miners who are inferiorly stacked against their competitors, as they don’t have enough resources to compete to solve these equations. There is, however, the option of miners collaborating with other miners in a ‘mining pool’ to solve these equations. But, the reward is shared amongst the miners.\n\nWith the PoS model, users ‘validate’ transactions (just like PoW mine) by ‘staking’ crypto into the network. The more funds the validators stake, the higher their rewards for participating.\n\nIn this method, the bar for entry is low as long as you have the funds to participate, (and there are other ways to get the 32 ETH needed to stake), unlike PoW which involves having expensive hardware and utilizing copious amounts of electricity.\n\nThis level of network accessibility (of Ethereum 2.0) enables better scalability, as more users are connected to the network and validate blockchain transactions. Ultimately, this leads to a higher level of security and decentralization due to multiple peoples’ participation.\n\nUsing the PoS model also prevents a 51% attack, something which is prevalent in PoW models. It simply means when a user commands control of 51% of nodes and validates transactions wrongly. Since it is practically impossible to HODL 51% of tokens on the Ethereum network, the PoS model is more secure.\n\nGenerally speaking, upgrading to Ethereum 2.0 will help secure the network and allow participants, collectors, and cryptocurrency owners to stake their ETH tokens and earn rewards.\n\nWhen did Ethereum 2.0 Start?\n\nWork on Ethereum 2.0 had begun early, as previously stated. It can be summarized into four phases:\n\nPhase 0\n\nIt commenced in 2020 with what was called “Beacon Chain” — which introduced the PoS model to the Ethereum blockchain — enabling users to stake their ETH and become validators. Beacon Chain didn’t disrupt the Ethereum 1.0 blockchain but existed alongside Ethereum’s mainnet.\n\nThe first Phase provided three major technological implementations to the Ethereum ecosystem: the Beacon Chain, the PoS consensus mechanism, and validator nodes.\n\nPhase 1\n\nThe next phase was purported to launch in mid-2021 but it was delayed to early 2022, with the Ethereum developers mentioning unfinished work. In Phase 1, there was meant to be a merge of the Mainnet into the Beacon Chain, therefore switching the consensus mechanism from PoW to PoS. Miners were expected to take their holdings and stake them to evolve into validators.\n\nIn addition, the Ethereum developers intended to introduce “Sharding” in this Phase. This is because it has a significant effect in ensuring the Ethereum network can handle an increased number of transactions.\n\nRather than settling all operations on just one blockchain, “Shard” chains disperse these operations across 64 new chains. This enables parallel processing to decrease the latency that originates from linear processing utilizing a single blockchain.\n\nInvariably, this would lead to an increase in the transaction speed and reduce the load on the network as validators could run their Shards. Also, processing any transactions would become easier from a hardware purview, as there would be reduced data to be stored on a particular machine.\n\nPhase 2\n\nUltimately, Phase 2 came with the introduction of Ethereum Web Assembly (eWASM). It was designed to make the Ethereum 1.0 network more efficient, a subset of the proposed Ethereum smart contract execution layer.\n\nEthereum 1.0 was equipped with an Ethereum Virtual Machine (EVM). This software interacts with dApps, evaluates gas fees for every transaction, and computes the network after each block is added to the blockchain. A fundamental constituent of the Ethereum blockchain, the EVM wears many hats. For one, it executes and terminates smart contracts, and detects if a dApp is deterministic or if a smart contract is isolated and is used by users globally.\n\nAs a result of numerous transactions occurring at once on the Ethereum blockchain, the EVM has become slow. Unfortunately, it is difficult to upgrade since it was written in complicated code, i.e Solidity. So the most likely option was to replace it.\n\nThat’s where eWASM comes in. It was designed to replace the EVM in the Ethereum hierarchy. It speeds up the network process by computing codes fast and it is effectively compatible with various coding languages like C and C++. All of these are poised to make eWASM more accessible for the Ethereum blockchain, which in turn makes the network faster and more efficient.\n\nPhase 3\n\nThis phase — a miscellaneous stage — was reserved for any extra upgrade that might have been needed before Ethereum 2.0 was launched completely. For example, creating extra Shard chains to add to the original 64 chains, heightened privacy on the network, or improving the overall technology on the blockchain.\n\nIt was estimated that each phase of Ethereum 2.0 would require about six to eight months to come to total fruition. Admittedly, the long-awaited Ethereum merge finally came, in mid-September 2022. The Ethereum Foundation however remarked that the complete transition to Ethereum 2.0 would occur in 2023, as the network was highly dynamic and ever-evolving.\n\nWhy Shift to Ethereum 2.0?\n\nOver time, the Ethereum network was faced with some constraints that were affecting its efficiencies like scalability, accessibility, and security.\n\nUsers, at times, had to pay over 100% in gas fees and extra costs just to undergo minimal transactions. Plus, the network struggled to approve transactions rapidly too.\n\nAll of these necessitated the need to improve its blockchain network to achieve an expansive level of adoption from investors. This is because Ethereum finds use in dApps — which are beneficial in governance, supply chain, finance, education, etc.\n\nTherefore, Ethereum developers — led by the creator, Vitalik Buterin — established a proposed upgrade (Ethereum 2.0) and worked towards it. It is simply the transition of Ethereum’s consensus mechanism from a proof-of-work (PoW) model to a proof-of-stake (PoS) model.\n\nThis was in hopes to reduce the blockchain’s energy consumption by 99%, and make the network faster, more scalable, and more secure to utilize.\n\nWhat Are the Benefits of Ethereum 2.0?\n\nPreviously, Ethereum was held back by some technical limitations, but all these changed with the advent of Ethereum 2.0. These are the benefits:\n\nLess Computation Power, More Eco-friendly\n\nAs opposed to the proof-of-work (PoW) model which involves using sophisticated power to solve complex equations, the proof-of-stake (PoS) model — which Ethereum 2.0 utilizes — doesn’t require such. This in turn makes it to be more eco-friendly as a single PoW transaction is reportedly said to consume as much energy as an average U.S. household in a week. Moreover, the hardware is said to generate electronic waste also.\n\nIncreased Scalability and Efficiency\n\nEthereum 1.0 computed about 25 to 30 transactions per second, but Ethereum 2.0 is said to handle 100,000 transactions per second. This increased Scalability is possible due to the Sharding technique.\n\nSharding enables Ethereum to store and access data, plus “Shard chains” would be utilized in transactions which makes it reportedly 64 times faster than the previous blockchain version.\n\nMaking ETH a more Deflationary Asset\n\nDue to the merge, issuing Ether as block rewards would greatly reduce. There are reportedly about 13,000 ETH mined daily. The number would reduce to 1,600 ETH daily as a result of the Merge. All of which would ensure less ETH is in circulation, thereby reducing its inflationary quality.\n\nHigher Security Level\n\nEthereum 2.0 needs a minimum of 16,384 validators, enabling a decentralized network and thus securing the blockchain, by reducing the attack surface area. This prevents a 51% attack from occurring on the network.\n\nMore Network Participation\n\nWith lower hardware requirements, more people can participate in Ethereum 2.0. By using Sharding, validators don’t need to store data by themselves. They can instead employ data techniques to confirm that the data has been made usable by the network. Moreover, more users can join in the staking process — provided they have 32 ETH to lock in — thereby increasing network participation.\n\nReduced Costs\n\nWith the PoW model, there was a high cost of hardware equipment, gas fees, and electricity bills. All of these are not present in Ethereum 2.0, as the PoS model doesn’t require as much hardware (with Sharding) and doesn’t have to pay miners gas fees, as the validators who stake ETH secure the network indirectly.\n\nWhat Are the Risks of Ethereum 2.0?\n\nThe Ethereum merge is the most significant upgrade to a blockchain network and it doesn’t come without its risks:\n\nPossible Scams\n\nSome crypto-related organizations pretend as though ETH (Ether) was what was updated to Ethereum 2.0, by calling it “ETH 2.” This is in a bid to get users to swap their ETH for the so-called ETH 2 and scam them.\n\nFeasible drop in ETH Value\n\nIf things go awry after the merge, it is possible that the value of ETH would drop, as well as other cryptos that are built on the Ethereum blockchain.\n\nWhat is the Future of Ethereum?\n\nThe crux of an updated Ethereum network (Ethereum 2.0) is to enable it to process more transactions speedily while being secure and accessible.\n\nWith the transition to a PoS model from the PoW model and the advent of Sharding, expectations — from industry experts and enthusiasts alike — are high. It is expected that the merge would have an all-encompassing impact on the DeFi space. Time would tell what would happen though."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAxLzMxL2V0aGVyZXVtLXdoYWxlcy1idXlpbmctdGhlc2UtMy1jcnlwdG9jdXJyZW5jaWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Whales Are Buying These 3 Cryptocurrencies Hand Over Fist - The Motley Fool",
        "content": "Individuals who have a lot of money invested in Ethereum don't always limit themselves to just one cryptocurrency. They often spread their wealth around.\n\nThat's exactly what has been happening recently, according to crypto tracking website WhaleStats. Ethereum whales are especially buying these three cryptocurrencies hand over fist.\n\n1. USD Coin\n\nUSD Coin (USDC -0.00%) ranks as the favorite cryptocurrency for the top 100 Ethereum whales these days. And it's not even a close contest based on the average volume amount.\n\nOf course, USD Coin hasn't delivered an appreciable gain for these investors. That's to be expected for a stablecoin. USD Coin is pegged on a 1-for-1 basis to the U.S. dollar. Its price typically doesn't fluctuate very much.\n\nHowever, USD Coin's market cap can change somewhat based on its adoption. Over the last year, its market cap has fallen a little. This small decline is largely due to the broader market factors that caused interest in cryptocurrencies to decrease.\n\nBut Ethereum whales and many other cryptocurrency traders continue to view USD Coin as a safe haven. The adoption of the stablecoin has been good news for Coinbase Global, which helped create USD Coin with fintech company Circle.\n\n2. Tether\n\nEthereum whales are also buying the world's most widely traded stablecoin -- Tether (USDT 0.00%). With a market cap of nearly $67.8 billion, Tether trails behind only Bitcoin and Ethereum among the biggest cryptocurrencies.\n\nLike USD Coin, Tether's price doesn't move very much. This stability is one of the main attractions for investors.\n\nIn addition, owners of the stablecoin can stake their tokens and earn interest. For example, crypto trading platform YouHodler currently pays an annualized interest rate of 8.32% for staking Tether.\n\nHowever, Tether isn't quite as popular as it once was. Its market cap topped $83 billion in the early part of May 2022. Today, the stablecoin's market cap is below $68 billion.\n\n3. Chiliz\n\nChiliz (CHZ -0.59%) might be the most surprising cryptocurrency that Ethereum whales are buying hand over fist. The digital token trails only USD Coin and Tether based on average trading volume among the top 100 Ethereum whales. However, Chiliz's market cap of around $906 million puts it only in 53rd place among all cryptocurrencies, according to CoinMarketCap.\n\nLike several other cryptocurrencies, Chiliz is off to a great start in 2023. Its price has skyrocketed close to 40% year to date.\n\nWhy do Ethereum whales like Chiliz so much? It's probably because Chiliz is the exclusive cryptocurrency used on the Socios.com sports platform. Sports fans can engage with many of their favorite sports teams across the world (including the Boston Celtics, FC Barcelona, and Juventus).\n\nFans on Socios.com can use Chiliz to buy tokens that allow them to have a stake in their favorite team. They can even influence things such as what team captains wear on their armbands.\n\nAre these cryptocurrencies good picks for non-whales?\n\nJust because Ethereum whales are buying these three cryptocurrencies the most doesn't mean they're automatically good picks for investors who aren't whales. Stablecoins such as USD Coin and Tether aren't as risky as most cryptocurrencies. However, they don't offer as much upside potential, either. Chiliz might be more attractive to some sports fans, but not as much to other individuals."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LnlhaG9vLmNvbS9lbnRlcnRhaW5tZW50L2V0aGVyZXVtLW5hbWUtZXZlcnl0aGluZy1rbm93LWxhdGVzdC0yMzAwMDAwOTkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Name Service- Everything You Need to Know About the Latest Trends & Milestones - Yahoo Entertainment",
        "content": "2022 was an incredible year for ENS, with record amounts of new users, name registrations and revenue. New trends in web3 brought together communities to rally around different categories of ENS names, and marketplaces evolved to provide support including new categories, analytics capabilities, and tools to improve the user experience. Major companies, influencers and celebrities began to adopt ENS names as they explored the metaverse and built their web3 identities. This article spotlights recent trends, metrics, builders & adopters in the space, and all of the latest from ENS Labs including an interview with ENS Labs’ Executive Director, Khori Whittaker.\n\nCore ENS Updates\n\nENS by the numbers:\n\n2.8m ENS domains created\n\n70k ENS have set an avatar\n\n$72m spent on registrations\n\n$13m spent on renewal\n\n74% of eligible addresses have claimed the ENS token airdrop from fall 2021\n\nThese stats were provided from ENS Labs developer Makoto’s expansive Dune analytics dashboard for ENS, which contains numerous charts, data points and other analytics resources. There are also useful public financial reports by ENS Labs founder Nick.eth on Google, including DAO token holdings and adjustable charts to view their current revenue.\n\nBack in the fall, the company behind ENS Domains changed their name from True Names Limited to ENS Labs. The normalization process led by ENS Labs developer Raffy.eth, which will further standardize which ENS names are acceptable for registration, is ongoing. He said recently that the registration of invalid names has decreased, which will lead to less impact on users once normalization goes live. Some of the more speculative activity around ENS trading revolves around predicting which currently invalid names will be valid once normalization is completed.\n\nCommunity members are strongly encouraged to participate in the DAO, which hosts several categories of content rich discussions that anyone can join. For a one stop shop of the main issues being discussed at any given time, the DAO has a useful dashboard on their discussion forum which contains a calendar, proposal drafts, and information on their 3 working groups including budget requests, public DAO calls, and names of the current stewards of each group. One recent notable discussion includes the sale of 10,000 ETH for USDC, which represents 25% of the DAO’s Ethereum holdings.\n\nA Conversation With ENS Director, Khori Whittaker\n\nONE37pm recently sat down with Khori Whittaker, Executive Director of ENS Labs, for an interview about the past, present and future of the highly successful Ethereum blockchain based domain service. Khori joined ENS Labs just before the surge of interest in ENS in early 2022. His prior experiences in business development, recruiting, and education have helped him scale the company, which has grown tremendously since its humble beginnings in 2017. In the interview, Khori highlighted how the DAO functions similarly to the board of a traditional company. Due to the elevated level of scrutiny and input going into each decision, ENS Labs is uniquely positioned to grow in a transparent, ethical and sustainable way.\n\nKhori sees ENS expanding into an “every day, everyone” name service. The NFT and blockchain space can be cumbersome at times, and the new, in-house educational materials being created by ENS Labs will become an essential first step for new users entering web3. Gamifying the experience and earning achievements, POAPs or badges for setting your primary ENS, adding an avatar & contact information, and utilizing other features will help new users begin to make their web3 imprint in a fun and exciting way.\n\nOn the topic of TLDs, Khori doesn’t anticipate ENS following the path of some competitors and issuing additional TLDs for sale, though he mentioned private businesses or government entities may opt to use personalized TLDs for application of blockchain based domain technology, similar to the Coinbase integration of .id domains. There are potential Government use cases being actively explored such as permits, identification, registration for various services, and even taxes. For that reason, he mentioned place names as one of the more interesting categories in ENS right now.\n\nOne exciting recent integration of ENS is by the .ART domain extension, which was the first TLD to receive permission from ICANN to extend the WHOIS (Registration Data) field for the purpose of identifying assets, a patented technology they call the .ART Digital Twin. They seek to use web3 technology to help creators create certificates of authenticity for their artwork. Another new use case for ENS involves Mailchain, an open source protocol dedicated to helping web3 users communicate via email.\n\nENS integrations are so popular with web3 users to the point that without them, the user experience becomes more complicated. Many users who played Yuga Lab’s recent Dookey Dash game remarked that the leaderboard hadn’t integrated their primary ENS names, making it difficult for players to flex their scores.\n\nSoon: Name Wrapper\n\nOn January 16th, jefflau.eth posted an update on the ENS DAO forum announcing that the highly anticipated name wrapper for ENS domains was redeployed on Goerli testnet after a thorough audit. The contracts are being tested for at least two weeks before consideration for deployment on mainnet, which is also contingent upon the release of the highly anticipated ENS V3 contract. ENS Labs developer domico.eth recently posted a thread on Twitter explaining some of the technical aspects of how subdomains work and how it ties into V3. Based on the information provided, it doesn’t appear the name wrapper will be released until after Q1 2023.\n\nWhat's New with ENS Vision?\n\nIn May of 2022, the Ethereum Name Service hit a milestone that took over five years to achieve since its launch – one million name registrations. With the release of ENS Vision’s bulk registration tool at the end of May, ENS registrations saw explosive growth in numbers. In a matter of a few months, the number of ENS registrations quickly doubled and surpassed over two million names created at a record pace. Impressively, ENS Vision’s bulk registration contract continues to facilitate over 30% of all monthly ENS registrations since its release.\n\nENS Vision launched its ENS exclusive aggregated marketplace in late July of 2022 and has since quickly grown from 0% of all ENS volume to now over 70% of all ENS daily volume over time in a short 6-month period. The exchange is set to surpass 20k ETH in total volume, 100k total sales, and 10k total users in Q1 2023. With over 17.5 million page views and over 700,000 unique users, ENS Vision has rapidly become the one-stop shop for everything ENS.\n\nNew features include a sweep feature, bulk renewal, bulk listings, and bulk transfer. One of the most interesting new features includes a “renewal sync,” allowing you to renew multiple names at different intervals to sync their expiration on the same day. Using usewinter’s new service, domains can now be purchased via credit card. More tools, features and verified collections are planned for 2023.\n\nImage credit: reservoir0x\n\nThanks to work by Reservoir0x, ENS Vision is now integrated with Dune Analytics. Some of the stats include:\n\nTotal ENS Names fill volume over time for all marketplaces (measured in ETH)\n\nPercentage of sales filled by ENS Vision\n\nPercentage of volume by ENS Vision\n\nMeetups, Builders & Advocates\n\nIn November, the ENS Labs team represented at the ETHGlobal hackathon in San Francisco with a booth, stickers, swag and printable ENS nametags. They also offered 5 bounty tiers for the best integration, giving away over $10k USD. They plan to attend ETHDenver in February and ETHDubai coming up later in March. Keep an eye out for exclusive POAPs for attending ENS related events, including this one for DEVCON BOGATA by @theaxents.\n\nImage credit: ENS Bogata POAP\n\nBack in July, Gregskril.eth created a website to assist ENS advocates in onboarding new users. The ENS Fairy UI allows you to register and gift an ENS name, saving the user 3 transactions. The ENS Ecosystem Working Group recently announced an expansion of the ENS Fairy concept with a proposed allocation of 174 ETH for ENS DAO to purchase domains off of premium expiration, to help the adoption of ENS and compete with speculators. Join the discussion in this thread and if you hold ENS tokens, make sure to vote.\n\nSadaf.eth, who has been featured in ONE37pm’s prior ENS articles and previously served as Community Manager for ENS Vision, has taken a role at the Ethereum Name Service as a community advocate.\n\nBishara.eth, an Arabic speaker and ENS domain researcher, recently made a channel dedicated to ENS with daily analysis, instructional videos, and resources in both English and Arabic. I recently used his video guide and a guide on the official ENS support site to make a decentralized website which links to my primary ENS. Bishara’s ENS DAO proposal for an Arabic educational channel recently passed, receiving 540k votes in the second round.\n\nAuthor of The Network State Balaji Srinivasan recently made a thread about ENS which garnered attention, saying “Email lists are good, ENS lists will be better.” He lamented the centralized nature of email and possibility of censorship, saying “email has become largely centralized by things like sender reputation.” He recently discussed use cases for ENS domains on Lex Fridman’s podcast.\n\nDecashed, an organization run by ENS advocate Sean Murray, had their first 10k club meetup in NYC during the 2022 Thanksgiving break.\n\nImage credit: Decashed\n\nTop Recent Sales & Notable Milestones\n\nPokemon Gen1 and trainers are trending, and other collectible related ENS names are gaining interest.\n\n333.eth for 100Ξ, 021.eth for 38Ξ and American.eth for 31Ξ\n\nIn the past 30 days, the 10k club had ~1200Ξ volume and 999 had ~600Ξ.\n\nArabic 999 club recently passed 3000Ξ total volume. Matt Higgins recently joined the community, purchasing ٤٣٣ (433) in Arabic. His recent thread calling for users to share their reasonable single word domains went viral. Fine art & documentary photographer Princess Reem alFaisal, the granddaughter of King Faisal of Saudi Arabia, has recently been sporting digit ٧٩١ (791) in Arabic.\n\nImage credit: ENS Vision\n\nENS Competitors\n\nLas Vegas based Unstoppable Domains Inc. recently received a patent for Resolving Blockchain Domains on January 17th, 2023. Unstoppable Domains was one of the first domain services on Ethereum, founded in 2018. They released 7 new TLDs in late 2022, adding to their existing Ethereum TLD .crypto and Zilliqa TLD .zil, partnering with Gemini (crypto exchange), Opera (Browser), Circle (USDC) to attempt to onboard more users into web3.\n\n\n\nA few NFT projects sprung up recently with intentions to become domain services on Ethereum. EPBTO uses IPTokenRenderer to place all of their .IP extension metadata on-chain, and has special protections against special character registrations that have traditionally resulted in attempts at fraudulent domain sales. Linagee domains, one of the earliest Ethereum contracts, saw a spike of interest in October after its “rediscovery” and release of a new wrapper, but has seen only a few Ethereum in .OG purchase volume over the past 30 days. With no integrations, projects like these should be considered aspirational domain projects, and users are encouraged to scrutinize any new blockchain based protocols closely before getting involved.\n\nENS in 2023\n\nThe Ethereum Name Service continues to expand its global reach and adoption in 2023, and according to Executive Director Khori Whittaker, “ENS has a solid, bright future ahead.” The release of the name wrapper this year will open new doors with integration possibilities, and change marketplace dynamics, with some trading volume likely moving into grail subdomains. ENS trading volume saw record highs in 2022 despite a bearish macro market in the crypto sector, and that trend is likely to continue as developers continue to expand the marketplaces, tools, and data available to the community. To create the best customer experience, integrating of ENS is a must for web3 projects, and the ENS Labs footprint is sure to expand exponentially as ENS Labs developers explore the possibility of deployment on Layer 2 solutions built on Ethereum."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vaGFja2Vybm9vbi5jb20vd2hhdC1pcy10aGUtZG93bnNpZGUtdG8tc3Rha2luZy1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "What Is the Downside to Staking Ethereum? - hackernoon.com",
        "content": "What Is the Downside to Staking Ethereum?\n\nToo Long; Didn't Read The process of staking Ethereum has become increasingly popular in recent years. As with any investment or financial decision, staking has potential downsides. These include the risk of losing your stake if the network is compromised, the potential for high volatility, the need for significant technical knowledge, and the lack of liquidity."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vdS50b2RheS9wb2x5Z29uLW1hdGljLWFuZC1vcHRpbWlzbS1vcC13aGljaC10ZWNobm9sb2d5LWlzLW1vcmUtYmVuZWZpY2lhbC1mb3ItZXRoZXJldW0tZXRo0gFmaHR0cHM6Ly91LnRvZGF5L3BvbHlnb24tbWF0aWMtYW5kLW9wdGltaXNtLW9wLXdoaWNoLXRlY2hub2xvZ3ktaXMtbW9yZS1iZW5lZmljaWFsLWZvci1ldGhlcmV1bS1ldGg_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Polygon (MATIC) and Optimism (OP): Which Technology Is More Beneficial for Ethereum (ETH)? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nIn recent years, Ethereum (ETH) has established itself as the leading blockchain in the cryptocurrency market due to its ability to facilitate the use of smart contracts. This feature allows for the creation of decentralized applications (dApps), tokens and other applications without the need for intermediaries.\n\nHowever, as the network has grown in popularity, it has also experienced issues with scalability and high transaction fees. In response to these challenges, several competitors such as Cardano (ADA), Solana (SOL) and Avalanche (AVAX) have emerged to address the scalability issues faced by Ethereum.\n\nDespite the emergence of rival blockchain platforms that boast advanced technology, Ethereum remains the most secure option due to its proven track record over time. In order to address its scalability and cost issues, solutions such as Layer 2 protocols have emerged as a means to enhance the Ethereum blockchain.\n\nTwo notable examples of Layer 2 solutions are Polygon (MATIC) and Optimism (OP). Both protocols aim to increase scalability on the Ethereum network, but they have distinct differences in their approach.\n\nPolygon vs. Optimism\n\nPolygon, also known as Matic Network, is a Layer 2 scaling solution that aims to improve Ethereum's scalability by using a layered architecture. This architecture allows for the faster and more efficient execution of smart contracts and decentralized applications.\n\nOptimism is another Layer 2 scaling solution that aims to improve Ethereum's scalability by enabling faster and lower-cost transfers on the network by transaction aggregation. Additionally, Optimism's Layer 2 supports more advanced smart contract functionality.\n\nDespite both Polygon and Optimism aiming to improve Ethereum's scalability, they achieve this through different methods.\n\nPolygon uses ZK-Rollups, which makes use of zk-SNARKs, a zero-knowledge proof technology, to validate transactions without revealing the details of the transactions. This allows for a large number of transactions to be grouped into a single block, thereby increasing the processing capacity of the blockchain.\n\nOn the other hand, Optimism uses a mechanism called Optimistic Rollups, which uses a leader mechanism to ensure security. Transactions are processed outside of the main blockchain but are still considered secure as long as they are confirmed in an honest manner by the leader.\n\nBut which one is best for Ethereum?\n\nOne of the leading authorities on this topic is Ethereum co-creator Vitalik Buterin. According to Buterin, second-layer Zero Knowledge Rollups (ZK-Rollups) are likely to ultimately surpass Optimistic Rollups as the preferred scalability solution for the Ethereum network.\n\nWhile Buterin acknowledges that the Optimistic solution is currently more advanced, he believes that the underlying technology of ZK-Rollups will ultimately prove to be superior in the long run. Furthermore, Buterin notes that ZK-Rollups are faster at facilitating transactions on and off the main network, which could lead to increased adoption of this technology."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2NyeXB0by9ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Shanghai Upgrade: Can ETH Prices Soar Again? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tLzYwLW9mLWludmVzdG9ycy1iZWxpZXZlLWV0aC1oYXMtYmV0dGVyLWdyb3d0aC1wb3RlbnRpYWwtdGhhbi1idGMtY29pbnNoYXJlcy1zdXJ2ZXktcmV2ZWFscy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "60% of investors believe ETH has better growth potential than BTC – CoinShares survey reveals - CryptoSlate",
        "content": "Around 60% of investors believe that Ethereum (ETH) has a more compelling growth outlook, according to a survey by CoinShares.\n\nAs opposed to the 60% siding with ETH, only 30% of the respondents said Bitcoin (BTC) had the most compelling growth outlook, according to the CoinShares survey.\n\nThe survey included 43 investors who managed a total of $390 billion worth of assets. Among the participants, those who identified as Wealth Managers (25%) and Family Office (25%) accounted for half of the group. Another 22% and 17% identified as Hedge Fund and Institutional, respectively.\n\nYear-to-year changes\n\nIt can be seen that a bulk of investors shifted to ETH from BTC when comparing the latest results with results from 2022.\n\nThe blue columns on the chart below represent the latest results, while the red marks show the results from last year’s survey.\n\nOnly 40% of the respondents said ETH had more compelling growth potential, while only a little less than 40% chose BTC in the 2022 survey. In one year, investors who opted for ETH spiked to 60%, while the ones who voted for BTC fell to 30%.\n\nEven though investors distanced themselves from BTC, this year’s results show an increase in the number of investors who invested in it. 30% of the participants own BTC, which marks an increase from 24% in 2022, according to CoinShares.\n\nDigital assets in portfolios\n\nThe latest numbers indicated that digital assets accounted for 1.1% of portfolios, which marks a significant increase from last year’s 0.7%.\n\nHedge Funds especially have considerably increased their investments in digital assets, CoinShares data revealed. In the meantime, institutional investors reduced their digital assets to below 1%.\n\nMentioned in this article"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vdGhlLWJsb2NrY2hhaW4uY29tLzIwMjMvMDEvMzEvZXRoLXRvLXBlYWstYXQtMjQ3NC1pbi0yMDIzLWFjY29yZGluZy10by1maW5kZXJzLWV0aGVyZXVtLXByaWNlLXByZWRpY3Rpb25zLXJlcG9ydC_SAXlodHRwczovL3RoZS1ibG9ja2NoYWluLmNvbS8yMDIzLzAxLzMxL2V0aC10by1wZWFrLWF0LTI0NzQtaW4tMjAyMy1hY2NvcmRpbmctdG8tZmluZGVycy1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9ucy1yZXBvcnQv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "ETH to peak at $2,474 in 2023 According to Finder’s Ethereum Price Predictions Report - Blockchain News",
        "content": "Ether is bound for another volatile year in 2023, according to Finder.com’s latest Ethereum Price Predictions Report.\n\nFinder’s panel of 56 fintech and cryptocurrency specialists think ETH will go as high as US$2,474 and as low as $984 in 2023 before ending the year at $2,184. Ethereum is currently priced at $1,588.\n\nDigital Capital Management managing director Ben Ritchie thinks Ether will be worth $2,500 by the end of 2023 but says it could go as low as $900 throughout the year.\n\n“Ethereum continues to dominate the market as the leading smart contract platform, driving a range of innovative projects within its ecosystem. However, recent market challenges have sparked investor concern and may limit the price of Ethereum to reach $2,500 this year. Despite this, Ethereum’s low annual inflation rate is expected to keep the price stable and above $900, even if future market disruptions occur.”\n\nSeasonal Tokens creator and founder Ruadhan O gave a bullish forecast of $3,000 by the end of 2023 and says Ethereum’s price will recover alongside Bitcoin and the rest of the market.\n\n“When economic activity starts to pick up, the transaction costs on the Ethereum network will rise. This will force Ethereum users to buy more ETH, providing additional upward pressure on the price.”\n\nWith ETH’s price still well below its price from April last year, the majority of Finder’s panel (60%) think it is currently underpriced. 28% think ETH is priced fairly, while just 12% think it’s overpriced. A similar number of panelists think now is a good time to buy ETH (56%) with 28% suggesting investors hold and 16% sell.\n\nNearly half of Finder’s panel (48%) think Ether will eventually ‘flip’ Bitcoin as the biggest cryptocurrency by market cap, with nearly a quarter, including technologist and futurist Joseph Raczynski, expecting it to happen as soon as 2024.\n\n“When you examine all blockchains based on security, decentralization, and scalability no other has its fundamental balance and judicious leadership, coupled with the critical mass of Ethereum. It’s not to say it can’t be toppled, but with each passing month it’s less likely.”\n\nEther is set to be worth $6,033 by 2025 and $14,316 by 2030, according to the panel average.\n\nOrigin Protocol co-founder Josh Fraser thinks ETH could crack $14,000 by 2025 given Ethereum is the base layer of innovation for the majority of DeFi and NFTs.\n\n“As these spaces develop, Ether will accrue in value. As scaling solutions gain mass adoption, Ethereum will be used for less-financially driven data, such as identity and social coordination. It’s at this point we could see Ether become a 6-figure asset.”\n\nHowever Associate Professor of Decentralised Finance at Nottingham Trent University Jeremy Cheah thinks Ether will be worth just $1,000 by the end of 2023 and $2,000 by 2025 given the lack of consumer rights safeguards which will suppress the price of crypto.\n\nYou can read the full report here: https://www.finder.com/ ethereum-price-prediction-2023"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLTctbW9udGgtaGlnaC1kb21pbmFuY2UtaGFzLWJ0Yy1wcmljZS1leWVpbmctMjVrLXdpbGwtZXRoZXJldW0tc3BvaWwtdGhlLXJhbGx50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin 7-month high 'dominance' has BTC price eyeing $25K — Will Ethereum spoil the rally? - Cointelegraph",
        "content": "Bitcoin (BTC) is rapidly regaining its lost dominance in the crypto market so far into 2023.\n\nOn Jan. 30, Bitcoin accounted for 44.82% of the total crypto market capitalization, the highest since June. In September, Bitcoin’s dominance index was as low as 38.84%.\n\nThe index typically rises when most crypto investors reduce their exposure to smaller tokens and seek safety in Bitcoin. The reasons include Bitcoin’s better liquidity and lower volatility than alternative cryptocurrencies, or altcoins, primarily in a bear market.\n\nBitcoin’s market dominance to grow further?\n\nAs of Jan. 31, Bitcoin is up 38% year-to-date at around $23,000. In comparison, the second-largest cryptocurrency, Ether (ETH), gained 30% in the same period, showing most investors remain gravitated toward Bitcoin so far in 2023.\n\nFrom a technical perspective, the Bitcoin dominance index may rise further in the coming weeks as it reclaims its 50-week exponential moving average (the red wave in the chart below) as support.\n\nBitcoin dominance index weekly performance chart. Source: TradingView\n\nIn doing so, the index could rise toward 48.5%, which has acted as resistance since May 2021.\n\nOn the other hand, independent market analyst Rekt Capital sees the Bitcoin dominance index rising toward 46%, which coincides with the upper trendline of a giant descending channel pattern, as shown in the monthly-timeframe chart below.\n\nBitcoin dominance index monthly performance chart. Source: TradingView, Rekt Capital\n\nThe short-term bullish scenario in the Bitcoin dominance index chart appears in line with a similar upside in the spot Bitcoin market, with bulls eyeing a run-up toward $25,000.\n\nThe strength of #bitcoin on the 4-hour charts continues to be impressive.\n\n\n\nWhile price action has trended sideways for over a week, short term indicators (MACD, RSI) have once again reset... and are now ramping higher.\n\n\n\nA price surge to ~$25k is probable.\n\n\n\n(Not investment advice) pic.twitter.com/QaPbNrxtxZ — Dr. Jeff Ross (@VailshireCap) January 29, 2023\n\nEthereum vs. Bitcoin the main driver of BTC dominance\n\nThe bearish argument is that the Bitcoin dominance index may start losing its upside momentum after testing its descending channel resistance, as it had done on several occasions in the recent past.\n\nRelated: Bitcoin sees most long liquidations of 2023 as BTC price tags $22.5K\n\n“Bitcoin Dominance is further overextending beyond red on the Monthly TF,” noted Rekt Capital, while citing the index’s horizontal trendline support near 44.11%. The analyst adde:\n\n“A Monthly Close above red could set BTCDOM for another dip into red which would benefit Altcoins.\"\n\nBitcoin dominance index monthly price chart (zoomed). Source: TradingView, Rekt Capital\n\nThe above analysis appears as ETH eyes a potential bullish reversal versus Bitcoin in the coming weeks.\n\nNotably, the ETH/BTC pair has been consolidating near its support area (purpled) inside the 0.0676- 0.0655 BTC range since Jan. 24.\n\nETH/BTC daily price chart. Source: TradingView\n\nThe ETH/BTC pair will likely see a rebound rally toward its descending trendline resistance (blacked) around 0.075 BTC if it continues to hold the support area. That, in turn, would reduce Bitcoin’s dominance in the cryptocurrency market as Ether’s share would rise toward 20%.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzAvZGVmbGF0aW9uYXJ5LWV0aGVyLWlzLXVuZGVycGVyZm9ybWluZy1iaXRjb2luLWhlcmUtYXJlLTMtcmVhc29ucy13aHkv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8zMC9kZWZsYXRpb25hcnktZXRoZXItaXMtdW5kZXJwZXJmb3JtaW5nLWJpdGNvaW4taGVyZS1hcmUtMy1yZWFzb25zLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Deflationary Ether Is Underperforming Bitcoin, Here Are 3 Reasons Why - CoinDesk",
        "content": "\"For most macro investors, BTC is the obvious on-ramp into the crypto market – the most liquid, the widest range of on-ramps. We see this in the strong increase in BTC spot volumes (while ETH spot volumes have not risen much), surge in the open interest on CME and stronger positioning in the options market,\" Noelle Acheson, author of the popular \"Crypto Is Macro Now\" newsletter, said."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8zMC90b3AtYW5hbHlzdC1zYXlzLW9uZS1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWlzLXJlYWR5LXRvLWJyZWFrLW91dC11cGRhdGVzLW91dGxvb2stb24tdGhyZWUtYWRkaXRpb25hbC1hbHRjb2lucy_SAZQBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDEvMzAvdG9wLWFuYWx5c3Qtc2F5cy1vbmUtZXRoZXJldW0tYmFzZWQtYWx0Y29pbi1pcy1yZWFkeS10by1icmVhay1vdXQtdXBkYXRlcy1vdXRsb29rLW9uLXRocmVlLWFkZGl0aW9uYWwtYWx0Y29pbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Top Analyst Says One Ethereum-Based Altcoin Is Ready To Break Out, Updates Outlook on Three Additional Altcoins - The Daily Hodl",
        "content": "An analyst closely followed in the crypto space says that one altcoin operating on the Ethereum (ETH) blockchain is ready to run, and has updates on three other digital assets.\n\nMichaël van de Poppe tells his 647,000 Twitter followers that Ethereum scaling solution Polygon (MATIC) is likely presenting an opportunity for a 60% gain if it provides the right entry at around $1.\n\n“This looks ready to break upwards significantly.\n\nWould be interested in buying around $1 for a retest and then it could run towards $1.60 quite easily.”\n\nThe analyst also has his radar locked on Ethereum competitor Avalanche (AVAX). According to Van de Poppe, AVAX bulls may want to wait for about a drop to a demand level near $17.50 before going long on the smart contract protocol.\n\n“Same point here. We could be looking at a case of continuation, but you’d definitely don’t want to chase the trade. Entries around $17.50 are doable.”\n\nNext on the trader’s radar is decentralized exchange protocol Injective (INJ). Van de Poppe says that INJ, which is already up about 40% in the last seven days, may not present any playable opportunities until it corrects to $2.30 or to $2.08 for longer-term trades.\n\n“Strong runner here, but points of interest are a bit lower.\n\nI’d be interested for a bounce play at $2.30 and for swing plays at $2.08″\n\nLastly, Van de Poppe looks at Verasity (VRA), an Ethereum-based altcoin focused on serving the e-sports, gaming, non-fungible token (NFT) and video economies. He says that while VRA looks very strong, bulls should wait for a roughly 40% correction down to the $0.004 range before opening a position.\n\n“This one looks strong and made a massive 250% run already.\n\nThrough that, I’d be patient on entering honestly.\n\nYou’d be interested once a correction takes place towards $0.004.\n\nThat’s the region for me before a new expansion upwards happens.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Terablete\n\nGenerated Image: DALLE-2"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTAxLTMxL2J1dGVyaW4tcy1zdGVhbHRoLWFkZHJlc3MtY3J5cHRvLWlkZWEtZmFjZXMtYS10ZXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Buterin's Stealth Address Crypto Idea Faces a Test - Bloomberg",
        "content": "In this edition of the Bloomberg Crypto newsletter: Even crypto luminaries are finding themselves hard-pressed to make privacy and transparency coexist on the blockchain, Emily Nicolle writes.\n\nPrivacy and transparency are two of the core principles of crypto, despite being relative opposites. Now that it’s time to build again after last year’s distress, developers are busy trying to find the best way for the two to coexist."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2FsdGNvaW5zL3doYXQtaXMtcm9ja2V0LXBvb2wtcnBsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Rocket Pool (RPL): An Ethereum 2.0 Proof of Stake Protocol - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdS50b2RheS9zaGliYS1pbnUtc2hpYi1sZWFkLWRldnMtZXRoZXJldW0tZXRoLWRvbWFpbi1uYW1lLWZvci1zYWxlLWhlcmVzLWZvci1ob3ctbXVjaNIBYWh0dHBzOi8vdS50b2RheS9zaGliYS1pbnUtc2hpYi1sZWFkLWRldnMtZXRoZXJldW0tZXRoLWRvbWFpbi1uYW1lLWZvci1zYWxlLWhlcmVzLWZvci1ob3ctbXVjaD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Lead Dev's Ethereum (ETH) Domain Name for Sale, Here's for How Much - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe official account @BoneShibaSwap (BONE) has made an announcement that they have created an ETH domain name Shytoshi.eth — named after the lead Shiba Inu developer, the pseudonymous Shytoshi Kusama.\n\nShytoshi.eth for sale for 500 ETH\n\nBoneShibaSwap has already twice hinted that it would like Kusama to buy it. Now, it is for sale on OpenSea for 500 ETH — around $790,000 in fiat. The seller promises to use this money to buy BONE tokens.\n\nThe sale of the ETH domain will last until April 30, according to the screenshot. The BoneShibaSwap account said that they hope Shytoshi would buy it before some Ethereum whale does it quicker. They referred to Kusama as \"one of the most important people in the crypto world.\"\n\n#Bone #shytoshi #EnsNames #Vip\n\nI put the real name of one of the most important people in crypto world up for sale\n\nI hope whales don't buy his original name before @ShytoshiKusama Shytoshi.eth Now available opensea\n\nfinal decision is yours\n\nI will use 500 Ethereum to buy $bone pic.twitter.com/up7CwH6b1d — BoneShibaSwap (@BoneShiba) January 31, 2023\n\nOn Jan. 30, @BoneShibaSwap also made this offer to Kusama. In the comment thread, they specified that this may make his name more recognizable in the crypto space, similar to Vitalik Buterin, who has an ETH domain name on his Twitter handle: vitalik.eth.\n\nYour words are like saying, Vitalik, you don't need this because everyone knows you :) pic.twitter.com/BeolxWGcy1 — BoneShibaSwap (@BoneShiba) January 29, 2023\n\nShytoshi Kusama has not responded to either of these tweets yet.\n\nNew Shibarium announcement could be around corner\n\nAs reported by U.Today earlier, the above-mentioned Shytoshi Kusama changed his location status on his Twitter handle to the \"Situation room.\" Shib enthusiast \"Kuro Shibarmy Japan\" shared this in a tweet, sparking comments from the SHIB army that the lead Shiba Inu developer might be preparing an announcement related to the Shibarium launch or is about to make an important decision on this topic.\n\nThe term \"Situation room\" refers to a place for making crucial decisions by top people in authority, such as at a military base or police station. There is also the situation room in the White House, where the U.S. president and his top officials make important decisions. It was this association that initially caused \"Kuro Shibarmy Japan\" to jokingly assume that Kusama was in the White House.\n\nThe upcoming beta launch of Layer 2 solution Shibarium was announced in the middle of January in a press release, where the basic concepts of Shibarium were shared by the dev team. The community around the SHIB token is looking forward to the release as the developers promise that the Layer 2 solution would ensure seamless transactions at a tiny gas price and tremendous burns of Shiba Inu via the BONE token, which will be used to pay transaction fees.\n\nOver the weekend, Shytoshi Kusama told the Shiba community on Telegram to \"keep popcorn on the ready.\" Many took this as a hint that Shibarium is about to launch soon."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9vcGVuc2VhLXNlZXMtYS1zcGlrZS1pbi1ldGhlcmV1bS1iYXNlZC1uZnQtc2FsZXMtdGhhbmtzLXRvLXRoZXNlLWZhY3RvcnMv0gFjaHR0cHM6Ly9hbWJjcnlwdG8uY29tL29wZW5zZWEtc2Vlcy1hLXNwaWtlLWluLWV0aGVyZXVtLWJhc2VkLW5mdC1zYWxlcy10aGFua3MtdG8tdGhlc2UtZmFjdG9ycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "OpenSea sees a spike in Ethereum-based NFT sales, thanks to these factors - AMBCrypto News",
        "content": "Ethereum-based NFTs on OpenSea saw its highest monthly sales volume since August 2022.\n\nOpenSea saw increased activity in the last 30 days.\n\nWith Blue Chip non-fungible tokens (NFTs) collections at the forefront, the year has so far seen a resurgence of interest in profile-picture (PFP) NFTs.\n\nEthereum-based NFT sales have soared to a four-month high on leading marketplace OpenSea, according to data from Dune Analytics. The monthly sales volume is expected to close the trading month at its highest level since August 2022.\n\nSo far this month, the sales volume of Ethereum-minted NFTs on OpenSea has totaled $409 million. This represented a 21% increase from the $283 million logged as sales volume at the end of 2022.\n\nThe recent increase in sales volume can be attributed to a surge in the number of Ethereum-based NFTs sold on the OpenSea marketplace.\n\nIn the last 28 days, 1.03 million Ethereum-minted NFTs have been sold on the leading NFT marketplace. According to data from Dune Analytics, this represented a two-month high in the sales count of Ethereum-based NFTs on OpenSea.\n\nIn addition to the surge in the sales volume and count of Ethereum-based NFTs on OpenSea, the marketplace itself has seen increased traction since the commencement of the 2023 trading year. Per data from DappRadar, in the last month, the transactions count on OpenSea grew by 9%.\n\nThe growth in transactions count of the decentralized application (dApp) resulted in a rally in sales volume. In the last 30 days, sales volume on OpenSea grew by 62%. All of these happened, despite the 1.21% decline in the count of unique active wallets within the period under consideration.\n\nEthereum is king\n\nIn the NFT vertical of the crypto ecosystem, Ethereum-based NFTs have seen the most sales in the last month. According to data from CryptoSlam, NFTs sales from the Ethereum chain in the last 30 days totaled $745 million.\n\nWithin this period, 207,719 buyers and 211, 813 sellers participated in 1.91 million sales transactions on the chain.\n\nWhat is the market saying?\n\nBlue Chip NFTs have grown in value since the year started. These NFTs are a subcategory of the broader NFT market that is of high quality and value. Examples include Bored Ape Yacht Club [BAYC], Mutant Ape Yacht Club [MAYC], Crypto Punks, and Meebits.\n\nAccording to NFTGo, the Blue Chip Index is calculated by weighing the market capitalization of Blue Chip NFT collections to determine their performance. So far this year, the Blue Chip Index has climbed by 6%.\n\nAs for the general market, market capitalization and sales volume have gone up by 7% and 21%, respectively, in the past 28 days."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvLm5ld3MvZW5zLWRvbWFpbnMtbWltaWNraW5nLW1ham9yLWV4Y2hhbmdlcy13YWxsZXRzLWluZGljYXRlLWEtbmV3LXR5cGUtb2Ytc2NhbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "ENS domains mimicking major exchanges' wallets indicate a new type of scam - crypto.news",
        "content": "Today crypto.news has been investigating the activity involving the wallets of defunct cryptocurrency exchange FTX. While examining the blockchain data, we found an apparent attempt at nefarious activity involving the Ethereum Name Service (ENS).\n\nWhat is an ENS domain?\n\nThe ENS is a decentralized domain name service built on the ethereum blockchain. It provides a more human-readable format for ethereum addresses, allowing users to send and receive funds at addresses like “myname.eth” instead of the traditional long string of numbers and letters. ENS aims to make interacting with the ethereum network more accessible and more user-friendly by providing a mapping between names and ethereum addresses.\n\nThe service is decentralized and operates on a blockchain, making it resistant to censorship and control by a single entity. ENS is an important infrastructure component of the Ethereum ecosystem, facilitating the widespread adoption of decentralized applications and services built on the Ethereum network. The service does not only support ethereum addresses but also other blockchains and centralized services such as websites and instant messaging profiles.\n\nHow ENS addresses can impersonate wallets\n\nA single address registered 50 different ENS domains — most of those, if not all, are the complete hexadecimal addresses of highly active addresses with the addition of “.eth” at the end. One example is FTX address 0x2FAF487A4414Fe77e2327F0bf4AE2a264a776AD2 which is present among this peculiar collection as “0x2FAF487A4414Fe77e2327F0bf4AE2a264a776AD2.eth.”\n\nOne likely reason why those ENS domains were registered is in the hope of intercepting payments meant for the addresses that those use as domain names. Many wallets support ENS domains as addresses to which users send assets. It implies that a user sending assets to one such address would only need to misclick once to transfer tokens to the ENS domain mimicking the wallet.\n\nAlleged scammers create ENS domains mimicking crypto exchanges\n\nA quick review of the addresses with the help of blockchain analysis service Arkham Intelligence reveals that they tend to be internal addresses of cryptocurrency exchanges. We can find a Coinbase address, an FTX address, a Binance address, and many other high-profile on-chain addresses — usually multiple per entity.\n\nThe mentioned address bought a total of 50 ENS domains in March 2022 for well over $3,000 — all in compliance with the scheme described above. However, the address failed to mislead any network participant into sending funds to the wrong recipient. It has been involved in 102 transactions in total: two for funding its ENS domain shopping and 100 for acquiring and receiving the domains in question.\n\nA visualization of the on-chain activity: funding address (top left), compulsive ENS shopper (bottom left), ENS smart contract (top right.)\n\nThere is one possible reason why no funds were mistakenly sent to the owner of those ENS domains. The addresses involved tended to be ones meant for internal use. Due to this choice, the transactions that could have been misled were sent by those working in the crypto industry. Most likely, they were using a very specific wallet infrastructure that only sent to whitelisted addresses and probably did not support ENS in the first place.\n\nDespite this, there is still plenty of time for somebody to make a mistake considering that those ENS domains will only expire in about four years.\n\nThe findings follow a recent report that Reddit users on the r/CryptoCurrency subreddit raised alarm bells regarding a potential Shiba Inu (SHIB) airdrop scam.\n\nFollow Us on Google News"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbmdhcGUuY29tL3ByZW1pZXItbGVhZ3VlLXNpZ25zLW5mdC1kZWFsLXdpdGgtdGhpcy1ldGhlcmV1bS1wcm9qZWN0L9IBUmh0dHBzOi8vY29pbmdhcGUuY29tL3ByZW1pZXItbGVhZ3VlLXNpZ25zLW5mdC1kZWFsLXdpdGgtdGhpcy1ldGhlcmV1bS1wcm9qZWN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Premier League Signs NFT Deal With This Ethereum-based Game - CoinGape",
        "content": "The Premier League and Sorare, a $4.3 billion fantasy soccer game, have agreed to a multi-year agreement under which the Premier League will license official player cards. According to the exclusive multi-year arrangement, players of the game will be able to buy and use NFTs that the prestigious football league officially licenses. People can participate in five-a-side fantasy soccer matches through the Paris-based startup Sorare, which has 3 million users globally. The players’ on-field performance in the present determines the likelihood of success.\n\nPremier League’s NFT Deal With Sorare\n\nIn addition to this, the Ethereum-based fantasy sports game has announced that it would be adding two additional features to the game. These include the opportunity to compete using player cards that are particular to a league and a feature called “financial fair play” that restricts users from picking all-star teams.\n\nadvertisement\n\nRead More: Check Out The Top Crypto Telegram Channels Of 2023\n\nIn October of 2022, it was rumored that Sorare was in licensing deal discussions with the Premier League, which is the top level of men’s soccer competition in England. The conclusion of these matters took longer than expected, according to Nicolas Julia, the CEO of Sorare. This was due to the fact that the Premier League already had an NFT licensing arrangement in place with another company. It was rumored that ConsenSys won the bid to secure the deal worth as much as UK£400 million or $459 million. But as the “crypto winter” wiped off a large portion of the formerly enormous resources accessible to businesses in the blockchain sector, this deal came crashing down.\n\nWhile speaking on Sorare, Julia was quoted as saying:\n\nSorare trended very differently from the rest of the space. Total exchanges of cards on the platform amounted to $500 million last year, almost doubling from $270 million in 2021.\n\nGrowing Sports Deal In Crypto\n\nAccording to the data provided by CryptoSlam, the Sorare NFT collection is the third largest in the world. And, as per the numbers provided by the platform, the company handles approximately one million dollars worth of transactions in a single day. The venture capital companies Accel and Benchmark, as well as Japan’s SoftBank, are among the prominent organizations that have invested in Sorare. In addition to these, well-known athletes like Lionel Messi, Serena Williams, and Kylian Mbappe are stockholders in the company.\n\nThe Premier League’s collaboration with Sorare is a recent example of the growing number of deals happening between different sports leagues and crypto platforms. In the past, Sorare has announced partnerships with both Major League Baseball and the National Basketball Association.\n\nAlso Read: Yuga Labs Co-Founder Steps Down From Everyday Operations Due To This Reason"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmJhbmtsZXNzdGltZXMuY29tL25ld3MvMjAyMi8xMi8yOC9idGMtdnMtZXRoLWJldHRlci1idXktYmV0d2Vlbi1ldGhlcmV1bS1hbmQtYml0Y29pbi1pbi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "BTC vs ETH: Better Buy Between Ethereum and Bitcoin in 2023 - Bankless Times",
        "content": "Bitcoin and Ethereum prices crashed hard in 2022 as the crypto industry faced a mountain of challenges. Some of the main headwinds were the soaring interest rates, rising inflation, and the collapse of Terra, Voyager Digital and FTX. In all, Bitcoin price dropped by 65% while ETH crashed by 68%. In this BTC vs ETH comparison, we will assess the better buy between the two.\n\nBTC and ETH faces challenges in 2023\n\nBitcoin, Ethereum, and other cryptocurrencies plunged in 2022 as concerns about the industry rose. First, investors were concerned about the health of the global economy as inflation rose. Consumer prices jumped to the highest level in more than four decades in most countries. This rebound was mostly driven by higher energy prices after Russia invaded Ukraine.\n\nSecond, central banks like the Federal Reserve, Bank of England, and European Central Bank (ECB) delivered multiple rate hikes during the year. The Fed hiked by 450 basis points, making it the most hawkish it has been in decades. Historically, cryptocurrencies and other risky assets tend to underperform in a period of high rates. Indeed, the tech-heavy Nasdaq 100 index fell by over 30%.\n\nThird, Bitcoin prices plunged after the collapse of Terra and its ecosystem. This collapse played a role into the collapse of other companies like FTX, Voyager Digital, Celsius, and BlockFi. As such, the fear and greed index dropped while outflows from exchanges rose.\n\nFind out how to buy Ethereum.\n\nOutlook for 2023\n\nEthereum went through a major change in 2022 as the developers activated the merge. This merge helped Ethereum transition from a proof-of-work into a proof-of-stake network. PoS networks are usually more climate-friendlier than PoS platforms.\n\nThe merge sets the stage for more upgrades in Ethereum. For example, the Shanghai upgrade will happen in Q1 of 2023. It will make it possible for people to withdraw their staked funds. It will then be followed by another upgrade that will introduce sharding mechanism.\n\nAll these upgrades will be positive for Ethereum and its ecosystem. For example, sharding will turbocharge its network speed and reduce its costs. It will also help more adoption by dApp developers. Bitcoin, on the other hand, will not see any change in 2023.\n\nHow to buy Bitcoin.\n\nBitcoin vs Ethereum\n\nSo, which is a better buy between Ethereum and Bitcoin in 2023? Historically, the two assets tend to move in sync with each other. In the past five years, Ethereum price has done better than BTC. In 2022, BTC did better despite the merge hype.\n\nEthereum faces a tulmoutous performance in 2023 because of regulatory risks. By introducing staking, it effectively became a security. As such, it could be limited in the United States now that regulators are increasing their focus on the sector.\n\nAnalysts believe that the scrutiny will likely depend on the outcome of the SEC vs Ripple case in the US. If the SEC wins, it could increase its focus on other assets like ETH. Therefore, because of these risks, I believe that BTC price will do better than Ethereum in 2023."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZXh0ZW5kLWdhaW5zLXNvbGFuYS1sZWFkcy_SAUFodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWV0aGVyLWV4dGVuZC1nYWlucy1zb2xhbmEtbGVhZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin, Ether extend gains; Solana leads among top 10 - Forkast News",
        "content": "Author profile\n\nPradipta Mukherjee is a business reporter and has worked for Bloomberg News and Business Standard in India. An MBA and a post-graduate in Economics, Mukherjee focuses on financial markets and corporates. She is a Mary Morgan Hewett award recipient for Women in Journalism. She has also won the Jefferson Fellowship; the Thomson Reuters Foundation fellowship on ‘Social Media and Digital Journalism’ at The Chinese University of Hong Kong; the Kiplinger Fellowship at Ohio University, USA; and most recently, the National Press Foundation's fellowship on 'International Trade.'\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0yMzYwMC1zb2xhbmEtZXRoZXJldW0tYm5iLXJpc2VzLXVwLXRvLTYtMzY4MDQ4LTIwMjMtMDEtMzDSAYgBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWhvbGRzLTIzNjAwLXNvbGFuYS1ldGhlcmV1bS1ibmItcmlzZXMtdXAtdG8tNi0zNjgwNDgtMjAyMy0wMS0zMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $23,600; Solana, Ethereum, BNB rises up to 6% - Business Today",
        "content": "Top crypto tokens were trading higher on Monday, thanks to gains in Bitcoin which flirted with $24,000 level over the weekend. Markets have remained largely hopeful the past week despite conflicting economic data and worrisome fourth quarter earnings reports.\n\nBitcoin was able to hold weekend gains and was firm above $23,500 level. Its largest peer, Ethereum was comfortable above $1,600-mark. Other Altcoins also posted decent gains.\n\nBitcoin hovered at $23,946 level over the weekend as markets continued to react to the US personal consumption data and the rise of investor sentiment. It is the highest level since August 2022, said Edul Patel, CEO and Co-founder at Mudrex.\n\n\"However, BTC is currently trading above the $23,600 level and rose by 2 per cent over the previous day. If bulls can hold BTC above the current level, the impulse may continue towards $24,000 and $25,000 soon. The volume is also high, indicating the buyers' strength in the market,\" he said.\n\nBarring the US dollar pegged stablecoins, all top crypto tokens were trading higher on Monday. Solana surged 6 per cent, followed by Ethereum and BNB. Bitcoin and Polygon also added 2 per cent each during the early trade.\n\nThe global cryptocurrency market cap was trading higher at $1.08 trillion mark, rising about 2 per cent in the last 24 hours. However, the total trading volumes surged 24 per cent close to $49.64 billion.\n\nBitcoin is hitting new three month highs, boosted by institutional buying, wider adoption, and infrastructure improvements. Institutional investors are increasingly taking notice of cryptocurrencies, with companies like Tesla and Square investing in Bitcoin, contributing to demand and higher prices, said Sathvik Vishwanath, co-founder & CEO at Unocoin.\n\n\"Market sentiment plays a big role in the value of Bitcoin, with rising demand and belief that the price will rise to cause a self-fulfilling cycle. However, there is always the risk of market volatility and regulatory changes that may impact growth,\" he said.\n\nCrypto updates\n\nLawyers for Sam Bankman-Fried have argued he should be allowed access to assets and crypto held by his former company FTX, saying there's no evidence he's responsible for previous alleged unauthorized transactions.\n\nEmails obtained by CoinDesk shed new light on the ongoing debate over the opaque and disputed ownership of WazirX, India’s largest crypto exchange. In November 2019, the ownership of WazirX was uncontested: Binance published a blog post saying that it had purchased the Indian exchange. WazirX’s executives talked openly about the acquisition.\n\nTech View by Giottus Crypto Platform\n\nPolygon (MATIC), the popular layer 2 blockchain, has had a great 2022 in terms of its adoption and partnerships. Now, its token seems to be reflecting the added value, having gone from $0.75 earlier this month to nearly $1.2 today.\n\nOn its way, it has cleared several resistance levels, made higher highs and higher lows, and continued to hold its price. With such momentum, short term target of $1.3 (its last high in November) is certainly in play, but with its 200-day EMA untested throughout the month ever since its breakout, there may be some consolidation first. A confluence of resistances and an overbought RSI in the vicinity of the $1.2 level also suggest a path that may see a test of $1.04 first for MATIC.\n\nMajor Levels:\n\nSupport: $1.10, $1.04, $1.0\n\nResistance: $1.25, $1.30\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: ‘NFTs can help bring art closer to people': Actor Lisa Ray\n\nAlso read: Stocks in news: Tata Motors, NTPC, Vedanta, L&T, Tech Mahindra and more"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2FsdGNvaW5zL3doYXQtaXMtc3N2LW5ldHdvcmstY3J5cHRvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "SSV Network (SSV): Transforming ETH Staking - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi2wFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9wb2x5Z29uLWZsaXBzLWV0aGVyZXVtLWZvci1kYWlseS1hY3RpdmUtYWRkcmVzc2VzLWFzLW1hdGljLXByaWNlLXN1cmdlcy0xMC1zb2xhbmEtc29sLWRlZmktcHJvamVjdC1mcmlrdGlvbi1zaHV0cy1kb3duLWl0cy11c2VyLXBsYXRmb3JtLXNub3dmYWxsLXByb3RvY29sLXNudy1tb3Zlcy10by1pdHMtYWxsLXRpbWUtaGlnaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Polygon Flips Ethereum for Daily Active Addresses as MATIC Price Surges 10%, Solana (SOL) DeFi project Friktion ... - Analytics Insight",
        "content": "It is no secret that the cryptocurrency market is vastly complex and ever-changing. In this article, we explore the recent events involving Polygon (MATIC), Solana (SOL), and Snowfall Protocol (SNW), to get a better sense of the latest updates in the crypto market. We compare these digital coins and discuss why Snowfall Protocol (SNW) has been gaining so much attention recently as its price continues to surge.\n\nPolygon’s (MATIC) surge may be met with a sharp decline\n\nWhile the rest of the cryptocurrency market is down today, Polygon’s MATIC token is surging. The cryptocurrency has now moved into the top ten, passing Solana (SOL) in the process. With a market cap worth $9.7 billion, Polygon (MATIC) is a leading cryptocurrency. Since the start of 2023, Polygon (MATIC), Ethereum’s layer-2 scaling network, has flourished. Since January, Polygon (MATIC) DeFi has seen an increase in its total value locked.\n\nAccording to DeFiLlama, the Polygon (MATIC) network’s TVL is $1.28 billion at press time. Since January 1st, Polygon’s (MATIC) value has risen by about 20%. However, when tokens like Polygon (MATIC) rise dramatically and instantly, they could meet with major price declines. Currently, Polygon (MATIC) is trading at $1.1357. Furthermore, experts believe that Polygon’s (MATIC) price would fall by 8.28% in one month. The corrected price of Polygon (MATIC) will be $1.0417.\n\nSolana (SOL) could decline by 26% post Friktion’s shutdown\n\nFriktion, a Solana (SOL) DeFi yield platform, states that its front end website is going down, and users should withdraw their funds from the platform. Though Solana’s (SOL) platform’s underlying protocol is still available on the blockchain, the front-end website will no longer offer the same services. The closure of Friktion, according to industry experts, may represent a setback for Solana’s (SOL) DeFi plans.\n\nOver $3 billion was traded on Solana’s (SOL) Friktion, and the platform’s Total Value Locked amounted to $150 million last year. Solana’s (SOL) price and performance may continue to suffer in the wake of the shutdown of its DeFi platform. Currently, the cost of Solana (SOL) is roughly $24. Additionally, if the crypto market has a bearish outlook in the coming month, the price of Solana (SOL) will also struggle, especially if it trades below its price of $22.77. If this price point is reached by Solana (SOL), it will result in the value of the altcoin further falling to the level at $17.89, signifying a 26% decline, as per experts.\n\nSnowfall Protocol (SNW) price skyrockets to $0.20\n\nSince its presale, Snowfall Protocol (SNW) has caused a stir in the cryptocurrency industry. The goal of Snowfall Protocol (SNW) is to make it simple and inexpensive to move cryptocurrency holdings from one blockchain to another, without the need for a lot of technical knowledge. This is possible with Snowfall Protocol’s (SNW) ability to facilitate multi-chain communication, which enables the transfer of digital assets without any interruptions or third-party interference.\n\nOwing to the enormous buzz surrounding the project, Snowfall Protocol (SNW) has successfully completed two rounds of presale, and generated over $4 million. The value of the native SNW token of Snowfall Protocol has skyrocketed from $0.005, in the first phase of the presale, to the current value of $0.20. Snowfall Protocol’s (SNW) presale period ends in February, and its price is expected to increase by as much as 5,000% once it is made available to the public.\n\nget in while you can and invest in Snowfall Protocol (SNW) today!!!\n\nPresale: https://presale.snowfallprotocol.io\n\nWebsite: https://snowfallprotocol.io\n\nTelegram: https://t.me/snowfallcoin\n\nTwitter: https://twitter.com/snowfallcoin\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24td2h5LWV0aC1pcy1zZXQtdG8taGF2ZS1hLWJ1bGxpc2gtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction - Why ETH Is Set to Have a Bullish 2023 - Analytics Insight",
        "content": "After months of rollercoaster rides with the $1,500 price range, Ethereum has finally managed to break the $1,600 resistance and is doing a good job stabilizing it at the moment.\n\nAlongside Bitcoin and most other leading altcoins, Ethereum has recorded some solid returns so far in January, with a value increase of around 30%.\n\nIf the market continues this recovery and other puzzles fall into place as well, Ethereum could have one hell of a comeback year in 2023.\n\nHowever, experts believe that it won’t bring nearly as much profit as Meta Masters Guild (MEMAG), FightOut (FGHT), RobotEra (TARO), and C+Charge (CCHG).\n\nLet’s go through the details.\n\n>>>Buy the Best Presale Crypto Now<<<\n\nEthereum Price Prediction 2023 – What Can We Expect from Bullish Rallies?\n\nEven despite the amazing progress Ethereum has made in 2022 such as the September 15h Merge, the price was “held captive” by the severe bear market.\n\nWe haven’t seen ETH reach the $2,000 target since May 2022, with $1,500 being a huge struggle point for Q3 and Q4 of 2022. Ever since the ATH of $4,878 in 2021, the price has been through numerous drops.\n\nHowever, with the market finally beginning to stabilize, we could be on the brink of new major bullish runs this year that will drive the price of Ethereum once again across the $2,500-$3,000 mark.\n\nWe’re already seeing some solid 30% returns in January, but the real test will be the $2,000 point and whether ETH will surpass it until summer.\n\nAnd with the Shanghai upgrade anticipated for March 2023, many experts believe that 2k will just be the starting point and that ETH has a real chance of ending 2023 somewhere around $5,000.\n\nThis is an impressive ROI if the predictions come true, but if you want 30x-50x returns this year, you should focus on the following projects.\n\n>>>Buy the Best Presale Crypto Now<<<\n\nMeta Masters Guild (MEMAG)\n\nMeta Masters Guild is a robust and innovative gaming guild that leverages P2E, Metaverse, and blockchain elements in one immersive ecosystem.\n\nIt addresses one of the most common problems in the crypto gaming space – boredom. Nowadays, there are a ton of players that take up a new P2E game and then quickly get bored due to the lack of innovation.\n\nThat’s why Meta Masters incorporates several P2E games with different storylines and concepts, providing users with the ultimate fun gaming experience.\n\nThe presale for MEMAG tokens started just a few weeks ago and it’s already going incredibly well, so don’t miss your chance of joining before the sell-out.\n\n>>>Buy MEMAG Now<<<\n\nFightOut (FGHT)\n\nFightOut is an M2E project that’s looking to dethrone some of the biggest players in this niche and establish itself as the new leader.\n\nIt utilizes NFTs, Web3, and blockchain tech to offer users a unique Move-to-Earn experience and motivate them to achieve their fitness goals.\n\nFor this purpose, users can access personalized diet regimes and training that have been tailored to their needs by professional coaches and nutritionists.\n\nThere are also NFT avatars that mirror your progress and you’ll be able to show them off in some of the real-world gyms that will be launched later this year.\n\nInvestors believe that this gym chain will have a huge influence on the price and that it will prompt some huge bullish rallies.\n\n>>>Buy FGHT Now<<<\n\nRobotEra (TARO)\n\nRobotEra is a new crypto gaming platform launched in an immersive Metaverse and it combines several P2E games and countless monetization opportunities.\n\nYou need an NFT robot avatar to cruise the different continents and explore the world, and these tokens will rise in value as the game continues to develop.\n\nThere are a few different ways to make money – using robot companions to complete tasks, trading land, selling your interesting creations, and more.\n\nRobotEra is currently in its presale phase in which you can buy TARO tokens for a huge discount.\n\n>>>Buy TARO Now<<<\n\nC+Charge (CCHG)\n\nC+Charge is a green cryptocurrency that functions as a P2P payment app and provides EV drivers with carbon credits for their contribution to the environment.\n\nBecause it aims to democratize the carbon credit market (that’s currently ruled by big corporations), experts are calling it the “best eco-friendly crypto of 2023”.\n\nThe main center point is the mobile app that shows EV drivers where the nearest charging stations are and rewards them with carbon credits if they charge the vehicles at CCHG-specified stations.\n\nWe might be looking at the lowest CCHG price ever, which is why experts suggest that now is the best time to join the ongoing presale.\n\n>>>Buy CCHG Now<<<\n\nRipple (XRP)\n\nRipple’s trial with SEC has been closely followed by the entire crypto market and the verdict will have a huge impact on the rest of the industry.\n\nWhile XRP is still hanging tightly onto its position as one of the leading altcoins, the future of the token pretty much depends on the outcome of the trial.\n\nThis is why so many speculative traders have put huge sums of money into it – if the verdict is in Ripple’s favor, we could see some incredible returns.\n\n>>>Buy the Best Presale Crypto Now<<<\n\nThe Bottom Line\n\nWith the Shanghai upgrade and market recovery, Ethereum is currently in a great position to continue the bullish rally and bring some hefty profits.\n\nIn fact, it’s possible to end 2023 somewhere around the $10,000 mark if everything goes as planned in the following months.\n\nBut, the 30x-50x return potential that MEMAG, FGHT, TARO, and CCHG promise is much more attractive.\n\nAccording to numerous media outlets and industry experts, these tokens are ticking “profit bombs” and they will explode as soon as they go viral.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZGFpbHljb2luLmNvbS9wcmVzcy1yZWxlYXNlcy9idWRibG9ja3otYmx1bnQtaXMtZ2V0dGluZy1tb3JlLXRyYWN0aW9uLWFuZC1jcnlwdG8tZXhwZXJ0cy1jb21wYXJlLWl0LXRvLWV0aGVyZXVtLWV0aC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "BudBlockz (BLUNT) Is Getting More Traction and Crypto Experts Compare It to Ethereum (ETH) - DailyCoin",
        "content": "Crypto analysts are constantly assessing new cryptocurrencies to find market potential. Their goal is to recognize and recommend tokens that may soon be claiming the top spot. It is tough to predict which tokens will deliver multifold returns.\n\nAnalysts make predictions based on business plans shared by new projects. For example, BudBlockz (BLUNT) has come up with a unique solution for millions of cannabis enthusiasts around the world. It aims to be the world’s first e-commerce platform for cannabis trading. Experts believe it may experience the same success as Ethereum ($ETH) and other top-ranked tokens.\n\nBudBlockz: Inviting Cannabis-Enthusiasts to Invest in the Fast-Growing Cannabis Industry\n\nPeople have been using cannabis since ancient times. Experts believe that people from central Asia started using this plant for medicinal and recreational purposes. It gradually became popular across the globe and attracted millions to its euphoric effects.\n\nA report reveals that up to 80% of Americans wish to legalize marijuana. They want to buy it legally and use it wisely to experience associated benefits. Eighteen states have already legalized this product, with many new states possibly decriminalizing it in the upcoming months or years.\n\nBudBlockz aims to benefit crypto investors by offering ways to invest in cannabis-related businesses. It has a solid roadmap to succeed and if it works, that success will make BLUNT an extremely popular cryptocurrency.\n\nUsing decentralized technologies to unite the cannabis industry\n\nThere is no other decentralized platform trying to unite the cannabis industry. BudBlockz is the first of its kind to offer a complete ecosystem for the marijuana sector and will grant opportunities to trade and invest in top-quality products. In addition, it will open licensed dispensaries across the globe to make top-quality cannabis products available.\n\nBudBlockz will use decentralized technologies to protect users’ information and provide easy access to logistics data. It is currently focusing on building a community of cannabis enthusiasts. The BLUNT community will play an essential role in growing and popularizing BudBlockz across the world.\n\nDevelopers have ensured that every potential user can easily access and navigate this platform. It helps users learn the latest legislation in their jurisdictions and provides information on products, and where they can access them legally. BudBlockz is establishing itself as a one-stop destination for learning everything about cannabis trading.\n\nProviding Ganja Guruz NFTs for fractional ownership\n\nBudBlockz will establish cannabis farms and dispensaries and will partner with local businesses to produce top-quality products. Licensed dispensaries will distribute products sourced from all over the world.\n\nSince the cannabis industry is growing fast, many people want to invest in marijuana-related businesses. BudBlockz is using NFT technology to provide fractional ownership – with users needing the Ganja Guruz NFTs to invest in cannabis enterprises.\n\nUsers who complete the KYC process will get the opportunity to have a stake in farms or dispensaries. However, they must be eligible to own such businesses in their regions.\n\nThe Blunt Token\n\nBudBlockz has introduced the BLUNT cryptocurrency which is currently available on presale. It is a new cryptocurrency offering access to all the services offered by BudBlockz.\n\nPeople have started buying and storing the BLUNT token in their crypto wallets to gain significant returns in the long term. There is a limited supply, so invest early to gain maximum returns. Cannabis enthusiasts and crypto investors are already buying and holding large chunks of the total supply, looking to huge potential profits in the future.\n\nEthereum displays signs of recovery in 2023\n\nEthereum has been in recovery mode since the market crashed. Many unfortunate events occurred that prevented Ethereum from regaining its lost value. Even though its value is low and the recovery is pretty slow, experts believe Ethereum may soon cross the $2,000 mark.\n\nEthereum is supporting thousands of projects that require a reliable network to operate. Demands for the Ether Token may increase rapidly, and the ETH token may benefit millions of investors. As per reports, the Ethereum Foundation is sponsoring several grants to accelerate Ethereum-related academic work. The current round has funds worth $1 million and it is due February 27th, 2023.\n\nBudBlockz is the first decentralized platform for cannabis enthusiasts. Just like Ethereum, the BLUNT token is required to access valuable services provided by BudBlockz. It may soon compete with top-ranked altcoins to claim the top position and benefit investors in the long term."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2NyeXB0b2N1cnJlbmN5L3N0b3J5L2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi1ldGhlcmV1bS1zb2xhbmEtZGlwLW1lbWUtY29pbnMtZmFsbC0yMzI4NTI1LTIwMjMtMDEtMzHSAYUBaHR0cHM6Ly93d3cuaW5kaWF0b2RheS5pbi9hbXAvY3J5cHRvY3VycmVuY3kvc3RvcnkvY3J5cHRvLXByaWNlcy10b2RheS1iaXRjb2luLWV0aGVyZXVtLXNvbGFuYS1kaXAtbWVtZS1jb2lucy1mYWxsLTIzMjg1MjUtMjAyMy0wMS0zMQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Crypto prices today: Bitcoin, Ethereum & Solana dip; meme coins fall - India Today",
        "content": "On 31 January, the prices of top cryptocurrencies traded in the red. Bitcoin's value went down by 3.81 percent to $22,837.20, comparatively lower than its previous week's value. The price of Ethereum also suffered negatively by 4.27 percent to stand at $1,569.48.\n\nAs of (0930 IST), the global crypto market cap declined 3.50 percent to $1.04T in the last 24 hours. The total crypto market volume, on the other hand, increased in its value by 14.47 percent to $56.91B.\n\nadvertisement\n\nThe value of XRP was down by 5.33 percent to $0.392237, followed by Solana's plunge of 6 percent to $23.96. This fall is further witnessed in the values of Polygon and BNB by 5.94 percent to $1.09 and 1.14 percent to $312.27, respectively, in the last 24 hours. At the same time, Cardano registered a loss of 5.34 percent to $0.372049. However, Dash grew by 8.30 percent to $61.83.\n\nAvalanche and Monero tumbled 5.38 percent to $19.59 and 6.60 percent to $173.55, respectively.\n\nTop gainers and losers of today\n\nThe market on Tuesday impacted the top cryptocurrencies. According to CoinMarketCap, the top gainers were Mina, Dash, Dogecoin, and dYdX. Contrarily, the top losers were BitDAO, Axie Infinity, Gala, and Lido DAO.\n\nMeme coins notice plunge\n\nThe plunge in the market also lowered the meme coins' value over 24 hours. Shiba Inu was down by 2.97 percent to $0.000012, along with Dogelon Mars's 4.54 percent slip to trade at $3.39e-7. Dogecoin, being the gainer of today, marked an increase in its value by 1.78 percent to $0.091208.\n\nMetaverse tokens decrease in value\n\nMetaverse tokens were equally affected by market fluctuations, which led to a decrease in top token prices. The dip was witnessed in Decentraland's value by 7 percent to $0.732641. This continued in the prices of Axie Infinity and Sandbox at 10.94 percent to $10.64 and 8.31 percent to $0.718367, respectively."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS0zMS1qYW4tYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1zb2xhbmEtcG9seWdvbi1zaGliYS1pbnUtMTU4MDMyODEuaHRt0gGMAWh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9waG90b3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LTMxLWphbi1iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXNvbGFuYS1wb2x5Z29uLXNoaWJhLWludS0xNTgwMzI4MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum down over 3%, most other tokens fall - CNBCTV18",
        "content": "1 / 8\n\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, fell 3.5 percent to $22,846.2. Its market value stood at $440.2 billion. The trade volume was at nearly $27.02 billion.\n\n2 / 8\n\n\"Bitcoin was seen changing hands at $22,800. BTC is down by three after reaching a high on Sunday of $24,000. Support for BTC is now $22,700, and resistance is $23,000,\" said Edul Patel, CEO and Co-Founder of Mudrex.\n\n3 / 8\n\nEthereum | The second largest virtual currency, Ethererum or Ether also fell 3.9 percent to $1,574.2 at the last count, with a market capitalisation of nearly $192 billion. The trade volume of Ethereum was almost $9.1 billion in the last 24 hours.\n\n4 / 8\n\nDogecoin | Meme-based virtual currency, Dogecoin, rose 0.7 percent to $0.1. Its market value stood at $11.9 billion. The trade volume was at nearly $837.4 billion.\n\n5 / 8\n\nSolana | Solana slumped six percent to $24.2 with a market capitalisation of $8.9 billion. The trade volume of Solana was $1 billion in the last 24 hours.\n\n6 / 8\n\nShiba Inu | Shiba Inu fell 2.2 percent with a market capitalisation of almost $6.4 billion. The trade volume was almost $306.8 million in the last 24 hours.\n\n7 / 8\n\nPolygon | Polygon fell 5.6 percent with a market capitalisation of $9.5 billion. The trade volume was $588.7 million in the last 24 hours.\n\n8 / 8"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vdS50b2RheS9wb3J0YWwtZmFudGFzeS10aGUtbWFnaWNhbC1waXhlbC1ycGctdG8tYmUtbGl2ZS1vbi1ldGhlcmV1bS1ldGgtYW5kLWF2YWxhbmNoZS1hdmF4LWluLTIwMjPSAW5odHRwczovL3UudG9kYXkvcG9ydGFsLWZhbnRhc3ktdGhlLW1hZ2ljYWwtcGl4ZWwtcnBnLXRvLWJlLWxpdmUtb24tZXRoZXJldW0tZXRoLWFuZC1hdmFsYW5jaGUtYXZheC1pbi0yMDIzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Portal Fantasy, the Magical Pixel RPG to be Live on Ethereum (ETH) and Avalanche (AVAX) in 2023 - U.Today",
        "content": "Advertisement\n\nPortal Fantasy, a community-based narrative-driven RPG supercharged by leading smart contract platforms, aims at redefining blockchain gaming with a player-first approach.\n\nPortal Fantasy invites GameFi enthusiasts to journey into the lands of the unknown\n\nUnveiled in Q1, 2023, Portal Fantasy is a free-to-play browser-based pixel RPG powered by the Ethereum (ETH) and Avalanche (AVAX) network. The game is set in a backdrop of a riveting and deeply engaging narrative that weaves its plot and gameplay seamlessly to create a familiar yet unique experience. Players can explore, battle, and create in the virtually unlimited number of worlds as they join hands with the brave Heroes and Architects.\n\n✨We're thrilled to reveal the Portal Fantasy trailer!✨\n\n⸜(｡˃ ᵕ ˂ )⸝\n\n\n\nA quiet day. A flickering monitor. A mysterious portal and a cat that wished he had thumbs. Through a series of dangerous and magical quests - uncover the secret of Portal Fantasy in this brave new world. pic.twitter.com/p9hA0kEo9q — Portal Fantasy 🔺 (@PortalFantasyio) November 28, 2022\n\nPlayers can choose from two completely unique but equally rewarding platsyles. Explore, train, and fight alongside Porbles (the magical creatures who roam these lands) as Heroes, or create brand-new worlds of their own design as Architects.\n\nImage by Portal Fantasy\n\nHeroes are tasked with exploring the vast worlds that are accessible via portals, and Architects are the ones tasked with creating them. As Heroes explore Architects' creations, they will be rewarded.\n\nThe developers had a “player first” approach when designing Portal Fantasy. The game is meant to offer a fun and memorable experience through its immersive quests and engaging narrative. The replayability offered by multiple playstyles and the potential for a long-lasting in-game community is the cherry on top. The design of the game is inspired by classic metroidvania-sque titles that offer a lot of freedom to the player. The hand-drawn classic-style pixel art harkens back to the original Pokemon titles.\n\nThe game features 30 original soundtracks designed to make the Portal Fantasy experience even more immersive. They also have a webcomic on Webtoon called Portal Fantasy with 11 chapters published at the time of writing. The events portrayed cover the epoch that started 2000 years after the War of the Goddesses between Ravenna and the Pyli Kingdom.\n\nBalanced and sustainable economy for maximum inclusiveness\n\nSimilar to many other GameFi and play-to-earn heavyweights, in Portal Fantasy , players can buy and breed their own Porbles from six different elements. New Porbles can be customized by Heroes and used to battle each other. The ultimate goal as Heroes is to capture all 100 Porbles in the Porble Index and build the best team. Porbles are Pokemon-style creatures that would be minted as NFTs. People would be able to trade Portal Fantasy NFTs outside the game on third-party platforms.\n\nImage by Portal Fantasy\n\nThe team behind Portal Fantasy aimed to create an inclusive game that was welcoming to players of all backgrounds, be it crypto enthusiasts or hardcore gamers.\n\nImage by Portal Fantasy\n\nPortal Fantasy invites both Web2 and Web3 natives: players can enjoy the game on its own without ever having to be exposed to its NFT and crypto functionalities. This allows the game to avoid the common pitfalls of the DeFi segment. For instance, the game does not depend on a constant inflow of new players. As a result, Portal Fantasy manages to entirely avoid the common criticism of crypto games being “Ponzi schemes' ' that rely on its user base rewarding itself.\n\nAdditionally, no mechanism of directly extracting value from the game exists in Portal Fantasy. Players are not required to attach their wallets prior to playing the game, this is entirely voluntary and can be done at any point.\n\nThis approach both builds trust within the gaming community and protects the game from being overrun by whales who sully the economy.\n\nMeanwhile, the game’s tokenomics is built on the top of the dual-token model: the Portal Fantasy Token (PFT) is a membership utility and governance token, while the game’s in game currency, Portal Orbs (ORB) are completely off-chain and require no monetary input from players. The total supply of PFT will be capped at 1 billion tokens. Moreover, the game’s cost of entry will remain at $0 for its entire lifespan.\n\nBeyond what has already been designed by the developers, the Portal Fantasy team is focused on building a solid, thriving and passionate community around the product. In the future, a new generation of enthusiasts will be able to create their own spin-offs of the game, with new maps, puzzles, quests and stories.\n\nPortal Fantasy release backed by suite of reputable VCs\n\nThe team behind Portal Fantasy boasts a number of heavy-hitters in the industry, with dozens of years of expertise combined among them. With alumni from veteran studios such as Ubisoft, Haemimont Games, and Ironward, who are behind some of the most notable AAA releases of recent years; it's safe to say that Portal Fantasy is in good hands.\n\nFurthermore, the development of the game has solid VC backing: its list of investors include Avalanche creators Ava Labs, top GameFi venture capitalists YGG SEA, Makers Fund, Blizzard Fund, Avalaunch, GFR Fund, Infinity Ventures, Genesis Block Ventures, Keychain Capital, C2 Ventures, Miranа, Wave Financial, D1 Ventures to name a few.\n\nWith such massive support, Portal Fantasy is set to push the boundaries in play-to-earn gaming, and will undoubtedly thin the distinction between blockchain and traditional games."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9pbnRlcmVzdC1pbi1lbnMtZG9tYWluLW5hbWVzLXJlbWFpbnMtbG93LXRoZS1yZWFzb24taXMtcXVpdGUtc3VycHJpc2luZy_SAWJodHRwczovL2FtYmNyeXB0by5jb20vaW50ZXJlc3QtaW4tZW5zLWRvbWFpbi1uYW1lcy1yZW1haW5zLWxvdy10aGUtcmVhc29uLWlzLXF1aXRlLXN1cnByaXNpbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Interest in ENS domain names remains low; the reason is quite surprising - AMBCrypto News",
        "content": "Interest in ENS domain names remains at a minimum.\n\nThe rally in ENS’ price since the year began has put many of its holders in profit.\n\nAccording to data from Dune Analytics, the interest in .eth domain registrations has remained low, with only 53,359 Ethereum Name Service (ENS) registrations recorded thus far in the current year.\n\nThroughout 2022, monthly domain name purchases on Ethereum Name Service embarked on a steady decline to close the tumultuous trading year with just 52,835 registrations in December.\n\nAfter rallying to a high of 437,365 .eth name registrations in September, it plummeted by 88% within three months.\n\nRead ENS’ Price Prediction 2023-2024\n\nAs capital flight intensified amid the significant decline in the market last year, interest in ENS domain names dropped to an all-time low.\n\nGoogle Trends, though not the most sophisticated of data tools, provided a rough insight into the global internet users’ interest level in ENS domain and .eth names.\n\nInterestingly, primary ENS name registrations saw a spike in the last month. A primary ENS name is a unique, human-readable name that is used to identify and locate a specific Ethereum address.\n\nAccording to Dune Analytics, primary ENS name registrations hit a two-month record of 17,027 in the last 30 days, yet this marks a 45% decrease from the peak of 31,000 primary names registered in May 2022.\n\nAs for revenue made from name registrations on the platform so far this month, the protocol saw a 49% jump in revenue for .eth name renewals but logged an 11% decline in revenue for new name registrations.\n\nRealistic or not, here’s ENS’ market cap in BTC’s terms\n\nProfit-taking is the order of the day\n\nOn a year-to-date basis, ENS’s price has grown by 46%. At press time, the altcoin traded at $15.77, data from CoinMarketCap showed.\n\nLeveraging the unexpected price rally, ENS holders began distributing their holdings to realize profits on their various investments. Data from on-chain data provider Santiment revealed that the ENS’ supply on exchanges has grown steadily since the year began. At press time, 8.13 million ENS tokens sat within cryptocurrency exchanges.\n\nAs its price grew, ENS’s MVRV ratio rallied alongside. At press time, the altcoin’s MVRV ratio was 74%. This meant that the asset’s current market value was 74% higher than its realized value.\n\nAs a result, if all holders sell their tokens at the current price, they will receive an average return of 2x their initial investment.\n\nHowever, ENS was overvalued at that level and might be due for a price correction. Generally, experts consider an MVRV ratio above 20% for altcoins to be high-risk. Therefore, they advise waiting for the MVRV to fall below 10% before making a purchase for better risk management."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC1jcnlwdG9jdXJyZW5jeS1wcmljZXMtdG9kYXktYml0Y29pbi1hbmQtZXRoZXJldW0tdHJhZGUtaGlnaGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Top Cryptocurrency Prices Today: Bitcoin and Ethereum Trade Higher - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3dvcm1ob2xlLXVuaXN3YXBzLWJyaWRnZS10by1ibmItY2hhaW4v0gFLaHR0cHM6Ly9lbi5ldGhlcmV1bXdvcmxkbmV3cy5jb20vd29ybWhvbGUtdW5pc3dhcHMtYnJpZGdlLXRvLWJuYi1jaGFpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Wormhole Set To Become Uniswap’s Official Bridge To BNB Chain - Ethereum World News",
        "content": "Crypto bridge Wormhole has won the governance vote to become Uniswap’s designated bridge to BNB Chain.\n\nWormhole beat fellow bridges Layerzero and deBridge to become the DEX’s bridge provider.\n\nCommunity members aim to use BNB Chain’s strong governance model and active community to develop Uniswap V3.\n\nWormhole will have to pass a final governance vote to become the DEX’s official bridge to BNB Chain.\n\nUniswapDAO has chosen the popular cross-chain bridge Wormhole as its official bridge to BNB Chain. Wormhole will be used by Uniswap V3 for cross-chain governance messaging between Ethereum and BNB Chain. The crypto bridge, which notably suffered a $325 million attack in February 2022, came out as the top choice for the decentralized exchange (DEX) after it won the governance vote.\n\nWormhole beat LayerZero and deBridge to become Uniswap’s official bridge\n\nAccording to the proposal posted on UniswapDAO’s governance forum last month, there were five initial contenders for the cross-chain to the BNB Chain. These were HyperLoop (0xPlasma), LayerZero, Celer, and Stargate. Wormhole and deBridge were added later when they expressed interest in becoming the provider for the BNB deployment.\n\nFor cross-chain deployment proposals, we believe it is most important to optimize for protocol security — specifically, for community members to be able to make informed decisions based on all available information on risks to bridge security.”\n\nThe voting snapshot shows that Wormhole received more than 62% of the votes. LayerZero was the second most popular choice with over 37% of the votes. The rest of the contenders including deBridge and Celer accumulated negligible votes. Wormhole will now have to pass a final vote to secure its status as the official bridge to BNB Chain.\n\nThe DEX aims to deploy on other chains before its BUSL license expires in April this year. Community members highlighted several other reasons to make the case for Uniswap V3’s deployment on BNB Chain. Among these were BNB Chain’s large and growing user base, an untapped market for the DEX to acquire new users. According to one member, “BNB Chain’s strong governance model and active community could provide valuable support and feedback for the development of Uniswap v3.”"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wMS8zMDYzNjA1Ny9nYWxhLWRpbm5lci13aXRoLWRvbmFsZC10cnVtcC1ub3ctZm9yLTEtZXRoZXJldW0tYXMtc3dlZXBzdGFrZS1uZnQtZmxvb3ItcHJpY2UtcGx1bmdlcy1ieS3SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzA2MzYwNTc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "'Gala Dinner' With Trump Now For 1 ETH As Sweepstake NFT Floor Price Plunges By 94% - Benzinga",
        "content": "The floor price of Donald Trump Winner Sweepstakes NFT has plunged by 94%, since its first sale on Jan. 12, to 0.122 Ethereum ETH/USD, worth $192.\n\nWhat Happened: Sweepstake NFTs feature images of Trump displaying a sign resembling a ticket, which outlines the prizes offered during the minting, such as a Gala dinner in Miami with Trump, a group cocktail at Mar-A-Lago, a one-on-one conversation with Trump, an hour of golf with the former president and two friends, as well as a Zoom call.\n\nSee Also In Benzinga India: Top Indian Apps That Give Bitcoin, NFT Rewards\n\nThe floor price of Gala dinner NFT has dropped to 1 ETH worth $1577, this was above 3 ETH worth $4,500 last month — a drop of 65%. It should be noted that users had to mint 45 Trump NFTs at $99 each for a guaranteed dinner ticket.\n\nAccording to OpenSea, the best offer received to buy stands at $0.0751 ETH. The total volume stands at 229 ETH with 821 owners and 29% unique owners.\n\nIn December, Trump unveiled Collect Trump Cards, an online website releasing 45,000 NFTs of the former president.\n\nThe collection is made up of 45,000 individual collectibles and was sold out for $4.45 million within a day of launching. Originally priced at $99 apiece, individual NFTs have since fetched considerably higher prices due to the incredible demand.\n\nRead Next: Dogecoin Rises On Musk Effect, Bitcoin, Ethereum Slide: Analyst Says Inflation Risks 'Need To Go Away' Amid Regulatory Fears\n\n\n\n"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC0zLWNyeXB0b2N1cnJlbmNpZXMtdGVjaG5pY2FsLWFuYWx5c2lzLWJpdGNvaW4tZXRoZXJldW0tYW5kLXNvbGFuYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Top 3 Cryptocurrencies Technical Analysis: Bitcoin, Ethereum, and Solana - Analytics Insight",
        "content": "An analysis of the Bitcoin/USDT 1-hour chart reveals that the dominant cryptocurrency is currently trading in proximity to its 200-day Moving Average (MA). The Relative Strength Index (RSI) reading of 41.91 suggests that bears are attempting to establish market dominance. Additionally, the Average True Range (ATR) of Bitcoin is displayed at 158.23, further emphasizing market volatility.\n\nBitcoin/USDT 1-Hour Price Analysis (Source: TradingView)\n\nFurthermore, after an extended period of consolidation, the digital asset appears to have finally breached its 200-day Moving Average to the downside. Nevertheless, numerous crypto analysts are anticipating a retest of the previous resistance level at $25,000 for Bitcoin. Should this price level be retested, it is speculated that a significant sell-off could ensue.\n\nEthereum/USDT 1-Hour Price Analysis (Source: TradingView)\n\nThe chart above depicts an evaluation of Ethereum, the second largest cryptocurrency by market capitalization. Currently, the cryptocurrency is trading near its 1-hour support level at a price point of $1,540. The Relative Strength Index (RSI) is exhibiting a bearish slope with a reading of 42.89. However, the Bull Bear Power Indicator displays a positive value of 8.76, indicating that bulls are currently exerting control over the market.\n\nAdditionally, Ethereum has violated its 200-day Moving Average and is now trading beneath it, suggesting that sellers are attempting to break the current support level. If this support level fails, it is projected that Ethereum will experience a price decline towards $1450.\n\nSolana/USDT 1-Hour Price Analysis (Source: TradingView)\n\nLastly, the third and the most well-known cryptocurrency for the NFT collects, Solana 1-hour chart is displayed above. Solana is also following the patterns of the major cryptocurrencies, Bitcoin and Ethereum. Additionally, the Bull Bear Power indicator is shown at a reading of -0.25, meaning that the bears are taking the throne as of now.\n\nBut however, if Bitcoin, the dominant cryptocurrency, manages to trigger a bullish trend, it is likely that other cryptocurrencies such as Solana will mirror its movement.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5pbmRpYXR2bmV3cy5jb20vYnVzaW5lc3MvbWFya2V0cy9iaXRjb2luLWhvbGRzLXN0ZWFkeS1uZWFyLTIzLTcwMC13aGlsZS1zb2xhbmEtYW5kLWJpbmFuY2UtY29pbi1zZWUtaW5jcmVhc2VzLW9mLXVwLXRvLTYtMjAyMy0wMS0zMS04NDM1MTnSAZoBaHR0cHM6Ly93d3cuaW5kaWF0dm5ld3MuY29tL2FtcC9idXNpbmVzcy9tYXJrZXRzL2JpdGNvaW4taG9sZHMtc3RlYWR5LW5lYXItMjMtNzAwLXdoaWxlLXNvbGFuYS1hbmQtYmluYW5jZS1jb2luLXNlZS1pbmNyZWFzZXMtb2YtdXAtdG8tNi0yMDIzLTAxLTMxLTg0MzUxOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin holds steady near $23,700, while Solana and Binance Coin see increases of up to 6% - India TV News",
        "content": "Follow us on Image Source : UNSPLASH Bitcoin holds steady near $23,700, while Solana and Binance Coin see increases of up to 6%.\n\nCrypto News: As of January 30, 2023, the price of Bitcoin, the largest cryptocurrency by market capitalization, is currently trading at around $23,402.75with a decline of 1.40%. Ethereum, the second largest cryptocurrency by market capitalization, is currently trading at around $1,604.10 having a decrease of 1.59%.\n\nBUDGET 2023: FULL COVERAGE\n\nThe cryptocurrency market has seen a significant decrease in recent months, with many alternative coins also experiencing a drop in value. It is important to remember that the prices of cryptocurrencies can be extremely unstable, and sudden price changes in both directions are not uncommon.\n\nThe cryptocurrency market is currently experiencing stability, with Bitcoin holding its value near $23,700. Bitcoin, the world's largest cryptocurrency by market capitalization, has been on a bullish run since the beginning of 2021 and has seen its price more than triple in value. Despite recent price corrections, it remains one of the most popular investments among retail and institutional investors.\n\nIn addition to Bitcoin, other cryptocurrencies are also performing well. Solana and Binance Coin (BNB) have seen increases of up to 6% in value, indicating a strong demand for alternative cryptocurrencies. Solana, a high-performance blockchain platform, has been attracting attention due to its ability to handle high transaction volumes and its fast processing times. Binance Coin, on the other hand, is the native token of the Binance exchange, one of the world's largest cryptocurrency exchanges.\n\nInvestors who are looking for alternative investment opportunities in the cryptocurrency market will likely be keeping an eye on Solana and Binance Coin, as these cryptocurrencies are showing potential for future growth. However, it is important to note that the cryptocurrency market is highly volatile and that prices can change rapidly.\n\nMajor cryptocurrencies are trading as follows as on 9 am IST, 31 January 2023 :\n\n• Bitcoin :\n\n$23,157.54\n\n-2.99%\n\n• Ethereum : $1,586.03 USD\n\n-3.54%\n\n• Tether : $1.02 USD\n\n+0.59%\n\n• USD Coin : $1.00 USD\n\n-0.10%\n\n• BNB: $315.00 USD\n\n-1.28%\n\n• XRP : $0.3989 USD\n\n-4.87%\n\n• Dogecoin : $0.09418 USD\n\n+4.71%\n\n• Cardano : $0.3778 USD\n\n-4.79%\n\n• Polygon : $1.11 USD\n\n-5.32%\n\n• Polkadot : $6.35 USD\n\n-5.02%\n\n• Tron : $0.06263 USD\n\n-1.26%\n\n• Litecoin : $97.14 USD\n\n+0.87%\n\n• Shibu Inu : $0.00001205 USD\n\n-1.45%\n\n• Solana : $24.77 USD\n\n-5.40%"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tdXNhZ2Utc2t5cm9ja2V0cy1ldGgtaGl0cy10d28tbW9udGgtaGlnaC_SAU1odHRwczovL2JpdGNvaW5pc3QuY29tL2V0aGVyZXVtLXVzYWdlLXNreXJvY2tldHMtZXRoLWhpdHMtdHdvLW1vbnRoLWhpZ2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 17:22:43 GMT",
        "title": "Ethereum Network Usage Skyrockets As ETH Hits Two-Month High - Bitcoinist",
        "content": "Despite the crypto market conditions, crypto assets and blockchains have continued to amass new highs pushing the global cryptocurrency market forward. In today’s news, Ethereum on-chain activity recorded a new high following the crypto market revival.\n\nVarious metrics under the Ethereum network have only continued to show a steady increase in the past few months. According to data from Etherscan, the total number of ETH transferred daily on the network surpassed 1 million once again in recent years, indicating that the network activity has not had any significant decline over the past three months.\n\nNot only has daily transfer increased, but another metric, such as network usage in terms of addresses, has also surged. According to PrimeXBT’s recent report on Ethereum, the network has grown actively in use, recording a high of 92.5 million addresses over the weekend.\n\nEthereum Network Continuous Growth\n\nEthereum, the second-largest crypto by market cap, has been a rival to the top crypto, Bitcoin. Since it emerged in the market, the Ethereum network has only continued to grow year after year with no significant retracement of any kind.\n\nOver the past six months, the Ethereum network’s unique addresses have surged roughly 10%, reaching an all-time high of 221 million. Alongside its other metric growth, there has been a 140% increase in the number of daily verified smart contracts on the network since last year.\n\nWith the rapid adoption and birthing of new ecosystems in Web3, potential blockchains such as Ethereum have had significant boosts making the native token hold steadily with no drastic decline. According to crypto YouTuber Lark Davis, Ethereum has been fundamentally solid throughout the bear market.\n\n“Ethereum is deflationary, provides high yields, has no sell pressure from miners anymore, is 99% more energy efficient, and has a thriving layer two scene as well as massive dev activity… all in a bear market. In summary, no one has enough ETH,” Davis tweeted on January 29.\n\nFollowing Ethereum’s transition into the proof of stake (PoS) mechanism, the network has been expected to become a deflationary token, and so far, it has performed as expected. Data from Ultrasound Money shows Ethereum issuance is currently deflationary at -0.04% per year.\n\nThis indicates that the supply of circulating ETH is shrinking over time. The total supply of ETH, which was 120.5 million at the beginning of this year, has decreased by around 9,200 ETH, valued at approximately $15 million, at the time of writing.\n\nEthereum (ETH) Price Outlook\n\nIn the past few weeks, ETH has rallied significantly, reaching a 12-week (nearly three months) high — this was achieved in the early hours of January 30 after seeing an almost 3% increase to trade for $1,658. Over the past 30 days, ETH has increased more than 30%, breaking out of the $1,300 zone seen late last year.\n\nMeanwhile, as the cryptocurrency market is currently experiencing a retracement, ETH has also followed suit and is down 2.4% in the last 24 hours with a current market price of $1,573 at the time of writing.\n\nFeatured image from Shutterstock, Chart from TradingView"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2VuZ2xpc2gtcHJlbWllci1sZWFndWUtcGFydG5lcnMtd2l0aC1zb3JhcmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "English Premier League partners with this blockchain fantasy sports platform to mint Ethereum-based digital player cards - Cryptopolitan",
        "content": "Sorare, a blockchain-powered fantasy sports platform, has partnered with the English Premier League (EPL) to create Ethereum-based digital player cards for its platform. By offering users unique and exclusive trading possibilities of Non-Fungible Tokens (NFTs) on different marketplaces, Sorare is spearheading exciting use cases for Ethereum-based fantasy sports and digital card collecting. This collaboration allows soccer fans worldwide to mint, collect and trade virtual versions of their favorite players’ cards amongst one another.\n\nAfter officially declaring the partnership on January 30th, a Sorare representative commented that talks between them and the league have been happening for some time.\n\nIn 2019, Sorare made a major breakthrough in the EPL network by signing West Ham United as its first English club partner. According to reports, the two parties have agreed upon a four-year deal with undisclosed contract values due to contractual reasons. This agreement is bound to benefit both sides in the years ahead.\n\nThe spokesperson for the company also clarified how this deal would be structured, with Sorare making an initial payment to the league in exchange for licensing rights. Then, a portion of profits from digital card sales would be split between Sorare and the Premier League.\n\nSorare is a one-of-a-kind platform that mints digital cards of EPL players on the Ethereum blockchain. The platform has been using ERC-721 token standard for its NFT player cards, allowing fans to collect and trade these tokens and use them in the fantasy sports league.\n\nAlso, Sorare is launching EPL digital cards, available for purchase before being tradable on acclaimed marketplaces such as OpenSea. Uniting fans, players, and organizations through blockchain technology has been the mission of the fantasy sports platform.\n\nFor Sorare, this innovative technology links users with their favorite teams and clubs. We are excited to see it creating the next generation of sports fanatics and entertainment experiences. Sorare\n\nIn recent years, NFTs have become highly sought-after items, from digital trading cards and sports highlights to NBA Top Shots that skyrocketed in 2021. Football leagues worldwide are increasingly taking advantage of blockchain-based platforms for their collectibles."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2NyeXB0by10b2tlbi1zdGFuZGFyZHMtZXhwbGFpbmVkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Crypto Token standards explained: ERC20, BEP20, BEP2, ERC721, ERC1155, ERC4626, ERC777, Wrapped tokens - Cryptopolitan",
        "content": "Cryptocurrencies are digital assets that exist on the blockchain. While there are thousands of different cryptocurrencies available in the market, most of them share similar underlying token standards.\n\nToken standards define some of the key functionalities and properties of blockchain tokens – such as token name, token symbol, token supply, token price, transferability between accounts, and more. Popular token standards include ERC-20, BEP-20, BEP 2 , ERC-721 , ERC777 , ERC-1155 , ERC4626 , and wrapped tokens. This article provides an overview of these token standards to help you understand their differences and similarities.\n\nWhy are crypto token standards important?\n\nCrypto token standards are important as they serve as protocols and guidelines to allow the stable functioning of cryptocurrency tokens. They play an essential role in organizing data and governing the interactions between smart contracts, decentralized applications, and other digital assets.\n\nToken standards are synonymous with similar concepts such as token transfer protocol, meaning they provide a blueprint for allowing different blockchain technologies and tokens to communicate with each other seamlessly.\n\nAs more types of tokens and protocols emerge, further discipline is required to ensure the success of blockchain technology – making crypto token standards all the more important for facilitating this congruence.\n\nCommon Token Standards in Crypto and DeFi\n\nWith the rise of blockchain technology, developers have created common token standards to facilitate interoperability and enable transparency. In the crypto and Decentralized Finance (DeFi) space, Ethereum‘s ERC20 has become an established leader in token standardization. Currencies like Bitcoin and Litecoin also have token standards for transferring value on their networks.\n\nOther popular standards include ERC721, a non-fungible token meant for digital collectibles and assets; ERC1155, a multi-token standard; ERC1337, a stablecoin standard; and ERC1400, a security token standard. These common token standards offer developers flexibility and added compatibility when creating new projects and applications. By operating within agreed-upon rulesets, all network participants can safely interact with them with greater security as compared to custom tokens built from scratch.\n\nERC20\n\nERC20 is the most popular standard for Ethereum tokens and relates to the ability to send and receive tokens within the Ethereum system. It is named an ERC for a reason – it stands for “Ethereum Request for Comment” and defines a set of rules that all ERC20 tokens must follow to be compatible with the Ethereum blockchain. This includes functions such as total supply, the balance of an address, transfer from one address to another, and approval of allowances from one address to another. Since its inception in 2015, this standard has encouraged token creation, decentralized trading platforms, and projects with complex token economies such as non-fungible assets.\n\nExamples of ERC20 tokens are Uniswap (UNI), Chainlink (LINK), and Aave (AAVE).\n\nBEP20\n\nBEP20 is the Binance Chain version of ERC20 token transfers, with some distinct differences that benefit both developers and users alike. The main difference between BEP20 and its predecessor is the speed of the transactions due to Binance’s expertise in blockchain technology. Transactions are almost instantaneous, providing an extra layer of convenience and security for users. Additionally, it has given developers more flexibility when creating DeFi protocols as they can now use one unified protocol across various blockchains such as Ethereum, Binance Smart Chain, and more without having to learn a new platform. With its innovative features such as improved security, accelerated time-to-market development, and enhanced usability, it is clear why more developers have been adopting BEP20 over ERC20.\n\nExamples of BEP20 tokens are Binance Coin (BNB), Wrapped Bitcoin (WBTC), and PancakeSwap (CAKE).\n\nBEP2\n\nBEP2 is a technical standard introduced to make the issuance and implementation of tokens on the BNB Beacon Chain simpler and more efficient. It contributes to developing an ecosystem in which tokens can be circulated freely while assuring maximum efficiency, reliability, and fairness. This standard defines a set of universal rules that all tokens must adhere to, allowing them to adapt seamlessly into the existing BNB Beacon Chain network with minimal effort. With this technology, token holders now have greater control over their tokens, allowing them to transfer them easily in the BNB ecosystem.\n\nExamples of BEP2 tokens are STEPN (GMT), Trust wallet token (TWT), and BEP2 PancskakeSwap (CAKE).\n\nERC721\n\nERC721 is an innovative smart contract standard that provides a foundation for the representation of non-fungible tokens (NFTs). Unlike standard ERC20 tokens, each ERC721 token is unique and can hold its own set of data which can vary in terms of type and quantity from other tokens. By splitting the ERC721 standard into numerous contracts, users can create more complex and secure NFTs as well as implement certain optional features, if required. That said, this foundation has allowed developers to seek further integration possibilities with new and existing applications using blockchain technology.\n\nExamples of ERC 721 tokens are CryptoKitties, NBA Top Shot, and Bored Ape Yacht Club (BAYC).\n\nERC1155\n\nERC1155 is a much-applauded multi-token standard for Ethereum smart contracts. Unlike other standards, it can be used to create both fungible and non-fungible tokens with ease. It offers flexibility by targeting several asset types and brings development efficiency as its code base is standardized for different transactions with one set of rules.\n\nERC1155 has been growing rapidly in popularity due to the way it simplifies token creation and management; not to mention, the increased security that comes from having a unified, secure code base at the foundation. All in all, this new standard promises to revolutionize the way blockchain technology can be used across industries thanks to its all-in-one approach.\n\nExamples of ERC 1155 tokens are Enjin Coin (ENJ) and Aavegotchi (GHST).\n\nERC777\n\nERC 777 is a significant development in token trading technology. It facilitates interactions between tokens and Ether by creating a common platform, which allows users to view the value of other tokens held in their wallets. This standard revolutionizes existing fungible token models and provides a more secure and efficient way to implement the token exchange. This could lead to an increase in the number of exchanges taking place, and thereby potentially give more control over data management and storage services on the blockchain. Overall, ERC 777 has made transactions over Ethereum faster, easier, and more reliable.\n\nExamples of ERC777 tokens are Bancor (BNT), Loopring (LRC), and MakerDAO (MKR).\n\nERC4626\n\nERC4626 is a revolutionary new standard for blockchain domain names that offer improved compatibility with Ethereum Name Service (ENS). It has been developed as a step forward from existing ENS specifications and builds on existing Ethereum-based technologies to create a unique solution that increases the scalability, interoperability, and usability of domains and wallets. With this new standard, developers can more easily build projects that rely on the power of ENS, and users will benefit from enhanced functionality when creating their own blockchain identities. As the usage of blockchain technology continues to become more widespread within our society, ERC4626 provides an exciting opportunity to make this process even easier.\n\nExamples of ERC4626 tokens are Unstoppable Domains (UD), ENSMaketplace (ENSM), and FTA tokens.\n\nWrapped tokens\n\nWrapped tokens provide an interesting solution to the dilemma of how to transfer assets between different blockchains. This process, known as token wrapping, involves the smart contract issuance of a token equivalent to the original asset, allowing it to be used on a non-native blockchain. Token washing is in essence the exchange of one token for another token at a fixed rate – accomplished by creating a smart contract that allows the sender’s tokens to be exchanged for an equal amount of the new tokens. Wrapping tokens provides flexibility when transferring digital assets from one platform to another without having to worry about compatibility and complexity issues.\n\nExamples of wrapped tokens are Wrapped Bitcoin (WBTC), Wrapped Ether (WETH), and Wrapped Stellar Lumens (WSL).\n\nConclusion\n\nThere are many standards for tokens in the cryptocurrency world, each with its purpose. The most popular standard is ERC20, which defines a set of rules that all ERC20 tokens must follow. BEP20 is the Binance Chain version of ERC20, with some minor differences. Another common standard is ERC721, which allows each token to be unique. These are just a few of the many crypto token standards out there. With so many options available, it’s important to choose the right one for your needs."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYXBubGl2ZS5jb20vYnVzaW5lc3MtbmV3cy9jcnlwdG8tYml0Y29pbi1wcmljZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin at $23.4k; Solana, Ethereum also witness minor dips - APN Live",
        "content": "The summer transfer market is here again, and teams are battling it out in the Premier League to acquire the best legs. Along with football enthusiasts, punters are flocking to top bookmakers, as well as crypto bookmaker sites, to stake on which teams land the top stars.\n\nLiverpool, desperate to save a failing season, have already procured the likes of Cody Gakpo.\n\nMan United have moved on from the dramatic exit of their once-upon-a-time icon, Cristiano Ronaldo, in the January acquisition of the Dutch mountain man, Wout Werghost.\n\nChelsea pulled off a coup by landing the skillful Jao Felix from Atletico Madrid in a stunning half-season loan. Of course, there is so much expectation on the shoulders of the young Portuguese to rescue an underperforming Chelsea side.\n\nJust like Jao Felix, there are other players who arrived at Chelsea with similarly high expectations…but FAILED.\n\nIn this article, we will discuss three players who could have done better during their time at Chelsea.\n\nAlvaro Morata\n\nWhen the Spaniard arrived from Real Madrid to Chelsea, he was flaming with confidence.\n\nMorata had previously played the role of a super substitute for Real Madrid, where he Kareem Benzema a run for the first striker position.s\n\nAcquired for 58 million pounds, many expected him to slot into Antonio Conte’s team and steadily pull of the goals.\n\nHis calm demeanor was also expected to introduce some calm forward, particularly after the unpredictably aggressive Diego Costa fought with almost every Premier League defender.\n\nIndeed, Morata’s first season was not as miserable.\n\nHe managed to score 15 goals in 30 starts. But after a bright start, his performances nosedived dramatically. By the second season, Morata was severely short on confidence, haunted by his extensive portfolio of big chances missed.\n\nNotably, in the second season, Morata only had five goals and was already a laughingstock at Stamford Bridge. Injuries didn’t help his cause either, as the Spaniard struggled with reoccurring back issues.\n\nUltimately, Chelsea would cut their losses by shipping him on loan to Atletico Madrid.\n\nKhalid Boulahrouz\n\nKhalid Boulahrouz played a defensive position for Chelsea from 2006 – 2008. Even in this short time (2 years) at Chelsea, he was loaned out to Sevilla for a year, where he made six appearances and scored no goals.\n\nDue to several issues, Khalid Boulahrouz’s performance in the English Premier League was subpar.\n\nFirst of all, he struggled to adapt to the toughness and pace of the English Premier League. Secondly, he had trouble adjusting to the Chelsea team’s tactical demands, which represented a significant improvement above the league he had previously played in.\n\nUltimately, he could not perform to the greatest standards because of his lack of experience playing at the highest level of European football, which revealed his flaws. Additionally, he was frequently played out of position, which prevented him from using his skill.\n\nIn all, Khalid Boulahrouz made a total of 13 appearances, scored no goals, and gave no assist. You can clearly see that Khalid Boulahrouz terribly flopped at Chelsea when put on par with his defensive counterpart, Ashley Cole, who gave several goal assists, scored 7 goals, and made 229 appearances in his stay at Chelsea.\n\nAfter his loan tenor was over in 2008, Khalid Boulahrouz was later sold off to VfB Stuttgart, where he made more appearances and scored two goals.\n\nWinston Bogarde\n\nWinston Bogarde’s performance at Chelsea was a total flop because, despite his considerable talent and experience, he was unable to have an impact on the team. He struggled to make the first team and was frequently criticized for his lack of effort and dedication to the club.\n\nHis ability to get along with the other players was also lacking, and his attitude toward teamwork and training was frequently questioned.\n\nWinston Bogarde’s performance at Chelsea was more like the display of a dying star. Although Winston Bogarde had played full-back for several popular clubs, which includes SVV, Sparta Rotterdam, Ajax, Milan, and Barcelona, he failed to replicate his successes at Chelsea.\n\nWinston Bogarde made a total of 9 appearances, scored no goals, and gave no goal assists in his stay at Chelsea (2000 – 2004). Given his experience playing at popular clubs, the French center-back player, William Gallas, seems to be beating Winston Bogarde at his game with 12 goals in 159 appearances whilst having no prior high-grade experience at any popular clubs.\n\nIn the end, when Winston Bogarde’s contract ended in 2004, he refused to accept a wage cut, which led to his eventual dismissal from the team in 2006 and his retirement from football. Now he is pursuing a managerial career at Ajax.\n\nPatrick van Aanholt\n\nDue to a lack of opportunity and playing time, Patrick van Aanholt’s performance at Chelsea was a flop compared to other clubs he had played for.\n\nVan Aanholt spent five years with Chelsea but only made two appearances and had no goals or assists before being eventually loaned out four times to different clubs.\n\nDue to the presence of more seasoned players like Ashley Cole and Branislav Ivanovic, who had made over 200 appearances and had scored more than six goals, he also had trouble making an impression.\n\nVan Aanholt ultimately failed to join Chelsea’s first team and left the club for Sunderland in 2014, where he made 82 appearances and scored 7 goals. After Sunderland, he furthered his career at Crystal Palace and is now in Galatasaray, where he is making significant progress.\n\nThese mentioned players clearly had potential. But somehow, we never saw enough of it at Chelsea."
    }
]