[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3Lm5ld3NjaWVudGlzdC5jb20vYXJ0aWNsZS8yMzY5MzA0LWNyeXB0b2N1cnJlbmN5LWV0aGVyZXVtLWhhcy1zbGFzaGVkLWl0cy1lbmVyZ3ktdXNlLWJ5LTk5LTk5LXBlci1jZW50L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Cryptocurrency Ethereum has slashed its energy use by 99.99 per cent - New Scientist",
        "content": "An experimental update to Ethereum, the world’s second-biggest cryptocurrency, has led to a dramatic reduction in the energy used to secure the currency and verify transactions\n\nEthereum is the world’s second-largest cryptocurrency SKapl/iStockphoto/Getty Images\n\nThe world’s second-largest cryptocurrency, Ethereum, has successfully slashed its emissions by 99.99 per cent after an unprecedented experiment to ditch power-hungry mining in favour of a new approach, according to researchers. But experts say there is little appetite for such a change among users of bitcoin, the largest digital currency, which has no central body to steer development.\n\nLike bitcoin and many other cryptocurrencies, Ethereum used to rely on “proof of work” to secure its network, meaning that computers performed huge numbers of calculations to “mine” new currency and verify transactions. This process uses vast amounts of electricity. But in September 2022, Ethereum switched to a new technique called “proof of stake” during a period of change known as the Merge.\n\nThe Cambridge Centre for Alternative Finance (CCAF) has published comprehensive data on bitcoin’s energy use over the past four years and has now released similar data for Ethereum. Alexander Neumüller at the University of Cambridge, who worked on the project, says the experimental update has been a technological success, achieving a “staggering” reduction in electricity consumption.\n\nAdvertisement\n\nUnder the new system, instead of using computer hardware to mine new currency to get a reward, validators lodge money with the network to gain the right to validate transactions and be rewarded. Before the Merge took place, the Ethereum Foundation, a non-profit organisation that oversees the development of Ethereum, estimated that this would cut energy use by 99 per cent, but the results of the switch were unpredictable, as nothing on the same scale had been attempted before.\n\nEthereum had, like bitcoin, been using more energy each year since its launch in 2015. According to CCAF’s data, it used 16.4 terrawatt hours in 2021. By 14 September 2022 – the day before the Merge – it had already used 17.6TWh, and was on course to end the year at 21.4TWh.\n\nThe CCAF now estimates that Ethereum will consume just 6.6 gigawatt hours of electricity annually, equivalent to about 2000 typical homes in the UK. In contrast, Ethereum’s previous consumption from its launch to the Merge totalled 58.3 TWh – comparable to Switzerland’s annual electricity consumption.\n\nSign up to our The Daily newsletter The latest science news delivered to your inbox, every day. Sign up to newsletter\n\nNeumüller says success was far from guaranteed due to the scale of the challenge. “An often-used anecdote in that regard was changing a jet engine during flight,” he says. “It has been executed very well. No one knew exactly what was going to happen.”\n\nSome analysis has suggested that although Ethereum’s power consumption has dropped, the hardware that used to account for it is now being used for other purposes. Kyle McDonald, who carried out his own research on the energy use of the Ethereum network before the Merge, says large numbers of disgruntled miners who were left with hugely expensive, specialised hardware and no source of income decided to continue harvesting other coins.\n\nBut Neumüller says not all miners switched and there is evidence that many sold off their hardware. His research looked at the other cryptocurrencies that miners could have profitably switched to and calculated that, between 8 September 2022 and 4 March 2023, nearly 80 per cent of the computational power used for mining had simply disappeared, as miners gave up and sold their hardware.\n\nDespite the success of Ethereum’s switch, Neumüller says that the bitcoin network is too attached to its current proof-of-work approach to follow suit.\n\nEthan Vera, co-founder of cryptocurrency firm Luxor Mining, also believes that a similar change in bitcoin is unlikely. “Proof of work is fundamental to bitcoin. The use of energy is critical to its security mechanism,” he says."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vaGFja2Vybm9vbi5jb20vZXRoZXJldW0tc3Rha2luZy12cy10cmFkaXRpb25hbC1pbnZlc3RtZW50c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Staking vs Traditional Investments - hackernoon.com",
        "content": "Too Long; Didn't Read\n\nPeople Mentioned\n\nThis blog post explores the benefits of ETH staking over traditional investments. Staking is a relatively new concept in the world of cryptocurrency, but it has quickly gained popularity due to its potential for high returns and lower risks. According to recent data, the average annual ROI forETH staking is currently around 6%, significantly higher than the 4% average annualROI for stocks."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWNhbmN1bi11cGdyYWRlLWJsb2Jz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Next Upgrade To Focus on Blobs - Blockworks",
        "content": "Ethereum’s developer community has had time to recover from the Shanghai-Capella (Shapella) upgrade a little over two weeks ago. Now, they have turned their attention to planning what will ship next.\n\nThe consensus on Thursday’s bi-weekly all-core devs call, was that the upgrade, known as Cancun-Deneb — shortened to “Dencun” — will focus on a feature vital to the success of the network’s rollup-centric roadmap: proto-danksharding, the nickname for Ethereum Improvement Proposal (EIP) 4844.\n\nProto-danksharding introduces a new transaction type — the “blob-carrying transaction” — a temporary data storage mechanism that is expected to reduce transaction costs for users on layer-2 rollups, by orders of magnitude.\n\nPéter Szilágyi, team lead at the Ethereum foundation, summed up the overarching view in the Zoom room: “I kind of feel that 4844 should be the thing that everybody focuses on, and the rest is ‘nice to have’.”\n\nSzilágyi was the chief proponent of making 4844 a priority back in January, when he suggested it should take precedence over the withdrawal of staked ether in Shapella, but was overruled by his peers.\n\nThis time, he’s all but certain to get his wish. There was no disagreement that Cancun — the execution layer part of the upgrade that was the focus of the call — will have proto-danksharding front and center.\n\nBut what goes into Cancun besides 4844?\n\nDeactivate SELFDESTRUCT\n\nIt may sound like an urgent task for your movie hero of choice, but in Ethereum-speak it’s an “attempt at getting rid of the SELFDESTRUCT opcode in order to pave the road for statelessness.”\n\nThe concept of a stateless Ethereum goes back to co-founder Vitalik Buterin’s October 2017 post. “State” refers to all the key information at a point in time for the blockchain: all Ethereum accounts, their balances, all deployed smart contracts and the storage associated with these.\n\nA future upgrade or set of upgrades will shift responsibility for storing the blockchain’s full state to more specialized “archival nodes,” allowing for a much larger set of full nodes to store much less. That would make it even easier for anyone to run a node, furthering the goal of network decentralization.\n\nFor now, this precursor EIP-6780 was agreed to merit inclusion in Cancun by all client teams.\n\nCall moderator and project coordinator Tim Beiko concluded that “clearly the self-destruct [proposal] is the second most mentioned EIP beyond 4844.”\n\nHe noted that an external auditor has been hired to ascertain, using on-chain data, whether currently deployed smart contracts could be broken by the change. The results are about a month away, Beiko said, yet there was no objection to making plans for the destruction of SELFDESTRUCT now and, as pseudonymous Geth developer lightclient said, “revisit it after the report comes.”\n\nTransient storage\n\nOne EIP that was eighty-sixed from Shapella, despite being ready to go, was EIP-1153.\n\nEIP-1153 proposes new, cost-effective ways to temporarily store data in Ethereum smart contracts, improving communication between different parts of a transaction. This update would support various applications, such as enhanced security features and streamlined token approvals.\n\n“I don’t see much effort to push it out, so I don’t see a point for it to be delayed,” Lukasz Rozmej from the Nethermind client team said on the call.\n\nJustin Florentine from the Besu client team said, while he would stop short of calling 1153 “a must-have,” he remained in very strong support.\n\nEIP-1153, or “transient storage” is popular enough to have its own “fan page,” and was pushed hard by the Uniswap team in late 2022, in a manner that rubbed some Ethereum developers the wrong way.\n\nLoading Tweet..\n\nBut, in the intervening months, the proposal has truly become uncontroversial, and Erigon’s Andrew Ashikhmin tipped the consensus in favor of its inclusion when he singled it out for endorsement on the call as “a small EIP that people are mostly in favor of.”\n\nEOF remains a ways off\n\nOne upgrade that was also originally a part of Shanghai, known as EVM Object Format (EOF), was broadly lauded by the assembled core developers, but once again considered a poor match for the 4844-centered Cancun plan — essentially reaffirming the consensus from late March.\n\nThe EVM Object Format (EOF) is an extensible and versioned container format for the Ethereum Virtual Machine (EVM) that introduces a one-time validation during contract deployment. It aims to improve code and data separation, making it easier to introduce new features or deprecate old ones.\n\nLong-time Ethereum core developer Greg Colvin articulated the importance of getting EOF implemented from his perspective.\n\n“We’ve been discussing this for 7 years,” Colvin said.\n\nOther developers were of the opinion that EOF was “too big to be the second place in a fork,” as Ansgar Dietrichs, a researcher at the Ethereum Foundation, put it. He suggested it should be the focus of the next major upgrade, called Prague.\n\nDanno Ferrin, principal software engineer at Swirlds Labs concurred. “As much as it hurts, I think it’s the right decision,” he told his colleagues on the call.\n\nBeiko analogized the pair of major upgrades — 4844 and EOF — to the prior two — the Merge and withdrawals — telling Colvin, “I think the strongest commitment we can make is to have it be the main thing for the next fork, but even that is not something we can 100% commit to today.”\n\nEOF remains a “quick follow” candidate, meaning developers would likely make it a priority within six months after Cancun.\n\n“It’s just time,” Colvin said. “I’ve got work I’ve been wanting to do on the [Ethereum Virtual Machine] for 7 years that I can’t do until this is in.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bXMtcG9zdC1tZXJnZS1lbmVyZ3ktdXNhZ2UtMDkzMDAwODM0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's post-Merge energy usage shows how blockchain tech can align with national sustainability goals - Yahoo Finance",
        "content": "The Ethereum blockchain's energy usage initially plummeted more than 99 per cent last year after a change to its architecture, a new report confirms, showing how a new token minting and validation process better aligns with sustainability goals two years after China's crackdown on crypto mining.\n\nFollowing a change from proof-of-work (PoW) to proof-of-stake (PoS) for creating new ether last September, power demand on the network cratered to 235 kilowatts from 2.44 gigawatts, according to the latest Cambridge Blockchain Network Sustainability Index released on Wednesday. Amid rising usage of the network, energy consumption reached 420,000 kilowatt hours in March, the index shows.\n\nIn its report on the index, the Cambridge Centre for Alternative Finance (CCAF) also notes that ether mining appeared to be of much less interest in China than bitcoin prior to the change. During Beijing's crackdown on mining activity in May 2021, the bitcoin network's hash rate, the measure of the network's computational power, was \"far more severely\" affected than Ethereum's, with each falling 71.1 per cent and 25.5 per cent, respectively.\n\nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.\n\nMonthly proof-of-stake energy usage for Ethereum leading up and following the merge. This chart shows consumption on the Beacon Chain, a proof-of-stake blockchain that merged with the main Ethereum chain in September 2022. Chart: SCMP alt=Monthly proof-of-stake energy usage for Ethereum leading up and following the merge. This chart shows consumption on the Beacon Chain, a proof-of-stake blockchain that merged with the main Ethereum chain in September 2022. Chart: SCMP>\n\nChina was once the world's largest cryptocurrency mining hub owing to its relatively cheap electricity, despite the digital assets being banned in the mainland. The crackdown two years ago briefly pushed measurable bitcoin mining activity in the country to near zero, although later data suggested much of that activity had largely moved underground.\n\nStory continues\n\nThe success of Ethereum's change in reducing energy usage shows how PoS blockchains can better align with green energy goals, which China has championed with a promise to reach peak carbon emissions by 2030 and carbon neutrality by 2060.\n\nConcerns about the energy usage of cryptocurrency mining were widely seen as a potential factor in Beijing's crackdown.\n\nPoW blockchains like bitcoin's are so energy intensive because the process requires hashing, or solving increasingly complex math problems, to add new tokens to the network and verify transactions. With PoS, users \"stake\" their own tokens, or put up a specified amount as collateral, to verify transactions.\n\nEther's switch to PoS was teased for years before the stakeholders pushing the change were able to make it stick. The network went through multiple technical changes before the so-called Merge last year, according to the report.\n\nBitcoin's monthly energy consumption has remained consistently high. Chart: SCMP alt=Bitcoin's monthly energy consumption has remained consistently high. Chart: SCMP>\n\nUntil the Merge, Ethereum's entire electricity consumption of 58.3 terawatt hours was more than Switzerland's average annual energy usage of 54.9 terawatt hours, according to the CCAF.\n\nEther is now estimated to consume 6.56 gigawatt hours of electricity annually, comparable to that of iconic structures such as the Eiffel Tower or the British Museum, the CCAF said.\n\nWhile the energy usage of Ethereum has climbed over the past several months, the CCAF said that is to be expected as more nodes and validators are added to the network. It is also still a far cry from what it used to consume and what the bitcoin network still consumes, which was 10.3 terawatt hours last month alone, more than 1,500 times Ethereum's annual consumption.\n\nThe bitcoin network's annual energy usage of 132.2 terawatt hours could power the entire country of Norway, according to the Cambridge Bitcoin Electricity Consumption Index.\n\nAmid a bitcoin price rally of about 75 per cent this year, the energy-intensive token remains the gold standard in cryptocurrency. However, governments are increasingly trying to balance innovation and sustainability goals regarding digital assets.\n\nBeijing has embraced blockchain technology and is promoting its development in the mainland. But with cryptocurrency illegal there, many projects focus on other uses of distributed ledger technologies.\n\nMeanwhile, Hong Kong's bid to become a regional virtual asset hub has received a nod of approval from mainland officials. A new licensing scheme in the city that goes into effect in June officially sanctions retail investor participation in the market for the first time.\n\nHong Kong's pro-digital asset stance has led some in the industry to speculate that it could be used as an experimental zone for crypto development in China. Some exchanges with ties to the mainland that fled during earlier crackdowns are looking to get licensed in Hong Kong.\n\nHowever, Hong Kong will also have to balance its Web3 initiatives with its own sustainability goals. The city has pledged to become carbon neutral by 2050, and it aims to become a green technology and finance centre with new initiatives set forth in this year's budget.\n\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2023 South China Morning Post Publishers Ltd. All rights reserved.\n\nCopyright (c) 2023. South China Morning Post Publishers Ltd. All rights reserved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMjYvZXRoZXJldW1zLWxpZmV0aW1lLWVuZXJneS11c2UtYmVmb3JlLXRoZS1tZXJnZS1lcXVhbGVkLXN3aXR6ZXJsYW5kcy1mb3ItYS15ZWFyL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMjYvZXRoZXJldW1zLWxpZmV0aW1lLWVuZXJneS11c2UtYmVmb3JlLXRoZS1tZXJnZS1lcXVhbGVkLXN3aXR6ZXJsYW5kcy1mb3ItYS15ZWFyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Lifetime Energy Use Before the Merge Equaled Switzerland's for a Year - CoinDesk",
        "content": "“When you talk about PoW, for instance, it is very hard to attack the network, even if you have extensive financial resources, because you actually need to buy and employ hardware as well as get access to energy,” he said. “PoS is really more financial based. So if your main objective was to disrupt the network, it would just be a case of acquiring the native tokens.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzI2L2lzLWV0aGVyZXVtLW1vcmUtZGVjZW50cmFsaXplZC1hZnRlci10aGUtbWVyZ2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Is Ethereum More Decentralized After The Merge? - The Motley Fool",
        "content": "It might come as a surprise, but Ethereum (ETH -0.21%) made its noteworthy switch from proof of work to proof of stake more than six months ago. Referred to as The Merge, this transition looks like a distant memory as attention has been focused on the fact that Ethereum is in the midst of an impressive rally to start off 2023 and is up more than 50% so far this year.\n\nAlthough Ethereum might be having a much better year than in 2022, it's probably time to check in on how this whole proof-of-stake thing is doing.\n\nEthereum before The Merge\n\nThe switch from proof of work caused some to believe Ethereum was becoming more centralized. This topic is highly controversial and is an extremely abstract concept, but its important to take into consideration since one of the primary use cases of investing in cryptocurrencies is their premise as an alternative to existing centralized systems.\n\nBefore The Merge, it was relatively easy to measure Ethereum's decentralization and security through the use of a metric called hash rate. Exclusive to proof-of-work blockchains such as Bitcoin, hash rate essentially quantifies computing power which serves as a proxy for decentralization and security. While using proof of work, Ethereum had the second-highest hash rate of all cryptocurrencies.\n\nBut now that it uses proof of stake and we can't use hash rate, gauging whether Ethereum is more or less decentralized and secure can be a little complicated. But let's give it a shot.\n\nThe post-Merge era\n\nThere are a plethora of new functionalities that accompanied The Merge, but likely the most significant was the replacement of miners with validators and the ability for holders to stake their funds.\n\nWithout the need for miners, Ethereum's network is secured by these validators, who earn the chance to verify blocks by \"staking,\" or essentially locking up their funds to the network. Therefore Ethereum's decentralization and security are derived from three factors -- the number of validators, the distribution of staked funds among these validators, and the percentage of Ethereum staked relative to its total supply.\n\nLet's start with the number of validators. Since The Merge, this number has been increasing at a steady rate. Today, it sits at just over 600,000. Not only has it been steadily increasing, but in the last month, the rate of new validators has skyrocketed, and this could be an encouraging sign that the network is growing in decentralization.\n\nThe validator dilemma\n\nTo become a validator, you must pledge 32 ether to the network. That's a lot of money (more than $58,000 at today's prices), but there is a way around it. Those with the technical know-how and resources to set up the equipment can pool together money from other holders and reach the 32 coin limit. Known as staking pools, this option allows anyone to participate in staking, but it has also created a lucrative business model for some centralized players.\n\nData show that four validators control roughly 53% of the total amount of staked Ethereum. Three of these validators are centralized companies that provide staking products to customers, such as Coinbase, Kraken, and Binance, and they collectively have 23% of all staked Ether. But the fourth is a decentralized staking protocol known as Lido, and it alone has 30% of the total amount of staked Ethereum.\n\nIn an ideal world, there would be a large number of staking pools with an equal distribution of ether staked. Unfortunately, this isn't quite the case. Thankfully, these centralized companies don't control nearly as much as Lido, which claims to be decentralized, but this concentration of staked ether among just a few participants is something to keep in mind.\n\nLackluster staking ratio\n\nThe last factor to consider in Ethereum's new journey as a proof-of-stake blockchain is the amount of ether staked relative to its total circulating supply. This ratio is crucial to evaluate because the greater the number of ether staked, the more secure and decentralized the network becomes.\n\nUnfortunately, Ethereum still lags in this area. Today almost 15% of the total ether supply is staked. Compared to other proof-of-stake blockchains like Cardano, Solana, and Avalanche, which all are above 60%, it becomes clear Ethereum has some work to do.\n\nMaking sense of these numbers\n\nBased on these three metrics, it could be surmised that Ethereum's network is still going through some growing pains. While the number of validators is rising steadily, the total number of ether staked among a few participants and the small ratio of ether staked relative to the total supply is a little concerning.\n\nDespite this, Ethereum is still one of the top blockchains in the world. It boasts a plethora of use cases in decentralized finance and has long-term potential. It looks like it just needs some more time to mature as a proof-of-stake blockchain to return to the levels of decentralization and security it had before The Merge."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wNC8yNi9jcnlwdG8td2FsbGV0LXBoYW50b20tYWRkcy1wdWJsaWMtbXVsdGljaGFpbi1zdXBwb3J0LWZvci1ldGhlcmV1bS1hbmQtcG9seWdvbi_SAXRodHRwczovL3RlY2hjcnVuY2guY29tLzIwMjMvMDQvMjYvY3J5cHRvLXdhbGxldC1waGFudG9tLWFkZHMtcHVibGljLW11bHRpY2hhaW4tc3VwcG9ydC1mb3ItZXRoZXJldW0tYW5kLXBvbHlnb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Crypto wallet Phantom to release public multichain support for Ethereum and Polygon - TechCrunch",
        "content": "Phantom, a crypto wallet for Solana blockchain users, will start supporting the Ethereum and Polygon blockchains in a public launch across browsers, iOS and Android on Monday, May 1, at 9 a.m. EST, the company exclusively told TechCrunch.\n\nSupport for the two new blockchains was originally slated for the first quarter of 2023, but was pushed back. The multichain integration will be available to its 3 million users, Brandon Millman, CEO and co-founder of Phantom, said to TechCrunch.\n\nThe new capabilities come more than a year after Phantom hit a $1.2 billion valuation on a $109 million funding round in January 2022. That round was led by Paradigm, and saw participation from Andreessen Horowitz, Jump Capital, Solana and other investors.\n\nSupport for Ethereum and Polygon will let Phantom wallet users transfer assets across blockchains and dApps like Uniswap and Aave as well as NFT marketplaces like Blur and OpenSea. Users can now also import existing assets from MetaMask, Solana or Ethereum Virtual Machine (EVM) wallets. “The Phantom multichain is now available everywhere that MetaMask is,” the company said.\n\nThe multichain support will open up Phantom to a broader pool of crypto users beyond the millions of users it currently has from the Solana ecosystem, given that wallet owners can trade, hold and interact across all three blockchains (opposed to just one).\n\n“If you have a MetaMask, you can plug in your seed phrase to have everything under one roof,” Millman said. “MetaMask can only handle one seed phrase at a time, but you can manage multiple here.”\n\nThere are other multichain crypto wallets on the market like Pillar, which provides support for Ethereum, Polygon, Gnosis Chain, BNB Chain and others. But in general, most crypto wallets focus on providing services for single layer-1 blockchains, with Ethereum-focused wallets being the most common. For example, MetaMask allows users to hold and transfer Ethereum or any other ERC-20 token, which are derived from the Ethereum blockchain. However, the MetaMask team has said they see potential for a multichain world in the future.\n\nPhantom is arguably one of the biggest Solana-based wallets, so its opening up to other blockchains speaks to the growing potential for a multichain world and the possibility that other big players (like MetaMask) may follow suit.\n\nPhantom’s new capability could also let dApps and other projects interact with consumers in an easier way cross-chain.\n\n“It’s all multichain; you can see Solana NFTs next to ETH NFTs,” Millman said. “They all show up in one place.”\n\nThe wallet also shows advanced metadata for NFTs such as current floor prices, sale prices and other factors within the application, he added. “We also have the ability to sell NFTs directly into marketplaces like Magic Eden and OpenSea and others.”\n\nPhantom is also adding new safety features that hide spam sent to crypto wallets in an attempt to help prevent phishing, Millman shared. “The analogy is similar to email: sometimes spam emails slip through, but users can just mark it as spam, and over time it gets better and better at catching it.”\n\nAll in all, safety is one of the biggest areas Phantom is worried about, Millman noted. “If you go to a website, we give you a warning that you’re leaving Phantom, and if we have an understanding that a website is malicious, we preemptively block it.” Obviously, users can ignore the warnings, but Millman advises against doing so.\n\nThe wallet also simulates transactions before they’re approved so users can see what they’re sending and receiving — and if there’s any cause for concern there, too, Millman said.\n\n“There are cases where you fall through all these protective layers and do get phished, but we have a customer support team that’s basically 24/7 and can try to get you help with exchanges, directory of local authorities or things like that to explore routes,” Millman said. “I think that’s a huge thing, because afterward, usually you don’t know what you can do.”\n\nUpdate: This article was amended after publication to reflect that Phantom’s launch of the multichain support has been pushed to Monday, May 1. The previous version of this article stated the launch would happen on Wednesday, April 26."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jaXJjbGUtbGF1bmNoZXMtY3Jvc3MtY2hhaW4tdXNkYy10cmFuc2Zlci1wcm90b2NvbC1mb3ItZXRoZXJldW0tYXZhbGFuY2hl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Circle launches cross-chain USDC transfer protocol for Ethereum, Avalanche - Cointelegraph",
        "content": "Circle, the creator of US Dollar Coin (USDC), has launched a mainnet protocol that lets users transfer USDC between Ethereum and Avalanche, according to an April 26 announcement. Previously, Avalanche users who held USDC on Ethereum had to deposit their coins with a Circle partner or use a third-party bridge to transfer their USDC from one network to the other. The new Cross-Chain Transfer Protocol (CCTP) protocol appears to do away with this need for USDC bridges.\n\nThe team released a video on April 13 showing how the new protocol works. Unlike a traditional bridge, it doesn’t lock tokens sent to its contract. Instead, it completely destroys them and issues new tokens on the receiving network. Users can redeem these new tokens for bank deposits directly, by depositing the tokens with Circle or its partners.\n\nIn the announcement, the team said that it expects CCTP to solve the problem of “fragmentation” in the Web3 ecosystem. Currently, there are multiple unofficial versions of USDC floating around on various networks, most of which are the result of tokens on one network being bridged to another. Now that there is an official way to transfer coins from one network to another, the team expects these unofficial copies to slowly decline in use, making the token less confusing to use.\n\nThe team said that many of the largest cross-chain protocols have already pledged to use CCTP going forward, including Celer, Hyperlane, LayerZero, LI.FI, MetaMask, Wormhole and others.\n\nRelated: VISA will facilitate USDC payments, thanks to fresh partnership\n\nJoao Reginatto, Circle’s vice president of product, said he believes the new protocol will help improve liquidity and capital efficiency in decentralized finance:\n\n“With CCTP, developers can simplify the user experience and their users can trust that they are always transacting with a highly liquid, safe and fungible asset in native USDC.\"\n\nUSDC is a fiat-backed stablecoin issued by Circle. The company claims that each USDC token is backed dollar-for-dollar in its reserves. Users can mint USDC by opening an account and depositing cash with either Circle itself or one of its partners, such as Coinbase. Once they’ve done this, they can receive the coin on several networks, including Ethereum, Avalanche, Stellar and Polkadot.\n\nUsers have lost billions of dollars worth of USDC and other cryptocurrencies due to bridge hacks over the past few years, as attackers have repeatedly figured out how to remove locked coins from bridge contracts and leave their copies on the receiving network with no backing. This has left developers wondering how to secure bridges for future use as digital assets become more mainstream."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3Lm13ZS5jb20vaW5zaWdodHMvaXJzLXJlbGVhc2VzLW1lbW9yYW5kdW0tb24tdGhlLXRheC1jb25zZXF1ZW5jZXMtb2YtYS1ibG9ja2NoYWluLXByb3RvY29sLXVwZ3JhZGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "IRS Memo Addresses Blockchain Protocol Upgrades - McDermott Will & Emery",
        "content": "IRS Releases Memorandum on the Tax Consequences of a Blockchain Protocol Upgrade"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYm9sZC5jb20vZmluYW5jZS1leHBlcnRzLXNldC1ldGhlcmV1bS1wcmljZS1mb3ItdGhlLWVuZC1vZi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Finance experts set Ethereum price for the end of 2023 - Finbold - Finance in Bold",
        "content": "The price of Ethereum (ETH) has been a hot topic in the crypto community as of late, to the point where numerous experts were consulted and requested to share their views.\n\nIn particular, finance platform Finder has asked 32 fintech and crypto experts to give their end-of-year price predictions for Ethereum, and the results reveal positive expectations for the asset.\n\nAccording to the results shared with Finbold, the experts suggest that Ethereum is set to rise as the year progresses, although it will not come close to its all-time high ($4,891). The coin reached this height on November 16, 2021, just before the crypto winter started pushing crypto prices down.\n\nPolled finance professionals believe that ETH could reach its peak in 2023 at around $2,758. However, after that the price is expected to start dropping again in the second half of 2023, sinking to $2,342 by the end of the year.\n\nEthereum price prediction. Source: Finder.com\n\nNotably, some of the surveyed experts included Paul Levy, a senior lecturer from the University of Brighton; Dimitrios Salampasis, the director of FinTech Capability at the Swinburne University of Technology, as well as Aaron Rafferty, the co-founder and CEO of StandardDAO.\n\nThe panelists’ predictions were made into a chart that can be viewed here.\n\nPost-Shapella worries\n\nMoreover, commenting on their prediction, a number of panelists also expressed concerns regarding post-Shapella Ethereum.\n\nData shows that around 21% of them believe that ETH is facing a risk of centralization, while nearly one-third of panelists (29%) think that the upgrade will eventually cause a massive sell-off. Meanwhile, half of the panelists believe that the update will result in greater scrutiny by the regulators.\n\nPost-Shapella Ethereum poll. Source: Finder.com\n\nAt the time of writing, April 27th, the price of ETH sits at $1,874.89 after declining by 4.64% in the last 7 days.\n\nEthereum price chart; Last 7 days. Source: Finbold.com\n\nAI provides its own prediction of the Ethereum price\n\nWith AI being another hot topic in fintech lately, some experts leverage this technology to predict Ethereum’s future price. AI has been used for automated trading for some time now, as it can quickly identify chart patterns and trends.\n\nIn this line, Finbold used projections made by CoinPriceForecast which revealed that Ethereum will potentially manage to climb above the $2k mark by mid-2023 and surge to $2,146 by the end of the year.\n\nIt is worth noting that the AI prediction is less optimistic than the one provided by the polled experts, which projects the ETH price to be higher than that by year-end, even after it drops from the expected $2,758.\n\nHowever, if AI is correct, ETH would still see a 31% price surge by the end of the year compared to its price today.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMjYvaG93LXRoZS1odW50LWZvci15ZXQtdG8tZXhpc3QtdG9rZW5zLWlzLXNoYXBpbmctZXRoZXJldW1zLWxheWVyLTItbGFuZHNjYXBlL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMjYvaG93LXRoZS1odW50LWZvci15ZXQtdG8tZXhpc3QtdG9rZW5zLWlzLXNoYXBpbmctZXRoZXJldW1zLWxheWVyLTItbGFuZHNjYXBlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "How the Hunt for Yet-to-Exist Tokens Is Shaping Ethereum’s Layer 2 Landscape - CoinDesk",
        "content": "One yet-to-tokenize, yet-to-launch zkEVM protocol to keep an eye on, according to van Weert, is the zkEVM startup Scroll – which has yet to deploy on Ethereum’s main network but has partnered with some big-name protocols. “They already have a very mature ecosystem on their testnet, whereas on zkSync it is lacking. I mean, the capital is there, but a lot of people are sort of sidelined on zkSync because they have already bridged their funds over, but there isn't enough to play around with right now.”"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vaGFja2Vybm9vbi5jb20vaG93LXRvLXBlcmZvcm0tZ2FzLWZyZWUtdHJhZGVzLW9uLWV0aGVyZXVtcy0xc3QtbGF5ZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "How to Perform Gas-Free Trades on Ethereum's 1st Layer - hackernoon.com",
        "content": "Too Long; Didn't Read\n\nPeople Mentioned\n\nCoW Swap is a decentralized exchange allowing you to trade tokens without paying gas fees. CoW Swap uses a slick, cost-eliminating workaround by replacing an on-chain spend with an off-chain wallet signature, then front-running your trade to eliminate ETH gas on limit orders."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3VzZGMtdHJhbnNmZXJzLW1vcmUtc2VjdXJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "USDC Transfers Between Ethereum and Avalanche Just Got More Secure - Blockworks",
        "content": "Circle, the issuer of USDC, announced on Wednesday that it is making its permissionless cross-chain transfer protocol (CCTP) available to developers building on Ethereum and Avalanche. As a result, USDC can now be transferred more securely and efficiently between the two chains using Circle’s burn-and-mint mechanism, as opposed to the traditional lock-and-mint approach.\n\nApps that embed the CCTP in their code will now enable users to burn their USDC on the source blockchain, then mint it on the chain to which they’re transferring the funds. Because it’s permissionless, the company says that developers can build on top of the CCTP and deliver new use cases, such as digital asset swaps, deposits on decentralized exchanges and buying NFTs across Ethereum and Avalanche, according to a statement from Circle.\n\nA number of developers have already integrated the CCTP, which was discussed on Blockworks’ 0xResearch podcast in March. It is currently used by wallets and infrastructure providers, including Celer, Hyperlane, LayerZero, LI.FI, MetaMask, Multichain, Rarimo, Router, Socket, Wanchain and Wormhole, according to a blog post written by Circle’s vice president of product, Joao Reginatto.\n\nReginatto added that lock-and-mint bridging was the standard before this idea of burn and mint. This caused “a proliferation of synthetic USDC assets,” he wrote, noting that these synthetic tokens “resulted in fragmented liquidity, security risks due to large amounts of the native asset locked on-chain, and confusing developer and end-user experiences.”\n\nBlockworks Research Senior Analyst Sam Martin said that billions of dollars have been lost as a result of bridge hacks, which he said usually involves lock-and-mint bridging solutions. “The larger the dollar value locked on the source chain, the larger the incentives are for hackers to figure out how to exploit the bridge’s contracts.”\n\nMartin added that the CCTP “is a much safer mechanism for moving value across chains, and should result in less fragmented liquidity across various DeFi ecosystems.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9kZWNlbnRyYWxpemVkLWV4Y2hhbmdlLXZlcnRleC1sYXVuY2hlcy1ldGhlcmV1bS0xMjQ1MDc0NDcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Decentralized Exchange Vertex Launches on Ethereum Layer 2 Arbitrum - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nVertex, a decentralized exchange for the spot and derivatives trading of digital assets, has gone live on Arbitrum (ARB), a popular network built atop the Ethereum blockchain.\n\nVertex, which had been operating on a test network, combines an off-chain order book layered on top of an on-chain automated market maker on a decentralized, self-custodial exchange. The firm, which has bases in Singapore and the Cayman Islands, counts Jane Street, Dexterity Capital, Hudson River Trading, GSR, Collab+Currency, JST Capital, Big Brain and Lunatic Capital among its early backers.\n\nThe messy collapse of FTX and other centralized trading platform blowups last year has fueled a shift toward decentralized exchanges and self-custody. Ethereum layer 2 system Arbitrum is now the fastest-growing blockchain in total value locked and has surpassed Ethereum in daily transaction volume.\n\nThe Vertex team has been working on the protocol for about a year. Co-founder Darius Tabatabai said the platform has drawn interest from institutional traders and from retail traders who use Arbitrum.\n\n“We built all the smart contracting ourselves, so we’re not forking anything,” Tabatabai said in an interview with CoinDesk. “The [automated market maker] is quite conventional, but we have a bunch of tech under the surface that enables you to do leveraged AMMs, to do looping, and we have an inbuilt money market. So you can think of it as a combination of Aave, dYdX and Uniswap, with an order book.”\n\nBuilding Vertex on Arbitrum and using an off-chain sequencer for the order book has enabled the venue to process between 10,000 and 15,000 transactions per second with the ability to match buy and sell orders in 10 to 30 milliseconds, a speed that rivals leading centralized venues and surpasses that on other decentralized exchanges, Tabatabai added.\n\n\n\n\n\n\n\n"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzI3L2NvaW5kZXNrLWluZGljZXMtY3J5cHRvLWFzc2V0LW1hbmFnZXItY29pbmZ1bmQtbGF1bmNoLWFuLWV0aGVyZXVtLXN0YWtpbmctYmVuY2htYXJrLXJhdGUv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMjcvY29pbmRlc2staW5kaWNlcy1jcnlwdG8tYXNzZXQtbWFuYWdlci1jb2luZnVuZC1sYXVuY2gtYW4tZXRoZXJldW0tc3Rha2luZy1iZW5jaG1hcmstcmF0ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "CoinDesk Indices, Crypto Asset Manager CoinFund Launch an Ethereum Staking Benchmark Rate - CoinDesk",
        "content": "Roger Bayston, head of digital assets at fund manager Franklin Templeton, said in the release that his firm is \"very excited about the launch of CESR\" because it opens new pathways for the industry, particularly for TradFi firms intrigued by crypto."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzI2L2RlY2VudHJhbGl6ZWQtZXhjaGFuZ2UtdmVydGV4LWxhdW5jaGVzLW9uLWV0aGVyZXVtLWxheWVyLTItYXJiaXRydW0v0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMjYvZGVjZW50cmFsaXplZC1leGNoYW5nZS12ZXJ0ZXgtbGF1bmNoZXMtb24tZXRoZXJldW0tbGF5ZXItMi1hcmJpdHJ1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Decentralized Exchange Vertex Launches on Ethereum Layer 2 Arbitrum - CoinDesk",
        "content": "“We built all the smart contracting ourselves, so we’re not forking anything,” Tabatabai said in an interview with CoinDesk. “The [automated market maker] is quite conventional, but we have a bunch of tech under the surface that enables you to do leveraged AMMs, to do looping, and we have an inbuilt money market. So you can think of it as a combination of Aave, dYdX and Uniswap, with an order book.”"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9jb25zZW5zdXMtMjAyMy1ldGhlcmV1bXMtbmV4dC1mcm9udGllci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Consensus 2023: Ethereum's Next Frontier | Video - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQyNzAwNTUzOS9lbi9Db2luRGVzay1JbmRpY2VzLWFuZC1Db2luRnVuZC1Bbm5vdW5jZS1DRVNSLXRoZS1CZW5jaG1hcmstUmF0ZS1mb3ItU3Rha2luZy1vbi1FdGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "CoinDesk Indices and CoinFund Announce CESR, the Benchmark Rate for Staking on Ethereum - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--CoinDesk Indices, the leading provider of digital asset indices by AUM since 2014, in partnership with CoinFund, a leading Web3 and crypto-focused investment firm and registered investment adviser, today announced CESR, the composite ether staking rate.\n\nCESR is a global floating rate benchmark derived from the daily transaction fees and staking rewards emitted from the Ethereum Proof of Stake (PoS) blockchain. As a global and unbiased benchmark, CESR can serve as a fundamental building block of the Web3 economy by enabling the proliferation of loans, bonds, futures, swaps, other derivative products and financial instruments that reference the index.\n\n“We are excited to launch what we see as a defining institutional reference rate for the crypto asset class,” said Chris Perkins, President of CoinFund. “This benchmark is poised to precipitate the expansion of investment products across global finance to ultimately enhance stability and risk management capabilities for investors.”\n\nThis benchmark serves as an important first step in the creation of a forward rate curve, serves as a new discount rate, and allows assets across the digital domain to be priced as a relative investment to CESR, as retail and institutional market participants are granted new opportunities to gain exposure and hedge risk. This development follows Ethereum’s transition from Proof-of-Work to Proof-of-Stake (‘The Merge’).\n\nCESR captures all relevant block rewards paid to network validators, comprising new emissions issued by the Ethereum PoS blockchain and transaction fees awarded from existing circulation, including maximal extractable value (MEV). The methodology accounts for protocol “slashing” and protocol withdrawals. CESR will be calculated and published by CoinDesk Indices daily, seven days per week.\n\n“Our partnership with CoinFund creates such a foundational piece of infrastructure to crypto asset markets,” said Alan Campbell, President of CoinDesk Indices. “Drawing on our experience managing the longest-running and largest benchmarked crypto indices globally, we’re excited to launch CESR, a building block for crypto-based finance.”\n\nRoger Bayston, EVP and Head of Digital Assets at Franklin Templeton, expressed support for CESR “As a firm committed to innovation across digital assets and the Web3 ecosystem, Franklin Templeton is very excited about the launch of CESR, backed by CoinFund and CoinDesk Indices, and the pathways it may open for the industry to use this innovative new index.”\n\nCESR will be released to the public in the coming weeks. To learn more, submit your information here."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZGVjcnlwdC5jby8xMzgwNzEvZnJhbmtsaW4tdGVtcGxldG9uLWJldHMtYmlnLW9uLWV0aGVyZXVtLWJ5LXB1dHRpbmctZnVuZC1vbi1wb2x5Z29u0gFiaHR0cHM6Ly9kZWNyeXB0LmNvLzEzODA3MS9mcmFua2xpbi10ZW1wbGV0b24tYmV0cy1iaWctb24tZXRoZXJldW0tYnktcHV0dGluZy1mdW5kLW9uLXBvbHlnb24_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Franklin Templeton Bets Big on Ethereum by Putting Fund on Polygon - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAsset manager Franklin Templeton, which oversees $1.4 trillion on behalf of clients, today announced that one of its funds is now supported on the Polygon blockchain.\n\nOne of the world’s largest asset managers, Franklin Templeton said Wednesday that its Nasdaq-listed OnChain U.S. Government Money Fund (FOBXX) would use Polygon so it could “be further compatible with the rest of the digital ecosystem.”\n\nFOBXX is Franklin Templeton’s crypto product which puts cash into American government securities, cash and repurchase agreements. It currently has over $270 million in assets under management (AUM).\n\nAD\n\nAD\n\nIt is the first U.S.-registered fund to use a blockchain to process transactions and record share ownership.\n\nPolygon is the blockchain behind the 10th largest cryptocurrency by market cap, MATIC. It is a scaling platform for Ethereum, meaning that it works to make Ethereum faster and more efficient.\n\nHead of Digital Assets at Franklin Templetonton Roger Bayston said: “Extending the reach of the Franklin OnChain U.S. Government Money Fund to Polygon enables the Fund to be further compatible with the rest of the digital ecosystem, specifically through an Ethereum-based blockchain.”\n\nColin Butler, Global Head of Institutional Capital at Polygon Labs, added that “Franklin Templetonton is at the forefront” of tokenizing assets.\n\nInvestors can buy shares of FOBXX and hold them in digital wallets via the Benji Investments mobile app.\n\nAD\n\nAD\n\nFranklin Templeton has long been involved in crypto: It announced a digital asset venture fund two years ago, and started digitizing shares for a money market fund on Stellar’s blockchain back in 2019.\n\nEditor's note: This article has been updated to correct Franklin Templeton's assets under management and reflect that the firm has had its fund on the Stellar network since 2019.\n\n"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9mcmFua2xpbi10ZW1wbGV0b24tYmV0cy1iaWctZXRoZXJldW0tMTgwMDQ0NTAwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Franklin Templeton Bets Big on Ethereum by Putting Fund on Polygon - Yahoo Finance",
        "content": "Asset manager Franklin Templeton, which oversees $1.4 trillion on behalf of clients, today announced that one of its funds is now supported on the Polygon blockchain.\n\nOne of the world’s largest asset managers, Franklin Templeton said Wednesday that its Nasdaq-listed OnChain U.S. Government Money Fund (FOBXX) would use Polygon so it could “be further compatible with the rest of the digital ecosystem.”\n\nFOBXX is Franklin Templeton’s crypto product which puts cash into American government securities, cash and repurchase agreements. It currently has over $270 million in assets under management (AUM).\n\nIt is the first U.S.-registered fund to use a blockchain to process transactions and record share ownership.\n\nPolygon is the blockchain behind the 10th largest cryptocurrency by market cap, MATIC. It is a scaling platform for Ethereum, meaning that it works to make Ethereum faster and more efficient.\n\nHead of Digital Assets at Franklin Templetonton Roger Bayston said: “Extending the reach of the Franklin OnChain U.S. Government Money Fund to Polygon enables the Fund to be further compatible with the rest of the digital ecosystem, specifically through an Ethereum-based blockchain.”\n\nDecrypt’s 2022 Crypto Project of the Year: Polygon\n\nColin Butler, Global Head of Institutional Capital at Polygon Labs, added that “Franklin Templetonton is at the forefront” of tokenizing assets.\n\nInvestors can buy shares of FOBXX and hold them in digital wallets via the Benji Investments mobile app.\n\nFranklin Templeton has long been involved in crypto: It announced a digital asset venture fund two years ago, and started digitizing shares for a money market fund on Stellar’s blockchain back in 2019.\n\nEditor's note: This article has been updated to correct Franklin Templeton's assets under management and reflect that the firm has had its fund on the Stellar network since 2019.\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc29sYW5hLXBoYW50b20td2FsbGV0LW5vdy1zdXBwb3J0cy1ldGhlcmV1bS1hbmQtcG9seWdvbi1jaGFpbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Solana: Phantom Wallet Now Supports Ethereum and Polygon Chains - Watcher Guru",
        "content": "Phantom is a cryptocurrency wallet and browser extension that utilizes the Solana blockchain to facilitate the management of digital assets and access to decentralized services. Through the wallet, users can engage in various activities such as purchasing, sending, receiving, transferring, and exchanging tokens and NFTs. It is accessible via both mobile devices and web browsers and includes support for Solana dApps with Ledger Support.\n\nAlso read: Why Bitcoin surpassed $30,000 again?\n\nAs part of its efforts to expand its services, Phantom has added the integration of Ethereum and Polygon support, indicating a move towards broader compatibility.\n\nPhantom now supports Ethereum and Polygon\n\nThe initial plans to add the support were shared three months ago. Phantom has expanded its services to include Ethereum and Polygon, in addition to Solana. Users can now access the new support provided by the wallet. This development may increase Phantom’s popularity and potentially challenge MetaMask’s position as a popular wallet.\n\nBrandon Millman, co-founder and CEO of Phantom, said, “We believe that the future of digital asset management lies in cross-chain interoperability, and we’re committed to providing our users with the tools and resources they need to easily navigate and transact across various blockchain networks.”\n\nAlso read: Shiba Inu (SHIB): BONE Now Listed on This Popular Crypto Exchange\n\nAccording to the announcement, the upgraded wallet will enable users to view all their holdings and NFTs in one place. Additionally, they can connect to dApps on SOL, MATIC, and ETH."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8venljcnlwdG8uY29tL2lmLWJpdGNvaW4taXMtZ29sZC1ldGhlcmV1bS1pcy1zaWx2ZXItdGhlbi1haS1jcnlwdG8taXMtcGxhdGludW0v0gFaaHR0cHM6Ly96eWNyeXB0by5jb20vaWYtYml0Y29pbi1pcy1nb2xkLWV0aGVyZXVtLWlzLXNpbHZlci10aGVuLWFpLWNyeXB0by1pcy1wbGF0aW51bS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "If Bitcoin is gold, Ethereum is silver, then AI crypto is platinum - ZyCrypto",
        "content": "Advertisement\n\nIn 2009, Bitcoin introduced the digital assets era, and since then, many have adopted cryptocurrency. Ethereum also came along with altcoins to fill gaps and improve on what Bitcoin left out, including dApps and smart contracts. The two established players in the market have been dominant, but with the advent of AI, a new class of cryptocurrencies has emerged, offering exciting possibilities for the future of finance and technology. Crypto watchers have even begun referring to these new coins as “platinum” in comparison to gold (Bitcoin) and silver (Ethereum).\n\nLet’s explore the potential of AI crypto and its role in shaping the future of digital finance.\n\nAvorak AI: Pioneering AI Crypto Surge\n\nAI crypto refers to cryptocurrencies or blockchain projects that utilize artificial intelligence (AI) and machine learning technologies to enhance various aspects of the blockchain ecosystem. These projects aim to improve security, scalability, and efficiency through new solutions and opportunities in data analysis, prediction, and automation. Avorak AI’s innovative solutions include a flagship trading bot, Avorak Trade, which is receiving attention for its accuracy, as beta testers report its quick response to price changes through 24/7 market analysis.\n\nAvorak AI (AVRK) is breaking records with its ongoing ICO, with phase five seeing a rise of 250%, reaching $0.210. The project has passed its second audit by SolidProof, which has elicited high expectations. YouTube analysts are showing enthusiasm for Avorak through their videos. Early investors enjoy 6% bonus yields and priority staking rights when Avorak lists on the Azbit exchange with an expected launch price of $1.\n\nThe impressive Avorak AI performance is evident through its sentiment and impressive milestone of surpassing $1.5 million. This achievement is a promising sign for the project’s future growth potential. The project’s innovative approach, growing community, and increasing demand for AI-based solutions may increase the AVRK price. This positive sentiment can provide further momentum for the project’s growth and success. Avorak AI’s strong performance encourages holders looking for high-growth potential projects.\n\nAdvertisement\n\nHow to Buy Bitcoin on etoro?\n\neToro’s rich features and market monitoring tools propel it among the best crypto buying platforms. You can buy Bitcoin on eToro by signing up for an account and verifying through the “Deposit Funds” button before funding it. When funds are available, search for BTC and click the “Trade” button. Next, enter the amount you want to invest in Bitcoin. Cross-check the details and click the “Open Trade” button to confirm the order. eToro charges fees for buying and selling cryptocurrencies, so familiarize yourself with the fee structure before purchasing.\n\nHow to Stake Ethereum?\n\nStaking Ethereum involves holding and locking up your ETH coins in a wallet. This will help maintain the security and operation of the Ethereum blockchain while you earn rewards in return. Before staking, ensure you have the minimum ETH required to become a validator on the Ethereum network. You will then choose a staking service, including exchanges, wallets, and dedicated staking platforms. Some popular options include Binance, Coinbase, and Kraken. Once you choose a staking service, deposit the required amount of ETH into the staking platform. This usually involves sending your ETH to a designated wallet address provided by the staking service and then following the instructions to initiate the staking process. Ethereum Staking can be technical and risky, so research and understand the staking process thoroughly before starting.\n\nConclusion\n\nAI crypto leverages AI tools to automate processes, improve efficiency and accuracy, and offer unique solutions to common challenges. With continued growth and evolution of AI technology, more innovative AI solutions by Avorak AI will continue to unfold, stamping its platinum label.\n\nLearn more about Avorak and its ICO here:\n\nWebsite: https://avorak.ai\n\nBuy AVRK: https://invest.avorak.ai/register\n\nDisclaimer: This is a sponsored article, and views in it do not represent those of, nor should they be attributed to, ZyCrypto. Readers should conduct independent research before taking any actions related to the company, product, or crypto projects mentioned in this piece; nor can this article be regarded as investment advice."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbmdhcGUuY29tL3BvbHlnb24tYnJpZGdlLWZvci1wb2x5Z29uLXprZXZtLWdvZXMtbGl2ZS1hbGxvd3Mtd2l0aGRyYXdhbHMtZnJvbS1ldGhlcmV1bS_SAWVodHRwczovL2NvaW5nYXBlLmNvbS9wb2x5Z29uLWJyaWRnZS1mb3ItcG9seWdvbi16a2V2bS1nb2VzLWxpdmUtYWxsb3dzLXdpdGhkcmF3YWxzLWZyb20tZXRoZXJldW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Polygon Bridge for zkEVM Allows User to Withdraw from Ethereum - CoinGape",
        "content": "On Wednesday, April 26, Polygon announced that the Polygon PoS Bridge is now available for Polygon zkEVM, whose beta version launched last month. The Polygon zkEVM network offers scalability solutions to decentralized applications (dApps) running on the Ethereum blockchain network.\n\nThe Polygon Bridge for Polygon zkEVM will have the same user experience as available in the Polygon PoS mainnet. However, it comes with a number of UX improvements that incorporate the feedback received from the community.\n\nadvertisement\n\nThese UX improvements include transaction history, a visible progress bar, and a recent transaction panel with completion status.\n\nThe concept of ‘Bridges’ in the crypto space is quite popular as they facilitate the transfer of assets across different blockchain platforms. However, bridges transferred using zk-technology are much better than the regular ones as they are entirely governed by smart contracts, one on the Polygon zkEVM and the other on Ethereum.\n\nPolygon Bridge – Withdrawing Funds from Ethereum\n\nThe launch of this Polygon Bridge for Polygon zkEVM will allow users to withdraw funds from the Ethereum mainnet within just 30-60 minutes of initiating the withdrawal. The Polygon Bridge shall be supporting some of the users’ favorite assets such as ERC-20 tokens and the extended features of ERC-777 tokens.\n\nAlso, users of the Polygon Bridge won’t have to undergo the bridging process. Soon as the user triggers a bridging transaction, the bridged token will be automatically mapped. Most of the other platform require users to map their tokens before bridging. This could also take hours or even days. Thus, the Polygon Bridge cuts through these hurdles offering users a seamless experience.\n\nThe Polygon zkEVM launched last month as mainnet beta is open source, permissionless, and public. Thus, any can build atop it and transact their assets. Some teams have already started building atop the Polygon zkEVM. This includes premier dApps such as Balancer and Lens, and other gaming projects."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vcHJlc3MtcmVsZWFzZXMvdml0YWxpay1idXRlcmluLWFtb25nLXRoZS10b3Atc3BlYWtlcnMtYXQtZWRjb24tMjAyMy1pbi1tb250ZW5lZ3Jv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Vitalik Buterin among the top speakers at EDCON 2023 in Montenegro - Cointelegraph",
        "content": "As one of the largest gatherings of the Ethereum and blockchain communities, the upcoming EDCON 2023 (Community Ethereum Development Conference) is set to take place in the beautiful city of Podgorica, Montenegro from May 19 to 23, 2023. The conference will feature keynote speeches, technical workshops and panel discussions on topics such as blockchain regulation, layer 3, decentralized society, decentralized governance, the network state and more.\n\nEDCON 2023 will bring together the brightest minds of the Ethereum community, including Ethereum co-founder Vitalik Buterin, The Network State author Balaji Srinivasan, Gitcoin co-founder Scott Moore, blockchain researcher at CNRS and the Berkman Klein Center at Harvard University Primavera De Filippi, Tim Beiko from Ethereum Foundation, Barry Whitehat from Ethereum Foundation, De University of Ethereum director Cy Li as well as many other blockchain projects heads and research leaders. The full, updated list can be found on the official website.\n\nThe conference will also include an Ethereum quorum day, community event day, and a super demo competition, providing ample opportunities for collaboration and discussion.\n\nFor more information on EDCON 2023 and sponsorship opportunities, please visit the site or contact the conference organizers via email.\n\nAbout EDCON\n\nOrganized by Linktime, De University of Ethereum and ETHPlanet, EDCON is a nonprofit, global, annual Ethereum conference that has attracted around 10,000 attendees, 2,000 developers, 300 speakers, 450 projects, 400 supporters and 300,000 online views since 2017. EDCON is mainly committed to serving the Ethereum ecosystem, boosting the communication and interaction of Ethereum communities worldwide.\n\nSocials\n\nTwitter\n\nTelegram"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiKGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9hdXRob3IvbWF0dC1uZWxzb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Posts of Matt Nelson - Blockworks",
        "content": "Matt Nelson is a product manager for Consensys' Ecosystem Team. He works on the Hyperledger Besu execution client, Web3Signer, and many other product and research initiatives. He was previously a software engineer building DLT and Blockchain solutions at IBM, and has been with ConsenSys since 2021 working on challenges in Ethereum. He has coordinated Merge efforts for the teams across ConsenSys to help with readiness, testing, development, and more. He continues to help lead the team in developing a top-tier execution client and furthering Ethereum protocol development."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8yNi9uZXctbWV0YW1hc2stY29tcGV0aXRvci10b3Atc29sYW5hLXdhbGxldC1waGFudG9tLWdvZXMtbXVsdGljaGFpbi13aXRoLWV4cGFuc2lvbi10by1ldGhlcmV1bS1hbmQtcG9seWdvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "New MetaMask Competitor? Top Solana Wallet Phantom Goes Multichain With Expansion to Ethereum and Polygon - The Daily Hodl",
        "content": "Phantom, a leading self-custody wallet in the Solana (SOL) ecosystem, is reportedly expanding to support the Ethereum (ETH) and Polygon (MATIC) chains.\n\nPhantom told TechCrunch that it plans to support the Ethereum and Polygon blockchains beginning May 1st on both iOs and Android devices.\n\nSays Phantom,\n\n“The Phantom multi-chain is now available everywhere that MetaMask is.”\n\nWith the expansion, Phantom users will have the ability natively hop between DApps (decentralized applications), and NFT (non-fungible token) marketplace sites such as Blur and OpenSea, according to TechCrunch.\n\nUsers will also have the capacity to import assets from MetaMask.\n\nBrandon Millman, CEO and co-founder of Phantom, says Phantom has the ability the hold multiple seed phrases whereas MetaMask can only hold one.\n\nMillman also says Phantom is adding new safety features to Phantom as they begin supporting multiple blockchains, including anti-phishing measures by hiding spam sent to the wallet and warning about any potential threats when navigating websites online.\n\nSays Millman,\n\n“The analogy is similar to email: sometimes spam emails slip through, but users can just mark it as spam, and over time it gets better and better at catching it…\n\nIf you go to a website, we give you a warning that you’re leaving Phantom, and if we have an understanding that a website is malicious, we preemptively block it…\n\nThere are cases where you fall through all these protective layers and do get phished, but we have a customer support team that’s basically 24/7 and can try to get you help with exchanges, directory of local authorities or things like that to explore routes…\n\nI think that’s a huge thing, because afterward, usually you don’t know what you can do.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Bisams"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS9zb2xhbmEtd2FsbGV0LXBoYW50b20tZXh0ZW5kcy1zdXBwb3J0LWZvci1ldGhlcmV1bS1hbmQtcG9seWdvbtIBUmh0dHBzOi8vdS50b2RheS9zb2xhbmEtd2FsbGV0LXBoYW50b20tZXh0ZW5kcy1zdXBwb3J0LWZvci1ldGhlcmV1bS1hbmQtcG9seWdvbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Solana Wallet Phantom Extends Support for Ethereum and Polygon - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to a recent TechCrunch article, Solana-based Phantom wallet is going to welcome users of Ethereum (ETH) and Polygon (MATIC) chains on May 1.\n\nAdvertisement\n\nSolana's wallet adds ETH and MATIC\n\nInitially, the wallet was scheduled to start integrating these chains during Q1 of this year. However, the start date was postponed. According to the chief of the wallet Brandon Millman, all three million users of Phantom will be exposed to the Solana, Ethereum and Polygon chains via the wallet.\n\nSolana Wallet Phantom adds support for Ethereum and Polygon, which was originally scheduled for the 2023Q1, but was delayed until today. Phantom once completed a financing of $109 million at $1.2 billion in January 2022. Paradigm led and A16Z participated. https://t.co/MimvkmqvMc — Wu Blockchain (@WuBlockchain) April 26, 2023\n\nThis has become possible after the wallet obtained a valuation of $1.2 billion after the $109 million fundraising round at the start of 2022; that is, a year has passed since then. The leading players who participated in that investment round were Paradigm and Andreessen Horowitz, along with Solana.\n\nIntegration with the above-mentioned chains will provide Phantom users with exposure to decentralized platforms, like Aave and Uniswap, and also to NFT platforms, such as OpenSea. Users will also be able to move their crypto from MetaMask wallet, Solana or EVM to Phantom.\n\nBesides, users of this wallet have options to trade and hold crypto. They will now be able to do it on three leading blockchains, rather than just one. Besides, as mentioned above, Phantom's users will now be able to interact with dApps and other multichain products."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9mcmFua2xpbi10ZW1wbGV0b24tbW9uZXktbWFya2V0LWZ1bmQtMTgwMDAwMzcxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Franklin Templeton Money Market Fund Launches on Polygon Blockchain - Yahoo Finance",
        "content": "Franklin OnChain U.S. Government Money Fund, the first U.S.-registered mutual fund run on blockchain, is now supported on Ethereum via Polygon\n\nSAN MATEO, Calif., April 26, 2023--(BUSINESS WIRE)--Franklin Templeton today announces that the Franklin OnChain U.S. Government Money Fund (FOBXX) (the \"Fund\"), the first U.S.-registered mutual fund to use a public blockchain to process transactions and record share ownership, is now supported on the Polygon blockchain.\n\nFranklin Templeton continues to see operational efficiencies through use of a blockchain-integrated system, including increased security, faster transaction processing and reduced costs, benefiting Fund shareholders. The Fund’s transfer agent maintains the official record of share ownership via a proprietary blockchain-integrated system that utilizes blockchain technology for transaction activity.\n\n\"Extending the reach of the Franklin OnChain U.S. Government Money Fund to Polygon enables the Fund to be further compatible with the rest of the digital ecosystem, specifically through an Ethereum-based blockchain. This furthers our distribution reach through a Layer 2 (L2) blockchain that has a proven track record,\" said Roger Bayston, Head of Digital Assets at Franklin Templeton.\n\nTapping into the scope and breadth of the Ethereum ecosystem opens up a world of possibilities for investors. The Fund offers a competitive yield and is a regulated 1940 Act fund that invests at least 99.5 percent of its total assets in government securities, cash and repurchase agreements collateralized fully by government securities or cash. The Fund’s investment goal is to provide investors with as high a level of current income as is consistent with the preservation of shareholders’ capital and liquidity and aims to maintain a stable $1.00 share price.\n\nOne share of the Franklin OnChain U.S. Government Money Fund is represented by one BENJI token. Token holders can gain exposure to the Fund in digital wallets through the Benji Investments app, available in mobile app stores.\n\nStory continues\n\n\"It’s amazing to have a legacy institution like Franklin Templeton bringing transparency, interoperability, and secure, democratized access to their financial instruments, all things afforded with Polygon,\" said Colin Butler, Global Head of Institutional Capital at Polygon Labs. \"When we take a step back and look at these things less as blockchain products and more as benefits created by utilizing blockchain rails, we start to see the ‘why.’ Tokenized assets are going to positively rewire the global financial system, and Franklin Templeton is at the forefront of this movement.\"\n\n\"The Polygon blockchain ecosystem spans many L2, sidechains, and sovereign blockchains and our suite of Ethereum scalability solutions has seen significant adoption across DeFi, NFTs, and enterprises,\" added Mr. Butler. \"The Polygon blockchain also provides access to a $260 billion market — the approximate aggregate value of all ERC-20 (Ethereum-based) assets.\"\n\nAbout Franklin Templeton\n\nFranklin Resources, Inc. [NYSE:BEN] is a global investment management organization with subsidiaries operating as Franklin Templeton and serving clients in over 155 countries. Franklin Templeton’s mission is to help clients achieve better outcomes through investment management expertise, wealth management and technology solutions. Through its specialist investment managers, the company offers boutique specialization on a global scale, bringing extensive capabilities in equity, fixed income, multi-asset solutions and alternatives. With offices in more than 30 countries and approximately 1,300 investment professionals, the California-based company has 75 years of investment experience and approximately $1.4 trillion in assets under management as of March 31, 2023. For more information, please visit franklintempleton.com and follow us on LinkedIn, Twitter and Facebook.\n\nAbout Polygon Labs:\n\nPolygon Labs develops Ethereum scaling solutions for Polygon protocols. Polygon Labs engages with other ecosystem developers to help make available scalable, affordable, secure and sustainable blockchain infrastructure for Web3. Polygon Labs has initially developed a growing suite of protocols for developers to gain easy access to major scaling solutions, including layer 2s (zero-knowledge rollups and optimistic rollups), sidechains, hybrid chains, app-specific chains, enterprise chains, and data availability protocols. Scaling solutions that Polygon Labs initially developed have seen widespread adoption with tens of thousands of decentralized apps, unique addresses exceeding unique addresses exceeding 211 million, over 1.12 million smart contracts created and 2.36 billion total transactions processed since inception. The existing Polygon network is home for some of the biggest Web3 projects, such as Aave, Uniswap, and OpenSea, and well-known enterprises, including Robinhood, Stripe and Adobe. Polygon Labs is carbon neutral with the goal of leading Web3 in becoming carbon negative. If you're an Ethereum Developer, you're already a Polygon developer! Leverage Polygon’s fast and secure txns for dApps you develop, get started here.\n\nYou could lose money by investing in the Fund. Although the Fund seeks to preserve the value of your investment at $1.00 per share, it cannot guarantee it will do so. An investment in the Fund is not insured or guaranteed by the Federal Deposit Insurance Corporation or any other government agency. The Fund’s sponsor has no legal obligation to provide financial support to the Fund, and you should not expect that the sponsor will provide financial support to the Fund at any time.\n\nInvestors should carefully consider a fund’s investment goals, risks, charges and expenses before investing. To obtain a summary prospectus and/or prospectus, which contains this and other information, talk to your financial professional, call us at (800) DIAL BEN/342-5236 or visit franklintempleton.com. Please carefully read a prospectus before you invest or send money.\n\nCopyright © 2023. Franklin Distributors, LLC. Member FINRA/SIPC. All rights reserved.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230426005743/en/\n\nContacts\n\nFranklin Templeton Corporate Communications:\n\nRebecca Radosevich, (212) 632-3207, rebecca.radosevich@franklintempleton.com\n\nKatherine Fox, (646) 818-9010, kfox@prosek.com"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGFpbHljb2luLmNvbS9zaGliYS1pbnUtYnVybi1yYXRlLXR1bWJsZXMtYXMtZXRoZXJldW0td2hhbGVzLWdldC1hY3RpdmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Shiba Inu Burn Rate Tumbles as Ethereum Whales Get Active - DailyCoin",
        "content": "Blockchain data shows SHIB is the top-traded coin by ETH whales.\n\nShiba Inu’s $BONE recently got listed by two major exchanges.\n\nOnly one transaction was recorded on Shibburn in the last 24 hours.\n\nThe popular canine coin Shiba Inu (SHIB) gained much traction among the TOP 100 Ethereum whales after briefly slipping below the multi-year support line of $0.00001 late Wednesday night. This has caused a buying spree on Coinbase, as the crypto scales suggest that 98% of retail investors on the popular American platform are buying Shiba Inu.\n\nMoreover, the largest whales quickly reacted to the sudden price drop. According to blockchain data, one Ethereum whale on KuCoin took the opportunity to stock up on SHIB holdings. In four transactions from KuCoin, the aforementioned whale bought 4,000,000,000 $SHIB tokens, topping up the crypto wallet to 16 billion SHIB.\n\nAt press time, SHIB is changing hands at $0.00001025, according to CoinGecko. With a 3.7% downturn in the last 24 hours, Shiba Inu managed to reclaim the fundamental resistance level but showed no bullish signs on the on-chain signals in the daily charts.\n\nSo as retail investors Panic Sell Crypto #ETH Whales are scooping up more $SHIB as it is once again the largest-held nonstable Alt Coin.\n\nIf I could only be a Whale 🐋😂 pic.twitter.com/or665PspLy — Shib Dream * Shiba Inu News * Shib Army Social 💎 (@theshibdream) April 21, 2023\n\nShiba Burn Rate Cools Down & Drops to Zero\n\nIn contrast to the swiftly increased Ethereum whale activity, the Shiba Inu community has almost halted its burning activity. In further detail, just 47,664 Shiba Inu tokens were burned in the last 24 hours in a single transaction, which equals $0.49.\n\nAs if that wasn’t enough, the official burning tracker Shibburn hasn’t recorded a single transaction since Thursday evening, making the SHIB Burn rate go negative for the first time. Currently, the SHIB burn metrics tool displays a shocking -100%, as none of the canine tokens were set ablaze.\n\nIn the past 24 hours, there have been a total of 47,664 $SHIB tokens burned and 1 transaction. Visit https://t.co/t0eRMnyZel to view the overall total of #SHIB tokens burned, circulating supply, and more. — Shibburn (@shibburn) April 27, 2023\n\nOn The Flipside\n\nThe lack of motivation from the community to burn SHIB tokens stems from the fact that there’s no automated way of burning the tokens.\n\nSHIB Army members can choose from one of the three dead wallets on Shibburn, but many have requested an automated burning mechanism.\n\nWhy You Should Care\n\nShiba Inu is evolving into a self-sufficient ecosystem via Shibarium, the Layer-2 scaling solution.\n\nExplore today’s trending crypto stories:\n\nBinance’s CZ Refutes Bloomberg Wealth Ranking\n\nFloki Soars to New Heights as Fake Airdrops Sweep Twitter"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L25ldy1tZW1lLWNvaW4tY291bGQtb3V0c2hpbmUtZXRoZXJldW0tZXRoLWFuZC1jYXJkYW5vLWFkYS1mb2xsb3dpbmctMzAwMC1ncm93dGgtcHJlZGljdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "New Meme Coin Could Outshine Ethereum (ETH) and Cardano (ADA) following 3000% growth prediction - Analytics Insight",
        "content": "In the ever-evolving DeFi crypto space, DigiToads (TOADS) has emerged as a revolutionary meme coin with the potential to outperform even Ethereum (ETH) and Cardano (ADA). The project has garnered significant attention, with experts predicting an astounding 3000% growth in the near future. As one of the best DeFi platforms and altcoins to invest in for 2023, DigiToads offers a unique combination of deflationary tokenomics, a P2E game, NFTs, NFT staking, and charitable initiatives.\n\nDigiToads (TOADS) Keeps Rallying\n\nDigiToads sets itself apart from other altcoins by combining the entertainment value of a meme coin with a sustainable ecosystem that incorporates multiple revenue streams. The P2E game, for instance, enables users to collect, nurture, and battle unique DigiToads in a web3 environment. Players can acquire these digital creatures by buying, trading, or winning them, and each DigiToad boasts its own distinct characteristics, strengths, and weaknesses.\n\nThe native TOADS token serves as the currency within the game, allowing players to purchase food, potions, and training equipment to enhance their DigiToads’ abilities. This innovative gaming attracts gamers but also makes DigiToads one of the top altcoins for investors seeking a high-growth project.\n\nAnother key feature of DigiToads is its NFT staking program, which continuously rewards holders who stake their NFTs. A pool funded by 2% of every TOADS transaction ensures that rewards are consistently available, keeping the community engaged and motivated.\n\nThe Platinum Toads initiative further distinguishes DigiToads from other DeFi coins. Platinum Toads are awarded to the top traders in monthly trading competitions, granting the winners remote access to a portion of the TOADS treasury for trading. This not only incentivizes the best communityand but also ensures that the treasury is managed effectively.\n\nDigiToads’ commitment to charity and environmental initiatives makes it one of the best altcoins for socially conscious investors. The project pledges 2.5% of its profits to charities focused on reforestation and rainforest preservation, demonstrating a strong sense of social responsibility.\n\n> Buy DigiToads Now <<\n\nTOADS Runaway Presale Success\n\nThe presale of DigiToads has already raised over $1,750,000, with significant growth potential still available. The ease of access, with many major cryptocurrencies accepted as payment, combined with a doxxed team and no vesting period, makes it an attractive investment opportunity for those looking to participate in new DeFi projects.\n\nJoin DigiToads Today\n\nDigiToads (TOADS) has emerged as one of the best DeFi cryptos and altcoins to invest in for 2023. Its combination of deflationary tokenomics, P2E gaming, NFT staking, meme coin potential, Platinum Toads, and charitable initiatives makes it a unique and promising project in the DeFi crypto space. With a staggering 3000% growth prediction, DigiToads is poised to outshine even major cryptocurrencies like Ethereum (ETH) and Cardano (ADA), offering investors an unparalleled opportunity in the world of altcoins.\n\nFor More Information on DigiToads visit the website, join the presale or join the community for regular updates.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0by1tYXJrZXQtZmFsbHMtc29sYW5hLXNvbC1hbmQtZXRoZXJldW0tZXRoLWRvd24tYnV0LXNwYXJrbG8tc3Byay13aWxsLXNvdXItaGlnaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Crypto Market Falls, Solana (SOL) and Ethereum (ETH) Down, But Sparklo (SPRK) Will Sour High - Analytics Insight",
        "content": "Investors are growing anxious in a brutal year for some of their favourite Crypto coins, with current shake-ups like Ethereum (ETH) and Solana (SOL) dipping on the Crypto chart. High inflation backed by the FTX meltdown has made the market uncertain leading to further crippling. Investors are worried and wonder if they’re ever going to recover.\n\nLarge unstaking is definitely going to happen as investors try to look for other coins—with the potential for growth to diversify their portfolios. An innovative alternative investment, Sparklo has been making headlines for the right reasons, even at its presale level.\n\nThe platform allows investors to trade and invest in Silver, Gold and Platinum bars. Analysts suggest that its prices will have a 40x increase after its launch, so buying earlier is highly recommended.\n\n“Ethereum Killer” Solana (SOL) Trading Below Long-Term $27 Resistance Area\n\nOftenly championed as the “Ethereum killer”, Solana (SOL) has been crashing on the market and is currently trading below its descending resistance line. Solana downward spiral made its prices go down to $8 in December 2022. Even after Solana’s $230% increase in January 2023, it has failed to recover and break out above the $27 resistance line.\n\nAnalysts suggest that this bullish trend will still provide resistance since Solana (SOL) hasn’t broken out of the long-term $27 resistance area and the red zone. It’s even estimated that this fall will continue to single digits.\n\nThis circumstance has made Solana (SOL) lose its appeal to investors now looking for other presale gems like Sparklo.\n\nEthereum (ETH) Plummers the Crypto Charts By 6%\n\nDue to the selling pressures of Bitcoin (BTC), the second largest Crypto by market capitalization, Ethereum (ETH) is crashing the market. Ethereum (ETH) was steadily approaching $1900, with a previous record increase which was due to Shanghai’s Blockchain upgrade.\n\nMany Crypto Analysts thought that Shanghai’s Blockchain upgrade would cause a price fall, but this was not the case. It turns out the upgrade caused Ethereum (ETH) to have steady increases. The upgrade allowed Ethereum (ETH) to shift from a proof of stake protocol to a proof of work protocol.\n\nThe shift allowed staked Ethereum (ETH) to be withdrawn from the blockchain. Will ETH continue falling?\n\nNo one knows, but it’s imminent for investors to look for other presale gems like Sparklo that have the growth potential to diversify their portfolio.\n\nPresale Gem, Sparklo (SPRK), Predicted to have Bullish Runs\n\nBeing a cryptocurrency protocol, Sparklo will become the first platform to allow traders to invest in precious metals fractionally. Investors will be able to trade and invest in fractionalized NFTs backed by Silver, Gold and Platinum.\n\nThe revolution project is making headlines and attracting investors who wish to invest in less risky assets during inflation and market uncertainty. Here are a few reasons why you should consider buying Sparklo as early as now:\n\nIt offers users an opportunity to invest in NFTs representing real luxury assets\n\nPartnered with jewellery stores that help bring products to the market\n\nWith the potential to grow, it can become a future crypto blue chip\n\nUsers have a chance to buy this future crypto blue chip at extremely affordable prices\n\nSparklo has set up measures that ensure the platform is ready for trade. For starters, it has passed through the Audit InterFi Network and will lock in liquidity for 100 years. Moreover, the Know Your Customer audit is in the works and will be received soon enough.\n\nWith a price of $0.015 that’s on a steady rise to $0.017 by the end of this week, it’s time to invest in it.\n\nWebsite: https://sparklo.finance\n\nBuy Presale: https://invest.sparklo.finance\n\nTwitter: https://twitter.com/sparklo_finance\n\nTelegram: https://t.me/sparklofinance\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bS1ldGgtcHJpY2UtcHJlZGljdGlvbi12cy11d2VyeC13ZXJ4LXBvdGVudGlhbC13aGljaC1jb2luLWlzLW1vcmUtbGlrZWx5LXRvLWV4cGxvZGUtaW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction VS Uwerx (WERX) Potential: Which Coin Is More Likely to Explode in 2023? - Analytics Insight",
        "content": "What do you get when you combine one of the fastest-growing industries with the power of financial freedom? This is exactly what Uwerx is planning with its upcoming launch. The decentralized freelancing platform combines blockchain with an ethical gig workers’ platform, offering speed, transparency, and monetary security.\n\nThe result is a token (WERX) that can explode in value – much more than Ethereum (ETH) might.\n\nBut Aren’t Ethereum (ETH) Signals Strong?\n\nEthereum (ETH) acts as a global computer and allows anyone to run decentralized apps (dApps) on it. This has led to thousands of protocols, applications, and tokens that today utilize Ethereum (ETH) as the backbone.\n\nAs such Ethereum (ETH) has a strong value in the market. Even after dropping 66% since its ATH, a single Ethereum (ETH) is worth $1,680.\n\nAccording to many crypto traders, Ethereum (ETH) still has rocky days ahead as the market adjusts to the post Terra and FTX world. There are wild swings expected in its price, with many saying it will peak at around $2474. A 47% jump, but the same experts are also pointing out that in case of a crypto market downturn, Ethereum (ETH) can dive to as low as $984.\n\nWhy is Uwerx (WERX) More Likely to Explode?\n\nOne major advantage that Uwerx will have over Ethereum (ETH) is how it is going to be structured. The platform offers some major benefits in the freelancing market – a global industry that is expanding 3 times more than the whole US workforce.\n\nAccording to Teamstage.io, freelancing is extremely strong in both developed and developing nations, with the US, UK, Brazil, and Pakistan at the top.\n\nThis places Uwerx in the perfect position to offer a marketplace that offers more than just a crypto token to invest in for potential profits. Over time, freelancers will experience the different advantages of using Uwerx over traditional platforms like Upwork and Fiverr. Things like the team’s announcement to give control to token holders and removing taxes will bring in a rise in demand for its WERX token – and therefore, an increase in its token value. Traders are excited and expect the WERX to range between $1 to $1.5 by September 2023.\n\nAs Uwerx gears up to kick off its WERX presale, targeted at $0.0075, this means it can explode in value in just a few months, offering anywhere from a potential 10,000% to 15,000% ROI.\n\nThank You, Decentralized Freelancing\n\nTraders and experts have high hopes for Uwerx for several reasons. Blockchain grings in a level of trust and transparency the industry desperately needs. A decentralized platform means that freelancers are not at the mercy of corporate greed is going to be a major pull factor.\n\nMixing in the low fees that cryptocurrencies are famous for, Uwerx offers significant savings as it will charge only 5% per job, rather than 20% compared to other platforms. Other advantages include:\n\nIP protection.\n\nRewards and incentives for new and active freelancers.\n\nFaster payment withdrawals.\n\nIntegration with Trello, Asana and Slack\n\nUwerx is committed to providing a sustainable freelancing platform and protecting WERX token holders. It has already completed a third-party technical audit, thanks to InterFi Network as well as SolidProof, and will also be locking in liquidity for a massive 25 years after its presale.\n\nThese reasons have traders and the freelancing world excited about WERX, making it highly likely it will not only rise in value but stand among the top crypto assets. Please follow the links below to find out more about the 25% purchase bonus.\n\nPresale: invest.uwerx.network\n\nTelegram: https://t.me/uwerx_network\n\nTwitter: https://twitter.com/uwerx_network\n\nWebsite: https://www.uwerx.network/\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2Jsb2NrY2hhaW4vYmxvY2tjaGFpbi1sYXllci0xLXZzLWxheWVyLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Blockchain Layer 1 vs. Layer 2: The Essentials - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5jaXR5YW0uY29tL2NhbWJyaWRnZS1kb25zLWxhdW5jaC10b29sLXRvLXRyYWNrLWV0aGVyZXVtLWVsZWN0cmljaXR5LWNvbnN1bXB0aW9uLWFzLWNvbmNlcm5zLW92ZXItZW52aXJvbm1lbnRhbC1pbXBhY3QtZ3Jvdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Cambridge dons launch tool to track Ethereum electricity consumption as concerns over environmental impact grow ... - City A.M.",
        "content": "Cambridge dons launch tool to track Ethereum electricity consumption as concerns over environmental impact grow\n\nToday is the day of the long-awaited Ethereum Dencun upgrade. Dencun will reduce Layer 2 transaction fees and involve “blobs” and “Proto-dank sharding”. On Monday, Ethereum punched above $4,000 for the first time since December 2021. This new cycle high has happened even in the face of the perceived diminishing likelihood of an Ethereum spot exchange-traded fund (ETF) being approved by the SEC.\n\nCryptocurrencies will face more scrutiny on their environmental impact after the University of Cambridge released a new open access tool to track electricity usage from cryptocurrencies, starting with Ethereum.\n\nThe new Cambridge Blockchain Network Sustainability Index (CBNSI) hopes to provide “cutting edge insights into the current and historical environmental impact of various blockchain networks.”\n\nSo far, the tool has tracked electricity consumption from Ethereum, the second largest cryptocurrency by market capitalisation.\n\nRead more Major Ethereum upgrade goes live, and Twitter starts letting users trade stocks with eToro partnership\n\nThe CBNSI’s data tracks Ethereum’s consumption both before and after The Merge.\n\nThe Merge took place in September 2022 and moved Ethereum’s proof-of-work model into a proof-of-stake model.\n\nUnder a proof-of-work model, currency holders have to ‘mine’ the currency in an energy intensive process. A proof-of-stake model, in contrast, requires participants to put financial resources at stake which is more less resource intensive.\n\nAccording to the research, there was a 99.99 per cent decrease in Ethereum’s electricity usage after The Merge concluded.\n\nThe research also showed that 39 per cent of Ethereum nodes were based in the US while 17 per cent were in Germany.\n\nWhile the CNBSI does not yet have data on Ethereum’s greenhouse gas emissions, work is underway to translate the consumption data into greenhouse gas emissions. This will allow for a better assessment of Ethereum’s ongoing environmental footprint and historical emissions debt.\n\nJoe Baguley, chief technology officer, EMEA at VMware said: “The Ethereum Merge is a responsible step in the right direction, removing a fundamental environmental barrier to more mainstream adoption.\n\n“But ‘The Merge’ won’t put a plaster on this carbon intensive network, particularly if Bitcoin won’t also overhaul its underlying infrastructure,” he continued.\n\nThe project builds off the Cambridge Bitcoin Electricity Consumption Index (CBECI), launched in 2019, which tracks the environmental impact of Bitcoin.\n\nAccording to its data, Bitcoin consumes more electricity than Ukraine and contributes more to greenhouse gas emissions than New Zealand.\n\nIf the electricity consumed by Bitcoin were directed to more productive uses – such as tea kettles in the UK – it would be able to power all kettles used in the UK for the next 30m years.\n\nExecutive director of the CCAF Bryan Zhang said “the debate around Bitcoin’s environmental impact demonstrated that we needed to expand the scope of our research to assess other blockchain networks.”\n\nThe launch of the CBNSI will provide policymakers with the “necessary foundational data for evidence-based debate to take place” Zhang said."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2JpZy1wcm9maXQtYWhlYWQtYXJiaXRydW0tcHJpY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Big Profit Ahead: Arbitrum Price to Rise by 500% in the Next 30 Days? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Arbitrum, a layer-two scaling solution for Ethereum, recently distributed $120 million in ARB tokens to 125 decentralized autonomous entities (DAOs) in its ecosystem. The tokens will be used to incentivize ecosystem growth by allowing DAOs to reward users or encourage liquidity and application. The distribution has been closely monitored by leading Ethereum analytics firms, with approximately 100 million ARB transfers reported to eligible protocols. This article is all about Arbitrum price and its potential price rise.\n\nHow has the Arbitrum (ARB) price been moving over the past few days?\n\nIn the last few days, the Arbitrum (ARB) price has risen massively. In the last 30 days, the price saw a gain of over 10%. This makes Arbitrum Coin one of the biggest winners in the altcoin rally that followed Bitcoin’s price surge above $30,000.\n\nArbitrum is a Layer 2 scaling solution for the Ethereum blockchain. The so-called Arbitrum Rollups are used for this. These do not have their own consensus mechanism, but use the state of the Ethereum blockchain for verification. This improves the verification of smart contracts.\n\nEthereum Layer 2 solutions have repeatedly experienced massive price increases in the past. The best known is Polygon, which was one of the strongest gainers in the first quarter of 2023. After the successful Shanghai update on Ethereum, investors on Arbitrum were particularly bullish as the connection between high scalability and security through verification on the main chain is very promising.\n\nArbitrum Price and Token Distribution Details\n\nhttps://twitter.com/arbitrum/status/1650541491012370435?s=20\n\nThe DAOs received their first financing of 113 million ARB tokens, valued at around $148 million at current prices. Treasure DAO and GMX were among the largest recipients with 8 million ARB tokens each, while SushiSwap, Balance, Uniswap, Curve, and Dopex received 3 to 5 million ARB tokens. Additionally, 118 other ecological protocols received varying percentages of the ARB airdrop. Around 90 million ARB tokens have been distributed so far, valued at approximately $120 million at current pricing.\n\nLocalizing Community Governance\n\nhttps://twitter.com/lookonchain/status/1650762245767569409?s=20\n\nThe token distribution is part of a broader effort by Arbitrum to localize community governance, allowing DAOs to choose how to distribute their share of the ARB tokens. PlutusDAO, for example, has promised to use the additional funds to “make Plutus stronger than ever before.” This approach gives DAOs greater autonomy to direct resources to areas they deem most critical to their operations.\n\nImpact on Liquidity and DeFi Projects\n\nThe token distribution is expected to increase liquidity across all Arbitrum DeFi projects. According to Mechanism Capital co-founder Andrew Kang, such incentives provide the “flywheel that gave the L1 token 100%+ APY” within ecosystems on Layer-1 platforms. Other Ethereum scaling solutions, such as Optimism, have launched similar programs to increase liquidity and usage.\n\nBenefits for Small Market Capitalization Protocols\n\nThe ARB incentives may benefit protocols with smaller market capitalizations the most, such as Vesta Finance, PlutusDAO, and Yin Finance. Onchain data analyst The Data Nerd calculated the ratio of ARB incentives to each protocol about its market valuation and determined that these ecosystems are receiving incentives that are multiples of their present market capitalization, which might assist in ecosystem expansion.\n\nArbitrum Price and Potential for Token Value Increase\n\ngm\n\n\n\nThe DAO Distribution of the Arbitrum airdrop occurred last night.\n\n\n\nAround $120M of $ARB was sent to Arbitrum protocols – although not all projects have received their allocation yet.\n\n\n\nAs of right now the top recipients include @Treasure_DAO, @SushiSwap and @dopex_io. pic.twitter.com/Pe2qfSUfah — Arkham (@ArkhamIntel) April 25, 2023\n\nThe distribution of ARB tokens to DAOs within the Arbitrum ecosystem is expected to fuel ecosystem growth and encourage the creation of decentralized apps (dApps) on the platform. As more protocols receive ARB tokens, the value of the token may climb, potentially leading to a 500% increase in price.\n\nHere are some significant points on why there may be big profit potential ahead for Arbitrum:\n\nhttps://twitter.com/nansen_ai/status/1650744810012278785?s=20\n\nArbitrum is a popular layer-two scaling solution for Ethereum, which means it can process transactions more quickly and cheaply than the Ethereum network itself.\n\nWith Ethereum’s high gas fees and slow transaction times, more users are looking for alternatives, and Arbitrum is one of the leading solutions.\n\nRecently, Arbitrum distributed $120 million in ARB tokens to 125 decentralized autonomous entities (DAOs) in the ecosystem it operates in, which could drive demand for the token.\n\nThe ARB tokens are being used to incentivize ecosystem growth by allowing DAOs to reward users or encourage liquidity and applications.\n\nAs more protocols and users adopt Arbitrum and utilize the ARB token, the demand for it could increase, potentially driving up its price.\n\nAccording to The Data Nerd, protocols with smaller market capitalizations, such as Vesta Finance, PlutusDAO, and Yin Finance, will benefit the most from the ARB incentives.\n\nThe analyst calculated that these ecosystems are receiving incentives that are multiples of their present market capitalization, which could help drive ecosystem expansion and potentially increase demand for ARB tokens.\n\nOther Ethereum scaling solutions, such as Optimism, have launched similar programs to increase liquidity and usage, which may further drive demand for Arbitrum and its associated token.\n\nAccording to some analysts, the current price of ARB may not yet reflect its potential value, which could mean there is room for growth and profit potential.\n\nHowever, as with any investment, it’s important to do your own research and assess the risks before investing in ARB or any cryptocurrency.\n\nConclusion\n\nThe distribution of $120 million in ARB tokens to DAOs within the Arbitrum ecosystem is a significant step towards incentivizing ecosystem growth and encouraging the creation of dApps on the platform. The token distribution is expected to increase liquidity, benefit small market capitalization protocols, and potentially increase the value of the token. With greater community governance, DAOs have the power to direct resources to the areas they deem most critical, further fueling ecosystem growth.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMioQFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9ibG9ja2NoYWluLXJhamFnb3BhbC1tZW5vbi12aWNlLXByZXNpZGVudC13YXppcngtb24tYml0Y29pbi1vci1ldGhlcmV1bS13aGljaC1pcy1hLWJldHRlci1jaG9pY2Utb2YtaW52ZXN0bWVudC0zMDY0NTk5L9IBpgFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9ibG9ja2NoYWluLXJhamFnb3BhbC1tZW5vbi12aWNlLXByZXNpZGVudC13YXppcngtb24tYml0Y29pbi1vci1ldGhlcmV1bS13aGljaC1pcy1hLWJldHRlci1jaG9pY2Utb2YtaW52ZXN0bWVudC0zMDY0NTk5L2xpdGUv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Rajagopal Menon, vice president, WazirX on Bitcoin or Ethereum, which is a better choice of investment - The Financial Express",
        "content": "For cryptocurrency traders perhaps one of the biggest challenges resides in selecting between Bitcoin and Ether. Reports from Investopedia, a financial media platform, include that currently Bitcoin and Ether are among the popular digital currency. As per CoinMarketCap, a crypto price-tracking platform, the current market value of Bitcoin stands at $28,425.16 (April 26, 2023, 08:40 am IST) and Ether stands at $1,868.09(April 26, 2023, 08:40 am IST).\n\nInitially, both cryptocurrencies were made to store and preserve data in a secure manner. With time, people began to realise that more things could be done with the help of this programmable money. Vitalik Butalin, creator of Ethereum, realised that Bitcoin has limitations and so he created his own crypto Ether (ETH). Eventually, Ethereum opened a new way of working with digital currencies by using the working mechanism of Proof-of-Stake (PoS). In a conversation with FE Blockchain’s Poulami Saha, Rajagopal Menon, Vice President, WazirX, talks about currently which crypto is better to invest in. (Edited excerpts)\n\nWhat makes Bitcoin popular among other cryptos?\n\nDigital currency was introduced in the ’90s. By then people already started experimenting with cryptocurrencies. However, in 2008, Satoshi Nakamoto introduced us to a digital currency that could provide safety and help solve many other problems. Bitcoin is considered as one of the oldest cryptocurrencies. What makes Bitcoin special is that Satoshi Nakamoto created it and left it for growing organically. Apart from that Bitcoin works in a decentralised manner which might not be easy to hack when it comes to safety. Also, its Proof-of-Work (PoW) mechanism adds to its security. Moreover, we can say that Bitcoin is popular for its authenticity.\n\nCan the working mechanism of Bitcoin affect its popularity, when it comes to the ability to adapt to changes?\n\nAdaptation to changes may need the involvement of many hands, which might affect the security of these networks. However, Bitcoin’s decentralised working mechanism does not allow such involvement. Since its creation, nothing has changed and no one can control it. Probably, this makes it one of the safest networks in the blockchain. Therefore, Bitcoin has been able to provide some sort of assurance to its users which I guess contributes to its popularity.\n\nEthereum is supposed to be more versatile then why it’s still in the second position?\n\nThe working mechanism of Ethereum which is Proof-of-Stake (PoS) makes it very adaptive to new technologies such as smart contracts and decentralised applications (dApps) among others. But Ethereum is also considered just as a security network by many. It is a security network that might fluctuate due to its unknown scalability. However, Bitcoin has become more of a commodity. The users are more comfortable using Bitcoins due to their unchangeable monetary value. It is already known that there are about 21 million Bitcoins and its monetary policy can’t be changed.\n\nWith the adoption of automatic technologies and smart contracts do you think Ethereum will lead the crypto market?\n\nThe future of cryptocurrency is quite unpredictable as crypto is a constantly evolving space and the popularity of these cryptocurrencies depends on the purpose that it is used for. Bitcoin promises strong security and storing values and Ether can be considered as the ‘Future of the financial system’. Reportedly, the current Shanghai upgradation seems to have contributed to the popularity of Ether. Experts believe that Ethereum with constant upgradation could create an impact in the long run.\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDQvMjcvZXRoZXJldW0tcHJpY2UtZm9yZWNhc3Rpbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Ethereum price forecasting: will it succeed in flipping Bitcoin? - The Cryptonomist",
        "content": "In this article we will make predictions for the future price of Ethereum, the second largest cryptocurrency by market capitalization.\n\nIn a year that seems to be off to a good start, following a disastrous bear market, ETH looks poised to climb to new heights, and who knows, perhaps to surpass Bitcoin in the rank of the most valuable crypto assets ever.\n\nLet’s shed some light on the situation.\n\nForecasting the price of Ethereum\n\nIn the first quarter of 2023 ETH, the coin that powers the ecosystem of dApps developed on top of Ethereum’s technology, experienced a major price increase taking it from around $1,200 at the start to the current $1,880 at which it is traded on major cryptocurrency exchanges.\n\nIn detail, since January, ETH’s price action has recorded four consecutive monthly green candles, even under the assumption that the coin closes the April candle above $1820.\n\nThis situation has not been seen since 2021, a period in which the price of ETH jumped from $800 up to $2770, and then continued its upward run, albeit with some retracement, to an all-time high of $4868 (spot price of the ETH:USDT pair on Binance)\n\nBeyond the general optimism in the air, Ethereum’s price movement right now seems to resemble that of early 2019, a year that saw a small market recovery after the bear market of 2018, followed by another 6 months of price distribution.\n\nIn this context, history could repeat itself, and if so, ETH would have more time before preparing for the bull run.\n\nThen again, everyone expects a super market recovery and a return to all-time highs for Bitcoin and Ethereum, but as is well known, things always go the other way from popular opinion.\n\nSome prominent figures within the cryptocurrency industry fear a less-than-stellar year for ETH’s value trend, although they argue that the price will not fall below the current $1880 threshold.\n\nIn this regard, Ruadahan O, creator of “Seasonal Tokens” predicted a modest year-end price of $2,200 for ETH. He fears that the Securities and Exchange Commission (SEC) may undermine Ethereum’s success in the United States.\n\n“Ethereum could be classified as a security by the SEC, because Ethereum investors are effectively betting on the future performance of the developers. The New York Attorney General has recently made this argument in a lawsuit against KuCoin, and the SEC may adopt the same argument as it seeks to assert jurisdiction over Ethereum.”\n\nOn the other hand, some like Aaron Rafferty, CEO and co-founder of StandardDAO, are optimistic that US authorities, such as the CTFC, will classify ETH as a commodity rather than a security, inspired by what is happening in Europe with the MiCA regulation.\n\n“If Ethereum is regulated as a commodity as the EU MiCA regulations would lead us to believe, then expect to see a significant jump given its current market dominance as the number one settlement layer for dApps.”\n\nWill Ethereum be able to surpass Bitcoin in market capitalization?\n\nMany believe that sooner or later Ethereum will succeed in flipping Bitcoin by market capitalization, effectively becoming the #1 cryptocurrency in the market.\n\nThe ecosystem that Vitalik Buterin has developed in recent years is much more full of projects and innovation than the one created and then “abandoned” by Satoshi Nakamoto more than 10 years ago.\n\nJust think of the smart contract factor, which is still absent in Bitcoin, except with a few digital artifacts.\n\nAs for functionality, Sathvik Vishwanath, project manager of “Crynet marketing solutions” reminds investors.\n\n“Ethereum’s blockchain technology allows for decentralized applications and smart contracts, which opens up new possibilities for industries like finance, real estate, and gaming. Additionally, ETH’s value is tied to its usage on the Ethereum network, which is increasingly being adopted by businesses and individuals.”\n\nThen again, Bitcoin turns out to be the most decentralized crypto in the world, which can boast precisely on the fact that there is no entity that controls or governs the network, something that cannot be said for ETH, which fortunately/unfortunately is supported by the Ethereum Foundation, even though it represents a decentralized blockchain among the network’s many, many nodes.\n\nIt is not easy to predict whether the digital token used to pay gas fees by users, will succeed in surpassing the digital gold Bitcoin, and it will be necessary to watch the progress of crypto regulations in the US and Europe regarding the future of the DeFi world, the beating heart of the Ethereum ecosystem to understand whether this niche will become more and more an integral part of everyday financial life.\n\nIf so, and DeFi succeeds in increasing its TVL to significantly higher values, then ETH will probably one day reach the status of the most highly valued cryptocurrency ever.\n\nContinuing on this very sensitive issue that is being discussed within the crypto world community, according to a survey conducted by Finder which polled 32 fintech specialists in April 2023, most respondents doubt that ETH will surpass BTC in market capitalization.\n\n47% do not believe Ethereum will surpass Bitcoin, while 20% are unsure.\n\n13% believe Ethereum will surpass Bitcoin by 2025, while 17% think it will take until 2030.\n\nAs for factors that could influence this, the regulatory landscape in the United States continues to seem like a big issue.\n\nHow to make short- and long-term predictions for the price of Ethereum\n\nMaking predictions about the future of crypto is always very difficult, given the multitude of variables in the financial markets and given the great volatility inherent within this world.\n\nMoreover, there is a big difference between forecasts that are made in the short term and those made in the long term: those in the short term are more influenced by technical analysis and market news, while those in the long term see fundamental analysis as the main vector.\n\nSpeaking of news and price analysis Nicole DeCicco, CEO of CryptoConsultz, believes that there could be significant volatility for the short-term ETH price, arguing that:\n\n“There’s no debating the fact the upgrade will dump huge sums of ETH into the market freeing up ETH that’s been locked up through staking protocols. Assuming this is a non-event is akin to putting one’s head in the sandbox, pun intended. What these long-term investors plan to do with that ETH in the short term remains unknown but I wouldn’t be surprised if there’s a negative impact on the price of ETH for those with a short-sighted outlook.”\n\nInstead, by looking at one of the indicators most valued by traders, namely the “supertrend,” which identifies periods when the price of an asset is most likely to run up or down, we can see that we are at the beginning of a period that looks set to see Ethereum’s future price increase.\n\nThen again, it is important to understand that this indicator arrives slightly later than the price movement of the markets and could be confusing if the results are observed early on\n\nAs for the fundamental analysis on Ethereum, there is not much to say except that it turns out to be one of the most thriving ecosystems with the most innovation in the entire crypto world.\n\nNumerous scaling solutions such as “zk rollups” are making their debut on the industry, increasing the potential amount of transactions that can take place on the L1 and increasing scalability.\n\nBy now, the whole world, when thinking about developing an ecosystem of dApps that rely on blockchain, chooses to use the Ethereum network because of the security standards it offers and the decentralization represented by the distribution of the network’s nodes.\n\nThis must make us think about what the future of Ethereum might be 10 to 15 years from now.\n\nIt is hard to define it with certainty, but if imagined, it certainly looks like a bright future."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3NvbGFuYXMtcGhhbnRvbS13YWxsZXQtYWRkaW5nLWV0aGVyZXVtLXBvbHlnb24v0gFOaHR0cHM6Ly93d3cudHJvbndlZWtseS5jb20vc29sYW5hcy1waGFudG9tLXdhbGxldC1hZGRpbmctZXRoZXJldW0tcG9seWdvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Solana's Phantom Wallet Goes Multichain: Adding Ethereum & Polygon Support - TronWeekly",
        "content": "Phantom, a popular crypto wallet for the Solana blockchain, is set to expand its offerings to include support for the Ethereum and Polygon blockchains, according to the report.\n\nThe company announced that the public launch of the multichain integration will take place on May 1, 2023, at 9 a.m. EST, across browsers, iOS, and Android.\n\nThe integration, which was scheduled to be geared up in the first quarter of 2023, is now available to Phantom’s three million customers.\n\nBy adding support for Ethereum and Polygon, Phantom users will now be able to transfer assets across blockchains, dApps, and NFT marketplaces, as per the report.\n\nExisting assets from MetaMask, Solana, or Ethereum Virtual Machine (EVM) wallets will also be able to be imported. The wallet will also have advanced NFT information, such as current floor and selling prices.\n\nPhantom is focused on user safety and is adding new features to help prevent phishing attempts. The wallet will simulate transactions before they are approved, so users can see what they are sending and receiving, and it will warn users about malicious websites.\n\nIn addition, Phantom has a customer support team that is available 24/7 to assist users who have been phished or hacked. Phantom’s expansion to multiple blockchains speaks to the growing potential for a multichain world.\n\nFurthermore, its new capability could allow dApps and other projects to interact with consumers in a more seamless way. Phantom’s support for Ethereum and Polygon will expand its reach beyond the millions of users in the Solana ecosystem.\n\nSolana (SOL) Price Analysis\n\nThe news of the Solana wallet to include support for the Ethereum and Polygon blockchains didn’t yet cause any significant spike in the value of SOL.\n\nAccording to CoinMarketcap, the token is presently being traded at $21.76, with a decrease of 1.30% in the last 24 hours and 5% in the last seven-day chart.\n\nSource: CoinMarketcap\n\nHowever, yesterday SOL was making waves in the market, as reported by TronWeekly. The market cap across all cryptocurrencies increased by 6.61% over the last day, and SOL’s value increased by 8.78% over the same period yesterday.\n\nRelated Reading | Dogecoin Creator Speaks Out: No Professional Involvement, “Literally Don’t Care”"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2hvdy1kZXZlbG9wZXJzLXJldHJpZXZlLWV0aC1zZXBvbGlhLXRlc3RuZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "How Can Developers Retrieve ETH from Ethereum's Sepolia Testnet? - Cryptopolitan",
        "content": "Testnets are valuable tools for Web3 developers to test their projects in a secure environment before launching on a mainnet. The Ethereum community has two central public testnets, including Sepolia, which can save blockchain developers’ time and resources. In this article, we will delve into Sepolia, which is one of Ethereum’s most significant proof-of-stake (PoS) testnets.\n\nThe article will start by explaining the details of Sepolia and the importance of a testnet. It will then give a brief guide on how developers can obtain Sepolia testnet ETH to pay for transactions on the network. The article will also compare Sepolia to other testnets, like Goerli, which is also maintained by the Ethereum community. Finally, the article will discuss Sepolia Etherscan, a blockchain explorer for the Sepolia testnet.\n\nWhat are testnets and why do we need them?\n\nTestnets are experimental versions of blockchain networks that imitate the real networks they are associated with. They work on different ledgers, so any currency used there has no connection to the actual transactions and values on the real network. Such a setup allows developers to test their projects on a proper blockchain environment without facing the risk of costly mistakes on the real network.\n\nDevelopers prioritize security when working on decentralized platforms, and using a testnet allows them to investigate vulnerabilities and learn about the platform. Testnets for pre-network upgrades enable investigation of newly developed changes before merging them with the mainnet.\n\nDifferences between testnet and mainnet\n\nBoth blockchain and crypto are important in their own ways. However, it’s necessary to differentiate between the two based on the following factors.\n\nObjectives\n\nDevelopers building blockchain networks prioritize building testnets. Testnets are primarily used by developers to experiment with their blockchain network, dApp or smart contract before making it live.\n\nOne benefit for developers is being able to test new concepts in an environment similar to the real-world deployment of their solutions. Meanwhile, the mainnet provides important advantages for users who are designing contracts, developing dApps, and making transactions. Because upgrades or modifications could potentially cause changes to user accounts, transactions on the mainnet are inherently secure.\n\n\n\nSecurity\n\nThe discrepancies between testnet and mainnet highlight the importance of security on mainnet, which varies depending on the blockchain network and consensus mechanism design. Furthermore, mainnet provides superior security because the tokens or cryptocurrency have tangible value for storage and transactions. The mainnet uses encryption, undergoes smart contract audits, and follows consensus mechanisms to ensure security. The testnet relies on the security features of the mainnet, and the safety of the system is determined by how the codebase is scripted.\n\nTraits\n\nThe comparison between testnet and mainnet will focus on their differing traits and features, including the interfaces used to access them. Mainnets typically see a higher frequency of transactions than testnets. Comparing the crypto mainnet with the testnet would show if the testnet limits operations to a few nodes. Remember that testnets are still being developed and have less user-friendly interfaces. One advantage of testnets is that the tokens used have no actual value, which helps reduce transaction fees.\n\nMining\n\nThe main difference between mainnet and testnet is that developers can earn real cryptocurrency through mining on the mainnet, while testnets do not provide any economic benefits for mining new crypto tokens.\n\n\n\nNetwork IDs\n\nWhen discussing the differences between mainnet and testnet, one important factor to consider is network IDs. These IDs help developers identify a specific network. For example, Ethereum’s mainnet has a network ID of 1, while testnets like Ropsten and Rinkeby have network IDs of 3 and 4.\n\nCoins\n\nThe digital currency that exists on the blockchain network is known as cryptocurrency and it has actual value. It can be utilized to pay for transactions on the mainnet. On the other hand, the coins that exist on a testnet are not real. So, when it comes to performing transactions, the mainnet requires genuine tokens whereas the testnet doesn’t require any fees.\n\nWhat is the Sepolia Testnet?\n\nSepolia is a PoS testnet for Ethereum that was introduced in October 2021. It is one of two primary testnets that have not been deprecated along with Goerli. Sepolia is currently being maintained by client developers, which makes it a safe and reliable testing environment.\n\nIn 2021, Sepolia used a proof-of-work (PoW) consensus mechanism at launch. However, they later merged with the PoS Sepolia Beacon Chain after The Merge. Now, they use a PoS consensus mechanism similar to the Ethereum mainnet. This makes Sepolia a suitable environment for testing smart contracts and dapps, just like the Ethereum mainnet.\n\nWhy is a testnet like Sepolia necessary? Well, when you perform transactions on the blockchain, you need to pay for gas. Developing dapps and other blockchain projects directly on Ethereum’s mainnet can be expensive due to the gas costs. So, testnets like Sepolia are used to create a more cost-effective and smoother development experience for blockchain developers.\n\nDevelopers can use Sepolia as a testing ground for their Web3 projects. Sepolia is very similar to Ethereum, and this allows developers to design, create, test, and monitor their project’s public performance before launching it on the Ethereum mainnet.\n\nIn order to perform transactions on the Sepolia testnet, you will need to use Sepolia testnet ETH as gas. To obtain these tokens, you can use a faucet for free. But first, you must add the Sepolia testnet network to your wallet.\n\nIn order to add this network, you must include specific details such as the Sepolia chain ID and network name in your wallet. The Sepolia chain ID (11155111) is crucial because it distinguishes the Sepolia chain from other testnet networks. Although the Sepolia testnet is already included by default in MetaMask, we will provide an example of how to add the network to your wallet using the Sepolia network details.\n\n\n\nFor MetaMask, open your wallet and select the “Ethereum Mainnet” button.\n\nimage 629\n\nNow click on the “Add network” button. This will allow you to manually add any network of your choice.\n\nimage 630\n\nNow choose “Add a network manually”.\n\nimage 631\n\nEnter the following details to add the Sepiola testnet:\n\n\n\nNetwork Name: Sepolia test network\n\nNew RPC URL: https://sepolia.infura.io/v3/\n\nChain ID: 11155111\n\nCurrency Symbol: SepoliaETH\n\nNext, we will learn how to obtain Sepolia testnet ETH by using a Sepolia faucet after incorporating some details from its network.\n\nDevelopers can obtain Sepolia testnet ETH by using a Sepolia testnet faucet. This will allow them to receive small amounts of Sepolia ETH in their wallets, which they can use to pay for transactions on the Sepolia testnet. These testnet tokens have the same functionality as real ETH on the Ethereum mainnet. The best part is that anyone can use this service.\n\n\n\nJust follow these simple steps:\n\nGo to https://faucet.sepolia.dev Enter the wallet address to receive Sepiola testnet ETH Verify the captcha and click the ”Request funds” button\n\nimage 632\n\nAfter clicking on the “Request funds” button, a pop-up window will appear with a “Transaction sent” message and the amount of Sepolia testnet ETH sent to your wallet. This means you now have Sepolia ETH and can start using it to run smart contracts on the testnet.\n\nHow Does Sepolia Differ From Other Testnets?\n\nLet’s compare Sepolia testnet to other testnets you may have encountered during your Web3 development journey. After learning more about Sepolia, including how to obtain testnet ETH, we can examine its unique characteristics. So, the question is, “What makes Sepolia different from other testnets?” Let’s find out.\n\nPreviously, Ethereum had multiple testnets, like Ropsten, Rinkeby, Kovan, and more. But these testnets, along with others, are now obsolete. When a testnet becomes deprecated, the community no longer provides client updates, which causes the network to fall out of sync with Ethereum Virtual Machine (EVM). Consequently, outdated testnets are no longer reliable or secure testing grounds for dapps and other Web3 projects.\n\nSepolia is a testnet that is different from Ropsten, Rinkeby, Kovan, etc. because it is not deprecated and is still maintained by the Ethereum community.\n\nAnother testnet maintained by the Ethereum community is Goerli, which can be used for Web3 development along with Sepolia. In order to compare these two networks, we first need to understand what the Goerli testnet is.\n\nIn 2018, Goerli was introduced as one of Ethereum’s major testnets, alongside Sepolia. It began as a project at ETHBerlin hackathon, but was officially launched at GörliCon in Berlin in 2019. The Ethereum community maintains Goerli, just like Sepolia, unlike other important testnets that have been deprecated, as mentioned before.\n\nWhen it was launched, Goerli was the inaugural Ethereum testnet built by the community that utilized proof-of-authority (PoA) and allowed for cross-client functionality. However, similar to Sepolia, Goerli changed its consensus mechanism to PoS when it joined forces with Beacon Chain during The Merge.\n\nOne of the significant strengths of the Goerli testnet is its cross-client functionality. This means that developers can use different programming languages to interact with the network, thanks to the various clients maintained by the Ethereum Foundation, for languages like Java, Rust, Go, C#, and others. Unlike other testnets like Rinkeby and Kovan, which support only one client, the Goerli testnet supports multiple clients.\n\nThe benefits of Sepiola Testnet\n\nWith the evolution of the blockchain ecosystem, developers are constantly in search of new testnets to experiment with and refine their innovations. Let’s look at some of the most prominent benefits of the Sepiola testnet.\n\nScalability and Performance\n\nOne of the major challenges that have long plagued blockchain networks is scalability. The Sepiola Testnet addresses this issue head-on, thanks to its innovative architecture that allows for a high throughput of transactions. This not only leads to a more efficient network but also makes it feasible to run complex applications and smart contracts on the platform.\n\nEnhanced Security Measures\n\nThe Sepiola Testnet boasts advanced cryptographic techniques that protect user privacy and secure sensitive data. This not only instills confidence in developers and users alike but also paves the way for the deployment of privacy-centric applications on the platform.\n\nUser-Friendly Environment\n\nhe Sepiola Testnet offers an environment where developers can safely test their applications and smart contracts before deploying them on the mainnet. This enables developers to identify and address any potential issues or vulnerabilities before their projects go live, ensuring a more secure and reliable end product.\n\nVibrant Community and Ecosystem\n\nAnother key advantage of the Sepiola Testnet is its thriving community, which plays an instrumental role in fostering innovation and collaboration. By actively participating in the community, developers can exchange ideas, seek advice, and share their experiences with like-minded peers.\n\nThe Sepiola ecosystem also includes a growing number of partners, ranging from established blockchain projects to cutting-edge startups. These partnerships not only validate the platform’s potential but also create synergies and opportunities for collaboration, further enhancing the overall value proposition of the Sepiola Testnet.\n\nOngoing Development and Improvement\n\nIt is backed by a dedicated team of developers who are committed to continuously refining and enhancing the platform. This ensures that Sepiola remains at the forefront of the blockchain industry and is well-equipped to adapt to the ever-evolving needs and requirements of developers and users alike.\n\nThe Sepiola team actively encourages feedback from the community, taking user input into account when shaping the platform’s future roadmap. This open and collaborative approach ensures that the Sepiola Testnet remains closely aligned with the needs of its user base, making it a truly user-centric platform.\n\nConclusion\n\nThe Ethereum Sepolia Testnet provides developers and users the opportunity to experiment with and refine blockchain projects. As a complete guide to this innovative test network, we’ve explored its numerous benefits, from scalability and performance to a thriving community and ongoing development. With such a promising foundation, the Sepolia Testnet is playing a big role in the blockchain industry."
    }
]