[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kb3JtYW50LWV0aGVyZXVtLWljby13YWxsZXQtYXdha2VuLXllYXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Another dormant Ethereum wallet reawakens after 8 years, moving millions - Cointelegraph",
        "content": "An Ether (ETH) wallet that has been inactive in 2015 has suddenly awoken after eight years of dormancy, moving a total of 8,000 ETH in just two minutes.\n\nThe wallet received 8,000 ETH after participating in Ethereum’s ICO (initial coin offering) in 2015 and remained inactive until May 27. On that day, its owner began with a cautionary transfer of 1 ETH to a new wallet. One minute later, they transferred the remaining 7,999 ETH to the new wallet address.\n\nAt the time of writing, the ETH stash is worth approximately $14.7 million.\n\nThis transaction was first noticed by blockchain analytics service Lookonchain, which informed its 219,000 Twitter followers of the transfer.\n\nAn Ethereum ICO participant who has been dormant for 8 years woke up today.\n\n\n\nHe transferred all 8000 $ETH($14.7M) to a new address.https://t.co/1griKB9Te9 pic.twitter.com/1bvQh3zsqY — Lookonchain (@lookonchain) May 28, 2023\n\nIn the comments section of the post, there was some community speculation around the reason for the transfer. One commenter suggested that the owner had just been released from prison, while another made a humorous remark that they were transferring funds from an old Ledger — a pointed comment about the company’s controversial new Recover upgrade.\n\nAt the time, the 8,000 ETH was purchased at a price of just $0.31 per token, which places the initial investment amount at around $2,500.\n\nAt today’s prices of $1,917, this marks a staggering 590,000% gain for the owner.\n\nThis isn’t the only ICO-era Ether wallet to re-awaken in recent months. On April 24, another wallet that received 2,365 ETH ($4.5 million) made its first transaction in nearly eight years, with the owner transferring 2,360 ETH to a new wallet address.\n\nOn March 5, another ETH wallet transferred 10,226 ETH ($19.6 million) out to new wallet address after remaining dormant for five years.\n\nThe new wallet address is also one with little in the way of any significant transaction history. The only other ETH transaction recorded in the new wallet is a 207 ETH ($380,000) incoming transaction that was made just a few minutes prior to the most recent transfer. Notably, the additional 207 ETH were sent from another wallet that had remained completely inactive since June 12, 2017.\n\nRelated: Arbitrum-based Jimbos Protocol hacked, losing $7.5M in Ether\n\nInterestingly, the new wallet also contains $46 worth of a memecoin called Gensler (GENSLR), and just $0.24 worth of a dragon-inspired token called Dejitaru Tsuka (TSUKA), according to data from Web3 wallet tracker DeBank.\n\nTotal allocation of token holdings in the owner’s new wallet. Source: DeBank\n\nThe Ethereum ICO occurred raised $18 million in two stages between July and September of 2014. The going exchange rate for the pre-sale was 1 Bitcoin for 2,000 ETH. The Ethereum blockchain was not launched until July 30, 2015, meaning that investors had to wait for more than a year to be able to redeem and use their Ether.\n\nDormant wallets with vast sums of crypto can awaken for a variety of reasons. Sometimes dormant wallets reawaken because they’ve been hacked. Other times, it's simply because the owner may have forgotten about it and upon its re-discovery, have decided that it's possibly a good time to sell.\n\nCrypto City: Guide to Osaka, Japan’s second-biggest city"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vbW9kZXJuZGlwbG9tYWN5LmV1LzIwMjMvMDUvMjkvZXRoLXByaWNlLXByZWRpY3Rpb25zLWFuZC11cGdyYWRlcy1mb3ItZXRoZXJldW0taW4tdGhlLWZ1dHVyZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "ETH Price Predictions and Upgrades for Ethereum in the Future - Modern Diplomacy",
        "content": "Excerpt: If one assumes a steep, monotonic increase in price for Ethereum, along with a natural expansion of the network across several other countries, the price of Ethereum will likely touch $16,024.42 by the end of 2030.\n\nEthereum, which is the second-largest cryptocurrency by market cap, has become a vital part of the decentralized finance (DeFi) and Non-Fungible Tokens (NFT) environments. Ethereum, with its indigenous currency Ether (ETH), has suffered massive instability and growth over the years.\n\nDeFi and NFTs have earned significant traction and have massively contributed to Ethereum’s valuation. DeFi proposes several financial services while NFT is a class of digital collectibles that represent exclusive ownership of assets. Both DeFi and NFT significantly depend on Ethereum’s smart contract feature, making Ethereum a vital component of the digital markets.\n\nSeveral factors can change the price of Ethereum. For example, factors such as market demand, regulatory developments, technological advancements, and macroeconomic trends. Below are some of the price predictions for the upcoming years.\n\nEthereum (ETH) Price Prediction from 2023 -2030\n\nThe entire of 2023 will be spent recovering from the crypto winter. Ethereum is estimated to touch $3,277.72, and the minimum price can be predicted at $2,185.15. The average price for the years should hover around $2,731.44. Ethereum is predicted to achieve newer heights in 2024 and present an average price of $4,552.39. In 2025, Ethereum is expected to increase to an average of $6,373.35.\n\nIf one assumes a steep, monotonic increase in price for Ethereum, along with a natural expansion of the network across several other countries, the price of Ethereum will likely touch $16,024.42 by the end of 2030. Moreover, the average price of the token will steady itself at $15,478.14. The major bull run over the past five-six years is likely to uphold the market sentiment and hence, the price of Ethereum will rise accordingly.\n\nSeveral other price predictions for Ethereum in the future are provided below.\n\nEthereum prediction by Raoul Pal\n\nThe Chief Executive Officer of Real Vision Group, Raoul Pal says all things positive about Ethereum. In a recent interview, he estimated that Ethereum would reach $20,000 by the end of 2023, and would be a significant hike from its present price.\n\nEthereum Prediction by Michael Van de Poppe\n\nAccording to crypto analyst and trader Michael Van De Poppe, Ethereum could achieve a price between $2700 and $3000 in the next couple of months. His estimates are based on the increasing adoption of DeFi and NFTs along with Ethereum’s incoming upgrades.\n\nEthereum’s Upgrade and its Impact\n\nEtereum 2.0 is a network upgrade that is focused on enhancing the platform’s scalability, privacy, and energy efficiency. This upgrade is highly anticipated by the blockchain community and hence, can have a massive impact on Ethereum’s price.\n\nEthereum 2.0 is a series of upgrades curated to make Ethereum more scalable and secure. Essentially, the Ethereum network’s upgrade revolves around transitioning from the current Proof of Work (PoW) consensus mechanism to the Proof of Stake (PoS) model. PoS, which is a way to validate transactions on the blockchain, makes the network more energy-efficient and environment-friendly than the PoW model. This transition has gained traction from several investors and crypto enthusiasts who are environment-conscious and want to use a network that is easy on the planet.\n\nSince the most recent Ethereum upgrade uses lesser gas fees, it shall be assumed as the next blockchain of choice. Moreover, the network upgrades enhance the network’s scalability via the application of sharding and several other optimizations. This will enable more transactions per second while lessening the congestion.\n\nIn the future, the price predictions are estimated to be bullish, however, the crypto market has shown its instability over the past few years and nothing can be estimated with utmost guarantee."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYW5kLWV0aGVyZXVtLXR3by10aXRhbnMtYmF0dGxlLWZvci1uZnQtc3VwcmVtYWN5L9IBUmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYW5kLWV0aGVyZXVtLXR3by10aXRhbnMtYmF0dGxlLWZvci1uZnQtc3VwcmVtYWN5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum: Two titans battle for NFT supremacy - Forkast News",
        "content": "This past weekend, two major cryptocurrency/non-fungible tokens events happened, Veecon Indianapolis 2023 and the BTC Miami/Ordinals Conference 2023.\n\nI chose to go to Indianapolis to meet my colleagues whom I’ve worked with for almost three years without meeting them in real life.\n\nAt one point, as I was walking back to the hotel on the streets of Indianapolis, it became apparent to me that there was a split in the NFT community. One was the “status quo” ETH-based community that’s in the pre-teen stage meeting up at Veecon, and the other was a newly birthed baby in Miami at BTC Miami/Ordinals 2023.\n\nAt Forkast Labs , we work on CryptoSlam.io to “unite the NFT community.” Ever since our co-founder Randy Wasinger added Loom (Sorare), Flow and WAX chains, alongside Ethereum in early 2021, we have always strived to include all new and relevant chains that we can.\n\nI also met loads of NFT industry celebs, including Richerd Chan from Manifold.xyz , who has created some of the most used Ethereum smart contracts in the NFT industry. He had actually reached out to me in 2020 through a client at the time and we had only talked online, but never met in person, and now he had so many folks around him that I could only briefly speak with him.\n\nAs an epic Ethereum NFT celebrity and developer, I decided to ask him a very telling question: “Are you developing for Bitcoin?”\n\nHis response made it clear that he wasn’t and had no intention of doing so at the moment. He posed a great question in return: “Is the BTC community even supporting Ordinals?”\n\nIt’s a great question, to be honest.\n\nIn Miami, it seems that the main theme revolves around the “laser-eyed maxis” who view Bitcoin as having a single use case: being “better money” and a store of value that shouldn’t be tampered with.\n\nOn the other hand, the new Ordinal crew, represented by individuals like @rodarmor , @TO , @LeonidasNFT and @udiwertheimer , are leading the charge on alternative use cases such as digital artifacts (NFTs) and BRC-20s, which are the bitcoin equivalent of fungible tokens like ETH and BTC.\n\nThe latest rankings on CryptoSlam.io show that $OXBT and $ORDI are in the top 10, indicating the rapid rise of Bitcoin in the scene.\n\nPersonally, I have never seen an ecosystem boot up this fast, except for NFTs in 2020-2021, and I would argue that it’s even moving faster this time around.\n\nThe Bitcoin market cap of over US$500 billion is more than double the Ethereum currency market cap of over US$200 billion. The Bitcoin protocol may be better suited to certain types of NFTs, ones that see immutability and scarcity as features instead of weaknesses.\n\nFundamentally, there is a big difference forming between what we are seeing on ETH and what we are seeing on BTC. The community is splitting into people who value UX, and corporate partners and one who values ultimate security/scarcity and immutability. While I think there are strengths to each, there IS a place for both.\n\nNet new people are coming into the “NFT” ecosystem, even if they will only trade Ordinals on BTC or BRC-20s, and they are really small in numbers, they are net new people. What will happen when the Michael Saylors of the world see the value in Ordinal theory, and its burgeoning use cases on BTC?\n\nSaylor talks about why Ordinals & Inscriptions are an important conversation, saying 👇\n\n\n\n\"If I were to discourage application development, I would be destroying the Bitcoin mining network.\" pic.twitter.com/i2xAayWREz — trevor.btc @ NYC (@TO) May 21, 2023\n\nThe NFT ecosystem, while can be seen as splitting, is actually growing and innovating, and while Taylor Swift fans are not coming in en masse, the core set of people who see the future of this technology is more excited about the growth of this industry than ever before."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2FsdGNvaW5zL2xpdGVjb2luLXZzLWJpdGNvaW4tdnMtZXRoZXJldW0tZGlmZmVyZW5jZXMtY29tcGFyaXNvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Litecoin vs. Bitcoin vs. Ethereum: What are the Differences? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA1LzI5L2RvZXMtdGhpcy1uZXctZXRoZXJldW0tcml2YWwtcmVhbGx5LWhhdmUtNDAweC11cHNpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Does This New Ethereum Rival Really Have 400x Upside Potential? - The Motley Fool",
        "content": "Ethereum (ETH 0.03%) remains one of the great all-time crypto investments. If you had invested in Ethereum way back in 2015 when things were just getting started, you'd be up a head-spinning 63,500% today.\n\nSo it's perhaps no surprise that the arrival of what some are calling the next Ethereum is cause for celebration in the crypto world. We've seen that already with the likes of Solana and Avalanche -- both were tagged as potential Ethereum killers almost as soon as they launched. And we are starting to see the same phenomenon with Sui (CRYPTO: SUI), a highly touted Layer-1 blockchain that just launched in May.\n\nWhat is Sui?\n\nSui is a super-fast, super-scalable proof-of-stake Layer-1 blockchain with a nearly impeccable pedigree. Many of the developers at Sui worked on Diem, the big blockchain project from Meta Platforms. And the founders of Sui have already lined up more than $330 million in venture capital from some high-profile names, including Coinbase Ventures.\n\nThe big draw right now seems to be Sui's transaction processing speed. The blockchain claims to be able to process up to 300,000 transactions per second (TPS), which is way beyond what even Solana (65,000 TPS) can offer. Moreover, the developer team behind Sui claims the blockchain is optimized for digital assets and the brave new world of Web3, due in large part to the programming language they use.\n\nHow high can Sui go?\n\nA little market cap comparison will give you a good idea of how high Sui could soar. Right now, it has a market cap of slightly over $500 million. So if it does a 10 times return on investment, it would give Sui a market cap of approximately $5 billion -- that's Solana and Avalanche territory. Currently, Solana has a market cap of $7.7 billion, and Avalanche's is $4.7 billion.\n\nBut let's say Sui eventually replaces Ethereum simply based on its superior performance characteristics. That's when things will really get interesting. Ethereum has a market cap of more than $200 billion right now, so if Sui ever catches up to Ethereum, that would be a 400-fold return on investment. You can start to see why investors love the concept of the next Ethereum -- the numbers get very big quickly.\n\nIn many ways, this same logic has already played out with Aptos (APT -1.04%), which was introduced in October 2022. Aptos was the other major blockchain project spun out of Diem, and like Sui, it came with an impeccable pedigree, top developer talent, and high-profile venture capital backing. Despite practically launching into the eye of a tornado (the FTX debacle in November 2022), Aptos is now up a staggering 125% year to date and is already one of the top 40 cryptos in the world by market capitalization.\n\nBut do we really need another Ethereum?\n\nThe big question, of course, is whether the blockchain world needs another Ethereum. At one time, we did, because Ethereum was still a slow, old-fashioned proof-of-work blockchain. But then came The Merge last year, and as a result, I'm not convinced we really need another Ethereum. Many speed and performance issues have now been addressed, and Ethereum pulled off The Merge without a hitch.\n\nSo for Sui to hit all its grandiose growth targets, many things would have to go right. For one, developers would have to perceive a real need to abandon Ethereum and switch to another blockchain for all their future development projects. I don't think that's going to happen. Moreover, Sui would have to beat out not just Ethereum but also a long list of previous Ethereum-killers, including (but not limited to) Solana, Avalanche, and now Aptos. That's a big ask.\n\nIt's still Ethereum, and it's not even close\n\nFor now, I cannot recommend Sui as a long-term investment. It's certainly interesting because of its price (still trading for around $1) and pedigree. But I just don't think faster speeds are enough to win over developers, users, and investors.\n\nAt the end of the day, people want to see what's built on top of the platform, and right now, you just can't beat Ethereum, which is dominant in many key areas of the blockchain world. Ethereum is still the world's premier Layer-1 blockchain. As a result, I remain bullish on Ethereum, both short-term and long-term."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA1LzI4LzUxMDAwLWV0aGVyZXVtLWV0aC1ub3ctb24tdGhlLXRhYmxlLWFjY29yZGluZy10by12YW5lY2staGVyZXMtdGhlaXItb3V0bG9vay_SAXFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8yOC81MTAwMC1ldGhlcmV1bS1ldGgtbm93LW9uLXRoZS10YWJsZS1hY2NvcmRpbmctdG8tdmFuZWNrLWhlcmVzLXRoZWlyLW91dGxvb2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "$51,000 Ethereum (ETH) Now on the Table, According to VanEck – Here’s Their Outlook - The Daily Hodl",
        "content": "Global investment manager VanEck says Ethereum (ETH) could hit $51,000 in less than seven years if certain conditions align.\n\nIn a new research report, VanEck lays out its base, bear and bull cases for Ethereum’s performance going into the end of the decade.\n\nVanEck explains its methodology in finding its estimates:\n\n“We base these estimates on the thesis that Ethereum becomes the dominant open-source global settlement network that hosts substantial portions of the commercial activity of business sectors with the highest potential to gain from moving their business functions to public blockchains. In a portfolio of similar smart contract platforms, we assume to own a collection of call options, with the dominant platform likely to take a majority market share.”\n\nAssuming that Ethereum is no longer the top settlement system or smart contract platform with only 15% dominance, VanEck says ETH could disintegrate as low as $343.29 by 2030 in its bear case.\n\nHowever, if things go well for Ethereum, VanEck lays out a base case price target of $11,848.62 and a bull case of $51,006.\n\nThe firm says that Ethereum is likely en route to becoming a store-of-value asset, similar to Bitcoin but perhaps in a slightly different manner.\n\n“Finally, we assert that ETH is evolving beyond a transactional currency or a consumable commodity like oil or natural gas. We believe that ETH, while not a complete store of value like Bitcoin due to Ethereum’s demonstrated mutability of code and an evolving social consensus focused on utility, will nevertheless become a store-of-value asset for state actors looking to maximize human capital (vs. Bitcoin, which maximizes for stranded energy).”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tbmVhcnMtdmlzYS1pbi1wcm9jZXNzZWQtdHJhbnNhY3Rpb24tdm9sdW1lLXdoYXQtdGhpcy1tZWFucy0yMDIzMDUyOTIxMzXSAYMBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tbmVhcnMtdmlzYS1pbi1wcm9jZXNzZWQtdHJhbnNhY3Rpb24tdm9sdW1lLXdoYXQtdGhpcy1tZWFucy0yMDIzMDUyOTIxMzU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum nears Visa in processed transaction volume, what this means - FXStreet",
        "content": "Share:\n\nEthereum almost caught up with Visa in processed transaction volume, recording $3.01 trillion vs. $3.08 trillion respectively.\n\nThe popular blockchain is already the network of choice for many established players looking to utilize the novel technology, Visa included.\n\nNotably, Ethereum is far younger than the traditional payments giant.\n\nThe report attests to growth in mainstream adoption of crypto and blockchain, despite association with scammers, drug dealers, and cybercriminals.\n\nEthereum (ETH), though younger than traditional payment moguls like Visa, has shown that blockchain has become a formidable force in the financial market for the second time in three years. The news comes after a Coingraph report indicating that the Ethereum blockchain recorded a trading volume of $3.01 trillion against Visa's $3.08 trillion.\n\nJUST IN: $ETH almost caught up with Visa in processed transaction volume - $3.01 trillion vs. $3.08 trillion, respectively. — Coingraph | News (@CoingraphNews) May 29, 2023\n\nEthereum premiered in 2016, 58 years after Bank of America (BofA) founded Visa as the BankAmericard credit card program.\n\nAlso Read: Ethereum ZK rollups eye Arbitrum's market share as adoption rises\n\nEthereum almost caught up with Visa in processed transaction volume\n\nEthereum (ETH) blockchain has recorded a massive $3.01 trillion trading volume, only about 0.07 trillion less than Visa. The competition is remarkable, especially for Ethereum, because of the bearish market since mid-2022.\n\nWith this information, Ethereum testifies to the growth in blockchain technology so much that it can now rival established players within the payments technology space. It also evidences the growth in mainstream adoption of a budding technology often associated with an enabler of crime. This is because scammers, drug dealers, and cyber criminals are now more inclined to digital assets than traditional finance.\n\nBased on Etherscan data, Ethereum daily transactions hit 968,996 on May 28, with the all-time high being 1,932,711 transactions on December 9, 2022.\n\nAlso Read: Ethereum worth $7.5M stolen in Arbitrum-based Jimbos Protocol exploit\n\nAs the second-largest blockchain in the world, Ethereum powers a wide range of financial technology solutions committed to revolutionizing the finance market on a global scale. These solutions include staking, lending, flash loans, and decentralized finance (DeFi).\n\nFurther, the Ethereum blockchain has become a wealthy, agile, and dynamic environment with a wide provision for further development. This is another advantage of Ethereum over traditional financial layers.\n\nEthereum foray into TradeFi\n\nThe famous blockchain is already the choice network for most established traders and investors like Visa, who want to use the novel technology. A May report about Ethereum's economics indicated that Visa employed Ethereum's Goerli testnet to try transaction-free payments using account abstraction.\n\nIt leveraged a smart contract christened 'Paymaster,' which allowed the company to capitalize on account abstraction to perform complex tasks on behalf of accounts and manage transaction costs. Citing Head of Crypto Cuy Sheffield at Visa at the time:\n\nExcited to see Visa deploy our first paymaster smart contract on testnet as we continue to research and experiment with account abstraction and ERC-4337.\n\nERC-4337 is an Ethereum standard that performs account abstraction without a consensus-layer alteration. This allows users to bundle and automate transactions on the network.\n\nEthereum previous triumph over visa: A deep dive into the factors\n\nThis is not the first time Ethereum has shown its gusto against Visa. The blockchain network had outperformed the payments giant in 2021, recording $11.6 trillion against Visa's $10.4 trillion trading volume.\n\nIn 2021, VISA moved $10.4 trillion in payments volume, Ethereum moved $11.6 trillion. — Blockworks (@Blockworks_) January 19, 2022\n\nThis was attributed to the second largest crypto recording 4.5X as many daily transactions as Visa and was corroborated by Ethereum Foundation's Josh Stark.\n\nFUN FACT: #Ethereum processed 4.5x times more transactions than Visa in 2021. — Watcher.Guru (@WatcherGuru) May 6, 2022\n\nDespite the difficult conditions in the crypto market, Ethereum survived through regulatory clampdowns, a myriad of bank crises amidst turbulences in traditional finance, and the ensuing Fear, of Uncertainty and Doubt (FUD). The role of developments and upgrades cannot be ignored as these are the major reasons for ETH high volume transactions. The Merge upgrade and Shanghai/Capella (Shapella) upgrade are among the major upgrades, as they reduced the gas fees and spiked the number of transactions between 2022 and 2023."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY3J5cHRvd2FsbGV0LmNvbS9hY2FkZW15L2V0aGVyZXVtLXZzLWV0aGVyZXVtLWNsYXNzaWMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum vs. Ethereum Classic - CryptoWallet.com",
        "content": "The Ethereum blockchain is the second-largest cryptocurrency worldwide and is home to a diverse collection of dApps, NFTs, and passionate community members. However, many years ago, a major hack resulted in huge controversy within the community. From this controversy, the network split in two, forming two separate chains—Ethereum and Ethereum Classic.\n\nIn this article, we’re going to dive into the history, the controversy, and the fundamental differences between the networks.\n\nEthereum vs. Ethereum Classic\n\nEthereum, a decentralized open-source blockchain platform with smart contract capabilities, is the second-largest cryptocurrency by market capitalization. It is the birthplace of Decentralized Finance (DeFi) and has its own cryptocurrency, Ether (ETH).\n\nConceived by programmer Vitalik Buterin in 2013, Ethereum aimed to create a decentralized and trustless ecosystem that facilitated more than just token trading. With the launch of the Ethereum Virtual Machine (EVM) in 2015 and an Initial Coin Offering that raised $17.3 million, Ethereum became a hugely popular platform due to the ability to run self-executing smart contracts.\n\nSmart contracts enable permissionless transactions, eliminating the need for intermediaries. They facilitate cryptocurrency trading, dApps (Decentralized Applications), and the creation of DAOs (Decentralized Autonomous Organizations).\n\nEther (ETH) serves as the fuel for deploying smart contracts and dApps on Ethereum. Users pay a “gas” fee, determined by network resources and congestion levels. Ethereum also allows for the creation of other tokens, such as ERC-20 tokens adhering to Ethereum’s standards, as well as non-fungible tokens (NFTs) using smart contracts.\n\nEthereum’s innovation fueled the rise of DeFi and the concept of Web 3.0, a decentralized ecosystem free from traditional banking and government regulations. However, in 2016, a DAO called “The DAO” fell victim to a hack of over $60 million. This hack led to the splitting of Ethereum into Ethereum and Ethereum Classic.\n\n2016 Hack\n\nThe DAO was one of the earliest Decentralized Autonomous Organizations founded. It was set up to act as an investor-directed venture capital (VC) fund. The DAO launched a fundraiser to create a decentralized marketplace, one where users could trade anything from houses to cars to services. It garnered a huge amount of hype and raised over $150 million. However, on June 17th, a hacker exploited a security flaw and siphoned 3.6 million ETH (about $60 million at the time) into his own accounts.\n\nThe Ethereum community was shaken badly, and market confidence dipped alongside the price of ETH. Discussions began about the best way to move forward with minimal impact on both the investors and the network while still staying true to the ethos of Web3 and cryptocurrency. Some suggested blacklisting the funds stolen or changing past transactions to return the ethers to the previous owners. Part of their reasoning was that the hack could shake market confidence and that Ethereum could be “too big to fail.”\n\nHowever, other crypto idealists protested, claiming that this ran counter to everything crypto was all about—”code is law”—and to reverse transactions would undermine the entire project and the wider crypto ecosystem. In the end, these two irreconcilable viewpoints resulted in a hard fork.\n\nWhat is a Hard Fork?\n\nA hard fork is a radical and permanent change to the protocol of a blockchain that results in the chain splitting off into two branches. One blockchain continues on with the original rules, while the other adopts a new set of rules and forms a new blockchain. It’s normally the result of a disagreement within the community or the development team. Hard forks are sometimes planned well in advance after long discussions or can happen rapidly due to unexpected events.\n\nEthereum vs. Ethereum Classic Hard Fork\n\nAfter much debate, the Ethereum blockchain underwent a hard fork on July 20th. It essentially rolled back the transaction history to before the hack—returning funds to the original holders. This was extremely contentious as blockchains are meant to be immutable—it shouldn’t be possible to reverse transactions.\n\nThose who refused to support this hard fork formed Ethereum Classic—a blockchain where the hack still happened (although the value was much less). This network was composed of a much smaller community, and the value of the token, ETC, has remained much lower than ETH since its inception.\n\nEthereum vs Ethereum Classic Comparison\n\nWhile the two chains were once the same, they have gone in quite different directions since the hard fork. Ethereum Classic has prioritized immutability and adhering strictly to the original rules. Ethereum, on the other hand, has focused on growth and development with a little bend to the rules when required. The table below shows some of the core differences. We’ll also dive into some of the fundamental differences in how each blockchain operates and the roadmaps they have planned.\n\nEthereum Ethereum Classic Token ETH ETC Supply Unlimited (4.5% max per year) Fixed Supply (230million) Mining Method Proof-of-Stake (PoS) Proof-of-Work (PoW) Immutability Possible to change transactions with a consensus No changes can be made to transactions Governance EIP ECIP Price (May 2023) $1,843.46 $18.24 All-Time High $4,891.70 $176.16\n\nBlockchain Technology and Architecture\n\nBoth Ethereum and Ethereum Classic share a common foundation. They use the Ethereum Virtual Machine (EVM) and are built upon the principles of decentralization, transparency, and immutability. Until recently, they also both used a Proof-of-Work mining method for settling transactions.\n\nHowever, since the fork, Ethereum has undergone significant upgrades and improvements, such as the implementation of Ethereum 2.0 and its transition from Proof-of-Work (PoW) to Proof-of-Stake (PoS). This was done to tackle high gas fees, scalability, and environmental concerns.\n\nEthereum Classic, on the other hand, has stayed true to the original rules and has remained extremely conservative when it comes to implementing any changes. In the eyes of the Ethereum Classic community, the blockchain and code will always be immutable.\n\nSecurity\n\nEthereum has since implemented many new security upgrades and third-party audits to protect the integrity of the network. Ethereum Classic has made concerted efforts; however, as a smaller network with a lower hash rate, it is inherently more vulnerable to network attacks such as a 51% attack.\n\nGovernance\n\nBoth follow a similar governance model where the community discusses and votes on any potential changes and the roadmap. Ethereum uses the Ethereum Improvement Proposal (EIP), while Ethereum Classic uses the Ethereum Classic Improvement Proposal (ECIP) process. Overall, the governance model is the same; however, the Ethereum Classic community tends to be more conservative when it comes to making changes, preferring to uphold the immutability of the blockchain.\n\nCommunity and Use Cases\n\nEthereum has a highly active and vibrant community of developers, investors, and creatives. This active community has propelled Ethereum’s dominance in the blockchain industry, and the ecosystem has a wide array of dApps and projects. Ethereum has seen widespread adoption in various industries, serving as the go-to platform for dApps, decentralized finance, and tokenization of assets. Its flexibility and scalability have enabled the development of innovative solutions across multiple sectors.\n\nIn contrast, Ethereum Classic’s community is smaller, yet it remains dedicated to the original Ethereum vision, attracting those who value the preservation of immutability. With its more limited community, Ethereum Classic finds niche applications and adoption in specific industries or communities that align with its principles.\n\nPrice History and Roadmap\n\nAs a result of the hard fork, investor confidence was mostly restored, and the price of Ethereum (ETH) continued to appreciate over the years reaching a high of $4,891.70. Although the price has reduced considerably following last year’s crash, it has been recovering steadily. Ethereum Classic (ETC) has experienced small spikes but has never come close to the price of ETH. This is partly due to the smaller community and lower adoption rates.\n\nRoadmap\n\nEthereum has always been an ambitious project with an innovative community continually working on improvements and changes. Now that the network has moved to a PoS mining method, the community is focused on further addressing scalability, reducing energy consumption, and improving overall security.\n\nEthereum Classic has a small network and has struggled with broader adoption. However, it continues to attract investors who value its core ideals. While there is no traditional roadmap, changes are discussed by the community. Changes are made slowly and steadily.\n\nEthereum vs Ethereum Classic: Key Takeaways\n\nEthereum and Ethereum Classic represent two distinct philosophical paths stemming from the same foundations. Ethereum has achieved widespread adoption and market success through continuous development and upgrades. It has become a prime example of the potential of DeFi and crypto. Ethereum Classic remains rooted in the original principles of immutability and decentralized governance. It showcases the dedication and ideals of the community members who truly believe that code is law.\n\nWhich network is better ultimately depends on your priorities and ideals. As time goes by, the two chains should evolve even further as the crypto landscape grows and expands."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLW1heS0yONIBOmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLW1heS0yOD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for May 28 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBulls are holding the gained initiative, according to CoinMarketCap's ranking.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nEthereum (ETH) has gained less than Bitcoin (BTC), going up by 0.93%.\n\nImage by TradingView\n\nThe last day of the week has started with a price blast for Ethereum (ETH). At the moment, one should pay attention to the recently formed resistance at $1,860.\n\nIf closure happens near it, there is a chance to see a breakout followed by a further rise to the $1,880 zone.\n\nImage by TradingView\n\nOn the daily time frame, the price of Ethereum (ETH) keeps trading sideways, accumulating power for a further sharp move. A continued rise is only possible if the candle fixes above the important zone of $1,880.\n\nImage by TradingView\n\nOn the bigger chart, the price has consolidated above the support level at $1,737. If the situation does not change by the end of the day, one can expect a test of the $2,000 mark by mid-June.\n\nEthereum is trading at $1,844 at press time."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2RvZ2Vjb2luLXRyYW5zYWN0aW9uLXZvbHVtZS1mbGlwcy1ldGhlcmV1bS10aGFua3MtdG8tZHJjLTIwLXRva2Vucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Dogecoin transaction volume flips Ethereum amid DRC-20 token fever - CryptoSlate",
        "content": "Dogecoin (DOGE) recorded a significant surge in its network activity over the last two days, processing more than 4 million transactions between May 27 and 28, according to BitInfoCharts.\n\nThe increase surpassed the number of transactions processed by its more storied rivals like Ethereum (ETH) and Bitcoin (BTC). ETH recorded 1.9 million transactions during the reporting period, while BTC saw less than 1 million transactions.\n\nThe data shows that the trend has been consistent for the last seven days. Between May 22 and 28, Dogecoin completed over 9 million transactions, while the Ethereum network recorded around 6 million transactions. Bitcoin completed 3.3 million transactions during the same period.\n\nDogecoin’s network activity surge driven by DRC-20 tokens\n\nFollowing the increasing popularity of Bitcoin’s BRC-20 tokens, DOGE enthusiasts implemented a similar model, namely DRC-20 tokens, which contributed to the surge in Dogecoin’s transaction volume.\n\nThe DRC-20 model facilitates the creation and trading of tokens on the Dogecoin blockchain, similar to how ERC-20 tokens function on the Ethereum network but using the BRC-20 standard as inspiration.\n\nThe hype surrounding these new assets has led to the proliferation of these tokens within the crypto community. A Dogecoin enthusiast, Mishaboar said:\n\n“DRC20 tokens are minted on the Dogecoin chain because of the low fees, and for a kind of “fetish” of minting meme tokens on top of the meme coin blockchain that started it all.”\n\nThe increasing network activity has raised concerns among some community members, who argue that it could lead to network congestion and negatively impact Dogecoin’s primary goal of providing an efficient, low-cost, and accessible means of everyday transactions.\n\nDOGE’s climbing hashrate\n\nMeanwhile, Dogecoin’s rising transaction volume coincided with a period of increasing hashrate — up 38% in May.\n\nAccording to Minerstat data, Dogecoin’s hashrate jumped to 934.03 TeraHash per second (TH/s) from 660.61TH/s recorded on May 1.\n\nUsually, an increasing hash rate suggests that the number of miners on a network is rising. It can also measure the strength of blockchain health and security.\n\nDespite the increase in network activity and hashrate, Dogecoin’s price has remained relatively unaffected, with the digital asset experiencing only a 2% gain in the past week and a 10% decrease in the last 30 days. As of the time of writing, Dogecoin trades at $0.0732, according to CryptoSlate’s data."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYmxvY2stc2l6ZS1zdXJnZXMtdG8tMS1tb250aC1oaWdoL9IBVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYmxvY2stc2l6ZS1zdXJnZXMtdG8tMS1tb250aC1oaWdoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum’s Block Size Surges To 1-Month High – What This Means For ETH - NewsBTC",
        "content": "Ethereum, the world’s second-largest cryptocurrency by market capitalization, has witnessed a significant surge in its mean block size, reaching a new 1-month high. This milestone was recently announced by Glassnode, a renowned on-chain analysis platform.\n\nThe increase in block size indicates a notable improvement in Ethereum’s network capacity and transaction throughput, potentially bringing positive implications for the ecosystem.\n\nBreaking Down The Block Size Surge\n\nThe mean block size of Ethereum has skyrocketed, surpassing the previous 1-month high recorded on May 27, 2023. Glassnode’s data reveals that the current mean block size stands at 121.4 million.\n\nThis surge highlights a substantial increase in the average data volume accommodated within individual blocks of the Ethereum blockchain.\n\nLarger block size is indicative of Ethereum’s ability to handle more data and transactions per block, effectively enhancing the network’s capacity. With a higher average data volume in recent blocks, ETH showcases its potential for improved scalability and transaction throughput.\n\nEthereum’s surge in block size signifies a positive development for the ETH ecosystem, as it accommodates the growing demands and usage of the network.\n\nWhat This Means For Ethereum\n\nThe surge in Ethereum’s mean block size holds several implications for ETH and its community. Firstly, it signifies the network’s continued growth and adoption. As more participants engage with the Ethereum blockchain, the increased block size demonstrates the platform’s ability to handle a higher volume of transactions, leading to enhanced efficiency and reduced congestion.\n\nMoreover, the surge in block size also contributes to improved transaction throughput. With larger block sizes, more transactions can be included in each block, resulting in faster confirmation times and smoother user experiences.\n\nThis development is crucial for applications built on the Ethereum network, such as decentralized finance (DeFi) protocols, non-fungible token (NFT) marketplaces, and various other decentralized applications (dApps). It enables them to process a greater number of transactions within a given timeframe, fostering better scalability and usability.\n\nAdditionally, Ethereum’s increased block size may have a positive impact on gas fees. Gas fees, which are transaction fees on the Ethereum network, can be influenced by block size. A larger block size allows for the inclusion of more transactions, potentially alleviating congestion and reducing gas fees. This could lead to a more cost-effective and accessible environment for users and developers utilizing the Ethereum ecosystem.\n\nMeanwhile, Ethereum has shown a possible brewing uptick in the past week. The second crypto asset by market capitalization has surged 2.3% in the past week. Over the past 24 hours, ETH has seen a 1.1% gain.\n\nAt the time of writing, Ethereum currently trades at $1,851. Ethereum’s trading volume has, however, ranged between $3 billion and $5 billion in the past seven days indicating a possible accumulation. Regardless, in the past 24 hours, ETH has had a trading volume of $5.5 billion.\n\n-Featured image from Shutterstock, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNDI1MzAvbWVldC1jcnlwdG8tcmljaC13aG8td2FudC1saXZlLWZvcmV2ZXItaW5zaWRlLXZpdGFsaWtzLXp1emFsddIBXWh0dHBzOi8vZGVjcnlwdC5jby8xNDI1MzAvbWVldC1jcnlwdG8tcmljaC13aG8td2FudC1saXZlLWZvcmV2ZXItaW5zaWRlLXZpdGFsaWtzLXp1emFsdT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Meet the Crypto Rich Who Want to Live Forever: Inside Vitalik's Zuzalu - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAround 200 key players in the fields of crypto, big pharma, politics, and academia flew home this past weekend after spending upwards of two months at Zuzalu: an experimental “pop-up city community” conceived by Ethereum co-founder Vitalik Buterin.\n\nSince March, Zuzalu attendees (Zuzalans, they call themselves) temporarily abandoned their respective lives and identities to become the first citizens of a new civilization—one founded among the resort hotels and Airbnbs of Lustica Bay, Montenegro, and tasked with envisioning what they consider to be a new future for humanity.\n\nAlong the way, attendees discussed the role of cryptocurrency, blockchain networks, and, of course, AI—all the rage these days in tech circles. But the experience also focused on topics like human longevity and the concept of a \"network state\" popularized by former Coinbase CTO Balaji Srinivasan. (He appeared remotely for a Zuzalu panel discussion that one attending engineer called the \"Doomer presentation.\")\n\nAD\n\nAD\n\nZuzalu was incredible 🙂 I’m gonna miss everyone !! pic.twitter.com/sCZ4Rk7ygk — rodney (@0xRodney) May 25, 2023\n\nThe novel conference has been described by some as a Burning Man for futurists, by others as a sleepaway camp for the crypto elite, and by many attendees as a life-altering experience with historic implications for the biological, political, and social potential of our species.\n\nSo what was it actually like to be there?\n\n“Every single person here believes that they can change the world,” Hannah Hamilton, co-founder of decentralized finance protocol Asymmetry, told Decrypt. “Normally, you meet one person who believes they can change the world—but it's everyone.”\n\nOn Hamilton’s second night at Zuzalu, she was approached at an apartment party by a man who asked her if she thought she could change the arc of human history. That’s typical Zuzalan small talk; a popular icebreaker at the conference is asking an acquaintance at what age they think they’ll die. Answers usually range from 80 to “never.”\n\nAD\n\nAD\n\nHamilton initially scoffed at the man, telling him that no, she didn’t think she could single-handedly change the world. The man informed her that she was wrong.\n\n“You are already,” he told her. Hamilton’s finance protocol is shaping Ethereum, in his view, and Ethereum is itself shaping the world economy and a global decentralized information network. Hamilton now believes she can, and will, have a direct impact on humanity’s fate.\n\n“Zuzalu has changed my life,” she said, “in literally a few days.”\n\nLife at Zuzalu was itself decentralized, with impromptu conversations and breakout seminars planned among participants that drive the conference’s cadence.\n\nThe two primary social hubs for Zuzalan society appear to be breakfast—served every day, vegetarian, at a local Montenegrin restaurant taken over by the event—and the sauna at the Chedi Lustica Bay, the five-star hotel most Zuzalans have called temporary home.\n\nFor a time, the Chedi’s sauna played host to a Zuzalan-organized, philosophy-driven conversation series aptly titled “Sauna Philosophers.” After more than 30 people began showing up for it regularly, Chedi Hotel management requested its immediate discontinuation.\n\n“The hotel staff doesn't like when you have events in the sauna,” developer and entrepreneur Philippe Dumonet, another Zuzalan, told Decrypt.\n\nAD\n\nAD\n\nIf most Zuzalu events were informal to some degree, that also means that any moment, even a house party, was ripe for optimizing human potential. One group of Zuzalans brought a large stack of bolivars—the hyperinflated Venezuelan currency—with them to Montenegro; they then handed out the near-worthless bills as non-fungible, secure invites to a party.\n\nSome laughed off the move as shtick. But when would-be partygoers arrived at the gathering later that night, they were turned away immediately if they could not produce a bolivar, and forced to permanently relinquish their own bolivar if they brought a guest unable to produce a bill themselves.\n\nBolivars soon became a hot commodity among Zuzalans, and ran out shortly thereafter. Their distributors developed an app via which bolivar holders can input their bills’ serial numbers, and create authenticated virtual IDs that could one day (or so their creators hope) be used create a vouching system to grow social groups.\n\nExcept for such instances of exclusivity designed in the name of expanding the human potential for trust, Zuzalu has felt very open and welcoming, according to attendees that Decrypt spoke with. And in such a small pool of people, like-minded Zuzalans have naturally gravitated towards each other.\n\nZuzalu hackathon presentations in progress! Based af award goes to: 153^3, bidirectional vouching to create a web of trust for parties by @ManuAlzuru @adrian_eth @notalddo @d3portillo 🏆 🏆 pic.twitter.com/8UBYTRVmOO — stuti |📍 zuzalu (@stutireal) May 14, 2023\n\nOne such clique that has gained notoriety in Lustica Bay is a group of Zuzalans who are confident that they will achieve immortality. They’ve garnered a reputation on Zuzalu’s Balkan campus for the sheer force of their entrepreneurial confidence in the face of humanity’s greatest design flaw: death.\n\n“That's one of the ones that think they're not gonna die,” Asymmetry’s Hamilton said she and her friends would whisper on the streets of Lustica when such Zuzalans walked by.\n\nAD\n\nAD\n\nBut to many of the minds present at Zuzalu, cheating death is just the next frontier in humanity’s development—and one that could bring its own problems.\n\nFun final parkour class in #zuzalu montenegro! Grateful for a time of well being, productivity, and inspiration@QJ_ECF pic.twitter.com/e3VXLS9CT2 — Noah Chon Lee (@noahchonlee) May 26, 2023\n\nA friend of Hamilton’s expressed to her that some humans achieving immortality will inevitably lead to bitterness and resentment among the mortal underclasses.\n\n“There will be a war against the people that are living forever, and they will all die,” they believe, as relayed by Hamilton.\n\nLuckily, Zuzalu has a backup plan in case of such an event. According to sources that Decrypt spoke with, some Zuzalans think the creation of a nation state reserved exclusively for people who live forever could address security concerns for that rarified population.\n\nBut there’s further concern among Zuzalans that if an immortals-only nation were created, it may then be vulnerable to targeting by a virus engineered to attach itself to medicines essential to the immorality-sustaining process.\n\nStrategies for navigating that particular scenario have not yet been devised. But Zuzalu is expected to return next year."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1zLXNoYW5naGFpLXVwZ3JhZGUtbWFkZS1pdC1lYXNpZXItdG8tZGV0ZWN0LWNyaW1pbmFsc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai upgrade made it easier to detect criminals - Cointelegraph",
        "content": "With its historic Merge event in September, Ethereum has become a proof-of-stake blockchain. The mechanism now used to confirm transactions relies on validators staking their Ether (ETH). Ethereum’s March upgrade, codenamed Shanghai, finally enabled stakers to withdraw their locked Ether.\n\nThe Ethereum ecosystem’s “investment themes” have included a) decentralized finance (DeFi) b) stablecoins c) Bitcoin (via wrapped versions of BTC) and d) non-fungible tokens (NFTs). With the upgrade, the network also began providing fixed-income assets.\n\nThere are currently several ways people make money on or using Ethereum. Broadly, they can be grouped into “investment themes,” including: a) decentralized finance (DeFi); b) stablecoins; c) Bitcoin (BTC) (via wrapped versions of BTC); and d) nonfungible tokens (NFTs). Following Shanghai, the network began to offer fixed-income assets.\n\nRisk-free rate\n\nYield is one of the core pillars of traditional finance (TradFi). A rise or fall in yield leads to an increase or decrease in the perceived risk of other financial assets. Thus, movements in the benchmark rate set by the United States Federal Reserve provide the rationale behind investment decisions, in general.\n\nRelated: Ethereum is going to transform investing\n\nAccordingly, compliance professionals use trends in the risk-free rate to detect irrational movement of funds in capital markets, as such fund flows might be attempts to launder money. The reasoning here is that launderers of illicit funds do not actively chase financial gains like regular investors, as the sole purpose of money laundering is to obfuscate the trail of dirty money.\n\nWith Ethereum’s staking yield denoting the “risk-free rate” of the crypto ecosystem, the Shanghai upgrade may have enhanced the state of crypto forensics.\n\nTradFi forensics focuses on activity — crypto forensics focuses on entities\n\nFinancial crime risk in TradFi is managed using automatic systems that alert institutions to probable illicit use of financial assets. While data scientists design and deploy models to raise red flags over suspicious transactions, investigation teams still must assess resultant leads and evaluate if Suspicious Activity Reports (SARs) need to be filed.\n\nAn interesting point of contrast between forensics for TradFi and crypto is that the latter focuses more on the criminal entity than the activity itself. In other words, investigators analyze networks of crypto wallets to identify transfers of criminal assets.\n\nMoney laundering occurs in three stages: a) Placement: proceeds of crime enter the financial system; b) Layering: complex movement of funds to obscure the audit trail and sever the link with the original crime; and c) Integration: criminal proceeds are now fully absorbed into the legal economy and can be used for any purpose.\n\nFor crypto assets, it is convenient to design solutions to detect the placement of illicit assets. This is because most laundered money originates from crypto-native crimes such as ransomware attacks, DeFi bridge hacks, smart contract exploits and phishing schemes. In all such offenses, a perpetrator’s wallet addresses are readily available. Consequently, once a crime has been committed, relevant wallets are monitored to analyze asset flows.\n\nIn contrast, forensic experts working for, say, a bank do not have any visibility into the offense — such as human or drug trafficking, cybercrime or terrorism — when criminal proceeds are being injected into a bank’s ecosystem. This makes detection extremely difficult. Hence, most Anti-Money Laundering (AML) solutions are designed to identify layering.\n\nEthereum’s staking rewards make it easier to detect unusual activity\n\nTo design solutions to detect layering, it is imperative to think like criminals, who craft complex flows of funds to obfuscate the money trail. The time-tested approach to exposing such activity is to spot the irrational movement of assets. This is because money laundering does not have the goal of generating profit.\n\nWith Ether’s post-Shanghai staking yields providing benchmark interest rates for crypto, we can formulate baseline risk-reward structures. Armed with this, investigators can systematically spot financial behavior running counter-intuitive to trends in the benchmark rate.\n\nRelated: Thanks to Ethereum, ‘altcoin’ is no longer a slur\n\nTo illustrate, there might be a pattern where an address or a group of addresses that points toward an entity that consistently takes on high risk while earning below the risk-free rate. A situation like that would almost certainly be investigated at a bank.\n\nCase in point, such a transaction surveillance architecture can be used to detect the wash trading of NFTs. Here, multiple market participants collude to carry out numerous NFT trades with the goal of layering criminal assets or manipulating prices. Since earning profits is not the intention behind the vast bulk of these transactions, such activity will raise a red flag.\n\nSimilarly, in a situation where proceeds of terrorism are being layered via DeFi protocols, detection of irrational asset movements can provide substantial leads to investigators, even without knowledge of the actual crime.\n\nFinancial crime and DeFi\n\nTraditional capital markets are often used to covertly move funds to circumvent sanctions and finance terrorist activity. Analogously, DeFi ecosystems present an attractive target for financial crime due to the ability to move vast sums of assets between jurisdictions using blockchain.\n\nFurther, there has been a significant shift in activity from centralized exchanges to decentralized exchanges due to recent fiascos like the collapse of FTX. This increase in DeFi volumes has made it easier for illegal flows to remain obscure.\n\nEven more compelling is the introduction of better compliance controls by centralized crypto service providers – often mandated by regulators – which are likely driving criminals to seek out new channels for money laundering.\n\nConsequently, illicit flows to DeFi could originate from an expanded set of crimes. This paradigm shift in crypto markets will require forensics teams to increase their capabilities of investigating complex fund flows across diverse protocols without prior knowledge of the source of criminal assets.\n\nAccordingly, compliance efforts need to pivot around the discovery of layering typologies. In fact, with the rapid progress in blockchain interoperability, systematic surveillance to detect criminal transfers has become even more crucial.\n\nOur ability to detect suspicious activity in crypto is less than ideal, partly due to crypto’s extreme price volatility. The volatility renders static risk thresholds ineffective and can enable money laundering to go undetected. In this sense, if and when Ethereum sets a benchmark rate, it will provide a means of establishing baseline rationality for fund flows and thus spotting outliers.\n\nDebanjan Chatterjee has more than 17 years of experience analyzing trends in financial crime using data science, including more than 13 years at HSBC. He holds a master’s in economics from India’s Delhi School of Economics.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUteHJwLWJlY29tZXMtYW4tb3V0bGllci1hcy1vdXRsb29rLXR1cm5zLWJ1bGxpc2gtMjAyMzA1MjkwNjU10gGeAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUteHJwLWJlY29tZXMtYW4tb3V0bGllci1hcy1vdXRsb29rLXR1cm5zLWJ1bGxpc2gtMjAyMzA1MjkwNjU1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: XRP becomes an outlier as outlook turns bullish - FXStreet",
        "content": "Share:\n\nBitcoin price shows a classic Power of Three (PO3) setup in play, forecasting a potential decline to $25,296.\n\nEthereum price could attempt a rally to $2,028 if the bullish outlook persists.\n\nRipple price has set up an inverse head-and-shoulders setup, forecasting a 10.76% increase to $0.515.\n\nBitcoin (BTC) price has surprised investors with a quick uptick over the weekend, but it is unclear if this is a spurt in buying pressure or a reentry of sidelined buyers. Judging by the price action, the cause of the uptick is unclear and the bearish outlook explained in previous articles is still valid.\n\nAlso read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC set to punish greedy bulls\n\nBitcoin price ready to collapse\n\nBitcoin (BTC) price breached its two-week consolidation on May 28 and collected the buy-stop liquidity resting above May 10 swing high at $28,293. This liquidity run was soon followed by a retracement, which is underway and signals a Power of Three (PO3) setup in play.\n\nThis technical formation has three phases – accumulation, manipulation and distribution. As the name indicates, the asset usually moves sideways in the first phase and is often followed by a sweep of a critical level, which is termed manipulation.\n\nThe third or the last phase is distribution, which leads to volatile rallies in the opposite direction of manipulation. In Bitcoin’s case, BTC swept a local top at $28,293 and is trading at $27,879, signaling the next move should favor bears.\n\nIf this setup plays out, Bitcoin price could reach the $25,764 support level to collect the sell-stop liquidity. Should the selling pressure persist even after this 7.6% decline, BTC price could hit the next critical support level at $25,296.\n\nThese levels are key accumulation levels, as seen in previous articles.\n\nRead more: Bitcoin Weekly Forecast: BTC delays inevitable crash to $25,000\n\nBTC/USD 4-hour chart\n\nOn the other hand, if Bitcoin price continues to tread above the $28,051 level, it could attempt an extension of this weekend's rally. If the move leads to a flip of the $30,000 psychological level, it would invalidate the bearish thesis.\n\nIn such a case, BTC could attempt a retest of the $32,450 hurdle.\n\nEthereum price needs to stay above this level\n\nEthereum price has overcome the $1,817 hurdle and shot up 7% over the weekend. ETH trades at $1,898 at the time of writing but it needs to hold above the $1,853 support level to resume its uptrend.\n\nIf successful, ETH could eye a retest of the $2,028 hurdle followed by a sweep of the April 16 high at $2,147.\n\nETH/USD 1-day chart\n\nOn the contrary, if Ethereum price breaches the $1,853 support level, investors should pay attention to $1,817. If this level fails to hold, ETH will invalidate the bullish thesis and could trigger a correction to $1,703.\n\nRipple price flips bullish amid confusing times\n\nRipple price has set up an inverse head-and-shoulders set up on the four-hour chart. This technical formation contains three swing lows, with the central one lower than the other two. The ones on each side are defined as the shoulders, while the central one is the head. Connecting the peaks using a trend line reveals a declining resistance level known as the neckline.\n\nThis setup forecasts a 10.76% upswing to $0.515, determined by measuring the distance between the right shoulder’s peak and the head’s lowest point, adding it to the breakout point at $0.465 (see chart below).\n\nSo far, Ripple price has not only breached the neckline but has also rallied nearly 4%, currently trading at $0.481. If the bullish trend continues, XRP price could rally another 7.30% before it hits the theoretical target.\n\nXRP/USD 4-hour chart\n\nInvalidation of the inverse head-and-shoulders setup will occur if Ripple price slices the neckline at $0.465. If this bearish outlook continues, XRP price could slide towards the May 24 low at $0.442."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hcmJpdHJ1bS1iYXNlZC1qaW1ib3MtcHJvdG9jb2wtaGFja2VkLWxvc2luZy03bS1pbi1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Arbitrum-based Jimbos Protocol hacked, losing $7.5M in Ether - Cointelegraph",
        "content": "Adding to the growing number of decentralized finance (DeFi) protocol hacks in the crypto industry, Jimbos Protocol is the latest to suffer an attack resulting in a significant loss of funds.\n\nAccording to blockchain security firm PeckShield, Jimbos Protocol — the liquidity protocol of the Arbitrum system — was hacked on the morning of May 28. The attack resulted in the loss of 4,000 Ether (ETH), worth approximately $7.5 million at the time.\n\nSpecifically, the attacker took advantage of the lack of slippage control on liquidity conversions. The protocol’s liquidity is invested in a price range that doesn’t need to be equal, creating a loophole where attackers can reverse swap orders for their own gain.\n\nAlthough launched less than 20 days ago, Jimbos Protocol aimed to address liquidity and volatile token prices through a new testing approach. However, the protocol’s mechanism was not adequately developed, leading to a logical vulnerability creating favorable conditions for attackers. As a consequence, the price of the underlying token, Jimbo (JIMBO), has plummeted by 40%.\n\nAccording to PeckShield’s findings, the attackers extracted 4,090 ETH from the Arbitrum network. Subsequently, they utilized the Stargate bridge and the Celer Network to transfer approximately 4,048 ETH from the Ethereum network.\n\nHacking incidents in DeFi protocols is not a novel phenomenon. While reports indicate a significant decline in the number of attacks compared with previous years, the community continues to be exposed to numerous exploits.\n\nRelated: The Sandbox CEO’s Twitter was hacked, used to promote alleged ‘airdrop’ scam\n\nDespite efforts to enhance security measures, the DeFi ecosystem grapples with the persistent challenge of safeguarding against potential vulnerabilities and unauthorized access. An example is the recent flash loan attack on the 0VIX protocol, resulting in a substantial loss of nearly $2 million.\n\nAnother recent noteworthy occurrence involved the hijacking of Tornado Cash, a prominent privacy-focused protocol. Unknown attackers successfully compromised the system and extracted significant quantities of Tornado Cash (TORN) tokens, leading to substantial financial losses.\n\nMagazine: Should crypto projects ever negotiate with hackers? Probably"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9qaW1ib3MtcHJvdG9jb2wtb2ZmZXJzLWRlYWwtdG8taGFja2VyLXRocmVhdGVucy1wb2xpY2UtYWN0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Jimbos Protocol offers deal to hacker, threatens police action - Cointelegraph",
        "content": "The team behind exploited decentralized finance (DeFi) app Jimbos Protocol has offered a deal to the app’s exploiter: Keep 10% of the funds and return the other 90%, or face prosecution. Otherwise, the team “won’t stop” until the attacker is “behind bars.” The proposed deal was disclosed in a May 28 tweet by the Jimbos team and posted to the Ethereum network.\n\nTo the attacker: keep a fast $800k payday, and live to tell the tale. We won't pursue you if you send back the 90%. But if you don't, we won't stop until you're behind bars.\n\n\n\nYou can open communications with us at Helloitsjimmy@proton.me — Jimbos Protocol (v2, soon) (@jimbosprotocol) May 29, 2023\n\nOn May 28 at 7:25 am UTC, the team posted a message to the Ethereum network stating that the attacker would not be prosecuted if 90% of the funds are returned.\n\nFirst Jimbos Protocol message to attacker. Source: Ethereum blockchain data\n\nAfter apparently not getting a response, the team posted another message at 7:07 pm, giving the attacker a deadline of “tomorrow by 4PM UTC” to return 90% of the funds and warned that the team would “start working with law enforcement agencies” if the funds were not returned.\n\nJimbos Protocol second message to attacker. Source: Ethereum blockchain data\n\nThis second message was also posted to the protocol’s official Twitter account.\n\nOn May 29, after the deadline passed, the team announced on Twitter that it had “identified promising leads, and one in particular” that may allow Jimbos to identify the attacker. The team warned the attacker that “we don’t want anyone’s lives ruined, but given no choice, we will do what we say,” implying the protocol would follow through with its threat to go to the police if the attacker didn’t comply.\n\nRelated: How the IRS seized $10B worth of crypto using blockchain analytics\n\nJimbos describes itself as a “reactive concentrated liquidity protocol.” It attempts to keep the price of its token, JIMBO, above a set floor price by accumulating Ether (ETH) in the protocol’s treasury and using it to defend the token’s price.\n\nOn May 28, the protocol became the victim of a flash loan attack, as an exploiter drained $7.5 million from its treasury-owned liquidity pool. According to an analysis from Numen Cyber Labs, the attacker took advantage of a flaw in the JimboController contract that allowed anyone to call the shift() function and add liquidity to the pool. This allowed the exploiter to manipulate the selling price of the JIMBO token when cashing out, draining $7.5 million worth of Ether from the pool in the process.\n\nDeFi exploits are a common problem in the Web3 ecosystem. But luckily for users, the exploiters sometimes return most of the funds after negotiating with development teams. On March 13, Euler Finance was hacked for over $195 million, the largest attack of 2023 so far. But the attacker subsequently returned nearly all the funds. Liquidity protocol Sentiment was similarly exploited on April 4, but the attacker returned 85% of the exploited funds on April 6.\n\nThe Jimbos Protocol team claims to be working with the same “security researchers and on-chain analysts” that investigated these previous two incidents."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LnRyYWRpbmd2aWV3LmNvbS9jaGFydC9FVEhVU0RULzZBRjA5NXpDLVVzaW5nLU9uLUNoYWluLU1ldHJpY3MtZm9yLUV0aGVyZXVtLUFuYWx5c2lzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Using On-Chain Metrics for Ethereum Analysis for BINANCE:ETHUSDT by LeafAlgo - TradingView",
        "content": "The world of cryptocurrency is highly dynamic and ever-evolving, and Ethereum, with its smart contract capabilities and expansive ecosystem, has emerged as one of the leading platforms in the blockchain space. As traders and investors seek to navigate the volatile markets of cryptocurrencies, they rely on various tools and techniques for technical analysis to make informed decisions.One such powerful tool gaining prominence is the use of on-chain metrics, which provide valuable insights into the underlying fundamentals and behavior of a blockchain network. In the case of Ethereum, on-chain metrics offer a unique perspective on the network's activities and can be instrumental in understanding market dynamics.By harnessing the power of on-chain data, traders can access a wealth of information about Ethereum's network activity, user behavior, token dynamics, and decentralized finance (DeFi) ecosystem. This data can provide critical insights that supplement traditional price analysis, offering a more comprehensive view of the market and potentially uncovering new opportunities.For the purposes of this article, I will be using the “J1 Glassnode Metrics Toolkit” designed by Tradingview user Jmorgado89 ( www.tradingview.com/v/QBstirSI/ ).It is important to note that on-chain metrics serve as a complement to other technical analysis techniques and should not be used in isolation. By combining on-chain insights with traditional indicators and market trends, traders can enhance their understanding of Ethereum's price movements and make more informed trading decisions.On-chain metrics refer to the data and statistics derived from the activity happening directly on a blockchain network. These metrics provide valuable insights into various aspects of the network, including transaction volume, address activity, token circulation, smart contract interactions, and more. In the context of Ethereum, on-chain metrics offer a comprehensive view of the network's dynamics and can help traders gain a deeper understanding of market trends and sentiment.--: Transaction volume is one of the fundamental on-chain metrics that measures the total number of transactions occurring on the Ethereum network over a specific period. High transaction volume indicates increased network activity, which can be an indicator of market interest and demand for Ethereum and its associated tokens. Traders often monitor transaction volume to gauge the overall health and popularity of the network.--: Active addresses refer to the number of unique addresses that interact with the Ethereum network within a given timeframe, typically measured daily or monthly. Tracking active addresses can provide insights into the level of user participation and adoption of Ethereum. Higher numbers of active addresses suggest a vibrant ecosystem with increased user engagement, while a decline in active addresses may indicate a potential shift in market sentiment.--: Monitoring the growth of new addresses can offer insights into the adoption and expansion of the Ethereum ecosystem. Increasing numbers of new addresses suggest growing interest and participation, indicating a healthy network. On the other hand, a decline in the creation of new addresses may indicate reduced interest or potential challenges within the Ethereum community. By tracking and analyzing the trend of new addresses over time, traders can gain a better understanding of Ethereum's user base and make more informed decisions regarding market trends and potential investment opportunities.--: Token circulation refers to the movement of tokens within the Ethereum network. By analyzing the flow of tokens across different addresses, traders can gain insights into the buying and selling activity of specific tokens. Token circulation data can help identify trends, such as accumulation or distribution patterns, and provide indications of market sentiment and investor behavior.--: Another important on-chain metric used in Ethereum analysis is the Spent Output Profit Ratio (SOPR). SOPR is a metric that measures the profitability of coins being moved on the Ethereum blockchain. It is calculated by dividing the realized value of the coins being spent by the value at which they were last moved. SOPR is a valuable tool for understanding market sentiment and identifying potential trend reversals. When the SOPR is above 1, it indicates that coins are being sold at a profit, suggesting a higher probability of market participants taking profits and potentially leading to a market correction. Conversely, when the SOPR is below 1, it suggests that coins are being sold at a loss, which may indicate increased selling pressure and a potential market bottom.--: Ethereum is home to a thriving DeFi ecosystem, comprising various protocols and platforms that enable decentralized financial activities such as lending, borrowing, and yield farming. On-chain metrics specific to DeFi, such as total value locked (TVL) and protocol-specific metrics like borrowing and lending rates, can help traders assess the growth and activity within the DeFi space. Monitoring these metrics can provide insights into emerging trends and opportunities within the DeFi landscape.Understanding these on-chain metrics allows traders to go beyond traditional price analysis and gain a deeper understanding of Ethereum's underlying network dynamics. By monitoring these metrics, traders can identify trends, assess market sentiment, and potentially anticipate market movements before they are reflected in price data.Next, we will explore some of the popular tools and platforms that traders can utilize to access on-chain metrics and enhance their Ethereum analysis.--: Etherscan is one of the most widely used block explorers for Ethereum. It provides a user-friendly interface for exploring the Ethereum blockchain and accessing a wealth of on-chain data. Traders can use Etherscan to track transaction details, monitor smart contract interactions, view token transfers, and analyze other critical on-chain metrics. This can be accessed at ( etherscan.io/ ).--: Dune Analytics is a powerful data analytics platform specifically designed for Ethereum. It allows users to create custom queries and visualize on-chain data in the form of interactive dashboards. Traders can leverage Dune Analytics to explore on-chain metrics, build custom metrics, and gain deeper insights into Ethereum's ecosystem. This can be accessed at ( dune.com/browse/dashboards ).--: Glassnode is a comprehensive on-chain data analytics platform that provides insights into various blockchain networks, including Ethereum. It offers a wide range of on-chain metrics, including transaction volume, network activity, token flows, and more. Glassnode's advanced analytics and customizable charts enable traders to identify trends, track investor behavior, and make data-driven trading decisions. This can be accessed through a few scripts on Tradingview, including the one I have used for this article; otherwise, go to ( glassnode.com/ ).--: CoinGecko is a popular cryptocurrency data platform that provides on-chain metrics and market information for multiple cryptocurrencies, including Ethereum. Traders can access a wide range of on-chain data, including transaction volume, active addresses, token circulation, and DeFi metrics. CoinGecko's user-friendly interface and comprehensive data make it a valuable resource for analyzing Ethereum's on-chain activity. This can be accessed at ( www.coingecko.com/ ).--: Many trading platforms, such as Binance, Coinbase Pro, and Kraken, offer on-chain data and metrics alongside their trading services. These platforms provide access to real-time market data, including on-chain transaction information, network statistics, and token data. Traders can leverage these platforms to access on-chain metrics while executing their trades, allowing for a seamless integration of on-chain analysis with their trading activities.Now, let's discuss how to integrate these metrics into a comprehensive trading strategy to enhance decision-making and maximize trading effectiveness.--: On-chain metrics can provide valuable insights into the fundamental health and activity of the Ethereum network. By combining these metrics with traditional technical analysis tools such as chart patterns, trend lines, and indicators, traders can gain a holistic view of market dynamics. For example, by analyzing on-chain transaction volume alongside price trends, traders can identify potential price reversals or confirm the strength of a prevailing trend.--: On-chain metrics related to network activity, such as the number of active addresses, daily transaction volume, and gas usage, can provide insights into the overall demand and usage of the Ethereum network. Monitoring these metrics can help traders identify periods of increased network congestion or heightened user engagement, which may impact price movements and trading opportunities.-- Track Token Movements and Flows: On-chain metrics related to token movements and flows can offer valuable information about investor behavior and market sentiment. Traders can monitor metrics such as token circulation, large transactions, and token velocity to gauge the buying or selling pressure on specific tokens. Unusual token movements or significant changes in token velocity can signal potential market shifts and present trading opportunities.--: Ethereum has become a hub for decentralized finance applications, and on-chain metrics specific to DeFi can provide insights into the health and activity of this ecosystem. Traders can monitor metrics such as total value locked (TVL), lending and borrowing volumes, and liquidity pool sizes to identify trends and potential trading opportunities within the DeFi space.--: Incorporating on-chain metrics into risk management strategies is essential for prudent trading. Traders can use metrics such as gas prices and transaction confirmation times to optimize fee management and execution timing. By considering on-chain metrics alongside risk management principles, traders can better manage their exposure to market risks and protect their capital.--: The field of on-chain metrics is continually evolving, with new metrics and analysis techniques emerging over time. Traders should stay informed about the latest developments and research in this area to enhance their understanding and refine their trading strategies. Following reputable sources, participating in online communities, and engaging with other traders can provide valuable insights and foster continuous learning.In conclusion, incorporating on-chain metrics into a comprehensive trading strategy can provide traders with a deeper understanding of Ethereum's market dynamics and enhance decision-making. By combining on-chain metrics with technical analysis, monitoring network activity, tracking token movements, and considering DeFi metrics, traders can gain valuable insights and identify potential trading opportunities. Integrating on-chain metrics into risk management strategies further enhances trading effectiveness and helps protect capital.As with any trading strategy, it is important to practice proper risk management, thoroughly test strategies, and adapt to changing market conditions. By leveraging the power of on-chain metrics alongside other market indicators, traders can strive for more informed and profitable trading in the dynamic world of Ethereum."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy50cmFkaW5ndmlldy5jb20vbmV3cy9uZXdzYnRjOmM1NTkzN2IzNjA5NGI6MC1ldGhlcmV1bS1wcmljZS1rZXktaW5kaWNhdG9ycy1zdWdnZXN0LWEtc3RyZW5ndGhlbmluZy1jYXNlLWZvci1zdXJnZS10by0yay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Key Indicators Suggest A Strengthening Case For Surge To $2K - TradingView",
        "content": "Ethereum price corrected gains from the $1,920 resistance against the US Dollar. ETH is currently supported and might soon aim for a move toward $2,000.\n\nEthereum is currently eyeing a fresh increase above the $1,920 resistance zone.\n\nThe price is trading above $1,880 and the 100-hourly Simple Moving Average.\n\nThere is a major bullish trend line forming with support near $1,880 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bullish momentum if it clears the $1,920 resistance.\n\nEthereum Price Remains Supported\n\nEthereum’s price started a decent increase above the $1,800 resistance. ETH even broke the $1,880 level before the bears appeared near $1,920 and pushed the price lower, similar to Bitcoin.\n\nThere was a downside correction below the $1,900 and $1,885 levels. The price spiked below the 50% Fib retracement level of the upward move from the $1,836 swing low to the $1,929 high. However, the bulls were active above the $1,870 level.\n\nThere is also a major bullish trend line forming with support near $1,880 on the hourly chart of ETH/USD. The trend line is close to the 61.8% Fib retracement level of the upward move from the $1,836 swing low to the $1,929 high.\n\nEther is still trading above $1,880 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,910 zone. The next major resistance is near the $1,920 level. A close above the $1,920 resistance could send Ether toward $2,000.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nThe next resistance sits near $2,040, above which Ethereum could gain pace toward $2,120. Any more gains above the $2,120 resistance zone might send the price toward the $2,200 resistance.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,920 resistance, it could continue to move down. Initial support on the downside is near the $1,885 level.\n\nThe next major support is near the $1,870 zone or the trend line. If there is a close below the $1,870 support, the price could decline toward the 100 hourly SMA. Any more losses may perhaps send the price toward the $1,815 level in the coming sessions, below which it could test $1,800.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is above the 50 level.\n\nMajor Support Level – $1,870\n\nMajor Resistance Level – $1,920"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bS1ldGgtY291bGQtYmUtcmVwbGFjZWQtYnktbGl0ZWNvaW4tbHRjLWJ1dC1pbnZlc3RvcnMtcHJlZmVyLWNvbGxhdGVyYWwtbmV0d29yay1jb2x0LWZvci10aGUtYmlnZ2VzdC1yZXR1cm5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Could Be Replaced by Litecoin (LTC), but Investors Prefer Collateral Network (COLT) for the Biggest ... - Analytics Insight",
        "content": "Ethereum (ETH) might be replaced by Litecoin (LTC). However, the Collateral Network (COLT) is gaining recognition due to its promise of high returns. This network is both emerging and innovative. With Collateral Network currently in phase one of its presale, investors are keen to participate in this exciting opportunity.\n\n>>BUY COLT TOKENS NOW<<\n\nLitecoin (LTC): Could It Replace Ethereum?\n\nLitecoin (LTC) has made considerable progress in the crypto world, with recent developments sparking interest among investors. As a faster and more scalable alternative to Bitcoin, Litecoin has long been considered a robust investment. The Litecoin foundation has many benefits. However, they face intense competition from other projects, like the Collateral Network (COLT) which is growing quickly.\n\nDespite its numerous advantages, The Litecoin foundation faces stiff competition from other projects in the market, such as the rapidly growing Collateral Network (COLT). While the Litecoin network has a loyal following, it remains uncertain whether it can genuinely unseat Ethereum as the go-to platform for developers and users or outshine the potential returns of Collateral Network (COLT).\n\nThat being said, Litecoin has been working diligently to stay ahead of the ethereum blockchain and other competition by improving its technology and forging partnerships with prominent players in the industry. These efforts are aimed at bolstering the Litecoin ecosystem and ensuring that it remains an attractive option for investors and users alike and grows market capitalization.\n\nEthereum’s (ETH) Latest Developments Could Solidify its Position\n\nEthereum (ETH) remains a dominant force in the cryptocurrency space, even as new challengers like Litecoin and Collateral Network emerge. Its latest developments, including the ongoing transition to Ethereum 2.0, promise increased growth, efficiency, and security, which could potentially solidify its position as the leading platform for smart contracts and decentralized applications.\n\nHowever, Ethereum is not without its challenges. High gas fees and network congestion issues have led some users to seek out alternatives like Litecoin and the promising Collateral Network. In response, the Ethereum network is working tirelessly to address these issues and maintain its largest cryptocurrency market dominance.\n\nFailure to address these issues could lead to a decrease in market share and a loss of popularity. Therefore, it is important for Ethereum to continue innovating and responding to the needs of its users in order to maintain its relevance and keep competitors like Litecoin (LTC) and Collateral Network (COLT) at bay. For those looking to invest in the future of Ethereum, now is the time to purchase COLT tokens before they become too expensive.\n\n>>BUY COLT TOKENS NOW<<\n\nCollateral Network (COLT): a Disruptive Lending Project\n\nCollateral Network (COLT) is an avant-garde decentralized finance (DeFi) platform that aspires to transform the lending industry. With its on-chain approach using smart contracts, the platform enables users to borrow cryptocurrency against their physical assets without intermediaries or cumbersome paperwork. This is the first and only lending protocol currently on the blockchain that is bringing off-chain assets onto the blockchain to utilize them in this manner.\n\nThese assets are then tokenized into tangible NFTs and then fractionalized. Lenders on the platform can then mint portions of the NFTs to provide funding for the borrower’s loan and get paid an agreed interest for doing so. This unique approach to asset-backed lending has generated a lot of excitement in the industry, prompting several crypto investors and blockchain enthusiasts to invest heavily in the platform.\n\nThe native token of Collateral Network is $COLT, and this token has dual tokenomics features. It serves as a governance token that gives holders the right to vote and participate in important decisions and updates regarding the network. Also, it is a utility token that will be used to perform transactions on the platform.\n\nCOLT is currently in stage 1 of its presale, and over 125 million tokens have already been sold. The price of COLT has been projected to increase by 3500% during its presale, reaching a price of $0.35. With these projections, industry experts have said now is the best time to buy into the Collateral Network ecosystem.\n\nFor more information on Collateral Network visit the website, join the presale or join the community for regular updates.\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://presale.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1hbmQtbGlkby1maW5hbmNlLWxlYWQtaW4tcmV2ZW51ZS1nZW5lcmF0aW9uLWFzLXByaWNlcy_SAVlodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tYW5kLWxpZG8tZmluYW5jZS1sZWFkLWluLXJldmVudWUtZ2VuZXJhdGlvbi1hcy1wcmljZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Ethereum, Lido Finance lead in revenue generation as prices… - AMBCrypto News",
        "content": "Ethereum and Lido Finance shone as top revenue generators, with Ethereum surpassing $1 billion in revenue.\n\nPositive price trends were observed for Ethereum, while Lido Finance showed signs of weakening bearish trend.\n\nIn the most recent revenue ranking unveiled by Token Terminal, Ethereum [ETH] and Lido Finance [LDO] made their impressive mark as two of the leading revenue generators. Analyzing the data covering the past 30 days, Ethereum triumphed in the top position, accumulating a staggering $374.9 million in revenue. Lido Finance secured the third spot with an impressive revenue of $86.9 million.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nA look at the cumulative revenue generated over the last 180 days, Ethereum’s dominance was even more evident, as it exceeded the remarkable milestone of $1 billion. While not reaching the same astronomical heights, Lido Finance still showcased a commendable performance. It secured the fifth position with a revenue of approximately $24.9 million.\n\nFurthermore, according to Crypto Fees data, Ethereum’s success extended beyond revenue figures alone. The platform collected over $6.1 million in fees, with a weekly average surpassing $9 million.\n\nLido and Ethereum contribute to the total TVL\n\nConsidering the Decentralized Finance (DeFi) ecosystem, the Total Value Locked (TVL) stood impressively at over $47 billion, as indicated by DefiLlama. Notably, Lido Finance emerged as a significant contributor to this thriving DeFi landscape, accounting for nearly 27% of the total TVL. As of this writing, Lido Finance’s TVL stood at a substantial $12.75 billion, with an encouraging upward trend depicted on the charts.\n\nFurthermore, directing our attention towards Ethereum, a dominant player in the DeFi space, its TVL amounted to approximately $27.4 billion. Lido Finance held a considerable stake in Ethereum’s TVL, contributing over 46% of the total TVL, underscoring its influential presence and impact within the Ethereum ecosystem.\n\nDaily timeframe price trend\n\nWhile it may not be directly linked to the generated revenue, Ethereum’s price has been experiencing positive trends recently. At the time of writing, ETH was trading at approximately $1,845, exhibiting a modest 1% increase on the daily timeframe.\n\nMoreover, there were indications of a gradual shift toward a bull trend, as evidenced by the movement of its Relative Strength Index (RSI).\n\nIs your portfolio green? Check out the Lido Finance Profit Calculator\n\nIn contrast, as indicated by its RSI, Lido Finance’s price movement remained trapped in a bearish trend. However, there were signs of this bearish trend weakening, accompanied by a slight increase in its price. As of this writing, LDO was trading at around $1.9, with a modest gain of over 1% in value.\n\nWith prominent positions on the revenue-generating list and positive price movements, both Lido Finance and Ethereum seem favorably positioned."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGgtd2FsbGV0LWRvcm1hbnQtc2luY2UtMjAxNS1tb3Zlcy04MDAwLWV0aC1pbi1taW51dGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "ETH Wallet Dormant Since 2015 Moves 8000 ETH in Minutes - DailyCoin",
        "content": "The whale wallet made two transactions and moved 8,000 ETH in total.\n\nThe wallet has been holding the ETH since 2015.\n\nThere was another whale wallet that woke up after 7.7 years of dormancy.\n\nEthereum (ETH) investors are known to be one of the most disciplined ones in the crypto industry. After all, ETH is the second-largest cryptocurrency and can be staked for around 5% reward.\n\nAwake and Moving\n\nA large ETH whale has just moved thousands of ETH to another wallet. According to data from Lookonchain, a wallet dormant since 2015 has transferred 8,000 ETH to a different wallet. The wallet first did a transaction of 1 ETH and then moved the remaining 7,999 after a few minutes.\n\nThe 8,000 ETH is worth around $15.14 million at the current ETH price of $1,892. However, the investor that holds the ETH bought it when the price of one token was around $0.31.\n\nThis means that the wallet paid $2,480 for 8,000 ETH.\n\nAn Ethereum ICO participant who has been dormant for 8 years woke up today.\n\n\n\nHe transferred all 8000 $ETH($14.7M) to a new address.https://t.co/1griKB9Te9 pic.twitter.com/1bvQh3zsqY — Lookonchain (@lookonchain) May 28, 2023\n\nThis is not the first time that in the past few months an ETH wallet woke up for the first since ETH ICO in 2015. At the end of April, a wallet holding 2,365 ETH made a similar move.\n\nThe ETH bought back in 2015 was also worth $0.31. In total, the investor paid around $730 for 2,365 ETH.\n\nOn the Flipside\n\nIt’s unclear why or where the 8,000 ETH moved. Some speculate that the investor moved its ETH to a different hardware wallet because of the recent Ledger controversy. However, there’s no proof to substantiate this claim.\n\nWhy This Matters\n\nIt’s interesting to see how early ETH investors are moving with their investments. While it’s unclear whether they know something others don’t, monitoring old whale wallets can help better understand the investment climate at the time.\n\nRead more about the wallet that moved 2,365 ETH after 7.7 years:\n\nWallet That Bought 2,365 ETH for $730 Wakes Up After 7.7 Years\n\nRead more about why Polygon zkEVM and zkSync Era TVLs are climbing:\n\nPolygon zkEVM and zkSync Era TVL Keeps Climbing Amid Airdrop Speculation"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tMjAyNS1jb2xsYXRlcmFsLW5ldHdvcmstcHJlZGljdGVkLXRvLXJpdmFsLWV0aC1pbi1ncm93dGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction 2025: Collateral Network Predicted To Rival ETH In Growth - Analytics Insight",
        "content": "Following its recent upgrade, analysts are extremely bullish on Ethereum’s (ETH) future. No project in the industry has as much influence as Ethereum, and now it’s easier than ever for investors to stake their Ether.\n\nWith this in mind, many investors believe that Ethereum could hit an all-time high by 2025. At the same time, Collateral Network (COLT) could rival Ethereum, with price predictions suggesting COLT tokens will surge by 3500% in the next six months.\n\n>>BUY COLT TOKENS NOW<<\n\nEthereum (ETH) Activity On the Rise But Its Price Crashes\n\nEthereum is used as the foundation for thousands of projects throughout the DeFi market. It’s a popular mining option, and its popularity among stakers has grown exponentially since the Shapella update. However, despite its recent success, Ethereum’s price has declined.\n\nAfter a temporary rally, Ethereum has decreased in value by 5.81%, with one Ethereum (ETH) trading at $1,776.33 at the time of writing. Additionally, Ethereum mining has become significantly less profitable.\n\nGiven the rising cost of electricity worldwide, miners’ profits have decreased, and smaller miners are beginning to make a loss. As a result, Ethereum mining could become monopolized, much like Bitcoin (BTC). While this could be bad for smaller miners, large mining operations will almost definitely capitalize.\n\nAs the DeFi market continues to expand, analysts believe that Ethereum will increase in value, potentially hitting an all-time high during the next bull market. However, given its high price, some investors may be unable to profit from this growth.\n\nCould Collateral Network (COLT) Offer Better Returns Than Ethereum?\n\nBy 2025 the crypto industry will have changed significantly, with more real-world applications than ever. One project that plans to pioneer this development is Collateral Network (COLT). Collateral Network is currently in stage one of its presale and has a long-term roadmap designed to disrupt the trillion-dollar lending industry.\n\nWith industry experience in both DeFi and lending, the Collateral Network development team spotted a huge gap in the market. Most lending processes are outdated, and few institutions will let individuals take loans against their assets. This forces individuals to sell their assets, often at below-market rates. Collateral Network lets individuals unlock liquidity against their physical assets by bringing them on-chain as fractionalized NFTs.\n\nOnce minted, investors can buy NFT fractions to loan money to borrowers. As a lender, investors will earn an interest rate, which is paid out weekly until the borrower fully repays the loan. Not only is this process easier, but it prevents the need for excess paperwork and unnecessary credit checks.\n\nCollateral Network has been doxxed and audited to give investors peace of mind. Furthermore, security features such as 2FA are implemented on the platform to prevent any risk of a scam.\n\nIn the circumstance that a borrower defaults on their loan, their asset will be sold at a private auction to Collateral Network token holders, who will be able to purchase the asset at a below-market rate. This ensures lenders always recoup their investments.\n\nWith less than 35% of stage one’s tokens still available, Collateral Network is expected to sell out in the next two weeks, after which COLT tokens will increase in price to $0.0168. Furthermore, the price of the token is expected to increase up to $0.35 before the presale ends and surge by 100x once it hits major exchanges. Therefore, the best time to acquire COLT tokens is now.\n\nFor more information on Collateral Network, visit the website, join the presale, or join the community for regular updates.\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://presale.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMitwFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzA1LzI5L3RoZS1uZXh0LWV0aGVyZXVtLXNlYXJjaGluZy1mb3ItdGhlLW5leHQtYnVsbC1ydW4tbW9vbnNob3QtaGlnaC1wb3RlbnRpYWwtY3J5cHRvLWNvaW5zLXdpdGgtYXBlbWF4LW9yYm9maS1iaWctZXllcy1haWRvZ2UtbG92ZS1oYXRlLWludS1hbmQtbW9yZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "The Next Ethereum. Searching For The Next Bull Run Moonshot High Potential Crypto Coins With ApeMax, Orbofi, Big ... - The Crypto Basic",
        "content": "The cryptocurrency market undergoes noticeable cycles characterized by variations in price, adoption, and overall market sentiment. These cycles are commonly known as bull runs when prices and market sentiment is up, and bear markets when there is a cooling-off phase.\n\nKeen investors who can search for and find high return coins before a bull run often achieve significant gains and ROIs from the rising bull market tides. For example, buyers who had the foresight to buy and hold Ethereum in 2016 when 1 ETH was worth a mere $1 have reaped massive benefits when the same coin price hit $4,815 during the last bull market peak in November 2021.\n\nWith the growing interest and increasing momentum in the cryptocurrency market, buyers are diligently exploring the terrain in pursuit of profitable and high APR prospects. Their objective is to discover undiscovered new crypto coins that possess considerable potential prior to the forthcoming bull run and ensuing market upswing and high APYs.\n\n- Advertisement -\n\nDrawing from meticulous market research and expert opinions, this article presents readers with a comprehensive overview of crypto bull runs, and gives some examples of coins which may have high potential in the next bull market upswing.\n\nIt is important to exercise caution and prudence when considering buying cryptocurrency, and to evaluate your personal goals and risk tolerance before diving into the purchase of cryptocurrencies. That being said, for buyers well versed in the space, there are many exciting new coins worth studying in the market.\n\nLeading our highlighted coin selection is ApeMax, an intriguing new token that introduces an innovative staking mechanism, enabling users to earn rewards by participating in staking activities.\n\nWhen is the next crypto bull run market?\n\nRecognizing a cryptocurrency bull market necessitates a thorough examination of multiple factors and indicators. While no approach can ensure complete precision, experts believe that these are some essential factors to consider that can aid in identifying a potential bull market:\n\n- Advertisement -\n\nBuyer Sentiment and the Fear and Greed Index\n\nIncreases in trading volumes, market capitalizations, and coin prices\n\nGreater institutional adoption\n\nIncrease utility and new user adoption rates\n\nList of 10 moonshot high potential crypto coins:\n\nApeMax Big Eyes Chainlink Polkadot Cardano Shiba Inu Tamadoge Love Hate Inu AiDoge Orbofi\n\nMoonshot high potential crypto coins:\n\nApeMax\n\nThe eagerly awaited presale stage of ApeMax has commenced, offering an enticing opportunity for buyers to obtain ApeMax coins at exceptional rates. Regarded as one of the standout cryptocurrency presales to monitor in 2023, ApeMax introduces pioneering tokenomics that empower users to earn rewards through staking activities across various entities. This groundbreaking approach establishes a solid groundwork for future expansion and advancement.\n\nEmbark on a savings adventure with ApeMax’s captivating Early Birds Loot Boxes, crafted for early adopters seeking to optimize their ApeMax experience. By acquiring tokens through these exclusive loot boxes, presale participants can unlock substantial discounts of up to 50% on ApeMax tokens. This presents a remarkable opportunity to amplify the advantages of the ApeMax presale and make the most out of this exciting opportunity.\n\nAmidst a cryptocurrency landscape filled with replicas and copycats, ApeMax stands out as a true trailblazer, introducing a crypto coin that challenges traditional conventions. Boasting unique tokenomics, practical real-world use cases, and a powerful brand image featuring a smiling ape riding a rocket, ApeMax is in a league of its own. This exceptional coin captivates the imagination of crypto enthusiasts, carving its distinct path forward.\n\nBig Eyes\n\nBig Eyes captivates the altcoin sector, raising $45.7 million in presale. $BIG tokens on Ethereum allow users to explore NFTs and create engaging digital content.\n\nChainlink\n\nChainlink revolutionizes cryptocurrency by bridging smart contracts and real-world data. Chainlink focuses on information reliability, security, and accurate data integration in blockchain networks.\n\nPolkadot\n\nPolkadot, a highly desired cryptocurrency, facilitates scalability and interoperability across distinct blockchains, fostering a connected and decentralized ecosystem with smooth data exchange.\n\nCardano\n\nCardano, a novel cryptocurrency, prioritizes research-led advancements, aiming to establish a resilient foundation for decentralized applications and smart contracts.\n\nShiba Inu\n\nShiba Inu coin rose to prominence as a notable cryptocurrency due to its association with the Shiba Inu dog breed and Dogecoin. Shiba Inu’s market cap hovers over $5 billion according to data from CoinGecko.\n\nTamadoge\n\nTamadoge, a prominent presale coin, distinguishes itself as a recently launched meme coin introducing a play-to-earn concept within the Tamadoge GameFi ecosystem.\n\nLove Hate Inu\n\nLove Hate Inu, a popular meme coin, sets itself apart thanks to its innovative utilization of a blockchain-based voting system, enabling users to engage in polls and earn.\n\nAiDoge\n\nAiDoge serves as the native token for a novel AI-generated meme platform and tool. It provides users with an engaging meme creation experience powered by artificial intelligence.\n\nOrbofi\n\nOrbofi coin ($OBI), the native token of the Orbofi ecosystem, is tied to the platform’s vision of being the Amazon of AI-generated content for web3.\n\n10 moonshot high potential crypto coins – Conclusion\n\nOffering a thorough analysis, this comprehensive guide unravels the early indicators that most experts look at to identify a crypto bull run, providing valuable insights into its fundamental nature. Additionally, it showcases a collection of interesting crypto coins that have garnered considerable attention from buyers who are eagerly looking to acquire them in anticipation of the next bull run and the ensuing market surge.\n\nApeMax revolutionizes the cryptocurrency arena with its pioneering tokenomics, reshaping the landscape by offering token holders the chance to earn rewards through “Boost-to-Earn” staking. The ApeMax presale provides an opportunity to acquire tokens at advantageous prices. Nevertheless, it is essential to exercise caution and acknowledge that buying cryptocurrencies demands careful deliberation, as they may not align with everyone’s risk appetite. Thorough evaluation and extensive research are crucial in order to make informed decisions within this realm.\n\nApeMax Official Website"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC92aXNhLWlzLXV0aWxpemluZy1ldGhlcmV1bXMtZXJjLTIwLWZvci10cmFuc2FjdGlvbi1mZWVzLXRyYWRlY3VydmUtdG8tb2ZmZXItbG93LXRyYWRpbmctZmVlcy1vbi1pdHMtcGxhdGZvcm0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Visa Is Utilizing Ethereum's ERC-20 For Transaction Fees, Tradecurve To Offer Low Trading Fees On Its Platform - Analytics Insight",
        "content": "Visa is the latest real-world business to accept Ethereum for payments. This collaboration has huge implications for the wider DeFi environment and could significantly speed up DeFi adoption.\n\nHowever, with Ethereum being known for its high and somewhat unpredictable fees, some investors believe that it may struggle to gain widespread traction. Meanwhile, Tradecurve offers extremely low fees on its platform which makes it a more viable option for mainstream crypto adoption.\n\n>>Register For The Tradecurve Presale<<\n\nCould The Visa Development Speed Up Ethereum Adoption?\n\nFrom May 25th, Visa will start to use ERC Ethereum tokens for transactions. Using a Visa card, individuals will be able to spend Ethereum and any ERC20 token is 30 countries and 45 million destinations.\n\nThis collaboration will be supported by an app, which will work like most banking apps. Individuals will be able to change their pin, freeze and order new cards, as well as chat to support teams if required.\n\nAlthough Ethereum’s value is yet to replicate its new potential, we could see cryptocurrency become a normal means of payment in just a few years.\n\nWhat Does This Mean For Ethereum?\n\nUntil now Ethereum was normally used to pay for DeFi goods and services and trade cryptocurrency. With the Visa collaboration, Ethereum can be used to buy everyday goods from stores, greatly increasing its potential utility.\n\nHowever, for Ethereum to gain mass adoption outside of the DeFi space, its issue of high fees will first need to be resolved. In some circumstances Ethereum users are still paying over $100 in gas fees just to make a transaction. As a result, Ethereum transactions may not be suitable for buying everyday products for the foreseeable future.\n\nTradecurve’s Second Presale Round On Track To Sell Out In May\n\nTradecurve is built on the ​​Ethereum blockchain and looks to become a top three exchange in the next few years. While this is an ambitious goal, Tradecurve has the utility to potentially dominate the market. With investor confidence being rocked following the collapse of FTX, many investors are now looking for decentralized alternatives. However, many alternatives don’t offer the assets they’re looking for.\n\nAs a decentralized hybrid exchange, Tradecurve lets investors buy DeFi assets and derivatives without the need for KYC checks. Instead, users can trade global asset classes whilst protecting their privacy through DeFi capabilities.\n\nTrading is fully anonymous, with traders using external wallets to connect, buy assets and disconnect as they please. This option of a self-custody wallet lets investors maintain full control of their assets and prevents unethical trading on behalf of an exchange.\n\nJust one account is needed to trade traditional and DeFi assets, and can be created with an email. Once created, investors will be able to access one of the widest range of assets on any platform and will have access to Tradecurves lucrative educational features. These will include AI and copy trading subscriptions, as well as a trading academy for new investors.\n\nTradecurve’s second presale round has sold out. TCRV tokens have increased from $0.012 to $0.015, with analysts predicting further price increases could occur weekly. This growth has helped Tradecurve attract thousands of daily new investors, as well as Ethereum whales looking for great returns.\n\nFor more information about the Tradecurve presale:\n\nClick Here For Website\n\nClick Here To Buy TCRV Presale Tokens\n\nFollow Us Twitter\n\nJoin Our Community on Telegram\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaXRjb2luLWFuZC1ldGhlcmV1bS1jb250aW51ZWQtdG8tc2x1bXAtYXMtY29uY2VybnMtYWJvdXQtdGhlLXVzLWRlYnQtY2VpbGluZy05LWFsdGNvaW5zLWZvci14MTAwLWdhaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Bitcoin And Ethereum Continued to Slump as Concerns About the Us Debt Ceiling - 9 Altcoins for X100 Gains - Analytics Insight",
        "content": "As the US debt ceiling crisis casts a shadow over global markets, leading cryptocurrencies Bitcoin and Ethereum have taken a hit.\n\nBitcoin’s value fell by 1.8%, reaching its lowest point in over two months, while Ethereum experienced a similar decline, plunging by over 2%.\n\nThis downturn, resulting from the uncertainty surrounding the debt ceiling and the Fed’s hawkish stance, also impacts other risk assets including cryptocurrencies.\n\nHowever, as these market leaders falter, it paves the way for altcoins like Wall Street Memes ($WSM), AiDoge (AI), SpongeBob Token (@SPONGE), Ecoterra (ECOTERRA), yPredict (YPRED), DeeLance (DLANCE), Launchpad (LPX), and Copium ($COPIUM) to take center stage.\n\nLet’s dig deeper.\n\n>>>Get the Best Presale Token Now<<<\n\n9 Altcoins With 100X Chance – Quick Overview\n\nTake a quick look at the eight best altcoins that experts predict can deliver astounding gains of up to 100X.\n\n9 Altcoins With 100X Chance– Detailed Analysis\n\nWith the basics covered, let’s move on to a more detailed look at the altcoins that can promise 100X returns.\n\nWall Street Memes ($WSM) – Branded as the “King Of Meme Coins”\n\nMeme coins have been riding a wild wave of popularity, exemplified by the surge of PEPE coin. Now, $WSM – the Wall Street Memes token is poised to soar even higher.\n\nBoasting over a million followers across social platforms and having caught the attention of Elon Musk, $WSM’s potential seems limitless. This wide recognition also hints at a strong possibility of a Binance listing soon.\n\nAdd to this the speed at which their first NFT collection, Wall St Bulls, sold out in 2021, and you have a true meme crypto contender.\n\nDon’t miss out – visit their website and secure your $WSM tokens now.\n\n>>>Buy WSM Now<<<\n\nAiDoge (AI) – Overall the Best Presale Asset Available\n\nIn the vanguard of the meme-creation landscape, AiDoge (AI) injects the art of humor with a dose of high-end AI technology.\n\nThis impressive project spins out viral, laugh-inducing memes while rewarding users with its digital currency.\n\nNot just that, the secure blockchain foundation of the platform ensures an end to copyright woes. AiDoge’s ongoing presale has already caught the attention of investors worldwide, raking in a staggering $14.5 million.\n\nSeize the chance to be part of this phenomenal project.\n\n>>> Buy AiDoge Now<<<\n\nSpongeBob Token ($SPONGE) – Marked as the Next PEPE Coin\n\nEmerging amidst the ripple effect of Pepe Coin and several potent meme coins, SpongeBob Token presents an intriguing narrative in the meme coin discourse this year.\n\nWithin days of its debut, it secured a massive following, propelled by an impressive price surge and key exchange listings.\n\nNotably, $SPONGE stands apart from its rivals, manifesting transparency through the publication of vital certificates that dispel common fears of rug pulls.\n\nThis demonstration of credibility is a major draw for investors, instilling faith in the token’s long-term prospects.\n\n>>> Buy SpongeBob Token Now<<<\n\nEcoterra (ECOTERRA) – Promoting Green Choices Through Blockchain\n\nEcoterra’s unique Recycle2Earn mechanism motivates users to make eco-friendly choices, turning recycling efforts into instant token rewards.\n\nCurrently in its 7th presale phase, Ecoterra presents an accessible entry point for newcomers, with tokens priced at a meager $0.0085 USDT.\n\nThe platform’s easy-to-use app accelerates this environmentally conscious journey, fostering the mass adoption of greener habits.\n\nBy bridging the gap between cryptocurrencies and sustainable choices, Ecoterra is truly paving the way for a greener future.\n\n>>> Buy Ecoterra Now<<<\n\nyPredict (YPRED) – Empowering Crypto Trading with AI Predictions\n\nIn the expansive realm of crypto, yPredict emerges as an unparalleled predictive model platform.\n\nThe brainchild of proficient AI developers, yPredict utilizes robust mathematical techniques to craft industry-specific forecasts.\n\nYPRED, the platform’s native token, serves as the key to these high-quality analytics, enabling users to tap into powerful trading signals.\n\nEven for the inexperienced, yPredict’s intuitive interface streamlines token purchase and model subscriptions.\n\nWith a DAO voting system to safeguard quality, staking opportunities for extra returns, and a capped supply of 100 million YPRED tokens, yPredict presents itself as an enticing investment prospect.\n\n>>> Buy yPredict Now<<<\n\nDeeLance (DLANCE) – Innovative Freelancing with Blockchain\n\nIn the dynamic world of freelancing, DeeLance stands out, harnessing the power of blockchain to craft a transparent ecosystem for both sides\n\nThe platform’s utilization of smart contracts, NFT tokenization, and an escrow payment service establishes a trustful environment.\n\nLow fees make DeeLance an attractive proposition, with $DLANCE tokens now available in presale, currently priced at $0.057. The future of freelancing is here, blending decentralization, fair practices, and seamless transactions.\n\n>>> Buy DeeLance Now<<<\n\nLaunchpad (LPX) – Pioneering the Web3 Revolution\n\nOn the crypto horizon, Launchpad XYZ, a soon-to-launch web3 platform, has generated notable interest.\n\nIts native token, $LPX, has accrued over $600,000 in its presale. Given the token’s price increase from $0.035 to $0.0445, quick acquisition might be wise before a potential future hike.\n\nLaunchpad XYZ’s mission?\n\nTo provide a user-friendly portal for top blockchain projects, encompassing NFTs to play-to-earn games. Staking $LPX offers advantages like discounted fees and presale whitelisting.\n\nAs Launchpad XYZ aims to simplify the transition from Web2 to Web3, it presents an exciting opportunity in the crypto landscape.\n\n>>> Buy Launchpad XYZ Now<<<\n\nCopium ($COPIUM) – Turns Your Mistakes into Profits\n\n$COPIUM, a community-oriented crypto token, offers a unique proposition. This token capitalizes on resilience and camaraderie among those who have weathered the volatility of the crypto world, turning regrets into potential profits.\n\nAttracting investors for its distinct nature and a lucrative NFT airdrop feature, $COPIUM promotes a sense of belonging in the digital currency realm.\n\nNotably, a recent announcement of a substantial token burn, reducing the supply by 30%, raises anticipation of potential price increases.\n\nAs part of the meme token trend, $COPIUM brings humor into crypto investing, offering a vibrant blend of community and profit.\n\n>>> Buy $COPIUM Here<<<\n\nSolana (SOL) – High Scalability & Decentralization\n\nSolana, has caught the market’s eye with its high scalability, becoming an optimal platform for dApp developers.\n\nIts distinct ‘Proof-of-History’ consensus allows for a whopping 65,000 transactions per second, maintaining decentralization with minimal transaction costs.\n\nThis high-speed, low-cost formula has positioned Solana as a preferred hub for NFT creation and trading, blockchain gaming, and DeFi protocols.\n\nOffering strong competition to Ethereum, Solana’s SOL tokens, owing to their affordability and broad access, are a promising choice for beginners in the crypto market.\n\nThe Conclusion\n\nAs Bitcoin and Ethereum grapple with the uncertainties of the US debt ceiling crisis, they continue their downward journey, challenging investor confidence.\n\nThis volatile environment, however, presents a golden opportunity to explore the untapped potential of altcoins.\n\nInnovative assets like Wall Street Memes, AiDoge, SpongeBob Token, Ecoterra, yPredict, DeeLance, Launchpad, and Copium are not only resilient to market fluctuations, but they also hold the promise of significant gains.\n\nThey represent diverse areas of technology, sustainability, and meme culture, offering a rich selection for investors seeking alternatives to the traditional crypto heavyweights.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMizQFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLW1heS0yOC1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNjA1MjY20gHRAWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktaW4taW5kaWEtbWF5LTI4LWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE2MDUyNjYvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Above $27,000 Mark As Neo Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $27,000 and $18,00 marks, respectively, on early Sunday morning. Other popular altcoins — including the likes of Ripple (XRP), Solana (SOL) — landed in the positive as overall prices saw minor gains across the board. Neo (NEO) emerged to be the biggest gainer, seeing a 24-hour jump of over 11.53 percent. Render Token (RNDR), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.13 trillion, registering a 24-hour gain of 1.18 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $27,146.92 seeing a 24-hour gain of 1.53 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 23.66 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,847.67, marking a 24-hour gain of 0.80 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.60 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 2.21 percent as per CoinMarketCap data, currently priced at $0.07282. As per WazirX, Dogecoin price in India stood at Rs 6.3111.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 2.21 percent. At the time of writing, it was trading at $89.79. LTC price in India stood at Rs 7,653.53.\n\nRipple (XRP) price today\n\nXRP price stood at $0.4734, seeing a 24-hour gain of 0.80 percent. As per WazirX, Ripple price stood at Rs 41.0101.\n\nSolana (SOL) price today\n\nSolana price stood at $20.42, marking a 24-hour gain of 4.96 percent. As per WazirX, SOL price in India stood at Rs 1,809.00.\n\nTop crypto gainers today (May 28)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nNeo (NEO)\n\nPrice: $10.88\n\n24-hour gain: 11.53 percent\n\nConflux (CFX)\n\nPrice: $0.3234\n\n24-hour gain: 6.44 percent\n\nVeChain (VET)\n\nPrice: $0.02039\n\n24-hour gain: 5.39 percent\n\nMask Network (MASK)\n\nPrice: $4.17\n\n24-hour gain: 5.33 percent\n\nSolana (SOL)\n\nPrice: $20.42\n\n24-hour gain: 4.98 percent\n\nTop crypto losers today (May 28)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nRender Token (RNDR)\n\nPrice: $2.66\n\n24-hour loss: 4.02 percent\n\nNexo (NEXO)\n\nPrice: $0.6662\n\n24-hour loss: 2.08 percent\n\nKlaytn (KLAY)\n\nPrice: $0.1874\n\n24-hour loss: 0.46 percent\n\nFlare (FLR)\n\nPrice: $0.02556\n\n24-hour loss: 0.34 percent\n\nImmutable (IMX)\n\nPrice: $0.7391\n\n24-hour loss: 0.23 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3Byb21vdGluZy1maW5hbmNpYWwtaW5jbHVzaW9uLXdpdGgtZG9nZW1peWFnaS1iaXRjb2luLWFuZC1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Promoting Financial Inclusion with DogeMiyagi, Bitcoin, and Ethereum - Analytics Insight",
        "content": "“Finance For All!” Unleashing Financial Inclusion With Bitcoin, Ethereum, And DogeMiyagi\n\nOver the years, we’ve witnessed amazing technological advancements in almost every sector, from medicine to finance. Yet, globally, some 1.4 billion adults remain unbanked, with little to no access to useful and affordable financial products and services that meet their needs.\n\nCryptoevangelists believe digital currencies are a revolutionary way of advancing financial inclusion, and it is easy to see why they do. Cryptocurrency can offer a variety of other financial services in addition to giving users access to conventional banking services.\n\nDogeMiyagi (MIYAGI), the new coin on the block, is looking to push the limits of what can be done for individuals in need of financial relief. While Bitcoin (BTC) and Ethereum (ETH) have paved the way for blockchain technology, DogeMiyagi adds a playful twist to the mix.\n\nThe Power Of DogeMiyagi’s Accessibility\n\nOne of the defining characteristics of DogeMiyagi (MIYAGI) is its accessibility. Unlike Bitcoin or Ethereum, which can require technical knowledge and significant investment, MIYAGI has a low barrier to entry.\n\nIts user-friendly interface and community-driven ethos make it an ideal digital currency for individuals in underbanked regions who may lack access to traditional banking services. DogeMiyagi’s inclusive nature allows people to participate in the global economy and transact with ease, fostering financial empowerment.\n\nDogeMiyagi’s Social Impact And Community-Driven Initiatives\n\nDogeMiyagi’s unique branding, inspired by the popular Doge meme and pop culture reference of Mr Miyagi from the 80s classic, The Karate Kid, has propelled it to the forefront of social media conversations. This playful approach has helped DogeMiyagi gain a massive following, including a passionate community of users who actively engage with the currency.\n\nLeveraging this momentum, DogeMiyagi has the potential to facilitate grassroots movements and community-driven initiatives focused on financial inclusion. By harnessing the collective power of its supporters, it can address specific challenges faced by underbanked communities and drive positive change.\n\nThe Role Of Bitcoin In Financial Inclusion\n\nBitcoin, as the pioneer of cryptocurrencies, has undoubtedly made significant contributions to financial inclusion. Its decentralized nature and borderless transactions have enabled individuals in underserved regions to access financial services and participate in the global economy.\n\nHowever, Bitcoin’s volatility and limited scalability have posed challenges to widespread adoption in underbanked areas. Additionally, the technical complexity associated with Bitcoin can act as a barrier for those without technical expertise.\n\nEthereum’s Impact On Financial Inclusion\n\nEthereum, renowned for its smart contract capabilities, has introduced innovative possibilities for financial inclusion. Its programmable nature allows for the development of decentralized applications (DApps) and the creation of financial services tailored to specific needs.\n\nEthereum’s vast ecosystem has fostered the emergence of microfinance platforms, decentralized lending protocols, and crowdfunding initiatives.\n\nHowever, similar to Bitcoin, Ethereum faces challenges of scalability and high transaction fees, which can limit its accessibility in underbanked regions.\n\nWhile Bitcoin and Ethereum have paved the way for financial inclusion by revolutionizing the concept of digital currencies, DogeMiyagi brings a fresh perspective with its accessibility and playful approach. By lowering the entry barriers and leveraging its vibrant community, DogeMiyagi has the potential to reach underbanked regions and empower individuals economically.\n\nAs the landscape of digital currencies evolves, embracing the inclusive and fun-loving spirit of DogeMiyagi can unlock new avenues for financial empowerment across the globe.\n\nFor More Information On DogeMiyagi:\n\nWebsite: https://dogemiyagi.com\n\nTwitter: https://twitter.com/_Dogemiyagi_\n\nTelegram: https://t.me/dogemiyagi\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9tYWtlLWEtZm9ydHVuZS13aXRoLWV0aGVyZXVtLWFzLWl0LWhpdHMtNTEwMDAtaW4tNy15ZWFycy12YW5lY2tzLW1hc3RlcnBsYW4v0gF0aHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL21ha2UtYS1mb3J0dW5lLXdpdGgtZXRoZXJldW0tYXMtaXQtaGl0cy01MTAwMC1pbi03LXllYXJzLXZhbmVja3MtbWFzdGVycGxhbi8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Make a Fortune with Ethereum as it Hits $51,000 in 7 Years – VanEck’s Masterplan - Crypto News Flash",
        "content": "Ethereum (ETH) could have a base case price target of $11,848.62 and a bull case of $51,000 according to VanEck.\n\nHowever, the asset could fall to as low as $343.29 in a bear case.\n\nEthereum (ETH), the second largest crypto by market cap, has been tipped to go as high as $51,000 in seven years. In a new research report that focuses on the base, bear, and bull case of the digital asset, Global investment manager VanEck observed the performance of Ethereum when certain conditions are met.\n\nThis prediction was made based on the possibility that Ethereum becomes the largest open-source global settlement platform.\n\nWe base these estimates on the thesis that Ethereum becomes the dominant open-source global settlement network that hosts substantial portions of the commercial activity of business sectors with the highest potential to gain from moving their business functions to public blockchains. In a portfolio of similar smart contract platforms, we assume to own a collection of call options, with the dominant platform likely to take a majority market share.\n\nOnce it becomes the top settlement system or smart contract platform, there is a high possibility that the base case price target would be $11,848.62. In a bull case, the price would target $51,006.\n\nHowever, things could go bad if it no longer becomes the top settlement system. The report estimates that a 15 percent dominance of Ethereum in this regard could send the price down to $343.29 in the bear case.\n\nEthereum is beyond transactional currency\n\nOne interesting observation by the researchers is that Ethereum has evolved over the years to establish itself beyond a transactional currency or a consumable commodity to become a store of value assets. This makes it similar to Bitcoin, however, operates a little differently.\n\nWe believe that ETH, while not a complete store of value like Bitcoin due to Ethereum’s demonstrated mutability of code and an evolving social consensus focused on utility, will nevertheless become a store-of-value asset for state actors looking to maximize human capital (vs. Bitcoin, which maximizes stranded energy).\n\nThis prediction is quite interesting, but far lower than Ark Invest’s Cathie Wood’s prediction. Last year, she predicted that Ethereum could reach a $20 trillion market cap by the year 2030. Decentralized finance is gaining traction, and could be a catalyst for Ethereum to displace many traditional financial services according to Cathie Wood as reported by Markets Insider.\n\nThe second-largest cryptocurrency, according to Ark Invest, will meet or surpass a $20 trillion market capitalization by 2030. Each coin would be priced at around $170,000-$180,000. Based on its current price of about $2,480, ether would have to jump by about 7,200% to meet the firm’s target. As financial services move on-chain, decentralized networks are likely to take share from existing financial intermediaries.\n\nJust recently, Ethereum announced one of its biggest upgrades, the Shapella upgrade, which enables users to unstake or withdraw their staked ETH. However, its constantly rising gas fee is becoming a major challenge and would need to be addressed for the asset to surge to these predicted price points.\n\nThe market sentiment around ETH is currently bullish and has surged by 5.61 in the last seven days to trade at $1,903.45.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMjgvd2hhdC1ldGhlcmV1bS1tZXYtYm90cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "What are Ethereum MEV bots? - The Cryptonomist",
        "content": "This article will discuss the topic of MEV bots, which are a series of individuals who exploit powerful hardware and specially designed techniques to make a profit in the business of producing blocks in the Ethereum blockchain.\n\nThis is a very complex topic, and an initial introduction to the topic of block validation in Ethereum is necessary again to be able to understand what MEV bots are and why it is interesting to talk about them.\n\nAll the details below.\n\nAn initial premise: the role of the validator and searchers\n\nAs anticipated, before talking about MEV bots on Ethereum it is essential to have a 360-degree view of how block validation and publishing works on the blockchain devised by Vitalik Buterin.\n\nWhile it is understood that MEV techniques can also be used on other networks, in this article we will focus exclusively on the Ethereum chain so as not to create confusion.\n\nOn it, all transactions are initially grouped in the mempool, waiting to be grouped and added to a block, before actually being published.\n\nUp to that point, the transactions remain pending and the crypto assets are not made available to the user who is to receive them.\n\nThe task of producing the final block is up to the validator (with proof-of-work it was the miner) who can independently choose which transactions to include first.\n\nAt this point it is IMPORTANT to understand that the figure of the validator gains from this activity in two ways: from the block reward (in the case of Ethereum, 2 ETH per block) and from the TX fees of users who want to have priority of execution.\n\nHence, it is in the validator’s interest to choose the transactions that “pay the most” and create a block that rewards it the most in terms of tx fees.\n\nConsider that sometimes these exceed the amount of the block reward.\n\nThe essence of the EVM, which we will discuss in more detail in the next section, is based on this very concept, namely, the fact that the block producer can sort the transactions in a block at will, making them execute according to a certain chronology that will then have certain effects on the market.\n\nAnother very important figure in this process is that of searchers, i.e., individuals who provide a “package” to the validator with a possible ordering of transactions, so as to simplify the work for it.\n\nThis is an already preset transaction combination that validators can exploit to earn as much from TX fees as possible, while rewarding the searchers with a commission for their work.\n\nHowever, the gain for searchers lies not so much in the commission they are entitled to, but in the effects that are caused when a validator chooses to publish their proposed block version.\n\nIn fact, by doing so, the searcher can take advantage of arbitrage opportunities on the DEX by choosing to order transactions in such a way as to create slippage on the price of an asset and take advantage of this price difference.\n\nThen there are other techniques that searchers and validators can exploit, sometimes trying to rip each other off by following the profit motive exclusively\n\nThe operation of Ethereum MEV bots in detail and the value creation process\n\nAfter the initial preamble, we can finally talk about MEV bots on Ethereum.\n\nThe term “MEV” refers to “Maximum Extractable Value,” which is that set of techniques that seek to maximize the profit of an individual (whether a validator, searcher, or relayer) by choosing to include, omit, or reorder certain transactions in a blockchain.\n\nSince the Ethereum blockchain is subject to the use of smart contracts and is full of decentralized marketplaces ranging from simple DEX to lending platforms, we understand well that choosing the ordering with which multiple transactions can be executed totally changes the end result, especially when large amounts of cryptocurrency are involved.\n\nIt is not always the validator who gains based on the sorting of tx in a block: although this party earns the block reward and user tx fees, sometimes other players benefit leading to multimillion-dollar profits even at the expense of the validators themselves.\n\nIt is good to understand that the person who exploits these EVM techniques is not just any user, but an expert who uses very complex hardware and specialized software in identifying the best strategy and carrying this out in an automated way.\n\nWe can summarize all EVM techniques in the following cases:\n\nasset price arbitrage on different decentralized markets;\n\nfrontrunning or sandwich attacks;\n\nloan liquidations in DeFi.\n\nLet’s try to delve into the second case, that is, frontrunning attacks: by exploiting the capabilities of the individuals involved in block publishing, it is possible to anticipate a significant purchase order (previously left pending in the mempool) to create an increase in the price of an asset, and always exploit the logic of transaction ordering to place a sell order in the next instant and sell the same asset at a higher price than the initial one.\n\nThis is more specifically referred to as a sandwich attack when a buy tx is placed before a major order (e.g., a purchase of 1000 ETH) and a sell tx is placed immediately after.\n\nThe slippage caused by the whale order represents the profit of the MEV strategy.\n\nThe world of EVMs is extremely complex, and these examples we have provided represent only the tip of the iceberg of a much more complicated set of strategies and techniques that have been carefully crafted to try to make a profit.\n\nIn any case, it is important to remember that when a validator or searcher profits from such a trade, for example by “artificially” creating a price slippage on a DEX, there is always a counterparty that loses the same dollar value.\n\nHere too, as is the case in trading, the game is zero-sum: when it comes to money, there is no ethics.\n\nThe pros and cons of the MEV techniques used by bots on Ethereum\n\nYou are probably wondering what the advantage is of having a structure of bots on Ethereum that exploit MEV strategies, sometimes playing dirty, to get rich behind someone else’s back simply by managing the sorting of tx in a blockchain.\n\nThere are different currents of thought that praise or criticize the essence of MEVs and these strategies.\n\nThose in favor of MEV bots mainly believe that this kind of on-chain activity and competition promotes stable asset prices in DeFi protocols and makes lending platforms less dangerous.\n\nIt is precisely because of the MEV bots that on Sushiswap and Uniswap, for example, the price of ETH is more or less always the same and no major variations occur that would harm trading on these protocols.\n\nIn fact, arbitrage opportunities are also and mainly generated by MEV strategies, but they are in fact exploited and concluded within the same block i.e. a few thousandths of a second later.\n\nOn the other hand, those who are against these maximum value extraction techniques argue that the user experience is definitely more unpleasant given the gas price increase caused by MEVs on Ethereum.\n\nIn the struggle to get the tx sorting preferred, individuals involved in this process increase tx fees to the point of forcing even simple users who want to make a simple cryptocurrency transfer to pay disproportionate fees.\n\nIn addition, some whale in carrying out on-chain crypto buying or selling transactions might suffer greater than normal slippage if he or she were targeted by a MEV, who for his or her part would earn the price difference caused.\n\nIn conclusion, MEV strategies represent an interesting insight into Ethereum’s blockchain architecture and the roles inherent in blockchain organization.\n\nTo date, this set of techniques is looked upon favorably by the Ethereum community, but as the ecosystem is constantly evolving, insiders are constantly monitoring the situation to prevent MEVs from threatening the consensus and integrity of the network, which has always been preserved so far.\n\nWe will see what the future of these bots on Ethereum will be and whether Vitalik and his own foundation will allow them to evolve or create solutions to destroy them."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vdGltZXN0YWJsb2lkLmNvbS9jcnlwdG8tZXhwZXJ0LXNheXMteHJwLXdpbGwtaGl0LTUtYmFzZWQtb24tdGhpcy1ub3RhYmxlLWV0aGVyZXVtLWV0aC1jb21wYXJpc29uLWRldGFpbHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 May 2023 07:00:00 GMT",
        "title": "Crypto Expert Says XRP Will Hit $5 Based On This Notable Ethereum (ETH) Comparison: Details - Times Tabloid",
        "content": "Mason Versluis, a closely followed crypto podcaster, who founded Gold Squad, has showcased his bullishness in the embattled digital token XRP.\n\nAs recently asserted by the crypto influencer, the $5 market price is on the cards for XRP. The reason for his confidence is that it’s the only asset to ever surpassed Ethereum (ETH) in terms of market capitalization.\n\nRead Also: Attorney John Deaton Addresses XRP Doubters, Says “FOMO Won’t Likely Kick in Until $2”\n\nAccording to Versluis in a tweet a couple of hours ago, this price point might seem impossible and can easily be taken as a joke. But there used to be a time when XRP was outperforming Ethereum (ETH), the second largest cryptocurrency by market cap.\n\nSo, for the popular podcaster, a $5 future price is not an impossible feat for XRP, the digital token that was occupying the third position in the crypto market ranking table before the SEC filed a class action lawsuit against Ripple, its major distributor.\n\nMason Versluis tweeted, “It’s easy to laugh at someone when they say XRP will hit $5. Do NOT underestimate one of the only coins to ever surpass ETH in market cap.”\n\nIt’s easy to laugh at someone when they say $XRP will hit $5. Do NOT underestimate one of the only coins to ever surpass $ETH in market cap 😮‍💨🤷🏽 — MASON VERSLUIS 🏆🔮 (@MasonVersluis) May 29, 2023\n\nAnother Analyst Shares a Similar Opinion\n\nXRP has to print a relatively 900% price surge from its current prices to hit the $5 price target. This may seem ridiculous, but not impossible as started by another pseudonymous analyst popularly known in Crypto Twitter as Crypto Assets Guy.\n\nAccording to the analyst, once the longstanding lawsuit is finally brought to an end, XRP will start a bull run that could make its price hit $5.\n\nCrypto Assets Guy stated, “I need to say this again: Once the lawsuit ends $XRP won’t hit $1000, $100 or $50 It could reach $5. Which is great in my opinion.”\n\nI need to say this again: Once the lawsuit ends $XRP wont hit $1000, $100 or $50 It could reach $5. Which is great in my opinion — Crypto Assets Guy (@cryptoassetsguy) May 29, 2023\n\nRead Also: Gym Positivity CEO Declares Support for Ripple and XRP. Here’s what he said\n\n<\n\nXRP in the Market\n\nOver the past couple of hours, XRP has been showcasing a bullish trend, which is obviously not initiated by Bitcoin (BTC) or any other top asset. XRP has been in this positive trend alone and has surpassed the $0.5 resistance level in the process.\n\nAt the time of press, XRP is trading at $0.5222, with a relatively 6% price upsurge in the last 24 hours and 12.35% in the last seven days, according to CoinMarketCap.\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNS8yOC9sYXllci0yLWRhdGEtZmVlcy1oaXQtYWxsLXRpbWUtaGlnaC1vbi1ldGhlcmV1bXMtYmxvY2tjaGFpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 May 2023 07:00:00 GMT",
        "title": "Layer 2 Data Fees Hit All-Time High on Ethereum's Blockchain - The Coin Republic",
        "content": "The layer 2 solutions of the Ethereum Blockchain have gained some exposure since they can address the blockchain network’s sustainability and high transaction fees. As a result of the traction L2 data fees on the Ethereum blockchain have hit an ATH. the data was revealed by The Block recently.\n\nIncrease in Layer-2 Fees on Ethereum\n\nLayer-2 data is basically the data fees related to the cost of transferring and executing data on L2 networks built on the Ethereum L1 mainnet. Due to the high usage of L2 solutions because of their benefits, demand for off-chain transactions has surged, which indirectly resulted in increased usage and demand for such solutions.\n\nSource: The Block\n\nThe above chart shows that Optimisim and ZK rollups have contributed to the high transaction fees milestone. However, if a closer look at the chart would reveal that Arbitrum and Optimism, which fall under the same optimistic rollup, have contributed more than ZK.\n\nArbitrum contributed a whopping 47.3% in the month of May while Optimism trailed with 23.04% of the spoils for the same month. While ZK rollups couldn’t beat the Optimistic roll-up numbers, zkSync stole the second spot ahead of Optimism with 25.38% of the total $16.2 million registered.\n\nOne of the major things the chart and the data fees indicates is that the adoption and use of these networks have been huge. It can be connected to the spike in Ethereum Mainnet’s transaction fees.\n\nOne of the most noteworthy observations from the publishing record is Polygon (MATIC) zkEVM. Despite the hype surrounding its launch even during the Beta phase, the project has cooled off significantly with only 1.03% of the total fees.\n\nDecrease in TVL\n\nSource: DefiLlama\n\nDue to the cool-off it, impacted its Total Value Locked performance. Despite DefiLlama data showing the metric increasing, one should note that it is way below its major competitors at $13.27 million.\n\nTotal value locked is majorly used for liquidity pool purposes for smart contract lending and staking in that respective blockchain. An increase in TVL indicates excellent health of the protocol and a decrease in TVL indicates threat and drying up of liquidity.\n\nzkSync with its total value locked at $127.63 million, is way ahead of Polygon zkEVM. The landscape in Optimism is however very different. Optimism has maintained its TVL stability at $889.36 million. Arbiturm has gained the first spot here as well with a TVL of $2.34 billion.\n\nEssentially, Optimistic rollups have captured the majority of the investors and the market shares as well. To beat Optimistic, ZK has to do a lot to impress investors."
    }
]