[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL21hdHQtY3V0bGVyLWludGVydmlldy1ldGhlcmV1bS1jZW50cmFsaXplZC1ibG9ja25hdGl2ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum is 'much more centralized than folks realize': Blocknative's Matt Cutler - Blockworks",
        "content": "Blocknative discontinued its MEV-boost relayer service on Ethereum last week. While other relayers do remain, a large majority of Ethereum transactions are now handled by just four entities.\n\nRelayers are responsible for bridging transactions between block builders and proposers. Without relayers, the network would face delays in transaction confirmations, reduced efficiency and potential bottlenecks, disrupting the smooth processing of transactions.\n\nThis development not only raises centralization concerns, but also underscores one of Ethereum’s central obstacles post-Merge: Relayers are providing costly services without compensation.\n\nBlockworks: Some funding approaches would solicit community donations to reward relayers while keeping the service free. Why didn’t you buy into these sorts of funding models?\n\nCutler: We’re a US-based entity, and that means OFAC SDN is a fact of life for us. We work very hard to be ecosystem aligned, and there are a lot of hard line stances as it relates to OFAC SDN compliance. A number of the public goods funding approaches that were being discussed for relays explicitly carved out relays that were OFAC SDN compliant, and I had some in-depth conversations with [Ethereum Foundation] core devs who basically felt that this was a black and white issue.\n\nBy the way, each infraction of OFAC SDN is up to a $30 million fine and up to 30 years in jail, right? And each transaction can be considered an infraction. So it’s like infinite liability. We were put in a sort of a rock and a hard place situation where we couldn’t satisfy both.\n\nBlockworks: Were you told OFAC compliance would keep you from receiving funds from community relayer funds that are currently in the works?\n\nCutler: While this was a topic of active discussion, specifically we never got that far. I think from our perspective this is really not about covering our costs. I mean, certainly the costs are substantial, but you know we’re trying to build a business here. And so just keeping the lights on and maybe not even paying for engineer salaries doesn’t really cut it. We’re trying to drive growth, right?\n\nBlockworks: One argument made against more baked-in revenue creation for relays is that charging fees creates a slippery slope where fees increase and users find ways to circumvent relays. What would you say to this?\n\nCutler: There is no other part of core Ethereum infrastructure which is really funded as a public good, maybe other than consensus clients, and they’re funded pretty heavily. So why do we pass the hat for something which is operationally required?\n\nI was always an advocate for what I call “missed slot insurance.” There’s many examples of relays, including Blocknative, making staking pools pull due to missed slots. My answer was there should be a hard fee with a hard benefit. The hard fee is you’re gonna pay into an insurance pool, and in the event where the relay network doesn’t do its job, you can expect missed slot insurance. OK, conversely, if you’re using a relay which is not part of the structure, you cannot expect insurance, but this is the bargain.\n\nReally what the network wants from the relay network is not competition. It wants utility. I flip on the light switch, and the lights come on, and I sort of understand that there’s a whole set of people who might be involved in delivering the power, but I don’t want to think about any of that. I don’t want to hear that, like, the oil came out of the ground in Bahrain and then got put on a boat that got caught up in the Suez Canal, and you gotta call the boat company. You’re like, “no, I just want the lights to go on,” right? You’re receiving this massive benefit from our operations, and there should be some sort of fee structure that’s associated with it.\n\nBlockworks: To zoom out for a second, why do relayers matter for Ethereum and the worldview it’s trying to advance?\n\nCutler: The whole idea is we’re building the foundation of the next economy that’s fundamentally more equitable than the existing system, and maybe it’s inevitable we recreate it, right? That’s something that is concerning to me.\n\nAt the relayer network, we now have four entities — two in the US, two in Europe — that relay 93% of all the blocks on Ethereum. There’s no explicit economic incentive, therefore there are implicit economic incentives that are opaque. There are all sorts of economic incentives to do things like colocation and there’s all sorts of backroom deals that are possible and may even be happening right now. The network is much more centralized than folks realize and is on a trend to become more centralized. It’s going in the wrong direction, and hey, Blocknative exiting, we can decide if this is a good or a bad thing or if it’s a non event, but there’s no question it’s now more centralized this week than it was last week.\n\nThis interview has been edited for brevity and clarity.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMTAvMDkvZXRoZXJldW0tZm91bmRhdGlvbi1zZWxscy0yLTdtLWV0aC1ldGhlci1zbGlkZXMtMS01L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Foundation Sells $2.7M ETH, Ether Slides 1.5% - Crypto Times",
        "content": "Ether (ETH) prices dropped by about 1.5% in the past few hours. This drop appears to be a reaction from traders after a wallet that certainly belonged to the Ethereum Foundation sold a portion of its allocated Ether tokens.\n\nThis specific wallet, with the address “0x9eE457023bB3De16D51A003a247BaEaD7fce313D,” exchanged more than 1,700 Ether for $2.7 million in USDC on Monday, according to data from Arkham.\n\nOn the blockchain tracking platform Etherscan, this wallet labeled as a “Grant Provider” had around $400,000 worth of tokens on Monday morning.\n\nThe Ethereum Foundation did not reveal specifics how they intended to with the funds they received. Due to this lack of clarity, traders reacted by selling Ethereum (ETH), which led to over 2% drop in its price since ethereum foundation had sold its stake.\n\nThe Ethereum Foundation develops applications and programs for the Ethereum network but is not a formal authority or a central organization that governs the Ethereum blockchain. It can affect the value of Ethereum tokens and the perception of Ethereum by investors and traders.\n\nIn April 2022, it held over almost $1.29 billion worth of ether (ETH), which accounted for more than 0.297% of the total ether supply at that time.\n\nAdditionally, they held around $300 million in investments outside of the cryptocurrency space."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMDkvZXRoZXItc2xpZGVzLWFzLWV0aGVyZXVtLWZvdW5kYXRpb24tc3dhcHMtMjdtLWV0aC1vbi11bmlzd2FwL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMDkvZXRoZXItc2xpZGVzLWFzLWV0aGVyZXVtLWZvdW5kYXRpb24tc3dhcHMtMjdtLWV0aC1vbi11bmlzd2FwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ether Slides as Ethereum Foundation Swaps $2.7M ETH on Uniswap - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS12dWxuZXJhYmxlLTE2NjUv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXZ1bG5lcmFibGUtMTY2NS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Price Topside Bias Vulnerable Unless It Surges Past $1,665 - NewsBTC",
        "content": "Ethereum price is slowly moving lower toward the $1,600 support against the US dollar. ETH remains at risk of more losses unless it clears $1,650 and $1,665.\n\nEthereum is struggling to stay above the $1,600 support zone.\n\nThe price is trading below $1,640 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bullish trend line forming with support near $1,620 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could start a fresh increase if it clears the $1,650 and $1,665 resistance levels.\n\nEthereum Price Holds Support\n\nEthereum made another attempt to gain strength above the $1,650 resistance. ETH failed to settle above the $1,650 level, struggled to clear $1,665, and underperformed vs Bitcoin.\n\nA high was formed near $1,664 before the price saw a fresh decline. It retested the $1,620 support. A low has formed near $1,617 and the price is now attempting another recovery wave. There was a minor increase above the $1,625 level.\n\nEthereum is now trading below $1,640 and the 100-hourly Simple Moving Average. There is also a connecting bullish trend line forming with support near $1,620 on the hourly chart of ETH/USD.\n\nOn the upside, the price might face resistance near the $1,640 level or the 100-hourly Simple Moving Average. It is close to the 50% Fib retracement level of the recent decline from the $1,664 swing high to the $1,617 low.\n\nThe next major resistance is $1,650 or the 76.4% Fib retracement level of the recent decline from the $1,664 swing high to the $1,617 low. The main resistance is still near the $1,665 level. A close above the $1,665 resistance might send the price toward the key resistance at $1,750.\n\nSource: ETHUSD on TradingView.com\n\nTo start a decent upward move, Ether must settle above the $1,720 and $1,750 levels. The next key resistance might be $1,850. Any more gains might open the doors for a move toward $1,920.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,665 resistance, it could continue to move down. Initial support on the downside is near the $1,620 level. The next key support is $1,600.\n\nThe first major support is now near $1,585. A downside break below the $1,585 support might start another strong decline. In the stated case, the price could revisit the $1,540 level. Any more losses may perhaps send Ether toward the $1,500 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,600\n\nMajor Resistance Level – $1,665\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vdS50b2RheS90b3JuYWRvLWNhc2gtcmVpZ25zLXN1cHJlbWUtb24tZXRoZXJldW3SATtodHRwczovL3UudG9kYXkvdG9ybmFkby1jYXNoLXJlaWducy1zdXByZW1lLW9uLWV0aGVyZXVtP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Tornado Cash Reigns Supreme on Ethereum - U.Today",
        "content": "Advertisement\n\nDespite facing sanctions from the U.S. Treasury in August 2022, Tornado Cash continues to dominate as the premier crypto mixer on the Ethereum network.\n\nRecent data from crypto analytics firm Arkham reveals that a staggering $77.35 million in assets passed through Tornado Cash contracts on the Ethereum Mainnet in just the last month.\n\nAn impressive comeback\n\nThe mixer, which operates across seven different chains, has made a name for itself by allowing users to obfuscate transfers of ten distinct crypto assets, with native ETH on the Ethereum mainnet being the most popular.\n\nAt its height in July 2021, Tornado Cash managed more than $700 million of ETH in its pool contracts. The platform did experience a significant setback post-sanctions, with assets plummeting by over 60% and a substantial decrease in transfer volume.\n\nNotably, this downturn was only temporary, as both total value locked (TVL) and transfer volume showed signs of recovery, even amidst the arrest of two of Tornado’s three founders.\n\nAt present, Tornado's TVL sits at approximately 118.3K ETH, equivalent to about $187.9 million, according to data provided by Arkham.\n\nUnder scrutiny\n\nAs reported by U.Today, the U.S. Treasury sanctioned the cryptocurrency mixing service Tornado Cash, accusing it of enabling the laundering of funds linked to North Korea's Lazarus Group. Despite Tornado Cash's claims of being a tool for preserving financial privacy, the Treasury alleges it facilitated illicit transactions, including the laundering of $445 million stolen by Lazarus. Tornado Cash developers, Roman Storm and Roman Semenov, were charged with aiding in laundering over $1 billion, with Storm being arrested.\n\nA Coinbase-backed group has lost a lawsuit challenging the U.S. Treasury Department's actions against the popular mixer. Judge Robert Pitman has ruled that Tornado Cash is a recognizable entity with property interest in its smart contracts.\n\n\n\nThe U.S. government's sanctions against the decentralized service Tornado Cash emphasize the challenges of shutting such services down entirely since programmers utilize its open-source code to develop similar programs."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWV4cGVyaWVuY2VzLXJvY2t5LXRyYWRpbmctZGF5LWFmdGVyLWV0aGVyZXVtLWZvdW5kYXRpb24tc2VsbG9mZi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum experiences rocky trading day after Ethereum Foundation selloff - CryptoSlate",
        "content": "The Ethereum Foundation exchanged 1700 ETH on Uniswap for $2.738 million worth of USD Coin (USDC) today, Oct. 9., at an average price of $1,611, according to on-chain data.\n\nIn the trading day since, ETH saw its price tumble as low as $1,553 before seeing a slight recovery to $1,577, where it stood at press time.\n\nThe Arkham Intelligence dashboard reveals that the Foundation received 1,700 ETH from a Gnosis Safe Proxy wallet. This ETH was subsequently converted into stablecoin via the Uniswap decentralized exchange (DEX). Later, the Foundation returned $3.23 million in USDC to the Gnosis wallet.\n\nThe Arkham Intelligence dashboard reveals that the Foundation holds digital assets worth $454,482 in its wallet, including 240.68 ETH valued at $390,000, 3.238 million USDC, 49,700 DAI, and 10,000 ARB tokens worth $8500.\n\nButerin’s dumping spree\n\nThe Ethereum Foundation transactions are coming on the heels of similar moves made by the blockchain network’s co-founder, Vitalik Buterin.\n\nOn Oct. 7, on-chain analyst Lookonchain reported that an address “0xD04daa” related to Buterin transferred 1000 units of ETH (worth $1.64 million) into Bitstamp, a centralized crypto exchange.\n\nAccording to the analyst, the same address has deposited 4,400 ETH, more than $7 million to Bitstamp in the last two months.\n\nBefore that, CryptoSlate had also reported that the Ethereum co-founder had consistently transferred his ETH holding to exchanges at different periods this year.\n\nFor context, Buterin sent over 1,000 ETH to exchanges, unknown addresses, and a Gnosis Safe Proxy wallet during a seven-day period in September. Before that, he had transferred 600 Ether to Coinbase in August and 200 ETH to Kraken in March.\n\nDespite these recent sales, Buterin still maintains a significant Ethereum holding. Data from the Arkham Intelligence dashboard reveals his ownership of approximately 250,000 ETH units, valued at around $400 million, within his cryptocurrency wallet."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1mb3VuZGF0aW9uLTI3bS1zd2FwLXNlbmRzLWV0aC1wcmljZS10dW1ibGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Foundation's $27M Swap Sends ETH Price Tumbling - DailyCoin",
        "content": "Ethereum Foundation swaps $27 million worth of ETH on Uniswap.\n\nEther’s price experienced a sharp decline following the transaction.\n\nThe crypto community is closely monitoring the situation.\n\nJust as in traditional markets, supply and demand rule crypto. Most recently, the Ethereum Foundation, the largest holder of ETH, has performed a significant sale of tokens. This sale, used to finance its operations, has had a noticeable impact on the price of ETH.\n\nEthereum Foundation Sends ETH Tumbling\n\nOn Monday, October 9, 2023, the Ethereum Foundation, a key organization within the Ethereum ecosystem, executed a large-scale Ether swap on the Uniswap decentralized exchange. This move involved transferring $27 million worth of ETH, which impacted the crypto market.\n\nNotably, the transaction caused a drop in the value of ETH. On Monday, the price of ETH dropped by 2% and traded at $1,589.52. This has brought the market cap of the second-largest crypto down to $191.09 billion.\n\nAt the same time, the major transaction coincided with a surge in trading volume. ETH trading volume was up 59.89% in the last 24 hours and reached $4.71 billion.\n\nEthereum’s Correction is Likely Temporary\n\nWhile the recent 2% drop in Ethereum’s price may raise concerns among investors and traders, it’s important to emphasize that this is likely a short-term adjustment rather than a reflection of Ethereum’s long-term potential. Such corrections are not uncommon in the cryptocurrency market, where price volatility is a defining characteristic.\n\nOne key aspect to consider is that the Ethereum Foundation, like many blockchain organizations, periodically sells tokens to fund its operations and support the development of the Ethereum platform. The $27 million ETH swap on Uniswap may be part of the Foundation’s financial strategy to ensure its sustainability and ongoing contributions to the Ethereum ecosystem.\n\nThese token sales can create short-term fluctuations in price, as they introduce additional supply to the market. However, it’s crucial to recognize that they are typically executed with the broader goal of bolstering the network, advancing technological improvements, and promoting Ethereum’s long-term viability.\n\nOn the Flipside\n\nIn the past, the Ethereum Foundation has faced criticism for its influence over the Ethereum network. For instance, the US Securities and Exchange Commission considers Ethereum a security .\n\nRecent reports suggest that Ethereum’s next major upgrade may face delays, raising questions about the network’s ability to meet its scalability and performance goals.\n\nWhy This Matters\n\nFor crypto traders and enthusiasts, staying informed about developments like the Ethereum Foundation’s token swaps and their impact on prices is vital. These events can present trading opportunities and risks, and being aware of them can help you make informed investment decisions.\n\nRead more about Ethereum’s latest upgrade:\n\nEthereum’s Next Major Upgrade Likely to Be Delayed: Core Devs\n\n\n\nRead more about the biggest crypto options exchange:\n\nDeribit Adds SOL, XRP, MATIC, Despite Market Downturn"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8yMDA4MjAvbGF5ZXItMi1tYWpvcml0eS1ldGhlcmV1bS10cmFuc2FjdGlvbnMtbWVzc2FyadIBTmh0dHBzOi8vZGVjcnlwdC5jby8yMDA4MjAvbGF5ZXItMi1tYWpvcml0eS1ldGhlcmV1bS10cmFuc2FjdGlvbnMtbWVzc2FyaT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Layer-2 Blockchains Host Most Ethereum Transactions: Messari - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAscending to 61% of all transactions, Ethereum’s Layer-2 networks were home to a majority share of activity in the third quarter, according to Messari’s latest State of Ethereum report.\n\nKunal Goel, senior research analyst for Messari, wrote that the surge was spawned by the explosive launch of Base—which briefly overtook the number of transactions happening on Ethereum's mainnet–along with the unexpected popularity of the Friend.tech social token platform.\n\nGoel said he was actually caught off guard by the aforementioned combination. “The most impressive thing is Base's quick growth and how just one app can turn things around for any blockchain,” he told Decrypt.\n\nAD\n\nAD\n\nHe explained that new chains “can suffer from a cold start problem,” but thankfully for Base, Friend.tech helped onboard a lot of users and funds. “Users need developers to make good apps, and developers need users to want to launch apps,” Goel said, adding, \"it's very good for Base that Friend.tech chose it for launch.”\n\nThe analyst remains cautious, however. “It is still a bear market, and interest and enthusiasm across the board is low.”\n\nIncubated by Coinbase, Base has seen impressive growth since its launch in early August, which reports a total value locked (TVL) of $448 million, according to a Dune dashboard by 21.co. This firmly places it in the top four layer-2 solutions, behind Arbitrum, Optimism and zkSync Era.\n\nArbitrum continues to be the most utilized by Ethereum users, with 600,000 average daily transactions, offering a 200,000 margin from the main competitors mentioned by Messari: Base and Optimism. These two, wrote Goel, have “cannibalized” Arbitrum’s network activity, with transactions dropping 36% during the third quarter.\n\n21.co’s Dune dashboard reveals an important lead for Arbitrum in terms of TVL, as well. Its $4.22 billion is nearly threefold that of Optimism, which lands in second, at $1.27 billion. That said, both have been flipping their market capitalizations of late, and according to Coingecko, the former leads with a $30 million margin, sitting currently at $1.067 billion.\n\nAD\n\nAD\n\nAs per Goel, the fact that Layer-2s are taking the lead in terms of transaction throughput is not surprising. He told Decrypt that “the longer-term view has always been that L2 transactions will overtake Ethereum's,” adding, “it was clear during the bull market of 2020-21 that Ethereum mainnet's block space alone wasn't going to be enough.”\n\nThe view resonated with Eliezer Ndinga, head of research for 21.co. He told Decrypt that his company had predicted this to be the trend, since “blockchains are quite limited in scale.”\n\nNdinga explained that these scaling solutions are “analogous to how bandwidth pushed the boundaries of what’s possible on the Internet from the era of dial-up where web pages were taking minutes to load on a web browser.”\n\nThe analyst bullishly called these layer-2s “a force to be reckoned with,” especially as “reputable financial institutions” start to adopt the technology.\n\nWhat Goel unveiled today has him bullish–as it should the Ethereum community at large. “The greater activity there is on L2s, the higher their market caps, the higher security they want from Ethereum, and higher demand for Ethereum's data availability service,” he told Decrypt.\n\nHe also shared what “the biggest thing” to watch is: how much cheaper L2s can get after the Dencun upgrade, and “once they get cheaper,” how much more activity they will see.\n\n“My long-term view is that all DEX trades should move to L2s as lower transaction fees help the most with high-velocity transactions,” he concluded."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzA5L3doeS1ldGhlcmV1bS1kb2dlY29pbi1hbmQtYml0Y29pbi1jYXNoLXNsdW1wZWQtdG9kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Why Ethereum, Dogecoin, and Bitcoin Cash Slumped Today - The Motley Fool",
        "content": "What happened\n\nA divergence appears to be building, at least in Monday's price action, between certain top cryptocurrencies and the broader equity market. While most risk assets declined in morning trading Monday in response to surging oil prices and an escalating conflict in the Middle East, equities recovered during the afternoon, with crypto assets underperforming.\n\nAs of 3 p.m. ET, Ethereum (ETH 6.21%), Dogecoin (DOGE 30.24%), and Bitcoin Cash (BCH 7.31%) had declined 3.3%, 3.6%, and 5.1%, respectively, over the prior 24 hours.\n\nSo what\n\nEthereum's decline appeared to have been driven by more than just macroeconomic factors. News that the Ethereum Foundation (which supports development and innovation on the Ethereum blockchain) had swapped $2.7 million worth of Ethereum for stablecoin USDC (USDC 0.01%) on Monday sent the token lower. While swaps like this have been seen in the past, and are used by the Ethereum Foundation as a way to cover costs, sell-offs typically follow such transactions. This was the case once again on Monday.\n\nInterestingly, both Bitcoin Cash and Dogecoin appear to be increasingly seeing intraday moves that are more correlated with the overall market. Monday's outsized moves in both these tokens indicate investors may be viewing them as ways to play momentum in either direction in the crypto sector. In other words, Dogecoin's status as a meme token and Bitcoin Cash's status as a higher-volatility token could be viewed by traders as making them opportune ways to gain leverage to broader crypto market moves in the near term.\n\nNow what\n\nIt's rarely good news to see one of the most sophisticated developers in the crypto sector selling assets to cover its operating costs. And while that's not necessarily a novel concept for investors who follow Ethereum, the market's reaction to this sale speaks volumes about what I think could be a shifting narrative around the sustainability of this space.\n\nFor those looking at the crypto sector as a way to diversify their portfolios, investing in tokens tied to projects that continue to invest in themselves continues to be a good idea. In that regard, this move by the Ethereum Foundation may be viewed in a positive light by those who believe that most of the innovation in this sector continues to come from this blockchain.\n\nFor traders and speculators looking to play the broader moves in this sector (driven by Ethereum and Bitcoin, primarily), altcoins and higher-leverage tokens will always be around to trade. That said, if I had to pick one of these tokens to buy on Monday's decline, it would have to be Ethereum. That's partly because of the aforementioned continued reinvestment into the network's technology, as well as the fact that Ethereum has typically headed higher again in the wake of previous Ethereum Foundation sales."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tMi0wLXVwZ3JhZGUtaGFzLWJyb3VnaHQtbW9yZS1jZW50cmFsaXphdGlvbi10by10aGUtYmxvY2tjaGFpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum 2.0 upgrade has brought more centralization to the blockchain - crypto.news",
        "content": "JPMorgan Chase &. Co. has shed light on how the Ethereum network decentralization has decreased significantly since the Merge event and Shanghai upgrade went live.\n\nThe rise of staking and centralization\n\nSince implementing the Merge and Shanghai upgrades, Ethereum has seen a substantial uptick in staking activities.\n\nStaking, a process where users lock up their crypto assets to support network operations, has its merits. According to a CoinDesk report citing JPMorgan research, this surge in staking activity comes at a cost: centralization.\n\nTraditionally, many in the crypto community prefer decentralized liquid staking platforms like Lido over their centralized counterparts.\n\nLido’s approach included adding more node operators to ensure no single entity controlled a significant portion of staked Ether (ETH). The aim was to address centralization concerns.\n\nHowever, centralization remains a risk. A concentration of liquidity providers or node operators could act as a single point of failure or even collude to create an oligopoly, potentially undermining the interests of the broader Ethereum community.\n\nEthereum, the world’s second-largest crypto, has become more centralized since the Merge and Shanghai upgrades. And JPMorgan is highlighting concerns over a decline in staking yields.\n\nYou might also like: Ethereum’s Dencun upgrade: the next major step in scalability\n\nThe menace of rehypothecation\n\nAnother highlight from the report is rehypothecation. This complex term refers to the practice of reusing liquidity tokens as collateral across multiple decentralized finance (DeFi) protocols simultaneously.\n\nDeFi encompasses lending, trading, and other financial activities carried out on the blockchain.\n\nThe problem arises when a staked asset’s value sharply declines or faces a security breach or protocol error.\n\nIn such scenarios, rehypothecation could trigger a cascade of liquidations, jeopardizing the stability of the DeFi ecosystem.\n\nFurthermore, the report points out that the increase in staking has diminished the appeal of Ethereum from a yield perspective.\n\nThis shift is especially noticeable amid rising yields in traditional financial assets. The total staking yield has fallen from 7.3% before the Shanghai upgrade to approximately 5.5%.\n\nFrom a different perspective, the research data presented in December following Ethereum’s Merge upgrade in September 2022 reveals a significant reduction in the network’s energy consumption, akin to the energy usage of entire countries such as Ireland and Austria.\n\nThis decrease in power consumption positively contributes to environmental sustainability, aligning with broader global efforts to reduce the carbon footprint associated with blockchain technologies.\n\nEthereum’s core developers have introduced an Ethereum Improvement Proposal (EIP-7514) as part of the upcoming Dencun upgrade, scheduled for activation in October 2023.\n\nThis proposal aims to slow down the rate of Ether staking. The intention is to provide the Ethereum community with more time to devise a practical reward scheme for stakers on the network.\n\nETH price analysis\n\nAs of the time of writing, the price of Ethereum (ETH) stands at $1,629, representing a 3.4% decline on the weekly timeframe.\n\nEthereum’s Relative Strength Index (RSI) is currently sitting at 40.4.\n\nThe price of ETH is struggling to maintain the $1600 level after facing rejection at the $1700 resistance level. A failure to hold the $1600 level could potentially lead to a further decline to the $1500 level.\n\nFollow Us on Google News"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2Jsb2NrY2hhaW4ubmV3cy9uZXdzL2V0aGVyZXVtLWZvdW5kZXItdml0YWxpay1idXRlcmluLXByb3Bvc2VzLXR3ZWFrcy10by1pbXByb3ZlLWRlY2VudHJhbGl6YXRpb24tYW5kLXJlZHVjZS1jb25zZW5zdXMtb3ZlcmhlYWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Proposes Tweaks to Improve Decentralization and Reduce Consensus Overhead - Blockchain.News",
        "content": "Vitalik Buterin, the founder of Ethereum, has proposed changes to the network's staking model aimed at improving decentralization and reducing the consensus layer's computational burden. The proposal includes the introduction of a two-tiered staking system involving node operators and delegators. Buterin suggests that these changes could significantly reduce the number of signatures required for consensus, thereby making it easier for more people to participate in the network's validation process.\n\nVitalik Buterin , the founder of Ethereum, has recently proposed a series of changes aimed at improving the network's staking model. The primary objectives are to enhance decentralization and reduce the computational burden on the consensus layer. The proposal comes as Ethereum faces challenges related to centralization risks and the sheer number of signatures required for consensus. Buterin's proposal could potentially revolutionize the way staking and consensus are approached on the Ethereum network, making it more accessible and efficient.\n\nIn the current Ethereum staking model, there are two types of participants: node operators and delegators. Node operators are responsible for running nodes and providing collateral, usually in the form of ETH. Delegators, on the other hand, contribute some amount of ETH but are not required to participate in any other way. This two-tiered staking model has been popularized by staking pools like Rocket Pool and Lido, which offer liquid staking tokens (LSTs). However, Buterin identifies two main issues with this system. First, there is a centralization risk in the mechanisms for choosing node operators, which are either not very decentralized or have other flaws. Second, the Ethereum Layer 1 verifies approximately 800,000 signatures per epoch, a number that could increase, thereby adding a significant computational load to the network.\n\nTo address these issues, Buterin suggests that delegators should have a more meaningful role in the network. He outlines two classes of solutions: delegate selection and consensus participation. In the delegate selection model, delegates could choose which node operators they want to support, thereby having a \"weight\" in the consensus. This would give them more power and make the network more decentralized. In the consensus participation model, delegators could be given a lighter role in the consensus process, which would act as a check on node operators. This would allow more people to participate in the network's validation process without taking on the full responsibilities and risks of being a node operator.\n\nButerin also provides concrete implementation ideas for these solutions. One such idea is to allow each validator to specify two staking keys: a persistent staking key (P) and a quick staking key (Q). These keys could be used in various ways to improve the consensus mechanism and reduce the number of required signatures. For example, the protocol could require both the node and a randomly selected delegator to sign off for a message from a node to count.\n\nIn conclusion, Buterin's proposal aims to achieve two main objectives. First, it seeks to empower those who do not have the resources or capability to solo-stake to participate meaningfully in the network. Second, it aims to reduce the number of signatures required for consensus to around 10,000, thus aiding decentralization and making it easier for more people to run a validating node. These changes could be implemented at different layers, including within staking pool protocols or as part of the Ethereum protocol itself, offering a flexible approach to improving the network's staking model.\n\nImage source: Shutterstock"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1kZWNsaW5lLWFtaWQtaXNyYWVsLWhhbWFzLWNvbmZsaWN0JTNBLWFuYWx5c3QtcHJlZGljdHMta2luZy1jcnlwdG_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Decline Amid Israel-Hamas Conflict: Analyst Predicts King Crypto To Reach $30K As ... - Nasdaq",
        "content": "Major cryptocurrencies experienced a decline on Sunday evening, amid the attack on Israel by Hamas. This event has introduced geopolitical risk into an already delicate market grappling with inflation and surging interest rates.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin (CRYPTO: BTC) -0.49% $27,868 Ethereum (CRYPTO: ETH) -0.73% $1,626 Dogecoin (CRYPTO: DOGE) -0.99% $0.060\n\nWhat Happened: Bitcoin, the largest cryptocurrency by market capitalization also declined due to the announcement of the U.S. economy adding 336,000 jobs in September, surpassing economist expectations by nearly double.\n\nThe Israeli-Palestinian conflict has reached a critical point, escalating into a full-blown war following an unexpected invasion by Hamas. Israeli Prime Minister Benjamin Netanyahu has vowed that the group, which rules the Gaza strip, will face unprecedented consequences. Meanwhile, global crude reserves are facing pressure due to production reductions by Saudi Arabia and Russia.\n\nPierre Andurand, founder of Andurand Capital Management LLP, believes that in the short term, the conflict is unlikely to impact oil supply. However, experts warn that it could eventually lead to supply disruptions and price fluctuations.\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga’s exclusive event – Future of Digital Assets. Tickets are flying- get yours!\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Trust wallet token +9.40% $1 dYdX +3.30% $2 Frax Share +3.00% $5.52\n\nThe global crypto market cap currently stands at $1.09 trillion, reflecting a decrease of 0.10% in the past 24 hours.\n\nStock futures experienced a decline on Sunday due to the attack on Israel. This unfortunate event has introduced additional geopolitical risk to an already delicate market, which is currently grappling with inflation and surging interest rates.\n\nFutures linked to the Dow Jones Industrial Average dropped by 207 points, equivalent to a 0.6% decrease. Similarly, S&P 500 futures experienced a decline of 0.7%, while Nasdaq 100 futures slipped by 0.6%.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes\n\nCrypto analyst Michael Van de Poppe anticipates a week filled with volatility in the market. According to him, it is likely that Bitcoin will continue its upward grind, potentially surging to $30K \"as worldwide uncertainty grows.\"\n\nI've had an amazing business trip to Dubai. Can't wait to share news! Now; market perspective it's going to be a volatile week. My idea is that #Bitcoin continues the upwards grind & potentially reaches $30K as worldwide uncertainty grows. Stop the war.\n\n— Michaël van de Poppe (@CryptoMichNL) October 7, 2023\n\nPseudonymous analyst CediBull remains firm in their idea shared below, with a target of at least $27,100 and a high probability of testing the mid-range at $26,700. Taking a step back for a broader perspective, there is a significant amount of liquidity accumulated below us, accompanied by rejection wicks to the upside.\n\nAdditionally, Open Interest (OI) has reached its peak, which historically has signaled a local top in the past five out of five instances. The overall direction seems clear in my opinion, but the key question is how far the price will drop. It is important to remember that the long-term outlook is still bullish, and breaching $24,800 is not anticipated. I believe we may test the mid-range, and if it holds, we could experience an early bottom. However, there is also the possibility of a swift dip below $26,000 (but remaining above $24,800), which could present an excellent opportunity for a low-risk, high-reward entry once again.\n\nNo change to my idea shared below. Targeting 27.1k at minimum with a test of the mid-range at 26.7k seeming highly likely as well.Zooming out for some additional context- you can see that we have tons of liquidity built up below us after taking liq above with plenty of… https://t.co/62pvVl0PFu pic.twitter.com/2ldlhWT4Di\n\n— CrediBULL Crypto (@CredibleCrypto) October 9, 2023\n\nBenjamin Cowen predicts a prolonged decline in ETH / BTC .\"Collapse continues. It has been a pretty slow process so far (certainly slower than I was expecting), but the trend has in fact been down for a long time.\"\n\n#ETH / #BTC collapse continues. It has been a pretty slow process so far (certainly slower than I was expecting), but the trend has in fact been down for a long time. pic.twitter.com/JbbuXKdOTh\n\n— Benjamin Cowen (@intocryptoverse) October 6, 2023\n\nOn-chain analytics firm Santiment reported that the movement of over 10K $BTC off exchanges is the highest since September 7, indicating a significant shift in the Bitcoin market. Additionally, Bitcoin, the leading cryptocurrency, is making a second attempt to surpass the $28K market value. The importance of utility cannot be overlooked, especially considering that unique addresses have reached their lowest point in six weeks.\n\n📊 #Bitcoin had its most coins (over 10K $BTC) moving off exchanges since September 7th, and #crypto's top market cap asset is making a 2nd run at crossing a $28K market value. Utility will be important here, as unique addresses have fallen to 6-week lows. https://t.co/JoJv9YYJsA pic.twitter.com/3JELGuzJRG\n\n— Santiment (@santimentfeed) October 8, 2023\n\nPhoto by CMP_NZ on ShutterstockJoin Benzinga’s Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions and institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8wOS9jcnlwdG8tYW5hbHlzdC1wcmVkaWN0cy1tb3JlLXJhbGxpZXMtZm9yLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tc2F5cy1jcmF6eS1tb3Zlcy1haGVhZC1mb3ItYml0Y29pbi1idGMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Crypto Analyst Predicts More Rallies for Ethereum-Based Altcoin, Says Crazy Moves Ahead for Bitcoin (BTC) - The Daily Hodl",
        "content": "A closely followed crypto strategist says more rallies are likely in sight for a low-cap altcoin running on the Ethereum (ETH) blockchain.\n\nPseudonymous analyst Altcoin Sherpa tells his 196,700 followers on the social media platform X that the native asset of the image-synthesizing ecosystem Render Network (RNDR) is likely due for a 33% rally from its current level.\n\nThe trader shares a chart showing how RNDR has converted its previous resistance at $1.80 into support with multiple exponential moving averages buoying the Ethereum-based altcoin’s uptrend.\n\n“RNDR trade going well. Going to be selling all the way up to $2.40.”\n\nAt time of writing, RNDR is trading for $1.80, down over 2% in the last 24 hours.\n\nLooking at Bitcoin (BTC), Altcoin Sherpa says that the flagship crypto could witness a notable surge in volatility toward the end of the year. The crypto strategist lays out two scenarios for Bitcoin – both of which depend on how BTC reacts should it hit $30,000.\n\n“BTC: where the next high is set is extremely key. If we hit some sort of lower high around $30,000 and die, we’re going to go to the low $20,000, in my opinion.\n\nIf we break past $32,000, this probably goes to like $40,000.\n\nIn other words, this is how I sort of envision it going down. Probably going to be a lot of crazy moves over the next four-ish months. Should be fun.”\n\nAt time of writing, Bitcoin is worth $27,980.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3ZpdGFsaWstYnV0ZXJpbi1wcm9wb3Nlcy10d28tdGllci1tb2RlbC10by1hZGRyZXNzLWNlbnRyYWxpemF0aW9uLWNoYWxsZW5nZXMtaW4tZXRoZXJldW0tc3Rha2luZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Vitalik Buterin proposes two-tier model to address 'centralization challenges' in Ethereum staking - CryptoSlate",
        "content": "Ethereum’s founder, Vitalik Buterin, unveiled an innovative proposal this week aimed at refining the platform’s staking mechanism.\n\nAs the world’s second-largest blockchain by market capitalization, Ethereum’s continued evolution is crucial for its vast user base, and these proposed changes aim to bolster decentralization, efficiency, and security.\n\nA Decentralized Vision for Staking\n\nThe primary concern addressed in Buterin’s proposal revolves around the limitations of the current staking system.\n\nNotably, he pinpoints decentralization issues surrounding the selection process for node operators across various staking pools and identifies inefficiencies in the current Layer 1 (L1) consensus mechanism.\n\nPresently, the constraints of solo staking combined with issues surrounding liquid staking mean that the platform can only process between approximately 100,000 to 1 million BLS signatures per slot.\n\nA further complication arises from the need for accountability in signing, which demands a participation record for each signature. If Ethereum scales up globally, using full danksharding for storage might still fall short, with a mere 16 MB per slot accommodating around 64 million stakers.\n\nDrawing inspiration from models implemented by Rocketpool and Lido, Buterin suggests adopting a two-tiered staking system. In this structure, Node Operators and Delegators emerge as central figures.\n\nTo rectify this, Buterin suggests a two-tiered staking model:\n\nA high-complexity slashable tier with frequent activity but limited participants (around 10,000). A low-complexity tier, where members engage sporadically and face minimal or no slashing risk.\n\nThis model would involve the modification of the validator balance cap and implementing a balance threshold to categorize validators into these tiers.\n\nButerin elaborates on potential roles for small-stakers:\n\nRandom selection of 10,000 small-stakers for each slot who sign off on their slot’s head. If divergences arise between the staker and node operator choices, it triggers an error, prompting community intervention.\n\nA system where a delegator declares their online presence, offering to serve as a small-staker for a set duration. For a node’s message to be acknowledged, it needs endorsement from both the node and a randomly picked delegator.\n\nAn approach in which delegators signal their availability, and subsequently, chosen delegators confirm their online status. These delegators can then publish inclusion lists for block validation.\n\nThe roles envisioned for small-stakers are characterized by their sporadic participation and non-slashable nature. Importantly, these roles tackle the significant issue of a potential 51% node operator majority attempting transaction censorship.\n\nButerin also contemplates these solutions in the context of staking pool features. He suggests protocols allowing validators to designate two staking keys: a persistent key and a temporary one, which, when combined, influence the block finalization process.\n\nThe Implications\n\nButerin’s proposal isn’t just technical fixes; it’s a vision for Ethereum’s future. By decentralizing the staking process further and integrating safety nets, he aims to:\n\nEmpower those lacking resources for solo staking, granting them meaningful participation avenues. Reduce the transaction processing load on Ethereum’s consensus layer, making it easier for all to run a validating node.\n\nBy diffusing the staking process and embedding safeguards, the objectives are clear: to empower those who traditionally lack the means for solo staking by offering them a meaningful way to participate and alleviate the transaction processing strain on Ethereum’s consensus layer. This ensures a more accessible platform for everyone intending to run a validating node.\n\nThe proposed refinements underscore the pressing need for minimal, strategic protocol modifications, all pointing towards a balanced, decentralized, and high-functioning Ethereum network."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLWF0dHJhY3RzLW1vcmUtY3JpdGljaXNtLWZyb20tY2FyZGFub3MtaG9za2luc29u0gFdaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtcy12aXRhbGlrLWJ1dGVyaW4tYXR0cmFjdHMtbW9yZS1jcml0aWNpc20tZnJvbS1jYXJkYW5vcy1ob3NraW5zb24_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Attracts More Criticism from Cardano's Hoskinson - U.Today",
        "content": "Advertisement\n\nEthereum's co-founder Vitalik Buterin recently discussed potential protocol and staking pool changes for the Ethereum network, suggesting they could enhance decentralization and efficiency. However, his comments have drawn criticism from Charles Hoskinson, the founder of Cardano, and other members of the Cardano community.\n\nIn his post on X, Hoskinson took a not-so-veiled jab at Buterin by attaching an animated GIF of actor Christian Bale and Muppet Kermit the Frog nodding at one another.\n\nCopycat accusations\n\nButerin's posts detailed how modifications in staking design could benefit users who lack the resources to solo-stake, allowing them more involvement in staking and consensus decision-making. Additionally, the changes could reduce the consensus layer's operational burden, further decentralizing the Ethereum network.\n\nIn response, the Cardano community accused Ethereum of attempting to emulate Cardano's long-standing features.\n\nSome of them posted that Cardano had pioneered liquid staking and delegating to pools for consensus years ago, boasting about Cardano's uptime and decentralization metrics.\n\nEthereum was mocked for \"dressing up as Cardano for Halloween\" by allegedly copying its long-established features.\n\nUnhealthy obsession?\n\nThe community's reaction to the latest tweet was rather mixed. Some agreed with Hoskinson, but others questioned the focus Cardano's community places on Ethereum.\n\nInquisitor Glokta, a Cardano supporter, expressed frustration, noting that the Cardano community seems more engrossed in Ethereum's actions than in their own developments.\n\nHe highlighted that Buterin rarely, if ever, comments on Cardano, hinting at a possible \"inferiority complex.\"\n\nHowever, Hoskinson stands by his comments. \"They literally just admitted they need to copy Ouroboros,\" he responded."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8yMDA2ODAvdGhlLWV0aGVyZXVtLWZvdW5kYXRpb24tanVzdC1zb2xkLTItNzYtbWlsbGlvbi1pbi1ldGjSAVVodHRwczovL2RlY3J5cHQuY28vMjAwNjgwL3RoZS1ldGhlcmV1bS1mb3VuZGF0aW9uLWp1c3Qtc29sZC0yLTc2LW1pbGxpb24taW4tZXRoP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "The Ethereum Foundation Just Sold $2.76 Million in ETH - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Ethereum Foundation, a non-profit organization responsible for developing and promoting Ethereum, has converted 1,700 ETH worth $2.76 million to Circle’s USDC stablecoin.\n\nCrypto analytics firm Scopescan reported the transaction this morning as the foundation converted Ethereum for USDC via Uniswap.\n\nAD\n\nAD\n\nIn a report from April 2022, the Foundation disclosed it had around 395,000 ETH representing 0.297% of Ethereum’s total supply by Q1 2022.\n\nAccording to the report, the Foundation spent a total of $48 million in research and development and grants to developers working on Ethereum during the financial year 2021.\n\nAccording to DeFiLlama data, the organization holds 316,488 ETH worth $502.7 million.\n\nThe Foundation did not immediately respond to Decrypt’s request for comment.\n\nEthereum and its Foundation\n\nPrevious instances when the Foundation moved its tokens to crypto exchanges were followed by declines in the price of Ethereum.\n\nAD\n\nAD\n\nOn May 6, 2023, for example, the Ethereum Foundation transferred nearly 15,000 ETH worth $28.5 million to the Kraken cryptocurrency exchange, marking a local top.\n\nAt the time, Ethereum was trading at $1,900, before dropping a few months later. the following months.\n\nRoughly 18 months prior, the Foundation transferred 20,000 ETH worth $95 million to Kraken on November 11, 2021, once again, coincidentally marking a top in Ethereum’s price of around $4,700.\n\nThen in May 2021, the organization transferred just over 35,000 ETH worth $123 million.\n\nEthereum’s price dropped from above $3,500 to lows of around $1,825 per CoinGecko data within weeks of the transfer.\n\nNotably, the amount of ETH sold this morning is worth comparatively less at $2.76 million.\n\nEthereum was last changing hands at $1,595, 1.6% lower since yesterday per CoinGecko."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mb3VuZGF0aW9uLWp1c3Qtc29sZC1taWxsaW9ucy1pbi1ldGgtYmVmb3JlLXByaWNlLW1hZGUtYW5vdGhlci1kcm9w0gFgaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWZvdW5kYXRpb24tanVzdC1zb2xkLW1pbGxpb25zLWluLWV0aC1iZWZvcmUtcHJpY2UtbWFkZS1hbm90aGVyLWRyb3A_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Foundation Just Sold Millions in ETH Before Price Made Another Drop - U.Today",
        "content": "According to various on-chain data sources, earlier today, Ethereum Foundation transferred a substantial amount of Ethereum (ETH) to Uniswap DEX. A total of 1,700 ETH was sold for 2.738 million USDC.\n\nAdvertisement\n\nThe sale was made at $1,611 per coin. Currently, ETH is changing hands at $1,590. Curiously, right after the sale, the ETH price slipped by 1.45%. Overall, today, the second-largest digital currency dropped nearly 3%, falling from $1,636 to the $1,591 level on the Bitstamp exchange.\n\nEthereum and the majority of other altcoins are currently going down, following the Bitcoin price dropping from $27,790 to the $27,500 zone. This was largely caused by the Stars Arena hack for nearly $3 million in crypto, as well as a recent turn in geopolitical events.\n\nAfter the aforementioned sale, the wallet linked to the Ethereum Foundation contains 240.68 ETH, 3.2 million USDC, 49,700 DAI stablecoins and 10,000 ARB. All of these crypto assets are worth $3.687 million in total.\n\nThe Ethereum Foundation (0x9e…313d) sold 1.7k ETH on Uniswap at 16:18 UTC+8 for 2.738 million USDC. The address currently holds 240.68 ETH, 3.238 million USDC, 49,700 DAI and 10,000 ARB, totaling $3.687 million in assets. https://t.co/WIAcSzKu37 — Wu Blockchain (@WuBlockchain) October 9, 2023\n\nOver the weekend, a similar event took place. As reported by U.Today, Ethereum cofounder and frontman Vitalik Buterin sold 1,000 ETH worth $1.64 million in fiat on the Bitstamp exchange. This was not the only ETH sale made by the Canadian programmer with Russian roots.\n\nOver the past two months, approximately 4,400 ETH were transferred from this blockchain address of Buterin to Bitstamp. This amount of Ether is evaluated at $7.23 million.\n\nAside from that, over the past two months, Vitalik also sent around 1,000 ETH in two chunks to the Coinbase exchange."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWV0ZnMtbGF1bmNoLXRvLXRlcGlkLWRlbWFuZC1iaXRjb2luLWFuZC1zb2xhbmEtcmVtYWluLWZhdm9yZWQtaW52ZXN0bWVudC1wcm9kdWN0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum futures ETFs launch to tepid demand; Bitcoin and Solana remain favored investment products - CryptoSlate",
        "content": "Ethereum (ETH) investment products struggled to record notable inflow despite the recent launch of several Ether futures-based exchange-traded funds (ETF) last week.\n\nAccording to CoinShares’ latest weekly report, these ETFs’ attraction of a meager sum of $10 million underscores the “tepid appetite” for Ethereum among investors. It continued that when a similar futures ETF launched for Bitcoin last year, the product saw up to $1 billion in investments during the first week of its operations.\n\nHowever, CoinShares’ senior analyst James Butterfill noted that the performance of the Ether-based ETFs could also be tied to the overall “poor investor appetite for digital assets at present.”\n\nLast week, several futures-based Ethereum ETFs from different asset managers like Valkyrie, VanEck, ProShares, Bitwise, Kelly, and VolShares launched in the U.S. CryptoSlate reported that these ETFs saw around $2 million in trading volume during the first day of their launch.\n\nBitcoin, Solana continues dominance\n\nMeanwhile, Bitcoin (BTC) and Solana (SOL) investment products continued their dominant trend as digital assets investment products recorded inflows of $78 million last week. During this period, ETPs’ trading volumes rose by 37% to $1.13 billion.\n\nAccording to Coinshares, BTC products saw inflows totaling $43 million, with the asset’s current positive price performance enticing some investors to add $1.2 million to their short-bitcoin positions. Additionally, the top cryptocurrency trading volume on trusted exchanges jumped by 16%.\n\nOver the past week, BTC’s price peaked at $28,410 and has continued to trade near the $28,000 benchmark.\n\nOn the other hand, Solana recorded its largest weekly inflow of $24 million since last year’s March and has continued to “assert itself as [investors’] altcoin of choice” despite the recent launch of Ethereum ETFs.\n\nAcross regions, CoinShares highlighted that investors from Europe continue to dominate as they contributed to 90% of inflows. Meanwhile, investors in Canada and the U.S. remain largely cautious, though they contributed $9 million to the inflows recorded during the previous week."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8wOC90cm9uLWZvdW5kZXItanVzdGluLXN1bi1hYnJ1cHRseS1tb3Zlcy0xMzIwMDAwMDAtd29ydGgtb2YtZXRoZXJldW0tZXRoLWhlcmVzLXdoZXJlLXRoZS1jcnlwdG8taXMtZ29pbmcv0gGMAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzA4L3Ryb24tZm91bmRlci1qdXN0aW4tc3VuLWFicnVwdGx5LW1vdmVzLTEzMjAwMDAwMC13b3J0aC1vZi1ldGhlcmV1bS1ldGgtaGVyZXMtd2hlcmUtdGhlLWNyeXB0by1pcy1nb2luZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Tron Founder Justin Sun Abruptly Moves $132,000,000 Worth of Ethereum (ETH) – Here’s Where the Crypto Is Going - The Daily Hodl",
        "content": "On-chain data shows that Tron (TRX) founder Justin Sun is suddenly relocating hundreds of millions of dollars worth of Ethereum (ETH).\n\nCrypto tracker Lookonchain initially spotted Sun’s series of ETH transactions to the tune of $132 million.\n\nAccording to Lookonchain, Sun is withdrawing the massive Ethereum trove to the tune of 80,251 ETH from the liquid staking service provider Lido (LDO).\n\n“So far, he has successfully withdrawn 43,000 ETH ($70 million) and deposited it to Binance.”\n\nSince Sun sent his ETH stack to a crypto exchange, it could potentially be sold on the open market.\n\nLookonchain is also watching the movement of a crypto address associated with Ethereum co-creator Vitalik Buterin. The on-chain data tracker says that the address could be depositing 1,000 ETH worth $1.64 million to crypto exchange Bitstamp.\n\n“This address has deposited a total of 4,400 ETH ($7.23 million) to Bitstamp in the past two months.\n\nThis address received 70,000 ETH ($115 million) from Vb3 and is believed to be related to vitalik.eth (may be the address of vitalik.eth).“\n\nAt time of writing, Ethereum is trading for $1,628.83, down less than 1% in the last 24 hours. The second-largest crypto asset remains 66.51% down from its all-time high of $4,878 which it hit in November 2021.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/Tomasz Makowski"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGFpbHljb2luLmNvbS95MDB0cy1mbG9vci1qdW1wcy1hbWlkLWV0aGVyZXVtLW1vdmUtYnV0LXRoZXJlcy1hLWNhdGNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "y00ts Floor Jumps Amid Ethereum Move. But There's a Catch - DailyCoin",
        "content": "y00ts’ migration to Ethereum is set to take place this week.\n\nThe collection’s floor price has jumped amid the move.\n\nDespite the floor price spike, other metrics suggest that not much is going on.\n\nAs profile picture-focused NFT projects lose steam in the extended bear market, DeLabs created NFT project y00ts is betting on a move to Ethereum to rekindle excitement by reuniting with its sister DeGods community.\n\nWith the migration process set to kick off this week, the NFTs have seen an uptick in their valuation. Can y00ts make a comeback with its Ethereum move?\n\ny00ts Floor Jumps 2.2%\n\nIn a series of announcements on Sunday, October 8, DeLabs co-founder Rohun Vora, also known as Frank, disclosed that the migration of y00ts to Ethereum will begin this week, adding that holders can port their collectibles for free.\n\nAmid the announcement, the floor price for NFTs in the collection sits at 0.822 ETH, representing a 2.2% gain in the past 24 hours, according to data from CoinGecko at the time of writing.\n\nBut while the jump in floor price suggests potential excitement about the move, other metrics tell a different story.\n\nMuted Activity\n\nDespite the recent spike in floor price, the collection has not witnessed any trading activity in the past 24 hours, according to CryptoSlam data at the time of writing. Furthermore, the data suggests that activity surrounding the collection has declined for the past 30 days, with the sales volume at $655,612, representing a 78% slump.\n\nThe data sharply contrasts the initial surge in activity surrounding the collection when DeLabs announced the move in August 2023. At the time, y00ts sales volume surged by a whopping 278%. The current decline in activity suggests that not much is going on despite the planned migration, but it would be interesting to see if this changes as the migration enters full swing.\n\ny00ts’ Ethereum migration is the collection’s second in less than a year. The first migration saw y00ts move from Solana to Polygon in April 2023.\n\nOn the Flipside\n\nBroader interest in PFP NFTs is on a decline as interest shifts to tokenized assets and loyalty programs.\n\ny00ts’ initial Polygon migration was met with significant excitement .\n\nFrank teased the launch of an unnamed project to answer doubts surrounding DeLabs NFT projects.\n\nWhy This Matters\n\nWith the declining interest in PFP NFTs, there is a need for a new narrative to boost hype and engagement. For DeLabs NFT projects like y00ts and DeGods, the promise of unification could provide a short-term boost.\n\nRead this to learn more about the impact of the y00ts migration on the Polygon NFT ecosystem:\n\nIs y00ts’ Ethereum Migration a Blow to Polygon’s NFT Ecosystem?\n\nFTX’s Gary Wang revealed shocking details about the firm’s relationship with Alameda in the ongoing SBF trial. Find out more:\n\nFTX’s Wang Blows Lid on Alameda’s Privileges in SBF Trial"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzMzMTczL2V0aGVyZXVtLXByZWRpY3Rpb24tb2N0b2Jlci0wOS0yMDIzL9IBS2h0dHA6Ly9hbXAuY29pbmNvZGV4LmNvbS9hcnRpY2xlLzMzMTczL2V0aGVyZXVtLXByZWRpY3Rpb24tb2N0b2Jlci0wOS0yMDIzLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Dropped -3.28% in Last Month and is Predicted to Reach $ 1,757.01 By Oct 14, 2023 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum is down -3.26% today against the US Dollar\n\nEthereum is currently trading 9.66% below our prediction on Oct 14, 2023\n\nEthereum dropped -3.28% in the last month and is up 19.73% since 1 year ago\n\nEthereum price $ 1,587.26 Ethereum prediction $ 1,757.01 (9.64%) Sentiment Bearish Fear & Greed index 50 (Neutral) Key support levels $ 1,627.10, $ 1,613.85, $ 1,600.57 Key resistance levels $ 1,653.63, $ 1,666.91, $ 1,680.16\n\nETH price is expected to rise by 9.64% in the next 5 days according to our Ethereum price prediction\n\nis trading at $ 1,587.26 after losing -3.26% in the last 24 hours. The coin underperformed the cryptocurrency market, as the total crypto market cap decreased by -3.33% in the same time period. ETH performed poorly against BTC today and recorded a -1.66% loss against the world’s largest cryptocurrency.\n\nAccording to our Ethereum price prediction, ETH is expected to reach a price of $ 1,757.01 by Oct 14, 2023. This would represent a 9.64% price increase for ETH in the next 5 days.\n\nETH Price Prediction Chart\n\nBuy/Sell Ethereum\n\nWhat has been going on with Ethereum in the last 30 days\n\nEthereum has been displaying a negative trend recently, as the coin lost -3.28% in the last 30-days. The medium-term trend for Ethereum has been bearish, with ETH dropping by -15.28% in the last 3 months. The long-term picture for Ethereum has been positive, as ETH is currently displaying a 19.73% 1-year price change. On this day last year, ETH was trading at $ 1,325.70.\n\nEthereum reached its all-time high price on Nov 10, 2021, when the price of ETH peaked at $ 4,867.17. The current ETH cycle high is $ 2,182.43, while the cycle low is at $ 897.01. ETH has been displaying low volatility recently – the 1-month volatility of the coin is at 1.62. Ethereum recorded 17 green days in the last 30 days.\n\nEthereum technical analysis for today - Oct 09, 2023\n\nThe sentiment in the Ethereum markets is currently Bearish, and the Fear & Greed index is reading Neutral. The most important support levels to watch are $ 1,627.10, $ 1,613.85 and $ 1,600.57, while $ 1,653.63, $ 1,666.91 and $ 1,680.16 are the key resistance levels.\n\nBearish sentiment for Ethereum\n\n1 indicators are currently signaling a bullish prediction for Ethereum, while 28 indicators are showing a bearish forecast. With 97% of indicators favoring a negative prediction. This results in an overall Bearish sentiment for Ethereum.\n\nCrypto market is currently experiencing Neutral\n\nCurrently, the Fear & Greed index is at 50 (Neutral), which signals that investors have a neutral outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 1,645.54 (SELL) $ 1,640.35 (SELL) - - MA5 $ 1,641.32 (SELL) $ 1,642.48 (SELL) - - MA10 $ 1,656.36 (SELL) $ 1,645.21 (SELL) - - MA21 $ 1,634.03 (SELL) $ 1,641.64 (SELL) $ 1,777.22 (SELL) $ 1,724.26 (SELL) MA50 $ 1,641.23 (SELL) $ 1,663.00 (SELL) $ 1,654.52 (SELL) $ 1,756.53 (SELL) MA100 $ 1,752.83 (SELL) $ 1,709.44 (SELL) $ 2,049.15 (SELL) $ 1,816.93 (SELL) MA200 $ 1,802.71 (SELL) $ 1,730.07 (SELL) $ 1,679.63 (SELL) $ 1,633.50 (SELL)\n\nPeriod Value Action RSI (14) 50.56 NEUTRAL Stoch RSI (14) 68.55 NEUTRAL Stochastic Fast (14) 47.02 NEUTRAL Commodity Channel Index (20) 66.67 NEUTRAL Average Directional Index (14) 13.43 NEUTRAL Awesome Oscillator (5, 34) 11.44 NEUTRAL Momentum (10) -15.88 SELL MACD (12, 26) 2.25 NEUTRAL Williams Percent Range (14) -52.98 NEUTRAL Ultimate Oscillator (7, 14, 28) 46.20 NEUTRAL VWMA (10) 1,657.84 SELL Hull Moving Average (9) 1,628.17 BUY Ichimoku Cloud B/L (9, 26, 52, 26) 1,644.78 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum is at 50.56, suggesting that ETH is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum over the last 50 days. Currently, Ethereum is trading above the SMA 50 trendline, which is a bullish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETH closing price for the last 200 days. ETH is now trading above the SMA 200, signaling that the market is currently bullish.\n\nThe bottom line about this Ethereum prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum price prediction is Bearish. ETH would have to increase by 9.64% to hit our $ 1,757.01 target within the next five days. Moving forward, it will be important to monitor the ETH market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8wOC9tYW55LW9mLWV0aGVyZXVtcy1yaXZhbHMtbWF5LW5vdC1yZWNvdmVyLWluLW5leHQtYnVsbC1tYXJrZXQtY3ljbGUtYWNjb3JkaW5nLXRvLWJsb29tYmVyZy1jcnlwdG8tYW5hbHlzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Many of Ethereum’s Rivals May Not Recover in Next Bull Market Cycle, According to Bloomberg Crypto Analyst - The Daily Hodl",
        "content": "Alternative layer-1s attempting to dethrone Ethereum (ETH) might be running on borrowed time, according to Bloomberg crypto market analyst Jamie Coutts.\n\nCoutts says on the social media platform X that the rise of Ethereum layer-2s (L2s) is helping to take revenue away from ETH competitors.\n\n“The rise in L2s has meant that the Ethereum network has started to regain market share from the Alt-L1 (alternative layer-1) peers. In the past year, active address L2 growth outpaced Alt-L1s by 2x (albeit from a lower base)”\n\nCoutts says that alternative smart contract platforms are facing a number of headwinds that threaten their survival, including inflationary tokenomics, excessive block space and Ethereum’s rapidly growing network effects.\n\nEven though the total amount of fees generated by such blockchains is on a long-term uptrend, the analyst says that most of the chains could easily fade into obscurity over the next several years.\n\n“Despite the current bear market, Blockspace Demand is in a long-term structural uptrend. However, the crypto industry is plagued with serious issues that are entirely of its own making. It is possible that only a tiny subset will be relevant in a few years.”\n\nCoutts also says that many alternative layer-ones, due to a lack of activity, are most likely not generating enough fees to ensure the future security of their networks.\n\nSays the analyst,\n\n“Although a cratering treasury market may invalidate our thesis since 4Q22 that 2022 capitulation was the cycle low for ETH, our outlook for the asset remains positive.\n\nHowever, for many Alt-L1s (not all) due to inadequate demand and subpar tokenomics we maintain a negative outlook.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Salamahin/Angelatriks"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vYmxvY2tvbm9taS5jb20vZXRoZXJldW1zLWNlbnRyYWxpemF0aW9uLWNvbmNlcm5zLXJpc2UtcG9zdC1tZXJnZS1hbmQtc2hhbmdoYWktc2F5cy1uZXctcmVwb3J0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum's Centralization Concerns Rise Post-Merge and Shanghai, Says New Report - Blockonomi",
        "content": "Is Ethereum becoming more centralized after two major upgrades?\n\nA recent research analyzes the effect of The Merge and Shanghai. JPMorgan’s new report shed light on Ethereum’s greater centralization after The Merge and Shanghai, the two major upgrades of the network in a year.\n\nAccording to the insight, the transition from Proof-of-Work to Proof-of-Stake has seen a surge in Ethereum staking. However, this has led to a decline in the overall staking yield and the growing centralization.\n\nPeople don’t want highly centralized systems, but it looks like Ethereum is going in that direction.\n\nGreater Centralization, Less Yield\n\nAs reported, the total staking yield for Ethereum has decreased to around 5.5%. Before the Shanghai upgrade, this figure stands at 7.3%.\n\nLido Finance is a go-to alternative for interested people who want to stake Ethereum without relying on a centralized entity. The protocol additionally has taken steps to mitigate centralization concerns by adding more node operators.\n\nHowever, despite Lido’s efforts, there are still centralization risks. Lido currently accounts for “almost one-third” of staking on Ethereum.\n\nThe report noted that a, “concentrated number of liquidity providers or node operators could act as a single point of failure or become targets for attacks or collude to create an oligopoly that would promote their own interests at the expense of the interests of the community.”\n\nApart from centralization, rehypothecation was also a highlighted risk in the bank’s study. This is a common practice in traditional finance where an asset or collateral is used as collateral for multiple loans or other financial transactions simultaneously.\n\nWhile rehypothecation can reduce the cost of borrowing and increase liquidity in financial markets, it can also amplify risks, especially during periods of financial stress. A recently known example of this risk is the collapse of Silicon Valley Bank.\n\nEthereum’s Co-founder Warns of Liquid Staking\n\nLiquid staking offers a multitude of advantages to both users and the broader blockchain ecosystem. When users stake their tokens, they help make the network safer and earn extra rewards.\n\nPlus, these users retain the flexibility to actively engage in various projects within the decentralized finance (DeFi) space. But it comes with high risks.\n\nLido Finance, while not the only platform offering ETH staking through its model, stands out with a substantial million ETH staked, representing approximately one-third of the total ETH staked on the Ethereum consensus layer.\n\nHowever, amassing such a significant portion of staking power raises concerns about increased risk.\n\nThe primary driver behind Lido’s extensive ETH staking is its exceptionally high yield. With various options delivering attractive returns, investors are flocking to stake their ETH on the Lido platform. This influx can lead to an imbalance, particularly when a crisis hits.\n\nEthereum’s co-founder, Vitalik Buterin, has raised concerns about the dominant role of liquid staking protocols, particularly Lido and Rocket Pool, in the Ethereum staking ecosystem.\n\nHe believes that although there are many validators, these two protocols still pose risks. To address this, he suggests changes to Ethereum itself, including giving more governance power to a small group of stakers.\n\nButerin also discussed the idea of integrating certain protocols and features directly into Ethereum’s source code instead of keeping them separate. He highlighted ERC-4337, an account abstraction standard, as a priority but cautioned that this could be a complex process with potential challenges.\n\nDebates around PoS consensus have circled in the crypto community even before The Merge. Some express concerns that this shift, while aiming to enhance scalability, may compromise the security and decentralization valued in PoW.\n\nPreviously, censorship was a major concern during the transition. Ethereum is now poised for its next major upgrade, called Dencun, anticipated in early 2024."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTA5L2V0aGVyLWV0aC1kaXNhcHBvaW50bWVudC1oYXMtYml0Y29pbi1idGMtZ2FpbmluZy1zaGFyZS1kdXJpbmctZG93bnR1cm7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ether Disappointment Has Bitcoin Gaining Crypto Market Share During Downturn - Bloomberg",
        "content": "Ether is ceding ground to market bellwether Bitcoin with investors seeking refuge in the most widely-held digital asset while the recent downturn in crypto prices deepens.\n\nThe second-largest digital currency by market value has slumped around 18% since June, while Bitcoin was down around half that amount during the same period. Ether dropped as much as 5.4% to $1,639 on Monday, and the original cryptocurrency slipped as much as 2.3% to $27,290."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8yMDA1MjAvZXRoZXJldW0taW5mbGF0aW9uLWV0aC1zdXBwbHktaGFzLWdyb3duLWJ5LTQ3LW1pbGxpb24taW4tMzAtZGF5c9IBYGh0dHBzOi8vZGVjcnlwdC5jby8yMDA1MjAvZXRoZXJldW0taW5mbGF0aW9uLWV0aC1zdXBwbHktaGFzLWdyb3duLWJ5LTQ3LW1pbGxpb24taW4tMzAtZGF5cz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Inflation? ETH Supply Has Grown by $47 Million in 30 Days - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum fans widely hyped last year’s merge as a decisive event that would permanently establish ETH as “ultrasound money.” Ethereum’s historic transition from proof of work to proof of stake last September reduced ETH issuance by 90%; many so-called Ethereum maximalists were convinced the change would clinch ETH’s status as a deflationary currency that would only, thereafter, appreciate in value.\n\nA year later, things aren’t looking so certain.\n\nIn the last 30 days alone, global ETH supply has surged by nearly 30,000 ETH, equivalent to roughly $47.9 million at writing, according to data aggregator ultrasound.money. That sharp uptick in the amount of ETH in circulation is mostly thanks to an equally stark decline in transaction flow on the Ethereum network: far fewer NFT trades, and much less DeFi activity.\n\nAD\n\nAD\n\nSince 2021, the Ethereum network has operated on a fee-burning mechanism: the more traffic on the network, the more gas prices—which are required to complete on-chain transactions—rise. The higher gas prices are, the more ETH is “burned” by the network, or permanently removed from circulation.\n\nAs of late, Ethereum gas fees have dropped remarkably low—an average network transaction currently costs 7 gwei, or just $0.24. An average transaction on NFT marketplace OpenSea costs about $0.94. Contrast that with just over a year ago: during the sale of Yuga Labs’ Otherside collection last May, for example, network users burned over $157 million worth of Ethereum to mint just 55,000 virtual land deed NFTs: an average of $2,854 in fees alone per transaction.\n\nWhile low gas fees might be good for the average Ethereum user, they also lead to the burning of less ETH—and thus, surges in global ETH supply.\n\nIs Ethereum becoming inflationary again? Yes, it is, and that's because Ethereum fees, which are supposed to burn ethers, are everywhere but not on Ethereum: its own L2s (Arbitrum, Polygon, etc.) and EVM competitors (BNB, Avalanche C, etc.) Limiting L1 dooms cryptocurrencies. pic.twitter.com/cE82gwUbZR — Nikita Zhavoronkov (@nikzh) September 23, 2023\n\nEthereum’s recent inflationary trend has caused some concern among crypto users and investors who fear current trends may spell trouble for the network’s long-term financial health.\n\nAD\n\nAD\n\nThe critical problem with Ethereum is that its future supply is unknown, unpredictable, and potentially inflationary. For Ethereum to be deflationary, tx fees must be high which means it must fail to scale and tx volume must not move to other crypto securities like Solana. pic.twitter.com/dITZ7RfSf6 — Joe Burnett (🔑)³ (@IIICapital) October 2, 2023\n\nBut the team behind Ethereum appears largely unconcerned about the development.\n\n“I suspect that none of the core devs care,” Micah Zoltu, an Ethereum core developer, told Decrypt of his colleagues’ attitudes on the subject. “If you look at the grand scheme of things, it is insignificant.”\n\nDanno Ferrin, another Ethereum core developer, said he had not been concerned by Ethereum’s recent inflationary kick.\n\n“It is still below the all-time high [ETH supply],” Ferrin told Decrypt. “And [Ethereum’s] short-term inflation is well below other chains and the economy as a whole.”\n\nInflation has been consistently on the rise globally since last year; in the United States, prices rose last June at the sharpest year-over-year rate recorded since 1981. In response to this economic climate, the U.S. Federal Reserve has repeatedly raised interest rates, a move that has persistently lowered the values of cryptocurrencies like Bitcoin and Ethereum."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1ldGhlcmV1bS1kb2dlY29pbi1kZWNsaW5lLWFzLSQxMDBtLXZhbmlzaGVzLWluLWEtc2luZ2xlLWRheS1hbWlkLWlzcmFlbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Decline As $100M Vanishes In A Single Day Amid Israel-Palestinian Conflict: Analyst ... - Nasdaq",
        "content": "Major cryptocurrencies plunged on Monday evening following an escalation in the Israeli-Palestinian conflict over the weekend.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Bitcoin (CRYPTO: BTC) -0.49% $27,592 Ethereum (CRYPTO: ETH) -0.73% $1,579 Dogecoin (CRYPTO: DOGE) -0.99% $0.052\n\nWhat Happened: Cryptocurrency traders faced significant losses exceeding $100 million from liquidations during Monday’s market downturn, which was triggered by a decline in digital asset prices coupled with an increasing conflict in the Middle East.\n\nWithin the last 24 hours, over 42,778 traders have been liquidated, resulting in a staggering total of $114.94 million in liquidations. The largest individual liquidation occurred on Binance, involving the ETH/BUSD pair with a value of $4.53 million.\n\nCoinGlass data reveals that a staggering $105 million of long positions, which were speculative bets on price increases, were entirely wiped out. These liquidations occur when an exchange terminates a leveraged trading position due to either a complete or partial loss of the trader’s initial margin. Essentially, this happens when the trader fails to meet the margin requirements or lacks sufficient funds to sustain the position.\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga’s exclusive event – Future of Digital Assets. Tickets are flying- get yours!\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Tether Gold +0.70% $1,845 Monero +0.27% $154 Pax Gold +0.05% $1,857\n\nThe global crypto market cap currently stands at $1.09 trillion, reflecting a decrease of 0.35% in the past 24 hours. Cryptocurrencies didn’t mirror the gains seen in other risk assets on Monday. The S&P 500 gained 0.63%, ending at 4,335.66. The tech-heavy Nasdaq Composite added 0.39%, landing at 13,484.24.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes\n\nCrypto analyst Michael Van de Poppe said Bitcoin is currently holding the critical support level.\n\n\"Most likely the path towards $30K is going to start from here. Gold is up, uncertainties rise, Yields are down, so Bitcoin should follow.\"\n\n#Bitcoin holding crucial level of support.Most likely the path towards $30K is going to start from here. Gold is up, uncertainties rise, Yields are down, so Bitcoin should follow. pic.twitter.com/9CoAPqK6dU\n\n— Michaël van de Poppe (@CryptoMichNL) October 9, 2023\n\nPseudonymous analyst Altcoin Sherpa said ETH, BTC is \"getting slaughtered, I don’t see a bounce until we get to lower areas. Thinking low 0.05s. That said, I still think November is a great time to buy altcoins.\"\n\nThe analyst added, \"The time for a short altcoin rally is just right around the corner IMO.\"\n\n$ETH: ETHBTC getting slaughtered, I don't see a bounce until we get to lower areas. Thinking low 0.05s. That said, I still think November is a great time to buy altcoins.The time for a short altcoin rally is just right around the corner IMO. #Ethereum pic.twitter.com/cgzwXVym5j\n\n— Altcoin Sherpa (@AltcoinSherpa) October 10, 2023\n\nSince October 6, on-chain analytics firm Santiment has observed a noticeable shift in the cryptocurrency community’s focus from regular price discussions to the Israel and Palestine conflict. While the conflict has not had a significant impact on the crypto market thus far, it is important to note that further escalation could potentially result in heightened price sensitivity.\n\n🇮🇱🇵🇸 Since October 6th, there has been an unsurprising shift away from regular price discussions, and over to #Israel and #Palestine. The #conflict has yet to have a notable impact on #crypto, but further escalation may lead to increased price sensitivity. https://t.co/FPKjV6peAR pic.twitter.com/4nfhBwGJkk\n\n— Santiment (@santimentfeed) October 9, 2023\n\nPhoto by FellowNeko on Shutterstock\n\nJoin Benzinga’s Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions and institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tZm91bmRhdGlvbi1zb2xkLTE3MDAtZXRoLWZvci0yLTc0LW1pbGxpb24tdXNkY9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Foundation Sold 1,700 ETH for $2.74 Million USDC - Watcher Guru",
        "content": "The Ethereum Foundation has liquidated approximately 1,700 ETH worth $2.76 million into the stablecoin USDC, according to transaction data from analytics firms.\n\nThe non-profit organization converted the Ethereum directly into USDC via the Uniswap decentralized exchange. The associated wallet now holds around $3.7 million in assets, including 240 ETH along with USDC, DAI, and ARB tokens.\n\nThe foundation’s ETH reserves have declined from 395,000 ETH in Q1 2022, equal to 0.3% of total Ethereum supply. However, it still retains substantial holdings.\n\nJUST IN: Ethereum Foundation sold 1,700 ETH for $2.74 million $USDC. — Watcher.Guru (@WatcherGuru) October 9, 2023\n\nEthereum Foundation’s reasons for ETH sale are unclear\n\nWhile the reasons for the sale are unclear, the converted amount seems to align with funding the foundation’s ongoing operations, including research grants.\n\nIn 2021, total expenses amounted to $48 million, including developer grants aimed at improving Ethereum infrastructure. Ongoing bear market conditions may have necessitated liquidating portions of ETH reserves to maintain funding.\n\nAlso read: Ripple vs. SEC: Lawyer’s Predictions Point to a Potential 2027 Resolution\n\nThe converted ETH amounts to a small fraction of holdings prudently utilized to further Ethereum’s growth during challenging markets.\n\nWhile the Ethereum Foundation still holds substantial assets, its activities are impacted by price declines like any other entity. ETH has dropped below $1,600 at press time, with a 2.4% drop in value over the last 24 hours. According to CoinMarketCap data, ETH is trading at $1,592."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2NvaW5wZWRpYS5vcmcvYWx0Y29pbi9ldGhlcmV1bS1mYWxscy1zaWNrLWF0LXBhdHRlcm5zLXN1cHBvcnQtbGluZS1mb2xsb3dpbmctbGFyZ2Utc2VsbG9mZi13aWxsLWJ1bGxzLXJldmVyc2UtZXRoLXByaWNlLXRyZW5kL9IBigFodHRwczovL2NvaW5wZWRpYS5vcmcvYWx0Y29pbi9ldGhlcmV1bS1mYWxscy1zaWNrLWF0LXBhdHRlcm5zLXN1cHBvcnQtbGluZS1mb2xsb3dpbmctbGFyZ2Utc2VsbG9mZi13aWxsLWJ1bGxzLXJldmVyc2UtZXRoLXByaWNlLXRyZW5kL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Falls Sick At Pattern’s Support Line Following Large Selloff: Will Bulls Reverse ETH Price Trend? - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nThe crypto market has been sluggish in recent days, with both Bitcoin and Ethereum prices facing significant sell-offs near resistance levels. Although the ‘Uptober’ trend experienced a revival in the last few days, whale players have not missed any opportunities to book their gains and exit the market profitably. This sentiment has created strong selling pressure and has substantially strengthened the resistance level.\n\nEthereum’s $1,650 Stand Amid The ‘Uptober’ Mirage\n\nDespite the bullish ‘Uptober’ predictions that hinted at a bullish October for the crypto market, Ethereum has found itself struggling with bearish domination. The anticipated upward trend, which saw a ray of hope in the initial days of the month, has been now fading due to Ethereum’s bearish price action. One can say that ‘Uptober’ is now becoming just a mirage.\n\nEthereum’s struggle to maintain trading above the $1,650 mark has been evident amidst a massive selloff by whale investors. This activity has notably weakened buyer confidence, with Coinglass’ liquidation data revealing over $12.5 million in total long-liquidations just minutes after ETH price faltered, failing to hold above $1,630.\n\nData from IntoTheBlock indicates a surge in large transactions yesterday, with whales suddenly becoming active following a $10 drop in ETH price from $1,639 to $1,629. The metric jumped from $1.38 billion to $1.7 billion, marking a $320 million increase. This uptick in large transactions was due to whales executing positions, serving as a key factor in the recent decline and further weakening the support level.\n\nNotably, the Ethereum Foundation, an entity in the development and ecosystem of the Ethereum network, recently divested a portion of its allocated Ether (ETH) tokens. The grant-issuing body executed a sale of 1,700 ETH in exchange for 2.738 million USDC on the decentralized exchange, Uniswap, at 16:18 UTC+8.\n\nWill Bulls Make A Reversal?\n\nEther faced a notable rejection at the resistance of $1,640 after the resistance of $1,650 was weakened. After the price reached a low of $1,585, it experienced a reversal following buyers’ aggressive purchases. Currently, ETH price is trading at $1,594, declining over 2.1% from yesterday’s rate.\n\nThe 20-day Exponential Moving Average (EMA) at $1,627 is currently displaying a declining trend, with the Relative Strength Index (RSI) hovering around the oversold zone at 31. These indicators collectively suggest a selling sentiment in the market.\n\nHowever, ETH price has initiated a minor rebound from the pattern’s support line. Should the price hold its current momentum, the bulls will make another attempt to breach the immediate resistance at $1,650. A successful breakthrough would result in the ETH price testing the level of $1,744.\n\nConversely, if the price continues to descend and falls below the pattern’s line, it would imply that the price might trigger a bearish consolidation. In this scenario, ETH price might test buyers’ patience at $1,530."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8yMDA2MDQvaHVvYmktcmVjbGFpbXMtOC1taWxsaW9uLWluLXN0b2xlbi1ldGgtYWZ0ZXItb2ZmZXJpbmctYm91bnR5LXRvLWhhY2tlctIBZmh0dHBzOi8vZGVjcnlwdC5jby8yMDA2MDQvaHVvYmktcmVjbGFpbXMtOC1taWxsaW9uLWluLXN0b2xlbi1ldGgtYWZ0ZXItb2ZmZXJpbmctYm91bnR5LXRvLWhhY2tlcj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Huobi Reclaims $8 Million In Stolen Ethereum After Offering Bounty to Hacker - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHuobi Gloabl’s cryptocurrency exchange has recovered millions in stolen funds from a hacker who absconded with them in September after making contact with the attacker and negotiating a deal to see it returned.\n\nJustin Sun, a Huobi Global investor and HTX adviser, took to Twitter on Saturday to announce that $8 million in stolen Ether (ETH) was restored and that the hacker made “the right choice” to accept HTX’s offer.\n\n\"We have confirmed that the hacker has fully returned all funds, as promised, and we have also paid the hack a white hat bonus of 250 ETH,\" wrote Sun in a post. “Providing full security for user assets is always our goal to strive for!”\n\nAD\n\nAD\n\nHTX first disclosed the hack on September 25 after one of the exchange's hot wallets was compromised and drained of 5,000 ETH.\n\nAt the time, Sun assured customers that the amount was a \"relatively small sum\" versus what he said was HTX’s $3 billion in assets. Sun also said at the time that HTX would offer 5% of the stolen ETH as a \"white-hat reward\" to encourage the hacker to return the funds—but warned that the firm would contact law enforcement if the offer wasn't accepted within a week.\n\nCrypto firms have sometimes found themselves left negotiating with hackers to get stolen funds back rather than turning to law enforcement agencies for help. In more than one of these deals, the firm and the hacker were able to reach an agreement in which the bulk of the funds are restored, and a bounty is then paid to the hacker to close things out.\n\nHacks against cryptocurrency exchanges are a persistent risk, but the types of exchanges targeted have differed.\n\nIn the second quarter of 2023, there was a 63% increase in blockchain hacks compared to the same time last year, according to an Immunefi report from July. The company also found that most of the hacks happened on DeFi platforms, which lost $228 million across 79 incidents. By comparison, centralized exchanges—like HTX—only lost a reported $37 million across two incidents.\n\nAD\n\nAD"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiqwFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9wcmVzcy1yZWxlYXNlcy9ldGhlcmV1bS1ldGgtYW5kLXZlY2hhaW4tdmV0LXByaWNlcy1zdHJ1Z2dsaW5nLXRvZGF5LWJ1dC1zZWVzLWJyaWdodC1mdXR1cmUtdG9tb3Jyb3ctaG93LWhpZ2gtY2FuLXJlYWNoLWV0aGVyZXVtLWFuZC12ZWNoYWluLXByaWNlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) and Vechain (VET) Prices Struggling Today, But Sees Bright Future Tomorrow. How High Can Reach ... - NewsBTC",
        "content": "Ethereum (ETH) – The market sentiment for Ethereum leans towards a ‘Sell’ with the cryptocurrency showcasing restrained trading movements and indicators suggesting potential uncertainties ahead; it might be a cautious investment.\n\nVeChain (VET) – VeChain, known for its supply chain solutions, showcases a ‘Strong Sell’ sentiment and faces market resistance, indicating caution is required for potential investors.\n\nScapesMania – This emerging coin offers potential high returns, aligns with the massive gaming industry, and showcases significant promise; it’s a good investment.\n\nFollowing a recent market analysis by Enigma Securities, a noted institutional digital asset liquidity and advisory firm, the cryptocurrency sphere appears to be entering a phase of low volatility. The firm’s mid-week report forecasts a period of market consolidation, likely to stretch through the end of October, offering a ripe window for long-term investors to accumulate assets like Ethereum (ETH) and VeChain (VET). This notion was echoed by Vetle Lunde, a senior analyst at K33 Research, who noted a sideways market movement in the near term. Amidst this calm, the CoinDesk Market Index nudged a modest 0.8% higher.\n\nThe traditional markets too, exhibited a semblance of calm following a rough Tuesday session, as fresh jobs data showcased a cooling US labor market. The ADP’s report of 89,000 new jobs in September, significantly below the anticipated 153,000, mirrored the smallest rise in private sector jobs since 2020, according to Kathy Jones, chief fixed income strategist at Charles Schwab.\n\nThe crypto market seems to be mirroring this broader financial stability, with Ethereum (ETH) and VeChain (VET) showcasing restrained trading movements. Ethereum (ETH), known for its smart contract functionality, has seen its trading value hover within a range of $1,570 to $1,733. Over the last month, its price edged up by a mere 0.48%, and 0.99% over the last week, reflecting a strong support at the $1,849 mark. Market sentiment for Ethereum (ETH) leans towards a ‘Sell’, with oscillators indicating a ‘Neutral’ stance and moving averages suggesting a ‘Strong Sell’.\n\nOn the other side, VeChain (VET), a blockchain platform designed to enhance supply chain management, has its trading value nestled between $0.0151 and $0.0192. Over the past month, the VeChain (VET) price appreciated by 7.45% and nudged slightly higher by 0.26% over the last week. Similar to Ethereum (ETH), the market sentiment around VeChain (VET) skews towards a ‘Strong Sell’, with both oscillators and moving averages indicating a selling bias.\n\nExperts opine that this phase of consolidation may extend the opportunity for discerning investors to bolster their crypto portfolios, as the market sentiment hints at a cautious approach. As traditional markets exhibit signs of steadiness, it’s plausible that the crypto realm may follow suit, basking in a period of low volatility and potentially lucrative accumulation windows.\n\nIndeed, Ethereum (ETH) and VeChain (VET) present a solid foundation for portfolio concentration amid this consolidation phase, offering a semblance of stability in a typically volatile market. However, they may not deliver the sharp price escalations akin to promising presale coins like Scapesmania, a project expected to surge by over 500% after listing.\n\nHence, investors should diversify their attention towards such budding projects, which can potentially provide lucrative returns amidst a steady market backdrop. This balanced outlook could navigate through the existing market tranquility while also tapping into the high-reward potential of emerging coins, preparing a well-rounded portfolio for both present stability and future growth.\n\nEthereum (ETH) Price Forecast\n\nEthereum (ETH), a linchpin for smart contracts and decentralized apps, faces a delicate balance amid market pressures and intrinsic potential. Its price, fluctuating between $1,570 and $1,732, has seen peaks at $1,743 and troughs at $1,077, indicating a volatile ride. Key indicators like the 3-10 Day MACD Oscillator stalling at $1,667 and Price Crossing the 40 Day Moving Average at $1,658 hint at potential uncertainties ahead. The diverging expert forecasts, oscillating between the optimism of a 1-month high rebound and the reality of multiple price stalls, make the Ethereum (ETH) journey a focal point for crypto enthusiasts. As the Ethereum (ETH) future performance may potentially be volatile, it makes sense to consider new evolving contenders like ScapesMania.\n\nVeChain (VET) Price Forecast:\n\nVeChain (VET), known for blockchain-based supply chain solutions, treads a challenging path akin to Ethereum. Its price, ranging between $0.0151 and $0.0191, reflects market caution as it faced resistance at the 40-day moving average of $0.0232, hinting at a pause in bullish momentum. The 3-10-16 Day MACD Moving Average stalling at $0.0196 suggests a potential cooling phase. If VET breaks the 1-month high of $0.0233, it may reignite optimism among proponents, though its proximity to the 52-week low of $0.0153 requires cautious navigation amidst market hurdles. In the midst of the uncertainty surrounding the future of VeChain (VET), ScapesMania emerges as an appealing opportunity worth exploring.\n\nScapesMania: Crypto’s Vibrant Landscape\n\nScapesMania is an innovative project where casual players pave the way for blockchain enthusiasts to benefit from a thriving gaming ecosystem. Here, you can shape the future of the project with DAO within the booming $286.50-billion industry and reap enticing holder rewards. With a dynamic roadmap and continuous development, ScapesMania’s potential post-listing ROI of 412% can be just the tip of the iceberg.\n\nThe Driving Forces Behind ScapesMania\n\nScapesMania is not a single project; it’s a thriving gaming ecosystem with diverse revenue streams. A grant-winning team with open social media profiles behind ScapesMania exemplifies transparency and instills confidence in the project’s growth potential. ScapesMania’s community boasts over 59K followers — think of endless opportunities for ad revenue!\n\nThe ambition of ScapesMania extends beyond its innovative concept: it has passed one audit and is in the process of another. Poised for liquidity and visibility, ScapesMania is already listed on major tracking platforms, with the presence on key exchanges on the horizon.\n\nWhy Join ScapesMania Now\n\nProjects with similar trajectories have rewarded early adopters with staggering x400-x500 ROI immediately after listing. Why not use this opportunity to secure a brighter future where your funds can potentially grow beyond the ordinary?\n\nRight now, you can grab ScapesMania tokens for $0.002428 during the presale — an opportunity that won’t last long! The listing price is $0.01, offering you the potential for a 412% return. Don’t wait anymore – seize the moment and secure your ScapesMania tokens today! The current 80% discount won’t last forever.\n\n<<Join the Presale>>\n\nThe performance of reviewed Crypto’s:\n\nName Price 24h % 7d% 1m% YTD% Ethereum (ETH) $1,633.66 -0.60% -2.54% 0.36% 66.17% Vechain (VET) $0.01674 0.58% -1.28% 7.55% 4.31%\n\nLong-term price prediction Table:\n\nName 2024 2025 2026 2027 2028 2029 2030 Ethereum (ETH) $2,386 $3,748 $5,694 $8,180 $11,845 $16,729 $23,724 Vechain (VET) $0.0265 $0.0375 $0.0556 $0,0813 $0.119 $0.174 $0.255\n\nWeighing the Scales: Concluding Thoughts\n\nIn today’s dynamic crypto atmosphere, seasoned players like Ethereum (ETH) and VeChain (VET) show signs of indecision. While they continue to exhibit trading significance, market vagaries pose constant challenges. On the other hand, newcomers like ScapesMania seem poised to carve out their niches, leveraging distinct strategies and fresh offerings.\n\nBy embracing ScapesMania today, you could be looking at a potential ROI of over 500% thanks to the post-listing price surge, a whopping +150% bonus, and other incentives for holders. Now is the right moment to act if you want to grab a 80% discount on purchase as well!\n\nFind out more about ScapesMania:\n\nVisit the ScapesMania Presale\n\nJoin the Telegram Group\n\nFollow ScapesMania on Twitter\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of NewsBTC. NewsBTC does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW0tZGV2ZWxvcGVycy1tYXktbm90LXByb2xvbmctdGhlLWZyZXNoLWRldm5ldC1sYXVuY2gv0gFaaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3doeS1ldGhlcmV1bS1kZXZlbG9wZXJzLW1heS1ub3QtcHJvbG9uZy10aGUtZnJlc2gtZGV2bmV0LWxhdW5jaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Why Ethereum developers may not prolong the fresh Devnet launch - AMBCrypto News",
        "content": "The network participation rate on Ethereum increased to 90% as Devnet-9 closes in on completion.\n\nThe Dencun testnet could launch before November ends.\n\nEthereum [ETH] developers had their usual All Core Developers Consensus (ACD) call on 5 October. From the meeting, they decided the timing for the Devnet-10 launch could happen earlier than initially projected.\n\nHow much are 1,10,100 ETHs worth today?\n\nOnce the block generator clears the way\n\nAlthough the ACDC call #119 focused on the Dencun upgrade, the developers considered discussing the health and status of the latest developer Testnet Devnet-9 as a priority, alongside Devnet-10.\n\nFor the unfamiliar, Devnet-9 launched on 29 September, as a way to improve the network participation rate on the blockchain. The network participation rate is defined as the percentage of validators actively carrying out their duties on the network.\n\nDuring the meeting, the developers noted that the network participation rate was impressively high at 90%.\n\nHowever, Barnabas Busa, a DevOps Engineer for the Ethereum Foundation, mentioned that there were a few bugs with Devnet-9, especially in the execution layer. For context, the execution layer is the part of the network responsible for validating the state in the block header.\n\nMeanwhile, the Ethereum Foundation seemed to be working on fixing the bug as Geth developer Marius van der Wijden said that he was working on updating the block generator for the execution layer.\n\nNext, on the agenda was the Devnet-10, which is primarily to check the next maximum epoch churn limit in EIP-7514. EIP-7514 is designed to slow down the growth of the active validator set by tracking the soaring levels of staked ETH.\n\nDencun Testnet is set before November\n\nAt the time of writing, Santiment showed that the number of validator deposits was 1026. This was a notable decrease from the highs registered some weeks back. Therefore, the decline means that the objectives for Devnet-10 may already be set in motion.\n\nAs expected, Ethereum’s development activity has started to rise again. The Development Activity means the code committed by developers toward upgrades on a network. Over the past month, the metric tumbled. So, the slight rise implies that developers were starting to get back to polishing the network.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAs per Devnet-10, Parithosh Jayanthi, another DevOps Engineer at the Foundation mentioned that it could launch as early as next week. The Berlin-based developer, however, mentioned that the timeframe could be subject to the quickness of solving outstanding bugs and issues. Busa also weighed in on the matter saying,\n\n“I would like to see all clients being able to participate and no more bugs on Devnet-9 before we proceed with the larger test. We should have a very stable, like 100% participation, before we move on.”\n\nRegarding the Dencun final upgrade the cal chairman Tim Beiko restated that the public Testnet would happen before Ethereum’s Instabul conference in mid-November called Devconnect."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYm9sZC5jb20vbWljaGFlbC1zYXlsb3Itd291bGQtYmUtdXAtMi01LWJpbGxpb24taWYtaGUtY2hvc2UtZXRoZXJldW0tb3Zlci1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Michael Saylor would be up $2.5 billion if he chose Ethereum over Bitcoin - Finbold - Finance in Bold",
        "content": "Three years into the bold ‘Bitcoin Initiative’ by MicroStrategy co-founder Michael Saylor, which has seen his company steadily purchasing Bitcoin (BTC) and currently ‘hodling’ close to 160,000 units, it looks like betting on Ethereum (ETH) instead would have been more profitable.\n\nIn fact, if MicroStrategy had bought Ethereum instead of Bitcoin, the company would have been $2.5 billion in profit instead of around $400 million in a loss at press time, according to the analysis by Bitcoin Rainbow Chart creator Holger Rohm, a.k.a. rohmeo.eth shared on October 9.\n\nOn top of that, the cryptocurrency analyst pointed out that the company would have held 11% of staked Ethereum (if staked) and would have earned “way more from staking than their core business does,” according to the data retrieved from BlockchainCenter.net.\n\nIndeed, as Finbold reported in late September, MicroStrategy was, at the time, recording $500 million in unrealized losses as Bitcoin was trading around $26,200 – notably lower than MicroStrategy’s average buy price.\n\nBitcoin price analysis\n\nAt press time, the flagship decentralized finance (DeFi) asset was changing hands at the price of $27,515, recording a decrease of 1.21% in the last 24 hours, as well as declining 2.84% across the previous seven days while still gaining 6.44% on its monthly chart.\n\nBitcoin 30-day price chart. Source: Finbold\n\nEthereum price analysis\n\nMeanwhile, the price of Ethereum at the time of publication stood at $1,593.93, which represents a loss of 1.63% on the day, a drop of 7.97% in the past week, as well as losing 2.43% to its value in the previous month, as per the most recent data retrieved on October 9.\n\nEthereum 30-day price chart. Source: Finbold\n\nAll things considered, Saylor’s Bitcoin bet might yet pay off, and massively. As it happens, many crypto analysts and investors believe that the maiden digital asset might still have a major bull run in its future, especially as it approaches its halving event, and could possibly even reach the price of $1 million.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS9kaXJ0eS1tb25leS1pbi1ldGhlcmV1bS1zdGFraW5nLW1heS1zcG9vay1pbnN0aXR1dGlvbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Illicit activity in Ethereum staking is low. It's still enough to spook big finance firms - DLNews",
        "content": "A new report finds Ethereum liquid staking providers are exposed to illicit funds at a very low level.\n\n'The dark number is probably significantly higher,' Northstake head of compliance Sebastian Heine said.\n\nIllicit funds could raise concerns for institutional investors.\n\nDeFi protocols that pool users’ Ether for staking are exposed to funds tied to money laundering, scams, sanctioned addresses and malicious actors, according to a new report by digital asset infrastructure provider Northstake shared with DL News.\n\nWhile the proportion of dirty to clean funds is small, it may still present challenges for institutional investors bound by stringent regulations.\n\nThe report looked at three of the top Ether liquid staking protocols and found each had been exposed to funds tied directly to illicit activities, as well as those connected to high-risk crypto exchanges and gambling sites that don’t require users to pass know-your-customer checks.\n\nDark number\n\nSebastian Heine, Northstake’s chief of risk and compliance, said they are likely underestimating exposure.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\n“The dark number is probably significantly higher,” Heine told DL News, referring to the actual amount of illicit or otherwise questionable crypto found in the staking protocols Northstake analysed.\n\n“Even though we have good tracking tools on blockchain, it still needs human effort, time, and expertise to identify these addresses and clusters which are related to sanctioned transactions,” he said.\n\nNorthstake found that total illicit and high-risk exposure was small — between 0.46% and 1.56% across the three protocols the report examined. Still, according to Northstake, this creates a serious dilemma for regulated entities looking to dip their toes in liquid staking protocols.\n\nThe report doesn’t identify the liquid staking protocols it analysed. Lido and Rocket Pool, the two largest liquid staking protocols, did not immediately return DL News’ requests for comment.\n\nJoin the community to get our latest stories and updates\n\n‘Regulated institutions have a matrix of issues to grapple with to access staking on the Ethereum blockchain.’ — James Butterfill, CoinShares\n\n“The level of exposure raises concerns and questions about acceptable thresholds for exposure to illicit funds, which an institutional investor is either willing to accept or legally allowed to carry,” the report said.\n\nLiquid staking protocols remove complexity in Ether staking and increase market efficiency. They stake depositors’ Ether for them and give out placeholder tokens, called liquid staking tokens, in return. They are also sometimes called liquid staking derivatives, though some note that the term “derivatives” comes with regulatory baggage.\n\nStaking rewards\n\nThese liquid staking tokens automatically accrue Ether staking rewards while also letting holders use them elsewhere, like as collateral for taking out DeFi loans.\n\nThis year, the Ether liquid staking market has exploded. In January, Lido, the largest Ether liquid staking provider, held $5.8 billion in deposits. Over the course of the year, that figure increased to $14.5 billion — a 150% gain.\n\nInvestor deposits in liquid staking derivatives protocols\n\n‘A matrix of issues to grapple with’\n\nThere’s a lot institutional stakers must consider, according to James Butterfill, head of research at digital asset manager CoinShares.\n\n“Regulated institutions have a matrix of issues to grapple with to access staking on the Ethereum blockchain, whether this is through the use of liquid staking, validators or crypto staking ETPs,” Butterfill said.\n\n“Regulated institutions will bring rigorous due diligence to this analysis, helped by blockchain analytics, in an effort to select the platforms which present the lowest risk to them.”\n\nBut Northstake’s figures also have to be put in perspective. “If a rule is applied that an investor cannot invest if there are some rogue actors, then it may well exclude many investment asset classes,” he said.\n\nAccording to estimates from the United Nations Office on Drugs and Crime, between 2% and 5% of global GDP is laundered every year. That equates to between $800 billion to $2 trillion a year.\n\nMeanwhile, only $16 billion worth of crypto is locked in liquid staking protocols, according to DefiLlama data.\n\n“If we assume the worst case that 1.5% is criminal behaviour, this equates to between 0.012% and 0.031% of global money laundering,” Butterfill told DL News. “This is remarkably low relative to other currencies, given that at one point according to SOCA [the UK’s Serious Organised Crime Agency], that 90% of all 500 Euro notes sold in the UK were in the hands of organised crime.”\n\nChallenge for institutional investors\n\nIn traditional finance, it can be hard to ascertain one’s actual exposure to illicit or questionable funds. Crypto is different, according to Northstake CEO Jesper Johansen.\n\n“We can actually document this on-chain,” he told DL News. “That’s the beauty of blockchain, the transparency. So the question is actually turned on its head: Would you, as an institutional investor, be willing to accept a half a percent documented exposure to sanctioned funds when making your investment? And I think the answer comes out at zero — as in, ‘no, I would not accept that.’ \"\n\nEther liquid staking protocols usually do not require users to pass any form of know-your-customer or anti-money laundering checks — DeFi is largely permissionless after all.\n\nWhile institutional investors may remain hesitant due to the counterparty risk involved with using liquid staking protocols, they are popular with retail investors, who aren’t affected by potential exposure to illicit funds.\n\n“It’s purely from the institutional investor point of view that we see this issue,” Johansen said, “because they have a fiduciary obligation to their investors to record any exposure that they have in their investments to the relevant competent authorities.”\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out to him with tips at tim@dlnews.com.\n\nAleks Gilbert is DL News’ New York-based DeFi Correspondent. Reach out to him with tips at aleks@dlnews.com."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vdGhlZGVmaWFudC5pby9ldGgtc2x1bXBzLXRvLTE1LW1vbnRoLWxvdy1hZ2FpbnN0LWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "ETH Slumps To 15-Month Low Against BTC - The Defiant - DeFi News",
        "content": "Bitcoin halving and spot BTC ETF speculation captures investors' imaginations while Ethereum has first inflationary month since transitioning to Proof of Stake.\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nEther is now trading at a 15-month low against Bitcoin amid speculation regulators may soon greenlight a spot BTC ETF and anticipation for next year’s Bitcoin halving. Meanwhile, monthly ETH issuance has outpaced ETH burned for the first time since The Merge.\n\nETH last traded hands for 0.0575 BTC, with daily price action trending at its lowest level since last July, according to TradingView. Ether is now down 26.3% against Bitcoin since early January.\n\nETH/BTC on Binance. Source: TradingView.\n\nEther Supply Inflates\n\nEther captured the imagination of investors in the latter half of 2022, with The Merge promising to transition the network to Proof of Stake and realize a deflationary Ethereum.\n\nWhile The Merge ushered reduced new Ether issuance by around 90%, a recent decline in on-chain activity culminated in Ethereum’s first inflationary month since last December. More than 30,100 ETH ($48M) entered supply over the past 30 days, according to Ultra Sound Money.\n\nHowever, Ethereum’s supply is down by roughly 272,000 ETH ($432.5M) since The Merge went live. The upgrade also reduced energy consumption by more than 99.9% by booting Proof of Work miners from the network.\n\nLayer 2 Migration\n\nWhile the transaction volume, burn rate, and fees on the Ethereum mainnet are in decline, Ethereum’s Layer 2 ecosystem is booming.\n\nCombined throughput on L2 overtook the Ethereum mainnet 12 months ago, with the two metrics trending competitively until Layer 2 activity shot up with the launch of ZkSync Era and Polygon ZkEVM in March. Linea and Mantle also launched in July, while Coinbase deployed Base in August.\n\nWhile L2s enjoyed a 20% throughput lead over the mainnet in early February, Layer 2s are now processing more than 5.5 times more transactions than the mainnet, according to L2beat.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nZkSync Era is giving the Ethereum mainnet a close run for its money by monthly throughput with 29.6M and 30.2M transactions respectively. Base closely follows with 28.6M as well.\n\nETH supply since The Merge. Source: Ultra Sound Money.\n\nLSTs Centralize Staked Ether Supply\n\nThe Merge has also given rise to new challenges for the Ethereum network to confront, with liquid staking tokens (LSTs) threatening to centralize the supply of staked Ether. LSTs are yield-bearing tokens offering holders exposure to Ethereum staking yields.\n\nLido, the leading LST provider, currently controls one-third of all staked Ether, translating to 7% of ETH’s supply having been converted to Lido’s stETH token, according to Glassnode. Further, the Lido protocol is earning 0.5% of newly minted ETH.\n\nLido’s growing dominance comes in spite of prominent community members calling on it to use economic disincentives such as raising fees to drive down adoption. Vitalik Buterin, Ethereum’s chief scientist, recently urged staking providers to target a staked Ether dominance of no more than 15%.\n\nBitcoin Bull Case\n\nWhile Ethereum is still coming to terms with its post-Merge reality, Bitcoiners are anticipating bullish news over the horizon.\n\nBitcoin’s next halving event is expected to take place at the end of April. The halving is a four-yearly event that reduces the issuance of new BTC by 50% that has historically preceded bullish market cycles.\n\nWhile the Ethereum community is also gearing up for its forthcoming Dencun upgrade, the technical nature of calldata compression and Layer 2 scaling has prevented Dencun from emerging as a mainstream narrative.\n\nBitcoin investors also anticipate that the U.S. Securities and Exchange Commission will soon approve a spot Bitcoin exchange-traded fund (ETF). BlackRock, the world’s largest asset manager, filed for a spot BTC ETF in June, prompting a wave of copycat applications.\n\nOn Oct. 9, Eric Balchunas, a senior ETF analyst at Bloomberg, tweeted that he expects a spot Bitcoin ETF to receive regulatory approval by the end of the year, citing dialogue between the SEC and prospective issuers.\n\n“The fact that they are actively engaging [with] issuers on their current filings (via comments, which hasn’t ever happened [before]) we think appeal unlikely and denial unlikely,” Balchunas said. “We holding line at 75% odds approval by end of year.”\n\nArk Invest and 21Shares also filed applications for spot Ether ETFs last month."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9yaXBwbGUteHJwLW1pZ2h0LWV4cGxvZGUtYWxvbmdzaWRlLWJpdGNvbi1hbmQtZXRoZXJldW0taGVyZXMtd2h5LXJlcG9ydC_SAWVodHRwczovL2NyeXB0b3BvdGF0by5jb20vcmlwcGxlLXhycC1taWdodC1leHBsb2RlLWFsb25nc2lkZS1iaXRjb24tYW5kLWV0aGVyZXVtLWhlcmVzLXdoeS1yZXBvcnQvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ripple (XRP) Might Explode Alongside Bitcon and Ethereum: Here’s Why (Report) - CryptoPotato",
        "content": "TL;DR\n\nForbes indicates that a US economic downturn could boost cryptocurrencies, especially Bitcoin, Ripple, and Ethereum.\n\nPredictions from experts like Christopher Wood and Robert Kiyosaki suggest a shift from the US dollar to Bitcoin and gold.\n\nFollowing legal wins against the US SEC, Ripple’s XRP could further benefit from the 2024 trial and potential banking partnerships.\n\nFinancial Crash = Crypto Bull Market?\n\nThe American business magazine – Forbes – released a recent report, according to which the American economy and the country’s official currency might collapse due to various reasons. Some factors contributing to the potential catastrophe are the US “debt death spiral” and the mass printing of fiat initiated by the Federal Reserve.\n\nThe entity estimated that such a dark-case scenario could be highly beneficial to the cryptocurrency industry, with Bitcoin (BTC), Ripple (XRP), Ethereum (ETH), and other assets rallying towards fresh peaks amid the uncertainty in traditional finance.\n\n“Such a failure to exit from unorthodox monetary policy in a benign manner is likely to culminate in the collapse of the US dollar paper standard to the benefit of both gold bullion owners, and also owners of Bitcoin,” Christopher Wood – global head of equity strategy at Jefferies – opined.\n\nForbes is not the only entity that has predicted a crypto bull market in case of a future economic crisis. The Japanese-American entrepreneur and author – Robert Kiyosaki – suggested earlier this year that the US dollar “will die,” urging investors to focus on BTC and precious metals. Those interested to learn more can watch our dedicated video below:\n\nCould 2024 be XRP’s Year?\n\nThe native token of Ripple has been the subject of numerous price predictions lately, especially after the blockchain enterprise won two victories in a row in its legal battle against the US SEC. The asset spiked by over 70% after the first court decision in July and more than 6% last week when the magistrates disallowed the regulator to appeal the ruling.\n\nAccording to ChatGPT, the trial between the organizations (scheduled for April 2024) could be pivotal for an eventual XRP bull run. Other factors that could prompt a price surge might be banking partnerships or adoption by financial institutions, the AI-powered language model added."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbmdhcGUuY29tL2NyeXB0by1tYXJrZXQtc2VsbG9mZi1oZXJlcy13aHktYml0Y29pbi1ldGhlcmV1bS14cnAtZG9nZS1mYWxsaW5nLXN1ZGRlbmx5L9IBZGh0dHBzOi8vY29pbmdhcGUuY29tL2NyeXB0by1tYXJrZXQtc2VsbG9mZi1oZXJlcy13aHktYml0Y29pbi1ldGhlcmV1bS14cnAtZG9nZS1mYWxsaW5nLXN1ZGRlbmx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Crypto Market Selloff: Bitcoin, ETH, XRP, DOGE Falling Suddenly - CoinGape",
        "content": "The crypto market witnesses a massive selloff around 09:30 AM UTC amid uncertainty as the global crypto market cap tumbles nearly 1.50% to $1.07 trillion. Bitcoin shows stability, while altcoins such as Ethereum (ETH), XRP, Solana (SOL), DOGE, and SHIB record major selling within a few minutes. CoinMarketCap’s Fear & Greed Index slips from 47 to 45 in just an hour.\n\nBitcoin price slips to $27,500 from a 24-hour high of $28,000. BTC price is currently trading at $27,516 as $50 million longs get liquidated in just an hour, with 24-hour liquidation of $90 million. BTC recorded nearly $19 million in liquidation.\n\nadvertisement\n\nEthereum plummeted below the $1600 level after the Ethereum Foundation sold ETH again, further worsening the upside possibility. The ETH price fell more than 1% in an hour and nearly 2% in the last 24 hours, with the price currently trading at $1,594. The 24-hour low and high are $1638 and $1591, respectively.\n\nAmong the top altcoins, Bitcoin Cash (BCH) led the selloff with 4% in an hour. Other altcoins such as XRP, SOL, DOGE, SHIB, and ADA fell nearly 2% in an hour, making the 24-hour fall of 5%.\n\nWhy Altcoins Are Falling Suddenly?\n\nCoinglass data indicate massive longs liquidation of $90 million today, October 9. More than 38k traders were liquidated in the last 24 hours, with the largest single liquidation order on Bybit’s BTCUSD worth $3.11 million. As a result of the selloff, the broader crypto market is in “red” today.\n\nMeanwhile, digital asset investment products saw inflows of $78 million, consecutively for the second week after six weeks of outflows. Solana recorded its largest week of inflows of $24 million since March 2022.\n\nPopular analyst Michael van de Poppe predicts that Bitcoin will continue to make higher lows and hold above $27,500 despite starting to show weakness as the price falls below $27,700. He believes altcoins will continue to suffer and will correct further.\n\nAlso Read: Solana (SOL) Clocks Largest Weekly Institutional Inflows Since March 2022, What’s Next?\n\nMacro Factors Became the Primary Reason For Selloff\n\nThe geopolitical risk in the Middle East due to the Israel-Hamas conflict increases WTI and Brent crude prices. Stock market indexes around the world are in red due to the conflict. Investors are anticipating a potential acceleration in inflation and its impact on the global monetary policy trajectory.\n\nUS futures tied to S&P 500, Dow Jones, and Nasdaq 100 are down more than 0.50%. European and Asian markets also remained under pressure due to the rally in oil prices.\n\nMeanwhile, the US Dollar Index (DXY) jumps over 106.50 and looks to put more pressure on BTC price as it moves higher.\n\nAlso Read: Ripple Moves 60 Million XRP, What’s Happening?"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1pbnNjcmlwdGlvbnMtc3VycGFzcy1uZnQtbWludGluZy1vbi1ldGhlcmV1bS1zb2xhbmEtcG9seWdvbi1kZXNwaXRlLWJlYXItbWFya2V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Inscriptions Surpass NFT Minting On Ethereum, Solana, Polygon Despite Bear Market - Nasdaq",
        "content": "Bitcoin inscriptions, a new way to store data on the Bitcoin (CRYPTO: BTC) blockchain, have surpassed 35 million since their inception in January.\n\nOrdinals are digital artifacts that can be inscribed onto Bitcoin using the Ordinals protocol.\n\nThey can be anything from text files, images, and audio to videos, and can be used to store a wide variety of data on the Bitcoin blockchain.\n\nAccording to a report by Galaxy Digital, text files represent the vast majority of Bitcoin inscriptions, accounting for approximately 95% of all inscriptions.\n\nAlso Read: People Are Going To Start Cashing Out Bitcoin — Here's Why\n\nImage-based inscriptions account for approximately 3.5% of all inscriptions, with the remaining 1.5% consisting of other types of digital artifacts.\n\nOrdinals Activity Since March: In the first 200 days since the first inscription on Bitcoin, a total of 1.14 million image-based inscriptions have been created.\n\nThis surpasses the number of non-fungible tokens (NFTs) minted on other blockchains, such as Ethereum (CRYPTO: ETH), Solana (CRYPTO: SOL), and Polygon (CRYPTO: MATIC), since the debut of NFTs on these respective networks.\n\nHowever, it is important to note that Bitcoin's minting activity throughout the first 200 days is still much lower than the total minting activity for NFTs on other blockchains, illustrating how Ordinals still have a long way to go in terms of adoption relative to the broader NFT ecosystem.\n\nOrdinals Trading Volume: Despite the unfavorable market conditions for NFTs in 2023, Ordinals accomplished meaningful growth.\n\nBitcoin has accumulated the third-highest NFT trading volume by the network at $596.4 million.\n\nEven when excluding BRC-20s, which represent ~30% of all Ordinals volume ($187.5 million), Bitcoin remains the third most popular chain for digital collectible activity after Ethereum and Solana.\n\nOrdinals Marketplaces: The most dominant marketplaces by volume for Ordinals are now Magic Eden, Unisat, and OKX at 28%, 28%, and 38% respectively.\n\nImplications for the Future of Bitcoin: The growing popularity of Bitcoin inscriptions is a significant development for the Bitcoin ecosystem.\n\nIt suggests that Bitcoin is being used for more than just a store of value and a medium of exchange. It is also being used to store and share data, which could lead to new and innovative use cases for Bitcoin in the future.\n\nFor example, Bitcoin inscriptions could be used to create a decentralized social media platform or a decentralized storage platform. They could also be used to create new forms of digital art and collectibles.\n\nRead Next: Bitcoin To $20K, Ethereum To $1K? Prominent Venture Capitalist Predicts Market Bottom\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event - Future of Digital Assets. Tickets are flying- get yours!\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ld3Mtdml0YWxpay1idXRlcmluLXNlbmRzLTEtNjQtbWlsbGlvbi1pbi1ldGgv0gFRaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tbmV3cy12aXRhbGlrLWJ1dGVyaW4tc2VuZHMtMS02NC1taWxsaW9uLWluLWV0aC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum News: Vitalik Buterin Moves $1.64 Million In ETH To Bitstamp - CoinGape",
        "content": "Today Lookonchain, an on-chain analytics firm, reported that an address associated with Ethereum co-founder Vitalik Buterin transferred 1,000 ETH tokens, valued at approximately $1.64 million, noting that the coins are likely headed to Bitstamp, a popular cryptocurrency exchange.\n\nFrequent Activity in Ethereum Co-founder’s Wallet\n\nThis isn’t the first time that Buterin’s wallet has been active. Over the past two months, this specific address has deposited a substantial 4,400 ETH into Bitstamp, totaling approximately $7.23 million.\n\nadvertisement\n\nAs per Lookonchain , this address received a significant influx of 70,000 ETH from a wallet labeled “Vb3” and is widely believed to be connected to Vitalik Buterin himself.\n\nJust a couple of weeks ago, the firm reported another notable transaction involving Buterin’s wallet. He moved around $1 million worth of Ethereum to Coinbase, mirroring a similar move made in August when he sent 600 ETH to the same destination, presumably for selling purposes.\n\nEthereum Remains Stable\n\nInterestingly, these transactions have not exerted any notable influence on Ethereum’s market price, as the price has remained relatively stable. This stability can be partially attributed to a broader trend. Recent data from Santiment indicated a substantial withdrawal of 110,000 ETH from centralized exchanges (CEXes) on Wednesday marking the most significant Ethereum outflow from CEXes since August 21.\n\nAs a result, Santiment reported that the total Ethereum supply on exchanges has plummeted to its lowest point in over 5.5 years, whereas the non-exchange ETH supply has surged to a historic high of 115.88 million ETH.\n\nThat said, Ethereum demonstrated remarkable resilience after a challenging week. Over the past 24 hours, it has swiftly rebounded by roughly 1.24% and was trading at $1,641 at press time."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8yMDA4MDcvY3J5cHRvYWR6LW5mdC1zYWxlLTEtNi1taWxsaW9uLWV0aGVyZXVtLWxpbmtlZC10b3JuYWRvLWNhc2jSAVtodHRwczovL2RlY3J5cHQuY28vMjAwODA3L2NyeXB0b2Fkei1uZnQtc2FsZS0xLTYtbWlsbGlvbi1ldGhlcmV1bS1saW5rZWQtdG9ybmFkby1jYXNoP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "CrypToadz NFT Sells for $1.6 Million in Ethereum Linked to Tornado Cash - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA seven-figure sale of a CrypToadz NFT on Ethereum wasn’t all that surprising during the market mayhem of late 2021. But such a sale today, amid significantly weakened demand for NFT assets, is sure to stand out. And today’s $1.6 million purchase of a CrypToadz NFT is raising some red flags, too, thanks to a connection to Tornado Cash.\n\nCrypToadz #4030 was purchased today on the OpenSea marketplace for 1,055 Wrapped Ethereum (WETH), or more than $1.6 million worth. The buyer also paid OpenSea a fee of almost $42,000 worth of ETH on top of the base price.\n\nThe amount paid is dramatically more than the typical going rate for a CrypToadz NFT. Currently, they start at 0.53 ETH (about $835) on OpenSea, with the best listed offer on that particular NFT coming in a little higher at just below 0.6 ETH ($940). In other words, the buyer paid well above the market rate for this profile picture (PFP) project.\n\nAD\n\nAD\n\nThe purchasing wallet was funded by a wallet that has been pulling money out of Tornado Cashhttps://t.co/nNhKvSVhoz pic.twitter.com/aInHO8vNyG — TexasHedge (@0xTexasHedge) October 9, 2023\n\nInitially, Crypto Twitter commenters pointed to a “fat finger” mistake—that the buyer may have zipped too quickly through the process and accidentally paid far more than intended. We’ve seen apparent examples of this on the other side, too, where sellers have accepted bids that were well below the market price for a particular collection.\n\nHowever, a bit more digging reveals another potential answer: wash trading.\n\nSee, the wallet that purchased the CrypToadz NFT today was recently funded with about 1,116 ETH (about $1.76 million) from another wallet—and that wallet received about 1,200 ETH (almost $1.9 million) from Ethereum coin mixing service Tornado Cash in September.\n\nTornado Cash is an automated service that lets users obscure the flow of cryptocurrency to and from wallets by mixing funds from various users into a pool. That breaks the public, on-chain flow of cryptocurrency between wallets, making it more difficult to trace how ETH is being sent around.\n\nAD\n\nAD\n\nPrivacy advocates say that Tornado Cash lets them transact cryptocurrency with less fear of surveillance, but authorities have called it and similar tools a way to launder money. The service was banned in the United States following Treasury Department sanctions in 2022.\n\nGiven the use of Tornado Cash to funnel substantial amounts of ETH into the funding wallet, this may indeed be an attempt at wash trading or money laundering by the buyer, using an NFT purchase to further complicate the flow of funds between crypto wallets and assets. On the other hand, use of Tornado Cash does not necessarily imply illegal actions or intent.\n\nOpenSea did not immediately respond to a request for comment."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vbGVhcm4uYnliaXQuY29tL2ludmVzdGluZy9ldGhlcmV1bS1mdXR1cmVzLWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Futures ETFs: Are They Worth Investing In? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8yMDA1ODgvdGhpcy13ZWVrLW9uLWNyeXB0by10d2l0dGVyLWV0aGVyZXVtLWZ1dHVyZXMtZXRmLWZ0eC1zYWdhLWJlZXBsZdIBYGh0dHBzOi8vZGVjcnlwdC5jby8yMDA1ODgvdGhpcy13ZWVrLW9uLWNyeXB0by10d2l0dGVyLWV0aGVyZXVtLWZ1dHVyZXMtZXRmLWZ0eC1zYWdhLWJlZXBsZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "This Week on Crypto Twitter: Ethereum Futures ETFs and the FTX Saga - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA multitude of positive crypto headlines did little to rally the prices of leading cryptocurrencies this week. On Tuesday, JP Morgan’s crypto lead Tyrone Lobban remarked at a panel in London that Bitcoin is “maybe more like a stablecoin nowadays”—a statement that regular readers of this This Week in Coins likely concur with.\n\nThis bodes well for crypto. After all, one of the most common criticisms of leading unbacked cryptocurrencies is that they’re pretty volatile. Despite the reputational damage caused by last year’s wave of industry bankruptcies, U.S. companies have redoubled their efforts to get crypto-related investment products on the market. One such product is the elusive spot ETF.\n\nThis week, Grayscale CEO Michael Sonnenshein made an important announcement. The crypto asset manager is now doing to its Ethereum fund what it’s been trying at length to do with its Bitcoin fund. Grayscale’s redoubled assault on the SEC stemmed from a courtroom victory back in late August when it won an appeal against the regulator after the latter rejected its application to convert its Bitcoin trust into a spot ETF.\n\nAD\n\nAD\n\n🚨 @Grayscale has filed to convert Grayscale Ethereum Trust to a spot ETF. $ETHE Thank you for your continued support -- our team is just getting started! https://t.co/3nNtfe4Nns — Sonnenshein (@Sonnenshein) October 2, 2023\n\nBloomberg ETF analyst Eric Balchunas tracked the U.S. launch of nine Ethereum Futures ETFs on Monday.\n\nAND THEY'RE OFF.. Ether Futres Derby underway.. VanEck in a slight early lead, altho looks like a few of them not out of gate yet, will post updates as we go.. pic.twitter.com/lzfD4FCTnn — Eric Balchunas (@EricBalchunas) October 2, 2023\n\nScimitar Capital analyst Alex noted the lack of enthusiasm for VanEck’s offering.\n\nIf VanEck does profit from its new Ethereum Futures ETF, it will channel the money into Protocol Guild, a collective of 152 Ethereum protocol developers who have pooled together to coordinate and share funding.\n\nAD\n\nAD\n\nBig announcement! We intend to donate 10% of our $EFUT ETF profits (https://t.co/gr652AkUvv) to @ProtocolGuild for at least 10 years. Thank you, Ethereum contributors, for nearly a decade of relentless building & ongoing stewardship of this common infrastructure. Details 👇 — VanEck (@vaneck_us) September 29, 2023\n\nThe IMF knows the potentially destabilizing risks crypto poses to traditional finance, tweeted Lido Finance’s Sacha on Wednesday.\n\nA video interview about visual art with the creator of the most expensive NFT collection sold at auction, Beeple, made the rounds on Wednesday.\n\nTwitter co-founder and former CEO Jack Dorsey’s crypto-friendly payments company Block strongly advocates self-custody.\n\nJUST IN: Jack Dorsey's Block is quietly shipping the first editions of its new #Bitcoin hardware wallet One of the largest payments firms in the US promoting financial sovereignty and self custody 🔥 pic.twitter.com/lnGEB7k80a — Bitcoin Magazine (@BitcoinMagazine) October 4, 2023\n\nMessari Crypto’s CEO Ryan Selkis shared a chart revealing a steady decline in active crypto developers this year. Let’s hope it’s the scammers and opportunists dropping off!\n\nAD\n\nAD\n\nActive developers in crypto are down to their lowest level since the end of 2020. Keeping an eye on this chart. (h/t @a16zcrypto @ElectricCapital) pic.twitter.com/GycnVpO3sG — Ryan Selkis 🪳 (@twobitidiot) October 4, 2023\n\nMeanwhile in FTX…\n\nThe industry’s favorite ongoing courtroom saga was heavily commented on this week after the release of a book by Michael Lewis that whitewashes allegations that disgraced former FTX CEO Sam Bankman-Fried was misusing customer money and misdirecting people. Needless to say, several crypto fans called out Lewis’s depiction of events.\n\nMichael Lewis is completely full of shit FTX was not a \"profitable business\" — Vance Spencer (@pythianism) October 2, 2023\n\n🚨Finished reading Michael Lewis' new book so you don't have to. You were not misled by the 60 minutes interview. It is a full-out defense of SBF. He spends more time questioning the intentions of the BANKRUPTCY LAWYER John Ray, than he does SBF. I'm speechless. pic.twitter.com/ID7d8bRrrf — Coffeezilla (@coffeebreak_YT) October 3, 2023\n\nWall Street cynic “Diogenes” (@WallStCynic) was not impressed by Lewis’s promotional interview and noted some historical parallels with the Enron bankruptcy. It’s worth noting that the appointed CEO in both cases is lawyer John J. Ray III.\n\nThis was literally Enron’s defense. “If it wasn’t for those meddling short-sellers and journalists causing a run-on-the-bank, we would’ve been fine.” This is nonsense, as both FTX and Enron were both massively insolvent, not illiquid. https://t.co/3nrJqUrYCg — Diogenes (@WallStCynic) October 2, 2023\n\nWho wants a lifetime supply of money for 60 hours of work? We all do, but only some of us can get it in this life.\n\nFTX earnings: • Tom Brady - $55 million\n\n• Steph Curry - $35 million\n\n• Larry David - $10 million Brady and Curry worked a total of roughly 60 hours pic.twitter.com/qPxU30KJ0W — Morning Brew ☕️ (@MorningBrew) October 2, 2023\n\nAD\n\nAD\n\nConvicted felon and pharma bro Martin Shkreli—who raised the price of a lifesaving antiparasitic drug called Daraprim by 5,455% and was incarcerated for unrelated charges of fraud—had a lot to vent about FTX’s relationship to Twitter.\n\nSBF (or FTX or Alameda) was somehow long $100m of $TWTR before the @elonmusk announcement. Probably insider trading. 🤣 SBF liked to talk to Nishad & Ramnik before he made large investments. SBF thought Elon wanted him to invest, but it was the M/Stanley bankers (my knowledge). — Martin Shkreli (e/acc) (@wagieeacc) October 3, 2023\n\nCould a new fundraise for a company that FTX has a stake in be big enough to make the former exchange’s creditors whole? Tanay Jaipuria thinks so.\n\nWith Anthropic rumoured to be raising at a $20-30B valuation, FTX’s stake in it could be worth ~$3B+ That may be enough to make all of FTX’s creditors whole🤣 — Tanay Jaipuria (@tanayj) October 4, 2023\n\nFinally, one tweeter caught the sudden unstaking of millions of dollars of SOL held by FTX’s equally bankrupt sister company, Alameda."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYm9sZC5jb20vY2FyZGFuby1mb3VuZGVyLW1vY2tzLXZpdGFsaWstYnV0ZXJpbnMtZXRoZXJldW0tY2xhaW1zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Cardano founder mocks Vitalik Buterin's Ethereum claims - Finbold - Finance in Bold",
        "content": "Following Ethereum (ETH) co-founder Vitalik Buterin’s recent post on the benefits of staking and further network decentralization, Cardano (ADA) co-founder Charles Hoskinson poked fun at it amid accusations that Ethereum was copying Cardano.\n\nSpecifically, Hoskinson shared Buterin’s post and added an animated GIF of Muppet Kermit the Frog and actor Christian Bale nodding at one another, indicating he was mocking the statements presented in it, in a post on social media platform X published on October 8.\n\nIndeed, the Ethereum pioneer shared in his October 7 post the advantages of suggested changes in staking design for users who do not possess enough resources to stake on their own, giving them a more involved role in staking and consensus participation.\n\nCritique or obsession?\n\nSubsequently, a number of members of the Cardano community have accused Ethereum of copying Cardano in the comments to the post, arguing that “Cardano pioneered liquid staking and delegating to pools for consensus years ago,” with “100% uptime, no messy hard forks, and is the most decentralized protocol as measured by block production/consensus.”\n\nEthereum dressing up as Cardano for Halloween? — claudano 💎🤲 (@coldjalapeno7) October 7, 2023\n\nReplying to a comment about the perceived “obsession” with Ethereum, Hoskinson pointed out that “they literally just admitted they need to copy Ouroboros,” hinting at Cardano’s proof-of-stake (PoS) protocol that promises to provide and improve the security guarantees of proof-of-work (PoW) “at a fraction of the energy cost.”\n\nMeanwhile, Cardano was at press time changing hands at the price of $0.2509, which shows a decline of 2.19% in the last 24 hours, as well as a 6.07% drop across the previous seven days, in addition to losing 1.51% over the past month, as per the most recent data on October 9.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0yNzgwMC1ldGhlcmV1bS1uZWFycy0xNjAwL2FydGljbGVzaG93LzEwNDI5MDc5NS5jbXPSAYsBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4taG9sZHMtMjc4MDAtZXRoZXJldW0tbmVhcnMtMTYwMC9hbXBfYXJ0aWNsZXNob3cvMTA0MjkwNzk1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $27,800; Ethereum nears $1600 - The Economic Times",
        "content": "ETMarkets.com\n\n\n\n\n\n\n\n\n\nThe major crypto tokens were trading lower on Monday. Meanwhile, the global cryptocurrency market cap declined 0.5% to around $1.09 trillion in the last 24 hours.Bitcoin was down 0.5% at $27,806, while Ethereum was below the $1,650 level.XRP, Solana, Dogecoin , Polygon, Polkadot, and Litecoin were trading in the red, while Toncoin was trading in the green.\"Bitcoin has been trading close to the $28000 level over the weekend. This price movement is in the wake of US non-farm payroll data reporting 336,000 jobs added in September versus economist forecasts for just 170,000. If BTC remains well above the current level, we can see it breach the $28,350 level. If not, support lies at $27,800 level,\" said Edul Patel, CEO of Mudrex.The total volume in DeFi is currently $2.24 billion, 12.36% of the total crypto market 24-hour volume. The volume of all stablecoins is now $16.28 billion, which is 89.84% of the total crypto market 24-hour volume.Bitcoin's dominance is currently 49.98%, according to CoinMarketCap. Meanwhile, BTC volume in the last 24 hours stood at approximately $7.8 billion, rising 14.5% in the last 24 hours.\"Trading close to $28k, BTC has been maintaining firm support at $27k. Even though there has been a BTC sell-off from short-term holders, the support levels come in as long-term holders are buying more. In fact, last week, the supply held by the long-term buyers stood at 15.6 million BTCs, as opposed to the short-term holder supply of 3.8 million BTCs—the first time since November 2015,\" said Parth Chaturvedi, Investments Lead at CoinSwitch Ventures.Tech view by ZebPay Trade DeskBitcoin maintained its upward pressure, nearing the $28,000 mark as the week closed on October 8th. Geopolitical uncertainty became a factor for traders during this period. The price of BTC exhibited resilience, avoiding significant downward volatility over the weekend. It recovered from a sudden test of the $27,000 level on October 6th, primarily due to surprising employment data in the United States that contrasted with policy adjustments by the Federal Reserve. As the new week began, the $28,000 resistance level became the primary focus for market participants.Bitcoin, after testing the crucial support level of $25,000 (Horizontal Trendline & 50% Fibonacci Retracement Level) has witnessed a relief rally and the prices went up to $28,580. The asset broke the downsloping trendline. However, it failed to break the resistance of $28,500. Currently, BTC is consolidating from $28,250 to $27,000. Once it breaks and sustains above $28,500, it may go up to $32,500 and to witness a rally, BTC needs to break, close and maintain above the key resistance level of $32,500.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3ByaWNlLXByZWRpY3Rpb25zLWZvci1ldGhlcmV1bS14cnAtYW5kLXNjb3JwaW9uLWNhc2luby10b2tlbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Price Predictions For Ethereum, XRP, and Scorpion Casino Token - Analytics Insight",
        "content": "The crypto landscape is ever-evolving, and as more individuals and institutions dive into the world of digital assets, the quest for solid price predictions becomes even more critical. The future seems bright for many tokens, but today, we’re focusing on three specific ones: Ethereum (ETH), XRP, and Scorpion Casino Token ($SCORP). So, what does the future hold for these coins? Let’s delve into some expert speculations.\n\nEthereum: The King of Smart Contracts\n\nEthereum has undoubtedly paved the way for the adoption and development of decentralized applications (dApps) and smart contracts. Its blockchain technology has revolutionized various sectors, from DeFi platforms to NFT marketplaces. Now that Ethereum has completed its ETH 2.0 upgrade, the platform will benefit from enhanced scalability and has become more energy efficient.\n\nGiven its undeniably pivotal role in the blockchain space, experts suggest that Ethereum has the potential to see exponential growth in the next few years. With the expanding ecosystem and continuous innovation, a price prediction of around $20,000 for ETH doesn’t seem far-fetched, especially when considering its previous bull runs and the broader adoption of blockchain technologies. Some even claim that it could topple Bitcoin (BTC) and become the number one cryptocurrency.\n\nXRP: The Pioneer of Cross-Border Payments\n\nXRP, developed by Ripple, has long been celebrated for its fast, low-cost cross-border payments. Facilitating real-time global transactions at a fraction of traditional costs, it’s no surprise that many banking institutions have taken a keen interest in Ripple’s technology. At the end of the 2018 bull market, XRP was one of the major players in the crypto world. After the SEC filed a lawsuit against Ripple, the price plummeted and the token didn’t hit the heights of other projects in the bull run of 2021.\n\nGiven the ongoing developments and partnerships, along with a broader adoption of blockchain for cross-border payments, it’s conceivable that XRP’s value could soar in the coming years. Expert analysis and market trends point towards a potential price of around $10 for XRP within the next few years.\n\nScorpion Casino Token: The Future of Gaming and Passive Income\n\nScorpion Casino Token($SCORP) is currently priced at a mere $0.018 and offers an exciting blend of gaming and crypto investment. The ongoing presale, with a launch price of $0.05, presents a golden opportunity for early adopters. You already stand to 3x your investment if you bought this token today by the end of the presale but hurry, the price is increasing on October 8th.\n\nOne of the most enticing features of the Scorpion ecosystem is its Buy-Back scheme. This system ensures a consistent passive income for all holders by using a portion of the platform’s daily income to purchase $SCORP tokens. This is then split 50/50 with half of the tokens being burnt and therefore increasing the value of each $SCORP token. The other half is sent to token holders of $SCORP resulting in daily passive income.\n\nConsidering Scorpion Casino Token hasn’t even launched yet, the upside potential of this token is huge. Some believe that in the coming years, the price of $SCORP could hit the $1 mark\n\nThe Future Looks Bright For Crypto\n\nThe crypto space is filled with volatility, making price predictions a challenging task. Yet, considering the intrinsic value and innovative solutions offered by Ethereum, XRP, and Scorpion Casino Token, it’s apparent that these tokens have a promising future ahead. As with any investment, always conduct thorough research and only invest money that you are comfortable with potentially losing.\n\nGet $SCORP For The Lowest Possible Price, Find Out More Here:\n\nPresale: https://presale.scorpion.casino/\n\nTwitter: https://twitter.com/ScorpionCasino\n\nTelegram: https://t.me/scorpioncasino_official\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2V0aGVyZXVtcy1uZXctdHdvLXRpZXJlZC1zdGFraW5nLXNvbHV0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Ethereum's new two-tiered staking solution: A game changer for security and scalability - Cryptopolitan",
        "content": "In a significant move aimed at improving the security, efficiency, and scalability of the Ethereum network, the platform has recently shifted from its traditional Proof-of-Work (PoW) consensus mechanism to a Proof-of-Stake (PoS) system. This transition is seen as a crucial step in addressing some of the challenges and limitations that have plagued the staking process on Ethereum.\n\nWhile this transition holds immense promise, it is not without its hurdles, including the steep 32 ETH entry barrier for solo staking and concerns about centralization within staking pools. In response to these challenges, Ethereum’s co-founder, Vitalik Buterin, has proposed an innovative two-tiered staking solution that promises to enhance the network’s security and scalability.\n\nEthereum: The two-tiered staking solution\n\nVitalik Buterin’s proposal revolves around the implementation of a two-tiered staking system, which introduces two distinct participant categories: node operators and delegators. This approach aims to strike a balance between security, decentralization, and accessibility within the Ethereum staking ecosystem.\n\nNode operators play a pivotal role in this new system by acting as validators. They commit a significant stake of 32 ETH while simultaneously running nodes responsible for handling transactions and generating new blocks. However, these operators are bound by strict ethical standards, and any engagement in malicious behavior exposes them to slashing penalties, which serve as a strong deterrent against misconduct.\n\nDelegators, on the other hand, possess stakes below the 32 ETH threshold required for solo staking. They are not involved in operating nodes themselves but have the freedom to assign their stakes to chosen node operators. This delegation allows them to support and engage with the consensus process in a lighter capacity. Delegators can carefully select the node operators they trust, fostering a sense of community and collaboration within the Ethereum network.\n\nBenefits of the two-tiered staking proposal\n\nVitalik Buterin’s proposal offers a multitude of benefits, both from the network’s perspective and for its users. One of the primary advantages of this proposal is the potential to significantly enhance scalability. By reducing the number of signatures required per block to approximately 10,000, the computational overhead is minimized, resulting in a more efficient network capable of processing a higher volume of transactions.\n\nThe two-tiered staking system raises the bar for potential attackers looking to gain control of a majority stake within the Ethereum network. This increased difficulty level serves to bolster network security and further decentralize the ecosystem, aligning with the core principles of blockchain technology.\n\nButerin’s proposal opens the door to more inventive and flexible staking solutions. It encourages the utilization of smart contracts and the adoption of liquidity tokens, among other mechanisms. This innovation not only diversifies the staking options available but also offers greater accessibility to a wider range of participants.\n\nFurthermore, the proposal suggests implementing these changes at various layers of abstraction within staking pools, between them, and within the Ethereum protocol itself. This approach allows for a gradual transition, minimizing disruptions while achieving the desired goal of a more secure and scalable network.\n\nConclusion\n\nEthereum’s shift to a two-tiered staking system, as proposed by Vitalik Buterin, marks a significant step forward in addressing the challenges associated with its transition to a Proof-of-Stake consensus mechanism. By striking a balance between node operators and delegators, this innovative solution promises improved security, scalability, and accessibility, ultimately paving the way for a more robust Ethereum ecosystem. As the Ethereum community embraces these changes, the future looks brighter than ever for this pioneering blockchain platform."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMTAvMDkvZXRoZXJldW0tc2xpZ2h0LWdyb3d0aC1ldGgtaW5mbGF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ethereum: slight growth in ETH inflation - The Cryptonomist",
        "content": "Since partial fee burns have been introduced on the Ethereum network, ETH’s inflation has reduced dramatically, so that at times it becomes a deflationary currency.\n\nBut it can happen, as has happened recently, that it becomes inflationary again instead.\n\nThe inflation of Ethereum (ETH)\n\n“Inflation” in crypto does not mean price increases, that is, the loss of purchasing power of coins. Instead, it means the eventual increase in the money supply, the so-called circulating supply.\n\nAs can be seen directly on Etherscan, until August 2021 the circulating supply of ETH increased sharply and very steadily.\n\nIn other words, ETH until a couple of years ago was an inflationary currency.\n\nBut then there was a change, due to the introduction of partial fee burns. Suffice it to say that between September 2021 and February 2022 the supply only increased by less than one million units, out of 117 million.\n\nBy the end of 2021, the inflation of Ethereum’s money supply had fallen to 3.5 %, from 4.6 % in 2020.\n\nBut it was from 2022 onward that the effects of partial fee burns were most felt, partly due to the move to Proof-of-Stake.\n\nIn fact, last year ended with ETH’s money supply inflation of only 2%, or less than half of two years earlier.\n\nThe metrics of 2023\n\nThe fee burn, however, is not constant because, precisely, it depends on how many fees are paid.\n\nAt the beginning of 2023, the average cost per transaction on the Ethereum blockchain rose above $4, then also rose above $6 in February. In mid-April it also jumped above $15, and in early May it even came close to $30.\n\nBy June it was down again to $4, but in July it was back above $6.\n\nStarting in September, however, it returned first below $4, and then even lately below $2.\n\nIn the months when the fees paid by users of Ethereum’s blockchain were higher, the burns were also higher, so that ETH for a few months became a deflationary coin.\n\n2023 opened with a circulating supply of about 120.5 million ETH, and by June it had fallen to just over 120.2 million. That is, the first half of 2023 closed with negative ETH money supply inflation of about -0.25%. The lowest peak of 2023 occurred in August with less than 120.22 million ETH in circulation.\n\nThereafter, however, fees fell, and so did partial fee burns. Currently the circulating supply has risen a little since June, settling just below 120.25 million ETH.\n\nIn other words over the past two months there has been a not at all worrisome increase of 0.02%. Acquired inflation since the beginning of the year however remains negative at -0.22%.\n\nEthereum’s (ETH) fluctuating inflation\n\nThe fluctuating inflation rate of the ETH money supply is due to the fact that there are two phenomena taking place simultaneously.\n\nThe first is the continuous creation of new ETH to remunerate validator nodes that validate transactions, and the second is precisely the partial burn of fees. The rate at which new ETHs are created is essentially invariable, but the burn of fees varies depending on the fees. The fewer fees are paid the less ETH is burned.\n\nThis results in ETH not having a fixed and predictable inflation rate, but a variable one. However, this variability is within a very narrow range, always less than 1 % per year, both positive and negative.\n\nBy contrast, for Bitcoin, for example, the money supply inflation rate is fixed and predictable, and actually halves every four years or so, with halving.\n\nAll this makes Bitcoin’s monetary policy appear to be prefixed and predictable, while Ethereum’s is not. Moreover, Bitcoin’s monetary policy has never been changed, and no one is actually able to change it, while Ethereum’s has already been changed several times, and no one knows for sure whether it will remain identical to the current one in the future.\n\nETH is not a deflationary currency\n\nAfter the introduction of the fee burn, and especially after the move to Proof-of-Work, ETH by some had been called a deflationary currency.\n\nThe numbers above reveal that it is incorrect to call it such, because it is deflationary only at times. Instead, at other times it reverts to inflationary.\n\nInstead, it is a currency with a variable rate of inflation of the money supply, although generally very limited, and probably negative in the long run.\n\nMoreover, since there is no certainty that this monetary policy will remain unchanged in the future, it is not even possible to say that ETH has a deflationary nature, while for example BTC does, since it inevitably tends, in the long run, toward deflation.\n\nAs for Ethereum much depends on its usage, because higher usage means higher fees, and therefore higher ETH burns."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2NoYXJsZXMtaG9za2luc29uLWRpc21pc3Nlcy1ldGhnYXRlLXNjYW5kYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 08 Oct 2023 07:00:00 GMT",
        "title": "Charles Hoskinson dismisses ETHGate scandal, argues Ethereum and XRP serve different ecosystems - Cryptopolitan",
        "content": "Cardano founder Charles Hoskinson recently fired back at allegations surrounding the ETHGate scandal. For those out of the loop, this scandal purports that members of the Ethereum community allegedly bribed U.S. regulatory officials. Hoskinson has fervently countered these claims, especially against critiques from the XRP community. Moreover, Hoskinson took to social media and an Ask Me Anything (AMA) session to clarify his position on the complex issue.\n\nHoskinson categorically emphasized the dissimilarities between Ethereum and Ripple‘s XRP. He underscored the absence of smart contracts in XRP’s ecosystem. Additionally, while Ethereum has been concentrating on a proof of work model, Ripple has been zeroing in on banks to promote remittance relations. Hence, Hoskinson stated that Ripple was never a direct competitor or a threat to Ethereum. He also named other blockchain projects like Nxt and Bitshares as more significant challengers to Ethereum’s space.\n\nRipple’s CTO clashes with Hoskinson’s view\n\nOn the other side of the debate, Ripple’s Chief Technology Officer, David Schwartz, offered an alternative viewpoint. Schwartz, differing from Hoskinson, argued that government favoritism in line with personal interests could be categorized as corruption. He dismissed Hoskinson’s claim that the ETHGate scandal revealed only an “unequal application” of U.S. law rather than corruption. Schwartz expressed his thoughts via social media, igniting further debates within the crypto community.\n\nThe Ripple executive’s comments have instigated debates that go beyond just the ETHGate scandal. Some community members are now questioning whether Hoskinson’s defense might be stemming from his intent to protect his history with Ethereum. It’s essential to note that Hoskinson was one of the eight co-founders of Ethereum and even served as its CEO for a brief period. After a public rift between the co-founders, he left Ethereum in 2014 to launch Cardano.\n\nHowever, both parties seem to agree on one point: The U.S. regulatory stance on cryptocurrencies like Ethereum and XRP has been inconsistent. Despite former SEC director William Hinman classifying Ethereum as not a security back in 2018, the status of other cryptocurrencies like XRP remains unclear. This inconsistency has led to considerable hindrances in the adoption and growth of cryptocurrencies other than Ethereum.\n\nIn this debate, one thing becomes abundantly clear. The crypto world is not just about technology; it’s also a field fraught with differing opinions on regulation, competition, and ethical considerations. The ETHGate scandal has merely peeled back a layer, revealing a host of complexities that market participants will have to navigate. Whether it’s about defining what constitutes corruption or discussing which cryptocurrencies pose a real threat to Ethereum, the debate continues to rage, and resolution seems far from near."
    }
]