[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2xheWVyLTItZXRoZXJldW0tc2NhbGFiaWxpdHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Ethereum L2s Are a Bug Masquerading as a Feature - Blockworks",
        "content": "The Ethereum community has been raving about “layer-2” or “L2” solutions for quite some time now. These solutions are marketed as a way to make Ethereum faster, cheaper and more scalable.\n\nBut if you look at what is actually being built and why, you will see that the generally accepted L2 narrative isn’t telling the whole story. What layer-2 technology is actually doing is putting a Band-Aid over some specific issues on Ethereum — but not actually creating solutions that will solve any of Ethereum’s real problems.\n\nIf there’s one belief at the core of crypto, it’s that incentives matter; the motivations, often financial or reputational, that drive individuals or entities to promote or criticize a certain narrative.\n\nWhat are the incentives motivating the people behind L2s?\n\nThey stand to benefit from L2s being perceived as a feature rather than a bug.\n\nIf layer-2s were widely understood to be a Band-Aid, rather than a fix, this would negatively impact anyone even tangentially involved in the Ethereum space — and certainly anyone behind these solutions, or anyone who intends to leverage these solutions.\n\nA shift in perception that identifies L2s as an insufficient stopgap measure would likely encourage the community to prioritize finding and developing long-term solutions to Ethereum’s challenges, potentially leading to the emergence of more innovative and sustainable technologies.\n\nWhat Ethereum is doing wrong\n\nThe main problem with Ethereum is that it can be simply too expensive for people to use. Vitalik Buterin has freely admitted this.\n\nWe can actually keep this discussion fairly non-technical. L2s are a solution to a PROBLEM. Something is wrong with Ethereum, and that needs to be fixed. That’s just reality and it is FINE.\n\nThe reason why it is too expensive to use Ethereum is because the network charges gas (essentially, ETH) to use its resources. The more people use the network’s resources, the scarcer those resources become and the higher the cost of those resources in ETH. Of course, the price of ETH can go up as this happens, which obviously creates certain financial incentives. Simply put, high usage and high ETH fees benefit people who already hold ETH.\n\nThe problem then with Ethereum is less about the fact that gas fees exist, but instead that gas fees are TOO high. They’re so high that they are limiting the upside for the people who control the chain.\n\nIf gas fees are high because of limited network resources, then the solution is obvious; Increase network resources. L2s accomplish this by giving users a place to send their transactions instead of the main network (main net) where they can be processed. The results of those transactions can then be broadcast down into the main network, Ethereum.\n\nSimply put — L2s are a way of NOT using Ethereum. Why, then, is the L2 narrative one of the successful solving of Ethereum’s problems, rather than a critical look at this solution’s temporary nature?\n\nThe dominant approach in the crypto space has been to avoid speaking honestly about both the benefits and the limitations of the technologies we are developing.\n\nInstead, we act as though our existing solutions are perfect. Even though we can acknowledge when they need small improvements, it’s normal to see anyone who says anything more intensely critical as an enemy, someone uninformed who doesn’t know what they are talking about, someone just trying to pump their own bag.\n\nIncentives matter\n\nWhenever you see a very one-sided narrative being put forward, especially when there is a lot of money on the line, this is an indication that something isn’t right. There’s almost always two sides to every story, especially when that story is about a solution to a problem. It’s crucial to approach such narratives with a discerning eye and critically evaluate the motivations behind each side of any argument to develop a well-rounded understanding of the issue at hand.\n\nIn the context of Ethereum and layer-2 solutions, it’s important to keep in mind that different parties have their own incentives to either promote or criticize these technologies.\n\nOn the one hand, there are those who have a vested interest in promoting layer-2s as the ultimate solution to Ethereum’s scalability issues; these individuals are likely to be Ethereum proponents or developers involved in creating and maintaining L2 projects. On the other hand, there are those who stand to gain from criticizing Ethereum and its scaling solutions, such as competitors in the blockchain space or individuals who have invested in rival platforms.\n\nIf L2 solutions were seen as temporary workarounds rather than real solutions, users, developers, and investors might become less inclined to participate in or support layer-2 projects.\n\nAnd while this would obviously hinder the growth and development of L2s, this lack of confidence in the real L2 narrative could actually prompt individuals to seek out alternative solutions, including new blockchain platforms, that offer genuine fixes to scalability and other issues faced by the Ethereum network. In other words, acknowledging the truth would be more beneficial long term to Ethereum than denying it.\n\nThe point here is not that L2s and going off of Ethereum to do your transactions are bad ideas. But if no one talks about what L2s do accurately (and that’s obviously because there are no incentives to do so), then real solutions to Ethereum’s issues will not be found — because no one will even be looking for them.\n\nAndrew Levine is the CEO of Koinos Group, a team of industry veterans accelerating decentralization through accessible blockchain technology. Their foundational product is Koinos, a fee-less and infinitely upgradeable blockchain with universal language support.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMjEvZXRoZXJldW1zLXNoYW5naGFpLXVwZ3JhZGUtc3B1cnMtaW5zdGl0dXRpb25hbC1pbnZlc3RtZW50LWludG8tc3Rha2luZy_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzIxL2V0aGVyZXVtcy1zaGFuZ2hhaS11cGdyYWRlLXNwdXJzLWluc3RpdHV0aW9uYWwtaW52ZXN0bWVudC1pbnRvLXN0YWtpbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Ethereum’s Shanghai Upgrade Spurs Institutional Investment Into Staking - CoinDesk",
        "content": "Ethereum’s highly anticipated tech update, often referred to as the Shanghai or Shapella upgrade, starting April 12 enabled withdrawals of some 18 million tokens, worth $35 billion, previously locked up in staking contracts. After the upgrade, ETH’s price rallied to $2,100, its highest level in 11 months, defying earlier concerns the unlocking could lead to significant selling pressure and a price crash. The token recently has dropped below $1,900, aligning with a broader crypto market decline."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1ub3NlZGl2ZXMtYmVsb3ctMmsv0gFLaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLW5vc2VkaXZlcy1iZWxvdy0yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Price Nosedives Below $2K, Here’s The Next Bearish Target - NewsBTC",
        "content": "Ethereum price started a major decline below $2,000 against the US Dollar. ETH might extend its decline and revisit the $1,860 support.\n\nEthereum is gaining bearish momentum below the $2,000 support.\n\nThe price is trading below $2,000 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bearish trend line forming with resistance near $1,955 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could decline further if it breaks the $1,930 support zone.\n\nEthereum Price Takes Hit\n\nEthereum’s price struggled to climb further above the $2,125 resistance zone. ETH started a fresh decline below the $2,050 and $2,000 support levels, similar to Bitcoin.\n\nEther gained bearish momentum below the $2,000 support. It tested the $1,930 support. A low is formed near $1,933 and the price is now consolidating losses. It is now trading below $2,000 and the 100-hourly Simple Moving Average.\n\nImmediate resistance is near the $1,960 zone. There is also a connecting bearish trend line forming with resistance near $1,955 on the hourly chart of ETH/USD. The 23.6% Fib retracement level of the downward move from the $2,125 swing high to the $1,933 low is also just above the trend line.\n\nAn upside break above the trend line resistance might send Ethereum toward $2,000. The next major resistance is near the $2,025 zone or the 50% Fib retracement level of the downward move from the $2,125 swing high to the $1,933 low. A close above the $2,025 resistance zone could start a fresh increase.\n\nSource: ETHUSD on TradingView.com\n\nIn the stated case, the price could rise toward the $2,125 resistance. Any more gains could send Ether toward the $2,200 resistance in the near term.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,960 resistance, it could continue to move down. Initial support on the downside is near the $1,930 level. A downside break below the $1,930 support could spark bearish moves.\n\nThe next major support is near the $1,900 zone, below which ether price might decline toward $1,860. In the stated case, the price could revisit $1,820. Any more losses may perhaps send the price toward $1,780 in the coming days.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is now gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is well below the 50 level.\n\nMajor Support Level – $1,930\n\nMajor Resistance Level – $1,960\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvZXRoZXJldW1zLWxheWVyLTItemstcm9sbHVwcy1jYW4tYmVjb21lLWludGVyb3BlcmFibGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Here's how Ethereum's ZK-rollups can become interoperable - Cointelegraph",
        "content": "The past few weeks have seen a wave of zero-knowledge proof project launches, including Polygon’s zkEVM and Matter Lab’s zkSync Era on mainnet, and the Linea zkEVM from ConsenSys on testnet.\n\nThey join StarkWare’s long-running StarkEx solution and its decentralized cousin StarkNet along with a variety of other projects in development from Polygon (Miden, Zero, etc.) and Scroll.\n\nThey all promise faster and cheaper transactions to scale Ethereum using zero-knowledge proofs.\n\nBut is the brutal competition between ZK-rollups a zero-sum game where there can be only one winner? Or are we looking at a future in which lots of different rollups are able to work in harmony and interoperably?\n\nAnthony Rose, head of engineering for zkSync, thinks the latter future is much more likely and predicts that one day, no one will think about which ZK-rollup they are on because it’ll all just be infrastructure.\n\n“I think that if we don’t get to that world, then we’ve probably failed,” he says. “It’s the same way as somebody using Snapchat or Facebook doesn’t really have to know about TCP/IP or HTTP — it’s just the plumbing of the way the internet works.”\n\nBut how do we move from a bunch of competing sovereign rollups to an ecosystem of ZK solutions that are interoperable and composable?\n\nPeople are already starting to think about this question, and all of the ZK projects Magazine spoke to have plans to make their projects interoperable with at least some other rollups — although the extent to which that can happen likely depends on the development of standards and protocols.\n\nAlso read: Attack of the zkEVMs! Crypto’s 10x moment\n\nZero knowledge about ZK-rollups?\n\nIf you’re unfamiliar with the term “zero-knowledge proofs” — which StarkWare insists should be called “validity proofs” — they’re a way to scale Ethereum using cryptography. Rollups take the computation for tens of thousands of transactions off the main blockchain and write a tiny cryptographic proof back to Ethereum that proves the computation was carried out correctly.\n\n“Every proof we generate covers roughly 20,000 transactions and fits inside a single block of Ethereum,” explains StarkWare co-founder Eli Ben-Sasson.\n\nDespite this increase in transactions per block, zkSync’s Rose doesn’t think Ethereum can come close to scaling up to become the base layer for everything via a single rollup.\n\n“A ZK-rollup on its own will not scale to the world that we’re talking about,” Rose says. “If we think that applications with some interactions on the blockchain are providing value to hundreds of millions of people, the scalability problem is still there to be solved.”\n\nScaling is a little like internet bandwidth, in that the more you get, the more you realize you need. Back in 2017, Ethereum planned to scale using “Eth2” sharding. This roadmap was then ripped up after ZK-rollups emerged in 2018 and promised vastly greater scaling, but only if Ethereum upgraded the blockchain with a different form of sharding (proto danksharding and then danksharding) to enable the ZK-rollups to achieve higher throughput.\n\nEven then, Rose says it’s likely rollups will need to work in collaboration. “This is a big active area of research for us,” Rose says of interoperability. “As the systems mature as well… I think, naturally, this is kind of the pattern that these systems suggest.”\n\nEthereum scaling is some way off\n\nIt’s the early days yet for scaling, however. Although various solutions claim they can theoretically hit tens of thousands of transactions per second (or even talk about “unlimited” scaling), in practice, they’re hamstrung by data availability on Ethereum.\n\nAt present, between them, the various Ethereum scaling solutions and Ethereum are running at about 25 transactions per second (TPS). Ethereum itself has performed an average of about 12 TPS over the past month, Arbitrum One was at 7.2 TPS, Optimism at 2.65 TPS and zkSync at 1.6 TPS, according to ETHTPS.info.\n\nThese numbers move around a bit and are low mostly due to demand rather than capacity. StarkEx is not covered, but StarkWare tells Magazine it averaged 5 TPS over the past month.\n\nDespite supply outweighing demand so far, interoperability between rollups would already be helpful to ensure that users don’t get stuck in walled gardens. Optimistic Rollup users, for example, have to wait a week to withdraw funds, which rather limits interoperability.\n\nZK-rollups don’t have that limitation and can allow instant withdrawals (but don’t).\n\nAlso read: ZK-rollups are ‘the endgame’ for scaling blockchains: Polygon Miden founder\n\nInteroperable ZK-rollups are possible, but is it probable?\n\nBobbin Threadbare, founder of Polygon Miden, says interoperability between ZK-rollups is certainly technically possible, but “whether it will happen in practice is a different question.”\n\nHe explains that withdrawals aren’t instant yet because it’s not financially viable to put proofs on Ethereum that frequently, so transactions are fired off roughly every 10 or 20 minutes. As demand and throughput go up, this delay will become quicker and quicker.\n\n“And in that case, you get closer, closer and closer to this instant kind of movement between different places,” he says.\n\n“The second thing is that different rollups will have to have some kind of incentives to say, ‘Okay, let’s figure out how we can seamlessly move things from this to that.’”\n\nThreadbare adds, “Very fast interoperability between ZK-rollups is technically possible, but a) People need to agree on standards, and b) They need to actually implement these standards in their systems.”\n\n“And I think that’s a much, much more complicated thing to do.”\n\nInteroperability is not composability\n\nThere’s a difference between “interoperability” and “composability” — although people often use them interchangeably.\n\nInteroperability is easier and basically involves being able to move funds from one layer-2 (L2) solution to another. “By this definition, at least all of the rollups which share an L1 today already are interoperable!” notes Optimism co-founder Ben Jones.\n\nArbitrum’s Patrick McCorry also says that for basic interoperability, you can already send an asset from one rollup to another via Ethereum — it’s just slow.\n\n“Or you could have some off-chain solution, maybe like Hop protocol, where there’s someone in the middle who you give them the assets from StarkWare and then you take the assets to Scroll, and they provide some way to synchronize. So, there’s ways to do that,” he says.\n\nHop Protocol currently allows users to send funds between Ethereum, Polygon, Gnosis, Optimism and Arbitrum, though ZK-rollups aren’t currently supported. Connext offers a similar service, including BNB. A cross-chain DEX and bridge aggregator called Rango already connects StarkNet to other L2s.\n\n\n\nAlso read: Ethereum is eating the world — ‘You only need one internet’\n\nDeclan Fox, product lead for the ConsenSys Linea zkEVM, expects support will be added soon. “Many third-party bridge providers will continue to offer interoperability solutions for ZK-rollups,” he says, adding that bridges have drawbacks around trust and fees.\n\n“At Linea, we value open systems and interoperability highly. The Linea testnet has already integrated many of the leading bridging solutions for this reason. In the future, Linea will be able to trustlessly interoperate with any of the layer 3 off-chain systems deployed on top of the layer 2 through their validating bridges.”\n\n6/16) The case of two users exchanging value within an L1 is simple\n\n\n\nSimply scan the other user's QR code & press send, as long as they are also using ETH\n\n\n\nIn the case of L2s, this is not so simple, as the user now needs to know what L2 their friend is on & how to bridge between — Justin Bons (@Justin_Bons) April 10, 2023\n\nMetaMask Snaps might help\n\nAnother possibility for interoperability is via the browser wallet MetaMask. ConsenSys is in the midst of developing new crowdsourced wallet extensions called Snaps that projects can develop that extend the capabilities of MetaMask.\n\nMetaMask senior product manager Alex Jupiter says Snaps are still in the testing phase, “but if we imagine a future where you know Snaps is stable, developers can extend it in all manner of ways. Of course, the next step is to get these different Snaps talking to each other. So, one ZK-rollup can talk to another ZK-rollup, right? And that’s part of the vision of Snaps, and yeah, we want to make that world possible.”\n\nOne Snap that has been demoed already enables MetaMask users to control Bitcoin via their Ethereum wallet, so getting ZK-rollups talking to each other certainly seems achievable.\n\n“Who knows where bridging is gonna go in the future as well. I’m not an expert on ZK-rollups, but I don’t think there’s a core technical limitation of that being a problem in the future.”\n\nMessari slide highlighting “composable rollup ecosystems with shared infrastructure.”\n\nZK-rollups and composability\n\nComposability is the ability to initiate a transaction that involves operations on more than one different rollup. Jones calls it “a stronger form” of interoperability “where chains can do more than just communicate asynchronously with each other but actually have transactions, which are aware of the state of each chain in some more ‘real-time’ manner (think cross-chain flash loans).”\n\nThis is likely to require the development of new standards and protocols, and Rose says that the sooner this happens the better.\n\n“It is a strictly better user experience if teams can build through an interface, and we can attempt to have more standardization. I think there is appetite for some of this standardization as well, and I do think we will see more of it as these systems mature.”\n\nFox says that “to get to a point where we have synchronous composability, there will need to be a globally sequenced and ordered set of transactions across the different off-chain systems. This is theoretically possible with ZK-rollups thanks to SNARKs [a type of ZK proof] where, for example, a common sequencer could offer a UX of unified execution and pooled liquidity,” he says.\n\n“Imagine making a DeFi trade where parts of the trade are executed on different chains for optimal liquidity all within the same transaction.”\n\nBase layer advertisement from Coinbase. (Coinbase)\n\nOptimistic about the Superchain\n\nOne potential coordination method might be Optimism’s Superchain concept, which it announced at the same time Coinbase unveiled its base layer-2 fork of Optimism.\n\nOptimism is an Optimistic Rollup, which is another way to scale Ethereum, though more limited in potential throughput. According to the announcement:\n\n“The Superchain seeks to integrate otherwise siloed L2s into a single interoperable and composable system.”\n\nJones tells Magazine, “There is no silver bullet,” but there are a couple of requirements for interoperability and composability the Superchain aims to address:\n\nShared Sequencing: “To have a system where you can do a cross-chain flash loan, at the very least, at the time when that transaction is being processed, it needs to be included in both of the chains reliably. This requires some notion of sequencers being able to communicate, merge or otherwise network together.”\n\nSeparation of Proving and Execution: “Different applications have different security requirements, and those security requirements impose different kinds of restrictions on what interoperability properties can be achieved. By de-coupling the computation of chain state from the proving of cross-chain messages, we can maximize the interoperability of applications without fragmenting them to other chains.”\n\nHe says the Superchain can connect optimistic and ZK-rollups as well as other chains, providing a shared, modular “standard for all these innovations to happen on.”\n\n“It is going to be far easier to make these chains interoperate when they are built on the same codebase, compared to interoperating chains, which were written separately from the ground up,” he says.\n\nHowever, underscoring Threadbare’s point about political issues being more complicated than technical issues, Arbitrum CEO Steven Goldfeder dismissed the concept out of hand.\n\n“The notion that we’re going to sort of coalesce on one particular technology stack — a technology stack that’s not even built out today, that doesn’t have the core features that make it a layer 2 or make it a rollup — the notion that we do that is, I think, a bit presumptuous,” he told The Defiant.\n\nWhy connect ZK-rollups with Optimism?\n\nAnd Arbitrum is built using Optimistic Rollups. It might be even harder to convince ZK-rollups with their higher potential throughput, to coordinate via Optimism. To some it might seem like connecting fiber optic cables together with copper wire.\n\nAll the L2s make this claim though (Coinbase)\n\nHowever, Optimism is laying the groundwork to incorporate ZK proofs (validity proofs) in its systems with the Bedrock upgrade, and the Superchain will take this idea even further. “Compatibility there is the goal,” says Jones.\n\nOther potential coordination methods are the Inter-Blockchain Communication Protocol from Cosmos or “modular blockchain” Celestia (though the latter seems to be trying to replace Ethereum as the data availability layer).\n\nBut ZK-rollups could also connect directly with each other.\n\nPolygon ZK-rollups will be interoperable\n\nPolygon has a variety of flavors of ZK-rollup possible in development. They include Polygon Miden (similar to StarkNet), the Polygon zkEVM (compatible with existing EVM projects), Zero (recursive scaling) and Nightfall (Optimistic Rollups meet zero-knowledge cryptography).\n\nThreadbare says that coordinating internally to hook up Polygon’s ZK solutions is easier than coordinating with outside projects, and he believes the technical challenges are doable. The team is working on the LX-LY bridge to enable this interoperability already.\n\n“Because we are all part of the same company, then the technical integration becomes much easier to solve,” he says. “Moving between these rollups will be super, super simple.”\n\n“The friction, it’s not two separate chains or three separate chains. It doesn’t appear like that. It’s just one Polygon that settles on Ethereum. And moving assets or funds or tokens between these different environments is super, super straightforward and easy. That’s the end game.”\n\nEthereum is eating the world. Metaphorically that is.\n\nStarkEx and StarkNet\n\nStarkWare’s Ben-Sasson says they are building similar interoperability between StarkEx and StarkNet.\n\n“Yeah, definitely. We’re gonna be porting the StarkEx systems to be layer 3s over at StarkNet, and, at some point, for them to be solutions on top of StarkNet. That’s definitely the plan,” he says.\n\nBack in 2020, StarkWare released a blog laying out its plans for interoperability, but Ben-Sasson says that has been superseded. StarkWare’s Cairo is a Turing-complete language and virtual machine, which makes it similar in capability to a general-purpose computer.\n\n“A good analogy is to think of a layer 2 or a layer 1 as some computer that is just a bit slower than your laptop, but it has a lot of integrity and safety,” he says. “So, you can start just connecting these computer programs in various ways. Just like today, computers talk to each other and inter-operate or compose.”\n\nTo get computers to talk to each other over the internet, a set of standards like TCP/IP and HTTP were developed. Ben-Sasson agrees that’s the likely path for connecting validity-proof rollups, too.\n\nCointelegraph explainer on STARKs v SNARKs\n\nPerhaps ZK-rollups can connect direct\n\nStarkNet isn’t working on standards like that at present, but Ben-Sasson suggests there may be other paths to interoperability. He says smart contracts can be written to interpret the different types of incompatible proofs used by different rollups. StarkNet uses STARKs as the name suggests; zkSync uses SNARKs, for example, while Polygon Zero uses recursive SNARKs called PLONKs.\n\n“Someone already wrote on StarkNet a smart contract that allows you to verify a Groth 16 SNARK,” he says.\n\nZKPs might disrupt the design of the blockchain execution layer. Why bother with specialized languages, when you can just submit a proof of any computation in any language? — Jake Brukhman (@jbrukh) April 15, 2023\n\nThis means the two rollups can communicate directly.\n\n“As long as you can, in chain one, verify the proofs of chain two, you can start having interoperability. StarkNet is already able to verify STARKs, and now also Groth 16 SNARKs, and I’m pretty sure that very soon, we’ll have things like, you know, PLONKs and Plonky and other kinds of systems.”\n\n“So, at least in StarkNet, it should be relatively straightforward to be able to prove things happened correctly in other chains, and you can start having interoperability.”\n\nFox tells me separately that Linea’s system “is already using the EVM to verify proofs (Groth16, PlonK, etc.) in a smart contract,” which he says can make it interoperable with L3s.\n\nBen-Sasson says it seems likely that StarkNet would be able to connect to different rollups directly.\n\n“You can do it directly. You can do it because it’s a general-purpose computer and because of the validity rollup nature, right, that you can just have these systems talking to each other.”\n\nSo, it sounds like the future is interoperable and composable.\n\n“Yes, it definitely is interoperable and composable. Yes. Definitely.”"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMjAvcDJwLWNyeXB0by1zdGFraW5nLTIzLW1pbGxpb24tZXRoZXJldW0tZXRoZXIv0gFXaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8wNC8yMC9wMnAtY3J5cHRvLXN0YWtpbmctMjMtbWlsbGlvbi1ldGhlcmV1bS1ldGhlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Staking infrastructure firm P2P.org raises $23 million shortly after upgrade to Ethereum - Fortune",
        "content": "P2P.org, a blockchain infrastructure firm, announced on Thursday that it had raised $23 million in a round led by Jump Crypto, Bybit, and Sygnum.\n\nDmitry Argunov, who is based in Cyprus and is P2P.org’s chief product officer, declined to provide the implied valuation of the company, whose parent firm is incorporated in the Cayman Islands. A company spokesperson also declined to make public other participants in the funding round.\n\nP2P.org’s business piggybacks on proof of stake, an increasingly common method blockchains use to secure their network, or prevent bad actors from hijacking a public database to, for example, falsely deduct a user’s funds.\n\nAs opposed to Bitcoin’s proof of work, which requires a large amount of electricity to verify transactions, blockchains like Ethereum require those who’d like to secure the network—the validators—to put in escrow a certain amount of Ether, Ethereum’s native cryptocurrency. For validators, it’s a direct financial incentive to help protect the network.\n\nIn return, validators receive interest on the amount of cryptocurrency they stake, or put into escrow. They also receive rewards for directly validating transactions on the blockchain.\n\nFor a crypto-naive institution that wants to reap the rewards of staking’s high yields, the process can be quite complicated. Anyone who would like to be a validator needs to follow a complicated protocol for depositing cryptocurrency and then offer up a computer to validate the transactions.\n\nThis is where companies like P2P.org come in, which simplify the process for staking on a wide set of protocols, including Ethereum.\n\nInvestors can send companies like P2P.org the amount of cryptocurrency they’d like to stake, and the firm then pools customer funds to stake the cryptocurrency, offering up its own computers to validate transactions. In return, P2P.org takes a cut of the yield.\n\nOriginally proof of work, Ethereum switched to proof of stake in 2022 and recently implemented two upgrades to its staking system in April, separately named Shanghai and Capella.\n\n“The recent Shanghai upgrade is opening up the possibility for further institutional interest in the direct staking of ETH,” Konstantin Lomashuk, founder of P2P.org, said in a statement.\n\nAs Ethereum, the second-largest blockchain next to Bitcoin, continues to upgrade its proof-of-stake system and the energy-intensive proof-of-work method continues to draw criticism for its environmental impact, companies that facilitate staking, like P2P.org, are positioned to continue attracting both venture and institutional capital.\n\n“The third iteration of the internet was born with the promise of decentralization and democratization of finance,” Bill Xing, Bybit’s head of financial product, said in a statement. “It is vital that we fortify the nodes that connect the users of Web3 and harness the power of network effect.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9oaXN0b3JpY2FsLW92ZXJ2aWV3LXNjYWxpbmctc29sdXRpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "An Overview of Ethereum Scaling - Unchained - Unchained",
        "content": "Developers have long sought ways to make Ethereum fit for huge numbers of users. Here are the most hopeful scaling solutions.\n\nThe Ethereum blockchain can host non-fungible tokens (NFTs), games, decentralized exchanges, and a range of applications. But it doesn’t have the capacity required to simultaneously handle thousands of transactions from all those applications. It’s more comfortable at around 15 transactions per second, far off the pace of, say, credit card networks. Developers have long looked for a way to increase the blockchain’s throughput and reduce network congestion.\n\nThe Problem Realized\n\nThe Ethereum blockchain was designed to be more flexible than Bitcoin. Not only could you send the network’s native currency, ETH, but you could also easily send other stuff, including NFTs.\n\nEthereum’s utility quickly proved problematic, however. In 2017, an early NFT project called CryptoKitties took off. The network struggled to handle all the transactions—it’s not just purchases and trades that get posted on the network, but also smaller transactions such as bids. During high traffic, transaction fees are designed to go up. While some people paid the ballooning levies, many grumbled or were priced out.\n\nEthereum had a clear problem: scalability. If a few thousand people trading digital cats could all but paralyze the blockchain, how was it going to become “the world’s computer”?\n\nWhat Did Developers Do?\n\nThere were three main courses of action.\n\nFirst, competitors like Solana emerged to develop alternative blockchains that could handle thousands of transactions per second. These blockchains often have their own tradeoffs—Solana, for instance, relied on a small group of “validators” to verify transactions, which worked well but at some cost to security—but generally host all the same types of applications as Ethereum.\n\nSecond, Ethereum developers researched network upgrades and scalability solutions. The most promising was sharding, which involves splitting a chain into many smaller chains. Like Bitcoin, Ethereum was originally designed so that every node is responsible for verifying the blockchain’s state. That level of redundancy is hard to scale. Sharding fixes that by removing the requirement that every node participate in validating every transaction. By splitting responsibilities between users, the network can process many more transactions per second.\n\nFinally, many have looked to develop products that could help scale Ethereum by connecting to it.\n\nThe Four Types of Scaling Solutions\n\nThere are four basic categories of scaling solution, each with subcategories:\n\nState channels\n\nOne potential solution is keeping transactions off the main chain via state channels. With state channels, one party puts ether into a sort of escrow account to open the channel, and any transactions are tallied offchain—that is, on a separate network that then submits its results back to the main protocol—before a final transaction closes the channel. Think of it like keeping a restaurant tab where your card is only swiped at the beginning and end. Due to some shortcomings, state channels have fallen out of favor. For one thing, they can require users to commit a lot of capital, decreasing their liquidity.\n\nPlasma\n\nPlasma involves bridging Ethereum via a smart contract to a plasma, or “child,” chain, where transactions will be executed. While plasma chains can harness some of Ethereum’s underlying security, their setup more or less requires users to trust chain operators not to act maliciously. Though once promising, the idea has also fallen out of favor.\n\nSidechains\n\nThe most popular sidechain is the Polygon proof-of-stake chain. Essentially, you can lock your ETH into place on Ethereum and then mint tokens to represent that value over on Polygon, akin to changing out your dollar bills at the casino in exchange for chips to spend at the blackjack table. While sidechains are like plasma chains, one key difference is that they create their own security. It’s like leaving the safe confines of Ethereum to cross a bridge with a sign that reads: “Enter at your own risk.”\n\nRollups\n\nRollups aren’t to the side of the main blockchain but are instead built right on top of it. Therefore, they are known as layer-2 blockchains. Their main function is to roll up multiple transactions into one, execute them on their chain, and then send back a compressed bit of data to the main chain to show that the transactions have taken place.\n\nThere are two general types of rollups: optimistic rollups and zero-knowledge (zk) rollups. Optimistic rollups save space by assuming transactions are valid. To prevent bad transactions from getting finalized on Ethereum, validators can submit “fraud proofs” that show that the network’s state was incorrectly changed.\n\nZk-rollups, on the other hand, use zero-knowledge cryptography to cut out most of the data that needs to be sent back to the main chain; this reduces the transaction size, abetting scaling. (For more on zero-knowledge proofs, see our explainer on zkEVMs.)\n\nThe Future\n\nSince at least 2021, Ethereum creator Vitalik Buterin and others have looked to a combination of network upgrades, sharding, and rollups as a solution to Ethereum’s scaling issues.\n\nEthereum developers are currently reviewing proto-danksharding via EIP-4844. This would allow some “blobs” of information to hitch a ride with blocks, enabling more data to be processed.\n\nMost external interest in scaling is focused on rollups. In March 2023, Polygon, long known for its sidechain, unveiled its zkEVM—a way to make Ethereum more compatible with zk-rollups. In the same month, Coinbase jumped into the layer-2 game by building its own rollup on Optimism’s open-source stack."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1mb3VuZGVyLXZpdGFsaWstdHdlZXQtY2hpbmVzZS1naXJsZnJpZW5kLXNwZWN1bGF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Did Vitalik Buterin's Rumored Breakup Cause Ethereum's Drop? - DailyCoin",
        "content": "Vitalik Buterin has liked a tweet with intriguing lyrics, sparking speculation.\n\nRumors have been swirling about Vitalik’s love life, with speculations of a Chinese girlfriend in the blockchain field.\n\nJustin Sun, the founder of Tron, has added a humorous tweet about the entire speculation.\n\nEthereum‘s enigmatic founder, Vitalik Buterin, recently caused a stir on Twitter with a like on a Chinese tweet by afrawang.eth. The tweet featured lyrics from Liang Jingru’s renowned song, “Happy Breakup,” leaving the community in speculation and intrigue.\n\nVitalik’s love life has always been shrouded in mystery, with speculations of him dating Chinese women and indulging in hot pot dinners at Chinese restaurants. Now, with afrawang.eth, a blockchain professional, in the spotlight, rumors abound about her being Vitalik’s long-rumored Chinese girlfriend.\n\nCurious followers have flooded the tweet with inquiries about their relationship status, fueling the gossip fire.\n\nJustin Sun Jokes About Ethereum Price Drops After Vitalik’s Speculated Breakup\n\nInterestingly, after afrawang.eth published an article on the 18th, the price of Ethereum took a tumble from its lofty height of $2,100. By the 19th, it had dipped below the $2,000 mark, hitting a low of $1,888 before rebounding to its current trading price of $1,902.\n\nWhile some speculate that Vitalik’s supposed breakup may have influenced Ethereum’s price drop, there is no confirmation of the news, leaving it all as mere speculation.\n\nIn a humorous turn of events, Justin Sun, the founder of Tron, couldn’t resist poking fun at the situation. He took to Twitter and jokingly suggested that Vitalik’s breakup was to blame for the crypto market’s slump, offering to play matchmaker and introduce him to a new partner to get the crypto industry back on track.\n\nRumor has it that the crypto market and ETH price are down📉 because @VitalikButerin ended things with his girlfriend.💔 For the sake of the crypto industry, I volunteer to introduce him to a new partner! Let's get things back on track! — H.E. Justin Sun 孙宇晨 (@justinsuntron) April 21, 2023\n\nOn the Flipside\n\nNo confirmed news or evidence supports the speculation about Vitalik Buterin’s breakup.\n\nThe decline in Ethereum’s price could be attributed to various factors, including market volatility, investor sentiment, and external market conditions, rather than just one individual’s personal life.\n\nIt’s important to approach rumors and speculations cautiously and rely on verified information from credible sources to make informed judgments about the cryptocurrency market.\n\nWhy You Should Care\n\nAs a key figure in the blockchain space and the founder of Ethereum, any news related to Vitalik Buterin can impact the general crypto market sentiment and investor behavior.\n\nFAQs\n\nDoes Vitalik Buterin have a girlfriend? While there has been speculation about his romantic life, Vitalik Buterin’s relationship status is not publicly known. Who is Vitalik Buterin’s girlfriend? There have been unconfirmed reports and rumors that his girlfriend is a Chinese woman in the blockchain industry. However, Buterin has not confirmed or publicly disclosed any details about his current relationship status. What ethnicity is Vitalik? Vitalik Buterin is of Russian-Canadian descent. He was born on January 31, 1994, in Kolomna, Russia, and moved to Canada with his family at a young age. Does Vitalik have a Ph.D.? Vitalik Buterin does not have a Ph.D. He is a well-known programmer and entrepreneur who co-founded the cryptocurrency platform Ethereum. He dropped out of the University of Waterloo in Canada before completing his bachelor’s degree to focus on his work in the blockchain and cryptocurrency field.\n\nTo learn more about the legality of sending free coins to Vitalik Buterin, check out this article:\n\nWhy Sending ‘Free’ Coins to Vitalik Buterin May Soon Be Illegal\n\nFor the latest updates and projections on Bitcoin’s price, take a look at this article:\n\nDailyCoin Regular: Bitcoin Price Updates, Breakdowns and Projections"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1wb3N0LW1lcmdlLW92ZXItMTAway1jb2lucy1lbGltaW5hdGVkLWZyb20tZXRocy1zdXBwbHkv0gFdaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLXBvc3QtbWVyZ2Utb3Zlci0xMDBrLWNvaW5zLWVsaW1pbmF0ZWQtZnJvbS1ldGhzLXN1cHBseS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Post-Merge: Over 100K Coins Eliminated From ETH’s Supply - CryptoPotato",
        "content": "The Merge represented the Ethereum network’s transition from proof-of-work to proof-of-stake. 218 days later, more than 103,092 ETH has been eliminated from the supply of the world’s largest altcoin.\n\nAt current prices, this amounts to a little over $197 million. Deflation on the network is on the rise as the supply declined by 0.146% per year.\n\nAccording to the latest data from the Ethereum monitoring site ‘ultrasound.money,’ the current supply of ether stands at nearly 120,416,113 million coins.\n\nThe currency burn rate over the last 30 days was found to be at 1,125k ETH and a supply growth of -0.37%.\n\nAt this pace, the Ethereum supply is expected to reach 118.1 million by the year 2025.\n\nIssuance rewards for stakers, on the other hand, will be at 3.9% per year, while the burn rate for the non-stakers will stand at 1.8% per year.\n\nContrastingly, if Ethereum had not undergone the Merge and instead continued to rely on miners to secure the network, the supply of the token would have increased by more than 2.5 million ETH, which translates to an astonishing $4.9 billion in the current market value.\n\nETH’s supply, for one, would have increased by 3.53% every year.\n\nWhile the Merge was indeed responsible for the reduction in ETH supply by a considerable amount, the aspect of burning ether can be attributed to the Ethereum Improvement Proposal 1559, which was implemented via the London upgrade in August 2021. Its main purpose is to slash inflation on the Ethereum network and exert deflationary pressure on the token’s supply.\n\nMeanwhile, the Shapella upgrade on April 12 enabled stakers to unlock their staked Ether. The exodus of tokens following the event slowed down.\n\nWithin a week, the amount of staked ether trumped the number of ETH being withdrawn for the very first time."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzIwL3NvY2lldGUtZ2VuZXJhbGVzLWNyeXB0by1kaXZpc2lvbi1pbnRyb2R1Y2VzLWV1cm8tc3RhYmxlY29pbi1vbi1ldGhlcmV1bS_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNC8yMC9zb2NpZXRlLWdlbmVyYWxlcy1jcnlwdG8tZGl2aXNpb24taW50cm9kdWNlcy1ldXJvLXN0YWJsZWNvaW4tb24tZXRoZXJldW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Societe Generale's Crypto Division Introduces Euro Stablecoin on Ethereum - CoinDesk",
        "content": "While U.S. banking giant JPMorgan's in-house stablecoin JPM coin has been in use since 2020 as a settlement token between financial institutions, it trades on the bank's internal Onyx network, not a public blockchain."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mb3JtZXItZXRoZXJldW0tbWluZXItY29yZXdlYXZlLXJhaXNlcy0yMjFtLWluLXNlcmllcy1i0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Former Ethereum miner CoreWeave raises $221M in Series B - Cointelegraph",
        "content": "On April 20, specialized cloud provider CoreWeave announced that it had secured $221 million in a Series B funding round, putting the company on track to expand operations and increase capacity in various emerging technologies.\n\nThe raise was led by Magnetar Capital with contributions from NVIDIA and rounded out by Nat Friedman and Daniel Gross. In November 2021, CoreWeave secured a $50 million investment from Magnetar Capital.\n\nAccording to CoreWeave, the money will be used to expand its cloud infrastructure for computational workloads such as artificial intelligence, machine learning, visual effects, rendering, batch processing and pixel streaming. The firm’s CEO and co-founder, Michael Intrato, said NVIDIA’s support would help the company continue to scale.\n\nFounded in 2017, CoreWeave uses cloud technology to scale graphics processing unit (GPU) computational resources that the company claims are “35 times faster and 80% less expensive” than competitor solutions. The firm started as an Ethereum miner, utilizing GPUs to verify transactions on the former proof-of-work blockchain.\n\nIn September 2022, Ethereum completed its much-anticipated Merge upgrade, transitioning the network into proof-of-stake from the previous proof-of-work protocol. The move rendered the practice of Ethereum mining and, subsequently, Ethereum mining GPUs obsolete. That said, CoreWeave ceased its Ethereum mining operations long before the Merge was completed.\n\nMagazine: Here’s how Ethereum’s ZK-rollups can become interoperable"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9iaXRjb2luLXR1bWJsZXMtdG93YXJkLTI5ay13aGlsZS1ldGhlcmV1bS1idWxscy1iYXR0bGUtYXQtMjAwMC1tYXJrZXQtd2F0Y2gv0gFpaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2JpdGNvaW4tdHVtYmxlcy10b3dhcmQtMjlrLXdoaWxlLWV0aGVyZXVtLWJ1bGxzLWJhdHRsZS1hdC0yMDAwLW1hcmtldC13YXRjaC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Tumbles Toward $29K While Ethereum Bulls Battle at $2,000 (Market Watch) - CryptoPotato",
        "content": "The cryptocurrency market has taken somewhat of a beating in the past few hours. Bitcoin’s price dropped to around $29,000, while Ethereum is trading slightly below $2000.\n\nBulls are attempting to defend these pivotal levels, and it’s important to see how things will pan out and whether there’s another crash incoming.\n\nBitcoin Price Drops Toward $30K\n\nThe market was performing relatively well throughout the past 24 hours as prices were recovering from the most recent declines. Bitcoin had reclaimed $30K.\n\nUnfortunately, the past hour has turned out to be quite negative, as the price tumbled toward $29K in less than 15 minutes. Longs comprised the overwhelming majority of the liquidations, so that could be a classic example of a long squeeze.\n\nThat said, BTC tagged $29K to the cent and is currently trading around $29,300, as seen in the chart above.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nEthereum Bulls Fight For $2K\n\nJust as $30K is an important level for Bitcoin, $2,000 is an instrumental zone for Ethereum too. The price is currently hovering near it, and the bulls are fighting to protect it.\n\nAs seen in the heatmap above, all the major cryptocurrencies were caught off guard by this most recent move, and the market is largely painted in red.\n\nSOL lost quite a bit – around 8.5% of its price. It’s also fairly evident that Bitcoin is boding well compared to the rest of the market.\n\nFor another day, Radix (XRD) remains the best performer. Despite the turmoil, the cryptocurrency is up 10% in the past 24 hours. It lost 9.4% in the past hour, though. Apart from it, all the other altcoins are trading in the red. Arbitrum’s ARB lost 12.6% and is the worst performer during this period.\n\nIt’s interesting to see how the market will pan out in the next 24 hours and whether or not this is just a temporary correction or the beginning of a deeper one."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1uYW1lLXNlcnZpY2UtYWRkcy1maWF0LXBheW1lbnRzLWZvci1lbnMtZG9tYWluLXJlZ2lzdHJhdGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Name Service adds fiat payments for ENS domain registrations - Cointelegraph",
        "content": "Web3 users can now register decentralized .eth domains on the Ethereum Name Service (ENS) protocol using a host of fiat payment options, including Apple Pay, and Google Pay, as well as debit and credit cards,\n\nENS announced the launch of a new fiat on-ramp for domain registrations through Web3 fiat payment gateway MoonPay on April 20. Registrations of .eth domains previously had to be paid for using Ether (ETH) via cryptocurrency wallets, which was cited as a barrier to entry for prospective Web3 users.\n\nMoonPay’s service has been integrated into the ENS website, while the platform also launched version 3 of its user interface to streamline sign-ups. This is aimed at eliminating the need for multiple transaction approvals previously required with cryptocurrency wallets.\n\nA statement from ENS founder Nick Johnson highlighted the service’s focus on making Web3 “human-readable” to simplify the process of obtaining decentralized digital identities. ENS allows users to map human-readable names like “cointelegraph.eth” to machine-readable information like cryptocurrency addresses and URLs:\n\n“This allows us to reach those who are either just entering the space or who are not yet comfortable with transacting and would prefer to use the currency and payment form they understand best.”\n\nThe upgrade of ENS’s platform is also touted to expand its usability beyond a primary use-case of creating human-readable names for wallets to replace numerical addresses typically generated by wallet service providers, platforms and blockchain protocols.\n\nENS users can use names to host censorship-resistant websites, which can be linked to conventional domain name service (DNS) addresses already in use.\n\nRelated: State of play: Decentralized domain services reflect on industry progress\n\nMoonPay’s vice president of partnerships, Bree Blazak, highlighted the integration with ENS as a means to create a simple payment experience for new users looking to obtain digital identities or decentralized domains:\n\n“Our partnership with ENS delivers that by making it possible to buy a .eth name with some of the most familiar payment methods available.”\n\nEthereum Name Service hasseen over 2.3 million names created from more than 550,000 unique addresses. As Cointelegraph previously explored, decentralized domain name registrations have been on the rise over the past two years.\n\nBoth ENS and Unstoppable Domains have become leading platforms onboarding new users to the world of Web3 and decentralized identities. The latter also partnered with MoonPay to incorporate nonfungible token domains in transactions on the platform in July 2022.\n\nMagazine: 2023 is a make-or-break year for blockchain gaming: Play-to-own"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDQvMjAvZXRoZXJldW0tbmFtZS1zZXJ2aWNlLXRvLXdvcmstd2l0aC1tb29ucGF5LXRvLWJ1aWxkLWZpYXQtb24tcmFtcC_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vd2ViMy8yMDIzLzA0LzIwL2V0aGVyZXVtLW5hbWUtc2VydmljZS10by13b3JrLXdpdGgtbW9vbnBheS10by1idWlsZC1maWF0LW9uLXJhbXAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Name Service to Work With MoonPay to Build Fiat On-Ramp - CoinDesk",
        "content": "“The goal of the integration is to offer a solution that eliminates this barrier by allowing users to use payment options that they are used to such as Apple Pay and Google Pay,” said Nick Johnson, the founder and lead developer at ENS. “By making it as user friendly as possible, this partnership will not only boost mainstream adoption of decentralized financial apps but also Web3 as a whole.”"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzIwL2RlY2VudHJhbGl6ZWQtZXhjaGFuZ2UtYmFuY29yLXN0YXJ0cy1vbi1jaGFpbi10cmFkaW5nLXBsYXRmb3JtLWNhcmJvbi_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNC8yMC9kZWNlbnRyYWxpemVkLWV4Y2hhbmdlLWJhbmNvci1zdGFydHMtb24tY2hhaW4tdHJhZGluZy1wbGF0Zm9ybS1jYXJib24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Decentralized Exchange Bancor Starts On-Chain Trading Platform Carbon - CoinDesk",
        "content": "This will enable users to buy the token low and sell it high as ETH moves between those ranges. The liquidity automatically rotates between users’ ranges to fill the orders. This is a similar model seen on centralized exchanges, but has lacked on DEXs, said Hindman. “Bringing the trading functionality of CEXs to DEXs is key to driving the next wave of traders on-chain,” he added."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1nYXMtZmVlLWp1bXBlZC1kdWUtdG8tbWVtZS1jb2luLWZyZW56eS13aXRoLW1peGVkLWNvbW1lbnRzLW9uLW5ldHdvcmstdXNhYmlsaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Ethereum gas fee jumped due to memecoin frenzy with mixed comments on network usability - Cointelegraph",
        "content": "Ethereum network’s gas fee skyrocketed to a new multi-month high amid a growing memecoin frenzy. The high transaction fee has swelled Ethereum’s daily revenue multifold compared to Bitcoin (BTC). While Ethereum proponents celebrated the growth in revenue, many others were quick to point out the growing congestion on the network and the difficulty in processing transactions.\n\nThere was an unusual shift in the top 10 gas-burning altcoins where instead of ETH (ETH), WETH, and USDT (USDT), memecoins such as TROLL, APEDand BOBO were among the top 10 spenders.\n\n⛽️ A highly unusual shift in top 10 gas burning #altcoins has emerged today. Instead of $ETH, $WETH, and $USDT being at the top of the fee distribution list, we're seeing new assets like $TROLL, $APED, and $BOBO among them. Read our latest deep dive. https://t.co/7SlmJ59k2m pic.twitter.com/Y2kaLKZTrL — Santiment (@santimentfeed) April 19, 2023\n\nThe average gas price for Ethereum transactions as of April 20 was 81.94 gwei, up from 60.82 gwei on April 19 and 44.42 gwei last year — an increase of 34.74% from April 19 and 84.46% from April 20, 2022. Gwei is a denomination of the Ether and represents one billionth of one ETH.\n\nETH gas fee increase in last month. Source: Ychart\n\nIndependent Ethereum educator Anthony Sassano shared the surge in daily fee revenue of the Ethereum network and said that the second-largest blockchain had brought in 28 times the revenue of Bitcoin. He also cited Ethereum layer-2 platforms like Arbitrum One that have outperformed the BTC network in terms of daily revenue due to the ongoing meme frenzy.\n\nDaily and weekly revenue of various blockchain. Source: Twitter\n\nEthereum proponent’s main argument is that the high gas fee and subsequent higher revenue highlight the network’s growing usability. However, many on Crypto Twitter were quick to point out that the extensive usage they are referring to is just a few thousand users gambling on memecoins.\n\nThe extensive usage you’re talking about are a few thousand users gambling meme coins. I thought (and hoped) eth was supposed to be the future of finance — nap.BasicallyRiskFree (@CryptoPannella) April 20, 2023\n\nA few users reportedly paid gas fees as high as a few hundred dollars, while others complained about having to pay a higher gas fee than the actual transaction.\n\ntry to buy a ~$20 NFT on eth, and the gas is ~$40.\n\nsome ppl say the infra operators deserve to be paid. sure, but imaging paying visa $40 fee for buying a $20 digital good.. infra should be affordable. pic.twitter.com/5L4SYjT5af — 0xMQQ (@0xMQQ) April 18, 2023\n\nAnother prominent reason for the soaring gas fees was blamed on a Maximal Extractable Value (MEV) trading bot that is front-running memecoin trades on a massive scale. The bot in question jaredfromsubway.eth has been the top gas spender in the last 24 hours, spending 455 ETH ($950,000) and using 7% of the total gas of the network.\n\nRelated: Tether blacklists validator address that drained MEV bots for $25M\n\nIn the last two months, it spent more than 3,720 ETH ($7 million) in gas fees and performed more than 180,000 transactions.\n\nbro has used 7% of the total gas on ethereum over the past 24hrs (455 ETH) just feasting away on $pepe\n\n\n\ndata from the legendary @hildobby_ https://t.co/j3SqtQnkKJ pic.twitter.com/hWavtdO1D5 — beetle (@1kbeetlejuice) April 18, 2023\n\nThe Subway-themed bot is using the sandwich trading technique to pocket millions of dollars while congesting the network at the same time.\n\nMagazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA0LzIwL2V0aGVyZXVtLXdoYWxlLWFicnVwdGx5LW1vdmVzLW92ZXItMzEzMDAwMDAwLWluLWV0aC1oZXJlcy13aGVyZS10aGUtY3J5cHRvLWlzLWhlYWRlZC_SAXpodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8yMC9ldGhlcmV1bS13aGFsZS1hYnJ1cHRseS1tb3Zlcy1vdmVyLTMxMzAwMDAwMC1pbi1ldGgtaGVyZXMtd2hlcmUtdGhlLWNyeXB0by1pcy1oZWFkZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Whale Abruptly Moves Over $313,000,000 in ETH – Here’s Where the Crypto Is Headed - The Daily Hodl",
        "content": "An Ethereum (ETH) whale is suddenly moving hundreds of millions of dollars worth of ETH as the smart contract platform dips below $2,000.\n\nAccording to data from the whale-watching platform Whale Alert, the deep-pocketed investor transferred nearly 150,000 ETH worth more than $313 million around the time of the transaction.\n\nThe Ethereum whale paid a fee of about 0.000945 ETH or $1.84 to make the multi-million-dollar transaction, according to Etherscan.\n\nThe whale moved the ETH from one unknown wallet to the crypto exchange Coinbase.\n\nThe receiving wallet made a number of transactions following the transfer and has a remaining balance of only about 2,744 ETH, according to Etherscan. The sending wallet has just 0.000986 ETH remaining.\n\nOther notable Ethereum transfers by high-net-worth traders on Whale Alert’s radar include:\n\n17,213 ETH worth $33.64 million transferred from an unknown wallet to Coinbase.\n\n16,881 ETH worth $33.53 million transferred from an unknown wallet to Coinbase.\n\n25,000 ETH worth $49.88 million transferred from the crypto exchange Bistamp to an unknown wallet.\n\n29,997 ETH worth $62.16 million transferred from the crypto exchange Bithumb to an unknown wallet.\n\nEthereum underwent an ecosystem upgrade on April 12th known as “Shapella,” which refers to the simultaneous improvements made on both Shanghai, the project’s execution layer, and Capella, the project’s consensus layer. The upgrade also allows validators to withdraw their staked ETH.\n\nAt time of writing, Ethereum is trading for $1,946.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/JoeyCheung"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiJWh0dHBzOi8vY29pbmpvdXJuYWwubmV0L2V0aGVyZXVtL2J1eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "How to Buy Ethereum 2024 - Best Places to Buy ETH - CoinJournal",
        "content": "Where to Buy Ethereum in the US?\n\n1. eToro – Best Overall Place to Buy Ethereum in the US\n\neToro is popular for its unique Copy Trading feature that allows users to copy the trading and investment decisions of more experienced investors. The platform stands out from its competitors by creating a vibrant community of 25 million users that can learn from one another.\n\nIt is also one of the most regulated crypto exchanges with licenses from the Securities and Exchange Commission (SEC) and Financial Industry Regulatory Authority (FINRA) in the United States, the Financial Conduct Authority (FCA) in the UK, the Cyprus Securities & Exchange Commission (CySEC) in Europe, and the Australian Financial Services Licence (AFSL) in Australia.\n\nThe platform offers thematic investment portfolios that allow newbies and experienced users to spread their risk by investing in a portfolio of stocks or crypto assets that is built around a theme or industry that they understand. This way, users reduce their risk of choosing one or two digital assets that do not perform well.\n\nUsers can buy ETH along with over 75 other cryptocurrencies the broker offers. Transaction fees are ultra-low with a 0% commission for crypto trades thanks to their proprietary blockchain technology called eToroX.\n\nDeposits and withdrawals are favorable to users as they can deposit as little as $10 through several payment channels like credit/debit cards and electronic wallets like PayPal, Neteller, and Skrill. For withdrawals, eToro charges a $5 fee on all transactions above $30 which is, unfortunately, the minimum limit for withdrawals.\n\neToro does not charge for deposits, but your payment provider may. Bank deposits are subject to a minimum value of $500 while credit cards used for deposits must bear the same name as the account.\n\nFor purchasing Ethereum, you’ll need to create an account, and pass KYC by submitting a valid ID and proof of address documents like a utility bill or bank statement.\n\nRead our full eToro review here.\n\nPros of eToro\n\nStraight forward signup\n\nAccess to over 75 crypto assets\n\nAccess to both coins and CFDs\n\n$10 minimum deposit\n\nFree deposits on eToro’s end\n\nWell regulated\n\nStrong social investing features like copy trader\n\nAffordable withdrawal fee ($5)\n\nMobile app\n\nCons of eToro\n\nUnavailable to US citizens living outside the US\n\nOpen Account 77% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money.\n\n2. Binance – Best Exchange with Cheap Transaction Fees\n\nBinance is one of the largest crypto exchanges in the world with a vast collection of around 600 cryptocurrencies that run the gamut from major coins like Bitcoin and Ethereum to fan tokens like the Manchester City Fan Token, and DeFi gems like JEWEL.\n\nDespite its massive coin selection, Binance’s low transaction fees are where it shines. The exchange charges a modest 0.10% for crypto transactions. If you hold its native coin, Binance Coin (BNB), you pay reduced fees, depending on how much BNB you hold.\n\nWhen it comes to liquidity, Binance’s $76 billion daily trade volume is more than enough to facilitate large volumes of Ether.\n\nYou also have several options when buying ETH. You could use the straightforward Convert feature to buy Ethereum at the current market price. This feature is great for users who want to buy and store Ether.\n\nFor more sophisticated buyers, the classic trading terminal gives access to a chart and indicators for studying Ethereum’s price pattern and predicting future movements. And when you’re ready to buy, use the order interface to place dynamic order types like limit orders, market orders ,and OCO orders.\n\nBinance makes depositing funds convenient with its support for about 61 different types of fiat currency through several payment channels like bank wires, bank deposits, SEPA Transfers, credit/debit cards, and third-party channels like Simplex.\n\nDeposit fees vary with currency and payment method but are usually within affordable limits. The highest charges we found were 1.80% for credit card transfers and $15 for US SWIFT transfers.\n\nRead more information in our full Binance Review here.\n\nPros of Binance\n\nLow trading fees at a max of 0.10%\n\n24/7 support but mostly through email\n\nAffordable deposit and withdrawal fees at a max of 1.80%\n\nSupports over 60 fiat currencies\n\nProvides advanced trading tools and order types\n\nHas a mobile app\n\nCons of Binance\n\nThe array of services could be overwhelming to new users\n\nLimited crypto selection for US entity\n\n3. Coinbase – Best Exchange for Beginners\n\nCoinbase is known for its smooth user interface and clean platform. The US-based exchange excels as a platform for beginners because it is one of the easiest crypto applications to use.\n\nThe exchange offers 193 cryptos, a number that is constantly growing as more coins periodically get added. You can find major coins, gaming tokens, and even meme coins within the collection, and US residents will find that it has the largest collection among US-based crypto entities.\n\nUsers also enjoy an all-in-one platform with staking and lending services and crypto-backed loans. Traders who wish to set limit orders to buy Ethereum at a lower price than its current market price can do so on the advanced trading platform.\n\nNew investors and crypto novices can use Coinbase’s convert interface to directly swap between coins for a flat 1% conversion fee. Trading fees are cheaper at 0.05% – 0.60% for immediate orders (taker fees) and between 0.00% – 0.40% for delayed orders (maker fees).\n\nDepositing and withdrawing funds to/from Coinbase is just as easy as swapping tokens. The exchange supports several payment channels depending on the geographical regions, however, six major regions encompass the rest. They include the United States, Europe, Singapore, Australia, Canada, and the United Kingdom.\n\nUS users can choose between Apple Pay, Google Pay, PayPal, bank transfers, and credit and debit cards. To withdraw, users can choose between PayPal, wire transfers, and bank transfers.\n\nDeposit and withdrawal fees vary depending on the payment channel. Credit card transactions cost 2.49% of the transaction value, bank transfers vary depending on the bank, and wire transfers cost $10 for deposits and $25 for withdrawals.\n\nCreating an account is easy. You’ll need an email address and password. You also have to pass KYC using a valid ID and a proof of address documents like a utility bill or bank statement.\n\nRead our full Coinbase review here.\n\nPros of Coinbase\n\nEasy-to-use\n\nRobust coin collection for a US entity\n\nOver 100 countries supported\n\nEducational resources for beginners\n\nCons of Coinbase\n\nSupport articles can be fuzzy about fees\n\nBuy Ethereum with Coinbase Disclaimer\n\n4. Bitpanda – Best Exchange for Traditional Investors\n\nBitpanda is a fintech firm known for its conventional feel, one that traditional investors are used to, making it an ideal way for them to enter the crypto space. This platform is geared toward helping investors manage their portfolios as a whole.\n\nThe platform’s most unique feature is its crypto indices that work like traditional ones in benchmarking the performance of certain sectors. These indices are composed of the top coins in the seven sectors they track.\n\nThey include the BCI Infrastructure index composed of 5 strong infrastructure projects, the BCI DeFi Leaders index composed of 5 top DeFi coins, the BCI Metaverse index composed of 5 top metaverse tokens, the BCI Smart Contracts index composed of 14 top smart contract blockchains, the BCI 5 index composed of the 5 most capitalized coins, the BCI 10 index composed of the 10 most capitalized cryptos, and the BCI 25 index composed of the 25 most capitalized cryptos.\n\nTraditional investors can put money into any of these indices and enjoy growth in the sectors they track. If the market doesn’t perform favorably, they don’t lose as much as they would have if they invested in one or two coins.\n\nFor investors with a long-term horizon, Bitpanda offers a savings plan that automatically buys a set amount of Ether periodically once connected to a credit card. This way, investors can develop a set-it-and-forget-it investment schedule for Ethereum and accumulate the coin over long periods.\n\nDeposits and withdrawals on Bitpanda are done in Euro, US dollar, British pound, Swiss franc, Danish krone, and Turkish lira through credit cards, bank transfers, SEPA transfers, Skrill, Neteller, and some region-specific channels.\n\nTransaction fees are an affordable 1.49% for crypto transactions and are already priced into the cryptos on the in-built exchange. Traders pay a maximum of 0.10% for delayed trades (maker fees) and 0.15% for immediate trades (taker fees).\n\nFinally, Bitpanda is licensed and regulated by the Financial Market Authority (FMA) Austria, the French Autorité Des Marchés Financiers (AMF), and the Czech Trade Authority.\n\nBitpanda Pros\n\nLists 170 cryptocurrencies\n\nInnovative crypto indices\n\nAutomated crypto savings\n\nSimple, easy-to-use platform\n\n€25 minimum deposit and withdrawal\n\nPro platform for advanced traders\n\nWell regulated\n\nBitpanda Cons\n\nSupports only 8 types of fiat currency\n\nLimited crypto products (no crypto card or lending service)\n\n5. Bitstamp – Best Exchange for Reliability\n\nBitstamp is an enduring crypto exchange best known for its reliability, collection of over 75 cryptos, institutional-grade security, and 24/7 customer service. If you want an exchange that has a track record of always being around, Bitstamp is the place to go.\n\nThe platform’s interface is clean, straight to the point, and more conventional than regular crypto interfaces, making it suitable for both traditional and novel investors. The simple platform is packed with a powerful trading terminal, staking services, and an accompanying mobile app to help manage portfolios on the go.\n\nInvestors can easily swap between coins at market cryptocurrency prices without using the trading terminal while traders can access the industry standard trading platform to set dynamic order types.\n\nTrading fees are slightly higher than some competitors at 0.50% for trades under $10,000. However, higher volumes attract lower fees.\n\nDeposits are quick and easy with payment channels like SEPA transfers, credit or debit cards, international wires, and bank transfers. Withdrawals also use the same channels.\n\nBitstamp transfer fees are affordable at 5% for credit cards, free for ACH, Faster Payments, and SEPA, and 0.05% for international wire. Withdrawal fees include €3 for SEPA, £2 for Faster Payments, free for ACH, and 0.1% for international wire.\n\nTo create an account, you’ll need an email address and KYC documents like an ID card and a utility bill.\n\nBitstamp Pros\n\nStrong reputation for being reliable\n\nInstitution-grade security\n\n$25 minimum deposit\n\nMobile app for on-the-go trades\n\n24/7 customer service\n\nTransparent fees\n\nBitstamp Cons"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI1OTc0L2lzLWV0aGVyZXVtLWJldHRlci10aGFuLWJpdGNvaW4v0gFHaHR0cDovL2FtcC5jb2luY29kZXguY29tL2FydGljbGUvMjU5NzQvaXMtZXRoZXJldW0tYmV0dGVyLXRoYW4tYml0Y29pbi8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Is Ethereum Better Than Bitcoin? - CoinCodex",
        "content": "Ethereum is better than Bitcoin if you want to use decentralized applications like DEXes and NFT marketplaces. Meanwhile, Bitcoin has a larger market capitalization and is usually seen as a better option if you are looking for a long-term digital store of value.\n\nBitcoin and Ethereum are by far the two largest cryptocurrencies by market cap, so it’s not too surprising that there’s a bit of a rivalry between the most fervent supporters of each project.\n\nIn this article, we’ll compare Bitcoin and Ethereum from multiple perspectives to help you understand the differences between the two cryptocurrencies and their use cases.\n\nBitcoin vs. Ethereum — Main differences\n\nSo, how is Ethereum different from Bitcoin? Let’s highlight the main differences between Bitcoin and Ethereum to understand how these two leading cryptocurrencies stack up against each other.\n\nConsensus mechanisms\n\nBoth the Bitcoin and Ethereum networks consist of thousands of nodes that are scattered across the globe. Therefore, nodes need a way for thousands of participants scattered across the globe to reach consensus on which transactions are valid and what the state of everyone’s balances is.\n\nBoth Bitcoin and Ethereum use a special type of ledger called a blockchain to record transactions and user balances. A blockchain consists of a series of “blocks” which contain records of transactions and are “chained” together through cryptography to ensure that the information contained in them cannot be changed retroactively after being added to the blockchain.\n\nBitcoin utilizes a Proof-of-Work consensus mechanism. Participants in Proof-of-Work consensus are called “miners”. In order to add the next block to the blockchain, a miner needs to find the correct “nonce”, which is a random string of characters included in each block.\n\nThe nonce is determined by combining the block’s data and a hashing algorithm. Finding the nonce requires a lot of computing power, and the Bitcoin network consumes substantial amounts of energy as a result.\n\nAt launch, Ethereum also used a Proof-of-Work consensus mechanism which was conceptually very similar to Bitcoin. In 2022, Ethereum switched to a Proof-of-Stake consensus mechanism. This drastically reduced the amount of energy consumed by the Ethereum network.\n\nIn a Proof-of-Stake consensus mechanism, users who want to be validators need to stake a certain amount of cryptocurrency. When it’s time to add a new block to the blockchain, the protocol selects an active validator to perform the task. Meanwhile, other validators attest to the proposed block. Proof-of-Stake consensus mechanisms include rules to penalize validators for malicious behavior.\n\nProgrammability\n\nAnother major difference between Bitcoin and Ethereum is programmability. Bitcoin is designed to function as a peer-to-peer digital currency that’s resistant to censorship attempts and avoids the common pitfalls of other digital currency designs, for example double spending. Bitcoin’s programmability consists of limited scripting capabilities.\n\nMeanwhile, the scope of Ethereum is more ambitious. While ETH can be used in a manner very similar to BTC, Ethereum also provides general-purpose smart contract capabilities. For example, Ethereum can be used to issue custom “tokens” that can also be transacted with on the same blockchain.\n\nEthereum’s programmability has unlocked some unique functionality like decentralized exchanges, lending protocols and NFT marketplaces. For example, the Maker protocol allows users to provide their ETH as collateral to mint DAI, which is a “stablecoin” that tracks the value of the US dollar. Another example is the Uniswap protocol, which allows users to swap between different Ethereum-based tokens trustlessly.\n\nCommon features\n\nNow that we’ve gone through the main differences between Bitcoin and Ethereum, let’s quickly highlight some of the main things they have in common.\n\nBoth utilize a blockchain architecture to keep track of transactions and balances\n\nBoth the Bitcoin and Ethereum blockchains are fully transparent with all information accessible publicly\n\nBoth allow users to send transactions on a 24/7 basis with no geographical or other restrictions\n\nBoth are permissionless—anyone can set up a node and join the network\n\nUsers interact with each other through addresses, not real-world identities\n\nBoth have irreversible transactions\n\nSupply dynamics\n\nThere’s quite a few differences between Bitcoin and Ethereum when it comes to supply dynamics.\n\nThe Bitcoin protocol specifies that no more than 21 million BTC can ever exist. Currently, there’s about 19.35 million BTC in circulation, and new BTC coins will continue entering circulation until the 21 million BTC limit is reached. This is expected to happen sometime in 2140.\n\nBTC coins are created whenever a miner adds the next block to the Bitcoin blockchain. The Bitcoin protocol issues BTC as a “block reward” in order to reward the miner. The Bitcoin protocol implements a mechanism called the Bitcoin halving, which triggers approximately every four years. When a Bitcoin halving happens, the block reward is reduced in half.\n\nAt the time of writing, the block reward is 6.25 BTC, and it will be reduced to 3.125 BTC when the next halving happens.\n\nMeanwhile, the Ethereum protocol doesn’t specify a limit for how many ETH coins can exist. Approximately 1,600 ETH is issued every day to reward validators in the network’s Proof-of-Stake consensus system.\n\nHowever, ETH coins are also being burned (permanently removed from circulation) with each transaction. This is because of an upgrade called EIP-1559, which introduced a mechanism in which the base ETH fee paid for each transaction is burned.\n\nTherefore, the fluctuation in the supply of ETH is mostly determined by demand for transactions. Higher transaction demand leads to more ETH being burned, which provides deflationary pressure to the ETH supply.\n\nTo learn more about Ethereum’s supply dynamics, check out our article explaining the Ethereum triple halving.\n\nInvesting options\n\nIn terms of investing, both Bitcoin and Ethereum are generally considered as the two most important cryptocurrencies. In other words, it’s difficult to imagine BTC and ETH performing poorly as investments if cryptocurrency as an asset class continues to grow.\n\nBoth Bitcoin and Ethereum are readily accessible to all types of investors, ranging from retail to institutional investors. In addition, most cryptocurrency exchanges have very low minimums, so it’s possible to get started with very small investments. For example, you can easily buy $100 worth of Bitcoin if you wish to do so.\n\nSo far, institutional investors have been more comfortable with investing in Bitcoin than in Ethereum. For example, we’ve seen quite a few publicly-traded companies invest part of their treasuries into Bitcoin.\n\nThis includes the likes of Tesla, Block, MicroStrategy and Nexon. Meanwhile, we have seen much fewer examples of publicly-traded companies buying and holding Ethereum. One of the reasons for this is simply that Bitcoin has a longer track record than Ethereum, as it was launched in early 2009. Meanwhile the Ethereum mainnet went live in July of 2015.\n\nIn the United States, investors have access to Bitcoin futures ETFs, which makes investing in Bitcoin easily accessible to traditional investors that prefer well-established products like ETFs. There’s currently no Ethereum ETFs in the United States.\n\nIn other markets, for example Europe, it is also possible to find exchange-traded products that provide exposure to Ethereum. For example, CoinShares offers the CoinShares Physical Ethereum ETP, and 21Shares offers the 21Shares Ethereum Staking ETP.\n\nDecentralization\n\nBoth Bitcoin and Ethereum are permissionless, which means that anyone is able to join the networks and help process transactions without requiring any special permissions.\n\nAccording to Bitcoin node data aggregator Bitnodes, there’s about 17,100 active nodes on the Bitcoin network at the time of writing. The location of 61% of nodes is unknown. Among the nodes with known locations, the United States comes in first with a share of about 10%. Germany (7.9%) and France (2.9%) are in second and third place, respectively.\n\nAccording to the Ethereum blockchain tracker Etherscan, there’s about 9,200 active nodes on the Ethereum network at the time of writing this article. 49.3% of active Ethereum nodes are located in the United States, with Germany coming second with a 17.7% share and Japan ranking third with a 2.7% share.\n\nGenerally, both Bitcoin and Ethereum are considered as strongly decentralized networks that are resilient to attempts of censorship and manipulation. However, there’s also a few concerns that are worth highlighting.\n\nThe main criticism regarding Bitcoin’s decentralization is related to the amount of hashrate controlled by the biggest Bitcoin mining pools.\n\nAt the time of writing, the Foundry USA mining pool controls 33.6% of the Bitcoin hashrate, while AntPool controls 22.1%. The third largest pool, F2Pool, has a 14.6% share of the hashrate. So, the three largest Bitcoin mining pools combine for around 70% of the Bitcoin network’s hashrate.\n\nDistribution of Bitcoin hashrate. Image source: BTC.com\n\nAs for Ethereum, the main concern regarding its decentralization has been RPC (Remote Procedure Call) providers, which are typically centralized companies. RPC services allow decentralized applications to access data from the blockchain.\n\nIf many decentralized applications use the same RPC provider, issues with the provider can make it difficult for regular users to access them. For example, the Ethereum ecosystem has been the subject of criticism for its alleged over-reliance on the RPC service provider Infura.\n\nTransaction fees\n\nIn terms of transaction fees, both Bitcoin and Ethereum are not exactly cheap to use. However, Ethereum transaction fees have largely been higher than Bitcoin transaction fees in the past few years.\n\nThis is because Ethereum has been seeing more demand for transactions than Bitcoin. One of the main reasons for this is that there’s simply more to do on Ethereum. While Bitcoin only enables simple peer-to-peer transactions, Ethereum also supports smart contracts and more complex uses like decentralized exchanges and NFTs. The Ethereum network is also used to transact with tokens other than ETH.\n\nSo far in 2023, the typical range for the number of daily transactions on the Ethereum network has been 850,000 on the low end and close to 1.2 million on the high end. In the same period, the Bitcoin network has been processing roughly 230,000 daily transactions on the low end and 420,000 daily transactions on the high end.\n\nBitcoin is currently better than Ethereum in terms of transaction fees, but neither of them are especially impressive in this area. If you want to regularly use Bitcoin or Ethereum but want to pay less in transaction fees, consider exploring the following solutions:\n\nBitcoin: The Lightning Network layer 2 solution provides much cheaper and faster BTC transactions\n\nEthereum: Layer 2 solutions like Arbitrum and Optimism enable much more efficient transactions\n\nLegal status\n\nIn the United States, Bitcoin has the advantage of almost universally being treated as a commodity. This simplifies the process of investing in Bitcoin and selling it in a compliant manner.\n\nEthereum has also generally been viewed as a commodity in the United States, although its designation is not quite as clear as Bitcoin’s. This is because Ethereum was launched through an initial coin offering (ICO) where investors provided funds for Ethereum’s development in exchange for a future allocation of ETH before the Ethereum network itself was released.\n\nSo, there is some controversy about whether Ethereum should be treated as a commodity or as a security. If Ethereum were to be legally designated as a security, it would likely become more complicated to invest in it and offer Ethereum trading services in a compliant manner.\n\nMeanwhile, Satoshi Nakamoto released the Bitcoin software in 2009, and anyone was free to download it and earn BTC coins through crypto mining. Since there was nothing in the process of the release of Bitcoin that could be considered an investment contract, almost nobody views Bitcoin as a security and it is instead considered a commodity.\n\nStill, Bitcoin could be subject to regulatory pressure from another perspective, as the Proof-of-Work system used by the Bitcoin network is often criticized for its high energy consumption.\n\nThe bottom line — Both Bitcoin and Ethereum are great choices for crypto investors\n\nHopefully, our comparison of Ethereum vs. Bitcoin has helped you understand the differences between the two largest cryptocurrencies. Ethereum is more flexible than Bitcoin when it comes to the use cases it can support, while Bitcoin is more valuable overall and generally seen as a “safer” long-term bet due to its relative simplicity, predictable supply dynamics and longer track record.\n\nIf you are looking to invest in cryptocurrency, both Bitcoin and Ethereum are very solid options. In fact, it’s quite common for crypto investors to have both BTC and ETH in their portfolio."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vYmxvY2tvbm9taS5jb20vcGVwZS1vdGhlci1tZW1lY29pbi1oeXBlLXNlbmRzLWV0aGVyZXVtLWdhcy1mZWVzLXRocm91Z2gtdGhlLXJvb2Yv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Pepe & Other Memecoin Hype Sends Ethereum Gas Fees Through The Roof - Blockonomi",
        "content": "Ethereum gas fees soared in the past few days due to the frenzy surrounding meme-inspired cryptocurrencies. The popularity of these coins has led to the growing demand for transactions on the Ethereum network, resulting in higher fees.\n\nMemecoins made a remarkable comeback, with Pepe The Frog leading the way. Recently deployed memecoins, including $TROLL, $APED, and $BOBO, took over top gas-burning altcoins, per market analysis platform Sentiment.\n\nMemecoins go Crazy\n\nData indicates that Ethereum’s average gas price for transactions on April 20 has spiked to 81.94 gwei (gwei serves as a unit of measurement for Ether – 1 gwei equals 10-9 ETH). It marks a significant increase from 60.82 gwei on April 19 and 44.42 gwei during the same period last year.\n\nEthereum educator Anthony Sassano highlighted the staggering surge in daily fee revenue on the Ethereum network in his recent post. According to Sassano, the remarkable success of Ethereum’s layer-2 platforms, notably Arbitrum, outperformed the BTC network.\n\nThe revenue surge has been attributed mainly to the ongoing meme frenzy gripping cryptocurrency markets. The observations also highlighted the growing dominance of Ethereum in the ever-evolving crypto landscape.\n\nDespite the high fees, users persist in utilizing these networks. This suggests that these networks’ benefits and opportunities outweigh the financial costs.\n\nA Small Market\n\nWhile some analysts view this as an indicator of its growing usability, critics have raised concerns, pointing out that the extensive usage being touted is primarily limited to a few thousand users gambling on memecoins.\n\nAnother factor is the increased activity of a Maximal Extractable Value (MEV) trading bot known as “jaredfromsubway.eth”. This bot has been front-running memecoin trades significantly, spending a remarkable 455 ETH (equivalent to $885,000) and utilizing 7% of the total gas on the network in the past 24 hours.\n\nEthereum gas fees have been the topic of discussion within the Ethereum community. High gas fees can make using the network expensive for certain activities, such as small transactions or interacting with low-value smart contracts.\n\nOngoing efforts are to improve Ethereum’s scalability and reduce gas fees, including Layer-2 scaling solutions and other optimization techniques to make the network more efficient and cost-effective for users.\n\nZk-Rollups Making Waves\n\nButerin highlighted during the ETHSeoul event last year that the fundamental advantages of Zero-knowledge Rollup technology are expected to position them as the superior choice for Ethereum layer 2 scaling solutions.\n\nLayer 2 scaling solutions for Ethereum have been experiencing impressive growth recently. These solutions are essential for increasing transaction processing capacity, reducing network congestion, and improving the user experience on Ethereum.\n\nBundling multiple transactions into one transaction through layer 2 solutions can significantly reduce gas fees, making it more accessible for users to interact with the network.\n\nThe combined growth of Zk-rollups and the maturity of Ethereum has the potential to create a robust future.\n\nHowever, after successfully completing the Shanghai upgrade, Ethereum now faces an uncertain short-term future as ETH stakers seek alternative avenues to deploy their recently withdrawn holdings, which raises concerns about the potential detrimental impact on the price of ETH.\n\nNevertheless, Ethereum remains the top secure and decentralized ecosystem in the blockchain space, with over 3500 different decentralized applications (DApps) and a vibrant and creative developer community, making it a favored choice for developing high-quality projects.\n\nEthereum has also outlined several upcoming upgrades and improvements in its roadmap, with the next major hard fork being sharding.\n\nSharding aims to increase the network’s throughput directly without relying on layer 2 solutions and is expected to be a significant milestone in the evolution of Ethereum. It will enable the network to handle much larger transactions than it currently can, further enhancing its scalability and potential for future growth.\n\nThe future for Ethereum looks great – memecoins, on the other hand, are a very murky market."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZmluYm9sZC5jb20vZXhwZXJ0LXByZWRpY3RzLW1ham9yLXB1bGxiYWNrLWZvci1iaXRjb2luLWFuZC1ldGhlcmV1bS1hcy11cy1yZWNlc3Npb24tbG9vbXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Expert predicts major pullback for Bitcoin and Ethereum as US recession looms - Finbold - Finance in Bold",
        "content": "Bitcoin (BTC) and Ethereum (ETH) could be facing resistance at key round number levels of $30,000 and $2,000, with the potential for a stock market downturn with the Federal Reserve tightening into a recession that could affect all risk assets.\n\nBitcoin and Ethereum have had a pivotal status since 2020, with definable diminishing supply and low but increasing adoption making a strong case for long-term bullishness.\n\nOn April 21, Bloomberg senior commodity strategist Mike McGlone stated that the yield curve’s highest probability since 1982 suggests a growing consensus that the worst of a US recession may be over. However, this could potentially lead to large pullback risks, according to McGlone.\n\nMcGlone tweeted: “Bitcoin and Ethereum — may be running into a wall of resistance at the key round number levels of $30,000 and $2,000. Our bias is bullish in the long term for the top cryptos, but an overwhelming force of the stock market going down with the Fed tightening into a recession has the potential to lower the tide for all risk assets, and Bitcoin and Ethereum are among the riskiest.”\n\nBitcoin and Ethereum are among high-risk assets. Source: Mike McGlone\n\nBitcoin and Ethereum\n\nThe future of Bitcoin and Ethereum is closely tied to technological advancements and increasing adoption. Many experts believe that these cryptocurrencies will continue to gain mainstream acceptance as more businesses and individuals recognize the benefits of decentralized financial systems.\n\nSince the turn of the year, Bitcoin has experienced a notable increase of approximately 70%, while Ethereum has climbed just above 60%. Interestingly, a recent historical pattern has emerged as the value of Bitcoin has again reached 15 ETH after six years.\n\nDespite the impressive performance of these digital assets and surpassing key price levels of $30,000 and $2,000 in April, both have experienced significant pullbacks in the last week. At present, Bitcoin is trading at $28,077, down 1.88% on the day and 8.91% over the previous week. Meanwhile, Ethereum, the second-largest asset by market cap, is currently trading at $1,908, down 1.75% in the last 24 hours and 9.86% in the last week.\n\nWhile Bitcoin and Ethereum’s recent pullbacks may cause temporary concern, their overall upward trend and potential for long-term growth remain. Investors should remain vigilant of potential downside risks, especially in light of broader market conditions.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZGVjcnlwdC5jby8xMzczNTMvZXRoZXJldW0tc3Rha2luZy1wcm92aWRlci1wMnAtb3JnLXJhaXNlcy0yM20tc2VyaWVzLWHSAVVodHRwczovL2RlY3J5cHQuY28vMTM3MzUzL2V0aGVyZXVtLXN0YWtpbmctcHJvdmlkZXItcDJwLW9yZy1yYWlzZXMtMjNtLXNlcmllcy1hP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Staking Provider P2P.org Raises $23M Series A - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nNon-custodial staking provider P2P.org has raised $23 million in Series A funding from investors, including Jump Crypto, Bybit, and Sygnum.\n\nFounded in 2018, P2P.org provides staking infrastructure for Ethereum and 49 other blockchain programs, including Cardano and Cosmos. The company's institutional staking solutions, including white label nodes and slashing insurance, have been used to stake more than $1.3 billion worth of assets, according to a press release. It plans to use the newly raised funds to expand its portfolio to include more chains in the Ethereum space, including Celestia, Sui, and Aleo.\n\nP2P.org also plans to expand its business model, focusing on building a stronger community, enhancing consumer support, improving customer experience, and elevating current infrastructure, according to a press release.\n\nAD\n\nAD\n\nP2P.org credits the successful round of funding to the recent Shanghai Upgrade, which it hopes will increase institutional interest in staking Ethereum. Institutional interest in staking on Ethereum has historically been lower compared to other blockchains, according to Konstantin Lomashuk, founder of P2P.org. But the upgrade has already resulted in increased staking of Ethereum across the board.\n\nThough Ethereum is seeing more inflows, digital assets firm CoinShares reported institutional investors are still prioritizing investments in Bitcoin. More than $104 million was reported in Bitcoin inflows as of Monday. As of Thursday morning, Bitcoin is trading for $28,650.40, down 2% in the past 24 hours, according to CoinGecko.\n\n“We are pleased to announce this fundraising round with our strategic investors,” Lomashuk said. “Now that the upgrade is complete and as the market continues to expand, we may expect ETH staking to grow significantly in market size.”\n\nSaurabh Sharma, Head of Investments at Jump Crypto, is optimistic about the opportunity. “We are excited to participate in this funding round and continue to leverage their cross-chain expertise,” Sharma said.\n\nBill Xing, Head of Financial Product of Bybit, said in the release that he thinks the P2P.org will enhance the mission of Web3, with the ultimate goal of putting control of the economy into people’s hands.\n\nAD\n\nAD\n\n“The third iteration of the internet was born with the promise of decentralization and democratization of finance,” he said. “We are proud to associate the Bybit name with P2P.org, the most trusted validator and infrastructure provider in the space. We look forward to elevating the space for believers in the digital economy together.”\n\nEthereum, at the time of writing, is trading at $1,841.33, down 2% in the past 24 hours, according to CoinGecko. This after Ethereum recently broke past $2,000 for the first time in months."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdS50b2RheS9jcnlwdG8tbWFya2V0cy1icmFjZS1mb3ItYml0Y29pbi1idGMtYW5kLWV0aGVyZXVtLWV0aC1vcHRpb25zLWV4cGlyedIBWGh0dHBzOi8vdS50b2RheS9jcnlwdG8tbWFya2V0cy1icmFjZS1mb3ItYml0Y29pbi1idGMtYW5kLWV0aGVyZXVtLWV0aC1vcHRpb25zLWV4cGlyeT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Crypto Markets Brace for Bitcoin (BTC) and Ethereum (ETH) Options Expiry - U.Today",
        "content": "The cryptocurrency market is preparing for a significant event as a considerable number of Bitcoin (BTC) and Ethereum (ETH) options are set to expire.\n\nAdvertisement\n\nAccording to data shared by Greeks.live on Twitter, 25,000 BTC options will expire with a put-call ratio of 0.7, a max pain point of $29,000, and a notional value of $0.72 billion.\n\nAdditionally, 217,000 ETH options will expire, featuring a put-call ratio of 0.83, a max pain point of $1,950, and a notional value of $0.42 billion.\n\nCrypto options, similar to traditional options, make it possible for investors to hedge their positions, speculate on price movements, or even generate income by selling options.\n\nOption expiries refer to the end of an option contract's life, at which point the option either gets exercised or becomes worthless.\n\nIn the context of the cryptocurrency market, an option is a financial instrument that provides traders the opportunity to buy or sell an underlying asset, such as Bitcoin or Ethereum , at a predetermined price before a specific expiration date.\n\nThe put-call ratio, meanwhile, is an indicator that measures the balance of put options (contracts that grant the right to sell) to call options (contracts that grant the right to buy) in the market. A high put-call ratio usually signals bearish sentiment, while a lower ratio implies bullish sentiment.\n\nThe max pain point, also known as the max pain level, is the point where option owners (buyers) feel the most financial pain, i.e., the price at which the greatest number of options will expire worthless."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1zdGFraW5nLXByb3ZpZGVyLXAycC1vcmctMTMwMTAyMDQ2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Staking Provider P2P.org Raises $23M Series A - Yahoo Finance",
        "content": "Non-custodial staking provider P2P.org has raised $23 million in Series A funding from investors, including Jump Crypto, Bybit, and Sygnum.\n\nFounded in 2018, P2P.org provides staking infrastructure for Ethereum and 49 other blockchain programs, including Cardano and Cosmos. The company's institutional staking solutions, including white label nodes and slashing insurance, have been used to stake more than $1.3 billion worth of assets, according to a press release. It plans to use the newly raised funds to expand its portfolio to include more chains in the Ethereum space, including Celestia, Sui, and Aleo.\n\nP2P.org also plans to expand its business model, focusing on building a stronger community, enhancing consumer support, improving customer experience, and elevating current infrastructure, according to a press release.\n\nEthereum Soars to 11-Month High Following Shanghai Upgrade\n\nP2P.org credits the successful round of funding to the recent Shanghai Upgrade, which it hopes will increase institutional interest in staking Ethereum. Institutional interest in staking on Ethereum has historically been lower compared to other blockchains, according to Konstantin Lomashuk, founder of P2P.org. But the upgrade has already resulted in increased staking of Ethereum across the board.\n\nThough Ethereum is seeing more inflows, digital assets firm CoinShares reported institutional investors are still prioritizing investments in Bitcoin. More than $104 million was reported in Bitcoin inflows as of Monday. As of Thursday morning, Bitcoin is trading for $28,650.40, down 2% in the past 24 hours, according to CoinGecko.\n\nBitcoin Fund Inflows Top $100M in One Week as Investors 'Flee to Safety'\n\n“We are pleased to announce this fundraising round with our strategic investors,” Lomashuk said. “Now that the upgrade is complete and as the market continues to expand, we may expect ETH staking to grow significantly in market size.”\n\nSaurabh Sharma, Head of Investments at Jump Crypto, is optimistic about the opportunity. “We are excited to participate in this funding round and continue to leverage their cross-chain expertise,” Sharma said.\n\nStory continues\n\nBill Xing, Head of Financial Product of Bybit, said in the release that he thinks the P2P.org will enhance the mission of Web3, with the ultimate goal of putting control of the economy into people’s hands.\n\n“The third iteration of the internet was born with the promise of decentralization and democratization of finance,” he said. “We are proud to associate the Bybit name with P2P.org, the most trusted validator and infrastructure provider in the space. We look forward to elevating the space for believers in the digital economy together.”\n\nEthereum, at the time of writing, is trading at $1,841.33, down 2% in the past 24 hours, according to CoinGecko. This after Ethereum recently broke past $2,000 for the first time in months."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS9ldGhlcmV1bS1zdGFraW5nLW91dGZsb3dzLTEzLWJuLWFmdGVyLXNoYXBlbGxhLXVwZ3JhZGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Ethereum staking outflows hit $1.3bn one week after Shapella upgrade - DLNews",
        "content": "Staked Ether levels have dropped by $1.3 billion over the past week after the blockchain’s upgrade dubbed Shapella enabled withdrawals.\n\nInvestors withdrew 1.36 million Ether valued at around $2.6 billion and deposited only 714,290 Ether worth $1.4 billion in the week after Shapella went live — a net outflow of 647,050 coins, according to data from TokenUnlocks.\n\nWhile some analysts had anticipated the upgrade would trigger a sell-off after the upgrade led to more tokens in the market, its price has remained relatively stable.\n\nSince the commencement of withdrawals last week, the second-largest cryptocurrency has seen a moderate price increase of approximately 1.5%, currently trading around $1,970.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\n“ETH often has more than $10 billion of trading volume on a single day,” Patrick Scott, a crypto analyst, told DL News. “The outflows are likely less consequential than normal crypto market volatility.”\n\nREAD NOW: Fallen crypto king Do Kwon slapped with fake passport charge in Montenegro\n\nThe withdrawals from Ethereum’s staking contract are likely far from over.\n\nIn order to keep Ethereum secure, the network limits the number of withdrawals that can take place concurrently. This means those who wish to withdraw their Ether must enter a withdrawal queue.\n\nJoin the community to get our latest stories and updates\n\nBased on the amount of Ether currently in line for full withdrawals, those entering the queue now will need to wait over two weeks before receiving their Ether.\n\nData from crypto analytics platform Nansen shows that 741,750 Ether, worth approximately $1.4 billion, is currently queued for full withdrawal. Of this amount, 68% of withdrawals are due to come from Coinbase, Binance and Kraken — the top three centralised exchanges that stake Ether on behalf of their customers.\n\nAlthough stakers are in the process of withdrawing billions of Ether, the outflows may not be leaving the market altogether. Data from DefiLlama highlights significant inflows into so-called liquid staking services such as Lido, Rocket Pool, and StakeWise.\n\nREAD NOW: ‘Sandwich bots’ filch millions off unwitting investors during meme coin rally\n\nThese decentralised protocols allow users to stake Ether and receive staking tokens – like token receipts – in return, such as stETH for Lido and rETH for Rocket Pool. Staking tokens often trade close to the price of Ether, but they aren’t pegged – fixed to the price of Ether – by design.\n\nLido, the leading liquid staking derivative provider, has experienced a surge in the amount of Ether staked via its protocol, with a notable 2.2% increase over the past week. This uptick is equivalent to roughly 120,000 additional Ether worth about $236 million, demonstrating a significant shift in investor sentiment towards liquid staking services.\n\nElsewhere Rocket Pool, the third-biggest liquid staking token provider, registered an inflow of about 7%. Two smaller liquid staking protocols — ether.fi and Frax Ether — have also seen gains of about 21% and 14%, respectively, in the same period.\n\nHowever, cbETH, or Coinbase Wrapped Staked ETH, the only liquid staking token issued by a centralised exchange, saw its supply decrease 2.7% in the same period.\n\nIn recent months, liquid staking services have garnered significant popularity, largely due to their ability to allow stakers to employ their staking tokens – and consequently, the staked Ether by extension – across various other DeFi protocols.\n\nSeveral DeFi lending protocols including Aave accept these tokens as collateral to issue cryptocurrency loans."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vbmZ0bm93LmNvbS9ndWlkZXMvY29tcGxldGUtc2ltcGxlLWd1aWRlLXRvLXRvcC1uZnQtYmxvY2tjaGFpbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "NFT Blockchains Abound. Here's a Guide to Web3's Best. - nft now",
        "content": "When it comes to NFTs, the Ethereum blockchain is king. Considered by many to be the one-stop shop for NFTs, over the past year, it has quickly become the most talked about — and at times the most trafficked — blockchain in existence.\n\nYet, numerous other blockchains have grown in popularity within the NFT space. Considering the high transaction costs and environmental impact that the Ethereum blockchain presents, crypto-artists and NFT enthusiasts have continued to seek out new places to mint and trade NFTs.\n\nBut there are several crucial factors to consider when choosing what blockchain to mint on. Some of the most important points are network size, creator costs, consumer spending habits, security, and community input. So to provide a bit of clarity to the widespread and fast-paced world of Web3 tech, we’ve created a high-level summary of blockchains for NFTs.\n\nWhich blockchains support NFTs\n\nEthereum\n\nDespite mounting competition, Ethereum remains the most popular NFT blockchain. The reasons are abundant: as a highly decentralized blockchain, it provides all the financial and legal services one typically needs for transactions without requiring intermediaries. It also houses some of the most popular NFT marketplaces (OpenSea), NFT projects (CryptoPunks and the Bored Ape Yacht Club), and NFT artists (Pak and Beeple).\n\nCredit: Dennis Diatel Photography/istock\n\nUntil recently, Ethereum required an exorbitant amount of energy to operate since it relied on a Proof-of-Work (PoW) consensus mechanism. Consensus mechanisms are the systems that allow a blockchain to operate in a decentralized manner, but in light of PoW’s notoriously energy-intensive operations, it uses cryptographic computations to validate transactions in the network. That’s one of the reasons why, on September 15, 2022, Ethereum switched to a consensus mechanism known as proof-of-stake (PoS) in an event called the merge. The blockchain’s energy needs plummeted by 99.5 percent as a result, and it now consumes less energy than even a simple Web2 platform like PayPal.\n\nWhile some debate remains about how secure the new PoS system is compared to PoW, Ethereum is still considered a safe blockchain to use, with the merge opening the door for future upgrades that the Ethereum Foundation claims will further increase its security. Considering its popularity, security, decentralization, and ease of use, you should consider this blockchain first when deciding where to mint.\n\nSolana\n\nFounded in 2017 by Anatoly Yakovenko, Solana was built to solve the high costs and slow transaction speeds common in blockchains like Ethereum and Bitcoin. When it arrived on the scene, blockchains were severely limited in their processing capabilities and could only handle roughly 15 transactions per second (TPS).\n\nSolana’s TPS now surpasses that of Visa, and even rivals Mastercard’s, earning it a firm spot as an industry leader regarding speed and scalability. The blockchain’s transaction fees are also quite low, making the network increasingly popular and one of the fastest-growing ecosystems in crypto. As of writing, SOL’s market cap was more than $10 billion.\n\nSolana is also one of the fastest programmable blockchains in the crypto space. Its unique combination of proof-of-history (PoH) and proof-of-stake (PoS) consensus mechanisms remove the need for the complex cryptographic puzzles that power PoW mechanisms. PoH is a computational process that can cryptographically verify the passing of time between two events in the blockchain, which reduces validation times and fees. In terms of the Solana blockchain, it’s used to ensure that transactions are in the right order and found by the correct leader (validator).\n\nLike Ethereum, Solana’s PoS system enables users to stake an amount of cryptocurrency for the chance to be randomly chosen as a block validator. Validators earn crypto (in this case, Solana’s native token, SOL) when they are selected. This incentivizes users to become stakers and rewards them for doing so. Thanks to Solana’s PoS and PoH mechanisms, its transaction fees and times are about as low as possible. However, while some major NFT marketplaces like Magic Eden operate on Solana, the chain isn’t as widely used as Ethereum, meaning there are both fewer marketplaces and people trading on the blockchain.\n\nTezos\n\nFounded in 2017 by Kathleen and Arthur Breitman, Tezos is an open-source platform for assets and applications. Like other blockchains, it enables the creation of smart contracts and the building of decentralized applications (dApps). Tezos’ native token is XTZ. While the chain is popular with regard to NFTs, its crypto ranks around 40th in terms of market cap. But Tezos’ selling point has always been innovation, not market dominance.\n\nCredit: Rodion-Kutsaev\n\nOne of the things that makes the Tezos blockchain unique is its ability to self-amend. This means it can improve itself over time via a formalized protocol upgrade process. Coupled with the fact that Tezos has long incentivized developers to build dApps on the platform, the chain is seen as a major leader in operability.\n\nSimilar to Solana and Ethereum, Tezos uses a PoS consensus mechanism to help reduce the computational work needed to verify blocks and transactions on the blockchain. Additionally, its transaction fees are lower than Ethereum’s (but more than Solana’s).\n\nOne of the first marketplaces on the blockchain, Hic et Nunc, was heralded as an economic alternative to Ethereum-centric marketplaces — until the platform shut down on November 14, 2021.\n\nTezos is a great place to start for those looking to mint batches of NFTs or large-scale collections. Currently, Objkt is the largest and most popular marketplace on the Tezos chain.\n\nFlow\n\nFlow is a high-performance blockchain designed specifically for creating NFTs, games, and decentralized apps (dApps). In stark contrast to general-purpose blockchains like Ethereum, Flow is built with scalability in mind, meaning billions of people could potentially interact with NFTs on the blockchain.\n\nOriginally launched in 2019, Flow quickly rose to prominence as the blockchain partner of the NBA. A product of Dapper Labs (the team behind legacy project CryptoKitties), Flow facilitated the launch and is the host of NBA Top Shot, making the blockchain an integral component in the popularization of non-fungible tokens.\n\nLike Tezos, Flow uses a solely PoS consensus mechanism to verify transactions. Because of this, the blockchain can handle a higher amount of TPS than Ethereum, with Flow developers stating that the chain has sustainably allowed for “a throughput of significantly more than 100 TPS,” though they don’t specify an exact number.\n\nAside from Blocktobay (a popular Flow-native NFT marketplace), Flow NFTs are tradeable via OpenSea, Rarible, Foundation, and many other platforms. Flow has become a popular place for sporting NFTs, as organizations like the NBA, NFL, UFC, and more have launched their own marketplaces on the blockchain. Yet, similar to Solana, Flow isn’t as widely used as Ethereum, resulting in fewer NFT marketplaces and fewer people trading on the blockchain.\n\nWorldwide Asset Exchange (WAX)\n\nThe Worldwide Asset Exchange (WAX) has become a network of choice for digital collectibles and virtual items. As historic NFT sales and viral collections on Ethereum, Tezos, and Solana made headlines over the years, WAX has built a reputation for being a home for Web3 gaming.\n\nCredit: WAX\n\nWAX was founded in 2017 by crypto pioneers William Quigley and Jonathan Yantis. The chain is based in the Cayman Islands and aims to embody a mission of global accessibility. WAX gives its users access to thousands of dApps and a range of NFT marketplaces. WAX is also home to several top blockchain games, including Alien Worlds, Farmer’s World, and Prospectors. Its prominence in blockchain gaming means the biggest projects on the chain hail from the play-to-earn sector.\n\nSimilar to other high-efficiency blockchains, Wax employs a PoS mechanism but also creates carbon offset NFTs and partners with Climate Care as part of a mission for sustainability. Similar to Flow, transaction fees are significantly low, and as a unique incentive to collectors, network fees on WAX are redistributed to the WAX community.\n\nWAX marketplaces also play host to a broad variety of influential brands, including baseball collectibles company Topps, racing giant NASCAR, toy company Hot Wheels, and even a few cult classic film franchises like Godzilla, The Princess Bride, and Spiderman.\n\nBinance Chain (BNB)\n\nFormerly two separate chains — Binance Smart Chain (BSC) and Binance Chain — Binance rebranded to BNB Chain in February 2022 to foster innovation in the network and move toward greater decentralization.\n\nOne of the more highly centralized chains, with several of the chain’s PoS validators reportedly holding direct ties to the Binance Crypto Exchange, the network is still a good balance between low fees and high-speed transactions. One of the reasons for this is that BNB Chain uses a consensus model called Proof-of-Staked-Authority (PoSA), which can support a short block time and low fees. Yet, the validators running transactions take turns to produce blocks — with the 21 validators needed to run the exchange switching out every 24 hours. According to some reports, 11 validators of the 21 control the Binance Chain and are all directly connected to the Binance Crypto Exchange.\n\nWhile centralization is a turn-off to many within the crypto and NFT ecosystem, the BSC NFT market did begin to pick up some speed towards the end of 2021. While centralization is a turn-off to many within the crypto and NFT ecosystem (its team recently paused the entire network after a $100-million hack, for example), the chain hosts some increasingly popular NFT marketplaces like Element, Mobox, and PancakeSwap, although the ecosystem is undoubtedly not even close to being as robust as Ethereum’s.\n\nBitcoin\n\nThat’s right; the Bitcoin blockchain hosts NFTs now. While Bitcoin was famous for its singular focus on hosting transactions for its eponymous cryptocurrency (and for its decidedly anti-NFT community), that all changed on January 21, 2023. That’s when software engineer Casey Rodarmor launched the Bitcoin Ordinals protocol. This upgrade has caused a massive uproar amongst Bitcoin diehards (also known as Bitcoin “maxis”) and in the broader NFT ecosystem.\n\nOrdinals are made possible because Bitcoins are composed of tiny units called satoshis (sats). Rodarmor’s new protocol allowed Bitcoin node operators to inscribe those units with data, even visual data, creating something that is effectively a fully on-chain NFT.\n\nCredit: istock\n\nBecause of the nature of the protocol, these Inscriptions come chronologically numbered. As word of Bitcoin NFTs spread throughout the Web3 community, Ordinals with lower Inscription numbers (and thus higher historical significance) became more valuable and sought after. Ordinals regularly change hands for prices in the 40-50 BTC ($1 million) range.\n\nBecause Bitcoin isn’t set up to easily conduct NFT transactions, however, interested buyers have had to go through a rather cumbersome, obtuse, and over-the-counter process to obtain them. This is slowly changing, however, with Web3 builders releasing Bitcoin Ordinals wallets in the weeks and months following the protocol’s release.\n\nThe entire development has stirred up the Web3 ecosystem in big ways, and the rush to inscribe and obtain Ordinals continues. The number of Ordinals Inscriptions recently passed the one million mark, and even Yuga Labs, the creators of Bored Ape Yacht Club, have gotten in on the action, minting a 300-piece collection on the blockchain on March 5, 2023.\n\nIf you’re new to NFTs, Bitcoin probably isn’t the best place to start learning (for the time being). However, if you’re interested in being at the frontier of NFT development, it could be just the place for you. Just make sure you do your research and know the risks before engaging with anything. Bitcoin is another proof-of-work blockchain, meaning its environmental impact does leave something to be desired."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzIxL2V0aGVyLWVyYXNlcy1hbGwtZ2FpbnMtZnJvbS1zaGFuZ2hhaS1yYWxseS1hcy1iaXRjb2luLWNyeXB0by1wcmljZXMtZmFsbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Ether Erases All Gains From Shanghai Rally as Bitcoin, Other Crypto Prices Also Fall - CoinDesk",
        "content": "ETH’s steady decline since Tuesday has come amid a wider price slump. Bitcoin was recently trading as low as about $27,200, down more than 3% over the past 24 hours and has tumbled more than 10% from a high Tuesday comfortably above $30,000."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL21lbWUtc2Vhc29uLWJsYW1lZC1mb3ItanVtcC1pbi1ldGhlcmV1bS1ldGgtZ2FzLWZlZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Meme season blamed for jump in Ethereum (ETH) gas fees - CryptoSlate",
        "content": "Ethereum (ETH) gas fees jumped to a 10-month high — prompted by a surge in meme coin mania.\n\nPer Glassnode, the median Ethereum gas price over a seven-day moving average (7DMA) reached 43.641 gwei — a price last seen on June 30, 2022.\n\nGwei is a denomination of ETH — with 1,000,000,000 gwei equaling 1 ETH, or 1 gwei equaling 0.000000001 ETH.\n\nOver the past year, the median gas price over a 7DMA peaked at 150 gwei in May 2022 but dropped sharply by July 2022. It then gradually stabilized around the 20 gwei mark going into September 2022, when the Merge rolled out.\n\nEthereum gas fees\n\nThe cost of using Ethereum has been a point of contention since the “DeFi Summer” of 2020 — when the average gas price reached as high as 700 gwei.\n\nThis period saw network activity surge as yield protocols, such as Curve, Compound, and Yearn, began taking off — triggering mania from the demand to farm unreal gains.\n\nEthereum’s architecture is such that high gas fees come about when network traffic and the demand for transaction verification is high.\n\nWhile some assumed the Merge and the switch to Proof-of-Stake (PoS) consensus would tackle this problem, it was confirmed that gas fees remain primarily driven by the demand for blocks and the network’s capacity to meet that demand — not the consensus mechanism used.\n\nRecently, Ethereum network activity has skyrocketed with a wave of newly released meme coins — some of which netted early investors gains in the thousands of percent.\n\nMeme coins are back\n\nPEPE is one such meme coin, which has risen to become the sixth largest by market cap at $89.1 million in a few days.\n\nPEPE reached a local top of $0.000000391704 on April 20 and has been trending downwards since.\n\nThe success of PEPE has spurred social media chatter on which meme coin is next to spike. For example, a tweet from @liquiditygoblin said meme season is back — tagging “$PEPE, $WOJAK, $COPE.”\n\nDespite the mania surrounding meme coins, @ManLyNFT warned that, while they can be fun, they are also high risk.\n\nFeatured Data Partner\n\nMentioned in this article"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmNjbi5jb20vdXRydXN0LXBhcnRuZXJzLXdpdGgtZXRoZXJldW0tY2xhc3NpYy1kZXYtdGVhbS1pbnRlZ3JhdGluZy1ldGMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "UTRUST Partners With Ethereum Classic Dev Team, Integrating ETC - CCN.com",
        "content": "This is a paid-for submitted press release. CCN does not endorse, nor is responsible for any material included below and isn’t responsible for any damages or losses connected with any products or services mentioned in the press release. CCN urges readers to conduct their own research with due diligence into the company, product or service mentioned in the press release.\n\nZurich, Switzerland, September 21st, 2018 – Cryptocurrency payment solution UTRUST has announced that it has secured a partnership with Ethereum Classic Dev Team , signing a Memorandum of Understanding (MoU). ETCDEV will collaborate with UTRUST to integrate ETC into the UTRUST platform, with the assistance from the Ethereum Classic Cooperative .\n\nThe partnership between ETCDEV and UTRUST comes at a time when demand for ETC is rising rapidly, due to the recent integration of ETC by Coinbase, the world’s largest cryptocurrency brokerage, wallet, and custodian.\n\nAdditionally, the decision of the US Securities and Exchange Commission (SEC) to declare Bitcoin and Ethereum as non-securities, cleared Ethereum Classic from potentially being considered a security. As such, merchants can freely accept ETC as an alternative payment method to fiat and consumers can use it knowing that the utilization of ETC cannot be considered as an act of illegally distributing securities.\n\n“Ethereum Classic is one of a select few cryptocurrencies, along with Bitcoin and Ethereum, with clear institutional demand,”\n\nsaid Nuno Correia, CEO, and co-founder of UTRUST.\n\nEarlier this year, Grayscale Investments, the $2 billion investment arm of Digital Currency Group, launched Ethereum Classic Investment Trust, enabling retail traders and institutions in the regulated US market to invest in Ethereum Classic. With it, Grayscale Investments allocated $90 million into ETC, demonstrating confidence in the long-term adoption rate of ETC as a leading cryptocurrency.\n\nRelatedNews\n\nCorreia added, “While blockchain payments have undoubtedly disrupted financial transactions, at UTRUST we believe it’s our responsibility to add a much-needed layer of consumer protection, as well as instant transactions and low fees, for anyone who wants to utilize Ethereum Classic for payments.”"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmZvcmJlc2luZGlhLmNvbS9hcnRpY2xlL2NyeXB0b2N1cnJlbmN5L2V0aGVyZXVtLW5hbWUtc2VydmljZS1pbmNsdWRlcy1maWF0LXBheW1lbnQtb3B0aW9ucy1mb3ItaXRzLXByb3RvY29sLzg0NTM1LzHSAYMBaHR0cHM6Ly93d3cuZm9yYmVzaW5kaWEuY29tL2FtcC9hcnRpY2xlL2NyeXB0b2N1cnJlbmN5L2V0aGVyZXVtLW5hbWUtc2VydmljZS1pbmNsdWRlcy1maWF0LXBheW1lbnQtb3B0aW9ucy1mb3ItaXRzLXByb3RvY29sLzg0NTM1LzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Name Service includes fiat payment options for its protocol - Forbes India",
        "content": "Image: Shutterstock\n\nUsers and proponents of the blockchain space are in for an improved experience when registering for domain names in the Ethereum Name Service (ENS) protocol. A range of options, including Google Pay, Apple Pay, and other debit and credit cards, can be used now for .eth domains. The process used to require payments through Ethereum earlier. Many users then considered it a barrier, as they had to use their crypto wallets for the registrations.The web3 payment gateway, MoonPay, would be used from now on by users for payments while it has been integrated with the Ethereum Name Service website. On top of this, ENS has also launched version 3 of its user interface for a better experience while signing up on the platform. Users had to go through multiple transaction approvals before while using crypto wallets.Nick Johnson, the founder of Ethereum Name Service, has said the move could simplify blockchain for beginners and make it easier for them to obtain digital identities. He stated, “This allows us to reach those who are either just entering the space or who are not yet comfortable with transacting and would prefer to use the currency and payment form they understand best.”Bree Blazak, Vice President at MoonPay, also welcomed the initiative and claimed how the partnership with Ethereum Name Service could make registrations simple with common payment methods. The payment experience for beginners to the domain would, thus, be made simple.The platform upgrade of ENS is likely going to uplift the status of ENS as a provider of readable names for crypto wallets in place of complex numeric numbers, which are created by wallets, blockchain protocols and platforms. Users of ENS can also host censorship-resistant websites through names that can be linked to in-use common domain name services (DNS).With decentralized domain name service registrations increasing in the last couple of years, Ethereum Name Service has witnessed over 2.3 million names created through 550,000 unique addresses.Unstoppable Domains and Ethereum Name Service are two leaders in the crypto space who have been responsible for inducting users into the web3 world through decentralized identities."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luYmFzZS5jb20vaW5zdGl0dXRpb25hbC9yZXNlYXJjaC1pbnNpZ2h0cy9yZXNlYXJjaC93ZWVrbHktbWFya2V0LWNvbW1lbnRhcnkvbG93ZXItYnRjLXZzLWV0aC1jb3JyZWxhdGlvbi1hcHJpbC0yMS0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Lower BTC vs ETH correlation - Coinbase",
        "content": "Market View\n\nThe correlation between bitcoin and ether returns has been falling since mid-to-late March, around the time BTC started outperforming peers in earnest (against the backdrop of the US banking turmoil and the increased regulatory scrutiny of non-bitcoin digital assets). But the decline of that relationship has become more pronounced in the days following the Shanghai (Shapella) fork, reminiscent of a similar trend observed in September 2022 during the Merge (when Ethereum changed its consensus mechanism to proof-of-stake).\n\nBased on a 40-day rolling window (significant to a 85-90% confidence level), the correlation coefficient between daily bitcoin and ether returns dropped from 0.95 thirty days ago to 0.82 as of April 20, below a 12-month average of 0.90 and the January low of 0.85. (In January, the relationship between these assets was affected by the change in market conditions and technical supply constraints .) Note that the performances between these two digital assets have otherwise maintained a fairly stable and high correlation through 2022 into 2023 outside of the idiosyncratic deviations witnessed in September and January (see chart 1).\n\nChart 1. Correlations between BTC and ETH daily returns across 40d, 60d and 180d rolling windows\n\nThe relevance of this falling correlation for institutional investors is that it can affect quantitative strategies that rely on cross hedging one asset for the other (or using ETH as a hedge for less liquid altcoins). On the other hand, from a fundamental perspective, it supports diversification arguments in favor of holding both BTC and ETH. Following the Merge, a decrease in the observed correlation coefficient between ETH and BTC returns (from 0.95 to 0.75) lasted for around 47-50 days. Comparatively, the current period of attenuation has lasted for around 30 days, and we think it could continue for another two weeks given that the initial phase of ETH withdrawals is still ongoing.\n\nAs of April 20, we project that an additional 73k ETH could be unlocked in partial withdrawals and 822k ETH could be unlocked in full withdrawals (based on what is currently in the exit queue according to Nansen ). This could take around 15 days to process. Given that full withdrawals will begin to dominate the withdrawals queue imminently, the remaining variable is how much of these fully unstaked ETH could make their way back to the deposit queue. For now, we do not have enough data to make a reliable estimate. So far, the ratio of withdrawn principal and rewards to deposits has been 2:1 since the upgrade was activated."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NvY2lldGUtZ2VuZXJhbGVzLWNyeXB0by1hcm0tdG8tbGF1bmNoLWV1cm8tcGVnZ2VkLXN0YWJsZWNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "SG Forge taps Ethereum for euro stablecoin, \"CoinVertible\" - CryptoSlate",
        "content": "Forge — a regulated crypto arm of the French banking firm Societe Generale — is set to launch a new euro stablecoin called “CoinVertible” on the Ethereum blockchain.\n\nThe investment bank aims to bridge the gap between traditional capital markets and the digital assets ecosystem through the launch of the euro-pegged stablecoin, according to the official announcement.\n\nAccording to SG-Forge, the euro stablecoin — which will be traded under the ticker symbol EURCV — will be exclusive to investors who have undergone Societe Generale’s Know Your Customer (KYC) and Anti-Money Laundering procedures.\n\nAccording to Jean-Marc Stenger, CEO at Forge, stablecoins are a key element to increasing trust and confidence in the native crypto ecosystem. He added that:\n\n“This issuance is a major step in Societe Generale-FORGE’s roadmap to deliver innovative solutions to its clients, either real-money institutions and corporates or entities of the crypto industry, and to facilitate the emergence of new market infrastructures based on blockchain technology.”\n\nThe company also highlighted that stablecoins provide other advantages — such as enabling the implementation of fresh solutions for corporate treasury, cash management, and cash pooling activities.\n\nSG-Forge’s new Euro stablecoin to be listed on exchanges\n\nThe Euro stablecoin will be listed on exchanges and third-party platforms in the coming months.\n\nSG-Forge highlighted that the EUR CoinVertible adheres to significant market regulations, including CAST — an open-source framework for interoperability and securitization.\n\nThe company emphasized that they will guarantee the complete separation of the assets used to secure the stablecoin’s value from the issuer. Moreover, SG-Forge will furnish daily transparency reports and provide details about the collateral positions.\n\nIn September 2022, Societe Generale’s crypto division received authorization from France’s financial markets regulator — Autorité des Marchés Financiers (AMF) — to provide cryptocurrency trading and custody services."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zdWJ3YXktdGhlbWVkLXRyYWRpbmctYm90LW1ha2VzLW1pbGxpb25zLXVzaW5nLXNhbmR3aWNoLWF0dGFja3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Subway-themed trading bot makes millions using 'sandwich' attacks - Cointelegraph",
        "content": "An anonymous Maximal Extractable Value (MEV) bot operator has cashed in well over $1 million this week by executing “sandwich attacks” against buyers and sellers of two new meme coins.\n\nThe wallet address, linked to the Ethereum Name Service (ENS) domain “jaredfromsubway.eth,” made $950,000 from the sandwich attacks on April 18 and profited about $300,000 and $400,000 on April 17 and 19, respectively, according to an April 19 tweet from nonfungible token data platform Sealaunch.\n\nAfter closing the day of yesterday with a profit close to $1M, jaredfromsubway.eth MEV bot is already profiting close to $400K today pic.twitter.com/VxouxAc59s — sealaunch.xyz (@SeaLaunch_) April 19, 2023\n\nThe bot’s ENS domain is a likely tongue-in-cheek nod to the popular sandwich chain and its disgraced former spokesperson Jared Fogle.\n\nOver a 24-hour period between April 18 to 19, 7% of all Ethereum gas fees were spent by the MEV bot, Sealaunch explained in a separate post.\n\nA large proportion of the profits came from attacks on trading activity relating to two new meme coins, Pepe (PEPE) and Wojak (WOJAK), which has helped propel jaredfromsubway.eth to the become the largest gas guzzler over the last day and week, crypto researcher Matt Willemsen explained:\n\nWondering why gas is so damn high? ‍\n\n\n\njaredfromsubway.eth (lmao) is absolutely cleaning up by sandwich-attacking $PEPE and $WOJAK trading activity. They are #1 gas spender over the past day and week.\n\n\n\nMEV sandwich bots on Ethereum have made $100M+ since the weekend. https://t.co/qhxyxlac20 — Matt Willemsen (@matt_willemsen) April 19, 2023\n\nA sandwich attack occurs when an attacker “sandwiches” a victim’s transaction between their own two transactions in order to manipulate the price and profit from the user.\n\nThis is possible because the victim’s transaction is first sent to the mempool where it waits to be added to the next block. In the meantime, the attacker sets one transaction with a high gas fee — to ensure it is accepted first — and another transaction with a lower gas fee to ensure it is accepted after the victim's transaction.\n\nThe attacker profits by buying the victim’s token at a price cheaper than market value, then sells it within the same block — taking in the difference between the revenue from the transaction minus the gas fees.\n\nThe large profits pocketed by jaredfromsubway.eth came from nearly $1.2 million being spent on gas fees between April 18 and 19, according to data shared by Thomas Mattimore, head of platform at the Reserve Protocol.\n\nThe MEV bot operator has spent over $7 million in gas fees across 180,000 transactions, according to Sealaunch.\n\nWhile some are finding the humor in the MEV bot’s domain name and actions, not all are happy.\n\nRelated: Tether blacklists validator address that drained MEV bots for $25M\n\nOne analyst for on-chain analytics firm Glassnode questioned the “value” of the work jaredfromsubway.eth is providing to the world.\n\nOther Twitter users went one step further, expressing their hatred and frustration toward the MEV bot operator.\n\nwhen i see jaredfromsubway.eth on the shitcoin i just aped my entire networth into pic.twitter.com/heK4bnbikf — DRT (@pepeDRT) April 19, 2023\n\nAccording to MEV Blocker, MEV bots have extracted more than $1.38 billion from Ethereum users attempting to trade, provide liquidity and mint NFTs.\n\nSeveral MEV Block projects have been launched in recent months to help protect Ethereum users from sandwich attacks.\n\nMagazine: Magazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93b3JzdC1jb2RlLWktdmUtZXZlci1zZWVuLWV1cm8tc3RhYmxlY29pbi1mYWNlcy1jZW50cmFsaXphdGlvbi1jcml0aWNpc23SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "'Worst code I've ever seen': Euro stablecoin faces centralization criticism - Cointelegraph",
        "content": "Criticism has been leveled at a new euro-pegged stablecoin released in France due to a decision to restrict peer-to-peer transactions.\n\nFrench bank Societe Generale-Forge (SGF) released the Ethereum-based stablecoin called EUR CoinVertible (EURCV) on April 20, which is available to only qualified institutional clients.\n\nAccording to observers who reviewed its smart contract code, itsERC-20 transfers need to first be approved by a centralized registrar — presumably one controlled by the bank — before the transaction is processed.\n\nIn an April 20 tweet, pseudonymous smart contract engineer “alephv.eth” explained:\n\n“They coded it so they have to whitelist all users, process all user transfers, and even process your ERC20 approvals before they process your 'transferFrom' lmao.”\n\nShe further mocked the code in a separate post, stating it was a \"radical commitment to inefficiency in the name of regulation.\"\n\nNonfungible token project founder “foobar” tweeted to his over 127,000 followers on April 20 that it’s “the worst code I’ve ever seen” and described the stablecoin as a “laughing stock.”\n\nFrance launched a stablecoin on Ethereum and it's the worst code I've ever seen\n\n\n\nEvery ERC20 single transfer has to be approved in a separate eth tx submitted by a centralized registrar\n\n\n\nWhat a laughingstock, is this your CBDC?https://t.co/hKkHiQTCyN pic.twitter.com/S6tRfh54wz — foobar (@0xfoobar) April 20, 2023\n\nCrypto researcher Mason Versluis tweeted that the code was “absolutely horrible” and suggested the French bank “stop trying to weasel” into crypto.\n\nBREAKING: France launches stablecoin on #Ethereum, but every single transfer has to be approved in a separate ETH transaction submitted by a centralized registrar!\n\n\n\nAbsolutely horrible. Keep your centralized bullshit over there, stop trying to weasel it into crypto.\n\n\n\nNews Via:… pic.twitter.com/mcg9fvUoSp — MASON VERSLUIS (@MasonVersluis) April 20, 2023\n\nPlenty of others chipped in on the criticism, but Ether (ETH) investor Ryan Berckman provided a more neutral analysis.\n\nHe explained that many traditional financial firms like SGF will take “baby steps” as they move into blockchain and digital assets:\n\n“Obviously, non-compliant, non-composable, allowlist-style stables are going to be uncompetitive in the market. Baby steps, they are coming from tradfi, they’ll see it soon enough and switch to a USDC-style denylist.”\n\nBerckman explained SGF may also be incorrect in its claim to be the first bank to launch an institutional stablecoin on a public blockchain. He pointed to the AUDN stablecoin minted on Ethereum in March by National Australia Bank (NAB), which claimed to be the second bank to launch a stablecoin.\n\nRegardless, Berckman expects more banks to follow suit in the months to come, stating that he is “certain” SGF won’t be the last bank to launch a stablecoin on a public network.\n\nRelated: Israel’s central bank says CBDC could be issued if stablecoin use increases\n\nSGF’s stablecoin isn’t intended for public use — at least to begin with.\n\nEURCV is only strictly available to institutional clients onboarded by the bank through its Know Your Customer (KYC) and Anti-Money Laundering (AML) procedures, according to the bank’s April 20 announcement.\n\nThe stablecoin is designed to bridge the gap between assets in traditional capital markets and the digital assets ecosystem.\n\nA total of 10 million EURCV tokens were minted on Ethereum on April , according to Ethereum explorer Etherscan. All 10 million tokens are held by one wallet address.\n\nThe stablecoin was launched on the back of growing demand for a new settlement asset to process on-chain transactions.\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3MvMWluY2gtam9pbnMtZXRoZXJldW1zLXprc3luYy1lcmEtZm9yLWZhc3Rlci1kZWZpLXRyYW5zYWN0aW9uc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "1inch Joins Ethereum's zkSync Era for Faster DeFi Transactions - Blockchain.News",
        "content": "1inch, a decentralized finance (DeFi) protocol, has deployed its aggregation and limit order protocols on Ethereum's zkSync Era. The move is aimed at leveraging faster and cheaper transactions on the layer-2 scaling solution.\n\nDecentralized finance (DeFi) protocol 1inch has recently made an important move to join Ethereum's scaling solution, the zkSync Era. By deploying its aggregation and limit order protocols on zkSync, 1inch aims to tap into faster and cheaper transactions that the layer-2 scaling solution offers.\n\nThe integration of 1inch on zkSync is expected to improve the protocol's performance and enable users to perform more DeFi transactions with greater efficiency. With the soaring demand for DeFi solutions, 1inch seeks to ensure that its users can continue to enjoy seamless and uninterrupted services while also reducing transaction fees.\n\n1inch is just the latest Ethereum-based platform to join the zkSync Era. Other notable DeFi protocols that have already deployed on the zero-knowledge proof (zk-proof) based scaling platform include Uniswap, SushiSwap, Maker, and Curve Finance.\n\nThe adoption of zkSync by a growing number of DeFi protocols underscores the importance of layer-2 scaling solutions in addressing the scalability issues faced by the Ethereum network. As a result of its growing popularity, zkSync has emerged as one of the most promising scaling solutions for Ethereum, offering faster and more cost-effective transactions than the Ethereum mainnet.\n\nFor those unfamiliar with zkSync, it is a scaling solution based on zk-proof technology that allows Ethereum to process transactions off-chain while still maintaining the same level of security and decentralization as the mainnet. With zkSync, users can perform transactions at a fraction of the cost and at a much faster speed than what is currently possible on the Ethereum mainnet.\n\nBy deploying on zkSync, 1inch is positioning itself to better serve its users and tap into the full potential of DeFi. With faster and cheaper transactions, 1inch aims to provide its users with a seamless and efficient experience, while also attracting more users to the platform.\n\nIn conclusion, the integration of 1inch on Ethereum's zkSync Era represents a major milestone for the DeFi ecosystem. With the growing adoption of layer-2 scaling solutions, the future of DeFi looks promising, as more users are expected to flock to these platforms, further driving innovation and growth in the DeFi space."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1oZXJlcy1ldmVyeXRoaW5nLXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtZXRocy1ib3RzLWFuZC1zYW5kd2ljaGVzL9IBZGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1oZXJlcy1ldmVyeXRoaW5nLXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtZXRocy1ib3RzLWFuZC1zYW5kd2ljaGVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Ethereum: Here’s everything you need to know about ETH’s Bots and Sandwiches - AMBCrypto News",
        "content": "Ethereum’s prices have been on a decline of late and the number of put options has increased.\n\nMEV and bot activity on the Ethereum network went uphill.\n\nEthereum’s [ETH] prices started to decline massively over the past few days. A lot of optimism was observed before Ethereum’s Shapella Upgrade, which allowed addresses to unstake their ETH from the beacon chain. However, as time passed, the sentiment around ETH started to change.\n\nRead Ethereum’s Price Prediction 2023-2024\n\nOver the last 24 hours, the value of ETH declined by 5.94% according to CoinMarketCap‘s data. The decline in prices was complimented by bearish sentiment from traders.\n\nThis was indicated by the fact that a large sum of OTM (Out of the money) block puts, which expire at the end of the month, made up 15% of daily trader volume.\n\nFor context, OTM block puts are option contracts with a strike price that is below the current market price of the underlying asset. These options would only be profitable if the price of the asset was to decrease significantly before the option expires.\n\nHence, the spike in block puts implied that traders were expecting ETH prices to fall further.\n\nBots and Sandwiches\n\nOn the Ethereum network, it was observed that there was a lot of bot activity going on. According to EigenPhi’s data, over the past month, MEV bots on Ethereum set a new record by earning $1.035 million in profits through 11,640 transactions. This included $940,000 in profits from sandwich attacks.\n\nA sandwich attack is a type of front-running attack used by MEV (miner extractable value) bots in which they place two trades around a target trade to exploit the price difference for profit.\n\nThe high number of MEV bots and sandwich attacks can cause Ethereum’s network to slow down due to increased congestion and transaction fees. This can lead to a negative impact on the network’s overall efficiency and user experience.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nThe Ethereum network was also impacted in terms of gas fees. Santiment’s data indicated that Ethereum lost its spot with respect to fee distribution. New assets such as APED and BOBO have taken the lead in this area.\n\nHowever, the interest in NFT trading on Ethereum remained unaffected. For the third consecutive month, Ethereum NFTs saw a trading volume of over $1 billion, according to Delphi Digital’s data."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbmdhcGUuY29tL3dlYi1zdG9yaWVzL21lbWVjb2lucy1wZXBlLWFuZC13b2phay10YWtlLWV0aGVyZXVtLWJ5LXN0b3JtL9IBUWh0dHBzOi8vY29pbmdhcGUuY29tL3dlYi1zdG9yaWVzL21lbWVjb2lucy1wZXBlLWFuZC13b2phay10YWtlLWV0aGVyZXVtLWJ5LXN0b3JtLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Memecoins PEPE and WOJAK Take Ethereum By Storm - CoinGape",
        "content": "PEPE and WOJAK have become the most popular Memecoins on Ethereum, with a transaction volume of over $250M and $120M respectively."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZW5ld3NtaW51dGUuY29tL25ld3Mvd2hhdC1zLWJpZy1kZWFsLWFib3V0LWFjY291bnQtYWJzdHJhY3Rpb24tYWEtZXRoZXJldW0td2FsbGV0cy0xNzYxNDjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "What's the big deal about Account Abstraction (AA) for Ethereum wallets? - The News Minute",
        "content": "The concept of Account (the object holding your tokens) and the concept of Signer (the object authorized to move these tokens) are basically the same thing! If you have a private key you automatically have an account at the associated address, and to own an account at a given address you must be in possession of the corresponding private key. That logic is hardcoded at the heart of the EVM."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdG8tc3Rha2UtcG9seWdvbi1tYXRpY9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "How to stake Polygon (MATIC) - Cointelegraph",
        "content": "The Polygon network, formerly the Matic network, is an Ethereum-scaling protocol that reduces cost and embeds high security. In a short span, Polygon has gained a high level of traction.\n\nA string of solutions on a single network sets Polygon apart from other Ethereum scaling projects. It empowers developers to zero in on a scaling solution that works best with their applications. Polygon Labs has been consistently working to develop scaling solutions based on plasma sidechains, a blockchain bridge, different types of zero-knowledge proofs and Optimistic Rollups.\n\nProcessing bundles of transactions on the Polygon proof-of-stake (PoS) blockchain drastically reduces the burden on the Ethereum main chain, making transactions faster. The throughput rate in the Ethereum base layer is roughly 14 transactions per second, while Polygon has the potential to handle exponentially higher transactions per second.\n\nAnyone wanting to participate in the network by updating transactional data on the system must stake Polygon (MATIC). In the Polygon network, a validator’s job is to ensure the network’s security and add transactions to blocks. Validators stake, allowing users to delegate tokens in exchange for rewards net of any commissions charged by validators.\n\nStaking of MATIC, explained\n\nAnyone looking to stake MATIC has to delegate tokens to a validator. Stakers can earn rewards against the staked funds. For now, there are no minimum staking requirements though validators can decide the minimum acceptable limit for staking. Validators might charge fees or commissions for these services. Staked MATIC tokens have an unlocking period of 80 checkpoints, approximately three to four days. Stakers wanting to exit just need to send an unbound request.\n\nIt helps to factor in validators’ credibility before delegating funds to any of them. One can hop to the Polygon staking dashboard to get information about validators, viewing metrics such as active validators, their uptime, commission and the amount required to stake. These metrics are valuable tools to help select reliable validator(s):\n\nUptime refers to the number of blocks signed in a specific time period. A validator’s uptime should be close to 100%. Otherwise, it indicates the validator is unreliable, as reflected in their public performance metrics.\n\nCommission rate is the percentage of one’s rewards the validator receives for their services.\n\nThe stake amount indicates the total number of tokens delegated to a validator.\n\nHow to stake MATIC on MetaMask\n\nMetaMask is a decentralized, noncustodial cryptocurrency wallet that interacts with the Ethereum blockchain. The wallet is accessible as a mobile app and browser extension on Google Chrome, Brave, Firefox, Opera and Edge.\n\nHere are the steps to stake MATIC on MetaMask:\n\nStep 1: Add MetaMask as a browser extension.\n\nTo stake MATIC on MetaMask, users need to visit the MetaMask website and set it up as a browser extension. Go to “Download.” One can choose between the currently used browser and iOS or Android. Select the download option for the browser to add MetaMask.\n\nStep 2: Connect MetaMask to the Polygon blockchain.\n\nMetaMask is compatible with different blockchains. To connect MetaMask to Polygon, go to “Networks” and “Add network.” In the window that appears, users must populate relevant data regarding the Polygon blockchain.\n\nStep 3: Transfer MATIC tokens to MetaMask.\n\nTo transfer MATIC tokens to the MetaMask wallet, copy the address from the wallet and feed it in as the destination address on the exchange or another wallet. Now, transfer MATIC tokens to MetaMask.\n\nStep 4: Connect MetaMask to the Polygon Wallet.\n\nOn the following link, click “MetaMask” to connect MetaMask to the Polygon wallet. https://wallet.polygon.technology/\n\nStep 5: Stake MATIC via MetaMask.\n\nOnce the connection is established, staking is enabled.\n\nStep 6: Delegate MATIC.\n\nSelect a validator to which tokens will be delegated.\n\nOne needs to use the control panel for staking. Click on the button “Apps” and then select “Staking.” Put the validator’s name in the search bar and click “Delegate.” All relevant information, such as the number of tokens staked, uptime and commission amount, is visible next to the validator’s name.\n\nFeed in the MATIC amount for staking and click “Continue.” In the pop-up extension window, click “Confirm.” The transaction might take a few minutes to complete, depending on traffic.\n\nTo execute a transaction, stake MATIC and begin receiving rewards, users must buy a voucher and pay for gas. Click “Buy Voucher.” Specify details like the gas limit and price, and re-confirm the transaction.\n\nDelegation is now complete. Users can “Stake more” or withdraw the rewards using the control panel. However, note that all transactions on the Ethereum network are paid in Ether (ETH). Therefore, the delegator must have enough ETH in the wallet to pay for the transactions.\n\nHow to stake MATIC on Coinbase Wallet\n\nTo stake MATIC on Coinbase, users need to use a wallet, as they don’t provide a staking feature on the exchange. If users have funds on the exchange but not in the wallet, they will need to move funds to the wallet. Even though Coinbase Wallet doesn’t have a built-in staking feature, there is a way to do it.\n\nHere are the steps leading to staking MATIC on Coinbase Wallet.\n\nStep 1: Install Coinbase wallet.\n\nInstall Coinbase Wallet on your smartphone. If it is an iPhone, go to the Apple App Store; visit the Play Store for Android.\n\nThe process includes creating a new wallet, agreeing to the terms of service, picking a username, setting privacy preferences, creating a passcode and backing up the wallet with a recovery phrase to help access the account in case users forget the passcode.\n\nStep 2: Move funds to the wallet.\n\nOpen the wallet and go down to the bottom right. Tap there and scroll down the screen that appears. The link “Connect to Coinbase” will be visible. Hit the link, and it will ask for authorization. Once done, the wallet will establish the user’s connection to their wallet.\n\nHit “Buy or transfer.” When the exchange prompts you to select a coin, select “MATIC wallet.” Now, users can feed in the number of coins they want to transfer. The wallet will ask for a verification code. Once successfully deposited, funds will be transferred. MATIC tokens on Coinbase exchange are ERC-20 tokens, meaning they run on top of the Ethereum network.\n\nStep 3: Stake MATIC.\n\nVisit the Polygon website. On the top menu, click “Use Polygon” and “Staking.” On the next page, click “Become a delegator.”\n\nThe user is taken to a page displaying a list of validators and their relevant details. One can sort the list in line with four parameters: performance, commission, stake and random, by clicking a drop-down list on the right of the page. The user can view the validators as a grid or a list. They can also search for a specific validator using a search box on the left.\n\nWhen users click any of the validators, they are taken to the page displaying further details of the relevant validator, such as MATIC staked, the commission asked, checkpoints signed and health status. Users can go through the list and click any validator.\n\nA different page displays further details of the validator. This includes the amount of MATIC their Ethereum wallet balance holds and its value in dollars, their stake, heimdall fee, rewards earned, performance index, checkpoints signed and more. Heimdall fees refer to the fees the validator has to pay using the Polygon network to submit checkpoints.\n\nThe user must log in by clicking the button at the top-right using their credentials. Users without an account on Polygon must create one and click the “Become a Delegator” button.\n\nUsers need to populate the number of MATIC coins they intend to delegate and tap “Continue.” When the user clicks “Continue,” a pop-up appears. The user must tap the “Delegate” button to complete the process.\n\nHow to stake MATIC on Trust Wallet\n\nTrust Wallet is a decentralized, noncustodial mobile app wallet for storing, exchanging and transferring crypto assets. Here is the process to stake MATIC on Trust Wallet:\n\nStep 1: Set up a Trust Wallet.\n\nSet up a Trust Wallet on your mobile phone. Select the preferred operating system (iOS or Android) and install the app.\n\nIf users have already been using Trust Wallet, they must import the wallet. Otherwise, they have to set up a new wallet. To import an existing wallet, click the “I already have a wallet” button and confirm a six-digit passcode.\n\nIf a user is uninitiated with the wallet, they must read and agree to the privacy policy and terms of service, create and confirm a six-digit passcode and back up the wallet with a recovery phrase.\n\nTrust Wallet allows a wallet for several coins, but a multicoin wallet is usually the most suitable. As MATIC staking occurs on Ethereum, one requires an adequate amount of ETH and MATIC on the Ethereum mainnet.\n\nStep 2: Connect Trust Wallet to Polygon.\n\nLog in to the Polygon staking dashboard and click “Become a Delegator.” From the list of wallets, select “WalletConnect” to connect to Trust Wallet on Polygon. A QR code will appear on the screen.\n\nReturn to the Trust Wallet app, go to the settings and choose WalletConnect. Click the “New Connection” button. Scan the QR code on the Polygon staking dashboard. Click “Confirm” to establish the connection.\n\nStep 3: Delegate and approve transaction.\n\nSelect the validator and click “Delegate.” Feed the number of MATIC coins to be staked and click “Continue.” To approve the transaction, confirm the smart contract call in the Trust Wallet app.\n\nGet back to the Polygon staking dashboard and click “Delegate.” Confirm yet another smart contract call in the Trust Wallet app. Delegation is active and users can begin accruing rewards.\n\nHow to stake using Ledger\n\nLedger is a popular device for storing cryptocurrencies. Before staking MATIC with Ledger, one needs to prepare for it.\n\nStep 1: Prepare for staking.\n\nThe process starts with updating Ledger Live to the latest version using the link: https://www.ledger.com/ledger-live/download\n\nConnect the Ledger device to “My Ledger” and install the latest version of the ETH app on the Ledger device. Enable blind signing in the ETH app settings. When the preparation process is completed, Close Ledger Live or problems might arise when working with MetaMask.\n\nUsers also need to ensure MATIC is stored in the Ledger Ethereum account and not in the Polygon account, as MATIC staking happens on the Ethereum network.\n\nStep 2: Connect Ledger ETH account to MetaMask.\n\nConnect the Ledger device to the desktop and open the ETH app within. Now, link the Ledger ETH account to MetaMask.\n\nOnce the connection is established, go to the Polygon Wallet app.\n\nConnect your Ledger Ether account to MetaMask by following these steps.\n\nOnce done, go to the Polygon Web Wallet app, select “Connect to a Wallet” and then MetaMask.\n\nWhen MetaMask opens in the browser, select the Ledger account, click “Next” and then “Connect.” Ledger displays “Sign message.” Select “Sign message” and simultaneously press both buttons to confirm. Now, MetaMask is connected to the Polygon Wallet app.\n\nStep 3: Select a validator.\n\nSelect “Polygon Staking.” In the app’s top-right corner, click the “Login” button and select MetaMask again.\n\nChoose a validator from the list that appears. Users need to consider two parameters: a high score for “Checkpoint signed” and a low “Commission.”\n\nStep 4: Delegate.\n\nClick the “Delegate” button, fill in the amount of MATIC to be staked and click “Continue.” MetaMask displays “Give permission to access your MATIC?”\n\nReview the fee amount; if it looks satisfactory, click “Confirm.” Ledger now displays “Review transaction.”\n\nSelect “Accept and send” and press both buttons simultaneously to “sign the transaction.” Ledger now displays “Application is ready.”\n\nReturn to the Polygon Web Wallet App, select a validator and click “Delegate.”\n\nReview and confirm the transaction through MetaMask and Ledger devices. When the Ethereum network confirms the transaction, the screen will display “Delegation Completed.”\n\nHow to stake MATIC using ZenGo wallet\n\nZenGo is a self-compatible wallet. It’s compatible with WalletConnect, with no seed phrase vulnerability. Let’s go through how users can stake MATIC using a ZenGo wallet.\n\nStep 1: Install the ZenGo wallet on your mobile phone.\n\nVisit the ZenGo website, select an operating system (iOS or Android) and install the app on the mobile phone. To accelerate the search, one can scan the QR code.\n\nOpen the ZenGo app, enter an email address and tap “Continue.” ZenGo requires the user to confirm their email address. For confirmation, reach the inbox by tapping “Open My Email” in the ZenGo app, then tap “Tap to Confirm” in the email received. After email address verification, enable biometrics to make the app even more secure.\n\nCreate a Recovery Kit for the safety of funds and easy access when changing devices. As a noncustodial wallet, ZenGo shares an encrypted secret key share. Part of the key stored on the device helps unlock the wallet and use it with a face scan. Once the Recovery Kit is created, tap “Done.”\n\nStep 2: Connect ZenGo wallet to Polygon.\n\nUsers need to connect the ZenGo wallet to Polygon. Open the link https://staking.polygon.technology/\n\nGo to the Polygon staking dashboard. In the upper right part of the screen, tap “Login.”\n\nTap WalletConnect from the list of available connections. WalletConnect protocol enables one to connect ZenGo to Polygon. The QR code will appear.\n\nGo to the ZenGo wallet homepage and tap the “Connect to Apps” button in the upper right corner. Scan the QR code.\n\nStep 3: Select a validator and delegate MATIC.\n\nNow begins the process of delegating MATIC. Make sure to have MATIC in ERC-20 and 0.05–0.1 ETH for fees, as the delegation happens on the Ethereum mainnet.\n\nOn the Polygon staking dashboard, scroll down to find information such as the network’s overview, active validators, their amount of stake, uptime, commission, amount of stake and health metrics.\n\nSelect a validator after considering the metrics and tap “Delegate” at the bottom-right of the screen.\n\nIn the pop-up box that appears, users need to enter the amount of MATIC to be staked and tap “Continue.” You can stake with an amount as low as 1 MATIC. To confirm the transaction, return to the ZenGo app and approve the transaction in the pop-up window.\n\nRevisit the Polygon staking dashboard and tap “Delegate.” In the ZenGo wallet, confirm the transaction and wait for approval.\n\nOnce delegation is active, the user will begin receiving rewards. At each checkpoint, rewards get accrued.\n\nRewards are received in the “My Account” section of the Polygon staking dashboard. Users can also unstake, stake to multiple validators or restake funds. To withdraw the rewards accrued, users must have a minimum of 2 MATIC in their account.\n\nThe road ahead\n\nAs a prominent layer-2 network, the Polygon protocol is a solution that helps Ethereum expand in size, security, efficiency and use cases. As the unit of payment and settlement in the network, MATIC helps power the system. The Matic network went live in 2020, rebranded to Polygon in February 2021, and is being used by developers to build Ethereum-compatible decentralized applications.\n\nThe Polygon protocol has been instrumental in making Ethereum usable and pulling it out of the mess the blockchain found itself in after rapid growth. Transactions were stuck for hours over a lack of scalability, with the cost of executing transactions often more than the transaction amount itself. The Polygon protocol has effectively transformed Ethereum into a full-fledged multichain system with the advantages of Ethereum’s decentralization and vibrancy.\n\nMATIC token is here to stay and keeps playing an increasingly important role in retaining the functionality of Ethereum ecosystem. Staking, meanwhile, will serve as a mechanism to ensure proper governance and security of the network."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmxlZGdlcmluc2lnaHRzLmNvbS9zb2NnZW4tZm9yZ2Utc3RhYmxlY29pbi1maXJzdC1zeXN0ZW1pYy1iYW5rLXB1YmxpYy1ibG9ja2NoYWluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "SocGen subsidiary is first systemic bank to issue stablecoin on public blockchain - Ledger Insights - Ledger Insights",
        "content": "Today Societe Generale Forge (SocGen Forge) unveiled the EURCV stablecoin (EUR CoinVertible), which is initially being issued on the Ethereum public blockchain with plans for other blockchains as well. This is the first public blockchain stablecoin issued by a subsidiary of a global systemically important bank (G-SIB).\n\nSocGen Forge has been at the cutting edge of blockchain for some time, providing the infrastructure for the first blockchain bond issued by the European Investment Bank (EIB) on Ethereum. Like that bond, the stablecoin uses Forge’s CAST framework for tokenization. It was also the first major commercial bank to launch a public blockchain bond back in 2019.\n\nThe motivation for the issuance includes using it as a robust settlement asset for on-chain transactions. The DLT Pilot Regime is now in force, although no major projects have yet been unveiled. Other client needs that SocGen Forge is targeting include corporate treasury, on-chain liquidity funding and an asset for margin calls.\n\nIn terms of jurisdiction, it is a French regulated digital asset and the company received its digital asset license last year. On the one hand, it has many of the features you’d expect from a conservative regulated institution. Access to the stablecoin is restricted to investors that have been through SocGen KYC and AML procedures. And the backing assets are fully segregated. If SocGen doesn’t want to buy the stablecoins from the holders, they can be redeemed or converted into collateral.\n\nHowever, the collateral is of a lesser quality than the reserves of the USDC or Paxos dollar stablecoins. Collateral supporting the EURCV is cash at a bank with at least the credit rating of SocGen and short term securities with an unsecured credit rating equivalent to SocGen or better. In contrast, USDC and Paxos only invest in bank deposits and Treasuries or Treasury repo.\n\nSocGen Forge plans to have the stablecoin listed on digital asset exchanges.\n\n“Digital assets with stabilisation mechanisms – i.e. stablecoins – built under a robust banking-grade structure will be a key element to increase trust and confidence in the native crypto ecosystem,” said Jean-Marc Stenger, CEO of SG-FORGE. “This issuance is a major step in Societe Generale–FORGE’s roadmap to deliver innovative solutions to its clients, either real-money institutions and corporates or entities of the crypto industry, and to facilitate the emergence of new market infrastructures based on blockchain technology.”\n\nWhite & Case was the legal advisor, Equitis Gestion is the fiduciary, and PwC audited the smart contract.\n\nEarlier this month, Brazilian investment bank BTG Pactual launched a dollar stablecoin."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXB1bXBzLXdpdGgtMmstaW4taXRzLXNpZ2h0cy1hcy1uZXctdXB3b3JrLXJlcGxhY2VtZW50LWlzLXNldC10by1oaXQtMzAwMDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Recent Pump is Good News for Cryptos Like Deelance - Analytics Insight",
        "content": "Like many cryptos, Ethereum (Ether) sure is happy that it’s 2023. After a long, cold crypto winter that saw Ethereum drop in value by 36.22% over the last year, it’s truly turned the corner in 2023. Year-to-date as of April 19, Ethereum has gained 65.14% and stands at $1,981.50. It’s been on a solid pump recently, too, bumping up in value by 11.08% in the last month, as it has 2k in its sight yet again.\n\nThe big boost that Ethereum has experienced in 2023 has also had a trickle-down effect on other cryptos that are based on the blockchain. One of those is a new Upwork replacement that’s set to hit $300,000 in the near future.\n\nIt’s called Deelance (DLANCE), a first-of-its-kind freelancing and recruitment platform based on the blockchain that’s revolutionizing how freelancers connect with potential employers. The platform has raised just shy of $300,000 in presale thus far, as investors are gobbling up the available $DLANCE tokens – just as you should now.\n\nBelow, we’ll dive more into Deelance to figure out why it’s such an amazing new crypto project, and reveal how Ethereum’s price pump adds more credence to the project.\n\n>>>Buy Deelance Now<<<\n\nEther’s Success Leads to the Same for Others on the Blockchain\n\nIt hasn’t always been true that Ethereum has to be successful in order for the other crypto projects that are based on it to be successful. For instance, while Ethereum struggled for much of 2022, there were certainly smaller alt coins that are based on the Ethereum blockchain that fared just fine.\n\nThat being said, it certainly doesn’t hurt when Ethereum does well. In fact, when Ether performs well, it usually follows that the solid projects with good underlying fundamentals on the world’s second-largest blockchain do well, too. That’s because investors start to do more research and take notice of the projects based on Ethereum.\n\nDeelance is one of those, and it’s definitely benefitting from the bounceback success that Ethereum has experienced this year. In a short amount of time in presale, Deelance has been able to raise more than $294,000. It’s blowing through pressale stages, with investors who wait, missing out on the lower prices that are available. That’s because there’s a price increase that occurs with each new presale stage. This is why it’s essential that you act now so you can get the biggest potential return on your investment.\n\n>>>Buy Deelance Now<<<\n\nDeelance is a Viable Replacement for Upwork\n\nUpwork has established itself as a leading freelancing platform based on Web2. It has a market capitalization of $1.37 billion. That being said, there are some major issues that the platform has, and it shows in its stock price. In the last year, Upwork’s stock has dropped 51.18% in value, though it’s leveled off a bit with “only” a 4.22% drop in 2023 year-to-date.\n\nDeelance provides a lot of advantages over a platform like Upwork – and others such as Freelancer and Fiverr – because it’s a Web3 platform. It offers significantly lower fees for both freelancers and clients than all those other platforms, and it offers instant withdrawals with no fees since it can be done in cryptocurrency.\n\nWhile having a large number of freelancers make the switch from Web2 to Web3 would have seemed unlikely maybe even a year or two ago, more and more people are comfortable with the move today. Part of the reason for that is the recent success of Ethereum, which is drawing more positive attention to projects such as Deelance.\n\n>>>Buy Deelance Now<<<\n\nDeelance is a New Way to Work\n\nDeelance is more than just another freelancing platform. It’s providing freelancers with a new way to work.\n\nUsers on the platform can create their own professional identity on the Deelance Metaverse. There, they can socialize with other people, buy commercial land or office space, put up billboard advertisements to increase their own brand awareness, get exclusive access to a Metaverse VIP experience, and even gain access to unique tools and services. Since all of this uses the $DLANCE token, too, it provides a great use case for why it’ll increase in value.\n\n>>>Buy Deelance Now<<<\n\nWhile working in the Metaverse, Deelance users will be able to interact with buyers in an office space. There, they can discuss potential projects, or progress on projects, which allows them to connect in a way that really wasn’t possible before now. Buyers and sellers can interact directly with each other, which increases the chances that connections will be made.\n\nAnd speaking of connections, freelancers can build their own network of colleagues in the Metaverse lobby arena. This is great, as freelancers often are out all on their own. This networking capability allows them to connect with others to learn and potentially build up their own business, too.\n\nThis aspect of Deelance is what’s setting it apart from all of the competition in its industry. Plus, it aligns quite well with Ethereum and the forward-thinking approach. After all, Ethereum did just go through The Merge last fall, which significantly upgraded how the blockchain works, which resulted in significant gains for the project.\n\n>>>Buy Deelance Now<<<\n\nBuy Deelance Now to Get the Biggest Return on Your Investment\n\nDeelance, a new Web3 freelancing and recruitment platform, is benefitting from two major developments – the shift in work culture to freelancing and the gig economy, and the recent pump of the Ethereum blockchain that it’s based on.\n\nThe fact that Ethereum is approaching $2,000 again is bringing a lot of great positive attention to cryptos based on the blockchain, which Deelance is. Yet, the real reason Deelance has been so successful in presale thus far is its own approach and design. It’s positioned itself as a great replacement for Upwork, Freelancer and Fivrr, and investors are taking notice, pumping almost $300,000 into the presale thus far.\n\nIf you want to get in on the ground level of this great opportunity, you better act quick. There’s a price increase with each new presale stage, and the current stage ends in about four days. So, buy Deelance now before you miss out.\n\n>>>Buy Deelance Now<<<\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzEwLXNpZ25pZmljYW50LWV0aGVyZXVtLWVjb3N5c3RlbS1wcm9qZWN0cy1hbmQtdG9rZW5zLWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "10 Significant Ethereum Ecosystem Projects and Tokens in 2023 - Analytics Insight",
        "content": "The top 10 Ethereum ecosystem projects and tokens for 2023 are compiled in this article\n\nThe second-largest cryptocurrency after Bitcoin is Ethereum, which is more than simply virtual currency. By creating a worldwide network that protects an ecosystem of decentralized apps (DApps) from decentralized finance (DeFi), NFTs, and more, Ethereum has expanded on the use cases of Bitcoin. Due to its decentralization in nature, Ethereum ecosystem projects and tokens are trending. This article gathers the top 10 Ethereum ecosystem projects and tokens in 2023.\n\n1. MakerDAO– An Ethereum project called MakerDAO enables cryptocurrency lending and borrowing. By depositing Ethereum-based tokens like UNI, YFI, or BTC into the protocol, users can borrow money by forming a collateralized debt position for the amount they want to borrow. When it comes time to return, the loan amount must be in DAI stablecoins, and any interest must be paid in the governance and utility token MKR. MakerDAO processes loans in DAI stablecoins.\n\nAs of April 21, 2022, MakerDAO (DAI) has a price of US$1.44 and a market valuation of US$207,255,730.\n\n2. 1INCH- The 1INCH native Ethereum token is used on the 1INCH decentralized exchange (DEX). By combining the best cryptocurrency exchange rates from all DEXs, the Ethereum-based DEX protocol seeks to provide its consumers with the best rates. Like other DEXs, 1inch enables direct token exchange between users.\n\nAs of 21 April 2023, the price of 1INCH (INCH) is US$0.5098, and its market cap is US$415,412,451.\n\n3. Sandbox– The native token and means of exchange in the Sandbox ecosystem is The Sandbox SAND. Users can use SAND to monetize their gaming experiences by buying property, building in-game assets, or listing them on The Sandbox Marketplace. Additionally, SAND owners can stake SAND tokens to get in-game incentives and take part in governance choices.\n\nAs of 21 April 2023, The Sandbox (SAND) is valued at US$0.6123 and has a US$917,979,106 market cap.\n\n4. Decentraland- Decentraland is a virtual reality real estate platform that enables users to build and charge for online experiences and buildings. On the Decentraland marketplace, creators can purchase virtual goods like LAND NFTs and avatars using the platform’s native token, MANA.\n\nAs of April 21, 2023, Decentraland (MANA) is worth US$0.5856 and has a US$1,100,391,969 market cap.\n\n5. Chainlink- Chainlink is a decentralized network that safely converts information from the real world to blockchain-based smart contracts and back via Oracle software. LINK, the native token of Chainlink, can be used by users to pay for network services.\n\nAs of April 21, 2023, Chainlink (LINK) is worth US$7.47 and has a US$3,864,830,220 market capitalization.\n\n6. Uniswap- The native governance token of Uniswap, an Ethereum-based decentralized cryptocurrency exchange, is called Uniswap UNI. On Uniswap, users can trade Ethereum tokens without relying on a third party to retain their money. The trading model used by the platform is a new one known as an automated liquidity protocol.\n\nAs of April 21, 2023, Uniswap (UNI) is worth US$5.75 and has a market cap of US$3,318,813,946.\n\n7. Aave- On the Ethereum blockchain, there is a lending protocol called Aave. Lenders can receive rewards by adding different Ethereum-based assets to liquidity pools, while borrowers can put approved assets up as collateral for loans.\n\nAs of April 21, 2023, AAVE (AAVE) is worth US$72.04 and has a US$1,014,280,242 market cap.\n\n8. Curve Finance- A DEX and automated market maker (AMM) platform called Curve Finance provides a quick and easy way to swap tokens while retaining minimal fees and slippage. Curve Finance, in contrast to other DEXs, is made particularly for trading stablecoins.\n\nAs of April 21, 2023, Curve Finance (CRV) has a market cap of US$745,637,473 and a price of US$0.96.\n\n9. Chromia- Chromia is a blockchain platform that gives programmers the resources they need to combine relational databases with blockchain technology to build safe DApps. The Chromia ecosystem’s standard currency is called CHR, and users can use CHR to pay DApp costs.\n\nAs of April 21, 2023, Chromia (CHR) is worth US$0.162 and has a US$110,603,916 market cap.\n\n10. Axie Infinity- On the Ethereum blockchain, there is a play-to-earn NFT game called Axie Infinity. Players can gather NFTs of the adorable creatures known as Axies and engage them in combat. AXS and SLP, the game’s native Ethereum-based currencies, can also be used by players to play and stake the tokens to earn rewards. AXS owners can take part in crucial Axie Universe votes for governance.\n\nAs of April 21, 2023, Axie Infinity (AXS) is worth US$8.16 and has a US$946,606,679 market cap.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmxvY2FscHJvZmlsZS5jb20vbmV3cy90ZXhhbnMtY3J5cHRvY3VycmVuY3ktYnV5LWhvbWUtNzUwNjQ1MdIBTGh0dHBzOi8vd3d3LmxvY2FscHJvZmlsZS5jb20vYW1wL25ld3MvdGV4YW5zLWNyeXB0b2N1cnJlbmN5LWJ1eS1ob21lLTc1MDY0NTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Texans Can Now Buy A Home With Cryptocurrency - Local Profile",
        "content": "An Austin-based startup is selling several properties in North Texas\n\nBuying a home is expensive! You need lots of money — or, in Texas, lots of crypto.\n\nAccording to The Dallas Morning News, a Zillow-like website has been launched by MyEListing, a startup located in Cedar Park, close to Austin. The platform enables individuals to list both commercial and residential properties for sale and offers the option to use either cash or cryptocurrency as payment.\n\nThe company's ASAP (Accelerated Sale and Purchase) program enables sellers to complete transactions in a single business day on the marketplace. Coinbase Commerce will facilitate the conversion of buyers' cryptocurrency to cash, while Millennial Title and Championship Title will manage the title work.\n\n“We pre-clear the title, the seller pre-signs the sales contract, and we list the property to the seller's liking,” a statement from the company reads. “All parties involved then sign closing documentation via an online Zoom call, buyers have 30 minutes to send the full purchase price after clicking the ‘Buy Now’ button featured on the listing, and the process is finished.”\n\nMyEListing doesn’t charge listing fees for properties, communication with other agents, or access exclusive market intelligence. Instead, the company aims to “empower real estate professionals from every corner of the industry with as many free resources as possible.”\n\nSome homes in North Texas are available on the new site, including one in Grapevine. The site features a three-quarter acre home site along Hughes Road. The property is being offered for $499,000 in cash, or alternatively, 17.5 Bitcoin or 256 Ethereum.\n\nTwo additional commercial properties in D-FW have been listed on the platform. The first is an office building in Farmers Branch priced at $4.3 million, or alternatively, 150 Bitcoin or 2,208 Ethereum. The second property is a 40-acre commercial tract of land located at the intersection of Interstate 20 and Interstate 45 in Dallas, with an asking price of $3.9 million, or alternatively, 136 Bitcoin or 1,997 Ethereum.\n\nAs of now, the platform only allows Texas-based properties to be listed. However, the company intends to expand to two or three additional states by June."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmdhZGdldHMzNjAuY29tL2NyeXB0b2N1cnJlbmN5L25ld3MvYml0Y29pbi1wcmljZS10b2RheS1jcnlwdG8tbWFya2V0LXZhbHVlLWV0aGVyZXVtLWFsdGNvaW5zLWxvc3Nlcy0zOTY3MDg30gF7aHR0cHM6Ly93d3cuZ2FkZ2V0czM2MC5jb20vY3J5cHRvY3VycmVuY3kvbmV3cy9iaXRjb2luLXByaWNlLXRvZGF5LWNyeXB0by1tYXJrZXQtdmFsdWUtZXRoZXJldW0tYWx0Y29pbnMtbG9zc2VzLTM5NjcwODcvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Prices Fall as Increase in Selling Pressure Causes Drop in Values of Most Cryptocurrenc... - Gadgets 360",
        "content": "Bitcoin price in India and international markets dropped on Friday, after days of seeing its value rise. Industry experts say that at present, the selling pressure on investors has increased, triggering a period of volatility for crypto assets. On Friday, the world's most popular cryptocurrency opened with a loss of 2.22 percent to trade at $28,245 (roughly Rs. 23.2 lakh). While it remains the most expensive cryptocurrency, BTC is currently trading at a similar price on both national as well as international exchanges. In the last 24 hours, the value of Bitcoin has dropped by $613 (roughly Rs. 50,370).\n\n“Bitcoin dropped for the second consecutive session due to an increased selling pressure,” Edul Patel, CEO of crypto investment platform Mudrex told Gadgets 360. Selling pressure garners heat when majority of the traders begin selling, indicating that the majority is betting on the market price to decrease. “This resulted in the loss of the rally and wiped out the weekly gains of Bitcoin. Despite this, there is still substantial support down to the late-March lows of $26,500 (roughly Rs. 21 lakh) and Bitcoin has seen a 40 percent increase over the past six weeks.”\n\nEthereum followed Bitcoin in a conventional market movement and reflected a loss of 0.10 percent at the time of publishing. The value of Ether is hovering around the mark of $1,940 (roughly Rs. 1.60 lakh) after having fallen by $157 (roughly Rs. 12,899) in the last three days.\n\nOn Friday, most cryptocurrencies saw their prices fall alongside Bitcoin and Ether. These included altcoins like Tether, Binance Coin, USD Coin, Ripple, and Cardano as well as Dogecoin, Polygon, Solana, and Polkadot.\n\nShiba Inu, Avalanche, and Tron also saw their values drop on Friday.\n\n“Market performance has been sideways with a downward bias in the last 24 hours. The two-day continuous drop could be triggered by a $400 million (roughly Rs. 3,268 crore) sell order on Binance. On the regulatory front, the US seems to be lagging as market liquidity seems to be moving away from the country. Greed seems to be on a decline, as the crypto fear and greed index stands at 50, down two points in the last 24 hours and lowest since March 15,” Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch told Gadgets 360.\n\nThe overall crypto market valuation dipped by 1.45 percent over the last 24 hours. As of Friday, the crypto market cap stood at $1.20 trillion (roughly Rs. 98,26,980 crore), showed the data by CoinMarketCap. In the otherwise top-to-bottom loss-ridden price chart, LEO and Bitcoin SV managed to record miniscule price hikes.\n\nWhile there are several factors that could have led to the crypto market hitting a speed breaker after rallying for days, it could also be due to the possibility of stricter oversight that could make it risky for miscreants to engage with the sector. The European Parliament on Thursday overwhelmingly backed the European Union's (EU) first set of rules to regulate the cryptoasset markets.\n\nCalled MiCA — or Markets in Crypto Assets — these rules largely revolve around consumer protection and prevention of market manipulation and financial crimes in the crypto sector. The MiCA bill is aimed at preventing insider dealing, unlawful disclosure of inside information, and market manipulation of crypto-assets.\n\n“The crypto market faces headwinds, but long-term tailwinds for Bitcoin are highlighted in 3iQ's 2023 Outlook. Key market indicators showed a ‘Sell' sentiment amidst prices of BTC and ETH decreasing after a good run in the past few days. Investors must proceed with caution,” Rajagopal Menon, Vice President, WazirX told Gadgets 360.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nApple is opening its first stores in India, one in Mumbai and the other in Delhi. What does this mean for Apple customers in India? We discuss this and more on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vYW1iY3J5cHRvLmNvbS8xaW5jaC10dXJucy10by1ldGhlcmV1bXMtbDItbGF1bmNoZXMtb24temtzeW5jLWVyYS1ldmVyeXRoaW5nLXlvdS1zaG91bGQta25vdy_SAWhodHRwczovL2FtYmNyeXB0by5jb20vMWluY2gtdHVybnMtdG8tZXRoZXJldW1zLWwyLWxhdW5jaGVzLW9uLXprc3luYy1lcmEtZXZlcnl0aGluZy15b3Utc2hvdWxkLWtub3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "1inch turns to Ethereum’s L2, launches on zkSync Era: Everything you should know - AMBCrypto News",
        "content": "zkSync Era’s integration would allow better provision of liquidity for 1inch users.\n\nAlas, development activity on the network remained very low.\n\nOn 20 April, the 1inch Network [1INCH] announced that it has adopted the Zero-Knowlege (ZK) scaling solution through its expansion to zkSync Era. Known to be connected with the cutting-edge ZK rollup technology, zkSync Era is an Ethereum [ETH] layer two (L2) whose purpose is to provide more cost-effective and faster transactions.\n\nRead 1inch Network’s [1INCH] Price Prediction 2023-2024\n\nFirst of its kind\n\nAccording to the announcement, the expansion would allow users on the DEX aggregator to enjoy the benefits of the ZK system. This includes lower fees, better access to liquidity, and higher transaction speeds.\n\nAlthough zkSync Era was only launched in March 2023, it has proven to be one of the best projects with real utility. Hence, the reason there is so much hype behind it, and its Total Value Locked (TVL) has been soaring.\n\nFor context, the TVL hike means that enough liquidity has been entering into chains under the protocol.\n\nReacting to the integration, 1inch’s co-founder Sergej Kunz mentioned that the project was excited to be the first to be implemented on the zkSync network. He affirmed that:\n\n“As zkSync Era gains steam, 1inch users will benefit from faster and cheaper transactions.”\n\nIn response, the CEO, and co-founder of Matter Labs, the firm behind the zkSync idea, Alex Gluchowski did not hide his eagerness to see the outcome of the collaboration. Like Kunz, Gluchowski said:\n\n“As the largest DEX aggregator by on-chain volume, 1inch will provide deeper liquidity to zkSync Era while offering DeFi users greater transparency and empowering them to execute faster trades at better rates and with less slippage on their transactions.”\n\nEcstasy in the land amid restraints in development\n\nAccording to Santiment, the network’s social volume rose to 41. The metric takes into consideration the search texts for an asset.\n\nAn increase, as seen at press time, implied that participants have a high precedence for 1INCH.\n\nSimilarly, its social dominance also increased to 0.464%. When this metric spike, it shows that the asset has ascended into one of the top assets being discussed among the top 100 in market capitalization.\n\nDespite the update, the 1inch Network development activity remained clustered at a low point. At the time of writing, it was 1.12.\n\nHow much are 1,10,100 INCHs worth today?\n\nThis means that there has been a continued downturn in public contribution on GitHub. However, there was a chance that the expansion could impact the metric positively considering the hype around zkSync Era.\n\nAdditionally, 1inch also pointed out that several protocols were immediately available via the network on zkSync Era. Some of these include SyncSwap, Mute, and SpaceFi."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vYWxleGFibG9ja2NoYWluLmNvbS90b21pLXVudmVpbHMtdGhlLWZpcnN0LXByaXZhY3ktc3RhYmxlY29pbi_SAUxodHRwczovL2FsZXhhYmxvY2tjaGFpbi5jb20vdG9taS11bnZlaWxzLXRoZS1maXJzdC1wcml2YWN5LXN0YWJsZWNvaW4vP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "tomi unveils the first privacy stablecoin on its Ethereum L2 amid U.S. crackdown - AlexaBlockchain",
        "content": "Key Takeaways\n\nEncrypted Privacy Layer: tomi launches TPL, an encrypted Layer 2 protocol that enables private transactions on Ethereum for the first time.\n\ntomi launches TPL, an encrypted Layer 2 protocol that enables private transactions on Ethereum for the first time. Privacy-First Architecture: TPL introduces a privacy-first architecture that allows users to access L1 applications while maintaining complete privacy.\n\nTPL introduces a privacy-first architecture that allows users to access L1 applications while maintaining complete privacy. tpUSD Stablecoin: tomi unveils tpUSD, its privacy stablecoin pegged to the value of the U.S. dollar and the first token on TPL, offering a solution to keep governments away from private transactions.\n\ntomi unveils tpUSD, its privacy stablecoin pegged to the value of the U.S. dollar and the first token on TPL, offering a solution to keep governments away from private transactions. Privacy-Enhancing Technology: TPL’s privacy-enhancing technology enables users to prove the validity of a statement without revealing any sensitive information, providing complete privacy for users.\n\ntomi, the anonymous team behind a DAO-governed, surveillance-free alternative to the internet that secured $40 million in funding led by DWF Labs last month, has launched tomi Privacy Layer (TPL), an encrypted Layer 2 protocol that enables users to transact directly on Ethereum with complete privacy for the first time.\n\nAs the U.S. Federal Reserve seek to increase oversight of non-bank stablecoin issuers, tomi’s new privacy-enhanced stablecoin offers a solution to one of the blockchain industry’s most pressing issues: privacy. With the launch of tomi Privacy Layer (TPL), users can now conduct private transactions on Ethereum without the fear of government surveillance or monitoring.\n\nThe current Ethereum ERC20 tokens allow users to view the wallet address, balance, and history of other users, which prevents private transactions. However, TPL utilizes zero-knowledge rollups (ZK-rollups) and snark proofs to empower users to hide their information and preserve their privacy.\n\nTPL’s privacy-enhancing technology enables users to prove the validity of a statement without revealing any sensitive information.\n\nUsers can now engage in private transactions and smart-contract execution via TPL directly on Ethereum applications. Additionally, TPL offers accessibility, adaptability, and scalability, making it a robust and user-friendly platform.\n\nThe launch of TPL is part of tomi’s broader bundle of privacy-preserving tools under the umbrella of tomiNET, its alternative internet ecosystem.\n\nTomiNET aims to create a clean slate for the internet, where big corporations and governments do not have power over people’s identities, businesses, and personal data. The project is a significant threat to fiat currency systems and power and data brokers around the world.\n\nThe team behind tomi feels that their safety may be at stake due to the project’s disruptive nature and chooses to remain anonymous, following Satoshi’s footsteps.\n\nThe launch of TPL and tomiNET marks a significant milestone for the project, which seeks to empower individuals to transact freely and privately without interference from third parties.\n\nRead Also: Mastercard Doubles Down On Crypto, Enabling Stablecoin Payments On Its Network With Stables"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L25leHQtbGV2ZWwtY3J5cHRvLXByb2plY3RzLXBvbGthZG90LWRvdC1ldGhlcmV1bS1ldGgtYW5kLXV3ZXJ4LXdlcngv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Next Level Crypto Projects Polkadot (DOT), Ethereum (ETH), and Uwerx (WERX) - Analytics Insight",
        "content": "In the crypto space, projects are not created equal. PolkaDot (DOT), Ethereum (ETH), and Uwerx will lead the next bull market cycle. A unique value proposition drives each, and analysts expect all three to post excellent returns in 2023.\n\nPolkadot (DOT)\n\nPolkadot (DOT) was created by Gavin Wood, one of the core developers of Ethereum (ETH). Polkadot (DOT) presents the solution for blockchains’ core problem: their natural isolation. Polkadot (DOT) creates a foundational layer, or layer zero, allowing for the free flow of assets and information between all the Polkadot (DOT) chains. Polkadot’s (DOT) core blockchain is the Relay chain that provides security and relays information and assets, as the name suggests. Polkadot’s (DOT) other chains are called parachains, and these purpose-specific chains can hyper-specialize, allowing for an enormous ecosystem. Polkadot’s (DOT) elegant solution to interoperability will drive its growth in 2023.\n\nEthereum (ETH)\n\nEthereum (ETH) is the oldest smart contract-capable blockchain. Ethereum (ETH) launched in 2015, and the developers at Ethereum (ETH) have been shipping upgrades to the network ever since. The most recent upgrade saw Ethereum (ETH) transition to proof of stake, and the coming Ethereum (ETH) hard fork, the Shanghai hark ford, will enable staking withdrawals. Making analysts expect that once Ethereum (ETH) can be withdrawn, investors will rush to buy Ethereum (ETH) so they can stake the Ethereum (ETH) token and earn passive income from validator rewards.\n\nUwerx (WERX)\n\nUwerx has analysts and experts buzzing. This relatively unknown microcap crypto project has outrageous upside potential in 2023. Uwerx will release a decentralized blockchain based freelance platform that will set a new standard for the freelancing industry. Until now, centralized platforms have choked innovation through high platform fees and unnecessarily heavy bureaucratic systems. Uwerx provides a blockchain-driven solution and replaces intermediaries with smart contracts. InterFi Network and SolidProof have both already audited the protocol, and liquidity will be locked for twenty-five years after launch.\n\nUwerx flags all the indicators of a hidden gem, and this project could become a blue chip as early as 2024. With millions of freelancers ready to migrate to a better alternative and Uwerx providing one, the growth potential remains obscene. Analysts have predicted WERX can rally by up to 9,000% in 2023 alone, and Uwerx is an opportunity to buy a potential blue chip crypto project at a lucrative price.\n\nParabolic Year For Uwerx\n\nWhen Uwerx breaks into the mainstream, its disruptive nature will do the rest. With lower platform fees and better security, Uwerx will offer a fundamentally superior service to those currently available on the market. 2023 belongs to freelancers and Uwerx holders. Get in on the presale now and win $5,000 alongside the ongoing 25% purchase bonus..\n\nFind Out More Here:\n\nPresale: invest.uwerx.network\n\nTelegram: https://t.me/uwerx_network\n\nTwitter: https://twitter.com/uwerx_network\n\nWebsite: https://www.uwerx.network/\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiqAFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDQyMDAwNTM3MC9lbi9Ib3JpemVuLUxhdW5jaGVzLUVPTi1pdHMtUHVibGljLUVWTS1Db21wYXRpYmxlLVNpZGVjaGFpbi1vbi1Hb2JpLVRlc3RuZXQtYW5kLU9mZmVycy11cC10by03NTAwMC1pbi1CdWctQm91bnRpZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Horizen Launches EON, its Public EVM-Compatible Sidechain, on Gobi Testnet and Offers up to $75000 in Bug Bounties - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--Horizen, a layer 0 public blockchain network that enables the zero-knowledge network of blockchains, has announced the launch of Horizen EON (Ethereum Open Network), its first public proof-of-stake and Ethereum Virtual Machine (EVM) compatible smart contracting sidechain, on permanent public testnet Gobi. Alongside the testnet launch of EON, Horizen has partnered with Immunefi on a bug bounty program offering up to $75,000 in bounties for reporting vulnerabilities to strengthen the security and integrity of the EON platform.\n\nThe addition of EON, the first of many smart contracting sidechains on Horizen, provides more opportunities for efficient development and usage of a wide range of decentralized applications (dapps) and services than ever before.\n\nHorizen EON is designed to bring EVM compatibility to the Horizen ecosystem, providing solidity developers with the ability to deploy custom logic to the blockchain, enabling continuous innovation at scale without changing the protocol. The smart contracts – coupled with the unbounded and custom blockchain nature of Horizen and its intra-ecosystem secure bridging protocol – offer a sidechain network that is fully permissionless, interoperable and customizable.\n\n\"We're excited to invite the Ethereum developer community to explore the vast possibilities that EON brings to the Horizen ecosystem,\" said Rob Viglione, Co-founder of Horizen and CEO of Horizen Labs. \"With the final testnet phase, we aim to integrate the existing Ethereum DeFi infrastructure with our interconnected network to receive valuable feedback from both our longstanding and new users. This will help us refine our offerings and create a seamless and user-friendly experience for all.\"\n\nThe bug bounty program on Gobi Testnet is the first of several other security and developer incentive programs, including a developer grant program and hackathons, to be launched on Horizen EON. The launch of EON and the accompanying these developer programs open the doors of the Horizen ecosystem to the broader web3 developer community, inviting them to explore the vast possibilities that Horizen offers.\n\n\"Immunefi is excited to collaborate with Horizen in launching their bug bounty program. This partnership showcases our shared commitment to security and excellence, empowering us to build a robust and trusted blockchain ecosystem together,” said Mitchell Amador, CEO of Immunefi.\n\n\"I’m proud of our team’s hard work building out the tech behind our public EVM,\" said Zain Cheng, CTO of Horizen Labs. \"Our focus is on optimizing the advantages of smart contracts within the Horizen ecosystem by providing a smooth development process and user experience through a suite of tools and a range of integrations on EON. In addition to our team's efforts, we rely on the wider community to ensure the security of our platform. Therefore, we invite developers to participate in our Gobi bug bounty program to help us improve EON's security.\"\n\nEarly participants and integrators have already started building on the EON ecosystem, which is supported by a network of products, integrations and developer tools such as Thirdweb, Remix, Truffle, Hardhat, MetaMask, Blockscout, Multichain, Covalent and more. EON has been run on an invite-only testnet and temporary public testnet prior to the launch of Gobi testnet, which is the second-to-last beta stage before the EON mainnet activation later this year.\n\nFor more information, visit the Horizen EON website.\n\nAbout Horizen\n\nHorizen is a layer 0 public blockchain that enables the zero-knowledge network of blockchains powered by the largest node system and a massively scalable cross-chain protocol, Zendoo. Horizen is EVM-compatible and offers tools for developers to custom-build private or public blockchains and dapps with a level of flexibility unmatched by others. By building on Horizen, developers have the freedom to fully customize their blockchains including consensus, speed, privacy and crypto-economies. Blockchains built on Horizen produce massive throughput without compromising decentralization. Please visit https://horizen.io for more information."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9zaGFuZ2hhaXMtYmxvY2tjaGFpbi1hZHZhbmNlbWVudHMtd2lsbC10aGV5LWlnbml0ZS1hLXN1cmdlLWluLWV0aGVyZXVtLWJpdGNvaW4tYW5kLWJpZy1leWVzLWNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Shanghai's Blockchain Advancements: Will They Ignite A Surge In Ethereum, Bitcoin, And Big Eyes Coin? - Analytics Insight",
        "content": "The upcoming Shanghai upgrade of the Ethereum network, marking the end of a two-year shift to proof of stake, has been a topic of interest in recent news. The transition to proof of stake will allow access to approximately $34 billion worth of over 18 million Ethereum (ETH), causing investors to feel uncertain about the potential effects on the value of ETH, Bitcoin (BTC), and Big Eyes Coin (BIG).\n\nBelow, we will delve into this subject to examine the potential implications for ETH, BTC, and BIG.\n\nEthereum’s Optimistic Future: A Positive Outlook for the Cryptocurrency\n\nThe upcoming Ethereum Shanghai upgrade is set to bring about technical improvements to the network and enable staking withdrawals, completing the transition to proof of stake that has been ongoing for two years. However, the distribution of approximately 18 million ETH, valued at $34 billion, to validators after the upgrade has sparked investor concerns regarding the impact on the market value of the second-largest cryptocurrency.\n\nAlthough the withdrawal queue restricts the number of daily requests, analysts predict that the short-term pricing impact will not be as severe as initially anticipated. Moreover, traders have already had access to staked ETH via liquid staking services like Lido even before the Shanghai upgrade. Consequently, some experts believe that Ethereum’s long-term prospects will become more optimistic, given that the market has already priced in the upgrade’s potential effects.\n\nOn the day of its debut, Ethereum’s price increased by 2.95%, reaching a trading price of $1,985.98 and a market capitalization of $239.22 billion. Additionally, the rising competition in cryptocurrency custody is expected to lead to more ETH being locked up, attracting the attention of significant institutions like JPMorgan Chase and Standard Chartered, and potentially leading to a long-term price increase.\n\nBitcoin’s Halving Cycle Shows Familiar Trends from Previous Cycles\n\nNew data suggests that the progress of the current Bitcoin halving cycle is similar to that of previous cycles, with BTC price fluctuations following a comparable pattern. On Thursday, BTC saw a 0.72% increase, which may be partially attributed to the Shapella upgrade. However, analysts are already discussing the potential impact of the block subsidy halving slated for next year, which is expected to reduce the number of BTC miners can create per block.\n\nBTC/USD has risen by nearly 70% in 2023, and the upcoming halving is anticipated to act as a catalyst for Bitcoin’s price to reach all-time highs, similar to what occurred in previous cycles.\n\nBig Eyes Coin Sees Major Victories\n\nBig Eyes Coin, a cryptocurrency inspired by felines, has raised an impressive $33.6 million in presale during the Ethereum Shanghai upgrade. The Big Eyes Coin platform offers several exciting features, including the BIG COMP, a contest that awarded two winners $100K. The platform also boasts the Big Eyes Excali-Paw Chest, which could grant users up to $1 million in $BIG, as well as the BIG Loot and Mintable trading cards available on OpenSea. Moreover, investors can take advantage of the recently launched Stage 13, which is another exciting feature.\n\nBig Eyes Coin is a unique cryptocurrency that places a high value on its investors, providing them with exclusive experiences. Despite its current price of $BIG 1891.89, token holders believe that the asset has enormous potential and are optimistic that its value will increase significantly once it hits the blockchain.\n\nNavigating the Current Market Trends for Cryptocurrencies\n\nIn the current market climate of cryptocurrency, having a well-diversified portfolio of assets is essential. Although Bitcoin (BTC) and Ethereum (ETH) are already considered commodities, it won’t be long before Big Eyes Coin (BIG) becomes recognized as a valuable asset with the potential for substantial returns.\n\nJoin the BIG Space!\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NlbHNpdXMtdG8tc3VlLXRpZmZhbnktZm9uZy1hcy1iaXRjb2luLWV0aGVyZXVtLWRpcC1zaWdudXB0b2tlbi1nZWFycy11cC1mb3ItbGF1bmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Celsius To Sue Tiffany Fong As Bitcoin, Ethereum Dip; SignUptoken Gears Up For Launch - Analytics Insight",
        "content": "The crypto industry is never short of buzz. While Crypto Celsius Network is allegedly planning to sue blogger and creditor Tiffany Fong, the Big Both of Crypto: Bitcoin and Ethereum have fallen aback. There’s also a new player: SignUp Token on the market, and they have something unmissable to offer. Read till the end to know more!\n\nIs there A Celsius vs Tiffany Case In The Cards?\n\nAccording to a court document, the defunct cryptocurrency lender Celsius Network has sought to sue crypto blogger and Celsius creditor Tiffany Fong for disclosing confidential business information. In a screenshot posted by Fong, she revealed her possession of about $11,900 in cryptocurrency, locked on the Celsius Network. Having covered her cause on her Youtube channel, this would not be the first time she has leaked confidential information. However, a filing by Kirkland & Ellis International, Celsius’ legal team, indicates the team has been examining Wong’s leaked information posts. This legal action has sparked interest among the cryptocurrency community, particularly those who are familiar with Celsius Network and Fong’s involvement with the platform.\n\nBitcoin And Ether Dip After Shanghai Upgrade\n\nContrary to optimistic predictions, Bitcoin (BTC) has dipped below the $30,000 level. This has come after a tumultuous trend, including a dip to 1.47%, but still surging across the week by 5% and then fluctuating after the weekend. Meanwhile, after enjoying a 12% surge throughout the week post the Shanghai Upgrade, Ethereum (ETH) dipped by 40%, to the $2k mark.\n\nSignUpToken.com: Future Of Crypto Gearing Towards Launch\n\nSignuptoken.com is an innovative project in the crypto industry, and it stands out as the only project that offers a presale through email sign-ups. With no need to spend any money, you can be part of the DeFi ecosystem and stand a chance to become the next crypto millionaire among your friends. The tokens offered by Signuptoken.com are based on ERC-20 technology, making them advanced and secure.\n\nThe platform also has a robust email validation system to prevent fraudulent sign-ups. By joining their mailing list, you will be notified of their token launch and the opening of their Uniswap exchange. Early adopters are rewarded, just like in the early days of Bitcoin. With more than 4500 email sign-ups already, there are only limited seats left to be among the first million millionaires!\n\nIt is crucial to store your crypto safely, and digital devices are secure, but there is always a risk of hacking. Hence, it is recommended to use a good Bitcoin hardware wallet to protect your assets, including those offered by Signuptoken.com. You might want to hurry up on this one!\n\nIn conclusion, the crypto industry is evolving, and it is essential to choose trustworthy and transparent platforms. The incident involving Celsius Network and Tiffany Fong highlights the importance of confidentiality and trust in the industry. Even the top coins in the market, Ethereum and Bitcoin, are subject to volatility. It is new-and-coming coins like SignupToken.com that offer promise. SignUp Token offers a unique and user-friendly platform for trading cryptocurrencies and earning rewards through its referral system. Make sure to sign up now if you haven’t and benefit from the SignupToken.com referral system by inviting your friends!\n\nFor More Info on Signuptoken.com:\n\nWebsite: https://www.signuptoken.com\n\nTwitter: https://twitter.com/_SignUpToken_\n\nTelegram: https://t.me/SignUpToken\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0by1pbi1ibG9vbS1hLWxvb2stYXQtdGhlLWFwcmlsLTIwMjMtZm9yZWNhc3QtZm9yLWJpdGNvaW4tZXRoZXJldW0tYW5kLWRvZ2V0dGkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Crypto in Bloom: A Look at the April 2023 Forecast for Bitcoin, Ethereum, and Dogetti - Analytics Insight",
        "content": "Cryptocurrency investors are always looking for new opportunities to invest in digital currency. With the recent rise in the popularity of presale platforms, it’s important to stay up to date on market trends. In this article, we’ll closely analyze the April 2023 forecast for Bitcoin, Ethereum, and the new presale coin Dogetti (DETI) and explore the key factors shaping the cryptocurrency market.\n\nBitcoin Climbing Back Bit By Bit\n\nBitcoin (BTC), as the largest cryptocurrency by market capitalisation, has been a strong performer so far in 2023, with prices up 68.4% year-to-date. There are several factors that contribute to this, including increased institutional adoption and a shift in Federal Reserve policy, which has helped to boost investor confidence in the digital currency.\n\nLooking at the positive price performance in March, we can see the potential for a bullish pattern to continue in April. Bitcoin reached $29,000 briefly in late March, but dipped back down to $28,477 at the end of the month, still clocking in a 19.2% monthly gain.\n\nEthereal Economics: The Rising Value of Ethereum\n\nEthereum (ETH), the second largest cryptocurrency by market capitalisation, has also seen gains in 2023, with prices up 49.2% year-to-date. One key factor driving this growth is the rise of Web3, the next generation of the internet, using decentralisation as a key part of the network. Web3 has the potential to revolutionise the way we use the internet, and Ethereum’s position as a key player in this space makes it an attractive investment opportunity for those interested in the future of digital technology.\n\nEthereum also is looking to perform strongly in April, as Ethereum shot up by 9.7% over the month of March, and finished strongly at a price of $1829.\n\nDogetti: The Rise of a New Meme Coin Kingpin\n\nDogetti (DETI) is a new presale coin that is set to launch in just two months and is attracting a lot of attention from many cryptocurrency investors. The coin’s purpose is to create a strong community where holders are regularly rewarded thanks to a 2% reflection protocol, which means that 2% of every transaction is distributed to all wallets.\n\nDogetti also has a unique feature in the form of DogettiSwap, a decentralised exchange built on the Ethereum blockchain where users can trade ERC20 tokens with a 6% tax fee, which is broken down into 2% redistributed to all wallets, 2% to a charity wallet, and 2% for liquidity.\n\nPredicting the future price of any asset is a daunting task, and cryptocurrencies are no exception. Bitcoin and Ethereum have all experienced significant price fluctuations in the past. These digital assets have proven their potential to disrupt traditional finance and create new opportunities for investors and entrepreneurs.\n\nOverall, the April 2023 cryptocurrency market forecast looks promising for Bitcoin, Ethereum, and Dogetti, with each offering unique opportunities for investors.\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9pc3JhZWxzLWNlbnRyYWwtYmFuay1sYXVuY2hlcy1kaWdpdGFsLWN1cnJlbmN5LWJpdGNvaW4tZXRoZXJldW0tc2lnbnVwdG9rZW4tY29tLWNhbi1jYXBpdGFsaXplL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Israel's Central Bank Launches Digital Currency; Bitcoin, Ethereum, Signuptoken.com Can Capitalize - Analytics Insight",
        "content": "In recent years, cryptocurrencies, particularly Bitcoin (BTC) and Ethereum (ETH), have gained significant attention as widely used digital currencies. However, alongside these established players, newer cryptocurrencies like Signuptoken.com (SUT) have also emerged as potential contenders in the evolving crypto landscape.\n\nAmidst this changing payment landscape, Israel’s Central Bank is reportedly considering the development of a Central Bank Digital Currency (CBDC), which refers to a digital form of fiat currency issued and regulated by a country’s central bank.\n\nIsrael’s Digital Shekel Or SHAKED?\n\nThe Steering Committee on the Potential Issuance of a Digital Shekel, or “SHAKED,” is in charge of the Bank of Israel’s investigation into the feasibility of releasing a digital shekel. They have identified a number of scenarios that could influence the creation and use of a central bank digital currency (CBDC), including things like CBDC issuances by other nations, a decline in the use of cash in transactions, the adoption of stablecoins or other private payment methods, competition within the domestic payment system, and technological developments in the payments industry.\n\nThe Bank of Israel acknowledges the necessity to proactively address these issues and maintain control over the nation’s payment system as the landscape of digital currencies continues to change. As a viable means of navigating these adjustments and ensuring that Israel stays at the forefront of financial innovation, CBDC is being taken into consideration. Although negotiations over the creation of “SHAKED” are ongoing, no official decision has been made.\n\nWhy Does Signuptoken.com Gain Attention\n\nSignuptoken.com (SUT) has unveiled groundbreaking features poised to revolutionize the crypto world, positioning it as a valuable asset comparable to gold.\n\nSUT, an ERC-20-based cryptocurrency, is committed to generating financial growth for its members. Despite being a relatively new player in the crypto space, Signuptoken.com has ambitious plans to launch on the Uniswap blockchain once it reaches one million sign-ups.\n\nWhat sets Signuptoken.com apart from other altcoins is its unique approach to fundraising. Unlike traditional initial coin offerings (ICOs) or presale programs, Signuptoken.com only collects email addresses, ensuring equal opportunity for all to increase their financial assets. By joining the exclusive Millionaires Club email list, members may even become eligible for early retirement.\n\nPoised to be a safe asset, Signuptoken.com (SUT) has responded to the clamor from its esteemed Millionaires Club members by introducing a highly anticipated referral system. Also, SUT ensures the security of its funds by taking measures to instill confidence in its platform. It acquired audits and secured listings on established crypto platforms such as CoinSniper and Solidity Finance.\n\nBitcoin And Ether — Likened To Gold\n\nAccording to CoinTelegraph, ARK Invest CEO Cathie Wood believes that cryptocurrencies like Bitcoin and Ether are similar to safe-haven investments like gold in that they offer stability during macroeconomic turbulence. She cites their endurance over the most recent banking crisis, outperforming other asset classes, as proof of their widespread acceptance and adoption, pointing to a potential upheaval of the established order of things.\n\nAs cryptocurrencies gain popularity and come under regulatory pressure from the US government, Wood anticipates that they will play a significant role in the upcoming election. But only some people are as enthusiastic about this idea as she is. The world’s largest hedge fund’s founder, Ray Dalio, is skeptical of Bitcoin due to its volatility and central banks’ unwillingness to accept it as a legitimate form of payment. After the US dollar and the euro, gold continues to be a substantial reserve held by central banks, according to Dalio.\n\nThe emergence of cryptocurrencies and the growing interest in CBDC by Israel’s Central Bank reflect the changing landscape of digital assets. With “gold” cryptos like Bitcoin, Ethereum, and SUT establishing their existence in the crypto world and CBDC being considered a potential digital currency by central banks, the future of payments and financial systems is likely to be shaped by the continued evolution of digital assets.\n\nProvide Your Email on the Signuptoken.com Roster\n\nWebsite: https://www.signuptoken.com\n\nTwitter: https://twitter.com/_SignUpToken_\n\nTelegram: https://t.me/SignUpToken\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vdGltZXNvZm1hbHRhLmNvbS9hcnRpY2xlL3ppbGxpcWEtY29pbi1mdXR1cmUtYTIuMTAyNjY2NNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Does the Zilliqa coin have a future? - Times of Malta",
        "content": "Zilliqa (ZIL) is one of the most talked about and ranked high among currencies that entered the crypto market in recent months. Xinshu Dong, the Chief Executive Officer of Zilliqa, and his team came up with this brilliant idea in 2017. It was his team of dedicated consultants and blockchain algorithm experts who brought Zilliqa to life.\n\nHere's an analysis of Zilliqa's current details and a future prediction of the Zilliqa price.\n\nLet us begin with a quick overview of Zilliqa.\n\nCryptocurrency Zilliqa Ticker symbol ZIL Price $0.02478 Price change 24h +9.52% Price change 7d -7.55% Market cap $393,441,947 Circulating supply 15,867,699,447 ZIL Trading volume $38,448,228 All-time high $0.2563 All-time low $0.002477 Zilliqa ROI +546.14%\n\nInteresting facts you would want to know about Zilliqa\n\nZilliqa is a blockchain network based on Ethereum founded by Prateek Saxena, Amrit Kumar, and Max Kantelia. It is a platform with many decentralized applications and was initially based on Ethereum before it adopted its protocol. Since ZIL was a new entrant into the investment market around 2018, trading it initially needed to be more stable.\n\nAs the blockchain network grows, Zilliqa coin allows you to trade rates, leading to an exponential increase in miners. Zilliqa is the first public blockchain based on sharding technology. Programming languages such as Scilla implement practical Byzantine fault tolerance, and Sharding can solve the scalability problem arising from its platform's active scaling method. Several transactions can be processed simultaneously with Zilliqa, which makes it a good choice for enterprises.\n\nZIL has added a hybrid consensus mechanism backed by a public blockchain platform with high bandwidth to address accessibility issues. There can be no node operation without Proof of Work (PoS) hashing. A unique feature of Zilliqa is its ability to detect fraudulent or spurious transactions by peers, which allows confirmation blocks to trace previous blocks.\n\nWe use cryptographic techniques based on zero-disclosure evidence and mathematical consistency to cross-check this blockchain-enabled transaction without disclosing any personal information about either party. Therefore, security obstacles should be addressed first. There is no doubt that Zilliqa's Zyro protocol is at the heart of the entire decentralized finance ecosystem, which is about to undergo another launch.\n\nZIL (Zilliqa): Its unique features\n\nThis protocol is known for its liquidity and lightning-fast transaction speeds, which makes it different from other Ethereum-based Decentralised Finance protocols and opens up many mining opportunities. According to their website, they're transforming digital infrastructure across various communities.\n\nTherefore, Zilliqa tokens can be used to implement smart contracts and transfer funds. The company has also developed its smart contract language called Scilla, which developers can use to write safe smart contracts. Many shards make it easy to process many transactions cost-effectively, and silicon-smoothly.\n\nZilliqa price prediction 2023\n\nIt is forecast that Zilliqa's price will trade in the range of $0.0195 in 2023. In the near term, ZIL is expected to reach a high of $0.02 and a low of $0.014. By the end of the year, Zilliqa's price is forecast to be approximately $0.016.\n\nZilliqa coin price prediction 2024\n\nAccording to projections, ZIL will have an average price of $0.025 in 2024. There are expectations that ZIL will reach a high of $0.029 and a low of $0.024. A long-term investment in Zilliqa makes sense for investors who plan to hold the company for the long haul. Investing in dips will enable you to make more than 100% over the next two to three years.\n\nZilliqa price prediction 2025\n\nIn the world of cryptocurrency, there may be miracles and short-term magic. Zilliqa's price is estimated to reach $0.05 by 2025, reflecting its rapid growth. Therefore, it is expected to reach a value of $0.057 by 2025. Cryptocurrencies are always viewed as long-term investments by experts.\n\nConclusion\n\nWhile various experts have predicted that Zilliqa (ZIL) will outperform its competitors, Zilliqa has continued to outperform them. Although Zilliqa has set higher benchmarks for itself, the community continues to develop new ones. ZIL's market share in the cryptocurrency market will exceed this platform's expectations since investors have found it to be extremely interactive and intuitive. Zilliqa's token exchange will soon unveil another important launch, supported by a wide range of exchanges. There is no need to exaggerate Zilliqa's rise to $0.0361, even if the same cannot be described as quite buoyant and overstated.\n\nDisclaimer: The information, view and opinions provided in this article are being provided solely for promotional and informational purposes and should not be construed as investment, tax or legal advice."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tZ2FzLWZlZXMtaGl0LW5ldy1oaWdocy_SATtodHRwczovL2JpdGNvaW5pc3QuY29tL2V0aGVyZXVtLWdhcy1mZWVzLWhpdC1uZXctaGlnaHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Gas Fees Hit New Highs During Meme Season - Here's Why - Bitcoinist",
        "content": "The hype around meme-inspired cryptocurrency has caused a spike in the price of Ethereum gas in recent days. The rising demand for transactions on the Ethereum network is a direct effect of the rising value of these tokens.\n\nThere was a 10-month spike in Ethereum’s gas prices. According to data provided by Glassnode, the median price of ETH gas on a seven-day moving average has risen to 43.641 gwei, a level not seen since June 30 last year.\n\nThe network utilizes a measurement system based on the gwei. To perform a transaction or launch a smart contract on the Ethereum network, a certain amount of gas is required.\n\n📈 #Ethereum $ETH Median Gas Price (7d MA) just reached a 10-month high of 43.641 GWEI Previous 10-month high of 43.620 GWEI was observed on 30 June 2022 View metric:https://t.co/6QGDfZoULY pic.twitter.com/n9qDcd6NqD — glassnode alerts (@glassnodealerts) April 21, 2023\n\nGas is a unit of computing effort that is used on the Ethereum network to carry out a certain operation. Gwei is the currency used to denote the cost of the gas needed to perform an action on the network.\n\nOne Gwei is equal to 0.000000001 Ether (ETH), which means that if the gas price is 20 Gwei, it would cost 0.00000002 ETH to execute the operation. The price of gas can vary depending on network congestion and demand.\n\nSince miners are driven by higher gas prices to include transactions with higher gas costs in the blocks they mine, higher gas prices usually result in faster transaction processing times.\n\nETH market cap at $229.8 billion on the daily chart at TradingView.com\n\nEthereum Gas Fees Up 35%\n\nThe median gas price across a 7DMA peaked at 150 gwei in May 2022 and has since decreased significantly to the low-to-mid-teens. Then, beginning in March 2022, it began to settle at roughly 20 gwei, where it remained until the Merge went live in September of that year.\n\nAs of April 20, 2023, the average gas price for Ethereum transactions was 81.94 gwei, up from 60.82 gwei on April 19 and 44.42 gwei in 2022, representing a rise of 34.74% and 84.46%, respectively.\n\nMemecoins are the buzz of the town right now, and Pepe The Frog is spearheading the charge. According to market analysis platform Santiment, recently deployed memecoins such as $TROLL, $APED, and $BOBO have surpassed the top gas-burning altcoins.\n\nIn particular, PEPE’s market cap has increased to little over $89 million in just a few days, making it the sixth largest memecoin.\n\nEthereum Edges Bitcoin In Daily Fees\n\nMeanwhile, independent Ethereum educator Anthony Sassano stated that the second-largest blockchain, Ethereum, had generated 28 times the revenue of Bitcoin through its daily fee structure.\n\nAdditionally, he mentioned layer-2 Ethereum platforms that have exceeded the BTC network in terms of daily revenue, such as Arbitrum One.\n\nImage shows the daily and weekly revenue of various blockchains. Source: Twitter\n\nThe findings also showed Ethereum’s rising prominence in the dynamic cryptocurrency market.\n\nWithin the Ethereum community, gas fees have been a topic of conversation. Certain activities, such as small transactions or interacting with smart contracts of low value, can become prohibitively costly due to the network’s high gas fees.\n\n-Featured image from Zipmex"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNyeXB0b2dsb2JlLmNvbS9sYXRlc3QvMjAyMy8wNC9ldGhlcmV1bS1zaGliYXJpdW0tYnJpZGdlLXVubG9ja2luZy1uZXctcG9zc2liaWxpdGllcy1mb3ItdGhlLXNoaWJhLWludS1jb21tdW5pdHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Ethereum-Shibarium Bridge: Unlocking New Possibilities for the Shiba Inu Community - CryptoGlobe",
        "content": "Meet the Ethereum-Shibarium Bridge, an upcoming solution that promises to enhance the Shiba Inu ecosystem by providing seamless, secure cross-chain transactions for SHIB users.\n\nThe Shiba Inu ($SHIB) project, a decentralized cryptocurrency initiative, was inspired by the widely-known Shiba Inu dog breed meme and developed as an Ethereum blockchain-based alternative to Dogecoin. The Shiba Inu (SHIB) ecosystem features three distinct tokens, each designed for a specific function.\n\nSHIB, the primary token, serves as a decentralized, community-driven currency that is accessible to millions of users around the world. Launched in late 2020 on the Ethereum blockchain, SHIB has gained international attention and can be used for payments at various locations, either directly or via third-party intermediaries.\n\nBONE, the governance token of the ecosystem, has a total supply of 250 million tokens and allows the Shib Army to engage in decision-making by voting on proposals through the Doggy DAO. BONE also underpins the ecosystem’s proprietary Layer 2 network, Shibarium.\n\nLEASH, with a total supply of 107,646 tokens, rewards the ecosystem’s dedicated supporters by offering exclusive perks and access. LEASH holders have previously enjoyed incentivized BONE rewards for providing liquidity on ShibaSwap, exclusive Shiboshi NFT minting access, and early land sale opportunities in the Shib: The Metaverse project.\n\nShibarium is a Layer 2 blockchain developed to address the limitations of the SHIB token’s host chain, Ethereum, particularly its low speed and high transaction costs.\n\nSHIB influencer Lucie Sasnikova recently explained the workings of the Ethereum-Shibarium Bridge. According to her, the bridge between the two major blockchain networks requires a secure and robust cross-chain solution. Shibarium achieves this through the use of Plasma and PoS security, creating a trustless and bi-directional transaction environment between Shibarium and Ethereum.\n\nThis bridge allows users to transfer tokens between networks without third-party risks or liquidity impacts. It is designed to be fast, cost-effective, and versatile while also serving as a scaling solution. The bridge leverages a dual consensus architecture (Plasma + PoS platform) to prioritize speed and decentralization and enables arbitrary state transitions on sidechains with EVM support.\n\nAs tokens cross the bridge, their circulating supply remains unchanged. When a token leaves the Ethereum network, Shibarium mints an equal number of pegged tokens (1:1). To transfer tokens back to the Ethereum network, they are burned on Shibarium and unlocked on Ethereum during the process.\n\nThe beta test network for Shibarium is named PUPPYNET. As per the blockchain explorer BlockScout, currently (i.e., as of 5:40 p.m. UTC on April 20, the beta version of Shibarium has successfully executed 4,290,709 transactions. Data from this PUPPYNET explorer indicates that the number of wallet addresses utilizing Shibarium beta has reached 13,993,009. Presently, the gas fees are 1.51 Gwei, which is virtually cost-free."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYml0Y29pbmlrLmNvbS9kZWZpLXByb3RvY29sLXVubG9jay1oYWNrZWQtZm9yLTIwLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Defi Protocol \"Unlock\" Hacked For 20 Ethereum - Bitcoinik",
        "content": "Reportedly Unlock Protocol was compromised and the hacker successfully drained 20 ETH from the platform.\n\nUnlock is a Defi protocol that provides the ability for creators to monetize their digital content with a few lines of code in a fully decentralized way.\n\nOn 21 April 2023, Crypto security platform Cyvers reported that Unlock Protocol was compromised by an unknown hacker & that hacker successfully drained 20 ETH from the platform.\n\n🚨 BREAKING: @UnlockProtocol has been hacked and 20 ETH has been stolen, hacker has received funds from @TornadoCash ,deployed a malicious contract and executed the transactions. pic.twitter.com/qawb09dDaj — 🚨 Cyvers Alerts 🚨 (@CyversAlerts) April 21, 2023\n\nInvestigation revealed that the hacker tricked the platform with the help of the protocol’s smart contract vulnerability in the postLockUpgrade() function, which helped the hacker to withdraw funds without user verification.\n\nTo remain anonymous, hackers used the popular Ethereum crypto mixer platform Tornado Cash, which is banned in the US since 2022.\n\nAt present, it is unconfirmed whether the Unlock Protocol team is aware of this hacking incident or not because there is no information/notice/warning about this hack attack seen on Twitter or the official website.\n\nUDT price action\n\nUDT is the native token of Unlock Protocol and the current trade price of the UDT token is $8.34. The trade price of this token is 40% down over the last 24 hours.\n\nAnd this high downfall in the price of this coin is a sign that UDT token holders are now in a panic over their investment.\n\nBitrue exchange\n\nEarlier this we reported that the Bitrue crypto exchange became a victim of a hack attack, in which the exchange lost $23 million worth of crypto assets.\n\nExchange confirmed that its security team was working with other crypto platforms, where hackers tried to interact with the stolen funds, and also confirmed that the Exchange will release compensation over the loss that users faced in the hack attack.\n\n3/4: To conduct additional security checks, Bitrue will temporarily suspend all withdrawals and will reopen withdrawals on 18 April 2023. We seek your understanding and patience at this time. All identified users who are affected by this incident will be compensated in full. — Bitrue (@BitrueOfficial) April 14, 2023\n\nRead also: Kiyosaki says Bitcoin didn’t need government bailout"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3LmJ1c2luZXNzMjQtNy5hZS9ob3ctdG8tYnV5LWV0aGVyZXVtLWluLXVhZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "How To Buy Ethereum in UAE | 2023 Award Winning Crypto Exchanges - Emirates Business 24/7",
        "content": "Page Summary\n\nEthereum is a popular cryptocurrency with a market capitalization of over $232 billion. According to Coinmarketcap it is the second leading cryptocurrency and has the support of international business leader Mark Cuban. If you’re considering investing in Ethereum, this article is for you.\n\nWhere to Buy Ethereum in UAE\n\neToro – Overall best exchange for UAE residents Coinbase – best exchange for beginner traders. OKEX – best exchange for lowest trading fees in UAE. Binance – best diversity and premium platforms for traders at all levels.\n\nRANK BROKER GENERAL PLATFORM SCORE BEST FOR WEBSITE #1 eToro Superior social trading experience 4,9/5 Best overall offer Official website #2 Coinbase For traders at all levels 2,6/5 Best beginner-friendly services Official website #3 OKEX Excellent of its safety measures 0,0/5 Lowest trading fees Official website #4 Binance Best portfolio with a focus on diversity 3,1/5 Asset diversity and premium platforms Official website\n\nOur Top 4 Ethereum Exchanges in Overview:\n\n1. eToro – The Best Overall Offer For UAE Residents Rating: 4,9/5 Min Deposit: $50 Fees: 4.8 Assets available: 4.8 Total Fees: Open account Read review Crypto assets are unregulated & highly speculative. No consumer protection. Capital at risk. eToro is the leading social trading brokerage firm with an excellent day trading platform. It offers a proprietary platform, a web platform, and a dedicated social trading space. This broker offers premium research tools, including social sentiment and an economic calendar. eToro has some of the best day trading services for experienced investors. Open account Crypto assets are unregulated & highly speculative. No consumer protection. Capital at risk. 2. Coinbase – Beginner Friendly Services Rating: 2,6/5 Min Deposit: Fees: 2.7 Assets available: 3.6 Total Fees: Open account Read review Coinbase is the leading US-based cryptocurrency exchange with a beginner-friendly platform. It is popular because of its secure and straightforward website, Coinbase Pro. It offers access to 14 different cryptocurrencies, including Bitcoin, Litecoin, and Ethereum. Coinbase has an excellent platform for traders at all levels. The standard fee is 1.49%, and the typical cost for trading Bitcoin by selling another crypto coin in your wallet is 0.50%. Open account 3. OKEX – The Lowest Trading Fees For Buying Bitcoin In The UAE Rating: 0,0/5 Min Deposit: Fees: Assets available: Total Fees: Open account Read review OKEx is a popular cryptocurrency exchange with an impressive trading volume. It is a top choice for buying and selling cryptocurrency in the UAE with low costs. OKEx has a competitive fee structure, and its commissions start at 0.10% per slide. This exchange has an excellent reputation because of its safety measures. Open account 4. Binance – Offers Asset Diversity And Premium Platforms For Traders At All Levels Rating: 4,8/5 Min Deposit: Fees: 4.8 Assets available: 5.0 Total Fees: Open account Read review Binance is a leading cryptocurrency exchange with the best platforms and services for Bitcoin day trading. It offers access to hundreds of digital currencies, including Bitcoin. Binance has low commission fees of 0.1%. It provides access to advanced charting and analysis tools. Binance is a good fit for professionals, as its learning tools are limited. It has many premium services, including crypto staking. Open account\n\nRelated: Best cryptocurrency exchange UAE, Best Bitcoin Trading Platform\n\nHow To Buy Ethereum In UAE And Dubai\n\nBuying Ethereum in UAE is legal, safe and simple, but you need to choose the right broker or cryptocurrency exchange. The most common way to buy Ethereum is to find an exchange, set up a trading account, deposit funds, buy Ethereum and store it in a e-wallet.\n\nStep 1: Choose A Trading Platform or Exchange\n\nFind a trustworthy exchange that matches your level of experience. The most common exchanges to buy Ethereum are eToro, Coinbase, Bitstamp, Binance, and Kraken.\n\nThe main criteria to consider is the type of exchange available. A reliable cryptocurrency trading platform offers either a fiat exchange or a cryptocurrency-to-cryptocurrency (C2C) exchange. Fiat exchanges are a top choice for trading Ethereum. Beginner crypto investors choose platforms with fiat exchanges. Experienced investors with a versatile digital portfolio choose C2C exchanges.\n\nStep 2: Set Up An Account\n\nAfter you decide on a exchance, the next step is to set up an trading account. It is a straightforward process, and you’ll need to submit your name, address, social security number, and a type of identification.\n\nEach crypto trading account requires verification. These requirements mean you’ll have to upload a document to verify your identity. This step takes between one hour and two days, depending on the exchange.\n\nStep 3: Fund Your Account\n\nWhen your account passes the KYC verification process, you are allowed to deposit currency into your account. The advantage of cryptocurrency exchange platforms is that they don’t have a high minimum investment. Most exchanges have fees per trade.\n\nStep 4: Buy Ethereum\n\nThe next step is to start trading Ethereum. After you fund your account, you’ll be able to begin buying Ethereum and other digital coins available on your exchange. Each exchange has a personalized interface suitable for either beginner or experienced traders. Check our in-depth reviews to read more about the best cryptocurrency exchanges with user-friendly interfaces.\n\nStep 5: Withdraw Ethereum Into A Wallet\n\nBuying Ethereum through an exchange lets you withdraw that currency into your bank account or digital wallet. Withdrawing is a straightforward process with different processing timeframes depending on the exchange you choose.\n\nHow To Buy Ethereum Using eToro Exchange\n\nOne of the top choices for buying Ethereum is eToro. Here is a step-by-step guide using eToro to buy Ethereum in the UAE.\n\nStep 1: Create A Brokerage Account With eToro\n\nThe first thing you need to do is open an account with eToro. On its official website, you’ll find the sign-up form requesting:\n\nYour full name\n\nResidential address\n\nSource of Funds\n\nDate of Birth\n\nContact Information\n\nOnce you’ve submitted that information, the next step is to verify your brokerage account.\n\nStep 2: Verify Your Brokerage Account\n\neToro allows investors to trade no more than $2,000 before verifying their accounts. You’ll have to submit an image of your ID and proof of residence. eToro follows strict U.S. regulations, so verifying your account is mandatory.\n\nStep 3: Fund Your Account\n\neToro offers access to many funding options. Choose the funding options that meet your needs. After you fund your account, the next step is to buy Ethereum.\n\nStep 4: Buy Ethereum\n\nWhen the funds appear in your wallet, eToro will allow you to complete your first Ethereum purchase. Ethereum has the ticker symbol ETH and selecting it will begin to set up your trade. Choose the amount of ETH you’d like to purchase and click “Submit.” Your transaction will complete in a matter of minutes.\n\nRelated: How to buy Bitcoin in UAE, How to buy cryptocurrency in UAE\n\nHow To Sell Ethereum?\n\nSelling Ethereum is a simple process. Go to your crypto wallet and select the amount you want to sell. Keep in mind that cryptocurrency profits are taxable as capital gains. That means you should speak with a tax professional before you sell a substantial amount of crypto assets.\n\nShould I Buy Ethereum?\n\nEthereum is a popular coin with investors at all levels of experience. Before purchasing a volatile investment like Ethereum, you should learn more about cryptocurrency investments. Our in-depth reviews offer insights on cryptocurrency and the best strategies available.\n\nRelated: Best Cryptocurrency to invest\n\nRelated:\n\nBest AI Trading Platforms\n\nBest Algorythmic Trading Platforms\n\nBest Leverage Trading Platforms\n\nBest Crypto Staking Platforms\n\nBest UAE Crypto Exchange\n\nHow to buy Ethereum in UAE\n\nHow To Buy Cryptocurrency in UAE – A Step by Step Guide\n\nBest Cryptocurrency Exchange Dubai\n\nBest Cryptocurrency to invest\n\nBest Bitcoin wallets\n\nBest Crypto Day Trading Platform\n\nBest Crypto signals telegram groups\n\nBest Crypto trading bots\n\nBest Crypto portfolio trackers\n\nHow To Buy Bitcoin in UAE and Dubai\n\nBest Cryptocurrency Exchanges for Bitcoin Trading"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vd3d3LmJ1c2luZXNzMjQtNy5hZS9iZXN0LWFsdGNvaW5zLXRvLWJ1eS1pbi11YWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Apr 2023 07:00:00 GMT",
        "title": "Best Altcoins to Buy in UAE in 2023 - Emirates Business 24/7",
        "content": "Page Summary\n\nWhich altcoins are going to have a good 2023? And what will the future bring? Even in 2023, you cannot ignore Bitcoin, but in this article, we look at altcoins. Read on to find out what the best altcoins to buy in the UAE in 2023 are.\n\nBest Altcoins to Buy in UAE in Overview:\n\nLuckyBlock\n\nOur recommended altcoin to buy this year is LuckyBlock. The team behind this project wants to launch a blockchain lottery, which is more transparent than traditional lotteries. LuckyBlock has a great following on Telegram which consists of over 24,500 followers. LuckyBlock is still in presale at the moment. You can be one of the early investors in LuckyBlock by buying it via PancakeSwap.\n\nEthereum\n\nEthereum is an open-source blockchain network that supports decentralized applications. It also supports other cryptocurrency platforms active in the DeFi industry, such as Aave (AAVE) and Uniswap (UNI). The popularity of DeFi has risen to great heights in recent times. This is due to the fact that it wants to decentralize the world of loans, insurance, and savings programs. Ethereum’s vision is to make these institutions independent from centralized financial institutions and banks. The popularity of DeFi contributes to Ethereum’s strong position in the crypto world. There seems to be no end to that for the time being, which makes Ethereum a very good investment for the coming years.\n\nBuy Ethereum on eToro\n\nSolana\n\nSolana is one of the fastest-growing blockchains and networks. The protocol is able to resolve over 70,000 transactions per second and is better scalable than other blockchain technologies. There is also the possibility to deploy smart contracts on Solana, which makes it a direct competitor of Ethereum in the DeFi space. The biggest reason for investors to invest in Solana is that it doesn’t have the scalability issues Ethereum has.\n\nBuy Solana on eToro\n\nBinance Coin\n\nBinance Coin is the native token of Binance. The more Binance Coins traders have, the fewer transaction fees they have to pay. Binance ‘burns’ these tokens every quarter, so they become more valuable over time. Binance Coins are like shares in Binance. Apart from this, Binance has its own blockchain, called the BEP-20 Smart Chain. New cryptocurrencies can be launched on this blockchain. This increases the value of Binance’s BNB tokens as they are the only bridging currency. Analysts expect that BNB coins will continue to rise in price for the time being. For this reason, we recommend investing in Binance Coins.\n\nBuy Binance Coin on eToro\n\nPolkadot\n\nMore and more companies, institutions, and projects are choosing Polkadot. This is one of the reasons it’s going to be a huge success in the coming years. Another reason is the interoperability of the platform. Polkadot uses chains called “parachains”. These chains communicate with the main chain called the ‘Relay Chain’. A special feature of this technology is that these chains connect to chains of other cryptocurrencies, such as Bitcoin and Ethereum. This is possible thanks to so-called ‘bridges’. Polkadot’s technology is groundbreaking and holds great promise for the future. None of this would have been possible without the ‘Substrate’ framework. This makes it possible to develop your own blockchain using advanced technology. All blockchains designed using Substrate can be active on the Polkadot network.\n\nBuy Polkadot on eToro\n\nPolygon\n\nPolygon is another protocol that tries to solve Ethereum’s scalability issue. It tries to do this by using Ethereum-compatible blockchains called para chains. If Polygon succeeds in doing so, it will raise a lot in price, like Ethereum. Polygon Studios is somewhat of a side project of Polygon that focuses on the entertainment and media industry. Polygon Studios has partnered up with eDAO to explore the likes of web3 and NFTs.\n\nBuy Polygon on eToro\n\nCosmos\n\nCosmos is an open-source blockchain project that aims to increase the scalability of other blockchains. It tries to do this whilst staying decentralized. Interoperability is the key to the success of this project and if it succeeds in doing so, investors will be rewarded. Users can deploy dApps on Archway, which is Cosmos’ alternative to Ethereum’s smart contracts.\n\nBuy Cosmos on eToro\n\nFantom\n\nThe Fantom Foundation is building a platform that includes fast, scalable, and distributed DAG-based registers that use aBFT principles to achieve consensus. They are also developing a compiler that can authenticate a virtual machine to run the smart contract. It does this with the Lachesis protocol. Fantom is still quite cheap, so early investors can pick up a lot of coins now at bargain prices.\n\nBuy Fantom on eToro\n\nCardano\n\nCardano is an excellent cryptocurrency investment right now for several reasons. First of all, the Cardano blockchain is very secure due to its decentralized nature. The layered architecture meanwhile ensures enough scalability. This gives Cardano enormous potential for the future. Moreover, the project was only launched after extensive peer-reviewed research. So it has a good scientific basis. Finally, the blockchain is stable and very sustainable, as Cardano is unminable. In short: we have high expectations of Cardano. In the coming years, we will see if this crypto lives up to its potential.\n\nBuy Cardano on eToro\n\nDecentraland\n\nVirtual worlds are on the rise. New inventions such as VR glasses contribute to this. You may have heard of Second Life, an online world where you can role-play the life of your in-game character. Decentraland is the virtual world on the blockchain. In this world, users pay with MANA. With this MANA they can buy digital land ownership and services. If you want to invest in the metaverse, Decentraland’s MANA might be your best bet.\n\nBuy Decentraland on eToro\n\nHow to buy altcoins and new cryptos?\n\nYou buy altcoins and new cryptos on cryptocurrency exchanges like eToro. Some new cryptocurrencies can only be bought on decentralized exchanges like PancakeSwap. If you want to invest in an altcoin, Lucky Block, for example, you do the following:\n\nVisit the PancakeSwap exchange. Connect your crypto wallet with PancakeSwap. Available wallets include MetaMask, Binance Smart Wallet, and Trust Wallet. Add funds to your wallet. You need either Bitcoin or Ethereum to buy most altcoins. Swap your funds for the desired altcoin or token. You do this by trading the correct cryptocurrency pair. Buy Lucky Block\n\nHow to buy crypto on eToro?\n\nYou buy crypto on eToro by opening an account, verifying and funding it, and then buying the crypto you want to invest in. Follow the steps below if you want to buy crypto on eToro:\n\nOpen an eToro account:\n\nGo to the eToro website and click on ‘Create Account’. You will be asked for your personal details. Fill these in and click ‘Submit’.\n\nVerify your identity:\n\neToro will ask you to verify your identity. You do this by uploading a picture of your driver’s license, government-issued ID card, or passport. Sometimes you will need to upload a recent utility bill or bank statement as proof of address.\n\nFund your account:\n\nClick on ‘Deposit Funds’ from within your eToro account. You will now have several different payment methods available to fund your account. Users can choose to fund their accounts with e-wallets like PayPal and Skrill, credit cards, or by bank wire transfer. Buy the crypto you want to invest in:\n\nFill in the name of the crypto you want to invest in in the search bar. A popup will show up with its current price. Click on ‘trade’ to invest in the cryptocurrency.\n\nBottom Line\n\nThere are many interesting crypto investment opportunities right now. Our recommended altcoin for 2022 is LuckyBlock, but there are also many other options. Always be sure to trade cryptocurrency on a regulated and reliable cryptocurrency exchange like eToro."
    }
]