[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzAzL2NvaW5kZXNrLXZhbGlkYXRvci16ZWxkYS1zdWNjZXNzZnVsbHktZXhpdHMtZXRoZXJldW0tYXMtd2l0aGRyYXdhbC1xdWV1ZS1zaHJpbmtzLXRvLTktZGF5cy_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8wMy9jb2luZGVzay12YWxpZGF0b3ItemVsZGEtc3VjY2Vzc2Z1bGx5LWV4aXRzLWV0aGVyZXVtLWFzLXdpdGhkcmF3YWwtcXVldWUtc2hyaW5rcy10by05LWRheXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "CoinDesk Validator ‘Zelda’ Successfully Exits Ethereum as Withdrawal Queue Shrinks to 9 Days - CoinDesk",
        "content": "Currently, the withdrawal queue sits at about nine days, indicating that the requests for validators to be removed from the blockchain has calmed down. At its peak, the withdrawal queue was at 17 days."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvam9lLWx1YmluLXRoZS10cnV0aC1hYm91dC1ldGgtZm91bmRlcnMtc3BsaXQtYW5kLWNyeXB0by1nb29nbGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Joe Lubin: The truth about ETH founders split and 'Crypto Google' - Cointelegraph",
        "content": "\n\nThere’s a narrative that’s grown up around Ethereum’s two most important co-founders, Joe Lubin and Vitalik Buterin, to explain how they went in different directions almost a decade ago.\n\n\n\nIt suggests the pair fell out over the blockchain’s future direction, with the idealistic 20-year-old Buterin determined to turn Ethereum into a nonprofit foundation, while Lubin and others wanted to commercialize the technology via a for-profit company.\n\n“That wasn’t really what happened,” the billionaire founder of Ethereum infrastructure and software firm ConsenSys tells Magazine during an in-depth interview in Tel Aviv.\n\n“What happened was people were looking for a way to explain why these two people were bumped out of the project. And that was a convenient way to label it. But that wasn’t the reason they were moved.”\n\nLubin’s referring to Ethereum’s infamous “Red Wedding” in 2014 when the eight co-founders and the team gathered to incorporate Ethereum as a company.\n\nFormer Ethereum CEO Charles Hoskinson (right) with creator Vitalik Buterin (left) from back in the day. (Flickr)\n\nThe meeting descended into bickering and infighting over internal politics that saw a devastated CEO Charles Hoskinson pushed out of the team, along with underperforming co-founder Amir Chetrit.\n\n“I think it’s true that I and several people on the team — like maybe everybody else — believed that you need to draw businesses in, you needed economic, commercial validation in order to build better things, even open-source software,” the 58-year-old says in his slow, measured tones.\n\n\n\n“But that wasn’t the root of why I started ConsenSys or why two people were bumped off the project.”\n\nRed Wedding and Crypto Google\n\nAs documented in Camilla Russo’s history of Ethereum, The Infinite Machine, the co-founders had gathered in Zug, Switzerland on June 7, 2014, to sign a document transforming Ethereum into a for-profit company. But instead of signing the contract, tensions boiled over Hoskinson’s management style and personality, Chetrit’s contribution to the project, Ethereum’s future direction and other internal political issues.\n\n\n\n\n\nAfter much back and forth, the decisions were all left to the gangly 20-year-old math genius who’d created the project in the first place. After some time alone on the terrace, he returned to say Hoskinson and Chetrit were out, and Ethereum would become a nonprofit foundation instead of a company.\n\n\n\n“Vitalik wrote an amazing white paper — it was right place, right time, incredible vision — and it attracted lots of people of disparate backgrounds, and we worked together well for chunks of time,” Lubin says by way of context.\n\nJoe Lubin in conversation with Magazine in Tel Aviv.\n\n“We had differences of opinion, at times, those differences of opinion boiled over famously… infamously. And there was a moment where two people were bumped out of leadership, and up to that point, we were having discussions about whether we were going to be purely nonprofit, or whether we were going to pursue a nonprofit track, put it under a foundation, and then the same group of people who worked so nicely together would build Crypto Google together.\n\n“And it became apparent to all of us that we probably weren’t going to build Crypto Google. But it was also clear to all of us that nobody was even close to being able to build Crypto Google and that we’re just building the foundation and the platform for a long time.”\n\nLubin was already planning his own for-profit company to build out Ethereum’s application layer when the decision was made, and it spun into life not long afterward.\n\nWhile other co-founders, such as Gavin Wood (Polkadot), contributed more to the early protocol itself, arguably none of them, apart from Buterin, has since contributed as much as Lubin to what Ethereum is today. While ConsenSys didn’t turn into Crypto Google, its infrastructure and apps are as important to Ethereum now as Google is to the web.\n\n“ConsenSys wasn’t formed to commercialize it. It was formed to continue the vision and the mission of the Ethereum platform,” Lubin explains.\n\n\n\nRelated: The Vitalik I know — Dmitry Buterin\n\nWho is Joe Lubin?\n\nBorn in Toronto in 1964, Lubin studied electrical engineering and computer science at Princeton in the mid-1980s, where his roommate was another future crypto billionaire, Mike Novogratz of Galaxy Digital. Amazon founder Jeff Bezos was in the same faculty, though Lubin tells Magazine they never met.\n\nJoe Lubin was almost 50 before he jumped on board the Ethereum train and made his first billion.\n\nLubin has had a surprisingly diverse career, working in AI, robotics and autonomous music creation for a number of different employers. He founded a hedge fund and was the vice president of private wealth management at Goldman Sachs, but nothing world-changing, according to Novogratz, as quoted in the Financial Times in 2021.\n\n“Joe was one of the brightest among us, a forward thinker, but by 45 hadn’t done anything to stand out,” Novogratz recalled. “I don’t think any of our gang would have guessed how things would turn out.”\n\n\n\nRelated: Here’s how Ethereum’s ZK-rollups can become interoperable\n\nThe combination of his near-front-row seat to the September 11 attacks on the World Trade Center and then the global financial crisis shook him to his core. He said at the ConsenSys Ethereal Summit in May 2017 that the events had made him feel as though “we were living in a global society and economy that was figuratively, literally and morally bankrupt.”\n\n\n\nHe believed a slow, cascading financial collapse was taking place, which made him receptive to the ideas in the Bitcoin white paper, which he read in 2011. The following year he moved to Jamaica with his girlfriend, who was trying to forge a career in dancehall music, and he became a music producer while investing in Bitcoin and waiting for the collapse.\n\nDuring a trip home to Toronto in late 2013, he attended a Bitcoin meetup alongside another co-founder, Anthony Di Iorio, and encountered a kid named Vitalik Buterin, who was touting his just-written white paper for an improved version of Bitcoin called Ethereum. Lubin was “blown away,” and he became an official co-founder in early 2014.\n\nThe core early Ethereum team at the house rented for Bitcoin Miami 2014, including Joe Lubin in the back row, second from right. (yanislav.medium.com)\n\n\n\nApproaching 50, he was an odd fit with a bunch of anti-establishment 20-something-year-old coders, but his Jamaican music production background gave him just enough cachet with the team to get by. And, of course, Lubin and Di Iorio personally bankrolled around $500,000 to $800,000 of the funding necessary to get Ethereum off the ground.\n\nLubin’s experience also helped the team avoid potential pitfalls and roadblocks, and he insisted on early meetings with the United States Securities and Exchange Commission and hiring high-priced lawyers to minimize the extraordinary legal risks.\n\nConsenSys arises!\n\nConsenSys was founded in Switzerland in October 2014 for legal reasons, which subsequently led to a nasty ongoing court battle between employees and shareholders who claim they weren’t properly compensated when the assets were transferred to an American entity.\n\nRelated: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide\n\nBut it actually operated from a graffiti-covered warehouse in Bushwick, Brooklyn. The aim was to build out applications and infrastructure for Ethereum by investing in startups, incubating projects and consulting with firms like JPMorgan and BHP Billiton on how to incorporate this new technology. It spawned more than 50 businesses early on, including a poker site, a prediction market and a healthcare records firm. But by all accounts, its early years were pretty slapdash, with no real corporate structure.\n\nMetaMask co-founder Dan Finlay spoke about the early days on the Epicenter podcast.\n\n\n\n“ConsenSys was this wonderful, just kind of chaotic incubator at the early stages. I don’t know, there must have been hundreds of different experiments getting validated and tried out there. And there was a really exciting energy,” he says, adding that a lot of projects got built before Ethereum could support them:\n\n“Back then, it was very normal to just kind of build your application as if the blockchain was going to scale or did scale already.”\n\nIn 2018, a Forbes investigation suggested that pretty much all of ConsenSys’ projects were in the red, and the company was burning $100 million a year on non-profitable projects, including an asteroid mining company.\n\nForbes took aim at ConsenSys in a 2018 investigation. (Forbes)\n\nNot long after, Lubin axed a bunch of underperforming projects, culled the 1,200-strong headcount and reset the company into ConsenSys 2.0 with a much more corporate and accountable culture.\n\nDespite being worth $7 billion after its most recent $450-million fundraising round in 2022, ConsenSys let go of another 11% of its staff in January of this year. Lubin tells Magazine it was readying itself to survive bad conditions as “macroeconomic and geopolitical” storm clouds gathered.\n\n“We wanted to ensure that we had significant runway so that we can stay strong and build,” he says, revealing it was eyeing a number of acquisitions that “if we’re able to bring some on board that will add really valuable pieces.”\n\nI am excited to share news of our Series D fundraise. https://t.co/SZP36mgBfl — Joseph Lubin (@ethereumJoseph) March 15, 2022\n\nCentralization vs. decentralization\n\nAnyone who’s listened to Lubin speak will know that he’s genuinely committed to, and a proponent of, the benefits of decentralization.\n\n\n\nSo, is there tension between running a centralized company like ConsenSys that provides the crucial infrastructure to a decentralized blockchain?\n\n“I don’t think there’s a tension,” he says.\n\n“It’s all about progressive decentralization. There’s nothing wrong with having an entity that is organized in one way that is trying to build something that is organized in a different way.”\n\nLubin explains that the products ConsenSys is building need to achieve “product-market fit; otherwise, they’re kind of useless, and so bringing something forth, wholly and perfectly decentralized, is very difficult — it may be impossible.”\n\nConsenSys plays a big role in the Ethereum ecosystem.\n\nConsenSys’ most crucial infrastructure is called Infura, which offers Ethereum nodes as a service, making it easier for developers and users to connect to the network. It’s basically an intermediary service between decentralized apps (DApps) and the blockchain that projects rely on to stay up and running.\n\nInfura probably works a little too well, as much of the Ethereum ecosystem is dependent on it. That means if Infura goes down, so too do half the network’s projects, including Uniswap, Compound, MetaMask and Aave.\n\nIt’s also a weak point for censorship and was criticized by some for complying with the Tornado Cash sanctions.\n\nDecentralizing Infura\n\nConsenSys has been working on a plan for some time now to “decentralize Infura.” This will take the form of a marketplace of competing infrastructure providers that offer similar services, of which Infura itself would be one.\n\nLubin believes it’s “extremely important” to make this happen.\n\n“I’ve been a proponent of decentralizing Infura since the start but more actively since five years ago,” he says.\n\n“What we’ve run into is that our ecosystem keeps having these wicked growth spurts,” he continues, adding, “It was a sub-priority to keep things going rather than to start a parallel project to parallelize and decentralize — and that’s going pretty well right now.”\n\nThe protocol will either be called XFura or the Decentralized Infura Network Protocol.\n\n“The idea is that we believe now that we can take a high-performance product and federate the protocol, initially do a lot of hand-holding with other providers and then we situate Infura on the protocol,” he says.\n\n“It’s pretty close. There are a bunch of very sophisticated partners that are working closely with EG [Galano], the lead of the project. I can’t give you a date.”\n\nAlthough Infura researcher Patrick McCorry went out of his way in an interview with Cointelegraph to say censorship resistance was not the point of decentralizing Infura, that’s certainly one of the benefits.\n\n\n\nA decentralized network would enable DApps to pick and choose providers, allowing them potentially to get around censored protocols or addresses like Tornado Cash.\n\n“I like the idea that there’s optionality,” says Lubin, carefully noting that different providers would operate in different nation-states and jurisdictions.\n\n“I think that works well if there’s a lot of them and if there’s real choice, so you can always go to an uncensored service and be sure that they’ve got enough validating power so that you’re gonna get your transaction processed fairly rapidly.”\n\nHowever, he adds it’s equally possible that future aspects of the protocol are obfuscated so that no one actually knows what’s in a packet or a transaction. He says he knows of people already “working on protocol enhancements” who will make this happen, and the explosion of layer 2s and layer 3s makes it even more likely.\n\n“If they’re already glommed in and impossible to read, then it’s hard to imagine that regulators will either care that much or have the ability to do anything,” he says.\n\n\n\n“I’m sure [there is] lots of criminal activity that flows through AWS and Azure and every mail server everywhere. So, there’s a level of infrastructure that you just can’t halt because it’s doing mostly useful activity.”\n\nDecentralizing MetaMask\n\nThe other core bit of infrastructure provided by ConsenSys that underpins the entire Ethereum ecosystem is its ubiquitous browser wallet MetaMask. It’s also being sort of decentralized by crowdsourcing the development of new features and the addition of new blockchains.\n\n\n\nCalled MetaMask Snaps, it’ll turn the browser wallet into a permissionless platform for others to build on — one proof-of-concept Snap enables MetaMask to act as a Bitcoin wallet.\n\nJoe Lubin has arguably made a bigger contribution to Ethereum than any other co-founder apart from Vitalik Buterin.\n\n“The MetaMask Grants DAO [decentralized autonomous organization] will get increasingly decentralized and will incentivize people to build cool things, to start companies that permissionlessly innovate that we have nothing to do with,” says Lubin.\n\nHe explains that over the years, MetaMask was approached by numerous blockchains looking for support, but after they’d crunched the numbers, there wasn’t enough activity to justify splitting its focus from Ethereum. Snaps, though, will open the doors to everyone.\n\nCrypto regulations\n\nLubin is unconcerned about the possibility of Ethereum being declared a security, saying, “It’s as likely and would have the same impact as if Uber was made illegal.”\n\n\n\n“There would be tremendous outcry from not just the crypto community but different politicians, certain regulators.”\n\nThere’s a sense of frustration from Lubin that this ground even needs to be covered again, saying that ConsenSys has been through all of this in discussions with the SEC and Commodity Futures Trading Commission over many years.\n\n“We went in there on a voluntary basis five years ago or something like that, when they’re just trying to wrap their heads around what tokens were,” he says.\n\n\n\n“They thought back then that everything was a security; we think [we] helped them significantly understand that lots of tokens are not securities and then they went away, and Gary and his team now think almost everything’s a security.”\n\nBut he believes that the renewed focus on regulations in the wake of the FTX and stablecoin collapses will ultimately be a good thing.\n\n“We now have the world’s attention, and smart people who care will prevail because it just makes sense,” he says.\n\n\n\n“And sure, there will be people with agendas who don’t want to see it that way. Maybe the banking lobby will help them not see it that way. But in terms of finally paying a lot of attention to trying to regulate an important space, I do believe that clear heads will think through this and that people will start to understand the benefits of decentralization and make good regulation for CeFi [centralized finance] and no regulation for tech, crypto.”\n\nCrisis equals opportunity\n\nIn fact, Lubin is remarkably philosophical and sanguine about all the regulatory, game theory and technological challenges facing Ethereum. For example, he concedes centralization of staking on platforms like Lido could become a concern, but because progressive decentralization is baked into the nature of the ecosystem, it won’t be a problem for long.\n\n“Things don’t start very decentralized,” he says. “These are still pretty new innovations, and our ecosystem is pretty exacting. If you want to be in the Ethereum ecosystem proper, then you’re not going to want to try to dominate something, you’re not going to want to operate centralized for very long. The ecosystem will identify that as problematic and come up with solutions for it, which is great.”\n\nIn Lubin’s world view, problems are just short-term issues you deal with as part of the process of making the project better.\n\n“I see things as processes. I hope we run into lots of complications in the near term, and all the way through, because every complication just points out how we can build a more robust platform and a more decentralized platform. Yes, hopefully, we’ll run into lots of difficult problems.”\n\n“Lots of smart people have good solutions that are being built.”\n\n\n\nAlso read: Ethereum is eating the world — ‘You only need one internet’\n\nThe future of Ethereum\n\nThe big question is, where does he see Ethereum heading? Does he believe the world’s entire financial system could end up running on Ethereum using ZK-Rollups?\n\nLubin says the founding conception of Ethereum was that it would become a “world computer,” and he suggests that was still in the cards.\n\n“I think several of us thought early on that we were building the Star Trek computer essentially,” he says, explaining it handled pretty much anything and everything.\n\n“And so, I think that decentralized protocols will be the underlying trust foundation for lots of heterogeneous architectures. So, it’s possible that Ethereum will scale sufficiently so that we can have one trust foundation and then build lots of layer 2s and layer 3s and up.”\n\n“There have been many computer revolutions for the last 200 and something years and this is another one.”\n\n“So, the answer’s yes. And the answer will take time to unfold. It would be impossible to rearchitect the global economy or global financial system in a short period of time.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLXVud3JhcC1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "How to Unwrap Ethereum? - Watcher Guru",
        "content": "The Ethereum network has made the switch from proof-of-work mining to proof-of-stake mining. The transition was completed successfully on September 15, 2022. Additionally, the blockchain went through some major changes as the miners were replaced by validators.\n\nRecently, the much-awaited Shapella upgrade went live, allowing these stakers to withdraw their staked ETH. However, ETH is the second-largest cryptocurrency and was created way back before the emergence of dApps.\n\nAlso read: How To Change Slippage Tolerance on PancakeSwap?\n\nThen the real question emerges as to what it is and why it exists. Wrapped Ether was created to give Ethereum-based decentralized applications (dApps) a more standardized approach to interface with Ether, the network’s native coin.\n\nWhat is Wrapped Ethereum (wETH)?\n\nwETH is just Ether wrapped in a smart contract to provide it with a standardized ERC-20 interface, allowing it to be exchanged and utilized within decentralized exchanges (DEXs) and other Ethereum-based services.\n\nGiven that Ether lacked the most widely used standard for tokens, the ERC-20 interface, it was necessary to create wETH. The process of wrapping ether includes moving the ETH to a smart contract. wETH will then be generated in return for this process. Additionally, this is to ensure that there is a reserve backing every wETH.\n\nAlso read: Is MetaMask Safe (2023)?\n\nBefore we look into how to unwrap Ethereum, let us look at how we can wrap it in just a few simple steps.\n\nHow to wrap Ether?\n\nThere are different ways to wrap Ethereum. One method involves the swapping of ETH for wETH through a cryptocurrency exchange. Another common method is the use of a smart contract. Let us look at the step-by-step guide on how to wrap ETH using OpenSea and MetaMask.\n\nGo to OpenSea and connect your MetaMask wallet.\n\nClick on the “Wallet” option. You will see three dots in the top-right corner. Click on the three dots next to Ethereum.\n\nClick on “Wrap” from the drop-down menu.\n\nEnter the amount and click on “Wrap ETH.”\n\nOnce it is done, confirm the MetaMask pop-up for the transaction to be complete.\n\nThat’s it. You will receive wETH which will shine brightly in pink.\n\nNow that we have covered how to wrap Ether, let us look at how to unwrap Ether using MetaMask and OpenSea.\n\nAlso read: How to Buy Crypto with Western Union\n\nHow to unwrap Ethereum?\n\nUnwrapping Ethereum is also a straightforward process. It works similarly to how you convert ETH to wETH. Let us look at the steps below."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjI5Mzk5L2NvaW5mdW5kLWV0aGVyZXVtLXlpZWxk0gE_aHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjI5Mzk5L2NvaW5mdW5kLWV0aGVyZXVtLXlpZWxk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "CoinFund's new product could set the benchmark yield rate for Web3 - The Block",
        "content": "Episode 43 of Season 5 of The Scoop was recorded with The Block's Frank Chaparro, and CoinFund President Chris Perkins.\n\nListen below, and subscribe to The Scoop on Apple, Spotify, Google Podcasts, Stitcher, or wherever you listen to podcasts. Please send feedback and revision requests to [email protected].\n\n\n\nEthereum's transition to proof of stake brought significant changes to the network, including a more predictable yield for investors. Unlike proof of work, which relies on miners to validate transactions and secure the network, proof of stake involves validators holding a stake in the network and earning yield in ether for their support.\n\nCoinFund, a crypto investment firm, is attempting to standardize the yield model to create a new benchmark yield rate for Web3.\n\nRELATED INDICES See crypto indices\n\nIn this episode, CoinFund President Chris Perkins explains how CoinFund's new Composite Ethereum Staking Rate ('CESR') aims to provide investors with a clear and comparable metric that can serve as the foundation for new financial products for the crypto space such as basis swaps and the development of a forward curve tied to Ethereum's interest rate.\n\nThis episode is brought to you by our sponsor CleanSpark.\n\nAbout CleanSpark\n\nCleanSpark (NASDAQ: CLSK) is America’s Bitcoin Miner™. Visit cleanspark.com/theblock to learn more about the CleanSpark way."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2N1cnZlLWRlcGxveXMtc3RhYmxlY29pbi1zbWFydC1jb250cmFjdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Curve Deploys Stablecoin Smart Contract on Ethereum - Blockworks",
        "content": "Curve Finance has deployed the smart contract for its stablecoin crvUSD on Ethereum.\n\nThe project designed the stablecoin using the Lending-Liquidating Automated Market Maker Algorithm (LLAMMA), which is a combination of both a traditional AMM and a lending market.\n\nAccording to a white paper from last October, LLAMMA uses an external oracle that ensures that crvUSD pools are made up of two different assets: crvUSD and the asset used to mint the stablecoin (such as ETH or BTC). This differs from other AMM designs, where assets are swapped at the price determined by the AMM curve.\n\nWhen the price of the collateral is higher, all of the user’s deposits will be in the deposited collateral, but as the price of the collateral goes lower, the oracle will convert the deposits to crvUSD.\n\nCurve deployed its initial crvUSD smart contracts yesterday, but a minor issue where fees were not flowing to the project’s DAO was noted by its team, Blockworks Research Senior Analyst Dan Smith said.\n\nThis protocol resolved this minor issue after Curve Finance redeployed an updated smart contract this morning.\n\nEven though information on Etherscan shows that Curve minted an initial 20 million crvUSD, Smith notes that this was part of the deployment process and the tokens themselves did not leave the system.\n\n“crvUSD only becomes circulating after it has been borrowed by an end user,” he said.\n\nAt the time of writing, Michael Egorov, the founder and CEO of Curve Finance, has the only open loan of $1.05 million.\n\nThe final step, Smith noted, will be to push the user interface onto the Curve website.\n\n“With two major releases during the depths of the bear market (crvUSD and upgraded tri crypto contracts), Curve is well positioned for success when liquidity and volume returns,” Smith said.\n\n“Curve now controls multiple parts of [the] DeFi stack with a DEX, lending market, and stablecoin.”\n\nTo learn more about Curve Finance and its Q1 performance, check out this detailed report by Blockworks Research.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtZGVjb2RpbmctdGhlLXBvc3NpYmlsaXR5LW9mLWEtcHJpY2UtY29ycmVjdGlvbi1hcy1mYWlsZWQtdHJhbnNhY3Rpb25zLXN1cmdlL9IBc2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtZGVjb2RpbmctdGhlLXBvc3NpYmlsaXR5LW9mLWEtcHJpY2UtY29ycmVjdGlvbi1hcy1mYWlsZWQtdHJhbnNhY3Rpb25zLXN1cmdlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Ethereum [ETH]: Decoding the possibility of a price correction as failed transactions surge - AMBCrypto News",
        "content": "The total number of failed Ethereum transactions exceeded 500,000.\n\nETH’s price craters as network activity experienced a dip.\n\nAccording to data from CryptoQuant, there was a significant surge in the total number of failed Ethereum[ETH] transactions, reaching over 500,000 as of 2 May.\n\nHow much are 1,10,100 ETHs worth today?\n\nTaking a cue from ETH’s historical performance, pseudonymous CryptoQuant Analyst MACD, found an interesting fact. Whenever the total count of failed ETH transactions exceeded 200,000, it indicated “market overheating” and was often followed by price corrections.\n\n“In the past, when Ethereum’s transaction failures rise above 200,000, it shows a market overheating and has often seen a price correction.”\n\nTo brace for a price correction or not?\n\nIn the last month, ETH’s price oscillated between $2100 and $1800. At press time, the leading altcoin exchanged hands at $1,869, with a 2% price rally within the past 24 hours, data from CoinMarketCap showed.\n\nOn-chain assessment of ETH’s performance revealed a decline in network activity since 14 April. According to Santiment, the count of daily active addresses that have since traded the alt fell by 41%.\n\nAdditionally, the number of new addresses created daily on the ETH network has plummeted as well. Information from the on-chain data provider revealed the creation of 12,492 new addresses on the ETH network on 1 May. This represented an 86% drop from the 91,560 new addresses created on 14 April.\n\nWith the continued decline in the count of new and active addresses trading ETH, the coin’s value fell from $2100 on 14 April to $1,869 at press time.\n\nIn addition to a fall in its network activity, ETH’s funding rates fell to a one-month low of -0.013 on 3 May. When a crypto asset records negative funding rates, it means that most traders in the market are taking short positions or betting against the asset.\n\nAs a result, it is often taken as an indicator of bearish sentiment and sometimes precipitates a decline in an asset’s value.\n\nFurthermore, as ETH’s price fell since mid-April, holders of 1000 to 100,000 ETH coins gradually distributed their ETH holdings, contributing to the decline in value, per data from Santiment.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nInterestingly, bigger whales, that hold between 100,000 to 10,000,000 ETH coins, increased their holdings during the same period. However, with bearish sentiments still lingering in the market, this has failed to result in any significant price rally.\n\nAt press time, ETH’s Relative Strength Index (RSI) and Money Flow Index (MFI) were positioned beneath their respective neutral spots, in downtrend positions. This indicated waning buying pressure and highlighted the need for new demand to drive up the alt’s value."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vd3d3LmxjeC5jb20vZXRoZXJldW0tdmlydHVhbC1tYWNoaW5lLWV2bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Ethereum Virtual Machine (EVM) - LCX",
        "content": "The Ethereum Virtual Machine (EVM) is designed as the runtime environment for Ethereum smart contracts. EVM functions similarly to a decentralized computer with millions of executable projects. It serves as the virtual machine that supports Ethereum’s whole operating system and is responsible for the execution and deployment of smart contracts.\n\nThe EVM lies atop the hardware and node network layers of Ethereum. It is Turing-complete and can therefore execute any program written in any programming language, letting developers write smart contracts and decentralized applications (DApps) for the emerging Web3 area with ease.\n\nIts primary function is to compute the network’s status and to execute and compile different types of smart contract code into a human-readable format known as “Bytecode.” This enables Ethereum nodes to identify smart contracts deployed on EVM-compatible chains such as Polygon or Avalanche and enables developers to easily move their Dapps or tokens from Ethereum to other EVM-compatible chains. These essential features of EVM make it one of the most powerful virtual computers currently available.\n\nHow Does It Work?\n\nThe Ethereum Network, conceived in 2013 by the programmer Vitalik Buterin, owes its phenomenal success as the blockchain of choice for DApp developers to the Ethereum Virtual Machine (EVM) that was created by Gavin Wood during his employment at Ethereum. EVM is a particular state machine that operates constantly and whose immutable actions define the state of each block in the Ethereum blockchain. It is written in C++ and uses the LLVM Project compiler.\n\nThe EVM not only governs what nodes can or cannot do to the distributed ledger maintained by the Ethereum blockchain but also defines the specific rules of changing state from block to block. This feature allows the smart contract functionality for which Ethereum has become renowned.\n\nThe EVM is a stack-based virtual machine, which means that it operates on a last-in, first-out (LIFO) data structure known as a stack with a depth of 1024 items, each of which is a 256-bit word. The 256-bit word size of the EVM makes native hashing and elliptic curve operations possible, ensuring that only the rightful owners can use the funds. For each input it receives, the EVM generates an output that is deterministic and mathematically function-like in the most basic sense. This stack is used to hold and manipulate data during the execution of smart contracts. When a smart contract is executed on the EVM, the code is run through a series of operations that manipulate the stack.\n\nMoreover, the EVM supports a variety of programming languages, including Vyper and Solidity, with Solidity being the most widely used language for smart contract source code. These programming languages are applied to create smart contracts, which are then transformed into the bytecode required for the EVM. The on-chain bytecode, also known as the runtime bytecode, is subsequently turned into an opcode that the EVM computing engine interprets in order to carry out the specified activities."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JuYi1jaGFpbi1oYWQtb3Zlci0xMG0tYWN0aXZlLWFkZHJlc3Nlcy1pbi1hcHJpbC1ldGhlcmV1bS1oYWQtNC05bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "BNB Chain had over 10M active addresses in April; Ethereum had 4.9M - CryptoSlate",
        "content": "BNB chain had 10.9 million active addresses in April — the highest, despite an 11% drop from March, data from on-chain analytics platform Nansen shows.\n\nSolana (SOL) was a distant second with 5.1 million active addresses last month — less than half the number of active addresses on the BNB chain. Active addresses on Solana fell by 12% in April compared to the previous month, the data show.\n\nEthereum (ETH) had 4.9 million active addresses in April — down 7.9% from March. Polygon (MATIC) and Arbitrum (ARB) both saw the number of active addresses climb last month. Polygon had 4.2 million and Arbitrum had 2.4 million active wallets last month — up 6% and 7.8% from March, respectively.\n\nBut it was Avalanche (AVAX), Celo, and Optimism that recorded the biggest growths in active addresses last month, according to Nansen data. Active addresses on Avalanche and Celo grew by 87% and 46% respectively, while Optimism saw a growth of 36% compared to March.\n\nDiving deeper on-chain\n\nOn the BNB chain, three platforms saw their number of users grow significantly last month. Users on the Polyhedra Network — which provides Web 3.0 infrastructure — increased phenomenally by over 4,000,000% in April.\n\nMeanwhile, blockchain interoperability provider LayerZero Labs, and Stargate saw their number of users jump by 471% and 375%, respectively.\n\nOn Solana, Nansen data shows new users are flocking to the decentralized exchange Orca, lifestyle app STEPN — which pays users to exercise — the automated market maker and liquidity provider Raydium protocol, and liquidity aggregator Jupiter Exchange.\n\nWith the recent success of Pepe meme coins, it’s unsurprising that the token’s users increased by over 213,000% in April, giving Ethereum a boost.\n\nOn Polygon, stablecoins Tether (USDT) and USD Coin (USDC) continue to play a huge role while Stargate and Galxe are pulling crowds.\n\nLastly, in Arbitrum, users of the non-fungible token (NFT) marketplace OpenSea grew by 619% last month. Decentralized exchange (DEX) Arbswap’s users grew by 608% and DEX aggregator Odos protocol saw its users increase by 516% over the last month, according to Nansen data.\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2NyeXB0by9ldGhlcmV1bS1raWxsZXItc3VpLWxhdW5jaGVkLXRvZGF5L9IBRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2NyeXB0by9ldGhlcmV1bS1raWxsZXItc3VpLWxhdW5jaGVkLXRvZGF5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "New “Ethereum Killer” SUI Launches Today, What You Need To Know - NewsBTC",
        "content": "Today is the day, the long-awaited launch of the next “Ethereum killer” SUI is taking place at 8:15 am EST (12:15 UTC). From a purely technical standpoint, SUI does a few things differently compared to Ethereum, and therefore the expectations are high. In addition to the bankrupt exchange FTX, the project has numerous notable backers, including Circle, Binance Labs, and Electric Capital.\n\nThe designated proof-of-stake (dPoS) blockchain has an entirely new architecture that is supposed to outshine even the “high-speed” blockchain Solana. Many of Sui’s developers previously worked on the Meta (Facebook)-launched project Diem, which was scrapped some time ago due to regulatory headwinds.\n\nThe developers behind Sui, Mysten Labs, are one of two spinoffs from Diem, the second being none other than Aptos, which celebrated its mainnet launch last October. The former Meta employees founded Mysten Labs back in 2021 to develop Sui.\n\nWhy Sui Is Being Hyped\n\nOne of the things that sets the Sui blockchain apart is its tremendous processing speed of data, which no other layer-1 blockchain can match. In testing, Sui already brought it to more than 300,000 transactions per second (tps). This far exceeds even Solana (65,000 TPS). Likewise, Sui has a big speed advantage in transaction confirmation time.\n\nWhile Solana needs around 20 seconds, Sui’s is only 450 milliseconds. In terms of scalability, Mysten Labs says that the system design is designed to allow horizontal scalability, which is not capped.\n\nIn addition to Sui’s high throughput and low latency, the project also touts a third advantage: the ability to process arbitrary amounts of data on chain. To do this, SUI makes use of a storage fund that redistributes fees for past transactions to future validators.\n\nIn other words, users pay upfront fees for both computation and storage. When storage requirements on-chain are high, validators receive additional rewards to offset their costs. Conversely, when storage requirements are low.\n\nThese three benefits are meant to take the use cases of blockchain technology to the next level.\n\nTokenomics\n\nWhile IOUs were already trading on smaller exchanges ahead of the official launch of the blockchain at 8 am EST (2 pm CET), well-known crypto exchanges such as Binance, OKX, KuCoin, and ByBit have announced the listing of the new token as soon as liquidity requirements are met.\n\nBinance, for example, said it expected to begin trading SUI/BTC, SUI/USDT, SUI/TUSD and SUI/BNB at 8:15 am EST.\n\nSUI’s token supply has a cap of 10 billion tokens. As stated by the Sui Foundation, a portion of the total supply is expected to be liquid when the mainnet launches today. The remaining tokens will be transferred or distributed as future reward grants for shares in the coming years.\n\nIn the Sui economy, the token has four purposes. It can be used to participate in the proof-of-stake mechanism. It is the asset required to pay gas fees to conduct transactions and other operations.\n\nFurthermore, the token is an asset that supports the entire economy with its value. Ultimately, the token plays an important role in governance as it serves as the right to participate in voting on-chain.\n\nFeatured image from PixelPlex\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3Lm5mdGN1bHR1cmUuY29tL25mdC1uZXdzL2JleW9uZC1ldGhlcmV1bS1iaXRjb2luLW9yZGluYWxzLWJyZWFrLTNtLWluc2NyaXB0aW9ucy10YWtpbmctdGhlLWNyeXB0by1pbmR1c3RyeS1ieS1zdG9ybS_SAYUBaHR0cHM6Ly93d3cubmZ0Y3VsdHVyZS5jb20vbmZ0LW5ld3MvYmV5b25kLWV0aGVyZXVtLWJpdGNvaW4tb3JkaW5hbHMtYnJlYWstM20taW5zY3JpcHRpb25zLXRha2luZy10aGUtY3J5cHRvLWluZHVzdHJ5LWJ5LXN0b3JtLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Beyond Ethereum: Bitcoin Ordinals Break $3m Inscriptions Taking the Crypto Industry by Storm - NFT Culture",
        "content": "Bitcoin Ordinals have recently taken the crypto industry by storm, with registrations surging to an all-time high of 3.4 million last week. This explosion of interest in the protocol is exciting news for the NFT market and suggests that the crypto industry is becoming more interested in NFTs and their applications beyond Ethereum.\n\nOrdinals Protocol allows users to embed data into the Bitcoin blockchain by inscribing references to digital art into small Bitcoin-based transactions. Despite the skyrocketing fees, the surge in daily enrollments began on April 21st and peaked on May 1st, with over 372,000 enrollments in just 24 hours. This surge in registrations contributed to an all-time high in daily BTC transactions on May 1st, reaching 682,281.\n\nAlthough most registrations for the protocol are text-based, followed by applications and JPEG images, the surge in enrollments is significant for the industry. Bitcoin Ordinals NFT is compliant with the BRC-20 standard – Bitcoin Request for Comment number 20 – which was introduced last March, enabling new tokens to be minted on the BTC network.\n\nI can't believe my eyes BRC-20 demand leading to a 700% increase in fees AFTER what we've seen with Ordinal Inscriptions 12,800% increase in fees from BEFORE Ordinal Inscriptions launched 300,000 unconfirmed transactions in the mempool pic.twitter.com/oyLceu6ODe — trevor.btc @ NYC (@TO) May 2, 2023\n\nWhat’s also interesting is that BTC maximalists used to be very opposed to ordinals, but appear to be coming around. The surge in registrations may be evidence that Bitcoin Ordinals NFT is becoming more accepted among BTC maximalists as they realize the potential for NFTs on the Bitcoin blockchain.\n\nThe explosion in numbers and daily enrollments is exciting news for the crypto industry and suggests that there is a growing demand for NFTs on the Bitcoin blockchain. With the surge in interest in Bitcoin Ordinals NFT, we can expect to see more innovation and growth in the NFT market.\n\nBitcoin Ordinals NFTs are not only contributing to the growth of the NFT market but also to the overall Bitcoin network by incentivizing miners, prioritizing valuable transactions, and enhancing network security. While the high fees may put a higher price tag on transactions on the network, proponents of Ordinals believe that the benefits outweigh the costs and that it opens up new use cases for Bitcoin, bringing in liquidity, new users, and developers, ultimately making Bitcoin more valuable through better user experience and more use cases."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdGhlZGVmaWFudC5pby9jdXJ2ZS1kZXBsb3lzLWNydnVzZC1zdGFibGVjb2luLW9uLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 04:38:42 GMT",
        "title": "Curve Deploys crvUSD Stablecoin On Ethereum - The Defiant - DeFi News",
        "content": "CRV Rallies 7%\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\ncrvUSD, the highly anticipated stablecoin from Curve Finance, is now live on Ethereum.\n\nThe contracts were deployed on Wednesday, inspiring DeFi degens to deposit $2M into the protocol within a couple of hours, despite no user interface being live.\n\nCurve is a stablecoin-focused decentralized exchange, offering low-fee swaps and boasting nearly $5B in total value locked. Its CRV governance token is up nearly 7% in the past 24 hours.\n\ncrvUSD is one of a new generation of forthcoming decentralized stablecoins native to popular DeFi protocols that promise to disrupt the sector. Curve users will be able to mint crvUSD against collateral assets deposited in the protocol, allowing users to access liquidity while simultaneously earning yield on their deposits.\n\nThe launch came one day after Curve launched crvUSD on the Sepolia testnet. A GitHub repository described the testnet deployment as intended to test whether Etherscan, a popular block explorer, would verify the token. Curve first deployed the contract for crvUSD on Sepolia on April 25.\n\nLLAMMA Liquidations\n\ncrvUSD’s white paper says the stablecoin will introduce a novel lending-liquidating AMM algorithm, or LLAMMA, to ease the effects of liquidations on borrowers.\n\n\n\nAs the value of Ether collateral backing crvUSD approaches its liquidation price, the protocol will gradually convert it to stablecoins. Then, as the price of ETH rises, the assets are converted back to ETH.\n\n“This transforms liquidations from a jagged, all-at-once, all-or-nothing affair with huge slippage losses into a smooth transitioning that could even earn the collateral holder swap fees if they weather the volatility,” said foobar, a web3 developer.\n\nAave GHO\n\nAave, the top DeFi money market protocol, has passed a governance proposal outlining initial parameters for GHO, its upcoming native stablecoin that will likely compete with crvUSD.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nAave users will similarly be able to mint GHO against collateral assets deposited to Aave for yield generation. The initial parameters include a 1.5% interest rate for borrowers of 1.5%, a 30% fee rebate for AAVE stakers, and a debt ceiling of 100M GHO.\n\nRenewed Emphasis On Decentralization\n\nThe milestones for crvUSD and GHO come as interest in decentralized stablecoins is at an all-time high.\n\nThe 2022 bear market was marked by the failure of several major CeFi firms, including the popular FTX exchange and crypto lenders Voyager and Celsius, leaving many investors wary of custodial counterparty risk and igniting demand for decentralized alternatives.\n\nHowever, few decentralized stablecoins have gained meaningful adoption, giving cautious traders scant alternatives to centralized stable tokens.\n\nMakerDAO’s overcollateralized DAI stablecoin is the top decentralized stablecoin with a $5B market capitalization.\n\nBut DAI has been criticized for being heavily backed by centralized assets, predominantly Circle’s USDC token, in recent years. The critics appeared to be validated in March when the price of DAI slumped below $0.90 amid fears over USDC’s solvency. The protocol is now aiming to limit DAI’s exposure to centralized assets per its Endgame roadmap.\n\nFRAX has held steady second place with a $1B capitalization since December.\n\nLiquity’s LUSD captured significant market share to emerge as the third-ranked decentralized stablecoin this year, growing from $175M to $278M since late January."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMDQvbGF5ZXItMi1uZXR3b3JrLW9wdGltaXNtLXRvLXVzZS1ldGhlcmV1bS1hdHRlc3RhdGlvbi1zZXJ2aWNlLXRvLXByb21vdGUtdXNlci10cnVzdC_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8wNC9sYXllci0yLW5ldHdvcmstb3B0aW1pc20tdG8tdXNlLWV0aGVyZXVtLWF0dGVzdGF0aW9uLXNlcnZpY2UtdG8tcHJvbW90ZS11c2VyLXRydXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Layer 2 Network Optimism to Use Ethereum Attestation Service to Promote User Trust - CoinDesk",
        "content": "“People in the Optimism Collective have been kind of trying to figure out, ‘hey, how do we actually identify one person – and not just like any person, but like a positive contributor to the space – to give these tokens to’ and that's when we started experimenting with attestations,” Bacchus said."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjI5MTc2L2V2bS1jb21wYXRpYmxlLWNoYWlucy1ldGhlcmV1bS1nYXMtZmVlc9IBT2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzIyOTE3Ni9ldm0tY29tcGF0aWJsZS1jaGFpbnMtZXRoZXJldW0tZ2FzLWZlZXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Ethereum's high gas fees see users flock to EVM-compatible chains - The Block",
        "content": "Usage of Ethereum Virtual Machine (EVM)-compatible blockchains hit a new all-time high last week, thanks to consistently high gas fees on Ethereum.\n\nDaily new unique addresses of EVM-compatible blockchains, including BNB Chain, Polygon and Avalanche, peaked at 6.77 million on April 25, according to The Block's Data Dashboard. The previous record was 6.74 million in 2021.\n\n\"Ethereum gas fees are up significantly since the start of the year, leading to growth in EVM-compatible chains,\" said Kevin Peng, research analyst at The Block. \"EVM-compatible chains provide a consistent experience for users and developers familiar with Ethereum. Growth in these chains can be a proxy for interest in an Ethereum-like user experience on-chain.\"\n\nAverage Ethereum transaction fees, known as gas fees, have increased by over 250% since the beginning of the year to around $9 per transaction from about $2.50 per transaction in December, according to The Block's Data Dashboard.\n\nAs The Block reported recently, a surge in memecoins trading has led to increased usage of Ethereum-based decentralized exchanges, adding to the upward pressure on gas fees.\n\nBNB Chain and Polygon leading\n\nEVM-compatible chains have lower transaction costs than Ethereum while benefiting from the security and network effects of the larger Ethereum ecosystem. BNB Chain and Polygon, in particular, saw increased usage last week due to their growing ecosystems, according to The Block's Data Dashboard.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\n\"This surge is driven by new contracts created on BNB Chain. In many cases, projects implement solutions such as gasless, meta transactions, relayer contracts etc., all with the purpose of optimizing gas fees, and sometimes improving the end-user experience. In such a case, we would see new contracts being created specifically for minting, claiming etc. — and it is these new contracts that have led to this spike,\" Arnaud Bauer, solution architect at BNB Chain, told The Block.\n\n\"Some instances that we saw this time were from 1inch, CyberConnect and XEN-related contracts being the bulk of it,\" Bauer added.\n\nEthereum Layer 2s growing too\n\nEthereum Layer 2 networks, especially Optimism and Arbitrum, have also grown in usage this year. Daily new unique addresses on both optimistic rollups-based chains have increased since the start of the year, according to The Block's Data Dashboard."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvd2hhdC1pcy10aGUtdG90YWwtZXRoZXJldW0tYnVybmVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "What is the Total Ethereum Burned? - Watcher Guru",
        "content": "One of the most known names in the industry, and the second-largest cryptocurrency by market cap, Ethereum has long been a vital asset. Moreover, since the arrival of a burn mechanism in 2021, the circulating supply has become an interesting development. Leading us to observe the total amount of Ethereum (ETH) burned.\n\nThe highly anticipated EIP-115 upgrade set in motion a burn mechanism that was critical for the digital asset. Subsequently, decreasing the circulating supply increases the overall value of the cryptocurrency. Since the arrival of the upgrade, the burn rate has rapidly increased, setting the stage for its current total burned supply.\n\nETH Burned\n\nSource: Redot.com\n\nEthereum operates similarly to many digital assets in terms of its circulating supply. Specifically, with every block, ETH increases that very supply. According to Ultrasound. Money, the current supply is more than 120,379,384.\n\nPrior to the burn mechanism, Ethereum projected that more than 600,000 ETH would be put into circulation annually. However, the concern was the growing supply without a diminishing tool. Thus, the EIP-115 upgrade was developed, and integrated.\n\nNow, since the implementation of the EIP-115 upgrade, a total of 3,170,487.19 Ethereum has been burned, according to Ultrasound.Money. Moreover, that number equates to a total of more than $9,411,313,559. The figure presents a massive development in the vital burn rate of the asset and its subsequent value.\n\nThe Importance of The Merge\n\nSource: Kaspersky\n\nThe industry will always note the importance of the merge to the Ethereum ecosystem. Specifically, the event signified the transition of the blockchain network from a proof-of-work (PoW) consensus mechanism to a proof-of-stake (PoS) one.\n\nSince the Merge event, the same data shows that a total of 547,196 ETH have been burned. Moreover, the collection of the asset equates to a total of $861,639,674. Conversely, the transition to a PoS model has aided the issuance rate of digital assets.\n\nSpecifically, Bitcoinsit reported that prior to its transition, ETH tokens were issued at a rate of 3.66% per year. Alternatively, that figure is quite high when compared to an asset like Bitcoin. Nevertheless, the latter was only issued at a rate of 1.72%. Moreover, proving that the merge has been undoubtedly helpful in increasing the effectiveness of the burn mechanism."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mbGFyZS1pbnRlZ3JhdGVzLWJsb2NrY2hhaW4tYXBpLW9uLWdvb2dsZS1jbG91ZC1tYXJrZXRwbGFjZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Flare integrates blockchain API on Google Cloud Marketplace - Cointelegraph",
        "content": "Layer-1 Ethereum Virtual Machine (EVM) blockchain platform Flare has integrated its application programming interface (API) portal on Google Cloud Marketplace, onboarding a number of significant blockchain APIs to the ecosystem.\n\nThe integration of Google Cloud Marketplace will provide high-integrity blockchain data from Flare nodes and connected chain nodes to a large pool of developers and users of the software products and services platform. This includes blockchain APIs for Algorand, BNB Smart Chain, Bitcoin, Dogecoin, Ethereum, Flare, Litecoin, Songbird, XRP ledger and future-supported blockchain APIs.\n\nBlockchain APIs are touted to free developers from having to run their own nodes for the respective blockchains they are interacting with. The data supplied powers applications that execute transactions and query the latest state of a blockchain by calling up on-chain data.\n\nFlare highlights blockchain APIs as valuable for building cross-chain applications that query various data sources, including major cryptocurrency exchanges and wallets that use its API portal.\n\nA statement from Flare’s vice president of engineering Josh Edwards highlighted that the provision of blockchain APIs to platforms like Google Cloud Marketplace will play a role in increased Web3 participation:\n\n“It makes it easier for developers to experiment with blockchain technology and its many use cases without being burdened by onerous hardware costs and ongoing maintenance.”\n\nEdwards also suggested that larger organizations and partners making use of Google Cloud Marketplace would potentially experiment with the secure and approved Web3 APIs.\n\nThe EVM-based layer 1 aims to extend the utility of blockchain technology by providing data from various chains and Web2 sources, which could climb to over 100 chains that form Flare’s oracle.\n\nRelated: Google Cloud broadens Web3 startup program with 11 blockchain firms\n\nFlare’s integration comes just days after Polygon Labs and Google Cloud announced a multiyear partnership for the cloud computing service provider to boost the Ethereum scaling protocol’s tools and infrastructure development.\n\nThe deal sees Google Cloud’s framework and developer tools provided to Polygon’s core protocols, aimed at fostering the development of Web3 products and decentralized applications on Polygon.\n\nGoogle Cloud’s partnership with the ecosystem is expected to advance Polygon’s zero-knowledge development. Testing of Polygon zkEVM’s zero-knowledge proofs on Google Cloud reportedly resulted in faster and cheaper transactions compared to the existing infrastructure available.\n\nMagazine: Here’s how Ethereum’s ZK-rollups can become interoperable"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMDMvY3VydmUtZmluYW5jZS1kZXBsb3lzLW5hdGl2ZS1zdGFibGVjb2luLW9uLW1haW5uZXQv0gFgaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8wMy9jdXJ2ZS1maW5hbmNlLWRlcGxveXMtbmF0aXZlLXN0YWJsZWNvaW4tb24tbWFpbm5ldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "DeFi Protocol Curve Finance Deploys Native Stablecoin on Ethereum Mainnet - CoinDesk",
        "content": "For example, when the price of the crypto asset posted as collateral falls below the liquidation level, the protocol will gradually convert the assets into crvUSD, and later will convert back to the collateral asset (de-liquidate) as the price recovers."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvd2hhdC1pcy12aXRhbGlrLWJ1dGVyaW5zLW5ldC13b3J0aNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "What is Vitalik Buterin's Net Worth? - Watcher Guru",
        "content": "The founder of Ethereum, one of the pioneering entities of the entire cryptocurrency industry, is one of the most recognizable names in the digital asset sector. Yet, as the brains behind one of the most used blockchains on the planet, just who is Vitalik Buterin, and what is his net worth?\n\nButerin is a well-respected industry leader and has catapulted his Ethereum network to unprecedented heights. Moreover, understanding the development of Ethereum, his early life, and his impact on the industry provides an interesting context for just how much the co-founder is worth.\n\nWho is Vitalik Buterin?\n\nVitalik Buterin was born on January 31, 1994, in Kolomna, Russia, and migrated to Canada at the age of six. After leaving Russia, Buterin’s early life was set in the province of Ontario, where he gained some notoriety as a programmer during his teenage years.\n\nAt a young age, it was clear that Buterin had a strong passion for digital assets. Specifically, Buterin was taught about the fundamentals of Bitcoin (BTC) by his father when he was 17 years old.\n\nAlthough he was tremendously interested, there was really no way for the young Russian Canadian to obtain the asset. Yet he would eventually begin writing blog posts for Bitcoin as compensation. Subsequently, that work would culminate in 2011, when he co-founded Bitcoin Magazine.\n\nSource: Global Happenings\n\nButerin would study collegiately at the University of Waterloo, taking advanced cryptography courses. Then, he would become a research assistant to former Tor Project board chairman, Ian Goldberg.\n\nIn 2012, Buterin took home bronze in the International Olympiad in Informatics. There, he began to collaborate with some of the brightest young development minds on the planet. Eventually, in 2014, billionaire Peter Theill established the Thierl Fellowship. Subsequently, Buterin was offered a $100,000 grant to focus full-time on Ethereum. Leading the young developer to drop out of college and chase his dream.\n\nThe Birth of Ethereum\n\nSource: Pixabay\n\nMoreover, Buterin created a host of open-source projects until he eventually co-founded Ethereum in 2013. The young developer co-founded the Ethereum network alongside Hoseph Lubin, Charles Hoskinson, Anthony Di Lorio, and Gavin Wood.\n\nEthereum was created to combat certain flaws that Buterin observed in various crypto projects like Bitcoin. Following the publication of the Ethereum technical book, the industry was able to observe how the Ethereum Virtual Machine (EVM) truly functions. Subsequently, presenting the primary technology behind the Ethereum network, and orchestrating its vast potential.\n\nSource: Redot.com\n\nIn 2015, the Ethereum brain trust was able to present the original, fully formed version of the network, Frontier. The arrival followed a rather long crowdfunding campaign and became somewhat of a viral sensation. Following its launch, tech giants like IBM and Microsoft were interested in the capabilities of the project.\n\nThe founder’s group behind Ethereum eventually sold ETH for more than 31,000 BTC, which equates to $18 million. Subsequently, the Ethereum Foundation was born. The foundation was a non-profit based in Switzerland and used to oversee the Ethereum network’s open-source software development.\n\nOverall, the Ethereum network benefited from the principles that it held firm to. Specifically, the design of the network ensures simplicity, modularity, universality, agility, non-discrimination, and non-censorship. All qualities that have drawn in users. Consequently, aspects that have continued to drive its popularity in the industry.\n\nVitalik Buterin Net Worth\n\nSource: Coin News\n\nAll of that exposition sets up the answer to the question of Vitalik Buterin’s net worth. Currently, Data Wallet approximates that the Ethereum co-founder boasts a net worth of around $540 million as of 2023. Specifically noting the significant amount of Ethereum that is held by the creator.\n\nWhat perhaps makes the net worth of Buterin interesting, however, is how he perceives his wealth. The Ethereum co-founder has stated his adherence to decentralization as a principle. Moreover, he shares his desire to use his wealth for philanthropic purposes. Additionally, the estimates are strictly that, as Buterin has assured that he is not exponentially wealthy. Conversely, he states that he ends up donating most of his income.\n\nSource: Cripto Tendencia\n\nThis is a facet that has been seen in the past, as Buterin has been known to donate large amounts of cryptocurrency. Specifically, Buterin had been given more than 50 trillion Shiba Inu (SHIB) in 2021. Subsequently, by the end of May of that year, he had donated almost all of it to the CryptoReleif fund. The total was more than $1.2 billion at the time.\n\nIn 2022, Buterin donated another $9.4 million to the University of Maryland to support the School of Public Health’s research into germicidal ultraviolet light. Subsequently, pointing to the philanthropic nature of the Ethereum founder.\n\nUltimately, Buterin’s net worth is based on various assets that are held in three wallets, according to Data Wallet. Specifically, the wallets 0xab, 0xD0, and 0x22 have all been verified to belong to the founder. Subsequently, those wallets hold a combined $500 million. Alternately, there is an additional estimate of $40 million in off-chain assets held by Buterin."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL3ByZXNzLXJlbGVhc2VzL2dvcmFjbGUtZW5oYW5jZXMtY3Jvc3MtY2hhaW4tY29tcGF0aWJpbGl0eS1vbi1hbGdvcmFuZC1pbXBvcnRpbmctZGF0YS1mcm9tLWV0aGVyZXVtLWFuZC1tb3Jl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Goracle enhances cross-chain compatibility on Algorand: Importing data from Ethereum and more - Cointelegraph",
        "content": "Goracle, the decentralized blockchain oracle solution built on the Algorand blockchain, has announced that it will now be able to import data from Ethereum and nearly any other blockchain. This feature enables developers to build cross-chain applications that can interact with multiple blockchains, increasing the overall utility ofAlgorand.\n\nGoracle’s features enables Algorand to act as a settlement layer for other blockchains, providing seamless access to data on other chains and facilitating cross-chain liquidity. This feature will enable developers to build a wide range of applications without building their own centralized oracles. For example, developers can now build DeFi apps that allow users to trade assets across multiple blockchains.\n\nOther use cases for cross-chain applications include supply chain management, gaming and asset management. For example, developers can build applications that track the movement of goods across different blockchains, verify the ownership of virtual assets in games, or manage a portfolio of assets across different blockchains.\n\nAdam Kinley, Director of Strategic Partnership at Goracle, said:\n\n“By enabling importing of data from other blockchains, Goracle is taking a major step forward in driving adoption of the Algorand blockchain. Our solution allows developers to build innovative applications that leverage the unique features of multiple blockchains while providing more opportunities for users to interact with the Algorand network.”\n\nAlgorand is already one of the leaders in the space when it comes to speed, security and transactions per second. With Goracle’s new feature, the Algorand blockchain is poised to become the preferred settlement layer for other blockchains. This is a major step forward for Algorand and interoperability in the blockchain industry, paving the way for new innovations and greater adoption.\n\nAbout Goracle\n\nGoracle is a decentralized blockchain oracle solution built on the Algorand blockchain. It provides a secure and reliable way for smart contracts on the Algorand blockchain to access off-chain data. With the new cross-chain compatibility feature, Goracle can import data from Ethereum and other blockchains, opening up new use cases and opportunities for developers. Goracle is currently in Testnet, and plans to launch to Mainnet in June.\n\n\n\nGoracle Social Links:"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vcHJvdG9zLmNvbS9ob3ctY3J5cHRvLXRyYWRlcnMtY2FuLXV0aWxpemUtbWV2LWluLWJsb2NrY2hhaW4tdHJhbnNhY3Rpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "How crypto traders can utilize MEV in blockchain transactions - Protos",
        "content": "Listen to this article.\n\nMaximum extractable value (MEV) refers to all of the money that can be extracted by reordering, viewing, adding, including, or excluding transactions within a block. The vast majority of MEV occurs via decentralized exchanges (DEXs) like Uniswap.\n\nIn all financial markets, the order of transactions is one of the most important determinants of price — think quants who colocate nearby exchange servers with fiber optic cables to ensure their orders fill first.\n\nVery often, discussions of MEV include the parties responsible for confirming transactions for ERC-20 tokens on Ethereum, which can come with issues such as validators being complicit with trading bots. Digital asset market participants have other ways to extract MEV using the different types of maximum extractable value.\n\nHere are the four types of MEV:\n\nSovereign MEV\n\nBlockchain communities can attempt to control their own MEV through sovereign MEV, which refers to setting protocol rules for extracting MEV, allowing or disallowing certain tactics for MEV extraction, and specifying where MEV proceeds may accumulate.\n\nA protocol’s community can decide who and what to prioritize via sovereign MEV practices, often with consequences for breaking these rules. With some blockchains with sovereign MEV rules, for example, an abusive validator might face penalties such as staking pool users moving to another staking platform or validator. Others allow the community to decide who gets the MEV or how MEV is generated.\n\nRead more: Ethereum tries to reduce MEV with blockers and rebates\n\nInternal MEV\n\nInternal MEV refers to MEV generated directly on an application-specific blockchain or ‘appchain.’ This form of MEV allows application developers to set rules that include the acceptable methods for capturing MEV. It can use atomic arbitrage, a trading strategy that places a buy order on one trading platform and a sell order of an equivalent quantity on another trading platform at the same time.\n\nCeFi-DeFi MEV\n\nCeFi-DeFi MEV uses a form of arbitrage that exploits the differences between centralized exchanges and decentralized finance apps. An asset’s price tends to update on centralized exchanges before on-chain pools and DEX liquidity providers can reposition.\n\nCeFi-DeFi MEV is one of the largest generators of MEV due to activity from arbitrage traders.\n\nInterchain MEV\n\nInterchain MEV takes advantage of the idea that most blockchains operate in ‘silos’ that don’t permit them to natively ‘see’ what’s happening on other blockchains. For example, the Bitcoin network cannot (excepting the use of third-party oracles) ‘see’ transactions on the Ethereum blockchain.\n\nInterchain MEV allows traders who can analyze cross-blockchain data to profit from swapping assets across blockchains via bridges or DEXs. Interchain MEV and associated arbitrage tactics happen most often in cross-domain blockchains like Cosmos.\n\nMEV is unavoidable\n\nEven Ethereum founder Vitalik Buterin has admitted that MEV will always exist in Ethereum. Validators can always select the transactions with higher fees — even if those transactions are from obvious front-running or sandwich attackers. MEV traders use a variation of arbitrage and other techniques to maximize profits.\n\nOn the bright side, developers can build ways to keep MEV under control by adding rules on who can get the rewards and how users can extract MEV from their blockchains through sovereign MEV practices.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on Twitter, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1hYm92ZS0yODUwMC1ldGhlcmV1bS1wb2x5Z29uLXJpc2UtdXAtdG8tMi9hcnRpY2xlc2hvdy85OTk1NTM1Mi5jbXPSAZoBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4taG9sZHMtYWJvdmUtMjg1MDAtZXRoZXJldW0tcG9seWdvbi1yaXNlLXVwLXRvLTIvYW1wX2FydGljbGVzaG93Lzk5OTU1MzUyLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $28,500; Ethereum, Polygon rise up to 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nAhead of the Federal Reserve's interest rate decision scheduled later in the day, the cryptocurrency markets were trading higher in Wednesday's trade. Bitcoin (BTC) rose 1.96% to $28,526, whereas Ethereum (ETH) was above the $1,850 level. BTC volume in the last 24 hours stood at approximately $16.17 billion, rising 1.78% in the last 24 hours.“Bitcoin rose nearly 2% in the past 24 hours following the Job Openings and Labor Turnover Survey (JOLTS) data. The data showed that job openings in the US declined to 9.6 million in March, below expectations of 9.775 million and their lowest since April 2021,” Edul Patel, Co-founder and CEO at Mudrex, said.\"Additionally, investors and traders may be making early moves in anticipation of the US Federal Reserve's decision on interest rate hikes. Similarly, Ethereum traded at the US$1,850 level and made movements following BTC,\" Edul added.The global cryptocurrency market cap was trading higher around $1.17 trillion, rising 1% in the last 24 hours.The total volume in DeFi is currently 2.50 billion, 7.21% of the total crypto market 24-hour volume. The volume of all stablecoins is now $32.02 billion, which is 92.45% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $551 billion. Bitcoin’s dominance is currently 46.92%, an increase of 0.25% over the day, according to CoinMarketCap.\"In the short term, the escalating banking crisis, the US economic outlook and monetary policy will affect the price of Bitcoin. Currently consolidating in the $27,000-$31,000 range, further US bank collapses may increase safe-haven demand and push Bitcoin sustainably towards $30,000,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point toward a Neutral sentiment. The Relative Strength Index (14), one of the key indicators, sits at 49, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 43 and 21, respectively, further indicating a Neutral market.\"\"The MACD Level (12, 26) at 120 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 42 with a Neutral indicator, while the Williams Percent Range (14) at −51 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.57 hours, IST on May 03, 2023)Bitcoin $28,526 1.96%Ethereum $1,861 1.87%Tether $1.00 0.01% BNB $323 -0.39% XRP $0.4596 -1.03%Cardano $0.3864 0.16% Dogecoin $0.07842 -0.07%Polygon $0.9705 1.38%Solana $21.86 0.15%Polkadot $5.68 0.16%Shiba Inu $0.000009951 0.61% Litecoin $88.04 1.09%Tron $0.06915 1.15%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90cmFkZXJzLXByZWRpY3QtZXRoZXJldW0tcHJpY2UtdG8taGl0LTNrLWJ1dC1haWRvZ2UtYW5kLXlwcmVkaWN0LWFyZS10aGUtbmV4dC1iaWctYWktY3J5cHRvLWNvaW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Traders Predict Ethereum Price to hit $3k but AiDoge and yPredict Are The Next Big AI Crypto Coins - Analytics Insight",
        "content": "Ethereum (ETH) managed to increase its value during April, mostly thanks to the Shapella upgrade, so last month, the value of this crypto at one point was around $1985. This led traders to believe that ETH could hit $3K, and this further increased interest in this popular crypto. But, during the last few days, ETH has started to experience fluctuations in price, and some young cryptos have achieved much better results. It seems that AiDoge (AI) and yPredict (YPRED) could be the next big AI cryptos and achieve significant success much faster than ETH, and in the same group of the successful ones, we could freely include Eccoterra (ECOTERRA), DeeLance (DLANCE) and Love Hate Inu (LHINU). Let’s see what the future could be for all these cryptos.\n\nThe Future of Ethereum (ETH)\n\nThanks to the beginning of the crypto spring, the Shapella upgrade, but also other factors, Ethereum (ETH) seemed promising during April, reaching a value of even $1985. However, recently, ETH has experienced a drop in value and now it is hovering around $1827. Traders still believe that ETH could continue to increase in value in the future, and here are the predictions for the next period:\n\nYEAR MINIMUM PRICE AVERAGE PRICE MAXIMUM PRICE 2023 $2,178.25 $2,722,81 $3,267.37 2024 $3,993.45 $4,538.01 $5,082.57 2025 $5,808.65 $6,353.21 $6,897.78\n\nTraders do predict Ethereum price to hit $3K, but that most likely won’t happen during 2023. On the other hand, there are several young and promising cryptos that, by all accounts, will reach new heights by the end of this year, so it would be wise to invest in them right now, while they can still be purchased at presale prices!\n\n>>>Buy AiDoge Now<<<\n\nThe Future of AiDoge (Ai)\n\nA bright future is predicted for the next big AI crypto, AiDoge (Ai). These predictions are based on the outstanding success this crypto achieved in just a few days of presale: more than $700K raised! Users are enthusiastically buying Ai Token at an extremely affordable price of only $0.0000264, as they hear positive reactions from both crypto experts and influencers. They are aware that this crypto could explode in price in the future, mostly thanks to its basic purpose because AiDoge provides the best AI-driven meme generation experience!\n\nMuch faster and better than similar platforms, AiDoge enables the creation of memes using AI technology. Your job is just to enter text prompts, and in the blink of an eye, AiDoge will deliver interesting, high-quality, relevant, and up-to-date memes! You will use the native Ai token for purchasing credits (which you will later spend on generating memes), for voting (upvoting or downvoting memes of other creators), and also for staking, which will bring you countless benefits. Coins from the same niche recently exploded, and predictions show that AiDoge, given that it offers much more, will achieve greater success than all of them!\n\n>>>Buy AiDoge Now<<<\n\nThe Future of Ecoterra (ECOTERRA)\n\nOne of the most successful current crypto presales, Ecoterra (ECOTERRA), with more than $2.5 million raised, shows us that recycling is already important and that in the future the importance of this environmentally conscious behavior will increase even more. Thanks to its revolutionary Recycle-2-Earn approach, Ecoterra gives users the opportunity to be rewarded for preserving the environment, so that every time they recycle, they will win ECOTERRA tokens!\n\nCrypto experts rate ECOTERRA as one of the cryptos that show a chance for 100x returns, so take advantage of the current presale price of $0.007, buy this best green crypto ASAP, and do a good thing for yourself and the planet!\n\n>>>Buy Ecoterra Now<<<\n\nThe Future of yPredict (YPRED)\n\nAnother “next big AI crypto coin” shows chances for greater success than Ethereum this year, and that is yPredict (YPRED), which has so far managed to raise more than $450,000! yPredict (YPRED) is a platform intended for crypto traders, investors, financial analysts, and quants, and its main “task” is to make predicting crypto price movements simple.\n\nyPredict will, using AI technology, provide the most relevant information that will significantly influence the delivery of the best crypto-related decisions. To get the most out of the yPredict platform, you need to own a native YPRED token. Now you can buy it for only $0.05, but hurry because the price increase is expected soon. The huge interest in YPRED from the first day of the presale is a clear sign that this coin provides immediate benefits, and in the future, it will realize its full potential!\n\n>>>Buy yPredict Now<<<\n\nThe Future of DeeLance (DLANCE)\n\nMore and more people are working online, more and more employers are looking for workers online, and that percentage will increase even more in the future. Because of this, the success of DeeLance (DLANCE), a platform that simplifies the process of online employment and provides better conditions for both freelancers and employers than all other platforms, is not surprising at all. DeeLance threatens to surpass Fiverr, Upwork, and similar platforms because it offers much lower fees, allows retaining ownership of the content, enables quick withdrawals, and offers a safe working environment for both parties!\n\nAt the same time, the DLANCE token shows excellent chances for huge value growth in the future, and that is precisely why there are already so many users who are using this unique opportunity to make great returns by investing early!\n\n>>>Buy DeeLance Now<<<\n\nThe Future of Love Hate Inu (LHINU)\n\nWhat crypto experts point out is that the best vote-2-earn meme coin, Love Hate Inu (LHINU), will achieve fantastic results in the future, especially after the end of the presale and the tier 1 listing that awaits us soon!\n\nFrom the Love Hate Andrew Tate Demo Voting poll we saw the viral potential of this meme coin, and what is now crystal clear is that LHINU is set for massive gains in the future! Grab it before the first exchange listing at the listing price!\n\n>>>Buy Love Hate Inu Now<<<\n\nConclusion\n\nETH will reach 3K in the future, but until that happens, you should turn to five young cryptos (AiDoge, Ecoterra, yPredict, DeeLance, and Love Hate Inu), which are ready to dominate the market due to their utility and potential for massive gains!\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLWJ1eS1ldGhlcmV1bS1pbi1jYW5hZGHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "How to buy Ethereum in Canada? - Watcher Guru",
        "content": "The Ultimate Guide to Purchasing Ethereum in Canada\n\nAre you interested in investing in Ethereum, one of the most popular cryptocurrencies? If you are a Canadian resident, you might wonder how to buy Ethereum in Canada.\n\nYou may also wonder if purchasing Ethereum is legal and how to buy it.\n\nIn this ultimate guide, we will walk you through the process of buying Ethereum in Canada, step by step.\n\nIs it legal to buy Ethereum in Canada?\n\nYes, it is legal to buy Ethereum in Canada. The Canadian government has been supportive of cryptocurrencies and blockchain technology. However, crypto regulations are still evolving and can differ between provinces. So, before you buy you may want to explore your province’s cryptocurrency regulations to be on the safe side.\n\n\n\nSource: CNBC\n\nHow to Buy Ethereum in Canada\n\nHere is a Step-by-step Guide to Help You Buy Ethereum in Canada:\n\nChoose a cryptocurrency exchange platform. Create an account by providing your name, email address, and password. Some exchanges may require additional verification steps. Fund your account using various payment methods, such as credit or debit cards, online bill payments, and bank transfers. Buy Ethereum by selecting the amount you wish to purchase and confirming your purchase. Store your Ethereum securely in a wallet.\n\nA Closer Look at These Steps\n\nChoose a Cryptocurrency Exchange Platform\n\nThe first step in buying Ethereum is to choose a cryptocurrency exchange platform. Several options are available in Canada, including Coinsquare, Kraken, Bitbuy, and Shakepay. Each exchange platform has advantages and disadvantages, so it’s important to research and choose the one that best fits your needs.\n\nCreate an Account\n\nOnce you have chosen a cryptocurrency exchange platform, the next step is to create an account. This typically involves providing your name, email address, and password. Some exchanges may also require additional verification steps, such as uploading a government-issued ID.\n\nFund Your Account\n\nAfter creating your account, you must fund it with Canadian dollars. Most cryptocurrency exchange platforms in Canada accept various payment methods, including credit or debit cards, online bill payments, and bank transfers. Choose the payment method that is most convenient for you and follow the instructions provided by the exchange platform.\n\nBuy Ethereum\n\nOnce your account is funded, you can now buy Ethereum. Simply navigate to the Ethereum trading page on the exchange platform and select the amount of Ethereum you wish to purchase. Review the transaction details, including the current market price and any fees associated with the transaction, and then confirm your purchase.\n\nSource: Crypto News\n\nStore your Ethereum\n\nAfter purchasing Ethereum, storing it in a secure wallet is important. Several types of wallets are available, including hardware, software, and paper wallets. Choose the type of wallet that best fits your needs and follow the instructions provided to store your Ethereum securely.\n\nHow to Choose the Best Exchange Platforms for Buying Ethereum in Canada\n\nConsider reputation and security, user interface and experience, and customer support when choosing an exchange platform. Review the fee structure, including trading fees and other charges associated with buying Ethereum.\n\nReputation and security\n\nOne of the most important factors to consider when choosing a cryptocurrency exchange platform is reputation and security. Look for exchanges with a good reputation in the industry that have not experienced any major security breaches.\n\nUser interface and experience\n\nAnother important factor to consider is the user interface and experience. Choose an exchange platform that is easy to navigate and has a user-friendly interface. This is especially important when it comes to payment options. The easier the platform is to navigate, the easier it will be for you to understand your crypto assets.\n\nCustomer support\n\nCustomer support is also an important factor to consider when choosing a cryptocurrency exchange platform. Look for exchanges that offer reliable customer support and have a good track record of resolving customer issues.\n\nTrading fees and other charges associated with buying Ethereum in Canada\n\nSource – Pixabay\n\nWhen buying Ethereum in Canada, it’s important to consider the trading fees and other charges associated with the transaction. Most crypto exchanges may charge a percentage-based fee for each transaction. This can vary depending on the exchange and the amount of crypto purchased.\n\nIn addition to trading fees, other charges may be associated with buying Ethereum, such as deposit and withdrawal fees. Be sure to review the fee structure of the exchange platform before making any transactions.\n\nDifferent Ways to Fund Your Account\n\nAs mentioned earlier, several ways to fund your cryptocurrency exchange account in Canada exist. Here are some of the most common payment methods accepted by exchange platforms:\n\nCredit or debit cards\n\nMany cryptocurrency exchange platforms in Canada accept credit or debit card payments. This is probably one of the fastest and easiest ways to fund your account. just keep in might you may incur higher fees than other payment methods. We recommend taking an extra moment or two to review various terms and conditions to understand what you’re signing up for.\n\nOnline bill payment\n\nSome exchange platforms also accept online bill payment as a payment method. This involves linking your bank account to the exchange platform and making payments through your online banking portal.\n\nBank transfers\n\nBank transfers are another common payment method accepted by cryptocurrency exchange platforms. This involves transferring funds from your bank account to the exchange platform, which can take several business days.\n\nConclusion and summary of key points\n\nIn summary, buying Ethereum in Canada is legal and relatively easy. To purchase Ethereum, you must choose a cryptocurrency exchange platform, create an account, fund your account, and then buy Ethereum.\n\nWe recommend choosing a reputable exchange platform. You’ll also want to consider the trading fees and other charges associated with the transactions. Plus, you will want to store your Ethereum in a secure wallet.\n\nInvesting in Ethereum can be a great way to diversify your portfolio. It’s a great way to utilize blockchain technology’s benefits, like smart contracts and peer-to-peer transactions.\n\nIf you want to purchase Ethereum, follow the steps outlined in this guide and start investing today."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYWF2ZS1nb2VzLWxpdmUtb24tc2Nyb2xsLWFscGhhLXRlc3RuZXQtYS1nYW1lLWNoYW5nZXItZm9yLWV0aGVyZXVtLXNjYWxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Aave Goes Live on Scroll Alpha Testnet: A Game-Changer for Ethereum Scaling? - BSC NEWS",
        "content": "Disclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: The content in the above article is a press release, provided by a third party. Readers should do their own research before interacting or engaging with the mentioned companies and/or any related services. BSC News is neither directly nor indirectly responsible for any damage or loss caused or alleged to be caused by or in connection with the use of any content, goods or services mentioned in the above article.\n\nDisclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: This is a paid Ask Me Anything (AMA), BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement AMA for $2000 Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the AMA.\n\nDisclaimer: This article is exclusive BSC News Premium Content. Premium content is viewable without a membership for a limited time. After the limited time period expires, readers will need to either subscribe or hold a BSC News NFT to view Premium Content. Visit the BSC News NFT website, Discord, and Twitter to learn more about becoming a Premium member.\n\nDisclaimer: The content of this piece is the opinion of the writer. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research.\n\nDisclaimer: Disclaimer: This article is written by a visiting author. Opinions herein are those of the visiting author. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9uZXctY29zbW9zLWNoYWluLXdpbGwtdXNlLWxpcXVpZC1zdGFraW5nLXRva2Vucy1mcm9tLW90aGVyLW5ldHdvcmtzLWZvci1zZWN1cml0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "New Cosmos chain will use liquid staking tokens from other networks for security - Cointelegraph",
        "content": "A new Cosmos-based blockchain called “Tenet'' will use liquid staking coins from other networks to secure its transactions, potentially allowing the new network to inherit the security of older ones, according to a May 3 announcement from the developers.\n\nThe network is currently available as a testnet and will launch a mainnet version as soon as testing is complete. This comes after liquid staking has recently become the largest decentralized finance (DeFi) protocol category.\n\nLiquid staking protocols such as Lido, Rocket Pool and Ankr allow users to stake their coins with a network of validators and receive rewards without having to run their own nodes. These protocols also provide users with tokens called “liquid staking derivatives,” or LSDs, redeemable for the underlying deposits and rewards.\n\nAccording to the announcement, Tenet will allow users to “restake” these LSDs to earn additional rewards on its network. And it will provide users with tokens that represent the LSDs themselves. The team calls these third-order tokens “liquid liquid staking derivatives,” or LLSDs. LLSDs will be usable in lending apps and decentralized exchanges throughout the Tenet network, the announcement said.\n\nThe team expects there to be two core benefits to using LSDs instead of a native coin to secure the network. First, it “ensures the long-term security of the Tenet chain by leveraging the joint security of each [layer 1] ecosystem it services.” Second, it should “bring additional liquidity and yield opportunities to LSDs.”\n\nRelated: Ethereum ‘re-staking’ protocol EigenLayer launches on testnet\n\nAt launch, the protocol is expected to allow liquid staking derivatives of Ether (ETH), BNB (BNB), Cosmos (ATOM), Solana (SOL) and Polygon (MATIC) to be restaked on Tenet.\n\nThe new network is being developed by former executives of Ankr and Blockdaemon and is advised by members of the Lido, Ankr and OpenAI teams.\n\nLiquid staking protocols have existed since 2020 when Lido was first launched. They grew in popularity in 2022 and early 2023 as the Ethereum network implemented a move to proof-of-stake and began to allow staking withdrawals. On May 1, crypto analytics platform DefiLlama announced that liquid staking had become the top category of DeFi apps when measured by total value locked.\n\nSome experts have argued that liquid staking may grow in the future as a result of the Ethereum Shanghai upgrade."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8venljcnlwdG8uY29tL3NvbGFuYS1zdXJwYXNzZXMtZXRoZXJldW0taW4tbW9zdC1vbi1jaGFpbi1hY3RpdmUtYWRkcmVzc2VzL9IBVWh0dHBzOi8venljcnlwdG8uY29tL3NvbGFuYS1zdXJwYXNzZXMtZXRoZXJldW0taW4tbW9zdC1vbi1jaGFpbi1hY3RpdmUtYWRkcmVzc2VzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Solana Surpasses Ethereum In Most On-Chain Active Addresses - ZyCrypto",
        "content": "Advertisement\n\nSolana, one of the largest “Ethereum Killers”, has surpassed the latter to become the network with the most transactions.\n\nOn Wednesday, Nansen shared a tweet comparing April’s most active on-chain addresses. According to the firm, Solana came in second after BNB Chain, becoming the network with the most active address by chain at 5.1 million in April.\n\nAnd despite that figure dropping by around 12% from March, the cryptocurrency network still managed to outdo Ethereum, which had 4.9 million active addresses in April.\n\nSolana also surpassed Ethereum by non-vote transactions last month. Non-vote transactions are transactions that do not involve any voting or decision-making by token holders. They typically involve the transfer of cryptocurrency between wallets or accounts and are the most common type of transaction on most blockchain networks due to their simplicity. According to Nansen data, as of April 30, Solana’s total non-vote transactions stood at 24.3 million compared to Ethereum’s 974,972.\n\nSolana’s attractive growth can be attributed to various factors, including a surge in developers and users due to its attractive transaction speeds and costs. Apart from announcing various developments that go into improving the network, including a Chat GPT plugin and a web3 phone, Solana’s ballooning transactions have also been propelled by NFTs.\n\nAdvertisement\n\nRecently, Mad Lads, a new project launched on Solana, became the most traded collection generating $17 million compared with $11 million for Yuga Labs’ Bored Ape Yacht Club collection during the last week of April. This is despite the Solana facing a major setback following the exit of y00ts and DeGods, two of its most popular collections, earlier this year.\n\nLaunched roughly a month ago, Mad Lads is a unique type of NFT that falls in a category called xNFTs. Ideally, xNFTs combine the features of traditional NFTs and executable code, meaning users can use them to conduct other activities such as gaming and chatting.\n\nThat said, Solana’s native token SOL has also performed well, soaring by over 116% since January 1. This is compared to Bitcoin, up 70%, and Ether, up just over 50% year-to-date.\n\nAt press time, SOL was trading at $21.47, down 3.36% in the past 24 hours, according to CoinMarketCap data. On the other hand, Ether rose by 1.66% in the same period and was exchanging hands at $1,851."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9hLWd1aWRlLW9uLWhvdy10by1icmlkZ2UtZnJvbS1zb2xhbmEtdG8tZXRoZXJldW0tMTY1NTU5OTEuaHRt0gFpaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L2EtZ3VpZGUtb24taG93LXRvLWJyaWRnZS1mcm9tLXNvbGFuYS10by1ldGhlcmV1bS0xNjU1NTk5MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "A guide on how to bridge from Solana to Ethereum - CNBCTV18",
        "content": "Due to the complex nature of blockchain technology, linking assets across blockchains can get tedious. There is where blockchain bridges come in. They enable the transfer of assets from one blockchain to another, providing users access to a wider range of decentralised applications.\n\nTypically, a cross-chain bridge entails using a smart contract to lock or burn tokens on the source chain and another smart contract to unlock or mint tokens on the destination chain.\n\nFor instance, some cross-chain bridges allow one to transfer assets between Ethereum and Solana. Bridges enable interoperability between two blockchain networks while leveraging their respective benefits, such as exploring unique dApps, trading with lower transaction fees, and increasing investor’s exposure to different assets that otherwise would not have been possible. In this article, we will examine how to bridge assets from Solana to Ethereum. But first, let’s explore how cross-chain bridges operate.\n\nHow do cross-chain bridges work?\n\nAs mentioned earlier, blockchain assets often cannot be directly transferred across different blockchains. To solve this issue, cross-chain bridges create \"wrapped\" versions of the asset that can be transferred to another blockchain.\n\nSuppose you want to send one Solana coin to an Ethereum wallet using a cross-chain bridge. The wallet will receive a \"wrapped\" token that represents the Solana coin in the form of an ERC-20 token, which is supported on the Ethereum blockchain.\n\nA quick note here is that there are two main types of bridges: Trusted bridges, which are controlled by a centralised entity, and trustless bridges, which operate on algorithms and smart contracts.\n\nLet us now understand how one can bridge from Solana to Ethereum.\n\nWith Allbridge\n\nOne of the many bridging options available to users is Allbridge. It assists in connecting EVM networks like Polygon and Ethereum with non-EVM chains such as Solana. Since its inception, Allbridge has facilitated over $6.4 million worth of asset transfers across blockchains. The transactions on Allbridge normally settle within 1 to 5 minutes, while the average fee charged for transactions is 0.3 percent.\n\nTo utilise Allbridge, simply navigate to their website, connect the Solana-supported wallet, and select the \"From Solana to Ethereum\" option. Then, input the destination address and enter the amount to bridge. The transaction then needs to be completed by clicking \"send\".\n\nUsing Portal Bridge\n\nPortal Bridge is one of the most popular options for bridging assets between Solana and Ethereum.\n\nThis is how the transfer can be done: First, go to Portal bridge, choose \"Source Solana to Target Ethereum\", and then select an asset you want to transfer. Connect two wallets on Solana and Ethereum. Finally, insert the address and amount, then proceed to approve the transaction by paying the network fees.\n\nOnce the transfer is complete, the bridge will lock your asset on the Solana network and mint equivalent tokens on the Ethereum network. You will get a confirmation once the process is successful. The procedure normally takes 8 to 10 minutes.\n\nWith Centralised Exchanges (CEX)\n\nCentralised exchanges have been a popular way to move assets between blockchains once cross-chain bridge thefts, like the Wormhole exploit, emerged as a security risk for users. Each has pros and cons, but both options can be utilized per individual preference. For instance, decentralized bridges charge more fees than centralized solutions, while CEXs require submitting a KYC and personal details on the platform before transferring funds.\n\nTo get started, open your CEX account, go to your wallet, and transfer ETH from your wallet. After receiving the asset, you then need to convert your funds to SOL. After the conversion, withdraw your SOL and send it back to your Solana wallet.\n\nConclusion\n\nThe two most well-known decentralised finance (DeFi) platforms available to users are Solana and Ethereum, and a number of options have been developed to allow users to transfer assets between these blockchains.\n\nIt is also important to note that cross-chain-related thefts have emerged as a major security risk in recent years, and one must weigh the options before choosing any bridge."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3MvYnVzaW5lc3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvY3VycmVuY3ktcHJpY2VzLW9uLW1heS00LWJpdGNvaW4taG9sZHMtYWJvdmUtMjg1MDAtZXRoZXJldW0tcmlzZXMtdXAtdG8tMi0xMDUyMzM2MS5odG1s0gGbAWh0dHBzOi8vd3d3Lm1vbmV5Y29udHJvbC5jb20vbmV3cy9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS9jcnlwdG9jdXJyZW5jeS1wcmljZXMtb24tbWF5LTQtYml0Y29pbi1ob2xkcy1hYm92ZS0yODUwMC1ldGhlcmV1bS1yaXNlcy11cC10by0yLTEwNTIzMzYxLmh0bWwvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Cryptocurrency Prices on May 4: Bitcoin holds above $28,500; Ethereum rises up to 2% - Moneycontrol",
        "content": "Bitcoin\n\nCryptocurrencies are largely trading higher after the Federal Reserve hikes interest rates by a quarter point.\n\nThe global crypto market cap is $1.20 trillion, a 1.63% increase over the last day.\n\nStory continues below Advertisement Remove Ad\n\nThe total crypto market volume over the last 24 hours is $42.15 billion, which makes a 19.20% increase. The total volume in DeFi is currently $3.44 billion, 8.17% of the total crypto market 24-hour volume.\n\nBitcoin’s dominance is currently 47.03%, an increase of 0.13% over the day.\n\nBitcoin rose by almost 2% to $28,526 and Ethereum was above $1,850, while the global cryptocurrency market cap rose by 1% to $1.17 trillion.\n\nThe volume of all stablecoins is now $38.50 billion, which is 91.35% of the total crypto market 24-hour volume. Speculators may be anticipating an announcement on interest rate hikes by the Federal Reserve, leading some experts to predict that ongoing banking crises and the US economic outlook may affect short-term price movements in Bitcoin.\n\nThe banking crisis doesn't appear to be over yet. Shares of PacWest Bancorp (PACW) fell by more than 50% in after-hours action on Wednesday following a Bloomberg report the U.S.-based lender is mulling a range of strategic options.\n\nBitcoin (BTC) was up on the news, rising more than 2% to $28,900 at press time.\n\nStory continues below Advertisement Remove Ad\n\nStory continues below Advertisement Remove Ad\n\nThe news on PacWest comes only days after First Republic Bank (FRC) was taken over by the Federal Deposit Insurance Corp.\n\nAt 8.00 am on May 4, these were the prices of the top cryptocurrencies (data from WazirX):"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGFpbHljb2luLmNvbS9zb2xhbmFzLXBoYW50b20td2FsbGV0LWdvZXMtbXVsdGljaGFpbi1vdmVyaGF1bHMtbmZ0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Solana's Phantom Wallet Goes Multichain, Overhauls NFTs - DailyCoin",
        "content": "Phantom Wallet now includes support for Ethereum and Polygon alongside Solana.\n\nEarlier, Phantom explained why it is going multichain.\n\nMultichain functionality is just the latest of Phantom’s upgrades.\n\nThe future will be multichain, a sentiment echoed by many in the crypto space. Phantom is one project moving in that direction.\n\nSolana’s flagship self-custodial wallet Phantom Wallet is broadening its scope by adding support for Ethereum and Polygon networks.\n\nPhantom Goes Multichain, with Ethereum and Polygon Support\n\nOn Monday, May 1, Phantom announced that its multichain feature is up and running. Phantom users will now be able to manage their NFTs and tokens on Ethereum, Polygon, and Solana.\n\n1/ Phantom multichain is rolling out today! 🥳\n\n\n\nNow you can use @ethereum, @0xPolygon, and @solana without switching wallets.\n\n\n\nWith support for multiple secret recovery phrases, it’s easy to import all of your wallets in seconds.\n\n\n\nCompatible everywhere with a MetaMask button. pic.twitter.com/wbvwmZ1ZlJ — Phantom (@phantom) May 1, 2023\n\nThe new upgrade will enable users to use decentralized applications (dApps) across chains seamlessly. Specifically, the wallet will automatically connect to the appropriate network without manual switching.\n\nWith this move, Phantom aims to make itself more versatile and user-friendly for a broader set of crypto traders. The multichain features appeal especially to NFT users, which can now manage their NFTs on multiple chains.\n\nPhantom Adds More Features For NFT Management\n\nIn addition to the multichain functionality, Phantom introduced more features, including better NFT management and enhanced security.\n\nPhantom’s new NFT management features let users search, pin, and manage listings on marketplaces directly within the wallet. The system will also enable users to hide spam NFTs from view.\n\nThe wallet also features a security upgrade, which lets users preview transactions in an easy-to-read format. The wallet will also have an automated blocklist to help prevent malicious transactions.\n\nOn the Flipside\n\nPhantom first announced going multichain in November 2022, to capitalize on the diminishing popularity of centralized exchanges. Since the fall of FTX, users have been looking for alternative solutions for crypto custody.\n\nEthereum is by far the largest smart-contract network in the world, both in terms of market cap and total value locked. On the other hand, Polygon is the most popular scaling solution for Ethereum.\n\nWhy You Should Care\n\nSolana is betting that Phantom’s growing market share among self-custodial wallets will ultimately bring more users to its network.\n\nRead more about Solana’s latest initiative: a Web3 phone:\n\nCan Solana’s Crypto-First ‘Saga’ Smartphone Succeed Where Others Failed?\n\nRead about Crypto.com’s GPT chatbot:\n\nCrypto.com Launches Amy, an AI Companion for Traders"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpZy1leWVzLWNvaW4tcHJldmFpbHMtb3Zlci1iZWFyLW1hcmtldC1hcy1ldGhlcmV1bS1hbmQtcmlwcGxlLXNsdW1wL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 May 2023 07:00:00 GMT",
        "title": "Big Eyes Coin Prevails Over Bear Market as Ethereum and Ripple Slump - Analytics Insight",
        "content": "The crypto market is staring at a slump after reaching wild highs in April. Ripple and Ethereum, the biggest gainers of the last bull run, are facing selling pressure as the market has turned red. Ripple saw its value climb to $0.5697 but is now trading at $0.4641. Ethereum saw its price reach $2,127, but the second-biggest crypto by market cap is now trading at $1,837. Amidst marketwide bearish performance, Big Eyes Coin, a meme coin in presale, is emerging as an outlier to the market sentiments. The project is going through a highly successful, and the crypto community has taken note.\n\nRipple Feels the Heat From Crypto Liquidation\n\nRipple has seen its value come down to $0.4641 as the token has lost almost 3% of its value. The token’s downward trend has come after a strong performance, even in the face of a lawsuit filed by the US SEC. XRP’s poor performance comes after major exchanges are reporting wide-scale liquidations.\n\nThe Ripple network was built to facilitate efficient cross-border transactions. The network only takes seconds to perform transactions that traditional methods take upwards of hours or even days. The network uses XRP as its utility token and has seen adoption from governments and large banks like Santander. The network is projected to grow in popularity and value as its on-chain activity grows rapidly.\n\nEthereum Slips Below $1,900 Level\n\nEthereum slipped below the $1,900 level after a month of strong performance. The network saw its price rise to $2,127 after its successful Shanghai upgrade. The upgrade marked the network’s full transition into a proof-of-stake (PoS) network. As of writing, ETH is trading at $1,848.\n\nEthereum is the second-largest cryptocurrency by market capitalization, and the network has the largest ecosystem of Dapps. Ethereum boasts the largest developer community and has always been at the forefront of crypto innovation. The network PoS upgrade is aimed at making it energy and cost-efficient. The upgrade will improve the network’s scalability and will drive more DeFi projects into the network. The network’s improved fundamentals will make it a strong investment for the future.\n\nBig Eyes Coin Beats Market Blues\n\nBig Eyes Coin is in its presale, and the token has turned heads with its strong performance. The project has raked up investment worth more than $34.5 million. The cat-themed meme coin’s presale will end on June 3rd and launch on Uniswap on June 15th. Big Eyes Coin Team has released the END300 promo code to celebrate the successful close of the presale. By using the code, investors can avail a 300% bonus on their purchase of BIG tokens.\n\nThe biggest draw of the network is its community-focused development roadmap. The network has released NFT cards that community members can use to mint BIG NFTs. Members can trade their BIG NFTs on Opensea, one of the largest NFT marketplaces. Additionally, the project has stated its aspirations to build DeFi projects in its ecosystem. The project is reportedly trying its hand in the p2e NFT gaming arena. These steps will potentially create wealth for the Big Eyes Coin community.\n\nBig Eyes Coin is also committed to acting on climate change. The project has set aside 5% of its liquidity to donate to charity. The community members can decide the causes the project contributes to.\n\nWhile the crypto market looks at a downturn, Big Eyes Coin has emerged as a bright spot. The project’s hugely successful presale underlines investor confidence in the project and signals its utility too. Big Eyes Coin’s performance is significant in the face of underperformance by heavyweights like ETH and XRP.\n\nSo, waste no more time and join the Big Eyes Coin presale to get in on an exciting crypto journey. Also, don’t forget to use the END300 promo code to make your entry into the BIG presale extra sweet.\n\nFor More on Big Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nOpensea: https://opensea.io/collection/big-eyes-lootbox-cards\n\nTwitter: https://twitter.com/BigEyesCoin\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2FsdGNvaW5zLXRvLWludmVzdC1pbi1hcy1iaXRjb2luLWFuZC1ldGhlcmV1bS1zdXJnZS1va2ItcG9seWdvbi1hbmQtYmlnLWV5ZXMtY29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Altcoins To Invest In As Bitcoin And Ethereum Surge: OKB, Polygon And Big Eyes Coin - Analytics Insight",
        "content": "Bitcoin (BTC) and Ethereum (ETH) have experienced a surge in trading prices, with BTC rising to $29,035 and ETH just below $1,900. BTC volume also increased by 84.70% in the last 24 hours. Despite concerns over First Republic Bank, Bitcoin has been steadily rising since hitting a low of $27,217 the day before. The global cryptocurrency market cap also rose by 1.18% in the last 24 hours to around $1.20 trillion, with Bitcoin’s market cap standing at $557 billion. While the market movement remains range bound, here are three altcoins to invest in for great returns: OKB, Polygon (MATIC) and Big Eyes Coin (BIG).\n\nOKB: The Utility Token\n\nOKB is an ERC-20 token on the Ethereum blockchain that acts as a utility token for OKX exchange users. Traders can receive discounts, access token offerings, and earn interest on their savings depending on the number of OKB tokens held. Additionally, OKB is designed as a deflationary token through the “Buy-Back & Burn” protocol, which burns millions of dollars in OKB tokens every quarter, adding value to holders.\n\nPolygon’s Current Decline A Minor Correction\n\nPolygon (MATIC) is currently below $1 as bears continue to pressure its price. Since April 19th, 2023, it has been on a gradual downtrend to its current price level of $0.966. Although recent price volatility and decline have affected other tokens in the market, MATIC has held onto most of its gains and remains above its January 1st price of $0.76. However, a sweep of previous lows remains possible if the bears maintain their charge, and the crypto market hopes the current decline is a minor correction rather than a downturn similar to the crypto winter of 2022.\n\nBig Eyes Coin To Launch On Top CEX, Uniswap\n\nBig Eyes Coin (BIG) has raised an impressive $34.5 million in presale and is set to launch on a top-tier CEX on June 15th, after the presale ends on June 3rd. The team has not yet confirmed which exchange it will launch on, but speculations are already circulating within the crypto community. The team has developed a roadmap for the next six months explaining the future plans for one of the most-promising. BIG plans to be listed on several exchanges, including Gate.io, Bitget, BKEX, MEXC, LBank, CoinEx, BIT, BitMart, Deepcoin, XT.COM, BitUBU, Hotbit, and BitForex, as part of its exchange roadmap. The team is dedicated to keeping the community informed and engaged throughout the project’s growth and development.\n\nBig Eyes Coin is gaining recognition not only in the cryptocurrency market but also in the non-fungible tokens (NFTs) space. The project team is currently working on developing its own line of NFTs, known as SushiCrew, featuring the project’s iconic cat characters. Each SushiCrew NFT will be unique, with its own set of characteristics and traits, making them highly collectible. The introduction of these NFTs is expected to strengthen Big Eyes Coin’s brand and provide a new revenue stream for the community. The team believes that the NFT market is growing, and by launching SushiCrew NFTs, Big Eyes Coin is well-positioned to take advantage of this trend and establish itself as a significant player in the crypto industry.\n\nThe Big Eyes team expresses gratitude to the CatCrew for their significant support in the Big Eyes Coin project, which has led to the impressive presale amount. With the end of the presale on June 3rd and the launch on a top-tier CEX set for June 15th, the team is confident that Big Eyes Coin is the project to watch in the crypto space.\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nOpensea: https://opensea.io/collection/big-eyes-lootbox-cards\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9pbnRlcm5ldC1jb21wdXRlci1pY3AtdGVhc2VzLWV0aGVyZXVtLWludGVncmF0aW9uLWNvbGxhdGVyYWwtbmV0d29yay1jb2x0LXByZXBhcmVzLWZvci0zNXgtcmV0dXJucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "COLT Boasts 35x Returns While ICP Teases ETH Integration - Analytics Insight",
        "content": "Internet Computer (ICP) is setting its sights on providing native ETH integration to improve communication across blockchains. While this announcement hits the streets, Collateral Network (COLT) is turning heads with 35x returns while still being in public presale. This token is also set to revolutionize the lending and crypto industries with never-before-seen real-world utility.\n\n>>BUY COLT TOKENS NOW<<\n\nInternet Computer (ICP) Hints at Native ETH Integration\n\nIn an attempt to provide a true World Computer and enable a multi-chain environment where smart contracts can communicate across blockchains, Internet Computer (ICP) shares its plans to bring native ETH integration via its official website. Internet Computer (ICP) is already integrated with the Bitcoin Network and is now looking to expand by entering the ETH blockchain.\n\nWith the upcoming integration, Internet Computer (ICP) wants to enable smart contracts on both the Ethereum (ETH) and Internet Computer (ICP) networks to interact with each other, enabling the Internet Computer (ICP) to read balances of ETH or ERC-20 accounts safely. Moreover, this integration will allow Internet Computer (ICP) to sign and submit ETH transactions.\n\nAnd with the recent spikes in ETH transaction fees and other development obstacles, Internet Computer (ICP) could bring a way for new users to enjoy the benefits of ETH fully.\n\nCollateral Network (COLT) Is Getting Ready for 35x Returns\n\nAs Internet Computer (ICP) hints at new developments, Collateral Network (COLT) is already showing excellent results and returns. Even though it is still in public presale, Collateral Network (COLT) is already seeing growth, with experts predicting 35x returns over the next quarter.\n\nThe starting price for Collateral Network was $0.01 and has since risen to $0.014, which is already an increase.\n\nThe project has been receiving positive predictions due to the enormous changes and opportunities it’ll bring to the crypto community. The peer-to-peer lender is unique in that it enables people with physical assets to obtain crypto loans by using them as collateral. The whole process is performed on the blockchain with the use of smart contracts making the transaction seamless, private and transparent for both parties.\n\nFor example, if you need a loan, you can leverage your luxury watch, gold, real estate, fine wines, etc., by sending your asset to Collateral Network. Once the relevant checks are finalized an NFT is minted of the asset and broken down into fractions (fractionalization). This enables multiple people on the platform to contribute to the loans with smaller amounts of capital (crowdlending).\n\nThis unique approach to asset-backed lending has got the industry buzzing as the real-world applications of this lending protocol are infinite industry altering. No mean feat for a market that is estimated to be worth $7 trillion dollars a year.\n\nWhile we’re still waiting to see how successful ICP’s ETH integration is, COLT is proving to be one of the most profitable crypto projects on the market.\n\nExplore the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZmluYm9sZC5jb20vZ3VpZGUvZXRoZXJldW1zLXJvbGUtaW4td2ViMy1kZXZlbG9wbWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Building the Future: Ethereum's Role in Web3 Development and its Impact on the Crypto Market - Finbold - Finance in Bold",
        "content": "Introduction\n\nEthereum is a decentralized blockchain platform that allows developers to build and deploy decentralized applications (dApps). Its cryptocurrency, Ether (ETH), is the second-largest by market capitalization, behind only Bitcoin. Ethereum’s importance lies in its ability to enable complex smart contracts, DeFi applications, and NFTs.\n\nThe price of Ethereum has significant implications for the broader crypto market and developer ecosystem. As a leading platform, Ethereum’s price often reflects market sentiment towards cryptocurrencies. Additionally, a higher ETH price can incentivize more developers to build on the Ethereum platform, leading to increased innovation and adoption. Therefore, understanding the factors that influence Ethereum price today is crucial for developers looking to build on the platform.\n\nEthereum’s Role in Web3 Development\n\nExplanation of Web3 and Its Significance\n\nDefinition Web3, also known as the decentralized web, is the next generation of the internet. Unlike the current web, which relies on centralized servers and corporations, Web3 is based on decentralized blockchain technology. This means that data and applications are stored and run on a distributed network of computers, rather than a central server. Web3 has the potential to revolutionize the way we interact with the internet, by enabling more privacy, security, and user control.\n\nEthereum’s Role in Decentralized Applications (dApps)\n\nEthereum is a leading platform for building decentralized applications, or dApps. These applications are built using smart contracts, which are self-executing programs that run on the Ethereum blockchain. Some of the most popular use cases for dApps on Ethereum include:\n\nSmart Contracts and Their Use Cases\n\nSmart contracts allow for complex and automated agreements to be executed without the need for intermediaries. This can enable a wide range of use cases, from simple payment transactions to more complex supply chain management systems.\n\nDecentralized Finance (DeFi)\n\nDeFi applications on Ethereum allow for peer-to-peer financial transactions and services, such as lending, borrowing, and trading. These applications are often more accessible and transparent than traditional financial services, and can enable new forms of financial innovation.\n\nNon-Fungible Tokens (NFTs)\n\nNFTs are unique digital assets that are verified on the Ethereum blockchain. They can represent anything from artwork to collectibles, and are often used in the gaming and entertainment industries. NFTs have exploded in popularity in recent years, with multi-million dollar sales of digital art and other unique assets.\n\nFactors Influencing Ethereum’s Price\n\nSupply and Demand Dynamics\n\nLike any other asset, the price of Ethereum is influenced by basic economic principles. The total supply of Ethereum is limited to 18 million per year to reduce inflation. However, demand for Ethereum can be influenced by various factors, including market sentiment, news events, and the growth of the broader crypto ecosystem.\n\nTechnological Advancements (e.g., Ethereum 2.0, Layer 2 Solutions)\n\nEthereum’s technological advancements impact its price. For example, the upcoming Ethereum 2.0 upgrade is expected to increase scalability and reduce transaction fees. This could lead to higher adoption of Ethereum-based applications and demand for ETH. Additionally, layer 2 scaling solutions, such as Optimism and Arbitrum, could help reduce network congestion and transaction fees.\n\nMarket Sentiment and Speculation\n\nMarket sentiment and speculation can significantly affect Ethereum’s price. Positive news events, such as increased institutional adoption or regulatory clarity, can lead to higher demand and prices. Conversely, negative news events, such as security breaches or regulatory crackdowns, can lead to decreased demand and lower prices.\n\nAdoption and Use Cases\n\nFinally, the adoption and use cases of Ethereum-based applications impact Ethereum’s price. Increased usage of Ethereum-based applications could lead to higher demand for ETH, as users need ETH to pay for transaction fees and interact with smart contracts.\n\nThe Impact of Ethereum’s Future on the Crypto Market\n\nHow Ethereum’s Growth Affects Other Cryptocurrencies\n\nAs a leading blockchain platform, Ethereum’s future growth has significant implications for other cryptocurrencies. Ethereum’s popularity and network effect make it an attractive platform for developers and investors, which can lead to increased innovation and adoption of the broader crypto ecosystem. Additionally, the growth of Ethereum-based DeFi and NFTs has helped to increase interest and demand for other cryptocurrencies, such as stablecoins and privacy-focused coins.\n\nNetwork Effect\n\nEthereum’s network effect is important for its continued success and growth. The established developer ecosystem, range of applications, and large user base all contribute to the strength of the network. As more developers and users interact with Ethereum-based applications, the network effect is likely to continue growing.\n\nChallenges and Competition\n\nHowever, Ethereum faces competition from other blockchain platforms such as Binance Smart Chain, Solana, and Polkadot. These platforms may offer faster transaction speeds and lower fees, attracting developers and users away from Ethereum. Additionally, Ethereum 2.0 must be successfully implemented for Ethereum to remain competitive in the long term.\n\nLong-Term Outlook for Ethereum\n\nOverall, Ethereum has a positive long-term outlook as a leading platform for building decentralized applications. However, the crypto market is constantly evolving, and Ethereum must continue to innovate and adapt to remain competitive. Regulatory and security risks could also impact the growth and adoption of the broader crypto ecosystem.\n\nStaying Ahead as a Developer\n\nDevelopers building on the Ethereum platform should stay up-to-date with the latest developments and upgrades. This includes following Ethereum’s official blog and social media accounts and participating in developer communities like Ethereum’s Discord channel or Reddit communities.\n\nDevelopers should also be familiar with programming languages and tools used for Ethereum development, like Solidity and Truffle. Staying up-to-date with new tools and frameworks, such as Layer 2 scaling solutions, can help developers build more efficient and scalable dApps.\n\nA Tip Collaborating and networking with other Ethereum developers is valuable for staying ahead. This includes participating in hackathons or attending Ethereum-focused conferences and events. Building relationships within the Ethereum developer community can help to share knowledge, find new opportunities, and stay informed about the latest developments.\n\nConclusion\n\nEthereum is a leading platform for building decentralized applications, and its role in Web3 development is crucial for the future of the decentralized internet. As Ethereum continues to grow and innovate, its impact on the broader crypto market is likely to continue to increase.\n\nFor developers, Ethereum offers a wide range of opportunities to build innovative and impactful decentralized applications. By staying up-to-date with the latest developments, learning new programming languages and tools, and collaborating within the developer community, developers can help to contribute to Ethereum’s growth and shape the future of the decentralized internet."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNS8wMy9iaXRjb2luLWFuZC1ldGhlcmV1bS1saXF1aWRpdHktaXMtZmxvd2luZy1pbnRvLW1lbWUtY29pbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum liquidity is flowing into meme coins - The Coin Republic",
        "content": "Introduction\n\nMeme coins have taken over the liquidity of Bitcoins, Ethereum and other cryptocurrencies.\n\nMeme coins are basically the crypto assets that gain popularity through social media trends, influencers and the community of the blockchain they are operating on. Some famous meme coins are Dogecoin and Shiba Inu.\n\nThese coins gain popularity overnight and also lose popularity overnight. Most meme coins become shit coins, that is useless coins. But the ones that are very trending nowadays and are doing incredibly in the last couple of years are Dogecoin and Shiba Inu.\n\nRecently, an anonymous crypto trader, named Crypto Tony alleged that the meme coins are taking away the liquidity of cryptocurrencies like Bitcoin and Ethereum.\n\nHe made this statement via Twitter through a tweet to his 289000 followers saying liquidity is flowing to meme coins from $BTC / $ETH. He also stated that this is the reason for the “ Sell in May” phenomenon.\n\n“Sell in May and Go away” is a phenomenon where it is believed from the historical performance of stocks, that due to the Halloween craze, the average growth of stocks in the months of November to April is much higher and stocks perform poorly during May to October. It’s a theory put forward by stock trader Almanac.\n\nThe anonymous trader\n\nThe tweet of this trader came during the time when Pepe coin, a famous meme coin is getting a 2300% rally every day. In the last 24 hours, it has surpassed Dogecoin also.\n\nAccording to the Ethereum Blockchain explorer, Pepe coin has about 75000 holders holding a total of $5 million worth of tokens.\n\nEven though the hype for this meme coin is quite high, some traders are backing off. A trader sold out coins worth $2 million bearing up a loss of $350000 because of less liquidity.\n\nHe then revealed in a tweet that he is still waiting for a position entry on Bitcoin, and his best option would be to wait for a long position upon a test of the range low at $26,600. He also suggested that he may even go for a short if they fail to hold this position.\n\nAccording to him, Dogecoin will increase its value soon after the new laws. And Bitcoin will go down to rise up the other Altcoins.\n\nHe is keeping a close eye on Altcoins for the third and fourth quarters in 2023."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMDMvc3VpLW5ldHdvcmstY3J5cHRvLWZpbmFsbHktcmVhbGl0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 May 2023 07:00:00 GMT",
        "title": "The SUI network and token are finally a reality: we are ready to revolutionize the crypto world. - The Cryptonomist",
        "content": "The launch of Tokens and Network Sui caused a stir in the crypto world because of the reputation of its parent company, Mysten Labs.\n\nMysten Labs was one of two spin-offs of Meta’s Diem project, the other being Aptos Labs, known as the so-called Solana Killer.\n\nMysten Labs is now in the process of launching the long-awaited Sui Network, which will usher in a new era of blockchain technology.\n\nAhead of the launch, Sui has raised huge amounts of money: Mysten Labs closed a $300 million Series B round last September, reaching a valuation of $2 billion, according to CrunchBase.\n\nThe launch of the Sui token and network is expected to revolutionize the way people interact with blockchain technology, making it more accessible to a wider range of users.\n\nThe SUI Network and Token: Here’s How It Will Change the Crypto World\n\nThe SUI network is designed to offer a number of features that will improve the user experience, including scalability, interoperability and security.\n\nThis revolutionary network will operate using a proof-of-stake consensus mechanism, which is designed to be more energy efficient and faster than the proof-of-work mechanism used by many other blockchain networks.\n\nThis means that the Sui network will be able to process transactions faster, making it more practical for everyday use.\n\nInteroperability is another important feature. It will allow users to transfer assets between different blockchain networks, which is a significant development.\n\nCurrently, many blockchain networks operate in isolation, making it difficult to transfer assets between them.\n\nThis has been one of the main obstacles to the widespread adoption of blockchain technology, as users have been reluctant to invest in assets that are tied to a specific network.\n\nThe Sui token is the native cryptocurrency of the Sui network. It will be used to pay transaction fees on the network and to incentivize users to participate in the network’s consensus mechanism.\n\nThe Sui Token will also be used to govern the network, giving users a voice in how the network is managed and developed.\n\nThe Sui Token is an ERC-20 token, which means it is compatible with the Ethereum blockchain.\n\nThis makes it easier for users to trade the token on cryptocurrency exchanges and use it in decentralized applications (dApps) built on the Ethereum blockchain.\n\nThe Potential of the Sui Network\n\nIn addition to its impressive features, the Sui Network has the potential to become the leading platform for NFT and gaming in the cryptocurrency industry.\n\nThis is due to its innovative programming language, Move, which is more intuitive and easier to use than other programming languages used in blockchain technology.\n\nThe team behind Sui said they want the network to become the platform of choice for NFTs and gambling because of the benefits Move offers.\n\nThe developers praised Move for its simplicity and ease of use, making it a more accessible language for writing smart contracts. This, in turn, could make it easier for developers to build decentralized and NFT applications on the Sui network.\n\nThe Move language was originally developed for the Diem blockchain, which was designed to provide a more stable and regulated cryptocurrency experience. However, with the launch of the Sui Network, Move has found a new home, and now its potential uses are very broad.\n\nOne of the key benefits of Move is its ability to ensure the security and fairness of smart contracts.\n\nThis is due to its unique type system, which is designed to prevent common programming errors that can lead to security vulnerabilities. With this programming language, developers can write more secure and reliable smart contracts, reducing the risk of hacking and other security breaches.\n\nIn addition to its security benefits, Move is designed to be more efficient than other programming languages used in blockchain technology.\n\nThis means that smart contracts written in Move can be executed faster and with less computing power, making them more practical for use in NFTs and games.\n\nFinal Thoughts on the Network\n\nIf the Sui Network succeeds in gaining widespread adoption and establishing itself as the platform of choice for NFTs and gaming, it could help drive the mass adoption of blockchain technology in the coming years.\n\nThe launch will be a significant event in the world of blockchain technology.\n\nThe characteristics of the Sui network, such as scalability, interoperability, and security, make it a promising platform for developers and users.\n\nThe success of the Sui token sale is a clear indication of the high interest in the network and its potential to transform the blockchain industry.\n\nHowever, the success of the token and the Sui network will depend on time and adoption.\n\nThe Mysten Labs team will have to work hard to build partnerships and promote the network to developers and users."
    }
]