[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTAvMzAvZXRoZXJldW0tc3BvdC1ldGYtZ3JheXNjYWxlLWJpdGNvaW4tamFudWFyeS_SAVZodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzEwLzMwL2V0aGVyZXVtLXNwb3QtZXRmLWdyYXlzY2FsZS1iaXRjb2luLWphbnVhcnkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Grayscale’s Ethereum ETF just entered a 240-day review process. Its Bitcoin cousin is expected in January - Fortune",
        "content": "The U.S. government on Friday published an application by crypto giant Grayscale to launch an Ethereum ETF for the spot market. Grayscale first applied for the ETF in early October, but the petition’s appearance on the Federal Reserve is significant because it starts a 240-day clock by which the Securities and Exchange Commission must respond.\n\nThe start of the Ethereum ETF process also coincides with a surge in crypto prices this month that analysts believe is correlated to impending decisions by the SEC on a batch of Bitcoin ETF applications by Grayscale, BlackRock, and others.\n\nSince the start of October, Bitcoin prices have jumped around 27% while Ethereum has climbed 7%.\n\nMany in the crypto industry believe the approval of ETF products, which make it easy for retail investors to buy various assets in the form of shares, will result in a flood of new liquidity into the markets.\n\nWhile Grayscale has sought to launch a Bitcoin ETF for years, the SEC has rebuffed these efforts, leading the company to sue the agency last year. In late August, a three-judge panel of the U.S. Court of Appeals issued a unanimous and resounding decision that opened the door to widespread expectations that the SEC would issue an approval soon.\n\nMany industry watchers have circled early January for when the SEC is likely to grant approval, in part because that will coincide with another “shot clock” deadline for a Bitcoin ETF application by the crypto hedge fund Ark Invest.\n\nWhile Ark is currently at the head of the approval queue, it remains to be seen if the SEC will approve its application first or instead approve a larger batch of applicants all at once. It’s also possible, though unlikely, the agency will find a new pretext to delay or not approve the Bitcoin ETF applications.\n\nThe process has been slow and convoluted in part because it involves a two-part approval—one to permit exchanges to list crypto ETFs, and a separate one for individual companies to issue the ETFs.\n\nIn a quirk of the regulatory process, the SEC has approved futures ETFs for both Bitcoin and Ethereum. While these are also crypto ETFs, the underlying assets they contain are not digital assets but instead futures contracts that are well understood only by investors well-versed in derivatives.\n\nIn response to a request for comment about the ETF application, a company spokeswoman said: “The filing reflects Grayscale’s ongoing commitment to converting its entire family of crypto investment products to ETFs.”"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1mYWNlcy1iaWctbW92ZS0yMDAwL9IBTGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1mYWNlcy1iaWctbW92ZS0yMDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Price Faces Big Move – Can Bulls Send ETH To $2,000? - NewsBTC",
        "content": "Ethereum price is consolidating gains below the $1,850 resistance against the US dollar. ETH must stay above the $1,750 support to start a fresh increase.\n\nEthereum is still struggling to gain pace for a move above $1,850.\n\nThe price is trading above $1,770 and the 100-hourly Simple Moving Average.\n\nThere is a key contracting triangle forming with support near $1,780 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could extend its decline if it fails to stay above the $1,740 support.\n\nEthereum Price Remains In Range\n\nEthereum failed to continue higher above the $1,850 level and started a downside correction. ETH corrected lower below $1,800, but the bulls remained active near $1,750.\n\nA low was formed near $1,741 and the price is now making a fresh attempt to gain pace, like Bitcoin. There was a move above the $1,780 level. The price tested the 50% Fib retracement level of the downward move from the $1,866 swing high to the $1,741 low.\n\nEthereum is now trading above $1,770 and the 100-hourly Simple Moving Average. There is also a key contracting triangle forming with support near $1,780 on the hourly chart of ETH/USD.\n\nOn the upside, the price is facing resistance near the $1,800 level. The first major resistance is near the $1,815 zone. It is near the 61.8% Fib retracement level of the downward move from the $1,866 swing high to the $1,741 low.\n\nSource: ETHUSD on TradingView.com\n\nA close above the $1,815 resistance could start a decent increase. In the stated case, Ether could revisit the $1,850 resistance. The next key resistance is near $1,865, above which the price could accelerate higher. In the stated case, the price could rise toward the $1,920 level. The main hurdle sits at $2,000.\n\nAnother Decline in ETH?\n\nIf Ethereum fails to clear the $1,815 resistance, it could start another decline. Initial support on the downside is near the $1,780 level, the 100-hourly Simple Moving Average, and the trend line.\n\nThe next key support is $1,740. A downside break below the $1,740 support might send the price further lower. In the stated case, Ether could drop toward the $1,700 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,720\n\nMajor Resistance Level – $1,815\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8xMC8zMC9ldGhlcmV1bS1oYXMtbGF5ZXItMC1wb3dlci1idXQtaXQtY291bGQtc3RpbGwtYmxvdy1pdC_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMTAvMzAvZXRoZXJldW0taGFzLWxheWVyLTAtcG93ZXItYnV0LWl0LWNvdWxkLXN0aWxsLWJsb3ctaXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Has Layer 0 Power. But It Could Still Blow It - CoinDesk",
        "content": "Ethereum Has Layer 0 Power. But It Could Still Blow It\n\nBefore it becomes foundational infrastructure for the next stage of the internet, there are three risks that the blockchain needs to avoid, says Paul Brody, head of blockchain at EY."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWV0aC1yb2NrZXRzLXVwLTgtMjAwMC1ldGgtaW5jb21pbmcuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Rockets Up 8% – $2,000 ETH Incoming? - Cryptonews",
        "content": "Ethereum Price Prediction: ETH Rockets Up 8% – $2,000 ETH Incoming?\n\nThe Ethereum price has risen to $1,815 today, gaining by 1.5% in 24 hours and 8.5% in the past week amid rising investor positivity.\n\nETH has also risen by 14.5% in the past fortnight, while the altcoin is up by 51% since the beginning of the year.\n\nThis makes it one of the best-performing major tokens since January, and with its fundamentals and momentum remaining strong, it could easily see additional gains in the coming days and weeks.\n\nEthereum Price Prediction: ETH Rockets Up 8% – $2,000 ETH Incoming?\n\n\n\nEthereum’s indicators continue to look very strong, with both its relative strength index (purple) and 30-day moving average (yellow) signalling further rises.\n\nIts RSI has risen back above 70 after dipping a little a few days, implying that buying pressure remains very much with the coin.\n\nLikewise, ETH’s 30-day average is climbing strongly towards its 200-day average (blue), with conventional wisdom suggesting that the current rally won’t peak until the shorter term average is noticeably higher.\n\nThe coin’s support level (green) also points to additional rises, while this indicator also suggests that ETH won’t fall back down to its pre-rally level if it corrects in the near future.\n\nETH continues to be strong as a result of investor positivity regarding Bitcoin ETFs, with the SEC looking increasingly like it will approve a number of recent applications at the start of the next year.\n\nSuch positivity has fed into the rest of the market, with ETH recovering in the past week or so after investors spent a couple of months overselling it.\n\nFundametals\n\n\n\nThe coin’s fundamentals weighed heavily against the selling it witnessed, yet now it has moved into a position where it’s ready to make up for lost ground.\n\nAnd it should rally more than pretty much any over alt if and when the Bitcoin ETFs are approved, and for various reasons.\n\nFor one, the approval of Bitcoin ETFs opens the door to the approval of Ethereum ETFs, with institutions interested in ETH more than any other altcoin.\n\nSecondly, Ethereum continues to be the biggest layer-one blockchain network by some distance, with its total value locked in accounting for roughly 55% of the entire DeFi sector.\n\nThis percentage doesn’t include Ethereum-based layer-two networks, which would bump its total to around 63%.\n\nOn top of this, Ethereum has also attracted the highest-profile adoption in recent months.\n\nThis includes Visa’s stablecoin trials, as well as PayPal’s Ethereum-based stablecoin, and not to mention Coinbase’s own layer-two network.\n\nGiven such ongoing interest, the Ethereum price is likely to reach $2,000 in the next few weeks.\n\nFrom there, it could end 2023 at around $2,500.\n\nOther Altcoins With Strong Potential\n\n\n\nWhile ETH looks set to continue rising, it isn’t the only high-potential altcoin in the market right now.\n\nA number of presale tokens also look very promising, with some of these likely to witness big rallies when they list on exchanges in the coming weeks.\n\nPerhaps the favorite the rise the most is Bitcoin Minetrix (BTCMTX), a tokenized cloud mining platform that has already raised over $2.7 million in its presale.\n\n#BitcoinMinetrix hits another major milestone! 🌟 Successfully raising more than $2,600,000. pic.twitter.com/hP6PLnjUcI — Bitcoinminetrix (@bitcoinminetrix) October 30, 2023\n\nBitcoin Minetrix has been able to attract plenty of investment already because it offers something unique with the crypto ecosystem.\n\nNamely, its platform will offer users the ability to mine Bitcoin (BTC) by staking its native token, BTCMTX.\n\nUsers who stake BTCMTX receive tokenized mining credits in return, which they can use to purchase cloud-based mining space.\n\nIn turn, this can earn them freshly mined Bitcoin, while staking BTCMTX also earns them new BTCMTX.\n\nAs such, Bitcoin Minetrix could end up being highly profitable for investors, especially if adoption causes BTCMTX to rally.\n\nExploring all the options with #BitcoinMinetrix! ⚒️ A simple path to cloud mining: ✨ Easy of entry for beginners\n\n💵 Cost-effective without hardware expenses\n\n🌆 No worries about space, noise, or heat\n\n🚀 Smooth upgrades#Bitcoin #CryptoMining pic.twitter.com/ZxRDAzqj6m — Bitcoinminetrix (@bitcoinminetrix) October 27, 2023\n\nThe coin will have a max supply of 4 billion BTCMTX, with new buyers able to join the presale by going to the official Bitcoin Minetrix website.\n\n1 BTCMTX currently costs $0.01130, although this will rise to $0.01140 in the just over two days.\n\nIt will also rise to $0.01190 by the time of the sale’s tenth and final stage, while it could jump even higher once trading platforms add it.\n\nVisit Bitcoin Minetrix NowDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3Mvdml0YWxpay1idXRlcmluLWFuYWx5emVzLWV0aGVyZXVtcy1sYXllci0yLXNvbHV0aW9uc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Analyzes Ethereum's Layer 2 Solutions - Blockchain.News - Blockchain.News",
        "content": "On October 31, 2023, Vitalik Buterin discussed Ethereum Layer 2 ecosystem, highlighting trade-offs between Rollups, Validiums, and Disconnected Systems, securing and scalability, pre-confirmations, trustless Ethereum interactions, and potential chain transformation into Validium.\n\nEthereum founder, Vitalik Buterin , delved into the intricacies of Layer 2 (L2) solutions on the Ethereum blockchain in a detailed post dated October 31, 2023. He acknowledged the rapid expansion of the L2 ecosystem, especially the ZK-EVM rollup segment, featuring notable projects such as StarkNet, Arbitrum , Optimism, and Scroll. He lauded the advancements in security, with L2beat mentioned as a good resource for tracking the progress of these projects.\n\nA notable observation by Buterin is the growing heterogeneity within L2 projects. He foresees a continuous trend driven by key factors:\n\n1. Independent Layer 1 (L1) projects seeking closer alignment with Ethereum, albeit cautiously to avoid compromising usability or losing momentum.\n\n2. Centralized projects exploring blockchain for enhanced security.\n\n3. Non-financial applications like games and social media, eyeing decentralization with a balanced approach to security based on the nature and value of activities conducted on-chain.\n\nHe emphasized that while current Ethereum L1 users might tolerate moderate rollup fees, newcomers from the non-blockchain realm are unlikely to accept any fee, especially when transitioning from a no-fee environment.\n\nButerin dissected the trade-offs among Rollups, Validiums, and Disconnected Systems, particularly focusing on the security and scalability aspects. The core question revolves around the assurance level of moving an asset from L1 to L2 and back to L1. He presented a comparative chart to explain the technology properties, security guarantees, and costs associated with each system type.\n\nHe also presented a spectrum of intermediate solutions like a validating bridge and discussed the cost of Ethereum's native data availability versus an application's needs, which would ultimately influence the choice between different L2 solutions.\n\nAn interesting concept introduced is \"pre-confirmations,\" providing a form of partial guarantee by attesting to the order and post-state root of transactions. This could be beneficial for low-value, high-frequency applications, offering a lower-security, low-latency solution within the same ecosystem accommodating high-security, high-latency applications.\n\nButerin highlighted the importance of a system's ability to trustlessly read the Ethereum blockchain, and the security implications it entails. He proposed two solutions: ensuring the top chain reads only finalized blocks of Ethereum or allowing the top chain to revert if Ethereum reverts.\n\nHe further delved into the concept of transforming a separate chain into a Validium through a two-way validating bridge. However, he pointed out that several edge cases, like handling 51% attacks or hard fork upgrades on Ethereum, require a social commitment to address exceptional scenarios.\n\nIn conclusion, Buterin explored two key dimensions of connectedness to Ethereum: the security of withdrawing to Ethereum and the security of reading Ethereum. He acknowledged the value of projects across different regions of this design space, advocating for a potential transition from looser to tighter couplings with Ethereum as technology evolves over time.\n\nImage source: Shutterstock"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vbW9yZS11cHRyZW5kLWZvci1ldGhlcmV1bS1oZXJlcy13aGF0cy1wb3NzaWJsZS_SAU1odHRwczovL2VuZy5hbWJjcnlwdG8uY29tL21vcmUtdXB0cmVuZC1mb3ItZXRoZXJldW0taGVyZXMtd2hhdHMtcG9zc2libGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "More uptrend for Ethereum? Here’s what’s possible… - AMBCrypto English",
        "content": "Ethereum continues to trade close to the $1,800 price range\n\nDifferent metrics have flashed positive and warning signals\n\nTwo common questions associated with Ethereum are whether it will continue its upward trend or when a price correction might occur. Recent reports indicating the behaviour of key metrics may provide insights, potentially revealing the answers within the charts.\n\nRead Ethereum (ETH) Price Prediction 2023-24\n\nEthereum supply on exchanges declines as…\n\nAt the time of this report, Ethereum was trading with a minor loss of less than 1%. Notably, despite this slight dip, it remained above the $1,700-mark, hovering closely to the $1,800 price range. Furthermore, the consistent uptrends in Ethereum’s price have coincided with a decreasing supply of ETH on exchanges.\n\nAs reported by Santiment, the decline in ETH supply on exchanges became apparent around October 23rd. Interestingly, this decrease aligned with the day ETH experienced its most significant surge in the recent bullish trend.\n\nAlso, this drop in supply suggested that investors’ confidence had grown, and they were more inclined to purchase and hold Ethereum. Additionally, a further drop in supply could create scarcity and drive up demand. Right now, the supply of ETH on exchanges stands at approximately 10.7 million ETH.\n\nUSDT market cap growth shows liquidity\n\nAnother positive metric indicating a sustained uptrend is the market capitalization of USDT (Tether) in the Ethereum ecosystem. The chart revealed that the USDT market cap has been expanding alongside the rising price of ETH. This increase in USDT’s market cap signified that more liquidity has been entering the market.\n\nThe continuous influx of liquidity is expected to bolster price growth and maintain the ongoing bullish trend.\n\nEthereum’s social dominance and volume wane\n\nAs Ethereum’s price began its ascent, there was a noticeable correlation with its trading volume, evident in the volume chart. According to Santiment, the chart displayed a remarkable spike, surging to over $19 billion during the period of upward price movement. This surge represented the highest trading volume seen in the last five months.\n\nHowever, in more recent times, the volume trend has revealed a decline. At the time of this report, the trading volume had fallen to approximately $7.4 billion. The drop in volume signified a reduction in momentum and a gradual loss of interest from traders.\n\nFurthermore, Ethereum was seeing a gradual decline in its social dominance, as indicated by the corresponding chart. The data revealed that ETH’s social dominance had dropped to around 7.2% at the time of this report.\n\nThis decline in the social dominance metric is a sign that discussions and conversations surrounding Ethereum are gradually waning. It also implies a diminishing level of interest in the cryptocurrency – A negative signal.\n\nPrice could go either way\n\nThe aforementioned metrics collectively indicate that Ethereum’s ongoing uptrend, or a potential reversal, is contingent on a multitude of factors. Notably, the sentiment and behaviour of traders play a pivotal role. If momentum regains strength, with increased liquidity entering the market and traders persisting in their strategy of buying and holding, a price spike will be likely.\n\n– Is your portfolio green? Check out the Ethereum Profit Calculator\n\nConversely, should the opposite scenario unfold, with reduced momentum and a fall in buying and holding sentiment, a price decline could be on the horizon.\n\nSimply put, Ethereum’s future price movement is closely tied to the actions and sentiments of market participants."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGFpbHljb2luLmNvbS9keWR4LWNoYWluLWdvZXMtbGl2ZS1tb3Zlcy10b2tlbi1hd2F5LWZyb20tZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "dYdX Chain Goes Live, Moves Token Away from Ethereum - DailyCoin",
        "content": "Unveiling of L1 token DYDX, a pivotal step in dYdX Chain’s growth.\n\nEnhanced network security and governance with the new L1 token.\n\nOpportunities for community engagement and revenue generation through staking.\n\nWhile Ethereum provides a reliable platform for thousands of blockchain projects, many eventually move to their native tokens. Most recently, the dYdX Chain has marked a significant milestone by launching a native chain and moving to an L1 token, DYDX.\n\nThe project departed from its previous ERC-20 token framework on Ethereum’s layer two protocol. The project says the migration means better network governance, heightened security, and functionality, and a new revenue distribution model for validators and stakers.\n\ndYdX Chain’s Transition to L1 Token, DYDX\n\nOn Wednesday, October 26, the dYdX Chain mainnet finally went live after the unveiling of its new L1 token. The first block was created by the Genesis Validators, as announced by the Operations subDAO (Ops subDAO). The move is a significant paradigm shift from its previous reliance on an ERC-20 token on Ethereum’s layer two protocol.\n\nThis transition, following a community vote, expands the staking opportunities, which aims to bolster the blockchain. Moreover, the project claims that the shift amplifies the protocol’s governance capabilities and reallocates the protocol’s revenue streams.\n\nThrough this transition, the dYdX Chain says its framework will be more closely with the decentralized ethos of blockchain technology. The L1 token also marks a step towards a self-sustained, community-driven blockchain ecosystem. Importantly, all fees collected by the protocol, which include trading fees denominated in USDC and gas fees for DYDX-denominated transactions or USDC-denominated transactions, are distributed to Validators and Stakers, creating a direct financial benefit for network participants.\n\nWhat Is dYdX?\n\nAt its core, dYdX is a leading decentralized exchange supporting perpetual trading. It operates on smart contracts on the Ethereum blockchain, allowing users to trade without intermediaries.\n\nThe project’s features include perpetual trading on Layer-2 with up to 20x leverage, offering pairs like BTC-USD, ETH-USD, and LINK-USD, among others​2​. This aspect of dYdX demonstrates its commitment to providing advanced financial services in a decentralized manner.\n\nOn the Flipside\n\nEthereum, where dYdX initially operated, is one of the most decentralized networks in the blockchain space.\n\ndYdX Chain might face an uphill battle to prove its chain is more decentralized than Ethereum.\n\nWhy This Matters\n\nThe emergence of dYdX Chain and its L1 Token, dYDx, is a significant stride towards achieving a self-sustainable and community-governed blockchain ecosystem. It showcases the potential for blockchain projects to evolve and adapt to community needs while enhancing network security and governance.\n\nRead more about decentralized exchanges like dYdX:\n\nDecentralized Exchanges: Crypto’s Wild West or Blockchain Essential?\n\n\n\nRead more about Solana’s positive performance:\n\nUnpacking Solana’s 7% Price Jump: What You Need to Know"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JhbmtydXB0LWZ0eC1tb3Zlcy0xNTZtLXdvcnRoLW9mLWFzc2V0cy1pbmNsdWRpbmctZXRoZXJldW0tYW5kLXNvbGFuYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bankrupt FTX moves $156M worth of assets including Ethereum and Solana - CryptoSlate",
        "content": "Blockchain analytics firm Nansen reported that wallets connected to bankrupt FTX have moved up to $156 million worth of digital assets, including Ethereum (ETH) and Solana (SOL), in several transactions over the past week.\n\nUnstakes Solana\n\nIn an Oct. 31 post on X (formerly Twitter), Nansen reported that FTX began unstaking 1.6 mill SOL tokens, worth approximately $57.6 million, on Oct. 30.\n\nWhile the unstaked assets are currently held in the staking wallet, FTX’s fund movement will increase the total SOL transferred to nearly $90 million.\n\nEarlier in the month, FTX liquidators staked approximately $120 million in Solana tokens through Figment, an institutional staking service provider. This move is anticipated to yield up to 7% return in staking rewards and is expected to help the bankrupt firm maximize its assets.\n\n$156M transferred\n\nNansen, while adding FTX’s recently unstaked Solana assets to the stream of transactions from the insolvent company to crypto exchanges like Binance and Coinbase, estimated a movement of approximately $156 million worth of digital assets.\n\nAccording to Nansen’s analysis, the new wave of transactions included 1,100 ETH valued at $2 million, 10.5 million USDC, and 7.6 million Render tokens worth $500,000.\n\nFTX also transferred 833,000 Kyber Network Crystal (KNC) tokens, equivalent to $616,000, and 108 million TRUE tokens worth $420,000. Further assets included 138,000 Band Protocol tokens valued at $221,000, 2.5 million The Graph tokens equivalent to $273,000, 845 Maker tokens valued at $1.17 million, and 9.5 million REN tokens worth $500,000.\n\nAdditionally, there were 695,000 Perpetual Protocol Tokens valued at $423,000, 767,000 Biconomy Tokens worth $182,000, and 23,000 Polygon tokens worth $15,000.\n\nFTX claims value rise\n\nPrices for FTX claims increased following reports of a $2 billion investment by Google in the artificial intelligence startup Anthropic.\n\nIkigai hedge fund manager Travis Kling posited that the investment had driven “FTX bankruptcy pretty close to a full recovery.”\n\nIn an interview with CryptoSlate, Thomas Braziel, an expert on FTX claims at 117 Partners, urged creditors to remain cautious. This was reiterated in a post on X (formerly Twitter), where he highlighted that there was no valuation mentioned in the Google-Anthropic investment, adding that:\n\n“Great to see this news tonight but the bankruptcy still have a big road ahead of it.”\n\nData from Cherokee Acquisition shows that the claim’s value has risen to between 50 and 53 cents on the dollar as of press time."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1sYXllci0yLWNvbnRpbnVlLXRvLWJlLWRpdmVyc2Utdml0YWxpay1idXRlcmlu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Ethereum layer 2s will continue to have diverse approaches to scaling — Vitalik Buterin - Cointelegraph",
        "content": "The Ethereum layer-2 ecosystem is likely to continue evolving with diverse technological approaches, according to co-founder Vitalik Buterin.\n\nThe co-founder of the smart contract blockchain unpacked the current landscape of Ethereum’s scaling ecosystem on his personal blog, with several layer-2 protocols differing in their approaches to bring greater scaling capacity, lower costs and increased security.\n\nAs Buterin highlighted, Ethereum Virtual Machine (EVM) rollups pioneered by Arbitrum, Optimism, Scroll and more recently, Kakarot and Taiko, have drastically improved the respective security of their solutions.\n\nDifferent types of layer 2shttps://t.co/ry4VTtWhJ1 — vitalik.eth (@VitalikButerin) October 31, 2023\n\nMeanwhile, “sidechain projects” like Polygon have also developed their own rollup solutions. Buterin also highlights “almost-EVMs” like zkSync, extensions like Arbitrum Stylus and zero-knowledge proof pioneers Starknet as important players driving scaling technology for the ecosystem:\n\n“One of the inevitable consequences of this is that we are seeing a trend of layer 2 projects becoming more heterogeneous. I expect this trend to continue, for a few key reasons.”\n\nButerin notes that some projects currently existing as independent layer 1s are looking to bring themselves closer to the Ethereum ecosystem and potentially become ecosystem layer 2s.\n\nRelated: Polygon’s ‘holy grail’ Ethereum-scaling zkEVM beta hits mainnet\n\nThis type of transition remains difficult, as an “all at once” approach would cause a decrease in usability given that technology is not at a stage where it can be completely included in rollup technology. Meanwhile, postponing such a transition runs the risk of “sacrificing momentum and being too late to be meaningful.”\n\nButerin also notes that some centralized, non-Ethereum projects want to give users greater security assurances and are looking to blockchain-based solutions. Historically, these types of projects would have looked to “permissioned consortium chains” to achieve this:\n\n“Realistically, they probably only need a “halfway-house” level of decentralization. Additionally, their often very high level of throughput makes them unsuitable even for rollups, at least in the short term.”\n\nLastly, Buterin considers non-financial applications like games and social media platforms that want to be decentralized but do not need high levels of security. Highlighting a social media use case, Buterin notes that different parts of the app would require separate functionality:\n\n“Rare and high-value activity like username registration and account recovery should be done on a rollup, but frequent and low-value activity like posts and votes need less security.“\n\nHe adds that a chain failure leading to a user’s post disappearing would be an “acceptable cost,” while a similar failure leading to the loss of an account would be far more serious.\n\nRelated: Vitalik Buterin voices concerns over DAOs approving ETH staking pool operators\n\nButerin also notes that the costs associated with paying for rollup fees might not be acceptable for non-blockchain users, while previous blockchain users are used to paying far higher prices for on-chain interactions.\n\nAn excerpt from Buterin’s latest blog post on the Ethereum ecosystem titled “Different types of layer 2s.” Source: vitalik.eth.limo\n\nThe Ethereum co-founder then delves into the trade-offs between different rollup solutions and systems that offer varying scaling capabilities to the ecosystem. The “connectedness” to Ethereum hinges on the security of withdrawing to Ethereum from layer 2s and the security of reading data from the Ethereum blockchain.\n\nRelated: Ethereum’s proto-danksharding to make rollups 10x cheaper — Consensys zkEVM Linea head\n\nButerin notes that high security and tight connectedness are important for some applications, while others require something looser in exchange for greater scalability:\n\n“In many cases, starting with something looser today, and moving to a tighter coupling over the next decade as technology improves, may well be optimal.”\n\nEthereum’s next scheduled hard fork is set to introduce EIP-4844, commonly referred to as “proto-dank sharding.” The EIP is expected to drastically increase the amount of data availability of the network. Buterin also notes that improvements in data compression enable greater functionality.\n\nMagazine: Ethereum restaking: Blockchain innovation or dangerous house of cards?"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8venljcnlwdG8uY29tL3ZhbmVjay1wcmVkaWN0cy1zb2xhbmFzLXJpc2UtdG8tMzIxMS1ieS0yMDMwLW91dHNoaW5pbmctZXRoZXJldW1zLXJldHVybnMv0gFjaHR0cHM6Ly96eWNyeXB0by5jb20vdmFuZWNrLXByZWRpY3RzLXNvbGFuYXMtcmlzZS10by0zMjExLWJ5LTIwMzAtb3V0c2hpbmluZy1ldGhlcmV1bXMtcmV0dXJucy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "VanEck Predicts Solana’s Rise To $3,211 By 2030, Outshining Ethereum’s Returns - ZyCrypto",
        "content": "Advertisement\n\nGlobal investment manager VanEck has made a bold prediction about Solana, suggesting that the SOL token may reach a staggering price of $3,211 by 2030, potentially surpassing the returns of the more established Ethereum.\n\nDespite SOL falling steeply following the FTX debacle, Solana, a high-performance blockchain known for its scalability and speed, has been gaining significant attention in the world of cryptocurrency and decentralized applications.\n\nIn their report, VanEck outlined the factors that led to their bullish prediction for SOL in the next decade. They presented a range of scenarios, with the most conservative estimate being $9.81 and the most optimistic projection reaching a remarkable $3,211.28, depicting a 10,000% surge in price.\n\nOne of the most compelling aspects of VanEck’s prediction is their belief that Solana could become the first blockchain to host an application that onboards over 100 million users. As per the firm, this achievement would be a significant milestone in the blockchain industry and a game-changer for SOL’s adoption and value.\n\nNotably, the report assumed that Solana will monetize at only 20% of Ethereum’s take rate, indicating that even a relatively modest market share could result in substantial returns for SOL token holders.\n\nAdvertisement\n\nFurthermore, the firm suggested that Solana might achieve less than half of Ethereum’s market share due to fundamental differences in community philosophy. This perspective highlights that while Ethereum emphasizes decentralization and community governance, Solana has taken a more pragmatic approach to scalability and speed, which could attract a different set of users and developers.\n\nVanEck’s optimistic outlook is based on its vision of a credible path to $8 billion in revenues for SOL token holders by 2030. If this prediction materializes, it would not only be a significant achievement for Solana but also a testament to the growth and potential of the broader blockchain ecosystem.\n\nThe cryptocurrency market has been characterized by its volatility and rapid changes, making long-term predictions a challenging endeavour. However, VanEck has positioned itself to take on the crypto market with safer vehicles.\n\nLast Friday, the New York-based firm submitted a revised application for the highly-anticipated Bitcoin Spot ETF, aligning itself with industry leaders such as BlackRock, Ark Invest, and Fidelity, all eager to capitalize on the promising future of the world’s largest cryptocurrency.\n\nAt press time, SOL was trading at $34.65, marking an impressive 6.8% gain in the last 24 hours, possibly spurred by the recent report. Notably, the cryptocurrency has been the top performer among the top 20 coins in the past week, with a substantial 19% increase, according to CoinMarketCap data."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9kb2dlY29pbi1ldGhlcmV1bS1hbmQtZXZlcmxvZGdlLXBvaXNlZC10by1zdXJnZS1oZXJlcy13aHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Dogecoin, Ethereum, and Everlodge Poised to Surge: Here's Why - CryptoPotato",
        "content": "Dogecoin, Ethereum, and Everlodge are amongst the more interesting altcoins to watch in the ongoing crypto rally.\n\nAlbeit different, all of these projects are attempting to position themselves the best they can for what seems to be a much-anticipated bull market.\n\nSummary:\n\nDogecoin’s price pumps 5.2%.\n\nAli Martinez predicts Ethereum to reach $1,900.\n\nEverlodge’s price has increased from $0.02 to $0.023.\n\nVisit the Everlodge presale and win a luxury holiday to the Maldives\n\nDogecoin (DOGE) Aiming To Surpass the $0.07 Level\n\nDogecoin, the original meme coin has been popular ever since its launch back in 2021. Dogecoin quickly climbed up the ranks after being promoted by top figures like Elon Musk. The meme coin hit an all-time high of $0.7376 in May 2021 before plummeting to the $0.06 level in October 2023.\n\nDespite this significant price drop, Dogecoin still remains a top ten largest crypto ranked by market capitalization. As of the time of this writing, the price of Dogecoin recently jumped by 7.7% to reach $0.069.\n\nAlso, there was an increase in DOGE’s trading volume, highlighting increasing support for the meme coin. As a result, some analysts have predicted that the Dogecoin price could aim for the $0.07 mark and potentially surpass it in the coming days.\n\nEthereum (ETH) To Reach $1,900\n\nOn October 20th, crypto analyst, Ali Martinez, told his Twitter followers that Ethereum is heading for the $1,900 level. According to the analysts, ETH has formed an ascending triangle pattern, which is a bullish formation.\n\nAli said Ethereum is “ready” to bounce off the ascending triangle’s hypotenuse. Moreover, the analyst emphasized that the Ethereum coin must close above the 18-day SMA (around $1,745) to reach $1,900. As of October 30th, the price of Ethereum has increased by 8.1% in the past week to hit $1,818.\n\nEthereum’s price has shown great recovery together with the rest of the crypto market. Meanwhile, the last time Ethereum reached $1,900 was in July 2023.\n\nEverlodge (ELDG) Captures Whale Attention With Unique Features\n\nJust like Dogecoin and Ethereum, investors in the Everlodge presale are sweeping tokens. Everlodge is working on a blockchain real estate marketplace. It will allow more people to invest in vacation homes, hotels, and fancy villas.\n\nWhat makes Everlodge unique over traditional platforms is its NFT fractionalization approach to property co-ownership. It is the first project in the world to combine fractional vacation home ownership with timeshare and NFT technology. Besides, users get extra benefits on the platform.\n\nIn addition, investors can trade their NFTs on Everlodge or other ERC-20 compatible marketplaces. They can also use their property-backed NFTs as collateral to obtain loans. Investors who buy the Everlodge token, ELDG, can stake them to earn passive income every month.\n\nInvestors who hold the ELDG token also get special discounts when they buy properties on the marketplace. The Everlodge project is currently in its sixth presale phase, selling its ELDG tokens for $0.023 each.\n\nFind out more about the Everlodge (ELDG) Presale:\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc3BvdC1ldGhlcmV1bS1ldGYtdG8tZm9sbG93LXNwb3QtYml0Y29pbi1ldGYtc2F5cy1hbmFseXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Spot Ethereum ETF To Follow Spot Bitcoin ETF: Says Analyst - Watcher Guru",
        "content": "The anticipation of a spot Bitcoin (BTC) ETF (Exchange Traded Fund) approval in the U.S. is one of the drivers of the recent crypto market surge. However, analysts expect a spot Ethereum (ETH) ETF to follow closely behind a spot Bitcoin (BTC) ETF.\n\nAccording to Raoul Pal, the spot Bitcoin and Ethereum ETFs are some of the most significant developments in the industry. The macro economy expert anticipates the spot BTC and ETH ETF to behave like a halving event. The expert does not expect a price surge instantly but in a gradual manner.\n\nAlso Read: Over $4.5B Worth of Bitcoin and Ethereum Options Set to Expire\n\nAccording to Pal, “The ETH spot ETF will happen as well; of course, it’ll be later; as soon as the Bitcoin one is done, they’ll front run it by going to the ETH one because they know that’s the next one.”\n\nPal further added, “The Bitcoin ETF, I don’t think of the as a one-off event. People think of it as this liquidity injection into the crypto economy, and I’m saying it’s a trade agreement.”\n\nWhy will a spot Bitcoin and Ethereum ETF boost the crypto market?\n\nSource: Bitcoinist\n\nAccording to Pal, one of the biggest hurdles for institutions entering the crypto industry is the lack of proper regulations. However, the introduction of a spot ETF may bring in more protection for institutions. Moreover, a spot Bitcoin (BTC) and Ethereum (ETH) ETF will bring significant institutional money into the sector. The inflow of institutional funds will most likely lead to a surge in the price of both assets.\n\nAlso Read: $15 Trillion Could Enter the Markets for Bitcoin Upon Spot-Based ETF\n\nMoreover, Pal anticipates other institutions, such as pension funds and asset managers, to step into the crypto space over time. The new players will further boost the market’s liquidity and growth."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0tZGVmaS1hY3Rpdml0aWVzLW9uLWEtcm9sbC13aWxsLWl0LWRyaXZlLWEtYnVsbGlzaC1wcmljZS1zdXJnZS_SAWhodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtLWRlZmktYWN0aXZpdGllcy1vbi1hLXJvbGwtd2lsbC1pdC1kcml2ZS1hLWJ1bGxpc2gtcHJpY2Utc3VyZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Ethereum DeFi Activities On A Roll: Will It Drive A Bullish Price Surge? - NewsBTC",
        "content": "Ethereum, often hailed as the pioneer of smart contracts, has cemented its position as the frontrunner in the world of decentralized finance (DeFi) and blockchain technology.\n\nRecent data reveals that Ethereum was the primary catalyst behind the surge in crypto Total Value Locked (TVL), amassing an impressive 75% of all deposited funds during the past week.\n\nEthereum’s journey began with the groundbreaking innovation of smart contracts. It was the first protocol to introduce this game-changing technology, enabling the creation of self-executing contracts with predefined rules and conditions.\n\nThis innovation laid the foundation for the entire DeFi ecosystem, as it provided the framework for decentralized applications and automated transactions.\n\nOne of the most compelling indicators of Ethereum’s continued dominance is the recent surge in decentralized exchange (DEX) volumes.\n\nIn the past week, Ethereum recorded a historic milestone, with over $9 billion in transactions settled on its network. This marks the highest weekly volume since mid-June and underscores the platform’s pivotal role in facilitating peer-to-peer trading and liquidity provision.\n\n.@ethereum dominated this week’s TVL growth rankings, accounting for $6.68B of the total $8.76B TVL growth across crypto last week. pic.twitter.com/45rqb3Seml — 0xScope (🪬 . 🪬) (@ScopeProtocol) October 30, 2023\n\nETH Price Dynamics And The BlackRock Factor\n\nAs Ethereum continues to take center stage in the crypto landscape, the question on many investors’ minds is how this data will impact the price of ETH. Currently, according to CoinGecko, Ethereum is trading at $1,798, showing a modest 0.6% increase in the last 24 hours, with a minor 0.9% decrease over the past seven days.\n\nVenture capitalist Arthur Cheong has provided intriguing insights into the potential price trajectory of Ethereum. Cheong, the founder of DeFiance Capital, suggests that ETH could experience a significant rally if a specific scenario unfolds.\n\nHe points to BlackRock, a financial giant, and its application for a spot Bitcoin (BTC) exchange-traded fund (ETF). If BlackRock’s BTC ETF application is successful, it could pave the way for a similar Ethereum ETF application in the future.\n\n“ETH is probably the best six to 12 month long among large-cap assets now when BlackRock applies for a spot ETH ETF six to 12 months down the road,” Cheong wrote on the social media platform X.\n\nETH is probably the best 6 to 12m long among large cap assets now when BlackRock applies for spot ETH ETF 6 to 12m down the road. Ethereum’s ESG friendliness and native staking yield will be appealing to institutional investors should BTC spot ETF turn out to be a success. — Arthur (@Arthur_0x) October 24, 2023\n\nETHUSD currently trading at $1798.3 on the daily chart: TradingView.com\n\nImplications And Future Prospects\n\nThe significance of Ethereum’s role in DeFi and blockchain technology cannot be overstated. Its smart contract functionality revolutionized the crypto space and enabled the birth of countless decentralized applications and platforms. The recent surge in DEX volumes underscores its pivotal role in facilitating crypto trading.\n\nAs the crypto world closely watches developments surrounding BlackRock’s potential ETFs, Ethereum’s future appears promising. Should a BTC spot ETF materialize and pave the way for an Ethereum ETF, institutional investors may flock to Ethereum for its ESG attributes and staking yield opportunities.\n\n(This site’s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk).\n\nFeatured image from iStock\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzMwL3Rva2VuaXplZC11cy10cmVhc3VyeS1tYXJrZXQtZ3Jvd3MtbmVhcmx5LTYwMC10by02OThtLWFzLWNyeXB0b3MtcndhLXJhY2UtaW50ZW5zaWZpZXMv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMzAvdG9rZW5pemVkLXVzLXRyZWFzdXJ5LW1hcmtldC1ncm93cy1uZWFybHktNjAwLXRvLTY5OG0tYXMtY3J5cHRvcy1yd2EtcmFjZS1pbnRlbnNpZmllcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Tokenized U.S. Treasury Market Grows Nearly 600% to $698M as Crypto's RWA Race Intensifies - CoinDesk",
        "content": "According to real-world asset (RWA) monitoring platform RWA.xyz, the tokenized Treasury market surged to $698 million as of Monday from around $100 million at the start of the year. The expansion was spurred by new entrants into the space as well as from existing platform growth, Charlie You, co-founder of RWA.xyz, noted in the Our Network newsletter."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYmVhcmlzaC1tdnJ2LWVudGVyZWQtZGFuZ2VyLXpvbmUv0gFUaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1iZWFyaXNoLW12cnYtZW50ZXJlZC1kYW5nZXItem9uZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Bearish Signal: MVRV Has Entered The “Danger” Zone - NewsBTC",
        "content": "On-chain data shows the Ethereum Market Value to Realized Value (MVRV) ratio has entered inside a danger zone that has historically led to tops.\n\nEthereum MVRV Ratio Has Surged Into The Danger Zone Recently\n\nIn its latest insight post, the on-chain analytics firm Santiment has talked about some underlying metrics related to ETH. First, the firm has pointed out how the trading volume of the cryptocurrency has gone down since Ethereum’s surge from a few days back.\n\nThe value of the metric has been sharply going down recently | Source: Santiment\n\nThe trading volume observing a significant decline while the price is trying to continue its rally could indicate that momentum is weakening for the cryptocurrency.\n\nOne positive for the asset, though, could be the fact that the supply on exchanges has gone down since the rally started, implying that the investors have made net withdrawals.\n\nLooks like the metric has plunged | Source: Santiment\n\nGenerally, investors transfer their Ethereum out of these central entities to hold onto it in self-custodial wallets for extended periods, so this decline in the supply on exchanges could be a sign of fresh accumulation.\n\nFollowing the latest rise in the asset, its social dominance has also seen a jump. The “social dominance” here refers to the mindshare that Ethereum occupies on social media platforms among the top 100 cryptocurrencies by market cap.\n\nInterest around ETH has grown in the last few days | Source: Santiment\n\nIt would appear that more eyes have been turning at Ethereum recently, which can be a sign that hype is building up among the traders. Historically, too much hype has been negative for the asset, as it has often led to top formations.\n\nSo far, though, the social dominance is still notably below the levels it was at when ETH hit its local top at the start of this month, as is apparent in the above chart. According to Santiment, this “may suggest there can be some room for it to go before things cool down.”\n\nA signal that is more concretely bearish for Ethereum, however, is the 30-day MVRV ratio. In simple terms, what this ratio tells us is how the value that investors are holding (the market cap) compares against the capital that they invested into the asset (the realized cap).\n\nThe indicator appears to have entered the danger zone | Source: Santiment\n\nHere, Santiment has used the 30-day MVRV ratio, which means this indicator only keeps track of the investors/addresses who bought their coins within the last 30 days.\n\nAs shown in the chart, this Ethereum indicator has recently risen into a territory that the analytics firm labels as a “danger zone.” Historically, the price has seen a correction not too long after the metric has reached this zone so another local top may be due for Ethereum right now.\n\nETH Price\n\nAt the time of writing, Ethereum is trading at around $1,800, up 1% in the past week.\n\nETH has been stuck in consolidation recently | Source: ETHUSD on TradingView\n\nFeatured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8zMS9jcnlwdG8tYW5hbHlzdC1zYXlzLWRvb3JzLWFyZS1vcGVuLWZvci1ldGhlcmV1bS1yYWxseS11cGRhdGVzLW91dGxvb2stb24tYml0Y29pbi1hbmQtb25lLWFpLWZvY3VzZWQtYWx0Y29pbi_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTAvMzEvY3J5cHRvLWFuYWx5c3Qtc2F5cy1kb29ycy1hcmUtb3Blbi1mb3ItZXRoZXJldW0tcmFsbHktdXBkYXRlcy1vdXRsb29rLW9uLWJpdGNvaW4tYW5kLW9uZS1haS1mb2N1c2VkLWFsdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Crypto Analyst Says Doors Are Open for Ethereum Rally, Updates Outlook on Bitcoin and One AI-Focused Altcoin - The Daily Hodl",
        "content": "A crypto analyst who nailed the top of Bitcoin’s (BTC) 2021 bull market says that Ethereum (ETH) is well-positioned to move another leg up after suddenly entering a new trading range.\n\nPseudonymous analyst Pentoshi tells his 706,400 followers on the social media platform X that Ethereum could soar more than 21% from its current value.\n\n“ETH: closing this weekly back inside the range opens up the doors to $2,200.”\n\nLooking at his chart, the analyst believes that ETH convincingly crossed the lower bound of a new trading range between $1,796 and $2,200.\n\nThe analyst also says that Ethereum against Bitcoin (ETH/BTC) corrected to a key psychological level, indicating a bounce is likely.\n\n“Despite it severely underperforming BTC, it’s now beginning to enter the demand zone on the ETH/BTC ratio.”\n\nETH/BTC is trading for 0.0524 BTC ($1,810) at time of writing.\n\nThe analyst also weighs in on Bitcoin, and he predicts that the top digital asset will remain in an uptrend as long as a key price range holds as support.\n\n“BTC is bullish as long as [it remains] above the $31,500-$32,500 area. Thus, I’ll continue to have bullish bias unless a deviation occurs as an invalidation.”\n\nThe analyst also believes Bitcoin could continue to rally across the $40,000 level in the coming weeks.\n\n“The most important levels to play [are] marked. Closing below purple equals likely deviation and invalidation. $40,000-$42,000 on the table in the weeks ahead.”\n\nBitcoin is trading for $34,511 at time of writing.\n\nLastly, the analyst updates his outlook on artificial intelligence (AI) altcoin Fetch.AI (FET). He predicts a period of consolidation before a move toward the $0.496 range high.\n\n“Update: likely going to get a little consolidation around this area which is the mid-range of the larger resistance and support mapped out, especially after such a strong move. So [I’m] expecting a small pullback and some sideways over the next few days before any attempts to go to the top of that previous range on FET.”\n\nFET is worth $0.36 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcHJpY2UtdGVldGVyaW5nLWFuYWx5c3QtZm9yZWNhc3RzLXN1cmdlLXBhc3QtMjAwMC1vbi1vbmUtY29uZGl0aW9uL9IBdmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcHJpY2UtdGVldGVyaW5nLWFuYWx5c3QtZm9yZWNhc3RzLXN1cmdlLXBhc3QtMjAwMC1vbi1vbmUtY29uZGl0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Ethereum’s Price Teetering: Analyst Forecasts Surge Past $2,000 On One Condition - NewsBTC",
        "content": "Ethereum (ETH), the second-largest crypto by market capitalization, has been in the spotlight due to its price action. A notable crypto analyst, Pentoshi, shed light on the asset’s price trajectory, suggesting a possible uptick in value if current conditions prevail.\n\nIt is worth noting that this analyst’s predictions come at a time when Ethereum trails behind Bitcoin’s recent price rally. Notably, while Bitcoin has recorded a 12.5% increase over the past week, Ethereum’s gains are modest, rising by 8.4% during the same timeframe.\n\nEthereum Price Bracket Significance\n\nAccording to the analyst’s post, Ethereum’s immediate future could see an upward trend if it manages to close the week within a specific price range. The suggested target zone, between $1,796 and $2,148, is critical, as highlighted by Pentoshi.\n\nShould ETH’s closing price fall within this bracket, the analyst posits a potential path cleared for Ethereum to reach or even surpass the $2,200 mark. While Ethereum lags Bitcoin’s recent performance, the analyst remains optimistic about its prospects.\n\nPentoshi indicates that Ethereum is approaching a “demand zone,” on the BTC/ETH ratio. Notably, this could stimulate buying activity and influence its price positively.\n\n$ETH\n\nClosing this weekly back inside the range opens up the doors to $2,200 Despite it severely underperforming BTC it’s now beginning to enter the demand zone on the btc /eth ratio BTC is bullish as long as above the 31.5-32.5k area thus I’ll continue to have bullish bias… pic.twitter.com/Hwoi8jwr2O — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) October 29, 2023\n\nBitcoin’s Bullish Standpoint Maintained\n\nPentoshi is bullish on Bitcoin, the pioneer cryptocurrency, provided it remains above a particular threshold. The $31,500 and $32,500 area is highlighted as Bitcoin’s support zone. The analyst maintains that staying above this range could sustain the positive outlook on Bitcoin.\n\nHowever, a dip below these levels would suggest re-evaluating this bullish analysis. Regardless, Bitcoin does not currently appear to be moving towards any support but instead seems to be pushing above any resistance.\n\nIn just four days, the asset has climbed from a trading price of $34,000 last Thursday to a present trading value of $34,760 at the time of writing. It’s worth noting that BTC has embarked on a significant uptrend, ascending more than 20% in the last two weeks.\n\nEthereum has also experienced a rally but hasn’t matched Bitcoin’s momentum. Over the past 14 days, ETH has seen a 14.8% increase and is currently trading at $1,820, marking a 1.4% rise in the last 24 hours alone.\n\nFeatured image from Unsplash, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0tcmVzaWxpZW50LWFib3ZlLTE4MDAtcHJlLWZvbWMtbWVldGluZy12aXRhbC1sZXZlbHMtdG8td2F0Y2gv0gFmaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS1yZXNpbGllbnQtYWJvdmUtMTgwMC1wcmUtZm9tYy1tZWV0aW5nLXZpdGFsLWxldmVscy10by13YXRjaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Resilient Above $1,800 Pre-FOMC Meeting – Details - NewsBTC",
        "content": "Ethereum (ETH), one of the leading cryptocurrencies, is displaying remarkable resilience in the face of recent market fluctuations. Despite experiencing relatively modest gains compared to Bitcoin (BTC) and other major altcoins, ETH has managed to consolidate its position above the $1800 mark.\n\nThe big question on everyone’s mind is whether Ethereum can sustain this level or if it will succumb to the prevailing market sentiment.\n\nIn the world of cryptocurrencies, prices are highly susceptible to market sentiment. Cryptocurrencies often exhibit dramatic price swings based on the emotions and perceptions of investors and traders. Positive sentiment tends to drive prices up, while negative sentiment can lead to sharp declines. In this particular instance, the catalyst for market sentiment is the upcoming US Federal Open Market Committee (FOMC).\n\nThe Role Of FOMC In Influencing ETH And The Crypto Market\n\nThe FOMC is a key division of the US Federal Reserve responsible for setting monetary policy in the United States. One of the primary tools at its disposal is the adjustment of interest rates. When the FOMC meetings take place, the decisions made regarding interest rates can have a significant impact on various financial markets, including cryptocurrencies.\n\nIf the FOMC decision leans towards a hawkish stance, implying an increase in interest rates, it could result in a surge of bearish sentiment across the cryptocurrency market. In such a scenario, Ethereum sellers might exert pressure, potentially pushing the altcoin below the $1700 mark.\n\nConversely, a dovish or unchanged policy stance could lead to a more positive sentiment, allowing ETH to maintain its current position and even experience upward momentum.\n\nSource: Coingecko\n\nAs of the latest data available on CoinGecko, Ethereum is trading at $1,816, showcasing a 1.8% gain over the last 24 hours and a notable 8.8% increase over the past seven days. While these gains may appear modest when compared to the cryptocurrency market’s usual volatility, they reflect Ethereum’s capacity to maintain a steady footing in turbulent times.\n\nEthereum currently trading at $1,826.1 on the daily chart: TradingView.com\n\nEthereum Layer 2 Solutions Break Records\n\nA noteworthy development in the Ethereum ecosystem is the remarkable performance of Layer 2 (L2) solutions. These scaling solutions are designed to alleviate Ethereum’s network congestion and high gas fees.\n\nRecently, L2 solutions set a new all-time high in Total Value Locked (TVL), briefly touching $12 billion before stabilizing around $11.89 billion. This achievement surpasses the previous historic high registered back in April at $11.85 billion, signifying the increasing adoption of Ethereum’s Layer 2 solutions.\n\nWith the $1,800 threshold serving as a crucial psychological barrier, the ultimate direction of Ethereum’s price movement hinges on the delicate balance between market sentiment and the decisions of key financial institutions.\n\n(This site’s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk).\n\nFeatured image from Shutterstock\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvcy9zbWFydC1jb250cmFjdHMuYXNw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "What Are Smart Contracts on the Blockchain and How They Work - Investopedia",
        "content": "What Is a Smart Contract?\n\nA smart contract is a self-executing program that automates the actions required in an agreement or contract. Once completed, the transactions are trackable and irreversible.\n\nSmart contracts permit trusted transactions and agreements to be carried out among disparate, anonymous parties without the need for a central authority, legal system, or external enforcement mechanism.\n\nWhile blockchain technology has come to be thought of primarily as the foundation for Bitcoin​, it has evolved far beyond underpinning a virtual currency.\n\nWhat You Need to Know Smart contracts are scripts that automate the actions specific to a contract between two parties.\n\nSmart contracts do not contain legal language, terms, or agreements—only code that executes actions when specified conditions are met.\n\nNick Szabo, an American computer scientist who invented a virtual currency called \"Bit Gold\" in 1998, defined smart contracts as computerized transaction protocols that execute the terms of a contract.\n\nInvestopedia / Laura Porter\n\nHistory of Smart Contracts\n\nSmart contracts were first proposed in 1994 by Nick Szabo, an American computer scientist who invented a virtual currency called \"Bit Gold\" in 1998, 10 years before Bitcoin was introduced. In fact, Szabo is often rumored to be the real Satoshi Nakamoto, the anonymous Bitcoin inventor, which he has denied.\n\nSzabo defined smart contracts as computerized transaction protocols that execute the terms of a contract. He wanted to extend the functionality of electronic transaction methods, such as POS (point of sale), to the digital realm.\n\nIn his paper, Szabo also proposed the execution of a contract for synthetic assets, such as derivatives and bonds. Szabo wrote, \"These new securities are formed by combining securities (such as bonds) and derivatives (options and futures) in a wide variety of ways. Very complex term structures for payments...can now be built into standardized contracts and traded with low transaction costs, due to computerized analysis of these complex term structures.\"\n\nSmart contracts do not contain the legal language or terms of a contract between two parties. They are scripts that contain if/then statements, functions, module imports, and other programming that automate the actions specified in a contract.\n\nMany of Szabo's predictions in the paper came true in ways preceding blockchain technology. For example, derivatives trading is now mostly conducted through computer networks using complex term structures.\n\nSmart Contract Uses\n\nBecause smart contracts execute agreements, they can be used for many different purposes. One of the simplest uses is ensuring transactions between two parties occur, such as the purchase and delivery of goods. For example, a manufacturer needing raw materials can set up payments using smart contracts, and the supplier can set up shipments. Then, depending on the agreement between the two businesses, the funds could be transferred automatically to the supplier upon shipment or delivery.\n\nReal estate transactions, stock and commodity trading, lending, corporate governance, supply chain, dispute resolution, and healthcare are only a few examples where smart contracts can be used.\n\nSmart Contract Pros and Cons\n\nThe primary benefit of smart contracts is similar to the benefit of blockchain technology—they remove the need for third parties. Other benefits of this technology are:\n\nEfficiency : They speed up contract execution\n\n: They speed up contract execution Accuracy : There can be no human error introduced\n\n: There can be no human error introduced Immutability: The programming cannot be altered\n\nSome of the downfalls of smart contracts are:\n\nPermanent : They cannot be changed if there are mistakes\n\n: They cannot be changed if there are mistakes Human factor : They rely on the programmer to ensure the code addresses the terms of the contract\n\n: They rely on the programmer to ensure the code addresses the terms of the contract Loopholes: There may be loopholes in the coding, allowing for contracts to be executed in bad faith\n\nWhat Is an Example of a Smart Contract? The simplest example of a smart contract is a transaction between a consumer and a business, where a sale is made. The smart contract executes the customer's payment and the business's shipment or transfer of ownership.\n\nWhat Blockchain Has Smart Contracts? Ethereum has smart contract capabilities inherent to its blockchain. The Bitcoin blockchain received smart contract abilities after its Taproot upgrade, which allowed it to communicate to layers that have smart contracts enabled on their blockchains.\n\nWhat Are Smart Contracts in Simple Terms? Smart contracts are apps on a blockchain that make each side of a transaction complete its part. For example, a smart contract could initiate a fund transfer with a third party to verify that the transfer took place.\n\nThe Bottom Line\n\nSmart contracts are code written into a blockchain that executes the terms of an agreement or contract from outside the chain. It automates the actions that would otherwise be completed by the parties in the agreement, which removes the need for both parties to trust each other.\n\nInvesting in cryptocurrencies and other Initial Coin Offerings (“ICOs”) is highly risky and speculative, and this article is not a recommendation by Investopedia or the writer to invest in cryptocurrencies or other ICOs. Since each individual's situation is unique, a qualified professional should always be consulted before making any financial decisions. Investopedia makes no representations or warranties as to the accuracy or timeliness of the information contained herein. As of the date this article was written, the author does not own cryptocurrency.\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2Z0eC9mdHgtdHJhbnNmZXJzLTE1MG0taW4tYXNzZXRzLWluY2x1ZGluZy1ldGhlcmV1bS1hbmQtc29sYW5hLWFtaWQtYmFua3J1cHRjeS_SAWtodHRwczovL3d3dy5uZXdzYnRjLmNvbS9mdHgvZnR4LXRyYW5zZmVycy0xNTBtLWluLWFzc2V0cy1pbmNsdWRpbmctZXRoZXJldW0tYW5kLXNvbGFuYS1hbWlkLWJhbmtydXB0Y3kvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "FTX Transfers $150M In Assets, Including Ethereum And Solana, Amid Bankruptcy - NewsBTC",
        "content": "Blockchain analytics firm Nansen has recently revealed that wallets associated with bankrupt crypto exchange FTX have transferred approximately $156 million worth of digital assets, including Ethereum (ETH) and Solana (SOL), in a series of transactions over the past week.\n\nThe movement of these funds has raised concerns and attracted the attention of industry experts and investors. Nansen’s report sheds light on the ongoing transfers and provides valuable insights into the extent of FTX’s asset movements.\n\nBankrupt FTX Wallets Unstake $57 Million Worth Of SOL Tokens\n\nAccording to the Nansen report, funds from FTX wallets have continued to migrate to various exchanges since the previous update. The report specifies the following notable transactions:\n\n695,000 Perpetual Protocol (PERP) tokens worth $423,000\n\n767,000 Biconomy (BICO) tokens worth $182,000\n\n833,000 Kyber Network (KNC) tokens worth $616,000\n\n108 million TrueFI (TRU) tokens worth $420,000\n\n138,000 Band (BAND) tokens worth $221,000\n\n2.5 million Graph (GRT) tokens worth $273,000\n\n845 Maker (MKR) tokens worth $1.17 million\n\n7.16 million Render (RNDR) tokens worth $17.8 million\n\n10.5 million USD Coin (USDC)\n\n23,000 Polygon (MATIC) tokens worth $15,000\n\n9.5 million Ren (REN) tokens worth $500,000\n\n1.1 million ETH tokens worth $2 million\n\nAdditionally, the report highlights that an additional 1.6 million SOL tokens worth $57.6 million have initiated the unstaking process. While these funds have not yet left the associated wallet, their potential movement would bring the total SOL tokens moved by FTX to just under $90 million.\n\nMoreover, considering the unstaking of SOL and the new assets transferred by FTX to Coinbase and Binance, the total value of funds moved by FTX now stands at $156 million.\n\nMajor Transfers Of LINK, AAVE, And MKR Unveiled\n\nNansen’s previous investigation revealed significant transfers from wallets linked to FTX and Alameda Research, FTX’s trading arm.\n\nThese funds were initially withdrawn from FTX and Alameda wallets before being sent to intermediary wallets and eventually deposited into Binance and Coinbase. The report discloses the following noteworthy movements:\n\n2.2 million USD worth of Chainlink (LINK) tokens\n\n1 million USD worth of Aave (AAVE) tokens\n\n2 million USD worth of MKR tokens\n\n3.4 million USD worth of ETH tokens\n\nIn addition to these transfers, Nansen discovered that 943,000 SOL tokens, equivalent to approximately $32 million, were moved from the FTX Cold Storage wallet.\n\nOverall, the recent findings by Nansen regarding the movement of funds from wallets associated with the bankrupt crypto exchange FTX have sparked concerns within the cryptocurrency community.\n\nThe report highlights substantial transfers of various digital assets, including ETH and SOL, and provides insight into the scale of FTX’s asset movements.\n\nAs of the current market conditions, FTX’s native token, FTT, is trading at $1.23. Despite a false breakout on October 23, where the token briefly surpassed $1,360, it has since declined consistently.\n\nHowever, over the past 30 days, FTT has maintained a profit margin of 3.7%, signifying relative stability within this time frame.\n\nFeatured image from Shutterstock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9zb2xhbmEtcHVtcC12YW5lY2stYnVsbGlzaC1mb3JlY2FzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Can SOL Really Pump 10000% by 2030? Bullish VanEck Forecast Points to “Ethereum Killer” Resurgence - CCN.com",
        "content": "Key Takeaways\n\nVanEck’s latest model predicts that the price of SOL could rise to over $3,000 by 2030.\n\nTo get there, Solana needs to launch an application with 100,000 users or more.\n\nBut is the platform more likely to launch a “killer app” before Ethereum?\n\nWhen Solana launched in 2020, its proponents heralded the new blockchain as an “Ethereum killer” that could dethrone its more established rival as the preferred infrastructure for building decentralized apps (dApps). But after a strong first year, a string of setbacks fell upon the project, hitting its developer community and suppressing the price of SOL.\n\nNow, however, the latest crypto market rally has rekindled interest in Solana. Exemplifying the trend, VanEck recently modeled a 6-year forecast in which SOL could pump to over $3,000. But the fund manager’s prediction comes with one crucial catch.\n\nVanEck Predicts 10,000% Solana Price Hike\n\nWith the price of SOL currently up over 66% in the last 30 days, VanEck’s latest report signals a resurgence of the Ethereum killer narrative.\n\nNoting that blockchain technology has yet to deliver a “killer app” that propels it into the everyday lives of global consumers, VanEck’s model is built on the assumption that Solana, and not Ethereum, will host the world’s first 100M user dApp.\n\nAs a base estimate for the valuation of Solana’s native token SOL, the report forecasts a price of $335 by 2030. In the most bullish scenario, it anticipates the token rising to $3,211 per token. However, for that to happen, VanEck notes that Solana must achieve “Ethereum-like dominance” in the market for on-chain transactions.\n\nSolana 2030 price predictions\n\nUltimately, however, the image of the Ethereum killer was never about SOL supplanting ETH as the world’s second-most valuable cryptocurrency. As the report acknowledges, partly because of its lower transaction fees, Solana’s “take rate,” i.e. how much value the network extracts from end-market applications, is roughly ⅕ of Ethereum’s.\n\nBut while economic metrics like market capitalization and total value locked are often used to rank blockchain projects, if Solana is to launch a 100,000-user app, developer activity is a crucial measure of success.\n\nActive Developer Count: Crucial Metric for Smart Contract Platforms\n\nAccording to Artemis , the current Ethereum developer community is significantly more active than Solana’s. During the past three months, there were 1748 active weekly Ethereum developers. In contrast, there were just 337 active Solana developers in the same period.\n\nFacing such a major disadvantage, Solana “needs to increase its total developer count as well as its market share of developers to increase the probability of hosting tomorrow’s blockbuster application,” VanEck observed.\n\nWeekly active blockchain developers\n\nOne of the factors that has traditionally inhibited the growth of Solana’s developer community is the need for proficiency in the Rust programming language.\n\nHowever, the pool of Rust developers equipped to build dApps on Solana is growing.\n\nResearch by Developer Nation found that in 2023, Rust emerged as the 11th most popular programming language among developers, having climbed from 14th place in 2021. Stack Overflow’s annual developer survey has deemed Rust the most admired programming language for 7 years in a row. Of those surveyed, more than 80% of developers who used Rust in 2023 want to use it again next year.\n\nIn the end, Solana may never topple Ethereum. But in the coming years, Rust’s rising popularity and the availability of tools that make Solana development more accessible could give the platform an edge over its peers."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhzLWJpZ2dlc3QtY2hhbGxlbmdlLWJlZm9yZS0yay1ldGhlcmV1bS1wcmljZS1hbmFseXNpcy_SAVZodHRwczovL2NyeXB0b3BvdGF0by5jb20vZXRocy1iaWdnZXN0LWNoYWxsZW5nZS1iZWZvcmUtMmstZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "ETH’s Biggest Challenge Before $2K: Ethereum Price Analysis - CryptoPotato",
        "content": "Technical Analysis\n\nBy Shayan\n\nLast week, Ethereum displayed an interesting sign by surpassing the 100-day moving average, indicating the growing interest.\n\nHowever, a significant hurdle lies ahead, represented by the 200-day moving average. A breakthrough at this level could reignite substantial demand in the market.\n\nThe Daily Chart\n\nUpon inspecting the daily chart, a robust uptrend emerged from the crucial $1.5K support region, with buyers impulsively driving the price above the 100-day moving average at $1,7K. This surge revived hope and demand, evident in Ethereum’s price action over the past weeks, as it convincingly breached the 100-day MA with a notably large bullish candlestick.\n\nPresently, ETH faces a pivotal obstacle at $1.8K, restricted by the 200-day moving average. A successful breakout above this level could result in a strong uptrend, targeting the solid resistance at $2K. However, given the substantial recent surge, the market might undergo a temporary correction before initiating another significant move.\n\n\n\nThe 4-Hour Chart\n\nThe 4-hour chart highlights intensified bullish momentum and a steadily rising demand, clearly visible in Ethereum’s recent price action. The past weeks have witnessed a compelling uptrend for Ethereum, characterized by significant bullish candles that surpassed key resistance levels.\n\nAdditionally, Ethereum exhibited a promising sign by breaching a significant resistance zone, encapsulated by the upper boundary of the descending wedge and the static resistance level of $ 1.7K, confirming the wedge’s reversal signal.\n\nHowever, the price currently contends with a crucial resistance zone around $1,850, leading to a sideways consolidation phase. This period allows the market to regain demand and attempt to breach the resistance region.\n\nConsequently, there is a high probability of a continued consolidation correction stage before the market definitively determines its next direction.\n\n\n\nOn-chain Analysis\n\nBy Shayan\n\nThe fund market premium metric plays a crucial role as it signifies the excess of the market price over the Net Asset Value (NAV) of the funds, reflecting the underlying assets they hold. Elevated readings indicate robust buying pressure within a specific country.\n\nUpon analyzing the chart, it becomes evident that this metric had declined since Ethereum achieved its all-time high in mid-November 2021, indicating waning interest in Ethereum funds. However, a noteworthy shift occurred following Ethereum’s lowest point during the bear market. At that juncture, the metric began a modest uptick.\n\nBetween January 2023 and the present date, there has been consistent growth in the premium for Ethereum funds, indicating a surge in investor enthusiasm for these assets. This trend points toward a growing demand for Ethereum within the market.\n\nShould the premium for Ethereum funds persist in its upward trajectory, it signifies a reduction in the gap between the market price and the actual market value of Ethereum contracts. This convergence strongly suggests that investors are increasingly optimistic about ETH’s potential."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY3J5cHRvLm5ld3MvcG9seWdvbi0yLTAtdG9rZW4tdXBncmFkZS1nb2VzLWxpdmUtb24tZXRoZXJldW0tbmV0d29yay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Polygon 2.0 token upgrade goes live on Ethereum network - crypto.news",
        "content": "Polygon has revealed that holders of its MATIC token can now transition their assets to the newly launched POL token.\n\nOn Oct. 26, Polygon, a prominent layer-2 scaling solution for Ethereum (ETH), announced the initiation of its POL token upgrade.\n\nThe latest development via an X thread revealed that several leading defi platforms, such as CoWSwap, ParaSwap, and Kyber Network, have already integrated Polygon’s migrator contract into their systems.\n\nThe POL Upgrade was initiated today on Ethereum:\n\nYou can find the POL contract at pol-token.eth.\n\n\n\nThe migrator contract is also live on Ethereum at migrator.pol-token.eth.\n\n\n\nCertain developers have integrated the official migrator contract into their dApps: — Polygon Devs (@0xPolygonDevs) October 26, 2023\n\nThe move marks a significant step in Polygon’s ongoing “Polygon 2.0” revamp, which aims to introduce a new staking layer and other advanced features.\n\nYou might also like: Lido community member suggests sunsetting Polygon staking\n\nDespite the buzz around the new POL token, Polygon’s native MATIC token experienced a 4% drop within 24 hours. However, it’s worth noting that the token had gained over 14% over the past week, according to data from CoinMarketCap.\n\nMATIC 24-hr price chart | Source: CoinMarketCap\n\nThe POL token is designed to support Polygon’s upcoming staking layer. Validators will have the option to re-stake their POL tokens to secure multiple Polygon chains simultaneously. Additionally, they can offer various validation services, including transaction sequencing and proof generation.\n\nPolygon’s ecosystem is diverse, featuring ZkEVM, a layer-2 rollup, PoS Chain, its established Ethereum sidechain, and Supernets, a layer-3 architecture. The project is also in the process of developing Miden, a ZK-STARK-based layer-2 solution.\n\nPOL token not tied to MATIC regulation\n\nAs reported by crypto.news earlier, recent regulatory events do not influence the transition from MATIC to POL. According to Polygon Labs, the U.S. Securities and Exchange Commission’s classification of MATIC and other tokens as securities in its lawsuits against Binance and Coinbase has no bearing on this upgrade.\n\nPolygon Labs had initially introduced these changes in June 2023 as part of their Polygon 2.0 roadmap. The roadmap also includes plans for a revamped decentralized governance structure, with a dedicated ecosystem council to oversee smart contract upgrades.\n\nWhile the POL token upgrade is a significant milestone for Polygon, it’s clear that the project has a comprehensive roadmap ahead, promising further advancements in the Layer 2 space.\n\nRead more: Circle incorporates USDC on Polygon\n\nFollow Us on Google News"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLXByaWNlLWV0aGVyZXVtLXByZWRpY3Rpb24tYXJlLWJ0Yy1ldGgtcG9pc2VkLWZvci1zdXJnZS1haGVhZC1vZi1mb21jLW1pbnV0ZXMtdG9tb3Jyb3cuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Price and Ethereum Prediction: Are BTC and ETH Poised for a Surge Ahead of FOMC Minutes Tomorrow? - Cryptonews",
        "content": "Bitcoin Price and Ethereum Prediction: Are BTC and ETH Poised for a Surge Ahead of FOMC Minutes Tomorrow?\n\nBitcoin and Ethereum are two of the most widely traded cryptocurrencies in the market, with both having experienced a lack of volatility over the past few days. As investors and traders eagerly await the Federal Open Market Committee’s (FOMC) minutes scheduled to be released tomorrow, the question on everyone’s mind is whether BTC and ETH are poised for a surge.\n\nBitcoin (BTC), the world’s largest cryptocurrency, has continued to rise and has gained some traction above the $25K mark. Meanwhile, the second most popular cryptocurrency, Ethereum (ETH), has surpassed $1,700 for the first time since September 2022.\n\nhttps://www.twitter.com/hzdcom/status/1627902479097634817?s=20\n\nBitcoin has risen 14 percent in the last seven days, indicating rapid growth. Other well-known cryptocurrencies, such as Dogecoin (DOGE), Solana (SOL), Litecoin (LTC), and Ripple (XRP), also saw marginal increases.\n\nThe total market capitalization of all cryptocurrencies was $1.13 trillion, representing a 1.67 percent increase in a 24-hour period.\n\nHowever, the reason for its upward rally could be linked to improved macroeconomic conditions and investors’ renewed market optimism. Furthermore, the Hong Kong Securities and Futures Commission (SFC) has recommended new laws for cryptocurrency trading platforms in order to increase investor safety. This was regarded as yet another important factor influencing Bitcoin values.\n\nUS Dollar’s Rally has Come to a Halt\n\nThe US dollar, which had been on an upward trend due to strong labor market statistics and persistent inflation, lost some of its momentum as traders awaited economic data to determine whether it was still justifiable to push the dollar higher. Despite having risen for three consecutive weeks, with a gain of about 1.7% in February, the US dollar index has now settled around 104, after reaching a six-week high of 104.67 on Friday.\n\n@Stablzone is incentivising the #DeFi industry because it provides a low-risk, high-yield investment opportunity. #USDT\n\n\n\nStable coins are digital assets that are pegged to a fiat currency, such as the US dollar, and are designed to maintain a stable value.\n\n\n\nIt’s $STABLZ Season 🛫 pic.twitter.com/Z5pZNxxfnU — 𝕊𝔸𝕋𝕆𝕊ℍ𝕀 𝕄𝔸ℝ𝕂𝔼𝕋𝕀ℕ𝔾 (@MillionXSatoshi) February 20, 2023\n\nTherefore, the bearish US dollar has played a significant role in supporting BTC prices, since Bitcoin has a high inverse connection to the US Dollar Index (DXY).\n\nThe holiday-shortened trading week brings readings on manufacturing, the health of the consumer and US economic output. That’s on top of minutes from the Fed’s most recent meeting and speeches from a range of officials, including Cleveland Fed President Loretta (6/18) — Margin32 (@Margin32) February 20, 2023\n\nMoving on, the market is now waiting for the release of the minutes from the Fed’s most recent meeting. However, traders are anticipating European and American manufacturing data later on Tuesday, as well as the core PCE price index on Friday, to help guide their next movements.\n\nHong Kong Proposes Crypto Platform Regulations\n\nCryptocurrency prices have received a further boost due to new licensing guidelines for crypto exchanges in Hong Kong, which are aimed at establishing the city as a hub for digital currencies. On Monday, the Securities and Futures Commission (SFC) of Hong Kong issued regulations for virtual asset trading platforms and is now inviting public feedback.\n\nAccording to the announcement, all cryptocurrency trading platforms, including those that currently exist, should begin assessing and upgrading their systems and procedures to conform with the new regime. They further added that those who do not intend to apply for a license have to start making arrangements for a peaceful exit from the Hong Kong market. Stablecoin regulation will begin in Hong Kong in June of this year as well.\n\nBitcoin Price\n\nTechnical analysis shows that Bitcoin‘s price has been fluctuating slowly within a tight range of $23,700 and $25,200. If the BTC/USD price is able to break out above the $25,200 resistance level, it may continue rising toward the $26,000 level, which is the next significant level of resistance.\n\nHowever, the leading technical indicators, including RSI and MACD, are showing divergence. While the RSI is currently above 50 and in the buying zone, the MACD is forming histograms below 0 and in the selling zone. Investor indecision is often a result of this kind of disparity.\n\nBitcoin Price Chart – Source: Tradingview\n\nIn the event that the price of Bitcoin drops below the present support level of $23,750, the 50% Fibonacci retracement mark would act as the next support level at $22,850.\n\nThe minutes from the next Federal Open Market Committee meeting are due out on Wednesday, so all eyes will be on that event in the coming week. Bitcoin’s price movement may be affected by these minutes.\n\nBuy BTC Now\n\nEthereum Price\n\nThe ETH/USD pair has experienced a boost in positive momentum after establishing support near the $1,650 mark. Ethereum’s price has been fluctuating within a narrow range during the past two hours, as evidenced by the formation of a symmetrical triangle pattern on the 2-hour timescale, which indicates market uncertainty.\n\nEthereum’s price might hit $1,720 if the cryptocurrency has a positive rebound over the $1,650 level. Further gains for the bulls are possible if prices break out to the upside from the symmetrical triangle pattern and the $1,720 mark.\n\nEthereum Price Chart – Source: Tradingview\n\nTo offset this decline, Ethereum has the support of around $1,650 and $1,625. Analyzing the price of Bitcoin is similar to analyzing the RSI and MACD, which are displaying divergence. The $1,760 and $1,800 price levels are expected to function as barriers in both cases.\n\nBuy ETH Now\n\nBitcoin and Ethereum Alternatives\n\nIn addition to Bitcoin (BTC) and Ethereum (ETH), there are several other altcoins in the cryptocurrency market that show significant potential. The CryptoNews Industry Talk team has conducted an analysis and created a list of the top 15 cryptocurrencies to watch in 2023.\n\nThis list is updated regularly with new altcoins and ICO projects, so it is recommended to check back frequently for the latest additions.\n\nDisclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.\n\nFind The Best Price to Buy/Sell Cryptocurrency"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmJhbHRpY3RpbWVzLmNvbS9iaXRjb2luX21pbmluZ192c19fZXRoZXJldW1fbWluaW5nX19maW5kaW5nX3lvdXJfcGF0aF90b19wcm9maXRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Mining vs. Ethereum Mining: Finding Your Path to Profits - Baltic Times",
        "content": "In the rapidly expanding world of cryptocurrency, Bitcoin and Ethereum have emerged as two of the most popular and valuable digital currencies. As individuals and investors seek opportunities to enter the crypto market, mining remains a lucrative avenue for potential profits. This article explores the key differences between Bitcoin mining and Ethereum mining, shedding light on their respective processes, rewards, and challenges. Whether you're a seasoned crypto enthusiast or a newcomer, understanding these distinctions will help you find your path to profits. For better insight you can visit https://bit-qt.app/.\n\nThe Rise of Cryptocurrency\n\nThe advent of cryptocurrencies brought about a revolution in the financial landscape, disrupting traditional monetary systems and offering innovative decentralized alternatives. Among the numerous platforms that facilitate online trading of cryptocurrencies. Aspiring miners can use this platform to enter the crypto market and explore the opportunities presented by Bitcoin and Ethereum mining.\n\nThe Pioneering Bitcoin Mining\n\nBitcoin, the pioneering digital currency created by the pseudonymous Satoshi Nakamoto, has captured the attention of the world since its introduction in 2009. Bitcoin mining is the process by which new bitcoins are created and transactions are added to the blockchain. Miners use powerful computer hardware to solve complex mathematical puzzles, and the first one to solve the puzzle gets the right to add a new block to the blockchain and is rewarded with bitcoins.\n\nThe Challenge of Bitcoin Mining Difficulty\n\nOver the years, Bitcoin mining has become increasingly competitive and challenging. The Bitcoin network is designed to adjust the mining difficulty level approximately every two weeks to ensure that new blocks are added at a consistent rate. As more miners join the network, the difficulty increases, making it harder to mine new bitcoins. As a result, miners now require specialized, high-performance mining rigs to remain profitable.\n\nEthereum Mining: Beyond Digital Currency\n\nIn contrast to Bitcoin's primary focus as a digital currency, Ethereum is a decentralized platform that enables the creation of smart contracts and decentralized applications (DApps). Ethereum mining is essential for processing transactions and securing the Ethereum network. Miners use graphics processing units (GPUs) to solve cryptographic puzzles, and those who succeed in solving them add new blocks to the Ethereum blockchain and are rewarded with Ether (ETH), the native cryptocurrency of the platform.\n\nThe Ethereum Mining Reward System\n\nEthereum's mining reward system differs from Bitcoin's in several ways. Unlike Bitcoin, Ethereum has not implemented a hard cap on its total supply, meaning that new Ether coins are continually being created through mining. However, Ethereum has proposed a shift from the current proof-of-work (PoW) consensus mechanism to proof-of-stake (PoS), where miners are replaced by validators who secure the network by staking their Ether.\n\nEnergy Consumption: Bitcoin vs. Ethereum\n\nOne of the critical concerns surrounding cryptocurrency mining is its energy consumption. Both Bitcoin and Ethereum mining are energy-intensive processes due to the computational power required to solve the cryptographic puzzles. However, Bitcoin's PoW algorithm, known as SHA-256, demands more power compared to Ethereum's current Ethash algorithm. The proposed shift to PoS in Ethereum is expected to significantly reduce its energy consumption.\n\nDiversification or Specialization: Choosing Your Mining Path\n\nWhen considering entering the mining space, individuals must decide whether to focus on Bitcoin mining, Ethereum mining, or both. Bitcoin's long-standing position as the leading cryptocurrency and its widespread adoption make it a relatively stable choice for miners. On the other hand, Ethereum's potential shift to PoS and its versatile platform for DApps offer unique opportunities for those looking to diversify their crypto mining ventures.\n\nPool Mining vs. Solo Mining\n\nAnother crucial decision for miners is whether to join a mining pool or opt for solo mining. Pool mining involves combining computational resources with other miners to increase the chances of successfully mining a block. While this leads to more frequent but smaller rewards, solo mining offers the potential for higher individual rewards but with a lower probability of success.\n\nThe Future of Mining: Staying Profitable in a Changing Landscape\n\nAs the cryptocurrency landscape continues to evolve, staying profitable in mining requires adaptability and staying informed about industry developments. Monitoring changes in mining difficulty, keeping an eye on energy costs, and understanding the implications of proposed upgrades like Ethereum's shift to PoS are vital for miners looking to make informed decisions.\n\nEmbracing the Journey: Bitcoin and Ethereum Mining\n\nIn conclusion, Bitcoin mining and Ethereum mining present distinct paths to potential profits in the world of cryptocurrencies. While Bitcoin remains the gold standard and a stable choice for miners, Ethereum offers exciting possibilities with its shift to PoS and a versatile platform for DApps. Whichever path miners choose, leveraging reputable online trading platforms like Crypto Loophole can provide a solid foundation for exploring the exciting world of crypto mining. Embracing the journey with the right knowledge, tools, and determination will undoubtedly lead to rewarding experiences in the ever-evolving crypto market."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLXByaWNlLWV0aGVyZXVtLXByZWRpY3Rpb24td2lsbC1idGMtZXRoLWJvdW5jZS1iYWNrLWFmdGVyLTM4LWZpYm9uYWNjaS1yZXRyYWNlbWVudC5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Price and Ethereum Prediction: Will BTC & ETH Bounce Back After 38.2% Fibonacci Retracement? - Cryptonews",
        "content": "Bitcoin Price and Ethereum Prediction: Will BTC & ETH Bounce Back After 38.2% Fibonacci Retracement?\n\nBitcoin and Ethereum, the two largest cryptocurrencies by market capitalization, experienced a significant bearish correction on Friday, with Bitcoin retracing 38.2% of its recent gains. Ethereum suffered a similar decline.\n\nAs a result, many traders and investors are now questioning whether this drop is a temporary correction or the beginning of a more prolonged bearish trend.\n\nIn this analysis, we will assess the technical factors affecting BTC and ETH and make predictions about their future movements.\n\nCongratulations！#BTC breaks 25,000, look for a continued price rise in the near future! 🚀🔥 pic.twitter.com/msEGiwX2Wl — OpenBlock (@OpenBlockWallet) February 16, 2023\n\nDespite challenging inflation statistics and tighter regulation of stablecoins, the leading cryptocurrency by market capitalization is currently trading at over $24,920, up more than 9% from the previous day.\n\nThe reasons behind this price surge can be attributed in part to Dubai’s crypto-friendly laws, which have encouraged the growth of the sector by attracting Web3 and crypto firms, as well as established enterprises embracing innovative technologies like cryptocurrencies, NFTs, and the metaverse.\n\nThese factors suggest that the demand for cryptocurrencies continues to grow, even in the face of broader economic challenges and regulatory headwinds.\n\nBREAKING: 🇦🇪 Abu Dhabi launched $2 billion initiative to back Web3 and #Crypto startups 🔥 pic.twitter.com/vXccOBU91t — Keyur Rohit (@CryptoKingKeyur) February 15, 2023\n\nWhile new regulations are presenting a challenge for the cryptocurrency market, some investors are shifting their capital from altcoins to Bitcoin. This is likely due to the fact that Bitcoin is the only cryptocurrency that the SEC chair has classified as a commodity, providing it with a unique advantage in terms of regulatory clarity and stability.\n\nDespite these regulatory challenges, Bitcoin remains a popular choice for investors seeking exposure to the cryptocurrency market. As the market continues to evolve and new regulations are implemented, it will be interesting to see how Bitcoin and other cryptocurrencies respond to these changes.\n\nUnderstanding Crypto Fundamentals: Analyzing a Bullish Market\n\nDespite the US government’s recent regulatory crackdown on cryptocurrencies, the market has seen a surge in prices, with many cryptocurrencies experiencing strong gains. This was particularly evident in the recent rise of Bitcoin, which unexpectedly regained its footing and sparked a broader rally in the market.\n\nWhile the US government’s regulatory policies may present challenges for the market, the recent surge in prices suggests that investors remain confident in the potential of cryptocurrencies.\n\n“The crypto bear market is over.”\n\n\n\nBro you’re 16 stfu. — Michael A. Gayed, CFA (@leadlagreport) February 17, 2023\n\nThe recent upward trend in the cryptocurrency market coincides with the launch of the Bitcoin NFT Ordinals protocol and a new record for average block size.\n\nAccording to the most recent data from Blockchain.com, the average size of a Bitcoin block has surpassed 2.5 gigabytes for the first time since the introduction of the new protocol. This increase in block size suggests a rising demand for Bitcoin and highlights the growing usage of the network.\n\nWhat's going on with #Bitcoin ?\n\n\n\nDespite news of heavy #US regulatory moves and SEC crackdown, bitcoin is flirting with $25k. One reason for this renewed interest is named Ordinals, a protocol which enables #BTC's version of #NFT's\n\n\n\n1/4#Crypto #ETH pic.twitter.com/A0Qvekvb64 — *Julius Specht (@specht_julius) February 16, 2023\n\nAs the cryptocurrency market continues to evolve, the introduction of new protocols and technologies will play a significant role in shaping its future. The successful launch of the Bitcoin NFT Ordinals protocol and the record-breaking average block size are examples of how innovation and technological advancements are driving the market forward.\n\n#bitcoin wallets filled with #btc reached an ATH for number of Non-zero addresses reached 44,089,657\n\n\n\nConviction that #bitcoin will win has never been higher\n\n\n\nCharts by @glassnode pic.twitter.com/i095xRKR07 — A u s t i n | Open Source Fitness (@_AustinHerbert) February 14, 2023\n\nIn addition to the recent surge in the cryptocurrency market, Bitcoin has experienced further gains due to a brief spike in network activity that added approximately 44 million non-zero BTC wallets to the user base. This increase in network activity highlights a growing interest in the cryptocurrency, which has contributed to its recent bullish trend.\n\nMoreover, the rise in short liquidations has also played a role in driving BTC’s upward price momentum. In the last 24 hours, traders have closed out approximately $85.87 million worth of short BTC positions, significantly contributing to Bitcoin’s price surge.\n\nAbu Dhabi Embraces the Crypto Market: A New Era of Adoption\n\nDubai has supported the growth of the cryptocurrency industry by establishing robust regulations, which have attracted both domestic Web3 and crypto organizations, as well as traditional businesses that are now incorporating novel technologies into their operations, such as NFTs, cryptocurrencies, and the metaverse.\n\nHub71, Abu Dhabi's tech ecosystem, has started a new $2 billion initiative to back Web3 and blockchain technology startups in the region.@hub71ad pic.twitter.com/p0rWPnYFS1 — Smashi (@smashitv_en) February 15, 2023\n\nHub71, a tech company located in Abu Dhabi, has announced a new initiative to support the advancement of Web3 technologies by providing Web3 entrepreneurs with access to finance, partnerships, and programs. The “Hub71+ Digital Assets” project includes a $2 billion fund to help eligible entrepreneurs, which has played a significant role in bolstering the cryptocurrency industry.\n\nPartnership Between Chinese Companies\n\nChina Telecom and the Shanghai Tree-Graph Blockchain Research Institute, also known as Conflux Network, have partnered to develop the BSIM, a blockchain-based SIM card.\n\nConflux Network, also known as the Shanghai Tree-Graph Blockchain Research Institute, has announced a partnership with China Telecom to collaborate on the development of a blockchain SIM card.\n\n\n\nRead more: https://t.co/6r2QzvvToA #Blockchain #Crypto #Innovation #Software #Law pic.twitter.com/BduRLjBTxf — Hashchain Consulting Group LLC (@HashChainGroup) February 16, 2023\n\nAccording to the official release, this new device will provide consumers with a secure method of storing private keys and utilizing the SIM’s built-in capabilities to verify digital transactions. This development is seen as yet another crucial factor that has positively impacted the cryptocurrency industry.\n\nBitcoin Price\n\nAs of today, the live Bitcoin price stands at $23,700 with a 24-hour trading volume of $38 billion. Over the last 24 hours, Bitcoin has experienced a 4% decline. It currently holds the top ranking on CoinMarketCap, with a live market cap of $457 billion.\n\nFrom a technical perspective, Bitcoin has been unsuccessful in surpassing the $25,300 level and has experienced a sharp decline to reach the 38.2% Fibonacci retracement level at $23,700.\n\nBitcoin Price Chart – Source: Tradingview\n\nIf the price continues to fall below the $23,700 level, it may indicate a bearish breakout and expose Bitcoin to the next support area at the $23,300 mark, which is supported by the 50% Fibonacci retracement level.\n\nBuy BTC Now\n\nEthereum Price\n\nAs of today, the live Ethereum price is $1,660, and the 24-hour trading volume is $11 billion. Ethereum has decreased by over 2% in the last 24 hours. It currently holds the second position in CoinMarketCap’s rankings, with a live market cap of $202 billion.\n\nCurrently, the ETH/USD pair is experiencing a consolidation phase within a narrow trading range of $1,635 to $1,675, after failing to surpass the $1,740 resistance level.\n\nOn the lower side, the 38.2% Fibonacci retracement level is providing support at the $1,640 level. However, a break below this level could push the ETH price even lower toward the $1,600 or $1,530 level.\n\nEthereum Price Chart – Source: Tradingview\n\nConversely, a bullish breakout of the $1,675 level may expose the ETH price to the $1,740 level. The 50-day moving average and MACD indicators also indicate a buying trend, so we should only consider buying trades above the $1,630 mark.\n\nBuy ETH Now\n\nBitcoin and Ethereum Alternatives\n\nIn addition to BTC and ETH, there are several other altcoins in the market with high potential. The CryptoNews Industry Talk team has analyzed and compiled a list of the top 15 cryptocurrencies for 2023.\n\nThe list is updated weekly with new altcoins and ICO projects, so it’s advisable to check back frequently for new entries.\n\nDisclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.\n\nFind The Best Price to Buy/Sell Cryptocurrency"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1ldGhlcmV1bS1jcnlwdG9zLXNoaWJhLWludS1hc2lhLXdyYXAtMzAtb2N0b2Jlci12aWRlby0yMDIzMTAzMDAzMTLSAZcBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvY3J5cHRvY3VycmVuY2llcy1wcmljZS1wcmVkaWN0aW9uLWV0aGVyZXVtLWNyeXB0b3Mtc2hpYmEtaW51LWFzaWEtd3JhcC0zMC1vY3RvYmVyLXZpZGVvLTIwMjMxMDMwMDMxMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Cryptos & Shiba Inu – Asia Wrap 30 October [Video] - FXStreet",
        "content": "Shiba Inu (SHIB) price shows signs of exhaustion and a potential pullback scenario, which could be an opportunity for patient buyers. A reset of the momentum indicators combined with the incoming pullback is likely to extend the ongoing rally\n\nEthereum (ETH) price is in a good position after last week’s rally. But things are not a given, as bulls need to defend a few key levels before they’re in the clear. Investors need to watch the key barriers to know where ETH will head next.\n\n$Bitcoin (BTC) has soared to a 17-month high past $35k, but its upward structure suggests a 5-wave leg may be completed soon. Will it be the end of the rally?\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0zNDAwMC1ldGhlcmV1bS1zbGlwcy1iZWxvdy0xODAwLW1vc3QtYWx0Y29pbnMtdXAtNDAzNzI3LTIwMjMtMTAtMzDSAZcBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3Rva2VuL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWhvbGRzLTM0MDAwLWV0aGVyZXVtLXNsaXBzLWJlbG93LTE4MDAtbW9zdC1hbHRjb2lucy11cC00MDM3MjctMjAyMy0xMC0zMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $34,000; Ethereum slips below $1,800; most altcoins up - Business Today",
        "content": "Bitcoin and other crypto tokens continued their bullish momentum in the new week on Monday. All the crypto tokens stepped in the early trades, continuing the weekend momentum. The euphoria around regulatory approval of a spot bitcoin exchange-traded fund (ETF) listing helped the crypto surge lately.\n\n\n\nBitcoin continued to remain firm as the largest crypto token gained about a per cent and managed to hover strongly above 34,000-levels. However, its largest peer, Ethereum, was also seen half a per cent each but remained below $1,800-level. Majority of the altcoins were trading with gains.\n\n\n\nBitcoin sustained its position above the $34,000 threshold, driven by the prevailing positive outlook regarding the potential approval of Bitcoin Spot ETF applications in the United States, said Edul Patel, Co-Founder & CEO at Mudrex.\n\n\n\n\"The ProShares Bitcoin Strategy ETF (BITO) witnessed its second-largest trading week to date, racking up $1.7 billion in trading volume, while the Grayscale Bitcoin Trust (GBTC) recorded $800 million in trading volume, possibly amplifying the overall market's positive sentiment. Ethereum, on the other hand, maintained its trading value above $1,700,\" he said.\n\n\n\nAll of the majority of top crypto tokens were trading higher on Monday. Solana surged about per cent, while Chainlink and Polkadot gained 3 per cent each. Polygon, Cardano and XRP gained about 2 per cent each in the early trade. Even the dollar pegged stablecoins inched up.\n\n\n\nThe global cryptocurrency market cap was trading significantly higher, rising up to $1.26 trillion-mark, as it jumped about a per cent in the last 24 hours. However, the total trading volumes surged more than 13 per cent to $27.37 billion.\n\n\n\nBitcoin concluded the week with a remarkable 15 per cent gain. Throughout the weekend, BTC maintained a positive stance but remained below its local resistance at $35,000. Currently, the price hovers around $34,300, while ETH is trading slightly above the local support level of $1,765, said CoinDCX Research Team.\n\n\n\n\"It's worth noting that this week carries significant weight for the crypto market due to various macro events, including the US FOMC meeting, the monthly announcement of the US unemployment rate, US job openings, and the US non-farm Employment Change. These events have the potential to introduce volatility to the crypto market,\" it added.\n\n\n\nImage: Crypto-chart-price\n\n\n\nTech View by Giottus Crypto Platform\n\nChainlink (LINK) is currently in a major rally on the back of RWA (Real world assets) narrative and wider positive sentiment in the market. The token has been on the sidelines for most of 2022 and 2023 but recently saw a considerable surge in price. LINK went from $5.9 in early September to $11.2 today, a 90% surge in price.\n\n\n\nImage: Chart-Chainlink\n\n\n\nThe token has broken the $10 key resistance level, and continued strong development is likely. The Bollinger Bands are currently wide as the price volatility increases near the $9 mark and the price action is trending well above the indicator’s mean line. The upward shift has propelled the RSI index to the overbought territory and is currently sitting at 76.9. If the price manages to successfully surpass the $12 mark, this could lead to further increase towards the resistance level of $13.5.\n\n\n\nMajor Levels:\n\nSupport: $10, $9, $7.85\n\nResistance: $12, $13.5\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvM2stb3ItMS01ay13aGVyZS1ldGhlcmV1bS1wcmljZS1pcy1oZWFkaW5nL9IBTGh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvM2stb3ItMS01ay13aGVyZS1ldGhlcmV1bS1wcmljZS1pcy1oZWFkaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Will Ether (ETH) Price Break $3000 in November? - CoinGape",
        "content": "For nearly two weeks, the Ethereum price recovery has witnessed intense supply pressure around the $1830 mark. The multiple higher price rejection candles in the daily chart at this barrier reflect the sellers are aggressively defending the higher ground. However, despite the overhead supply pressure, the buyers preventing the asset from falling below the $1,750 mark indicate the bullish momentum is not completely exhausted.\n\nAlso Read: Solana Vs Ethereum: A Deep-Dive Analysis of Two Popular Coins\n\nadvertisement\n\nETH Price Analysis: Dual Resistance Threatens for New Correction\n\nThe flag pattern governs the current correction trend in the Ethereum coin.\n\nA bullish breakout from the overhead trendline could set a rally beyond $2000\n\nThe intraday trading volume in Ether is $6.7 Billion, indicating a 5.9% loss.\n\nSource- Tradingview\n\nThe Ethereum price recovery faces a formidable hurdle at the $1,850 level, coinciding with the upper trendline of a bullish flag pattern. Amid the prevailing uncertainty emanating from the Bitcoin price consolidation, the ETH price has been trading sideways for over a week.\n\nAlthough sellers have attempted to take advantage in this market flux, the buyers have been steadfast in maintaining a floor at $1,750. Consequently, the coin price oscillates between this support level and the overhead trendline.\n\nA decisive breakout or breakdown from this range will offer a clearer outlook for near-term price action. Should the market supply pressure intensify, a drop below the $1,750 level could instigate a significant correction, maintaining the asset within its current flag pattern.\n\nIn such a scenario, the Ethereum coin could potentially slide toward its lower trendline, currently situated below the $1,500 mark.\n\nIs ETH Price Heading to $3000?\n\nWhile the current market sentiments remain uncertain, the ETH price is strictly following the flag pattern formation, evidenced by the multiple rebounds within its trendline. In theory, this pattern is a bullish continuation pattern, and therefore it should bolster buyers to break above the overhead trend line. A potential breakout with a daily candle closing would accelerate the buying momentum and could surge the altcoin to a potential target of $2,292 followed by a $3,000 mark\n\nVortex Indicator : The considerable gap between the VI+ and VI- slopes in a bullish crossover state confirms the recovery trend remains robust.\n\nExponential Moving Average: An impending bullish crossover between the 20-day and 200-day EMA slopes could further intensify buying interest in this asset."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3VzLWZlZC1pbnRlcmVzdC1yYXRlLXByZXZpZXctdHdvLXNjZW5hcmlvcy1mb3ItYml0Y29pbi1hbmQtZXRoZXJldW0tcHJpY2VzLTIwMjMxMDMxMTMxNNIBigFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy91cy1mZWQtaW50ZXJlc3QtcmF0ZS1wcmV2aWV3LXR3by1zY2VuYXJpb3MtZm9yLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXByaWNlcy0yMDIzMTAzMTEzMTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "US Fed interest rate preview: Two scenarios for Bitcoin and Ethereum prices - FXStreet",
        "content": "Share:\n\nBitcoin and Ethereum prices are close to key psychological levels, $34,400 and $1,800, ahead of the Federal Reserve’s interest rate decision.\n\nCryptocurrencies in the top 10 by market capitalization noted an increase in their prices in the week leading up to the Fed’s decision.\n\nTraders foresee a 98.2% probability that the US Federal Reserve will leave interest rates unchanged on Wednesday.\n\nBitcoin price rallied throughout October 2023, marking another profitable month for BTC holders. The upcoming US Federal Reserve interest rate decision has the potential to make or break Bitcoin’s price rally.\n\nAltcoins like Ethereum will probably follow Bitcoin’s coattails. A vast majority of market participants expect the interest rate to remain unchanged and a small percentage anticipate a rate cut by the US central bank.\n\nAlso read: Federal Reserve Preview: Powell set to lift US Dollar by leaving door open to more hikes\n\nUS Fed interest rate preview: Two scenarios for Bitcoin and cryptocurrency prices\n\nScenario 1: US Fed leaves rates unchanged\n\nAccording to the CME Fed Watch Tool, there is a 98% probability that the US Ccentral bank will leave interest rates unchanged on November 1. In September 2023, Bitcoin price noted no stark movements as the Fed left interest rates unchanged. A similar outcome is expected, in response to the Federal Reserve’s November 1 decision.\n\nCME Fed Watch tool and expectation of interest rate hike\n\nBitcoin price could witness short-term volatility, with BTC hovering close to the $34,400 level. BTC is likely to momentarily retrace its weekly gains of 4.33%, a recovery in the asset’s price could follow soon after.\n\nBitcoin’s rally is largely driven by the anticipation of a spot BTC ETF approval by the US financial regulator Securities and Exchange Commission (SEC). The SEC’s decision could therefore influence BTC price directly, as opposed to unchanged interest rates.\n\nScenario 2: US Fed cuts interest rates\n\nMarket participants believe that there is a 1.8% probability of an interest rate cut. In the event of a rate cut, risk assets like Bitcoin and altcoins are expected to rally. Typically, a rate cut makes it cheaper to borrow funds and engage in leveraging risk assets like Bitcoin for gains. An increase in demand and inflow of funds to the asset likely drive prices higher.\n\nIt is important to note that the interest rate cut is highly unlikely. Investors are focused on Fed Chair Jerome Powell’s speech to identify whether more interest rate hikes are on the horizon.\n\nExpert analysis on likelihood of further rate hikes\n\nYohay Elam, lead analyst at FXStreet analyzed the Fed’s interest rate decision and the possibility of future rate hikes in his post here. Elam notes that the Federal Reserve's overnight rate stands at a range of 5.25%-5.50%, above both measures of inflation. The US Central bank has slowed the pace of its rate hikes and settled for one interest rate increase in the past three meetings.\n\nWhile market participants expect another “no change” decision from the US Fed, the Central bank left room for another hike in 2023. Elam says,\n\n“The bank's dot plot showed a target of 5.6% by year-end, leaving the door open to another move. With no new forecasts at this juncture, Fed Chair Jerome Powell will likely insist on another move, leaving his options open. One reason to do that is the buoyant jobs market.”\n\nBitcoin and Ethereum prices hover at crucial levels\n\nBitcoin and Ethereum, the two largest cryptocurrencies by market capitalization are hovering around crucial levels, ahead of the bank’s decision on Wednesday. Bitcoin price sustained above $34,400 while Ethereum is trading above its $1,800 psychological level."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9jcnlwdG8tbGVzLW9wdGlvbnMtZXRoZXJldW0tZ3JpbXBlbnQtZW4tZmxlY2hlLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Crypto: Ethereum Options Soar! - Cointribune EN",
        "content": "Tue 31 Oct 2023 ▪ 3 min of reading ▪ by Evans S.\n\n▪ Altcoins\n\nThe unprecedented boom in options on the Ethereum crypto (ETH) has taken many in the ecosystem by surprise. ETH option block volumes recently passed the impressive threshold of $250 million. Behind this figure lies a complex phenomenon, tinged with both opportunities and challenges.\n\nThe spectacular rise of Ethereum options\n\nOn October 30, the market witnessed a massive flow of call options trading on the Ethereum crypto, reaching a total of over 140,000 contracts. These figures reflect growing optimism among institutional investors.\n\nAccording to a report from Greeks Live, a reference for crypto options traders, most of these trades involved the purchase of monthly options in the 1650/1700/1800 range, which will expire on November 24. More intriguingly, despite a 6.28% rise in put sales, call purchases jumped 12.85%.\n\nThe implications of these rising volumes\n\nThe remarkable increase in call option trading shows that investors are betting on a rise in the price of the Ethereum crypto. On the other hand, a 3% rise in short-term implied volatility suggests that the market is anticipating a price fluctuation in the near future.\n\nInterestingly, however, bullish investor sentiment on Ethereum contrasts with recent CoinShares data.\n\nDespite an influx into many altcoins due to optimism around Bitcoin, Ethereum saw an outflow of $6 million. These contradictory data beg the question: what will be the real impact of these option volumes on the market in the long term?\n\nAn evolving crypto market\n\nThe meteoric growth of ETH options block volumes is more than just a milestone for crypto and the Ethereum ecosystem. It testifies to the growing momentum and maturity of the cryptocurrency market.\n\nWith increasing liquidity and the potential stabilization of the market thanks to options, Ethereum seems to be well on the way to consolidating its position as one of the leading cryptocurrencies.\n\nHowever, it’s vital to remember that the crypto sphere is inherently volatile. While the future of ETH options looks bright, it’s crucial for investors and traders to remain informed and cautious.\n\nEthereum’s journey has only just begun, and every step of the way will bring its share of surprises and lessons. Even the UN is taking an interest.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1pbmRpY2F0ZXMtd2hhdHMtbmV4dC1mb3ItbDJzLWFuZC1icmlkZ2Vz0gFdaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWZvdW5kZXItdml0YWxpay1idXRlcmluLWluZGljYXRlcy13aGF0cy1uZXh0LWZvci1sMnMtYW5kLWJyaWRnZXM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Indicates What's Next for L2s and Bridges - U.Today",
        "content": "Advertisement\n\nThe Ethereum (ETH) founder attempted to make a simplified classification of Layer-2 solutions on the top of Ethereum (ETH) and proposed two elegant designs to make L1/L2 bridging more secure and resource-optimized.\n\nFrom reading bridges to validation bridges: Vitalik Buterin on L1/L2 consistency\n\nIn 2023, there are three types of L2 solutions dominating the EVM ecosystem: rollups, validiums and disconnected system. While rollups store the data on L1, validiums use servers or other isolated systems for these purposes. Rollups verify the data via fraud-proof or zk-SNARKs, while validiums only support zk-SNARKS.\n\nDifferent types of layer 2shttps://t.co/ry4VTtWhJ1 — vitalik.eth (@VitalikButerin) October 31, 2023\n\nThis scheme was described by Vitalk Buterin in his latest blog post published today, Oct. 31, 2023.\n\nTwo factors are dominant, he says, when it comes to choosing this or that L2 design to build on. First, it is the cost of native Ethereum (ETH) data availability and then the application's own needs, i.e., its interest in higher speed or more enhanced security.\n\nThen, if the Ethereum (ETH) mainnet somehow reverts (unexpectedly splits into two independent versions), the L2 network can only read finalized blocks or revert as well: here are the two main models needed to keep the L1/L2 system consistent.\n\nAnother productive concept in this segment is the so-called validating bridge, i.e., a cross-blockchain mechanism that can prove the validity of its \"underlying\" blockchain:\n\n\"Now, let's make the bridge a validating bridge: it checks not just consensus, but also a ZK-SNARK proving that the state of any new block was computed correctly.\"\n\nOnce this is done, the top chain's validators can no longer steal your funds. They can publish a block with unavailable data, preventing everyone from withdrawing, but they cannot steal (except by trying to extract a ransom for users in exchange for revealing the data that allows them to withdraw).\n\nHowever, the L1/L2 equilibrium is still vulnerable until some \"form of governance gadget on Ethereum\" is able to make the bridge contract on Ethereum (ETH) aware of a hypothetical hard fork taking place.\n\nNo \"one-size-fits-all\" solution for Ethereum L2s, here's why\n\nAll of these \"add-ons\" to Ethereum (ETH) L2s' security and operability come with their own costs. In terms of security, they can be described as the security of withdrawing to Ethereum or the security of reading Ethereum.\n\nEvery dApp needs to find the perfect solution with its own requirements in mind. For some applications, high security and tight connectedness are of paramount importance. For their competitors, something looser is acceptable in exchange for more advanced scaling opportunities.\n\nHowever, for some systems, improving \"connectedness\" in the coming years, step by step, might be a perfect solution, Buterin concludes."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLXByaWNlLWV0aGVyZXVtLXByZWRpY3Rpb24td2lsbC1mb21jLW1lZXRpbmctbWludXRlcy1pbXBhY3QtYnRjLWV0aC13ZWVrLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Price and Ethereum Prediction: Will FOMC Meeting Minutes Impact BTC and ETH This Week? - Cryptonews",
        "content": "Bitcoin Price and Ethereum Prediction: Will FOMC Meeting Minutes Impact BTC and ETH This Week?\n\nBitcoin (BTC) and Ethereum (ETH), the two biggest cryptocurrencies in the world, continue to hold above the $24,000 and $1,600 marks, respectively. However, they experienced a slight decline this morning, with Bitcoin falling from $25,000 to $24,000.\n\nThe crypto market continues to fluctuate, investors are keeping a close eye on the upcoming Federal Open Market Committee (FOMC) meeting minutes, which are set to be released this week.\n\n#BTC recovered back to the $24,500 level since the drop on Friday. pic.twitter.com/f8qHM4sPMD — Rupert Murdoch (@Sir_Ruper) February 20, 2023\n\nThe recent downward trend in cryptocurrency prices may be linked to positive economic data coming out of the United States. This has strengthened the belief that the Federal Reserve will continue with its plan to tighten monetary policy for a longer period than previously expected.\n\nAsian shares got off a subdued start as trading volume was dampened by a US holiday, while hawkish signals from Fed officials continued to weigh on sentiment. pic.twitter.com/m5vQUCapuT — Arthur Benta (@ArthurBenta) February 20, 2023\n\nIn addition, traders seem to be cautious about making large investments before the release of Coinbase’s results and Hong Kong’s new VASP licensing scheme, both of which are expected to have a significant impact on the market in the upcoming weeks.\n\nHow the Release of FOMC Meeting Minutes on Wednesday Could Impact Crypto Prices?\n\nThe release of the Federal Open Market Committee (FOMC) minutes on Wednesday could have an impact on the price of Bitcoin. As the FOMC sets the monetary policy in the United States, any hint of a shift in this policy could affect financial markets, including the cryptocurrency market.\n\nIn a recent speech at the Economic Club of Washington, Federal Reserve Chair Jerome Powell discussed the ongoing disinflation process and expressed confidence in the Fed’s ability to lower inflation to their targeted rate of 2%.\n\nWhile Powell’s response to the strong January jobs report did not indicate a change in the central bank’s approach to future rate increases, he cautioned that sustained strong labor data could lead to a higher terminal level of the Fed funds.\n\nAt its February 2023 meeting, the Federal Reserve raised the target range for the fed funds rate by 25 basis points, now ranging from 4.5% to 4.75%. This is the second consecutive meeting where the size of the increase has been reduced, although borrowing costs are now at their highest point since 2007.\n\nBitcoin traders and investors will be closely watching the FOMC minutes for any indication of inflationary concerns or changes to interest rates, which could potentially impact the price of Bitcoin.\n\nExploring Mild Dips in the Cryptocurrency Market\n\nThe global cryptocurrency market has been performing well in recent days but experienced a slight decline in the most recent 24-hour period. At the time of writing, the market’s total value was $1.11 trillion, representing a 0.68 percent drop in value.\n\nThe market’s inactivity could be related to the fact that the United States is celebrating President’s Day, which may cause traders to be cautious in placing any significant bids. As a result, Bitcoin has also seen a slight drop in value compared to the previous day.\n\nKeeping a close eye on $BTC. If it closes below 24.3k, the we’ll expect to see BTC drop lower. Otherwise it’ll range until it can break above 25.2k – then it’ll have all the bulls coming out! 😉 #Bitcoin #BTC #cryptomarket #CryptoInvestor #crypto pic.twitter.com/QPQnKUQKqn — Crypto Guy (@Crypto_Guy360) February 19, 2023\n\nMeanwhile, Ether has also experienced a decline in the past 24 hours, likely for the same reason. As a result, other well-known cryptocurrencies such as Dogecoin (DOGE), Litecoin (LTC), and Ripple (XRP) have also seen slight losses.\n\nCan a Strong US Dollar Undermine Cryptocurrency? Analyzing the Relationship Between the USD and Digital Assets\n\nThe US dollar has been experiencing significant gains and showing strength across the board, driven by positive US economic data that has pushed back predictions of a prolonged period of monetary policy tightening by the Federal Reserve.\n\nThe market is anticipating that interest rates will need to rise due to recent statistics coming out of the world’s largest economy, which indicate a tight labor market, persistent inflation, robust growth in retail sales, and increased monthly producer prices.\n\nhttps://www.twitter.com/IanCuIIey/status/1627298207666405376?s=20\n\nMarket forecasts indicate that the Fed funds rate is expected to reach a high of slightly under 5.3% by July. The US dollar has been strengthened by the hawkish views of Fed members, who believe that higher interest rates will be necessary to combat inflation successfully.\n\nTransitory disinflation\n\n\n\nOn Thursday we’ll get fresh PCE data and it’s expected to run hot with +0.5%… largest increase since mid-22 🔥\n\n\n\nFed funds rate is now seen peaking at 5.3% up from 4.9%\n\n\n\n=> Crumbling the basis of the rally is. Back inflation is. A clown JP is.. no balls pic.twitter.com/AB24WS8ne0 — Yoda Research (@YodaResearch) February 19, 2023\n\nTherefore, the strong US dollar has been considered an important factor contributing to the decline in cryptocurrency values, including Bitcoin (BTC) and Ethereum (ETH).\n\nBitcoin Price\n\nLooking at Bitcoin from a technical standpoint, it has been trading sideways and maintaining a narrow range between $23,700 and $25,200. The immediate resistance level for the BTC/USD pair is currently at $25,200, and if the price breaks out above this level, it could potentially reach the $26,000 mark.\n\nHowever, the leading technical indicators, including RSI and MACD, are showing divergence. RSI is presently above 50 in a buying zone, while MACD is forming histograms below 0 in a sell zone. This type of divergence often indicates indecision among investors.\n\nBitcoin Price Chart – Source: Tradingview\n\nIf Bitcoin’s price falls below the current support level of $23,750, the next support level would be at $22,850, which is determined by the 50% Fibonacci retracement mark.\n\nIn the upcoming week, the focus will be on the FOMC meeting minutes, which are set to be released on Wednesday. These minutes could potentially impact the price action of Bitcoin.\n\nBuy BTC Now\n\nEthereum Price\n\nThe ETH/USD pair has seen a rise in bullish momentum after finding support near the $1,650 level. On the 2-hour timeframe, Ethereum has formed a symmetrical triangle pattern, which suggests indecision in the market and has kept the price of ETH within a choppy range.\n\nIf Ethereum experiences a bullish bounce-off above the $1,650 level, it could potentially reach the $1,720 mark. Additionally, a bullish breakout above the $1,720 level and the symmetrical triangle pattern could drive further bullish price action. In either scenario, the price levels of $1,760 and $1,800 are likely to act as resistance levels.\n\nEthereum Price Chart – Source: Tradingview\n\nOn the downside, Ethereum has support levels at approximately $1,650 or $1,625. The RSI and MACD are exhibiting divergence, which is comparable to the analysis of Bitcoin’s price.\n\nThis indicates that investors may be waiting for a significant news event, such as the release of the FOMC meeting minutes, to determine the next market trends.\n\nBuy ETH Now\n\nBitcoin and Ethereum Alternatives\n\nIn addition to Bitcoin (BTC) and Ethereum (ETH), there are several other altcoins in the cryptocurrency market that show significant potential. The CryptoNews Industry Talk team has conducted an analysis and created a list of the top 15 cryptocurrencies to watch in 2023.\n\nThis list is updated regularly with new altcoins and ICO projects, so it is recommended to check back frequently for the latest additions.\n\nDisclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.\n\nFind The Best Price to Buy/Sell Cryptocurrency"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1ldGhlcmV1bS1iaW5hbmNlLXNvbGFuYS1hc2lhLXdyYXAtMzEtb2N0b2Jlci0yMDIzMTAzMTAxMjXSAY4BaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvY3J5cHRvY3VycmVuY2llcy1wcmljZS1wcmVkaWN0aW9uLWV0aGVyZXVtLWJpbmFuY2Utc29sYW5hLWFzaWEtd3JhcC0zMS1vY3RvYmVyLTIwMjMxMDMxMDEyNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Binance & Solana – Asia Wrap 31 October - FXStreet",
        "content": "Solana is making the headlines with Breakpoint at the moment as the month of crypto conferences is upon us. Starting Monday, the developer meetup is expected to generate some significant bullishness for SOL as well as the entire ecosystem.\n\nThe world’s largest derivative market is now close to becoming the world’s leading Bitcoin Futures market as well, potentially replacing Binance. The CME Group is poised to overtake Changpeng Zhao’s company in this regard, given how much institutions are exhibiting interest in Bitcoin at the moment.\n\nEthereum (ETH) price continues to hold above a crucial support level after a significant climb beginning in mid-October. The second largest cryptocurrency by market capitalization may have more gusto to move north, based on technical fundamentals, with data indicating a renewed investor confidence for ETH.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vbWlsa3JvYWQuY29tL25ld3Mvdml0YWxpay1idXRlcmluLWRpc3NlY3RzLWV2b2x2aW5nLWxhbmRzY2FwZS1vZi1ldGhlcmV1bS1sYXllci0yLXNjYWxpbmctc29sdXRpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Dissects Evolving Landscape of Ethereum Layer 2 Scaling Solutions - Milk Road",
        "content": "As Ethereum continues to cement itself as the leading smart contract blockchain network, an array of layer 2 scaling solutions have emerged to help bring greater capacity, lower costs, and increased security to the ecosystem. According to Ethereum co-founder Vitalik Buterin, the layer 2 landscape is likely to remain diverse and heterogeneous going forward.\n\nIn a recent blog post titled “Different Types of Layer 2s,” Buterin provided an overview of the current state of Ethereum layer 2 solutions and why he expects continued variation in technical approaches:\n\nDifferent types of layer 2shttps://t.co/ry4VTtWhJ1 — vitalik.eth (@VitalikButerin) October 31, 2023\n\nThe Expanding EVM Rollup Ecosystem\n\nEVM rollups like Arbitrum, Optimism, Scroll, and more recently, Kakarot and Taiko have made major advancements in improving the security of their solutions through innovations in fraud proof mechanisms and zero-knowledge proofs.\n\nPolygon, originally an independent layer 1 blockchain, has also built its own EVM rollup called Polygon zkEVM to complement its existing sidechain solution.\n\nBy bringing rollup technology to their sidechains, projects like Polygon aim to provide an incremental path toward greater Ethereum interoperability and security.\n\nBeyond EVM Rollups\n\nIn addition to EVM rollups, “almost-EVMs” like zkSync allow Ethereum developers to reuse their skillsets while enabling advanced scaling capabilities through zk-SNARKs.\n\nStarknet has also emerged as a leading permissionless decentralized rollup using STARK proofs.\n\nOther creative solutions like Arbitrum Stylus and Fuel Labs build on top of Arbitrum and Starknet, respectively, to extend functionality.\n\nMotivations for Heterogeneity\n\nAccording to Buterin, there are several key reasons driving continued innovation and heterogeneity across layer 2 solutions:\n\nTransitioning Independent Chains\n\nSome projects currently operating as standalone layer 1s wish to integrate more deeply with Ethereum to benefit from its security and liquidity.\n\nHowever, these projects need time to transition gradually, as shifting entirely to a rollup now would hurt usability, but waiting too long risks missing the opportunity.\n\nPartial Decentralization\n\nCentralized applications exploring blockchain integration only require “halfway house” decentralization, not the full security guarantees of a rollup.\n\nTheir high throughput needs also make rollups impractical in the short term. Validiums and sidechains are better suited for these use cases today.\n\nVariable Security Requirements\n\nConsumer apps like social media and gaming need modularity to handle different security requirements. High-value activities warrant rollup security, while low-value actions can rely on lower guarantees.\n\nPaying for Security\n\nWhile Ethereum native users may tolerate rollup fees to improve security, non-blockchain users are accustomed to zero fees. Solutions like sidechains and validiums can offer a smoother onboarding experience in the near term.\n\nEvaluating Tradeoffs\n\nWhen assessing the tradeoffs between solutions offering varying degrees of decentralization and Ethereum interoperability, Buterin highlights two key considerations:\n\nEthereum’s native data availability is improving through innovations like proto-danksharding and data compression techniques. This expands the viability of highly secure rollup solutions over time.\n\nThe needs and sensitivities of specific use cases. Finance applications demand robust security guarantees. Consumer apps can better tolerate lower security and runaway fees.\n\nMeasuring Connectedness\n\nButerin notes two primary dimensions for evaluating a layer 2’s “connectedness” to Ethereum:\n\nWithdrawal Security\n\nThe guarantees allow users to withdraw assets issued on Ethereum back to the base layer. Rollups provide stronger assurances than validiums.\n\nReading Ethereum Data\n\nThe ability to read Ethereum state and sync revert actions Tighter coupling enables superior composability but requires more complex bridge logic.\n\nFor both dimensions, projects sit on a spectrum, ranging from loose integration to tight interleaving with Ethereum. There are merits to different approaches depending on the use case:\n\n“In many cases, starting with something looser today and moving to a tighter coupling over the next decade as technology improves may well be optimal.” Buterin concludes.\n\nThe layer 2 landscape is primed to continue diversifying as Ethereum gears up for native scaling improvements in sharding and rollup interoperability.\n\nWhile rollups are likely to serve as long-term solutions for decentralized finance and other security-critical applications, alternative layer 2 technologies will also proliferate in the coming years to meet the needs of gaming, social media, the Internet of Things, and more."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLWRhcHBzLWRlZW1lZC1ub3QtZGVjZW50cmFsaXplZC1hZnRlci13YWxsZXRjb25uZWN0LWJsb2Nrcy1ydXNzaWFuLXVzZXJzLWZyb20tdGhlLXByb3RvY29sLTIwMjMxMDMxMjAzM9IBogFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1kYXBwcy1kZWVtZWQtbm90LWRlY2VudHJhbGl6ZWQtYWZ0ZXItd2FsbGV0Y29ubmVjdC1ibG9ja3MtcnVzc2lhbi11c2Vycy1mcm9tLXRoZS1wcm90b2NvbC0yMDIzMTAzMTIwMzM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Ethereum dApps deemed “not-decentralized” after WalletConnect blocks Russian users from the protocol - FXStreet",
        "content": "Share:\n\nEthereum wallet and protocol communication protocol WalletConnect is facing heat for blocking users from Russia and Ukraine.\n\nThe protocol was criticized for defeating the purpose of blockchain and decentralization by controlling access to services.\n\nWalletConnect CEO Pedro Gomes cited legal and OFAC guidance as the reason behind the move.\n\nEthereum is called the home of decentralized finance (DeFi), owing to the vast array of protocols running on the chain, which amount to nearly 950. Thus, it does not come as a surprise when users react negatively to the supposed “decentralized” applications and decide to alter who can and cannot access their protocols.\n\nEthereum dApps: Not so decentralized\n\nEthereum is the base chain that supports the operation of the open-source protocol that enables the communication and interaction between a wallet and dApps. The protocol recently became the target of crypto enthusiasts after WalletConnect decided to take some measures.\n\nThe protocol over the past 24 hours blocked all users from Russia and some parts of Ukraine. People using the service were given an “error 1009 access denied” message. As this came to light, crypto users, as well as influencers, took to X, formerly Twitter, to express their anger over the app.\n\nPopular crypto researcher Chris Blec tweeted,\n\n“WalletConnect, an app that is deeply baked into the Ethereum DeFi ecosystem, is now blocking normal users in Ukraine, Russia, North Korea, Iran, Cuba, and Syria. They are punishing these people for the sins of their tyrannical governments. This is the state of Ethereum in 2023.\n\nThese claims can be verified by accessing the source code of the protocol since it is open-source, wherein it is evident that not just Russia and Ukraine but users from North Korea, Syria, Cuba and Iran are also facing similar issues.\n\nUsers even suggested that the fact that such an option exists is proof that the protocol is not truly decentralized. The point of being decentralized is so that no one authority or entity can control the actions of other participants, which has been evidently flouted by WalletConnect. Another user stated,\n\n“Seriously, I just lost my business forever. A custody interface platform ability to block usage by geo is not protection it is liability — this should not be engineered into their connect platform.\n\nWalletConnect supports over 75 top wallets on the blockchain, which makes this move rather significant, given about 6.76% of the entire traffic they receive comes from Russia, making it their third largest target country.\n\nWalletConnect traffic source\n\nWalletConnect blames regulation\n\nWalletConnect, upon being criticized for their decision, issued a statement on Twitter where they cited the latest legal and OFAC (Office of Foreign Assets Control) guidance. The Delaware-based protocol is facing the same problems as other crypto companies in the United States: lack of clear regulations.\n\nBack when Russia attacked Ukraine in February this year, the regulatory authorities in the US ensured sanctions on certain Russian oligarchs and blocked their access on Binance, Coinbase and other top exchanges to prevent them from selling their crypto holdings.\n\nThus, in the end, the blame goes back to the regulatory issue in the USA. WalletConnect CEO Pedro Gomes, in the statement, also said that while some Ukraine areas’ IP addresses were blocked initially, they have since been re-enabled. He also did not confirm the blocking of other countries mentioned in the GitHub source code, saying, “We can confirm that no other countries were blocked”."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLXByaWNlLWV0aGVyZXVtLXByZWRpY3Rpb24tY2FuLWZvbWMtbWVldGluZy1taW51dGVzLWJvb3N0LWNyeXB0b2N1cnJlbmN5LW1hcmtldC5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Price and Ethereum Prediction: Can FOMC Meeting Minutes Boost The Cryptocurrency Market? - Cryptonews",
        "content": "Bitcoin Price and Ethereum Prediction: Can FOMC Meeting Minutes Boost The Cryptocurrency Market?\n\nBitcoin, the world’s largest cryptocurrency, has failed to maintain its upward momentum and has fallen below $24,000 in the last 24 hours, dropping from its peak of $25,100 due to a significant reversal in the cryptocurrency market. Following Bitcoin’s lead, Ethereum has also seen a gradual decline in the past 24 hours.\n\nAs the cryptocurrency market continues to experience volatility, all eyes are on the Federal Open Market Committee (FOMC) meeting minutes scheduled to be released today. The outcome of this event is expected to have a significant impact on the market, particularly on Bitcoin and Ethereum prices.\n\nCryptocurrency Market Analysis: A Fundamental Outlook\n\nThe downward trend in the cryptocurrency market can be mainly attributed to the upcoming release of preliminary GDP data and PCE figures from the United States, which are expected to increase market volatility.\n\nStart of new week seeing a lot of negative delta, while price still holds above $24,000\n\n\n\nIf we were to drop, I would be looking at the imbalance marked below, but in the meantime we could see a squeeze higher#BTC pic.twitter.com/v6vle4v8VB — JW (@JW100x) February 22, 2023\n\nIn addition, the upcoming release of the Federal Reserve’s February meeting minutes is viewed as another factor causing investors to hesitate and contributing to Bitcoin’s losses. The central bank is expected to deliver a hawkish stance in the Fed minutes, which is keeping cryptocurrency gains in check.\n\nMost Asian currencies fell on Tuesday, while the dollar advanced against a basket of currencies as markets awaited more cues on U.S. monetary policy from the minutes of the Federal Reserve’s February meeting and more inflation data. pic.twitter.com/hlICzmpzpA — Parkmoneyfx (@parkmoneyfx) February 21, 2023\n\nMoreover, the previously released higher-than-expected US PMI has given the Fed additional economic headroom to hike interest rates, adding to the cautious sentiment in the crypto market.\n\nRisk-Off Wave in the Crypto Market: Eyes on Key US Data\n\nDespite the emergence of several positive regulations for the cryptocurrency market, the global cryptocurrency market has failed to sustain its upward trend and has turned negative for the day. This is likely due to cautious investor sentiment ahead of the Federal Reserve’s February meeting minutes, as investors await more clarity on US interest rates and the path of monetary policy.\n\nIn addition, the upcoming release of the Personal Consumption Expenditures Index is also expected to increase market volatility.\n\nBTC Daily Technical Outlook:$BTC closed bearish as the US stock indices declined sharply, one more bearish candle will make Bitcoin bearish for a couple of weeks. I’ll look for a trade tomorrow from its intraday volatility. The Crypto market will follow whatever Bitcoin does 🤔 pic.twitter.com/T5KByIG2SX — CRYPTOWZRD (@cryptoWZRD_) February 22, 2023\n\nIt’s worth noting that the Federal Reserve’s February meeting minutes, which are set to be released later today, are widely expected to echo the central bank’s hawkish tone.\n\nThis means that the rising interest rates will limit liquidity, which is not good for cryptocurrencies. Higher yields typically lead investors to withdraw their money from riskier investments.\n\nU.S. stocks ended higher after stronger-than-expected retail sales data offered evidence of a resilient economy, but gains were capped as investors worried about more interest rate hikes by the Federal Reserve https://t.co/e6F5Tf1aMS pic.twitter.com/Qh1ew6YYEv — Reuters (@Reuters) February 16, 2023\n\nThis week, all eyes are also on Thursday’s report of the Personal Consumption Expenditures Price Index, which is expected to reveal that inflation remained strong in January. This may provide further justification for the Fed to continue raising interest rates.\n\nDo rising interest rates affect consumption? An analysis examines the behavior of personal consumption expenditures during five episodes of monetary policy tightening since 1990 https://t.co/2llaKMAL8k pic.twitter.com/3ccWrXxSU8 — St. Louis Fed (@stlouisfed) February 20, 2023\n\nNew economic data released on Tuesday showed that US PMIs for February was better than expected, providing the Federal Reserve with more economic headroom to raise interest rates as it has indicated it wants to do soon.\n\nNew York State Department of Financial Services Enhances Capacity to Monitor Virtual Currency\n\nThe New York State Department of Financial Services (NYDFS) has announced that it has enhanced its ability to detect illicit activity related to virtual currency within the entities it regulates. The agency stated that these upgrades are a part of its ongoing efforts to remain competitive in the industry and be proactive in addressing issues related to virtual currencies.\n\nhttps://www.twitter.com/dumbwire/status/1628161667887681537?s=20\n\nThe recent improvements made by the New York State Department of Financial Services (NYDFS) to detect unlawful activity involving virtual currency among the organizations it supervises are seen as a positive development for the cryptocurrency market.\n\nThe NYDFS is proactively taking steps to stay competitive and keep up with the evolving landscape of virtual currencies. The department recently announced additional capabilities to detect potential insider trading, market manipulation, and front-running activity associated with Department-regulated entities’ and applicants’ exposure or potential exposure to listed virtual currency wallet addresses.\n\nThis move is expected to aid in the expansion of cryptocurrencies. The NYDFS made the announcement on February 21 but did not provide any details about the “new insider trading and market manipulation risk monitoring tools.”\n\nLet’s examine the technical aspect of the market.\n\nBitcoin Price\n\nLooking at the technical analysis of BTC/USD, the pair has broken a crucial support level of $24,500 and has begun to decline toward $23,900. However, the double bottom pattern has transformed this level into a significant support level for Bitcoin.\n\nIn the 2-hour timeframe, an ascending triangle pattern has formed with an upward trendline providing support near $24,000. If Bitcoin falls below this level, the next support level will be around $23,400. The RSI and MACD indicators are in the selling zone, which is adding selling pressure to Bitcoin.\n\nBitcoin Price Chart – Source: Tradingview\n\nBitcoin’s immediate resistance is at $24,500, and a rise in buying pressure could lead to a breakout above this level, exposing BTC to the next resistance level at $25,200.\n\nInvestors are keeping a close eye on the FOMC meeting minutes, which will be released today at 7:00 PM (GMT). This event is expected to impact future trends in the financial markets, making it crucial to remain focused.\n\nBuy BTC Now\n\nEthereum Price\n\nThe ETH/USD pair has broken below its choppy range of $1,675 to $1,725 and is currently showing a downward trend. Ethereum’s next support level is expected to be around the 38.2% Fibonacci retracement level of $1,630.\n\nIf the downward momentum continues and there is a bearish breakout below the 38.2% Fibonacci retracement level, the downtrend could extend toward the $1,600 or $1,565 levels.\n\nEthereum Price Chart – Source: Tradingview\n\nIf the ETH/USD pair can maintain above the $1,630 level, it may lead to a potential price rebound toward the $1,675 or $1,740 level.\n\nBuy ETH Now\n\nBitcoin and Ethereum Alternatives\n\nApart from Bitcoin (BTC) and Ethereum (ETH), there are many other altcoins in the cryptocurrency market that are worth watching. To help investors stay up-to-date, the CryptoNews Industry Talk team has conducted an analysis and compiled a list of the top 15 cryptocurrencies to keep an eye on in 2023.\n\nThis list is regularly updated with new altcoins and ICO projects, so it is recommended to check back often for the latest additions.\n\nDisclaimer: The Industry Talk section features insights by crypto industry players and is not a part of the editorial content of Cryptonews.com.\n\nFind The Best Price to Buy/Sell Cryptocurrency"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtYnVsbHMtdXBob2xkLTE4MDAtc3VwcG9ydC1icmVha291dC1hYm92ZS0yay1hcHByb2FjaGluZy_SAW5odHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWJ1bGxzLXVwaG9sZC0xODAwLXN1cHBvcnQtYnJlYWtvdXQtYWJvdmUtMmstYXBwcm9hY2hpbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "ETH Price | Ethereum Price Prediction: ETH Regains Ground Above $1,800 - CoinGape",
        "content": "Ethereum (ETH) price has over the last few days, affirming the ongoing bullish grip with higher support above $1,800. Most investors have a long-term outlook for Ethereum, with many of them booking positions ahead of the next bull market.\n\nMeanwhile, corrections have significantly reduced, elevating October as one of the most bullish months. If traders focus on holding their long positions intact, Ethereum price is bound to quickly close the gap to $2,000 with the possibility of the second recovery phase following suit to $3,000.\n\nadvertisement\n\nWhen Is Ethereum Price Expected To Hit $2,000\n\nAccording to the Moving Average Convergence Divergence (MACD) indicator, ETH’s uptrend is far from over. Possibly, bulls are just starting their field day. Traders began paying more attention to Ethereum longs after the blue MACD line flipped above the red signal line, sending a vivid buy signal on October 20.\n\nIf these long positions remain open while more traders seek exposure to ETH, the climb to $2,000 would be a matter of when and not if.\n\nThe 21-day Exponential Moving Average (EMA) also upholds the bullish outlook as it crosses above the signal line, forming a golden cross pattern. A golden cross is a bullish pattern whose appearance assures traders that the path with the least resistance is to the upside.\n\nUp 8% in the last seven days, Ethereum price is trading at $1,816 on Monday during the US business hours. The uptrend will go a long way if bulls keep the immediate support at $1,815 intact.\n\nHowever, not all will be lost in case of a brief pullback—one that would sweep through liquidity preferably at $1,800 to build the necessary momentum for the next run-up to $2,000.\n\nInvestors feeling already sidelined by the bullish trend in October are likely to appreciate the correction, as it would offer them a chance to buy Ethereum at a lower price point while anticipating a bigger breakout beyond $2,000.\n\nIn the event, that the pullback to seek volatility causes fear among traders and investors and they start to sell to lock in the gains, the 200-day EMA (purple) would be in line to absorb the selling pressure at $1,714. Further losses would seek refuge at $1,680, a support area marginally below both the 21-day EMA and the 100-day EMA.\n\nStaked Ether Rises To A Quater of The Total Supply\n\nThe decentralized finance (DeFi) sector in the Ethereum ecosystem has been growing at a commendable rate, thanks to the protocol’s transition from the proof-of-work (PoW) consensus algorithm to a proof-of-stake (PoW) mechanism.\n\nDefi Llama shows that of the $42 billion of the total value locked (TVL) in DeFi systems, $22.8 billion is accounted for by Ethereum.\n\nIn October alone, ETH TVL’s balance has grown by $3 billion from $19.8 billion. This increase can be attributed to the trend reversal that has seen Ethereum price rally from $1,522 to $1,816 and the long-term view investors have for Ethereum.\n\nBlockchain data from IntoTheBlock and shared by @KriptoBaykusV2 on Twitter (now X), shows that staked Ether has continued to grow in 2023 such that it accounts for at least a quarter of the the network’s total supply.\n\n$ETH arzının neredeyse dörtte biri şu anda stake ediliyor. Ocak 2023 de bu oran %14'tü. Güçlü bir artış var ve yavaşlayacak gibi de görünmüyor. #ETH boğada nereye gider acaba?#btc #Bitcoin Kaynak: @intotheblock – https://t.co/typanDsG8o pic.twitter.com/cuPddc7YE9 — Baykuş (@KriptoBaykusV2) October 27, 2023\n\nSo far, almost 28 million ETH has been staked in various smart contracts. Liquid staking protocols like Lido and Rocket Pool account for the highest number of staked Ether but platforms like Maker, AAVE, and Uniswap are also very competitive.\n\nRelated Articles"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMTAvMzEvc2V2ZXJhbC1sMXMtd2FudHMtdG8tam9pbi1ldGhlcmV1bS1iZWNvbWUtbDItdml0YWxpay1idXRlcmluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Several L1s Wants To Join Ethereum & Become L2: Vitalik Buterin - Crypto Times",
        "content": "Ethereum co-founder, Vitalik Buterin has shared a latest blogpost expressing his views on layer 2 chains that are joining Ethereum.\n\nButerin notes that the layer2 (L2) ecosystem is expanding rapidly over the last year with several teams building solutions using roll-up and EMV-compatibility tech. As the L2 projects are growing, Buterin expects this trend to continue further as he sees some layer1 projects are “seeking to come closer to the Ethereum ecosystem.”\n\nDifferent types of layer 2shttps://t.co/ry4VTtWhJ1 — vitalik.eth (@VitalikButerin) October 31, 2023\n\nThe upsurge in L2s is also pushed forward by centralized projects that are exploring blockchain applications to provide more privacy as well as some non-financial applications such as gaming and social protocols which need decentralization, buterin said.\n\nButerin stated that, “applications and users that are on the Ethereum layer 1 today will be fine paying smaller but still visible rollup fees in the short term..” adding “it’s easier to justify paying $0.10 if you were paying $1 before than if you were paying $0 before.”\n\nThe Ethereum co-founder further explained the difference and scope of Rollups and Validiums which most of the layer2 projects uses. He has compared both these L2 tech-stacks to layer1 chains (Disconnected).\n\nRollup vs Validium vs Disconnected (L1s) – Vitalik.eth\n\nHe also mentioned a different method for layer2 to read data from Ethereum which includes reverting data and information. “Applications can build on top of this to implement functionality such as depositing and withdrawing tokens,” he said."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY3J5cHRvZGFpbHkuY28udWsvMjAyMy8xMC9iaXRjb2luLWJ0Yy1ldGhlcmV1bS1ldGgtYW5kLXNvbGFuYS1zb2wtcmVhZHktdG8tZXhwbG9kZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC), Ethereum (ETH), and Solana (SOL), ready to explode - CryptoDaily",
        "content": "Table of Contents\n\nSome analysts are defiant in their belief that crypto can’t continue to go up while stocks are down. It would appear that Bitcoin, Ethereum, and Solana, have other ideas.\n\nAs wars rage, bond markets are teetering, banks are on the brink, and equities are falling, the crypto market is staging a recovery, and not any old dead cat bounce, but what might be turning into a full blown bull market.\n\nBitcoin ready to break bullish pennant\n\nBitcoin leads the way, as is its due. Up 112% for the year so far, the alpha cryptocurrency is not showing any signs of faltering. Currently inside of a bull pennant that has continued to lengthen, the bitcoin price looks ripe for a further explosion to the upside.\n\nSource: Trading View\n\nA measured move for the flag could take bitcoin to over $40,000, and with approval for the Spot Bitcoin ETF perhaps coming within days, and weeks at most, the future for bitcoin does look bright.\n\nEthereum waking up at last\n\nJust like bitcoin, ethereum has had its obstacles to overcome. It has lagged the king of the cryptocurrencies thus far, in that it is only just managing to consolidate above its 200-day moving average.\n\nSource: Trading View\n\nHowever, now it is above this extremely important indicator, a flag is forming from which price could be catapulted higher. The $ETH measured move here would likely be to over $2,150.\n\nSolana outperforms them all\n\nThe talk in technical crypto circles right now is on Solana’s game-changing Firedancer which is set to enhance scalability and processing times to levels practically unheard of until now. According to analysts, latency times can be reduced to milliseconds - the same as is achieved on the world’s major stock exchanges. An analyst quoted from a Messari report when he stated:\n\n\"They talk about how Firedancer puts Solana in the range of CEX latency times... And they go on and talk about things like security and expenses and processing times and, again, latency, which is so important,\"\n\nWith this kind of news in the forefront for Solana, the price of $SOL is being driven strongly. 335% up on the year, $SOL is emerging as one of the major catalysts for the crypto bull market.\n\nSource: Trading View\n\nAn upward sloping channel is guiding the price higher, and although this is usually a bearish chart pattern, if the price is forced out of the top of the channel, it would become very bullish for $SOL indeed.\n\nDisclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNpdHlhbS5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0tcHJpY2VzLWxpZnQtb24tZXRmLWhvcGVzLXdoaWxlLWpwbS1jb2lucy1kYWlseS10cmFuc2FjdGlvbnMtZXhjZWVkLTEtYmlsbGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum prices lift on ETF hopes while JPM coin's daily transactions exceed $1 billion - CityAM - City A.M.",
        "content": "Bitcoin and Ethereum prices lift on ETF hopes while JPM coin’s daily transactions exceed $1 billion\n\nData from CryptoCompare shows that the price of the flagship cryptocurrency, Bitcoin (BTC) surged at the beginning of the past week, moving from around $30,600 to over $34,500 and has since shifted sideways to now remain at that level.\n\nEthereum’s Ether, the second-largest digital asset by market capitalisation, moved in a similar way, starting the week off at around $1,650 and jumping to a $1,850 high before enduring a small correction to now trade at $1,815.\n\nThe prices of most digital assets surged over the week after it was revealed that BlackRock’s proposed iShares spot Bitcoin exchange-traded fund (ETF) had been listed on the Depository Trust & Clearing Corporation (DTCC), which provides post-trading clearing, settlement, custody, and information services for Nasdaq.\n\nIt was revealed shortly after, however, that the ETF had been listed on the DTCC’s website since August. The move was nevertheless interpreted as a signal that the ETF could get approved by the US Securities and Exchange Commission (SEC) in the near future, boosting prices, to the point that BTC reached $35,919 on OKX.\n\nAs a result Bitcoin short sellers lost nearly $180 million over 24 hours, showing how strong demand for a spot Bitcoin ETF in the US appears to be. Backing that up, a recent report from crypto forensics firm Chainalysis revealed that the largest market in the cryptocurrency world is North America, with an estimated transaction volume of $1.2 trillion between July 2022 and June 2023.\n\nPer the report, North America’s crypto transactions account for 24.4% of the total and are driven by institutional activity, with large transactions of over $1 million or more making up 76.9% of its total volume. Decentralised finance and centralized exchange, the report notes, share the region’s on-chain activity.\n\nElliptic debunks claims of Hamas raising millions in crypto\n\nBlockchain forensics firm Elliptic has over the week clarified that the numbers that are being used to show how much crypto Hamas has raised aren’t correct, noting there’s little evidence showing terrorist groups are using digital assets effectively.\n\nElliptic said that Hamas started asking for Bitcoin donations in 2019, but stopped all public crypto fundraising in April. It said that Hamas was worried about the safety of donors using crypto. Per Ellitpic, only about $21,000 in crypto donations were sent to Hamas following its attack on Israel on October 7.\n\nThe possible use of cryptocurrencies by terrorist organisations gained attention earlier this month after the Wall Street Journal reported, using Elliptic data, that Hamas and other militant groups raised millions in crypto before launching its attack on Israel. The report was cited by more than 100 US lawmakers.\n\nElliptic clarified that there’s no evidence suggesting “that crypto fundraising has raised anything close to this amount, and data provided by Elliptic and others has been misinterpreted.\n\nChainalysis has itself in a separate report that claims of millions of dollars in crypto being moved to fund Hamas’ operations are likely to be “overstated”.\n\nJPMorgan moves more than $1 billion daily with its JPM coin\n\nJPM Coin, the digital asset launched by JPMorgan in 2020, is being used for over $1 billion in daily transactions, according to the company’s global head of payments, Takis Georgakopoulos.\n\nGeorgakopoulos said that current payment systems are slow, especially for cross-border transactions. He also said that they separate money and information, which makes tracking and reconciling transactions difficult, and reduces the fungibility of money.\n\nMeanwhile, Charles III, King of the United Kingdom and the 14 other Commonwealth realms, has approved a bill that will help law enforcement agencies confiscate and freeze cryptocurrency that has been used for crime.\n\nIn the US, Nasdaq-listed cryptocurrency exchange Coinbase has argued that the Securities and Exchange Commission has overstepped its authority when it classified cryptocurrencies it listed as securities.\n\nCoinbase said in a recent court document that it wants to end the SEC’s lawsuit against it. In it, the firm claimed the regulator’s definition of a security was too broad and disputed that the cryptocurrencies the exchange offers were not within the SEC’s authority.\n\nOver in Europe, Binance announced it will end its Visa debit card services in the European Economic Area (EEA) on December 20 over a decision from the card issuer, Contis Financial System.\n\nFrancisco Memoria is a content creator at CryptoCompare who’s in love with technology and focuses on helping people see the value digital currencies have. His work has been published in numerous reputable industry publications. Francisco holds various cryptocurrencies.\n\nFeatured image via Unsplash."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0by1wcmljZS10b2RheS1vY3RvYmVyLTMxLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLXJ1bmUtcm5kci1hYnAtbGl2ZS10di0xNjM5Mzk10gGqAWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vY3J5cHRvLXByaWNlLXRvZGF5LW9jdG9iZXItMzEtY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tcnVuZS1ybmRyLWFicC1saXZlLXR2LTE2MzkzOTUvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Stable As Ethereum Eyes $1,800 - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, managed to hold on to the $34,000 mark early Tuesday, as the overall market’s Fear & Greed Index stood at 72 (greed) as per CoinMarketCap. Ethereum (ETH), on the other hand, is steadily eyeing the $1,800 mark. Popular altcoins — including the likes of Dogecoin (DOGE), Ripple (XRP), Solana (SOL), and Litecoin (LTC) — saw minor jumps across the board. THORChain (RUNE) went on to become the top gainer, with a 24-hour jump of over 14 percent. Render (RNDR), on the other hand, became the biggest loser with a 24-hour dip of over 4 percent.\n\nThe global crypto market cap stood at $1.27 trillion at the time of writing, registering a 24-hour gain of 0.35 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $34,259.87, registering a 24-hour dip of 0.19 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 29.60 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $1,799.78, marking a 24-hour jump of 0.78 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.54 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour gain of 0.65 percent, as per CoinMarketCap data, currently priced at $0.06922. As per WazirX, Dogecoin price in India stood at Rs 6.03.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.88 percent. At the time of writing, it was trading at $68.94. LTC price in India stood at Rs 5,905.01.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5758, seeing a 24-hour jump of 3.92 percent. As per WazirX, Ripple price stood at Rs 49.60.\n\nSolana (SOL) Price Today\n\nSolana price stood at $35.70, marking a 24-hour gain of 9.44 percent. As per WazirX, SOL price in India stood at Rs 2,950.\n\nTop Crypto Gainers Today (October 31)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nTHORChain (RUNE)\n\nPrice: $2.79\n\n24-hour gain: 14.18 percent\n\nBitTorrent(NEW) (BTT)\n\nPrice: $0.0000005062\n\n24-hour gain: 13.37 percent\n\nSolana (SOL)\n\nPrice: $35.78\n\n24-hour gain: 9.27 percent\n\nArweave (AR)\n\nPrice: $5.69\n\n24-hour gain: 9.01 percent\n\nCosmos (ATOM)\n\nPrice: $7.85\n\n24-hour gain: 7.60 percent\n\nTop Crypto Losers Today (October 31)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nRender (RNDR)\n\nPrice: $2.46\n\n24-hour loss: 4.31 percent\n\nAxie Infinity (AXS)\n\nPrice: $5.60\n\n24-hour loss: 3.97 percent\n\nInjective (INJ)\n\nPrice: $13.53\n\n24-hour loss: 3.91 percent\n\nNeo (NEO)\n\nPrice: $8.96\n\n24-hour loss: 2.89 percent\n\nWOO Network (WOO)\n\nPrice: $0.2197\n\n24-hour loss: 2.71 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Over the last 24 hours, Bitcoin has been trading around the $34,300 level as market participants await the US Federal Reserve's forthcoming decision on interest rates to be announced on Wednesday. To sustain its bullish momentum, Bitcoin will need to surpass the $34,700 resistance level, failing which it may find support near $34,000. Interestingly, today marks the 15th anniversary of the Bitcoin whitepaper's release, a milestone that coincides with Bitcoin's remarkable 108 percent price increase since the commencement of 2023. Ethereum, on the other hand, has been trading around $1800.”\n\nParth Chaturvedi, Investments Lead, CoinSwitch Ventures, said, “The crypto market has slightly pushed up in the last 24 hours, with global crypto M.Cap. rising by 0.5 percent to continue being above $1.3 trillion. The top 40 cryptos by M.Cap. seem to be in the green. BTC (+0.2 percent) seems to be consolidating within a short range of $34,000-$34,800. However, given its recent price rally, short-term BTC holders (less than 155 days) are participating in one of the strongest profit-taking events in the past couple of years. Considering the macro conditions unfolding, investors are hopeful to see a bullish trend take over.”\n\nRajagopal Menon, Vice President, WazirX, said, “Meme coins, notably PepeCoin, have witnessed impressive gains, doubling in value. Bitcoin, the pioneering crypto, also remains at the forefront of attention by trading near the $35,000 mark. On the other hand, Ethereum has also started its week by crossing the $1.8k mark and is maintaining its streak. This recent surge is partly attributed to growing optimism about SEC approval for the first U.S. Bitcoin ETF, potentially sparking a crypto influx.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “In October, Bitcoin's remarkable 30 percent rise raised expectations of a long-awaited bull market in 2023. The crypto market, which held at $34,000 over the weekend, showed signs of investor greed with a Fear & Greed Index score of 72. The global crypto market capitalization reached 1, $26 trillion, up 0.85 percent in 24 hours, as positive sentiment and rising institutional interest played a pivotal role. This optimism revolves around the potential approval of the Bitcoin Spot ETF in the United States, further strengthened by the ProShares Bitcoin Strategy ETF (BITO) and significant trading activity in the Grayscale Bitcoin Trust (GBTC). Institutional interest in Bitcoin is growing, with Bitcoin-focused products accounting for 73.3 percent of the market and $23.2 billion in assets under management.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The renewed interest in digital assets fuelled by growing number of Bitcoin ETF applications is pumping fresh capital in the digital asset market. The high possibility of Bitcoin ETF approval in the US is attracting interest from traders across the board and FOMO-driven trading is picking up pace. The open interest on Bitcoin options breached the at over $17 billion mark (as per glassnode data), exceeding the previous peak recorded during the 2021 bull run. BTC is sitting comfortably at $34,000 level while ETH is changing hands at around $1,800 mark at the time of writing.”\n\nCoinDCX Research Team told ABP Live, “In the last 24 hours, BTC has maintained its position above $34,000 mark, with ETH steadily trading at $1,800. From a technical perspective, as long as BTC remains above approximately $31,000, the market sentiment retains a bullish tone. Notably, crypto funds experienced their most substantial weekly inflow since July 2022, attracting over $326 million, as indicated by CoinShares data. Bitcoin-based funds took the lion's share, securing 90 percent of the total inflow, which amounted to $296 million.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lnplbmdlci5uZXdzLzIwMjMvMTAvMzAvY3J5cHRvLWFuYWx5c3QtYWxpLW1hcnRpbmV6LXNoYXJlcy1pbnNpZ2h0cy1vbi1iaXRjb2luLWFuZC1ldGhlcmV1bS10cmFqZWN0b3JpZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Crypto Analyst Ali Martinez Shares Insights On Bitcoin And Ethereum Trajectories - Zenger.News",
        "content": "As the crypto market continues to evolve, prominent figures in the industry are sharing their insights on the potential paths of significant cryptocurrencies.\n\nLast Thursday, crypto analyst Ali Martinez shared his view on the trajectories of Bitcoin (CRYPTO: BTC) and Ethereum (CRYPTO: ETH), shedding light on potential bullish trends and challenges ahead.\n\nAccording to Martinez, BTC is gearing up for an upward trend. However, he anticipates a temporary dip, possibly to the $33,000 range, before this bullish breakout.\n\nAs the crypto market continues to evolve, prominent figures in the industry are sharing their insights on the potential paths of significant cryptocurrencies. PHOTO BY KANCHANARA/UNSPLASH\n\nMartinez shared on X, “Bitcoin looks like it wants to pull back before advancing higher! BTC appears to have formed an ascending triangle on the hourly chart. As BTC trades below the hypotenuse, the odds increase for a 5% correction toward $33,000.”\n\n#Bitcoin looks like it wants to pull back before advancing higher!$BTC appears to have formed an ascending triangle on the hourly chart. As #BTC trades below the hypotenuse, the odds increase for a 5% correction toward $33,000. You can try this trading strategy at @bytradeio.… pic.twitter.com/IOPjq61oEq — Ali (@ali_charts) October 26, 2023\n\nReflecting on Bitcoin’s historical performance, Martinez suggested that the current cycle might peak around October 2025.\n\nHe wrote on the platform, “Examining the past two cycles from the market bottom and the present Bitcoin trend suggests it’s still a good time to buy BTC. A similar trajectory points to the next BTC market top around October 2025. We still got two exciting years ahead.”\n\nAt the time of writing, Bitcoin was trading at $34,331.51, up by about 15 percent in the last seven days.\n\nSpeaking about Ethereum, Martinez cited data from crypto analytics firm IntoTheBlock. He highlighted a potential resistance for Ethereum at the $1,960 level, which was termed as a “supply wall.”\n\n“Wen Ethereum break out? Well, you may need to wait for ETH to overcome the huge supply wall at $1,960. Here, 1.14 million addresses bought nearly 33 million ETH, according to IntoTheBlock,” he said.\n\nWen #Ethereum break out? Well, you may need to wait for $ETH to overcome the huge supply wall at $1,960. Here, 1.14 million addresses bought nearly 33 million #ETH, according to @intotheblock. pic.twitter.com/B2noPQbJPc — Ali (@ali_charts) October 26, 2023ealm.\n\nProduced in association with Benzinga"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbmpvdXJuYWwubmV0L25ld3MvZXZlcmxvZGdlLW9uLXRoZS1yaXNlLWNhbi1pdC1tYXRjaC1iaXRjb2luLWFuZC1ldGhlcmV1bXMtZ3Jvd3RoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Everlodge on the rise: can it match Bitcoin and Ethereum's growth? - CoinJournal",
        "content": "In the rapidly evolving realm of cryptocurrencies, a new player is making waves: Everlodge (ELDG). This burgeoning contender is in its presale phase, yet showing potential to challenge the dominance of established giants like Bitcoin (BTC) and Ethereum (ETH).\n\nThis article delves into Everlodge’s remarkable ascent, exploring whether it has what it takes to rival the market leaders’ supremacy.\n\nEverlodge’s innovative approach to luxury investment\n\nEverlodge is setting a new trend in the luxury real estate arena, making it possible for the average person to hold stakes in luxurious vacation properties starting at just $100. By leveraging the power of NFTs, each representing a share of a property, they are dismantling the longstanding barriers to elite real estate ventures.\n\nAll necessary legal and ownership details are carefully encrypted into the metadata of a strong smart contract. The resulting digital tokens are then segmented to allow interested investors to participate in prime real estate opportunities without spending a fortune.\n\nBut there’s more. Everlodge isn’t just a marketplace; it doubles as a launchpad for budding property developers. They can tap into the community, sourcing funds for their ambitious projects. It’s a symbiotic setup – developers get the required capital, and users get a shot at lucrative early-bird opportunities.\n\nELDG is the primary currency in the Everlodge world. It serves as the platform’s heartbeat. Holding onto ELDG tokens offers a range of benefits, such as trading discounts and reduced maintenance charges. Token staking provides an opportunity to earn a consistent monthly yield, enabling passive income.\n\nThe buzz is real. Currently, ELDG tokens are up for grabs at just $0.23 each in the sixth phase of the presale. This rate isn’t here to stay, as it is set to keep rising as more people jump on board.\n\nOnce the presale ends, ELDG will debut in tier-one exchanges, potentially catapulting its value. Market whispers hint at a colossal 30x surge post the token’s debut on leading exchanges.\n\nFor more information about the Everlodge (ELDG) Presale you can visit their website or join their community here.\n\nEvaluating recent Bitcoin (BTC) price movements\n\nBitcoin’s journey has been nothing short of a rollercoaster lately. After a promising kick-off to the year, the cryptocurrency took a surprising dip in mid-August, plummeting from $30k to a worrying sub-$25k. The price has since rebounded to the current price of $26.3K.\n\nSo, what’s causing Bitcoin’s fall from grace? The prevailing sentiment is a thirst for fresh liquidity in the Bitcoin market. The buzz surrounding a potential Blackrock ETF did give Bitcoin a short-lived 20% boost, but the uncertainty around the SEC’s verdict has left the market in a lull.\n\nAll eyes are now on the anticipated Bitcoin halving in 2024. Historically, such events have revitalized Bitcoin’s momentum, but the crypto realm remains inherently unpredictable. The consensus is growing that Bitcoin’s resurgence is tied to the approval of the Blackrock Bitcoin ETF.\n\nWith whispers suggesting that an ETF decision might be pushed to 2024, several Bitcoin enthusiasts are exploring other opportunities. Many are gravitating toward the Everlodge presale, eager to secure tokens while they’re still affordable.\n\nEthereum (ETH): price resistances and network activities\n\nEthereum remains a powerhouse within the DeFi arena, boasting an impressive Total Value Locked (TVL) that exceeds $20 billion across various platforms. Its foundational crypto role and robust developer resources underscore its sustained relevance.\n\nThe allure of Ethereum isn’t limited to individual investors; institutional powerhouses are increasingly swayed by its capabilities, especially in the realm of smart contract development.\n\nA buzz surrounds the potential unveiling of an Ethereum-centric ETF by Blackrock, which, if realized, would catapult Ethereum into the portfolios of a broader spectrum of investors, promising significant growth.\n\nHowever, price-wise, Ethereum is wrestling with challenges. The resistance level within the $2,000 to $2,100 bracket has proven formidable. A recent slip saw Ethereum’s price spiralling downwards by 15% in just one day.\n\nCoupled with this price dip, a drop in network activity and fears of substantial sell-offs have shadowed uncertainty over Ethereum’s trajectory. This sentiment is underscored by a staggering 50% drop in Ethereum’s TVL since its 2023 peak of $32 billion in April.\n\nAmidst this backdrop, Ethereum holders are looking over their shoulders at Everlodge, a nascent blockchain project whose potential challenges Ethereum’s dominance. While Ethereum competes in a highly competitive atmosphere with other layer-1 platforms, Everlodge offers a unique product in the $280 trillion real estate market."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vdHJvbi10cngtb3V0c2hpbmVzLWV0aGVyZXVtLWFzLWFsdGNvaW5zLXN1cmdlLXNvdXRoLWtvcmVhbi1pbnZlc3RvcnMtZW1icmFjZS1jcnlwdG9jdXJyZW5jeS1jcmF6ZS_SAYoBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3Ryb24tdHJ4LW91dHNoaW5lcy1ldGhlcmV1bS1hcy1hbHRjb2lucy1zdXJnZS1zb3V0aC1rb3JlYW4taW52ZXN0b3JzLWVtYnJhY2UtY3J5cHRvY3VycmVuY3ktY3JhemUvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "TRON (TRX) Outshines Ethereum as Altcoins Surge, South Korean Investors Embrace Cryptocurrency Craze - Crypto News Flash",
        "content": "Tron (TRX) continues to outperform competitor altcoins as global demand for altcoins surge significantly.\n\nSouth Korean investor’s shift focus from Bitcoin to alternative digital assets, according to new reports.\n\nAltcoin season might be just around the corner, according to leading market players, and the Tron (TRX) token is unseating its competitors. Altcoin bulls are preparing for the new month, as they continue to collectively clear weekly and monthly losses. The market has seen a notable switch in positions as altcoins move from the red zone to the green zone.\n\nAssets like Tron (TRX) are unseating their competitors as they take in gains. Holding the position as the 10th most valuable cryptocurrency by market cap, Tron (TRX) has outperformed Toncoin (TON), its closest competitor.\n\nAt the time of this report, Tron (TRX) is trading for $0.09508. Although the Toncoin (TON) trades at $2, TRX has surpassed the asset in weekly and monthly gains. The TRX token has increased more than 11% over the last week. TRX bulls have also sustained hourly gains of more than 4%, while TON continues to take a downward trajectory.\n\nSimilarly, TRX is attempting to go head-to-head with Ethereum (ETH), another leading altcoin. While Ether’s weekly gains have surpassed that of Tron, Ether is still struggling to sustain momentum in the green zone, as weekly losses pile up.\n\nSouth Korean investors favor altcoins over Bitcoin\n\nIt is worth noting that the current upsurge in altcoins can be traced to fundamental factors. Notably, recent research revealed that South Korean cryptocurrency traders are focusing their attention on altcoins. While the apex cryptocurrency Bitcoin, has been the centre of attention for most of the year altcoins are gaining massive adoption at a global scale.\n\nAccording to a report from DeSpread Research, crypto investors in South Korea increased to 6 million this year. In a Korea Financial Intelligence Unit (KoFIU) survey, the report, was disclosed that the majority of these investors are mainly engaged in investment activities centered around centralized exchanges. As such, the influence of centralized exchanges in the Korean crypto market has become even more significant.\n\n“Korean exchanges had an explosive reaction to news related to Ripple. The trading volume of the four major Korean exchanges, which recorded $27 billion in June, increased to $37 billion in July, a 37% increase from the previous month,” DeSpread wrote in the report.\n\nOn the other hand, as centralized exchanges lose their appeal globally, local exchanges like Upbit record an upsurge in the demand for altcoins.\n\n“The majority of individual investors on Upbit show strong interest in altcoins with high-profit potential and tend to accept the associated high risks. This is considered one of the reasons for the high proportion of altcoin trading in the Korean market.” The report added.\n\n."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMTAvMzEvY3J5cHRvY3VycmVuY2llcy1zb2xhbmEtb3V0cGVyZm9ybS1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Cryptocurrencies: Solana Could Outperform Ethereum - The Cryptonomist",
        "content": "A recent cryptocurrency report published by VanEck claims that the performance of SOL, Solana’s native cryptocurrency, could outperform ETH (Ethereum) in the coming years.\n\nHowever, this is not a precise prediction, but rather assumptions about more or less good scenarios within which the price could move.\n\nVanEck’s proposed scenarios for the Ethereum and Solana cryptocurrencies\n\nVanEck’s predictions relate to the performance of the SOL price over the next ten years.\n\nThey are therefore low-probability forecasts, consisting of an extremely wide range of possibilities.\n\nThe current price of Solana’s native cryptocurrency is around $36, having also fallen below $10 in December last year.\n\nThe worst-case scenario suggested by VanEck is that the price will fall below $10 in the next few years (9.8).\n\nHowever, as this is one of the two extremes of a very wide range, it should only be taken as a reference point.\n\nIn fact, the best case scenario would be to exceed $3,200, i.e. an increase of 10,000% from current levels.\n\nTaking an intermediate figure, we can say that VanEck sees the possibility of the SOL price rising above $1,500, but with a good chance of ending up well above or well below this figure.\n\nSolana’s past\n\nIt should be noted that SOL debuted on the crypto markets in 2020 at under $0.6 and peaked at over $260 in November 2021. So from the time of its listing to its all-time high, the gains were over 40,000%.\n\nTypically, these incredible performances are very difficult to repeat, so a +10,000% from current values seems unlikely, although theoretically possible.\n\nHowever, taking the highs from $260 to $3,200 as a reference, the gain would be +1.100%, which is not at all absurd in the crypto markets in the long term.\n\nMoreover, the price of SOL seems to be well suited to the inflation of real speculative bubbles, such as the 2021 one. Suffice it to say that in July 2021, after the first big spike in early 2021, the price was below $30 and in less than four months it went up an incredible +1,000%. Within the next seven months, it went back to where it started, with the speculative bubble having completely deflated by then.\n\nThe starting price of $0.6 is probably of little use and not worth using as a reference point. Perhaps a better reference point would be the $9.8 reached in December 2020, which is probably not coincidentally the bottom identified by VanEck.\n\nThe other reference point could be $30, as the price of Solana has indeed been hovering around this level since June 2022, if we exclude the bracket below $10 opened by the FTX bankruptcy in November 2022 and closed already in January 2023.\n\nThe Solana boom\n\nIn fact, VanEck is predicting a real boom in the use of SOL.\n\nAccording to the report published yesterday, Solana could become the first blockchain to host an application with more than 100 million users. This hypothetical achievement would be a tipping point for the adoption and value of SOL, leading to a huge increase in value.\n\nAnother hypothesis is that Solana could reach a market share of just under half that of Ethereum, partly because it proposes a different model.\n\nWhile Ethereum relies heavily on decentralisation and community governance, Solana has a more pragmatic approach dedicated to scalability and speed, which could end up attracting a different type of user and developer less interested in decentralisation.\n\nCryptocurrencies: the comparison between Ethereum and Solana\n\nVanEck’s idea is therefore not a direct competition between Solana and Ethereum, but rather a different approach aimed at different types of users.\n\nComparisons can only be made on price changes over time, while on a practical level these two things would not be directly comparable.\n\nOn the other hand, the price of ETH has already experienced two huge bull runs, the one in 2017 that took it from $10 to $1,200, and then the one in 2021 that took it from $600 to almost $4,900.\n\nAt this point, it is possible to imagine that the price of SOL could also go through another similar bull run, although it should be noted that, using historical highs as a reference, Ethereum’s second bull run resulted in a x4 from the previous highs.\n\nShould the next bull run also lead to a x4 in the SOL price, the new high could be around $1,000.\n\nFinally, it should be mentioned that VanEck also offers an ETN on the SOL among its derivatives products."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiK2h0dHBzOi8vd3d3LmJsb2NremVpdC5jb20vZXRoZXJldW0tdG8tMjAwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Could Be On Its Way To $2,000 - Blockzeit",
        "content": "With the recent surge of Bitcoin (BTC) comes a renewed optimism on other key cryptocurrencies. Ethereum (ETH) is expected by the cryptocurrency community to follow suit with all eyes looking at the $2,000 level.\n\nRecent Movements of Ethereum\n\nRecently, Ethereum has successfully overcame several barriers, including the $1,650, $1,670, and $1,727 thresholds, marking a notable 19% gain in value between October 19 and 25. This rally led to a local peak at $1,865, and now the digital asset finds itself at a crossroads.\n\nFXS suggest that, going forward, Ethereum is likely to retrace its steps to these aforementioned hurdles, subsequently finding support. Such a retracement would also provide an opportunity for the daily Relative Strength Index (RSI) to reset at the 50 mean level. This RSI reset could provide additional weight to the bullish case, bolstering the confidence of investors.\n\nShould Ethereum experience a substantial bounce, the next major milestone for the cryptocurrency would be tagging the psychologically significant $2,000 level and the range high at $2,030. Notably, Ethereum faced this challenge earlier in April but couldn’t overcome it. Thus, any move into this territory will be seen as pivotal in shaping the long-term prospects of this blockchain-based smart contract token.\n\nBeyond $2,030, the path forward for Ethereum would hinge on its ability to clear this hurdle or convert it into a supportive platform. Success on this front would pave the way for Ethereum to target the next notable resistance at $2,424, making this a critical juncture for the cryptocurrency’s future.\n\nWhile the bullish outlook for Ethereum’s price seems logically sound at this rate, it remains dependent on the cryptocurrency’s ability to maintain its position above the $1,700 mark. In the event of a daily candlestick close below this level and a subsequent breach of the $1,650 support, the optimistic scenario may lose its footing. If this occurs, Ethereum’s price could revisit $1,551 or potentially slide even lower, collecting sell-side liquidity resting beneath the swing lows established on September 10 and October 10.\n\nCurrent Status of Ethereum\n\nAs of this writing at 8:00 AM UTC time, Ethereum is moving sideways at around $1,790. The numbers are just 0.30% up on a 24-hour frame but ETH has witnessed a spike of 27% in trading volume to $5 billion in the same period. At present, the cryptocurrency has a market cap of $215 billion with a circulating supply of 120 million ETH.\n\nFinal Thoughts\n\nEthereum’s journey towards $2,000 is met with promise, but it’s crucial for investors to remain vigilant. Ethereum’s performance relies on maintaining key support levels, and a close watch on these barriers is warranted. Whether it successfully navigates these obstacles or encounters setbacks, Ethereum’s price remains an engaging storyline in the cryptocurrency market."
    }
]