[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMTQvZXRoZXJldW0tY28tZm91bmRlci1vbi1zZWMtY3J5cHRvLWNyYWNrZG93bi1jbGVhci1oZWFkcy13aWxsLXByZXZhaWwuaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA5LzE0L2V0aGVyZXVtLWNvLWZvdW5kZXItb24tc2VjLWNyeXB0by1jcmFja2Rvd24tY2xlYXItaGVhZHMtd2lsbC1wcmV2YWlsLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum co-founder says 'clear heads will prevail' in the SEC's legal battles with crypto firms - CNBC",
        "content": "The co-founder of Ethereum, Joseph Lubin, said \"clear heads will prevail\" as the U.S. Securities and Exchange Commission continues to dispute with crypto firms in court over whether crypto tokens are considered securities.\n\n\"I anticipate that, with previous technologies like the internet, the web and cryptography, clear heads will prevail,\" Lubin told CNBC's \"Capital Connection\" on Thursday.\n\n\"America will see that decentralized protocols, blockchain, cryptocurrency are aligned with the philosophies of the U.S. And I think much of the rest of the world will follow suit,\" said Lubin, who is also the CEO of blockchain technology company ConsenSys.\n\nCrypto firms such as Binance, Coinbase and Ripple are fighting lawsuits with the SEC, which has accused them of law violations.\n\nThe SEC sued Ripple and its co-founders in 2020 of violating securities laws by selling its native cryptocurrency XRP without first registering it with the SEC. Meanwhile, the SEC accused Coinbase of operating an unregistered exchange and broker in June. In the same month, Binance was charged for several securities law violations."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tc2Vlcy1zZWNvbmQtaGlnaGVzdC1vbi1jaGFpbi1hY3Rpdml0eS1pbi1oaXN0b3J5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum sees second-highest on-chain activity in history - crypto.news",
        "content": "The network saw over 1 million unique active wallets accepting or sending ETH, the second-highest amount in the asset’s history.\n\nThe Ethereum (ETH) network registered a spark of activity on Sept. 13, as the number of unique active wallets (UAW) connected to the network hit 1,089,893.\n\nIn an X post, Blockchain analysts at Santiment said this was the second-highest amount of UAW in Ethereum’s 8+ year history, suggesting that such spikes “could be the capitulation signal needed for prices to rebound.”\n\nDaily active addresses interacting with ETH (orange) vs Ethereum price (green) | Source: X\n\nThe last time the Ethereum network witnessed a spike in on-chain activity was on Dec. 9, 2022, when the amount of UAW set an all-time high at 1.42 million, with ETH trading at around $1,265, according to data from Santiment.\n\nDaily active addresses interacting with ETH (black) vs. Ethereum price (green) | Source: Santiment\n\nFTX liquidations as a possible trigger\n\nAlthough the real reason behind the activity remains unclear, the spark came when U.S. Bankruptcy Judge John Dorsey approved FTX’s request to sell up to $100 million weekly to return funds to its creditors.\n\nAs crypto.news reported, the ceiling can be increased to $200 million. However, any adjustments will be evaluated on an individual token basis. Before selling high-profile digital currencies such as Bitcoin (BTC) and Ethereum (ETH), the estate must provide a 10-day advance notice to the US Trustee’s office. FTX is set to sell $3.4 billion worth of crypto in total.\n\nNonetheless, the crypto market seems to rise despite the US Consumer Price Index (CPI) coming higher than expected and FTX’s liquidation approval. According to data provided by CoinGecko, the global crypto market capitalization rose from $1.031 trillion to $1.086 trillion at the time of writing. This indicates a $55 billion hike despite the two bearish events on Sept. 13.\n\nFollow Us on Google News"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWpvZS1sdWJpbi11cy1yZWd1bGF0b3JzLWNyeXB0by1yZWd1bGF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum co-founder says US regulators will ultimately embrace crypto - Blockworks",
        "content": "It’s a matter of time before the US embraces crypto, says Joseph Lubin.\n\nLubin, a co-founder of Ethereum and CEO of Consensys, struck a confident tone during a recent interview that rational decisions will be made amid ongoing disputes between US regulators like the US Securities and Exchange Commission and crypto companies.\n\nSimilar to previous tech advancements like the internet, practical thinking will ultimately guide the regulatory approach to the industry, Lubin said on CNBC’s “Capital Connection” on Thursday.\n\n“America will see that decentralized protocols, blockchain, cryptocurrency are aligned with the philosophies of the US,” he added. “And I think much of the rest of the world will follow suit.”\n\nUS crypto exchanges expect to face increased scrutiny after the SEC filed lawsuits against Coinbase and Binance in June, accusing them of violating securities regulations.\n\nElsewhere, Coinbase has initiated legal action against the SEC, urging the securities regulator to offer clearer regulatory guidelines for the crypto industry. The exchange maintains that the current regulatory framework in the US lacks clarity and practicality.\n\nLubin highlighted in the interview that the US regulatory approach influences many countries worldwide.\n\n“The US has a lot of influence on the world through financial intermediaries and other intermediaries, and decentralized protocol technology is about right sizing and eliminating intermediaries in many ways,” he told CNBC, adding that the country is “all about free markets, capitalism, free speech.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS93aGF0LXRoZS1tZXJnZS1oYXMtbWVhbnQtZm9yLWV0aGVyZXVtLWFmdGVyLW9uZS15ZWFyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "The Merge one year on: Ethereum no longer a 'wanton environmental polluter' but centralisation issues remain - DLNews",
        "content": "Ethereum celebrates the one year anniversary of its transition to Proof-of-Stake on Friday.\n\nUnder Proof-of-Stake, the network has reduced global electricity demand by an amount equal to that of entire countries such as Myanmar and Slovakia.\n\nBut the Merge has done little to help some existing problems, such as a lack of client diversity.\n\nA year on from the Merge, Ethereum’s landmark upgrade has bolstered the blockchain’s public image and enhanced its green credentials. But issues of centralisation and technical diversity remain, according to developers and DeFi builders.\n\nSeptember 15 marks the one-year anniversary of the Merge, which, among other things, transitioned the leading smart contract network from the energy-intensive Proof-of-Work consensus mechanism to the greener Proof-of-Stake.\n\nUnder Proof-of-Stake, Ethereum has reduced global electricity demand by an amount equal to that of entire countries such as Myanmar and Slovakia in the year since the Merge.\n\nThat’s according to data from The Cambridge Centre for Alternative Finance, which says Ethereum’s energy use dropped 99.99%, down from the estimated 21.41 terawatt hours of electricity it used the year before the Merge under Proof-of-Work.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nEthereum’s new green credentials have had the biggest impact in the year since the transition.\n\n“The discussion changed a lot,” Ethereum core developer Marius van der Wijden told DL News. “If you discussed crypto or Ethereum before the Merge, it immediately went to energy consumption and emissions.”\n\n“Now we can have good discussions about the merits of blockchain without having to discuss the environmental impacts,” he added.\n\nNOW READ: Vesta Finance token soars 150% as DeFi protocol is rocked by rage quit proposal\n\nJoin the community to get our latest stories and updates\n\nAnd Van der Wijden isn’t the only one to say so.\n\n“No longer being a wanton environmental polluter is a significant improvement to the blockchain’s public image,” Nick Ashley, marketing manager at Ether liquid staking provider Rocket Pool, told DL News. “Institutions can take Ethereum more seriously, with the option to earn a return on their holdings while complying with ESG policies.”\n\nAshley also noted the increasing interest from universities, which are now more eager to participate in Ethereum’s security and contribute to ongoing research and education.\n\nHowever, while many predicted that Ethereum might see increased investment interest after the Merge thanks in part to its energy use reduction, this has yet to materialise.\n\nData from Coinshares shows that institutional investment into Ethereum actually decreased by $108 million since the start of the year. In a September 11 report, Coinshares noted that Ethereum was the “least loved digital asset amongst exchange traded products investors this year.”\n\nEconomic improvements\n\nAside from cutting carbon emissions, The Merge also cut issuance of Ethereum’s native cryptocurrency Ether by about 95%. Under Proof-of-Work, the network paid out around 13,000 Ether a year to miners for securing the network. Under Proof-of-Stake, this figure dropped to 1,600 Ether annually.\n\nAccording to Ashley, this “solved one of the most important problems of all by ensuring that Ethereum can remain sustainable in the long term.” If the pre-Merge issuance continued, the supply of Ether would have grown indefinitely, diluting the market and providing stakers little incentive to lock up their Ether to secure the network.\n\nThe reduced emissions, combined with a previous upgrade which enabled the Ethereum network to burn a portion of transaction fees, has made Ether disinflationary over the past year — even more so during times of high network activity when more transaction fees are burned.\n\nWith Ether burned from transactions outpacing new emissions since the Merge, projections from Ethereum data platform ultrasound.money show the Ether supply is likely to find equilibrium at around 73 million, if the current yearly usage continues.\n\nSince the Merge, the Ethereum network has burned 300,000 Ether, worth approximately $480 million.\n\nEther supply since the Merge. (ultrasound.money/ultrasound.money)\n\nDiversity issues\n\nDespite the improvements to Ethereum’s energy consumption and economic structure brought by the Merge, it also exacerbated an existing problem.\n\nAccording to Ethereum core developer Preston Van Loon, the lack of Ethereum client diversity following the Merge has been “prominently discussed” in developer circles.\n\nEthereum clients are pieces of software that run Ethereum and communicate over the network with other clients.\n\nVan Loon explained how shortly after the Merge, the Prysm client became dominant and exceeded a super majority above two-thirds of the entire Ethereum network.\n\nNOW READ: Compound founder Robert Leshner says ‘institutions aren’t coming’ to DeFi\n\n“Having a single client representing more than two-thirds of the network was a considerable risk,” Van Loon said. “The client could have a bug that may become finalised with the remaining third in disagreement.”\n\n“Diversity has improved significantly, but there is still room to improve, especially on the execution layer where Go Ethereum is an overwhelmingly dominant client,” Van Loon added.\n\nAn Ether staking surge\n\nThe Merge, and the subsequent April 2023 Shanghai upgrade, also drove billions worth of Ether into staking — particularly liquid staking services such as those offered by Lido and Rocket Pool.\n\n“Ethereum’s transition to Proof-of-Stake can be broken down into two phases, the Merge in September of last year and the Shanghai upgrade back in April,” Marin Tvrdić, a business development contributor at Lido DAO, told DL News.\n\n“The biggest impact of this transition is the rapid growth of the liquid staking economy,” he said.\n\nSince the Merge, deposits to liquid staking protocols have more than doubled. According to DefiLlama data, over $19 billion worth of Ether is currently staked through liquid staking protocols, with the biggest protocol, Lido, accounting for 73% of the market.\n\nLido dominates liquid staking derivatives with a 73% share of the market.\n\nTvrdić also noted that the Merge has allowed staking protocols to focus on expanding access to staking, helping to consolidate Ethereum’s overall decentralisation.\n\nVan Loon also highlighted how the switch to Proof-of-Stake has helped open up Ether staking not just for liquid staking protocols, but also for individuals by lowering barriers to entry. Under Proof-of-Work, only entities with sufficient hash power or operating mining pools had the privilege of building new blocks and verifying transactions.\n\nNOW READ: Speed-trading giant borrows Coinbase playbook in slamming Gary Gensler after SEC lawsuit\n\nNow, he explained, anyone with ordinary hardware and 32 Ether can become a block producer.\n\n“Ultimately, the switch has made Ethereum a more decentralised network,” he said.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out to him with tips at tim@dlnews.com.\n\nDisclosure: Tim holds over $1,000 worth of Ether, Swell staked Ether, Redacted Cartel, and GMX. He also holds an insignificant amount in NFTs."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTMvaGVsbG8taG9sZXNreS1ldGhlcmV1bXMtbmV3ZXN0LXRlc3RuZXQv0gFUaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wOS8xMy9oZWxsby1ob2xlc2t5LWV0aGVyZXVtcy1uZXdlc3QtdGVzdG5ldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Hello Holesky, Ethereum’s Newest Testnet - CoinDesk",
        "content": "Goerli and Sepolia are operated by a smaller subset of “validators” than the main Ethereum chain, and some developers think these smaller validator sets pose a problem: “We don't want to hit a scaling issue that could happen first on mainnet,” Parithosh Jayanthi, a devops engineer at the Ethereum Foundation, a non-profit focused on Ethereum research and development, told CoinDesk. “We want to catch [scaling issues] on testnet, which means we have to have a testnet that's bigger” than the main Ethereum chain."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1hY3RpdmUtYWRkcmVzc2VzLXNlY29uZC1oaWdoZXN0LWluLWhpc3RvcnktYW5hbHlzdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's active addresses second-highest in history: Analysts - Cointelegraph",
        "content": "Through an examination of Ether’s (ETH) on-chain activity, market intelligence platform Santiment has published a report indicating that the count of daily active Ether addresses experienced a notable increase, reaching around 1,089,893 on Sept. 13.\n\nThis recent upsurge represents the second-highest number of daily active addresses ever recorded in Ethereum’s history. The highest count was registered on Dec. 9, 2022, aligning with Ether’s reevaluation following its losses from the post-2021 bear market.\n\nAs a result, analysts at Santiment suggest that the Ether market may experience increased volatility, potentially leading to a recovery. Additionally, this uptick in on-chain activity indicates a growing demand for the underlying asset.\n\nThe #Ethereum network just saw 1,089,893 unique wallets acting as a sender or receiver of $ETH on Wednesday, the 2nd highest amount in the asset's 8+ year history. This historic anomaly could be the capitulation signal needed for prices to rebound. https://t.co/JF0g8vvBWs pic.twitter.com/1dRnPCjxcA — Santiment (@santimentfeed) September 14, 2023\n\nEthereum, whose native crypto, ETH, is the second-largest by market capitalization, is presently encountering immediate market instability after a recent price decline that pushed it below the $1,700 threshold. Nevertheless, Ethereum maintains its position in the decentralized finance ecosystem and smart contract arena, securing around $20 billion in total value locked.\n\nEthereum remains attractive to institutional investors, as seen in the growing interest in spot exchange-traded funds. Additionally, the Ethereum network holds a central role in numerous blockchains due to its Ethereum Virtual Machine network. As a result, Ethereum’s prospects seem largely optimistic, supported by the network’s significant valuation, liquidity and strong trading activity.\n\nWhen it comes to analyzing Ether’s price, it’s worth noting that, despite being a prominent altcoin with unique fundamentals, ETH’s price movement is still considerably impacted by Bitcoin (BTC). Throughout history, September, particularly before a halving event, has been recognized as a bearish period for the cryptocurrency market.\n\nRelated: Nasdaq’s Hashdex mixed Ether ETF filing joins crypto ETF race\n\nThis might suggest that Ether’s price will continue its decline in the upcoming weeks, potentially nearing the next support level at approximately $1,500. In addition, the cryptocurrency is encountering significant selling pressure as both weekly and daily death crosses form between the 50- and 200-day moving averages.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Ethereum is ‘woefully undervalued’ but growing more powerful: DeFi Dad, Hall of Flame"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzEzL3Zpc2Etc2F5cy10aGlzLWV0aGVyZXVtLXJpdmFsLWhhcy11bmlxdWUtdGVjaG5vbG9naWNhbC1hZHZhbnRhZ2VzLW92ZXItb3RoZXItY2hhaW5zL9IBeWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzEzL3Zpc2Etc2F5cy10aGlzLWV0aGVyZXVtLXJpdmFsLWhhcy11bmlxdWUtdGVjaG5vbG9naWNhbC1hZHZhbnRhZ2VzLW92ZXItb3RoZXItY2hhaW5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Visa Says This Ethereum Rival Has ‘Unique Technological Advantages’ Over Other Chains - The Daily Hodl",
        "content": "Credit card giant Visa says that one Ethereum (ETH) competitor has unique technological advantages over other blockchains as a payments platform.\n\nIn a new company blog post, the financial services titan says that smart contract platform Solana (SOL) has distinctive features that set it apart from its rivals, such as low and predictable transfer fees, high throughput rates and significant node support.\n\nAccording to Visa, Solana even has the upper hand against the king crypto Bitcoin (BTC) and ETH in some aspects.\n\n“Solana’s transaction fees are not only affordable, usually less than $0.001, but predictable. This level of low-cost predictability helps make it an attractive network to explore efficiencies and cost savings for existing payment operations.\n\nIn [the figure] below, Solana clearly stands out from a cost perspective compared to Bitcoin and Ethereum, whose fees can fluctuate unpredictably based on demand for transactions to execute on the network. A network with unpredictable transaction costs can be more difficult for payment companies to manage within their products and can lead to confusing consumer experiences.”\n\nVisa goes on to say that because of Solana’s efficiency, they have decided to expand their stablecoin settlement program to include Solana as a means of testing the blockchain’s capacity to meet the financial demands of modern corporations.\n\n“Solana’s unique technological advantages, including high throughput with parallel processing, low cost with localized fee markets and high resiliency with a significant number of nodes and multiple node clients, work together to create a scalable blockchain platform with a compelling value proposition for payments.\n\nThese are some of the reasons that we decided to expand our stablecoin settlement pilot to include transactions over the Solana network. As we pilot our stablecoin settlement functionality on Solana, we plan to test whether Solana has the ability to meet the demands of modern corporate treasury operations.”\n\nSolana is trading for $18.39 at time of writing, a 2.19% increase during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Fortis Design/Sol Invictus"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2JpdGNvaW4tYW5kLWNyeXB0by1ndWlkZS93aGF0LWlzLXRoZS1mdXR1cmUtb2YtZXRoZXJldW0td2UtYW5hbHl6ZS1pdHMtcm9hZG1hcC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "What is the Future of Ethereum? We Analyze its Roadmap - Altcoin Buzz",
        "content": "The Ethereum network, which supports a sizable ecosystem of decentralized applications (dapps), has advanced significantly over the last couple of years.\n\nEthereum has been the pioneering force behind smart contracts, leading to ground-breaking innovations including DeFi), NFTs, the metaverse, and blockchain gaming. However, the rise in Ethereum’s popularity led to problems such as high costs, high energy consumption, and scalability. In this article, we’ll analyze Ethereum’s Roadmap to know how the future will be for this important blockchain.\n\nA Journey of Upgrades\n\nEthereum’s developers devised a grand plan to address these problems. They called that plan “Ethereum 2.0,” which is a set of upgrades on the network. With these improvements, the network should become more resilient, scalable, safe, and effective for practical applications.\n\nSo, the changes in Ethereum 2.0 are intended to improve the performance of the Ethereum network in a number of areas. The adventure started in December 2020 with the Beacon Chain’s launch. This update in particular introduced the concept of the Proof of Stake (PoS) consensus mechanism to the network.\n\nEthereum’s developers didn’t stop there. They proceeded with other enhancements. Next on their list were the Berlin and London upgrades, which came in 2021. These upgrades optimized gas fees and introduced Ethereum Improvement Proposal 1559 (EIP-1559).\n\n🟠 The merge Ethereum merge merged the proof-of-stake testnet with the proof-of-work mainnet, converting the latter to PoS. The merge finished on 15 September 2022. And the last merge-related upgrade (Shanghai-Capella) concluded last week. 2/ https://t.co/N1RjRgJj4T — satvik.shm Ξ (@7vik_writes) April 17, 2023\n\nEthereum developers took things a notch higher in 2022 with the launch of the Gray Glacier, Bellatrix, and Paris upgrades—collectively referred to as “The Merge”. These effectively converted Ethereum from Proof of Work (PoW) to Proof of Stake (PoS), where validators who staked ETH took over from miners as the source of blocks. Here are some of the benefits of the merger:\n\nMinimized energy consumption.\n\nDecreased the net issuance of ETH.\n\nReduced block times (13.3s → 12s).\n\nIt led to stronger finality.\n\nIntroduced yield.\n\nDistributed Validator Technology(DVT). This resulted in better decentralization.\n\nImproved security.\n\nCurious about what lies ahead for #Ethereum? In our latest #Binance Research report, we take a closer look at Ethereum's roadmap, highlighting some of the key phases and upgrades worth keeping an eye on. Read about them here ⬇️https://t.co/WNXegI1bhE — Binance Research (@BinanceResearch) September 4, 2023\n\nThe Shanghai Upgrade.\n\nThe Shanghai Upgrade in April 2023 was the most recent Ethereum update. This upgrade, which also included EIP-4895, enabled ETH validators to unlock their network-staked ETH. It improved ETH liquidity since it enabled people to access staked ETH and related rewards.\n\nNow let’s look at what Ethereum’s future looks like based on its roadmap.\n\nThe Surge\n\nThe surge intends to improve the Ethereum network’s scalability and decentralization. It features the implementation of EIP-4944, also known as Proto Danksharding. This will enable a new format of transaction via “data blobs” that can be seamlessly integrated into nodes and their processes.\n\n🟠 The surge The Ethereum surge is a set of upgrades that will increase the speed of the blockchain and its L2 counterparts. This increase in scalability would solve the blockchain trilemma without compensating for network security. The main upgrade here will be sharding: 3/ https://t.co/HtkGxjCdOt — satvik.shm Ξ (@7vik_writes) April 17, 2023\n\nThe sharding method used by Ethereum divides transactions into numerous smaller batches, scaling the network horizontally, a process that is significantly simpler than enhancing a single machine.\n\nFor instance, it is more effective for 20 validators to validate five batches of 20 transactions each than it is for 100 validators to validate 1,000 transactions one at a time. Additionally, EIP-4844 establishes the foundation for transactions based on roll-up technology as well as resources that make it easier to create zero-knowledge scaling solutions. This phase will increase the scalability of the Ethereum network from 15 TPS to 100,000 TPS.\n\nThe Scrouge\n\nThe Scrouge upgrade seeks to prioritize decentralization and address protocol risks related to Maximum Extractable Value (MEV). It is the highest possible value that can be obtained from manipulating the order of transactions in a block above the recognized gas fees and block reward.\n\nMany in #DePin space have suggested the future will be nodes run from mob devices. @VitalikButerin advocating stateless clients to unlock this. End result is more decentralisation. This is what the future internet looks like and why we are building #Web3https://t.co/0AseX6hcEg — marklittle.eth (@mark_little2) September 6, 2023\n\nOne of the ways to tackle this MEV issue is through the implementation of PBS (Proposer Builder Separation). PBS addresses the centralization risk posed by MEV and also offers an anti-censorship solution\n\nThe Verge\n\nAccording to Ethereum founder Vitalik Buterin, the Verge will reduce the amount of data validators store on their machines. It will accomplish this by introducing Verkle trees. Buterin claims this is an improvement over Merkle proofs that enables substantially reduced proof sizes.\n\n📱🚀 Vitalik Buterin believes that future upgrades to Ethereum could allow full nodes to run on mobile devices, making the network more decentralized. #Ethereum #VitalikButerin #mobile #decentralization — CubeCoin | News (@CubeCoinCrypto) September 7, 2023\n\nThe Verkle trees are one component of a larger roadmap for making Ethereum stateless, a difficult idea that is still being developed. In simple terms, the proposal seeks to establish stateless clients, in which validating nodes don’t need to store state data before block verification.\n\nThe Purge\n\nThe Purge upgrade contains a number of improvements to get rid of outdated network history and gradually clean up the network. It will minimize Ethereum’s technical debt and historical data storage requirements. This will reduce the storage requirements for node operators.\n\nThe Purge also plans to introduce history expiration (EIP-4444), which will allow some node operators to skip storing some of the data from earlier blocks. Validators will simply store one year’s worth of history rather than the entire blockchain’s history.\n\nEIP-4444 also aims to remove excessive or unneeded functions from the Ethereum Virtual Machine, optimize the protocol, minimize technical complexity, and lower the cost of participating in the network. The major objective is to reduce network traffic and increase transaction speed.\n\nThe Splurge\n\nThe Splurge upgrade, which is the final stage, is intended to solve all outstanding issues in the network. This upgrade will only be used for research and to guarantee the proper execution and implementation of previous processes.\n\nvery concerned about what will happen after the Ethereum Merge, Surge, and Verge because then we're just left with rhymes like the Purge, Scourge, or Dirge pic.twitter.com/z2INpfQ9UN — Molly White (@molly0xFFF) September 17, 2022\n\nThe phases contained in Ethereum’s roadmap will improve the network once they each go live. They will also lead to more liquidity and earning opportunities. However, these upgrades could possibly affect the price of ETH. But we can’t say in what direction that will happen. Instead, it will depend on several factors, including market trends.\n\n– For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n– Unlock the key to managing your crypto portfolio like a PRO! Our top analysts bring you exclusive insights and the latest updates on cryptocurrency trading. Join Altcoin Buzz Alpha on Youtube or Patreon for just $15/month!"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2xheWVyLTItc29sdXRpb24tYXJiaXRydW0tZHJpdmVzLWV0aGVyZXVtLWVjb3N5c3RlbXMtZ3Jvd3RoLXN1Z2dlc3RzLXBhbnRlcmEtY2FwaXRhbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Layer 2 solution Arbitrum drives Ethereum ecosystem's growth, suggests Pantera Capital - CryptoSlate",
        "content": "According to the latest Pantera Capital Blockchain Letter, the crypto market may finally turn a corner after a brutal bear market in 2022, and leading Ethereum layer 2 solution Arbitrum is emerging as one of the biggest beneficiaries.\n\nAs Pantera’s letter illustrates,\n\n“Arbitrum is a massive share taker within the Ethereum ecosystem, and Ethereum, in turn, has itself been a massive share taker across all of crypto.”\n\nFurthering this point, Pantera reports that Arbitrum has single-handedly fueled 100% of the incremental growth in Ethereum’s transaction volume this year, even as other layer 2 solutions and competitors stayed largely stagnant.\n\nPantera’s fundamentals-based investing.\n\nPrincipally focusing on fundamentals-based investing, Pantera acknowledges the significant bottlenecks Ethereum has grappled with due to its scalability constraints. Reflecting on Ethereum’s predicament, the letter indicates that layer 2 solutions like Arbitrum are surfacing as preferred solutions, promising faster and cheaper transactions while retaining Ethereum’s robust security measures and wide-ranging application support.\n\nDrawing from Pantera’s analysis, Arbitrum’s critical edge lies in its capacity to process transactions that are 40x faster and 20x cheaper than the base Ethereum layer. This superiority has propelled Arbitrum to considerable growth, both in absolute terms and in contrast to its peers, making it one of the fastest-expanding layer 2 solutions on Ethereum and enabling it to seize a substantial proportion of Ethereum’s transaction market share over the past year.\n\nPantera notes that Arbitrum has consistently grown in transaction volume despite a bearish trend across the crypto market this year. Citing available data, Pantera’s letter reveals that Arbitrum has been instrumental in the Ethereum ecosystem’s growth this year, contributing to 100% of its incremental growth.\n\nArbitrum growth and expanding user base.\n\nThe letter further explores the driving factors behind Arbitrum’s growth, spotlighting its expanding user base and the subsequent rise in developers keen to build new applications on its platform. This virtuous upward spiral, as Pantera notes, is critical to Arbitrum’s continued evolution. However, the firm underscores that the pivotal concern for fundamental value investors resides in the potential revenue from this increasing activity.\n\nAmplifying its distinctiveness in the market, Arbitrum stands out as a profitable protocol in Pantera Capital’s analysis. The platform generates revenue by amassing transaction fees on its network, assembling these transactions into larger bundles, and consigning them to the Ethereum base layer. This mechanism implies a gross profit of about 10 cents per transaction for Arbitrum.\n\nWith a product that has found a market fit and a viable unit economics model, Pantera Capital deems Arbitrum’s valuation as defensible. Per Pantera’s letter, the protocol has consistently grown quarter-over-quarter since its launch, with transactions nearing 90 million per quarter and revenue hitting $23 million in Q2. The gross profit for the same period approached nearly $5 million, equivalent to an annualized $20 million.\n\nThe letter illustrates that Arbitrum, with about 2.5 million monthly average users and roughly 350 million transactions yearly, is nearly a $100 million annual revenue business, generating around $50 million of standardized gross profit.\n\nArbitrum market capitalization.\n\nRegarding market capitalization, Arbitrum currently boasts a $5 billion figure on an issued shares basis. This represents an appealing prospect to Pantera, particularly when compared to similar market capitalizations of other layer 1 and layer 2 protocols, given Arbitrum’s superior usage, revenue, and profit statistics.\n\nFrom a growth and valuation perspective, the letter suggests Arbitrum could potentially scale to a transaction run rate of over 1 billion at 10 cents profit per transaction over the next year. This projection implies about a hundred million in earnings and, at a $5 billion market capitalization, infers a valuation of roughly 50 times forward earnings. Despite appearing expensive on an absolute basis, Pantera considers this valuation reasonable for an asset still growing in the triple digits.\n\nPantera Capital’s Blockchain Letter presents Arbitrum as a rapidly evolving protocol that has found a product-market fit, demonstrates profitability, and trades at a reasonable valuation relative to its growth, other crypto assets, and traditional financial assets."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW1zLTYtbW9udGgtbG93LW1heS1ub3QtYmUtdGhlLWVuZC_SAUdodHRwczovL2FtYmNyeXB0by5jb20vd2h5LWV0aGVyZXVtcy02LW1vbnRoLWxvdy1tYXktbm90LWJlLXRoZS1lbmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Why Ethereum’s 6-month low may not be the end - AMBCrypto News",
        "content": "ETH could drop below $1,500 as many old coins changed wallets.\n\nThe sentiment remained bearish, but ETH’s burn mechanism could rescue the altcoin in the long-term.\n\nEthereum’s [ETH] plunge to $1,540 has been accompanied by interesting changes that could push the altcoin into capitulation, Santiment revealed. The on-chain analytic platform, in its 12 September post on X (formerly Twitter), noted that a large number of ETH have been transferred from old wallets.\n\n? #Ethereum dropped to $1,540 for the first time since March 12th, and this coincided with large quantities of stagnant $ETH moving away from old wallets. A continued dip in mean $ age while prices drop is a capitulation sign, which foreshadows reversals. https://t.co/50jK2C7aLi pic.twitter.com/4RhtlVX3rr — Santiment (@santimentfeed) September 12, 2023\n\nOldies leave their former abode\n\nThe post focused on using the Mean Coin Age (MCA) to decipher the possibility. The MCA is the sum of a coin’s Unspent Transaction Output (UTXO) alive at the time of coin creation.\n\nAs a long-term indicator, a drop in the MCA implies a massive movement of UTXOs that have been immobile for a long period.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nAt the time of writing, ETH’s 90-day MCA had decreased to 41.07. This further affirmed Santiment’s position that a big fall could be close. Although the 90-day dormant circulation has now reduced, the surge to 634,000 on 11 September reinforced the notion that old coins were moving in droves.\n\nSo, the spike implies that it’s not just the two to five years dormant coins on Ethereum that are moving. Those who have remained stagnant for just three months joined the party.\n\nPreviously, AMBCrypto had explained why ETH’s price action could remain bearish. However, Santiment mentioned that after the rain comes sunshine, noting that relief could come to ETH after the projected price drop.\n\nIs light at the end of the tunnel?\n\nHowever, traders do not expect the recovery to be anytime soon, as shown by the funding rate. As of this writing, ETH’s funding rate was -0.003%. Since perpetual futures contracts can be held indefinitely, it becomes very necessary to have the funding rate.\n\nFunding rate is the amount of an asset paid between long and short-positioned traders with open contracts. When the funding rate is positive, it means that longs are paying too short to keep their position. In this case, traders’ sentiment is bullish.\n\nBut a negative funding rate means that shorts are paying longs a funding fee. Here, like it was with ETH, the sentiment is bearish. So, the broader bias was for ETH to drop much below $1,500.\n\nFor now, Ethereum may need to depend on other metrics besides its market-based indicators in the hope of recovery. One metric that comes to mind is the Ethereum burned supply.\n\nThis Ethereum burned supply represents the cumulative sum of ETH incinerated since the implementation of the EIP-1559. For context, the EIP-1559 was implemented during the London Hard Fork— the same period Ethereum began the burn mechanism.\n\nIn EIP-1559, the base for transactions is not sent to any miner/validator. Rather, it is burned as a means to reduce ETH’s supply and improve its value in the long term.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nLately, ETH turned inflationary, which could be a cause for concern. However, the burned supply of Ethereum had also increased to 4.25 million (as displayed above).\n\nIf the number continues to increase, then ETH may get back its deflationary pressure, and in the long term, could be profitable for its price."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3ZpdGFsaWstYnV0ZXJpbi1mdXR1cmUtYnVpbHQtZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Vitalik Buterin previews a future built on Ethereum - Blockworks",
        "content": "Vitalik Buterin doesn’t want Ethereum to rest on its laurels, but to keep pressing forward with new ideas and approaches to old problems.\n\nLooking around at the app landscape today, Buterin sees chutes of the future sprouting, but even the newest of the new is “not imaginative enough,” he told the Permissionless audience in Austin, Texas, during an interview with David Hoffman.\n\nDeFi “is cool,” NFTs are a new primitive but “an extension of something that has a history,” and using crypto for payments is good, but also familiar. These are “individual pieces that are designed to fit into an ecosystem that’s otherwise the same as before,” Buterin said.\n\nWhat he’s excited about is decentralized social, repeatedly name-dropping Farcaster, a Twitter-like protocol built on the OP mainnet with a companion Warpcast mobile app that is currently in invite-only alpha release.\n\nAlong with Lens, developed by Aave-founder Stani Kulechov and running on Polygon’s proof-of-stake chain, Farcaster and similar social experiences are using crypto tools to compete with centralized platforms.\n\n“Let’s see how far we can push things in that direction,” Buterin said. “But where I see the longer term future here is it really can plug into all of the other stuff that we’ve been doing as a space.”\n\nBuilding Sybil-resistance for example, so that “the 894 likes are 894 people, and not 894 accounts that are all controlled by the Kremlin.”\n\nCrypto-based solutions have the potential to be more decentralized, privacy-preserving and secure than the current Web2 landscape, according to Buterin, citing building blocks such as ENS, various proof-of-humanity ideas, and POAPs — or a next generation version using zero-knowledge technology that will be even better — and Gitcoin Passport, as examples.\n\n“The big dream here is to like, really create an independent open tech stack,” Buterin said. Something to compete with the likes of Google and Twitter, without going down a closed, centralized system such as China’s tight integration of Wechat, Alipay and increasingly CBDC.\n\nButerin envisions a gradual on-ramping process for new Web3 users to create an Ethereum address, initially controlled by a familiar service like Gmail, but using account abstraction, giving people the ability to take ownership when they are ready to use more crypto-native approaches.\n\n“Basically, give people the opportunity to slide down the decentralization ladder and then, at the end of it, really properly be in this totally independent stack that actually works together — all the different pieces inside it,” he said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zc3YtbmV0d29yay1tYWlubmV0LWluY3JlYXNlLWV0aGVyZXVtLXN0YWtpbmctcG9vbC1kZWNlbnRyYWxpemF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "SSV.network hits mainnet to increase decentralization of Ethereum staking pools - Cointelegraph",
        "content": "Criticisms aimed at the perceived centralization of Ether (ETH) staking pools may finally be quelled by an alternative staking infrastructure that aims to improve private key security and reduce validator downtimes and slashing penalties.\n\nSpeaking exclusively to Cointelegraph, SSV.network founder Alon Muroch outlined how the platform’s distributed validator technology (DVT), developed in partnership with the Ethereum Foundation, can help decentralize ETH staking pools and validators.\n\nSSV.network launched its public mainnet with more than 10 staking decentralized applications deploying their platforms on the network on Sept. 14. DVT is intended to decentralize the current landscape of staking providers, which is currently dominated by a handful of ETH staking pools that command a significant share of ETH locked in the Eth2 staking contract.\n\nRelated: SSV launches $50M ecosystem fund to support ETH staking tech\n\nAccording to Muroch, the technology is an approach to validator security that spreads out key management and signing responsibilities across multiple parties, reducing single points of failure and increasing validator resiliency.\n\nThe technology splits a private key used to secure a validator across a cluster of computers. This increases security and allows for some nodes of a validator cluster to go offline, which also reduces single points of failure from the network and makes validator sets more robust.\n\n“By splitting keyshares between a diverse set of nodes in a cluster, validators become much more decentralized. Staking pools that use DVT can decentralize their own infrastructure or delegate it to SSV.network node operators.”\n\nData from blockchain analytics firm Nansen shows that Lido Finance accounts for 32% of ETH locked in the Beacon Chain deposit contract. ETH staking pools offered by Coinbase (8%) and Binance (4%) also command a significant share of staked ETH.\n\nAn overview of the largest ETH staking entities. Source: Nansen Eth2 deposit contract\n\nAs SVV noted in an announcement marking the mainnet launch, centralized exchanges such as Coinbase, Binance and Kraken hold around 18% of the total staked ETH, while liquid-taking pools like Lido, RocketPool, Stader and Stakewise account for over 36% of the total market share.\n\nLiquid staking pools became hugely popular in the build-up to Ethereum’s anticipated Shanghai upgrade in July 2023. The event introduced the ability for Ethereum users to withdraw staked ETH from the Beacon contract for the first time.\n\nSSV intends to offer alternative liquid and centralized staking pools, which it describes as “fundamentally centralized and custodial”. Muroch added that SSV can significantly increase validator private key security and maximize rewards through high performance and a fault-tolerant setup that stops slashing penalties for offline validators.\n\nSSV.network grabbed headlines in January 2023 when it launched a $50 million ecosystem fund to support other projects developing using DVT. The technology was previously highlighted as an important aspect of Ethereum’s scaling roadmap laid out by co-founder Vitalik Buterin in December 2021.\n\nMagazine: Are DAOs overhyped and unworkable? Lessons from the front lines"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTMvZXRoZXJldW1zLXZpdGFsaWstYnV0ZXJpbi1zZWVzLWdyb3dpbmctcHJlc2VuY2Utb2YtYXNpYS1kZXZlbG9wZXJzLWluLWJsb2NrY2hhaW4tdGVjaC_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wOS8xMy9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLXNlZXMtZ3Jvd2luZy1wcmVzZW5jZS1vZi1hc2lhLWRldmVsb3BlcnMtaW4tYmxvY2tjaGFpbi10ZWNoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Sees Growing Presence of Asia Developers in Blockchain Tech - CoinDesk",
        "content": "\"When the average crypto Twitter person says, 'Oh, Asia is back,' they’re really referring to hundred-millionaires buying your favorite dog coins or whatever,\" Buterin said, referring to tokens like SHIB of the Shina Inu blockchain ecosystem, which in turn was a knockoff of Dogecoin's DOGE. \"But I feel like, here, there is an Asia degree of deep community and technical involvement that is unlike anything I’ve seen before Covid or before any of the recent bubbles.\""
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzEzL3RvcC1hbmFseXN0LXdhcm5zLW9mLWltbWluZW50LWV0aGVyZXVtLWNvbGxhcHNlLXNheXMtZXRoLWZsYXNoaW5nLWZhaWxlZC1idWxsaXNoLXBhdHRlcm4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Top Analyst Warns of Imminent Ethereum Collapse, Says ETH Flashing Failed Bullish Pattern - The Daily Hodl",
        "content": "A widely followed crypto analyst believes that a monumental collapse is in the cards for the smart contract platform Ethereum (ETH).\n\nIn a new video, analyst Nicholas Merten tells his 512,000 YouTube subscribers that Ethereum had more than a year to break out from an ascending triangle pattern.\n\nAccording to Merten, Ethereum’s inability to convincingly move above the resistance of the bullish formation suggests that ETH is weak and likely headed to much lower levels.\n\n“Ethereum cannot show up to the plate. It keeps getting shot down [at around] $2,000, and that’s okay for a while. But eventually, you’ve got to be able to either break out to the upside or if you break through the ascending line of support to the downside, that spells bad news. That is a failed technical pattern…\n\nSo if we are not going to catch a bid here, then that means we’re probably going to revisit $1,100 – the previous support range – or come down to $890 like we were back here in June.\n\nOr maybe even worse: perhaps our scenario of anywhere from $300 to $500 Ethereum is not too bearish at all. Perhaps is not too far off.”\n\nAt time of writing, Ethereum is trading for $1,597, slightly below the diagonal support of Merten’s ascending triangle pattern.\n\nMerten is not the only analyst sounding the alarm about a possible Ethereum crash. Crypto strategist Benjamin Cowen previously said that it is in the realm of possibility for ETH to nosedive to as low as $400.\n\n“There’s a good chance that [there will] be a lower low, and it might not be a much lower low, maybe it just goes down to just below $800. It could go lower. It could go to $600 or $500 or $400, but that is in the cards for Ethereum.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3JvbGx1cHMtc2NhbGUtZXZtLWV0aGVyZXVtLW1vbmFkLWxhYnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Scaling Ethereum's virtual machine is a 'solvable problem,' says Monad Labs' Galler - Blockworks",
        "content": "The Ethereum scaling story tends to center around layer-2 rollups, but what about the EVM itself? Does the virtual machine suffer from limitations that are inherent to the execution layer of the system, or can developers overcome them?\n\nWhile rollups take the computation load off the Ethereum mainchain, Blockworks co-founder Michael Ippolito wondered how the computation that occurs directly on Ethereum could be more “performant.”\n\n“Do rollups solve all of our scalability challenges, or is there still work to be done on the execution layer?” he asked during the Permissionless II conference in Austin, Texas.\n\nMonad Labs developer relations engineer Kevin Galler replied: “A lot of the current limitations of the EVM we know today are actually more of a side effect of how the backend computer of this EVM has been constructed up until now,” but are not inherent to the interface or the bytecode.\n\n“You can actually design parallelism and stuff into this,” he said, acknowledging that “there’s stuff you have to work around to maintain backwards compatibility.”\n\n“There’s like, 20 years of high performance computing research on how to do these things,” he said, “so, it’s a very solvable problem.”\n\nOffchain Labs senior software engineer Raul Jordan admitted that the current implementation of the EVM is “fairly slow for many reasons,” adding “there are many things we can do to power that up.”\n\nJordan noted that developers are already accustomed to being able to build DeFi primitives and other “really cool applications” with the EVM as it stands today, but wondered “how can we give them superpowers to build something greater than they have before?”\n\n“How can we empower them?” he asked. “Should we make the EVM faster, or can we introduce new constructs that allow them to do things that weren’t possible before?”\n\nCan’t cheat physics\n\nSomani expressed concerns with the possibility of an excess of layer-2 protocols. “The issue with the single threaded EVM…is that it results in a lot of rollups.”\n\n“There’s people suggesting there should be millions of rollups or something,” Somani continued. “That’s going to lead to a lot of issues with liquidity fragmentation and end-to-user experience.”\n\n“Sufficiently advanced virtual machines” have local fee markets, Somani said, “so that if there’s a lot of activity on one app, it doesn’t congest all those.”\n\n“So bringing that [virtual machine] to Ethereum can lead to this highly parallelized [layer-2] that doesn’t really need all these other robots to exist,” he said.\n\n“You can’t cheat physics,” Galler interjected. “Bandwidth is fundamentally what limits how fast a lot of these blockchains can run.”\n\nReflecting on scaling challenges, Jordan referred to the example of Arbitrum Stylus, noting that the product allows developers to write code in common programming languages like Rust and C++, compiling to a special instruction format called WebAssembly. “You can actually execute this side by side with EVM smart contracts.”\n\n“So we ended up realizing that the EVM is not the ceiling,” he said, “it’s actually the floor.”\n\n“You can do a lot more than you thought was possible while still maintaining the same guarantees.”\n\nScalability at the execution layer “has a long way to go,” Jordan added, “and we’re trying to get there.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTMvdGhlLXByb3RvY29sLXRoZS1jZnRjLWlzLWNyYWNraW5nLWRvd24tb24tY3J5cHRvL9IBXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTMvdGhlLXByb3RvY29sLXRoZS1jZnRjLWlzLWNyYWNraW5nLWRvd24tb24tY3J5cHRvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "The Protocol: The CFTC Is Cracking Down on Crypto - CoinDesk",
        "content": "DEXES DINGED! Last week, the Commodity Futures Trading Commission charged three decentralized finance (DeFi) platforms – Opyn, Inc., ZeroEx (0x), Inc. and Deridex, Inc. – with operating illegal derivatives trading services. Notably, the CFTC reprimanded the smart-contract based trading platforms for supporting tokens that were issued by third-parties. Just a week earlier, a New York court dismissed similar claims against Uniswap in a class action case, with a judge arguing that the decentralized exchange platform was not accountable for third-party “scam tokens” listed to its platform. The CFTC charges were significant in the context of the wider U.S. regulatory landscape. For several years now, the CFTC and Securities and Exchange Commission have been in a jurisdictional turf war over who should regulate the U.S. crypto industry. The industry has generally lobbied in favor of oversight by the CFTC, which holds a reputation as the less strict agency, but last week’s aggressive CFTC actions drew long-standing assumptions about the regulator into doubt. On the other hand, CFTC Commissioner Caroline Pham did pitch a relatively crypto-friendly, “time-limited” program last week to pave the way for regulated crypto markets and tokenization."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xNC90d28tZXRoZXJldW0tcml2YWxzLW92ZXJ0YWtlLWNhcmRhbm8tb24tb25lLWNyaXRpY2FsLW1ldHJpYy1zYXlzLWNyeXB0by1hbmFseXRpY3MtZmlybS1zYW50aW1lbnQv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzE0L3R3by1ldGhlcmV1bS1yaXZhbHMtb3ZlcnRha2UtY2FyZGFuby1vbi1vbmUtY3JpdGljYWwtbWV0cmljLXNheXMtY3J5cHRvLWFuYWx5dGljcy1maXJtLXNhbnRpbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Two Ethereum Rivals Overtake Cardano on One Critical Metric, Says Crypto Analytics Firm Santiment - The Daily Hodl",
        "content": "Blockchain analytics platform Santiment says that two Ethereum (ETH) rivals are surpassing Cardano (ADA) in one major area.\n\nAccording to a new Santiment blog post, Polkadot (DOT) and its canary test network Kusama (KSM) are now seeing more development activity on the development hosting platform GitHub than Cardano during the past 30 days.\n\n“It is many of the usual suspects that currently make up this top 10 ranking board, with Polkadot’s and Kusama’s shared Github repository overtaking Cardano’s rate of development once again, after ADA was outpacing them earlier this summer.”\n\nBoth Polkadot and Kusama registered 570.1 Github commits in the past 30 days, leading all other crypto assets. Cardano came in third with 548.77 Github commits in the past 30 days.\n\nSantiment says that development activity shows “which projects are putting in the most effort to improve and innovate their existing products.”\n\nDOT is trading for $4.02 at time of writing. The 13th-ranked crypto asset by market cap is up 0.6% in the past 24 hours.\n\nKSM, the 173rd-ranked crypto asset by market cap, is trading at $18.07 at time of writing and is up 0.1% in the past day.\n\nADA is trading at $0.24 at time of writing. The eighth-ranked crypto asset by market cap is down 0.3% in the past 24 hours.\n\nThe firm also says that other projects experiencing notable development activity include blockchain oracle Chainlink (LINK) and peer-to-peer decentralized storage network Filecoin (FIL).\n\n“Looking at more recent times, it does appear that Chainlink’s team has been raising its development rates quite notably. Filecoin’s team is also starting to pick up some steam since July.”\n\nLINK is trading at $5.97 at time of writing. The 23rd-ranked crypto asset by market cap is down 0.4% in the past 24 hours.\n\nFIL is trading at $3.17 at time of writing. The 32nd-ranked crypto asset by market cap is up 1.2% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tZXRoZXItbWl4ZWQtZXRmLW5hc2RhcS1oYXNoZGV40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Nasdaq's Hashdex mixed Ether ETF filing joins crypto ETF race - Cointelegraph",
        "content": "The Nasdaq stock exchange has submitted an application to the Securities and Exchange Commission (SEC) seeking approval to list an Ethereum Exchange-Traded Fund (ETF) offered by Hashdex, an asset management company. This ETF is designed to include a combination of spot ether holdings and futures contracts in its portfolio and pioneering a new approach to cryptocurrency investment within the regulatory framework.\n\nKnown as the Hashdex Nasdaq Ethereum ETF, this investment fund is the first '33 Act Ethereum futures filing of futures Ethereum under the ‘33 Act and is overseen and supervised by Toroso Investments. Toroso Investments is registered as a commodity pool operator with the Commodity Futures Trading Commission (CFTC) and is also a member of the National Futures Association.\n\nThe current surge in cryptocurrency ETF applications has placed significant emphasis on whether the proposed funds intend to include futures contracts or spot assets. While the SEC has granted approval for the former, the latter remains unapproved. Fund managers appear to be exploring a middle-ground option, testing their chances in this regulatory landscape.\n\nThe primary investment goal of the Hashdex fund is to ensure that its shares mirror the daily fluctuations in the Nasdaq Ether Reference Price. To achieve this objective, the fund intends to allocate its assets to investments in ether, ether futures contracts traded on the CME, as well as cash and cash equivalents. Nasdaq said in the 19b-4 form:\n\n\"Instead of holding 100% spot Ether, which could make it more susceptible to price manipulation in the spot market, the Fund will hold a mix of Spot Ether, Ether Futures Contracts, and cash,\"\n\nThe Fund aims to decrease its reliance on the spot market and address worries regarding potential manipulation in unregulated Ether spot exchanges by including Ether Futures Contracts and cash in its holdings, it elaborated.\n\nRelated: Franklin Templeton files for spot Bitcoin ETF\n\nHashdex joined the competition for a spot Bitcoin (BTC) exchange-traded fund in the United States. However, Hashdex’s approach differs from recent filings as it won’t depend on the Coinbase surveillance sharing agreement, opting to acquire spot Bitcoin from physical exchanges within the CME market.\n\nIn the previous week, both Ark Invest and 21Shares submitted applications to the SEC for a spot ether ETF, a type of ETF also being pursued by VanEck. The SEC has thus far deferred its determinations on all the applications it has received for spot cryptocurrency funds.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aXRoLWNodXJuLWxpbWl0LW9uLXRoZS1yaXNlLXdpbGwtZXRoLWRpdGNoLXRoZS1iZWFycy_SAcMBaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLXdpdGgtY2h1cm4tbGltaXQtb24tdGhlLXJpc2Utd2lsbC1ldGgtZGl0Y2gtdGhlLWJlYXJzLz91dG1fc291cmNlPXJzcyZ1dG1fbWVkaXVtPXJzcyZ1dG1fY2FtcGFpZ249ZXRoZXJldW0td2l0aC1jaHVybi1saW1pdC1vbi10aGUtcmlzZS13aWxsLWV0aC1kaXRjaC10aGUtYmVhcnMmYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Ethereum: With churn limit on the rise, will ETH ditch the bears? - AMBCrypto News",
        "content": "Ethereum increased the Churn Limit to 12, aiming to enhance network scalability and security.\n\nThe price of ETH declined along with its volume.\n\nEthereum[ETH], despite its recent struggles in achieving positive price momentum, has been actively working on network improvements. One notable development was the increase in Ethereum’s Churn Limit, which saw a recent rise from 11 to 12. This adjustment is part of ongoing efforts to enhance the network’s efficiency and scalability.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nRising Churn Limit\n\nThe Churn Limit plays a crucial role in Ethereum’s blockchain, as it regulates the number of validators allowed to join or exit the network within a specific timeframe. By increasing this limit, Ethereum aims to accommodate more validators, thereby strengthening network security and decentralization.\n\nYesterday, the churn limit increased from 11 to 12. Next churn limit increase projected to occur around October 4! H/t: @dapplion pic.twitter.com/ftwhRxbGFE — Christine Kim (@christine_dkim) September 11, 2023\n\n\n\nHowever, it’s essential to consider the Ethereum entry queue’s behavior. This queue, which represents validators waiting to join the network, has been gradually decreasing since its peak on 10 June. The ongoing trend suggested that if no new validators join the network by the end of September, the number of pending validators could return to zero.\n\nDespite these challenges, Ethereum has been making notable improvements in terms of its Churn Rate, reflecting the network’s dedication to optimization. Furthermore, the number of Ethereum validators also grew from 880,000 to 924,024, showcasing a continued interest in supporting the network’s security and operations.\n\nState of the validators\n\nValidator Attestations, vital for confirming transactions and maintaining Ethereum’s blockchain integrity, witnessed a decline in the past month. These attestations serve as a critical aspect of Ethereum’s security framework and require careful monitoring to ensure the network’s reliability.\n\nHowever, daily validator income has shown limited growth, with an average daily income of $0.000236 ETH. This income level may not be attractive enough to incentivize potential validators to participate actively, potentially slowing down network expansion.\n\nIn parallel to these technical challenges, Ethereum’s market performance has faced hurdles. The price of Ethereum remains below $1,623, and trading volume also decreased. Thus, contributing to the overall uncertainty within the Ethereum community.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nFurthermore, Ethereum experienced a setback when Vitalik Buterin’s Twitter account was compromised in a security breach. It was later confirmed that a SIM swap attack was used to gain unauthorized access to his account, involving manipulation of the telecom company T-Mobile to access his SIM card."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tZXRoLXRvLWZhbGwtYmVsb3ctOTAwLW5leHTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum: ETH To Fall Below $900 Next? - Watcher Guru",
        "content": "Ethereum is trading in the $1,600 range, and the asset is finding it hard to gather momentum to breach the $2,000 mark. ETH has fluctuated between the $1,500 and $2,000 mark in 2023. The world’s second-biggest cryptocurrency is treading cautiously in the indices and is down nearly 15% since last month.\n\nHowever, leading cryptocurrency analyst Nicholas Merten warned that Ethereum could crash and fall below the $1,000 mark. According to his prediction, ETH could trade in three digits on the charts and plummet to $890 levels.\n\nAlso Read: XRP Could Reach $10,000 For Its Role in CBDCs, Predicts Analyst\n\nEthereum: ETH Could Be Poised For a Crash & Trade Below $1,000, Predicts Analyst\n\nSource: CNN\n\nMerten explained to his half-million subscribers on YouTube that Ethereum had more than a year to break out of an ascending triangle pattern. He said that ETH’s inability to climb above its resistance in the bullish formation makes the cryptocurrency weak and most likely headed for a crash.\n\nAlso Read: ‘Solana a Solid Bet for the Next Bull Run’ Predicts Analyst\n\nSource: YouTube DataDash / Nicholas Merten\n\n“Ethereum cannot show up to the plate. It keeps getting shot down to $2,000, and that’s okay for a while. But eventually, you’ve got to be able to either break out to the upside or if you break through the ascending line of support to the downside, that spells bad news. That is a failed technical pattern,” he said.\n\nThe analyst explained that things could get worse for ETH from here and might go below the $1,000 mark. “So if we are not going to catch a bid here, then that means we’re probably going to revisit $1,100. The previous support range, or come down to $890 like we were back here in June.”\n\nAlso Read: Dogecoin: How Much Could You Earn if You Invested $1,000 5 Years Ago?\n\nAt press time, Ethereum was trading at $1,616 and was up 1.7% in the 24-hour day trade. However, ETH is down close to 69% from its all-time high of $4,878, which it reached in November 2021."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xNC9jcnlwdG8tdHJhZGVyLXNheXMtb25lLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tcHJpbWVkLXRvLWRvLWJpZy1udW1iZXJzLXVwZGF0ZXMtb3V0bG9vay1vbi1iaXRjb2luLWFuZC1wb2x5Z29uL9IBkwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xNC9jcnlwdG8tdHJhZGVyLXNheXMtb25lLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tcHJpbWVkLXRvLWRvLWJpZy1udW1iZXJzLXVwZGF0ZXMtb3V0bG9vay1vbi1iaXRjb2luLWFuZC1wb2x5Z29uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Crypto Trader Says One Ethereum-Based Altcoin Primed To ‘Do Big Numbers’, Updates Outlook on Bitcoin and Polygon - The Daily Hodl",
        "content": "A closely followed crypto trader says that one mid-cap altcoin is primed for a significant rally in price.\n\nPseudonymous trader Altcoin Sherpa tells his 196,300 followers on the social media platform X that blockchain oracle Chainlink (LINK) will likely break out of a months-long trading range in the next bull market cycle.\n\n“LINK: 500 days of accumulation/chop/ranging for one of the best crypto projects that is the core infrastructure for thousands of projects. I think LINK is going to do big numbers next cycle and is one of the few I’d probably hold. Not a good trading vehicle right now though.”\n\nLooking at the trader’s chart, LINK has traded since May 2022 within a range with an upper bound of $9.33 and a lower bound of $5.52.\n\nNext, the trader predicts that Bitcoin (BTC) will likely cross the 200-day simple moving average (SMA), which indicates bullishness.\n\n“BTC: would like to see a four-hour close above and continuation. A retest would actually be healthy too.”\n\nLooking at his chart, the trader suggests Bitcoin is likely to break out to $26,700 and then retest the $26,300 level before continuing a rally to $28,000 by September 18th.\n\nBitcoin is trading for $26,666 at time of writing, up 1.3% in the last 24 hours.\n\nThe trader also weighs in on the scaling solution Polygon (MATIC). He predicts Polygon could see a more than 42% decline due to a lack of trading interest if it loses support at the $0.50 level.\n\n“MATIC: Not sure why anyone would buy this one, to be honest. Headed back to the $0.30-$0.45 area IMO (in my opinion).”\n\nMATIC is trading for $0.52 at time of writing, up 1.3% in the last 24 hours.\n\nLastly, the trader predicts a collapse for the native token of the Bored Ape Yacht Club community ApeCoin (APE) as it retests the $1.14 level.\n\n“APE: This is why you don’t lock coins up in general. This is the last stand for this sh*tcoin. Might be worth a punt if you’re into knife catches. That said, I don’t really see any sort of narrative or reason for this to go up. NFT (non-fungible token) market dead right now.”\n\nAPE is trading for $1.14 at time of writing, up 0.1% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtd2FsbGV0cy1zYXctc2Vjb25kLW1vc3QtYWN0aXZlLWRheS1zaW5jZS1sYXVuY2jSAVBodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLXdhbGxldHMtc2F3LXNlY29uZC1tb3N0LWFjdGl2ZS1kYXktc2luY2UtbGF1bmNoP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Wallets Saw Second Most Active Day Since Launch - U.Today",
        "content": "Advertisement\n\nAs Ethereum (ETH) has started slowly recovering from a dramatic two-month decline, its activity reaches the second greatest level in over eight years. Santiment experts claim that this might be a potential bullish sign.\n\n1.1 million wallets: Second most active day in Ethereum's (ETH) history\n\nYesterday, Sept. 13, 2023, 1,089,893 unique wallets transacted on the Ethereum (ETH) network as either a sender or recipient of Ether. So far, this is the second largest number in Ethereum's (ETH) mainnet history, as noticed by leading on-chain data analysis platform Santiment.\n\n😮📊 The #Ethereum network just saw 1,089,893 unique wallets acting as a sender or receiver of $ETH on Wednesday, the 2nd highest amount in the asset's 8+ year history. This historic anomaly could be the capitulation signal needed for prices to rebound. https://t.co/JF0g8vvBWs pic.twitter.com/1dRnPCjxcA — Santiment (@santimentfeed) September 14, 2023\n\nTypically, this metric ranges between 300,000 and 450,000 wallets; that said, yesterday, the network witnessed a 150-200% mysterious spike. Per Santiment analysts, this striking upsurge might be \"the capitulation signal needed for prices to rebound.\"\n\nThe most active day in Ethereum's (ETH) history was registered on Dec. 9, 2022, after the collapse of the FTX/Alameda ecosystem. It preceded a painful Ethereum (ETH) price decline to its multimonth low below $1,160. More than 1.42 million of Ethereum (ETH) accounts transacted in a record-breaking day.\n\nAs covered by U.Today previously, yesterday, a whopping amount of 640,000 Ethers (ETH) was withdrawn by users of centralized exchanges. Experts foresee volatility coming, as major Ethereum (ETH) activity metrics are rocketing.\n\nEthereum (ETH) close to having first \"inflationary\" week in a long time\n\nDespite this mini-rally, net activity on the Ethereum (ETH) network remains very low. As such, its EIP 1559-enabled token burn process is slowing down while the issuance rate remains stable.\n\nIn the last seven days, Ethereum (ETH) validators received 15,610.53 Ethers (ETH), as calculated by Ultrasound Money tracked. Meanwhile, only 11,762.10 Ethers (ETH) were destroyed in the corresponding period.\n\nAs such, Ethereum (ETH) lost its deflationary status that used to excite network enthusiasts. As of today, Ethereum (ETH) is subject to 0.167% per year inflation.\n\nEthereum (ETH) is changing hands at $1,619 on major spot platforms, up 1.3% in the last 24 hours."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9uYXNkYXEtc2Vla3Mtc2VjLWFwcHJvdmFsLWZvci1taXhlZC1ldGhlcmV1bS1ldGYv0gFOaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL25hc2RhcS1zZWVrcy1zZWMtYXBwcm92YWwtZm9yLW1peGVkLWV0aGVyZXVtLWV0Zi8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Nasdaq Seeks SEC Approval for Mixed Ethereum ETF - CryptoPotato",
        "content": "Nasdaq, the renowned stock exchange, has officially filed with the Securities and Exchange Commission (SEC) to list an Ethereum ETF in partnership with Brazilian asset manager Hashdex, who expressed interest in holding both spot ether and futures contracts.\n\nNasdaq Partners with Hashdex on ETH ETF Application\n\nThe partnership will result in the creation of the Hashdex Nasdaq Ethereum ETF, managed and controlled by Toroso Investments. As a registered commodity pool operator with the Commodity Futures Trading Commission and a member of the National Futures Association, Toroso Investments holds an influential position in this venture.\n\nThe proposed Ether ETF has gotten attention for its intention to hold both futures contracts and spot funds. This strategic move is in response to the SEC’s approval of futures contracts while rejecting spot products.\n\nAccording to the 19b-4 form, the Hashdex fund aims to reflect daily changes in the Nasdaq Ether Reference Price and will invest in ETH, Ether futures contracts listed on the CME, cash, and cash equivalents.\n\nThe fund will diversify its holdings across Spot Ether, Ether Futures Contracts, and cash. This approach intends to lessen the fund’s reliance on the spot market, thereby mitigating potential manipulation concerns in unregulated Ether spot exchanges. Instead, the fund will rely on Ether Futures Contracts and Ether futures EFPs traded on the regulated CME Market, ensuring high transparency and oversight levels.\n\nHashdex’s CEO Confident in Future Spot BTC ETF Approval\n\nEarlier this year, Marcelo Sampaio, the CEO and co-founder of Hashdex, stated that his firm prefers to cooperate with regulators rather than take legal action against them. This was a reference to Grayscale Investments, who won a lawsuit against the SEC after its proposed spot bitcoin ETF was rejected. Sampaio also expressed confidence in the eventual approval of a spot Bitcoin ETF, although the timeline and circumstances are still uncertain.\n\nMeanwhile, Ark Invest and 21Shares made a pioneering application last week with the SEC for this initiative to launch the ARK 21Shares Ethereum ETF. This product is set to become the first US ETF backed by Ethereum, the second most valuable cryptocurrency after Bitcoin.\n\nThe applications occur amidst a growing competition to approve the first US spot Bitcoin ETF. Despite multiple rejections due to fraud and price manipulation concerns, many analysts view Grayscale Investments’ recent lawsuit victory against the SEC as a potential catalyst for future approvals of such funds."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGVjcnlwdC5jby8xNTY0OTgvZnR4LWdldHMtYXBwcm92YWwtdG8tc2VsbC1iaXRjb2luLWV0aGVyZXVtLXNvbGFuYdIBUWh0dHBzOi8vZGVjcnlwdC5jby8xNTY0OTgvZnR4LWdldHMtYXBwcm92YWwtdG8tc2VsbC1iaXRjb2luLWV0aGVyZXVtLXNvbGFuYT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "FTX Gets Court Approval to Sell Billions in Bitcoin, Ethereum and Solana - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCollapsed digital asset exchange FTX was today given the green light to sell billions in crypto assets by the judge overseeing its bankruptcy proceedings.\n\nJudge John Dorsey on Wednesday approved that the defunct crypto brand can now sell $3.4 billion in Solana, Ethereum, Bitcoin, and other assets at the U.S. Bankruptcy Court for the District of Delaware.\n\nThe company’s plan for offloading the assets, first outlined in August, will appoint Mike Novogratz’s Galaxy Digital as the investment manager overseeing the sale. According to the plan, FTX will cap its selling at $100 million worth of tokens per week, a limit that could be increased to $200 million on an individual token basis.\n\nAD\n\nAD\n\nJudge Dorsey will allow FTX to raise its weekly maximum if the company gets written authorization from the court. But a footnote on the order clarifies that sales of Bitcoin, Ethereum, stablecoins, and the redemption of stablecoins will not count towards the $100 million weekly limit. Calculation of the limit will also exclude transactions made to bridge tokens from non-native blockchains back to their native networks.\n\nFTX quickly and unexpectedly went bankrupt last November due to alleged criminal mismanagement.\n\nBillions of dollars in customer cash disappeared and now the exchange’s new management now is working to pay back creditors. Selling these assets will help plug the hole, which originally stood at $7 billion.\n\nA Monday court filing showed that FTX owns $1.16 billion in Solana (SOL), $560 million in Bitcoin (BTC), $192 million in Ethereum (ETH), and $137 million in Aptos (APT). The crypto prices in the court document are based on pricing from August 31.\n\nSome $800 million in cash and public equity has already been recovered.\n\nAD\n\nAD\n\nEx-CEO and co-founder of FTX Sam Bankman-Fried is awaiting a massive criminal trial in October after his crypto behemoth went bust last year.\n\nFeds arrested and hit the fresh-faced ex-Jane Street trader and MIT graduate with 13 criminal charges, including wire fraud, securities fraud, conspiracy to commit bank fraud, and defrauding the Federal Election Commission."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLTEwLWJpbGxpb24tdHJhZGluZy12b2x1bWUtY29tZXMtY2FuLWJ0Yy1yZWFjaC0xMDAwMC5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction as $10 Billion Trading Volume Comes In – Can ETH Reach $10,000? - Cryptonews",
        "content": "Ethereum Price Prediction as $10 Billion Trading Volume Comes In – Can ETH Reach $10,000?\n\nETH Chart / Source: TradingView\n\nEther (ETH), the cryptocurrency that powers the world’s largest and most widely used smart-contract-enabled layer 1 blockchain Ethereum, has been nudging higher in recent trade and was last changing hands around 0.5% higher in the last 24 hours in the $1,610 area, now up close to 5% from earlier weekly lows in the $1,530s.\n\nCrypto markets have seen a broad recovery since jitters regarding FTX’s plans to sell $3.4 billion in digital assets weighed on sentiment earlier in the week.\n\nDigital asset investment firm Arca’s CIO Jeff Dorman was quoted in the crypto press on Tuesday as saying that the market reaction to potential FTX sales was an overreaction.\n\n“The way crypto market makers and traders are front-running the FTX supply shows a complete misunderstanding of how a syndicated sale process works,” he said, adding that “this isn’t an every-man-for-himself VC unlock… This is a court-ordered process that Galaxy will sell very slowly and opportunistically”.\n\n24-hour trading volumes of nearly $10 billion in the Ether market, as per CoinGecko, suggest potential dip buying activity.\n\nUS Inflation Continues to Fall\n\nElsewhere, US inflation data, despite the headline YoY and Core MoM numbers coming in a little above expected, may also be cushioning sentiment.\n\nThat’s because the YoY rate of Core inflation posted a big decline to 4.3% from 4.7%, easing pressure on the Fed to continue hiking interest rates.\n\nThe US central bank embarked on a historic interest rate hiking cycle last March and has since lifted interest rates 525 bps to 5.25-5.5%.\n\nCore inflation is more closely monitored by the Fed as, according to them, it gives a better representation of price pressures in the US economy than the headline figures, which can be easily buffeted by volatile food and energy prices.\n\nWith interest rates already well above the Core inflation rate, meaning a positive real interest rate, the Fed will want to avoid tightening financial conditions too much, as they still hope to achieve a “soft-landing” scenario for the US economy, defined as bringing inflation under control without causing a recession.\n\nPrice Prediction – Where Next for Ether (ETH)?\n\nRecent Ether price stabilization will not assuage fears about a price drop to sub-$1,500 levels, given the cryptocurrency’s still unfavorable near-term technical outlook.\n\nEther remains stuck below its 21DMA, which has been offering strong resistance recently, as well as below a downtrend that began in August.\n\nA break above these resistance levels will be needed for the short-term outlook to improve.\n\nFor now, with Ether in the process of forming a bearish descending triangle structure, a drop to sub-$1,500 levels remains a strong possibility.\n\nA potential retest of the March lows around $1,370 remains a strong possibility.\n\nArguably, the fundamental outlook doesn’t warrant a decline back to such levels, so strong dip buying would be likely.\n\nEther future ETF approvals in the US are likely in the next few months, with spot ETF approvals likely next year.\n\nMeanwhile, Ether has for now been able to avoid the US SEC’s wrath of being labeled as a security (unlike major rivals like BNB, SOL and ADA).\n\nIt seems likely that after 2022’s slump, Ether remains in the early accumulation stages of a new bull market that is yet to really get going.\n\nCan ETH Reach $10,000?\n\nIf Ether is in the early stages of a new bull market, big gains could lie ahead.\n\nETH posted gains of 5,700% from its December 2018 bear market lows of around $70 to its 2021 record highs in the $4,800s.\n\nWith the market has matured and higher market caps achieved over time, Ether is unlikely to post another 5,700% gain from its 2022 lows at $880 this bull market, which would take its price to over $50,000 and market cap to over $11 trillion.\n\nBut could ETH rally 11x from its 2022 lows to rise above $10,000 in the coming years?\n\nAbsolutely, assuming the Ethereum blockchain is able to maintain its rapid adoption and position as the dominant Web3 infrastructure provider.\n\nRemember, ETH is deflationary thanks to its token burn mechanism, more ETH are constantly being removed from supply as ETH staking gains ground, and one of the fastest areas of crypto growth is in the Ethereum layer-2 protocol space (the likes of Arbitrum, Optimism, Base and Polygon), all of which rely on Ethereum’s underlying security.\n\nEthereum will also be undergoing major network upgrades to address scalability concerns in the coming quarters, further boosting its use case, such as danksharding.\n\nA price of $10,000 at the current supply of just over 120 million ETH tokens would imply a market cap of around $1.2 trillion, which seems very reasonable and attainable in the coming years, assuming a broad crypto bull market that also sees the likes of Bitcoin rally into the $100,000s per coin.\n\nAlternatives to Consider\n\nIt’s always smart for crypto investors to hedge their bets, given the unpredictability of the market.\n\nOne excellent Ether (ETH) alternative that crypto investors should consider is a new coin being launched by Wall Street Memes, one of the internet’s largest retail investing communities.\n\nWall Street Memes, with its over 1 million following across various social media channels, has traditionally described itself as “the king of stonks” (stocks for the uninitiated), but is also looking to claim the crown of being “the king of crypto”, with the launch of its very own meme coin token $WSM.\n\nThe presale of $WSM has been a resounding success, with over $25 million raised, and dozens of major crypto industry influencers and analysts backing the coin for major success.\n\nAnd investors are running out of time to get involved, with the presale scheduled to end in under 14 days.\n\nGet in now on a token that could match or even surpass the likes of Pepe Coin, Dogecoin and Shiba Inu.\n\nBuy $WSM Here\n\nDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9tZXRhbWFzay1sYXVuY2hlcy1zbmFwcy10by1leHBhbmQtY29tcGF0aWJpbGl0eS1iZXlvbmQtZXRoZXJldW0v0gFdaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL21ldGFtYXNrLWxhdW5jaGVzLXNuYXBzLXRvLWV4cGFuZC1jb21wYXRpYmlsaXR5LWJleW9uZC1ldGhlcmV1bS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "MetaMask Launches Snaps to Expand Compatibility Beyond Ethereum - CryptoPotato",
        "content": "The popular Web3 wallet has officially unveiled a novel feature called ‘Snaps,’ which paves the way for its expansion beyond the confines of Ethereum.\n\nThis marks a new dawn for developers and users of Metamask, who will benefit from interoperability and compatibility for different non-EVM blockchains.\n\nThe inception of this feature traces back to a proposal by Dan Finlay, the co-lead developer in Metamask, to construct a platform welcoming developers to build permissionless solutions that integrate with the wallet.\n\nFollowing significant advancement, the concept envisioned by Dan Finlay is becoming a reality with the introduction of Metamask Snaps in Extension v11.0+.\n\nMetamask defines Snaps as novel features developed by third parties that users can directly install into their wallets without permission. The project offers a functionality allowing anyone to add features from other independent developers straight into their Metamask wallet.\n\nAccording to Metamask;\n\n“Snaps run in a sandboxed environment and use a permissions model to protect your data and respect your consent. Snaps do not have access to your MetaMask account data. When installing a Snap, make sure you understand what permissions you are granting.”\n\nSources indicate that Metamask engaged with about 150 different devs in developing this new functionality. The launch of Snaps is a giant leap forward for innovation grounded in Metamask, propelling the decentralization movement into a new era.\n\nhttps://www.youtube.com/watch?v=KvVwXoep9oE&t=1s&ab_channel=CryptoPotato\n\nSnaps Welcome Interoperability with non-EVM Blockchains\n\nAs indicated in Metamask’s snap directory, 34 snaps are integrated and ready to use by crypto investors at launch. Based on Metamask, one of the primary classes of the allowlisted ‘Snaps’ focuses on the interoperability and compatibility of Metamask with non-EVM blockchains, including Solana, Bitcoin, Algorand, Cosmos, and more. There are two Solana-focused, 1-Algorand-focused, and 1 Bitcoin-focused Snaps.\n\nThe BTCSnap is the first-ever product allowing users to manage BTC directly within Metamask without wrapping the tokens.\n\nAlgorand Foundation now has an Algorand Snap, which allows people to manage, swap, and transfer accounts directly with Metamask.\n\nSolflare Wallet and Drift Labs have launched different integrations of Solana wallets so investors can swap, stake, connect to Solana Dapps, and even bridge from EVM to SOL with utmost ease.\n\nMore interoperability-focused snaps already launched include Tezos-Metamask-Snap, CubeSigner, Cosmosnap, Consensys/Starknet Snap, and Mina Portal, etc.\n\nNotification and Transaction Insight Snaps\n\nAside from the interoperability Snaps, Metamasks brought the Notification and Transaction insights the new feature as well. Notification snaps bring with them chat features and notifications provided directly into Metamask. Examples of such tools include Push Snap by Push V1, Walletchat-Metamask Snap, and more.\n\nTransaction Insight Snaps are features that bring clear and in-depth analysis of blockchain transactions. Such Snaps include Forta network-Metamask Snap, risk detect-snap, Blockfence-insights, Tenderly Snap, and Wallet Guard."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aWxsLWV0aC1yZWFsbHktZHJvcC10by0xMDAwLWV0aGVyZXVtLXByaWNlLWFuYWx5c2lzL9IBUmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aWxsLWV0aC1yZWFsbHktZHJvcC10by0xMDAwLWV0aGVyZXVtLXByaWNlLWFuYWx5c2lzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Will ETH Really Drop to $1,000? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has been making lower highs and lows recently, following a decisive reversal from the key $2,000 area. Considering the current market structure, more downside can be expected.\n\nTechnical Analysis\n\nBy Edris\n\nThe Daily Chart\n\nOn the daily chart, the price has recently broken below the $1,650 support. However, this level is currently being retested. A further bearish continuation is likely if the price fails to climb above the broken level soon.\n\nThe recent bearish crossover between the 50-day and 200-day moving averages is also a negative signal, indicating the potential beginning of a downtrend in the coming weeks.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour timeframe, it is evident that after weeks of testing the $1,650 support zone, the price has finally broken through and is currently pulling back towards it.\n\nIf the market rises above the $1,650 level in the coming days, a rally toward $1,750 is imminent. Otherwise, a deeper decline would materialize, spreading fear among investors and making them wonder if the bear market may not be over yet.\n\nOn-Chain Analysis\n\nBy: Edris\n\nEthereum Taker Buy Sell Ratio\n\nOver the past few weeks, Ethereum’s price has been trending down after being rejected from the $2,000 resistance level multiple times. Analyzing the futures market sentiment can provide insights into the current situation.\n\nThis chart shows the taker buy-sell ratio with a 30-day moving average applied to enhance visualization. The metric indicates whether buyers or sellers are executing their orders more aggressively. Positive values are associated with bullish sentiment, and negative values are considered bearish.\n\nThis metric has been trending in the negative region over the past few months, indicating that futures market traders are bearish on ETH. As long as this is the case, there is a low probability of a bullish reversal in the short term."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vdS50b2RheS9lbm9ybW91cy1hbW91bnQtb2YtZXRoZXJldW0tZXRoLXJhcGlkbHktbGVhdmluZy1leGNoYW5nZXPSAU1odHRwczovL3UudG9kYXkvZW5vcm1vdXMtYW1vdW50LW9mLWV0aGVyZXVtLWV0aC1yYXBpZGx5LWxlYXZpbmctZXhjaGFuZ2VzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Enormous Amount of Ethereum (ETH) Rapidly Leaving Exchanges - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nA recent data dump from IntoTheBlock reveals a puzzling trend: a whopping 640,000 ETH has exited exchanges. This mass exodus of Ethereum from trading platforms was not exactly on anyone's bingo card, especially given Ethereum's recent market performance. As of the latest data, Ethereum is priced at approximately $1,598.67. So, what is fueling this unexpected dynamic?\n\nAdvertisement\n\nFirst, accumulation. The outflow could be a bullish sign, indicating that investors are hoarding Ethereum for the long haul. However, it is essential to note that Ethereum's long-term performance has been bearish. This makes the accumulation theory a bit shaky but still plausible. Investors might be seeing this as an opportune moment to stock up on Ethereum at a lower price point.\n\nSource: TradingView\n\nAnother angle to consider is portfolio de-risking. Some whales might be liquidating their Ethereum holdings — not because they have lost faith in the asset, but perhaps to diversify their portfolios. In a volatile market, putting all your eggs in one basket is rarely a good idea.\n\nThe sudden drop in exchange reserves also opens up a conversation about liquidity. Reduced liquidity could lead to increased volatility, which traders should keep an eye on.\n\nWhile the reasons behind this massive outflow remain speculative, the data do not lie. Ethereum is seeing a significant shift, and whether it is for accumulation or diversification, the impact on the market will be worth monitoring.\n\nIs this the calm before a storm, or is it a storm in itself? Only time will tell. But one thing is certain: the Ethereum landscape is shifting, which might lead to an unexpected surge of volatility."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZm91bmRlci1tYWtlcy1zdXJwcmlzaW5nLXByZWRpY3Rpb24tb24tc2VjLWNyeXB0by1yZWd1bGF0aW9u0gFdaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1mb3VuZGVyLW1ha2VzLXN1cnByaXNpbmctcHJlZGljdGlvbi1vbi1zZWMtY3J5cHRvLXJlZ3VsYXRpb24_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Founder Makes Surprising Prediction on SEC Crypto Regulation - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum cofounder and ConsenSys CEO Joseph Lubin comments on the SEC's ongoing legal battles with crypto businesses.\n\nAdvertisement\n\nThe U.S. Securities and Exchange Commission (SEC) has filed lawsuits against crypto firms, alleging that most crypto tokens are securities and that crypto firms must first register them with the regulatory agency before selling them.\n\nAs reported, in a written testimony presented at the House hearing on Tuesday, SEC chair Gary Gensler cited noncompliance with the securities law in the crypto industry as the reason for the filing of several enforcement actions.\n\nAs the SEC seeks to perpetuate its regulation-by-enforcement agenda, the cofounder of Ethereum, Joseph Lubin, predicts that \"clear heads will prevail.\"\n\n\"I anticipate that, with previous technologies like the internet, the web, and cryptography, clear heads will prevail,\" Lubin told CNBC.\n\nLubin also sees the U.S. setting the pace in regulation, while the rest of the world will follow suit: \"America will see that decentralized protocols, blockchain, and cryptocurrency are aligned with the philosophies of the U.S. And I think much of the rest of the world will follow suit.\"\n\nThe CEO of ConsenSys also commented on SEC Chair Gary Gensler's belief that most cryptocurrencies will pass the investment contract test. He argues that such a claim cannot be made without evidence.\n\n\"Gensler indicated that he feels that many tokens are securities, although they really need to be demonstrated to be that. He can’t just make that pronouncement, \" the ETH cofounder stated.\n\nLubin maintains his stance that Ethereum is a commodity.\n\nSEC v. Crypto: No backing down\n\nAs the legal battle between Ripple and the Securities and Exchange Commission (SEC) nears its conclusion, the company's president, Monica Long, has declared that the firm will not back down from the fight.\n\nLast month, Coinbase moved to dismiss the SEC lawsuit, while notable individuals and organizations joined the case as amicus curiae, among which are six securities law scholars from notable universities. LBRY, despite losing its summary judgment against the SEC, recently filed a notice of appeal."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMimgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtaXMtYnRjLXJlYWR5LWZvci1hLXB1bGxiYWNrLW9yLWlzLWl0LWEtZmFrZS1vdXQtMjAyMzA5MTMyMTI20gGeAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtaXMtYnRjLXJlYWR5LWZvci1hLXB1bGxiYWNrLW9yLWlzLWl0LWEtZmFrZS1vdXQtMjAyMzA5MTMyMTI2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Is BTC ready for a pullback or is it a fake out? - FXStreet",
        "content": "Share:\n\nBitcoin price has risen above the $25,586 resistance level as it gingerly treads a recovery higher.\n\nEthereum price recoups losses, but the $1,800 psychological level could be difficult to overcome.\n\nRipple price decisively breaks above a bearish channel at $0.4600, but growing headwinds leave a lot to be determined.\n\nBitcoin (BTC) price is leading the rest of the market, including Ethereum (ETH) and Ripple (XRP) prices, north, with momentum indicators painting a bullish picture. However, investors must exercise caution from here on out, with a lot still to be determined.\n\nAlso Read: US CPI annual inflation comes in above expectations at 3.7%, Bitcoin price rests above $26,000\n\nBitcoin price forging an uptrend\n\nBitcoin (BTC) price is forging an uptrend after two successive green candlesticks. While the outlook appears promising, investors should exercise caution lest the recovery prove fake.\n\nFor the bullish perspective, the Relative Strength Index (RSI) moving north points to rising momentum, which is corroborated by the green candlesticks of the Awesome Oscillator (AO). Furthermore, RSI is converging bullishly with Bitcoin price adding weight to prospects of an uptrend. This is indicated by BTC price’s recent streak of lower lows, which were not mirrored by the RSI.\n\nFurthermore, BTC has retained above the last higher low of the previous uptrend – the June lows at $24,800. Given this key level has held, the market structure remains long-term positive, making a recovery a real possibility.\n\nIn an uptrend scenario, Bitcoin price could break past the resistance confluence between the 50- and 200-day Simple Moving Averages (SMA) before confronting the 100-day SMA, with the three moving averages converging around the psychological $28,000. This makes this obstacle a formidable one. A confirmed breach above the $28,838 resistance level would increase the odds for a continuation north.\n\nBTC/USDT 1-day chart\n\nOn the flipside, a strong resistance barricade hovers above Bitcoin price, indicated by the 50-day SMA (short-term moving average) crossing below the 200-day SMA (longer-term moving average). Any move up to this cluster of MAs will likely be met with technical selling pressure.\n\nThis technical formation is also what is known as a ‘death cross’ which is when the 50-day SMA crosses below the 200-day SMA, and signals oncoming bearishness in the market. However, it is not a textbook version of the pattern as the 200-day SMA is rising as the 50 crosses below it. Ideally, for a five-star set-up, both MAs should be falling.\n\nA bearish reversal could, nevertheless, send Bitcoin price back below $25,586, or in a dire case, to test the $24,000 psychological range. The June lows at $24,800 are a key make-or-break level, and if breached could flip the script for the lead crypto.\n\nAlso Read: Bitcoin price rise pulls crypto market cap above $1 trillion; US headline CPI forecast to rise; core to fall\n\nEthereum price could have trouble overcoming the $1,800 hurdle\n\nEthereum (ETH) price is recovering, like BTC, but overhead pressure seems to be gathering up. To the upside, the 50-day SMA could reject ETH, or worse, the confluence between the 100- and 200-day SMA, at around the $1,800 psychological level, present a formidable resistance level. A break above this hurdle could see ETH tag $1,919 – levels last tested around mid-July.\n\nThe RSI is northbound, converging bullishly with price, and bolstered by the green bars of the AO’s histograms, adding credence to the bullish thesis.\n\nETH/USDT 1-day chart\n\nOn the other hand, Ethereum price still risks a correction, considering the pattern of lower lows and lower highs since the April highs were lost. Bears still have a presence in the ETH market, as indicated by the mixed AO histogram.\n\nShould the optimistic forecast fail, Ethereum price could break below the $1,552 support level, or in the dire case, extend toward the $1,407 support level, thereby reclaiming the March 11 lows. This would indicate a 12% slump below current levels.\n\nAlso Read: Total Crypto market cap falls below $1 trillion as whales dump Bitcoin and Ethereum\n\nRipple price faces strong headwinds after a bullish breakout\n\nRipple (XRP) price successfully broke out from a bearish falling channel, which it then pulled back for a retest and final leg-up goodbye. If it continues to hold above this channel for the second consecutive day it could turn the upper boundary of the descending channel into support at $0.4600.\n\nHowever, Ripple price faces strong opposition, with the 200-, 100-, and 50-day SMAs, acting as resistance levels to cap the upside potential for XRP at $0.5107, $0.5666, and $0.5753 levels respectively.\n\nXRP/USDT 1-day chart\n\nConversely, early profit takers could cut the budding uptrend short, sending Ripple price back into the confines of the descending channel. A decisive break below the midline of the channel at $0.4191 would invalidate the bullish outlook, possibly sending XRP to the channel’s lower boundary at $0.3562. Such a move would indicate a 25% crash below current levels.\n\nAlso Read: Ripple Price Forecast: XRP holders need to prepare for 25% crash"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9kZXNwaXRlLWNyeXB0by1tYXJrZXQtcm91dC1pbi10aGUtdXMtY2xlYXItaGVhZHMtd2lsbC1wcmV2YWlsLXNheXMtZXRoZXJldW0tY28tZm91bmRlci5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Despite Crypto Market Rout in the US, “Clear Heads Will Prevail,” Says Ethereum Co-Founder - Cryptonews",
        "content": "Despite Crypto Market Rout in the US, “Clear Heads Will Prevail,” Says Ethereum Co-Founder\n\nSource: Consensys / Zaza Weissgerber\n\nJoseph Lubin, the co-founder of Ethereum and the CEO of blockchain firm ConsenSys, is optimistic about crypto adoption in the US, similar to embracing “previous technologies like the internet.”\n\nIn a recent interview on CNBC’s ‘Capital Connection,’ he said that “clear heads will prevail” in the industry, despite the ongoing turmoil and regulatory uncertainties.\n\n“I anticipate that, with previous technologies like the internet, the web and cryptography, clear heads will prevail. America will see that decentralized protocols, blockchain, cryptocurrency are aligned with the philosophies of the U.S. And I think much of the rest of the world will follow suit.”\n\nLubin’s remarks come at a time when digital asset platforms including Binance and Coinbase are facing allegations from the US regulator for offering unregistered securities and a slew of other charges.\n\n“Ether is a Commodity”\n\nThe US Securities and Exchange Commission (SEC) under Chair Gary Gensler is viewing most tokens as securities, however, a year-long battle between Ripple Labs and the SEC over the nature of Ripple’s XRP token concluded in July, confirming that XRP is not a security when sold to the general public.\n\nReferring to Gensler’s remarks, Lubin said that crypto assets really need to be demonstrated to be a security. “He can’t just make that pronouncement,” Lubin added.\n\nHe also stood by his stance on calling Ether (ETH) a “commodity.” In March, Lubin made a statement, saying that Ether is more akin to a commodity like oil.\n\n“I stand by my conviction that ether is a commodity.”\n\nFurther, Lubin believes that “clear heads” in the crypto industry would prevail amid a crackdown on crypto companies. He said that the US still remains an example for a lot of countries."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tbGV2ZXJhZ2UtcmF0aW8tcmlzaW5nLXdoYXQtaXQtbWVhbi_SAVZodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLWxldmVyYWdlLXJhdGlvLXJpc2luZy13aGF0LWl0LW1lYW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Leverage Ratio Is Rising, What Does It Mean? - NewsBTC",
        "content": "Data shows the Ethereum leverage ratio has been going up recently, something that may lead to higher volatility for the asset’s price.\n\nEthereum Estimated Leverage Ratio Has Risen To 23% Now\n\nAs explained by an analyst in a CryptoQuant Quicktake post, the Ethereum leverage ratio is pointing at increased risk in the market. The “estimated leverage ratio” (ELR) refers to the ratio between the Ethereum open interest and derivative exchange reserve.\n\nThe former of these, the “open interest,” keeps track of the total amount of positions that are currently open in the ETH futures market, while the latter metric, the derivative exchange reserve, simply measures the number of tokens sitting in the wallets of all centralized derivative exchanges.\n\nThe ELR basically tells us about how much leverage the average user on the futures market is currently opting for. When this indicator has a high value, it means that the open interest has a significant value compared to the exchange reserve, and so, the average contract is going for a high amount of leverage.\n\nOn the other hand, low values imply that the futures market users aren’t willing to take risks at the moment as they haven’t taken any significant amount of leverage.\n\nNow, here is a chart that shows the trend in the Ethereum ELR over the last few years:\n\nThe value of the metric seems to have been heading up in recent days | Source: CryptoQuant\n\nHistorically, whenever the ELR has gone up, the price of the cryptocurrency has become more likely to show volatility. This is due to the fact that a higher amount of leverage means that the average contract becomes more likely to get liquidated.\n\nA large amount of liquidations happening at once can lead to chaos in the market, and since this is more likely to happen when the ELR is high, the price can naturally have a greater chance of turning volatile.\n\nAs displayed in the above graph, the Ethereum ELR had risen to some high values in August. As it usually plays out, this overleveraged market condition resulted in sharp price action for the asset, which, in this case, occurred in the form of a steep crash from the $1,800 level to the $1,600 level.\n\nThe ELR quickly cooled down to relatively low values with the crash, as the positions with the most leverage were weeded out. For a while, the metric moved sideways at these lows, but recently, the indicator has once again started to rise.\n\nAt present, the metric has a value of 23%, which isn’t as high as the pre-August crash value, but is still notable nonetheless. Huobi, Derbit, and OKX appear to have a disproportionate amount of leverage as compared to the wider sector, as the ELR for the platforms is currently 88%, 73%, and 43%, respectively.\n\n“When ELR increases, volatility tends to follow the same path,” notes the quant. “In this sense, Ethereum may be heading towards a period of increased turbulence.”\n\nETH Price\n\nEthereum had declined towards $1,500 at the start of the week but has since made recovery back above the $1,600 mark.\n\nETH has returned back to its consolidation level | Source: ETHUSD on TradingView\n\nFeatured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiwQFodHRwczovL3d3dy5hdGFsYXlhci5jb20vZW4vYXJ0aWN1bG8vZWNvbm9teS1hbmQtYnVzaW5lc3MvbW9uZXJvLXhybS1hdHRlbXB0cy10by1yZWNvdmVyLWV0aGVyZXVtLWNsYXNzaWMtZXRjLWRpcHMtaW4tbmV0d29yay1hY3Rpdml0eS1hbmQtcG9tZXJkb2dlLXBvbWQtdG8tc3Bpa2UtNDAwMC8yMDIzMDkxNDEwMDY1NTE5MDg4Ny5odG1s0gHFAWh0dHBzOi8vd3d3LmF0YWxheWFyLmNvbS9lbi9hcnRpY3Vsby9lY29ub215LWFuZC1idXNpbmVzcy9tb25lcm8teHJtLWF0dGVtcHRzLXRvLXJlY292ZXItZXRoZXJldW0tY2xhc3NpYy1ldGMtZGlwcy1pbi1uZXR3b3JrLWFjdGl2aXR5LWFuZC1wb21lcmRvZ2UtcG9tZC10by1zcGlrZS00MDAwLzIwMjMwOTE0MTAwNjU1MTkwODg3LmFtcC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Monero (XRM) Attempts to Recover, Ethereum Classic (ETC) Dips in Network Activity and Pomerdoge (POMD) to Spike 4,000% - Atalayar EN",
        "content": "Keywords Monero: Monero, Monero crypto, Monero price, Monero price prediction\n\nKeywords Ethereum Classic: Ethereum Classic, Ethereum Classic crypto, Ethereum Classic price, Ethereum Classic price prediction\n\nMeta Title: Monero (XRM) Attempts to Recover After Falling Hard, Ethereum Classic (ETC) Dips in Network Activity, Pomerdoge (POMD) to Spike 4,000%\n\nMeta Description: Learn about the future surrounding Monero, Ethereum Classic and Pomerdoge to see which altcoin can surge in value the most.\n\nThe privacy-oriented Monero (XMR) crypto has been falling in value, but analysts project that it can provide returns in 2023 for investors who jump into it now. Ethereum Classic (ETC) generated just $26 in fees during the span of 24 hours, worrying many investors about its future. Many are now turning their attention to Pomerdoge (POMD), a project that can dominate the P2E and meme-coin market in 2023.\n\nSummary\n\nMonero to reach $206.60\n\nEthereum Classic is projected to grow to $22.75\n\nPomerdoge can surge by 4,000% at launch\n\n\n\nClick Here To Find Out More About The Pomerdoge (POMD) Presale\n\nMonero (XMR) Price Projection\n\nThe Monero (XMR) cryptocurrency is privacy-focused and puts its priority on anonymity and security. Originally launched in 2014, the Monero crypto and network is built to be decentralized, open-source, and to let users transact without leaving any traces.\n\nHowever, while the Monero crypto does indeed offer many privacy features, this has also raised concerns about bad actors using the network. However, despite its appeal, the v price has been in decline.\n\nDuring the past month, the Monero crypto is down 13%. In the last week alone, it decreased by 3%. Now, it's hovering between $139 and $148, making $150 its next price barrier. According to the Monero price prediction, it can reach a maximum point of value at $206.60 by the end of the year.\n\nEthereum Classic (ETC) Future Outlook\n\nEthereum Classic (ETC) has tumbled in value recently and saw a dramatic rejection from severe resistance at around the 20DMA. Moreover, the Ethereum Classic network activity shows a decrease as well, especially when compared to the last bull market in 2021.\n\nAccording to on-chart data, the $2 billion project, Ethereum Classic, generated $26 in fees within the span of 24 hours on August 30. 2023.\n\nHowever, analysts are still bullish on the future of the Ethereum Classic crypto. According to the Ethereum Classic price prediction, it's projected to reach $22.75 by the end of the year.\n\nPomerdoge (POMD) to Provide Massive ROI\n\nPomerdoge is an upcoming project that will enable players the opportunity to take part in an exciting new P2E game whilst earning rewards. Each player gets rewards for their time while playing the Pomergame.\n\nEach player controls a Pomer, and their objective will be to build up their character to Elite Level in order to create their own custom items. In addition, upon reaching Gold Status, they unlock the ability to sell skins, items, and other valuables in the Pomerplace.\n\nAs for Pomerplace, there will also be an arena where players can battle with their Pomer against other members. There's also a collection of 7,777 NFTs. Each one will cost 0.2 ETH, but they will only be available to POMD token holders.\n\nThere will be a liquidity lock for life on top of Pomerdoge, while the team tokens will be locked for two years. During the current presale stage, a single POMD token sells for $0.0115. Analysts project that a growth of 4,000% is projected to occur at launch, making it a solid opportunity for investors to diversify.\n\nFind out more about the Pomerdoge (POMD) Presale Today:\n\nWebsite: https://pomerdoge.com/\n\nTelegram Community: https://t.me/pomerdoge"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vdS50b2RheS91bmV4cGVjdGVkLWV0aGVyZXVtLWV0aC1ib3VuY2Utd2hhdHMtcmVhbGx5LWJlaGluZC1pdNIBSWh0dHBzOi8vdS50b2RheS91bmV4cGVjdGVkLWV0aGVyZXVtLWV0aC1ib3VuY2Utd2hhdHMtcmVhbGx5LWJlaGluZC1pdD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Unexpected Ethereum (ETH) Bounce: What's Really Behind It? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum's price has been a roller coaster lately, but a recent uptick has everyone scratching their heads. As of the latest data, ETH is priced at $1,582.21. What is fueling this unexpected bounce?\n\nSome market watchers believe we are seeing the effects of mass capitulation among bearish traders. The theory goes like this: the recent price plummet that sent Bitcoin below $25,000 and Ethereum under $1,600 triggered a buying frenzy. Retail traders, sensing an opportunity, swooped in to snap up assets at bargain-basement prices.\n\nBut let's not get carried away. While the capitulation theory holds some water, it is crucial to remember that the crypto market is a complex beast. Multiple factors, often interlinked, contribute to price movements. So, while retail buying power might be a factor, it is unlikely to be the sole driver of Ethereum's recent price uptick.\n\nWhat is clear, however, is that the market is in a state of flux. Volatility is the name of the game, and Ethereum is no exception. Whether this bounce is a temporary blip or the start of a more sustained recovery remains to be seen. But for now, at least, Ethereum investors have a little something to smile about.\n\nXRP loses important support\n\nXRP's recent tumble below the pivotal $0.5 mark has traders on edge. This price level was not just a number; it served as a psychological bulwark, a line in the sand that many hoped would not be crossed. Yet here we are, with XRP currently trading at approximately $0.4776, according to the latest data.\n\nWhy does the $0.5 level matter so much? It is not just about the number itself but the sentiment it carries. When XRP held above this level, it was a sign of relative stability and investor confidence. Now that it has been breached, the market's mood has shifted, and not for the better. The RSI (Relative Strength Index) is also in oversold territory, adding another layer of concern.\n\nWhat is the next line of defense? If we look back at the price action in June and April of this year, the $0.45 level stands out as a robust support point. During those periods, the asset showed strong consolidation around this price, making it a likely candidate for the next battleground.\n\nThe breach of the $0.5 level could serve as a catalyst for further downward movement, especially if the market fails to recover swiftly. The next few trading sessions will be crucial in determining whether XRP can regain its footing or if it will continue its descent into more precarious territory.\n\nShiba Inu investors waking up\n\nWhile Shiba Inu's price might not be painting the rosiest picture — hovering around $0.00000722 according to recent data — the meme token is quietly making waves in another department. Specifically, its trading volume on Binance has skyrocketed by a staggering 200%, reaching a colossal three trillion. What's the story behind this volume surge?\n\nOne of the main reasons could be the increased activity of whales, which suggests a possible accumulation phase. Whales often have the foresight and resources to buy low and sell high, and their heightened activity could be a precursor to a future price uptick.\n\nSecondly, this volume explosion is not happening in a vacuum; it coincides with a market-wide price drop. This juxtaposition could imply that savvy traders are seizing the opportunity to buy the dip, anticipating a rebound. The surge in trading volume, especially during a market downturn, could be a bullish indicator disguised as a bearish trend."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9uYXNkYXEtbGlzdHMtZXRoZXItZXRmLW1peGVkLWNyeXB0by1mdW5kcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Could Mixed Spot/Futures Crypto Funds be the Way Forward? - CCN.com",
        "content": "Key Takeaways\n\nNasdaq has filed an SEC application to list an ETF that invests in both spot Ether markets and Ether futures.\n\nThe proposed fund would be issued by the Brazilian digital asset manager Hashdex.\n\nThe SEC has so far resisted spot crypto funds but endorsed their futures-based equivalents.\n\nCould mixed spot/futures ETFs could overcome the impasse?\n\nThe US Securities and Exchange Commission (SEC) has so far resisted allowing Exchange-Traded Funds (ETF) to directly hold cryptocurrencies. Yet, since 2021, several funds that invest in cryptocurrency futures markets have been approved.\n\nWith the SEC currently stalling its decision on several spot Bitcoin ETF applications, Nasdaq has proposed listing a mixed spot/futures fund as a novel third path.\n\nAssuaging SEC Concerns Over Market Manipulation\n\nOn Tuesday, September 12, Nasdaq filed an SEC application to list an ETF that invests in both spot Ether markets and Ether futures. The fund would be issued by Hashdex, a Brazilian firm specializing in digital asset management.\n\nThe decision to mix direct cryptocurrency investments with crypto futures is framed in terms that are designed to appease the SEC’s objections to spot crypto ETFs. Namely, the Commission’s concerns that spot cryptocurrency markets are vulnerable to manipulation.\n\nNasdaq’s filing argues that “instead of holding 100% spot Ether, which could make it more susceptible to price manipulation in the spot market, the Fund will hold a mix of Spot Ether, Ether Futures Contracts, and cash.”\n\nSecuring a Role for the CME\n\nTo the SEC, allowing crypto futures ETFs is justified because futures contracts are issued by the Chicago Mercantile Exchange (CME).\n\nCrypto spot trades, on the other hand, are facilitated by exchanges that the SEC hasn’t sanctioned. (And which it therefore views illegal, according to the SEC’s classification of the majority of cryptocurrencies as securities.)\n\nIn response, to the SEC’s stance on spot crypto ETFs, the Nasdaq–Hashdex application insists that the fund will incorporate “dynamic investment restrictions,” designed to mitigate the risk of market manipulation.\n\nAs the filing notes, the fund would ensure that the CME is the only “market of significant size’” facilitating investments for the proposed ETF.\n\nOvercoming the ETF Impasse\n\nUltimately, critics have argued that the SEC’s logic is flawed and it has been questioned by US courts.\n\nRegardless of how much oversight the SEC exercises over the CME, crypto futures are still bound by the price of the underlying assets they track. They are thus subject to the same manipulation and volatility risks of crypto markets.\n\nThat being said, if they help appease the SEC and weaken its resistance to allowing ETFs to directly hold cryptocurrency, mixed funds could overcome a regulatory hurdle that has constrained the growth of crypto investment in the US."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiJWh0dHBzOi8vZmludHkuY29tL3VzL2NyeXB0by9ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Investing in Ethereum (ETH): The American investor's guide - Finty",
        "content": "Ethereum (ETH) is a second generation cryptocurrency. Launched in 2015, Ethereum has much in common with its first generation counterpart, Bitcoin.\n\nLike Bitcoin, Ethereum uses distributed ledgers and cryptography to facilitate digital transactions. However, Ethereum is much more than a medium of exchange. It uses blockchain technology to monetize and facilitate self-executing programmatic contracts via its native token, ether (ETH).\n\nEthereum is widely regarded as the hottest platform in the crypto world with a wide range of data friendly services. Though Bitcoin is bigger than Ethereum by volume, Ethereum is faster than its first generation counterpart with the ability to validate transactions in seconds.\n\nUse these guides to learn more about what it does, how it works, and how you can invest in it."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYm9sZC5jb20vdGhpcy1oaXN0b3JpYy1ldGhlcmV1bS1hbm9tYWx5LWNvdWxkLXNwYXJrLWh1Z2UtZXRoLXByaWNlLXJlYm91bmQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "This historic Ethereum anomaly could spark huge ETH price rebound - Finbold - Finance in Bold",
        "content": "It has been tough two years for Ethereum (ETH), losing around 65% of its value since 2021’s all-time high, and some holders could have been feeling it harder these days, with ‘capitulation signs’ amid six-month lows for ETH price, noted by analysts.\n\nHowever, after the capitulation, there is usually a price rebound – at least, this is what most experts will agree upon on market cycle theories.\n\nIn that sense, analysts from the Santiment’s Sanbase PRO reported on September 14 another major capitulation signal in what they called a “historic anomaly” observed in the Ethereum Network.\n\nAs reported, Ethereum hit over 1 million Daily Active Addresses (DAA) in a single day, which makes this the second all-time high for this metric in the network’s 8-year history.\n\nETH Daily Active Addresses “Ethereum has a massive spike in unique addresses interacting on Network, 2nd largest of all time”. Source: Santiment\n\nCapitulation signal on Ethereum’s Daily Active Addresses\n\nSantiment’s analysts believe this “historic anomaly” could be seen as a huge “capitulation signal needed for prices to rebound”. This supports the thesis that ETH price could see a recovery in the near future, as many holders had to realize losses in what could be the end of a cycle.\n\nDAA measures the number of unique addresses becoming active in a single day. Calculated by summing up sending and receiving transactions from these unique addresses, being more reliable data for the market’s sentiment than overall transaction activities, that could be inflated by a few addresses performing multiple sendings.\n\nNotably, Glassnode spotted an increase in this general data, as the number of sending addresses also hit an 8-month high of 17,364 this morning.\n\nETH number of sending addresses (hourly chart, 7d MA). Source: Glassnode\n\nEthereum price analysis\n\nMeanwhile, ETH is trading at $1,620 by press time, with daily gains of 1.35%, already showing a consolidation behavior after the massive drop on September 12 that took its prices lower than $1,550 per token.\n\nEthereum 1-week price chart. Source: Finbold\n\nNevertheless, the overall sentiment is still bearish in the crypto market. So, further price actions for the second largest cryptocurrency by market cap will also depend on news and developments related to the Ethereum ecosystem, as well as macro and microeconomics.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2ludHJ1c3QuY29tL21hcmtldC1uZXdzL2FzdGFyLW5ldHdvcmstYW5kLXBvbHlnb24tbGFicy1jb2xsYWJvcmF0ZS10by1wcm9wZWwtZXRoZXJldW0tc2NhbGFiaWxpdHktd2l0aC1hc3Rhci16a2V2bdIBhAFodHRwczovL3d3dy5jb2ludHJ1c3QuY29tL21hcmtldC1uZXdzL2FzdGFyLW5ldHdvcmstYW5kLXBvbHlnb24tbGFicy1jb2xsYWJvcmF0ZS10by1wcm9wZWwtZXRoZXJldW0tc2NhbGFiaWxpdHktd2l0aC1hc3Rhci16a2V2bS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Astar Network and Polygon Labs Collaborate to Propel Ethereum Scalability with Astar zkEVM - CoinTrust",
        "content": "Astar Network, a prominent player in Japan’s web3 landscape, has unveiled a groundbreaking initiative in collaboration with Polygon Labs. Their joint effort introduces the Astar zkEVM, a solution designed to enhance Ethereum’s scalability and pave the way for the next phase of blockchain adoption. Leveraging the Polygon Chain Developer Kit (CDK), this Ethereum Layer-2 (L2) scaling strategy positions Astar Network as a pivotal player in Japan’s blockchain ecosystem.\n\nEmpowering Ethereum L2 Scaling:\n\nThe Astar zkEVM represents a significant advancement in Ethereum L2 scaling. By integrating advanced zero-knowledge proofs into Astar’s existing technical suite, the aim is to make Ethereum more accessible to developers and businesses. This strategic partnership combines Astar Network’s extensive experience in collaborations with industry giants such as Sony, Toyota, and NTT Docomo, with the scalability expertise offered by Polygon’s zk-powered CDK. The outcome is poised to become Japan’s leading blockchain platform.\n\nWeb3 Mass Adoption:\n\nAstar and Polygon Labs are aligning their efforts to usher in the era of web3 mass adoption. Serving as a bridge for global enterprises, the Astar zkEVM is positioned to accelerate blockchain adoption not only in Japan but also internationally. It is anticipated to serve as a launchpad for gaming and entertainment ventures seeking entry into the Japanese market. The integration of zero-knowledge proofs and Ethereum Layer-2 scaling enhances Astar Network’s compatibility with Ethereum Virtual Machine (EVM) chains, contributing to the broader objectives of the web3 domain.\n\nSupport from Japanese Authorities:\n\nThe timing of the Astar zkEVM launch is significant, given the open endorsement of web3 technologies by Japanese officials and Prime Minister Fumio Kishida’s recognition of their transformative potential. Recent efforts by the Financial Services Agency (FSA) to simplify tax protocols further underscore the government’s support for blockchain innovation. Astar Network’s zkEVM solution is poised to play a pivotal role in driving this evolution forward.\n\nSota Watanabe, Founder of Astar Network, emphasized the importance of their collaboration with Polygon, stating, “Our launch of Astar zkEVM, in conjunction with Polygon, will bolster Ethereum’s efficiency and safety, positioning Japan at the forefront of web3 innovation.”\n\nEnhanced Efficiency and Security:\n\nThe Astar zkEVM introduces features akin to the Ethereum Virtual Machine, with a focus on amplified security and ease of integration. This approach simplifies the journey for both developers and users venturing into the web3 space. Given Astar Network’s strong connections in Japan’s enterprise, entertainment, and gaming sectors, the partnership with Polygon Labs promises the development of groundbreaking web3 applications.\n\nAstar Network’s Role:\n\nAstar Network occupies a crucial position as a portal for enterprise, entertainment, and gaming projects, significantly contributing to global web3 acceptance. The network, powered by Polkadot and Polygon, serves as a trailblazer in the Japanese blockchain market. The introduction of their new Layer-2 solution, Astar zkEVM, showcases the utilization of zero-knowledge (ZK) technology to enhance the web3 experience on the Ethereum platform.\n\nPolygon Labs’ Expertise:\n\nPolygon Labs specializes in crafting scaling solutions for the Polygon ecosystem. The lab collaborates closely with developers, offering a robust, secure, and environmentally friendly blockchain framework for web3 applications. Their suite of protocols facilitates developer access to critical scaling solutions, with several of their innovations already integrated into decentralized applications. Polygon Labs hosts prominent web3 projects such as Aave and Uniswap and collaborates with well-known entities like Adobe.\n\nConclusion:\n\nThe collaborative effort between Astar Network and Polygon Labs, resulting in the Astar zkEVM, marks a significant milestone in Ethereum’s journey towards enhanced scalability and accessibility. As Japan embraces web3 technologies, this partnership positions Astar Network as a key player in the nation’s blockchain evolution and offers a promising path to web3 mass adoption, both domestically and internationally. With an emphasis on efficiency, security, and integration, the Astar zkEVM is poised to unlock new possibilities for developers and users in the web3 space, reaffirming the role of blockchain technology in shaping the future."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90b3AtMy1yZWNlbnQtcHJpY2UtcHJlZGljdGlvbnMtYml0Y29pbi1idGMtcmlwcGxlLXhycC1ldGhlcmV1bS1ldGgv0gFgaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3RvcC0zLXJlY2VudC1wcmljZS1wcmVkaWN0aW9ucy1iaXRjb2luLWJ0Yy1yaXBwbGUteHJwLWV0aGVyZXVtLWV0aC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Recent Price Predictions: Bitcoin (BTC), Ripple (XRP), Ethereum (ETH) - CryptoPotato",
        "content": "It is safe to assume that crypto investors are quite intrigued by the future price of some of the most popular digital currencies. Being among the largest by market capitalization, Bitcoin (BTC), Ripple (XRP), and Ethereum (ETH) have gathered much of the interest.\n\nIn the following lines, we will take a closer look at some of the recent price predictions regarding the aforementioned crypto assets.\n\nWhat Does the Future Hold for Bitcoin?\n\nNumerous finance experts and crypto proponents have supported the thesis that the primary cryptocurrency will surpass the $100,000 milestone sooner or later. Such examples are Robert Kiyosaki (the author of the best-seller Rich Dad, Poor Dad), Adam Back (CEO of Blockstream), Tom Lee (Managing Partner at Fundstrat), Anthony Scaramucci (former White House official), and many others.\n\nOne of the most recent forecasts came from analysts of Pantera Capital, who predicted that the leading digital asset could tap almost $150,000 sometime next year. According to them, the driving factor for the price increase will be the BTC halving that will take place in 2024.\n\nOther events that could prompt a rally are the potential approval of a spot Bitcoin ETF in the US, the Fed halting its aggressive interest rate policy, adoption from a leading corporation (such as Apple, for example), etc.\n\nHow About XRP?\n\nThe native token of Ripple has also been in the spotlight lately (especially after the crypto firm secured a partial victory in its lawsuit against the SEC in July). Back then, XRP skyrocketed above $0.80 while many bulls expected to see the price surpassing the $1 mark.\n\nHowever, the asset failed to keep the momentum and plunged in the following months to its current level of approximately $0.48 (per CoinGecko’s data).\n\nThe popular cryptocurrency analyst Shannon Thorp recently made the bold forecast that XRP could reach $500 in the next four years, considering that the total value of cross-border payments tap $250 trillion by 2027.\n\nIf the coin indeed explodes to such a level, it would mean that its market capitalization will stand at around $260 trillion (about 260 times greater than the current market cap of the entire crypto industry).\n\nAnother fact that shows how prosperous this forecast might sound is the sector’s condition during the bull market in 2021. Back then, BTC hit an all-time high price of almost $70K, whereas the total market capitalization of the industry was nearly $3 billion at its peak (120 times shy of the target envisioned by Thorp).\n\nETH Might Plummet\n\nThe latest Matrixport analysis (reported by CryptoPotato) estimated that the second-largest cryptocurrency by market cap could nosedive to $1,000 (or drop to a 15-month high) based on the ecosystem’s revenue projections.\n\nThe entity also touched upon FTX and its creditor’s plan to sell billions in crypto assets, including ETH. It believes this could be another factor pushing the coin’s valuation south."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wb2x5Z29uLWFsbG9jYXRlZC0xLWJpbGxpb24tZG9sbGFycy16ay1yb2xsdXBz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Polygon co-founder: $1B bet on ZK-rollups paying off - Cointelegraph",
        "content": "Polygon co-founder Sandeep Nailwal believes the layer-2 blockchain firm is reaping the benefits of allocating $1 billion to develop zero-knowledge (ZK) proof-powered scaling solutions for the Ethereum ecosystem.\n\nSpeaking at a keynote address during the latest edition of the Token2049 conference in Singapore, Nailwal touched on the development of “Polygon 2.0” scaling efforts and the promise of recursive ZK-proof technology to create a seamless interoperable blockchain ecosystem.\n\nPolygon co-founder Sandeep Nailwal at Token2049 in Singapore.\n\nNailwal highlighted how Web2 and Web3 are similar in form and function, with the former serving as the internet of information with “practically unlimited scalability” as well as the ability to transfer or convey information in various forms seamlessly across the world at great speeds.\n\nRelated: Polygon’s ‘holy grail’ Ethereum-scaling zkEVM beta hits mainnet\n\nWeb3, meanwhile, represents the “internet of value,” which, according to Nailwal, will require two capabilities to become ubiquitous.\n\n“Firstly, infinite, unlimited, unbounded scalability and unified liquidity for value to be transferred, there cannot be 100 chains with the value distributed across them, and they cannot interoperate.”\n\nIn order to tap into the characteristics that have made Web2 able to become the internet of information, Nailwal pointed to the importance of an aggregator or interoperability layer to amalgamate ZK-proofs of different chains into a common layer.\n\n“The moment those two proofs are submitted on Ethereum layer, we have a mechanism where we have a global state route on Ethereum, and then any kind of liquidity can move across the chain without coming to Ethereum.”\n\nRecursive ZK-proof technology holds the key to this aggregator layer, which Nailwal expects to be deployed in the coming months. The technology will allow different blockchains to submit ZK-proofs of their network state to the aggregator, which then submits a proof of these combined attestations to the Ethereum network.\n\n“Our goal is that this proving will eventually go down to, like, probably two seconds. So, every chain is submitting a proof of whatever has happened on their ecosystem or on their chain every two seconds to this aggregator layer.”\n\nThe Polygon co-founder believes that cross-chain transactions could be executed in four to five seconds, one third of an Ethereum block time, which will begin to feel “like one single big block space.”\n\nNailwal highlights the potential benefit of having high liquidity chains like their zkEVM and proof-of-stake chain to share value to applications while noting that larger layer-1 blockchain platforms have expressed interest in tapping into an interoperable layer.\n\n“Anybody can join this layer, and it’s a mutual win-win because everybody benefits from each other’s liquidity.”\n\nPolygon zkEVM’s beta hit mainnet in March 2023, allowing developers to deploy smart contracts and decentralized applications that benefit from faster throughput and lower costs than Ethereum’s layer 1.\n\nThe company also recently launched its Chain Development Kit, which allows developers to build, customize and deploy layer-2 chains connected to the wider Ethereum ecosystem.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3Lm5lcmR3YWxsZXQuY29tL2FydGljbGUvaW52ZXN0aW5nL2ZpZGVsaXR5LWNyeXB0b9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Fidelity’s Crypto Platform Is Now Open. Is It Any Good? - NerdWallet",
        "content": "When Fidelity Investments rolled out its crypto service in 2021, it introduced digital assets for the first time to the company's approximately 40 million individual clients.\n\nCrypto isn't for everyone — it's risky, volatile and can be hard to navigate. Fidelity's product has simplified the process, largely by starting investors with just a few crypto options.\n\nFidelity Crypto could be appealing for investors who are curious about cryptocurrency and already know and trust Fidelity with their investments.\n\nBut if you’re already a hardcore crypto investor, chances are you’re not going to be interested in switching for these new offerings alone. While Fidelity’s low trading costs are competitive with some of the leading crypto exchanges, the selection and crypto functionality announced by the firm are not yet up to par.\n\nFor instance, Fidelity offers only two cryptocurrencies: Bitcoin and Ethereum. And users can't send or receive cryptocurrency from their accounts, a must for users who want to use crypto for payments or to access blockchain-based services on the web. You can sell crypto for fiat money, though.\n\n» Learn more: Read our review of Fidelity's brokerage.\n\nAdvertisement Charles Schwab Interactive Brokers IBKR Lite Webull NerdWallet's ratings are determined by our editorial team. The scoring formula for online brokers and robo-advisors takes into account over 15 factors, including account fees and minimums, investment choices, customer support and mobile app capabilities. NerdWallet rating 4.9 /5 NerdWallet's ratings are determined by our editorial team. The scoring formula for online brokers and robo-advisors takes into account over 15 factors, including account fees and minimums, investment choices, customer support and mobile app capabilities. NerdWallet rating 5.0 /5 NerdWallet's ratings are determined by our editorial team. The scoring formula for online brokers and robo-advisors takes into account over 15 factors, including account fees and minimums, investment choices, customer support and mobile app capabilities. NerdWallet rating 4.7 /5 Fees $0 per online equity trade Fees $0 per trade Fees $0 per trade Account minimum $0 Account minimum $0 Account minimum $0 Promotion None no promotion available at this time Promotion None no promotion available at this time Promotion Get up to 75 free fractional shares (valued up to $3,000) when you open and fund an account with Webull. Learn More Learn More Learn More\n\nWhy you might want to sign up\n\nHere are a few factors to consider as you evaluate Fidelity's crypto offerings.\n\nCrypto trading fees\n\nFidelity is offering customers what it describes as “commission-free” crypto trading. That doesn’t necessarily mean trading is free. The company says it takes a spread of up to 1% on crypto trades.\n\nStill, that’s relatively good compared with other crypto services reviewed by NerdWallet. Coinbase, the largest U.S.-based exchange focused solely on crypto, often charges a fee of $2.99 on simple transactions, which would exceed 1% on small purchases.\n\nOther crypto services can have significantly higher fees, with some upward of 10% depending on how you pay.\n\nFunding and minimums\n\nFunding a Fidelity Crypto account could be easy if you already have a brokerage or cash management account with the company. You’ll be able to move money from Fidelity accounts into Fidelity Crypto.\n\nThere’s no minimum deposit to open a crypto trading account. And the minimum crypto purchase is $1, Fidelity says. These factors put the company on even footing with most other leading exchanges.\n\nIf you don’t have a Fidelity account, making purchases will require you to create and fund an account such as a brokerage or cash management account.\n\nWhy you might want to use another exchange\n\nAvailability\n\nFidelity Crypto is initially available 35 states. If you can’t access the service in your state, you’ll have to go with another option.\n\nCrypto selection\n\nFidelity Crypto’s offerings are on the low end among cryptocurrency platforms reviewed by NerdWallet. Granted, Bitcoin and Ethereum are the two most valuable cryptocurrencies, which means they are widely used and relatively well-established in this emerging sector.\n\nHowever, cryptocurrency traders often look at more options when they are buying and selling. Crypto.com, another major cryptocurrency exchange, has more than 300 cryptocurrencies for sale. Other brokerages also have more crypto options. SoFi, for example, has about 20.\n\nIt may turn out that Fidelity follows the path of other brokerages, such as Robinhood, which started with limited crypto offerings, then expanded over time.\n\nFunctionality\n\nFidelity Crypto does not offer some of the advanced features available on competing exchanges. It doesn't allow staking, a process that allows owners of some cryptocurrencies to earn rewards similar to interest.\n\nAnd unlike some other crypto exchanges, Fidelity Crypto does not offer round-the-clock crypto transactions, with trading limited to 4 a.m. to 12 a.m. Eastern time.\n\nFinally, the company says it does not allow customers to transfer cryptocurrency out of their accounts or to external crypto wallets.\n\nTransfers are crucial if you want to do anything with cryptocurrency other than hold it in hopes that it will increase in value. You won’t be able to use crypto purchased through Fidelity on decentralized finance products, for instance.\n\nTrack your finances all in one place. Find ways to save more by tracking your income and net worth on NerdWallet. Sign Up\n\nThe bottom line"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGVjcnlwdC5jby8xNTYxOTEvYW5jaWVudDgtbGF1bmNoZXMtYS13ZWIzLWdhbWluZy1sYXllci0yLWNoYWluLW9uLWV0aGVyZXVt0gFZaHR0cHM6Ly9kZWNyeXB0LmNvLzE1NjE5MS9hbmNpZW50OC1sYXVuY2hlcy1hLXdlYjMtZ2FtaW5nLWxheWVyLTItY2hhaW4tb24tZXRoZXJldW0_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Ancient8 Launches A Web3 Gaming Layer 2 Chain on Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHCMC, Vietnam, September 13th, 2023, Chainwire\n\nToday marks a significant milestone for Ancient8 as the Ancient8 Chain, a gaming-focused community-driven Ethereum Layer 2 built to onboard the next 100 million Web3 citizens is finally launched.\n\nAncient8's journey is fueled by the spirit of innovation and unity. The team chose the Optimism Superchain as their leading tech stack to make Ethereum gaming accessible to everyone. The company offers a comprehensive suite of products that serve game studios, providing seamless access to launch, onboard, localize, market, and engage. Ancient8's chain is led by the parent company Ancient8 Collective, which comprises the entire core gaming partners. Together, the group fosters a decentralized community outlook that builds an inclusive ecosystem that empowers all.\n\nAD\n\nAD\n\nA Momentous Leap: Gaming Guild to Layer 2 Ecosystem\n\nIn 2021, Ancient8 began a mission as a Gaming Guild to introduce users to Web3 through gaming. It partnered with over 100 games to assist 200,000+ gamers in navigating Web3. During the rigorous work with dozens of partners and gamers, the team encountered the same challenges in Web3 gaming – most blockchains fall short in providing the tech, tools, and community needed for gaming. Games need a blockchain that can deliver seamless, high-performance gaming experiences that players and developers deserve.\n\nThus, Ancient8 is launching the Ancient8 Chain, a gaming-focused ETH Layer 2 chain that addresses these shortcomings head-on and is tailor-made for the unique demands for gaming.\n\nAncient8's goal is to onboard millions of users into Web3. To achieve this, strategic alliances were formed to develop cutting-edge software products, introducing the Ancient8 Ecosystem of builders. This ecosystem proudly hosts five protocols that serve web3 game studios - Space3, Dojo Launchpad, Eko ID, PlayNation, and Gosu Network. These projects are designed to empower users and developers, promoting collaboration within the thriving world of Web3 gaming.\n\nBuilding a Decentralized Future - The Ancient8 Foundation\n\nAD\n\nAD\n\nAs the world shifts towards a future with decentralized gaming, the founders opted to decentralize Ancient8 by establishing the Ancient8 Foundation. Ancient8 will no longer have a centralized team. The Ancient8 Chain ecosystem will be built collaboratively and decentralizely by the Ancient8 Collective, a group of 8 core partners comprised of top web3 gaming thought leaders who are committed to shaping the mainstream adoption of a decentralized world. The Ancient8 Foundation will focus on fostering adoption of the Ancient8 Chain and its decentralized governance.\n\nMetacyber8 Labs, a venture studio focusing on Web3 product development, will be the core contributor to build the Ancient8 Chain technology and some of its core ecosystem products.\n\nAncient8's singular purpose is to create a vibrant Metaverse, fostering endless possibilities and innovation.\n\nAncient8 Chain: Unlocking the Future of Web3 Gaming on Optimism\n\nAncient8 doesn't just offer a gaming chain; it presents the unequivocal choice for web3 games. It's the ultimate solution for developers seeking to create immersive, scalable, and cost-effective blockchain games.\n\nWhat Sets Ancient8 Apart from the Rest?\n\n1. Scalable Gaming on Ethereum\n\nThe decision to build a Layer 2 on the OP Stack is rooted in the pursuit of creating the best possible infrastructure for web3 gaming. This decision aligns with Optimism's Superchain concept, offering both scalability and composability, thus empowering developers to create engaging experiences, and providing users with low-cost transactions. The Superchain vision ensures a future where scalability and different systems coexist, bringing more exciting possibilities to gaming and DApps.\n\nAD\n\nAD\n\nScalability and throughput advantages: The OP Stack offers a highly scalable solution, addressing Ethereum mainnet limitations. Integrated with Optimistic Rollups, Ancient8 Chain achieves impressive transaction throughput, ensuring smooth user experiences by eliminating congestion and delays that hinder web3 gaming adoption.\n\nThe OP Stack offers a highly scalable solution, addressing Ethereum mainnet limitations. Integrated with Optimistic Rollups, Ancient8 Chain achieves impressive transaction throughput, ensuring smooth user experiences by eliminating congestion and delays that hinder web3 gaming adoption. EVM compatibility: The OP Stack is fully compatible with the Ethereum Virtual Machine (EVM), enabling seamless code and infrastructure adaptation. This alignment, combined with a cost-efficient rollup architecture, enhances user accessibility, promoting interoperability and collaboration within the blockchain space.\n\nThe OP Stack is fully compatible with the Ethereum Virtual Machine (EVM), enabling seamless code and infrastructure adaptation. This alignment, combined with a cost-efficient rollup architecture, enhances user accessibility, promoting interoperability and collaboration within the blockchain space. Security and trust: Leveraging Ethereum's battle-tested security, Ancient8 Chain settles transactions on the mainnet, fostering user confidence in a trusted, decentralized network.\n\nLeveraging Ethereum's battle-tested security, Ancient8 Chain settles transactions on the mainnet, fostering user confidence in a trusted, decentralized network. Interoperability and collaboration: The OP Stack envisions uniting rollup architectures, promoting interoperability and collaboration in Chain. Ancient8 Chain becomes part of a vibrant ecosystem, pioneering the OP Chain gaming ecosystem, enabling developers to collaborate, share resources, and expand possibilities for web3 gaming.\n\n2. Robust Suite of Products\n\nAncient8's suite of products is strategically designed for the burgeoning Web3 gaming market, targeting an audience of over 100 million potential users. From building on Ancient8 Chain to launching with Dojo, onboarding with Space3, localizing with PlayNation, and marketing with Gosu Network, this comprehensive approach sets the stage for Web3 native game publishing and amplifies market presence. With a focus on emerging markets and a thriving gamer community of 200K+, Ancient8 stands at the forefront of game development innovation.\n\n3. Built by the Ancient8 Collective\n\nThe Ancient8 Chain ecosystem will be built collaboratively by the Ancient8 Collective, a group of core partners comprised of top web3 gaming thought leaders who are committed to shaping the mainstream adoption of a decentralized world. The Ancient8 Chain will be built by games, for games and gamers. This spirit of unity extends to all gamers, underscoring our commitment to inclusivity and shared growth.\n\nGlobal Expansion: Fueling Web3 Adoption Worldwide\n\nAncient8 Chain's launch opens a new chapter with a global focus, reaching out to audiences far beyond Southeast Asia. As the world witnesses a surge in crypto adoption and the explosive growth of web3 gaming, Ancient8 takes immense pride in its strong community and strives to provide the essential infrastructure for mass adoption. By embracing Ancient8 Chain, users and developers worldwide can be part of the blockchain revolution.\n\nThe potential for hundreds of millions of users across the globe to join the blockchain revolution now becomes a reality. Ancient8 is proud to lead this transformative journey, driving the expansion of web3 gaming while propelling blockchain towards its full potential.\n\nJoin Ancient8 in shaping the future of decentralized applications with Ancient8 Chain.\n\nAD\n\nAD\n\nAbout Ancient8\n\nAncient8.gg is a gaming-focused community-driven Ethereum Layer 2 built to onboard the next 100M Web3 citizens.\n\nAs a pioneering gaming ecosystem on the Optimism Superchain, Ancient8 utilizes OP Stack Layer 2 technology to offer blockchain games the best features of Ethereum, with no code changes needed, at a significantly reduced cost.\n\nThe platform is backed by the Ancient8 Collective, which comprises top web3 gaming thought leaders committed to promoting mainstream adoption of a decentralized world. We understand the challenges of web3 game development and provide fair distribution of resources through our transparent governance model.\n\nGames and protocols contributing to the growth of the Ancient8 Chain are eligible for both ecosystem and financial support.\n\nContact\n\nCore Contributor at Ancient8\n\nJustin\n\nContact@ancient8.gg\n\nDisclaimer: Press release sponsored by our commercial partners."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA5LzE0L2V0aGVyLXN0YWtpbmctbGFuZHNjYXBlLWdldHMtYm9vc3QtYXMtc3N2LW1haW5uZXQtc2Vla3MtdG8tZGlzcGVsLWNlbnRyYWxpemF0aW9uLWNvbmNlcm5zL9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA5LzE0L2V0aGVyLXN0YWtpbmctbGFuZHNjYXBlLWdldHMtYm9vc3QtYXMtc3N2LW1haW5uZXQtc2Vla3MtdG8tZGlzcGVsLWNlbnRyYWxpemF0aW9uLWNvbmNlcm5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ether Staking Landscape Gets Boost as SSV Mainnet Seeks to Dispel Centralization Concerns - CoinDesk",
        "content": "The launch comes as staking, the process used to secure the Ethereum blockchain, is run largely by centralized staking providers, which together hold more than 70% of the staked ether (ETH) supply. These include a number of centralized exchanges such as Binance, Coinbase, Kraken holding just about 18% of the total staked ETH. Liquid staking providers such as Lido, RocketPool, Stader and Stakewise account for more 36% – with Lido accounting for the lion’s share."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mbGlydHMtd2l0aC0yNjAwMC1ldGhlcmV1bS1uZWFycy0xNjAwLXRvbmNvaW4tcmlzZXMtOS0zOTgxNzgtMjAyMy0wOS0xM9IBlgFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2FtcC9jcnlwdG8vdG9rZW4vc3RvcnkvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tZmxpcnRzLXdpdGgtMjYwMDAtZXRoZXJldW0tbmVhcnMtMTYwMC10b25jb2luLXJpc2VzLTktMzk4MTc4LTIwMjMtMDktMTM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin flirts with $26,000; Ethereum nears $1,600; Toncoin rises 9% - Business Today",
        "content": "Bitcoin and other crypto tokens were struggling to hold gains on Wednesday as the digital asset market digested the negative blows from Binance and FTX. However, the majority of the tokens were inching up. The potential selling and layoff news is weighing on digital markets, while traders are on tenterhooks ahead of US economic data due later today.\n\nA joint policy paper on crypto published by the IMF and FSB warned jurisdictions against implementing blanket bans to mitigate risks associated with the sector, and recommended targeted restrictions and sound monetary policy instead. Targeted restrictions might come in handy for emerging economies in particular, it said.\n\nBitcoin posted mild gains as the largest crypto token rose about half a per cent, flirting with $26,000-levels. Its largest peer, Ethereum, also inched up slightly, to remain below $1,600-mark. Price action in the altcoins remained on the positive side in the morning.\n\nBitcoin’s trading price crossed the $25,900 mark, which could be a reflection of renewed market attention on the Bitcoin Spot ETF race. Franklin Templeton, a prominent asset management firm, has recently filed an application with the US SEC, which may have caused bullish sentiment in the market, said Edul Patel, Co-Founder & CEO at Mudrex.\n\n\"Moreover, the number of wallets holding 0.1 bitcoin surged to a record-breaking 12 million yesterday, indicating a rising level of confidence among market participants in Bitcoin. Meanwhile, Ethereum has been trading around the $1600 level,\" he added.\n\nBarring a few exceptions, all top crypto tokens were trading higher on Wednesday. Toncoin surged more than 9 per cent, while Tron jumped about 3 per cent. Among the losers, Solana, Polkadot and Dogecoin shed about a per cent each. Cardano was also down about half a per cent.\n\nThe global cryptocurrency market cap was trading slightly higher, rising to $1.03 trillion-mark, as it rose about one-third per cent in the last 24 hours. However, the total trading volumes dropped as much as 12 per cent to $32.09 billion.\n\nImage: Crypto-chart-price\n\nTech View by Giottus Crypto Platform\n\nOptimism (OP) is experiencing a short rally. The asset is showing signs of recovery including a breakout from its short-term descending channel. OP could hit its key 100-day moving average, around the $1.4mark. Its RSI reading is currently at 46.2 and has started moving upwards towards a neutral territory.\n\nImage: Chart-OP\n\nHowever, if OP is unable to break through the $1.5 barrier, the price may fall below current levels. The most recent low (about $1.2) serves as an early support level, with$1.12 providing the next line of defence.\n\nMajor Levels:\n\nSupport: $1.21, $1.12\n\nResistance: $1.4, $1.5\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9ldGhlci1hLTQwMC1iZW5qYW1pbi1jb3dlbi1hbnRpY2lwZS11bi1yZXBsaS1kdS1tYXJjaGUtY3J5cHRvLTIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum at $400: Benjamin Cowen Foresees a Crypto Market Retreat - Cointribune EN",
        "content": "Thu 14 Sep 2023 ▪ 3 min of reading ▪ by Fenelon L.\n\nMarket predictions in the crypto space often lead to spirited debates among investors. Recently, Benjamin Cowen, a respected analyst in the field, made some waves by forecasting a significant downturn for Ethereum (ETH) and Cardano (ADA).\n\nAlarming Projections for Ethereum and the Crypto Market\n\nFollowing the recent tumble of Bitcoin, which dragged down a large portion of the crypto market with it, renowned analyst Benjamin Cowen is anticipating an extended winter period for Ethereum and Cardano.\n\nIn a video, Cowen paints a bleak future for Ethereum. According to him, not only could Ethereum’s price decline, but it could also drop below the critical threshold of $800.\n\nHis analysis doesn’t stop there; he even envisions a potential drop to levels of $600, $500, or even $400.\n\nOutlining a trajectory for Ethereum, Cowen anticipates a mix of gradual declines and brief rallies, fueling an atmosphere of uncertainty. This volatility could persist until the end of the year, raising doubts among both optimistic and pessimistic investors. In such a context, significant losses could loom for market participants.\n\nCardano (ADA): Heading for an Imminent Decline?\n\nCowen’s outlook for Cardano, another major player in the crypto space, is equally gloomy. He draws parallels between a potential downturn in Cardano and a 50% drop in the Nasdaq. According to his estimations, Cardano could plummet to less than $0.20, down from a previous position of $0.37.\n\nHe doesn’t stop there. If Cardano were to fall by 27% from its current level, we could see a price near $0.16, a level last seen in August 2020. To bolster his analysis, Cowen also recalls other historical milestones for Cardano, including a peak at $0.11 in 2019 and pre-pandemic prices ranging from $0.07 to $0.08.\n\nFaced with this uncertainty, Cowen expresses reservations about the short-lived rebounds of Cardano, which could deceive investors and lead them to adopt risky strategies.\n\nCowen’s analysis serves as a reminder of the importance of exercising caution in the world of cryptocurrencies. However, it’s worth noting that these are his personal forecasts, which may or may not materialize. Meanwhile, the crypto sphere is holding its breath, anticipating the SEC’s resolution regarding the Ethereum Futures ETF. Its approval could potentially catalyze an upward trend for ETH and the entire crypto market.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vYmxvY2tzdGVyLmNvbS9ldGhlcmV1bXMtc3VwZXItcGxheWVyLWxheWVyLW4tcHJlcGFyZXMtdG8tc2hha2UtdGhlLWNyeXB0by13b3JsZC13aXRoLXVwY29taW5nLXRlc3RuZXQtbGF1bmNo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's Super Player, Layer N Prepares to Shake the Crypto World with Upcoming Testnet Launch - Blockster",
        "content": "I am the Co-Founder, Editor-In-Chief and Creative Director at Blockster. I curate our publication's stories, build partnerships with premium Web3 brands, and oversee our product direction."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmxlYXByYXRlLmNvbS9uZXdzL2V0aGVyZXVtLXVuZGVyLWZpcmUtZnJvbS1zZWMtb3Zlci1hbGxlZ2VkLXZpb2xhdGlvbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Ethereum under fire from SEC over alleged violations - Leaprate Forex Trading News",
        "content": "Ethereum, the cryptocurrency, is still under investigation from the U.S. Securities and Exchange Commission due to disputes over crypto tokens being made available and secure.\n\nIn a press release this week, Co-founder of Ethereum, Joseph Lubin suggested that clear heads and clarity of thinking are the best way to proceed through the investigation. This comes after the cryptocurrency has been hit by waves of regulatory boards demanding the tightening and transparency of crypto commodities, tokens and intermediaries.\n\nLubin stated:\n\nAmerica will see that decentralized protocols, blockchain, and cryptocurrency are aligned with the philosophies of the U.S. And I think much of the rest of the world will follow suit.\n\nIn March, Lubin told CNBC:\n\nPeople buy barrels of oil with the expectation of profit – I stand by my conviction that ether is a commodity.\n\nEthereum is not the only crypto company to face duress; Binance, Ripple, and Coinbase are also under the watchful eye of the SEC for violating security laws by selling native cryptocurrency XRP without registering it with the SEC.\n\nDon’t miss out the latest news, subscribe to LeapRate’s newsletter\n\nHowever, many crypto leaders have warned the SEC that their laws and regulations lack clear instructions. CEO of Binance, Changpeng Zhao indicated that the company would remove itself from U.S. users if the SEC does not implement better-outlined laws. This would damage the U.S. reputation as the global leader in crypto-related movement."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJhbmtsZXNzdGltZXMuY29tL25ld3MvMjAyMy8wOS8xNS91YXctc3RyaWtlLWltcGFjdC1vbi1ldGhlcmV1bS1jb3Ntb3MtYWxnb3JhbmQtamFzbXktY3J5cHRvLXByaWNlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "UAW Strike Impact on Ethereum, Cosmos, Algorand, Jasmy Crypto Prices - Bankless Times",
        "content": "Cryptocurrencies have done modestly well this week, with Bitcoin rebounding above $26,000 and the market cap of all digital coins soaring to $1.06 trillion. This happened after Franklin Templeton applied for its spot Bitcoin ETF, joining other companies like Blackrock, Invesco, and WisdomTree that are waiting for their approvals.\n\nCryptocurrencies reacted mildly to the strong US retail sales and inflation numbers that raised the possibility of more Fed tightening. The headline consumer price index (CPI) jumped to 3.7% in August, the biggest increase in months. Retail sales continued soaring, signaling that the American consumer is still strong.\n\nThe next key macro news that will move cryptocurrency prices will be the UAW strike in the United States. More than 150k workers will go to a strike after negotiations with the Big Three auto companies failed.\n\nThese workers, through their unions, are seeking several things, including a 40% pay increase, healthcare coverage, and job guarantees. Auto companies like Ford, GM, and Stellantis believe that these requests are extreme. Stellantis has even warned that it will relocate manufacturing of its trucks to Mexico.\n\nThis strike will have a major impact depending on how it lasts. First, the automobile sector is a major job creator in the United States. As such, a long strike will hurt the economy, the three auto companies, and their suppliers.\n\nMost importantly, this strike will lead to low new vehicle supplies in the US, which will lead to higher prices for new and used cars. Vehicles are some of the most important contributors of inflation in the US.\n\nHigher inflation, also because of soaring crude oil prices, will force the Federal Reserve to consider hiking interest rates in the coming meetings. In most periods, cryptocurrency prices tend to underperform in a period of high-interest rates.\n\nMeanwhile, millions of Americans are scheduled to restart paying their student debts later this month. And with the M2 money supply falling, there is a likelihood that these repayments will hit the economy and crypto prices.\n\nTherefore, the outlook of key cryptocurrencies like Ethereum, Cosmos ATOM, Algorand, and Jasmy is bearish. These coins will likely see weaker demand as people move to the relatively safe and high-yielding US dollar.\n\nRead more: How to buy Algorand.\n\nAccording to Crane Data, money market funds by companies like Western Asset, Federated Hermes, State Street, and Allspring Heritage are yielding over 5.45%. As such, many people will likely move to these liquid and safe assets as hopes of more Fed hikes rise."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaW5hbmNlLW9wdGltaXNtLXNjYWxpbmctcGxhdGZvcm0tb3AtYm5iLWhpdHMtbWFpbm5ldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "BNB Smart Chain Optimism-powered layer-2 opBNB hits mainnet - Cointelegraph",
        "content": "The BNB Chain blockchain ecosystem is set to tap into Optimism’s rollup technology, powering its newly launched opBNB layer-2 scaling platform.\n\nBNB Chain announced the public mainnet launch of its Ethereum Virtual Machine (EVM)-compatible L2, which delivers lower gas fees and faster transactions to decentralized applications running within the ecosystem.\n\nThe opBNB platform reportedly handled over 35 million on-chain transactions and saw more than 150 decentralized applications (DApps) deployed on its testnet. BNB Smart Chain also claims that the platform achieved a peak of 4,000 transactions per second during a stress test of its capabilities.\n\nRelated: Can the Optimism blockchain win the battle of the rollups?\n\nBNB Chain senior solution architect Arno Bauer highlighted scalability and security as top priorities for the scaling solution while meeting stringent criteria:\n\n“This included high availability, 4K transactions per second, rigorous stress testing, reduced gas costs under 0.2 gwei, fast finality under 1 second and enhanced security with multiple external audits.”\n\nAs Cointelegraph previously reported, opBNB is based on the Optimism OP Stack and is EVM-compatible, allowing it to interact with Ethereum-based smart contracts, networks and ERC-20 token standards.\n\nThis solution makes use of optimistic rollups to scale transactions by assuming that transaction data proven off-chain is valid until proven otherwise. The technology has been important in helping the Ethereum network scale, but critics highlight the week-long lockup of funds in these protocols, while validation checks are processed.\n\nOptimism has seen significant growth in daily transaction volumes processed and an increasing number of active daily addresses, suggesting that the layer-2 solution continues to offer value to users and DApps.\n\nA number of major decentralized finance (DeFi) protocols have also deployed on Optimism to harness its scaling capabilities. This includes the likes of Uniswap, Aave, 1inch Network, SushiSwap and Curve Finance.\n\nCointelegraph has reached out to BNB Chain to ascertain further details of opBNB’s development and other scaling solutions that may have been considered by the ecosystem.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTMvYm5iLWNoYWlucy1sYXllci0yLW5ldHdvcmstb3BibmItZ29lcy1saXZlL9IBWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMTMvYm5iLWNoYWlucy1sYXllci0yLW5ldHdvcmstb3BibmItZ29lcy1saXZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "BNB Chain’s Layer 2 Network opBNB Goes Live - CoinDesk",
        "content": "Projects can integrate with opBNB through BNB Chain’s extensive developer tutorial and dedicated technical support. To kickstart network activity, BNB Chain said it would soon roll out airdrop incentives alongside fifteen ecosystem projects to attract initial users and funds to the upstart network."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24td2hlcmUtbmV4dC1hcy1ldGgtZHJvcHMtdG8tbWFyY2gtbGV2ZWxzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Where Next As ETH Drops to March Levels - Analytics Insight",
        "content": "Ethereum (ETH) dropped below $1,600 on Monday dropping to $1,530, levels last seen in March. The largest altcoin by market capitalization briefly regained the $1,600 ground on Tuesday before dropping back to the current price at $1,589.\n\nThe drop in Ether’s price on Monday coincided with a surge in the movement of previously dormant ETH tokens away from old wallets, according to Santiment. The on-chain and social metrics intelligence platform posted the following chart on the social media platform X showing a noticeable increase in the most dormant ETH over three months, according to its Age Consumed on-chain metric.\n\n“A continued dip in mean $ age while prices drop is a capitulation sign, which foreshadows reversals”, the post read.\n\nThe decline to March levels could attract more buyers, who could take advantage of the dips and buy more ETH at a discount, targeting short-term profits once ETH rebounds toward the $2,000 psychological level. This means Ethereum is building up fresh momentum for a sustained recovery.\n\nEthereum Could Reach $2,000 in the Short Term\n\nIncreased buying from the $1,500 demand zone could push ETH first above $1,600 then to $1,800, and later to $2,000. A sustained break past $2,000 could usher Ethereum into a bull run that could take place between 2024 and 2025.\n\nThe RSI is pointing upwards and moving away from the oversold region. This suggested that the buyers had begun returning to the scene.\n\nETH/USD Daily Chart\n\nUpholding support at $1,600 could help ease the potential selling pressure that has continued to build up after the confirmation of a death cross pattern. This bearish signal occurred on September 1 when the short-term moving average, the 50-day SMA (yellow) crossed below a long-term 200-day sMA (purple).\n\nThe death cross adds credence to the bearish outlook, implying that sellers have the upper hand and the ongoing downtrend is far from over.\n\nUnless investors put the fear of uncertainty aside and rally behind Ethereum, the RSI will drop back into the oversold region, which will validate another sell-off to $1,450.\n\nNote that the longer the price stays below the $1,600 level, the higher the chances of another sell-off trimming gains and forcing investors to capitulate.\n\nAnalysts believe it is too early to rule out a potential drop to $1,000 – a level that would appear justified based on the revenue projection from the Ethereum ecosystem.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wb2x5Z29uLTItbWF0aWMtY29udmVyc2lvbi10by1wb2wtcHJvcG9zYWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Polygon 2.0 — MATIC conversion to POL outlined in preliminary improvement proposals - Cointelegraph",
        "content": "Polygon Labs’ vision of an interconnected layer-2 Ethereum ecosystem powered by zero-knowledge cryptography begins in earnest following three inaugural improvement proposals that will begin the transition to Polygon 2.0.\n\nThe scaling technology firm unveiled Polygon 2.0 in June 2023, outlining plans for a scaling ecosystem made up of four protocol layers. The staking, interop, execution and proving layers all play a role in creating an interconnected ecosystem of chains that enable fast value transfer and information sharing.\n\n1/ The wait is over. Polygon 2.0 implementation kicks off now with the release of 3 Polygon Improvement Proposals (PIPs), and a roadmap for Phase 0.https://t.co/gk7FW0zCpc pic.twitter.com/YJo3BtQy4y — Polygon (Labs) (@0xPolygonLabs) September 14, 2023\n\nPolygon co-founder Sandeep Nailwal recently unpacked how the ecosystem aims to become the value layer of the internet by using zero-knowledge (ZK) technology to provide low-fee, high-throughput performance to the wider Ethereum ecosystem.\n\nPolygon released three Polygon Improvement Proposals (PIPs) on Sept. 14 for community consideration and voting that are earmarked to begin taking place in the final quarter of 2023.\n\nRelated: Polygon’s ‘holy grail’ Ethereum-scaling zkEVM beta hits mainnet\n\nThe PIPs outline technical details for “Phase 0” of the establishment of a network of interconnected ZK-powered layer-2 chains that scale Ethereum. This includes a proposal for the transition and specifications that will see MATIC (MATIC) tokens become POL tokens, which will become the Polygon proof-of-stake (PoS) protocol’s native token.\n\nPIP-17 will include the initiation of the upgrade from MATIC to POL. This includes its transition to POL as the native gas token and staking token for the Polygon ecosystem, as well as the launch of the staking layer and migration of Polygon public chains.\n\nPIP-18 includes the technical description of POL tokens as well as accompanying contracts that will handle emission and token migrations. POL tokens can be migrated at a 1:1 ratio from existing MATIC tokens. The PIP notes an initial supply of 10 billion and a yearly emission of 2% equally distributed between validator staking rewards and a community treasury.\n\nLastly, PIP-19 proposes the update of the native gas token on Polygon PoS from MATIC to POL while ensuring maximum backwards compatibility.\n\nPolygon’s announcement notes that PIP-19 will not change contracts on Polygon PoS, while the properties of the protocol’s native token will not change either. However, contracts on Ethereum that are awaiting MATIC from the native MATIC bridge may be affected by the upgrade.\n\nMagazine: Here’s how Ethereum’s ZK-rollups can become interoperable"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNpdHlhbS5jb20vYml0Y29pbi1hbmQtZXRoZXJldW0tcHVzaC1vbi1hcy1hbm90aGVyLWFzc2V0LW1hbmFnZXItam9pbnMtZXRmLXJhY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum push on as another asset manager joins ETF race - CityAM - City A.M.",
        "content": "Bitcoin and Ethereum push on as another asset manager joins ETF race\n\nBitcoin continues to improve on its position in increments. The market leader is up 1.5% in the last day, trading above the key $26k level this morning.\n\nEthereum (ETH) is up 2.3%, while Solana (SOL) is showing a bit more pep and is up by more than 4%. Other cryptos like Polygon (MATIC) and Avalanche (AVAX) are also up by more than 1% over the last 24 hours.\n\nEarlier this week, Franklin Templeton, a global investment company, filed an application with the Securities and Exchange Commission (SEC) to launch a Bitcoin exchange-traded fund (ETF). In doing so, the company joins other global institutional investors such as BlackRock waiting on SEC approval.\n\nYesterday’s Crypto AM Daily\n\nIn the Markets\n\nThe Bitcoin Economy\n\n*Data can be found at https://terminal.bytetree.com/\n\n🌅Total crypto market cap\n\n🔵 $1.05 trillion\n\n🔺 1.66%\n\nWhat Bitcoin did yesterday\n\n🔺 Daily high $26,382\n\n🔻 Daily low $25,766\n\nBitcoin market capitalisation\n\n🟠 BTC $512,416 billion\n\n🟡 Gold $12.724 trillion\n\n💳 Visa $515.43 billion\n\nBitcoin volume\n\n🪣 Total spot trading volume $13.62 billion\n\n🔻 14.26%\n\nSP500\n\n🔺 0.12%\n\nFTSE/JSE Top 40\n\n🔺 0.24%\n\nFear and Greed Index\n\nBitcoin’s market dominance\n\n📊 50\n\nRelative Strength Index (RSI)\n\n💪 51\n\nValues of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price, while 30 or below indicates an oversold or undervalued condition.\n\n📣 What they said yesterday\n\nWhat Visa has said to the global banking community is “get your crypto act together or we might well go elsewhere to settle our merchants”. Steven Boykey Sidley, Professor and Head of the Blockchain and the Cryptoverse Research Group at the Institute for Future Knowledge\n\nCrypto AM: Editor’s picks\n\nFCA’s new crypto advertising rules met with mixed industry response\n\nChatGPT urges crypto conference panel not to become over-reliant on AI\n\nMt. Gox customers will have to wait until November to recover lost Bitcoin funds\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nMPs are falling silent over potential of cryptocurrency\n\nErica’s ‘Crypto Wars’ handed honours in Business Book Awards\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCrypto AM: Events\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3NoaWJhLWludXMtZXRoZXJldW0tY29ubmVjdGlvbi13aGF0LWRvZXMtaXQtbWVhbi1mb3ItZXZlcmxvZGdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Shiba Inu's Ethereum Connection: What Does It Mean for Everlodge? - Analytics Insight",
        "content": "As an ERC-20 token, SHIB is connected to the Ethereum blockchain, and similarly, Everlodge operates within the Ethereum network. So, what implications does this hold? Let’s delve into the details.\n\nJoin the Everlodge presale and win a luxury holiday to the Maldives\n\nShiba Inu’s Link with Ethereum\n\nShiba Inu takes the form of an ERC20 token, effectively entwining its operations, including the Shiba Inu burning mechanism and the Shibarium platform, with the Ethereum blockchain. With the transition to Proof of Stake (PoS), Ethereum mining’s relevance has waned, replaced by Ethereum staking for transaction validation. This shift implies that Shiba Inu transactions will undergo validation via an alternative method. Furthermore, there’s speculation that the Ethereum price’s fluctuations could influence the entire array of tokens inherent to the Ethereum chain.\n\nThis connection might hold particular significance for certain SHIB holders. Despite a recent temporary shutdown of Shibarium, the Shiba Inu developer team asserts that the blockchain is primed for a re-release, eagerly anticipated by the Shiba Inu community. Recent enhancements have introduced safety measures and a monitoring system to avert potential disruptions. The initial launch of Shibarium led to a suspension of transactions, rendering $2.5 million in bridge assets temporarily inaccessible and affecting the value of Shiba Inu.\n\nWith its revival, an increased number of validators come online to bolster security on the Layer-2 system. Shibarium’s goal is to curtail gas fees for users, and the public beta phase is slated to commence before September’s end.\n\nThe fact that Shiba Inu and the Shibarium are bulit on Ethereum means that they benefit from the security and decentralisation of Ethereum.\n\nEverlodge: Co-Ownership of Luxurious Vacation Properties\n\nEverlodge is also built on Ethereum, and is offering a unique opportunity for individuals to invest in high-end vacation properties across the globe. The whitepaper is available on the official Everlodge website, expounding on the mission of Everlodge.\n\nThe crux of Everlodge’s business model revolves around acquiring and transforming luxury properties into NFTs. This transformation confers legal ownership via the blockchain, with the fractionalization making it accessible to potential investors. Thanks to the nature of blockchain technology, all pertinent details are stored on the chain, publicly accessible, and the participation process is user-friendly.\n\nEverlodge is aiming to democratize the real estate market, making it accessible to investors irrespective of their background, nationality, or financial circumstances. Everlodge will introduce a decentralized NFT marketplace for real-world properties.\n\nAs global financial uncertainties rise, confidence in the traditional financial system wanes, compelling investors to explore alternative avenues.\n\nThrough Everlodge, investors can profit from rental income and the appreciation in property values. In addition to earning rewards through staking the Everlodge token, ELDG, which offers a 10% APR. Issued on Ethereum, the ELDG token remains within the influence of the Ethereum blockchain.\n\nHolders of Everlodge tokens are poised to enjoy incentives such as complimentary stays in vacation properties. The ongoing Everlodge presale presents the opportunity to acquire ELDG on the official Everlodge website, with prices starting at a mere $0.012. Notably, the token’s projected minimum launch price stands at $0.38.\n\nFind out more about the Everlodge (ELDG) Presale\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC1hbmFseXN0cy1wcmVkaWN0LTEweC1ncm93dGgtZm9yLWJpdGNvaW4tZXRoZXJldW0tYW5kLXNvbGFuYS1oZXJlcy13aHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Top Analysts Predict 10X Growth For Bitcoin, Ethereum, And Solana - Here's Why! - Analytics Insight",
        "content": "The crypto market seems to be stuck in a puzzling state right now. It’s like everyone’s waiting for something big to happen. But you know what? Many top analysts are still bullish about Bitcoin (BTC), Ethereum (ETH), and Solana (SOL). They believe these cryptos could pull off some serious 10X growth, which is pretty impressive.\n\nAnd even better, if these big players make it big, it could give a boost to the entire altcoin scene. Some analysts have their eyes on coins like Wall Street Memes ($WSM), Bitcoin BSC ($BTCBSC), and Launchpad XYZ ($LPX), expecting them to go 10X, too. But first, let’s see why top analysts expect BTC, ETH, and SOL to grow 10X.\n\n>>>Buy Wall Street Memes Now<<<\n\n10X Growth on the Horizon – Insights from Top Analysts on Bitcoin, Ethereum, and Solana\n\nWhile the current crypto market might seem a bit shaky, some top analysts are actually quite bullish on Bitcoin, Ethereum, and Solana.\n\nStarting with Bitcoin, top analysts like Bill Miller and Cathie Wood are optimistic, even predicting a 10X surge. Their confidence stems from Bitcoin’s limited supply and the growing interest from institutional investors, both of which could lead to some serious gains. They firmly believe that Bitcoin’s role as a store of value is set to drive its value way up.\n\nEthereum is also on analysts’ radar, especially the renowned investment firm VanEck. The company is eyeing a potential 10X return on Ethereum investments. In its view, Ethereum’s upcoming 2.0 upgrade, the explosive adoption of DeFi applications, and its real-world applications could drive its value up.\n\nMeanwhile, other analysts are also bullish on Solana, predicting a remarkable 10X increase in its value. They attribute this potential surge to Solana’s lightning-fast and cost-effective transactions. Solana’s strategic collaborations, such as with Visa, have experts excited about the possibility of substantial gains in the near future.\n\nWhile top analysts are focusing on Bitcoin, Ethereum, and Solana, others are paying close attention to altcoins like Wall Street Memes, Bitcoin BSC, and Launchpad XYZ and predicting that these coins will surge 10X or even more. So, let’s dig into what makes these coins special.\n\n>>>Buy Wall Street Memes Now<<<\n\n1. Wall Street Memes ($WSM) – Dubbed as the 10X Meme Coin of 2023 by Top Analyst\n\nWall Street Memes ($WSM) is undoubtedly the hottest meme coin of 2023, and it’s an exciting opportunity for you to get massive gains as top analysts are buzzing about its potential for 10X gains! This coin is riding the meme wave and encapsulating the rebellious spirit of WallStreetBets within the crypto realm.\n\nSince the beginning, WSM’s presale has been phenomenal, having now surpassed $25 million! Moreover, WSM is doing its tokenomics right. They’ve allocated 50% of the tokens to the presale, ensuring community engagement and thwarting rug pulls. Another 30% goes into community rewards, keeping the community motivated and involved. The remaining 20% is for liquidity.\n\n>>>Buy Wall Street Memes Now<<<\n\nBut what truly sets WSM apart is it boasts a massive following of over a million dedicated supporters, and Elon Musk has interacted with them. Plus, there’s an exciting $50K airdrop to keep the frenzy going.\n\nTop crypto analysts like Michael Wrubel are optimistic regarding WSM’s potential for 10X growth. He is thrilled about WSM’s established community, which gives it a significant edge over other meme coin launches.\n\nThe presale is wrapping up, and less than 20 days are left until WSM hits tier-1 exchanges. Analysts are buzzing about potential 10X gains, so don’t wait too long – jump on board now.\n\n>>>Buy Wall Street Memes Now<<<\n\n2. Bitcoin BSC ($BTCBSC) – Top Analyst Predicts 10X Surge Due to Innovative Staking\n\nBitcoin BSC ($BTCBSC) is a new player in the crypto scene that could potentially give you a shot at Bitcoin-like gains. Why? Well, it draws inspiration from Bitcoin but takes advantage of the Binance Smart Chain, making it more efficient. Plus, top analysts like Jacob Bury are talking about a possible 10X surge in its value.\n\n>>> Buy Bitcoin BSC Now<<<\n\nCurrently priced at $0.99, it harks back to Bitcoin’s initial price parity with the dollar back in 2013 before its meteoric rise. The $BTCBSC presale has already raked in over a million dollars in just a short time. Its presale supply mirrors Bitcoin’s 2013 numbers but boasts a unique feature – a Stake-to-Earn model instead of resource-intensive mining.\n\nJacob Bury underlines the significance of staking rewards, advocating for long-term holding and growth. Every 10 minutes, a generous 69% of the remaining 14 million+ tokens are distributed to stakers. This greener alternative to mining has experts excited about a potential 10X surge for $BTCBSC.\n\nAs top analysts foresee 10X growth for Bitcoin, it’s expected that clones like Bitcoin BSC will experience a significant uptick in value, and the unique staking mechanism could propel $BTCBSC even further. The presale is filling up fast, so it’s wise to jump in early to potentially ride that 10X wave.\n\n>>> Buy Bitcoin BSC Now<<<\n\n3. Launchpad XYZ ($LPX) – The Web3 Powerhouse Eyed for 10X Gains by Top Analyst\n\nLaunchpad XYZ is a crypto project that’s creating quite a buzz, and experts like Conor Kenny are calling it a potential 10X winner. Launchpad XYZ is on a mission to bring together all the crucial Web3 tools you need for smarter trading and investment decisions, all under one roof.\n\n>>> Buy Launchpad XYZ Now<<<\n\nTheir platform boasts some exciting features, such as an AI assistant that combines sentiment analysis, the latest news, and insights from pro traders. They also have a dedicated charting platform, watchlists to keep an eye on the hottest tokens, and an automated project rating system to make your life easier.\n\nTo access the Launchpad XYZ platform, you will need the native $LPX token, which is currently available in presale for $0.0445 per token, nearly 40% off the list price of $0.07. The presale has already pulled in over $1.6 million, but time is running out, so it’s a smart move to get in early.\n\nKenny is particularly impressed with Launchpad XYZ’s suite of trading tools and exclusive access, seeing them as key factors that could potentially drive it to a 10X growth.\n\n>>> Buy Launchpad XYZ Now<<<\n\nConclusion\n\nAs top analysts anticipate the growth for BTC, ETH, and SOL, coins like $WSM, $BTCBSC, and $LPX could achieve 10X even faster. These tokens have gained attention due to their distinctive attributes, strong communities, and innovative staking systems. Importantly, these coins are currently in presale, presenting a timely opportunity to get involved.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3Qvd2hlcmUtaXMtYmVzdC10by1zdGFrZS1teS1ldGjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Where is Best to Stake My ETH? - BSC NEWS",
        "content": "This article explores the top Ethereum staking platforms, both centralized and decentralized, providing insights into their features and rewards.\n\nETH Staking: A Secure Path to Passive Income in Crypto\n\nIn the ever-evolving landscape of cryptocurrencies, one question looms large for Ethereum investors seeking to maximize their returns: \"Where is best to stake my ETH?\"\n\nStaking, a process involving supporting the blockchain network and validating transactions, has emerged as an enticing option for those seeking passive rewards. Among the myriad choices available, Ethereum (ETH) staking stands out as a beacon of security and reliability, promising a steady income derived from protocol revenue.\n\nIn the realm of proof-of-stake consensus mechanisms, validators take a pivotal role by locking up a specific amount of cryptocurrency as collateral. This collateral serves as the bedrock upon which new blocks are created, and transactions are validated.\n\nIn return for their commitment, those staking their Ethereum tokens actively contribute to enhancing the security and decentralization of the Ethereum network while enjoying rewards as a token of appreciation.\n\nWhat sets staking Ethereum apart from the traditional mining process is its significantly reduced energy consumption, which minimizes its environmental footprint.\n\nListed below are six platforms you can use to stake your ETH. These platforms not only excel in offering remarkable staking rewards but also serve as strategic assets for astute investors navigating the dynamic and ever-evolving realm of Decentralized Finance (DeFi).\n\nSource: Ethereum Twitter\n\nLets discover the best places to stake your Ethereum and see how your investments can flourish in the burgeoning world of DeFi.\n\n‍\n\nTop Decentralized ETH Staking Platforms\n\nWhile staking Ethereum (ETH), choosing the right platform is paramount. Here, we present the top decentralized Ethereum staking platforms that offer unique advantages, each catering to different user preferences and requirements.\n\n1. Lido: Unleashing the Power of Liquidity\n\nLido takes the lead as a premier Ethereum staking platform, offering a seamless, efficient, and decentralized staking experience. One of its standout features is its remarkable liquidity, boasting over $1.5 billion provided on Curve. This liquidity empowers users with the flexibility to easily convert their staked ETH (stETH) tokens into other assets, opening doors to diverse opportunities within the DeFi ecosystem.\n\nStaking with Lido yields stETH tokens, representing staked ETH and earned rewards, with an impressive current APR of 3.8%.\n\nLido has a firm commitment to security, decentralization, and user-friendliness, combined with substantial liquidity, making it one of the best platform to stake ETH coins and contribute to ETH's robustness and growth.\n\n2. RocketPool: Decentralization at its Core\n\nRocketPool secures the second spot as a top Ethereum (ETH) staking platform, championing a decentralized approach to ETH 2.0 staking. As a decentralized staking pool, RocketPool allows users to stake 8, 16, or 32 ETH, receiving rETH tokens in return.\n\nUtilizing a network of node operators, RocketPool ensures the trifecta of security, decentralization, and trustlessness, making it a favored option among those in search of a more decentralized staking solution. While offering ETH rewards at a current 3.27% APR, it's worth noting that RocketPool is better suited for advanced on-chain users due to its complexity.\n\nRocketPool's decentralized nature reduces dependence on a single point of failure, enhancing its overall security.\n\n3. Frax Finance: Innovating Ethereum Staking with Frax Ether\n\nFrax Finance introduces a pioneering Ethereum staking DeFi platform, Frax Ether (frxETH), designed to maximize staking yields and simplify the Ethereum staking process. Frax Ether's liquid staking removes the technical barriers and the 32 ETH requirement associated with solo staking, making it accessible to a broader range of users.\n\nThis platform offers a unique twist by combining three primary components—Frax Ether (frxETH), Staked Frax Ether (sfrxETH), and the Frax ETH Minter.\n\nFrxETH acts as a stablecoin loosely pegged to ETH, providing a seamless entry point into the Frax ecosystem. Users unlock staking yields by exchanging frxETH for sfrxETH, which can be redeemed when converting sfrxETH back to frxETH.\n\nWith potential earnings of up to 6% APR in interest on their ETH holdings, liquid staking with Frax Ether offers users flexibility and composability within the DeFi landscape.\n\nSource: Frax Finance Twiiter\n\n‍\n\nTop ETH Centralized Staking Platforms\n\nWhile decentralized staking platforms offer unique advantages, centralized alternatives provide a simplified and user-friendly approach to Ethereum (ETH) staking. Here, we delve into the top centralized Ethereum staking platforms, each offering its blend of convenience and rewards.\n\n1. Binance: Streamlined Staking with Binance Staked Ethereum (BETH)\n\nBinance is a robust centralized Ethereum (ETH) staking platform, providing a user-friendly interface for staking ETH and earning a current 3.42% APR in rewards through Binance Staked Ethereum (BETH). Binance excels at simplifying the staking process, catering to users with varying levels of technical expertise. However, it's important to note that Binance offers comparatively lower yields when compared to alternatives like Bybit.\n\nDespite this, Binance's immense user base and stringent security measures make it an appealing choice for Ethereum staking. Users can conveniently stake their ETH holdings and enjoy competitive rewards with minimal complexity.\n\n2. Bybit: Global Leader in Ethereum Staking\n\nBybit emerges as the premier choice for Ethereum (ETH) staking across more than 180 countries, thanks to its user-friendly integration of ETH 2.0 staking and support for stETH. By locking up your ETH as collateral, you actively contribute to the validation of the Ethereum network while earning up to 7% APR in rewards.\n\nBybit's automatic conversion of staked ETH to stETH at 1:1 ensures that users begin accruing daily rewards based on their stETH holdings. The platform's Unified Trading Account goes a step further, allowing you to trade using your stETH tokens as collateral, granting access to both the Spot market and the ability to withdraw your stETH holdings.\n\nWith its user-centric approach and generous rewards, Bybit firmly establishes itself as a key player in Ethereum staking.\n\nSource: ByBit Twitter\n\n3. Coinbase: A Top Exchange Embraces Staking\n\nCoinbase, a publicly traded company and one of the largest crypto exchanges globally offers Ethereum staking with a competitive 3.27% APY.\n\nNotably, Coinbase does not impose a lock-up period, though users may need to wait for the unstaking process to complete as per the protocol before accessing their crypto. Staking ETH on Coinbase follows a straightforward process akin to staking other cryptocurrencies. Similar to Lido DAO, Coinbase offers a synthetic staked ETH token, cbETH, allowing users to earn an additional yield.\n\nHowever, it's worth noting that Coinbase's rigorous KYC requirements translate to a more extended sign-up process, demanding additional verification steps. Nonetheless, for users seeking a familiar and trusted exchange to stake their ETH and other assets, Coinbase presents a compelling choice.\n\n‍\n\nThe Path to Secure and Rewarding Ethereum Staking\n\nAs with any investment, caution and prudence are paramount. Ethereum staking presents its considerations and risks, ranging from smart contract vulnerabilities to centralization concerns.\n\nSmart contract risk is a focal point, as once your ETH is staked within a PoS smart contract, it's no longer under your direct custody and becomes susceptible to potential hacking attempts.\n\nMoreover, the consequences of a significant smart contract breach could extend beyond the immediate loss of funds. It could have a cascading effect on the entire Ethereum ecosystem, impacting the value of unstaked ETH held in self-custody.\n\nAdditionally, there are considerations related to slashing penalties and rule violations by some lesser-known staking platforms.\n\nAs regulatory bodies like the SEC explore the classification of PoS cryptos as securities, it becomes vital for stakers to stay informed about potential regulatory changes.\n\nNevertheless, the allure of passive rewards on one of the most promising assets of recent years provides an avenue for compounding crypto gains.\n\nBefore embarking on the journey of crypto staking, it is essential to be well-informed and diligent. Conduct thorough research, select reputable platforms, and stay attuned to the evolving regulatory landscape. By taking these precautions, users can confidently navigate the world of Ethereum staking, contributing to the network's security and growth while enjoying its rewards."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbmdhcGUuY29tL3BvbHlnb24tcmVsZWFzZXMtcHJvcG9zYWxzLW9uLWV0aGVyZXVtLXNjYWxpbmctcG9sLXRva2VuL9IBUmh0dHBzOi8vY29pbmdhcGUuY29tL3BvbHlnb24tcmVsZWFzZXMtcHJvcG9zYWxzLW9uLWV0aGVyZXVtLXNjYWxpbmctcG9sLXRva2VuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Polygon Releases Proposals On Ethereum Scaling And POL Token - CoinGape",
        "content": "Blockchain firm Polygon Labs on Thursday announced the official beginning of Polygon 2.0 implementation with the release of three Polygon Improvement Proposals (PIPs). Also, the initiation of migration of MATIC to POL token. This is a major announcement from Polygon as it looks to scale Ethereum for unlimited scalability and unified liquidity.\n\nPolygon Announces 2.0 Implementation Proposal\n\nPolygon Labs in an official announcement on September 14 revealed the release of three Polygon Improvement Proposals (PIPs) for Polygon 2.0 implementation. The plan unveiled in June will likely be completed in early Q4 this year.\n\nadvertisement\n\n“Central to the Polygon 2.0 vision is the idea of empowering the community — the builders, creators and all others who make the Polygon ecosystem possible.”\n\nPIP-18 has Phase 0 plans to build a network of interconnected zero knowledge-powered L2 chains that scale Ethereum to the size of the Internet.\n\nIt will make significant changes including upgrades from MATIC to POL token as the native token for Polygon PoS and staking token for Polygon PoS. Also, the launch of the Staking Layer and migration of Polygon public chains leverage the layer.\n\nPIP-17 has POL token handling emission and token migration from MATIC, enabling staking, community ownership, and governance.\n\nPIP-19 will upgrade the Polygon PoS native token to POL while ensuring maximum backwards compatibility. This will happen by upgrading the native MATIC Bridge Contract.\n\nMATIC Changes POL Token\n\nMATIC price jumped more than 1% in the last 24 hours, with the price currently trading at $0.521. However, traders didn’t immediately respond to the Polygon 2.0 implementation and POL token migration. The 24-hour low and high are $0.509 and $0.524, respectively.\n\nTrading volumes decreased by 12% in the past 24 hours, indicating lack of interest from traders. Moreover, the SEC’s consideration of MATIC as securities and Binance dropping Polygon support and removing MATIC pairs impacted its price action.\n\nAlso Read:"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0by13aGFsZS1sb3NzZXMtb3Zlci0yNC1taWxsaW9uLXN0YWtlLWxvY2tlZC1ldGhlcmV1bS1ib3Jyb2UtZmluYW5jZS1nYWlucy0yNS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Sep 2023 07:00:00 GMT",
        "title": "Crypto Whale Losses Over $24 Million Stake-locked Ethereum, Borroe.Finance Gains 25% - Analytics Insight",
        "content": "A cryptocurrency whale lost $24.23 million worth of Ethereum ($ETH) to phishing scammers on September 6, 2023. Despite the theft, Ethereum ($ETH) remained stable, with investors still bullish in the long term. On the other hand, Borroe.Finance ($ROE) has gained attention for its innovative AI-driven financing platform, offering immediate cash flows to Web3 participants. Borroe.Finance has already delivered a 25% profit in the presale. Can Ethereum catch up?\n\n>>BUY $ROE TOKENS NOW<<\n\nAttackers Steal $24.23 Million Worth of Ethereum ($ETH) From Crypto Whale\n\nRecent on-chain data reveals that an Ethereum ($ETH) whale identified as “0x13e382” fell victim to phishing scammers on September 6, 2023. That incident resulted in a loss of $24.23 million worth of liquid-staked Ethereum ($ETH). This loss included 4,851 rETH (valued at $8.58 million) and 9,579 stETH (valued at $15.63 million).\n\nScam Sniffer, a Web3 security company, disclosed that the Ethereum ($ETH) whale had unintentionally granted token approval to the scammers by authorizing “increaseAllowance” transactions. The firm said this Ethereum ($ETH) theft is likely “the largest sum ever taken from an individual victim.”\n\nWhile the identity of the victim remains confidential, their transaction history suggests an experienced liquidity provider with significant on-chain expertise. This Ethereum ($ETH) wallet has been active since 2017 and currently supports over $1.6 million in WBTC/USDT liquidity on the Uniswap V3 platform.\n\nDespite this attack, Ethereum ($ETH) remained steady. The resilience is attributed to the increased demand from large investors looking to capitalize on a bull market they believe is imminent.\n\nAnalysts believe Ethereum ($ETH) will remain bullish to end the year around $1,850. Therefore, Ethereum ($ETH) is a good crypto to buy currently.\n\nBorroe.Finance ($ROE) Records 25% Profits, Investors Rush To Buy\n\nBorroe.Finance ($ROE) is an innovative AI-driven financing platform revolutionizing how content creators and Web3 ecosystem participants access immediate cash flows. It achieves this transformation through the sale of expected future earnings, encompassing subscriptions, royalties, and unpaid invoices, to facilitate rapid liquidity.\n\n>>BUY $ROE TOKENS NOW<<\n\nIn contrast to traditional funding methods struggling to adapt to Web3 principles, Borroe.Finance seamlessly embraces this technological shift. It offers an ideal solution for businesses to raise capital through the issuance of non-fungible tokens (NFTs) representing forthcoming or outstanding invoices.\n\nBy enabling the creation and cost-effective distribution of invoice NFTs, Borroe.Finance ($ROE) empowers a decentralized network, allowing buyers to easily trade these NFTs on various secondary markets. Hence, these are the best NFTs to buy now.\n\nRecently, Borroe.Finance ($ROE) acquired validation from BlockAudit. Notably, BlockAudit endorsed the platform’s immunity to all types of cyber threats and malware. While transitioning from the beta stage of its presale, $ROE recorded a remarkable 25% profit, surging from its initial value of $0.010 to $0.0125 in Stage 1.\n\nAs Stage 2 nears, the set value of $ROE at this stage is $0.0150. In that context, $ROE is on track to record a massive 300% surge from its beta stage price, reaching $0.0400 at the end of the presale. Thus, it ranks as the best crypto investment in 2023.\n\nLearn more about Borroe.Finance ($ROE) here:\n\nVisit Borroe.Finance Presale | Join The Telegram Group | Follow Borroe.Finance on Twitter\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdHJhZGVicmFpbnMuaW4vZmVhdHVyZXMvaW5zdGl0dXRpb25hbC1pbnZlc3RtZW50LWluLWV0aGVyZXVtLXRyZW5kcy1hbmQtaW1wYWN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Institutional Investment in Ethereum: Trends and Impact - Trade Brains",
        "content": "Within the dynamic and constantly shifting realm of cryptocurrencies, Ethereum has risen to prominence as a standout participant, commanding the interest not just of individual traders but also of institutional stakeholders. The trend of institutional investment in Ethereum has swiftly grown to become a pivotal force over recent years, wielding the power to mold market behaviors and imprint a lasting mark on the expansive cryptocurrency landscape.\n\nThis comprehensive article delves extensively into the ascendancy of institutional involvement in Ethereum, meticulously dissecting the fundamental trends propelling this phenomenon forward, while also meticulously analyzing the far-reaching consequences and ramifications it bears upon the wider cryptocurrency market. Trying to cash in on the latest crypto wave? Ethereum is the leading contender, and the AI trading system makes purchasing it easier.\n\nThe Institutional Shift\n\nThe transition towards embracing institutional investment within the Ethereum ecosystem signifies a moment of profound significance in the trajectory of cryptocurrencies. While the cryptocurrency realm has conventionally been associated with tech aficionados and individual retail traders, the incursion of institutional entities introduces a distinct echelon of credibility and steadiness to the Ethereum market.\n\nThis influx of institutional investors, spanning a spectrum from hedge funds to corporate entities, is motivated by the alluring prospects of substantial returns, the strategic diversification of their portfolios, and the invaluable opportunity to gain exposure to the transformative potential of blockchain technology.\n\nDriving Factors\n\nSeveral driving factors have paved the way for institutional interest in Ethereum:\n\nGrowing Acceptance and Recognition\n\nEthereum’s recognition as more than just a speculative asset has grown steadily. Its underlying smart contract capabilities have found utility in various sectors, such as decentralized finance (DeFi), supply chain management, and non-fungible tokens (NFTs). This broader usability enhances Ethereum’s appeal to institutional investors looking for tangible use cases.\n\nMarket Maturation\n\nAs the cryptocurrency market matures, regulatory clarity and improved infrastructure have become more pronounced. This has created a conducive environment for institutional investors, who often require regulatory certainty and robust custodial solutions before entering a market.\n\nPotential for Diversification\n\nInstitutional investors are always seeking avenues to diversify their portfolios. Ethereum, with its distinct market dynamics and correlation patterns, offers a unique opportunity for diversification, reducing the overall risk exposure of institutional investment portfolios.\n\nBitcoin’s Influence\n\nBitcoin, often dubbed digital gold, initially captured institutional interest. As Ethereum’s narrative expanded beyond being solely a cryptocurrency, it drew the attention of investors who were looking for exposure to blockchain technology beyond just a store of value.\n\nImpact on the Market\n\nThe influx of institutional investment in Ethereum has far-reaching implications for the cryptocurrency market:\n\nPrice Stability\n\nInstitutional investors, known for their long-term investment strategies, contribute to reducing price volatility. Their substantial investments can help dampen the extreme price swings commonly associated with cryptocurrencies, making Ethereum a more attractive option for risk-averse investors.\n\nMainstream Adoption\n\nInstitutional involvement acts as a bridge to mainstream adoption. As reputable institutions allocate funds to Ethereum, it piques the interest of a wider audience, fostering greater acceptance and understanding of cryptocurrencies in general.\n\nEnhanced Market Capitalization\n\nThe injection of institutional capital inevitably leads to an increase in Ethereum’s market capitalization. This, in turn, bolsters Ethereum’s position in the cryptocurrency rankings and solidifies its status as a pivotal player in the digital asset space.\n\nRegulatory Scrutiny\n\nWhile institutional investment lends credibility, it also invites increased regulatory scrutiny. Regulators are paying closer attention to Ethereum as institutional involvement grows, potentially shaping the regulatory framework surrounding cryptocurrencies.\n\nFuture Outlook\n\nThe trajectory of institutional investment in Ethereum is poised for a continued and intricate evolution. As a growing number of institutions grasp the profound possibilities offered by blockchain technology and decentralized applications, it is anticipated that their attraction towards Ethereum will gain even more momentum.\n\nThis heightened interest holds the potential to catalyze additional phases of market maturation, spur heightened efforts in infrastructure enhancement, and stimulate the creation of a more diverse range of investment offerings meticulously designed to align with the distinct requirements of institutional investors.\n\nConclusion\n\nThe infusion of institutional investment has brought a revitalizing surge of activity to the Ethereum ecosystem. This rejuvenation is the result of a powerful synergy between cutting-edge technological advancements, heightened awareness of Ethereum’s capabilities, and the facilitative role. Bolstered by robust institutional engagement, Ethereum has transitioned into a transformative phase, embarking on a new trajectory of development and innovation.\n\nAs the broader cryptocurrency landscape undergoes dynamic transformations, Ethereum confidently assumes a pioneering position, propelled by the momentum generated through unwavering institutional support and its boundless inherent potential.\n\nAdvertisements Ready to elevate your brand through Trade Brains? If you’re aiming to connect with a specific audience of finance professionals and decision-makers, we provide opportunities for sponsored articles and partnerships to effectively showcase your brand and boost sales. Explore our diverse advertising options and reach out to us today! To enhance your brand visibility and connect with a highly engaged finance audience, contact us at [email protected]."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vZ2l6bW9kby5jb20uYXUvMjAyMy8wOS9ldGhlcmV1bS1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1zYXlzLWEtc2ltLXN3YXAtd2FzLWJlaGluZC1oaXMtdHdpdHRlci1oYWNrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Says a SIM Swap Was Behind His Twitter Hack - Gizmodo Australia",
        "content": "Vitalik Buterin, a computer programmer who co-founded the popular cryptocurrency Ethereum, is clearing the air after his account on Twitter (now known as X) was hacked this weekend. The hack involved a post touting a commemorative NFT that was actually a cryptocurrency wallet drainer.\n\n“Finally got back my T-mobile account (yes, it was a sim swap, meaning that someone socially-engineered T-mobile itself to take over my phone number),” Buterin wrote. “Main learning re twitter was: > A phone number is sufficient to password reset a Twitter account even if not used as 2FA. Can completely remove phone from Twitter.”\n\nButerin revealed that a SIM swap attack was the method for the hack in a post on the decentralized social media platform Farcast, as reported by Decrypt. The outlet says that the swap allowed the hackers to take over Buterin’s Twitter account by manually resetting his password using his phone as well as using the number to bypass the platform’s two-factor authentication. The Ethereum co-founder boasts a big 4.9 million followers on the platform, and the hack resulted in an estimated $US650,000 worth of NFTs being stolen from unsuspecting victims.\n\nThis weekend, the hackers took control of Buterin’s account to post a phony link to a limited edition NFT, which was advertised to commemorate the release of proto-danksharding for Ethereum. Proto-danksharding is an upcoming update to the cryptocurrency’s digital infrastructure, which developer Mario Havel told Decrypt was in its last stages of development before release, seemingly in the next few months. The new update will use so-called “data blobs,” allowing the Ethereum network to expand and handle up to 100,000 daily transactions.\n\n“To celebrate the Proto-Darksharding coming to Ethereum, @Consensys is marking the moment with a commemorative NFT. ‘Proto honors the work of the devs who made this possible. The collection is free for the next 24 hours,” the alleged hackers posted on Buterin’s account, followed by a link to a webpage where users were encouraged to claim the NFT. The tweet was posted and subsequently removed over the course of 20 minutes."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vY29pbm5vdW5jZS5jb20vaGFzaGRleC1uYXNkYXEtZXRoZXJldW0tZXRmL9IBN2h0dHBzOi8vY29pbm5vdW5jZS5jb20vaGFzaGRleC1uYXNkYXEtZXRoZXJldW0tZXRmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 07:00:00 GMT",
        "title": "Nasdaq Files for Hashdex Nasdaq Ethereum ETF - Coinnounce",
        "content": "Nasdaq's Latest ETF Filing: A Unique Blend of Spot Ether and Futures Contracts\n\nNasdaq has submitted an application to the SEC for an Ethereum Exchange-Traded Fund (ETF) offered by Hashdex, marking a groundbreaking approach in the cryptocurrency investment landscape. The Hashdex Nasdaq Ethereum ETF is set to include both spot ether holdings and futures contracts within its portfolio.\n\nToroso Investments Takes the Helm\n\nThis innovative investment fund, the Hashdex Nasdaq Ethereum ETF, represents the first '33 Act Ethereum futures filing and is under the supervision of Toroso Investments. Toroso Investments, registered as a commodity pool operator with the CFTC and a member of the National Futures Association, brings regulatory oversight to this unique ETF.\n\nBalancing Risk and Reward\n\nWith a surge in cryptocurrency ETF applications, the Hashdex fund aims to find a middle ground by combining spot assets, ether futures contracts, and cash equivalents. This strategy is designed to reduce susceptibility to price manipulation in the spot market. The fund seeks to track the daily fluctuations in the Nasdaq Ether Reference Price."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2luc2lkZWJpdGNvaW5zLmNvbS9uZXdzL3BoaXNoZXItd2hvLXN0b2xlLTI0LTItbWlsbGlvbi13b3J0aC1vZi1ldGhlcmV1bS10cmFuc2ZlcnMtZnVuZHMtdG8tdG9ybmFkby1jYXNoLXBlY2tzaGllbGQtc2F5c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Sep 2023 17:34:27 GMT",
        "title": "Phisher who stole $24.2 Million Worth of Ethereum Transfers Funds to Tornado Cash, Peckshield Says - Inside Bitcoins",
        "content": "Don’t invest unless prepared to lose all the money you invest. This is a high-risk investment, you shouldn’t expect to be protected if something goes wrong.\n\nJoin Our Telegram channel to stay up to date on breaking news coverage\n\nA phisher who stole about $24.2 million of staked Ethereum (ETH) from a crypto whale is transferring the assets to crypto mixing firm Tornado Cash, says blockchain security firm Peckshield.\n\nThe stolen cryptocurrencies were liquid staking tokens including Lido Staked Ether (stETH) and Rocket Pool ETH (rETH), Peckshield said.\n\nThe security firm said that the phisher initially transferred 701 Ethereum (ETH) tokens worth about $1.15 million to the cryptocurrency mixer, and then exchanged 28,000 DAI tokens for 17.3 ETH and subsequently moved 1,100 ETH ($1.78 million) to Tornado Cash.\n\nLater, the phisher transferred 2,000 ETH worth about $3.1 million to a new wallet address, and sent 600 ETH to Tornado Cash. Currently, the attacker holds a total of $22.7 million in various cryptocurrencies including 13,100 ETH and 1.1 million DAI tokens, Peckshield said.\n\nPeckshield said on Sept. 7 that the attacker exchanged the stolen assets for 13,785 ETH and 1.64 million Dai (DAI), a stablecoin valued at $1.00. A considerable portion of the acquired DAI has already been moved to FixedFloat, a fully automated cryptocurrency exchange.\n\nLegal Challenge and Sanctions\n\nTornado Cash was sanctioned in August last year for its alleged involvement in money laundering, a practice it was accused of since its establishment in 2019. The Justice Department says it was responsible for enabling over $1 billion in money laundering activities, with a significant portion of these funds believed to have benefitted North Korea’s Lazarus Group.\n\nU.S. authorities say that the Lazarus Group’s illicit actions have provided financial support to North Korea’s nuclear weapons and ballistic missile programs.\n\nLast month, a court decision in the US reaffirmed sanctions against Tornado Cash. Six Tornado Cash users had challenged these sanctions, but the court upheld the ban, ruling that the plaintiffs’ claims of constitutional violations were not compelling enough.\n\nTornado Cash’s Private Ethereum Transactions\n\nTornado Cash provides a platform for users to make their Ethereum transactions more private. This is done by combining their funds with those from other cryptocurrency holdings. This process effectively hides the origin of a cryptocurrency transaction, making Tornado Cash an attractive option for cybercriminals seeking to convert their ill-gotten gains.\n\nRelated Articles\n\nNew Crypto Mining Platform - Bitcoin Minetrix Rating Audited By Coinsult\n\nDecentralized, Secure Cloud Mining\n\nEarn Free Bitcoin Daily\n\nNative Token On Presale Now - BTCMTX\n\nStaking Rewards - Over 50% APY Learn More"
    }
]