[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1zLWRlZmxhdGlvbi1hY2NlbGVyYXRlcy1hcy1zaGFuZ2hhaS11cGdyYWRlLWxvb21zLWNhbi1ldGgtcHJpY2UtYXZvaWQtYS0zMC1kcm9w0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Ethereum's deflation accelerates as Shanghai upgrade looms — Can ETH price avoid a 30% drop? - Cointelegraph",
        "content": "The price of Ethereum’s native token, Ether (ETH), has surged by more than 40% year-to-date to around $1,750, the highest level in seven months. However, ETH’s price is not out of the woods yet despite several bullish cues in the pipeline, such as the Shanghai upgrade.\n\nEthereum price bull trap?\n\nEther’s rise aligns with similar upside moves elsewhere in the crypto market, responding to lowering inflation that reduces the Federal Reserve’s likelihood of continuing to raise interest rates.\n\nAt the same time, warnings about an imminent bull trap in the markets have emerged, which may wipe out recent profits. Due to its long-term correlation with stocks and Bitcoin, Ether faces similar risks.\n\nBull Trap About to confirm on $ETH and $BTC along with shooting stars on both. Failed breaks usually trigger the biggest opposing moves. You have been warned. If stocks do dump, reversal signal on crypto can follow. Close > that shooting star candle invalidates the trap. pic.twitter.com/tJ9c5N0M3J — Cameron Fous (@Cameronfous) February 16, 2023\n\nLet’s take a closer look at several potential bullish and bearish catalysts for the price of Ethereum below.\n\nETH becomes most deflationary since Merge\n\nThe issuance rate of Ether has dropped to its lowest level since the network’s transition to proof-of-stake (PoS) via “the Merge” in September, 2022.\n\nEther’s annual supply has reduced by 0.056% since the Merge. In other words, the Ethereum network has minted fewer ETH tokens than were removed from the supply in the past five months.\n\nEther supply since the Merge. Source: Ultrasound Money\n\nInvestors typically perceive a cryptocurrency with a fixed supply or deflationary issuance rate as bullish in the longer term.\n\n#Ethereum's #deflation #rate is accelerating by the day. This has very positive impact on the supply/demand dynamics, and should send the price a lot higher as demand increases. I think this is happening very soon. #ETH #ETHE pic.twitter.com/dnHVKBabuf — Jesse Dow (@JesseLeeDow1) February 16, 2023\n\nEthereum’s supply is currently around 120.50 million, but there is technically no max supply. However, the London hard fork in August 2021 introduced a fee-burning mechanism that added deflationary properties to Ether’s tokenomics.\n\nAs a result of this upgrade, the higher the Ethereum network’s transaction fees at any given time, the more Ether will be “burned” or removed from the supply forever.\n\nInterestingly, Ethereum’s median gas price has rebounded to a seven-month high of 27.13 gwei (the smallest ETH unit) in the week ending Feb. 17.\n\nEthereum seven-day median transaction gas price. Source: Glassnode\n\nShanghai hard fork\n\nETH demand must not drop against a deflationary supply rate for the price to climb. One potential bullish catalyst in the pipeline for Ethereum is its upcoming network upgrade dubbed Shanghai, slated for mid-March.\n\nThe Shanghai hard fork enables users who have locked their Ether into Ethereum’s PoS smart contract to withdraw their assets. According to Kennan Mell, an independent market analyst, this increased liquidity could encourage more people to hold and stake Ether tokens.\n\nIn his SeekingAlpha article, Mell argues:\n\n“It’s possible that the successful implementation of staking withdrawals will boost Ethereum’s price as new investors decide to buy in right afterward, either because they were waiting to buy until the network successfully went through a risky hard fork to implement withdrawals or because they are lured by a more liquid staking yield.“\n\nMeanwhile, the total value locked in the Ethereum PoS contract continues to rise to new record highs, with the latest data showing deposits of almost 16.63 million ETH.\n\nEthereum 2.0 total value staked. Source: Glassnode\n\nCrypto staking crackdown\n\nHowever, any bullish catalysts for ETH’s price could be offset by regulatory crackdowns and unfavorable technicals in the near term.\n\nIn February, the United States Securities and Exchange Commission (SEC) fined crypto exchange Kraken $30 million for not registering its staking-as-a-service program, which includes Ethereum staking.\n\nRelated: Ethereum’s Shanghai fork is coming, but it doesn't mean investors should dump ETH\n\nCoinbase exchange CEO Brian Armstrong also warned that the SEC might ban crypto staking services for retail investors altogether. If true, such a prohibition could hurt Ether’s demand among U.S. investors.\n\nResembles poor financial advice to diversify into stocks in an economy of high FFR and inflation\n\n\n\nBut, SEC wanting to ban staking is valid\n\n\n\nMajor exchanges like #Binance can no longer offer in-app staking\n\n\n\nAND\n\n\n\nPoS protocols like #Ethereum will be subject to security laws & taxes https://t.co/1YxpVNxD0B — oracledaddy (@oracIedaddy) February 20, 2023\n\nETH price hits bearish inflection level\n\nFrom a technical perspective, Ether’s price is testing a key resistance confluence for a potential pullback.\n\nThe confluence comprises a multimonth descending trendline resistance and a 50-week exponential moving average (50-week EMA; the red wave), as shown below.\n\nETH/USD weekly price chart. Source: TradingView\n\nA pullback from the confluence could have ETH’s price test the 200-week EMA (the blue wave) near $1,550 as its short-term downside target.\n\nFurthermore, an extended correction could push the price toward the black ascending trendline support near $1,200 by March 2023, down about 30% from the current levels.\n\nHowever, a decisive breakout above the descending trendline resistance could activate a bullish reversal setup toward the $2,000–$2,500 area.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZXRoZXJldW0tcHJpY2UtcG9pc2VkLWZvci0yMC1yYWxseS1kdWUtdG8tdGhlc2UtcmVhc29ucy0yMDIzMDIyMDA4MjXSAXdodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1wcmljZS1wb2lzZWQtZm9yLTIwLXJhbGx5LWR1ZS10by10aGVzZS1yZWFzb25zLTIwMjMwMjIwMDgyNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Ethereum price poised for 20% rally due to these reasons - FXStreet",
        "content": "Share:\n\nEthereum price shows a bullish pennant formation with a theoretical forecast of $2,055.\n\nSecond confirmation of uptrend will arrive after ETH flips breakout line at $1,801.\n\nInvalidation of ETH’s bullish thesis will occur on flipping the $1,554 support level into a resistance barrier.\n\nEthereum (ETH) price shows a clear sign of consolidation around a significantly important monthly resistance level. Although ETH has flipped this hurdle into a support floor on the lower timeframes, investors need to wait for a decisive breakout from the pennant to confirm the start of the second leg.\n\nEther is at the center of popularity due to its upcoming network upgrade - the Shanghai hard fork. According to CoinStats, the smart contract token has a total market capitalization of $204 billion, and this number is only going to increase due to the bullish outlooks seen both in its fundamentals and technicals.\n\nCoinStats\n\nEthereum price prepares for its next bullish phase\n\nEthereum price rallied nearly 20% between February 13 and 23. As ETH entangled with the monthly resistance level at $1,677, the consolidation kick-started. During this sideways movement, Ether has produced two higher lows and two lower highs, denoting a pennant formation.\n\nTogether, the Ethereum price action between February 13 and 20, shows a bullish pennant formation. This setup forecasts a 20% upswing, which is obtained by measuring the distance of the initial run-up and adding it to the breakout point on the pennant.\n\nAssuming a breach of the pennant occurs around $1,720, a 20% move would put the Ethereum price target at $2,055.\n\nSupporting this optimistic outlook for Ethereum price is the hidden bullish divergence seen between the Ether price move and the Relative Strength Index (RSI). This technical formation is spotted when the price forms higher lows, but the momentum indicator produces lower lows.\n\nThis setup often leads to an explosive surge in bullish momentum that propels the underlying asset’s price.\n\nWhile a decisive break of the pennant would be the initial confirmation of an upswing, market participants can wait for a four-hour candlestick close above the breakout line at $1,801.\n\nETH/USDT 1-day chart\n\nAlthough the bullish outlook for Ethereum price makes logical sense, investors need to be cautious as a fatal crash in Bitcoin price would undo everything for ETH. A decisive flip of the $1,554 support level on the four-hour and the daily timeframe would invalidate the bullish thesis.\n\nSuch a development would see Ethereum price crash to the $1,329 support floor.\n\nEthereum network grows but so do scams\n\nThe number of investors holding Ethereum (ETH) grew from 25 million to 87 million in 2022. With many new upgrades to the Ethereum blockchain set to debut in 2023 and the resumption of the 2023 bull run is likely going to boost the network further. Investors can also see a swift growth in Layer 2 solutions like Arbitrum and Polygon. Additionally, the implementation of the zkSnark (Zero-knowledge) technology has also brought a renewed interest among investors.\n\nIn a recent tweet, the Ethereum Denver Twitter account noted that hackers targeted their Ethereum Denver website. Soon after Blockfence tweeted and tagged this website as \"high risk.\" Interestingly, the involved bad actors have also promoted the fake ETH Denver website on Google. To make matters worse, the website appeared before the original website, which could attract a lot of unbeknownst investors.\n\nAlthough the cryptocurrency scams have decreased in recent months, scammers or hackers are finding new and improved ways to steal money."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGVjcnlwdC5jby8xMjE3NjgvYmx1ci1vcGVuc2VhLWV0aGVyZXVtLW5mdC10cmFkaW5nLXNreXJvY2tldHPSAUxodHRwczovL2RlY3J5cHQuY28vMTIxNzY4L2JsdXItb3BlbnNlYS1ldGhlcmV1bS1uZnQtdHJhZGluZy1za3lyb2NrZXRzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Blur Overtakes OpenSea as Ethereum NFT Trading Skyrockets - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFollowing two straight months of sales growth, NFT trading rapidly accelerated over the past week as Ethereum NFT volume more than doubled during that span. It’s due to an evolving market in which upstart marketplace Blur has overtaken leader OpenSea, with traders rapidly flipping valuable NFTs like they’re DeFi tokens.\n\nAccording to data from DappRadar, Blur has generated $460 million worth of Ethereum NFT trades over the past seven days—a 361% increase over the previous span. OpenSea, meanwhile, saw a 12% increase in trading volume to $107 million during that period. The third-place marketplace, X2Y2, tallied barely $11 million in trades in that time.\n\nOverall, CryptoSlam points to a 155% week-over-week increase in Ethereum NFT trading volume. The surge in volume comes during a week in which Blur airdropped its BLUR governance token to NFT traders who earned rewards through the marketplace, and also by trading elsewhere ahead of Blur’s own launch last fall.\n\nAD\n\nAD\n\nThe BLUR token has a market cap of $466 million, at its current price of $1.20 per token, and it appears that at least some NFT collectors poured their airdropped funds back into buying NFTs. And they’re primarily using Blur to buy and sell NFTs, as the market data shows.\n\nHowever, the surge in trading volume at Blur doesn’t appear to be primarily driven by traders simply selling off their BLUR tokens and buying and holding high-value NFTs. Instead, whale traders with significant NFT holdings appear to be flipping NFTs with even greater frequency than before, in an effort to boost potential future token reward allocations.\n\nFor example, the largest NFT project (market-wide) over the past week in terms of trading volume is Otherside, Yuga Labs’ upcoming metaverse game. The NFT land plots generated some $63 million in trades this past week, per CryptoSlam, marking a 318% week-over-week increase.\n\nThe largest seller during that span is the wallet of MachiBigBrother, a well-known pseudonymous NFT trader, who was involved with nearly 1,300 Otherside NFT trades yielding $4.3 million worth of sales in the process. A look at his trading activity shows a constant flood of inbound and outbound trades, and this is just one example of many.\n\nIt’s facilitated by Blur’s unique marketplace model, which not only broadly incentivizes heavy activity with the promise of token rewards, but specifically rewards traders for using bidding pools that enable bulk trading for NFTs.\n\nAD\n\nAD\n\nBlur Bidding Pools have reached a new ATH of $132.65M TVL, or, around 2.4x Aptos TVL and 0.5x Solana TVL. Blur also became the #1 protocol on Ethereum by gas usage as well, surpassing both Uniswap and Seaport. 🚨TURN NOTIFICATIONS ON🚨 for details about Season 2, coming soon! https://t.co/89DONJ6K8z pic.twitter.com/GCqGHDQBcq — Blur (@blur_io) February 20, 2023\n\nBlur is teasing its next “Season 2” token airdrop, and specifically notes that traders that “bid on top collections closer to the floor get more rewards.” In other words, traders that put in a bid close to the floor price—that is, the cheapest available NFT for a certain project—of a popular project will maximize their eventual rewards. They’re both buying and selling in bulk as a result.\n\nThat’s why projects like Otherside, the Mutant Ape Yacht Club, and Moonbirds are all flying this week, and why many of the NFTs in those projects are trading hands over and over again. And MachiBigBrother, the aforementioned whale trader, currently sits at the top of Blur’s Season 2 leaderboard for trading rewards.\n\nDeFi, a catch-all term for non-custodial trading and lending services, took the Ethereum space by storm in 2020 and has played a significant role in the growth of the ecosystem since. Now, through token rewards and gamification techniques, Blur has incentivized traders to treat NFTs more like DeFi tokens, flipping frequently and attempting to maximize every potential benefit through liquidity mining. Some traders have even posted guides on how best to mine Blur’s token rewards without making potentially costly mistakes in the process.\n\nDeFi and NFTs are merging. Ape and ape hard. — Machi Big Brother (@machibigbrother) February 18, 2023\n\nThe NFT-meets-DeFi approach isn’t entirely new. We’ve seen DeFi-like implementations for NFTs in recent months, such as Sudoswap and Hadeswap embracing liquidity pools versus traditional marketplace listings, plus BendDAO using that kind of format for NFT-based loans. Other NFT-based loan protocols have risen in recent months and flourished.\n\nLast August, amid earlier debates around NFT flipping and creator royalties, Crypto Twitter personality Cobie tweeted that NFTs are “altcoins with pictures.” It was a controversial take then, but Blur’s DeFi-like approach to NFT trading has executed that concept at a scale previously unseen—and the impact has been profound.\n\nOpenSea, long the market leader in terms of trading volume, has been eclipsed by Blur’s trading frenzy—and as a result, OpenSea announced Friday that it has temporarily cut its own 2.5% marketplace fee, and will cut back on some creator royalty enforcement protections. This means OpenSea, in an attempt to remain competitive with Blur, is effectively going \"zero fee,\" forgoing the fees that drive its own primary source of revenue as well the fees that finance most NFT projects.\n\nAD\n\nAD\n\nAs when OpenSea publicly considered changes to its creator royalties model last fall, many NFT artists and creators have vocally pushed back against the move. But Blur, which does not fully honor creator royalties across projects, apparently forced OpenSea’s hand last week as the longtime leader attempts to adjust to a new normal.\n\nOpenSea still serves more unique wallets than Blur—about 106,000 for OpenSea over the past week, with about 66,000 for Blur. But Blur has shot ahead in terms of number of transactions, along with the widening gap in trading volume.\n\nLike more exaggerated examples of wash trading, the flood of NFT flipping and rewards “farming” on Blur muddles the market data—and the surging trading volume from the past week doesn’t suggest that the NFT market is growing and onboarding scores of new collectors. It’s mostly whales trading among themselves.\n\n“We aren’t growing the pie,” tweeted Web3 project founder Naveen Jain. “It’s the same folks circulating assets and ETH around and around.”\n\nThat apparently is true, but the entire market is still forced to grapple with the shifting tides—from Blur and OpenSea battling it out for market share to project creators watching their revenue streams dry up as platforms cater more to NFT flippers and pro traders."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGFpbHljb2luLmNvbS96ay1yb2xsdXBzLXVucmF2ZWxsaW5nLWV0aGVyZXVtcy1zY2FsYWJpbGl0eS1pc3N1ZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "ZK-Rollups: Unravelling Ethereum's Scalability Issues - DailyCoin",
        "content": "Zk-rollups have long been touted as the ultimate solution to Ethereum’s woes. As blockchain and crypto adoption enjoy exponential growth worldwide, scaling solutions are needed to ensure the world’s leading smart contract platform can handle millions of users.\n\nZero-knowledge proofs and rollup technology aim to boost transaction throughput in the Ethereum ecosystem, but there are still a lot of questions about how zk-rollups work.\n\nIn this quick guide, we’ll be simplifying the complex jargon around zk-rollup solutions and making sure that you don’t have zero knowledge about zero-knowledge.\n\nWhat’s Wrong with the Ethereum Blockchain?\n\nSince the earliest days of Ethereum, every blockchain network has struggled to overcome a single concept: How to solve the Blockchain Trilemma. Coined by Vitalik Buterin, the Blockchain trilemma dictates that the perfect blockchain successfully balances decentralization, security and scalability.\n\nDecentralization – In the true spirit of blockchain, the perfect network is fully distributed. The network is self-sufficient and governed by its users, with miners and validators owned and operated independently worldwide. Bitcoin is a perfect example of decentralization in action.\n\n– In the true spirit of blockchain, the perfect network is fully distributed. The network is self-sufficient and governed by its users, with miners and validators owned and operated independently worldwide. Bitcoin is a perfect example of decentralization in action. Scalability – The perfect blockchain is fast and affordable, making it effective and efficient for all users, regardless of the size of their wallet. Low gas fees and fast transactions are the norm, rather than a unique feature.\n\n– The perfect blockchain is fast and affordable, making it effective and efficient for all users, regardless of the size of their wallet. Low gas fees and fast transactions are the norm, rather than a unique feature. Security – The perfect blockchain is safe. No one can break into your wallet by force, transactions are protected by complex cryptography, and the correct distribution of tokens prevents hackers from taking control of the network with a 51% attack.\n\nEven with dozens of Layer-1 blockchains competing daily, the blockchain trilemma remains unsolved. The irony of the trilemma is that balancing all three options is impossible because engineers always need to sacrifice one option to achieve the others.\n\nTake Solana, for example. Solana is often considered the fastest and most affordable blockchain available. The network boasts over 4,000 transactions per second (TPS), costing a single transaction less than a penny. Solana is also secure and just as safe as any other leading chain.\n\nOn the other hand, Solana suffers from the final point of the trilemma, decentralization. The network is often criticized for constant outages due to centralized points of failure. Solana’s strength and resources came from venture capitalists, who hold a somewhat heavy allocation of SOL tokens.\n\nDespite being the leading Layer-1 blockchain and smart contract platform in the crypto industry, Ethereum has difficulties overcoming the blockchain trilemma.\n\nEthereum Scalability\n\nIf you’ve ever used the Ethereum mainnet at peak traffic, you’ll know that scalability is not Ethereum’s strength. Throughout 2021 and 2022, Ethereum transaction costs were completely out of control. While basic send-and-receive transactions were around $20-30 each, more complex DeFi token swaps or NFT mints often cost over $100 each.\n\nSource: BitInfoCharts.\n\nTransaction fees and throughput are undoubtedly the biggest issues facing Ethereum scaling. During high congestion periods, dApps on the Ethereum network become almost unusable. In many cases, the transaction fee for buying an NFT costs more ETH than the NFT itself. These scalability issues make blockchain technology and decentralized finance (DeFi) inaccessible.\n\nUntil these problems are solved, cryptocurrency and blockchain adoption will struggle to onboard the masses. Thankfully, there are plenty of different ways for Ethereum to become the global powerhouse we know it has the potential to be.\n\nSome of the most revolutionary Ethereum scaling solutions are ZK and optimistic rollups.\n\nWhat are Rollups?\n\nRollups help reduce network congestion on the Ethereum main chain. They take computation and state-storage off-chain process transaction data on other blockchains and then send it back to the main chain. Essentially, rollups allow the network to ‘roll up’ a batch of transactions into one cost-effect transaction. This means users can enjoy the security of the Ethereum layer while benefitting from the cheaper gas fees and faster throughput of Layer-2 networks, like Polygon or Arbitrum.\n\nRollups aren’t the only Ethereum scaling solutions out there. Alternative methods include sharding, sidechains, and state channels. While these are all viable solutions, Buterin himself is most bullish on rolllups and believes that they’ll be an integral part of Ethereum’s future.\n\nRollups are typically divided into two groups, optimistic rollups, and zk-rollups. The main difference between the two is how they verify transactions. Optimistic rollups rely on fraud proofs to validate transaction data, while zk-rollups use zero-knowledge proofs (ZKPs).\n\nOptimistic Rollups\n\nAs the name suggests, optimistic rollups are, well, optimistic. Adopting an ‘innocent-until-proven-guilty’ approach, optimistic rollups assume that each transaction in a rollup is valid. The network all users a set period, usually around a week, to resolve disputes around fraudulent transactions.\n\nBy optimistically assuming that every transaction is valid, the network doesn’t have to devote excess time and computation to confirming transactions are accurate. Some of the most popular Layer-2 solutions, like Arbitrum and Optimism, use this technology to settle off-chain transactions before sending them back to the Ethereum main chain.\n\nZK-Rollups\n\nZk-rollups use complex cryptography called a zkproof to ensure that all rollup transactions are valid without sharing sensitive information about the transactions themselves. They rely on cryptographic proof and submit validity proofs to smart contracts on Ethereum instead of assuming that all transactions are valid.\n\nThis means that all zk-rollup transactions can be processed off-chain, while also reducing the amount of transaction data shared, making them focused on privacy. Moreover, because they don’t need to wait a week for fraudulent transactions to be contested, zk-rollups are considered a much faster and superior technology to Optimistic rollups.\n\nThe most common zk-proofs we see in cryptography are zk-snarks and zk-starks. Simply put, these systems allow users to prove that they know vital or sensitive information, such as transaction data, without publicly revealing the data.\n\nExamples of a few zk-rollup projects include Starknet and Immutable X.\n\nPros and Cons of Zero-Knowledge Rollups\n\nZk-rollups have made significant progress in addressing Ethereum’s scalability issues. They’ve introduced faster and more affordable transactions secured on the main chain and made DeFi more accessible than ever. That being said, they’re far from a perfect solution.\n\nAdvantages of Zk-rollups\n\nValidity proofs ensure that off-chain transactions are correct before being secured on the main chain.\n\nIncreased transaction throughput and low gas fees.\n\nTrustless cryptographic proofing ensures security is enforced by code instead of relying on validators, as we see with optimistic rollups.\n\nUsers can withdraw funds from zk-rollups without experiencing the week-long delays common on optimistic rollups.\n\nDisadvantages of Zk-rollups\n\nZero-knowledge rollups and proof systems are complicated to build and deploy.\n\nYou need specialized hardware to produce validity proofs, making them a centralization risk.\n\nZk-snark proof systems rely on an established, trusted setup for ongoing use. If misused, this setup is a security risk.\n\nThe Ethereum Virtual Machine (EVM)\n\nIf you’ve ever hopped between the most popular blockchain networks like Ethereum, Binance Smart Chain or Avalanche, you’ve probably noticed that many dApps and wallets have a similar interface and user experience. This is thanks to a convenient technology called the Ethereum Virtual Machine, or EVM.\n\nIn its purest form, the Ethereum Virtual Machine is a database and machine state for interacting with Ethereum accounts and contracts. Developers use the EVM to build and deploy dApps on the Ethereum network, as well as by users who interact with these applications using their crypto wallets.\n\nWhat’s special about EVMs is that they’re not Ethereum-exclusive. Many other blockchains run their own EVM, which makes it possible for Ethereum-based dApps and tools to be easily ported over and deployed on other networks.\n\nFor example, many decentralized exchanges like PancakeSwap on the Binance Smart Chain or Quickswap on Polygon were created using Ethereum smart contracts. See the similarities between UniSwap and PancakeSwap’s UI?\n\nEach respective network’s EVM makes it possible to write Ethereum-based code and applications and replicate them on other networks. This makes blockchain development between EVM-compatible chains far more interoperable and gives developers and users greater flexibility.\n\nzkEVM\n\nAs the name would suggest, a zkEVM uses ZK technology and proofing within an Ethereum Virtual Machine. Most importantly, they support smart contract development on zk-rollups, giving these powerful scaling solutions greater utility. Without a zkEVM, zk-rollups would be limited to simple transactions like basic send and receive functions.\n\nEssentially, a fully functional zkEVM will bring the complete Ethereum experience, including DeFi and NFTs, to the scalable and secure environment of a zk-rollup network.\n\nAn effective zkEVM can securely process thousands of transactions per second. This is a significant improvement from the Ethereum main chain, which struggles to clear more than 20 TPS.\n\nThe zkEVM Race\n\nCompetition within the zkEVM field is tense, with some of the biggest names in the crypto space, like Polygon, hustling to be among the first to deploy a functional zkEVM. The Polygon team has had their eyes set on a zkEVM for some time after purchasing the Hermez Network for $250M back in 2021.\n\nPolygon has since launched a zk-rollup solution named Polygon Hermez in mid-2022. While this represented a key milestone in the zk-rollup sector, Polygon Hermez is limited to simple token transactions, such as sending and receiving payments.\n\nThe Polygon zkEVM is expected to launch in 2023 and will bring greater utility and smart contract support to their zk-rollup scaling solution.\n\nOther projects like Matter Lab’s zkSync are leading contenders to release the world’s first zkEVM, alongside notable competitors like Starknet and Scroll.\n\nOn the Flipside\n\nWhile zk-rollups are arguably more scalable and secure, Optimistic rollups like Arbitrum attract more users and process more transactions than other Layer-2 scaling solutions. However, this could change with the launch of the first zkEVM, which will bring greater utility to zk-rollups.\n\nWhy You Should Care\n\nThe Ethereum network is ill-prepared to accommodate growing adoption and an influx of new users. Zk-rollup scaling solutions and zkEVMs will make blockchain technology and cryptocurrency far more accessible than before and drive mass adoption worldwide.\n\nFAQs"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMirAFodHRwczovL3d3dy5hdGFsYXlhci5jb20vZW4vYXJ0aWN1bG8vZWNvbm9teS1hbmQtYnVzaW5lc3MvZXRoZXJldW0tYmFzZWQtbWVtZS1jb2lucy1ob3ctd2lsbC1zaGliYS1pbnUtYW5kLWRvZ2V0dGktZmFyZS1jcnlwdG8tbWFya2V0LXRocm91Z2gtMjAyMy8yMDIzMDIyMDE0MzI0MzE4MTg0NS5odG1s0gGwAWh0dHBzOi8vd3d3LmF0YWxheWFyLmNvbS9lbi9hcnRpY3Vsby9lY29ub215LWFuZC1idXNpbmVzcy9ldGhlcmV1bS1iYXNlZC1tZW1lLWNvaW5zLWhvdy13aWxsLXNoaWJhLWludS1hbmQtZG9nZXR0aS1mYXJlLWNyeXB0by1tYXJrZXQtdGhyb3VnaC0yMDIzLzIwMjMwMjIwMTQzMjQzMTgxODQ1LmFtcC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Ethereum-Based Meme Coins: How Will Shiba Inu and Dogetti Fare In The Crypto Market Through 2023? - Atalayar EN",
        "content": "2023 has shown what the crypto market is capable of. Through the majority of 2022, the market was in a state of decline, with Bitcoin (BTC), the crypto market pioneer, dropping from $68,000 to $20,000. So, how will cryptocurrencies like Ethereum (ETH) fare through 2023? And more specifically, how will Ethereum-based meme coins fare through 2023?\n\nThe two Ethereum-based meme coins we will examine today are Shiba Inu (SHIB) and Dogetti (DETI). Shiba Inu is a household name among meme tokens, residing in the top fifteen cryptocurrencies by market capitalisation. Dogetti is a newcomer to the crypto market, aiming to transform the way we view meme coins. Let’s find out how Ethereum, Shiba Inu, and Dogetti will fare in the crypto market through 2023.\n\nDogetti’s NFT Collection Turns Heads Among Crypto Enthusiasts\n\nThe NFT collection proposed by Dogetti could see the platform take meme tokens to the next level. Dogetti will implement a breeding mechanism for its NFTs in the fifth stage of its roadmap, allowing Dogetti NFT holders to create new digital companions to either hold or sell for crypto or fiat currency.\n\nSo, what else can we expect from the Dogetti platform? Dogetti will host a DAO within its ecosystem, allowing DETI holders to vote on proposals concerning the platform’s future. This allows Dogetti community members to actively shape the direction of Dogetti throughout its history.\n\nAdditionally, Dogetti users will be treated to two major services on the platform, the NFT marketplace and the Decentralised Exchange (DEX). Due to Dogetti building on the Ethereum network, users can swap any ERC20 token with another on the DEX!\n\nEthereum Continues Good Form Into February\n\nAs many know, Ethereum switched its outdated Proof-of-Work (PoW) consensus for a Proof-of-Stake (PoS) consensus. This switch in consensus meant that Ethereum’s energy consumption dramatically fell, resulting in a 99.95% decrease in the network's carbon footprint.\n\nThe change also meant that Ethereum was able to increase its transaction speed. While Ethereum utilised a PoW consensus, the network was only capable of handling 15-30 transactions per second. However, at Ethereum’s peak performance, the network is capable of handling 100,000 transactions per second.\n\nEthereum is performing extremely well through February. The network has increased its market capitalisation by 8.40% in the past seven days at the time of writing. This positive trend brings hope for the rest of 2023 for Ethereum and Ethereum-based cryptocurrencies.\n\nShiba Inu Hits $7 Billion Market Capitalisation\n\nShiba Inu introduced itself to the crypto market as a direct competitor to Dogecoin (DOGE). Although the meme token platform is currently below Dogecoin in terms of market capitalisation, Shiba Inu has still made a significant impact on the crypto market.\n\nThe meme token giant has recently proposed a blockchain named Shibarium. The Shibarium blockchain will be Layer-2, utilising Ethereum’s technology. The blockchain is currently in the beta stage of development and will launch in 2023 if the beta phase is successful.\n\nAs mentioned above, Shiba Inu has hit a $7 billion market capitalisation. The platform is currently experiencing a positive trend, increasing its market capitalisation by 5.35% in the past seven days at the time of writing.\n\n\n\nFinal Thoughts\n\nSo, how will Ethereum and Ethereum-based cryptocurrencies fare through 2023? According to current trends, Ethereum, Shiba Inu and Dogetti’s 2023 crypto journey will be positive. Each platform has a special set of characteristics that could help it maintain positive trends.\n\nAdditionally, Dogetti offers 25% bonus tokens with each presale purchase. All you have to do is enter the ‘WISEGUY25’ code at the checkout to receive yours.\n\nFor more information on Dogetti (DETI), please visit the following links:\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY29pbmdhcGUuY29tL2JsdXItYmVjb21lcy10b3AtZ2FzLWd1enpsZXItcHJpY2Utc29hcnMtMTAxMTEv0gFIaHR0cHM6Ly9jb2luZ2FwZS5jb20vYmx1ci1iZWNvbWVzLXRvcC1nYXMtZ3V6emxlci1wcmljZS1zb2Fycy0xMDExMS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "BLUR Becomes Top \"Gas Guzzler\" On Ethereum, Binance To List? - CoinGape",
        "content": "BLUR, the native token of NFT marketplace Blur, is the number one gas burner on Ethereum. Earlier this week, Coinbase said they would launch trading of the BLUR-USD pair when there’s sufficient liquidity. And now, according to Etherscan.io, BLUR overtook UniSwap and Seaport in daily Eth trading volume.\n\nComputational resources on Ethereum are measured in units of gas and paid for by users on the network in the native cryptocurrency ETH. Its 24-hour fees have surpassed $457,006.19, representing nearly 9.91% of all Ethereum network fees of the past day. This week’s airdrop has resulted in over $4 million worth of Ethereum being burned in the last seven days.\n\nadvertisement\n\nBlur’s Growing Dominance\n\nBLUR’s total value locked (TVL) has witnessed a massive surge in the past 48 hours, reaching $121.42 million. This cemented its position as a dominant player in the NFT marketplace ecosystem. Interestingly, it also acts as an NFT marketplace aggregator. According to statistics, it was the largest in the ecosystem with a market dominance of almost 70%.\n\nAs reported previously by Coingape, Blur airdropped its BLUR tokens to more than 100,000 NFT traders. And just the following day, the company recommended NFT project creators prevent trades using OpenSea. There is no fee assessed to artists for using the marketplace. Read more crypto news here…\n\nMassive Price Surge\n\nBLUR price at the time of writing is $1.30 which represents an increase of 11.34% over the past 24 hours. Currently, its market capitalization is $504,594,132 and its 24-hour trading volume is up by 18.83%. Now it stands at $686,428,266. At the same time, the circulating supply is approximately 386,316,751 BLUR, according to CoinMarketCap’s crypto market tracker.\n\nAlso Read: Shibarium Beta To Go Live Next Week: Rumors or Reality?\n\nDisclaimer: The information provided in this article “Blur Is the Number One Gas Guzzler on Ethereum” is solely the author’s opinion and not investment advice, it is provided for educational purposes only."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZWdhbWVycy5pby8xOTkwcy1taWxrLWNhcHMtZ2FtZS1wb2dzLW1ha2UtYS1jb21lYmFjay1pbi1ldGhlcmV1bS1uZnQtZm9ybS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "1990s Milk Caps Game Pogs Make a Comeback in Ethereum NFT Form - egamers.io",
        "content": "Do you remember Pogs? Those circular cardboard pieces that were a hit in the 90s? Well, they’re back in a new form as Ethereum NFTs, attracting attention from blockchain gamers. Additionally, multiple Pogs Web3 games are being developed.\n\nWhat are Pogs, and how did they become NFTs?\n\nPogs were originally a children’s game that became a popular collectible in the 90s. The game involves players stacking cardboard discs, then taking turns to throw a larger disc at them, trying to knock them over and win the ones that land face-up.\n\nPogs are being reimagined as non-fungible tokens (NFTs) on the Ethereum blockchain, allowing them to be owned, bought, and sold digitally. The project is led by a startup called Pogs Digital, which is creating NFT versions of classic Pogs designs and new designs featuring popular NFT collections.\n\nOn April 6, the company behind Pogs will launch 3,800 Ethereum NFTs, all created with a unique artwork each, at a price of 0.049 $ETH (Almost $90)\n\nIn addition, the company plans to release multiple mobile games, allowing players to use their Pog NFTs to compete against each other and win more NFTs. These games are set to be released this summer, with the first game, called Stack and Slam, being scheduled to debut this week on the Solana blockchain.\n\nThe History of Pogs Game\n\nAccording to Wikipedia, Milk caps is a children’s game played with flat circular cardboard milk caps. Players make a stack of these caps and take turns dropping a heavier “slammer” object onto it, causing the caps to be disrupted.\n\nEach player keeps any face-up caps and is to restack the face-down caps, repeating the process until none land face-down, at which point the player who collected the most caps wins the game of milk caps.\n\nThe game is also known as Pogs, under which name it was sold commercially in the 1990s. The name originates from Pog, a brand of juice made from passionfruit, orange, and guava; the use of the juice caps to play the game preceded the game’s commercialization."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYmxvZy5rcmFrZW4uY29tL2NyeXB0by1lZHVjYXRpb24vbmZ0cy0xMDEtaWRlbnRpdHktZXhwcmVzc2lvbi13aXRoLXBmcHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "NFTs 101: Identity expression with PFPs - Kraken Blog Kraken Blog - Kraken Blog",
        "content": "There was once a time when displaying an image of your real face on social media was standard practice. A holiday photo, a mugshot, a pic of you and your pug; these were all commonplace ways of showcasing yourself to the world. But that time has passed, and a new era of social signaling has begun.\n\nNon-fungible tokens (NFTs) are one of the crypto industry’s most innovative creations. Here, artists and communities are constantly pushing the boundaries of art and ownership. One popular use case for higher-ticket NFTs that has emerged in this space is profile picture NFTs, or PFPs.\n\nWhat is a PFP NFT?\n\nThe PFP NFT all started when a collection of 10,000 pixelated characters called CryptoPunks. The collection first launched on Ethereum in 2017. At the time, Ethereum holders could get them by paying a small gas fee to generate a single punk.\n\nEach person who did so received an algorithmically generated NFT character, each with its own randomized set of traits of varying rarity. If you want to learn more about how the rarity of different NFTs can be measured, you can check out the Kraken Learn Center article What is an NFT rarity ranking?\n\nAs the NFT craze peaked in 2021, everyone wanted their own CryptoPunk NFT because of their immutable prestige as the first Ethereum PFP collection.\n\nThe rampant surge in demand for the collection’s limited supply sent CryptoPunk prices skyrocketing. Presently, the floor price for CryptoPunk NFT is 65 ETH (~$106,000). Only a few crypto enthusiasts own one and therefore, they carry a unique level of prestige.\n\nIt wasn’t long before people started substituting their Twitter profile pictures with their CryptoPunk NFT characters to cement themselves as an early adopter and express their punk personalities. This trend set the stage for holders of other popular NFTs to follow suit, and before long, PFPs became mainstream.\n\nClockwise, starting bottom right: CryptoPunks, SlimHoods, Doodles, BAYC, 0N1 Force, Lazy Lions.\n\nThese days, a variety of NFT collections fall within the PFP category. Bored Ape Yacht Club is another prominent collection featuring portraits of apes sporting unique facial expressions, accessories and clothing items. The creators later produced two additional spin-off collections – Mutant Ape Yacht Club and Bored Ape Kennel Club. All three collections are often featured as profile pictures on social media platforms.\n\nDoodles is another popular collection of colorful, cartoon characters that are easy to spot on social media platforms. Some OG NFT collectors choose to feature smaller collections such as SlimHoods, Lazy Lions, and 0N1 Force as their social profile pictures.\n\nHow to use an NFT as a PFP\n\nTwitter is the leading social media platform that supports PFP NFTs. Any NFT can be used as a PFP, the options are limitless!\n\nTo officially feature your NFT onto your Twitter profile as a PFP, you’ll first need to:\n\nPay for a Twitter Blue subscription (~ $8-$11 per month). Download the Twitter mobile application (free).\n\nThen, you’ll need to head to your profile on the mobile app, tap your profile picture > “Edit.” Three options will appear including “Choose NFT.” Clicking this option will take you to a screen prompting you to connect your crypto wallet that stores the NFT. Please be very careful when connecting a crypto wallet to any third-party website or app and double check the URL and security certificate before proceeding.\n\nThe social media platform currently supports multiple wallets, such as:\n\nMetaMask\n\nRainbow\n\nLedger Live\n\nTrust Wallet\n\nOnce connected, you’ll be able to select the NFT you wish to feature as your new profile picture.\n\nTwitter crops all PFP NFTs hexagonally to differentiate them from normal profile pictures.\n\nBeware of fakes\n\nWhile blockchain technology allows you to prove to the world that you are the true owner of an original media file, it doesn’t stop people from copying PFP NFT images and minting their own NFTs for themselves.\n\nSome may pose as legitimate NFT holders to gather followers, mislead people, or commit fraud — something to bear in mind when navigating the minefield that is “Crypto Twitter.” If you want more tips on how to keep your crypto and NFTs safe, be sure to check out our Crypto Security 101 video series.\n\n\n\nWhy buy a PFP NFT?\n\nNot only can a PFP serve as a visual extension of the digital identity you want to create for yourself, but they can also demonstrate your commitment to the cryptocurrency movement, and your appreciation of digital art.\n\nHolders are also finding new ways of increasing the utility of their PFP NFTs by setting up exclusive communities, selling physical merchandise sporting their NFTs, and providing early access to new NFT collection launches. When it comes to the practical benefits of owning an NFT, things are changing – and improving – every day.\n\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, or hold any digital asset or to engage in any specific trading strategy. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your crypto assets and you should seek independent advice on your taxation position."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGgtdGVzdHMtNS1tb250aC1oaWdoLWFzLXdoYWxlcy1yZXRhaW4tdGhpcy1vZi1zdXBwbHktbW9yZS1pbnNpZGUv0gFdaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aC10ZXN0cy01LW1vbnRoLWhpZ2gtYXMtd2hhbGVzLXJldGFpbi10aGlzLW9mLXN1cHBseS1tb3JlLWluc2lkZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "ETH tests 5-month high as whales retain this % of supply, more inside - AMBCrypto News",
        "content": "Ethereum rose to $1,700 on February 17.\n\nWhale and shark address holding have not slowed down their accumulation.\n\nThe price of Ethereum [ETH] reached $1,700 on 17 February after five months. Is this ascent an indicator of things to come? Or will the whale accumulation result in dumping before the Shanghai upgrade?\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nETH witnesses brief surge\n\nEthereum gained 3.45% on 17 February, according to a daily period analysis of the cryptocurrency. According to additional research into that trading period, it peaked at $1,721 before ending trade at $1,694.\n\nIt was five months since ETH’s price had last reached the $1,700 range during that trading period. Its price was roughly $1,694 at the time of writing.\n\nFurthermore, the Relative Strength Index (RSI) indicated that ETH was in a bull trend because its line was above the 60 mark. The price movement was also noted above both the long and short Moving Averages (blue and yellow lines). Therefore, the asset’s price moving above the (MAs) suggests a good price move and may also point to a possible future uptrend.\n\nShark and whale hold on\n\nRecent data from Santiment showed that whale and shark addresses were still tightly clutching onto their ETH bags. The graph shows that whale and shark addresses with 100–100,000 ETH still retained close to 47% of the entire supply of ETH. Furthermore, the absence of a sell-off following the most recent price increase suggested that investors anticipated further price increases.\n\nIn addition, an examination of the supply owned by the top addresses revealed that the addresses at the top had been on an accumulating binge. For most of January, the graph showing the quantity held by the top addresses as a proportion of the overall supply of Ethereum was rising. It has now leveled off, but at the time of writing, it was at 123.\n\nVolatility incoming?\n\nEthereum’s Shanghai upgrade will be the next big thing for the cryptocurrency sector. In March, users can withdraw more than $16.5 million worth of Ethereum (ETH) off the blockchain. The Merge was the last significant improvement to the network; however, it had little effect on the price of Ethereum.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nThe Shanghai upgrade will affect the supply and demand of ETH, whereas the Merge was a purely technological development with no apparent economic consequences. However, because of the long-term and short-term nature of the upcoming development, it has the potential to affect the ETH price significantly.\n\nWhen staked ETHs are released, it is unknown how the shark and whale addresses will respond. But if they, too, decide to sell their assets, ETH’s value will plummet. So, in terms of Ethereum’s price movement, March will be a crucial month."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmZvb2wuY29tL3RoZS1hc2NlbnQvY3J5cHRvY3VycmVuY3kvYmVzdC1jcnlwdG8tc3Rha2luZy1wbGF0Zm9ybXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "Best Crypto Staking Platforms for 2024 - The Motley Fool",
        "content": "Staking is when you commit your crypto assets to a blockchain to support the network and validate transactions. In return, you receive crypto rewards.\n\nThis is only an option with cryptocurrencies that confirm transactions using a model called proof of stake. To process transactions, these cryptocurrencies choose validators who have staked their own crypto. The validator checks a block of transactions, adds it to the blockchain, and receives a staking reward for their contribution. Examples of cryptocurrencies that use proof of stake include:\n\nYou can stake crypto on your own without a staking service, but it's not quite as easy. You'll need to store your crypto in a blockchain wallet, and you'll also likely need to join a staking pool with other crypto investors. Staking platforms, on the other hand, allow you to stake your crypto in a few clicks. This is also a big advantage if you're not comfortable storing your cryptocurrency.\n\nIt's worth mentioning that \"staking\" is often used as a catch-all to cover any way you earn rewards on your crypto. For example, some people refer to crypto lending programs as staking. They're not, but crypto lending can also be an effective way to earn crypto rewards, so we've included lending programs on our list of staking platforms.\n\nREAD MORE: What Is Staking in Crypto?\n\nAre there fees for crypto staking?\n\nCryptocurrency staking fees depend on the staking method and cryptocurrency you choose. Many platforms don't charge any staking fees, but there are some that do. You can find this information on the platform's fees page.\n\nIf you decide to stake crypto without using a platform, you will most likely need to join a staking pool. These pools are made up of groups of investors who pool their crypto for a better chance of earning rewards. Most staking pools charge a pool fee. This amount can vary, but anywhere from 2% to 5% is common."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL25mdC1tYXJrZXRwbGFjZS1ibHVyLWlvLWJ1cm5zLTI1Mi1ldGgtdG8taGl0LXRvcC1vZi1idXJuLWxlYWRlcmJvYXJkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "NFT marketplace Blur.io burns 252 ETH to hit top of burn leaderboard - CryptoSlate",
        "content": "NFT marketplace aggregator Blur.io has surpassed Uniswap, OpenSea, and Etherum transactions as the top ETH burner over the past 24 hours.\n\nData shared by Access Protocol CEO Mika Honkasalo from Ultrasoundmoney highlighted that over 252 ETH was burned as a result of Blur.io activity between Feb. 18 and Feb. 19. Furthermore, the two contracts identified by Ultrasoundmoney combined to a total of 310.7 ETH compared to 239.39 ETH and 177.8 ETH from Uniswap and OpenSea, respectively.\n\nHowever, when Uniswap V2 and V3 contracts are combined, Uniswap burned a total of 328 ETH, narrowly pushing Blur.io off the top spot.\n\nBlur.io\n\nBlur.io is an NFT marketplace aimed at “pro traders” with the ability to sweep the floor of multiple marketplaces from one dashboard. Blur gained notoriety through its airdrop campaign in late 2022 and has since seen a meteoric rise in popularity.\n\nAnalytics platform DappRadar placed Blur.io at the top of its leaderboard for volume over the past 24 hours as activity rose 41% to hit $114.34 million traded.\n\nEthereum burn mechanics\n\nA base fee is paid by the sender of an ETH transaction and then burned to reduce the overall supply of ETH. This burn mechanic reduces the overall supply of ETH over time with the implication of increasing its scarcity and potentially increasing its value.\n\nBurning the base fee, introduced in EIP-1559, also helps create a more stable fee market on the network. As the base fee is dynamically adjusted based on network congestion, burning the fee helps to ensure that the fee market remains stable and that fees do not become excessively high or volatile.\n\nBurn by sector\n\nBlur.io is also closing in on a 30-day timeframe which sees Uniswap and OpenSea top the charts with a combined 14,273 ETH burned in the past month. In addition, Blur.io was responsible for burning 3,012 ETH across the same period.\n\nFurthermore, the NFT sector took up 23% of the burned ETH over the past 30 days with 18,666 ETH. Comparingly, the DeFi sector took the majority at 32%, with a total of 25,403 ETH burned. However, in the past 24 hours, NFT transactions have burned 549 ETH, and DeFi burned 690 ETH.\n\nOverall, the data suggests that both the NFT and DeFi sectors are significant contributors to ETH burn activity, with the Blur.io marketplace emerging as a new notable player in the space.\n\nMentioned in this article"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mYWtlLWV0aGVyZXVtLWRlbnZlci13ZWJzaXRlLWxpbmtlZC10by1ub3RvcmlvdXMtcGhpc2hpbmctd2FsbGV00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Fake Ethereum Denver website linked to notorious phishing wallet - Cointelegraph",
        "content": "A fake website of the popular Ethereum Denver conference is the latest phishing target of a red-flagged smart contract that has stolen over $300,000 worth of Ether (ETH).\n\nThe popular conference saw its website duplicated by hackers this week in order to trick users into connecting their MetaMask wallets. According to Blockfence, which identified the fraudulent website, the smart contract has accessed more than 2,800 wallets and stolen over $300,000 over the past six months.\n\nAnother day, another scam.\n\nThis time the scammer targeted the @EthereumDenver website. Blockfence is here to protect you and fight scammers together: The scam contract was marked as \"High Risk\" by our ML algorithm and our partners at @GoplusSecurity pic.twitter.com/Jdtoz2Bgu4 — Blockfence (@blockfence_io) February 20, 2023\n\nETHDenver also issued a notice to its followers on Twitter warning of the malicious website.\n\nHello Fellow Bufficorns!!\n\n\n\nPlease be aware that there is a FAKE ETHDenver website that is asking for you to connect your wallet.\n\n\n\n“Go-ETHDenver” is not us. Please report the site! pic.twitter.com/1dt4hYmfvO — ETHDenver (@EthereumDenver) February 20, 2023\n\nBlockfence CEO Omri Lahav told Cointelegraph that users were prompted to connect their MetaMask wallets via the usual “connect wallet” button. The website prompts a transaction that, if approved, carries out the malicious function and steals the users’ funds.\n\nBlockfence’s research team identified the incident while tracking different trends in the industry. Lahav said that the smart contract executing the scam had stolen over 177 ETH since its deployment midway through 2022:\n\n“Since the smart contract was deployed almost six months ago, it’s possible that it was used on other phishing websites.”\n\nHackers had gone as far as paying for a Google advertisement to promote the malicious website’s URL, banking on search trends being high, with ETHDenver taking place on Feb. 24 and 25. The fake website appeared second on a Google search, above the actual ETHDenver website.\n\nAs Cointelegraph previously reported, hacks and scams continue to be commonplace in the cryptocurrency ecosystem. 2022 saw over $2.8 billion of cryptocurrency stolen through a variety of hacks and exploits."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vY29pbmdlZWsuY29tL2FjY291bnQtYWJzdHJhY3Rpb24tb24tYml0Y29pbi1zaW5jZS1kYXktMS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Account abstraction on Bitcoin since day 1 - CoinGeek",
        "content": "This post was first published on Medium.\n\nAccount abstraction has for a long time been a dream of Ethereum and has become a hot topic recently.\n\nWe demonstrate Bitcoin has shipped with account abstraction/unification since its genesis. Thus, all the salient features promised by AA can be and have been developed on Bitcoin, without any protocol changes and with little added complexity. Ethereum’s flawed initial design requires constant and complex retrofits to realize AA, which is still yet to be delivered, over 14 years later than Bitcoin.\n\nAccount Abstraction (AA)\n\nTo understand AA, we need to understand how accounts work on Ethereum first. An Ethereum account is similar to a bank account, but holds ethers or ETH rather than fiat. There are two types of accounts on Ethereum, both identified by a unique address.\n\n1. Externally Owned Account (EOA)\n\nEOAs are accounts owned by something external to the blockchain: users. They are the traditional accounts that users create with a wallet like MetaMask. An EOA has a public address controlled by the user’s private key, which can sign and initiate transactions. The validation of signature is hardcoded into the base layer and runs outside of the Ethereum Virtual Machine (EVM).\n\n2. Contract Account (CA)\n\nThese accounts are commonly known as smart contracts and are controlled by their smart contract code, not a private key. The smart contract is run in the EVM. Also a CA has storage and code, neither of which an EOA has.\n\nMotivations for AA\n\nEOA suffers from an one-size-fits-all issue. Whether an EOA has a balance of 1 ether or ethers worth billions of dollars, it is secured by a single private key. If a user loses the private key (or seed phrase) due to a small mistake, she can lose everything. This makes self-custody non-viable for mainstream audience.\n\nAA seeks to improve user experience and eliminate the existence of two types of accounts by unifying EOA and CA. It makes EOA programmable by moving the validation logic of signed transactions into the EVM, as in CA. An EOA can be tailored to each user’s needs.\n\nThe History and Current State of AA\n\nThere have been many proposals over the years on how to achieve AA on Ethereum.\n\nSome requires significant protocol changes such as EIP-2938. Others does not require protocol changes but fundamentally changes the workflow of a user wallet, such as the latest EIP-4337. It introduces a new mempool, a new actor called bundlers, and multiple new layers, among other changes. Given the enormous complexities introduced, it is not surprising EIP-4337 has not seen any meaningful adoption.\n\nAccount Abstraction on Bitcoin\n\nThe Bitcoin equivalent of an account is a so-called Unspent Transaction Output (UTXO). The bitcoins in a UTXO are controlled/locked by the smart contract code in it. To spend them, a user has to provide the matching “key”, which typically requires some kinds of secret information.\n\nCrucially, there is no distinction between a UTXO controlled by a private key and a UTXO not controlled by one. The spending condition of a UTXO is always validated in the Bitcoin Virtual Machine (BVM). The most popular types of UTXO has an address used by all Bitcoin wallets and is controlled by the corresponding private key¹. However, its validation of signature is still done at BVM and NOT baked into the base layer and thus requires no special handling, in contrast to Ethereum.\n\nUse cases\n\nBitcoin has AA from the beginning since it unifies all account/UTXO processing. To corroborate this, we list some of the most prominent AA features that have been implemented on Bitcoin. Other AA features can be achieved similarly.\n\nSponsored transactions\n\nIt allows third parties (such as a paymaster and an application) to pay transaction fees on behalf of their users. This is needed to onboard users without any bitcoins. One way to enable it is using the ANYONECANPAY sighash flags. It allows anyone to add inputs to a partially signed transaction, which can be used to pay miner fees.\n\nDifferent signature schemes\n\nBitcoin uses a specific signature scheme called ECDSA on a specific elliptic curve called secp256k1 by default, the same as Ethereum. Since a UTXO is controlled by a programmable smart contract, we can use any alternative signature schemes. For example, we have implemented Schnorr and BLS signatures.\n\nWe have also implemented ECDSA on alternative curves like secp256r1, which enables hardware signing using the secure enclave of iOS and Android devices.\n\nVault\n\nA non-custodial Bitcoin vault has been built, where bitcoins locked inside can only be transferred after a user defined time delay. A user can also set a spending limit per day and whitelists/blacklists, among other things.\n\nRecurring payments\n\nA Patreon-like service on Bitcoin has been implement to allow recurring payments.\n\nMultisig\n\nBitcoin has built-in support for multisig out of the box.\n\nNOTE:\n\n[1] The smart contract is called Pay to Public Key Hash (P2PKH).\n\nWatch: Blockchain: Data Power-Ups and NFTs for eSports & Online Games\n\nwidth=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1heGllLWluZmluaXR5LWJpdGNvaW4tZXRoZXJldW0tYXNpYW4td3JhcC0yMC1mZWJydWFyeS0yMDIzMDIyMDAwMDnSAZcBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvY3J5cHRvY3VycmVuY2llcy1wcmljZS1wcmVkaWN0aW9uLWF4aWUtaW5maW5pdHktYml0Y29pbi1ldGhlcmV1bS1hc2lhbi13cmFwLTIwLWZlYnJ1YXJ5LTIwMjMwMjIwMDAwOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Axie Infinity, Bitcoin & Ethereum — Asian Wrap 20 February - FXStreet",
        "content": "Ethereum price has been consolidating within an overall uptrend, but there are signs of a potential trend reversal. Traders should exercise caution and implement effective risk management strategies before entering any trades on the ETH price.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMivwFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWZlYnJ1YXJ5LTIwLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLWJsdXItc3RhY2tzLXN0eC1nYWluZXItbG9zZXItMTU4MzI3NdIBwwFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWZlYnJ1YXJ5LTIwLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLWJsdXItc3RhY2tzLXN0eC1nYWluZXItbG9zZXItMTU4MzI3NS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Ethereum Remain Stable STX Gains Over 87 Percent - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH), arguably two of the most popular crypto coins in the world, managed to remain above the $24,000 and $1,600 marks, respectively, over the weekend. While other popular altcoins — including the likes of Dogecoin (DOGE), Litecoin (LTC), and Ripple (XRP) — saw minor losses, Solana (SOL) gainer over 10 percent in the last 24 hours. Speaking of gainers, the price of Stacks (STX) saw a 24-hour jump of over 87 percent, making it the biggest gainer of the lot.\n\nThe global crypto market cap stood at $1.11 trillion at the time of writing, registering a 24-hour dip of 0.68 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $24,346.95, registering a 24-hour loss of 1.38 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 20.47 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,683.06, marking a 24-hour loss of 0.71 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.42 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour dip of 1.56 percent, as per CoinMarketCap data, currently priced at $0.0873. As per WazirX, Dogecoin price in India stood at Rs 7.40.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 2.29 percent. At the time of writing, it was trading at $97.70. LTC price in India stood at Rs 8,250.\n\nRipple (XRP) price today\n\nXRP price stood at $0.3881, seeing a 24-hour dip of 0.99 percent. As per WazirX, Ripple price stood at Rs 32.40.\n\nSolana (SOL) price today\n\nSolana price stood at $25.77, marking a 24-hour jump of 10.32 percent. As per WazirX, SOL price in India stood at Rs 2,052.23.\n\nTop crypto gainers today (February 20)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nStacks (STX)\n\nPrice: $0.7648\n\n24-hour gain: 87.40 percent\n\nConflux (CFX)\n\nPrice: $0.2213\n\n24-hour gain: 46.72 percent\n\nNeo (NEO)\n\nPrice: $10.86\n\n24-hour gain: 12.97 percent\n\nFilecoin (FIL)\n\nPrice: $8.65\n\n24-hour gain: 10.99 percent\n\nSolana (SOL)\n\nPrice: $25.79\n\n24-hour gain: 10.51 percent\n\nTop crypto losers today (February 20)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nBlur (BLUR)\n\nPrice: $1.24\n\n24-hour loss: 8.59 percent\n\nMina (MINA)\n\nPrice: $0.9928\n\n24-hour loss: 6.94 percent\n\nRender Token (RNDR)\n\nPrice: $1.70\n\n24-hour loss: 6.75 percent\n\nThe Graph (GRT)\n\nPrice: $0.1695\n\n24-hour loss: 6.33 percent\n\nLido DAO (LDO)\n\nPrice: $3.01\n\n24-hour loss: 6.12 percent\n\nWhat crypto exchanges are saying about the current market scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “This morning, Bitcoin saw a slight dip, dropping from $25,000 to $24,000. Despite this, the BTC has maintained its weekly gains, indicating continued buyer activity. If buyers push the price back up to $25,250, there is no major resistance until $31,000. The support level for BTC currently sits at $23,800. Ethereum has followed a similar pattern, with its current trading near its resistance level of $1,700. Breaking through this could lead to an uptrend soon.”\n\nWazirX Vice President Rajagopal Menon said, “Bitcoin has seen a slight dip compared to the previous day because the US observed a President’s Day. Similarly, Ether has also been trading low in the past 24 hours for the same reason.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin said, “The BTC/USD pair had limited trading activity on Sunday, hovering between $24,400 and $25,250. A potential breach of the $25,250 resistance level could see Bitcoin rise towards $26,000 or $26,450, but a break below $23,300 could lead to a further decline towards $22,850.”\n\nKunji founder Anurag Dixit offered his take, “Bitcoin (BTC) has recently made multiple attempts to break through the significant resistance level of $26,000, but has been met with consistent retracements. However, despite this, certain sub-sectors within the cryptocurrency market have continued to perform strongly over the weekend, indicating the emergence of notable outperformance trends.\"\n\nShivam Thakral, the CEO of BuyUCoin, said, “It’s a great start for the week as Bitcoin is ready to test the crucial $25,000 mark. BTC is up by almost 12 percent in just seven days while the second largest digital asset Ethereum is up by over 10 percent during the same period. If Bitcoin finds strong support at the $24,000 level then it will provide much-needed momentum for BTC to test $30,000 in near future. Coinbase results and Hong Kong’s new licensing regime for VASPs will have a significant impact on the market in the coming weeks.”\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tb2R1bGFyLWJsb2NrY2hhaW5zLWNvdWxkLWJlLXRoZS1uZXh0LWhvdC1jcnlwdG8tbWFya2V0LXRyZW5kLWluLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Modular blockchains could be the next hot crypto market trend in 2023 - Cointelegraph",
        "content": "The public blockchain sector grew from less than a few million dollars in the last decade to a $1 trillion industry. However, one thing that the space has yet to achieve is a decentralized, secure interoperable solution.\n\nLet’s take going from Ethereum to Bitcoin, the largest blockchain network, as an example. Historically, centralized exchanges have been one of the few safe, viable solutions for shifting from one chain to another.\n\nBitGo, a centralized solution provider, provides the largest pool of liquidity for Ethereum users to gain Bitcoin (BTC) exposure via Wrapped Bitcoin (WBTC). The BitGo IOU accounts for over 93.6% of the Bitcoin bridged to Ethereum. Users must rely on BitGo partner platforms like centralized exchanges or CoinList to exchange BTC and WBTC.\n\nThe dominance of WBTC exposes it to evident centralization and regulatory risks. RenBTC, a platform managed by Alameda Research, dissolved in December 2022 after FTX’s collapse, and the same might happen with BitGo. The recent regulatory crackdown on Paxos for issuing the U.S. dollar-backed Binance USD (BUSD) stablecoin could also eventually bring services like BitGo into the U.S. Securities and Exchange Commission’s crosshairs.\n\nThe interoperability between smart contract platforms and other application-specific blockchains must also be developed. Sidechains and rollups on Polygon, Arbitrum and Optimism comprise 90% of the cross-chain bridge volume from Ethereum. Near’s Rainbow and Fantom bridges are the only independent blockchains with a notable total value locked on bridges with Ethereum.\n\nEthereum market share of bridges by TVL. Source: Dune\n\nSeveral major crypto projects, such as Polkadot and Cosmos, implemented modularity from the ground up to build a secure, scalable cross-chain platform, with the ultimate goal being to establish an interoperable “network of networks.” However, Cosmos and Polkadot have yet to attract sufficient liquidity to its ecosystem.\n\nThe issue of bridge centralization\n\nThe 2021 hype cycle witnessed the emergence of a “multichain future” where various blockchain host specific functions but are joined together through interoperable solutions. The first generation of bridges was highly primitive and centralized, eventually making them hot targets for exploits.\n\nThe next generation of interoperable solutions operate as separate blockchains to include decentralization and enhance security. These include intermediate transfer tokens like THORchain’s RUNE (RUNE). However, the daily volume of transfers via THORchain has stayed below $20 million, suggesting that it has failed to pick up usage.\n\nThreshold, which introduces a trustless and private portal for Bitcoin on Ethereum, will launch in Q1 2023. It will look to replace centralized providers like BitGo in bridging liquidity between Bitcoin and Ethereum.\n\nSome other protocols focus on the interoperability between smart contract platforms.\n\nLayerZero is an omnichain interoperability protocol that allows the development of applications like decentralized exchanges and lending protocols on top of it. These protocols can interact with monolithic chains like Ethereum, Cosmos Hub and Solana. Stargate is the first DEX built using LayerZero and has a liquidity of $324 million across Ethereum, Polygon, BNB Smart Chain and Avalanche.\n\nCelestia is a layer-1 blockchain built using the Cosmos SDK. The platform supports smart contract execution but is only responsible for ordering transactions and making a blockchain’s data more accessible.\n\nIt aims to act as an intermediate layer between Ethereum rollups and the mainnet by compressing the rollup data for faster execution on the Ethereum layer 1. Celestia does not verify the block data but helps optimize the gas cost and speed of execution. This capability will extend to layer-1 blockchains like Cosmos, Solana and Avalanche.\n\nThe team will run an incentivized test in Q1 2023 to start public testing and reward testnet validators with a potential airdrop of native tokens.\n\nCelestia testnet incentives announcement. Source: Celestia’s Discord\n\nRelated: ‘Multichain future is very clear’ — MetaMask to support all tokens via Snaps\n\nFuel Labs, the team building Fuel Network, also developed the Fuel Virtual Machine and Sway programming language, which enhances transaction speed. The team launched its second beta testnet in November 2022, and the public testnet is expected to go live sometime in 2023.\n\nWhile the interoperable space remains underdeveloped and exposed to centralization risks, various teams are working on decentralized solutions that will launch in 2023. These protocols will securely bridge the liquidity across decentralized finance protocols and other layer-1 blockchains. On top of that, they will also help build a multichain future, where the user experience will be blockchain agnostic and protocols will interact with each other seamlessly.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiKWh0dHBzOi8vY2xlYXJ0YXguaW4vcy9ldGhlcmV1bS12cy1jYXJkYW5v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "Ethereum vs Cardano 2.0: What Is The Differences ? - ClearTax",
        "content": "Over the years, users have compared Ethereum and Cardano because they have similar features. Both blockchains run smart contracts and have a range of decentralised finance applications for their users. Developers can use both these blockchains as they come with features that are quite similar.\n\nHowever, there are a few key areas where they differ. Let’s find out more about how these two cryptos differ.\n\nEthereum vs Cardano: Top parameters\n\nLet’s look at the following parameters to highlight the differences between Ethereum and Cardano. These include:\n\nConsensus mechanism\n\nEthereum currently uses the Proof-of-Work (PoW) consensus mechanism to validate transactions on its network. In this process, validators or miners use high-powered ASIC computers to find the correct nonce and validate a blockchain block.\n\nMiners can add new blocks in roughly 12 seconds on this network. This mechanism ensures that Ethereum works in a decentralised manner and all members agree on things like the order of transactions and account balances.\n\nEthereum uses an algorithm called Ethash for its mining operations. This algorithm makes miners participate in a race of trial and error to find the correct nonce to validate a block. A miner can only add a block on the network when they find a valid nonce. They achieve this by downloading and running the full dataset through a mathematical function. The dataset generates a target mixHash that is below the target nonce.\n\nThe mining difficulty set by the blockchain will determine how easy it is for miners to get a valid nonce for validating the block. This entire process though complex makes the network difficult to hack, and malicious users do not get to double-spend their coins.\n\nCardano uses the Proof-of-Stake (PoS) mechanism to power its blockchain. Here, the validators, known as stakers, need to stake or invest a certain amount of tokens on the blockchain to get a chance to win validation rights for a block. The higher your stake, the chance you will get the right to validate the block.\n\nThe PoS algorithm that Cardano uses is called Ouroboros. It divides time into epochs and slots. Epochs are overarching time frames, while the slots are 20-second increments within the epochs. The algorithm chooses a random slot leader among each slot, choosing the block that will be added to the blockchain. On Cardano, you can add a new block every 20 seconds.\n\nThere are two types of blocks that you can add to the Cardano blockchain:\n\nMain block\n\nIt contains all transaction-related information, software update proposals and a list of votes for these updates.\n\nGenesis block\n\nThis block contains a series of main blocks and lists all the slot leaders associated with the epoch.\n\nWhen the epoch ends, the leaders of the previous slot elect the slot leaders of the next epoch. Each slot leader performs a “coin tossing act” to randomly choose the next slot leader.\n\nIf you compare both mechanisms, you will see that both have pros and cons. The PoW mechanism is very energy intensive, and you need much computation power to start mining. However, in the case of the PoS mechanism, you need high initial investment to add a stake. Ethereum 2.0 will use the Proof-of-Stake consensus mechanism when it releases in future.\n\nToken, transaction speed and transaction fees\n\nEther (ETH) is the main cryptocurrency powering Ethereum. When miners validate a block, they get newly minted Ether as block rewards. Ethereum does not have a limit on its supply. Its supply is set to increase at a fixed rate of 4.5% yearly. Ethereum transaction speeds can range from 15 seconds to five minutes. On some days, transactions take longer to validate due to network load. The transaction fee of Ethereum at the time of writing is 0.729 USD.\n\nThe native coin of Cardano is ADA. For every successful block, slot leaders get newly minted coins as rewards. Unlike Ethereum, Cardano has a limited supply of 45 billion. The transaction speeds of Cardano are approximately 250 per second. The transaction fee of Cardano at the time of writing is 0.16 USD.\n\nNodes\n\nEthereum mainly uses a set of three nodes to run its operations. They are:\n\nLight nodes\n\nThese nodes use limited, shortened data from the blocks. They synchronise with the full blocks to ensure accuracy.\n\nFull nodes\n\nCompared to light nodes, full nodes carry more blockchain data and history. They can also display historical data when commanded.\n\nArchive nodes\n\nThese nodes hold the entire history of the blockchain, that is, the transaction data and history from all the previous blocks.\n\nEthereum also uses two more nodes for its functioning. They are Mining nodes and Ethereum Virtual Machine (EVM). The mining nodes belong to the miners on the network, and the EVM nodes are responsible for providing a runtime to execute smart contract code.\n\nCardano uses three nodes to function. They are:\n\nEdge nodes\n\nThese nodes are responsible for creating crypto transactions.\n\nmCore nodes\n\nYou can use these nodes to stake ADA tokens and participate in blockchain governance.\n\nRelay nodes\n\nThe function of these nodes is to send information between mCore nodes and the public internet.\n\nHistory and vision\n\nFounded on 30 July 2015, Ethereum was the brainchild of Vitalik Buterin, who was one of the co-founders. He considered this network as a \"world computer\" that anyone could use to launch and run an application.\n\nHe started the Ethereum Foundation, which sold 72 million ETH at a crowd sale. At that time, the valuation of this amount was $18 million.\n\nDevelopers like Jeff Wilke, Gavin Wood, Charles Hoskinson and Joseph Lubin made notable contributions that made Ethereum what it is today.\n\nEthereum aims to use blockchain technology for decentralising products and services in an array of use cases other than just money.\n\nLaunched on 27 September 2017, Cardano was founded by Charles Hoskinson and Jeremy Wood. It aims to be a third-generation blockchain project and wishes to solve the issues that Ethereum users face. Its high scalability, energy-efficient consensus mechanism and lower transaction fees make it an attractive alternative to Ethereum.\n\nUnlike Ethereum, which has reached a stable place in the blockchain market, Cardano is still growing and is yet to reach its full potential. At the time of writing, the market cap of Ethereum is $132,321,750,953, and that of Cardano is $14,290,667,586. If you want to invest on either of these platforms, conduct thorough research and find the current market trends."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL2V0aGVyZXVtLXNoYW5naGFpLXVwZ3JhZGUtc2V0LWZvci1zZXBvbGlhLXRlc3Qv0gFOaHR0cHM6Ly93d3cudHJvbndlZWtseS5jb20vZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS1zZXQtZm9yLXNlcG9saWEtdGVzdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Shanghai Upgrade Set For Sepolia Test Network Launch Despite Latest Bug Discovery - TronWeekly",
        "content": "Despite encountering a bug in the latest Shanghai release for the Geth EL client, Ethereum developers have agreed to proceed with the launch of the Shanghai upgrade on the Sepolia test network later this month.\n\nThe bug was discovered on February 16th during the All Core Developers Execution (ACDE) call #155, which the Ethereum Foundation’s Tim Beiko chaired. The bug affected the Geth EL client and was discovered during testing on the Zhejiang test network.\n\nEthereum Developers to Implement Changes to Protocol\n\nThe Geth (EL) client team has since issued a fix for the bug, which caused nodes to fail to download and initialize blocks with zero withdrawals and transactions.\n\nDuring the ACDE call, representatives of the Nethermind and Erigon (EL) client teams confirmed that they would double-check the logic for handling empty blocks in their latest releases to ensure that they were not vulnerable to the same bug. In addition, the developers agreed to exclude zero blob transactions from the mempool and Ethereum protocol.\n\nThe developers discussed how the protocol and mempool should handle transactions formatted as blobs that do not contain any data and ultimately agreed to ban zero blob transactions from the protocol in their implementation of EIP 4844 for the Cancun upgrade.\n\nDespite these issues, developers are committed to launching the Shanghai upgrade on the Sepolia test network on February 28th. To achieve this, client teams must cut new releases for Shanghai by early next week, and all client teams have confirmed they can do so.\n\nFurthermore, developers will begin testing the circuit breaker mechanism of MEV-Boost software in the coming weeks. Additionally, the Ethereum Nimbus (CL) client team is making progress on updating Ethereum EL block headers to an SSZ format, with two main approaches currently being considered.\n\nHowever, the Ethereum protocol is constantly evolving, and its developers are working hard to make it even better. While bugs and issues are to be expected along the way, developers remain committed to moving forward and delivering the Shanghai and Cancun upgrades, which are critical to the continued success of Ethereum.\n\nRelated Reading | Polygon (MATIC) Sees 65% Surge in Trading Volume – Here’s Why"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3dlZWtseS1tYXJrZXQtd2F0Y2gtYml0Y29pbi1ldGhlcmV1bXMtZ2Fpbi_SAUpodHRwczovL3d3dy50cm9ud2Vla2x5LmNvbS93ZWVrbHktbWFya2V0LXdhdGNoLWJpdGNvaW4tZXRoZXJldW1zLWdhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Weekly Market Watch: Bitcoin & Ethereum's Bulls Gain Momentum, Low Cap Tokens Experience Growth - TronWeekly",
        "content": "The previous week showed a more positive outlook for the crypto markets, with both Bitcoin and Ethereum seeing upward momentum. Although smaller market-cap coins initially saw notable growth at the beginning of the week, any progress made was ultimately wiped out by the week’s end.\n\nDuring the previous week, the cryptocurrency community was abuzz with talk about two low cap coins, BLUR and FLOKI, which had garnered significant attention. However, as the week drew to a close, both coins experienced substantial losses, reversing their double-digit gains and ending up in the red on the daily chart.\n\nFLOKI, a token themed around dogs, saw a surge in price on February 16th, reaching its highest levels since January 2022. On that day, the price of FLOKI rose by 65.43% in the last 24 hours and 75% in the previous seven days, with a 176% increase in trading volume over the past 24 hours.\n\nSource: CoinMarketcap\n\nAdditionally, the market cap grew by 65%. Currently, the coin has experienced a downturn, with about a 6% decrease in the last 24 hours, but it’s still up by 108.9% on the weekly chart.\n\nThe BLUR non-fungible token (NFT) marketplace launched its native token last week, and users who were awarded token allotments received “care packages.” Blur tokens began trading on February 14th, reaching a high of $5.02 per token. However, the coin has since dropped more than 97.16% from its all-time high and 5% on the daily chart.\n\nSource: CoinMarketcap\n\nHowever, several altcoins with also low-cap coins on the list of weekly gainers have shown substantial growth, with Conflux (CFX) leading the pack, followed by Filecoin (FIL) and The Klaytn (KLAY) in third place. Other tokens have also experienced significant gains.\n\nThe native cryptocurrency of the Conflux network, CFX, has been making waves in the crypto market, experiencing a surge of 294.54% over the past week and showing unique bullish signs.\n\nThe rise in price was sparked by Conflux’s announcement on February 15th that it plans to build blockchain-based SIM cards (BSIM cards) in partnership with China’s Telecom, the second-largest wireless carrier in China.\n\nAs of Monday, CFX was trading at $0.2132, experiencing a 25% increase in the past 24 hours and a remarkable 114.67% surge in the 24-hour trading volume. The token reached its peak of $0.2378 and ended the week at $0.2263 after starting at $0.05184, displaying a robust and impressive performance.\n\nSource: CoinMarketcap\n\nHowever, some market analysts caution that the token’s current rally may not be sustainable, with the support level at $0.090 considered unstable. A potential break below this mark could lead to a drop to $0.050 in the coming days.\n\nMeanwhile, as the Filecoin network continues to progress in the crypto market, it has garnered the community’s attention as a weekly gainer. Filecoin’s native cryptocurrency, FIL, has seen a significant surge of about 70% in the past week as it rallies ahead of the launch of the Filecoin Virtual Machine (FEVM) on the Filecoin mainnet.\n\nCurrently trading at $8.49, FIL reached its peak of $9.40 and ended the week at $8.44 after starting at $4.92, showing a strong and impressive performance. Despite experiencing a 3% decrease in the last 24 hours, the token’s trading volume has gone up by 50%.\n\nSource: CoinMarketcap\n\nMoreover, some popular coins are experiencing gains in weekly charts, including Klaytn (KLAY) at 35%, Solana SOL at 25%, and Polkadot DOT, with an increase of 20%, according to the data from CoinMarketcap.\n\nBitcoin (BTC) & Ethereum (ETH) Weekly Review\n\nAfter experiencing three consecutive weeks of consolidation without any significant gains, Bitcoin has made a strong comeback this week by surpassing the key resistance level of $25,000, marking a robust performance.\n\nSource: CoinMarketcap\n\nBitcoin recently reached an 8-month high on February 16th, but according to data analyst Santiment’s tweet, this bullish trend was accompanied by a significant amount of euphoria that may have caused a temporary peak in value.\n\nThe tweet suggests that the positive sentiment on social media platforms may have been overdone, leading to a local top. Additionally, negative commentary earlier in the month caused a temporary dip in Bitcoin’s value, with many investors losing faith in its long-term prospects.\n\nSimilar to Bitcoin, Ethereum has experienced a significant surge in value in the past week, reaching an impressive 5-month high on February 16th, according to another tweet by data analyst Santiment.\n\nThe rise in Ethereum’s value is notable as it follows the significant #merge event that merged Ethereum’s mainnet with the Ethereum 2.0 beacon chain. Additionally, the data indicates that a high concentration of ownership remains in the market, with shark and whale addresses holding nearly 47% of the supply.\n\nCoinMarketCap data shows that Bitcoin is currently trading at $24,473.30, with a slight decrease of 0.50% over the past 24 hours but a 12.49% increase over the past seven days. While ETH is being traded at $1,692.55, experiencing a 0.07% decrease in the past 24 hours and a 12.14% increase in seven days. Additionally, both leading coins are experiencing a 50% growth in the 24-hour trading volume."
    }
]