[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXR3aWNlLWluLWNyeXB0by10b3AtMTDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Now Featured Twice in Crypto Top 10 — Thanks to Lido - Blockworks",
        "content": "Ethereum now commands two out of the top 10 market cap spots, after the premiere ETH staking derivative flipped Binance’s stablecoin earlier this week.\n\nLido Staked ETH (stETH) is now worth more than $10 billion, per CoinGecko, eclipsing Binance USD (BUSD), which now has only $8.4 billion in circulation.\n\nBUSD had about double that at the start of the year, ranking it in seventh place, slightly behind XRP.\n\nIts issuer Paxos has faced compounding redemptions after a Wells notice from the SEC claimed the stablecoin represents an unregistered securities offering.\n\nClick play to watch stETH flip BUSD and enter the top 10 | Chart by David Canellis\n\nLike other liquid staking providers, Lido allows ether holders to stake their ETH in return for a separate derivative token, stETH.\n\nStaking directly to the Ethereum blockchain without services such as Lido requires 32 ETH ($56,500) to operate a staking validator node. All staked ether cannot be withdrawn until the network’s next big upgrade, Shanghai, goes live next month.\n\nStETH turns ETH staked via Lido into an immediately liquid asset, which can either be traded on crypto exchanges, lent out or used as collateral for loans across DeFi protocols.\n\nThe token is backed by ether locked in staking, but its price isn’t directly pegged; stETH has wavered from ETH parity at times.\n\nLido also automatically pays stETH holders daily staking rewards passed down from the Ethereum blockchain. There’s currently just shy of 5.6 million ETH ($9.9 billion) staked inside Lido’s protocol (excluding interest), according to Nansen, up 150% from around 2.3 million ETH ($4.1 billion) one year ago. Etherscan shows more than 171,000 wallet addresses hold stETH.\n\nMeanwhile, ether dominance — which measures how much of the crypto market is ETH — hovers a touch under 20%, while bitcoin dominance is almost 46%.\n\nEther liquid staking derivatives find product-market fit\n\nIn any case, ether staking derivatives like stETH have exploded in popularity in recent months, making the best of the lengthy lockup periods associated with participating in Ethereum 2.0 consensus.\n\nThe earliest ETH stakers locked their tokens in the proof-of-stake Beacon Chain back in Nov. 2020, when ether was less than $450.\n\nETH has since rallied as much as 1,000%, reaching a high of $4,878 one year after the Beacon contract went live, before dropping 64% to under $1,800 today.\n\nETH goes up and down, but the number of ETH staked in consensus can only increase (for now)\n\nMore than 17.6 million ETH ($31.3 billion) has been staked, representing nearly 15% of the circulating supply overall.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vY29pbmdlZWsuY29tL2V0aGVyZXVtLWlzLWEtc2VjdXJpdHktY2Z0Yy1pcy13cm9uZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Ethereum is a security—CFTC is wrong - CoinGeek",
        "content": "Gary Gensler, chairman of the U.S. Securities and Exchange Commission (SEC), has clarified that, in his view, ETH is an unregistered security—as are most other tokens in the digital currency industry.\n\nOn March 9, U.S. Commodity Futures Trading Commission (CFTC) Chairman Rostin Behnam expressed a different perspective. In his view, ETH is a commodity and thus falls under the regulatory purview of the CFTC. Noting that ETH had been listed on CFTC exchanges for quite some time, he said, “we would not have allowed the Ether futures product to be listed on a CFTC exchange if we did not feel strongly that it was a commodity asset.”\n\nTo complicate matters further, New York Attorney General Letitia James weighed in late last week with a lawsuit against KuCoin, accusing it of selling unregistered securities, specifically ETH.\n\nSo, who’s right? Is ETH a security? According to the Howey Test, it absolutely is.\n\nETH is a security according to the Howey Test\n\nFirst, let’s begin with a simple explainer of what The Howey Test is and why it matters. This will be crucial to understanding why ETH is a security.\n\nAccording to Investopedia, “The Howey Test refers to the U.S. Supreme Court case for determining whether a transaction qualifies as an “investment contract,” and therefore would be considered a security and subject to disclosure and registration requirements under the Securities Act of 1933 and the Securities Exchange Act of 1934. Under the Howey Test, an investment contract exists if there is an “investment of money in a common enterprise with a reasonable expectation of profits to be derived from the efforts of others.”\n\nIn essence, the Howey Test is used to determine what is and isn’t a security in the United States. It’s a well-known term within the digital currency industry as it has been brought up in relation to high-profile cases like SEC vs. Ripple.\n\nLet’s break down the Howey Test further. In order to qualify as an investment contract, there has to be:\n\nInvestment of money.\n\nIn a common enterprise.\n\nWith a reasonable expectation of profits.\n\nWith those profits being derived from the effort of others.\n\nAstute observers will immediately see that, in all likelihood, the Ethereum ICO from 2014 meets all four criteria. During the sale, more than 7 million ETH tokens were sold in the first 12 hours alone, with coins sent to a wallet controlled by ETHSuisse, a company based in Switzerland.\n\nSo, under the guise of a ‘decentralized’ ICO, we have:\n\n1. The investment of money. Everyone who sent BTC to the Ethereum ICO wallet address will attest to that.\n\n2. In a common enterprise, in this case, EthSuisse. This was a company based in Zug, Switzerland. This firm has since been dissolved, and the Ethereum Foundation has taken control.\n\n3. With a reasonable expectation of profits. Why else does anyone buy into ICOs? The hype around Ethereum was insane including by its main pitchman Vitalik Buterin.\n\n4. With the profits being derived from the efforts of those who had developed the Ethereum blockchain and would develop it in the future.\n\nI’m not a securities expert, but I possess basic powers of logical deduction, and based on those four simple criteria that make up the Howey Test, ETH is a cut-and-dry security. That the common enterprise that accepted the cash has since been dissolved does not change anything. All four criteria of the Howey Test have been met.\n\nWhat defines a commodity? According to Black’s Law Dictionary, commodities are “goods that can be freely sold to the public. It can be agriculture, fuel, or metals.” It’s much more difficult to see how the argument that ETH tokens fit this definition would hold up in court.\n\nMost ICO tokens are worthless and will go away\n\nAccording to the legal opinion of both the Chairman of the SEC and the New York Attorney General, and according to the logic above, Ethereum, and most other tokens sold via ICO, are unregistered securities.\n\nThat means the people involved in the entities that sold them are legally liable for doing so, and most tokens will share the fate of KIN after the SEC wins its lawsuit against Kik Interactive. Not only do we have qualified opinions and logic to go on, but legal precedent favors the notion that ETH and most other ICO tokens are securities, too.\n\nAll of this should cause readers to radically reassess what the future of the industry might look like. Whereas Satoshi’s original Bitcoin is in the clear, according to Gensler and others, almost everything else can and will be targeted.\n\nThe next few years are going to change everything. Smart developers should switch to a ‘set in stone‘ protocol that scales infinitely and utilizes tokens not issued in any ICO or offering—the original Bitcoin, BSV.\n\nFollow CoinGeek’s Crypto Crime Cartel series, which delves into the stream of groups—from BitMEX to Binance, Bitcoin.com, Blockstream, ShapeShift, Coinbase, Ripple, Ethereum, FTX and Tether—who have co-opted the digital asset revolution and turned the industry into a minefield for naïve (and even experienced) players in the market.\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzE0L21hY3JvLWd1cnUtcmFvdWwtcGFsLWJ1bGxpc2gtb24tZXRoZXJldW0tZXRoLXNheXMtdW5leHBlY3RlZC12LXNoYXBlLXVwLW1heS1iZS1pbW1pbmVudC_SAX1odHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8xNC9tYWNyby1ndXJ1LXJhb3VsLXBhbC1idWxsaXNoLW9uLWV0aGVyZXVtLWV0aC1zYXlzLXVuZXhwZWN0ZWQtdi1zaGFwZS11cC1tYXktYmUtaW1taW5lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Macro Guru Raoul Pal ‘Really Bullish’ on Ethereum, Says Unexpected V-Shaped Melt up May Be Imminent - The Daily Hodl",
        "content": "Real Vision CEO Raoul Pal says he is bullish on the leading smart contract platform Ethereum (ETH) after a month-long market correction.\n\nThe former Goldman Sachs executive says in a new strategy session that ETH could be setting the stage for a major run to the upside.\n\n“I’m really bullish. I look at the chart. The chart looks great. It feels like we’ve just had this nice kind of month-long correction. I am looking at the ETH [chart], but you can use any of the charts. I don’t know what it is, but there’s one thing that’s just going to trigger this. I then went back and looked at all the other previous pick-ups from the low and then versus stuff like Amazon back in 2003-04. I look at all of this stuff and normally it always goes higher and faster than people expect. And then corrects.”\n\nPal sets price targets of between $2,000 to $3,000 for an Ethereum run to the upside. However, he says the price of ETH could go even higher since Ethereum is burned when used in transitions, making it more scarce.\n\n“It could be anywhere between $2,000 and $3,000. Let’s call it that. It could be even higher. I don’t know. Because there are a lot of mechanics in ETH which is very lopsided because of the burn. The more people come into the network, the less ETH is around. I think it might become a problem for ETH, but it’s going to give it a lot of upside volatility.”\n\nPal says Ehtereum may go on an unexpected V-shape recovery.\n\n“There is a risk of a V-shape up. That’s the risk I think is underpriced.”\n\nEthereum is worth $1,673 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nFeatured Image: Shutterstock/Tomasz Makowski"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAzLzE0L3N0YWtlZC1ldGgtd2l0aGRyYXdhbHMtYmVpbmctcHJvY2Vzc2VkLW9uLWV0aGVyZXVtLWdvZXJsaS10ZXN0bmV0LWFoZWFkLW9mLXNoYW5naGFpLWZvcmsv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMTQvc3Rha2VkLWV0aC13aXRoZHJhd2Fscy1iZWluZy1wcm9jZXNzZWQtb24tZXRoZXJldW0tZ29lcmxpLXRlc3RuZXQtYWhlYWQtb2Ytc2hhbmdoYWktZm9yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Staked ETH Withdrawals Being Processed on Ethereum Goerli Testnet Ahead of Shanghai Fork - CoinDesk",
        "content": "Goerli was the last of three testnets to run through such a simulation. This test was the most anticipated of all three given that it has the largest validator set and mimics the Ethereum blockchain’s activity most closely. It was also the last opportunity for staking providers to test that staked ETH withdrawals would be properly processed before the upgrade goes live."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1zaGFuZ2hhaS13aXRoZHJhd2Fscy1hbmQtcmVjZW50LXVwZGF0ZXMtZm9yLWV0aC1ob2xkZXJzL9IBW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1zaGFuZ2hhaS13aXRoZHJhd2Fscy1hbmQtcmVjZW50LXVwZGF0ZXMtZm9yLWV0aC1ob2xkZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Ethereum: Shanghai withdrawals and recent updates for ETH holders - AMBCrypto News",
        "content": "With Ethereum’s Shanghai upgrade, the $28 billion worth of staked ether will start to become available in a few weeks.\n\nDue to the high yield, around 17.5 million ETH have been invested in self-hosted or staking-as-a-service validators.\n\nWithin a few weeks, the $28 billion worth of staked ether (ETH) will start to become available thanks to Ethereum’s Shanghai upgrade.\n\nThis supply, which is now unavailable for withdrawal and cannot be sold, will gradually be restored to the public markets and have an impact on the price of Ethereum.\n\nAccording to the Ethereum website, Shanghai may become live in the first half of 2023. According to some analysts, the change might go into effect as soon as April 15, which is U.S. tax day. Staking into Ethereum’s Beacon Chain hasn’t permitted ETH withdrawals since late 2020.\n\nEthereum guaranteed participants in its proof-of-stake validation a variable 3-12% annualized yield as payment for their multi-month pledge to refrain from selling.\n\nAround 17.5 million ETH have been invested in self-hosted or staking-as-a-service validators as a result of that high yield.\n\nShanghai update staking reward\n\nThe future updates consist of two simultaneous upgrades that have been combined to cover every aspect of the upgrade.\n\nShanghai alludes to modifications made to Ethereum’s execution layer, primarily making it possible to deposit staked ETH to execution layer wallets. The Beacon Chain, now known as Capella, must adapt concurrently with the Shanghai upgrading.\n\nA lot of investors might be preparing for a large exodus of ETH, which would be bad for pricing or less secure for Ethereum’s blockchain. Nevertheless, the new upgrade has restrictions that prevent customers from withdrawing all of their staked ETH at once.\n\nThe Shanghai upgrade to Ethereum distinguishes staking payouts from the 32 ETH minimum requirement formerly necessary to activate Proof-of-Stake validator keys.\n\nIn summary, withdrawing validators’ incentives is much simpler and quicker than withdrawing the greater 32 ETH amount from validator activation. Around 18 months will pass before all prizes and the first 32 ETH can be fully withdrawn.\n\nThe post-Shanghai method will permit around 1,800 validators to withdraw their entire initial deposit plus rewards each day. This function deftly restricts the daily withdrawal of ETH.\n\nEthereum chooses 1,800 at random and gives no technical justification; the quota is just eight complete withdrawals every epoch and is meant to reduce sell pressure on ETH.\n\nEthereum developers made staking easy and withdrawing difficult\n\nThe Ethereum developers made stakes simple and withdrawals challenging. Instead of the typically preferred 0x00 prefix, validators will need to alter their credential prefixes to 0x01 before withdrawing.\n\nA withdrawal address must be manually specified by validators because, for some reason, it can only be done so once. Any error could prevent a validator from withdrawing in the future.\n\nOnly after the validator has a withdrawal address set and moves up in the long queue to become eligible for withdrawal can withdrawals take place."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1zZWxsaW5nLWV0aC1ob2xkaW5ncy10aGlzLW1pZ2h0LWJlLXJlYXNvbtIBYWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1jby1mb3VuZGVyLXZpdGFsaWstYnV0ZXJpbi1zZWxsaW5nLWV0aC1ob2xkaW5ncy10aGlzLW1pZ2h0LWJlLXJlYXNvbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Co-Founder Vitalik Buterin Selling ETH Holdings, This Might Be Reason - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to blockchain security firm PeckShieldAlert, Ethereum creator Vitalik Buterin recently moved 200 ETH to the Kraken crypto exchange.\n\nAdvertisement\n\nInvestors often move their crypto to exchanges when they are looking to sell. This often attracts a transaction cost, which might imply there is an intent behind such moves.\n\nThat said, the Ethereum creator likely needed the funds for a specific purpose, such as funding a fresh project or covering expenditures, although the exact reason for the transaction remains unknown.\n\nAt the time of writing, ETH was up 13% in the past 24 hours at $1,656.\n\nReflexer received 500 Ethereum from Vitalik Buterin's designated address over the weekend, according to PeckShieldAlert. Later, he minted the 150,000 Rai Reflex Index (RAI).\n\nThe address subsequently exchanged 17,500 RAI for 50,000 DAI, and then 132,500 RAI for 378,500 USDC.\n\nIn the past week, Buterin sold some of his altcoin holdings, later declaring that the coins had \"no cultural or moral value.\"\n\nFor 58 ETH, Buterin sold 9.9 billion CULT tokens, CultDAO's native token. In addition, he sold his BITE and MOPS stakes. The sales came to 220 ETH in total."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpbmFuY2UtY29udmVydHMtMWItYnVzZC10by1iaXRjb2luLWV0aGVyZXVtLWJuYi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Binance converts $1B BUSD to Bitcoin, Ethereum, BNB - CryptoSlate",
        "content": "Binance CEO Changpeng Zhao (CZ) has confirmed that the exchange has converted the remaining $1 billion in its industry recovery fund to native crypto assets — including Bitcoin, Ethereum, and BNB.\n\nThe transaction was completed during the early trading hours of March 13, according to on-chain data. CZ pointed out how cheap the transaction was and added that:\n\n“Imagine moving $980 million through a bank before banking hours on a Monday.”\n\nBinance set up the industry recovery fund in November 2022 following the collapse of several crypto firms. CZ said the fund is meant to provide liquidity for strong projects facing a liquidity crisis.\n\nWhy Binance is converting BUSD\n\nIn a March 13 tweet, CZ said the conversion was necessary because of the changes that have affected stablecoins and banks in recent weeks.\n\nThe recovery fund was initially in its Binance USD (BUSD). However, recent events have led to the capitulation of several crypto-friendly banks — Silvergate, Silicon Valley Bank, and Signature — and have affected confidence in some stablecoins.\n\nU.S. regulators took control of these crypto-friendly banks citing systemic risks to the broader financial landscape. President Biden said he directed Treasury Secretary Janet Yellen to work with banking regulators to address the problems with these firms.\n\nMeanwhile, the stablecoin BUSD also came under regulatory scrutiny. New York’s financial regulator ordered its issuer Paxos to stop other mints in February.\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMjMyOTUvYmluYW5jZS1zd2Fwcy1idXNkLXN0YWJsZWNvaW4tYml0Y29pbi1ldGhlcmV1bS1ibmLSAVJodHRwczovL2RlY3J5cHQuY28vMTIzMjk1L2JpbmFuY2Utc3dhcHMtYnVzZC1zdGFibGVjb2luLWJpdGNvaW4tZXRoZXJldW0tYm5iP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Binance Swaps BUSD Stablecoin From 'Recovery Fund' to Bitcoin, Ethereum, BNB - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBinance, the world’s largest crypto exchange by trading volume, responded to the latest drama around the USDC stablecoin by converting the remainder of its $1 billion Industry Recovery Initiative funds into Bitcoin (BTC), Ethereum (ETH), and other digital currencies.\n\n“Given the changes in stablecoins and banks, Binance will convert the remaining of the 1 billion Industry Recovery Initiative funds from BUSD to native crypto, including BTC, BNB, and ETH,” Binance CEO Chanpeng Zhao wrote in a tweet early Monday.\n\nBinance launched its crypto industry “Recovery Fund” in November 2022 following the collapse of the FTX exchange. The initiative was aimed “ to help projects who are otherwise strong but in a liquidity crisis.”\n\nAD\n\nAD\n\nGiven the changes in stable coins and banks, #Binance will convert the remaining of the $1 billion Industry Recovery Initiative funds from BUSD to native crypto, including #BTC, #BNB and ETH. Some fund movements will occur on-chain. Transparency. — CZ 🔶 Binance (@cz_binance) March 13, 2023\n\nThe move also comes in the wake of Paxos, BUSD's owner and issuer, being hit by a lawsuit from the United States Securities and Exchange Commission (SEC), with the agency claiming last month that the firm violated investor protection laws. Paxos announced it would halt BUSD minting and \"end its relationship with Binance,\" for the stablecoin.\n\nIt is not immediately clear how much money from Binance's fund has been converted or is earmarked to be converted into the mentioned coins.\n\nThe ETH address shared by CZ shows some substantial transfers over the past few hours, with the original wallet almost emptied at the time of this writing. Transactions are continuing to be executed at the time of writing.\n\nIt's worth noting that last September Binance began auto-converting USDC deposits into its native BUSD—effectively delisting the rival stablecoin.\n\nAD\n\nAD\n\nDecrypt reached out to Binance for additional comments but was yet to hear back by press time.\n\nUSDC regains USD peg\n\nFurthermore, Binance's decision comes hot on the heels of the USDC stablecoin depegging from its intended $1 price.\n\nThe depegging event was triggered by the ongoing crisis surrounding the collapse of the Silicon Valley Bank (SBV), where the firm holds about $3.3 billion.\n\nSilicon Valley Bank was among the 20 largest banks in the U.S. when it failed Friday after a bank run by customers. California state regulators placed the bank under the control of the FDIC, which in turn created a new entity—the Deposit Insurance National Bank of Santa Clara—through which the remaining assets will be managed.\n\nUSDC plummeted to an all-time low of $0.87 on Friday night.\n\nThe collapse of SBV, preceded by the meltdown of the Silvergate Bank, also sent shockwaves through the stock market, while the crypto industry saw a depressing drop as well, with Bitcoin crashing below $20,000 for the first time since mid-January.\n\nIn a separate move, the Federal Reserve moved to shut down the Signature Bank on Monday morning, another crypto-friendly bank with total assets of around $117 billion as of the end of last year.\n\nThe scare, at least for now, appears to be short-lived though: according to a joint statement from the Fed, U.S. Treasury, and FDIC on Sunday, all depositors of now-shuttered Silicon Valley Bank and Signature Bank will be able to get their funds out on Monday.\n\nAD\n\nAD\n\n\"Circle is now out of the woods, which is a huge positive for the crypto world,” Bradley Duke, co-CEO at ETC Group, said in a statement shared with Decrypt.\n\nCircle has meanwhile stated that it will “cover any shortfall” caused as a result of the $3.3 billion in its funds held by the collapsed SBV.\n\nThe Boston-based company also reiterated that USDC is 100% collateralized with cash and U.S. Treasuries.\n\nAccording to the firm, “USDC is currently collateralized 77% ($32.4B) with U.S. Treasury Bills (with a three month or less maturation period), and 23% ($9.7B) with cash held at a variety of institutions, of which SVB is only one.”\n\nThe latest news helped the broader crypto market flip green again, with Bitcoin trading around $22,280 by press time, up 9.1% over the day.\n\nUSDC is changing hands at $0.989, according to CoinGecko."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9nb2VybGktZm9ya2VkLXNoYW5naGFpLXVwZ3JhZGUtZXhlY3V0ZWQtb24tdGVzdG5ldC1idXQtbm90LXdpdGhvdXQtaXNzdWVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Breaking: Shanghai upgrade executed on testnet but not without issues - Cointelegraph",
        "content": "The Shapella hard fork has been executed on the Goerli testnet — the last test run before Ethereum validators will be able to withdraw their Ether (ETH) from the Beacon Chain.\n\nThere were, however, issues with the hard fork. Ethereum core developer Tim Beiko noted that while deposits were being processed, the process didn’t run as smoothly as it could have because several testnet validators didn’t upgrade their client software before the Goerli fork.\n\nDeposits are being processed (https://t.co/CxYtPcGMCp), but it seems like several validators haven't upgraded. Looking into it\n\n\n\nOne challenge with testnet validators is that given the ETH is worthless, there's less incentive to run a validator/monitor it. — timbeiko.eth (@TimBeiko) March 14, 2023\n\nHe blamed it on testnet validators having “less incentive” to make the upgrade given that the Goerli ETH \"is worthless” but expects validators to make proper adjustments ahead of the fork on the Ethereum mainnet.\n\nEthereum researcher \"terence.eth\" explained that it took 15 epochs for Shapella to be forked onto the Goerli testnet because network participation was below the two-thirds threshold:\n\n15 epochs later, Goerli has finalized.\n\n\n\nThere was nothing wrong with the Client software. We just had to get the offline operators to upgrade. It was a good stress test.\n\n\n\nOn to the next one. Mainnet! https://t.co/s573n5pC9f — terence.eth (@terencechain) March 15, 2023\n\nThrough Ethereum Investment Proposal EIP-4895 staked ETH from the Beacon Chain will be “pushed” to the execution layer.\n\nWhile the Shapella upgrade comprises five different EIPs, EIP-4895 has been by far the most anticipated as it moves Ethereum one step closer to a fully functional proof-of-stake system.\n\nShapella is expected to take effect on the Ethereum mainnet in early April following a few delays in preparing the Sepolia and Goerli testnets for the fork.\n\nThe hard fork will allow for partial and full withdrawals, and will theoretically unlock 17.6 million ETH when Shapella is forked, which equates to over $30 billion at current prices.\n\nHowever several mechanisms are in place to prevent a flood of the ETH supply from hitting the market, according to the Ethereum Foundation.\n\nThe Shanghai upgrade will enable phased validator withdrawals, allowing users who have been staking to access their staked $ETH and staking rewards.\n\n\n\nThere are 522K active validators on Ethereum, and once the upgrade comes, only ~1.6k-1.8k validators would be able to exit per day pic.twitter.com/ewCvD7u1ER — ParaSpace (@ParaSpace_NFT) March 8, 2023\n\nThe number of withdrawals allowed within a 24-hour period will only represent about 0.40% of the total staked ETH because only an approximate 2,200 withdrawals can be processed per day.\n\nRelated: Ethereum Shanghai upgrade could benefit liquid staking providers and cement ETH's layer 1 dominance.\n\nThis is because, in most cases, a maximum of 10 validators can be assigned to an epoch and it takes approximately five or six minutes for an epoch to be processed.\n\nIf each of the 2,200 validators withdraws the full 32 ETH staked per day it would only account for about 70,000 ETH — a fraction of the 17.6 million staked.\n\nThe execution on Goerli was shared in a March 15 live stream by EthStaker on YouTube."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXRvZGF5LWV0aC1oaWtlcy1nb2VybGktdGVzdG5ldC1jcnlwdG8tbWFya2V0LWNhcC1icmVhY2hlcy10cmlsbGlvbi_SAWtodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1wcmljZS10b2RheS1ldGgtaGlrZXMtZ29lcmxpLXRlc3RuZXQtY3J5cHRvLW1hcmtldC1jYXAtYnJlYWNoZXMtdHJpbGxpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Price Today: ETH Hikes Over 9% Ahead Of Goerli Testnet As Crypto Market Cap Breaches Trillion Mark - CoinGape",
        "content": "Ethereum Price Today: The market is trading in green as Bitcoin and other Altcoins are seeing a jump today despite the collapse of two major crypto-related banks last week. As of writing, Bitcoin price increased by 8.68% in the last 24 hours. Ethereum price increased by 8.01%.\n\nThe global crypto market cap stands at 1.03 trillion USD, an increase of 7.18% over the past day. The total crypto market volume in the last 24 hours increased by 2.09% and is currently at 75.21 billion USD.\n\nadvertisement\n\nEthereum (ETH) price rises by 8.68%\n\nThe second largest crypto, Ethereum price today escalated by 8.68% in the last 24 hours. The market cap for Ethereum is 196.50 billion USD. Moreover, trading volume increases by 11.29% over the previous 24 hours, showing increased interest among investors. Each ETH token is trading for 1,605 USD. Source: coinmarketcap\n\nAlso read: Bitcoin (BTC) Price Shoots Over 8%, Why Is the Market Up Despite Bank Collapses?\n\nThe Shanghai upgrade which was all set to be executed by the end of March has been pushed further to April. The launch of the Goerli testnet, which serves as a thorough dress rehearsal for the Shanghai upgrade, is currently scheduled by Ethereum’s developers to take place on or around March 14.\n\nWhat’s next for ETH?\n\nThe price of Ethereum experienced a surge toward $1,370, which was met with resistance from the bulls. However, ETH established a strong foundation and continued to climb above the $1,450 resistance level.\n\nNotably, there was a distinct increase above the $1,500 and $1,565 resistance levels. Additionally, a significant bearish trend line was broken, with resistance close to $1,480 on the hourly chart of ETH/USD. Eventually, the pair exceeded the $1,600 resistance level, peaking at $1,636.\n\nAlso read: Breaking: USDC Set To Regain $1 Peg As Circle Devises New Strategy To Cover Shortfall"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vcm9ib3RpY3NhbmRhdXRvbWF0aW9ubmV3cy5jb20vMjAyMy8wMy8xNC93aWxsLWV0aGVyZXVtLTItMC1raWxsLW1pbmluZy82NTgyNi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Will Ethereum 2.0 Kill Mining? – Robotics & Automation News - Robotics and Automation News",
        "content": "Therefore, as a mine, you are considering mining Eth 2.0. You’ve been hearing a lot of excitement about it, so you’re interested to find out whether it’s worthwhile for your money and your time.\n\nWe’ll discuss the benefits and drawbacks of mining Ether 2.0 in this post so you can decide for yourself. Furthermore, ether Systems, a stock exchange, enables ethereum code to carry out their operations immediately.\n\nHow Ever will Mining Be Affected by Ethereum 2.0?\n\nEthereum will undergo a significant update in 2020 called Serenity, often known as Ethereum 2.0. By safeguarding the database and authenticating transactions, miners run and maintain a Cryptocurrency.\n\nThey get Ether, the commodity that underpins Ethereum, in exchange. Because it will enable nodes other than miners to verify and conduct trades, Ether 2.0 will render mining obsolete.\n\nIn addition, it will eliminate the need for miners to contribute by lowering the amount of processing power and bandwidth needed to maintain the Ethereum network.\n\nThough this may be terrible news for miners, Ether 2.0 has several potential advantages. For instance, Ethereum 2.0 will allow miners to validate transactions more quickly and get more rewards.\n\nAdditionally, it will enable them to generate a new revenue stream by offering their computer capacity for sale to other users in the network.\n\nEthereum 2.0’s Benefits for Mining\n\nWhat benefits does Ethereum 2.0 provide miners, then? One is that mining is done in a far more effective manner. The new PoS technique is intended to enable mining with far less technology, reducing the need for power.\n\nAdditionally, it implies that miners will indeed be able to extract minerals more effectively, allowing them to reap greater returns for their labourers.\n\nBecause of how much more attack-resistant the algorithmic program is, producers will be more likely to forfeit their rewards or income. The third feature of Ethereum 2.0 is its increased scalability.\n\nAs a result, the network will be able to process more payments at once, making it quicker and simpler to use. The advantages of this will be significant for both individuals and enterprises.\n\nEthereum 2.0’s Drawbacks for Miners\n\nThe second drawback of Ethereum 2.0 is that it will take more time to execute transactions, from ten min to 3 minutes on average. It is because Bitcoin 2.0 will utilize a slower consensus process called Piece of Stake (PoS) compared to the one it now uses, termed Formal verification (Pow).\n\nSome people consider this a positive development since it will make Ethereum 2.0 more secure and egalitarian. However, miners will have to wait much longer to get paid for their labour, making it less desirable for them.\n\nUsers will cut the block incentives the miners will earn with Ethereum 2.0 in half, which brings us to the final and third disadvantage. As a result, they will only get 1.5 ETH for each brick they mine rather than the usual 3 ETH.\n\nAlthough it may not seem like a significant concern, the fact that mining requires buying things (in the form of power bills) means that mines will either have to accept lesser earnings or find a method to reduce their expenses.\n\nThe Miners’ Opinion on Ethereum 2.0\n\nYou undoubtedly want to know what miners think about this whole situation. After all, many individuals may lose their jobs if Ether 2.0 does deal with mining. For several reasons, many miners genuinely support the migration to proof-of-stake.\n\nFirst, proof-of-work is increasingly concentrated, with major powers like Russia holding a significant mining capacity. Decentralization, one of the fundamental principles of cryptocurrencies, suffers from this standardization.\n\nSince proof-of-stake eliminates the need for costly mining hardware, anybody with a pc may participate in Ether 2.0. A more decentralized and secure network may result from this.\n\nSecond, actual evidence is using more and more energy. According to an analysis by Gathering important data, Ethereum’s yearly carbon emissions are comparable to that of Las Vegas and will only increase as the network expands. Ether 2.0 will be much more energy-efficient via evidence.\n\nWhat Possibilities Does Ethereum Miner Have in the Future?\n\nIt is due to Ethereum 2.0 possibly switching to a proof-of-stake method, which eliminates the need for mining. What does this entail for miners, then? Well, it may imply that they’ll need to locate another source of income. Or, it can mean they will need to find another source of income.\n\nOf course, Ether 2.0 may either not be deployed in its entirety or will be postponed permanently. In such a situation, miners may exhale with relief and continue their regular work.\n\nBalance Out\n\nSo, will mine disappear as a result of Ether 2.0? It’s difficult to say. On the one extreme, the network changes will significantly reduce the profitability of ETH mining. Conversely, it’s conceivable that the total rise in ETH consumption will balance out the decreasing payouts, allowing miners to carry on making money.\n\nOne thing is for sure: Ethereum blockchain is going through a significant transition, so producers will want to be ready for any possible repercussions. Only the future will reveal whether Ether 2.0 will affect miners.\n\nShare this: Print\n\nFacebook\n\nLinkedIn\n\nReddit\n\nTwitter\n\nTumblr\n\nPinterest\n\nWhatsApp\n\nTelegram\n\nPocket\n\n"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2F1c3RyYWxpYW4tYmFuay1uYWItc3RhYmxlY29pbi1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "'Big Four' Australian Bank Issues Stablecoin On Ethereum - Blockworks",
        "content": "One of Australia’s ‘big four’ banks says it has completed its first intra-bank cross-border transaction using its own stablecoin via Ethereum.\n\nThe transaction, part of a National Australia Bank (NAB) pilot for an AUD-backed stablecoin, involved deploying stablecoin smart contracts for seven major global currencies, showcasing the potential to shorten cross-border transactions from days to minutes.\n\nNAB intends to issue its stablecoin under the ticker “AUDN,” which will be managed as a liability on its books. The firm further plans to enable transactions for the Australian, New Zealand, Singapore and US dollars, as well as the euro, yen and pound sterling.\n\nDigital asset infrastructure provider Fireblocks and fintech platform Blockfold assisting with the smart contracts, direct custody of the tokens (alongside minting and burning). NAB says its stablecoin was issued as an ERC-20 token.\n\n“We believe that elements of the future of finance will be blockchain enabled and we’re already witnessing rapid change in the tokenisation market,” Drew Bradford, NAB Markets Executive General Manager, said in a statement.\n\nThe bank claimed it’s the world’s first major financial institution to process a cross-border stablecoin transaction via a public Layer-1 blockchain. A NAB spokesperson shared the current AUDN token contract with Blockworks, viewable on Etherscan.\n\nIn any case, ANZ — another ‘big four’ Australian bank — became the first institution in the country to issue and conduct payment of a stablecoin linked to the nation’s dollar last year, also via Ethereum, although it wasn’t cross-border.\n\nAs well, JPMorgan alongside Singapore’s DBS Bank and others executed foreign exchange transactions using tokenized deposits, a slightly different concept to stablecoins, as part of a 2022 pilot. The group used Ethereum Layer-2 network Polygon for the trades.\n\nA number of institutions worldwide have also leveraged Ethereum and Polygon to issue tokenized bonds.\n\nStill, NAB considers its recent stablecoin transaction a milestone for the bank. It expects to support “select corporate and institutional clients” in transacting with digital assets by the end of the year.\n\nUpdated Mar. 15, 2023 at 5:53 pm ET: Added AUDN token contract.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzEzL2Jhbmstc3RvY2tzLWltcGxvZGUtYml0Y29pbi1idGMtYW5kLWV0aGVyZXVtLWV0aC1yaXAtYXMtZmVkLWZhY2VzLXJhdGUtaGlrZS1kZWNpc2lvbi_SAXpodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8xMy9iYW5rLXN0b2Nrcy1pbXBsb2RlLWJpdGNvaW4tYnRjLWFuZC1ldGhlcmV1bS1ldGgtcmlwLWFzLWZlZC1mYWNlcy1yYXRlLWhpa2UtZGVjaXNpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bank Stocks Implode, Bitcoin (BTC) and Ethereum (ETH) Soar As Fed Faces Rate Hike Decision - The Daily Hodl",
        "content": "Crypto markets are flying as banks and traditional finance stocks get hammered by investors grappling with the collapse of several large banking institutions.\n\nAs a new trading week begins, bank stocks are proving to be the biggest losers, with some of them suffering as much as 75% in losses mere hours into the open.\n\nA look at Yahoo Finance’s list of top losers shows a long list of banking stocks bleeding out badly.\n\nFollowing the recent closure of Silicon Valley Bank, Silvergate Bank and Signature Bank, fears of a spreading banking contagion have rocked the sector as investors look to see who could be next on the chopping block. At time of writing, First Republic Bank (FRC) and Western Alliance (WAL) are taking the worst hits from the market turmoil, both down roughly 60%.\n\nBitcoin (BTC) bull and head of ARK Invest Cathie Wood warns that if the Federal Reserve doesn’t pivot on interest rates, more banks will be destroyed.\n\n“If the Fed continues to focus on lagging indicators like the CPI, and does not pivot in response to the deflationary forces telegraphed by the inverted yield curve, then this crisis will devour more regional banks and further centralize, if not nationalize, the US banking system.\n\nAs a result, [ARK Invest is] not surprised that BTC and ETH appreciated as US regional bank stocks imploded. Their blockchains are decentralized, transparent, and auditable. Banks are not and, in the last few days, have become less so.”\n\nBitMEX founder and crypto veteran Arthur Hayes is also expecting the Fed to flip dovish again and print more money, presumably boosting risk assets like crypto.\n\nThat’s a… savage move in the 2yr. In case you think this is something other than what it is. The bond market is saying it’s back to print dat money mode. Don’t fight the Fed!!!!”\n\nBanking giant Goldman Sachs has reportedly forecasted that due to the crisis, the Fed will pause rate hikes this month rather than go ahead with the previously expected 25 basis point rise.\n\nSays Goldman economist Jan Hatzius,\n\n“In light of the stress in the banking system, we no longer expect the FOMC to deliver a rate hike at its next meeting on March 22.”\n\nWith the banking issues that plagued crypto as of late no longer on center stage, Bitcoin, Ethereum (ETH) and altcoin markets are rallying hard.\n\nAt time of writing, Bitcoin is trading at $24,220, up 20% in the last 24 hours, while ETH is priced at $1,685, up 15% in the last 24 hours.\n\nAltcoins are also ripping, with many well above 30% in the last day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Mia Stendal/Sensvector"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbmdhcGUuY29tL2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi1ldGhlcmV1bS1nYWlucy1vdmVyLTgtd2hlcmVhcy1tYWpvci1hbHRjb2lucy1qdW1wcy_SAWhodHRwczovL2NvaW5nYXBlLmNvbS9jcnlwdG8tcHJpY2VzLXRvZGF5LWJpdGNvaW4tZXRoZXJldW0tZ2FpbnMtb3Zlci04LXdoZXJlYXMtbWFqb3ItYWx0Y29pbnMtanVtcHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin, Ethereum Gains Over 8%; Whereas Major Altcoins Jump Over 6% As Market Recovers - CoinGape",
        "content": "Crypto Prices Today: Bitcoin and other Altcoins are still seeing a jump today despite the collapse of two major crypto-related banks last week. As of writing, Bitcoin price increased by 8.68% in the last 24 hours. Ethereum price increased by 8.01%. Crypto prices today for Cardano price rises by 9.69%. Solana price hikes by 8.48%. XRP increased by 0.39%. Litecoin jumps by 11.18%.\n\nPolygon is up by 6.81%. Polkadot price escalates by 7.16%.\n\nadvertisement\n\nThe meme cryptos have been seeing an increase, too in the last 24 hours. Dogecoin price jumps by 5.62% whereas Shiba Inu price is up by 5.52%.\n\nThe global crypto market cap stands at 1.03 trillion USD, an increase of 7.18% over the past day. The total crypto market volume in the last 24 hours increased by 2.09% and is currently at 75.21 billion USD.\n\nThe top 4 crypto for today are:\n\nCardano (ADA) price rise by 9.69%\n\nWith a rise of 9.69% in the Cardano price during the last 24 hours, the market cap for the crypto is at 11.81 billion USD. At the same time, trading volume is seeing a rise of 34.67%. Each ADA token is trading for 0.3405 USD. Source: coinmarketcap\n\nAlso read: Breaking: USDC Set To Regain $1 Peg As Circle Devises New Strategy To Cover Shortfall\n\nPolygon (MATIC) price rise by 6.81%\n\nPolygon price is escalating by 6.81% in the last 24 hours and each MATIC token is trading for 1.14 USD. The market cap for this crypto is currently at 9.96 billion USD. Trading volume is up by 41.98% over the last day. Polygon is an Ethereum layer 2 scalability platform and has also been rallying with Ethereum in the past month. Source: coinmarketcap\n\nPolkadot (DOT) price rise by 7.16%\n\nWith an increase of 7.16% in the last 24 hours, the Polkadot price rise, and each DOT token is trading for 5.95 USD. The market cap stands at 6.94 billion USD. Trading volume increased by a massive 24.62% compared to the previous day. Source: coinmarketcap\n\nLitecoin (LTC) price rise by 11.19%\n\nLitecoin price grew by 11.19% in the previous 24 hours. The market cap for this crypto stands at 5.66 billion USD. Each LTC token is trading at 78.16 USD. The trading volume has gone down by 7.42% during the previous 24 hours. Source: coinmarketcap\n\nAlso read: Crypto-Friendly Signature Bank Announces Shutdown Overnight"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aC1zdGFraW5nLW5vdC1pbnZlc3RtZW50LXNjaGVtZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "ETH Staking Not an Investment Scheme, ConsenSys Execs Argue - Blockworks",
        "content": "Staking rewards are compensation for services to keep the Ethereum network secure, ConsenSys executives said Monday in a blog post that argued the process should not be confused with an investment.\n\nRewards and fees that network validators might receive are not yield on a loan, nor are they a dividend on investment, argued ConsenSys General Counsel Matt Corva and Bill Hughes, the company’s director of global regulatory matters.\n\n“Staking is a data integrity mechanism that Ethereum and similar blockchain networks require to function, not an investment scheme,” they added in a blog post. “Service agreements that offer technical staking solutions are not investment contracts or any other type of enumerated security.”\n\nStaking is a process in which crypto holders participate in validating transactions on the blockchain. In return, the block’s proposer receives a reward paid in the blockchain’s native crypto, such as ether.\n\nRead more: The Investor’s Guide to Staking\n\nFounded in 2014, ConsenSys is a blockchain technology company focused on the Ethereum ecosystem. The firm hosts more than 17,000 Ethereum validators — representing 3% of all Ethereum validators, according to its website.\n\nValidator rewards come from two places: the protocol-specified rewards and a portion of the transactional fees paid by users who want their transactions added to the network, the ConsenSys executives said.\n\n“Rewards aren’t a mythical construct dependent on the acts of a specialized manager, such as funds entrusted to a hedge fund or other money manager who enjoys discretion over how the funds are invested to generate a reward,” Corva and Hughes wrote.\n\nRegulation amid a challenging backdrop\n\nThe declaration comes just days after New York Attorney General Letitia James called ether a security in a lawsuit against crypto exchange KuCoin.\n\nSome industry watchers have said regulators are likely to continue a “regulation-by-enforcement” trend seen in recent months, particularly as contagion in the space has impacted companies like Silvergate, Silicon Valley Bank and Signature.\n\n“I think everyone’s on the same page that we would like to have a more broad, comprehensive legal framework for the entire crypto space,” Wilshire Phoenix co-founder William Cai told Blockworks. “But the two words “crypto space” really encompasses so many different pieces, and asking for a comprehensive legal framework…seems to be a difficult task.”\n\nThe ConsenSys blog post also comes about a month after the SEC charged Kraken with failing to register crypto staking products as securities. The crypto exchange settled on both counts — paying $30 million and ending its on-chain staking services for US clients.\n\nFollowing the Kraken settlement, Coinbase CEO Brian Armstrong said in a tweet that “Coinbase’s staking services are not securities,” adding that the company would “happily defend this in court.”\n\nCoinbase’s chief legal officer, Paul Grewal, added in a blog that staking does not meet the Howey Test, which the SEC and US courts use to determine whether an asset is a security.\n\n“When a customer asks us to stake some of their crypto, they aren’t giving up one thing to get something else — they own exactly the same thing they did before,” Grewal wrote. “Staking customers retain full ownership of their assets at all times, as well as the right to ‘unstake’ those assets consistent with the underlying protocol.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8xNC90b3AtYW5hbHlzdC1wcmVkaWN0cy1yYWxsaWVzLWZvci1mYW50b20tYW5kLW9uZS1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLXNheXMtZXRoLWxvb2tzLWhlbGxhLWJ1bGxpc2gv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzE0L3RvcC1hbmFseXN0LXByZWRpY3RzLXJhbGxpZXMtZm9yLWZhbnRvbS1hbmQtb25lLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tc2F5cy1ldGgtbG9va3MtaGVsbGEtYnVsbGlzaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Top Analyst Predicts Rallies for Fantom and One Ethereum-Based Altcoin, Says ETH Looks ‘Hella’ Bullish - The Daily Hodl",
        "content": "A crypto analyst known for accurately calling Bitcoin’s (BTC) 2018 bottom believes that bullish price actions are in store for Ethereum (ETH), Fantom (FTM) and one low-cap altcoin.\n\nPseudonymous analyst Smart Contracter tells his 221,400 Twitter followers that Ethereum rival Fantom looks ready for an uptrend after completing its corrective move down and breaking out of a diagonal resistance.\n\n“Nice FTM downtrend break on USD pair and BTC pair and macrostructure is a big clear three wave move down. Hard not to be looking for longs on some things now in light of this weekend price action.”\n\nSmart Contracter practices the Elliott Wave theory, an advanced technical analysis approach that tries to predict future price action by following crowd psychology that tends to manifest in waves. According to the theory, a bullish asset typically resumes its uptrend following a three-wave move down or an ABC wave.\n\nAt time of writing, FTM is trading for $0.413, well above the analyst’s diagonal resistance at $0.37.\n\nNext up is the blockchain indexing protocol The Graph (GRT). According to the crypto trader, GRT also looks bullish after concluding its ABC wave down.\n\n“So many alts look amazing.\n\nGRT also has a clean ABC down on weekly after five-wave rise.”\n\nAt time of writing, GRT is worth $0.144, up over 10% in the past day.\n\nLooking at Ethereum, Smart Contracter says the top altcoin looks strong after rallying from a low of $1,372 on March 10th to close the previous week above $1,500.\n\n“Damn, ETH weekly looking hella bullish now, absolute solid buy back heading into the close.”\n\nAt time of writing, Ethereum is trading for $1,678, an increase of over 5% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2V0aGVyZXVtLWZvdW5kZXItaXMtb24tYS1zZWxsaW5nLXNwcmVlLWhlcmVzLXdoYXQtaXQtY291bGQtbWVhbi_SAV9odHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9ldGhlcmV1bS1mb3VuZGVyLWlzLW9uLWEtc2VsbGluZy1zcHJlZS1oZXJlcy13aGF0LWl0LWNvdWxkLW1lYW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Founder is on a Selling Spree, Here’s What it Could Mean - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nVitalik Buterin, the founder of Ethereum (ETH) has been making headlines after he recently transferred 200 ETH to the Kraken cryptocurrency exchange. While trying to sell, investors often transfer their cryptocurrency to exchanges.\n\nThe Ethereum founder used the ETH hoard as collateral on Reflexer to create 150,000 RAI tokens, according to earlier Peckshiled reporting. Then, Buterin traded 132,500 RAI for 378,500 USD Coin (USDC). For 50,000 Dai, the remaining 17,500 RAI were exchanged (DAI). According to PeckShield, the exchange of ETH into the stablecoins USDC and DAI was completed in less than three hours.\n\nEtherscan, a blockchain monitoring service, also recorded the transactions. In order to create 100,000 RAI, Buterin initially sent 200 ETH to Reflexer. Then, Buterin immediately donated 300 ETH to Reflexer to generate 50,000 RAI. According to Etherscan, Buterin spent over $200 to handle both transactions.\n\nIn addition, he had recently sold 9.9 billion CULT tokens, the CultDAO’s native token, for 58 ether (ETH). According to blockchain analyst PeckShield, he also sold his shares in BITE and MOPS. According to Coindesk, the sales totaled 220 ether, which is worth $332,420 at the moment.\n\nBite and the majority of the other coins described in the r/Testingtesting62831 forum were tagged as Buterin as “shitcoins” that have no redeeming cultural or moral significance, and will probably lose most of the money they put into them on March 9. “I strongly oppose these proposals,” he said.\n\nBy selling tokens like Dogelon Mars (ELON) in May 2021, Buterin launched a similar dumping that resulted in reductions in the value of 40% and 90%, respectively. Coming back to Ethereum, after Vitalik Buterin’s most recent remarks about the network, the price projections for Ethereum are optimistic."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTQtbWFyY2gtMjAyMy9hcnRpY2xlc2hvdy85ODYyODEyOC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE0LW1hcmNoLTIwMjMvYW1wX2FydGljbGVzaG93Lzk4NjI4MTI4LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin above $24,500; Ethereum, Litecoin rise up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: Taking their gaining streak for the second straight day, the cryptocurrency markets were trading higher in Tuesday's trade. Bitcoin (BTC) rose 9.25% to $24,514 whereas Ethereum (ETH) was above the $1,650 level. BTC volume stood at approximately $48.26 billion, rising 39.89% in the last 24 hours.Meanwhile, the global cryptocurrency market cap was trading higher around $1.08 trillion, rising 5.11% in the last 24 hours.\"In the last 24 hours, Bitcoin experienced a surge of almost 10%, surpassing the US$24,000 mark, following the announcement that U.S. regulators have backed Silicon Valley Bank and Signature Bank. This news has given investors, and traders hope that the banking sector's recent near meltdown will prompt the Federal Reserve to ease its monetary hawkishness. As a result, BTC has risen above a floor and reached a two-week high,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens were also trading higher. Dogecoin , Solana, Polygon and Polkadot were trading over 3% higher.The total volume in DeFi is currently 8.03 billion, 8.83% of the total crypto market 24-hour volume. The volume of all stablecoins is now $86.66 billion, which is 95.29% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $473 billion. Bitcoin’s dominance is currently 43.70%, an increase of 1.41% over the day, according to CoinMarketCap.\"The next major level for BTC to break is $25,300 post which $28,000 will be on the cards. BTC dominance has surged to over 43% today, indicating that investors are choosing BTC over altcoins in the short term. Some volatility is expected this week as US CPI data comes through tomorrow,\" Vikram Subburaj, CEO of Giottus Crypto Platform said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 61.68, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates a Neutral outlook at 81.95 and the Average Directional Index (14) at 22.36 indicates Buy.\"\"The MACD Level (12, 26), at −88.41, indicates a Buy, contrary to previous day’s prediction. The Stochastic RSI Fast (3, 3, 14, 14) and the Williams Percent Range (14) continue to be Neutral at 93.02 and −5.03 respectively,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.48 hours, IST on March 14, 2023)Bitcoin $24,514 9.25%Ethereum $1,682 4.92%Tether $1 0.03%BNB $307.69 1.15%XRP $0.3712 0.58%Cardano $0.3447 1.71%Polygon $1.18 3.75%Dogecoin $0.07285 3.13%Solana $20.45 3.90%Polkadot $6.17 4.04%Tron $0.0671 -1.99%Shiba Inu $0.00001111 2.38%Litecoin $81.27 4.20%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiqwFodHRwczovL3d3dy5hdGFsYXlhci5jb20vZW4vYXJ0aWN1bG8vZWNvbm9teS1hbmQtYnVzaW5lc3MvYml0Y29pbi1ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLXEyLWJpZy1leWVzLWNvaW4tYmVjb21lcy10b3AtZWFybmluZy1jcnlwdG8tdmF1bHQtcGluLzIwMjMwMzE0MTAyOTMxMTgyMTY4Lmh0bWzSAa8BaHR0cHM6Ly93d3cuYXRhbGF5YXIuY29tL2VuL2FydGljdWxvL2Vjb25vbXktYW5kLWJ1c2luZXNzL2JpdGNvaW4tZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1xMi1iaWctZXllcy1jb2luLWJlY29tZXMtdG9wLWVhcm5pbmctY3J5cHRvLXZhdWx0LXBpbi8yMDIzMDMxNDEwMjkzMTE4MjE2OC5hbXAuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Price Prediction For Q2: Big Eyes Coin Becomes Top Earning Crypto With Vault Pin - Atalayar EN",
        "content": "Since there is a limited supply of Bitcoin and Ethereum, considering how they’re becoming more widely used, many experts predict that their prices will increase over the long term. Moreso, having survived the Silvergate crisis, the duo are expected to begin another attempt to bring back the bull run.\n\nGovernment regulations, investor sentiment, and rivalry from other cryptocurrencies like Big Eyes Coin (BIG) are a few variables that could impact their prices in the near future. In this article, we will make Bitcoin and Ethereum price predictions as well as highlight how Big Eyes Coin is becoming a top-earning crypto.\n\nBitcoin (BTC): Price Prediction After Silvergate Brouhaha\n\nIn Q2 2023, it's predicted that the price of the biggest cryptocurrency, Bitcoin, will increase as more organisations and individuals choose to use it as a source of value and a hedge against inflation. But there's also a chance that regulatory ambiguity and greater rivalry from other cryptocurrencies will stagnate it or could even push its price lower.\n\nAt press time, Bitcoin has shaken off the effects of the Silvergate crisis, gaining close to 9% in the last 24 hours. As Bitcoin makes another attempt to bring back the bull run, experts have predicted that Q2 of 2023 might just signal the return of Bitcoin (BTC)’s best days.\n\nEthereum (ETH): Banking on DeFi Ecosystem’s Growth\n\nIn terms of market capitalisation, Ethereum is presently the second-largest cryptocurrency, and its price has historically been quite volatile. Similar to Bitcoin, a number of variables, such as investor sentiment, technical advancements, and competition from other cryptocurrencies, affect the price of Ethereum. The adoption of decentralised applications (dApps) and the expansion of the decentralised finance (DeFi) network, however, makes Ethereum price prediction a bit difficult.\n\nHowever, with more DApps being created on its blockchain and the DeFi ecosystem growing, it's predicted that Ethereum's price will increase in Q2 2023. However, there's a chance that greater rivalry from other smart contract platforms and unpredictability in the regulatory environment will have a negative effect on its price.\n\nBig Eyes Coin: Top Earning Crypto ‘CATs’ Home $31.4m\n\nCat-themed crypto, Big Eyes Coin, has introduced yet another avenue for its teeming followers to earn big on their investments and grow their finances. The top-earning crypto has ceaselessly shown its investor-centric style, having concluded a 200% launch offer which was indeed one of the biggest cryptocurrency giveaways in history, and is also giving out more with its new initiative, the \"Vault Pin\".\n\nWith the vault pin, investors can now receive a free Loot Box based on how much money they contribute. Customers who spend over $100 on tokens through the Big Eyes website can redeem their reward by entering the vault code 819.\n\nFinal Verdict\n\nHurry now and take advantage of this bonus offer as time ticks away! Users are already piling onto Big Eyes Coin’s website to claim theirs, as the offer has a limited time.\n\nUsers will receive the biggest prize possible—a Saver Tin filled with $1000 worth of BIG tokens if they spend $100. Users who spend $1000 will get a Cute Box, which could aid them in winning up to $10,000 worth of BIG. A Kitty Vault, where one can earn up to $25,000 worth of BIG, is available to those who spend $5000. Note that the Vault Pin must be 819.\n\nHere is the biggest cryptocurrency bonus offer! Visit the Big Eyes Coin website now and take advantage of this amazing opportunity as the top-earning crypto, Big Eyes Coin, begins the journey to make millionaires!\n\nFind out more about Big Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWNhc2gtb3V0cGVyZm9ybWVkLWxpdGVjb2luLWFuZC1ldGhlcmV1bS1jbGFzc2ljLWluLXRoaXMtY2F0ZWdvcnkv0gFjaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2JpdGNvaW4tY2FzaC1vdXRwZXJmb3JtZWQtbGl0ZWNvaW4tYW5kLWV0aGVyZXVtLWNsYXNzaWMtaW4tdGhpcy1jYXRlZ29yeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Cash outperformed Litecoin and Ethereum Classic in this category - AMBCrypto News",
        "content": "Bitcoin Cash ranks higher in decentralization than Litecoin and Ethereum Classic.\n\nBCH whales have been reaccumulating during the recent crash.\n\nBitcoin Cash [BCH] has been overshadowed by its more popular counterparts for the major part. Nevertheless, it has managed to retain a sizable following, and it is perhaps the most underrated cryptocurrency as far as decentralization is concerned.\n\nIs your portfolio green? Check out the Bitcoin Cash Profit Calculator\n\nBitcoin Cash happens to be doing quite well on the decentralization front. A higher hash rate is often considered a good measure of decentralization for PoW networks, and it also translates to higher network security.\n\nBCH’s hash rate has been above the 1 EH/s level for the last three months. Its hash rate at press time was as high as 1.78 EH/S.\n\nFor context, 1 EH/S is a million times more than 1 TH/S. Litecoin’s latest hash rate figure came in at 716.06 TH/S while ETC’s hash rate was 107.13 TH/s at press time.\n\nThis means that Bitcoin Cash outperformed Litecoin and Ethereum Classic in terms of hash rate. Despite these findings, Bitcoin Cash’s hash rate is lower than Bitcoin’s 355.37 EH/S hash rate, hence BTC is still king in that regard.\n\nEven so, Bitcoin Cash does have a higher block size than BTC, and this facilitates a higher TPS. This is why, for some, BCH is a more preferable option as a peer-to-peer payment than Bitcoin.\n\nBitcoin Cash price action\n\nBCH is still heavily undervalued compared to BTC yet both have a similar circulation and maximum supply.\n\nBitcoin Cash traded at $114.16 at press time, which represented a 25% discount from February highs. Nevertheless, it still showed a bit of an upside from its current weekly low of $105.05.\n\nBCH’s price action reflects movements in the overall crypto market. But is Bitcoin Cash more likely to achieve a sizable bounce back? So far the recent pivot was underpinned by significant whale accumulation.\n\nHow much are 1,10,100 BCHs worth today?\n\nWhales in the highest address category holding over 1 million BCH have been adding to their balances. The same applies to addresses within the 1,000 to 100,000 BCH category. These addresses increased their holdings since 9 March, hence buying the dip.\n\nDespite the accumulation, addresses within the 100,000 to 1 million BCH category have been contributing to some selling pressure.\n\nThis may explain the limited upside. Bitcoin Cash’s dormant circulation metric indicates that a significant amount of the cryptocurrency exchanged hands during the recent selloff.\n\nOn the other hand, the transaction volume indicated a surge in activity on 9 March. This observation confirmed the influx of buying activity observed when the price bottomed out."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzEzLzEwMDAwMDAwMDAwMDAwLXNoaWJhLWludS1zaGliLWxlYXZlcy1ldGhlcmV1bS13aGFsZS13YWxsZXRzLWFtaWQtbGF1bmNoLW9mLXNoaWJhcml1bS1iZXRhL9IBf2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzEzLzEwMDAwMDAwMDAwMDAwLXNoaWJhLWludS1zaGliLWxlYXZlcy1ldGhlcmV1bS13aGFsZS13YWxsZXRzLWFtaWQtbGF1bmNoLW9mLXNoaWJhcml1bS1iZXRhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "10,000,000,000,000 Shiba Inu (SHIB) Leaves Large Ethereum Wallets Amid Launch of Shibarium Beta - The Daily Hodl",
        "content": "Trillions of Shiba Inu (SHIB) tokens are no longer under the control of crypto whales following the highly anticipated launch of Shibarium in its beta form.\n\nLeading analytics firm IntoTheBlock reveals Shiba Inu whale balances have declined from 670.9 trillion to 660.9 trillion SHIB since Friday, a day before the crypto project started the early beta phase of the Shibarium network.\n\nIntoTheBlock also says that the number of SHIB whale addresses has decreased 6.25% in the last seven days.\n\nShibarium is the much-hyped layer-2 protocol built on top of Ethereum (ETH), similar to Polygon (MATIC). The project was first announced in May of 2021 and has been in steady development ever since.\n\nThe exodus of SHIB from whale wallets does not appear to have negatively impacted the value of the dog-themed crypto asset. At time of writing, SHIB is trading at 0.000011, up over 6% in the last 24 hours.\n\nDespite the unloading of Shiba Inu from some whales, the blockchain-tracking platform WhaleStats shows the largest 100 Ethereum whales in existence still hold a staggering $601.20 million worth of SHIB, representing nearly 12% of their crypto portfolio.\n\nAnd according to WhaleStats, SHIB is still the largest altcoin holding among the top 100 Ethereum whales, excluding stablecoins and Ethereum itself.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Art Furnace/nsimsek0/WindAwake"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaXRjb2luLWFuZC1ldGhlcmV1bS1jb3VsZC1tYWtlLXlvdS1hLWZ1dHVyZS1taWxsaW9uYWlyZS1idXQtc2lnbnVwdG9rZW4tY291bGQtYmUteW91ci1nYXRld2F5LXJpZ2h0LW5vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Could Make You A Future Millionaire, But SignupToken Could Be Your Gateway Right Now - Analytics Insight",
        "content": "Welcome to the exciting world of cryptocurrencies! If you’re looking for ways to become a millionaire in the future, then Bitcoin (BTC) and Ethereum (ETH) might just be the answer. These digital assets have been making waves in the financial world and have seen significant price increases over the past few years.\n\nOn the other hand, are you tired of sifting through hundreds of irrelevant emails in your inbox? What if we told you that one email could be the key to becoming a millionaire sooner rather than later? Introducing SignupToken, the new player in the crypto space that’s offering a unique opportunity for those looking to get in on the ground floor… If this excites you, you’ll want to read on!\n\nBitcoin and Ethereum: The Story Of The Two Titans And Where They’re Headed\n\nBy adopting the alias Satoshi Nakamoto, an unidentified person or group of individuals established Bitcoin in 2009. It was the first cryptocurrency that operated independently of a central organisation or bank by using blockchain technology. Blockchains are decentralised open ledgers where network nodes record and cryptographically confirm transactions.\n\nOn the other hand, programmer Vitalik Buterin developed Ethereum in 2015 – a decentralised software platform that enables developers to build and deploy smart contracts and decentralised applications (DApps) without interruption, fraud, third-party intrusion, or control.\n\nBoth Bitcoin and Ethereum have seen significant price increases in recent years, with Bitcoin hitting an all-time high of over $64,000 in April 2021 and Ethereum reaching its peak at over $4,300 in May 2021 – could you ever have imagined this back in 2010 when Bitcoin was used to just buy a couple of pizzas? Many experts believe that the future of these cryptocurrencies looks promising and could reach unimaginable heights in the next bull run!\n\nSignupToken: Promising New Cryptocurrency Platform Could Make You A Millionaire\n\nNow, let’s talk about SignupToken. This new player in the crypto space is taking a unique approach to its launch. Instead of the traditional pre-sales and prepayments, Signuptoken is offering a chance to be part of its Millionaires Club by simply signing up for its email list.\n\nThis is where things get exciting. Once SignupToken hits one million email sign-ups, the token will be dropped onto crypto exchanges, and those who signed up will be the first to know. With the goal of making one million millionaires, Signuptoken is determined to disrupt the market and help its fans get rich in the process.\n\nIt’s estimated that 300 billion emails are sent every day, and this one could be the ticket to your financial future. So, if you’re tired of getting bombarded with irrelevant emails, why not sign up for the chance to be part of the most exclusive club in the crypto space?\n\nIt’s important to note that there are no pre-sales involved with SignupToken, making it a unique opportunity to get in on the ground floor. While there are no guarantees in the world of investing, SignupToken is worth considering for those who are interested in cryptocurrencies and are looking for new opportunities!\n\nFinal Thoughts\n\nThe world of cryptocurrencies is full of exciting possibilities, and Bitcoin and Ethereum barely scratch the surface. With new players like Signuptoken entering the market, there are plenty of opportunities to get in on the ground floor and potentially make your fortune. So, don’t wait any longer. Sign up for SignupToken today and join the Millionaires Club – there’s nothing to lose!\n\nFollow SignUp Token through the link below:\n\nWebsite: Signuptoken.com\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdS50b2RheS94cnAtbGVkZ2Vycy1ldGhlcmV1bS1jb21wYXRpYmxlLXNpZGVjaGFpbi1ub3ctYWNjZXNzaWJsZS1vbi10ZXN0bmV00gFXaHR0cHM6Ly91LnRvZGF5L3hycC1sZWRnZXJzLWV0aGVyZXVtLWNvbXBhdGlibGUtc2lkZWNoYWluLW5vdy1hY2Nlc3NpYmxlLW9uLXRlc3RuZXQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "XRP Ledger's Ethereum Compatible Sidechain Now Accessible on Testnet - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a new tweet, RippleX, which supports XRPL ecosystem's development and growth, explains the details of the incoming EVM sidechain on XRP Ledger.\n\nAdvertisement\n\nAccording to it, the Ethereum Virtual Machine (EVM) compatible XRPL sidechain is available on testnet. Users can set up an account and submit a transaction using the EVM sidechain bridge.\n\n🧵 #DYK XRPL Thread: EVM Sidechain\n\n\n\nThe Ethereum Virtual Machine (EVM) compatible XRPL sidechain is available on testnet, and brings all kinds of #web3 applications to the #blockchain community.\n\n\n\nCheck out the intro. #BuiltOnXRPL (1/6)https://t.co/dUfpEoqjWn — RippleX (@RippleXDev) March 13, 2023\n\nIn October, software company Peersyst announced the release of the first phase of the EVM sidechain for XRPL, which launched on XRPL Devnet.\n\nPhase two of the project features a permissionless EVM sidechain and bridge that connects to XRPL Devnet to test scalability in a controlled environment.\n\nAt the end of the three-phased development, a permissionless EVM sidechain and bridge will be available on the XRPL mainnet.\n\nRipple CTO David Schwartz believes bringing Ethereum smart contracts to XRP Ledger (XRPL) will lower the barriers to entry for developers wanting to build apps with cross-chain interoperability.\n\nFormer Ripple advisor to lead Fed review of failed Silicon Valley Bank\n\nIn light of Silicon Valley Bank's failure, the Federal Reserve Board said on Monday that Vice Chair for Supervision Michael S. Barr, a former Ripple advisor, is in charge of reviewing the supervision and regulation of the bank. By May 1, the evaluation will be made available to the public.\n\nThe Federal Deposit Insurance Corporation (FDIC) was appointed as a receiver for a subsequent sale of the bank's assets after it was closed down by California banking regulators last week.\n\nUncertainty surrounded the specifics of the tech-focused bank's abrupt demise, but it appeared that the Fed's aggressive interest rate hikes the year before, which drastically tightened financial conditions in the start-up sector where it was a major participant, were to blame."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LnRyYWRpbmd2aWV3LmNvbS9uZXdzL25ld3NidGM6NGQ3ZWE1MTE2MDk0YjowLWV0aGVyZXVtLXByaWNlLWhvbGQtc3Ryb25nLWF0LTEtNjUwLWJ1dC1yaXNrLW9mLXB1bGxiYWNrLWluY3JlYXNlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Price Hold Strong At $1650 But Risk of Pullback Increases - TradingView",
        "content": "Ethereum price rallied over 15% and broke the $1,650 resistance against the US Dollar. ETH might correct lower and test the $1,625 support zone.\n\nEthereum started a major increase above the $1,600 resistance zone.\n\nThe price is trading above $1,620 and the 100 hourly simple moving average.\n\nThere is a short-term breakout pattern forming with resistance near $1,700 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could correct lower, but dips might be limited below the $1,625 support.\n\nEthereum Price Climbs Over 15%\n\nEthereum price started a major increase above the $1,550 resistance zone. ETH gained pace for a move above the $1,600 resistance zone and the 100 hourly simple moving average, similar to bitcoin.\n\nThe price even spiked above the $1,680 resistance zone and tested the $1,700 region. A high is formed near $1,701 and the price is now consolidating gains. There is also a short-term breakout pattern forming with resistance near $1,700 on the hourly chart of ETH/USD.\n\nEther price is now trading above $1,620 and the 100 hourly simple moving average. It is consolidating gains and well trading above the 23.6% Fib retracement level of the upward wave from the $1,371 swing low to $1,701 high.\n\nOn the upside, the price is facing resistance near the $1,700 zone. The first major resistance is near the $1,740 zone. The next major resistance is near the $1,765 level.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nA close above the $1,765 resistance zone might start another major increase. In this case, the price may perhaps rise towards the $1,850 resistance level. Any more gains might send the price towards $2,000.\n\nDips Limited in ETH?\n\nIf ethereum fails to clear the $1,700 resistance, it could start a downside correction. An initial support on the downside is near the $1,680 level.\n\nThe next major support is near the $1,625 zone. If there is a break below $1,625, the price might drop towards $1,535. It is near the 50% Fib retracement level of the upward wave from the $1,371 swing low to $1,701 high. Any more losses might call for a test of the $1,500 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is now losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 60 level.\n\nMajor Support Level – $1,625\n\nMajor Resistance Level – $1,700"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAzLzEzL2NyeXB0by1pcy1yZWNvdmVyaW5nLXNsb3dseS0yLWNyeXB0b3MtdG8tYnV5LW5vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Crypto Is Recovering Slowly: 2 Cryptos to Buy Now - The Motley Fool",
        "content": "After a stellar January and February, the crypto market has pulled back since the beginning of March. Even with the recent decline, the collective market cap of crypto is still up about 20% in 2023 and optimists are hopeful that the strong start to the year might signal an end to a brutal bear market that has gripped crypto since late 2021.\n\nThe exact timing of when this bear market will end is uncertain, but eventually this crypto winter will probably thaw just like those in the past. In preparation for a potential crypto spring, there are two cryptocurrencies to buy today.\n\nWhat these two might lack in originality is made up for in their track records of innovation, history of weathering multiple bear markets, and the continuing ability to disrupt the status quo. For these reasons, and many others, Bitcoin (BTC 1.02%) and Ethereum (ETH 1.43%) are recognized as the top assets in their class.\n\nThe original cryptocurrency\n\nFor Bitcoin, one of the main reasons it is the most valuable cryptocurrency is simply because it was the first, dating to 2009. Although this head start has receded in significance in recent years as other cryptocurrencies have jockeyed for market share, Bitcoin has remained at the top due to its inherent characteristics, which make it an attractive long-term investment. In the past five years it has returned more than 140% and over the decade it has notched a 44,300% return.\n\nTo many, Bitcoin is viewed as an asset that preserves wealth. Ingrained into Bitcoin's code is a feature that ensures it will become increasingly scarce, because only 21 million bitcoins will ever enter circulation. In addition, the rate of new coin creation is dwindling. Today, there are about 19.25 million coins in circulation, and the remaining 1.75 million will enter the supply gradually until 2140, when the last bitcoin is mined.\n\nIn addition to being completely decentralized and highly secure, Bitcoin does something that fiat currencies have failed to do -- protect purchasing power. Unlike currencies such as the U.S. dollar, British pound, Japanese yen and many others, Bitcoin's supply rate is growing extremely slowly. The central banks that control fiat currencies are able to inflate the supply in hopes of accomplishing a host of objectives. Whether the central banks achieve those objectives is a topic for another day, but what inevitably does happen through this process is a decrease in purchasing power. Bitcoin aims to resolve this by offering holders a way to increase their purchasing power with time as supply growth dwindles and demand increases.\n\nA groundbreaking invention\n\nAlthough Bitcoin is viewed by many as a store of value, Ethereum derives its value from its seemingly infinite number of use cases. When Ethereum came into existence in 2015 it completely changed the crypto economy. With the arrival of Ethereum, developers could now use computer code to cause specific actions to take place when particular criteria were met. Known as a smart contract, this code essentially turned Ethereum into programmable internet money that didn't require any one person or entity to oversee transactions.\n\nThis innovation laid the foundation for an entirely new and lucrative sector -- decentralized finance (DeFi). With these fancy new smart contracts, developers could optimize existing traditional financial processes, such as lending, because there's no need for a bank. Terms -- such as the loan's value, interest rate, and duration -- are all written into the smart contract. Outside of finance, smart contracts have the potential to even revolutionize industries such as real estate, supply chain management, and healthcare. As a result of this long term potential, Ethereum has treated investors to generous returns. Despite being newer than Bitcoin, Ethereum has actually outperformed the original cryptocurrency over the past five years and is up more than 180%.\n\nAll you need are these two\n\nAlthough Bitcoin and Ethereum differ in the way they are used, both serve a unique purpose. As a result, they a make up a majority of the value of the cryptocurrency asset class -- roughly 60%, with Bitcoin at 41% and Ethereum at 19%.\n\nBecause Bitcoin and Ethereum are so big, as they go, so goes the rest of the market. For this reason, they offer investors the simplest and most effective means to prepare for crypto's recovery. Rather than trying to find an obscure, unproven cryptocurrency, keep it simple. Investing in Bitcoin and Ethereum has treated investors well in years past and likely will for years to come."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMTQvdml0YWxpay1idXRlcmluLW5hbWVkLXdhbGxldC1zZW50LTUwMC1ldGhlci10by1taW50LXJhaS1idXktdXNkYy1hbWlkLWRlcGVnZ2luZy_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMy8xNC92aXRhbGlrLWJ1dGVyaW4tbmFtZWQtd2FsbGV0LXNlbnQtNTAwLWV0aGVyLXRvLW1pbnQtcmFpLWJ1eS11c2RjLWFtaWQtZGVwZWdnaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Vitalik Buterin-Named Wallet Sent 500 Ether to Mint RAI, Buy USDC Amid Depegging - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2FsdGNvaW5zL3doYXQtaXMtZXZlcnNjYWxlLWV2ZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Everscale (EVER): The Next Ethereum Killer? - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wcml2YWN5LWZvY3VzZWQtYmxvY2tjaGFpbi1uZXR3b3JrLWNsb3Nlcy1henRlYy1jb25uZWN0LXRvb2zSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Privacy-focused blockchain network closes Aztec Connect tool - Cointelegraph",
        "content": "Privacy-oriented blockchain platform Aztec is preparing to shut down Aztec Connect, the network’s privacy infrastructure serving as the encryption layer for Ethereum.\n\nAztec Network officially announced the upcoming closure of Aztec Connect, and plans to disable Aztec Connect deposits from front-ends like zk.money and zkpay.finance on March 17.\n\nAccording to a blog post by Aztec, users will be able to withdraw their funds from Aztec Connect with no fees for one year. “While withdrawals will always be possible, they will become significantly more burdensome after March 21, 2024,” Aztec said, recommending users withdraw funds as soon as possible. Since it launched in July 2022, Aztec Connect has amassed more than 100,000 users, the announcement notes.\n\nFrom March 2024, Aztec will no longer run a sequencer, meaning the current system will no longer publish rollup blocks processing Aztec Connect transactions. “Contract permissions will be renounced, and all rollup functionality will be ceased,” the announcement reads.\n\nAs Aztec has fully open-sourced the entire Aztec Connect protocol, the firm encourages the Aztec community to fork, deploy and operate a new version of the system. “We’d love to see an independently-operated Aztec Connect and are ready to fund it,” Aztec said.\n\nAccording to the announcement, the shutdown of Aztec Connect marks a milestone in the development of a decentralized general-use encrypted blockchain. Before launching Aztec Connect in July 2022, Aztec first experimented with using a zk-Rollup with Aztec 1, which was “slow, inefficient, costly” and limited in functionality to “basic private transfers.”\n\nSource: Aztec\n\nAztec emphasized that the research made with Aztec Connect will be usable and critical to the development of a next-generation blockchain, providing a basis for a fully programmable version of encrypted rollups, adding:\n\n“It’s undeniable that Aztec Connect was an important stepping stone towards realizing our ultimate goal. It’s now time for us to focus fully on that goal: a decentralized general-use encrypted blockchain.”\n\nAfter closing Aztec Connect, Aztec plans to focus on developing the universal zero-knowledge language known as Noir and the next-generation encrypted blockchain.\n\nRelated: Crypto projects respond to privacy coin ban in Dubai\n\nThe news comes amid ConsenSys preparing to release its zero-knowledge Ethereum Virtual Machine rollup on a public testnet on March 28. The launch will follow more than four years of research, potentially enabling faster transactions, higher throughput and better security of settlements on the Ethereum blockchain."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbmdhcGUuY29tL3ByZXNzLXJlbGVhc2VzL2RpZ2l0b2Fkcy0xMHgtcHJlc2FsZS1zdGFydHMtYXMtYml0Y29pbi1ldGhlcmV1bS1hbmQtYm5iLWNvbnRpbnVlLXRvLWJvdW5jZS1iYWNrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "DigiToads 10x Presale starts As Bitcoin, Ethereum, And BNB Continue To Bounce Back - CoinGape",
        "content": "The cryptocurrency markets have been abuzz over the past few days as Bitcoin, Ethereum, and BNB have seen a dramatic uptick in value. But, while the market has been experiencing some upswing, one digital asset is prepping for an even bigger push forward. DigiToads is a brand-new addition to the Ethereum chain, and its presale is attracting investors all around. Let’s discuss what you could expect in the coming months.\n\nBuy DigiToads Now\n\nDigiToads and its presale performance\n\nDigiToads is a new project in the cryptocurrency market that has been gaining attention for its innovative features. It is a P2E gaming, deflationary, staking reward token, and meme coin all rolled into one. The project also plans to launch a Metaverse called “The Swamp” with a DAO Treasury and a toad NFT Collection.\n\nThe current stage of its presale is an opportunity for early investors to get in on the ground floor and see substantial returns on their investments.\n\nDigiTaods presale is divided into ten separate phases, and each one starts with the increased price. This dynamic model stimulates adoption and hype to get as early as possible to gain higher rewards once the project launches.\n\nHere’s a quick breakdown of how DigiToads price is scheduled to update over the presale phases:\n\nStage Price Stage 1 $0.01 Stage 2 $0.012 Stage 3 $0.016 Stage 4 $0.02 Stage 5 $0.024 Stage 6 $0.027 Stage 7 $0.036 Stage 8 $0.042 Stage 9 $0.047 Stage 10 $0.05 Launch $0.055\n\nThis model suggests that the earliest TOADS adopters can increase their initial deposits by 900% at the debut, which will grow even further thanks to the project’s fascinating potential.\n\nBuy DigiToads Now\n\nIs Bitcoin bouncing back?\n\nBitcoin is the first and most broadly utilized decentralized digital currency, enabling instantaneous, borderless, and anonymous payments to and from anybody globally. It was quite a trip for BTC, with the price hitting about $70,000 in November 2021.\n\nHowever, the last year has been a massive letdown for BTC enthusiasts, with the price falling to as low as around $15,000. The year 2023 started splendidly for Bitcoin, with a price increase of almost 50%. Regaining momentum in Bitcoin prices is an encouraging sign for the market as a whole and an indication that Bulls are preparing to reclaim control.\n\nIs Ethereum going up?\n\nThe second-largest cryptocurrency, Ethereum (ETH), has also had a rough year. Experts, however, are optimistic because the price had a stellar January, rising by about 33% and setting a new monthly high not seen since July 2022.\n\nBNB overview\n\nBNB is the native coin of the world’s largest cryptocurrency exchange, Binance. BNB has a lot of practical applications, and its popularity is growing as the exchange does. But BNB has had its share of difficulties as well. There was mounting anxiety among investors about the transparency of major crypto exchange platforms, particularly because of last year’s collapse of the FTX exchange.\n\nHowever, BNB started to see a resurgence of support from bulls after breaking $300 in January 2023\n\nFinal thoughts\n\nTo sum up, DigiToads Presale is an exciting opportunity to diversify your portfolios and potentially see substantial returns. The project’s innovative features, including its deflationary nature and staking rewards, make it a well-rounded investment that stands out in the crowded cryptocurrency market.\n\nThe recent bounce back in the price of Bitcoin, Ethereum, and Binance Coin is a positive sign for the overall market and provides a tailwind for projects like DigiToads to gain traction and succeed.\n\nVisit The Website: https://digitoads.me/cgp\n\nPresale Registration: https://digitoads.me/buycgp\n\nJoin The Community: Linktr.ee/digitoads"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vaG93LWFkZC1hcmJpdHJ1bS10by1tZXRhbWFza9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "How to add Arbitrum to MetaMask: a step-by-step guide - OKX",
        "content": "Arbitrum is a Layer 2 scaling solution for Ethereum that aims to increase transaction speed and reduce gas fees. It accomplishes this by using off-chain computation to process transactions faster and more efficiently. Integrating with Arbitrum, will allow users to benefit from faster transaction times and lower fees provided by the Layer 2 solution, whilst benefiting from Ethereum’s secure and decentralized network. In this step-by-step guide, we’ll show you how to add Arbitrum to your MetaMask crypto wallet so you can start using it right away.\n\nMetaMask and Its Importance in the Cryptocurrency Space\n\nMetaMask is a popular web3 wallet that enables users to interact with decentralized applications (dApps) on the Ethereum network. It allows users to securely store and manage their Ethereum assets and interact with dApps without the need for a centralized intermediary.\n\nMetaMask is essential to the Ethereum ecosystem as it provides a convenient and user-friendly interface for interacting with Ethereum-based dApps, which are becoming increasingly popular in cryptocurrency. By adding Arbitrum to MetaMask, users can take advantage of the benefits provided by the Layer 2 solution, while still using the same familiar interface that they already know and trust.\n\nWhat Is Required To Add Arbitrum to MetaMask?\n\nBefore adding Arbitrum to MetaMask, there are a few prerequisites to keep in mind. First, you’ll need a MetaMask crypto wallet installed and set up on your browser. Then, you can download and install MetaMask as a browser extension from the official MetaMask website.\n\nAdditionally, you’ll need to ensure that your version of MetaMask supports the Arbitrum network. Currently, MetaMask supports the Arbitrum One network, which is based on Ethereum. You’ll need to be running version 9.5.0 or higher of the MetaMask extension to be able to add Arbitrum.\n\nOnce these prerequisites are in place, you can proceed with adding Arbitrum to your MetaMask wallet. The process is straightforward and can be completed in just a few steps.\n\nSupported Networks and Versions of MetaMask Required\n\nCurrently, MetaMask supports the Arbitrum One network, which is based on Ethereum. To add Arbitrum to your MetaMask crypto wallet, you must ensure you are running version 9.5.0 or higher of the MetaMask extension.\n\nIt’s important to note that while Arbitrum One is currently the only supported network on MetaMask, additional networks may be added in the future. Therefore, it’s always a good idea to check for updates and ensure that you have the latest version of MetaMask installed to take advantage of any new features or network support.\n\nStep-by-Step Guide to Adding Arbitrum to MetaMask\n\n1. Install and Set Up MetaMask:\n\nTo add Arbitrum to MetaMask, you’ll first need to download and install the MetaMask extension on your browser. Here’s how to do it:\n\nGo to the official MetaMask website and click the “Get Started” button.\n\nSelect your browser and follow the instructions to download and install the MetaMask extension.\n\nOnce installed, open MetaMask by clicking on the installed extension and click on the “create a new wallet button” or import an existing one.\n\nIf creating a new crypto wallet, follow the prompts to set up a new password and backup seed phrase.\n\nOnce your wallet is created or imported, you’ll be taken to the MetaMask interface.\n\nOverview of the MetaMask Interface:\n\nThe MetaMask interface is extremely user-friendly and easy to navigate. Here’s a quick overview of the key components:\n\nAccount Balance: This displays your account balance in ETH or the currently selected token.\n\nNetwork Dropdown: This allows you to switch between different Ethereum networks.\n\nSend and Receive Buttons: These buttons allow you to send or receive funds from your wallet.\n\nTransaction History: This displays a history of all transactions for the selected network.\n\nSettings: This button allows you to access settings and additional features.\n\nWith MetaMask installed and set up, you can now add Arbitrum to your crypto wallet.\n\n2. Add the Arbitrum Network to MetaMask\n\nTo add the Arbitrum network to MetaMask, you’ll need to follow these steps:\n\nNavigating to the network settings in MetaMask:\n\nClick on the network dropdown menu in the top left corner of the MetaMask interface.\n\nSelect the “Ethereum Mainnet” option.\n\nAdding Arbitrum network\n\nClick on the network dropdown menu again and select the “Arbitrum one” option.\n\nA dialogue box will appear showing the following details:\n\nNetwork Name : Arbitrum One\n\n: Arbitrum One Network URL: https://arbitrum-mainnet.infura.io\n\nChain ID : 42161\n\n: 42161 Cryptocurrency Symbol : ETH\n\n: ETH Block Explorer URL: https://explorer.arbitrum.io\n\nDouble-check settings and click on the “Approve” button to add the network to MetaMask.\n\nOnce these steps are completed, you should see the Arbitrum network listed in the network dropdown menu. Switch to the Arbitrum network and start using it for faster and cheaper transactions.\n\n3. Add Arbitrum Tokens to MetaMask\n\nTo add Arbitrum tokens to your MetaMask wallet, follow these steps: Click on the MetaMask icon to open the wallet interface.\n\n\n\nScroll to the bottom of the page and click on the “import tokens” menu.\n\n\n\nAdding custom tokens to MetaMask:\n\nhttps://arbiscan.io/\n\nFinding the token contract address and decimal value for the desired token:\n\nVisit the Arbitrum block explorer ().\n\nSearch for the token you want to add to your wallet.\n\nNote down the token contract address and decimal value.\n\nAdding the token to MetaMask with the correct contract address and decimal value:\n\nGo back to the MetaMask wallet interface and paste the token contract address into the “Token Contract Address” field.\n\nEnter the token cryptocurrency symbol and decimal value in the appropriate fields.\n\nand decimal value in the appropriate fields. Click on the “Next” button.\n\nClick on the “Add Tokens” button to complete the process.\n\nAfter completion, you should see the token listed in your MetaMask wallet. You can now send and receive the token just like any other asset in your wallet.\n\nOverview of the Features and Benefits of the Arbitrum Network\n\nArbitrum is a promising Layer 2 scaling solution for Ethereum that aims to address some of the key challenges facing the Ethereum network, such as network congestion, high gas fees, and slow transaction times. The network uses Optimistic Rollups technology to process transactions off-chain and then settle them on the Ethereum network, enabling faster and more efficient transactions.\n\nOne of the primary benefits of the Arbitrum network is its low gas fees. The network achieves this by batching and compressing transactions, resulting in fewer on-chain interactions and lower gas fees. This makes it more affordable for users to transact on the network, which can help increase the adoption and usage of decentralized applications built on Ethereum.\n\nAnother key feature of the Arbitrum network is its compatibility with existing Ethereum dApps and smart contracts. Arbitrum allows developers to integrate their dApps and smart contracts with the network without the need to rewrite their code. This is a significant advantage over other Layer 2 solutions that may require more complex and time-consuming integration efforts.\n\nIn addition to its technical features, the Arbitrum network also offers a high degree of security. The network uses a range of security mechanisms, including fraud proofs and advanced cryptography, to ensure the safety and integrity of transactions. The network is also governed by a decentralized community of validators responsible for maintaining the network and making decisions about its future development. This helps ensure that the network remains decentralized and resilient to attacks.\n\nExamples of What Can Be Done With the Network\n\nThe Arbitrum network offers a range of exciting possibilities for developers and users alike. Some examples of what can be done on the network include:\n\nDecentralized Finance (DeFi) applications: The Arbitrum network can be used to build and run DeFi applications, such as decentralized exchanges (DEXs), lending and borrowing platforms, and stablecoin systems. These applications can benefit from the network’s fast transaction processing times and low gas fees, enabling efficient and affordable transactions. Gaming and Non-Fungible Tokens (NFTs): The Arbitrum network can also be used to build and run gaming applications and NFT marketplaces. These applications can leverage the network’s fast transaction processing times and low fees to enable seamless in-game and affordable NFT transactions. Supply Chain and Identity Management: The Arbitrum network can also be used to build and run supply chain and identity management applications. These applicons can benefit from the network’s security and decentralization features, ensuring the authenticity and integrity of both the supply chain data and identity information. Cross-Chain Interoperability: The Arbitrum network can also be used to enable cross-chain interoperability between different blockchains. This could allow for the seamless transfer of assets and data between different blockchain ecosystems, enabling greater interoperability and connectivity across the entire blockchain space.\n\nThe Arbitrum network’s fast transaction processing times, low fees, and security and decentralization features make it a compelling choice for a wide range of use cases.\n\nAdding Arbitrum to Your MetaMask Wallet Is Easy\n\nAdding Arbitrum to your MetaMask wallet is a straightforward process that can help you take advantage of the benefits offered by this Layer 2 scaling solution for Ethereum. With faster transaction processing times and lower gas fees, the Arbitrum network offers a compelling alternative to using the Ethereum network alone for decentralized applications.\n\nBy following the step-by-step guide outlined in this blog, you can easily add Arbitrum to your MetaMask wallet and start using it to transact and interact with decentralized applications built on the Arbitrum network. Whether you’re a developer looking to build on a more scalable platform, or a user looking for a faster and more affordable way to transact on the Ethereum network, adding Arbitrum to your MetaMask wallet is a smart move.\n\nFAQs\n\nDoes MetaMask Accept Arbitrum?\n\nYes, MetaMask does accept Arbitrum. In fact, MetaMask currently supports the Arbitrum One network, which is a Layer 2 scaling solution for Ethereum. To add the Arbitrum network to your MetaMask wallet, you can follow the steps outlined in our earlier sections. Once added, you can use your MetaMask wallet to transact on the Arbitrum network, taking advantage of its faster transaction times and lower gas fees compared to the Ethereum network.\n\nWhat Is the New RPC URL for Arbitrum?\n\nThe new RPC URL for Arbitrum is https://arb1.arbitrum.io/rpc. This URL is used for connecting Arbitrum network and is required when adding the Arbitrum network to your MetaMask wallet or any other Ethereum wallet that supports the network. Make sure to enter this URL correctly when adding the network to your wallet to ensure that you are properly connected to the Arbitrum network.\n\nWhat Is the Chain ID for Arbitrum?\n\nThe chain ID for the Arbitrum One network is 42161. Symbol: AETH. This ID is required when adding the Arbitrum network to your MetaMask wallet or any other Ethereum wallet that supports the network. Make sure to enter this ID correctly when adding the network to your wallet to ensure that you are properly connected to the Arbitrum network.\n\nHow Do I Access Arbitrum Network?\n\nTo add Arbitrum network to MetaMask:\n\nSelect \"Ethereum Mainnet\" from the network dropdown menu.\n\nSelect \"Arbitrum One\" from the dropdown menu again.\n\nEnter network details.\n\nClick \"Approve\" to add the network.\n\nOnce added, switch to the Arbitrum network to transact and interact with dApps built on the network.\n\nOnce you have added the Arbitrum network to your wallet and switched to it, you can use the network to transact and interact with decentralized applications built on the Arbitrum network.\n\nIs Arbitrum an ERC20 Token?\n\nNo, Arbitrum is not an ERC20 token. In fact, it’s a Layer 2 scaling solution for the Ethereum network, designed to improve the speed and efficiency of transactions on the network.\n\nArbitrum uses Optimistic Rollup technology to process transactions off-chain and then settle them on the Ethereum network. It does not have its own native token, nor is it an ERC20 token. Instead, it provides a platform for developers to build and deploy decentralized applications that can take advantage of its faster transaction processing times and lower gas fees compared to the Ethereum network."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yYWxsaWVzLTEwLXRvLXRvcC0yNGstYm5iLWFuZC1ldGhlcmV1bS1qdW1wLXVwLXRvLTctMzczMjUyLTIwMjMtMDMtMTTSAZQBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3Rva2VuL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXJhbGxpZXMtMTAtdG8tdG9wLTI0ay1ibmItYW5kLWV0aGVyZXVtLWp1bXAtdXAtdG8tNy0zNzMyNTItMjAyMy0wMy0xNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rallies 10% to top $24k, BNB and Ethereum jump up to 7% - Business Today",
        "content": "Bitcoin and other top crypto tokens continued to move sharply higher on Tuesday amid the Silicon Valley Bank (SVB) fallout. However, a few stablecoins lost their pegging to the US dollar amid the crisis but mainstream tokens, particularly, the US dollar were flexing muscles.\n\n\n\nBitcoin advanced another 10 per cent, hitting $24,000-mark. A flight from stablecoins pushed Bitcoin's store of value higher. Its largest peer Ethereum was trading 5 per cent higher and was hovering around $1,700-levels. Altcoins outperformed the blue chips tokens, rallying up to 40 per cent.\n\n\n\nThe closure of three crypto-friendly banks, Silvergate, SVB, and Signature, is likely to result in short-term liquidity issues since these banks acted as the primary ramps for dollars into crypto assets. SVB's transaction halt had caused a sharp 10 per cent de-peg of USDC over the weekend, said Parth Chaturvedi, Crypto Ecosystem Lead at CoinSwitch.\n\n\n\n\"We might see a rapid shift in the usage of new banking partners by the crypto industry. Many in the industry are pivoting to Mercury, BCB Group, Axos, and a few other banks that cater to crypto startups. This could also spark a flight of crypto companies to other more favorable jurisdictions like Switzerland, Hong Kong, Dubai, and the UK,\" he said.\n\n\n\nBarring the US dollar pegged stablecoin Tether, all other top and popular crypto tokens were rallying sharply on Tuesday. BNB was up 7 per cent, followed by Litecoin and Polygon, which rallied 4 per cent each. Solana, Dogecoin, Polkadot and Shiba Inu advanced 3 per cent each.\n\n\n\nThe global cryptocurrency market cap was trading sharply higher, regaining the 1 trillion mark. It jumped another 6 per cent to $1.08 trillion in the last 24 hours. However, the total trading volumes surged more than 24 per cent, close to $90.50 billion.\n\n\n\n\n\n\n\nTech View by WazirX Trade Desk\n\nThe Graph (GRT) is an indexing protocol for querying data for networks like Ethereum and IPFS, powering many applications in both DeFi and the broader Web3 ecosystem. Anyone can build and publish open APIs, called subgraphs, that applications can query using GraphQL to retrieve blockchain data.\n\n\n\n\n\nThe GRT price chart has broken out of the descending trendline with good volume, it is up by 29 per cent for the day. Currently it is retesting the support after breaking out, an upward movement is expected to continue. The next resistance for GRT token is expected at the $0.15 level and the next support could be expected around the $0.10 levels.\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: Adani Enterprises, Adani Ports, Adani Power, Adani Green in focus as govt issues statement on Adani-Hindenburg crisis\n\nAlso read: Reliance Industries shares tank 20% from their 52-week high levels; should you wait or buy now?"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9idGMtZXRoLWJhY2t0cmFjay1sb3NzZXMtaXMtY3J5cHRvLXJvdXQtZnJvbS11LXMtYmFuay1jb2xsYXBzZXMtdHJ1bHktb3Zlci_SAWVodHRwczovL2FtYmNyeXB0by5jb20vYnRjLWV0aC1iYWNrdHJhY2stbG9zc2VzLWlzLWNyeXB0by1yb3V0LWZyb20tdS1zLWJhbmstY29sbGFwc2VzLXRydWx5LW92ZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "BTC, ETH backtrack losses- Is crypto rout from U.S. bank collapses truly over - AMBCrypto News",
        "content": "U.S. regulators offer a bailout to customers affected by SVB and Signature bank collapses.\n\nWill there be alternatives to these crypto-friendly banks and their payment systems to provide liquidity?\n\nBitcoin and Ethereum were both up by more than 9% in the last 24 hours retracing their weekend losses and propping up the crypto market. The stablecoins also saw a surge as they regained their peg.\n\nThe U.S. regulators were able to take out negative sentiments among investors following the collapse of the crypto banks by offering bailout to depositors.\n\nIt should be noted here that Signature Bank and SVB collapsed in just a couple of days from each other. Thus, bringing down the banking and crypto sectors.\n\nSignature was the only viable option for most crypto companies after Silvergate shut its shop and on Sunday the U.S. said adieu to it as well.\n\nCrypto firms reveal their exposure to Signature\n\nSeveral crypto companies including Coinbase, Paxos, and Celsius have come forward to disclose their exposure to the bank.\n\n“As of close of business Friday March 10 Coinbase had an approximately $240m balance in corporate cash at Signature,” the exchange announced on Twitter.\n\nAs of close of business Friday March 10 Coinbase had an approximately $240m balance in corporate cash at Signature. As stated by the FDIC, we expect to fully recover these funds. https://t.co/XY5L7m4RMs — Coinbase (@coinbase) March 12, 2023\n\nBlockchain company Paxos said (at press time) it held $250 million at the bank while Celsius admitted that Signature held their funds without disclosing the amount.\n\nThe companies shared hope that they will be able to recover the funds following the joint statement from different U.S. regulators. “All depositors of this institution will be made whole,” the regulators said in relation to the Signature bank context.\n\nWhat’s next?\n\nThe crypto market, eventually, recovered on 13 March. Most of the cryptocurrencies registered positive gains and investors were seen returning back to their trading activities. However, the question remains- Is this recovery just a calm before the storm?\n\nCrypto companies will now have to transfer their funds elsewhere with the demise of these banks. Circle has already moved its funds from SVB to BNY Mellon and others will soon follow suit.\n\nNotably, the collapse of these lenders will also affect crypto liquidity. The Silvergate Exchange Network (SEN) and Signature’s Signet were real-time payment platforms that allowed users to conduct transactions 24*7.\n\nNow that they are gone, investors might have to limit their payments to banking hours unlike earlier. It looks like crypto liquidity will be affected in the absence of these platforms unless an alternate system comes up."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2RvZ2V0dGktb24taXRzLXdheS10by1ncmVhdG5lc3Mtd2hpbGUtYml0Y29pbi1hbmQtZXRoZXJldW0tcHJpY2VzLWRpcC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Dogetti on its Way to Greatness While Bitcoin and Ethereum Prices Dip - Analytics Insight",
        "content": "The news surrounding Silvergate’s issues is huge, causing Bitcoin (BTC) and Ethereum (ETH) prices to dip. But it does not necessarily mean that it’s the end for the crypto industry. Dogetti (DETI) is a new meme coin that is still gaining success in its presale, which gives a lot of hope to token enthusiasts.\n\nRecently, a major European asset manager stated their belief in digital assets and that these coins are not destined to fail.\n\nEU Asset Manager Says Digital Assets are Here to Stay\n\nAmundi Chief Investment Officer Vincent Mortier, along with macroeconomist Tristan Perrier released a thematic analysis paper to examine the state and perspectives of the crypto industry.\n\nThe two executives from the leading European asset manager argued that crypto giant Bitcoin failed to be an inflation hedge for the previous two years due to huge changes in policy and market interest rates, pressuring “all asset classes”.\n\nAccording to the paper, nominal interest rates might cease to surge or drop due to high inflation but would not rise. If it happens, it can lead to a bull market, which is a favorable environment for an asset with finite supply and a long duration. Such a coin attracts investors due to its future potential rather than its current status.\n\nDuring market volatility, it is important to invest in the long-term, which is one great benefit of purchasing DETI coins.\n\nDogetti Holders are in for a Treat at Launch\n\nEarly investors who had bought DETI in its Presale Stage 1—when the coin was sold at $0.00007—are going to enjoy a huge increase when the coin launches on a crypto exchange.\n\nThe token is now in Stage 2, selling for $0.00029 each. That means the price has seen a huge increase of about 300%!\n\nWhen Dogetti ends Stage 5, which is also the time the coin launches, DETI will be selling for $0.0007 each. We are looking at a 900% increase from Stage 1!\n\nThe longer you wait to purchase DETI, the more you possibly lose millions of dollars in the future! If you buy at a later date nearing the final stage of the presale, you will only receive fewer tokens than if you had bought them earlier.\n\nAside from generating wealth for all “family members”, Dogetti is a coin that never forgets to give back to its community. One of the best features of joining the Dogetti family is its 2% protocol. For every transaction, 2% will be redistributed to all holders, meaning you gain extra coins just by having DETI in your wallet. Dogetti will also take 2% from every transaction and add it to its charity wallet. The whole family is encouraged to cast votes on which charities they want to support.\n\nLastly, the meme coin will get 2% from every transaction and split it between liquidity and burn wallets. This ensures the stability of the project as well as the family in the long term.\n\nInstitutions Look Beyond BTC and ETH\n\nA top executive of Coinbase, David Duong, hinted that institutional investors might be open to investing in digital assets other than the top two giants, Bitcoin and Ethereum.\n\nIn a live stream with crypto analyst Scott Melker, the head of Coinbase’s institutional research said that 55% of their institutional clients are into Bitcoin and Ethereum, but the remainder is in altcoins. This means that a lot of attention is poured into the ecosystem outside of BTC and ETH.\n\nBitcoin and Ethereum have been performing poorly after Silvergate shut its operations, sending the whole crypto market into meltdown. On March 9th, Bitcoin and Ethereum traded at $21,637 and $1,533, respectively. BTC’s price decreased by 7.31%, while ETH saw a 6.21% decrease in the past seven days.\n\nNevertheless, many investors are still hoping that the crypto market will recover. If you want to invest long-term and avoid market volatility, you might want to try presale coins like Dogetti. Check them out on their website and social media.\n\nDogetti (DETI):\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tYW5kLWV0aGVyZXVtLWFyZS1zaHJpbmtpbmctZG9nZXR0aS1zdGlsbC1jb250aW51ZXMtdG8tdGhyaXZlLWluLXByZXNhbGUtcGhhc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Are Shrinking, Dogetti Still Continues to Thrive in Presale Phase - Analytics Insight",
        "content": "Recently, increasing market regulations have had a detrimental effect on Bitcoin and Ethereum. On the other hand, Dogetti (DETI), since its presale, has formed itself as the brightest meme coin in the crypto market.\n\nBitcoin Plunges Due to Unending Inflation\n\nThe US Federal Reserve Chairman Jerome Powell’s hardline testimony to Congress prompted traders to price in a higher “terminal,” and as a result, Bitcoin (BTC) is perilously close to falling below US $20,000 for the first time in two months. By the start of the second week of March, Bitcoin had lost about 1% against the US dollar. The next morning, it lost another 0.9%, which allowed for a collapse in the BTC/USDT pair to roughly $22,000.\n\nThe Fed has increased interest rates by 450 basis points (bps) since last year, causing risk assets, such as cryptocurrencies, to tremble. As fear, uncertainty, and doubt spread in the cryptocurrency market, investors are shifting away from Bitcoin towards tokens that facilitate smart contracts. Although there is still a considerable distance between the current price and $20,000, if the dip is extended further by momentum traders, there is a possibility that the gap between them could narrow.\n\nETH Alert: 90% decline since March 2020\n\nSince June 2022, the price of Ethereum has increased by 78%, but this does not imply success. The volume profile of the digital asset strongly suggests a significant correction in the cryptocurrency market. The ETH volume profile showed approximately $64.25 million ETH traded between $270 and 450, with buying volume outpacing the selling volume by nearly 1 million ETH between July 2020 and November 2020.\n\nFollowing Powell’s speech, Ethereum (ETH) recovered from an intraday low of US$1,540 on March 7 to close the session 0.25% lower. The performance of the second-largest cryptocurrency in the world was actually worse, falling more than 0.7% on the ETH/USD pair. A recent purchase of 65% of Ethereum at a lower price in March 2023 suggests that even if a considerable price decline is inevitable, the potential to secure profits may still be high.\n\nThe majority of the top-20 altcoins took a stiffer boost just after the hawkish Fed chair’s remarks, though Bitcoin and Ether limited overnight losses to one or two percentage points.\n\nDogetti – Meme Coin with Future Potential\n\nDogetti (DETI), a meme coin that is relatively new, is currently in the second phase of its presale. With sales of more than 7,205,450,000/50,000,000,000 DETI tokens thus far, the dog-themed coin has gotten off to a flying start, raising more than $515,741 in total. Dogetti offers a family code called “WISEGUY25” that entitles you to a massive 25% discount on your purchase.\n\nThe mirror protocol of Dogetti, which enables users of its digital currency, DETI, to amass more coins just by keeping them in their digital wallets, is one of the platform’s main attractions.\n\nIn addition, Dogetti recently introduced DogettiDAO and DogettiNFTs, allowing customers to mint their own customized NFT pets. Since the demand for these digital assets is only expected to increase, this entry into the NFT market is wise. The collaboration between Dogetti and Uniswap offers traders high levels of security, low fees, and quick transactions. As a result of its hybrid consensus mechanism, Dogetti is able to process transactions swiftly and securely, making it the perfect platform for DeFi applications that demand low-cost, swift, and efficient transactions.\n\nConclusion\n\nTo conclude, the decision to invest in digital currencies can be volatile, but the likelihood of good yields is impossible to ignore. With distinct characteristics like its reﬂective protocol and NFT opportunities, Dogetti (DETI), a cryptocurrency, has exhibited great commitment. Dogetti is an enticing potential investment due to its burgeoning family. Right here, you can buy your very own Dogetti.\n\nFor more information about Dogetti (DETI):\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vbmV3cy5uYWIuY29tLmF1L25ld3MvbmFiLWNvbXBsZXRlcy13b3JsZC1maXJzdC13aXRoLWNyb3NzLWJvcmRlci1zdGFibGVjb2luLXRyYW5zYWN0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "NAB completes world-first with cross-border stablecoin transaction - NAB News",
        "content": "NAB has completed an intra-bank cross-border transaction using NAB-issued stablecoin, which represents a world-first by a major financial institution on a layer-one public blockchain.\n\nThis pilot transaction on the public and permissionless Ethereum blockchain, involved deployment of stablecoin smart contracts for seven major global currencies. The pilot’s success demonstrates the potential to cut cross-border transactions from days to minutes and brings NAB one step closer to enabling clients who operate in multiple jurisdiction and currencies a simpler and faster experience, starting with corporate and institutional clients.\n\nNAB Executive General Manager, Markets, Drew Bradford, said NAB was investing to develop Australia’s safest, simplest and most secure digital asset ecosystem.\n\n“We are committed to pursuing the right digital asset opportunities with clear customer benefits. Bringing multi-currency stablecoins to market demonstrates NAB’s focus on simplifying international banking protocols to increase speed and transparency while lowering costs and reducing complexity for customers,” Mr Bradford said.\n\n“We believe that elements of the future of finance will be blockchain enabled and we’re already witnessing rapid change in the tokenisation market. The stringent governance frameworks we have in place ensures we can support the creation of a safe and reliable digital financial system.”\n\nNAB’s Australian stablecoin, AUDN, which will be fully backed one-for-one with the Australian dollar and managed as a liability of the bank, will be the cornerstone for NAB’s ambitions in digital assets. In addition, transacting on a public, permissionless layer-one blockchain will allow for greater transparency, accessibility and scalability.\n\nNAB has partnered with leading technology providers Blockfold and Fireblocks for this pilot to build and deploy its stablecoins. This includes leveraging their expertise for smart contract creation, securely minting and burning its stablecoin and managing the direct custody of the digital assets on the blockchain technology.\n\nFireblocks CEO and Co-founder, Michael Shaulov, said: “Australia continues to be a global torch bearer for tokenisation in financial services, with NAB leading the charge in the world’s first use case of a large financial institution leveraging a public blockchain for cross-border payment rails. NAB’s successful trade execution marks the beginning of the evolution of financial services from Web2 to Web3, underpinned by blockchain technology as well as strong governance and risk management”.\n\nBlockFold CEO and Co-founder, Francois Schonken, said: “NAB’s multi-currency cross border settlement execution on a public blockchain is exhilarating. This trade marks the first cross-border multi-currency exchange executed by a regulated large financial institution (NAB) backed stablecoin. The NAB eco-system of stablecoins puts in place cross-border payment rails that unlock tokenization potential for both real world assets and financial products”.\n\nNotes to editors:\n\nNAB’s ambition is to enable transactions across seven of the top globally utilised currencies: Australian, New Zealand, Singapore and US dollars, Euro, Yen and Pound Sterling.\n\nNAB expects to be supporting select corporate and institutional clients to transact using digital assets by the end of 2023.\n\nThe transaction was completed using NAB’s own, newly minted ERC-20 tokens.\n\nAbout Fireblocks\n\nFireblocks is an enterprise-grade platform delivering a secure infrastructure for moving, storing, and issuing digital assets. Fireblocks enables exchanges, custodians, banks, fintechs, and hedge funds to securely scale digital asset operations through the Fireblocks Network and MPC-based Wallet Infrastructure. Fireblocks serves over 1,600 financial institutions, has secured the transfer of over $3 trillion in digital assets and has a unique insurance policy that covers assets in storage and transit. Some of the biggest crypto businesses have switched to Fireblocks because it’s the only solution that CISOs and Ops Teams both love. For more information, please visit www.fireblocks.com.\n\nAbout BlockFold\n\nBlockFold is a professional services consultancy specialising in tokenisation and smart contract development. Our mission is to rebuild the global financial system on secure, open and transparent standards. We work with some of the largest global financial institutions to help them leverage blockchain technology to issue and trade stablecoins, bonds, carbon credits and real world assets. For more information, please visit blockfold.com."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiuAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLW1hcmNoLTEzLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLWNmeC1jb25mbHV4LWdhaW5lci1sb3Nlci0xNTg3OTg40gG8AWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktaW4taW5kaWEtbWFyY2gtMTMtY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tY2Z4LWNvbmZsdXgtZ2FpbmVyLWxvc2VyLTE1ODc5ODgvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Ethereum Pick Up Steam CFX Gains Over 30 Percent - ABP Live",
        "content": "After days of a slump, the global crypto market cap managed to recover and reclaim the $1.02 trillion mark over the weekend. Bitcoin (BTC), the world’s oldest and most valued crypto, appeared stable within the $22,000 range early Monday morning. Other popular altcoins — including the likes of Ethereum (ETH), Dogecoin (DOGE), Litecoin (LTC), Ripple (XRP), and Solana (SOL) — landed in the greens across the board. The Conflux (CFX) token emerged to be the top gainer, with a 24-hour gain of over 30 percent.\n\nThe global crypto market cap stood at $1.03 trillion at the time of writing, registering a 24-hour gain of 8.33 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $22,338.13, registering a 24-hour gain of 8.27 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 19.03 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,596.60, marking a 24-hour gain of 7.79 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.36 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 5.53 percent, as per CoinMarketCap data, currently priced at $0.07035. As per WazirX, Dogecoin price in India stood at Rs 6.21.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour jump of 12.04 percent. At the time of writing, it was trading at $78.04. LTC price in India stood at Rs 6,402.14.\n\nRipple (XRP) price today\n\nXRP price stood at $0.3691, seeing a 24-hour gain of 0.58 percent. As per WazirX, Ripple price stood at Rs 31.70.\n\nSolana (SOL) price today\n\nSolana price stood at $19.68, marking a 24-hour gain of 8.17 percent. As per WazirX, SOL price in India stood at Rs 1,789.08.\n\nTop crypto gainers today (March 13)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nConflux (CFX)\n\nPrice: $0.1889\n\n24-hour gain: 30.13 percent\n\nSynthetix (SNX)\n\nPrice: $2.85\n\n24-hour gain: 28.56 percent\n\nOptimism (OP)\n\nPrice: $2.36\n\n24-hour gain: 24.97 percent\n\nStacks (STX)\n\nPrice: $0.743\n\n24-hour gain: 24.72 percent\n\nMaker (MKR)\n\nPrice: $899.50\n\n24-hour gain: 24.41 percent\n\nTop crypto losers today (March 13)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nBone ShibaSwap (BONE)\n\nPrice: $1.53\n\n24-hour loss: 0.87 percent\n\nBinance USD (BUSD)\n\nPrice: $1.00\n\n24-hour loss: 0.36 percent\n\nTether (USDT)\n\nPrice: $1.01\n\n24-hour loss: 0.36 percent\n\nTrueUSD (TUSD)\n\nPrice: $1.00\n\n24-hour loss: 0.28 percent\n\nWhat crypto exchanges are saying about the current market scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Over the past 24 hours, many cryptocurrencies have seen a rise in value due to news of the government's plan to protect all depositors of Silicon Valley Bank. As a result, Bitcoin has surged past the $22,000 mark after hitting its lowest point since January. Within a day, the cryptocurrency has gained nearly 10 percent. Ethereum has also followed a similar trajectory and is trading above the $1,600 level.”\n\nWazirX Vice President Rajagopal Menon said, “Bitcoin has seen a modest increase over the last 24 hours after the Federal Deposit Insurance Corporation, and USDC issuer, Circle announced its support to protect Silicon Valley Bank investors. Large-scale borrowing by small banks in the US, which are the major partners of tech companies, is experiencing high volatility as a domino effect. With funding figures not looking up anytime soon, more tech startups are expected to withdraw their existing reserves further impacting the market. This might also affect Crypto prices in the coming weeks.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin said, “Bitcoin has a price target of $18,400 with the possibility of visiting the $21,800 region before the expected decline. For Ethereum, a key support level remains at $1,423 and a break below this level could lead to a retest of last November's lows. The key resistance to watch out for is around $1,460, which represents the February lows. MATIC is currently trading around $1.08, Solana around $17.99 and TRX around $0.05938.”\n\nKunji founder Anurag Dixit offered his take, “Two major US financial institutions have made headlines this week, as both Silicon Valley Bank and Circle faced significant challenges. Silicon Valley Bank's depositors were granted full access to their funds on Monday, following restrictions on withdrawals and transfers due to concerns about the bank's liquidity position. Meanwhile, Circle has been grappling with the aftermath of the failure of its key banking partner, Signature Bank, which has highlighted the dependency of the stablecoin ecosystem on some centralized entities.\"\n\nShivam Thakral, the CEO of BuyUCoin, said, “The crypto market cap is back above the $1 trillion mark and BTC has surged by over 8 percent in the last 24 hours and is trading above the $22,300 mark. ETH which follows the BTC trajectory jumped by over 7 percent during the same period. The positive mood of the market is mainly due to the federal regulators hinting towards recovering Silicon Valley Bank’s customer deposits. The news has uplifted investor sentiment with a promise of more liquidity in the market. The momentum will depend on the further regulatory recourse of SVB fallout.”\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWNvbW11bml0eS13aXRoLTg4LWhpc3RvcmljYWwtYWNjdXJhY3ktc2V0cy1ldGhlcmV1bS1wcmljZS1mb3ItbWFyY2gtMzEtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Crypto community with 88% historical accuracy sets Ethereum price for March 31, 2023 - Finbold - Finance in Bold",
        "content": "Disclaimer: The CoinMarketCap cryptocurrency community price estimate is based only on the votes of its users. Estimates do not guarantee end-of-month prices.\n\nThe financial sector in the United States has been rocked by the failure of many banks and financial institutions in the previous week, notably Silicon Valley Bank and Silvergate Bank. In response, Bitcoin’s (BTC) value jumped from a low of $19,736 last week to its current level of $24,835, carrying the broader crypto market up with it.\n\nFor instance, Ethereum (ETH), the leading smart contract platform and second-largest cryptocurrency by market cap fortunes, now look bullish after rebounding from last week’s low of $1,379 to regain support at $1,600 as it tests resistance at $1,700 midway through the month.\n\nHowever, despite the bullish turn of events, according to the 1,565 community votes cast by the members of the crypto tracking platform CoinMarketCap by press time, ETH is set to change hands at an estimated average price of $1,560 by March 31, a decrease of -7.67% or -$129.58 to ETH’s current price, as per data retrieved on March 14.\n\nETH end of March price estimation. Source: CoinMarketCap\n\nIt is also important to note that the projections of the crypto community for Ethereum over the last six months have had a historical accuracy of 87.72%, making them a suitable alternative to the price estimates made by the artificial intelligence (AI) platforms that have set a slightly lot lower Ethereum price for the same period at the price of $1,529 by March 31.\n\nETH estimation accuracy. Source: CoinMarketCap\n\nDue to the Ethereum Shanghai update, the roughly $28 billion worth of ether that has been staked will begin to become accessible in a few weeks. This supply, which at this time is unable to be withdrawn or sold, will be progressively returned to the public markets, which will affect the price of Ethereum. With that being said, crypto trading analyst Ali Martinez noted that Ethereum whales continue to buy up ETH during the recent market dip:\n\n“Ethereum whales with 1,000 to 10,000 $ETH added around 400,000 ETH to their holdings in the recent crypto market dip, worth around $600,000,000.”\n\nETH March whale purchases. Source: Ali Martinez\n\nRegarding Ethereum’s technical analysis (TA) on the one-day gauges over at the finance monitoring website TradingView are very bullish. Its summary aligns with the ‘strong buy’ sentiment at 16, which results from moving averages (MA) pointing at ‘strong buy’ at 14, and oscillators in the ‘buy’ area at 2.\n\nEthereum is now testing resistance at $1,700, trading at $1,688; it is up 6.41% in the last 24 hours.\n\nETH 1-day price change. Source: Finbold\n\nOver the last week, ETH is up 8%, with a total market capitalization of $210 billion.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wMy8xNC9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLXdpbGwtZXRoLWJyZWFrb3V0LWZyb20taXRzLWNvbnNvbGlkYXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Will ETH Breakout From its Consolidation? - The Coin Republic",
        "content": "The pair of ETH/BTC was trading at 0.0687 BTC with a dip of 3.68% over the intraday trading session.\n\nEthereum price prediction suggests that it is currently in an uptrend after bouncing back from its primary support of $1473.53. From the start of 2022, the Ethereum token was in a bearish phase till August 2022 as can be seen from the daily trading chart. This indicates that the sellers were dominating from the start of 2022. After August 2022 buyers became hyper-active in the market which can be seen on the chart as the token broke its primary support and resistance even reaching its secondary resistance of $2028.52. But after testing its secondary resistance sellers pushed back the token below its primary support of $1473.53 and kept it there till the end of the year 2022.\n\nAfter the start of 2023, the Ethereum token again started its upwards movement breaking its primary support on its way up. But after testing its primary resistance of $1729.00 the Ethereum token began consolidating between its primary support and resistance. The formation of the bearish hammer candlestick after a downtrend may cause the current bullish phase.\n\nThe coin’s volume has increased by 14.31% in the last 24 hours. The increase in volume indicates that the number of buyers has increased. This shows that buyers are trying their best and there is a relationship between volume and the price of ETH, which represents strength in the current bullish phase.\n\nEthereum Price Technical analysis:\n\nRSI is increasing overbougth zone and is showing a positive crossover which indicates that the buyers are coming in the majority and pushing ETH downwards. This suggests the strength of the current bullish trend. The current value of RSI is 59.88 which is above the average RSI value of 46.49.\n\nThe MACD and the signal line are increasing but not showing any definitive crossover over the daily chart which can support the RSI claims. Investors need to watch every move over the charts during the day’s trading session.\n\nConclusion\n\nEthereum price prediction suggests that it is currently in an uptrend after bouncing back from its primary support of $1473.53.But after testing its secondary resistance sellers pushed back the token below its primary support of $1473.53 and kept it there till the end of the year 2022. After the start of 2023, the Ethereum token again started its upwards movement breaking its primary support on its way up. The increase in volume shows positive market sentiment towards the token.RSI and MACD are increasing in an overbought zone and are showing a positive crossover which shows strength in the current uptrend.\n\nTechnical Levels-\n\nResistance level- $1729.00 and $2028.52\n\nSupport level- $1473.53 and $1059.49\n\nDisclaimer-\n\nThe views and opinions stated by the author, or any people named in this article, are for informational purposes only, and they do not establish financial, investment, or other advice. Investing in or trading crypto assets comes with a risk of financial loss."
    }
]