[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LnVzYXRvZGF5LmNvbS9zdG9yeS9zcGVjaWFsL2NvbnRyaWJ1dG9yLWNvbnRlbnQvMjAyMy8wOS8yMi91bnJhdmVsaW5nLXRoZS1lbmlnbWEtaG93LWV0aGVyZXVtLWZ1bmN0aW9ucy83MDkyOTk4NDAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Unraveling the Enigma: How Ethereum Functions - USA TODAY",
        "content": "Jon Stojan\n\nContributor\n\nUnraveling the enigma that is Ethereum might seem like attempting to decode an ancient cipher, but the mystery is not as daunting as it appears. At its core, Ethereum functions as a decentralized platform, a digital soil from which digital contracts and decentralized applications (DApps) grow. To demystify this digital wizardry, let's delve deeper into the mechanisms of Ethereum, its smart contracts, and DApps.\n\nLet's begin our journey by picturing Ethereum as a grand ledger managing transactions and smart contracts. Like Bitcoin, it operates on blockchain technology, where blocks, akin to digital Lego pieces, assemble the chain. Each block contains a list of transactions, with Ethereum's blockchain offering a notable twist: every block also holds the most recent state of each smart contract.\n\nBut what makes a contract \"smart\"? Consider smart contracts as self-executing contracts, eliminating the need for intermediaries. They represent a kind of digital handshake that is only set in code and triggers once the conditions align. Let's visualize this with a rudimentary example: Bob, an online merchant, and Alice, his customer. Alice orders a book from Bob. The smart contract, coded into Ethereum, awaits Bob's confirmation of the shipment. Once confirmed, it automatically transfers Alice's payment to Bob's digital wallet. Thus, trust between strangers is achieved through lines of code.\n\nWith the foundation set, we can now introduce the progeny of these smart contracts: decentralized applications, or DApps. Akin to regular apps on your smartphone, DApps perform specific tasks, such as managing finances or even running virtual worlds. However, they flourish under a democratic, decentralized setup, free from the shackles of a central authority. As the parent, the Ethereum blockchain allows these DApps to interact with its smart contracts, functioning as the backbone for these autonomous entities.\n\nPicture Ethereum as a busy city bustling with activity. Here, DApps are the buildings, each with its own purpose and design. Some might be banks, others stores, or even casinos. These establishments, built atop Ethereum's solid foundation, interact with each other via smart contracts—the city's law. The blockchain acts as the ledger, the town records, if you will, keeping an accurate and tamper-proof log of all transactions, big and small.\n\nAt the heart of all these transactions, Ethereum's native cryptocurrency, Ether, plays a pivotal role. Imagine Ether as the city's currency, playing a role in exchanges and transactions, from purchasing a virtual sword in a gaming DApp to powering a transaction in a financial one. The value of Ether fluctuates, much like the Bitcoin price, and serves as a medium of exchange within the Ethereum ecosystem.\n\nThe beauty of Ethereum lies not only in its technology but also in the democratic spirit that pervades its operations. Its system fosters collaboration and incentivizes every participant, creating an ecosystem where innovation thrives.\n\nIn summary, the Ethereum enigma unwinds itself into a simple yet brilliant concept. It is a decentralized platform powered by smart contracts and Ether, enabling the creation of DApps that revolutionize how we interact and transact in the digital realm. So, the next time you come across the term Ethereum, imagine a thriving digital city, its skyline etched with a plethora of DApps, all functioning seamlessly within the secure and democratic boundaries of its blockchain. In the end, the mystery is just an awe-inspiring vista of technological advancement."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMjIvdml0YWxpay1idXRlcmluLWNuYmMtaW50ZXJ2aWV3LWV0aGVyZXVtLWZvdW5kZXItb24tdXMtY3J5cHRvLWNyYWNrZG93bi5odG1s0gFvaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDkvMjIvdml0YWxpay1idXRlcmluLWNuYmMtaW50ZXJ2aWV3LWV0aGVyZXVtLWZvdW5kZXItb24tdXMtY3J5cHRvLWNyYWNrZG93bi5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Vitalik Buterin, the man behind ethereum, talks crypto and the U.S. crackdown - CNBC",
        "content": "Ethereum co-founder Vitalik Buterin in Prague, where he finds refuge with like-minded programmers looking to change the world through cryptography-powered technology. CNBC\n\nPRAGUE — For Vitalik Buterin, the idea of home is fleeting. The Russia-born coder, who built ethereum in his late teens, doesn't stay long in any one city anymore. Meanwhile, the list of places he won't go keeps growing. \"There's definitely a bunch of countries that I would have very gladly visited three years ago, that I'm much, much more apprehensive about visiting today,\" Buterin told CNBC in an interview in the Czech Republic. Buterin singled out his homeland of Russia as one of the destinations he now avoids. The Canadian emigre has both Ukrainian and Russian roots but has actively supported the resistance movement in Ukraine. It has also become clear that pursuing privacy technologies and open-source code carries risk in certain global jurisdictions, giving Buterin new hesitation — for instance, the creators behind the open-source protocol Tornado Cash face charges in both the Netherlands and the U.S. Tornado Cash is used by some people to protect their privacy in the still-nascent crypto market, but a mixing service can also be used by criminals or nation-states to launder money. Many in the industry worry that targeting the developers who build a tool, instead of just the bad actors using that tool, sets a dangerous precedent. \"Even in countries that the mainstream considers to still be fairly normal places — I definitely worry about those more,\" Buterin says. The decentralized lifestyle suits Buterin, a 29-year-old programmer whose influence in the crypto sector transcends lines of code — or geography. Prague is one new center of gravity where he now finds refuge with like-minded programmers collectively looking to change the world through cryptography-powered technology.\n\nEthereum co-founder Vitalik Buterin speaks at ETHPrague 2023, an international conference drawing crypto developers from around the world. Photo: Pavel Sinagl\n\nWe met in a sparsely furnished room at the top of a sprawling industrial complex in the Holešovice district, a neighborhood once synonymous with slaughterhouses and steam mills, that's now home to Bohemian artists and some of crypto's most rebellious believers. The interior of this deceptively nondescript structure is a honeycomb of labyrinthine corridors and winding staircases that snake into its fortress-like belly, echoing the complexity of crypto to the unfamiliar. Today, the biggest challenge for Buterin and the ethereum community is making sure that it provides actual value to people. \"The way that I see the ethereum ecosystem in general is that the last decade was the decade of kind of playing around and getting ethereum right. This decade is the decade where we have to actually build things that people use,\" Buterin said, hands clasped, as he leaned forward from his perch on an ergonomic-friendly kneeling chair. He is arguably the most influential cryptographic developer alive today, but Buterin wasn't trying to step into the limelight when he wrote the ethereum white paper in 2013. Still, years after shunning public accolades and demurring countless invitations to speak to the press, he can't shake the fame — or the superlatives used to describe him. Buterin was named the world's youngest crypto billionaire at age 27 as the crypto market swelled to its peak in 2021. They call him \"V God\" in China, Time magazine dubbed him crypto royalty in its April 2022 cover story, and he faces mobs of fans desperate for a moment of his attention — and a selfie — virtually anywhere he goes on the planet. But Buterin isn't really any of those things. He isn't the prince of crypto. He isn't a cult leader of new gen cypherpunks. He isn't the wonkiest wonk, or the nerdiest nerd. He regularly gives away his fortune to worthy causes, knocking down his net worth. And he isn't, according to his own estimation, the be-all and end-all authority on the ethereum network. He is, however, someone who cares deeply about realizing his vision of a world where, among other things, humans have equitable access to money no matter who they are or where they live.\n\nZoom In Icon Arrows pointing outwards ETHPrague 2023 was held at Paralelní Polis in the Czech Republic. Pavel Sinagl\n\nButerin finds that cryptocurrencies realize their greatest utility in emerging economies — a phenomenon that has gained momentum in recent years. \"The stuff that we often find a bit basic and boring is exactly the stuff that brings lots of value to them right now, like making payments work, and savings,\" Buterin said, referring to lower-income countries. \"Just being able to plug into the international economy — these are things that they don't have, and these are things that provide huge value for people there,\" Buterin told CNBC. \"It's hard to even be interested in really abstract stuff like decentralized social media, when you don't really have those kinds of basics done.\" As U.S. investigators pressed criminal charges against the likes of Sam Bankman-Fried and federal regulators such as the Securities and Exchange Commission began cracking down on what they called the trade of unregistered securities, the action in crypto began to move overseas. Whereas investors in the U.S. tend to treat crypto as more of a get-rich-quick opportunity and a way to trade on volatility in a less-regulated market than traditional securities, Buterin typically gravitates to developing markets around the world — including Africa, where he traveled in February — where he sees tangible, day-to-day use cases for the technology he helped to build. \"When I visited Argentina back at the end of 2021, lots of people use crypto, lots of people love crypto,\" he said. \"I literally got recognized on the streets of Buenos Aires more often than I got recognized in San Francisco.\" But for crypto to become truly useful on a global scale, Buterin told CNBC, it ultimately has to move out of centralized entities such as custodial trading platforms and it must be simpler to use. \"I found coffee shops without even looking for them that just happened to accept bitcoin and ether — but the problem is, they were all using Binance,\" said Buterin. He said he appreciates centralized exchanges such as Binance for offering a smoother user experience to non-technical people living in countries where the average GDP is less than $10,000 per capita. Nevertheless, he believes that it must become more decentralized. \"Those centralized actors are vulnerable to, you know, both pressure from the outside and to themselves being corrupted,\" he said. Last year, a wave of bankruptcies in the crypto sector exposed grift throughout the industry. A lot of people got rich before the increase in interest rates and subsequent collapse of Luna in May 2022 set off a chain reaction that sent the entire market tumbling down, spurring a crypto winter that persists to this day. Bankman-Fried, the ex-CEO of now-bankrupt crypto exchange FTX, for example, faces criminal charges alleging that he promulgated a multibillion-dollar fraud scheme. Binance, the world's largest crypto exchange by trading volume, is being sued by both the SEC and the Commodity Futures Trading Commission over a raft of accusations, including the assertion that Binance commingled billions of dollars worth of user funds with its own money. Instead of placing blind trust in a central intermediary to act in the best interest of the customer, Buterin said, he believes the ideal solution comes down to writing better code so that users can deal directly on-chain. \"We need the experience on-chain to actually be good for regular people to use,\" Buterin said. \"We need it to actually be possible to do ethereum payments in a way where the transaction fee is less than five cents a transaction; in a way where the experience doesn't suck and randomly fail 2.3% of the time; in such a way that you need a Ph.D. in ethereum sciences to actually figure out what's going on,\" he said.\n\nEthereum co-founder Vitalik Buterin speaks at ETHPrague 2023, an international conference drawing crypto developers from around the world. Photo: Pavel Sinagl\n\nPrivacy and security are also key priorities. \"People need to have wallets that are actually secure, where if they lose the keys, they're not going to lose everything,\" Buterin added. A national digital currency could provide the ease of use he envisions, but he believes that decentralization is also critical, otherwise they'll devolve into another version of the existing banking system — only with more surveillance built in. \"That was a space where I think I had somewhat more hope, probably, naively, five years ago, because there were a lot of people who wanted to do things like make them blockchain friendly, give actual transparency and verifiability guarantees, and some kind of level of actual privacy,\" Buterin said, referring to central bank digital currencies, or CBDCs. CBDCs are a type of blockchain-based virtual currency that is fully regulated and has the backing of a country's central bank. The People's Bank of China, which is arguably the leader in CBDCs thus far, has been piloting its take on a CBDC for almost a decade. As of June, transactions using the digital yuan, or e-yuan, hit nearly $250 billion. But as CBDCs catch on, concerns have been raised about financial surveillance and monitoring tools which can be baked into these government-issued digital currencies. \"As each and every one of those projects come to a certain maturity,\" Buterin said, the privacy-preserving bits \"all sort of fall away as the thing comes closer and closer to being a 1.0. We get systems that are not actually much better than existing payment systems, because they just basically end up being different front-ends for the existing banking system.\" \"They end up being even less private and basically break down all of the existing barriers against both corporations and the government at the same time,\" he said.\n\nBuilding a new, brave world\n\nVitalik's father, Dmitry, introduced him to bitcoin in 2011. Both Vitalik and Dmitry Buterin, a computer scientist who had lived outside Moscow, were intrigued by the idea of a decentralized currency that operated outside the reach of governments or central banks. But Vitalik was keen to advance this new kind of decentralized ledger technology so that it could be put to greater use. What ultimately put him on the map was baking smart contracts — a programmable piece of code that aims to replace middlemen such as banks and lawyers in certain types of business transactions — into the blockchain. It was a game-changing innovation for the sector that led to an explosion of projects and initial coin offerings, or ICOs, built on ethereum. Today, the network serves as the primary building block for all sorts of crypto projects, including non-fungible tokens, or NFTs; decentralized finance, or DeFi; and web3, a still somewhat amorphous buzzword for a third generation of the internet that is decentralized and built using blockchain tech. Meanwhile, ethereum's native token, ether , is the world's second-biggest cryptocurrency by market cap after bitcoin.\n\nEthereum co-founder Vitalik Buterin speaks at ETHPrague 2023, an international conference drawing crypto developers from around the world. Photo: Pavel Sinagl\n\nIn ethereum circles, hackers are known as BUIDLers — an intentional misspelling of the word \"builders\" in a sort of homage to the bitcoin meme HODL, or \"hold on for dear life.\" The meme-off may seem silly, but it gets at the core of what separates these two very different sets of people. Bitcoiners tend to move more slowly on development, prioritizing security and decentralization above all else, while ethereum programmers tend to be more cavalier. While they aren't necessarily breaking things as they go, they do move fast and tinker aggressively. Last year, for example, the ethereum network fundamentally altered the way the blockchain secures its networks and verifies transactions, slashing its energy consumption by more than 99% in the process. Before this upgrade, both the bitcoin and ethereum blockchains had their own vast networks of miners all over the planet running highly specialized computers that crunched math equations in order to validate transactions. Proof-of-work uses a lot of energy, and it is one of the industry's biggest targets for criticism. But with the upgrade, ethereum migrated to a system known as proof-of-stake, which swaps out miners for validators. Instead of running large banks of computers, validators leverage their existing cache of ether as a means to verify transactions and mint new tokens. Buterin insisted that ethereum's move to a proof-of-stake model is more likely to stand up against government intervention. \"Proof-of-stake is actually easier to anonymize and harder to shut down than proof-of-work is,\" he said. \"Proof-of-work requires huge amounts of physical equipment and requires huge amounts of electricity. These are exactly the kinds of things that drug enforcement agencies have decades of experience detecting.\" About the ethereum network, he said, \"On the other hand, you've got your laptop. You just need a VPN somewhere, and you hide it in a corner. It's not perfect, but it's definitely much easier to hide.\"\n\nCoder behind the curtain\n\nIn previous appearances in Denver and Paris, Buterin's stage presence was colored with a subtle unease. But one-on-one in Prague, he really came alive, dropping the tics and effortlessly swapping the role of elusive coder for open-minded educator. His transparent communication style, coupled with his willingness to engage in profound philosophical discussions around concepts such as quadratic funding — a way to crowd-raise a central crypto treasury that is then used to fund public goods projects in ethereum, all with the help of an algorithm designed to optimize spending decisions — and soulbound digital identities on the blockchain have turned him into a trusted thought leader within the crypto community. Notably, Buterin is also very willing to field any question posed to him — especially those that address critiques of the network and of the scope of his leadership position today. Take the example of his own outsized role in the cryptocurrency he created. Unlike the pseudonymous and hidden Satoshi Nakamoto, who created bitcoin, Buterin is very much the face of ethereum. Some see this as a significant point of weakness for the network, because governments could target either Buterin or the Ethereum Foundation. But Buterin rejects those contentions. He said that five years ago a lot more was dependent on him personally and on the foundation, but today, clients — that is, software applications built on top of the blockchain that operate independently — have taken on a lot of the work. Ethereum has become its own self-governing ecosystem, with no single point of failure, he said. \"Even if the foundation got some magic freezing order in every jurisdiction at the same time, and if something happened to me at the same time, there's entire companies that are sole maintainers of ethereum clients that would totally be able to continue,\" explained Buterin. They call it the philosophy of subtraction. \"I think one of the ways of describing its aim is basically that the Ethereum Foundation isn't trying to kind of be a zealot, a long-term operator or dominator, or anything like that,\" he said. \"The goal of the Ethereum Foundation is to foster things that, once they start, can continue in a way that's totally independent.\" In terms of what's next for ethereum, Buterin said a big priority is focusing on privacy and scalability through zero-knowledge rollups. ZK-rollups are transactions bundled into sets and executed off-chain. This layer-two technology plays a major role in future upgrades that will ultimately help to make ethereum faster and cheaper to use. \"There's definitely an extent to which there are diverging interests and there is the extent to which I think the ecosystem does need to find a way to fight hard for the right to continue to build things with the kinds of privacy that we've been used to for thousands of years,\" Buterin said. Clarification: Buterin does not believe he's been targeted by any countries specifically and does not consider himself an outlaw, but is apprehensive about visiting certain countries because of his work."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjIvZXRoZXItdHVybnMtaW5mbGF0aW9uYXJ5LWFzLW5ldHdvcmstcmV2ZW51ZS1wbHVuZ2VzLXRvLTktbW9udGgtbG93L9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjIvZXRoZXItdHVybnMtaW5mbGF0aW9uYXJ5LWFzLW5ldHdvcmstcmV2ZW51ZS1wbHVuZ2VzLXRvLTktbW9udGgtbG93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ether Turns Inflationary as Network Revenue Plunges to 9-Month Low - CoinDesk",
        "content": "Crypto services provider Matrixport reiterated its negative outlook for the crypto asset compared to BTC in a Friday market update, citing “shockingly low revenues” and “lack of buzz” around the next protocol update. The firm forecasted earlier this month that ETH could fall to as low as $1,000 if the trend continues."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2VjbGlwc2Utc29sYW5hLXZpcnR1YWwtbWFjaGluZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Eclipse is using Solana's virtual machine to launch an Ethereum L2 - Blockworks",
        "content": "Eclipse will use Solana’s tech stack for its upcoming mainnet launch, the Ethereum layer-2 network project announced. Eclipse’s mainnet is expected to go live before the end of the year.\n\nBy design, a blockchain stack contains four different layers: execution, settlement, consensus and data availability.\n\nBlockchains, such as Bitcoin, Ethereum and Solana, carry out all these tasks in a single layer. This means that when a transaction is made, the blockchain executes, settles, reaches consensus, and ensures data availability all within the same layer.\n\nModular blockchains, on the other hand, are designed to focus on specific tasks.\n\nNeel Somani, founder of Eclipse, notes that he believes all layer-2s — validiums, optimiums and zk-rollups — should be considered “modular blockchains.”\n\n“At a minimum, they’ve all separated execution from settlement,” he said.\n\nNotably, Eclipse will use Solana Virtual Machine (SVM) for execution on its upcoming mainnet. The execution layer is the blockchain layer that holds the code and rules of a transaction; it enables transaction signing and smart contract execution.\n\nOn Ethereum, for example, transactions are executed sequentially. On Solana, however, there is a parallel execution environment. This means that more transactions can be processed at a lower cost.\n\n“That’s probably the biggest difference,” Somani said. “Another benefit is the ‘local fee markets,’ meaning if one application gets a ton of activity, it doesn’t impact fees for other apps. It is a smaller set of ‘opcodes,’ and it’s register-based which makes [zero-knowledge] proving easier.”\n\nElsewhere, Eclipse will use Risc Zero for proving. Settlement, like most rollups today, will take place on Ethereum — meaning that it will utilize Ethereum’s security properties to validate transactions. Data availability (DA) will be derived from Celestia.\n\nRead More: Why data availability sampling matters for blockchain scaling?\n\nUnlike many rollup solutions today, Celestia’s DA layer utilizes Data Availability Sampling (DAS) over having a Data Availability Committee (DAC), meaning there are fewer trust assumptions.\n\nThat said, the team at Eclipse will continue to keep a close eye on Ethereum’s EIP-4844 upgrade and consider migrating to Ethereum’s DA in the future.\n\n“It’s become clear that the single-threaded EVM is not sufficient to scale Ethereum, which is why apps are turning to their own app-specific rollups,” Somani told Blockworks. “Yet even the most sophisticated designs like Arbitrum are now seeing fee spikes — and it’s all because of the lack of parallelism and local fee markets.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ldGhlcmV1bS1zaGFuZ2hhaS1hY3Rpdml0eS1zbGFtbWVkLXdhbGwtc3RyZWV0LWJhbmsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Upgrade Activity Slammed by Wall Street Ban - CCN.com",
        "content": "Key Takeaways\n\nFor JPMorgan analysts, Ethereum’s behavior following the Shanghai upgrade has been “disappointing.”\n\nA future update may incorporate EIP-4844, according to Ethereum developers.\n\nEIP-4844 seeks to increase Ethereum’s scalability beyond what is possible with Layer 2 solutions.\n\nAccording to a study analysis released on Thursday, September 21, 2023, by JPMorgan (JPM), Ethereum’s Shanghai upgrade, which was introduced in April, does not seem to have increased activity on the biggest smart contract blockchain in the world as many had hoped.\n\nConcerns Over Ethereum’s Network Activity\n\nLead analysts Nikolaos Panigirtzoglou explained that while the energy consumption for the Ethereum network decreased by more than 99% as a result of the Merge upgrade’s switch from proof-of-work (PoW) to proof-of-stake (PoS), the Ether supply is decreasing, and staking increased significantly, the increase in network activity has been disappointing.\n\nAccording to JPM, following the Shanghai upgrade, daily Ethereum transactions have dropped by 12%, daily active addresses have decreased by over 20%, and the total value locked (TVL) in decentralized finance (DeFi) on the blockchain has fallen by approximately 8%.\n\nThe decline in network activity suggests that various “bearish forces” from the previous year, such as the Terra and FTX setbacks, the regulatory crackdown in the United States, and a contracting stablecoin market, may have offset the benefits of the Shanghai upgrade, the bank added.\n\nDespite a 50% increase in staking since the Shanghai update, which bolsters network security, the “prevalence of liquid staking protocols like Lido remains uncomfortably high, raising concerns about centralization,” the bank noted.\n\nThe Merge, which involved switching from a more energy-intensive PoW to the PoS consensus process, happened in September 2022.\n\nThe Shanghai upgrade, implemented in April of this year, enabled the withdrawal of staked ether (stETH). DeFi encompasses a wide range of blockchain-based financial activities, including lending, trading, and other transactions. The total value of digital assets deposited in a DeFi protocol is referred to as TVL.\n\nEIP-4844 Upgrade For Ethereum\n\nThe article suggested that the impending EIP-4844 upgrade, also known as Protodanksharding , holds the potential for a significant uptick in Ethereum network activity. However, it cautioned that “continuing bearish crypto forces remain a headwind.”\n\nWith the EIP-4844 upgrade or protodanksharding, the cryptocurrency sector is now anticipating for a significant rise in Ethereum network activity. According to the experts, “continued bearish crypto forces remain a headwind,” nonetheless.\n\nIn order to fully execute danksharding, which differs from the initially anticipated sharding method, protodanksharding is a necessary first step. Danksharding introduces data-containing blobs—temporary data packets linked to blocks that can hold more data than the blocks themselves—instead of slicing the Ethereum blockchain into numerous shard chains.\n\nLayer 2 networks like Arbitrum and Optimism, which bundle transactions before sending them to the main chain, could gain from this. While the data blobs won’t alter Ethereum block sizes, they’ll provide extra temporary data space for Layer 2 rollups, potentially enhancing network speed and reducing transaction costs.\n\nCurrently planned for the fourth quarter of this year, protodanksharding might now happen in the first quarter of 2024."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzIxL2lmLW1ldHJpYy1pcy1yaWdodC1ldGhlcmV1bS1jb3VsZC1iZS11bmRlcnZhbHVlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "If This 1 Metric Is Right, Ethereum Could Be Massively Undervalued - The Motley Fool",
        "content": "Ethereum (ETH -0.58%) is up a resounding 37% so far this year. That might sound impressive, but keep in mind that Ethereum is still trading at nearly the same level it was 12 months ago when it completed The Merge. Shouldn't Ethereum's price have soared after this much-hyped technological breakthrough?\n\nClearly, crypto investors aren't impressed by technical upgrades and are waiting for the next big catalyst to appear for Ethereum. But that next big catalyst might be right under their noses, and they aren't even aware of it yet. As a result, Ethereum could be massively undervalued at its current price of $1,645.\n\nLayer 2 blockchain activity\n\nThe one metric to keep an eye on is the amount of activity happening on Layer 2 blockchain networks. These Layer 2 blockchains are built directly on top of the main Ethereum network, and help make Ethereum run faster, more efficiently, and more affordably. As such, they are very much part of the broader Ethereum ecosystem, and should be taken into account when thinking about Ethereum's growth prospects.\n\nEven after The Merge, Ethereum needs these Layer 2 blockchains, and founder Vitalik Buterin has always been clear that he supports the development of these Layer 2 networks. They are not cannibalizing the future growth of Ethereum. Instead, they are actively contributing to a much faster rate of growth for Ethereum.\n\nTo give you an idea of just how important these Layer 2 blockchain networks are, there are now five that rank among the top 55 cryptocurrencies by market capitalization. Granted, many of them are hardly household names. With the exception of Polygon, which garnered a fair amount of attention around the time of The Merge, they are quietly working behind the scenes, helping to scale Ethereum.\n\nImpact on growth\n\nThese Layer 2 blockchains are directly contributing to Ethereum's market dominance in key areas. For example, take non-fungible tokens (NFTs). If you examine the 30-day sales volume for NFTs, Ethereum is still the clear leader, with just under $200 million in sales. The next biggest Layer 1 blockchain network is Solana, with just under $30 million in sales. So, as a quick approximation, it's possible to say that Ethereum is doing nearly 7 times the sales volume of its next closest competitor.\n\nHowever, two of the top blockchains for NFT sales volume are Immutable X and Polygon, and both of these are Layer 2 blockchains for Ethereum. When you add in the 30-day NFT sales volume for both of these (approximately $50 million total), then it's possible to say that Ethereum is doing 8 times or even 9 times the sales volume of its next closest competitor.\n\nAnd the same story is true in the decentralized finance (DeFi) market. Again, Ethereum is the clear market leader here, accounting for nearly 55% of Total Value Locked (TVL). This metric describes how much value is \"locked up\" in various DeFi protocols, and is the single best indicator for overall DeFi strength. But four Layer 2 blockchains also rank in the Top 10 for TVL, and these account for another 10% of TVL on an aggregate basis. Taking this into account, Ethereum is responsible for a staggering two-thirds of all TVL in the blockchain world.\n\nValuation models\n\nAs demonstrated above, taking into account Layer 2 blockchain activity shows just how much Ethereum is potentially undervalued. A new report from crypto research firm RxR came to a similar conclusion. Using a valuation model based on Metcalfe's Law, which states that the value of any network is directly proportional to the square of the number of users, the research firm suggested that Ethereum might be undervalued by as much as 27%. In short, investors are overlooking the massive user growth on Layer 2 blockchain networks, and that is causing them to undervalue Ethereum.\n\nGranted, there are bound to be some skeptics who think that Metcalfe's Law shouldn't be applied to cryptocurrencies. After all, it's inconclusive whether adding a new user to an existing blockchain network should lead to a huge increase in value. It's different in the case of, say, telecom networks, because it's immediately clear how each new user (i.e., the person paying the phone bill each month) can be monetized.\n\nMoreover, Metcalfe's Law can lead to some pretty dizzying price estimates for cryptocurrencies. During the last crypto bull market rally, models based on Metcalfe's Law were projecting a $20,000 price target for Ethereum. The all-time high for Ethereum is just under $5,000, so that price target was wildly off the mark.\n\nSo is Ethereum undervalued or not?\n\nStill, it's easy to see how Ethereum could be significantly undervalued. Ethereum's metrics seem to be flatlining or declining. But dig deeper, and you'll see Layer 2 activity is taking off. The big question you have to ask yourself as an investor is whether this Layer 2 activity should be additive to the overall value of Ethereum.\n\nIt might be a controversial take, but I'm firmly in the camp of investors and analysts who think that Ethereum is trading at a huge discount right now. There's just too much activity happening on Layer 2 blockchain networks to ignore."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vYmxvY2tnZWVrcy5jb20vZ3VpZGVzL3doby1lYXJucy1ldGhlcmV1bS1nYXMtZmVlcy1hbi1pbi1kZXB0aC1ndWlkZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Who Earns Ethereum Gas Fees: An In-Depth Guide - Blockgeeks",
        "content": "Who earns Gas fees on the Ethereum blockchain? – sounds like some kind of intergalactic fuel for cryptocurrency transactions, right?\n\n…With Ethereum’s transaction speed and transaction verification, these gas fees are charges incurred for processing transactions on the network. Well, it’s not exactly rocket science, but it does power the Ethereum spaceship with cryptocurrency and the bitcoin blockchain! The Ethereum blockchain network operates on gas units. So, hold on tight as we take a hilarious journey through the world of charging Ethereum gas fees in cryptocurrency wallets. The hashrate is an important factor to consider.\n\nNow, you might be wondering what these gas fees, charge for ethereum transactions, are all about. It’s important to understand that these fees are necessary to incentivize ethereum miners and maintain the hashrate of the network. Picture this: whenever you make a transaction involving cryptocurrency on the Ethereum network, whether it’s sending ETH or interacting with decentralized applications (dApps), you gotta pay up a charge. These cryptocurrency fees are like tolls for investors using the Ethereum highway, charging them to keep things running smoothly and allowing for tips.\n\nUnderstanding gas fees is a crucial tip for investors who want to navigate the Ethereum universe without breaking the bank. Gas fees are influenced by factors such as block size and can significantly impact an investor’s control over their finances. The complexity of ethereum transactions, smart contracts, and network congestion can impact gas fee levels for ethereum miners. This is especially true due to the limited block size, which affects the efficiency of eth transfers. So, before embarking on your interstellar ETH transfer journey, investors should buckle up and get ready to learn how these fees, including the gas limit, play a significant role in determining the cost of using dApps. Here’s a tip: consider the size of the transaction when calculating fees.\n\nBut wait! High gas fees have been a major concern for Ethereum investors, causing quite a stir within the community. Here’s a tip to tackle the issue: consider the size of your transactions to avoid excessive fees. In this blog post, we’ll delve into the hot topic of eth transfer fees and explore ways to keep those fees from burning through your digital pockets. We’ll provide tips on how to protect yourself from potential attack and manage your eth gas efficiently.\n\nHow Gas Fees Work on the Ethereum Blockchain\n\nGas fees are an integral part of the Ethereum blockchain, serving as a measure of computational effort required to execute transactions or smart contracts. These fees help protect against potential attack on the network. These fees help protect against potential attack on the network. Understanding how gas fees and attacks work is crucial for anyone engaging with the Ethereum network, whether you are a user, miner, or developer.\n\nGas Consumption and Operations\n\nEach operation on the Ethereum network consumes a specific amount of gas, which includes a transaction fee. This fee is necessary to prevent attacks and ensure the priority of the transaction. These operations, including eth transfers and complex smart contract executions, can be affected by ethereum gas fees. It is important to keep track of the eth gas fees chart to avoid high fees. Additionally, it is crucial to be aware of potential attacks when conducting these operations. For example, executing a decentralized application (DApp) that involves multiple computations and interactions requires more gas compared to transferring Ether from one account to another. This is because the DApp is more vulnerable to attack.\n\nGas consumption in Ethereum (ETH) is influenced by factors such as the complexity of the operation, the data being processed, and the risk of a potential attack. As each transaction or smart contract execution consumes gas, it is important to consider these costs when interacting with the Ethereum blockchain to prevent any potential attack.\n\nSetting Gas Price and Transaction Prioritization\n\nUsers have the ability to set their desired gas price when submitting transactions in ETH. This feature helps protect against potential attacks. The gas price represents the amount of Ether they are willing to pay per unit of gas consumed during an attack. By setting a higher gas price, users incentivize miners to include their ETH transactions in blocks more quickly, reducing the risk of an attack.\n\nMiners play a vital role in processing transactions on the Ethereum network, defending against potential attack. They prioritize ETH transactions based on their potential earnings from gas fees to prevent an attack. Transactions with higher gas prices in eth are given priority, leading to faster processing times and confirmation on the blockchain, which helps prevent attack.\n\nFailed Transactions and Gas Costs\n\nEven if an ETH transaction fails due to an attack, error, or insufficient funds, it still incurs gas costs. This is because computational resources were utilized during its execution attempt, specifically for the eth gas. Therefore, it’s essential to double-check transaction details and consult the ethereum gas fees chart before submitting them to avoid unnecessary expenses.\n\nFailed transactions in the Ethereum network can occur due to various reasons such as incorrect input data or insufficient gas limits set for complex operations involving eth. Being mindful of these factors can help minimize failed transaction costs and optimize your interaction with the Ethereum blockchain.\n\nGas Limits and Computation Restrictions\n\nGas limits are imposed on each block in the Ethereum blockchain, restricting the amount of computation that can be performed within a block. This limitation ensures that blocks remain manageable in size and prevents abuse of computational resources for eth.\n\nWhen submitting a transaction or executing a smart contract, it’s important to consider the gas limit. If the gas required exceeds the block’s gas limit, the transaction will fail. Therefore, users must estimate and set an appropriate gas limit to ensure successful execution.\n\nFactors Impacting High Ethereum Gas Fees\n\nNetwork Congestion and Competition for Block Space\n\nDuring peak usage periods, the Ethereum network experiences increased congestion, leading to a surge in gas fees. This is primarily due to the high demand for block space as more transactions compete to be included in each block. Think of it like rush hour traffic on a busy highway, where everyone is vying for a spot on the road.\n\nAs the number of transactions being processed increases, so does the competition among users who are willing to pay higher gas fees to have their transactions prioritized by miners. Miners are incentivized to include transactions with higher fees because they earn those fees as rewards. Consequently, this competition drives up gas fees and makes it more expensive for users to interact with the Ethereum network.\n\nComplex Smart Contracts and Higher Gas Costs\n\nSmart contracts on Ethereum can range from simple agreements to highly intricate programs with complex logic. The computational resources required to execute these smart contracts directly impact gas costs. More intricate smart contracts often involve multiple conditions, loops, or complex calculations that require additional processing power.\n\nWhen a user interacts with such a smart contract, they need to pay for every computation step executed by the Ethereum Virtual Machine (EVM). Each step consumes gas, and since gas has a monetary value attached to it, complex smart contracts naturally result in higher gas costs.\n\nDeFi’s Contribution to High Gas Fees\n\nThe rise of decentralized finance (DeFi) applications has been one of the main factors contributing significantly to high gas fees on the Ethereum network. DeFi protocols enable users worldwide to access financial services without intermediaries using blockchain technology.\n\nHowever, many popular DeFi applications operate on Ethereum and rely heavily on smart contracts for their functionality. As more users flock towards DeFi platforms seeking opportunities such as yield farming or lending/borrowing assets, there is an exponential increase in transaction volume.\n\nThis surge in demand further amplifies network congestion, leading to higher gas fees. Users engaging in DeFi activities often find themselves paying substantial amounts just to interact with these platforms due to the intense competition for block space.\n\nScalability Limitations and Congestion Spikes\n\nThe current Ethereum network faces scalability limitations, which contribute to increased congestion and subsequent fee spikes. Ethereum’s design, while groundbreaking, has struggled to keep up with the growing demand for its services.\n\nAs more users join the network and execute transactions simultaneously, the limited capacity of Ethereum’s infrastructure becomes apparent. The network can only process a certain number of transactions per second, resulting in bottlenecks during peak periods.\n\nTo address this issue, Ethereum is undergoing a transition from its current Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoS) through the implementation of Ethereum 2.0. This upgrade aims to improve scalability by introducing shard chains that will increase the network’s transaction processing capacity.\n\nInefficient Resource Allocation Mechanisms\n\nThe lack of efficient resource allocation mechanisms within the Ethereum network also affects fee optimization. Gas fees are determined by two main components: the base fee and priority fee.\n\nThe base fee increases when there is high demand for block space and decreases when there is less competition. However, it does not adjust instantaneously but rather follows a pricing algorithm that takes into account historical demand trends.\n\nCalculation of Ethereum Gas Fees: Pre and Post London Upgrade\n\nPre-London Upgrade:\n\nBefore the London upgrade, Ethereum gas fees were calculated by multiplying the “gas price” with the “gas used.” This calculation determined the total cost of a transaction on the Ethereum network. Users had the flexibility to manually set their preferred “gas price” based on urgency or priority.\n\nThe gas price represented the amount of Ether (ETH) users were willing to pay per unit of gas. Gas, in this context, referred to the computational effort required to execute a specific operation or smart contract on the network. The gas used indicated how much computational work was performed during a transaction.\n\nFor instance, if a user set a higher gas price and more gas was consumed for their transaction, they would end up paying a higher fee. Conversely, setting a lower gas price could result in slower processing times if miners prioritized transactions with higher fees.\n\nPost-London Upgrade:\n\nWith the introduction of EIP 1559 through the London upgrade, Ethereum aimed to improve fee predictability and reduce volatility. This upgrade brought significant changes to how gas fees were calculated and provided users with more control over their transactions.\n\nOne key element introduced by EIP 1559 was the concept of base fee. The base fee is dynamically adjusted based on network congestion levels, aiming to maintain blocks around 50% full. When there is high demand for block space, causing congestion, the base fee increases; conversely, during periods of low demand, it decreases. This mechanism allows for greater fee predictability as users can estimate how much they will need to pay based on prevailing network conditions.\n\nEIP 1559 introduced tips as an incentive mechanism for miners. Users can include tips when submitting transactions to incentivize miners for faster processing and inclusion in blocks. Tips are optional and go directly to miners as an additional reward beyond the base fee.\n\nThe inclusion of the base fee and tips provides users with a better understanding of how gas fees are determined. They can now make more informed decisions when setting their preferred gas price, taking into account the dynamic nature of the base fee and whether they want to add tips for faster transaction processing.\n\nWho Benefits from Ethereum Gas Fee Collection\n\nMiners: The Primary Beneficiaries\n\nMiners play a crucial role in the Ethereum network and are the primary beneficiaries of gas fee collection. These individuals or groups of individuals dedicate their computational power to validate transactions and secure the network. In return for their efforts, miners receive gas fees as rewards for including transactions in blocks they mine.\n\nWhen a user initiates a transaction on the Ethereum blockchain, they attach a certain amount of gas to it. This gas acts as fuel that powers the execution of smart contracts and dApps. Miners prioritize transactions with higher gas fees because including them in blocks allows them to earn more rewards. Thus, high gas fees can lead to increased miner revenue, creating an incentive for miners to actively participate in securing the network.\n\nIncentivizing Network Security and Participation\n\nThe collection of gas fees not only benefits miners but also incentivizes network security through mining participation. As miners compete to include transactions in blocks, they contribute to the overall security and decentralization of the Ethereum network. With more miners actively participating, it becomes increasingly difficult for any single entity or group to manipulate or control the system.\n\nFurthermore, high gas fees provide additional motivation for miners to invest in powerful hardware and infrastructure required for efficient mining operations. This investment strengthens the overall security of the network by increasing its computational power and making it more resistant to potential attacks.\n\nIndirect Benefits for the Ethereum Community\n\nWhile miners directly benefit from gas fee collection, the Ethereum community as a whole also reaps indirect benefits from this process. By supporting a secure and decentralized network through mining activities, miners help maintain trust among users and developers alike.\n\nA reliable blockchain infrastructure is essential for developers who create decentralized applications (dApps) or smart contracts on Ethereum. Gas fees ensure that these applications execute reliably without any interruption or manipulation. Developers can have confidence that once their code is deployed on the blockchain, it will operate as intended, providing a seamless user experience.\n\nDevelopers and the Reliable Execution of dApps\n\nDevelopers who create dApps or smart contracts are among the key beneficiaries of gas fee collection. Gas fees serve as a mechanism to prioritize transactions and ensure their reliable execution. By attaching an appropriate amount of gas to their transactions, users can guarantee that their interactions with dApps will be processed in a timely manner.\n\nGas fees also incentivize developers to optimize their code and make it more efficient. Since gas fees are directly related to the computational resources required for executing transactions, developers have an incentive to write smart contracts that minimize unnecessary operations and reduce gas consumption. This optimization benefits both users and developers by making transactions more cost-effective and improving overall network performance.\n\nStrategies to Reduce Ethereum Gas Fees\n\nOptimize Smart Contract Code and Reduce Complexity\n\nOne effective strategy for reducing Ethereum gas fees is to optimize the code of your smart contracts and minimize complexity. When writing smart contract code, every operation consumes gas, which in turn incurs fees. By optimizing your code, you can reduce the amount of gas consumed by each transaction, ultimately lowering the associated fees.\n\nTo achieve this optimization, it’s important to carefully analyze and streamline your smart contract logic. Look for opportunities to simplify operations and eliminate any unnecessary steps. For example, you can avoid redundant calculations or data storage that may not be essential for the contract’s functionality. By doing so, you can significantly decrease the gas consumption and subsequently reduce the fees paid for executing transactions on the Ethereum platform.\n\nUtilize Layer-Two Scaling Solutions\n\nAnother effective approach to mitigating high Ethereum gas fees is by leveraging layer-two scaling solutions. These solutions aim to alleviate congestion on the main Ethereum network by moving certain transactions off-chain or onto secondary networks known as sidechains or rollups.\n\nBy utilizing layer-two scaling solutions, you can significantly reduce gas costs for specific types of transactions that are suitable for off-chain processing. These solutions allow users to perform actions like token swaps or transfers at a fraction of the cost compared to executing them directly on the Ethereum mainnet.\n\nLayer-two scaling works by batching multiple transactions together and submitting them as a single transaction on-chain. This consolidation reduces overall gas consumption and enables more efficient use of network resources. However, it’s important to note that not all types of transactions are suitable for layer-two scaling, so careful consideration should be given when deciding which actions can benefit from this approach.\n\nMonitor Network Congestion and Select Appropriate Times\n\nGas fees on Ethereum often fluctuate based on network congestion levels. During periods of high demand, such as when there are popular decentralized applications (dApps) or significant market activity, gas fees tend to spike. Conversely, during periods of lower network congestion, gas fees can be considerably lower.\n\nTo take advantage of lower gas fees, it’s advisable to monitor the Ethereum network and select appropriate times for executing transactions. By observing historical trends and analyzing real-time data on gas prices, you can identify periods of relatively low congestion and initiate your transactions during those windows.\n\nVarious online platforms and tools provide information about current gas prices and network congestion levels. These resources enable users to make informed decisions regarding the optimal timing for their transactions. By strategically planning your activities based on network conditions, you can minimize the impact of high gas fees on your Ethereum transactions.\n\nLeverage Transaction Batching Techniques\n\nTransaction batching is a technique that allows multiple actions to be executed within a single transaction on the Ethereum platform. Instead of submitting each action as an individual transaction, batching combines them into one comprehensive transaction. This consolidation reduces the overall number of operations performed on-chain and subsequently lowers the associated gas fees.\n\nBy leveraging transaction batching techniques, you can optimize your Ethereum wallet’s usage by grouping together similar actions or operations. For example, if you frequently perform token transfers or interact with multiple decentralized finance (DeFi) protocols, you can combine these actions into a single batched transaction.\n\nBatching not only reduces gas consumption but also enhances efficiency by reducing the number of interactions required with smart contracts.\n\nFuture Outlook: Lowering Gas Costs and “The Merge”\n\nUpcoming upgrades like Eth2 (Ethereum 2.0) aim to address scalability issues, potentially reducing network congestion and lowering gas costs.\n\nEth2, also known as Ethereum 2.0, holds great promise for the future of the Ethereum network. One of its primary objectives is to tackle the scalability challenges that have plagued Ethereum in recent years. As demand for transactions on the network has grown exponentially, so too have gas prices – a reflection of the cost associated with executing smart contracts and interacting with decentralized applications (dApps).\n\nWith Eth2, developers are working on introducing several significant upgrades that could alleviate these concerns. By implementing shard chains, Eth2 will enable parallel processing within the Ethereum network. This means that multiple transactions can be processed simultaneously across different shards, increasing the overall capacity of the network.\n\nImagine a busy highway with multiple lanes instead of just one congested road. Shard chains act as these additional lanes, allowing more vehicles (transactions) to flow smoothly without causing traffic jams or excessive delays. As a result, this expansion in capacity has the potential to significantly reduce network congestion and subsequently lower gas costs.\n\nThe introduction of shard chains in Eth2 will enable parallel processing, increasing the capacity of the Ethereum network.\n\nShard chains represent a fundamental shift in how Ethereum operates by introducing parallel processing capabilities. Currently, all transactions on Ethereum need to be processed sequentially through a single main chain known as the Beacon Chain. This limitation often leads to bottlenecks and increased transaction fees during periods of high demand.\n\nHowever, with shard chains set to be implemented in Eth2’s roadmap, this bottleneck issue may soon become a thing of the past. Shard chains will allow for concurrent execution of transactions across different shards within the Ethereum ecosystem. Each shard will have its own mini-blockchain capable of handling its subset of transactions independently.\n\nThink of it as having multiple smaller teams working on different tasks simultaneously, rather than waiting for a single team to complete each task one after another. This parallel processing capability will significantly increase the network’s capacity and throughput, enabling Ethereum to handle a much higher volume of transactions without experiencing congestion or exorbitant gas costs.\n\nThe implementation of “The Merge” will transition Ethereum’s consensus mechanism from proof-of-work (PoW) to proof-of-stake (PoS), further improving scalability and energy efficiency while potentially impacting miner revenue streams.\n\n“The Merge” refers to the upcoming transition in Ethereum’s underlying consensus mechanism. Currently, Ethereum relies on the energy-intensive proof-of-work (PoW) algorithm for transaction validation and block creation. However, this approach has its limitations.\n\nTo address these concerns, Ethereum plans to shift from PoW to proof-of-stake (PoS) with the introduction of Eth2. In a PoS system, validators are chosen based on the number of cryptocurrency tokens they hold and are willing to “stake” as collateral. These validators then take turns proposing and validating blocks based on their stake, rather than through computational work as in PoW.\n\nThis transition holds several advantages for the Ethereum network. Firstly, it greatly improves scalability by reducing the computational burden required for transaction validation. Without relying on complex computations, PoS allows for faster block confirmation times and increased throughput.\n\nSignificance of Ethereum Gas Fees for Investors\n\nIn conclusion, understanding the significance of Ethereum gas fees is crucial for investors navigating the world of decentralized finance. Gas fees play a pivotal role in determining the cost and speed of transactions on the Ethereum blockchain. By comprehending how gas fees work and the factors that impact their levels, investors can make informed decisions to optimize their investment strategies.\n\nTo take advantage of lower gas fees and maximize your returns, consider implementing some practical strategies. For instance, you can leverage layer 2 solutions like Polygon or Optimism to conduct transactions at reduced costs. Staying updated with upcoming upgrades such as the London Upgrade and the long-awaited transition to Proof-of-Stake through “The Merge” can provide insights into potential improvements in gas fee dynamics.\n\nRemember, investing in Ethereum is not just about buying and holding tokens; it also involves actively managing transaction costs. By keeping an eye on gas fees and adopting smart strategies, you can position yourself for success in this ever-evolving landscape.\n\nFAQs\n\nWhat are some common factors that contribute to high Ethereum gas fees?\n\nSeveral factors contribute to high Ethereum gas fees. The most significant ones include network congestion, demand for computational resources required by smart contracts, and the complexity of executing specific operations within a transaction.\n\nCan I reduce my Ethereum gas fees without compromising transaction speed?\n\nYes! There are several strategies you can employ to reduce your Ethereum gas fees while still maintaining reasonable transaction speeds. Some options include utilizing layer 2 scaling solutions, batching multiple transactions together, or conducting transactions during periods of lower network activity.\n\nWho collects the Ethereum gas fees?\n\nEthereum miners collect the gas fees associated with each transaction they process. These miners provide computational power to validate transactions and secure the network while being rewarded with both newly minted Ether (ETH) and collected transaction fees.\n\nAre there any plans to lower Ethereum gas costs in the future?\n\nYes! The Ethereum community has been actively working on various solutions to lower gas costs. The London Upgrade, which introduced the EIP-1559 fee structure, is one example. The upcoming transition to Proof-of-Stake through “The Merge” is expected to significantly reduce gas fees by replacing miners with validators.\n\nHow can I stay updated on Ethereum gas fee dynamics and optimizations?\n\nTo stay informed about Ethereum gas fee dynamics and optimizations, it’s recommended to follow reputable sources such as official Ethereum blogs, developer forums like Reddit’s r/ethereum subreddit, and influential voices in the blockchain space. Joining relevant online communities or participating in decentralized finance (DeFi) platforms can provide valuable insights from experienced users."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1wbHVuZ2VzLTE1NjUv0gFFaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXBsdW5nZXMtMTU2NS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Plunges After Rejection, Are Bears Back In Action? - NewsBTC",
        "content": "Ethereum price gained bearish momentum below $1,620 against the US Dollar. ETH is showing bearish signs and might decline further toward $1,540.\n\nEthereum declined further below the $1,600 support zone.\n\nThe price is trading below $1,620 and the 100-hourly Simple Moving Average.\n\nThere are two bearish trend lines forming with resistance near $1,600 and $1,620 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to move down and test the $1,540 support in the short term.\n\nEthereum Price Takes Hit\n\nEthereum’s price started a fresh decline from the $1,660 and $1,670 resistance levels. ETH declined below the $1,620 support level to enter a bearish zone and underperformed Bitcoin.\n\nThe bears even pushed the price below the $1,600 support and the 100-hourly Simple Moving Average. A low is formed near $1,568 and the price is now attempting a recovery wave. There was a move above the $1,580 level. The price is testing the 23.6% Fib retracement level of the recent decline from the $1,660 swing high to the $1,568 low.\n\nEther is now trading below $1,620 and the 100-hourly Simple Moving Average. There are also two bearish trend lines forming with resistance near $1,600 and $1,620 on the hourly chart of ETH/USD.\n\nOn the upside, the price might face resistance near the $1,600 level and the first trend line. The next resistance is near the $1,610 level, the second trend line, and the 100-hourly Simple Moving Average. The trend line is also near the 50% Fib retracement level of the recent decline from the $1,660 swing high to the $1,568 low.\n\nSource: ETHUSD on TradingView.com\n\nA close above the $1,620 resistance might send the price toward the $1,650 resistance. The next major barrier is near the $1,660 level. A close above the $1,660 level might send Ethereum further higher toward $1,750.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,620 resistance, it could start another decline. Initial support on the downside is near the $1,565 level.\n\nThe next key support is $1,540. A downside break below $1,540 might accelerate losses. In the stated case, there could be a drop toward the $1,440 level in the coming days.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,540\n\nMajor Resistance Level – $1,620\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9tYXNzaXZlLWV0aGVyZXVtLXdoYWxlLWNvbnRpbnVlcy10by1zZWxsLXNoaWZ0aW5nLTUwNDAtZXRo0gFOaHR0cHM6Ly91LnRvZGF5L21hc3NpdmUtZXRoZXJldW0td2hhbGUtY29udGludWVzLXRvLXNlbGwtc2hpZnRpbmctNTA0MC1ldGg_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Massive Ethereum Whale Continues to Sell, Shifting 5,040 ETH - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nOn-chain analytics provider Lookonchain reports a massive ETH shift by a large holder, or whale, in recent hours.\n\nAdvertisement\n\nA large ETH whale withdrew 5,040 ETH from the Binance crypto exchange, totaling $8.17 million. The whale has withdrawn 24,548 ETH worth $40 million from Binance since Sept. 5, according to Lookonchain, with an average withdrawal price of $1,631.\n\nThe smart whale withdrew 5,040 $ETH($8.17M) from #Binance again ~20 mins ago.\n\n\n\nAnd the whale has withdrawn a total of 24,548 $ETH($40M) from #Binance since Sept 5, with an average withdrawal price of $1,631.https://t.co/J0BhAsGJhQ pic.twitter.com/xxb6MQ3L19 — Lookonchain (@lookonchain) September 21, 2023\n\nDepositing assets on an exchange usually indicates a desire to sell, while withdrawals may indicate a desire to accumulate.\n\nAnother whale sent 30,000 ETH (almost $50 million) to Binance, OKX and KuCoin on Sept. 19, according to Lookonchain.\n\nIn a string of moves, a whale that had been dormant for two years awoke and transferred 10,000 ETH worth $16.5 million out. Days later, the whale deposited 10,000 ETH worth $16.5 million to Binance, OKX and KuCoin via three different addresses. The whale then sent out another $10,000 ETH valued at $16.5 million.\n\nIn the most recent move of ETH to exchanges, Ethereum cofounder Vitalik Buterin moved 300 ETH (about $493,000) to Kraken on Tuesday.\n\nThe impact of the move is seen in the ETH price. This is because market participants pay close attention to whales' on-chain actions since they are regarded as well-informed and have an influence on the market.\n\nEthereum has lost the $1,600 level and is currently trading lower daily. The most recent price drop follows after whales, or huge holders, moved ETH to crypto exchanges, increasing concerns about potential price drops.\n\nETH was down 2.69% in the last 24 hours to $1,583 at the time of writing."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvdW5kZXJzdGFuZGluZy1ldGhlcmV1bS1tZXJnZS1hLWdhbWUtY2hhbmdlci1mb3ItY3J5cHRvY3VycmVuY3ktaW52ZXN0b3JzL9IBfGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvdW5kZXJzdGFuZGluZy1ldGhlcmV1bS1tZXJnZS1hLWdhbWUtY2hhbmdlci1mb3ItY3J5cHRvY3VycmVuY3ktaW52ZXN0b3JzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Understanding Ethereum Merge: A Game-Changer for Cryptocurrency Investors - Finance Magnates",
        "content": "The cryptocurrency industry was buzzing with expectation and excitement as Ethereum, the second-largest blockchain by market capitalization, prepared for the Ethereum Merge. In this detailed article, we will look at the Ethereum Merge concept, its relevance in the crypto industry, the mechanics of this transfer, and the impact it had on cryptocurrency investors.\n\nIntroduction\n\nSince its creation, Ethereum, also known as the backbone of the decentralized finance (DeFi) ecosystem and non-fungible tokens (NFTs), has used a proof-of-work (PoW) consensus mechanism. However, the scalability and energy efficiency of Ethereum have long been a source of contention. The Ethereum community went through a long journey known as the Ethereum Merge to address these concerns and pave the path for a more sustainable and scalable future.\n\nUnderstanding the Ethereum Network\n\nBefore we go into the Ethereum Merge, let's take a quick look at the Ethereum network and its current state. Ethereum is a decentralized blockchain that allows smart contracts and decentralized apps (DApps) to be created. It has garnered significant acceptance because to its adaptability and programmability, enabling a plethora of initiatives in the cryptocurrency industry.\n\nIntroduction of Ethereum Merge\n\nThe Ethereum Merge includes the network's consensus mechanism switching from proof of work (PoW) to proof-of-stake (PoS Proof-of-Stake (PoS) Proof-of-stake is a type of consensus algorithm in which a blockchain network aims to achieve distributed consensus. It is also process used to reach an agreement on a single data value. In PoS-based cryptos, the creator of the next block is chosen through various combinations and parameters. In essence, an individual person can mine or validate block transactions based on how many coins he or she holds. Adhering to this concept, the more Bitcoin or altcoin owned by a miner, the greater the mini Proof-of-stake is a type of consensus algorithm in which a blockchain network aims to achieve distributed consensus. It is also process used to reach an agreement on a single data value. In PoS-based cryptos, the creator of the next block is chosen through various combinations and parameters. In essence, an individual person can mine or validate block transactions based on how many coins he or she holds. Adhering to this concept, the more Bitcoin or altcoin owned by a miner, the greater the mini Read this Term). This modification fundamentally alters how transactions are validated and new blocks are added to the ethereum blockchain. PoS selects validators to create new blocks based on the amount of cryptocurrency they own and are prepared to stake ether as collateral, whereas PoW relies on miners solving complicated mathematical riddles.\n\nKeep Reading KuCoin and Revolut Forge Alliance for Instant Euro-to-Crypto Transactions\n\nOne Year After the Ethereum Merge: What Has Changed?\n\nEthereum's transition from proof of work to proof of stake led to a dramatic reduction in energy consumption. The network's carbon footprint decreased by 99.99%, aligning with growing environmental concerns associated with crypto.\n\nIn what concerns liquid staking, the amount of Ethereum staked has nearly doubled since the merge, with 26.5 million Ethereum, worth around $43 billion, now staked.\n\nEthereum's scalability, however, still remains a key concern for adoption. While the merge itself didn't directly impact speed, the upcoming \"surge\" upgrades are expected to enhance Ethereum's scalability. Layer-2 solutions have already increased transactions per second significantly.\n\nAs for regulatory challenges, staking has become a regulatory focal point in the U.S., with the SEC targeting crypto exchanges offering staking services. Ethereum's classification remains uncertain, creating a regulatory divide between the SEC and CFTC.\n\nLastly, in terms of supply and the project’s direction, the merge has altered Ethereum's token supply dynamics, resulting in a decrease in the overall circulating supply. This change highlights Ethereum's long-term direction and its ability to implement major technical upgrades.\n\nExploring Proof-of-Stake\n\nThe Ethereum Merge is a component of Ethereum 2.0, a set of improvements designed at improving the network's scalability, security, and sustainability. Ethereum 2.0, also known as ETH2 or Serenity, introduced numerous significant enhancements, including shard chains for greater throughput, eWASM for enhanced smart contract capabilities, and, of course, the Ethereum Merge to shift to PoS.\n\nExamining the Pros and Cons of Using Proof of Stake for Ethereum Merge\n\nThe adoption of PoS via the Ethereum Merge has both advantages and cons.\n\nPros:\n\nEnergy Efficiency: When compared to PoW, PoS utilizes substantially less energy, alleviating concerns about Ethereum's carbon footprint.\n\nWhen compared to PoW, PoS utilizes substantially less energy, alleviating concerns about Ethereum's carbon footprint. Security: By forcing validators to maintain a considerable stake, PoS adds a stronger level of security, making malevolent behavior monetarily impractical.\n\nBy forcing validators to maintain a considerable stake, PoS adds a stronger level of security, making malevolent behavior monetarily impractical. Scalability: PoS can theoretically process more transactions per second than Ethereum, potentially addressing Ethereum's scalability Scalability Scalability is a term that describes the constraints of a network via hash rates to meet increased demand. In the context of Bitcoin, scalability reflects the issue in which a limited rate can process transactions adequately.Blocks within the Bitcoin blockchain are limited in both size and frequency. The overall transaction processing capacity of the network is dictated by the average block creation time of 10 minutes as well as a block size limit of 1 megabyte. Consequently, this leads to pain Scalability is a term that describes the constraints of a network via hash rates to meet increased demand. In the context of Bitcoin, scalability reflects the issue in which a limited rate can process transactions adequately.Blocks within the Bitcoin blockchain are limited in both size and frequency. The overall transaction processing capacity of the network is dictated by the average block creation time of 10 minutes as well as a block size limit of 1 megabyte. Consequently, this leads to pain Read this Term\n\nCons:\n\nCritics contended that PoS could lead to centralization because individuals with larger stakes would have more control over the network.\n\nTransition Difficulties: Transitioning from PoW to PoS is always a challenging process fraught with technical difficulties that must be properly addressed.\n\nWhile PoS has numerous benefits, it also raises questions about the allocation of money and power within the network. Critics were concerned that these changes would benefit the wealthy and powerful, potentially leading to a more centralized ecosystem. Furthermore, the switch to PoS demanded a robust and secure network upgrade, which was no easy task.\n\nImpact on Cryptocurrency Investors\n\nLet us now look at how the Ethereum Merge influenced cryptocurrency investors.\n\nThe switch to PoS was expected to boost Ethereum's value by addressing worries about energy usage and scalability. It enticed more institutional investors who have been wary of PoW networks like Bitcoin due to environmental issues.\n\nFurthermore, Ethereum's update to Ethereum 2.0, which includes the introduction of shard chains, created new opportunities for developers, resulting in an increase in decentralized applications and DeFi initiatives. Active investors in these industries seek to benefit from higher returns.\n\nThe shift was bound to bring up uncertainties and price swings which is why diversifying one's crypto portfolio beyond Ethereum was recommended for optimal risk management.\n\nConclusion\n\nThe Ethereum Merge was a watershed point in the evolution of blockchain technology. As Ethereum upgraded and transitioned from PoW to PoS, it aspired to become more sustainable, scalable, and secure, hence offering up new opportunities for innovation and growth within the cryptocurrency ecosystem. While the transformation was fraught with difficulties and uncertainty, it also presented tremendous potential for both investors and developers.\n\nFAQ\n\nWhat Is Beacon Chain?\n\nThe Beacon Chain is a PoS blockchain that runs alongside Ethereum's existing PoW chain. It was introduced to lay the groundwork for Ethereum 2.0 and to make the transition to PoS easier. The major function of the Beacon Chain is to coordinate validators and administer the PoS consensus mechanism.\n\nWhat Is Ethereum 2.0?\n\nEthereum 2.0, also known as Eth2 or Serenity, is a set of improvements intended at improving Ethereum's scalability, security, and long-term viability. It features the Ethereum Merge shift to PoS, the introduction of shard chains for increased throughput, and the inclusion of eWASM for advanced smart contract capabilities.\n\nWhat are the benefits of the Ethereum merge?\n\nThe Ethereum Merge provides various advantages, including higher energy efficiency, increased security via PoS, improved scalability, and the potential for a value boom. It overcomes the environmental concerns raised by PoW, making Ethereum more appealing to institutional investors and environmentally sensitive users. Furthermore, the enhancements to Ethereum 2.0 may stimulate innovation and growth in the DeFi and DApp sectors, benefiting both investors and developers."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS9iaW5hbmNlLXNheXMtc2VuZGluZy1ldGhlcmV1bS1mZWVzLXNvYXJpbmctdW5pbnRlbnRpb25hbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Binance just sent Ethereum gas soaring again. The exchange says it was 'unintentional' - DLNews",
        "content": "A flurry of transactions from Binance wallets sent Ethereum gas fees soaring Thursday morning.\n\nThe transaction spree cost Binance over $844,000.\n\nLast year, a near identical event occurred, but Binance gave prior notice that time.\n\nA flurry of transactions from Binance-connected crypto wallets sent Ethereum fees soaring Thursday morning, leaving onlookers confused.\n\nAt around 10:30 a.m. in London, data from blockchain explorer Etherscan showed hundreds of long-inactive wallets that simultaneously started sending Ether to a single wallet tagged as Binance 14.\n\nThe transactions continued for approximately 20 minutes, and caused Ethereum gas fees to jump from around 15 to 300 gwei. This caused the cost to process simple peer-to-peer Ether transactions to shoot up from around 40 cents to over $10.\n\nA Binance spokesperson told DL News the transactions were part of a “routine consolidation” of Ether to one of its wallets. “Any impact to gas prices was unintentional but quickly resolved,” the spokesperson said.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nOn Ethereum, “gas” refers to the fee associated with the computational work necessary to process transactions or execute smart contract operations. Its cost, or “gas price,” is typically expressed in gwei. Just as a dollar is divided into 100 cents, one Ether is divided into a billion gwei.\n\nBinance spent over $844,000 on the transactions, according to Etherscan data.\n\nIt’s not the first time Binance has clogged Ethereum with transactions.\n\nIn December, a near identical event occurred, but for transfers of Tether’s USDT stablecoin. But unlike today’s spike in gas fees caused by Binance activity, that one came with a prior notice.\n\nJoin the community to get our latest stories and updates\n\nJust before the activity, Binance said that it was consolidating funds from various deposit addresses in preparation for a Proof of Reserves audit.\n\n“As a result, during this time you may notice temporary increases in ETH gas fees,” the post said at the time.\n\nProof of Reserve audits are where centralised crypto exchanges create a cryptographic proof to show they hold enough assets to back all users’ crypto deposits. Exchanges do this to reassure depositors that they will be able to withdraw all the crypto they hold there at any time.\n\nBinance 14 is one of several Binance exchange wallets. It’s a non-custodial wallet controlled by Binance where the exchange stores crypto deposits from its users.\n\nAn error?\n\nBinance’s choice to again conduct numerous simultaneous transactions is puzzling, given that spacing them out could have prevented network congestion and resulted in lower fees.\n\nIn the aftermath, some onlookers pointed out that Binance had overpaid for the transactions. If the exchange had spread out its transactions, instead of firing them all off at once, it could have avoided clogging the network and paid less in fees.\n\nThat’s because Ethereum gas fees — small amounts of Ether paid to the blockchain to process transactions — increase as activity on the blockchain increases.\n\nWhen there are many transactions waiting to be processed, Ethereum automatically ups the cost to submit new transactions. Such a feature is necessary to protect Ethereum from spam attacks."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1uZXctbG93LWJpdGNvaW4tc3dpdGNoLXBvc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Ethereum price sees new low vs Bitcoin since switching to proof-of-stake - Cointelegraph",
        "content": "Ether (ETH) has seen a 36% year-to-date increase in its price in 2023 in U.S. dollar terms. This recovery, however, is modest given that ETH is currently trading 66% below its November 2021 peak of $4,870.\n\nEthereum vs. Bitcoin: 14-month downtrend and counting\n\nMoreover, on Sept. 20, Ether reached its lowest levels against Bitcoin (BTC) in 14 months, breaching the critical 0.06 BTC support. This has raised questions among Ether investors about the factors behind this price decline and what it will take to reverse the trend.\n\nETH/BTC price on Coinbase. Source: TradingView\n\nETH buyers placed their biggest hopes on protocol upgrades that significantly reduced the need for new coin issuance when the network transitioned to a proof-of-stake consensus mechanism.\n\nThese hopes were realized in mid-September 2022, resulting in an annualized issuance rate of just 0.25% of the supply. This transformation aligned with the Ethereum community’s vision of “ultrasound money.”\n\nFurthermore, the subsequent Shapella upgrade on April 12 allowed for withdrawals from the native staking protocol, addressing a major concern for investors. Previously, both the 32 ETH deposits and the yield from participating in the network consensus were locked up indefinitely.\n\nConfidence among Ethereum enthusiasts grew as these significant hurdles were crossed with minimal issues. They anticipated that the price of Ether would surpass $2,000, a prediction that came true on April 14.\n\nHowever, this optimism was short-lived, as ETH’s price promptly fell back to the same $1,850 level just a week later.\n\nNotably, instead of witnessing a net withdrawal, Ethereum staking experienced a net inflow of 3.1 million ETH in the 30 days following the Shappela upgrade, surpassing even the most optimistic expectations.\n\nGiven that the Ethereum network’s planned developments have generally been on track, albeit with the customary delays, investors now need to explore other potential catalysts for reversing the current downtrend in Ether’s price relative to BTC.\n\nExternal factors present important triggers for ETH price\n\nOne of these potential catalysts lies in the ongoing legal battle between Ripple (formerly Ripple Labs) and the U.S. Securities and Exchange Commission, which could significantly impact Ether’s price momentum.\n\nThe SEC contends that XRP (XRP) sales to retail investors constitute a securities offering. However, in July, Judge Analisa Torres ruled that XRP generally does not qualify as a security under SEC guidelines, especially when distributed through exchanges.\n\nAs noted by the “American lawyer and Bitcoiner” Bryan Jacoutot on X (formerly Twitter), the Ethereum Foundation remains exposed due to the presale of ETH directed toward institutional investors and subject to a lock-up period.\n\n(1/12) ANALYSIS: I've reviewed the district court ruling on XRP and it rests on very shaky ground. Expect an appeal.\n\n\n\nAND Ethereum Foundation remains at risk even if its upheld because of important distinctions in the methods used by Ripple to sell the \"pre-mine\"\n\n\n\n⬇️⬇️ — Bryan Jacoutot (@BryanJacoutot) July 13, 2023\n\nAccording to Jacoutot, even if Ripple were to secure a favorable outcome, it wouldn’t immediately mitigate the risks for Ethereum. Nevertheless, it’s undeniable that the regulatory uncertainty surrounding the Ether initial coin offering (ICO) remains a source of concern for investors.\n\nOn Sept. 20, an Ethereum address associated with the ICO era showed its first activity, transferring 32.1 ETH (valued at $52,000 at the time) directly to Coinbase. This additional movement only amplified regulatory concerns since there are no apparent incentives for addresses that have remained dormant for four to eight years to divest at this particular point in the market cycle.\n\nAn Ethereum ICO participant who has been dormant for 8 years transferred 32.1 $ETH to #Coinbase just now.\n\n\n\nThe address received 200 $ETH at Ethereum Genesis.\n\n\n\nAnd the address appears to be related to shemnon.eth (@shemnon).https://t.co/nj5eF8iRT0 pic.twitter.com/6Viytn4dU5 — Lookonchain (@lookonchain) September 20, 2023\n\nA similar occurrence unfolded with an address linked to Vitalik Buterin, which sent 300 ETH (worth $490,000 at the time) to the Kraken exchange on Sept. 19.\n\nMore positive news gives hope to Ethereum investors\n\nOn the news side, Ethereum has seen some positive surprises, such as the unexpected request for a spot Ether exchange-traded fund by ARK Invest and 21Shares on Sept. 6. This development reduced the risks associated with excessive institutional concentration in Bitcoin, particularly if the ETF is approved.\n\nAdditionally, Canto, a layer-1 Cosmos-native blockchain, announced its expansion to Ethereum’s layer 2 on Sept. 18. This zero-knowledge, permissionless rollup, compatible with the Ethereum Virtual Machine, is primarily focused on bringing traditional finance into the Ethereum ecosystem.\n\nShould Bitcoin’s price surge be driven solely by the approval of a spot Bitcoin ETF or inflation concerns in the United States, Ether is well-positioned to follow suit, benefiting from the same catalysts.\n\nMeanwhile, Ethereum’s primary competitors in the decentralized applications sector, namely Solana and BNB Chain, face similar risks pertaining to ICO and securities regulations, making it unlikely for them to challenge Ethereum’s dominance in terms of total value locked and trading volumes.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL2lzLWV0aGVyZXVtLWRlYWQtYWxsLXBvdGVudGlhbC1iZWFyaXNoLXNjZW5hcmlvcy1jb3ZlcmVkL9IBWGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL2lzLWV0aGVyZXVtLWRlYWQtYWxsLXBvdGVudGlhbC1iZWFyaXNoLXNjZW5hcmlvcy1jb3ZlcmVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Is Ethereum Dead? All Potential Bearish Scenarios Covered - AMBCrypto Blog",
        "content": "The cryptocurrency market remains a tumultuous terrain for investors, with the fluctuating values of digital assets like Ethereum causing a stir. Amidst the volatility, a recurrent question echoes through the industry: Is Ethereum dead in 2023?\n\nThis article explores this concern, assessing Ethereum’s potential for long-term growth and the challenges it faces.\n\nUnderstanding Ethereum\n\nEthereum, a decentralized blockchain platform, was proposed in 2013 by Vitalik Buterin and officially launched in 2015. It brought to the forefront the concept of a programmable blockchain, enabling developers to build applications on its infrastructure.\n\nDespite being a leading player in the crypto industry, Ethereum is currently grappling with market difficulties and global economic policies, leading some to question its future.\n\nIs Ethereum dead?\n\nEthereum is the second-largest blockchain platform by market capitalization, and it has been the driving force behind the decentralized finance (DeFi) and non-fungible token (NFT) revolutions. However, in recent months, Ethereum has faced a number of challenges, including high gas fees, scalability issues, and competition from other blockchain platforms.\n\nSome people believe that these challenges are insurmountable and that Ethereum is on the decline. Others believe that Ethereum is still the best blockchain platform and that it will eventually overcome its challenges.\n\nHere are some reasons why people may think that Ethereum is dead:\n\nEthereum has high gas fees, which can make it expensive to use.\n\nEthereum is not very scalable, which means that it can be slow and expensive to process transactions during peak times.\n\nEthereum faces competition from other blockchain platforms, such as Solana, Avalanche, and Cardano.\n\nSo, is Ethereum dead? It’s too early to say. Ethereum is facing some challenges, but it is still the second-largest blockchain platform and has a large and active community. Ethereum is also undergoing a number of upgrades that could address its current challenges. However, it is important to note that Ethereum faces competition from other blockchain platforms, and it is possible that one of these platforms could eventually overtake Ethereum.\n\nUltimately, whether or not Ethereum is dead will depend on a number of factors, including the success of its upgrades, the adoption of other blockchain platforms, and the overall state of the cryptocurrency market.\n\nAre you wondering if cryptocurrency mining is dead after 2023? Find out the truth in our guide.\n\nEthereum’s rise and current situation\n\nEthereum has carved a niche for itself in the crypto landscape, especially with its transformative potential and innovative prowess. However, evaluating Ethereum’s current situation requires a nuanced understanding of its potential for long-term growth, innovation, and contribution to the crypto world.\n\nExperts maintain a positive outlook for Ethereum’s prospects due to its robust developer community, diverse applications, and potential long-term growth. However, investing in established cryptocurrencies like Ethereum provides diversification opportunities while mitigating risks and offering unique technology benefits. These go on to prove that Ethereum is not dead.\n\nPotential bearish scenarios in the Ethereum trading landscape\n\nHere are a few potential bearish trends that may have impacted the Ethereum trading landscape. These scenarios might have made traders believe that Ethereum is dead. Take a look:\n\n1. Market cycles and crypto winter\n\nThe cryptocurrency market cycle, like the stock market, follows four stages: accumulation, markup, distribution, and markdown. Crypto winter, a period characterized by bearish market conditions, can be attributed to factors such as regulatory ambiguity, diminishing institutional interest, and market saturation. Ethereum is currently experiencing a downtrend in the market cycle, leading to a decrease in its value.\n\n2. Global economic policies and their impact\n\nThe Federal Reserve’s policies can significantly impact the price of cryptocurrencies, including Ethereum. Initial FED meetings in 2023 led to a considerable decline in prominent coins, including Ethereum. In the current economic climate, it’s advised for investors to steer clear of meme currencies and focus on more established cryptocurrencies like Ethereum.\n\nFind out what is Ethereum 2.0 and explore how it works in our comprehensive guide.\n\n3. Mainstream adoption challenges\n\nEthereum’s adoption faces significant hurdles, such as high gas fees and scalability issues, which limit the platform’s appeal to small investors and app developers. Despite these challenges, Ethereum’s decentralized nature offers several benefits, such as preserving the state of the blockchain and preventing censorship.\n\n4. Ethereum loses its market share to other blockchain platforms\n\nEthereum is currently the leading blockchain platform for DeFi and NFTs. However, there are a number of other blockchain platforms that are emerging, such as Solana, Avalanche, and Cardano. These platforms offer a number of advantages over Ethereum, such as lower gas fees and higher scalability. If Ethereum loses its market share to these other platforms, it could lead to a decline in its price.\n\nLooking to know more about the mysterious demise of some cryptocurrency billionaires? We have got you covered!\n\nThe future of Ethereum\n\nEthereum 2.0 is an ambitious upgrade that aims to address current challenges and revolutionize the Ethereum network. With the rise of NFTs and the metaverse, Ethereum is at the forefront of digital innovation, further solidifying its position as a valuable player in the crypto world.\n\nEthereum after the Merge\n\nAfter years of delays, Ethereum Merge finally went live in September 2022, clearing the path for more technical improvements and greater adoption. Ethereum 2.0, a much-anticipated set of upgrades, aims to improve transaction speed, reduce gas fees, and enhance scalability.\n\nThe rise of NFTs and Metaverse\n\nNFTs are unique digital assets that cannot be replaced or exchanged on a one-to-one basis, while metaverses are virtual worlds built on blockchain technology used for gaming, art, and various other activities. The emergence of NFTs and the metaverse has had a positive impact on Ethereum’s value.\n\nDecentralized applications (dApps)\n\ndApps are powered by blockchain technology and smart contracts, bypassing intermediaries and offering users increased control over their data and the potential to create new business models.\n\nHere’s everything you need to know about Ethereum 2.0 and its use cases. Take a thorough look.\n\nFrequently asked questions\n\nWe have addressed a few questions that traders have been wondering about. Take a look:\n\nQ: Does ETH still have a future?\n\nA: Although Ethereum (ETH) has had some ups and downs, it is not dead. However, its current market indicators remain bullish long term. This suggests that it still has a strong future ahead.\n\nQ: Will Ethereum ever go back up?\n\nA: Analysis of the Ethereum market trends and historical data shows that ETH is likely to experience a steady appreciation in value.\n\nQ: Is it still safe to invest in Ethereum?\n\nA: Given the current market trends and potential risks ahead, Ethereum remains a volatile and potentially risky investment.\n\nConclusion\n\nIn conclusion, the rumors of Ethereum being dead are greatly exaggerated. Despite current challenges, Ethereum’s future looks promising, with its post-merge roadmap, the rise of NFTs and the metaverse, and the growing world of decentralized economy. We have also covered all bullish scenarios for Cardano too, in another blog that you might find interesting. Do check it out."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0taGFzLWJlZW4tZGlzYXBwb2ludGluZy1zaW5jZS1zaGFuZ2hhaS1qcG1vcmdhbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Has Been Disappointing Since Shanghai: JPMorgan - Watcher Guru",
        "content": "Ethereum has fallen short of expectations in terms of network activity following the much-anticipated Shanghai upgrade implemented in April. While the crypto community had high hopes for this upgrade, it appears that the results have left many disappointed, according to JPMorgan.\n\nJUST IN: JPMorgan says Ethereum has been disappointing since its Shanghai upgrade. — Watcher.Guru (@WatcherGuru) September 22, 2023\n\nNetwork Activity Declines Despite Energy Efficiency\n\nThe transition from proof-of-work to proof-of-stake, known as the Merge , was expected to revolutionize Ethereum. The upgrade was aimed at drastically reducing its energy consumption. In fact, it succeeded in reducing energy usage by over 99%. However, despite this remarkable achievement, the Ethereum network has not seen the surge in activity that was anticipated.\n\nAlso read: US Government Indicts Senator Bob Menendez For Bribery\n\nJPMorgan analysts, led by Nikolaos Panigirtzoglou, expressed their concerns in a recent note. They pointed out that while Ethereum’s energy consumption plummeted, the supply of Ethereum was shrinking. Additionally, staking had risen significantly, with a 50% increase since the Shanghai upgrade. Surprisingly, these positive developments did not translate into increased network activity.\n\nEthereum’s vital metrics, including daily transactions, daily active addresses, and the total value locked (TVL) in decentralized finance (DeFi) protocols, have all experienced declines. These numbers are crucial indicators of the network’s health and adoption, and their downward trend is a cause for concern.\n\nJPMorgan’s analysts attribute Ethereum’s lackluster performance to a combination of “bearish forces” that have plagued the cryptocurrency ecosystem over the past year. These include the collapses of platforms like FTX and Terra, the uncertainty surrounding U.S. regulatory measures and crackdowns, waning interest in crypto among institutional investors, and a drying up of venture capital funding."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpbmFuY2UtZ2FzLWZlZXMtZXRoZXJldW0tYWNjb3VudC1jb25zb2xpZGF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Binance account consolidation sends Ethereum gas fees soaring - Blockworks",
        "content": "A “routine” Binance account consolidation process sent gas fees on Ethereum soaring, prompting accusations of incompetence on Thursday.\n\nAt approximately 6 am ET, an address labeled Binance 14 received hundreds of incoming ether transactions. Per Etherscan, the process sent gas prices as high as 280 gwei — over twenty times more expensive than the 13 gwei at the time of writing.\n\nThe activity briefly made the address one of the largest gas guzzlers on Ethereum, as the wallet was responsible for 83% of fees at the peak of the transfers. Top spenders tend to include the decentralized exchange Uniswap, various MEV bots, and layer-2 networks settling transactions to the base chain.\n\nThe Binance 14 address has spent $842,000 in total gas fees on a 24-hour basis, and just $562 in the last three hours. Over the course of its existence, the address — which currently accounts for $250 million of Binance’s nearly $56 billion in holdings — is responsible for $95 million in gas expenditure between both incoming and outgoing transfers.\n\nIn a statement to Blockworks, a Binance spokesperson said, “Binance carried out a routine consolidation of [ether] ETH to one of its wallets. Any impact to gas prices was unintentional but quickly resolved.”\n\nIndeed, throughout its existence the Binance 14 address has seen a number of gas spend spikes, including one on Dec. 9, 2022 that led to an 880 ETH spend over a 24-hour period.\n\nBinance was the target of ire on social media as a result of the account consolidation process, with many observers noting that if they had simply spread the transactions out over a longer period of time, the gas spike would have been significantly subdued.\n\nAs a result of what some labeled as inefficient methodology, Binance ended up spending more on gas than they would have otherwise and made the network more expensive for others.\n\n“Every interaction I have had with them screams of incompetence,” said Rotki app founder Lefteris Karapetsas of the transfers.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjIvZXRoZXJldW1zLXNoYW5naGFpLXVwZ3JhZGUtaGFzLWZhaWxlZC10by1ib29zdC1uZXR3b3JrLWFjdGl2aXR5LWpwbW9yZ2FuLXNheXMv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOS8yMi9ldGhlcmV1bXMtc2hhbmdoYWktdXBncmFkZS1oYXMtZmFpbGVkLXRvLWJvb3N0LW5ldHdvcmstYWN0aXZpdHktanBtb3JnYW4tc2F5cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum’s Shanghai Upgrade Has Been ‘Disappointing,’ JPMorgan Says - CoinDesk",
        "content": "“While the shift from proof-of-work (PoW) to proof-of-stake (PoS) that resulted from the Merge upgrade meant that the energy consumption for the Ethereum network collapsed by more than 99%, the ether supply is shrinking and staking rose sharply, the increase in network activity has been rather disappointing,” analysts led by Nikolaos Panigirtzoglou wrote."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vYmxvY2tnZWVrcy5jb20vZ3VpZGVzL3RvcC00LXVzLXN0YXRlcy10aGF0LWFyZS1tb3JlLWludGVyZXN0ZWQtaW4tZXRoZXJldW0tb3Zlci1iaXRjb2luLWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Top 4 US states that are more interested in Ethereum over Bitcoin in 2023 - Blockgeeks",
        "content": "In the dynamic landscape of cryptocurrency, while Bitcoin maintains a stronghold in terms of market share across most US states, certain regions have shown an increased inclination towards Ethereum. According to recent findings, four states — New Jersey, Colorado, Florida, and Wisconsin — stand out with a higher Ethereum preference.\n\nLet’s delve deeper into the reasons behind this shift.\n\nTop 4 US states that prefer Ethereum over Bitcoin in 2023\n\nNew Jersey’s interest in Ethereum and crypto\n\nNew Jersey’s recent legislative moves clearly signal its intent to become a pivotal crypto hub. The state’s General Assembly has passed the “Digital Assets and Blockchain Regulation” Act, which introduces a range of provisions favorable for the cryptocurrency sector. It lays down regulations for digital assets, cryptocurrencies, and blockchain technologies and paves the way for decentralized autonomous organizations to establish themselves within the state.\n\nSen. Robert Singer’s comments reflect the state’s approach: “We want to be more industry-friendly.” This, combined with incentives for virtual currency businesses and the focus on blockchain integration, positions New Jersey at the forefront of Ethereum adoption.\n\nColorado: The home of ETHDenver\n\nGovernor Jared Polis’s 2022 announcement to establish Colorado as a center for crypto innovation has borne fruit. The state has introduced a program allowing tax payments through cryptocurrency and embraced Ethereum-centric events like ETHDenver.\n\nETHDenver, one of the largest web3 conferences in the world, has seen enormous support from the blockchain community. Its mission to build Colorado as the ultimate destination for a decentralized future is making significant strides. The event’s community-funded approach and the proposed $10 million fund for decentralized projects further amplify Colorado’s commitment to Ethereum and the broader blockchain ecosystem.\n\nFlorida: Crypto Adoption led by a passionate Mayor and Governor\n\nFlorida is emerging as an attractive destination for crypto investment, thanks to the efforts of Governor Ron DeSantis and Miami Mayor Francis Suarez. The state’s endeavors to integrate blockchain technology into various sectors and Mayor Suarez’s aggressive campaign to lure crypto businesses to the region have significantly fueled Ethereum‘s popularity. The renaming of the Miami Heat’s stadium to FTX Arena (before FTX went down in flames and the stadium quickly ditched the moniker) and the symbolic gesture of leaders receiving pay in Bitcoin testify to the state’s growing enthusiasm for digital currencies. With the state attracting several businesses and developers, there is hardly any surprise why they lean more heavily towards the sophisticated use cases of the Ethereum ecosystem over Bitcoin.\n\nWisconsin: The Silent Ethereum Advocate\n\nThere is not much information out there about Wisconsin’s interest in crypto. However, the survey suggests otherwise. The state, known for its progressive approach towards technology and innovation, is likely recognizing Ethereum‘s potential beyond just a digital currency. As Ethereum establishes itself as a robust platform for decentralized applications, states like Wisconsin, which value technological progress, would naturally gravitate towards it.\n\nWhy should you buy Ethereum instead of Bitcoin?\n\nCertainly, Bitcoin holds the mantle as the premier cryptocurrency, its pioneering presence and vast adoption making it a household name. However, when diving into the intricate tapestry of blockchain technology, Ethereum emerges as a potent contender, not just as a cryptocurrency but as a comprehensive platform for decentralized applications and smart contracts.\n\nEthereum‘s programmability is its trump card. This isn’t just about trading or holding a currency; it’s about harnessing a versatile framework upon which a myriad of applications can be built. In essence, Ethereum offers an entire ecosystem, opening doors to decentralized finance (DeFi), gaming, art, and much more.\n\nThis functionality has a magnetic pull on states with a burgeoning crypto presence and developer community. Consider Colorado and Florida; their robust crypto-awareness has led them to prefer the multifunctional Ethereum over the monolithic Bitcoin. As these states champion technological innovation, it’s only logical for them to gravitate toward a platform that offers more than just a digital currency.\n\nIn Conclusion\n\nWhile Bitcoin remains a significant player in the cryptocurrency market, Ethereum’s multifaceted capabilities, from decentralized finance (DeFi) to smart contracts, are drawing the attention of progressive states. The proactive measures by the states of New Jersey, Colorado, Florida, and Wisconsin clearly indicate Ethereum‘s growing significance in the US’s crypto narrative. As 2023 unfolds, observing how other states respond to this trend and the innovations that Ethereum will undoubtedly catalyze will be interesting.\n\nFAQ\n\nIs it better to buy Bitcoin or Ethereum?\n\nBuying Bitcoin or Ethereum often boils down to individual investment goals and risk tolerance. Being the first and most well-established cryptocurrency, Bitcoin is often seen as a “store of value” and likened to “digital gold.” On the other hand, Ethereum offers a platform for decentralized applications and smart contracts, making it a currency and a comprehensive ecosystem. Those seeking a diverse range of applications lean towards Ethereum, while those looking for a more established and straightforward digital currency might choose Bitcoin.\n\nWhat problem does Ethereum solve?\n\nEthereum was designed to overcome limitations in earlier cryptocurrencies, primarily regarding flexibility. While Bitcoin introduced the concept of blockchain and decentralized money, Ethereum took it a step further by creating a platform where developers can build and deploy smart contracts and decentralized applications. This means tasks, transactions, and programs can run autonomously without intermediaries, potentially revolutionizing various sectors, from finance and real estate to entertainment and governance.\n\nWill Ethereum overtake Bitcoin?\n\nPredicting the future of the crypto market is challenging due to its volatile nature. While Ethereum brings a lot of functionality to the table with its smart contract capabilities, Bitcoin’s primary value proposition is its status as the original cryptocurrency and its widespread adoption as a store of value. Some experts believe Ethereum‘s expansive use cases might give it an edge in the long run, a concept termed the “flippening,” but it remains speculative. Both cryptocurrencies have their strengths and could coexist, catering to different market segments.\n\nWhat will happen to Ethereum in 2030?\n\nIt is impossible to predict Ethereum’s valuation in 2030. With the incorporation of multiple L2s and sharding, Ethereum’s scalability issues should be solved, potentially making Ethereum more efficient and capable of handling more transactions per second. With favorable regulations, Ethereum should have plenty of use cases.\n\nWhat are the disadvantages of Ethereum?\n\nEthereum’s biggest problem is integrating and deploying all the cool scalability innovations that are happening right now. For example, sharding can be complicated, and integrating it with Ethereum’s chain could have unforeseen consequences."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1ncmluZHMtbG93ZXItMTYwMC_SAUpodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tcHJpY2UtZ3JpbmRzLWxvd2VyLTE2MDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Grinds Lower But Key Support Is Still Intact - NewsBTC",
        "content": "Ethereum price corrected lower from the $1,670 resistance against the US Dollar. ETH could take a major hit if it breaks the $1,600 support.\n\nEthereum started a bearish wave from the $1,660 resistance.\n\nThe price is trading below $1,640 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $1,640 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair must stay above the $1,600 support zone to start another increase in the short term.\n\nEthereum Price Slides Further\n\nEthereum’s price failed to clear the $1,660 and $1,670 resistance levels. As a result, ETH started another decline and traded below the $1,630 support, like Bitcoin.\n\nThe price moved below the $1,620 support as well. However, the bulls are active near the $1,600 level. A low is formed near $1,606 and the price is now consolidating losses. It is trading near the 23.6% Fib retracement level of the downward move from the $1,659 swing high to the $1,606 low.\n\nEther is now trading below $1,640 and the 100-hourly Simple Moving Average. There is also a key bearish trend line forming with resistance near $1,640 on the hourly chart of ETH/USD.\n\nOn the upside, the price might face resistance near the $1,630 level and the 100-hourly Simple Moving Average. The next resistance is near the $1,640 level and the trend line. The trend line is also near the 61.8% Fib retracement level of the downward move from the $1,659 swing high to the $1,606 low.\n\nSource: ETHUSD on TradingView.com\n\nThe main resistance is now forming near $1,660. A close above the $1,660 resistance might send the price toward the $1,720 resistance. The next major barrier is near the $1,750 level. A close above the $1,750 level might send Ethereum further higher toward $1,820.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,640 resistance, it could start another decline. Initial support on the downside is near the $1,600 level.\n\nA downside break below $1,600 might accelerate losses. The next key support is close to $1,540, below which the price could even test the $1,500 level. The next key support is $1,440.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,600\n\nMajor Resistance Level – $1,640\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL21hdGljLWFuYWx5c2lzL2NlbG8tY29uc2lkZXJzLXRyYW5zaXRpb25pbmctdG8tZXRoZXJldW0tbGF5ZXItMi13aXRoLXBvbHlnb24tY2hhaW4v0gF4aHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvbWF0aWMtYW5hbHlzaXMvY2Vsby1jb25zaWRlcnMtdHJhbnNpdGlvbmluZy10by1ldGhlcmV1bS1sYXllci0yLXdpdGgtcG9seWdvbi1jaGFpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Celo Considers Transitioning To Ethereum Layer-2 With Polygon Chain - NewsBTC",
        "content": "Celo, a blockchain platform, is exploring migrating from its standalone blockchain to an Ethereum (ETH) Layer-2 (L2) network. Originally, Celo had planned to utilize Optimism’s OP Stack, a customizable toolkit similar to Polygon (MATIC) but based on Optimism’s technology.\n\nHowever, Sandeep Nailwal, co-founder of Polygon Labs, has proposed an alternative solution to the Celo community. Nailwal suggests leveraging Polygon’s Chain Development Kit (CDK), an open-source toolset that enables the creation of customizable Layer-2 chains powered by zero-knowledge (ZK) technology.\n\nCelo’s Potential Move To Ethereum Layer-2 Via Polygon\n\nIn a recent blog post, Polygon Labs suggested Celo could consider deploying an Ethereum Layer-2 solution using Polygon CDK.\n\nAccording to Polygon Labs co-founder Nailwal, this strategy would allow Celo to leverage the benefits of being an Ethereum Layer-2 platform while preserving the characteristics that have contributed to its success.\n\nThe proposal emphasizes several key advantages of adopting Polygon CDK. Firstly, it enables cross-community collaboration by integrating with an ecosystem of Layer-2 solutions powered by zero-knowledge technology.\n\nPolygon CDK enhances compatibility with Ethereum by providing an environment equivalent to the Ethereum Virtual Machine (EVM). This alignment ensures a seamless transition for Celo, closely matching Ethereum’s technical infrastructure and tooling.\n\nFurthermore, according to Nailwal, deploying with the protocol’s CDK offers increased security for Celo. It allows Celo to leverage Ethereum’s proven consensus layer while incorporating the security benefits of zero-knowledge proofs.\n\nRegarding fees and scalability, Celo can benefit from low fees by utilizing the zkEVM validium architecture and off-chain data availability supported by Polygon CDK. These features contribute to cost-efficient transactions while enabling scalability for Celo’s network.\n\nMoreover, according to Nailwal, Celo gains access to a unified Layer-2 economy by becoming a part of the Polygon ecosystem by combining Ethereum’s mainnet with Polygon’s ecosystem. This integration creates a seamless experience for developers and users, facilitating interaction with both networks.\n\nFast Transactions And Lower Fees?\n\nWith zero-knowledge technology, Celo users can enjoy near-instant withdrawals, faster finality times, and instant cross-chain interactivity.\n\nAccording to the blog post, these features enhance the speed, efficiency, and security of transactions, ultimately improving the user experience.\n\nThrough Polygon CDK, chains can achieve near-instant cross-chain interactivity with Ethereum, leveraging the power of ZK proofs to establish a secure and interconnected network.\n\nOverall, the proposed migration to Polygon CDK represents an opportunity for Celo to transition to an Ethereum Layer-2 solution while harnessing the advantages offered by Polygon’s ZK-powered technology. The proposal aims to initiate discussions between the Celo and Polygon communities to explore the potential benefits for all stakeholders involved.\n\nIt is important to note that no final decision has been made at this stage, and the proposal signifies the beginning of discussions between the Celo and Polygon communities.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL21ha2VyLWVuZGdhbWUtc3ViLWRhby1nb3Zlcm5hbmNlLWdub3Npcy1kYWnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Maker subDAO branches out beyond Ethereum - Blockworks",
        "content": "After countless forum posts and Discord back-and-forths, MakerDAO’s expansive “endgame” plan is finally seeing concrete action.\n\nMaker passed a poll initiating the Spark Lend DeFi protocol on the Gnosis Chain. This sets the stage for the impending launch of its DeFi-focused subDAO. The move is meant as an example for how Spark Lend can proceed after the Maker “endgame” is finalized and the subDAO becomes fully autonomous.\n\nIn preparation for the endgame, MakerDAO has launched a prototypical set of so-called subDAOs meant to govern different aspects of the DAO. SparkDAO is Maker’s DeFi subDAO, and its Spark Protocol lending platform has been buoyed by the popularity of sDAI, or savings DAI, a yield-bearing token benefiting from high Treasury returns.\n\nUsers can now access Spark Lend, an Aave fork with similar features, on both Gnosis Chain and Ethereum. While demand grows, Karpatkey — the treasury manager for Gnosis — is providing liquidity to the DAI market, essentially acting as a stand-in for Maker until it assumes the operations itself.\n\nThe endgame is largely aimed at reducing DAO governance fatigue, an issue MakerDAO founder Rune Christensen called the “central issue” of DAOs on the Unchained podcast this week. For now, the protocol’s governance process remains unchanged, and the passed proposal is headed to a second “executive” vote.\n\nMaker subDAOs are meant to be specialized groups who can make decisions quickly. They operate with their own governance tokens and have a reduced number of stakeholders voting on each proposal.\n\nCurrently, Spark and other initial Maker subDAOs lack their own tokens and are not autonomous. While subDAOs could eventually overturn Spark’s work, Phoenix Labs CEO Sam MacPherson believes Spark sets a precedent for future subDAOs. Until SparkDAO governance starts in earnest, Maker’s focus remains on expanding Spark Lend’s deployment.\n\n“Other chains will be putting out proposals, and we’re going to go to all of them is the idea,” MacPherson said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLXNlcHRlbWJlci0yMtIBQGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLXNlcHRlbWJlci0yMj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for September 22 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe rates of most of the coins are rising; however, there are some exceptions to this rule.\n\nAdvertisement\n\nTop coins by CoinStats\n\nETH/USD\n\nThe rate of Ethereum (ETH) has risen by 0.73% over the previous 24 hours.\n\nImage by TradingView\n\nOn the hourly time frame, the rate of Ethereum (ETH) is approaching the resistance level of $1,601. If the rise continues and the daily bar closes near that mark, the accumulated energy might be enough for growth to the $1,620 area soon.\n\nImage by TradingView\n\nA different picture can be seen on the daily chart as today's slight rise has not affected the technical position of ETH. If bulls want to get back in the game, they need to fix the rate above the zone of $1,660.\n\nOnly in that case is a midterm rise possible.\n\nImage by TradingView\n\nA bearish situation remains more relevant on the weekly time frame. If the bar candle closes below the $1,600 zone, traders are likely to expect a support breakout, followed by a further drop to the $1,500 range soon.\n\nEthereum is trading at $1,597 at press time."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9kb3JtYW50LWV0aC1nZW5lc2lzLXdhbGxldC10cmFuc2ZlcnMtY29pbnMtY29pbmJhc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Dormant Ethereum Genesis Wallet Springs to Life, Shifting ETH to Coinbase - CCN.com",
        "content": "Key Takeaways\n\nAn almost eight-year-inactive Ethereum ICO participant has sent 32.1 ETH to Coinbase.\n\nWhales in Ethereum sold out their shares. Price impact remained negligible.\n\nGrayscale applied for another ETF, maintaining the strong level of institutional interest in Ethereum.\n\nAfter being dormant for eight years, an inactive Ethereum ICO participant deposited 32.1 ETH to Coinbase wallet.\n\nAn Ethereum ICO participant who has been dormant for 8 years transferred 32.1 $ETH to #Coinbase just now. The address received 200 $ETH at Ethereum Genesis. And the address appears to be related to shemnon.eth (@shemnon ).https://t.co/nj5eF8iRT0 pic.twitter.com/6Viytn4dU5 — Lookonchain (@lookonchain) September 20, 2023\n\nThis specific Ethereum address was a part of Ethereum Genesis and was initially been given 200 ETH. It looks to be connected to shemnon.eth (@shemnon).\n\nThe unexpected action has sparked attention and speculations among cryptocurrency enthusiasts, especially in light of Ethereum’s notable value growth since its launch.\n\nRecent Signs Of Early ETH Whales Migrating\n\nAfter years of inactivity, a number of Ethereum addresses related to the platform’s initial coin offering (ICO) have recently displayed activity.\n\nJust recently, a major Ethereum whale transferred nearly $10M worth of ETH to Kraken while in July, an Ethereum ICO participant resumed activity after an eight-year break by depositing a sizable 61,216 ETH, or around $116 million, into the Kraken cryptocurrency market.\n\nAnother long-inactive wallet transferred 641 ETH and started staking in a second incident that coincided with Ethereum’s ninth birthday, amounting to a transaction value of almost $1.19 million.\n\nSuch transactions are notable not only for their quantity, but also for the large gains that these early Ethereum supporters have experienced.\n\nEarly adopters have seen exponential growth in their investments considering that the price of Ethereum during its initial coin offering (ICO) was around $0.31 per ETH and that it currently trades for around $1,623.\n\nPotential Justifications For the Actions\n\nThere are concerns regarding the motivations behind these transfers due to the unexpected migration of substantial quantities of Ethereum from wallets that have been dormant for years.\n\nSome have theorised that the original holders may be collecting profits or diversifying their assets in light of Ethereum’s spectacular price increase over the years.\n\nOthers could think that these changes are a result of Ethereum staking, which is becoming more and more popular and enables holders to receive incentives for helping to protect the network.\n\nEffects on ETH\n\nThe price of ETH, which was trading at $1,630 at the time of writing, nevertheless remained largely constant despite these significant changes.\n\nThis steadiness demonstrated the altcoin’s adaptability as a market that took these sizable transactions in stride without seeing appreciable price changes.\n\nHowever, these behaviours by ICO participants may cause FUD (Fear, Uncertainty, and Doubt) among bitcoin enthusiasts. Concerns about market manipulation or negative sentiment might arise when investors carry on large transactions on exchanges.\n\nInstitutional Enthusiasm Remains High\n\nIt’s interesting to see that institutional interest in Ethereum has not decreased. A well-known cryptocurrency investing company called Grayscale recently applied for a new Ethereum futures exchange-traded fund (ETF).\n\nGrayscale had previously filed a registration for the same investment vehicle under different regulatory legislation; therefore, this action startled many in the cryptocurrency community.\n\nThe company’s latest filing under the Securities Act of 1933 could be viewed as a backup plan in the event that the SEC rejects its initial proposal for an ETH futures ETF.\n\nIf no regulatory authorities object, the initial ETF proposal should go live in October. Grayscale has shown significant belief in the long-term potential of cryptocurrency, despite short-term market changes, by taking the initiative to develop an Ethereum-focused ETF."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZmlyc3QtZXRoZXJldW0tZnV0dXJlcy1ldGYtZXhwZWN0aW5nLWFwcHJvdmFsLWJ5LW9jdG9iZXItMi0yMDIzMDkyMjA3NDDSAXpodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9maXJzdC1ldGhlcmV1bS1mdXR1cmVzLWV0Zi1leHBlY3RpbmctYXBwcm92YWwtYnktb2N0b2Jlci0yLTIwMjMwOTIyMDc0MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "First Ethereum futures ETF expecting approval by October 2 - FXStreet",
        "content": "Share:\n\nHal Press of North Rock Digital says that the first Ethereum futures ETF will be approved on October 2.\n\nThe crypto hedge fund founder believes Valkyrie’s combined product will be the first ETH futures ETF product to market.\n\nEthereum price declined 2.33% over the past week as the altcoin trades sideways below $1,600.\n\nThe first Ethereum futures ETF (exchange-traded fund) is likely to be approved on October 2, according to crypto hedge funder Hal Press. The North Rock Digital founder’s thesis is based on the recent events in the crypto ecosystem.\n\nThe Valkyrie Bitcoin Strategy and Ether Strategy ETFs are awaiting approval from the Securities & Exchange Commission (SEC), with a deadline of October 3, 2023. Press believes this could be the first Ethereum Futures ETF to win the SEC’s approval.\n\nThe approval of a Bitcoin futures ETF in October 2021 had fueled bullish sentiment among market participants and acted as a catalyst for BTC’s price rally to a peak of $66,900. Traders have similar expectations from the approval of an Ethereum futures ETF, therefore, the date of approval is key to identify the trend in ETH price.\n\nAlso read: BASE chain likely to issue tokens in the future, Coinbase CLO Paul Grewal waits for regulatory clarity\n\nEthereum futures ETF approval likely to come in at the earliest\n\nHal Press expects the news of an Ethereum futures ETF approval as early as October 2, ahead of the deadline of Valkyrie’s combined ETF product application. Press explains that it is possible that some news comes out earlier, but the latest possible date to watch for the approval of this investment product is in October 2’s post-market.\n\nThe following table shows deadlines for approval of different ETF applications:\n\nETF application status and SEC date\n\nCrypto investment giant Grayscale is the latest to file for an Ethereum futures ETF with the SEC. Earlier this week on September 19, Grayscale proposed listing and trading shares of the Grayscale Ethereum Futures Trust ETF under the New York Stock Exchange Arca Rule 8.200-E.\n\nAn approval of the Ethereum futures ETF could open the floodgates to similar investment products and usher in a bullish sentiment among ETH holders and traders.\n\nAt the time of writing, Ethereum price is ranging below $1,600 at $1,589 on Binance. Over the past week, ETH yielded a 2.33% loss for Ethereum holders."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0td2hhbGUtOC0xLW1pbGxpb24tb2YtZXRoLWJpbmFuY2UtYnV5cy1uZnRzL9IBXmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0td2hhbGUtOC0xLW1pbGxpb24tb2YtZXRoLWJpbmFuY2UtYnV5cy1uZnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Whale Unfazed By Prices, Pulls $8.1 Million Of ETH From Binance And Buys NFTs - NewsBTC",
        "content": "Ethereum is under pressure and has just dropped below $1,600. However, on-chain data shows that a crypto whale, “0xb154”, has moved more coins from Binance, a cryptocurrency exchange, to a non-custodial wallet.\n\nOn September 21, the ETH whale transferred over $8.1 million of the coin.\n\nWhale Moves More Ethereum From Binance, Buying NFTs\n\nWhen crypto prices contract, outflows from non-custodial wallets to centralized ramps, including Binance and Coinbase, tend to rise. This is because centralized exchanges supporting stablecoins or fiat, including the Euro or JPY, offer an interface where they can easily swap for the “safety” of the less volatile fiat currencies or tokens designed to mirror them, including USDT.\n\nThat the holder is shifting tokens away from Binance regardless of the heightened volatility can signal confidence for ETH and the broader Ethereum ecosystem. It is not immediately clear what could have motivated the whale to move coins away from the exchange at this point.\n\nHowever, what’s evident is that ETH is down roughly 4% from September 21’s peak and moving further away from April 2023 highs when it rose to over $2,100.\n\nRecords show this is not the first time the whale moved funds. On September 6, the investor withdrew 9,688 ETH worth $15.8 million from Binance. Less than two weeks earlier, the whale notably transferred 22,340 ETH, worth $41.2 million, to Binance.\n\nA closer examination of the same address shows it has 24,556.59 ETH worth over $38.8 million at spot rates. Besides ETH, the address controls dust amounts of other periphery altcoins, including ZUM and SWISE.\n\nApart from simply HODLing ETH, the whale has also been active on the non-fungible token (NFT) scene, looking at historical purchases. Over time, the investor has held over 100 NFTs where, on average, spent 0.2641 ETH; the latest purchase was on September 21.\n\nThe investor has been actively accumulating NFTs since early April 2023 and has spent over 35 ETH.\n\nETH And NFTs Are Fragile\n\nThe whale has accumulated more ETH and NFTs when the crypto market is fragile. To illustrate, NFT trading volume is over 90% down from 2021 peaks.\n\nPresently, ETH prices are down 25% from April 2023 peaks. When writing, bears have successfully forced the coin below June 2023 lows as the coin moves further away from the psychological $2,000 level. Candlestick arrangement points to weakness, suggesting that ETH could dump even lower to $1,400—or March 2023 lows, if sellers press on.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tYmVhcmlzaC1zaWduYWwtcHJpY2Uv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1iZWFyaXNoLXNpZ25hbC1wcmljZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Bearish Signal Reappears After Five Years To Threaten ETH’s Price - NewsBTC",
        "content": "Ethereum has been one of the cryptocurrencies to maintain a reasonably high level even through multiple price crashes in the market. However, it seems like the altcoin will not be able to hold as it has done in the past with a dreaded bearish signal resurfacing to threaten the asset’s price.\n\nEthereum Addresses Holding More Than 1,000 Coins Fall\n\nOver the last few years, the Ethereum whales have fervently held on to their coins. The large holders were some of the most convinced when it comes to the altcoin, with the number of wallets holding more than 1,000 coins maintaining above 2018 lows. However, the support has broken as conviction has declined.\n\nGlassnode reported on Wednesday, September 20, that the number of ETH addresses holding more than 1,000 coins has finally fallen to 6,082. The last time that the figure was this low was back in 2018 when the bear market was in full bloom.\n\nAddresses holding more than 1,000 coins fall to 5-year low | Source: Glassnode\n\nThis means that for the last five years, this number has held, until now. The significance of this decline is evident in what happened the last time when the figure was this low. With the bearish trend that was recorded in 2018, expectations have turned to a decline for Ethereum’s price as well.\n\nWhat Happened The Last Time?\n\nIn 2018 when this Ethereum metric was at this level, the altcoin’s price suffered massively. The year saw its price plunge from as high as $1,367 to as low as $80 in the span of 12 months. The low conviction that followed this would carry on into the next year, triggering a long bearish winter for ETH.\n\nEthereum’s already tepid hold on the $1,600 level is also threatened by massive sell-offs. Over the last few days, there have been a series of large transactions all carrying massive amounts of ETH toward centralized exchanges.\n\nThe most recent of these transactions include 22,343 ETH worth $36.2 million at the time of the transaction being moved to Coinbase. Two hours later, Whale Alert flagged another large transaction carrying 16,500 ETH ($26.77 million) to the OKEx crypto exchange.\n\nSince one of the major reasons why investors transfer tokens to centralized exchanges is to take advantage of their deep liquidity and sell their tokens, it is possible these whales are looking to sell these coins. In such a case, investors could be looking at massive selling pressure on the horizon for ETH, which could send its price back below the $1,600 support.\n\nETH bulls struggle to hold $1,600 support | Source: ETHUSD on Tradingview.com\n\nFeatured image from Bitcoinist, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8yMC9ldGhlcmV1bS13YWxsZXQtc3VkZGVubHktc2VsbHMtYWxsLWl0cy1ldGgtZm9yLW1pbGxpb25zLWluLXN0YWJsZWNvaW5zLWFmdGVyLWx5aW5nLWRvcm1hbnQtZm9yLW5lYXJseS01LXllYXJzL9IBkwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8yMC9ldGhlcmV1bS13YWxsZXQtc3VkZGVubHktc2VsbHMtYWxsLWl0cy1ldGgtZm9yLW1pbGxpb25zLWluLXN0YWJsZWNvaW5zLWFmdGVyLWx5aW5nLWRvcm1hbnQtZm9yLW5lYXJseS01LXllYXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Wallet Suddenly Sells All Its ETH for Millions in Stablecoins After Lying Dormant for Nearly Four Years - The Daily Hodl",
        "content": "A long-dormant Ethereum (ETH) wallet suddenly sold all $4.18 million worth of its ETH on Tuesday, according to the crypto tracker Lookonchain.\n\nThe wallet had held on to 2,591 ETH since November 2018, when the second-largest crypto asset by market cap was trading at around $110.\n\nEthereum is trading at $1,634 at time of writing, meaning the whale’s ETH holdings skyrocketed by a staggering 1,385% in nearly five years.\n\nLookonchain notes the whale swapped the Ethereum for the stablecoins USDT and DAI.\n\nIt’s not the only large wallet to dump its Ethereum holdings after a long period of inactivity: Lookonchain also reports that a different whale had been dormant for two years before transferring 10,000 ETH worth $16.5 million last week. It later deposited 10,000 ETH to the crypto exchanges Binance, KuCoin, and OKX via three addresses.\n\nAccording to the blockchain tracker, that second whale also transferred another 10,000 ETH this week.\n\nEthereum whales have demonstrated bearish behavior in the second and third quarters of 2023, according to the crypto analytics firm Santiment.\n\nExplained Santiment’s director of marketing Brian Quinlivan in late August,\n\n“There has been about a 4-month-long dump in supply from addresses holding between 10 and 10,000 ETH.\n\nThey really were accumulating significantly at the end of last year, but profit taking from these key tiers happened hard and quickly right as the price was hitting around a 1-year high of approximately $2,120.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzIyL3doYWxlcy1tb3ZlLW92ZXItNjYwMDAwMDAwLWluLWJpdGNvaW4tZXRoZXJldW0tYW5kLWNoYWlubGluay1oZXJlcy13aGVyZS10aGUtY3J5cHRvcy1oZWFkZWQv0gGBAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzIyL3doYWxlcy1tb3ZlLW92ZXItNjYwMDAwMDAwLWluLWJpdGNvaW4tZXRoZXJldW0tYW5kLWNoYWlubGluay1oZXJlcy13aGVyZS10aGUtY3J5cHRvcy1oZWFkZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Whales Move Over $660,000,000 in Bitcoin, Ethereum and Chainlink – Here’s Where the Crypto’s Headed - The Daily Hodl",
        "content": "Deep-pocketed crypto investors are moving hundreds of millions of dollars worth of digital assets as Bitcoin (BTC) dips below $27,000.\n\nNew data from whale-surveying platform Whale Alert shows that high-net-worth traders have abruptly moved over $660 million worth of Bitcoin, Ethereum (ETH), and Chainlink (LINK).\n\nNine of the 14 transactions moved digital assets to exchanges Binance, Coinbase, Gate.io and OKX.\n\nThe combined $426.9 million worth of BTC transactions on Whale Alert’s radar include:\n\nBitcoin is trading for $26,559 at time of writing, down 1.6% during the last 24 hours.\n\nMoving on to smart contract platform Ethereum, Whale Alert finds about $191.1 million worth of ETH transactions, including:\n\nEthereum is trading for $1,588 at time of writing, down 2.1% during the last day.\n\nLastly, Whale Alert notices two large transactions of decentralized oracle network Chainlink:\n\nChainlink is trading for $6.69 at time of writing, down 3.4% during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzIxL2JpdGNvaW4tc2xpZGVzLXRvLTI2NWstYW1pZC1zdXJnaW5nLXVzLWRvbGxhci1yZWNvcmQtaGlnaC1yYXRlcy1hcmUtbmlnaHRtYXJlLWZvci1jcnlwdG8tZmlybXMv0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjEvYml0Y29pbi1zbGlkZXMtdG8tMjY1ay1hbWlkLXN1cmdpbmctdXMtZG9sbGFyLXJlY29yZC1oaWdoLXJhdGVzLWFyZS1uaWdodG1hcmUtZm9yLWNyeXB0by1maXJtcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Slides to $26.5K Amid Surging U.S. Dollar; Record-High Rates Are ‘Nightmare’ for Crypto Firms - CoinDesk",
        "content": "“Crypto not only needs rates to peak, but for rate cut bets to grow,” Moya added. “The Fed still believes the soft landing will happen, but a few more stickier inflation reports and that will make those 2024 rate cut bets disappear.”"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jaGFpbmxpbmstaGl0cy1ldGhlcmV1bS1sYXllci0yLWFyYml0cnVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Chainlink hits Ethereum layer-2 Arbitrum for cross-chain DApp development - Cointelegraph",
        "content": "Blockchain oracle network Chainlink has tapped into Ethereum layer-2 scaling protocol Arbitrum to drive cross-chain decentralized application development.\n\nThe two protocols announced the mainnet launch of the Chainlink Cross-Chain Interoperability Protocol (CCIP) on Arbitrum One on Sept. 21, giving developers access to Chainlink’s solution, which taps into Arbitrum’s high-throughput, low-cost scaling.\n\nThe combination of CCIP and Arbitrum One’s ecosystem aims to unlock a myriad of use cases, including cross-chain tokenization and collateralization, blockchain gaming, data storage and computation.\n\nChainlink Labs chief business officer Johann Eid commented on the partnership, highlighting Arbitrum’s role in offloading transaction congestion from Ethereum’s base layer and providing a base to build decentralized applications (DApps).\n\n“CCIP now gives these users access to a highly secure and easy-to-use interoperability protocol built on Chainlink’s time-tested infrastructure, powering cross-chain smart contracts in a way that will open up new avenues of growth, accessibility, and innovation.”\n\nThe integration will marry Arbitrum’s optimistic rollup technology that currently commands around 60% of total value locked in the wider Ethereum layer 2 ecosystem. Arbitrum facilitates fast, low-fee transactions that are batched off-chain and then submitted to Ethereum’s base layer.\n\nThe optimistic rollup is assumed to be valid until proven otherwise by validators of the network.\n\nMeanwhile, CCIP allows developers to build cross-chain DApps that use arbitrary messaging and simplified token transfers. This taps into Chainlink’s decentralized oracle network that enables smart contracts to securely access off-chain data sources, APIs and payment systems.\n\nRelated: Blockchains need an interoperable standard to evolve, say crypto execs\n\nThe protocol allows smart contracts to interact with real-world data and events, making it possible for them to be triggered by data from external sources.\n\nStarkWare, another prominent Ethereum scaling technology firm, previously tapped into Chainlink’s oracle services. As Cointelegraph previously reported, StarkWare’s zero-knowledge proof rollup protocol StarkNet integrated Chainlink’s data and price feeds for its ecosystem in February 2023.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: NFT collapse and monster egos feature in new Murakami exhibition"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDkvMjEveHJwLWNvbXBsZXRlcy13YXZlLTItcG9pc2VkLXRvLXJhbGx5LTV4LW1vcmUtdGhhbi1ldGhlcmV1bS1pbi10aGlyZC13YXZlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "XRP Completes Wave 2, Poised to Rally 5x More Than Ethereum in Third Wave - The Crypto Basic",
        "content": "According to a recent analysis by top crypto market watcher Dark Defender, XRP sets sail to outperform Ethereum (ETH) by five times.\n\nDark Defender’s latest analysis leverages the Elliott Wave Theory and considers XRP’s price movements against Ethereum on the monthly timeframe. The analysis is a follow-up to his earlier posts on the current situation of the XRP/ETH market.\n\nPrevious Analyses\n\nHis first analysis in this series was in mid-July after XRP rallied to the $0.93 high on the back of the lawsuit victory. Dark Defender confirmed that this XRP price spike allowed the asset to break above a long-standing five-year resistance on the XRP/ETH chart.\n\n- Advertisement -\n\nThe analyst emphasized that XRP had begun flipping Ethereum as he drew five Elliott Waves on the weekly chart. XRP had already completed the first two waves and was on track to complete the third wave, which would see it outperform ETH by a large margin.\n\nHowever, Dark Defender’s second analysis, which came up in August, projected a drop for XRP to see the asset back-test the resistance point it broke in July. XRP underperformed in August, correcting the gains of July 13. Amid this bearish trend, the asset dropped against ETH.\n\nDark Defender noted that XRP would retest the previous resistance point and flip it into support before rallying further. He called attention to a green signal on the chart, asserting that it indicates that XRP would continue to appreciate against ETH in the long term.\n\nXRP to Outperform ETH by 5x\n\nIn the latest analysis, the chartist confirmed that XRP had completed the back-test against ETH. Notably, the asset successfully retested the resistance and turned it into a support point.\n\n- Advertisement -\n\nDark Defender believes XRP would now follow the third Elliott Wave, leading to a rapid surge against ETH. According to him, XRP would increase five times more than Ethereum. This would bring the XRP/ETH pair to a value of 0.001764.\n\nThis does not mean XRP will rally five times on its own; it only tells the asset will surge five times more than ETH. If ETH rises 2x, XRP will soar by 10x; if ETH surges 3x, XRP will increase by 15x.\n\nInterestingly, regardless of the rate, should XRP soar five times more than ETH, it would still not overtake ETH in the market cap. A five times increase would take XRP’s market cap from $27.4 billion to $137 billion at $2.5 per XRP. This is still below ETH’s $195 billion valuation."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1kZW5jdW4tZGF0ZS1taWdodC1iZS1wb3N0cG9uZWQtdW50aWwtbmV4dC15ZWFyLWhlcmVzLXdoedIBVWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1kZW5jdW4tZGF0ZS1taWdodC1iZS1wb3N0cG9uZWQtdW50aWwtbmV4dC15ZWFyLWhlcmVzLXdoeT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Dencun Date Might Be Postponed Until Next Year, Here's Why - U.Today",
        "content": "Advertisement\n\nEthereum Dencun, a hotly anticipated upgrade for the second largest blockchain, might be activated in 2024. The upcoming testing mechanism, Devnet-9, will include two new Ethereum Improvement Proposals (EIPs).\n\nEthereum Dencun mainnet activation might be delayed\n\nTim Beiko, chair of the ACDE calls, supposes that the Ethereum Cancun-Deneb (DenCun) upgrade might not be activated in 2023. If developers do not foresee launching Dencun on public testnet before Devconnect in November 2023, the update most likely would be activated in 2024.\n\n🚨 According to an Ethereum core developer, the activation of the Dencun mainnet may be delayed and might not occur this year as originally planned, citing the impact of the failed Holesky testnet launch. pic.twitter.com/PSe8o2PQnp — Camel_global (@Camel_global) September 22, 2023\n\nPreviously, Beiko had recommended activating Dencun upgrade on the following testnets in the following order: Holesky, Goerli and then, Sepolia.\n\nNext Wednesday, on Sept. 27, 2023, Ethereum (ETH) developers are going to launch Devnet-9, a crucial testbed for Q4, 2023, enhancements to Ethereum's (ETH) consensus design.\n\nParithosh Jayanthi, a DevOps Engineer at Ethereum Foundation, said that the consensus team is almost ready to launch Devnet-9. The new network might go live even without all clients being ready, Jayanthi stressed:\n\nWe can still start the devnet as long as we have at least a couple of clients ready and we can add the rest post [launch].\n\nAs covered by U.Today previously, Ethereum Dencun is the most anticipated upgrade in 2023. It includes the EIP 4844 and EIP 4788 upgrades crucial for the scaling and privacy of Ethereum (ETH) dApps.\n\nDevs give Holesky testnet second try\n\nAlso, Ethereum (ETH) developers discussed the activation of Holesky, a consensus testnet that is designed to replace Goerli. As the first launch of Holesky failed, developers are going to relaunch it on Sept. 28, 2023.\n\nOn Sept. 15, 2023, Holesky collapsed due to the misconfigiration and some other minor bugs.\n\nEthereum (ETH) core developers have been discussing the Dencun upgrade since April 2023. It is set to lay the ground work for the switch to the sharded design of the largest smart contracts platform."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zb3V0aC1rb3JlYS1idXNhbi1ldGhlcmV1bS1jb21wYXRpYmxlLWJsb2NrY2hhaW4tY2l0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Busan is developing an Ethereum-compatible mainnet to become a 'blockchain city' - Cointelegraph",
        "content": "South Korea’s second-largest city, Busan, is developing a public blockchain network compatible with mainstream blockchain platforms, such as Ethereum and Cosmos. The aim is to integrate blockchain-based services from various blockchain mainnets onto a single platform at the city level and develop Busan into a blockchain city.\n\nBusan City has allocated a 100-billion-Korean-won ($75 million) budget for open blockchain development compatible with global standards under the Blockchain Innovation Fund (BIF). The funds will be raised through investments from public financial institutions in Busan, with nearly 100 private companies showing interest. The BIF is a private fund that supports the development of Busan’s blockchain industry and infrastructure construction, led by financial and public institutions in Busan.\n\nThe public blockchain development is being done under the Busan Digital Asset Exchange Establishment Promotion Plan and Future Schedule plan, with a focus on making Busan a blockchain city.\n\nBusan Blockchain City Development Plan. Source: News1\n\nThe official announcement noted that Busan City has been actively testing various use cases of blockchain technology in its trade-free zone; however, most of these projects were carried out on different blockchains, resulting in an “uncomfortable” experience for businesses. This was one of the key reasons for the city administration to zero in on a public blockchain at the city level that is compatible with global blockchain networks such as Ethereum.\n\nRelated: Coin Center responds to US lawmakers’ request for crypto tax guidance\n\nBusan City is also involved in the process of establishing the Blockchain Trust Framework technology standard conducted by the Korea Internet & Security Agency.\n\nThe project aims to improve the quality of private services and encourage interconnection between services by presenting requirements such as blockchain technical system, performance and security level. The standard will also be utilized for public services within Busan City.\n\nThe long-term blockchain development plan also includes the development of the Busan digital asset exchange in the first half of 2024. The digital exchange will not only list digital assets but also tokenized securities, including precious metals and raw materials, such as gold, copper and oil. In the future, the administration behind the projects aims to tokenize and trade global intellectual property rights and carbon emissions rights.\n\nMagazine: Big Questions: Did the NSA create Bitcoin?"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8yMS9zaWduaWZpY2FudC1kb3duc2lkZS1tb3ZlLWZvci1ldGhlcmV1bS1hZ2FpbnN0LWJpdGNvaW4tbG9vbWluZy1zYXlzLWJlbmphbWluLWNvd2VuLWhlcmUtYXJlLWhpcy10YXJnZXRzL9IBjQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8yMS9zaWduaWZpY2FudC1kb3duc2lkZS1tb3ZlLWZvci1ldGhlcmV1bS1hZ2FpbnN0LWJpdGNvaW4tbG9vbWluZy1zYXlzLWJlbmphbWluLWNvd2VuLWhlcmUtYXJlLWhpcy10YXJnZXRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Significant Downside Move for Ethereum Against Bitcoin Looming, Says Benjamin Cowen – Here Are His Targets - The Daily Hodl",
        "content": "Crypto analyst Benjamin Cowen is saying that Ethereum (ETH) is likely to significantly underperform Bitcoin (BTC) over the near term.\n\nCowen tells his 787,000 YouTube subscribers that a severe plunge by the Ethereum/Bitcoin (ETH/BTC) pair could mark the end of the downward movement of altcoin prices.\n\n“I myself will flip bullish on the Ether/Bitcoin pair. it’s just that at this phase of the cycle I think it’s more likely to keep going down than to go up in the short term. That’s my view…\n\nWhen I look at this chart, it simply looks like there’s a much more likely chance that it breaks to the downside…\n\nAt some point in this fade, we likely get a more significant move to the downside to mark the end of the altcoin reckoning.”\n\nAccording to the widely followed crypto analyst, if the ETH/BTC pair mimics the price action demonstrated during the 2018/2019 bear market, it could plunge by around 35% from its 2022 low.\n\n“Just for the record 35% below that wick [2022 low] would put you at around 0.03200000 BTC.\n\nI think there’s still reason to believe that something like that could happen, that the Ether/Bitcoin pair could see a significant sell-off into the end of the year where it completely takes out this wick [0.04908000 BTC] and a lot of people might think that that wick is going to be the low. And then we just end up going lower.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9pcy1yaXBwbGUteHJwLWFib3V0LXRvLW91dHBlcmZvcm0tZXRoZXJldW0tZXRoLWJ5LTUwMC_SAVNodHRwczovL2NyeXB0b3BvdGF0by5jb20vaXMtcmlwcGxlLXhycC1hYm91dC10by1vdXRwZXJmb3JtLWV0aGVyZXVtLWV0aC1ieS01MDAvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Is Ripple (XRP) About to Outperform Ethereum (ETH) By 500%? - CryptoPotato",
        "content": "Ripple’s price has increased by 5.6% throughout the past seven days and is now trading above $0.5 after a period of depressing sideways action and declines.\n\nThe uptick in volatility and trading volume has also stirred the waters, with some analysts coming up with interesting XRP price predictions.\n\nWe reported earlier today that the most obvious target for XRP throughout a potential expansion phase would be its former all-time high at around $3.3. Meanwhile, if you’re interested in a more macro overview of Ripple’s potential performance during the next bull run, check out our recent video on the matter:\n\nThat said, one well-known analyst is pinning XRP to the second-largest cryptocurrency by means of total market capitalization – Ethereum (ETH). Back in July, he outlined that XRP was on the verge of breaking a resistance against ETH that was in place since 2018.\n\nNow, the analyst, who goes by the X handle Dark Defender seems to believe that XRP is about to outperform ETH by a factor of 5x.\n\nThe reasoning is that XRP managed to complete a successful backtest of said resistance against Ethereum.\n\nXRP/ETH pair completed the back-test. XRP is expected to appreciate 5 times more than ETH. Watch Ethere. The Misty Pond got a new King.\n\nIt’s important to note that XRP outperforming ETH doesn’t necessarily mean that it will flip in terms of price or market capitalization. It simply means that XRP will perform better in relative terms."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vd2hhbGVzLWFiYW5kb24tc2hpcC1ldGhlcmV1bXMtdmFsdWUtaW4tamVvcGFyZHkv0gFaaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS93aGFsZXMtYWJhbmRvbi1zaGlwLWV0aGVyZXVtcy12YWx1ZS1pbi1qZW9wYXJkeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Whales Abandon Ship? Ethereum’s Value In Jeopardy As Major Holders Liquidate - NewsBTC",
        "content": "Ethereum (ETH), a significant player in the crypto space, has recently come under scrutiny due to some concerning on-chain activities.\n\nNotably, the number of addresses holding significant amounts of Ethereum has declined, and some long-term holders appear to be liquidating their positions, potentially posing threats to Ethereum’s value.\n\nWhale Watch: A Steep Decline In Ethereum Holdings\n\nOn-chain analytics have been instrumental in offering real-time insights into crypto market trends. Recent revelations have highlighted a downturn in Ethereum’s holding patterns that might have deeper implications for the digital asset’s value and the market.\n\nAccording to Glassnode, a leading on-chain analytic platform, the number of addresses holding 1,000 Ethereum (ETH) coins or more has plummeted to a 5-year low.\n\nPrecisely, these addresses, often termed ‘whale addresses’ in the crypto world, have decreased to 6,082. Such a sharp decline can be attributed to the liquidation activities of some of Ethereum’s long-term holders.\n\nIt is worth noting that this contraction in whale holdings could potentially increase the susceptibility of Ethereum to market bears, potentially initiating a downward price trajectory.\n\nThe impact of such sales on the market is apparent. When large quantities of a cryptocurrency, such as Ethereum, are offloaded, it often leads to a considerable influx of selling pressure. This can cause panic among smaller investors, prompting further sales and possibly leading to a price drop.\n\nAdditional Pressures From Dormant Wallets\n\nInterestingly, another layer adds to Ethereum’s selling pressure alongside the decrease in large-scale holdings. According to data from Lookonchain, a renowned on-chain data analysis firm, a dormant Ethereum wallet, untouched for around four years, has suddenly sprung into action.\n\nThe wallet in question liquidated its entire ETH holding, quickly pushing roughly $4.81 million worth of the altcoin into the market.\n\nA wallet that had been dormant for 4 years sold all 2,591 $ETH for $4.18M stablecoins 6 hours ago.https://t.co/et78rXHG5u pic.twitter.com/pJanMLxwA3 — Lookonchain (@lookonchain) September 20, 2023\n\nSuch unexpected sales from long-inactive wallets could raise alarms in the market. While the exact reasons behind such liquidations often remain concealed, they invariably amplify the selling pressures on the affected cryptocurrency, which, in this case, is Ethereum.\n\nMeanwhile, Ethereum’s price has seen a slight bullish trajectory over the past week, up 1.4%. The asset has moved from a low of $1,596 seen last Wednesday to trade above $1,650 on Monday before retracing to $1,626, at the time of writing down by 1.8% in the past 24 hours.\n\nFeatured image from Unpslah, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdS50b2RheS9sb25nLWRvcm1hbnQtZXRoZXJldW0tZ2VuZXNpcy13YWxsZXQtYXdha2Vucy10by10cmFuc2Zlci1ldGgtdG8tY29pbmJhc2XSAVxodHRwczovL3UudG9kYXkvbG9uZy1kb3JtYW50LWV0aGVyZXVtLWdlbmVzaXMtd2FsbGV0LWF3YWtlbnMtdG8tdHJhbnNmZXItZXRoLXRvLWNvaW5iYXNlP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Long-Dormant Ethereum Genesis Wallet Awakens to Transfer ETH to Coinbase - U.Today",
        "content": "Advertisement\n\nA previously inactive Ethereum ICO participant transferred 32.1 ETH to Coinbase, after remaining dormant for eight years. This particular Ethereum address, which appears to be linked to shemnon.eth (@shemnon), was part of the Ethereum Genesis and had initially received 200 ETH.\n\nThe sudden activity has piqued interest and speculation within the cryptocurrency community, particularly given the significant value appreciation of Ethereum since its inception.\n\nRecent stirrings of early ETH whales\n\nOver the past few months, several Ethereum addresses associated with the platform's initial coin offering (ICO) have shown activity after years of inaction. For instance, in July, an Ethereum ICO participant ended an eight-year hiatus, depositing an enormous 61,216 ETH, valued at roughly $116 million, into the cryptocurrency exchange, Kraken.\n\nFurthermore, in a separate incident aligning with Ethereum's eighth anniversary, another long-inactive wallet transferred 641 ETH and began staking, equating to a value of approximately $1.19 million.\n\nSuch transactions draw attention not just because of their substantial size, but due to the significant gains these early Ethereum supporters have seen.\n\nWith Ethereum's ICO price being a mere $0.31 per ETH and its current market price hovering around $1,623, early adopters have witnessed exponential growth in their investments.\n\nPossible reasons behind the moves\n\nThe sudden movement of significant amounts of Ethereum from wallets that have been inactive for years raises questions about the motives behind these transfers. Some might speculate that the original holders, seeing Ethereum's impressive price rally over the years, might be taking profits or diversifying their portfolios. Others might believe these moves could be related to the increasing popularity of Ethereum staking, allowing holders to earn rewards by participating in the network's security."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtaGlnaGxpZ2h0LW9mLWEtdm9sYXRpbGl0eS1maWxsZWQtd2Vlay1pcy1oZXJlLTIwMjMwOTIwMTc0ONIBnAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLWhpZ2hsaWdodC1vZi1hLXZvbGF0aWxpdHktZmlsbGVkLXdlZWstaXMtaGVyZS0yMDIzMDkyMDE3NDg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Opportunity will come and patience will be rewarded - FXStreet",
        "content": "Share:\n\nBitcoin price rests below the $27,500 level as those who profited in the September 12-18 rise recently await the next move.\n\nEthereum price is likely to fall 5% if BTC shows weakness, sending ETH for a liquidity grab below the $1,552 support level.\n\nRipple price must break and close above the mean threshold at $0.5337 or fall 10% retracing the $0.4600 level.\n\nBitcoin (BTC) price holds steady with reduced trading volume as the weekend mood sets in. Ethereum (ETH) price hackens to the BTC cue, with both cryptos engaging low gear. Meanwhile, Ripple (XRP) price is rejected from a key level but maintains an overall bullish outlook.\n\nAlso Read: Bitcoin Weekly Forecast: BTC downside likely after 20-week EMA culls bulls\n\nBitcoin price holds below $27,000\n\nBitcoin (BTC) price dropped below the $27,000 psychological level, with investors digesting the FOMC meeting reports following the Federal Interest Rate decision. The current stance could be attributed to the weekend mood, or more ideally, traders having taken profits from the September 12-19 upswing and are now waiting for the next move.\n\nIt is likely that Bitcoin price could extend the slump below the $26,000 psychological level before a possible pullback with the odds of a move below the $25,229 level increasing by the day. A decisive break and close below this level would confirm the downtrend.\n\nBTC/USDT 1-day chart\n\nHowever, if the Relative Strength Index (RSI) decisively moves above 50, Bitcoin price could shatter the downtrend line at $27,210, clearing the path for more gains. This could potentially deliver BTC above the $28,000 psychological level.\n\nAlso Read: Bitcoin trading volume in spot and derivatives market points to dwindling liquidity, limits price growth\n\nEthereum price follows BTC to the heel\n\nEthereum (ETH) price could have little to say as far as its next move is concerned, considering the Proof-of-Stake (PoS) token has been mirroring the price action of Bitcoin for quite some time now, owing to its strong correlation with BTC.\n\nIndependently, however, Ethereum price remains bare, with momentum falling as indicated by the RSI dropping. The immediate support at $1,624 is therefore critical for ETH, as losing it would plunge it back under a confining bearish trendline. The downtrend could go as low as the $1,552 level.\n\nETH/USDT 1-day chart\n\nOtherwise, if bullish momentum increases, Ethereum price could very well rise above the immediate hurdle at $1,682, then $1,791, with a confirmed daily candlestick close above the $1,900 likely to kickstart an uptrend. The steady climb of the AO is a good sign, with the sustained green shade solidifying the case for the bulls.\n\nAlso Read: Ethereum and Bitcoin are ready to dive\n\nRipple price repels the MT\n\nRipple (XRP) price has repelled the supply zone order block's mean threshold (MT) at $0.5337. However, the overall outlook is still bullish, with the RSI inclined north and the AO steadily climbing to the positive region. Nevertheless, investors should still wait for confirmation above the aforementioned level for the uptrend to be considered plausible.\n\nXRP/USDT 1-day chart\n\nA strong rejection from the mean threshold, potentially positioning Ripple price under $0.4600 could mean the supply zone will hold as a resistance level, with the ensuing selling pressure sending Ripple price toward the foot of the latest uptrend at $0.4600. In the dire case, the downtrend could continue, with the remittance token potentially tagging the May lows at $0.4191.\n\nAlso Read: XRP is the next Bitcoin if we solve a multi-trillion-dollar problem, Ripple CEO Brad Garlinghouse"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW9uLWNoYWluLW1ldHJpY3MtdGFuay1hZnRlci1zaGFuZ2hhaS11cGdyYWRlLXNob3VsZC1pbnZlc3RvcnMtd29ycnkv0gFmaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tb24tY2hhaW4tbWV0cmljcy10YW5rLWFmdGVyLXNoYW5naGFpLXVwZ3JhZGUtc2hvdWxkLWludmVzdG9ycy13b3JyeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Network Activity Disappoints After Shanghai Upgrade - CoinGape",
        "content": "Insights shared by JPMorgan suggest that the Ethereum blockchain network has seen a major downturn in network activity and other on-chain metrics following the Shanghai upgrade in April.\n\nThe analysts at JPMorgan pointed out a decline in Ethereum’s daily transactions, daily active addresses, and the total value locked (TVL) in decentralized finance (DeFi) protocols on the network. In a note on Thursday, JPMorgan analysts led by Nikolaos Panigirtzoglou wrote:\n\nadvertisement\n\n“While the shift from proof-of-work to proof-of-stake that resulted from the Merge upgrade meant that the energy consumption for the Ethereum network collapsed by more than 99%, the Ethereum supply is shrinking and staking rose sharply (with the amount of ether staked up by 50% since the Shanghai upgrade), the increase in network activity has been rather disappointing”.\n\nThe decline in Ethereum activity indicates that several “bearish forces” that have persisted over the past year. This includes the FTX and Terra incidents, regulatory uncertainties and enforcement actions in the U.S., declining institutional interest in cryptocurrency, and reduced venture capital investment.\n\nJPMorgan analysts believe that this may have had a more substantial impact than the positive effects of the Shanghai upgrade on Ethereum’s network activity. Also, Ethereum has given a dismal price performance against Bitcoin over the last few months.\n\nEthereum Enthusiasts Excited About Sharding\n\nThe cryptocurrency sector is currently pinning its hopes on the EIP-4844 upgrade, also known as protodanksharding, with the expectation of a significant boost in Ethereum network activity. Nevertheless, the JPMorgan analysts caution that “persistent negative crypto factors continue to pose challenges.”\n\nProtodanksharding represents an initial phase leading towards the eventual adoption of danksharding. Rather than dividing the Ethereum blockchain into numerous shard chains, danksharding introduces data-containing blobs. These are temporary data packets appended to blocks, capable of accommodating more data than the blocks themselves.\n\nEthereum Community Challenges JPMorgan Observations\n\nSome Ethereum community enthusiasts have raised questions over JPMorgan’s observations. Ethereum enthusiats @MattKunke believes that JPMorgan is just looking at L1 transactions. However, the Ethereum Layer-2 solutions have shown tremendous improvements.\n\nAlmost guarantee they just looking at L1 transactions too instead of: https://t.co/RPyE2KggA4 — mattkunke.eth 🦇🔊 (@MattKunke) September 22, 2023\n\nAnother concern currently with Ethereum is the massive validator concentration on the network. At present, the network boasts nearly 800,000 active validators, marking a 41% surge since the introduction of the “Shapella” upgrade in April, which facilitated staked ETH withdrawals.\n\nChristine Kim from Galaxy Research said that “Ethereum is getting close to reaching an unsustainable number of active validators. It’s pretty technical, but network “latency” is becoming a key problem”.\n\nDo Ethereum Investors Have to Worry?\n\nThe ETH Price has already come under pressure and is trading under $1,600 levels at the press time. However, there’s a likelihood of Ethereum futures ETFs coming to the market by the next month of October. This could prove to be a major catalyst to drive the Ethereum price higher."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDkvMjIvZXRoZXJldW0tZGVuY3VuLXVwZ3JhZGUtbWlnaHQtYmUtZGVsYXllZC10by1uZXh0LXllYXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Dencun Upgrade Might Be Delayed To Next Year - Crypto Times",
        "content": "Dencun, the next major upgrade on Ethereum network could be delayed as late as next year as its testnet version has not been implemented yet.\n\nIn the 118th Consensus Layer Meeting yesterday, Ethereum developers talked over the potential release time for the upcoming Dencun upgrade. Tim Beiko, the prominent figure from the Ethereum Foundation hosted the meeting and he shared concerns on the to-be-delayed release of Dencun upgrade on mainnet.\n\nThe core Ethereum developers discussed that the upgrade is not yet introduced on testnets as it’s currently in devnet phase. The upgrade is set to be tested on a local developer network called ‘Devnet 9’ next week prior to its release on public testnets.\n\nBeiko expressed that if Dencun is not introduced on public testnet before Devconnect event taking place in November, 2023, the mainnet implementation for the upgrade might not occur this year as projected before.\n\nThe proposal EIP-4844 dubbed Dencun Upgrade was introduced in February 2022 and it aims to improve Ethereum scalability by introducing major updates in the execution layer and consensus layer.\n\nThe upgrade introduces a new transaction format called “shard blob transactions” which will allow storing off-chain data temporarily till Ethereum nodes access it and broadcast to the network. This will ultimately reduce gas fees even more on layer 2 rollups such as Arbitrum and Optimism.\n\nWith this upgrade, the execution layer – the smart contract execution engine – will be renamed to Cancun and the consensus layer – which sees the network decentralization via staking – will be renamed to Deneb. Hence the upgrade is named Dencun and its also known as proto-danksharding."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGgtZGV2ZWxvcGVyLXByb2dyYW1zLWFpLWNyeXB0b2N1cnJlbmN5LWFzdHJvcGVwZXgtdXNpbmctY2hhdGdwdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "ETH developer programs AI-generated memecoin AstroPepeX using ChatGPT - Cointelegraph",
        "content": "An Ethereum developer has managed to get ChatGPT to launch its own ERC-20 token, AstroPepeX (APX), modeled off data from the top traded tokens on Uniswap.\n\nX (previously Twitter) user CroissantETH unpacked details of how they integrated ChatGPT into a custom application using OpenAI’s API. They told it to design and issue its own ERC-20 token with an estimated market cap of $3.5 million.\n\nData from Etherscan reveals that there are now over 2,300 APX holders that have carried out over 17,700 transactions since the token mint on Sept. 20.\n\nWhat if ChatGPT could deploy its own token?\n\n\n\nSurely this shouldn't be possible, right? pic.twitter.com/Wz5OvakwxC — ‍.eth (@CroissantEth) September 19, 2023\n\nThe developer managed to get ChatGPT to be able to deploy smart contracts on the Ethereum network after feeding it data on the top 10,000 traded tokens on Uniswap.\n\n“In essence, it asks ChatGPT to form an ERC-20 token using Open Zeppelin standards. The token name & other parameters are designed to be passed in by values given by GPT in the code’s constructor.”\n\nCroissantETH also explained how ChatGPT’s first attempts at potential names for its ERC-20 token were not ideal. The developer’s solution was to integrate data from the top traded Uniswap tokens to give the large language model a more natural-sounding output.\n\n“GPT-4 evidently had a much better understanding of crypto culture while also offering its own creativity in responses.”\n\nTo ensure the token was made solely by GPT before deploying the contract, CroissantETH addressed ownership of the private keys and the contract with a solution that ruled out any human intervention.\n\n“Once the contract is deployed, ownership is immediately revoked and 100% of the tokens are added alongside 2 ETH to liquidity on Uniswap upon creation.”\n\nThus AstroPepeX was created, sending 65,000,000,000 APX tokens and 2 Ether (ETH) in liquidity to Uniswap’s decentralized exchange.\n\nIt's time to let GPT takeover.\n\n\n\nI just ran the script, & it created:\n\n\n\nAstroPepeX\n\n\n\n65,000,000,000$APX\n\n\n\n0xed4e879087ebD0e8A77d66870012B5e0dffd0Fa4\n\n\n\n(Note: There is a require condition that limits transfers >0.5% of the supply)\n\n\n\nEnjoy! pic.twitter.com/FjoQpDdhM3 — ‍.eth (@CroissantEth) September 19, 2023\n\nUsing exclusive access to blockchain analysis tools from Nansen 2’s beta, Cointelegraph confirmed that APX tokens have indeed moved onto decentralized finance platforms like Poloniex and centralized exchanges including Bitget, MEXC and LBank.\n\nNansen 2 beta's Token God Mode dashboard for the AstroPepeX token.\n\nPoloniex also promoted the token’s listing on X, opening deposits and trading on its exchange on Sept. 21.\n\nAstroPepeX #APX is Poloniex newest listing! @CroissantEth\n\n\n\nDeposit will be opened on September 21st, 12:00 (UTC)\n\n\n\nSeptember 21st (UTC), Post-only mode will be enabled on 12:00 & Full trading will be enabled on 13:00https://t.co/d17DLkFcUL#NewListing #crypto pic.twitter.com/zzKPVFSVoZ — Poloniex Exchange (@Poloniex) September 21, 2023\n\nAstroPepeX’s website links to its Ethereum address and social media handles. Among these is a community Telegram group with some 1,500 members, as well as a BuyTech bot posting automatic updates of APX trades and the current market capitalization of the token. CroissantETH later tweeted that the token does not have an official Telegram group.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Make 500% from ChatGPT stock tips? Bard leans left, $100M AI memecoin: AI Eye"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYm9sZC5jb20vY2hhdGdwdC1naXZlcy10b3AtMy1jcnlwdG8tcHJpY2UtcHJlZGljdGlvbnMtYml0Y29pbi1ldGhlcmV1bS14cnAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "ChatGPT Gives Top 3 Crypto Price Predictions: Bitcoin, Ethereum, XRP - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nBitcoin, Ethereum, and XRP remain three of the most talked-about cryptocurrencies, owing to their size and first-mover advantage.\n\nHowever, these cryptos have had a tough few weeks as the broader market has flipped bearish.\n\nIn this article, we turn to ChatGPT to obtain insights into the potential future price movements of BTC, ETH, and XRP before highlighting an alternative coin that the AI model believes could be primed for significant growth soon.\n\nChatGPT Predicts Over 2x Return for Bitcoin by 2025\n\nFirst up is Bitcoin (BTC) – the world’s largest cryptocurrency, as measured by market cap.\n\nAlthough BTC’s price is still up 59% since the start of the year, it has faced volatility in recent weeks, with several pullbacks testing the commitment of long-term holders.\n\nAt the time of writing, Bitcoin hovers around the $26,450 level, having rejected the support zone at $25,000 on September 12.\n\nInterestingly, ChatGPT predicts Bitcoin could rebound to $32,000 by the end of 2023, citing the pending spot BTC ETF filings as a potential catalyst.\n\nLooking ahead to 2024, if positive momentum continues alongside mainstream adoption, ChatGPT believes Bitcoin could hit $48,000.\n\nFinally, in 2025, assuming consistent growth and a favorable investment climate, ChatGPT speculates that Bitcoin may reach $60,000 – 126% higher than today’s price.\n\nChatGPT Predicts ETH Could Hit $4,500 in the Next Two Years\n\nEthereum (ETH), the world’s second-largest cryptocurrency with a market cap of $189 billion, has also had a rocky few weeks in the market.\n\nLike Bitcoin, Ethereum is up significantly since January 1, yet the token’s price has been highly volatile of late, dropping 22% since mid-July.\n\nThis sustained drop has followed ETH’s latest attempt to break the psychologically important $2,000 level, which hasn’t been breached cleanly since April.\n\nHowever, ChatGPT believes that Ethereum could still climb to approximately $2,200 by the end of the year – assuming that broader market sentiment turns bullish.\n\nLooking to 2024, continued growth as a major DeFi platform may boost ETH’s value to around $3,300, according to ChatGPT.\n\nBy the end of 2025, assuming sustained adoption and innovation, ChatGPT speculates that ETH could reach a valuation of $4,500 – 187% higher than today’s price.\n\nXRP Could Return to $1.10 by 2025, According to ChatGPT\n\nLastly, XRP (XRP) has had a rollercoaster ride in 2023, primarily due to the highly publicized legal battle with the SEC.\n\nBack in mid-July, Ripple Labs scored a partial victory against the SEC, which sent the XRP price rocketing over 100% in a matter of hours.\n\nUnfortunately, after weeks of speculation, the SEC announced that it plans to appeal the court’s decision – prompting the XRP price to plummet over the following two months.\n\nAlthough uncertainty around XRP’s prospects remains high, ChatGPT predicts that XRP could be about to rebound and hit $0.68 by the end of 2023.\n\nAdditionally, in 2024, a resolution in Ripple’s favor or broader crypto growth could boost XRP to $0.85, based on ChatGPT’s analysis.\n\nFinally, by the end of 2025, ChatGPT speculates that XRP could rise as high as $1.10, contingent on adoption within traditional financial systems, regulatory clarity, and favorable market conditions.\n\nWhich Other Cryptos is ChatGPT Bullish On?\n\nWhile ChatGPT sees potential in major coins like Bitcoin, Ethereum, and XRP, the AI model is also optimistic about some lesser-known tokens.\n\nOne token that appears to have caught ChatGPT’s eye is Bitcoin BSC – a Binance Smart Chain project that has raised over $4 million through its presale in just three weeks.\n\nTrending Bitcoin BSC Presale Fuels ChatGPT’s Bullish Price Prediction\n\nBitcoin BSC (BTCBSC) is a stake-to-earn version of Bitcoin that uses the BEP-20 standard, a combination that has yet to be seen in the crypto market.\n\nBTCBSC aims to be a low-cost and scalable alternative to Bitcoin, with the same total supply of 21 million coins and a presale price of just $0.99.\n\nBy holding BTCBSC, investors can earn rewards released every 10 minutes, following the same schedule as Bitcoin’s block rewards.\n\nAs outlined on Bitcoin BSC’s staking dashboard, estimated yields are currently at 127% per year, with over 2 million tokens already staked.\n\nConsidering Bitcoin BSC’s presale started less than three weeks ago, this figure indicates strong early interest from the crypto community.\n\nAdditionally, the presale has already reached its soft cap target of $4 million and is trending towards the $6 million hard cap goal.\n\nThese factors have created a rapidly growing buzz around BTCBSC, with over 7,500 people following the project’s official X (formerly Twitter) account.\n\nGiven this context, ChatGPT predicts that Bitcoin BSC’s powerful presale start and multiple influencer endorsements could push the token’s value to $3.50 by the end of 2023.\n\nLooking ahead to 2024, as BTCBSC’s staking protocol and DeFi integration expand, its price could climb to $7, per ChatGPT’s analysis.\n\nLastly, by 2025, sustained adoption, innovation, staking rewards, and positive market sentiment could help drive BTCBSC to a value of $12 – a 12x increase from the current presale price.\n\nVisit Bitcoin BSC Presale"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpbmFuY2UvdGhpcy1iaW5hbmNlLXdhbGxldC10cmlnZ2VyZWQtYS10ZW1wb3JhcnktMzB4LXN1cmdlLWluLWV0aGVyZXVtLWdhcy1mZWVzL9IBbWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpbmFuY2UvdGhpcy1iaW5hbmNlLXdhbGxldC10cmlnZ2VyZWQtYS10ZW1wb3JhcnktMzB4LXN1cmdlLWluLWV0aGVyZXVtLWdhcy1mZWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "This Binance Wallet Triggered A Temporary 30X Surge In Ethereum Gas Fees - NewsBTC",
        "content": "A cryptocurrency wallet associated with the prominent trading platform, Binance, has seen massive activity in the last 24 hours, leading to abnormally high transaction fees on the Ethereum network.\n\nBinance Wallet Incurs Nearly $850,000 Gas Fees In One Day\n\nA crypto wallet labeled “Binance 14” witnessed a significant transaction surge on September 21, rising above 140,000. As a result of this activity surge, transactions of the Binance-owned wallet consistently incurred gas fees of over 300 gwei, even though the network’s average fee was around 10 gwei.\n\nThis gas fee jump and significant wallet activity have resulted in around 530 ETH (equivalent to nearly $850,000) in gas used on the Binance 14 address today.\n\nThe increase in transactions on the Binance wallet had a broader, albeit temporary, impact on the Ethereum network. Gas fees on the blockchain momentarily jumped from less than 10 gwei to above 330 gwei per transaction, according to blockchain data tracker Etherscan.\n\nGas fees refer to the cost blockchain users incur or pay validators to conduct transactions or execute contracts on the Ethereum network. Fees depend on the blockchain’s demand and supply of processing power. This means when a network has many transactions, there is often a high demand for processing power, which increases gas fees.\n\nPossible Reasons For The Gas Fee Spike\n\nIn the wake of this incident, Wu Blockchain reported that Binance said it was carrying out its wallet aggregation process when the gas fees were low to facilitate withdrawals and ensure the safety of user funds. Nonetheless, some prominent crypto community members have weighed in on the situation, offering possible explanations for the gas fee spike.\n\nMartin Koppelmann, cofounder of the Gnosis chain, said on the X (formerly Twitter) platform that Binance might be using a “really inefficient script” to consolidate, leading to high transaction costs.\n\nGas prizes spiking because of a ton of regular ETH transfers related to Binance.\n\na) they are using a really inefficient script to consolidate funds and are massively overpaying transaction costs\n\nb) something fishy is going on — Martin Köppelmann 🦉💳 (@koeppelmann) September 21, 2023\n\nBlockchain analysts at Scopescan gave a similar prognosis on the gas incident. The on-chain analytics platform said:\n\nDue to Binance consolidating funds from long-inactive deposit addresses, the Ethereum network is experiencing congestion, causing Gas fees to surge to 300 gwei.\n\nAdam Cochran, a popular crypto investor, suggested that the abnormally high transaction fees might have been due to Binance’s subpar APIs. In his X post, Cochran criticized the exchange’s technological infrastructure while casting doubts on its capacity to safe-keep “hundreds of billions in coins across multiple protocols.”\n\nAccording to CoinGecko data, the price of Ethereum currently sits below $1,600, reflecting a 2.8% decline in the past 24 hours. Nevertheless, Ether maintains its position as the second-largest cryptocurrency, with a market capitalization of over $190 billion.\n\nEthereum price trading beneath $1,600 on the daily timeframe | Source: TOTAL chart on TradingView\n\nFeatured image from Unsplash, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmNjbi5jb20vZWR1Y2F0aW9uL2hvdy10by1idXktYml0Y29pbi13aXRoLW1ldGFtYXNrLXdhbGxldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "How To Buy Bitcoin With MetaMask Wallet - CCN.com",
        "content": "Key Takeaways\n\nMetaMask is a self-custody wallet emphasizing internet privacy, consent, and association.\n\nThe MetaMask wallet connects users to the Ethereum blockchain ecosystem.\n\nMetaMask does not facilitate the acquisition of Bitcoin directly; however, it does allow transactions involving Wrapped Bitcoin (WBTC).\n\nWBTC, an ERC-20 token, bridges Bitcoin’s value to Ethereum’s decentralized apps.\n\nMetaMask is a leading self-custody wallet made up of a dedicated team of developers and designers. The primary vision of the browser extension, Metamask, is to revolutionize how individuals interact with the internet, emphasizing consent, privacy, and free association. MetaMask is at the forefront of creating a more decentralized and equitable digital landscape.\n\nBeyond merely being a digital wallet, MetaMask acts as a bridge connecting users to the Ethereum blockchain and its vast ecosystem.\n\nPurchasing Bitcoin Via MetaMask\n\nWhile MetaMask primarily supports Ethereum Virtual Machine (EVM)-based currencies, it doesn’t allow direct Bitcoin purchases. Users may, however, exchange Ether (ETH) or other ERC-20 tokens for a Bitcoin-equivalent known as wrapped Bitcoin (WBTC).\n\nWhat Is Wrapped Bitcoin?\n\nShedding light on the innovative spirit of the cryptocurrency world, WBTC emerged in January 2019 as a bridge between Bitcoin and Ethereum’s decentralized applications (DApps). This ERC-20 token, sitting on Ethereum’s infrastructure, mirrors Bitcoin’s value on a one-to-one basis.\n\nPrior to its inception, the utilization of Bitcoin in financial dealings was largely funneled through centralized avenues, centralized exchanges (CEXs). However, WBTC has ushered in a new era where decentralized exchanges (DEXs) facilitate its exchange, and it’s increasingly leveraged as collateral across various financial platforms.\n\nStep-By-Step Guide To Using Metamask: Downloading and Installing the Browser Extension/App\n\nSteps For Users Who Wants To Access MetaMask Via Web Browsers\n\nWebsite navigation: Navigate to the official MetaMask website to ensure you’re accessing the authentic platform.\n\nBrowser selection: Choose the version tailored for your specific browser, be it Chrome, Firefox, Brave , or Edge.\n\nInstallation prompt: Click on the “Install MetaMask” option to initiate the installation process.\n\nExtension addition: You will be directed to your browser’s extension/add-on page. From there, select “Add to [Your Browser]” or “Install” to continue.\n\nSuccessful installation: Post installation, you should easily spot the distinctive fox icon for MetaMask on your browser’s toolbar, indicating a successful setup.\n\nSteps For Users Who Wants To Access MetaMask Via Mobile Devices\n\nApp store navigation: Visit the designated app store for your device, be it the App Store for iOS users or Google Play for those on Android.\n\nSearch function: In the search bar, type “MetaMask” to locate the official app.\n\nApp download: Download and initiate the installation process for the MetaMask application.\n\nSteps To Setting Up A New MetaMask Wallet\n\nApp launch: Tap on the MetaMask icon, recognized by its fox emblem, to open the app.\n\nInitial setup: Start by clicking “Get Started”.\n\nWallet creation: For those unfamiliar with MetaMask, select “Create a Wallet”.\n\nData collection preference: A prompt regarding data collection may appear. Choose as per your comfort level and proceed.\n\nPassword setup: For your wallet’s security, set a robust password.\n\nRecovery essentials: A “Secret Recovery Phrase” will be presented. Treat this with extreme caution, as it’s crucial for future wallet retrieval.\n\nSteps To Fund Your MetaMask Wallet\n\nThe need for ether: Before delving into WBTC, ensure you have Ether (ETH) in your MetaMask. ETH covers transaction fees (often termed “gas”) and possibly the direct acquisition of WBTC.\n\nAccessing MetaMask: Click the MetaMask extension icon for easy access.\n\nAddress retrieval: To obtain your unique wallet address, click on the account name at the top.\n\nETH transfer: Send ETH to the copied address, either from another wallet or through an exchange.\n\nEngaging with a decentralized exchange (DEX)\n\nDEX choice: Although numerous platforms exist, one may utilize Uniswap for this illustration.\n\nUniswap Website Visit: Access Uniswap’s official website.\n\nInitiating Uniswap: Click either “Use Uniswap” or “Launch App”.\n\nWallet Connection: If MetaMask doesn’t automatically sync, there should be a clear option allowing you to manually connect.\n\nSteps To Executing The ETH To WBTC Swap\n\nToken selection: The interface will present two dropdown menus. Select ETH in the first and in the second, pinpoint and choose WBTC.\n\nQuantity specification: Input the ETH quantity for swapping or the WBTC amount you’re aiming to obtain.\n\nRate verification: Before proceeding, scrutinize the conversion rate and affirm its acceptability.\n\nInitiating the swap: Click on “Swap” or “Exchange”.\n\nConfirmation: A window detailing the transaction, inclusive of gas fees, will emerge. Validate these details.\n\nFinal transaction approval: MetaMask will request a transaction confirmation, where gas fees can also be viewed and adjusted.\n\nAwaiting confirmation: Patiently wait as the Ethereum network validates the transaction. You can monitor this using MetaMask or through Ethereum block explorers like Etherscan.\n\nReviewing Your WBTC assets\n\nAccessing MetaMask: Reopen the MetaMask extension.\n\nWBTC display: If WBTC isn’t visible among your assets, you might need to manually introduce it.\n\nToken inclusion: To add WBTC, click “Add Token” and locate “WBTC”. Now, your WBTC balance should be evident.\n\nConclusion\n\nMetaMask stands as a tool in the modern digital landscape, underpinned by a vision of decentralization, privacy, and user empowerment. Beyond serving as a mere digital wallet, it provides a seamless conduit to the expansive Ethereum ecosystem, facilitating transactions like the acquisition of Wrapped Bitcoin (WBTC) — an innovative bridge linking Bitcoin and Ethereum’s DApps.\n\nWith a user-friendly interface, clear installation guidelines, and a robust security framework, MetaMask is a testament to the evolving synergy between user experience and blockchain technology, ushering in a new era of digital interactions and financial exchanges.\n\nFAQs\n\nWhat is MetaMask?\n\nMetaMask is a renowned self-custody wallet developed by a dedicated team. It aims to transform online interactions, emphasizing consent, privacy, and free association, promoting a decentralized internet landscape.\n\nHow does MetaMask differ from other digital wallets?\n\nBeyond being a digital wallet, MetaMask serves as a gateway to the Ethereum blockchain and its extensive ecosystem, enabling users to explore a variety of decentralized applications and services.\n\nCan I buy Bitcoin directly with MetaMask?\n\nNo, MetaMask primarily supports EVM-based currencies and doesn’t facilitate direct Bitcoin purchases. However, users can exchange Ethereum or other ERC-20 tokens for Wrapped Bitcoin (WBTC), an equivalent to Bitcoin on the Ethereum blockchain.\n\nWhat is Wrapped Bitcoin (WBTC) and its significance?\n\nWBTC is an ERC-20 token on Ethereum that mirrors Bitcoin’s value 1:1. Launched in January 2019, it enabled Bitcoin’s use on Ethereum’s decentralized applications, expanding Bitcoin’s utility beyond centralized platforms like CEXs."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wOS8zNDgzMDg5Mi9iaXRjb2luLWV0aGVyZXVtLWFuZC1kb2dlY29pbi10cmFkZS1tdXRlZC1pbi13YWtlLW9mLWZlZC1kZWNpc2lvbi1hLWxvb2stYXQtdGhlLWNyeXB0b3MtaW7SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzQ4MzA4OTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum And Dogecoin Trade Muted In Wake Of Fed Decision: A Look At The Crypto's Into The Weeke - Benzinga",
        "content": "Bitcoin BTC/USD was trading mostly flat during Friday’s 24-hour trading session in the wake of this week's Federal Reserve meeting, where the central bank applied a pause on hiking interest rates.\n\nEthereum ETH/USD and Dogecoin DOGE/USD also traded flat, in tandem with the S&P 500, while spot gold was lifting slightly, rising about 0.3%.\n\nWhile economists are mixed on whether the Fed will apply a rate hike at the November and December meetings, CME Group’s FedWatch Tool sees a likelihood that the central bank will hold rates steady into 2024.\n\nThe lower-than-average volume across the general market and the crypto sector on Friday indicates the bears may be losing steam and a period of consolidation may be in the cards. Of course, traders and investors will be watching the crypto sector over the weekend for indications of how the general market may trade on Monday.\n\nWant direct analysis? Find me in the BZ Pro lounge! Click here for a free trial.\n\nThe Bitcoin and Ethereum Charts: Bitcoin and Ethereum were consolidating with inside bar patterns during Friday’s 24-hour trading session after dropping over 2.5% on Thursday. The consolidation indicates both the bulls and the bears are taking a break.\n\nBitcoin’s and Ethereum’s inside bar patterns are neutral because although the cryptos dropped on Thursday, both are currently trading in uptrends and may have formed higher lows that day. Bullish traders want to see continued consolidation and then for Bitcoin and Ethereum to break up from Thursday’s mother bar.\n\nBearish traders want to see big bearish volume come in and drop Bitcoin and Ethereum down from Thursday’s low-of-day, which could accelerate downside pressure.\n\nEthereum has resistance above at $1,615 and at $1,717 and support below at $1,564 and at $1,421.\n\nThe Dogecoin Chart: Like Bitcoin and Ethereum, Dogecoin was consolidating on lower-than-average volume Friday but dropped from Thursday’s low-of-day, to break bearishly from an inside bar pattern.\n\nDogecoin’s fall caused the crypto to negate its uptrend by forming a lower low. On Friday, Dogecoin was working to print a hammer candlestick, however, which indicates a bounce may be in the cards for Saturday. If that happens, bullish traders want to see the crypto regain support at the eight-day and 21-day exponential moving averages (EMA).\n\nBearish traders want to see Dogecoin continue to reject the eight-day EMA and for the indicator to continue to push the crypto lower.\n\nDogecoin has resistance above at $0.061 and at $0.065 and support below at $0.057 and at $0.05.\n\nRead Next: ByBit Suspends Services In This Country Due To Stricter Rules, Banned Incentives"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9ldGgtZ2FzLWZlZS1zdWRkZW5seS1zb2Fycy10by0zMDAtaGVyZXMtbGlrZWx5LWV4cGxhbmF0aW9u0gFOaHR0cHM6Ly91LnRvZGF5L2V0aC1nYXMtZmVlLXN1ZGRlbmx5LXNvYXJzLXRvLTMwMC1oZXJlcy1saWtlbHktZXhwbGFuYXRpb24_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "ETH Gas Fee Suddenly Soars to 300, Here's Likely Explanation - U.Today",
        "content": "Chinese crypto journalist and blogger Colin Wu has taken to X social media platform to share news about the gas fee on the Ethereum chain soaring as high as 30x.\n\nAdvertisement\n\nAccording to his post, the fee on the ETH mainnet has gone up from less than 10 to approximately 300.\n\nWu explains this sudden surge in gas price by the high on-chain activity of the Binance 14 hot wallet, which belongs to the leading crypto exchange spearheaded by Changpeng Zhao (CZ).\n\nWu added that the amount of gas consumed by transactions made via this wallet today has surged to 362 ETH, with the overall number of transactions reaching 94,000. This is a lot higher than usual, the blogger concluded.\n\nThe GAS of the Ethereum mainnet has soared from less than 10 to about 300. The main reason may be the sudden increase in a large number of transfers on Binance 14. The GAS consumption of this address today reached 362 ETH, and the number of transfers reached 94,000, which is far… — Wu Blockchain (@WuBlockchain) September 21, 2023\n\nThe tracker currently shows that the overall deposit transaction count on Binance 14 wallet today has reached 145,204. The number of depositing wallets stands at 144,947. By now, 530 ETH has been used on fees.\n\nWhale keeps withdrawing ETH from Binance, dormant ETH whale stirs\n\n\"Smart Money\" tracking platform @lookonchain has reported that not so long ago, an anonymous crypto investor operating large sums of funds (they are often known as whales within the community) moved 5,040 ETH from Binance. This sum in Ethereum is worth roughly $8.17 million.\n\nThe same investor transferred 24,548 ETH in total from this crypto trading venue since Sept. 5, buying this ETH at an average price of $1,631.\n\nOver the last two days, since Tuesday, the second largest cryptocurrency Ethereum has lost 3.89%, dropping from $1,657 to the $1,592 level.\n\nAs reported by popular crypto tracker Whale Alert, on Wednesday, a premine Ethereum whale awakened after spending 8.1 years in dormancy. The wallet immediately transferred a large amount of 200 ETH worth $325,858, presumably with the purpose of selling this crypto lump.\n\n💤 A dormant pre-mine address containing 200 #ETH (325,858 USD) has just been activated after 8.1 years!https://t.co/8DQjyChQ2X — Whale Alert (@whale_alert) September 20, 2023\n\n\n\n"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9kb2dlY29pbi10by1yaXNlLWRlc3BpdGUtbWFqb3ItYmxvdy1ldGhlcmV1bS10by1yaXNlLWFib3ZlLTIzMDAtYW5kLXRyYWRlY3VydmUtbWFya2V0cy1sYXVuY2hlcy1kZW1vLXBsYXRmb3JtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Dogecoin To Rise Despite Major Blow, Ethereum to Rise Above $2,300 and Tradecurve Markets Launches Demo ... - Analytics Insight",
        "content": "Dogecoin Shows Resilience Despite Setback, Ethereum Set to Surpass $2,300, and Tradecurve Markets Unveils Innovative Demo Platform\n\nThe New York Department of Finance Services (DFS) has removed popular digital tokens from the approved greenlist. One of them is Dogecoin (DOGE) and this has worried investors.\n\nAnalysts also project that Ethereum (ETH) could surge above $2,300 by the end of Q4 2023 and provide significant gains. However, Tradecurve Markets (TCRV) has gained the most significant attention. With the launch of its recent demo platform, over 18,000 users signed up, and today, we will explore why.\n\nSummary\n\nDogecoin will climb to $0.098 by the end of 2023\n\nEthereum to surge to $2,335.71 by the end of the year\n\nTradecurve Markets launches demo platform and can surge by 35x at launch\n\n>>Register For The Tradecurve Presale<<\n\nDogecoin (DOGE) Is on an Upward Momentum and Can Breach $0.098 by the End of the Year\n\nThe DFS has tightened the regulatory grip on cryptocurrencies. It’s part of the ongoing VOLT initiative to strengthen oversight in the digital asset sector. However, Dogecoin (DOGE) was removed from the green list. Now, analysts are worried that this could impact how businesses operate in New York and how the future of the Dogecoin crypto will be affected.\n\nHowever, Dogecoin is up 10.2% on the annual chart. In addition, it has fallen under the 200-day average. This could signify that Dogecoin is prepared to continue its value growth. During the past week, the crypto had its low point at $0.060621, with its high point at $0.062816. At this rate, according to the Dogecoin price prediction, analysts project that it will climb to $0.098 by the end of 2023.\n\n>>Register For The Tradecurve Presale<<\n\nEthereum (ETH) to Break past the $1,700 Price Barrier and Surge Above $2,300 by the End of Q4, 2023\n\nThe Ethereum (ETH) crypto is trading at $1,647.49 and has risen by 25.6% in the past year. During the last week alone, the Ethereum price increased by 2.4%. During the previous week, Ethereum stood between $1,583.50 and $1,665.65. This signifies that it broke past the $1,640 price barrier and could soon spike above $2,000.\n\nNow, the $1,700 supply zone appears to be a tough barrier for the crypto over time. The Ethereum price has sealed below this level since the middle of August. Support from the wider market could be required to break past this barrier.\n\nHowever, a drop below the ascending trendline at $1,620 would suggest the inability of buyers to sustain these heights. According to the Ethereum price prediction, it can surge to $2,335.71 by the end of the year.\n\nTradecurve Makers (TCRV) Launches a Demo Platform and Onboards 18,000 Users\n\nTradecurve Markets (TCRV) will disrupt the industry and include features that will enable users to access many markets. Everything will be available, from trading stocks, forex, commodities, and CFDs to cryptocurrencies.\n\nThis upcoming hybrid exchange will achieve this by removing all barriers to entry. As a result, it will boost anonymity and provide easy liquidity of assets and the fast execution of transactions.\n\n:large_green_circle:Exciting news\n\nThe #TradeCurve Demo Platform is NOW LIVE!\n\nDive in, explore, and experience the future of trading. We value your insights – sign up, give it a whirl, and share your feedback with us.\n\nLet’s shape the future together! :point_right::skin-tone-4:https://t.co/nuKSMkeh21#Cryptotrading pic.twitter.com/HuMKbBeI7D — Tradecurve (@Tradecurveapp) September 11, 2023\n\nRecently, Tradecuve Markets launched its demo platform, allowing users to test the platform and its feature set. Anyone can access high leverage starting at 500:1, protection against negative balance, and a VIP account system. However, the platform also implements AI-driven trading bots that will automate trading.\n\nDuring the presale period, the TCRV token trades at $0.025 and has raised $5.8 million. Over 18,000 users have already signed up to use the exchange. This high adoption rate signifies that the platform is getting significant attention. According to analysts, the token can surge by 35x at launch.\n\nFor more information about the Tradecurve Markets (TCRV) presale:\n\nWebsite: https://tradecurvemarkets.com/\n\nBuy presale: https://app.tradecurvemarkets.com/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vaW50ZXJlc3RpbmdlbmdpbmVlcmluZy5jb20vY3VsdHVyZS9jaGF0Z3B0cy1jcnlwdG8tdG9rZW4tMTItbWlsbGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "ChatGPT's crypto token makes $12 million in trading on day 1 - Interesting Engineering",
        "content": "ChatGPT just engineered, designed, and marketed a cryptocurrency coin called AstroPepeX. The developer, who goes by the name CroissantEth on X, used the AI chatbot to write a crypto contract to create its own token on the blockchain, gave the name ‘AstroPepeX’ to the token, and even created a ticker – $APX for it.\n\nAt first, ChatGPT suggested ‘FluffyUnicorn Coin’ for the crypto name, but CroissantEth didn’t like it, so it gave the chatbot more context about cryptocurrencies."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9kb2dlY29pbi1kb2dlLW5vLWxvbmdlci1vbi1ncmVlbmxpc3QtbmV3bWlncmF0aW9ucy10by1ldGhlcmV1bS1ldGgtY291bGQtdHJhZGVjdXJ2ZS1tYXJrZXRzLXRjcnYtZ3Jvdy1ieS0xMDB4L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Dogecoin (DOGE) No Longer on \"Greenlist,\" NewMigrations to Ethereum (ETH), Could Tradecurve Markets (TCRV ... - Analytics Insight",
        "content": "Dogecoin (DOGE) Faces Setback, New Migrations to Ethereum (ETH), Will Tradecurve Markets (TCRV) Surge by 100x?\n\nThe crypto world is abuzz with recent developments, as Dogecoin (DOGE) faces a setback with its removal from the token ‘greenlist’ by the DFS. Meanwhile, Ethereum (ETH) witnessed new migrations with the introduction of Canto and Astar blockchains. Additionally, there’s growing speculation about Tradecurve Markets (TCRV) potentially surging by 100x.\n\n>>Register For The Tradecurve Markets Presale<<\n\nDogecoin (DOGE): Removed from DFS’s ‘Greenlist’\n\nDogecoin (DOGE) recently encountered a hurdle as it was removed from the New York Department of Financial Services (DFS) ‘green list.’ This decision raised questions within the Dogecoin community, leading to discussions about its implications for the coin’s future. It remains to be seen how Dogecoin will adapt and whether it can overcome this setback.\n\nWhile stricter, the updated regulatory guidance by the DFS is part of a broader effort to enhance transparency within the cryptocurrency space. Dogecoin’s popularity and widespread adoption make it a resilient and recognizable asset. Thus, it could still be valuable to a diversified crypto portfolio.\n\nAs a result, experts remain bullish about the long-term growth of the Dogecoin value. Therefore, they predict that the Dogecoin price will reach $0.098 by December 2023.\n\n>>Register For The Tradecurve Markets Presale<<\n\nEthereum (ETH): New Migrations\n\nEthereum (ETH), the blockchain giant, continues to evolve by introducing new blockchains. Recently, there was some positive Ethereum news as the migration of Cosmos-native L1 blockchain Canto to it was announced.\n\nWith increased interoperability and improved speed, Ethereum remains at the forefront of blockchain technology. The network’s ability to attract projects from various ecosystems, like Astar’s expansion from Polkadot to Ethereum, showcases Ethereum’s prominence as a preferred blockchain platform.\n\nThese moves contribute to Ethereum’s resilience and solidify its position as a top token. Because of this, market analysts foresee the Ethereum price sitting between $2,048.41 and $2,335.71 within Q4 of 2023.\n\nTradecurve Markets (TCRV): A Potential 100x Surge?\n\nAmidst these developments, all eyes are on Tradecurve Markets (TCRV), a project gaining attention. TCRV is in the spotlight due to its potential for a 100x surge once listed on a Tier-1 CEX following its launch. With a low market cap and innovative solutions for online trading, Tradecurve Markets is capturing the imagination of traders worldwide.\n\nTradecurve Markets’ innovative approach allows users to trade all derivatives on a single account. This feat differentiates it from platforms like Coinbase, which predominantly focus on cryptocurrencies. This groundbreaking move opens up vast opportunities, especially in the global foreign exchange market, which IMARC Impactful Insights valued at $753.2B in 2022.\n\n🟢Exciting news\n\nThe #TradeCurve Demo Platform is NOW LIVE!\n\nDive in, explore, and experience the future of trading. We value your insights – sign up, give it a whirl, and share your feedback with us.\n\nLet’s shape the future together! 👉🏽https://t.co/nuKSMkeh21#Cryptotrading pic.twitter.com/HuMKbBeI7D — Tradecurve (@Tradecurveapp) September 11, 2023\n\nAdditionally, Tradecurve Markets addresses a critical concern in the online trading sector by prioritizing user privacy. For instance, many popular exchanges require intrusive sign-up KYC checks. Tradecurve Markets stands out by eliminating the need for these checks. Instead, users can create an account using an email only, link it to a crypto wallet, and make a deposit.\n\nMoreover, TCRV’s lower market cap presents an exciting growth potential. It has more room for substantial price growth compared to well-established giants like Dogecoin and Ethereum. One TCRV token costs just $0.025 as it is in Stage 5 of its presale. But Stage 6 is approaching fast and will increase the price to $0.03 – a 20% ROI for those who buy it now.\n\nFor more information about the Tradecurve Markets (TCRV) presale:\n\nWebsite: https://tradecurvemarkets.com/\n\nBuy presale: https://app.tradecurvemarkets.com/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vZ3JheXNjYWxlLWZpbGVzLWZvci1ldGhlcmV1bS1zcG90LWV0ZnMtYWxsLXlvdS1uZWVkLXRvLWtub3ctMTYzMDk1M9IBcGh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vZ3JheXNjYWxlLWZpbGVzLWZvci1ldGhlcmV1bS1zcG90LWV0ZnMtYWxsLXlvdS1uZWVkLXRvLWtub3ctMTYzMDk1My9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Grayscale Files For Ethereum Spot ETFs: All You Need To Know - ABP Live",
        "content": "Grayscale Investments recently submitted an application to the US Securities and Exchange Commission (SEC) for a novel cryptocurrency exchange-traded fund (ETF). This ETF, unlike the numerous Bitcoin spot ETFs awaiting approval, focuses on Ethereum futures. The company's filing, disclosed on a Tuesday, outlined that the fund would exclusively trade in futures and would not engage in Ether transactions or necessitate an Ether custodian, as reported by the Wall Street Journal.\n\nGrayscale's submission follows a favourable ruling obtained last month, where a federal judge overturned the SEC's previous decision blocking Grayscale from transforming its Bitcoin trust into a spot ETF, marking a triumph against the primary Wall Street regulator.\n\nAnticipating approval for its Bitcoin ETF, Grayscale is now seeking the SEC's endorsement for an Ethereum futures ETF.\n\nALSO READ: Bitcoin ETF: What Is It? Here’s How It Lead To Recent Crypto Rally\n\nIn 2021, the SEC initially sanctioned a Bitcoin futures ETF, enabling investors to speculate on the future prices of digital assets. These investment products mirror cryptocurrency prices but don't involve direct crypto storage.\n\nThe investment community is keenly interested in spot crypto ETFs, with the SEC currently evaluating multiple applications, including one from BlackRock, the world's leading asset manager.\n\nA crypto ETF would offer conventional investors a safer way to gain exposure to this asset class. ETFs are investment instruments that permit individuals to purchase shares mirroring the underlying asset's price. A Bitcoin ETF would facilitate investment in the asset without the need to manage and secure cryptocurrency holdings.\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvdHZwbHVzLmNvbS8yMDIzLzA5L2VjbGlwc2VzLW1haW5uZXQtdG8tdHJhbnNmb3JtLWJsb2NrY2hhaW4td2l0aC1ldGhlcmV1bS1zb2xhbmEtaW50ZWdyYXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Eclipse's mainnet to transform blockchain with Ethereum & Solana integration - CryptoTvplus",
        "content": "Eclipse, a highly customizable modular rollup platform, has officially launched its mainnet network. This infrastructure is made up of a fusion of cutting-edge technologies, integrating Ethereum, Solana Virtual Machine (SVM), Celestia, and RISC Zero.\n\nAccording to the firm, Eclipse will leverage Ethereum as its settlement layer, utilizing ETH as the gas token for transactions. The validating bridge is established on Ethereum, ensuring security and liquidity.\n\nThe integration with Solana Virtual Machine (SVM) will be for execution, benefiting from its exceptional speed and scalability. The SVM enables parallel transaction execution, optimizing performance.\n\nAdditionally, for data availability, it noted that Eclipseutilizes Celestia, allowing Eclipse to achieve high throughput and efficient data publishing.\n\nThe robust scalability of Celestia’s bandwidth ensures seamless operation. Eclipse also utilizes RISC Zero for Zero-Knowledge (ZK) proofs of fraud.\n\nWhy Eclipse\n\nOne of the reasons behind the launch of Eclipse is to address Ethereum’s need for scalability. While Eclipse is renowned for its work on app-specific rollups, it recognizes the necessity for a general-purpose Layer 2 (L2) solution capable of handling extensive scalability.\n\nTherefore, Eclipse aims to provide a versatile L2 framework to efficiently accommodate diverse use cases instead of operating like specialized chains that cater to specific applications,\n\nAnother feature that Eclipse brings to the Web3 space is that it utilizes an efficient merklization process, which allows for significant improvements in state handling compared to the Ethereum blockchain.\n\nIt achieves full Ethereum Virtual Machine (EVM) compatibility through Neon EVM, enabling the deployment of EVM smart contracts on any SVM chain. This compatibility ensures a seamless experience for users while benefiting from SVM’s parallelized execution.\n\nAnother benefit is a seamless user experience with MetaMask due to the integration with MetaMask Snaps, which allows EVM users to interact natively with Eclipse Mainnet, eliminating the need to switch wallets, and the adoption of Firedancer, a Solana client, which promises to significantly increase the network’s throughput, resilience, and efficiency.\n\nEclipse said that its vision aligns with Ethereum’s ethos of continuous innovation. By harnessing the latest technologies and combining the best elements of existing platforms, Eclipse Mainnet seeks to address the scalability challenges faced by the crypto community.\n\nIt also added that as the ecosystem evolves, Eclipse stands ready to provide an efficient and adaptable Layer 2 solution for users and developers alike."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMisAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0by1wcmljZS10b2RheS1zZXB0ZW1iZXItMjItY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tc29sLXRlcnJhLWNsYXNzaWMtYWJwLWxpdmUtdHYtMTYzMTE0MdIBtAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0by1wcmljZS10b2RheS1zZXB0ZW1iZXItMjItY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tc29sLXRlcnJhLWNsYXNzaWMtYWJwLWxpdmUtdHYtMTYzMTE0MS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $27,000, Terra Classic Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC), the world’s oldest and most valued cryptocurrency, dipped below the $27,000 mark. Ethereum (ETH) lost the $1,600 mark as well early Friday. The dips could largely be attributed to US Federal Reserve Chair Jerome Powell’s statement on the possibility of increasing interest rates. Popular altcoins — including the likes of Dogecoin (DOGE), Ripple (XRP), Solana (SOL), and Litecoin (LTC) — traded sideways across the board. Terra Classic (LUNC) went on to become the biggest gainer, with a 24-hour jump of over 5 percent.\n\nThe global crypto market cap stood at $1.06 trillion at the time of writing, registering a 24-hour dip of 1.33 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $26,640.35, registering a 24-hour loss of 1.53 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 23.02 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $1,594.62, marking a 24-hour dip of 1.73 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.39 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour loss of 2.01 percent, as per CoinMarketCap data, currently priced at $0.06164. As per WazirX, Dogecoin price in India stood at Rs 5.27.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.25 percent. At the time of writing, it was trading at $65.06. LTC price in India stood at Rs 5,460.12.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.513, seeing a 24-hour dip of 0.76 percent. As per WazirX, Ripple price stood at Rs 43.59.\n\nSolana (SOL) Price Today\n\nSolana price stood at $19.71, marking a 24-hour loss of 2.17 percent. As per WazirX, SOL price in India stood at Rs 1,700.\n\nTop Crypto Gainers Today (September 22)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nTerra Classic (LUNC)\n\nPrice: $0.00006156\n\n24-hour gain: 5.69 percent\n\nTHORChain (RUNE)\n\nPrice: $1.79\n\n24-hour gain: 1.16 percent\n\nZcash (ZEC)\n\nPrice: $26.35\n\n24-hour gain: 0.60 percent\n\nUNUS SED LEO (LEO)\n\nPrice: $3.88\n\n24-hour gain: 0.60 percent\n\nFrax Share (FXS)\n\nPrice: $5.38\n\n24-hour gain: 0.45 percent\n\nTop Crypto Losers Today (September 22)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nImmutable (IMX)\n\nPrice: $0.6684\n\n24-hour loss: 9.75 percent\n\nMultiversX (EGLD)\n\nPrice: $25.81\n\n24-hour loss: 7.17 percent\n\nLido DAO (LDO)\n\nPrice: $1.49\n\n24-hour loss: 5.47 percent\n\nGala (GALA)\n\nPrice: $0.01326\n\n24-hour loss: 5.21 percent\n\nXDC Network (XDC)\n\nPrice: $0.05158\n\n24-hour loss: 5.06 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin has been trading sideways in the past 24 hours, largely in response to statements made by US Federal Reserve Chair Jerome Powell regarding the prospect of raising interest rates. At the same time, market participants are digesting the US benchmark 10-year note yields, which have climbed to 4.49 percent — the highest since November 2007. Meanwhile, Ethereum's price has decreased but remains above the $1,550 mark.”\n\nParth Chaturvedi, Investments Lead, CoinSwitch Ventures, said, “Remarks by the US Feds on the monetary policy seem to have led to a sell-off within investors across markets, including crypto. As per CoinGecko, the global crypto M.Cap is down 1.5 percent but continues to be above $1 trillion. The crypto fear and greed index has re-entered the fear zone after dropping 4 points since yesterday. The index currently stands at a score of 43/100. The top 50 cryptos by M.Cap are trading in the red. BTC is down 1.6 percent in the last 24 hours and is currently trading below its support level of $27,000. ETH (-2.0 percent) too is trading below its support at $1,600.”\n\nRajagopal Menon, Vice President, WazirX, said, “Despite macro pressures, Bitcoin may gain support from ongoing spot Bitcoin exchange-traded fund (ETF) applications in the US, with a 70 percent probability of SEC approval in the next six months, potentially leading to a +20 percent price surge.”\n\nAtulya Bhat, CMO, BuyUcoin, said, “Bitcoin slipped below the $27,000 mark after the Fed chief hinted toward tight monetary policy and higher interest rates may be prolonged to tame inflation. Higher interest rates may discourage borrowing activity and may result in liquidity crunch. ETH, the largest altcoin slipped below the $1600 mark during the same period and is changing hands at $1,593.24 at the time of writing.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin, currently at $26,645, endured a tumultuous episode at 11:34 UTC (7:34 ET). It witnessed a stunning drop from around $65,760 to a stunning low of $8,200. Remarkably, within just minutes, the cryptocurrency rebounded and almost regained its original value. Interestingly, this flash crash selectively rocked Binance.US and left traders confused. The spokesman attributed the chaos to an \"institutional trader\" and a glitch in their trading systems. The event underscores the volatile nature of Bitcoin, where breathtaking price swings can quickly disrupt markets. It serves as a vivid reminder of the unpredictable terrain of the cryptocurrency realm, where fortunes can change in an instant.”\n\nCoinDCX Research Team told ABP Live, “In the last 24 hours, Bitcoin's price took a dip of 1.40 percent, now standing at Rs 23,65,000 ($26,600). This decline in the value of the bitcoin coincided with a drop in global stock markets. This occurred as investors responded to cautious remarks made by the US Federal Reserve regarding their monetary policies. Additionally, we saw an increase in the 10-year U.S. Treasury yields, reaching the highest point in 16 years. This change likely had an impact on how the overall financial markets were behaving.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vY29pbmpvdXJuYWwubmV0L2NvbXBhcmUvZXRoZXJldW0tZ2FtYmxpbmctc2l0ZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "The 10 Best Ethereum Gambling Sites | Rated And Reviewed - CoinJournal",
        "content": "Our Top 10 Ethereum Gambling Sites Reviewed\n\n1. BC Games – Overall Best Option\n\nBC Games is a betting platform that offers over 100 games across three major categories: Sports, Casino, and Lottery. It supports crypto deposits and withdrawals and even has a native token called BCD which maintains parity with the dollar and is used for lotteries.\n\nThe platform’s sportsbook records wagers for major sports like Baseball, Soccer, Tennis, and Basketball. You can do some sports betting on soccer games and teams in various countries. The sportsbook also includes sports betting on eSports like CS:GO, Dota 2, League of Legends, Rocket League, FIFA:Volta, and Starcraft.\n\nThe Casino includes various types of games that are either Slots, Table Games, or BC Originals, which are games that have been developed by the site. Many of the provably fair games are within the Originals category.\n\nThe casino section also contains high volatility games with increasing multipliers and a live casino for online gambling with live versions of classics like Blackjack, game shows like Deal or No Deal, and new games like Crazy Coin Flip.\n\nThe Lottery section works like a traditional lottery that uses random variables to produce six numbers. Players can buy tickets and choose the numbers on them. At 15:00 UTC+0 daily, the lottery numbers are chosen.\n\nIf all six numbers on your ticket match the draw, you win the jackpot of $100,000. If only 5 numbers match, you win $3,000. A 4-number match wins $20 while a 3-number one wins $1. If no numbers match, you may win a free ticket.\n\nThe lottery uses the site’s native BCD token for tickets and winnings. BCD can be converted back to USD, but cannot be converted to any other crypto as it only exists within the BC ecosystem.\n\nTo access these gambling games, create an account and deposit funds. BC Games supports deposits and withdrawals in over 17 cryptos. You can also access various bonuses in the promotions tab of the website once you have made a deposit.\n\nPros\n\nGenerous welcome bonuses\n\nWide collection of games\n\nLow minimum deposit\n\nCons\n\nVague on legality of its services in certain regions\n\nWhy We Chose BC Games\n\nWe chose BC Games because of its holistic approach to online gambling. It features a sportsbook for sports betting, a casino for digital casino games that are provably fair, and crypto-native Ethereum casino games. Crypto users will be delighted to find an in-built exchange to help with swaps."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tc3Rha2luZy1tb21lbnR1bS1mYWxsaW5nLXdoYXRzLWdvaW5nLW9uL9IBTGh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tc3Rha2luZy1tb21lbnR1bS1mYWxsaW5nLXdoYXRzLWdvaW5nLW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Staking Momentum Falling, What's Going On? - Bitcoinist",
        "content": "The number of Ethereum (ETH) holders choosing to stake, effectively locking their coins in the smart contracts platform, is falling. According to CryptoQuant data, as of August 23, the staking inflow total stood at 30,656, down from 404,704 registered on June 1.\n\nEthereum Staking Inflow Dropping, But There Are Over 813,000 Active Validators\n\nThe staking inflow total, which measures the number of unique addresses moving coins to the official Beacon Chain deposit address for staking purposes, rose steadily from around 5,952 on April 3 to 404,704 on June 1.\n\nThis spike was significantly buoyed, as data shows, with the activation of the Shapella upgrade on April 12. To illustrate, between April 12 and June 1, the staking inflow total rose from 16,736 to 404,704, a more than 25X increase.\n\nThe Shapella upgrade allowed Ethereum validators to withdraw their coins for the first time since they began locking in late December 2021. This update gave validators—tasked with validating transactions and keeping the network secure—an option to keep staking their coins or exit.\n\nHowever, according to Dune Analytics, the number of validators rose from around 568,000 on April 12 to over 913,000 as of early September 2023.\n\nIn September 2022, Ethereum powered off the proof-of-work consensus protocol to validate transactions to a proof-of-stake consensus. Instead of miners, Ethereum now relies on validators. When writing, there are over 813,105 active validators who have, in total, locked over 26 million ETH.\n\nWill This Make Ethereum Centralized?\n\nThe 92% contraction in staking count is concerning. However, it doesn’t necessarily mean the Ethereum network is now susceptible or flawed.\n\nSpecifically, while the metric tracks the number of ETH holders choosing to stake and earn rewards on Ethereum, the tracker doesn’t reveal the number of those who withdraw during this period.\n\nA sharp increment in the number of ETH unlocked—as shown by the number of validators deactivating their nodes—or choosing not to validate transactions could cause worry. This might open the network to centralization concerns since liquidity-staking providers like Lido Finance are increasingly popular following the Shapella upgrade on April 12.\n\nTo quantify, Lido Finance, a dominant decentralized finance (DeFi) protocol with a total value locked (TVL) of over $13.9 billion when writing on September 22, channels hundreds of thousands, if not millions of ETH, from holders, allowing them to earn staking rewards.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vYml0Y29pbmlzdC5jb20vcHJvLXhycC1sYXd5ZXItZHJvcHMtYm9tYnNoZWxsLWFubm91bmNlbWVudC_SAUdodHRwczovL2JpdGNvaW5pc3QuY29tL3Byby14cnAtbGF3eWVyLWRyb3BzLWJvbWJzaGVsbC1hbm5vdW5jZW1lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Pro-XRP Lawyer Drops Bombshell Announcement About Ethereum - Bitcoinist",
        "content": "Following days of building up anticipation for his “big announcement,” pro-XRP lawyer John Deaton finally dropped the bombshell on September 22. As some might have predicted, his announcement had much to do with the ETH Gate.\n\nPro-XRP Lawyer: Revelations About Ethereum\n\nIn a broadcast on his X (formerly Twitter) platform, Deaton mentioned that he had three announcements to make, with the first being about the Ethereum ICO (Initial Coin Offering) irregularities.\n\nJohn Deaton Live https://t.co/7Sj3RuySFO — John E Deaton (@JohnEDeaton1) September 22, 2023\n\nHe stated that he has been in communication with Steven Nerayoff, a prominent “OG” in the crypto space, as he has been around for a while and was actively involved in Ethereum’s ICO. According to him, Nerayoff showed him some of the “receipts,” which made him realize why Nerayoff feels he was targeted.\n\nThe pro-XRP lawyer noted that this communication and everything he has seen is protected by the attorney-client privilege. Because of this, he was limited in what he could say. However, he made some observations based on what he had heard and seen.\n\nAccording to him, some people who distanced themselves from Nerayoff during his indictment aren’t telling the truth. He chose not to mention any names, though.\n\nFurthermore, he stated that if the SEC’s case against Ripple’s founders were to go to trial, Bill Himman’s cross-examination would be of “epic proportions.” He even offered to join the Ripple legal team “free of charge” and be the one to handle that particular cross-examination. It is believed that Himman was at the center of the whole ‘regulatory pass’ that Ethereum might have gotten from the SEC.\n\nXRP market cap currently at $27 billion. Chart: TradingView.com\n\nMeanwhile, Deaton stated he is confident of getting Nerayoff on Crypto Law when he is “ready” to reveal the truth about everything that happened between the SEC and Ethereum. While he is unsure whether or not people will be held accountable (as the statute of limitation may apply to certain charges), Deaton is confident that the truth will come out and “we are getting closer” to it.\n\nNerayoff also tweeted in support of Deaton’s broadcast and stated that he looks forward to “the real truth coming out.” In response, Deaton stated that he was inviting Ethereum’s founders Vitalik Buterin and Joseph Lubin, alongside Nerayoff, to come on live where “nothing can be cut or manipulated, and we will get to the truth.”\n\nTwo Other Announcements\n\nJust as he had hinted before the big announcement, Deaton had something to say about the XRP Ledger. He revealed that he was joining the SpendTheBits team as an angel investor. SpendTheBits is a crypto mobile payment app built on the XRP Ledger. Deaton stated that he is excited to be part of what the founders are building.\n\nThe third announcement was about his Memoir, which he was finally launching after four years of writing. The book “Food Stamp Warrior” discusses “all the things we’re not supposed to talk about nowadays,” including poverty, violence, drugs, sex, addiction, abuse, and race. Deaton also pointed out that he talked about the “clown regulators” at the SEC in the book.\n\nFeatured image from Shutterstock"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYmxvY2tjaGFpbnJlcG9ydGVyLm5ldC9ldGhlcmV1bS1wcmljZS1kcm9wcy1iZWxvdy1jcnVjaWFsLTE2MDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Drops Below Crucial $1,600 Amid Declining Exchange Outflow: Are Bears Gaining Control? - Blockchain Reporter",
        "content": "As anticipated, the Federal Reserve confirmed today that it would keep its primary policy rate unchanged in its economic projections summary. Following this announcement, Ethereum’s price appeared to respond favorably, sustaining its position above $1,600. However, over the last few hours, ETH price failed to maintain its rally above $1,600, dropping below Fib channels amid declining exchange outflows.\n\nEthereum Turns Bearish With Increasing Exchange Reserve\n\nRecent market trends have thrown a curveball: Ethereum’s price has slipped below the pivotal $1,600 threshold. This drop, coupled with a decreasing exchange outflow, raises eyebrows and prompts the question: Are the bears starting to dominate the scene?\n\nAccording to Glassnode, the Ethereum exchange outflow has reached a 1-month low of 6709 ETH, which hints at an increasing exchange reserve. A decreasing outflow means that more Ethereum is finding its way back to exchanges as less amount of ETH is now being withdrawn from exchanges. This increase in exchange reserves suggests that there’s more Ethereum available to be sold, which is typically a bearish sign.\n\nOn the flip side, increasing outflows indicate lower exchange reserves, which is bullish. It suggests that investors are withdrawing ETH from exchanges to cold wallets for accumulation purposes, possibly in anticipation of a price surge.\n\nThe combination of Ethereum’s price drop and the declining exchange outflow paints a concerning picture. It suggests that not only are investors more willing to sell their Ethereum, but there might also be an increasing sentiment of uncertainty or lack of confidence in its short-term price potential.\n\nETH deposits have witnessed a notable surge recently. As of this moment, exchange deposits have surpassed 161,000, reaching a peak not seen in the past nine months. Before this surge, the chart’s previous high was around 98,000 deposits, recorded back in January. This strengthens short-position holders’ confidence.\n\nOver $5.7 Million Long-Positions Liquidated\n\nAfter reaching a high of $1,617, ETH’s price took a downturn, and this decline was accompanied by a significant bearish indicator: a surge in long-liquidations. According to data sourced from Coinglass, a staggering $5.7 million worth of long positions were liquidated in a short span of a few hours.\n\nThis rapid liquidation is a clear sign of increased selling pressure, particularly as ETH approaches its resistance levels near $1,620. For those unfamiliar with the term, long-liquidation essentially means that traders who bet on the price increase had to exit their positions, often at a loss, due to the price moving against their predictions.\n\nThe open interest (OI) for ETH, which represents the total number of outstanding derivative contracts (like futures and options) that have not been settled, has also seen a significant spike. After the ETH price dropped below the $1,610 mark, Coinglass reported a sharp increase in OI by $200 million. An increase in open interest, especially during a price decline, can be interpreted as more traders entering the market, expecting further price drops or hedging against them.\n\nAfter ETH’s price dipped to a low near $1,590, a notable development caught the attention of traders: a positive funding rate for ETH. The funding rate is a crucial metric for derivatives, particularly for perpetual futures contracts. In simple terms, it represents the fee paid by one side of the contract to the other. A positive funding rate means that long traders (those betting on the price to go up) are paying short traders (those betting on the price to go down).\n\nA positive funding rate often indicates that the majority of traders are bullish on the asset, expecting its price to rise. While a positive sentiment is a good sign, it’s essential to note that a persistently high positive funding rate can make it expensive for traders to hold long positions.\n\nIn the short term, a positive funding rate can act as a counterbalance to bearish trends, suggesting that there’s still significant confidence in ETH’s potential to rebound. As of writing, ETH price trades at $1,594, declining over 2.2% from yesterday’s rate."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY2FwdGFpbmFsdGNvaW4uY29tL2NvdW50aW5nLWRvd24tdG8tZXRoZXJldW0tYnVsbC1ydW4tYW5kLWJpdGNvaW4tc3BhcmstbGF1bmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Counting Down To Ethereum Bull Run, and Bitcoin Spark Launch - Captain Altcoin",
        "content": "Home » Journal Counting Down To Ethereum Bull Run, and Bitcoin Spark Launch Journal Counting Down To Ethereum Bull Run, and Bitcoin Spark Launch Philipp Traugott\n\nTwo major events have investors and enthusiasts counting down the days with anticipation. Ethereum (ETH) is gearing up for a potential bull run, while the launch of Bitcoin Spark (BTCS) promises to bring new excitement to the crypto landscape\n\nEthereum (ETH) price prediction\n\nGrayscale, a leading crypto asset management firm, recently filed an application with the U.S. Securities and Exchange Commission (SEC) to establish a new Ether Futures Exchange Traded Fund (ETF) under the Securities Act of 1933. This move follows a previous filing under the Investment Company Act of 1940. With reports in the crypto sphere hinting at the SEC’s potential approval of multiple Ether Futures ETFs as early as October, market analysts are anticipating a substantial uptick in the value of ETH. This bullish sentiment is rooted in the belief that the increased accessibility of Ether Futures could stimulate demand for Ethereum (ETH) among institutional investors, who are likely to flock to these instruments once they become available.\n\nWhat is Bitcoin Spark?\n\nBitcoin Spark is the latest Bitcoin fork. However, this fork has captured the attention of the crypto community because it isn’t merely a copy of the previous network. It is a new and innovative blockchain on a mission to bring a new era of cryptocurrency transactions.\n\nBitcoin Spark boasts lightning-fast transaction speeds and low fees due to its high individual block transaction capacity, short block time, and vast nodes. It also primes itself as a robust platform by seamlessly integrating a smart contract layer that allows for multiple programming languages, fostering a diverse ecosystem of smart contracts and decentralized applications (Dapps).\n\nAdditionally, Bitcoin Spark introduces a novel concept of decentralized CPU and GPU rental through its groundbreaking Proof-of-Process (PoP) consensus mechanism. The PoP non-linearly rewards users for confirming blocks and contributing their processing power to the network. The network’s massive nodes and nonlinear dynamics will allow for a wider range of validators, even those with low-powered devices. The Bitcoin Spark team will provide an application that will enable Windows, Mac OS, Linux, iOS, and Android users to engage in network validation by permitting access to their device’s processing unit. The validators’ power will then be leased to organizations or individuals undertaking high CPU or GPU load tasks, with payments made in BTCS. The revenue generated will then be distributed among the validators.\n\nFurthermore, the Bitcoin Spark application and website will have small, unobtrusive slots for advertisements. The community will police the ads to ensure security, and advertisers will be required to pay with BTCS.\n\nBitcoin Spark (BTCS) price prediction\n\nBTCS is currently trading at $2.5 with a complimentary 9% bonus in Phase 5 of the Bitcoin Spark Initial Coin Offering (ICO). BTCS is set to launch at $10 on November 30th, indicating a 464% increase from its current price. Several factors suggest BTCS could witness a significant surge in price post-launch. First, Bitcoin Spark’s innovative technology is bound to attract more users as it gains more recognition. Many analysts believe that Bitcoin Spark is rewriting the history of Bitcoin (BTC), with its ICO being compared to the early days of BTC. Additionally, BTCS has a capped supply of 21 million, suggesting long-term price appreciation, as seen with BTC. Moreover, Bitcoin Spark has a low market cap, which allows the BTCS price to surge by unprecedented levels. This is further cemented by the project’s launch being close to the start of the next expected crypto bull run, which has historically led to massive rallies for low-cap gems.\n\nConclusion\n\nWhile Ethereum (ETH) and Bitcoin Spark (BTCS) have significant potential for price increases, conducting your own research before making any investment is advisable.\n\nTo get more information on Bitcoin Spark:\n\nWebsite | Buy BTCS\n\nDisclaimer: We advise readers to do their own research before interacting with any featured companies. The information provided is not financial or legal advice. Neither CaptainAltcoin nor any third party recommends buying or selling any financial products. Investing in cryptoassets is high-risk; consider the potential for loss. CaptainAltcoin is not liable for any damages or losses from using or relying on this content."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lmdpem1vdGltZXMuY29tL2J1c2luZXNzL2dyYXlzY2FsZS1pbnZlc3RtZW50cy1hcHBsaWVzLXRvLW9mZmVyLWV0aGVyZXVtLWZ1dHVyZXMtZXRmLzQ2Njcw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Grayscale Investments applies to offer Ethereum Futures ETF - Gizmo Times",
        "content": "Grayscale Investments has applied to the U.S. Securities and Exchange Commission for a new exchange-traded fund, and this time it isn’t for the Bitcoin ETF, but the company has applied for the Ethereum Futures ETF. There have been a lot of Bitcoin spot ETFs that are pending an approval with the regulator, and this adds to the list but it isn’t a spot ETF that has been applied.\n\nThe paperwork of the filing had mentioned that the transactions would not happen in Ether and there won’t be any need to retain any Ether custodian. Instead, the ETH dealing would happen strictly in futures.\n\nGrayscale had earlier applied to convert its Bitcoin trust into a spot ETF, but the SEC had plans against it and the commission blocked it, until the Federal judge decide to overturn that decision. The approval for the Bitcoin spot ETF is yet to happen, but now, Grayscale will have to wait for the Ethereum Futures ETF approval as well.\n\nApplications for Bitcoin ETFs are not new, as the world’s largest asset manager BlackRock had also applied for one and the application is pending review.\n\nAn Exchange-Traded Fund (ETF) is a type of investment fund and exchange-traded product, with shares that are tradeable on a stock exchange. ETFs are designed to track the performance of a specific index, commodity, bond, or a basket of assets, and they are structured in a way that combines features of both mutual funds and individual stocks.\n\nETFs offer a convenient way for investors to gain exposure to a diversified portfolio of assets, and this exposure happens in a much safer way. ETFs are transparent, versatile, and cost-efficient, making them a better choice for the retail investors to safely trade the underlying asset without having to buy the asset directly."
    }
]