[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTE2L2V0aGVyZXVtLXMtc2hhbmdoYWktdXBncmFkZS10by1lbmFibGUtd2l0aGRyYXdhbHMtc2V0LWZvci1hcHJpbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Upgrade to Enable Withdrawals Set for April - Bloomberg",
        "content": "Ethereum ’s next major software upgrade, which could make crypto’s biggest commercial highway more attractive to investors and developers alike, will take place around April 12.\n\nCalled Shanghai, it will let people who pledged their Ether tokens to order transactions on the Ethereum blockchain to withdraw them. Currently, some 17.5 million of such so-called staked Ether, worth about $29 billion at current prices, can’t be accessed on the network, although the coins do earn their owners a yield."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMTYvZXRoZXJldW1zLXNoYW5naGFpLWhhcmQtZm9yay1ub3ctaGFzLWFuLW9mZmljaWFsLXRhcmdldC1kYXRlL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMTYvZXRoZXJldW1zLXNoYW5naGFpLWhhcmQtZm9yay1ub3ctaGFzLWFuLW9mZmljaWFsLXRhcmdldC1kYXRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ethereum’s Shanghai Hard Fork Now Has Official Target Date - CoinDesk",
        "content": "Ben Edgington, product lead of Teku, an Ethereum client, told CoinDesk that “despite the reduced participation, we could see that all client types were producing valid blocks, and that participation increased over time. This reassured us that nothing was fundamentally wrong, just late upgraders.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1jb3JlLWRldmVsb3BlcnMtc2V0LWFwcmlsLTEyLWZvci1zaGFuZ2hhaS1oYXJkLWZvcmvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ethereum core developers set April 12 for Shanghai hard fork - Cointelegraph",
        "content": "The target date for the highly anticipated Shanghai hard fork on Ethereum has now been set: April 12. Ethereum core developers approved the target deadline during the All Core Developers Execution Layer #157 call on March 16.\n\nThe Shanghai mainnet upgrade features five Ethereum Improvement Proposals, including EIP-4985, which will enable staked Ether (ETH) withdrawals on the Beacon Chain, completing Ethereum’s transition from proof-of-work to a proof-of-stake (PoS) consensus.\n\nThe target date — April 12 at 10:27:35 pm UTC, epoch 620,9536 — will now be confirmed by developers on GitHub. The fork was initially forecasted for March, but developers later pushed it back to early April.\n\n6209536 4/12/2023, 10:27:35 PM UTC — timbeiko.eth (@TimBeiko) March 16, 2023\n\nValidators will receive rewards payments automatically at periodic intervals in withdrawal addresses. Additionally, stakers can exit positions entirely, reclaiming their full balance.\n\nAccording to Etherscan, the Ethereum PoS smart contract has attracted over 17.6 million ETH, worth nearly $29.4 billion at publication time. Analysts predict that the upgrade could trigger a sell-off in the short term, as Cointelegraph reported.\n\nOverview of Ethereum PoS smart contract. Source: Etherscan\n\nThe transition to PoS officially started on Sept. 15, 2022 with the Merge, a significant milestone for Ethereum that replaced miners with validators and introduced ETH staking as a key component of the network. Ethereum’s roadmap has several updates coming after Shanghai, including the “Surge,” “Verge,” “Purge” and “Splurge.”\n\nThe switch to a PoS consensus could have regulatory implications for ETH and the crypto space. In September 2022, United States Securities and Exchange Commission Chair Gary Gensler suggested that the blockchain’s transition might have brought ETH under the regulators’ radar.\n\nAfter a recent crackdown on crypto firms providing staking services in the U.S., Gensler again suggested on March 15 that proof-of-stake coins might be securities:\n\n“Whatever they’re promoting and putting into a protocol, and locking up their tokens in a protocol, a protocol that’s often a small group of entrepreneurs and developers are developing, I would just suggest that each of these token operators [...] seek to come into compliance, and the same with the intermediaries.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3doYXQtYXJlLXNtYXJ0LWNvbnRyYWN0LXdhbGxldHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "What Are Smart Contract Wallets? A Beginner's Guide - Blockworks",
        "content": "The Ethereum Foundation’s ERC-4337 account abstraction went live on Ethereum’s mainnet on March 1. While some expressed excitement for the news and the potential for smart contract wallets, the leading smart contract wallet providers reminded everyone that they already exist.\n\nSo what’s different? And what in the world is a smart contract wallet again?\n\nKey takeaways:\n\nSmart contract wallets provide a means of self custodying crypto assets.\n\nThey enable bundled transactions, customizable recovery options, the ability to pay gas fees in a different token, greater privacy in identity management and more.\n\nNot all smart contract wallets remove the EOA from the equation.\n\nThere lacks a universal standard to account abstraction that can address risk concerns.\n\nERC-4337 is an account abstraction approach that intends to remove the reliance on centralized relayers and EOAs.\n\nIt can potentially provide a universal standard that addresses security concerns but needs further infrastructure.\n\nWhat are smart contract wallets?\n\nA smart contract wallet is a device or application that lets users customize the way they would prefer to manage their digital assets.\n\nAccount abstraction is how developers make smart contract wallets possible. They abstract all the essential functions of the Externally Owned Account (EOA) and plug them into a smart contract full of new levers and buttons.\n\nIn other words, it’s a choose-your-own-adventure approach to self custody.\n\nUse Cases\n\nYou can program the smart contract wallet for the use cases that mean most to you — things like social recovery and bundled transactions. Proponents believe that it will onboard millions more to Web3 by revolutionizing the user experience, and critics fear that it introduces additional risks.\n\nThe Ethereum account model explained\n\nBefore we explain how it works and the significance of ERC-4337 account abstraction, it’s worth refreshing our understanding of the Ethereum account model.\n\nUnlike Bitcoin and other cryptocurrencies, Ethereum uses an account model instead of a UTXO (unspent transaction output) model. This allows users to deploy and use self-executing smart contracts that can run applications such as Uniswap.\n\nThere are two types of accounts on the Ethereum network: externally owned accounts (EOAs) and smart contract accounts.\n\nBoth are represented by a unique public address, which is essentially a string of letters and numbers.\n\nBoth can be used to send, hold or receive ether.\n\nHowever, EOAs and smart contract accounts differ in how they are controlled and used. EOAs are controlled directly by the user through a private key signing function. This authorizes the account to perform three primary tasks:\n\nValidate transactions\n\nExecute transactions\n\nPay transaction fees\n\nIn contrast, smart contract accounts are controlled by their embedded logic — a series of if-then statements. But this design makes smart contracts dependent on EOAs. They are still needed to deploy the smart contracts and prompt smart contract actions.\n\nThe smart contract’s dependence on EOAs makes it difficult for wallet providers to program new ways for users to validate, execute and pay transaction fees.\n\nLimitations of this model\n\nThis accounts model limits many wallet providers to only offer users a seed phrase in the case that they lose access. The seed phrase though is notoriously vulnerable to users forgetting it or losing it to theft — which discourages users from interacting with the blockchain, and makes it difficult for them to manage their digital assets.\n\nRead More: What is a seed phrase and are they necessary?\n\nAnother pain point is the number of steps it takes for a user to interact with a smart contract. Since every interaction with a smart contract requires a signature, gas fees can get expensive quickly. This also adds vulnerability for the user, as each transaction increases risks associated with potential network congestion, errors in smart contract code, or other technical issues.\n\nLastly, the standard EOA model limits the innovation of wallet providers. There are workarounds that use smart contracts that enable more use cases with greater customization, but they come with a new set of risks.\n\nHow does account abstraction work?\n\nBefore ERC-4337, smart contract wallets had two general approaches to account abstraction. They could either use third party relayers with an abstracted EOA or use a layer-2 solution with native account abstraction.\n\nThe EOA and relayer approach\n\nSmart contract wallets like Safe use an EOA as the basis of a smart contract wallet and a transaction relay service to bundle and process transactions on behalf of the smart contract account.\n\nRemember, the current EVM logic requires users to deploy a smart contract with their EOA account. So in this approach, safe wallets use an EOA for its initial set up. But once the account is created, users can add a layer of customization to the authorization process.\n\nBenefits\n\nFor example, with Safe, users can configure several types of transaction confirmation methods, including multi-sig, time-lock, and threshold signatures.\n\nA multi-sig confirmation method is a security feature that requires multiple parties to approve a transaction before it can be executed. It adds an extra layer of security to transactions and helps prevent fraudulent activity.\n\nIn a time-lock confirmation method, a transaction is scheduled to execute at a future time and is confirmed automatically when that time is reached, without requiring any additional approval. This approach is useful for scenarios where a group of people want to agree on a transaction in advance, but don’t want to coordinate their approval at a specific time.\n\nThreshold signatures is a multi-signature scheme where a transaction can be authorized by a subset of a group of signers, instead of requiring all signers to approve it. This allows for greater flexibility in the approval process and can increase security by reducing the likelihood of all signers being compromised at the same time.\n\nThis layer of abstraction can also be used to customize account recovery. For example, it lets users add trusted accounts that can help recover the account in case the user loses access. The recovery process involves a time delay and a confirmation from a majority of trusted accounts to prevent unauthorized access.\n\nSince the smart contract is on Ethereum, it still costs gas to execute actions that require multiple transactions. So instead of executing a set of transactions individually, the smart contract can be programmed to send authorized transaction metadata to a transaction relay service that executes them on the user’s behalf.\n\nRisks\n\nThis allows third parties to cover the gas fees for the user or let them pay the fees with a different token. The challenge though is, not all third party relayers are the same. Some contain unique centralization risks that the average user is not going to understand.\n\nLayer-2 native account abstraction\n\nSmart contract wallets like Argent have partnered with ZK-Era to provide account abstraction through a layer-2 solution. This avoids the need for third party relayers and removes the need for a user to set up an EOA.\n\nZK-Era’s native abstraction uses Zero-knowledge proof rollups to bundle a set of transactions from an Argent smart contract account that are then settled using the ZK-Era smart contract on the Ethereum blockchain.\n\nBenefits\n\nSince the accounts are on a layer-2, users don’t need to use an EOA for initial set up and authorization. This adds greater scalability and complexity because smart contracts on layer-2s can process more computations without delegating to a third party like a relayer.\n\nRisks\n\nThe exact process is too complicated to explain here, but the main concerns are rooted in the security and dependency of the layer-2 smart contract responsible for settling deposits and withdrawals.\n\nERC-4337 account abstraction\n\nERC-4337 account abstraction offers an approach that doesn’t require third party relayers, layer-2 smart contracts, or a consensus layer change. It lets people manage a smart contract wallet without ever needing to use an EOA in the same way.\n\nIt does this through providing a new standard of transaction messaging. Instead of executing transactions individually or sending the metadata of a set of authorized transactions to a relayer, smart contract wallets can send a series of user operations to a bundler.\n\nSo what is a bundler and user operation? And how are they different from a relayer and transaction?\n\nBenefits and risks\n\nTo get a full breakdown of how this works, keep an eye out for an upcoming report from Blockworks Research analyst Ryan West.\n\nIn short, the model offers the potential for a more decentralized version of what relayers do for smart contract wallets like Safe.\n\nBut many on Twitter have pointed out that the current bundler infrastructure is centralized and fragile.\n\nTwitter user @blockomotive stated, “there’s been other projects and technology offering transaction relaying services for a while.”\n\n“However,” they added, “until many bundlers are up and running (which still requires dedicated [infrastructure]), the system remains centralized and fragile. Currently, only a few projects offer API services to run bundlers, increasing the centralization of 4337.”\n\nAnd @Safe stated in February 2023:\n\n“We are evaluating an EIP-4337 integration (also based on a module). We will only roll out this integration when we meet our very tough security standards.”\n\nFinal thoughts\n\nEven though the majority of the smart contract wallet discussion is centered around alternative account recovery systems, there are many more exciting use cases. Smart contract wallets have the potential to customize the way users manage their identity online, vote on governance proposals, delegate user responsibilities of DAO wallet and more.\n\nRead more: What Is Decentralized Identity? The Pillar of Web3\n\nMost account abstraction methods still require some form of dependency — whether it is a relayer, bundler or layer 2 smart contract. Web3 users shouldn’t be expected to understand the difference in risk between the three primary alternatives.\n\nBut if the industry adopts a universal standard, users may feel more comfortable using smart contracts wallets — unlocking the smart wallet advocate’s promised new wave of adoption.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vcHJvdG9zLmNvbS9ldGhlcmV1bS1saXF1aWQtc3Rha2luZy1icmFjZXMtZm9yLWFwcmlsLTEyLXdpdGhkcmF3YWxzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Ethereum liquid staking braces for April 12 withdrawals - Protos",
        "content": "Listen to this article.\n\nWith Ethereum’s Shanghai update scheduled for April 12, holders of liquid staking tokens are likely keen to find out how the event will affect their holdings. ETH liquid staking tokens belonging to just two services — Lido (stETH) and Coinbase (cbETH) — are worth over $10 billion. Other services include RocketPool, StakeHound, Frax, StakeWise, Bitcoin Suisse, and Liquid Collective.\n\nPrior to Shanghai, any ETH deposits into these protocols were not able to be withdrawn from Ethereum’s (deposit-only) Proof-of-Stake (PoS) system. After Shanghai, albeit subject to lengthy withdrawal queues, users will be able to unstake their ETH and sell or migrate to a new liquid staking service.\n\nSpecifically, holders of a liquid staking token like stETH will be able to request a redemption for actual ETH from Lido, redeeming their stETH for official ETH. In the case of stETH, a token holder will soon be able to request a redemption from Lido DAO’s smart contracts, the issuer of stETH.\n\nRead more: Ethereum’s largest staking service finally regains stETH peg\n\nAs a result, all liquid staking administrators will have to compete against other staking services just to retain their current depositors.\n\nPrior to Shanghai, liquid staking services have only been competing for inflows. Next month, they’ll also compete to retain their investors.\n\nOf course, each service issues a different token and advertises slightly different reward mechanisms to pass along the yield earned from Ethereum’s PoS validation. Below is a review of Ethereum’s major liquid staking services.\n\nCoinbase holds 11% of staked ether\n\nCoinbase has the advantage of being one of the world’s oldest and largest digital asset exchanges. It also operates one of Ethereum’s largest liquid staking services.\n\nCoinbase customers send ETH directly to the Coinbase Earn product where Coinbase will stake it on the customer’s behalf. This simplicity has allowed it to accumulate an 11% share of staked ETH.\n\nIn August 2022, Coinbase launched its native ‘staked Ethereum’ token, cbETH. Unlike Lido DAO’s 1:1 peg of its liquid staking token (stETH) to ETH, Coinbase recalculates cbETH’s value on the original amount of staked ETH plus the rewards it’s earned over time.\n\nThis feature means cbETH holders may redeem one cbETH for more than one ETH after the Shanghai upgrade.\n\nOne risk factor is that Coinbase operates only one validator. Although its validator is enterprise-grade and properly maintained, if it goes offline, none of the stakers using Coinbase’s staking platform can earn rewards. In addition, Ethereum’s protocol would slash Coinbase’s stake as a penalty for downtime.\n\nAs a trade-off for convenience and simplicity, Coinbase offers lower rewards than most ETH staking pools. It currently offers customers a 3.89% APY on Ethereum staked into Coinbase Earn.\n\nRead more: Kraken settles with SEC over crypto staking — is Coinbase next?\n\nLido validators are less likely to get bored\n\nBy far the largest liquid staking platform with 31% share of all staked ETH, Lido has more than 5.8 million ETH in its staking pool.\n\nUnlike self-administered, so-called ‘solo staking,’ Lido offers compounded yields on staked holdings. This essentially allows Lido Staked Ethereum (stETH) token holders to earn interest on previously earned interest. It has a 10% fee on staking rewards that it splits between node operators and the treasury of Lido DAO.\n\nLido gives staking rewards daily by rebasing its liquid staking token, stETH. Rebasing is a technique whereby a protocol adds and/or subtracts tokens directly within wallets that have approved rebasing actions. Rebasing increases the quantity of stETH by a small percentage each day.\n\nBecause staked ETH is obviously yield-bearing, this feature ensures that holders can redeem stETH tokens for ETH at a 1:1 ratio when Shanghai goes live.\n\nLido claims to be highly selective in choosing its third-party validators. It says it chooses committed, professional validators less likely to get bored and turn off their machines after a few months. A deactivated validator is subject to slashing and cannot earn rewards while offline or out of consensus.\n\nOne downside is that Lido reserves the option of socializing the risk of slashing, reducing the earnings of all stakers on its platform to avoid a major hit on any single staker.\n\nAs a smart contract-based protocol, Lido is exposed to risks of hacks and exploits. Like all other smart contracts, the price of its liquid staking token could collapse if hackers are successful.\n\nRocketPool says it will socialize slashing penalties\n\nRocketPool has more than 430,000 ETH in its staking pool. Unlike Coinbase, it has 2,199 validators, making it one of the most distributed liquid staking services by number of validators. Like Coinbase, RocketPool calculates the value of its rETH token on the amount of initially staked ETH plus earned rewards over time.\n\nRocketPool offers two options for staking.\n\nUsers can simply stake any amount of ETH and earn interest.\n\nIf they are willing to stake at least 16 ETH, users can also stake and run a node for a higher APR plus RPL rewards. RPL is the proprietary governance token of the RocketPool community. It advertises its ‘Stake + Run Node’ option as half as expensive as solo staking, which requires at least 32 ETH for activating an official set of validator keys.\n\nRocketPool bases its APR on a seven-day moving average, which currently sits at 5.97% for simple staking — far higher than Coinbase’s 3.89% — and as high as 7.12% for its “Stake + Run Node” option.\n\nRocketPool says it will socialize slashing penalties and other losses from a bad or deactivated node, which reduces the loss to any individual staker.\n\nStakeWise does things a little differently\n\nStakeWise operates a little differently by offering two liquid staking tokens.\n\nWhen a user contributes ETH to StakeWise, StakeWise gives them deposit tokens plus reward tokens used to pay the ‘interest’ for staking ETH. Instead of simply rebasing the original token like Lido does to its stETH, StakeWise has sETH2 grant daily rewards in a token called rETH2. Holders can redeem rETH2 for ETH at a 1:1 ratio.\n\nStakeWise offers real-time node monitoring as well as an API for third-party app development.\n\nFrax does things VERY differently\n\nFrax takes a very different approach with its token rewards. When users send ETH to its ‘frxETHMinter’ tool, they receive an equivalent amount of frxETH token. However, frxETH isn’t eligible for ETH staking rewards on its own.\n\nUsers have to go through one additional step to earn rewards. They need to exchange their frxETH tokens for ‘staked frxETH,’ or sfrxETH. Then they can earn interest on their deposited frxETH. Their sfrxETH will be worth the original frxETH, plus any frxETH rewards they received.\n\nAs one might expect, sfrxETH trades slightly higher than frxETH.\n\nConclusion\n\nIn summary, Coinbase, Lido, Stakewise, and Frax are four of the biggest ETH liquid staking pools. They may experience large redemption requests or a run on their liquidity pools on secondary exchanges after Ethereum’s upcoming Shanghai update enables withdrawals of staked ETH. Shanghai could activate by April 12.\n\nOn the other hand, the Shanghai upgrade might strengthen these liquid staking services by enabling true redemption of pooled, staked ETH via Ethereum’s official protocol.\n\nOver the next four weeks, liquid staking will undoubtedly continue to provide a popular way to stake ETH while retaining a liquid staking token that usually trades close to par with ETH.\n\nFor more informed news, follow us on Twitter, Instagram, and Google News or subscribe to our YouTube channel."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1kZXZzLWNvbmZpcm0tZXRoLXN0YWtpbmctd2l0aGRyYXdhbHMtZGF0ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Devs Confirm ETH Staking Withdrawals Date - DailyCoin",
        "content": "Ethereum core developers have decided on the exact date and time for the Shapella upgrade.\n\nThe Shapella upgrade will enable staked ETH withdrawals.\n\nThere is $29.45 billion worth of ETH currently staked.\n\nEthereum (ETH) is one step closer to releasing one of the most important network upgrades in the blockchain’s history.\n\nOn Thursday, core Ethereum developers agreed on when to launch the Shanghai-Capella, or Shapella, upgrade. The Shapella upgrade will enable withdrawals of staked ETH by network validators.\n\nThe developers are targeting April 12 as the date to release the upgrade. The exact time for the upgrade is 10:27 a.m. UTC, with epoch number 620,9536.\n\n6209536 4/12/2023, 10:27:35 PM UTC — timbeiko.eth (@TimBeiko) March 16, 2023\n\nThere are currently 17.680 million ETH staked on the Beacon Chain, which equates to $29.45 billion. Some observers believe unlocking the staked ETH will significantly affect the price of ETH as those that have wanted to sell their ETH will finally be able to do so.\n\nEthereum core developers have been actively preparing for the Shapella upgrade in the last few months. They’ve successfully rehearsed the withdrawals on three public testnets: Sepolia, Zhejiang, and Goerli.\n\nETH is currently trading at $1,660, up 2% in the last 24 hours and 8.6% in the last seven days, according to data from CoinGecko. The second largest blockchain has a market capitalization of $200 billion.\n\nOn the Flipside\n\nSome industry observers believe the Shapella upgrade won’t trigger massive ETH sales. Instead, the majority of stakers will move to liquid staking to have more flexibility with their ETH.\n\nWhy You Should Care\n\nETH staking withdrawals are one of the most important Ethereum blockchain upgrades in history. Those who believe there will be massive sell-offs after withdrawals are enabled should consider hedging their positions or having another plan to avoid losing investment value.\n\nRead more about Ethereum:\n\nWhat Is Ethereum? Blockchain’s Future of Finance Explained\n\nRead more about Euler’s ultimatum to its hacker:\n\nEuler’s 24-Hour Ultimatum to Hacker: Return 90% of Stolen Funds or Face Arrest"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9tb25leS9pcy1ldGhlcmV1bS1hLXNlY3VyaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Is Ethereum a Security? • What Does the S.E.C. Think in 2024 - Benzinga",
        "content": "Is Ethereum a security? The question has financial experts divided. Some experts believe that cryptocurrencies like Ethereum should fall under security laws, while others argue that Ethereum's decentralized nature sets it apart. The outcome of the debate is still uncertain, but it's a topic that continues to spark discussion in the media and among industry leaders.\n\nget started Limited Time Offer: Trade $100, Get $10 Buy $100 worth of crypto and get a $10 bonus! get started Disclosure: eToro supports the following currencies: BTC, ADA, DASH, DOGE, EOS, ETH, LTC, NEO, XLM, XTZ, TRX, ZEC. eToro USA LLC; Investments are subject to market risk, including the possible loss of principal. T&Cs apply. *The bonus is available to Benzinga readers in the US for open states only. Served by eToro USA LLC. Show More\n\nIs Ethereum a Security?\n\nWhether or not Ethereum is considered a security is a matter of debate and interpretation. In general, a security is a financial instrument that holds value, represents ownership in an asset, and can be traded between parties. Some examples of securities are stocks or bonds. Ethereum is a blockchain-based platform that enables the creation and execution of decentralized applications and smart contracts. ETH, the native token of Ethereum is used to pay for transaction fees and services on the network.\n\nThe Securities and Exchange Commission (SEC) has not provided a clear ruling on whether Ethereum is a security, but it has stated that cryptocurrencies and coin offerings may be considered securities and subject to federal securities laws. The SEC has also said that whether a particular asset is a security depends on the facts and circumstances of the case.\n\nThe Howey Test Applied to Cryptocurrency\n\nThe Howey Test is a critical evaluation tool used by the Securities and Exchange Commission (SEC) in the US to determine whether a specific asset should be considered a security under federal laws. Securities, such as stocks and bonds, are financial instruments that meet the criteria established by the Howey Test.\n\nAccording to The Securities Act of 1933, an investment contract must satisfy all three requirements to be considered a security. These requirements are:\n\nAn investment of Money In a common enterprise With reasonable expectations of profits Derived solely from the efforts of others\n\nThe first requirement of the Howey test, “An investment of money,” is often debated when it comes to Ethereum. Some argue that validators depositing their ETH in the smart contract to validate transactions and secure the Ethereum blockchain is not considered “an investment of money,” as they are putting ETH as collateral to participate in the proof of stake (PoS) mechanism and not making a purchase or investment. However, others argue that the ETH deposited as collateral can be viewed as a risk and may fall under the investment criteria.\n\nUnder the second requirement of the Howey Test, “In a common enterprise,” there are two tests of Commonality that can be applied.\n\nHorizontal Commonality: This test refers to the individual's capital being tied to each other by pooling of funds and proportional distribution of profits. Some argue that staking ETH qualifies as horizontal commonality because the fund is staked in a similar smart contract. While others debate that since no one has direct control over the staked ETH, there is no grouping of funds. The staked ETH remains distinct and bound to the node. Additionally, there is no pro-rata distribution of profits, as validators are not incentivized or penalized on the transactions that the validators validate. Vertical Commonality: This test focused on the relationship with the investor and the promoter. The argument is that it does not apply to Ethereum, since there is no promoter. Etherum is a decentralized and open-source project, anyone can be a validator. The actions depend on the codes of the smart contract.\n\nThe third requirement of the Howey Test states that for an investment to be considered a security, there must be “with reasonable expectations of profits” Some argue that there is a reasonable expectation of profits because the value of ETH is expected to go up and down and investors are able to profit. However, it is also seen as a passive investment not an active one.\n\nThe fourth requirement states that for an investment to be considered a security they are derived solely from the efforts of others. Ethereum's validators are made to work to maximize their uptime and stay connected with the network, which is not solely dependent on the efforts of others.\n\nThe Argument for Ethereum Being a Security\n\nThe argument that Ethereum is a security centers around the idea that the purchase and holding of Ethereum can be considered an investment of money, and therefore a security, under the Howey Test. They also argue that there is a common enterprise, as Ethereum is a decentralized network where all participants are working towards the same goal of maintaining the network. Finally, they argue that there is a reasonable expectation of profits derived from the efforts of others, as the value of Ethereum can increase and the holders can profit from the efforts of the Ethereum developers and miners.\n\nEthereum switching from a proof of work to a proof of stake consensus mechanism, has had people speculate that the ETH ticker doesn't necessarily mean it is the same token anymore and should be considered a security.\n\nWhy Ethereum Isn’t a Security\n\nThe argument that Ethereum is not a security is based on the idea that buying and holding Ethereum does not meet the criteria of an investment contract under the Howey test.\n\nFirst, the argument is that buying Ethereum is not an investment of money, but rather a purchase of a utility token that is used to access the Ethereum network and its various decentralized applications. It is not a passive investment, but rather an active participation in the network.\n\nSecond, the argument is that there is not a common enterprise, as Ethereum is a decentralized network where participants are not pooling their funds and there is no central authority controlling the network. Each individual's capital is distinct and not tied to each other.\n\nThird, the argument is that there is no reasonable expectation of profits derived solely from the efforts of others. The value of Ethereum is determined by the market demand and supply, the value of the network, and the efforts of the individual holders who use and contribute to the network. The rewards for holding and participating in the network is not solely dependent on the efforts of others.\n\nWhat Happens If The SEC Says Ethereum Is A Security?\n\nIf the SEC were to officially classify Ethereum as a security, it would have a significant impact for the Ethereum network and its community.\n\nIt would mean that any transactions involving the sale or exchange of Ethereum would be subject to federal securities laws, including registration and disclosure requirements. This could make it more difficult for individuals and companies to buy and sell Ethereum, and may also make it more difficult for new decentralized applications to launch on the Ethereum network.\n\nAnother impact that could happen is it would mean that exchanges that list Ethereum would be subject to greater regulatory inspection,and may be required to register as securities exchanges. This could lead to some exchanges delisting Ethereum or not listing it in the first place..\n\nAnother possibility would mean that individuals involved in the sale or exchange of Ethereum may be held liable for failure to comply with securities laws, which could result in fines or other penalties.\n\nIt's also worth noting that the classification of Ethereum as a security could have a negative impact on the overall crypto market, as it could lead to more regulatory inspections and more difficulties for crypto projects to launch and operate.\n\nHow to Buy Ethereum\n\nWhether or not Ethereum is technically a security, its still available on a wide range of the best cryptocurrency exchanges. A few of the best crypto exchanges that offer Ethereum trading are Uphold, Coinbase, Robinhood, eToro and HYCM. If you don't already have an account with a crypto exchange you will have to make a new one and verify your identity with the exchange. As soon as your account is verified you can deposit funds and start buying Ethereum.\n\nWhat Are Security Tokens?\n\nSecurity tokens and cryptocurrency are similar in the way they are created and stored. However, the difference lies in the purpose and intended use of the tokens. Security tokens are a new way to transfer ownership of assets utilizing the blockchain platform. They allow for the digitization of assets and create automation with being in compliance with securities laws. They offer similar rights and benefits as traditional securities, like stocks and bonds. They have the ability to freeze or lock certain tokens if they are being held by a restricted person.\n\nThe market for security tokens is still in its early stages, but it is expected to grow significantly in the coming years as more and more assets are tokenized and more investors are attracted to the benefits of security tokens.\n\nWhat Is Ethereum Considered, If Not a Security?\n\nEthereum and other cryptocurrencies are a relatively new and a unique asset class that do not fit neatly into traditional investment frameworks. Unlike stocks or bonds, which are clearly defined as securities under U.S. laws, Cryptocurrencies like Ethereum are decentralized and operate on a blockchain network, making it hard to apply the same legal criteria as traditional investments.\n\nIt is important to understand that although Ethereum the platform is not currently considered a security. Some tokens built on Ethereum blockchain may be considered securities by the SEC, depending on how they are structured, marketed and offered to investors."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtanVtcHMtNi1hcy1zaGFuZ2hhaS1tYWlubmV0LXVwZ3JhZGUtZGF0ZS1pcy1hbm5vdW5jZWTSAVZodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLWp1bXBzLTYtYXMtc2hhbmdoYWktbWFpbm5ldC11cGdyYWRlLWRhdGUtaXMtYW5ub3VuY2VkP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Jumps 6% as Shanghai Mainnet Upgrade Date Is Announced - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum's price advanced on Friday, building upon its recovery from Wednesday's lows of $1,613. On March 17, Ethereum reached intraday highs of $1,768 — the highest since September 2022 during the run-up to the Ethereum Merge.\n\nAdvertisement\n\nAt the time of writing, ETH was up nearly 6% in the last 24 hours at $1,750.\n\nThe much-anticipated Ethereum Shanghai hard fork's mainnet date has been scheduled for April 12. Ethereum core developers agreed upon the timeline during the All Core Developers Execution Layer #157 call on March 16.\n\nThe #Ethereum main chain will undergo the Shanghai hardfork at slot 6209536, which is April 12, 2023.\n\n\n\nGet live slot visualisation on the https://t.co/prW3YorSh6 frontpage for this highly anticipated hardfork 🎉\n\n\n\nLink to slot: https://t.co/WicBeSokvx pic.twitter.com/tgYIYEujaw — beaconchain.eth 📡🦇 (@beaconcha_in) March 16, 2023\n\nEthereum core developer Tim Beiko tweeted the target date as April 12 at 10:27:35 p.m. UTC, slot 620,9536.\n\n6209536 4/12/2023, 10:27:35 PM UTC — timbeiko.eth (@TimBeiko) March 16, 2023\n\nThis will become official once the developers vote on the date and GitHub confirms it.\n\nStaked ETH withdrawals will be possible because of the Ethereum Shanghai and Capella upgrades, also known as \"Shapella,\" which complete Ethereum's entire shift to a proof-of-stake (PoS) network.\n\nInitially scheduled for March, the upgrade was later postponed by developers until April.\n\nBinance announces support for ETH 2.0 staking withdrawals\n\nTop crypto exchange Binance says it will support ETH redemptions on the ETH 2.0 staking page within a week of the function becoming available on the Ethereum network.\n\n#Ethereum’s Shanghai Upgrade is targeted to happen on April 12.\n\n\n\nThe network will then start supporting $ETH staking withdrawals.\n\n\n\n🧵 Learn how #Binance will support redemptions and withdrawals. pic.twitter.com/eUCHJw3atY — Binance (@binance) March 17, 2023\n\nAlso, after the feature is released, users who took part in ETH 2.0 staking will be able to convert BETH to ETH in a 1:1 ratio on the ETH 2.0 staking page.\n\nThe forthcoming Shapella upgrade, which is anticipated to be live on the mainnet on April 12, will begin supporting staking withdrawals for ETH.\n\nIt urges its users to keep in mind that they may be subject to a daily ETH redemption quota because of the processing constraints on the Ethereum network. It states that waiting in queues for ETH redemption might be expected.\n\nAfter the Shapella upgrade is finished, Binance promises to put out another announcement with more information about ETH staking withdrawals."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLWZvdW5kZXItdXJnZXMtc2VsZi1jdXN0b2R5LXJlY29tbWVuZHMtdXNlLW9mLW11bHRpLXNpZy1zb2NpYWwtcmVjb3Zlcnktd2FsbGV0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Ethereum founder urges self-custody – recommends use of multi-sig, social recovery wallets - CryptoSlate",
        "content": "Ethereum co-founder Vitalik Buterin took to social media to tout the benefits of using multi-sig and social recovery wallets for self-custody of crypto assets.\n\nButerin said that self-custody is important as centralized entities can become untrustworthy and people can lose their funds without notification. However, he added that being solely responsible for the entirety of one’s security system carries inherent risks that can be minimized by using multi-sig and social recovery technology wallets.\n\nThe Ethereum co-founder said he and the Ethereum Foundation use multi-sig wallets to secure most of their crypto assets.\n\nMulti-sig & Social recovery\n\nAccording to Buterin, multi-sig wallets — like Gnosis Safe — should be used for cold storage of crypto-assets as they require multiple keys to sign off on transactions.\n\nUsers can assign multiple people to hold their keys and set up their wallet, so x amount of keys are required for a transaction to be approved — this could be all keys or some.\n\nMeanwhile, social recovery wallets are a nascent technology being developed recently and are set to become more accessible in the coming months with applications like the “Soul Wallet.”\n\nSocial recovery wallets allow transactions to be approved with a single “master key” which can be recovered if lost. Users can assign people to hold “recovery keys,” which can be used to reset the master key if lost.\n\nButerin said that once social recovery technology is made more accessible, he would recommend using it for hot storage.\n\nHe added that both technologies allow people to safeguard their assets in their lifetime and ensure they are recoverable after their deaths.\n\nGuardians\n\nButerin said an important part of using these technologies is choosing the “guardians” wisely. Guardians are people one would designate as holders of keys to confirm transactions or recover wallets. He said:\n\n“Two key questions in using multi-sig wallets and social recovery wallets securely are: (i) whom do you choose as guardians, and (ii) what instructions do you give them?”\n\nAccording to Buterin, guardians have to be people who will not lose keys and who will not conspire to steal the holder’s assets. As such, guardians should be as decentralized as possible. He added that each guardian’s risks should differ, and people should avoid commonalities when choosing guardians.\n\nHe said guardians could be people or devices, and using one’s device or wallet to act as a guardian does not reduce decentralization and is okay. However, most guardians should not be devices under a single person’s direct control.\n\nButerin recommended using guardians that do not know each other, and where possible, guardians should be in different countries. He said that guardians would only need to know each other in the case of a holder’s demise, and in those cases, these guardians would naturally find each other by reaching out to friends and family.\n\nAdditionally, Buterin said that guardians must be tested multiple times a year to ensure they still have access to their keys and there are no operational issues.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3MvY29pbmJhc2Utd2FybnMtb2YtZGVsYXlzLWZvci1ldGgtdW5zdGFraW5nLWFmdGVyLWV0aGVyZXVtLW1lcmdl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Coinbase warns of delays for ETH unstaking after Ethereum Merge - Blockchain.News",
        "content": "Coinbase users may face delays in unstaking their ETH after Ethereum's Shapella upgrade, due to on-chain processing. Coinbase advises users to be patient and offers a liquid staking option, \"cbETH.\"\n\nCoinbase has warned its users that unstaking requests for ETH on its platform may take weeks or even months to process after the upcoming Ethereum network update in mid-April. The Shapella upgrade will enable stakers to withdraw their ETH holdings after they were locked up during the Ethereum Merge event in September 2022, which transitioned the network from proof-of-work (PoW) to proof-of-stake (PoS).\n\nCoinbase anticipates a flood of unstaking requests once the functionality is enabled, but as a channel to pass unstaked ETH to customers once released by the protocol, it has no control over the on-chain processing of requests. Unstaking requests will open to all Coinbase customers at the same time and be queued based on when they are received.\n\nWhile Coinbase cannot give an exact timeframe for unstaking, it expects considerable wait times due to the time it takes for the Ethereum network to process transactions. In the meantime, Coinbase provides a liquid staking option called \"cbETH,\" which lets stakers trade ETH while it is still locked up, with the promise of redeemability at a later date.\n\nThe Ethereum Merge was a significant milestone for the network's scalability, transitioning from PoW to PoS to reduce energy consumption and improve transaction processing times. While the Ethereum network remains the leading platform for decentralized applications and smart contracts, ETH stakers have been unable to access their holdings since the Merge. The upcoming Shapella upgrade will finally provide a solution, allowing users to withdraw their staked ETH and stake more without being subject to an indefinite lockup period.\n\nOverall, Coinbase's warning of potential delays in unstaking ETH highlights the complexities and limitations of on-chain processing. While the Ethereum network continues to evolve and improve, users must be patient and consider alternative options like Coinbase's cbETH to mitigate the inconvenience of locked-up assets."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDMvMTYvYXJiaXRydW0tZXRoZXJldW0tYXJiLWFpcmRyb3AtZGFvLWxheWVyLTMtYXJiaXRydW0tb3JiaXQtb2ZmY2hhaW4tbGFicy_SAXFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzAzLzE2L2FyYml0cnVtLWV0aGVyZXVtLWFyYi1haXJkcm9wLWRhby1sYXllci0zLWFyYml0cnVtLW9yYml0LW9mZmNoYWluLWxhYnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Arbitrum, a leading scaling solution for Ethereum, will finally have a native cryptocurrency - Fortune",
        "content": "Offchain Labs, the developer behind the Arbitrum ecosystem, announced on Wednesday it would be airdropping, or releasing for free to select individuals, $ARB, a new token designed to govern the two Arbitrum blockchains.\n\nThe new cryptocurrency will be released on March 23 and sent to users of Arbitrum One, the larger of the two blockchains, and Arbitrum Nova, specifically designed for Web3 games and social media applications.\n\nAs part of the token offering, Offchain Labs, whose founders are a Princeton University professor and his two Ph.D. students, will establish the Arbitrum Foundation and an associated DAO, or decentralized autonomous organization, to govern the management and development of the Arbitrum ecosystem. Holders of $ARB will be allowed to vote on proposals submitted to the DAO, further decentralizing control of Arbitrum.\n\n“Looking ahead, we’re moving closer and closer toward a decentralized financial system, with the Arbitrum technology at the very forefront,” Steven Goldfeder, CEO and cofounder of Offchain Labs, said in a statement.\n\nThe announcement follows Aribtrum’s sudden rise in less than two years as one of the most popular layer-2 blockchains on Ethereum. With $1.6 billion in total assets locked on the chain, according to DeFi Llama, Arbitrum outperforms by almost double closest competitor Optimism, another layer-2 blockchain that similarly makes Ethereum transactions faster and less expensive. Optimism already has a token, OP, with a current market capitalization of about $750 million, according to CoinMarketCap.\n\nGoldfeder told Fortune that the planned $ARB airdrop was a means toward further decentralizing Arbitrum, not a cash grab. “I don’t care about the token for the sake of a token. I really don’t,” he added. “The token is a tool to decentralize and a tool to give governance power over to users.”\n\nHe said $ARB would only be used for governance, or providing individuals voting power in Arbitrum’s new DAO. Ether, the native currency on Ethereum, would still be used for transaction fees.\n\nIn addition to the announced release of $ARB and the foundation of the Arbitrum DAO, Offchain Labs announced on Wednesday the unveiling of Arbitrum Orbit, a means for developers to build layer-3 blockchains on top of the Arbitrum blockchains.\n\n“There’s this increasing trend in the community where projects not only want to launch their own application, they actually want to launch their own chain,” Goldfeder told Fortune.\n\nHe said that as Offchain Labs, which announced that it raised $120 million in funding in 2021 at a valuation of $1.2 billion, loosens its control over Arbitrum, it will spend the next few months focused on onboarding developers who want to create their own layer-3 blockchains on top of Arbitrum’s network."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAzLzE3L2NvaW5iYXNlLWludmVzdG9ycy1iZXdhcmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Coinbase Investors Beware: There Is Serious Cause for Concern Ahead - The Motley Fool",
        "content": "Down more than 81% from its all-time high and yet up by more than 88% since the beginning of 2023, Coinbase Global (COIN 0.78%) is in a peculiar position. Benefiting from the recent rally in the crypto market, Coinbase's price jumped significantly in the past few months as a renewed sense of optimism has investors hoping that the worst might just be over.\n\nHowever, there is reason to believe that bumpy and dangerous roads are ahead.\n\nAfter a tumultuous and controversial 2022, which was riddled with multiple cryptocurrency companies going bankrupt, U.S. regulators have ratcheted up pressure on the crypto industry as a whole. This could be bad news for Coinbase.\n\nRegulators turn up the heat\n\nAt the beginning of February, the Securities and Exchange Commission (SEC) reached a settlement with the cryptocurrency exchange platform Kraken after alleging that their staking service met the criteria of an unregistered security. As a result, Kraken was forced to discontinue its staking product and pay a $30 million fine.\n\nMore recently, the New York Attorney General introduced a lawsuit with KuCoin, another cryptocurrency exchange. Similar to the SEC-Kraken case, the state of New York alleges that KuCoin's staking products are technically unregistered securities and, as such, are currently out of compliance.\n\nFurthermore, the New York AG took the allegations a step further and claimed that not only were the staking products technically securities, but that the world's second-most valuable cryptocurrency, Ethereum (ETH 1.31%), also met the criteria of a security.\n\nThis is where things could get particularly troublesome for Coinbase.\n\nThe staking problem\n\nTo diversify revenue outside of just transaction fees, Coinbase has prioritized building out its staking services and intends to become \"the best platform to generate rewards on crypto.\"\n\nPotentially even worse for Coinbase is the New York AG's allegations that Ethereum is technically a security. If this is judged to be true, it could deal a serious blow to Coinbase's future profits.\n\nThe reason is due to a planned Ethereum upgrade scheduled for 2023 and Coinbase's dependence on the cryptocurrency to generate revenue.\n\nThe new upgrade, known as Shanghai, would allow those who stake Ethereum to withdraw their funds. Currently, users are unable to do so, and as a result, the number of users who stake Ethereum is drastically lower than other proof-of-stake cryptocurrencies which allow withdrawals, like Cardano or Solana.\n\nIn a recent report by J.P. Morgan, analysts found that around 25% of all trading volume on Coinbase is Ethereum-based. The company generates roughly $50 million from clients currently staking the cryptocurrency. J.P. Morgan analysts continued that with the promise of Shanghai looming, Coinbase could significantly bolster profits if it leads to an increase in users looking to utilize the exchange for their staking needs.\n\nJ.P. Morgan estimated that on the low end, profits could increase to $225 million and possibly even up to $545 million if 95% of retail investors currently using the platform decide to stake their Ethereum.\n\nBut this could all come crashing down. There are arguably too many question marks around Coinbase's Ethereum staking. It's a potentially significant moneymaking project, but regulators have to pin down their approach to this stuff to make it an investable quality. If Ethereum is deemed a security in the New York case and the SEC decides to zero in on Coinbase, it could deal a serious blow to Coinbase's future revenue growth.\n\nWhile much remains unknown in the regulatory environment, it might be best to hold off on adding any Coinbase to portfolios until a clearer picture comes into focus. There are plenty of alternatives available to crypto investors who want a proper stock in the digital asset sector, after all."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbmdhcGUuY29tL2JyZWFraW5nLWV0aGVyZXVtLXNoYW5naGFpLXVwZ3JhZGUtZGF0ZS1vZmZpY2lhbGx5LWFubm91bmNlZC_SAVZodHRwczovL2NvaW5nYXBlLmNvbS9icmVha2luZy1ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlLWRhdGUtb2ZmaWNpYWxseS1hbm5vdW5jZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Breaking: Ethereum Shanghai Upgrade Date Officially Announced - CoinGape",
        "content": "The most-awaited Ethereum Shanghai upgrade now has an official date. During the All Core Developers Execution Layer (ACDE) meeting on Thursday, Ethereum core developers set April 12 as the official date for the Shanghai mainnet upgrade.\n\nEthereum core developer Tim Beiko in a tweet on March 16 revealed that Shapella (Shanghai and Capella) upgrade on the mainnet is scheduled for happen at epoch 6209536 on April 12 at 10:27:35 PM UTC. Other developers also shared the news as staked Ethereum withdrawals are coming as the date was slightly delayed from the initial target of March.\n\nadvertisement\n\nThe Shanghai upgrade will enable validators to withdraw their Ethereum staked on the Beacon Chain to the execution layer. It will also introduce new functions to both the execution and consensus layers. The Shapella upgrade introduces changes to the execution layer (Shanghai), consensus layer (Capella), and the Engine API.\n\nEthereum clients will announce the software releases for the upgrade soon and would require nodes and validators to focus on updating their client software. Recently, Ethereum core developers also noted that several validators didn’t upgrade with the latest client software releases causing issues after the Shapella upgrade on the Goerli testnet\n\nLido Announced Delay in Staked Ethereum Withdrawals\n\nLido Finance, the largest Ethereum liquid staking platform, announced that Lido staked ETH (stETH) withdrawals will likely be delayed to May. It revealed that the time spent on undertaking V2 audits has caused delays in readiness for the Ethereum Shanghai Goerli upgrade.\n\nLido revealed that stETH withdrawals are unlikely to happen on the mainnet until all audits are complete. The mainnet withdrawals are estimated to go live in mid-May.\n\nEthereum price is up just 1% in the last 24 hours, with the price currently trading at $1,664. The 24-hour low and high are $1,616 and $1,671, respectively. On Tuesday, the ETH price hit a high of $1,779 amid the massive recovery in the broader crypto market.\n\nAlso Read: Arbitrum To Airdrop ARB Tokens In March, Complete Details Inside"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vZGVjcnlwdC5jby8xMjM3MjcvZXRoZXJldW0tbGF5ZXItMi1zb2x1dGlvbi1hcmJpdHJ1bS1hbm5vdW5jZXMtdG9rZW4tYWlyZHJvcC1vcGVucy10ZWNoLXN0YWNrLWRldnPSAXBodHRwczovL2RlY3J5cHQuY28vMTIzNzI3L2V0aGVyZXVtLWxheWVyLTItc29sdXRpb24tYXJiaXRydW0tYW5ub3VuY2VzLXRva2VuLWFpcmRyb3Atb3BlbnMtdGVjaC1zdGFjay1kZXZzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Layer-2 Solution Arbitrum Announces Token Airdrop, Opens Tech Stack to Devs - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nArbitrum is finally decentralizing into the hands of its community.\n\nThe popular Ethereum scaling solution today announced the imminent launch of its native ARB token, joining other layer-2 projects like Optimism.\n\nThe governance token will let holders vote and propose any changes that they would like to execute to Arbitrum. The project is an optimistic rollup solution, which moves network activity off of the Ethereum mainnet to lower gas costs. According to data pulled from L2 Beat, it commands more than 55% of the layer-2 market in terms of how much money is on it.\n\nThough Offchain Labs, the dev team behind Arbitrum, has announced the token drop, its distribution won’t kick off for another week.\n\nIn the meantime, users will have the ability to nominate delegates to help steer the direction of the project. Akin to representative democracy, token holders who may have a vested interest in a crypto project, but perhaps not the time or technical acumen to truly improve a protocol, can give their voting power to another individual.\n\nEarly Arbitrum users, determined by an internal eligibility criterion, will be eligible to receive the new ARB token, said Offchain Labs’ co-founder and CEO Steven Goldfeder.\n\n“We worked very closely with Nansen and meticulously, over many, many months to decide the criteria for the user airdrop,” he said.\n\nIndividual user addresses will enjoy 11.6% of the entire token supply, with another 1.1% going to other projects built on Arbitrum.\n\nAD\n\nAD\n\n“Not only are we giving Arbitrum users a say in governance, we’re also giving DAOs of Arbitrum projects and projects building on Arbitrum a say,” said Goldfeder.\n\nThe total value locked (TVL), or the amount of money sloshing around in a specific project, is just one metric that the team has used, but Goldfeder insisted that eligibility has been very broad to include as many projects as possible.\n\n“We try not to overfit for one metric,” he said. “For gaming projects or social projects, TVL is not the metric they use.”\n\nArbitrum turns to token-governed development\n\nPrior to today, Offchain Labs was the sole entity in charge of making changes or adjustments to the scaling technology.\n\nNow, though, alongside the launch of the token, Goldfeder and his team will be giving these controls over to its community. These controls also come with the added responsibility that as soon as the DAO executes a vote, the code will be updated simultaneously. DAO votes have usually been used to signal to developer teams which changes to make, but examples in the past also show how sometimes that signal doesn't actually go on-chain.\n\n“There will be the DAO and the community that decides the future of the chain and the future of technology,” said Goldfeder. “There will be Offchain and others that will be developing technology, but ultimately, it’ll be the direction of the DAO.”\n\nImportantly, it isn’t a move to fully open-source the code. Instead, said Goldfeder, it’s a middle ground, giving the community the licensing regime to bestow on other developer teams.\n\n“The community will have the ability to decide the future of technology and how it wants to license it,” he told Decrypt. “If one thing is clear, that in the Arbitrum ecosystem, it's in the community's best interest, and in everyone's best interests, to be open and free to use and free to modify. I think that will spur a lot of innovation.”\n\nAD\n\nAD"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXNldC1kYXRlLWZvci1ldGgtd2l0aGRyYXdhbHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Devs Finally Set Date for ETH Withdrawals - Blockworks",
        "content": "Following a successful Goerli testnet upgrade, Ethereum’s “Shapella” hard fork has now been scheduled to deploy on mainnet on Apr. 12.\n\nThe Shapella upgrade is the combination of the execution layer (Shanghai) with the consensus layer (Capella), which will allow validators to withdraw their locked-up ether from the network.\n\n“It’s called “Shapella” as a portmanteau of “Shanghai” and “Capella,” Noam Hurwitz, engineering lead at Alchemy told Blockworks. The date was decided during today’s Ethereum core developers call.\n\nIn the existing proof of stake model, the Ethereum network is secured by decentralized validators who must post 32 ether — about $52,500 — to participate in block production on the network.\n\nThe first ETH stakers locked their tokens in the network’s Beacon contract in Nov. 2020. Ether was worth $450 at the time, now it’s trading for $1,660.\n\nActivating withdrawals will enable two things, Hurwitz said. First, offline validators can reclaim their principal stake, and they can also claim earned fees.\n\n“There’s also a less talked about change that reduces the gas cost applied to earning this fee,” Hurwitz said. “So in general, this is a much anticipated economic unlock for validators.”\n\nA researcher at Arbitrum who goes by the pseudonym terencechain told Blockworks that there aren’t many roadblocks ahead of the Shapella hard fork on Ethereum’s mainnet.\n\n“Goerli testnet went smoothly despite some operators forgetting to upgrade their nodes,” they said. “Client teams are gearing up for the main release for upgrading the mainnet to Shapella, not that we have an upgrade time. Expect releases in the next 2 weeks and minor last min bug fixes.”\n\nTooling is receiving last minute bug fixes, and user interface is receiving last minute touch ups to ensure optimal user experience.\n\n“It’s important for them to be ready earlier so stakers can safely perform full withdrawal or partial withdrawal,” terencechain said.\n\nDocumentation is also being reviewed, he noted. Adding that “We want the documentation to be as solid as possible. That’s the gateway to stakers withdrawals.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb2luYmFzZS1leHBlY3RzLWhpZ2gtZGVtYW5kLWZvci1ldGgtdW5zdGFraW5nLXdpdGgtc2hhbmdoYWktdXBncmFkZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Coinbase expects high demand for ETH unstaking with Shanghai upgrade - Cointelegraph",
        "content": "Ether (ETH) stakers who have had their holdings locked up during the Ethereum Merge event might soon have access to “unstaking.“\n\nCoinbase has announced in a tweet that unstaking requests on its platform may take the protocol weeks or months to process. According to the tweet, it expects a flood of staking withdrawal requests after the update to the Ethereum network enables the functionality next month.\n\nThe Merge transitioned Ethereum from proof-of-work (PoW) to proof-of-stake (PoS) in September 2022, but stakers’ holdings remained locked up. This merger created a temporary situation where staking providers like Coinbase allow users to stake ETH on its platform — but not withdraw the funds.\n\nExpected to take place in mid-April, Ethereum’s Shapella upgrade will enable users to withdraw their staked ETH. ETH holders can also stake more without being subject to an indefinite lockup period\n\n7/ We anticipate that demand for unstaking will be high soon after the upgrade and it may take the protocol weeks to months process unstaking requests. — Coinbase (@coinbase) March 15, 2023\n\nCoinbase noted that staking requests are processed on-chain, and the firm will only act as a channel to pass unstaked ETH to customers once released by the protocol.\n\nCoinbase explained, “Unstaking requests will open to all Coinbase customers at the same time and will be relayed to the Ethereum protocol and queued based on when they are received.”\n\nOnce the upgrade is finished, users will be able to make unstaking requests from their Coinbase accounts, which will become available after approximately 24 hours. However, customers should anticipate a considerable wait time after submitting the request.\n\nCoinbase cannot give customers an exact timeframe for unstaking because they don’t have control over the process. They have given an estimate based on the time it takes for the Ethereum network to process transactions, but customers should be prepared to wait and be patient.\n\nRelated: Ethereum price reaches lowest level relative to Bitcoin in 5 months\n\nTo account for the inconvenience, Coinbase provides its users a liquid staking option called “cbETH” as a derivative of staked ETH on the platform, letting stakers effectively trade ETH while it is still locked up, with the promise of redeemability at a later date."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdS50b2RheS9zZWMtYm9zcy1zdWdnZXN0cy1ldGhlcmV1bS1ldGgtbWlnaHQtYmUtc2VjdXJpdHktb25jZS1hZ2FpbtIBT2h0dHBzOi8vdS50b2RheS9zZWMtYm9zcy1zdWdnZXN0cy1ldGhlcmV1bS1ldGgtbWlnaHQtYmUtc2VjdXJpdHktb25jZS1hZ2Fpbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "SEC Boss Suggests Ethereum (ETH) Might Be Security Once Again - U.Today",
        "content": "Gary Gensler, the head of the U.S. Securities and Exchange Commission (SEC), has once again implied that proof-of-stake (PoS) tokens, which include Ethereum (ETH), should be regulated as securities, Bloomberg reports.\n\nAdvertisement\n\nDuring an SEC meeting held on Wednesday, the head of the organization highlighted that the individuals behind these tokens frequently utilize social media platforms to promote their ventures, attracting investors who anticipate making profits. He suggested that these projects should seek professional guidance in order to ensure compliance.\n\nGensler's statement was in response to a question about the different views between him and Commodity Futures Trading Commission Chairman Rostin Behnam, who recently stated that he considers Ether a commodity.\n\nDuring an interview in February, Gensler suggested that Ethereum might fall under the classification of a security. He believes that cryptocurrencies, excluding Bitcoin, are securities since entrepreneurs utilize diverse methods to endorse their tokens and attract investors. This view contradicts with the view of the head of the SEC's sister regulatory agency.\n\nUnlike proof-of-work (PoW), which relies on computational power and energy consumption to solve complex mathematical problems, PoS relies on the amount of cryptocurrency held by participants (their \"stake\") in order to determine their chances of creating a new block and validating transactions.\n\nThere are still heated debates about whether or not Ether can be considered a security after the second most popular blockchain network transitioned away from proof-of-work last year.\n\nCrypto firms aim to avoid being regulated as securities due to stringent requirements that come with that label. However, regulatory scrutiny is increasing.\n\nAs reported by U.Today, New York Attorney Genera Letitia James slammed cryptocurrency exchange KuCoin with a lawsuit earlier this month for allegedly selling unregistered securities. In the lawsuit, James suggested that the Bitcoin competitor is an unregistered security since it was generally treated as a commodity. This is a rare instance of the token being given that legal status.\n\nGensler declined to comment on any specific token after repeatedly refusing to mention Ethereum in the past."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDMvMTcvd2hvLWlzLXRob21hcy1ncmVjby1pcy10aGUtbXlzdGVyaW91cy1ldGhlcmV1bS1hZHZpc2VyLXNoaWJhLWludS1yeW9zaGkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Who is Thomas Greco? Is the Mysterious Ethereum Adviser Shiba Inu Ryoshi? - The Crypto Basic",
        "content": "The crypto community seems awash with a renewed obsession to uncover the identity of Ryoshi, the mysterious Shiba Inu founder.\n\nOver a week ago, Coinbase Director of Project Strategy & Business Operations, Conor Grogan, drew links between the anonymous crypto founder and Sam Bankman-Fried’s Alameda Research, sparking speculation that SBF is Ryoshi. And as reported today, prominent crypto Youtuber Ben Armstrong, aka Bitboy Crypto, tapped one of the founders of Unification as Ryoshi, a claim that the Unification founder has denied.\n\nIn response to the latest speculation, Digital Asset Investor, another crypto Youtuber has pointed Bitboy in the direction of Thomas Greco (at least that is who he identifies himself as), a mysterious figure in the early days of Ethereum.\n\n- Advertisement -\n\nNotably, the first hint that he could be Ryoshi is that he appears in a picture attached at the end of Ryoshi’s first Medium blog along with Ethereum co-founder Vitalik Buterin, Ethereum Foundation Executive Director Aya Miyaguchi and two other unidentified persons in Japan. The picture was supposedly taken during Devcon 2019, with a YouTube video from Coin Bureau two years ago identifying him as Ryoshi.\n\nBut first, Who is Thomas Greco?\n\nWell, no one really knows, and those who do are tight-lipped, as highlighted by Digital Asset Investor, who also shared a clip of prominent crypto journalist Laura Shin asserting that Buterin was reluctant to talk about the mysterious figure.\n\nA search of the name Thomas Greco does not turn up much and mostly links to a community economist who writes about alternative monetary exchange solutions like private credit clearing systems, complementary currencies, and local currencies. However, when you add the keyword Ethereum, you will find a handful of videos where the so-called Ethereum adviser can be seen with Buterin or speaking at Ethereum events and articles that cite him as an adviser on the OmiseGo project as well.\n\nIn a Financial Times interview of Buterin from 2018 that turns up in the search, Greco is described as a “collaborator” and “developer” who Buterin asserts has worked with him for years. In an Epicenter Podcast episode with Laura Shin from 11 months ago dissecting her book “The Cryptonians,” which also turns up in the search, the journalist relaying the information from Ethereum Foundation members at the time alluded to Greco as a close friend of Buterin who played the role of gatekeeper deciding who gained access to the founder and influencing key decisions along with another likely pseudonymous friend called Wendell Holmes.\n\n- Advertisement -\n\nHowever, by far, the most well-put-together account of the Mysterious Ethereum figure is by an individual known only as Kevin, who runs an alternative income blog called Turtle Investor. Kevin’s account is also the first that alludes to the fact that Greco is an assumed identity while also pointing out that the enigma went on to advise on other popular projects, including Polkadot and Cosmos. As highlighted by Kevin, Greco could be seen at almost every event with Buterin from 2017.\n\nKevin is yet to respond to a request for comment from The Crypto Basic at the time of writing.\n\nCould He be Ryoshi?\n\nWhile there is no clear-cut evidence to prove this, it is worth noting that assuming Buterin to be the friend mentioned by Ryoshi in his first Medium blog post, it is easy to see how this argument can be made.\n\nRecall that Ryoshi claimed to have started SHIB with a friend with whom he shared his ideas of a decentralized ecosystem. The friend, who he alluded to as a successful businessman and influential person in the crypto space, helped him write the Shiba Inu smart contract and put up 10 ETH (which he described as “nothing” for this friend) to provide the initial liquidity for SHIB’s Uniswap pool.\n\nFollowing this narrative, it appears to be a no-brainer. However, there’s a catch, Ryoshi claims to have met this friend at Devcon 2019 in Osaka, and from what we know, Greco has been in the picture since at least 2017.\n\nDoes this mean Greco can not be Ryoshi? Not necessarily. It could also be that the supposed friend is not Buterin. Recall that Buterin has denied involvement in the creation of the project. Whatever the case, we may never know. The famous picture of Buterin walking a dog in Japan with other supposed ETH developers remains potentially the strongest clue to Ryoshi’s identity."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ob3ctdG8tbmF2aWdhdGUtZXRoZXJzY2FuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "How to Navigate Etherscan - Unchained - Unchained",
        "content": "You probably know what Etherscan is, but you may not know how to use it. Let’s take you under the hood to see how Ethereum works.\n\nYou don’t need to understand the complicated mechanics of blockchain technology to use cryptocurrency. But learning a bit about how your transactions are processed can be illuminating and valuable.\n\nWith block explorers, you can see on-chain data in an organized format. To the untrained eye, all the alphanumeric digits and phrases may be overwhelming. Here is how you can begin navigating them.\n\nWhat Is a Block Explorer?\n\nA block explorer is a web interface for viewing activity on a blockchain network. It connects to a blockchain node, allowing users to retrieve information from the network — or even interact with it.\n\nA block explorer can fulfill several functions:\n\nSearch engine : to look up historical block data, transactions, gas prices, wallet addresses, smart contracts, and other on-chain data;\n\nAuditing platform : to verify smart contracts and look for suspicious activity;\n\nBlockchain API : to read (query), write (pass commands), or deploy new smart contracts on the blockchain; and\n\nAnalytics platform : to use the various data charts to analyze on-chain activity.\n\nEvery blockchain has one or multiple explorers, often maintained by outside developers. Some of the most popular include Blockchair for Bitcoin, PolygonScan for Polygon, the Cardano blockchain explorer, and the BNB Beacon Chain explorer.\n\nThis guide will explain the applications of blockchain explorers by benchmarking Etherscan, the most famous explorer in the Ethereum network. However, since most explorers follow a similar broad design, this guide should also help you understand transactions on other networks.\n\nFamiliarize Yourself With the Block Explorer\n\nThe Etherscan homepage provides an overview of recent activity on the Ethereum blockchain.\n\nTransactions accepted during consensus form the block, while the demand for block space dictates the gas price.\n\nThe search field lets you look up any activity (transactions and blocks) or identity (addresses and smart contracts) on the blockchain. The transactions are stored with a unique identifier that represents a particular transaction (under “Latest Transactions”) called a hash.\n\nUnder the search bar, we find an overview of the Ethereum blockchain and the ETH token. The gas price, block time, and transactions per second (TPS) give an idea of the traffic on the blockchain. For example, high demand for block space increases block time (time taken to generate a block) and gas prices, while low demand decreases them.\n\nLet’s look more closely at one of the blocks. To do so, click on any of the block number links.\n\nSome noteworthy tidbits:\n\nStatus : “Unfinalized (Safe)” means that at least two-thirds of the validators have validated the block. After the epoch (a period of just under 6.5 minutes) ends, the block becomes finalized.\n\nGas used : The block used 42.62% of its gas limit. Comparing this with subsequent blocks can give an idea about the on-chain traffic. (A simple ETH transfer typically costs 21,000 gas in moderate traffic. Users often pay several times more than that during peak traffic.)\n\nBlock reward and burnt fees : When the block burns more ETH than it mints as rewards, ETH becomes deflationary. Quite evidently, the ETH supply was inflationary in this block.\n\nNext, let’s explore how a particular transaction looks. Click on any transaction link from the homepage or the “Transactions” row. (There are 131 in this block.)\n\nSome noteworthy details:\n\nStatus and block confirmations : The green tick represents a successful transaction. The probability of a block reorganization (an event where seemingly confirmed blocks of transactions are dropped in favor of a new chain of transactions) decreases as the number of block confirmations increases.\n\nInteracted with : This indicates which contracts the sender address interacted with during the transaction (in this case, the CryptoPunk NFT contract).\n\nSender and receiver addresses : You can reference these to cross-check if the correct address received the transaction.\n\nGas usage : This denotes how many gas units were consumed by the transaction. The gas fee is measured in Gwei and fluctuates with demand. (Use the Gas Tracker to find the latest price.)\n\nTip: Use the transaction decoder (More > Transaction decoder) for a streamlined summary of the transaction data.\n\nFind an Address\n\nEach wallet on Ethereum is associated with both a public and private address. The private address is used to sign transactions and is kept secret. The public address is derived from your private address; it is your on-chain identity and is used to receive transfers.\n\nNote: Smart contracts do not have any owner. Therefore, they only have a public address.\n\nHere is how a typical address page looks. It shows the ETH balance and a list of ERC-20 tokens the wallet holds. You can also view how the address interacts with other addresses and contracts on the blockchain.\n\nSome addresses use the Ethereum Name Service (ENS). ENS is a naming system that converts an alpha-numeric Ethereum address into a human-readable string. ENS names have “.eth” at the end. On the Etherscan homepage, go to “More > ENS Lookup” to search ENS addresses.\n\nFollow the Money\n\nWhile writing data on the Ethereum blockchain costs gas, querying it does not. Users can access the entire transaction history of the network for free. Let’s open a transaction overview and follow the money.\n\nThe overview page has all the details one might need to trace the movement of ETH or ERC-20 tokens. Necessary fields generally verified by users are transaction status, block confirmation (the higher, the more “final”), sender and receiver addresses, gas, and the transfer amount.\n\nNote: The Bitcoin network follows a different record-keeping model from Ethereum, called UTXO (Unspent Transaction Output). The balance in a Bitcoin wallet is the difference between spent and unspent transactions. Notice that the transaction has two recipients, with the second one as the sender itself receiving back the “unspent” BTC.\n\nInteract With and Analyze Smart Contracts\n\nBlockchain enthusiasts and developers can leverage Etherscan to learn about smart contracts, audit their code, and even interact with them using a wallet address. For example, check out the Uniswap V2 contract on Etherscan.\n\nThe transactions tab lists all the addresses that have interacted with the contract. Click on the “Contract” tab to access the source code.\n\nThe green check mark on the tab means the source code has been verified to match the on-chain bytecode. Etherscan lets users interact with the contract in several ways:\n\nCode : Use this tab to verify or analyze smart contract code.\n\nRead contract : Smart contracts comprise several functions, and users can query these functions to watch how other addresses have interacted with the contract.\n\nWrite contract : Decentralized applications are accessed via their official website. Still, using Etherscan, you can also pass commands to those underlying smart contracts. Note that this will cost gas and require connecting Etherscan with a Web3 wallet like MetaMask.\n\nClosing Thoughts\n\nEtherscan is a valuable tool for exploring the Ethereum blockchain. You should now be empowered to navigate the block explorer. As you start monitoring the Ethereum blockchain regularly, you will notice block activity patterns that help you make more conscious decisions about when and how to make transactions."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGVjcnlwdC5jby8xMjM3NTEvZXVsZXItZmluYW5jZS1oYWNrZXItc2VuZHMtMS02bS1ldGgtdG9ybmFkby1jYXNo0gFQaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMzc1MS9ldWxlci1maW5hbmNlLWhhY2tlci1zZW5kcy0xLTZtLWV0aC10b3JuYWRvLWNhc2g_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Euler Finance Hacker Mixes $1.6M in Ethereum on Tornado Cash - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFunds tied to the latest Euler Finance exploit are on the move.\n\nAccording to on-chain data, the attacker sent ten transactions to mixing service Tornado Cash worth 100 Ethereum each from an intermediary address, and still holds 1,500 ETH labeled as “Fake Phishing” at the same address.\n\nThe address has sent a total of 1,000 ETH, worth roughly $1.6 million.\n\nAD\n\nAD\n\nHackers moved part of the stolen funds less than 24 hours after Euler Finance—a borrowing and lending platform—warned that if 90% of the assets were not returned, the company would offer a $1 million bounty to anyone who can provide information that can lead to their arrest and the return of all funds.\n\nEuler Finance fell victim to a flash loan exploit that resulted in the loss of $8.7 million in the DAI stablecoin, $18.5 million in Wrapped Bitcoin (WBTC), $135.8 million in Staked Ethereum (stETH), as well as $33.8 million in USDC.\n\nWhile Euler confirmed that it is working with law enforcement, the company also suggested the criminal investigation could be potentially dropped if the money is returned.\n\nNotably, along with the funds sent to Tornado Cash, the attackers, as confirmed by blockchain analytics firm CertiK, transferred 100 ETH to an address allegedly belonging to one of the victims.\n\n2/ Euler Finance Exploiter 2 has transferred 100 ETH (~166K) into a plausible exploit victim address 0x2Af24. pic.twitter.com/ozipj0TFhn — CertiK Alert (@CertiKAlert) March 16, 2023\n\nAD\n\nAD\n\nThe user, who claimed to have had 78 Wrapped Staked Ethereum (wstETH) of their life savings deposited on Euler, urged hackers to return him at least 80% or 90% of the funds. Surprisingly, they saw their appeal satisfied."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vZGVjcnlwdC5jby9uZXdzLWV4cGxvcmVyP3Bpbm5lZD0xMzM0NTcmdGl0bGU9ZXRoZXJldW0tZGV2ZWxvcGVycy10YXJnZXQtYXByaWwtMTItZm9yLXNoYW5naGFpLWhhcmQtZm9ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 14:28:04 GMT",
        "title": "News Explorer — Ethereum Developers Target April 12 for Shanghai Hard Fork - Decrypt",
        "content": "Mar 16, 2:17 pm\n\nCoindesk\n\nEthereum Developers Target April 12 for Shanghai Hard Fork\n\nEthereum developers have set April 12 as the target date for the Shanghai hard fork, which will enable staked ETH withdrawals. Tests have been conducted to ensure that staked ETH withdrawals will function properly, though the last testnet hard fork experienced low participation rates. Despite this, Ethereum developers are confident that the mainnet upgrade will go smoothly."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMirwFodHRwczovL3d3dy5hdGFsYXlhci5jb20vZW4vYXJ0aWN1bG8vZWNvbm9teS1hbmQtYnVzaW5lc3MvY3J5cHRvLW1hcmtldC1jYXAtZGVsaW5lcy1kYWlseS10cmFkaW5nLWJpdGNvaW4tZXRoZXJldW0tcHJpY2VzLXNoZWQtYmlnLWV5ZXMtY29pbi1sYXVuY2hlcy8yMDIzMDMxNzEyMTY1ODE4MjI1Mi5odG1s0gGzAWh0dHBzOi8vd3d3LmF0YWxheWFyLmNvbS9lbi9hcnRpY3Vsby9lY29ub215LWFuZC1idXNpbmVzcy9jcnlwdG8tbWFya2V0LWNhcC1kZWxpbmVzLWRhaWx5LXRyYWRpbmctYml0Y29pbi1ldGhlcmV1bS1wcmljZXMtc2hlZC1iaWctZXllcy1jb2luLWxhdW5jaGVzLzIwMjMwMzE3MTIxNjU4MTgyMjUyLmFtcC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Crypto Market Cap Delines In Daily Trading As Bitcoin & Ethereum Prices Shed: Big Eyes Coin Launches 300% ROI Vault PIN - Atalayar EN",
        "content": "The global cryptocurrency market capitalization has declined by 2.16% over the past 24 hours to $1.07 trillion after witnessing a rally that saw the global market cap register $1.13 trillion at the back of a week of red trading.\n\nThe rally seemed rather brief as table-toppers Bitcoin (BTC) and Ethereum (ETH) lost steam in daily trading, prompting several other altcoins to fluctuate in their prices. And while the industry grapples with the controversies surrounding the closure of US-based banks, Silvergate Capital, Silicon Valley Bank, and Signature Bank, new meme token Big Eyes Coin (BIG) has been steering its way toward its launch with several new and unique presale offers.\n\nBitcoin - Downward Correction Following 20% Rally\n\nBitcoin (BTC), the most popular digital asset in the cryptocurrency industry, slid by 0.67% in 24-hour trading to trade at $24,711.48 after a multi-day rally in which BTC registered a 90-day high of $26,514.72.\n\nDespite the price shed, Bitcoin was still indicating a weekly upward movement of 13.52%, prompted by a roughly 20% price rally shortly after the weekend. At the time of writing, Bitcoin held a market capitalization of $476 billion and a 24-hour trading volume of $42.5 billion.\n\nEthereum - Weekend Rally Reversed\n\nEthereum (ETH), the industry’s second-largest virtual cryptocurrency, has fallen by 2.83% overnight to trade at $1,659.86. Similar to Bitcoin, Ethereum was also on a multi-day rally, having posted a 90-day high of $1,779.92 last week.\n\nAt the time of writing, Ethereum was indicating a weekly growth of 7.97% and held a market capitalization of $203 trillion, a 2.82% decline from the previous day, while registering a 24-hour trading volume of $12.5 billion.\n\nBig Eyes Coin - Cute NFTs, BIG Returns\n\nBig Eyes Coin (BIG) is an Ethereum-powered meme token that self-propagates for its development using Non-Fungible Tokens (NFTs) while offering its holders access to more content and events.\n\nThe project is currently having its Initial Coin Offer (ICO) and plans to launch after 15 stages of presale and achieves a target of $50 million presale tokens. Now in stage 12, Big Eyes Coin has raised $31.66 million in presale tokens, with a BIG token currently worth $0.00049, a 390% spike from its launch price of $0.0001.\n\nThe ERC-20 token has a total supply of 200 billion tokens, with 70% of it sold via its presale, 20% for exchanges, 5% added to a market wallet, and 5% held in a visible wallet which will be donated to several ocean-saving charities.\n\nAn ICO is a perfect opportunity for traders to expand their crypto portfolio and also invest in the token at a discounted price before it is available to the general public when it launches. Big Eyes Coin, which is a community-owned token, in its biggest giveaway to date, has launched the vault PIN ‘300’, which buyers simply have to enter when purchasing $100 or more worth of BIG presale tokens. This will allow the buyer to earn an additional 300% in Big Eyes Coin Loot Boxes.\n\nBig Eyes Coin Loot Boxes is the project’s video game feature that can be found during gameplay, earned as a reward, or paid for with real money and offers a maximum return of 5000% per loot box. It features the Saver Tin, Cute Box, Kitty Vault, Super Saiyan Box, and Excali-Paw Master Chest, each carrying a maximum ROI of $500, $5000, $25,000, $100,000, and $1,000,000 worth of BIG tokens, respectively.\n\nThe Big Eyes Coin Loot Boxes run through during the presale only and will end when the project goes live. The results are always random, and the investment will never be lost since buyers will be returned their capital in BIG tokens if they do not win the loot box result.\n\nLearn more about Big Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1sYXllci0yLWFyYml0cnVtLXRvLWFpcmRyb3AtMTE2LWJpbGxpb24tYXJiLW5hdGl2ZS10b2tlbi1kZXRhaWxz0gFdaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWxheWVyLTItYXJiaXRydW0tdG8tYWlyZHJvcC0xMTYtYmlsbGlvbi1hcmItbmF0aXZlLXRva2VuLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Layer 2 Arbitrum to Airdrop 1.16 Billion ARB Native Token: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum's Layer 2 scaling solution, Arbitrum, has unveiled its native ARB token and also the launch of DAO governance.\n\nAdvertisement\n\nARB is an ERC-20 governance token native to the Arbitrum One rollup chain, with an initial supply cap of 10 billion at launch. The Arbitrum token is majority community-owned (over 56%). Of the community allocation, 12.75% will be distributed in an airdrop on March 23, based on data captured in a snapshot on Feb. 6, 2023.\n\n💙🧡Congratulations to Arbitrum for launching their native token $ARB!\n\n\n\nSupport for Arbitrum One and Arbitrum Nova networks are fully ready on Bitrue. We will list $ARB once the airdrop that users receive is transferable. Please stay tuned to know wen $ARB will come to Bitrue! https://t.co/D91guaoxwX — Bitrue (@BitrueOfficial) March 16, 2023\n\nARB tokens can be used to vote on Arbitrum DAO governance proposals, allowing holders to shape Arbitrum's future. Token holders will also be able to delegate their voting power to delegates.\n\nAccording to Lookonchain, 1.162 billion ARB will be airdropped to eligible users of the platform.\n\nIn a document, it states the eligibility criteria while noting that a point system was used to determine the number of tokens that airdrop recipients could claim. Additionally, the criteria and design of the airdrop as a whole were intended to reward early adopters.\n\n\n\nIt cautions users to follow the information on the official website, while noting that there is no presale of the ARB token. The airdrop has also not yet commenced and will begin on March 23, as previously stated.\n\nIn a historic milestone, the Arbitrum Foundation has also announced the launch of DAO governance for the Arbitrum One and Arbitrum Nova networks after years of development and nearly 18 months of running on the mainnet."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2dyYXlzY2FsZS1kZWNpZGluZy1ldGhwb3ctZnV0dXJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Grayscale Still Deciding What To Do With ETHPoW - Blockworks",
        "content": "Cryptocurrency investment management company Grayscale will extend its review period to determine whether or not it should acquire and sell proof-of-work Ethereum.\n\nGrayscale was tasked on behalf of shareholders to determine whether it should purchase and sell the proof-of-work fork of Ethereum (ETHPoW) after the Merge.\n\nRead more: Proof-of-Work vs. Proof-of-Stake: What’s the Difference?\n\nThe initial review period needed to determine the utility and value of ETHPoW was expected to last less than 180 days. The company revealed on Thursday that it would extend this review period for an additional 180 days.\n\n“The trading venues for the ETHPoW tokens have not yet been broadly established, and there is continued uncertainty both as to whether digital asset custodians will support the ETHPoW tokens and if trading markets with meaningful liquidity will develop,” the company said in a statement.\n\nSpecifically, Grayscale noted that the value of the token is likely to fluctuate significantly for a period of time if digital asset custodians choose to support the token and a trading market develops.\n\n“As a result of this uncertainty, as well as the potential for significant volatility in prices for the ETHPoW tokens, it is not possible to predict whether Grayscale, as agent, will be able to acquire the ETHPoW tokens or the value, if any, that Grayscale, as agent, will be able to realize from sales of the ETHPoW tokens,” the company said.\n\nFollowing the Ethereum hard fork, which moved the network from proof-of-work to proof-of-stake, the price of ETHPoW soared to $51.45 and then plummeted. It is currently trading at $3.40, according to information on CoinGecko.\n\nETHPoW has severely underperformed both ETH and Grayscale’s Ethereum Trust\n\nRead more: Ethereum Switches to Proof-of-stake After 7 Years of Work\n\nEthereum proof-of-work enthusiast are still active on the chain. Recently noting in a tweet that there had been “impressive NFT projects” emerging on the network.\n\nDespite this, it noted that due to the lack of funding and coordinated efforts in the ecosystem, the proof-of-work chain has not yet been able to escape its infancy stage.\n\n“​​If this situation continues to develop, developers, investors, and project parties may gradually lose confidence, and the entire ecosystem will gradually slip from existing NFT projects to a vacuum,” the network tweeted.\n\nA proposal to develop a EthereumPoW ecosystem DAO is underway, with the goal of encouraging more user activity on the chain.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXZpdGFsaWstYnV0ZXJpbi1zaGFuZ2hhaS11cGdyYWRlLWFyYml0cnVtLWFpcmRyb3Av0gFUaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tdml0YWxpay1idXRlcmluLXNoYW5naGFpLXVwZ3JhZGUtYXJiaXRydW0tYWlyZHJvcC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Advise Amid Shanghai Upgrade, Arbitrum Airdrop - CoinGape",
        "content": "Amid the hype surrounding the Ethereum Shanghai upgrade and the Arbitrum airdrop, co-founder Vitalik Buterin recommends crypto investors using social recovery wallets and multi-signature wallets to achieve self-custody of crypto funds. He also uses a multisig wallet personally to store his funds, as does the Ethereum Foundation.\n\nVitalik Buterin in a tweet on March 17 said self-custody is important in the crypto space. It has become even more crucial amid recent events experienced in the last year period. He suggests using social recovery wallets for normal daily activities and multisigs wallets for long-term savings.\n\nadvertisement\n\n“Self-custody is important. And social recovery and multisig is a great way to do it. A quick reddit post on how I think about choosing guardians for social recovery and multisig wallets.”\n\nVitalik Buterin on Using Multisig and Social Recovery Wallets\n\nAccording to the post, Vitalik Buterin recommends using multisig wallets such as Gnosis Safe to easily and securely store funds. He claims central entities that seemed trustworthy, but should not be trusted as they have significant risks such as regulatory pressure and human or system errors.\n\nSocial recovery wallets are easier to use than multisig wallets. With the ERC-4337 account abstraction and upcoming smart contracts wallets like Soul Wallet, wallet security will improve. Vitalik Buterin proposes to use social recovery for hot wallets that store a small portion of a person or organization’s funds, and multisigs for cold wallets that store a person or organization’s savings.\n\nMoreover, he also gave interesting suggestions on selecting guardians to improve the security of crypto funds by minimizing the chances of guardians losing keys, stealing money, and having shared risks with other guardians.\n\nReplying to a comment that says it is important to have guardians that know how to use a hardware wallet, which is better than storing keys in Metamask or Google Drive, Vitalik Buterin said:\n\n“Some should use a hardware wallet but no need for all of them to imo. You don’t want to freak out if you discover tomorrow that there’s a serious issue with that one hardware wallet company that most of your friends buy from. But yeah, all your guardians using google drive or metamask is definitely something to avoid.”\n\nAlso Read: Shiba Inu Burn Rate Spikes Over 10000% After A Day Of Massive Pullback\n\nShanghai upgrade and Arbitrum Airdrop\n\nTwo events related to Ethereum, the Shanghai upgrade and Arbitrum airdrop are creating a massive hype in the community.\n\nEthereum core developers revealed that the Shapella (Shanghai and Capella) upgrade on the mainnet is scheduled to happen at epoch 6209536 on April 12 at 10:27:35 PM UTC. It will make validators remove staked Ethereum from the Beacon Chain.\n\nMeanwhile, Ethereum Layer-2 blockchain project Arbitrum announced the airdrop of the ARB governance token on March 23. Here’s how to claim the Arbitrum airdrop, eligibility, and process.\n\nAlso Read: US Fed Prints $300 Billion, Bitcoin Price And Ethereum To Rally"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wMy8xNi9zb3VsLXdhbGxldC1jcnlwdG8td2FsbGV0L9IBQGh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wMy8xNi9zb3VsLXdhbGxldC1jcnlwdG8td2FsbGV0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Backed with $3M, Soul Wallet aims to bring self-hosted crypto wallets to the next billion - TechCrunch",
        "content": "Backed with $3M, Soul Wallet aims to bring self-hosted crypto wallets to the next billion\n\nIf you own a non-custodial crypto wallet like MetaMask, you know the headache of keeping your 16-word seed phrase safe. That’s the responsibility that comes with having full control over one’s digital assets.\n\nA third-party wallet, like one hosted by an exchange, on the other hand, stores private keys on users’ behalf and provides a better user experience. The risk is the lack of transparency over how user funds are managed, which could lead to incidents like the FTX meltdown.\n\nSome believe a new technical change in the Ethereum ecosystem is about to solve the dilemma between asset control and user experience. At the center of the movement is the ERC-4337 standard introduced by the Ethereum Foundation, the nonprofit research affiliate of Ethereum, the world’s second-largest cryptocurrency that boasts a vibrant developer community.\n\nJiajun Zeng, a former product manager at TikTok’s parent firm ByteDance and Chinese on-demand services giant Meituan, was amongst the first to leverage the new standard. His startup Soul Wallet just raised $3 million in a seed funding round to offer an online, self-custodial Ethereum wallet built on top of ERC-4337.\n\nComparing existing crypto wallets and wallets powered by the new technical upgrade is akin to “comparing Nokia to iPhones,” said Zeng in an interview with TechCrunch.\n\n“After the FTX implosion, people are refocusing on how to achieve a better user experience on a self-host wallet,” observed Zeng.\n\nAt EthDenver, a major Ethereum developer conference that attracted more than 30,000 attendees in the Colorado capital in early March, the new standard was generating plenty of buzz amongst blockchain application builders.\n\nThrough ERC-4337, Ethereum plans to bring smart contract capabilities to wallets (through what’s called “account abstraction,” but let’s not get into the nitty-gritty). In short, developers can program smart contracts, or lines of codes that execute predefined agreements, into wallets.\n\nBeing smart means doing away with some of the legacy issues of crypto wallets, such as the reliance on seed phrases. Instead, smart contract-enabled wallets make it possible for users to recover their accounts via social recovery, such as using one’s trusted contacts, another wallet or even a third-party service. For those who use WeChat, it’s a similar account recovery process.\n\nDevelopers can also code other customized functions into wallets, such as letting users pay gas fees using stablecoins rather than limiting payments to Ethereum.\n\nMetaMask, a popular self-custodial Ethereum wallet, uses an old cryptographic method called EOA, or externally owned accounts, where if a user loses their private keys, their funds are forever lost. Early mover Argent has incorporated some smart functions into its wallets but the features are still limited, said Zeng.\n\nThe challenge of introducing any new technological standard is scaling. MetaMask has sticky users because it’s compatible with many popular decentralized apps. The question is how Soul Wallet and other similar startups can compete to build a significant pool of partners.\n\nEthereum is promoting smart contract wallets as the future of Ethereum, so dApp developers will feel incentivized to make the switch, reckoned Zeng, an active member of the Ethereum community.\n\n“We are targeting the next billion crypto adopters rather than trying to win users away” from the likes of MetaMask, said Zeng.\n\n“In developing countries like South America and Africa, people are using cryptocurrencies to hedge against currency inflation, so it’s down to how crypto adoption can spread in these regions,” he continued.\n\n“As for developed countries, adoption hinges on how dApps and NFTs are evolving.”\n\nSoul Wallet is currently undergoing internal testing and is scheduled to launch in Q3 or Q4 after a series of stringent audits, according to Zeng. The team has a dozen people spanning the U.S., Japan, Thailand and China.\n\nInvestors that participated in its latest “party” round include Struck Crypto, Game7DAO, NGC Ventures, Dispersion Capital, Alchemy, Ankr and Signum Capital. The financing was also backed by a few notable angel investors such as David Hoffman and Ryan Sean Adams from Bankless; Kristof Gazso, the co-author of ERC-4337; Marc Zeller from Aave-Chan Initiative; Scott Moore from Gitcoin; Terence Tsao from Arbitrum; and Tim Beiko from Ethereum Foundation.\n\nUpdated on March 16, 2023 with the funding round’s investor list."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8xNi9pcy1ldGhlci1hLXNlY3VyaXR5L9IBQ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8xNi9pcy1ldGhlci1hLXNlY3VyaXR5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Is Ether a Security? - CoinDesk",
        "content": "“Although the SEC contended that the Debtors somehow had to prove a negative – i.e., that the Debtors were not violating securities laws and that Binance.US is not violating registration requirements for brokers – the SEC had not even affirmatively contended that the Debtors were doing anything wrong, or that Binance.US was doing anything wrong,” the judge wrote. “Nor had the SEC offered any guidance at all as to just what it was that the Debtors allegedly were supposed to prove on these issues, or how the Debtors possibly could prove what the SEC wanted them to prove without receiving any explanation at all from SEC as to just why the Debtors’ operations, or Binance.US’s operations, might raise legal issues.”"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL2NvaW5yaXZldC5jb20vYmlnLWV5ZXMtY29pbi10cmVhdHMtZWFybHktaW52ZXN0b3JzLXRvLWZyZWUtbmZ0cy1hcy1iaXRjb2luLWFuZC1ldGhlcmV1bS1wcmljZXMtc29hci1kZXNwaXRlLWNyaXNpcy13aXRoLWNyeXB0by1mcmllbmRseS1iYW5rcy_SAZoBaHR0cHM6Ly9jb2lucml2ZXQuY29tL2JpZy1leWVzLWNvaW4tdHJlYXRzLWVhcmx5LWludmVzdG9ycy10by1mcmVlLW5mdHMtYXMtYml0Y29pbi1hbmQtZXRoZXJldW0tcHJpY2VzLXNvYXItZGVzcGl0ZS1jcmlzaXMtd2l0aC1jcnlwdG8tZnJpZW5kbHktYmFua3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Big Eyes Coin Treats Early Investors To Free NFTs As Bitcoin And Ethereum Prices Soar Despite Crisis With Crypto-Friendly Banks - Coin Rivet",
        "content": "Buy and sell Bitcoin the easy way Start your crypto portfolio today! Get started\n\nIn a big move to say thank you to those who saw the potential in the cat-themed coin and supported it from the onset, Big Eyes Coin (BIG) has announced that it will be hosting its very first NFT drop, and investors who came in stages 1–3 will be whitelisted to mint for free.\n\nBIG’s announcement is supported by a generally optimistic prognosis for the overall cryptocurrency market, which appears to have recovered since the beginning of the week as a result of the U.S. government’s action to safeguard Silicon Valley Bank depositors.\n\nBitcoin (BTC) is up by 10% at $24,837.30, while Ethereum (ETH) rose by 7% to $1,690.09 at the time of writing.\n\nThe overall cryptocurrency market gained more than $70 billion in 24 hours and jumped back above $1 trillion on Monday.\n\nBig Eyes Coin To Drop First NFT\n\nBIG is proving that loyalty pays.\n\nThe cute currency will be releasing its first NFT, #SushiCrew, and in its usual fashion, it will be rewarding early investors with minting rights. These are those who bought into the coin’s vision in stages 1-3. The meme coin informed investors through its Twitter page that its early investors will be whitelisted to mint the NFTs for free.\n\nCrypto enthusiasts can buy, sell, or trade NFTs, which are digital assets. They can grow in value in the future, thereby increasing the potential for wealth for token holders.\n\nBig Eyes offers a lot of incentives to its community, including vault pins that enable one to massively increase their bonuses (as if a bonus isn’t enough), loot boxes, and more.\n\nBitcoin And Ethereum See Green Again\n\nBitcoin (BTC) has extended its three-day winning streak as the top cryptocurrency by market value increased to a three-week high of $24,837.30. Prices have almost entirely recovered from the decline from $25,000 to $19,500 that was observed in the second half of February.\n\nFrom their lows on Friday, Bitcoin and Ether, the two most popular coins, have increased by a fifth as traders gained confidence from US regulators’ assurances that accounts at the bankrupt Silicon Valley and Signature banks will be safeguarded. Bitcoin increased by 6% just on Monday.\n\nInvestor confidence has increased as a result of the authorities’ actions to support SVB and safeguard depositors in these institutions.\n\nCryptocurrency Losing Some Of Its Big Supporters\n\nThe crypto markets have been on a rollercoaster ride since Silvergate Capital, a significant lender to the cryptocurrency industry, collapsed last week.\n\nMid-last week, Silvergate announced that it was closing its bank and reducing staff. Then, on Friday, Silicon Valley Bank fell, marking the largest banking failure since the global financial crisis of 2008. In response to the U.S. Federal Reserve’s increase in interest rates, both Silvergate and SVB invested money in U.S. Treasury bonds, which have since lost value.\n\nIn order to prevent the spread of the problem to the larger banking industry, U.S. regulators also shut down Signature Bank on Sunday. Signature Bank was a significant lender in the cryptocurrency market.\n\nFinal Thoughts\n\nAlthough the crypto industry was hit by the news of some of its friendly banks collapsing, we are beginning to see the market rebound, a testament to its resilience. On the other hand, Big Eyes Coin continues to expand its offering, both to the existing community and to potential investors. The coin just crossed the $31.57 million mark in its presale, and with only three stages left, BIG is on course for a successful launch.\n\nFind Out More About Big Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nDisclaimer: The views and opinions expressed by the author should not be considered as financial advice. We do not give advice on financial products."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlcy10aGUtdGFyZ2V0LWRhdGUtZm9yLWV0aGVyZXVtcy1zaGFuZ2hhaS1oYXJkLWZvcmsv0gFUaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2hlcmVzLXRoZS10YXJnZXQtZGF0ZS1mb3ItZXRoZXJldW1zLXNoYW5naGFpLWhhcmQtZm9yay8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Here’s the Target Date for Ethereum’s Shanghai Hard Fork - CryptoPotato",
        "content": "After a months-long wait since the Merge, Ethereum developers have set a target date for the network’s highly anticipated Shanghai hard fork.\n\nThe upgrade will enable the network’s stakers to withdraw their locked Ether (ETH) for the first time since December 2020.\n\nWithdrawing Staked ETH\n\nDuring a recorded call among core developers on Thursday, devs set April 12 as their target date for “Shapella” – the dual upgrade enabling ETH withdrawals. Shapella is a combination of the words Shanghai and Capella, changes to Ethereum’s execution and consensus layer respectively.\n\nOnce devs vote on and confirm the upgrade via GitHub, April 12 will be set in stone – a month’s delay from their initial target date of March 2023. To be precise, popular developer Tim Beiko tweeted on Thursday that the fork would occur at block 6209536, which will arrive at 10:27:35 PM UTC on April 12.\n\nThis follows several successful simulation upgrades across Ethereum’s testnets, including its Goerli testnet on Tuesday. Things ran smoothly besides some issues surrounding validators who were late to upgrade – problems that Beiko claimed are not likely to repeat on the mainnet.\n\nAgain, this is something that might be worse on Goerli than mainnet, as it's more likely those nodes are being run with less resources than mainnet ones. — timbeiko.eth (@TimBeiko) March 14, 2023\n\nEthereum’s move to proof of stake in September allowed ETH owners to begin earning yield on their holdings, effectively producing 4% yield at writing time.\n\nIt also completely obsoleted the network’s mining industry, incentivizing relevant businesses to transfer their GPU processing power to other proof-of-work chains. This has substantially reduced Ethereum’s energy footprint, which its neighbor network Bitcoin is often scrutinized for.\n\nThere are currently 17.6 million ETH locked within the network’s staking contract. That’s roughly 14.3% of the total supply, creating a $29.4 billion wall of economic security against a potential 51% attack.\n\nWhile staking requires a minimum of 32 ETH for individuals, small retail holders can fractional amounts of ETH through centralized staking services. Coinbase, which offers such a service, predicted on Wednesday that its platform will experience high demand for “unstaking” after the upgrade next month.\n\nHas the Merge Backfired?\n\nWhile the Merge helped Ethereum escape the critical gaze of environmentally conscious politicians, it may have given market regulators more reason to clamp down on the crypto heavyweight.\n\nLast week, New York Attorney General Letitia James sued KuCoin for allegedly listing securities on its platform – one of which, it claimed, is ETH.\n\nEchoing previous claims from Securities and Exchange Commission (SEC) chairman Gary Gensler, James argued that transitioning to proof of stake gave ETH more security-like properties.\n\n“The shift to proof-of-stake significantly impacted the core functionality and incentives for owning ETH, because ETH holders now can profit merely by participating in staking,” she stated in a legal filing."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsZWVwaW5nY29tcHV0ZXIuY29tL25ld3MvbWljcm9zb2Z0L21pY3Jvc29mdC1pcy10ZXN0aW5nLWEtYnVpbHQtaW4tY3J5cHRvLXdhbGxldC1pbi1taWNyb3NvZnQtZWRnZS_SAXRodHRwczovL3d3dy5ibGVlcGluZ2NvbXB1dGVyLmNvbS9uZXdzL21pY3Jvc29mdC9taWNyb3NvZnQtaXMtdGVzdGluZy1hLWJ1aWx0LWluLWNyeXB0by13YWxsZXQtaW4tbWljcm9zb2Z0LWVkZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Microsoft is testing a built-in crypto wallet in Microsoft Edge - BleepingComputer",
        "content": "Microsoft is working on a non-custodial built-in Ethereum crypto wallet for Microsoft Edge to allow users to send and receive cryptocurrency and NFTs.\n\nPublic keys can be shared with others to receive payments, while private keys should be kept secret and can be used to authorize transactions when you want to spend your cryptocurrency.\n\nMicrosoft sleuth Albacore who first spotted the new Edge Crypto Wallet tweeted some screenshots and expressed his puzzlement about the possibility of it ending up as a new Microsoft Edge feature.\n\nIt is not yet rolling out to Insiders, and it's most likely only available to Microsoft Edge Dev Channel users as part of a very limited test phase.\n\n\"This is a non-custodial wallet, meaning you are in complete control of your funds. We will not have access to your password and recovery key. It is embedded in Edge, making it easy to use without installing any extension,\" Microsoft says during the onboarding process.\n\n\"As a tester, you will use your own funds. In the event of loss of funds, Microsoft will not reimburse any loss. This is a confidential project and no details should be shared externally.\"\n\nMicrosoft Edge Crypto Wallet (BleepingComputer)\n\nBleepingComputer tested the new feature, and during onboarding, testers are asked to generate a password to secure their assets and a 12-word recovery phrase to recover their crypto wallet if they forget the password.\n\nAfter finishing the onboarding process, the wallet generates an Ethereum address to allow users to receive funds through the Ethereum network.\n\n\"This alphanumeric address identifies your wallet and is used for transactions—like buying or receiving cryptocurrency. You can also use the QR code to share your public address,\" Microsoft says.\n\nSetting up an Edge Crypto Wallet recovery phrase (BleepingComputer)\n\nLike other cryptocurrency wallets, Microsoft Edge's Crypto Wallet supports multiple Ethereum accounts, allowing you to switch between them as needed.\n\nTested can set their default crypto wallet to the built-in Edge one or an Extension wallet, depending on how they want to manage their assets.\n\nThe Edge crypto wallet can also connect to decentralized apps (dApps) and has a news section to keep track of the latest developments in cryptocurrency.\n\nMicrosoft has partnered with Consensys to offer a built-in cryptocurrency swap feature between Ethereum, Dai Stablecoin, Uniswap, USD Coin, and Tether Coin.\n\nSwapping tokens in the new Edge Crypto Wallet (BleepingComputer)\n\nAdditionally, strings in the Edge Developer build show that Redmond might provide support for a Bitcoin wallet in the future.\n\n​\"We encourage you to test our first Web3 wallet and provide candid feedback along the journey. As the first testers you have the unique opportunity to shape our foray into cryptocurrencies and NFTs,\" Redmond added.\n\nUpdate March 17, 16:25 EDT: A Microsoft spokesperson provided the following statement when asked for more details:"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvdGV0aGVyLWl0cy1pbXBhY3Qtb24tZXRoZXJldW0v0gE_aHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy90ZXRoZXItaXRzLWltcGFjdC1vbi1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Tether: How Its $2 Billion USDT Minting Impacts Ethereum’s Success In The Bull Market - NewsBTC",
        "content": "Despite recent negative developments in the crypto market, the sentiment seemed to be somehow bullish as Tether, its stablecoin and some major cryptos show resilience in the past couple of days.\n\nThe collapse of major banks has significantly impacted the stablecoin market, with Circle’s USDC suffering a depeg causing smart money to flee USDC in favor of other stablecoins.\n\nTether is benefiting from the chaos in the USDC market with the organization minting more than $2 billion on both the Ethereum and Tron blockchains.\n\nWhaleAlert, a crypto wallet tracker, recently took notice of the mint 15 hours ago. With capital flight already happening on USDC markets, Tether’s recent minting would drive up demand for the stablecoin.\n\nTether Minting: What Does This Mean For Ethereum?\n\nThe minting of stablecoins on the Ethereum blockchain is a move by Tether which is expecting demand to rise for USDT.\n\nAccording to Nansen.ai, stablecoin diversification is happening after the subsequent collapses of Silvergate, Silicon Valley Bank, and Signature Bank.\n\nTether’s recent minting could give the top altcoin a much-needed shot in the arm in price in the medium to long term.\n\nImage: Binance Academy\n\nAccording to CoinGecko, Ethereum is up more than 2% in the daily timeframe. Although comparatively smaller than yesterday’s price movement, it is a welcome addition for investors to pad their portfolios.\n\nUSDT, on the other hand, is still the undisputed king in the stablecoin market. CoinGecko’s recent stablecoin market research shows that USDT’s market dominance grew by 2.3% in January to 49%.\n\nOn Stagnation And Rejection\n\nThe top altcoin is currently trading on the red candle, possibly signaling the start of profit-taking activities in the short to medium term. If the bulls can overcome the selling pressure that is present with high prices, the altcoin can retest the $1,778.99 resistance.\n\nA breakthrough on the latter can push prices to test $1,828 in the medium term.\n\nWith more USDT present in the market and a possibility of higher market dominance, ETH’s attractiveness grows for investors. However, this is still speculation as there is an equal chance for the coin to drop.\n\nThe current market value of Ethereum is sitting at $1,700, however, the price is currently facing significant resistance near the $1,710 level.\n\nETH price chart. Source: TradingView\n\nDespite this, if Ethereum manages to break through this level of resistance, it could potentially expose the ETH price towards the $1,800 mark, which would indicate a bullish trend.\n\nAs investors await the release of US CPI and retail sales data, they will also be closely monitoring Ethereum’s price movement. Currently, Ethereum’s immediate support levels are at $1,600 or $1,495, on the lower side.\n\nETH total market cap currently at $201 billion on the daily chart | Chart: TradingView\n\nThe outcome of the US CPI and retail sales data release will likely have a significant impact on the overall market sentiment. Should the data indicate positive trends, it could potentially boost investor confidence and lead to a surge in the price of Ethereum.\n\nConversely, negative results could result in a decline in Ethereum’s value, potentially pushing it towards its immediate support levels.\n\n-Featured image from HappyCoin\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vd3d3LmNvaW5zcGVha2VyLmNvbS9wbGJ5LWV0aGVyZXVtLXJhYmJpdGFycy1uZnQv0gE8aHR0cHM6Ly93d3cuY29pbnNwZWFrZXIuY29tL3BsYnktZXRoZXJldW0tcmFiYml0YXJzLW5mdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "PLBY Group Loses $4.9M after Receiving Ethereum Payments for Its 'Rabbitars' NFT - Coinspeaker",
        "content": "Negative swings in the market price of Ethereum may have had a material impact on the company’s earnings and carrying value.\n\nPLBY Group (NASDAQ: PLBY) has announced that it lost about $4.9 million in the value of the Ethereum (ETH) assets it held last year. The parent company of Hugh Hefner’s Playboy confirms that the impairment loss came as a result of the crypto winter that swept through the industry and significantly impacted market prices across the board.\n\nPLBY Group Gives Analysis, Claims Impairment Losses May Not Be Recovered\n\nAccording to a recent filing, the lifestyle and media company says it was accepting Ethereum as payments for its “Rabbitars” non-fungible tokens (NFTs). And these assets, it holds as digital assets in its balance sheet, says PLBY Group. The filing, however, reveals that the value of its digital assets was $327,000 as of last year. Whereas, an earlier filing on September 30 had valued the company’s digital assets at $1.75 million.\n\nDespite the discrepancies, the company says it operates with the concept that its digital assets are “indefinite-lived intangible assets,” and are subject to impairment losses. That is, the fair value of the assets may fall below their carrying value at any time.\n\nPLBY also explains further that such impairment losses on digital assets may not be recovered. That is even if the fair value of the assets rises again after taking the hit. Part of the filing reads:\n\n“Therefore, negative swings in the market price of Ethereum could have a material impact on the company’s earnings and carrying value.”\n\nMeanwhile, the company also revealed the only time a price rise can potentially impact its earnings positively. According to the filing, this can only happen when the Ethereum it holds in its balance sheet, is sold at a gain.\n\nSince PLBY launched its “Rabbitar” NFT project in October 2021, Ethereum has lost about 60% in value, per TradingView data.\n\nIt might be worth noting that the Rabbitars NFT is not Playboy’s first foray into the NFT space. Before launching the project, the company carried out an NFT drop called “Liquid Summer” in early 2021.\n\nPlayboy is also keen on blockchain technology. It first delved into the blockchain technology industry in 2018. That was when Playboy TV started accepting bitcoin payments before later expanding to Playboy.com in June. The company also announced its MetaMansion project in February, signaling its intent to move to the metaverse."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzE2L3BsYXlib3ktbG9zdC00OW0tb24tZXRoZXJldW0taXQtYWNjZXB0ZWQtYXMtbmZ0LXBheW1lbnRzL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzE2L3BsYXlib3ktbG9zdC00OW0tb24tZXRoZXJldW0taXQtYWNjZXB0ZWQtYXMtbmZ0LXBheW1lbnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Playboy Lost $4.9M on Ether It Accepted as NFT Payments - CoinDesk",
        "content": "“The market price of one [ether] in our principal market ranged from $964 to $3,813 during the year ended Dec. 31, 2022, but the carrying value of each Ethereum we held at the end of the reporting period reflects the lowest price of one Ethereum quoted on the active exchange at any time since its receipt,” according to the filing. \"Therefore, negative swings in the market price of Ethereum could have a material impact on the company's earnings and carrying value, while only time a rise in prices will impact the company’s earnings positively, is when the Ethereum held in the balance sheet, are sold at a gain,\" the filing said."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYnJhdmVuZXdjb2luLmNvbS9pbnNpZ2h0cy9jcnlwdG9zLWJlc3QtbGF5ZXIyLXNvbHV0aW9uc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Arbitrum launches token - Layer 2 the narrative of 2023 - Brave New Coin Insights",
        "content": "Arbitrum launches token – Layer 2 the narrative of 2023\n\nReturns so far this year for Layer 2 projects have far outstripped Bitcoin and Ethereum. Strengthening the crypto ecosystem’s ability to serve both new users and new use cases, Layer 2s are a driving force in the narrative of 2023. So what are they, and why should you care?\n\nThe Arbitrum Foundation today announced the launch of DAO governance for its Arbitrum Nova and Arbitrum One networks. To power the new decentralized structure, a governance token will be launched, called $ARB. The token will be airdropped to users of Arbitrum on Thursday, March 23rd\n\nL2beat.com lists Arbitrum One as the largest layer-2 platform and the holder of 56.1% of the Layer-2 Total Value Locked. The Arbitrum token airdrop has been highly anticipated because of the size and popularity of the project. Layer-2 airdrops have a strong recent history of success, including the Optimism airdrop (OP).\n\nThe Aribtrum news follow another recent major Layer-2 announcement. In late February 2023, publicly listed Digital Asset exchange Coinbase launched Base, a new Layer 2 that is built using OP Stack, an open-source, shared standard for building Layer 2s released by Optimism.\n\nLayer 2 refers to any secondary framework or protocol built on top of an existing blockchain that adds features that improve the scaling capabilities of the base chain. Base layer blockchains like Bitcoin and Ethereum, can slow down and become expensive when they are congested because of events such as popular NFT drops.\n\nEthereum gas fees over the last year. Source: Ycharts\n\nThe chart above demonstrates the inconsistent nature of Ethereum gas fees and their tendency to spike.\n\nThe launch of BASE is set to introduce Web 3.0 solutions and networks to a whole new audience of users. Coinbase has an estimated 110 million verified users and US$80 billion worth of assets locked on its platform. The launch of BASE is potentially a watershed mainstream moment for the layer 2 space and it now appears to be cemented into the crypto consciousness. BASE arrives with the layer 2 space booming. One important feature of layer 2s is that they are designed to maximize the blockchain User Experience (UX) which is a perfect fit for Coinbase, a platform that has made crypto accessible for millions.\n\nL2beat, a layer 2 analytics platform, says that over the last year the US dollar value locked on Ethereum layer 2 platforms has risen from US$4.1 billion to US$6.2 billion, a ~51% rise. The amount locked onto layer 2s has also risen in ETH terms from ~3.45 million ETH to 3.96 million ETH, an ~15% increase. L2beat does not include the Polygon network, an Ethereum scaling solution, which many technologists state is not a ‘true’ layer 2. If we add Polygon’s TVL to this mix, the layer 2 TVL then becomes ~US$7.3 billion.\n\nCurrently, the top layer 2 platforms in the world are Ethereum-focused, but platforms such as Stacks, which is focused on building scaling solutions for the Bitcoin blockchain, are growing in popularity. The layer 2 solutions space is being developed rapidly.\n\nSince August 2022, transaction activity on Arbitrum, the top Ethereum layer-2 platform, has surged.\n\nThe wider trend for Ethereum, the base chain that Arbitrum supports, is much more flat and apart from a few isolated spikes, the daily transaction activity for Ethereum is marginally lower than it was 18 months ago.\n\nArbitrum transactions exceed Ethereum’s – Source L2Beat.com\n\nOn February 22nd, the total number of transactions on the Ethereum chain hit 100,080,869. On Arbitrum on the same day, the total number of transactions was 100,103,187. This has not happened since or before but indicates that daily transactions on a single layer 2 can top those on the base chain.\n\nThere are forecasts that eventually layer 2s will replace Ethereum as the platforms for everyday transactions while Ethereum will maintain utility as a settlement/verification layer. What happened on February 22nd, is a clear indication that this future is possible.\n\nTypes of Layer 2 Solutions\n\nTrue Layer 2s\n\nOptimistic Rollups – This is the technology that supports the two most popular ‘True’ Roll-up solutions, Arbtitrum and Optimism. Like other layer 2 solutions, Optimistic Rollups reduce computation on the Ethereum chain by processing transactions and state-storage off-chain.\n\nOptimistic rollup operators bundle multiple off-chain transactions together in large batches before submitting them to the Ethereum main chain. This method enables the spread of fixed costs across multiple transactions. Rolling them up into batches reduces fees and the compression techniques used also reduce the amount of data posted on Ethereum.\n\nOptimistic roll-ups are called ‘Optimistic’ because they assume the transactions they shift off-chain are valid. There is no onchain proof of validity.\n\nArbitrium and Optimism makeup over 80% of the Layer 2 market share.\n\nZero-Knowledge Rollups – This is the solution used by dYdX, Loopring, and ZkSync Lite. ZK roll-ups in many ways are similar to Optimistic Roll-ups, Zero Knowledge roll-ups publish cryptographic proofs-of-validity for off-chain transactions. Operators of ZK rollup chains submit validity proofs to the main chain that demonstrate with cryptographic certainty that the proposed changes to Ethereum’s state are due to a batch of valid transactions that were processed off-chain.\n\nZKrollups are inherently more secure but because they are less scalable they have been less popular. Optimism can process larger batches of transactions more quickly. It is also more popular because it is easier to implement and operate.\n\nValidium – A more niche solution that is used by a number of EVM-based Dapps including Immutable X, ApeX, Sorare. Validium, like Zk-Rollups, proves the validity of transactions with Zero-Knowledge proofs; it does not store transaction data on-chain, which significantly reduces the amount the Validium contract interacts with the Ethereum mainnet. Storing data transactions has trade-offs like security, but significantly increases throughput and scalability. Validium’s throughput is reportedly comparable to Optimism and is said to be able to process ~9000 transactions per second.\n\nForks and Hybrids (Optimistic chains like Metis) – There are a few forks of layer 2 solutions that add modifications designed to optimize the original solutions. An example of this is the Metis platform, launched by MetisDAO. Metis propose that they offer a best-of-both-worlds solution, combining the scalability of Optimistic roll-ups with the security of Zero-Knowledge proofs. Metis has its own suite of unique dapps like Hummus exchange (a fork of platypus finance) and Hermes (a fork of Solidly).\n\nSidechains\n\nPolygon – A scaling solution that is in a category of its own. Polygon is actually a variety of scaling layers built with a Polygon infrastructure that has built a technology to communicate with Ethereum. The most popular is the Polygon Proof-of-Stake (PoS) sidechain that is currently live and actively used. Polygon PoS supports faster and cheaper transactions for the Ethereum main chain by running a parallel sidechain, with its own consensus model and token, which periodically checks in with the base chain for security purposes. Polygon’s scaling technology is supported by Plasma.\n\nPrice performance of Layer-2 tokens\n\nOptimism (OP) – Price at the start of the year – US$0.917, Price now – US$2.47. YTD Returns – 169.4%\n\nLoopring (LRC) – Price at the start of the year – US$0.188, Price now – US$0.321. YTD Returns – 70.4%\n\nSkale (SKALE) – Price at the start of the year – US$0.0199, Price now – US$0.0416. YTD Returns – 109.0%\n\nMetis (METIS) – Price at the start of the year – US$16.05, Price now – US$28.53. YTD Returns – 77.8%\n\nBoba Network (BOBA) – Price at the start of the year – US$0.613, Price now – US$0.243. YTD Returns – 49.1%\n\nZk space (ZKS) – Price at the start of the year – US$0.0444, Price now – US$0.0675. YTD Returns – 52.0%\n\nPolygon (MATIC) – Price at the start of the year – US$0.759, Price now – US$1.15. YTD Returns – 51.5%\n\nStacks (STX) Price at the start of the year – US$0.213, Price now – US$0.917. YTD Returns – 330.5%\n\nImmutable X (IMX) – Price at the start of the year – US$0.384, Price now – US$1.18. YTD Returns – 207.3%\n\ndYdX (DYDX) – Price at the start of the year – US$1.10, Price now – US$2.43. YTD Returns – 120.3%\n\nBenchmarks\n\nBitcoin (BTC) – Price at the start of the year – US$16540.69, Price now – US$25,081.81. YTD Returns – 51.6%\n\nEthereum (ETH) – Price at the start of the year – US$1196.61, Price now – US$1683.86. YTD Returns – 40.7%\n\nKey Takeaways"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vcHJvdG9zLmNvbS9wbGF5Ym95LWxvc2VzLTVtLW9uLWV0aGVyZXVtLWVhcm5lZC1mcm9tLW5mdC1zYWxlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Playboy loses $5M on Ethereum earned from NFT sales - Protos",
        "content": "Listen to this article.\n\nParent of Hugh Hefner’s Playboy, PLBY Group, has disclosed a loss of $4.9 million on the Ethereum it held last year — citing a crypto winter as the cause.\n\nPlayboy’s NFT collection, Rabbitars, launched in 2021 at the peak of the NFT craze. According to its 10-K form filed on Thursday, the value of its digital assets was $327,000 as of last year. But in September 2022, PLBY’s filings showed a value of $1.75 million in digital assets.\n\nIndeed, since Rabbitars were released two years ago, the price of ether has plummeted over 60%.\n\nPLBY considers its digital assets as “indefinite-lived intangible assets.”\n\nThey are subject to impairment losses if the fair value of assets falls below carrying value at any time.\n\nImpairment losses can’t be recovered — even if fair value increases once more.\n\n“The market price of one Ethereum in our principal market ranged from $964 – $3,813 during the year ended December 31, 2022, but the carrying value of each Ethereum we held at the end of the reporting period reflects the lowest price of one Ethereum quoted on the active exchange at any time since its receipt,” PLBY explained in its filing.\n\n“Therefore, negative swings in the market price of Ethereum could have a material impact on the company’s earnings and carrying value, while only time a rise in prices will impact the company’s earnings positively, is when the Ethereum held in the balance sheet, are sold at a gain,” the filing said.\n\nPlayboy has been crypto curious for years\n\nPlayboy has actually had a long history with NFTs, Bitcoin, and blockchain. In 2018, it planned to integrate a crypto token called Vice Industry Token (VIT) onto its platforms. VIT would have been used to reward viewers for watching its content, leaving comments, and voting.\n\nIt even planned to introduce a crypto wallet on its websites. However, the Canadian blockchain startup it partnered with to make it happen, Global Blockchain Technologies (GBT) was sued by Playboy for fraud and breaching contract.\n\nRead more: NBA Top Shot NFTs could be unregistered securities, judge says\n\nPlayboy has also released archival photographs and magazine covers as non-fungible tokens, featuring celebs like model Lenna Sjööblom and Burt Reynolds.\n\nIts own Rabbitar series has dwindled in value since 2021 — some owners are selling their digital collectibles for over 1,000 ether, but offers hover around 0.06 WETH on OpenSea. Floor price for Rabbitars is 0.07 ETH at press time.\n\nFor more informed news, follow us on Twitter, Instagram, and Google News or subscribe to our YouTube channel."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWFuZC1zdGFibGVjb2lucy1hcmUtY29tbW9kaXRpZXMtY2Z0Yy1jbGFzaGVzLXdpdGgtdGhlLXNlYy_SAVxodHRwczovL3p5Y3J5cHRvLmNvbS9ldGhlcmV1bS1hbmQtc3RhYmxlY29pbnMtYXJlLWNvbW1vZGl0aWVzLWNmdGMtY2xhc2hlcy13aXRoLXRoZS1zZWMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "‘Ethereum and Stablecoins Are Commodities’: CFTC Clashes With the SEC - ZyCrypto",
        "content": "Advertisement\n\nIf digital assets are classified as securities, it means more restrictions, something feared could hinder innovation in the sector.\n\nIt is part of a broader debate as the industry regulators move to tame volatility and protect investors.\n\nThe Commodity Futures Trading Commission (CFTC)’s hearing before the Senate Agriculture Committee Wednesday was dominated by the discussion around digital assets. The commission took a firm stance against the SEC regarding the classification of Ether and Stablecoins.\n\nCFTC chair, Rostin Behnam, told the committee that the second largest cryptocurrency was a commodity since it has been listed on CFTC exchanges for quite a while and that it was the right authority to police its derivatives and the underlying markets. Responding to Sen. Gillibrand, Behnam told the hearing that his commission had considered all the litigation and credibility risks in the classification.\n\nSecurity or commodity: why the classification matters\n\nSuppose an asset is classified as a security. In that case, it is subject to additional regulatory requirements, something experts believe, in the case of Ethereum, could hinder the growth of the blockchain and the many projects building on it. Such classification also compels the regulated security to comply with the relevant reporting and registration standards provided under the Securities Act of 1934.\n\nOn the other hand, if Ether is classified as a commodity, it means fewer restrictions and growth potential. SEC’s argument for classifying Ether as a security is based on how the project was funded – through an Initial Coin Offering (ICO). During the ICO, the agency claims investors bought the token anticipating a return, a test for determining security called the Howey test.\n\nBehnam also sharply disagreed with the position of the SEC’s chair Gary Gensler that all digital assets except bitcoin are securities because the “forks buying them are anticipating profits, and a small group of entrepreneurs and technologists are nurturing the projects.”\n\nAdvertisement\n\nCFTC’s stance on stablecoins\n\nCiting a 2021 settlement with stablecoin issuer Tether, where the commission fined the platform $41 million on the allegations that it misled investors that fiat currencies fully backed USDT stablecoin, Behnam maintains his position that stablecoins also fall under its oversight as commodities.\n\n“Notwithstanding a regulatory framework around stablecoins, they are going to be commodities, in my view,” he said. “I know colleagues might have a different opinion, but we’ve done the legal analysis and examined the circumstances around the Tether case. It was clear to our enforcement team and the commission that Tether stablecoin was a commodity, and we needed to move forward and swiftly to police the market and the company.”"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vdGhlZGVmaWFudC5pby91bmlzd2FwLXYzLWxhdW5jaGVzLW9uLWJuYi1jaGFpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 18:03:17 GMT",
        "title": "Uniswap v3 Launches On BNB Chain After Months of Infighting - The Defiant - DeFi News",
        "content": "Uniswap, the leading decentralized exchange, went live on BNB Chain following months of infighting on Wednesday. Uniswap Labs announced the launch of its v3 protocol on BNB Chain, saying the blockchain “typically offers faster and cheaper transactions than Ethereum,” making the exchange accessible to a broader user base. BNB Chain, a blockchain created by the…\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nUniswap, the leading decentralized exchange, went live on BNB Chain following months of infighting on Wednesday.\n\nUniswap Labs announced the launch of its v3 protocol on BNB Chain, saying the blockchain “typically offers faster and cheaper transactions than Ethereum,” making the exchange accessible to a broader user base.\n\nBNB Chain, a blockchain created by the Binance exchange, is the second-largest smart contract network with a total value locked (TVL) of $5B, according to DeFi Llama. The network is compatible with the Ethereum Virtual Machine, meaning Ethereum developers can easily port their code.\n\nThe network has an adversarial history regarding Ethereum, with Binance seeking to siphon TVL away from Ethereum. BNB Chain is host to Uniswap’s top rival, Pancake Swap, which is a fork of Uniswap v2. Pancake Swap drove a total value locked of $2.5B, according to DeFi Llama, and a 24-hour volume of 159.7M, according to CoinGecko.\n\nUniswap is the fifth-ranked DeFi protocol with a TVL of $3.5B, according to The Defiant Terminal. Uniswap v3 drove $2.2B worth of trades over the past 24 hours.\n\nUniswap’s v3 iteration pioneered “concentrated liquidity”, a feature significantly improving the efficiency of capital utilization for DEXes, in May 2021 when it launched on Ethereum. The Uniswap v3 code was launched under a Business Source License, protecting its code against unauthorized commercialization for two years.\n\n0xPlasma Labs, a DeFi platform, first published a proposal outlining plans to launch v3 on BNB Chain in December 2022. Uniswap governance passed the initial temperature check proposal on Jan. 22 with 80% support. 0xPlamsa predicted deploying v3 on BNB Chain would grow Uniswap’s TVL by $1B.\n\nThe debate continued within the Uniswap community during the lead-up to a final on-chain vote scheduled for Feb. 10 that would determine whether to implement the proposal.\n\nGFX Labs, a crypto firm that participates in Uniswap governance, said that a BNB Chain deployment would benefit Uniswap by protecting it against unauthorized competitors deploying v3 on the network after its Business Source License expires in April.\n\n“Within two months of Uniswap v3’s deployment, it took over most of Polygon DEX’s market share,” GFX added.\n\nThe proposal passed with two-thirds support, but Andreessen Horowitz (A16z), the largest venture capital firm in crypto and a major Uniswap investor, said it was unable to participate in a vote to determine v3’s bridging infrastructure provider for BNB Chain because of a technical issue.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nThe firm said it would have voted for its portfolio company, LayerZero, to provide bridging infrastructure for the BNB Chain deployment rather than Wormhole, and asked for the community to count 15M of its UNI as having been mobilized to vote accordingly.\n\nDevin Wash, the founder of the Uniswap Foundation, rejected A16z’s request, and said Uniswap would move forward with the final vote count.\n\nOn Wednesday, Wormhole said v3’s BNB Chain Launch is a “significant win” for Uniswap and “an essential step towards a multi-chain future” for the broader DeFi ecosystem."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDMvMTcvdml0YWxpay1zdWdnZXN0cy1tdWx0aXNpZy13YWxsZXRzLWZvci1zZWN1cmluZy1mdW5kcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Vitalik Suggests Multisig Wallets for Securing Funds - Crypto Times",
        "content": "In a recent blog post on Reddit, Ethereum co-founder, Vitalik Buterin emphasised on self-custody of funds through Multisig wallets and Social Recovery wallets to ensure the safety of funds, instead of handing them over to a “centralized entity”.\n\nSelf-custody is important. And social recovery and multisig is a great way to do it.\n\n\n\nA quick reddit post on how I think about choosing guardians for social recovery and multisig wallets:https://t.co/FY1iyJ6BFC — vitalik.eth (@VitalikButerin) March 17, 2023\n\nHis statement is coming amidst the ongoing devastation in crypto-friendly banks such as Silicon Valley Bank, Signature Bank, to name a few, and the collapse of centralised crypto firms including FTX, Voyager Digital, and others.\n\nVitalik stated in a blog post, “I use a multisig wallet personally to store the bulk of my funds, as does the Ethereum Foundation.”\n\nMultisig wallets are digital wallets that require the approval of all authorised members to sign transactions through signature. It means no single owner can get access to funds. On the other hand, funds locked in social recovery wallets can be recovered by a group of keys held by other people if the main key gets lost.\n\nHe said social recovery wallets are more incorporative than multisig with ERC-4337 account abstraction and upcoming wallets like Soul Wallet. ERC-4337 is the recently deployed smart contract on the Ethereum network and is expected to boost mainstream crypto adoption.\n\nBoth types of wallets rely on “guardians,” which are individuals or entities holding keys that can approve transactions or recover funds.\n\n“My recommendation will be to use social recovery for hot wallets that store a small portion of a person or organization’s funds, and multisigs for cold wallets that store a person or organizations’s savings,” he added.\n\nIn a post, he shared guidance to choose guardians, in which he stated"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG8taW52ZXN0bWVudC1mcmF1ZC1yaXNlLTE4My1zdG9yZS15b3VyLWJpdGNvaW4tYW5kLWV0aGVyZXVtLXNhZmVseS13aXRoLWxvY2t5b3VyY3J5cHRvLWNvbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Crypto Investment Fraud Rise 183%; Store your Bitcoin And Ethereum Safely With Lockyourcrypto.com - Analytics Insight",
        "content": "According to a criminal record report published by the Federal Bureau of Investigation, cryptocurrency investment scams increased from 907 million dollars in 2021 to 2.5 billion dollars in 2022, which is a 183% rise. The FBI also stated that the crypto investment scams saw an unprecedented rise in the number of victims in 2022, and Most of the victims assumed huge debt to cover losses from these fraudulent investments. As per the FBI report, the crypto fraudsters targeted people ages 30-49. The FBI noted in its report that the scams were socially engineered and trust-enabled. Most of the scams began with romance or confidence and later evolved into cryptocurrency investment fraud, the report mentioned.\n\nThe crypto community is being introduced to various new cybercrimes every day. This emphasizes the importance of having a safe vault to protect crypto investments. Lockyourcrypto.com is one such digital fortress that provides crypto investors with a highly-secured place to keep their valuable digital assets away from cybercriminals.\n\nBitcoin And Ethereum Rise\n\nBitcoin and Ethereum are the two major icons of the crypto world. Even People who do not know about cryptocurrencies and their values are aware of Bitcoin and Ethereum. The influence of these currencies reaches beyond the virtual world and affects the ordinary man in our real world.\n\nThough both coins are regarded as the most credible and valuable digital assets in the market, they suffered a week-long downtrend in the market in March. Between March 9-14, the price of BTC fell below $20K and rose to $26K. At the time of writing, BTC was trading at around $24,800.\n\nEthereum, the second-largest cryptocurrency, also stumbled in the market in the past week. ETH price slumped below $1,300 and rose to $1,700 over the past 7 days. It was trading at around $1,600, at the time of writing.\n\nBoth Bitcoin and Ethereum have gained 15% and 8.52% respectively over the past seven days.\n\nThis volatile nature of the crypto market can make a weak-handed person panic sell their stocks which could result in loss or reduced profit. Lockyourcrypto.com has a perfect feature for these weak-handed investors to control their paper hand and increase their chance to earn more.\n\nLockyourcrypto.com – A Digital Fortress\n\nThe crypto industry has two types of wallets called non-custodial wallets and custodial wallets. With non-custodial or self-custodial wallets, the investors will have control of their private keys and cryptocurrency holdings. They will be responsible for maintaining security measures to protect their crypto funds.\n\nNon-custodial wallet users will need a backup mechanism to use if they forget the private keys. They can employ Cold wallets or hardware wallets, which are in physical form and can store the private keys offline. Since these physical wallets can be stolen and broken, they are also not safe.\n\nBut with custodial wallets, a third party like Lockyourcrypto.com will be in control of your private keys. Many investors prefer custodial wallets as they don’t wish to risk forgetting their private keys and losing their entire investments.\n\nLockyourcrypto.com protects your private keys in multilayer security. It uses a password pin or fingerprint authentication to eliminate unauthorized access to the vault.\n\nThe users will need to log in to the Lockyourcrypto.com platform to transfer their digital assets to the vault. After transferring the funds, the users can choose the time frame for the funds to be locked up. This lock-up feature would help weak-handed investors to control their paper hands during market volatility. The added advantage of the lock-up time frame is that depositors can not withdraw or transfer this fund during this period except in case of an emergency.\n\nLockyourcrypto.com platform uses high-level encryption to protect funds from cyber attacks. It also ensures the privacy of the depositors.\n\nAlong with all these safety measures, investors should be aware of various forms of cyberattacks in the crypto industry to avoid falling prey to such scams in the future.\n\nCheck it out at the links below:\n\nWebsite: www.Lockyourcrypto.com\n\nTwitter: https://twitter.com/_Lockyourcrypto\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNhbmFyaWFud2Vla2x5LmNvbS9wb3N0cy9FdGhlcmV1bS1zLXVzZS1jYXNlcy1hbmQtYWRvcHRpb24tcmF0ZS1pbi12YXJpb3VzLWluZHVzdHJpZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's use cases and adoption rate in various industries - - Canarian Weekly",
        "content": "Ethereum's use cases and adoption rate in various industries\n\n3/16/23, 11:02 AM By Canarian Weekly Business\n\nEthereum is a blockchain-based platform that allows developers to create decentralized applications. It is a decentralized open-source blockchain with smart contract functionality, which allows developers to build and deploy decentralized applications.\n\nEthereum has seen a surge in adoption in various industries, with use cases ranging from finance to supply chain management. In this article, we will discuss some of the use cases and adoption rates of Ethereum in various industries.\n\nFinance.\n\nThe finance industry has been one of the biggest adopters of Ethereum. With its smart contract functionality, Ethereum has enabled the creation of decentralized finance (DeFi) applications. These applications aim to replace traditional financial intermediaries such as banks, by providing financial services such as loans, insurance, and trading in a decentralized manner.\n\nThe use of smart contracts ensures that transactions are transparent, immutable, and executed without intermediaries, thus reducing the costs associated with traditional financial services. According to DeFi Pulse, the total value locked in DeFi protocols has surpassed $200 billion, with Ethereum being the leading blockchain platform for DeFi. You might also want to consider knowing about cryptocurrencies’ Decentralization.\n\nGaming.\n\nEthereum is also being used in the gaming industry. With the creation of non-fungible tokens (NFTs) on Ethereum, game developers can create unique in-game assets that players can buy, sell and trade in a decentralized manner. These in-game assets can include characters, weapons, and other virtual items.\n\nThe use of NFTs ensures that the ownership of in-game assets is transparent and immutable, preventing fraud or duplication. The adoption of NFTs in gaming has been on the rise, with some NFTs selling for millions of dollars. Ethereum-based game Axie Infinity has become one of the most popular blockchain games, with over a million daily active users.\n\nSupply Chain Management.\n\nEthereum is also being used in supply chain management. The use of smart contracts enables the creation of a transparent and immutable record of the movement of goods from the point of origin to the final destination. This ensures that all stakeholders in the supply chain have access to the same information, preventing fraud and improving efficiency.\n\nEthereum-based supply chain management platform Provenance has been used by companies such as Nestle and Unilever to track the movement of their products and ensure the sustainability of their supply chains.\n\nReal Estate.\n\nEthereum is also being used in the real estate industry. The use of smart contracts allows for the creation of decentralized platforms for buying and selling real estate. These platforms can provide a transparent and immutable record of property ownership and transactions, reducing the need for intermediaries such as real estate agents or lawyers.\n\nThe use of smart contracts can also enable the automation of tasks such as property inspections and mortgage payments, improving efficiency and reducing costs. Ethereum-based real estate platform Propy has been used to complete real estate transactions in the United States and Europe.\n\nAdoption Rate.\n\nEthereum's adoption rate has been on the rise in recent years. According to a report by DappRadar, the number of active Ethereum wallets has surpassed 150 million, with over 2.5 million daily active users of Ethereum-based decentralized applications. The total value of transactions on the Ethereum blockchain has also surpassed $1 trillion, making it the second-largest blockchain after Bitcoin.\n\nThe adoption of Ethereum is not limited to the finance and gaming industries, with its use cases expanding to other industries such as healthcare, energy, and education.\n\nChallenges.\n\nWhile Ethereum has seen a surge in adoption, it still faces some challenges. One of the biggest challenges is the scalability of the Ethereum blockchain. With the increasing number of users and transactions, the Ethereum network has been experiencing congestion and high fees, making it difficult for some users to use Ethereum-based applications.\n\nTo address this challenge, Ethereum developers are working on solutions such as Ethereum 2.0, a major upgrade to the Ethereum network that aims to improve its scalability and efficiency. Ethereum 2.0 will introduce features such as sharding, which will allow the network to process more transactions simultaneously, and proof-of-stake consensus, which will reduce energy consumption and improve network security.\n\nOther challenges facing Ethereum include regulatory uncertainty, interoperability with other blockchains, and the development of user-friendly decentralized applications.\n\nConclusion:\n\nIn conclusion, Ethereum has seen a surge in adoption in various industries, with use cases ranging from finance to supply chain management. Its smart contract functionality has enabled the creation of decentralized applications that aim to replace traditional intermediaries and improve efficiency.\n\nHowever, Ethereum still faces challenges such as scalability, regulatory uncertainty, and the development of user-friendly applications. Despite these challenges, Ethereum's adoption rate is expected to continue to rise as more industries explore its potential for innovation and disruption.\n\nOther articles that may interest you... AENA Plans to open hotels in major Spanish airports\n\nAchieving Long-Term Growth: Ripple's XRP Investment Blueprint\n\nThe Best Options for Moving to Spain from Abroad"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ub3QtanVzdC1hLW1lbWUtYmlnLWV5ZXMtY29pbnMtcHJlc2FsZS1pcy1yZW1pbmlzY2VudC1vZi1lYXJseS1zdWNjZXNzZXMtb2YtZXRoZXJldW0tYW5kLWZpbGVjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Not Just A Meme: Big Eyes Coin's Presale Is Reminiscent Of Early Successes Of Ethereum And Filecoin - Analytics Insight",
        "content": "Within the crypto market, there is always an interest in what could be the new big thing on the scene. And if current indications are anything to go by, the new meme coin sensation Big Eyes Coin (BIG) could be just that. Amid a blistering presale, it’s generating numbers that could draw legitimate comparisons to Ethereum (ETH) and Filecoin (FIL).\n\nPresales are useful to investors and cryptos alike. They help investors in knowing how a coin could be potentially trading on the crypto market, and likewise, coins can assess what kind of impact they could have. This is where Big Eyes Coin will be looking to carve its name. It’s enjoying a presale of historical magnitude, and the project will look to use this as a springboard for better things once the meme coin enters the crypto market and begins trading on the live market.\n\nNot Just A Meme, But A Community That Believes In Itself\n\nBig Eyes Coin has sustained itself through a strong emphasis on its community and has shown that it’s no laughing matter. Meme coins can be contagious, and Big Eyes Coin is quickly spreading in the crypto community as a new crypto to watch out for.\n\nMeme coins are not always taken seriously, given the warm and laid-back nature of these tokens. They have introduced an element of humour to the crypto market by connecting the crypto industry to the internet meme culture. This is often why many meme coins will have strong communities behind them, and Big Eyes is an example of this.\n\nThis can include integrating those holding BIG tokens into its decision-making process or hosting friendly competitions on Twitter to promote a sense of community by webbing people together.\n\nWhat it has done is result in a truly spectacular presale that is still not finished. The feline coin has been trading exceptionally well as it entered Stage 12 in pursuit of its $50m target. It is more than halfway there, having generated more than $31m in sales. Even during a bearish market, Big Eyes Coin has found ways to continue attracting investors to its platform.\n\nBig Eyes Coin’s Loot Boxes Is A Token Boon\n\nIt’s worth looking at why Big Eyes Coin does well in its presales and how this ties in with its emphasis on community. If the two weren’t linked, you might wonder why BIG cares so much about creating a community. Yet the two are related and exist in symbiosis. Big Eyes Coin has done well, at least in part, because it prioritises its community.\n\nAn example of this is its loot boxes. These are mystery gifts sealed in boxes that are acquired through purchases, and Big Eyes Coin has provided four of them. First, there is the Cute Box which offers a maximum reward of $100. The Kitty Vault follows this with the possibility of earning $25k from it in BIG tokens. The next box is the Super Saiyan Box which offers you a mouthwatering $100k in tokens. And if you thought that was amazing, wait until you hear about its final box. The Excali-Paw Master Chest brings with it a possible $1m in BIG tokens.\n\nAnd here is the best bit about these boxes. They’re designed so that you cannot make a loss on them. The lowest offering of tokens in each loot box is equal to what you pay to acquire them. Every other possible reward within each box trumps what you pay, meaning you cannot make a loss on them. This is an example of the steps Big Eyes Coin has taken to cultivate a relationship of trust with potential investors and encourage them to begin trading for BIG tokens and come to regard it as the next big token in the crypto market.\n\nThere Are Comparisons To Be Made Between Ethereum And Filecoin\n\nBig Eyes Coin has been a glowing presale success that outstrips the performances of many other coins. It has established itself as the next big thing on the meme coin scene, and its numbers are comparable to that of Ethereum and Filecoin. For example, more than seven million ETH tokens were sold in the immediate hours of its presales. These tokens were worth over $2.2m.\n\nFilecoin performed as vibrantly as it produced around $52m in its presales. Considering Big Eyes Coin is well on its way to achieving its target of $50m, there is more than one good reason to see why its supporters are giddy with excitement when you consider the successes of Ethereum and Filecoin since going live.\n\nIf you are excited about what Big Eyes Coin is doing and would like to know more, then visit the links below!\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nTwitter: https://twitter.com/BigEyesCoin\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS1nb2VzLWxpdmUtYXByaWwtMTItd2lsbC1ldGgtaGl0LTIwMDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Shanghai upgrade goes live April 12; Will ETH hit $2,000? - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) investors are inching closer to accessing their staked ETH after the network’s developers announced a new possible date for the highly anticipated Shanghai upgrade.\n\nIndeed, Ethereum’s core developers, in a meeting on March 16, set the date of April 12 for the crucial Shanghai-Capella upgrade, also known as Shapella, on the main network.\n\nAccording to the developers, the Shapella upgrade was successfully launched on the Goerli testnet as the final dress rehearsal before the mainnet launch. The upgrade is scheduled to take place at 10:27 a.m. UTC on April 12, with epoch number 620,9536.\n\nThe highlight of the upgrade is Ethereum Improvement Proposal (EIP) 4895, which will enable validator staking withdrawals on the main network, a critical feature that was not included during Ethereum’s transition to proof-of-stake (PoS) consensus last September after the Merge upgrade.\n\nFurthermore, the Shapella upgrade will include three additional improvements to optimize gas costs for specific activities. Ahead of the withdrawals, the developers have previously conducted various public testing phases on three tests since February, including Sepolia, Zhejiang, and Goerli.\n\nETH withdrawals from their respective validator sets were also successfully processed on all three testnets.\n\nImpact on ETH’s price\n\nThere are projections that the Shanghai upgrade will likely have a positive impact on Ethereum’s price, considering that before the Merge upgrade, there was a significant influx of capital, which appeared to be a case of “buy the rumor, sell the news.”\n\nWith the Shanghai upgrade set to introduce more staking options, analysts view it as a positive development for Ethereum’s value. The possibility of driving Ethereum’s value higher is further validated by the fact that the upgrade will give room to the release of staked ETH, a possible bullish trigger.\n\nAt the same time, one of the Merge upgrades long term projected benefits is the introduction of institutional investors on the platform.\n\nEthereum price analysis\n\nIn the meantime, Ethereum has been trading in tandem with the general market. Amid the current market rally, Ethereum has capitalized by breaching the $1,700 resistance level. By press time, Ethereum was trading at $1,723 with weekly gains of over 20%.\n\nEthereum seven-day price chart. Source: Finbold\n\nIf the upcoming upgrade acts as a bullish aspect for Ethereum, it will be a crucial foundation for the second-ranked cryptocurrency by market cap to target reclaiming $2,000. On the flip side, Ethereum faces the possibility of retesting the $1,500 position, which is acting as a key support level.\n\nAdditionally, the regulatory impact on staking activities will likely also have an impact on the value of Ethereum.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2hvdy10by1lYXJuLWV0aGVyZXVtLWZvci1mcmVlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "How Can You Earn Free Ethereum? Best Ways to Earn for 2023 - Cryptopolitan",
        "content": "Ethereum is a popular virtual currency that has gained tremendous popularity over the past few years for introducing the smart contract capability. So, unsurprisingly, people are looking for ways to get their hands on some Ethereum for free. Fortunately, we will discuss several methods to earn Ethereum for free in this article.\n\nFaucets\n\nFaucets are websites that give away small amounts of Ethereum for free. They require you to solve a captcha or perform another task to receive your Ethereum. You can find many faucet websites online and earn Ethereum easily and with fun. However, before claiming from any faucet, ensure the website is legitimate and not a scam.\n\nExample:\n\nWith FreeEthereum.com, Ethereum enthusiasts can use a reliable platform to get their hands on some tokenized ETH without investing money. Launched in July 2020, the Ethereum faucet offers various tasks, such as clicking links and completing quizzes, allowing users to quickly gain small amounts of ETH BEP-20 (the token from the Binance Smart Chain). The faucet’s settings were configured conveniently with a timer set at one hour, a minimal withdrawal of 0.002 ETH, and no withdrawal fees – making it an excellent choice for those who want to collect free cryptocurrencies at their own pace. FreeEthereum.com is a superb option for everyone interested in ordering some quick ETH.\n\nAirdrops\n\nAirdrops are another way to get free Ethereum tokens. Projects conducting airdrops have just launched their Initial Coin Offering (ICO), giving away tokens or coins to people registering for their ICO. Participating in these airdrops allows you to get free Ethereum without any investment.\n\nExample:\n\nThe popular Ethereum-based blockchain project Polygon (formerly Matic Network) conducted an airdrop of 50,000 MATIC tokens. All users had to do was sign up with their email address and follow the instructions on the website to receive their free tokens.\n\nOnline Games\n\nYou can also earn Ethereum by playing online games. Many game platforms offer rewards in Ethereum tokens for completing tasks or winning competitions. These games provide a fun and easy way to get free Ethereum without any investment.\n\nExample:\n\nEther Kingdoms is a popular crypto-based RPG where players can fight monsters, level up, and earn tokens. In addition, the game has an in-built reward system where players can receive Ethereum rewards for completing tasks.\n\nFreelancing\n\nIf you have some skills or knowledge that are useful to others, you can use them to get rewarded in Ethereum. For example, there are freelance websites such as Upwork and Freelancer where people post projects that require specific skills. You can bid on these projects and earn Ethereum in return.\n\nExample:\n\nIf you are a web developer or a designer, you can search for relevant projects on Upwork and bid on them. Once accepted, the project manager rewards you in Ethereum tokens for completing the project.\n\nCryptocurrency Trading\n\nTrading cryptocurrencies is another way to get free Ethereum. Although trading cryptocurrency requires some knowledge and experience, it can be a great way to make money without investment. By trading wisely and carefully, you can accumulate enough Ethereum over time that will be yours for free.\n\nExample:\n\nBinance is among the most popular crypto exchanges, offering users various trading options. With Binance, you can trade Ethereum (ETH) and other cryptocurrencies for gains. By carefully studying the market and taking calculated risks, you can make some profits from trading ETH tokens without any investments.\n\nMicrotasks\n\nMicrotasks are small tasks you can complete for a small amount of money. These tasks often require little effort and can be done quickly, allowing you to make some free Ethereum.\n\nExample:\n\nMicroworkers offers a variety of microtasks that require no investment and pay in Ethereum. These tasks often involve data entry, image tagging, or simple surveys. You can earn small amounts of ETH tokens without any investments by completing these tasks.\n\nReferrals\n\nReferrals are another way to get free Ethereum without any effort. Many services and companies offer a referral program, where you can earn commissions or rewards when someone signs up through your link. For example, many exchanges offer a referral program that rewards you with a certain amount of Ethereum each time someone registers using your link.\n\nExample:\n\nCoinbase is one of the most popular cryptocurrency exchanges, offering users various services. They also offer a referral program, where you can get rewarded in Ethereum for each new user that joins the platform through your link.\n\nBots\n\nBots are automated scripts that can help you earn free Ethereum. These bots are programmed to search for profitable trades and execute them automatically, earning profits on your behalf. Some bots even allow you to customize settings so that they can make the most profitable trades possible, allowing you to get as much free Ethereum as possible.\n\nExample:\n\n3Commas is a popular trading bot that allows users to automate their trades on multiple exchanges. You can customize your settings and let the bot do its job, earning you free Ethereum. 3Commas is easy to use and requires no investment, making it an excellent way to get extra ETH without any effort.\n\nStaking\n\nStaking is another way to get free Ethereum. Users can delegate their Ethereum tokens to a validator to support the network. Then, as a reward for supporting the network, users receive tips in Ethereum. This method of earning Ethereum does require some investment but is a great way to passively earn rewards for supporting the Ethereum blockchain.\n\nExample:\n\nHuobi is one of the most popular staking platforms for Ethereum. They offer users a variety of ways to earn rewards by staking their ETH tokens. By delegating your tokens to Huobi, you can receive ETH rewards without additional investments or effort.\n\nLend your Ethereum\n\nIf you want to get free Ethereum without doing any work, another option is to lend your Ethereum. You can earn a passive income by lending your Ethereum and collecting monthly interest payments.\n\nExample:\n\nNexo is a popular platform that allows users to lend their crypto in exchange for interest payments. For example, you can lend your Ethereum tokens at competitive rates, allowing you to get free Ethereum without any effort or additional investments.\n\nAccept payments in Ethereum.\n\nIf you are running a business or selling goods and services, you can accept payments in Ethereum. By accepting Ethereum payments, you can get free Ethereum without any effort. This option is perfect if you run an online store that sells digital goods such as software or music.\n\nExample:\n\nCoinbase Commerce is a popular platform that allows users to accept payments in Ethereum. By setting up Coinbase Commerce, you can start accepting ETH payments for your products or services and get free Ethereum each time someone pays with ETH.\n\nParticipate in bounty programs.\n\nBounty programs are another great way to get free Ethereum without any investment. However, these programs usually require you to complete specific tasks, such as social media marketing or bug testing, and then reward you with a predetermined amount of crypto.\n\nExample:\n\nGitcoin is a popular platform that allows users to participate in bounty programs. Completing tasks on the platform can earn free Ethereum as a reward for your efforts. In addition, you also have the opportunity to participate in hackathons and get rewarded with ETH for your work.\n\nLiquidity pools\n\nAnother way to get free Ethereum is by participating in liquidity pools. These pools allow you to deposit cryptocurrency into a shared pool and earn rewards for providing liquidity. By depositing your Ethereum into a liquidity pool, you can earn passive income through interest payments and trading fees.\n\nExample:\n\nUniswap is a popular liquidity pool platform allowing users to deposit Ethereum tokens and earn rewards through trading fees. By depositing your ETH into a Uniswap pool, you can earn passive income each time someone trades with your liquidity.\n\nBe careful of scams\n\nBe aware that there are many scams out there that promise to give away free Ethereum. Before you use any service or participate in an airdrop, do your research and verify the offer’s authenticity. Never share personal information such as passwords or private keys, as these can lead to losing your funds. If something seems too good to be true, it probably is – so be careful when dealing with any service that promises free Ethereum.\n\nConclusion\n\nThere are several ways to get free Ethereum without investing or doing any work. For example, you can use platforms like Nexo and Celsius Network to lend your ETH for interest payments, accept payments in ETH for goods and services, participate in bounty programs and liquidity pools, or watch out for airdrops.\n\nBe sure to research and be careful of scams when dealing with any service that promises free Ethereum. With the right approach, you can get your hands on some extra ETH without having to invest a penny."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2V0aGVyZXVtcy1zaGFuZ2hhaS11cGdyYWRlLWdldHMtcmVsZWFzZS1kYXRlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Upgrade Gets Official Release Date - Cryptopolitan",
        "content": "Ethereum is one of the most popular and widely used blockchain platforms in the world, with a vast ecosystem of applications, services, and developers. Recently, there has been much anticipation and speculation about the upcoming Shanghai upgrade, which promises to bring significant improvements and enhancements to the Ethereum network. The official date for the upgrade has now been announced, and the ETH community is eagerly preparing for the changes ahead. It is projected to have a positive impact on the ETH token as well.\n\nAccording to a recent announcement by the Foundation, the Shanghai upgrade is scheduled to take place on December 4th, 2023. This highly anticipated upgrade is expected to bring significant improvements to the network, including enhanced scalability, improved security, and better support for smart contracts and decentralized applications. The upgrade will also introduce several new features and enhancements that are designed to improve the overall user experience and make Ethereum more accessible and user-friendly.\n\nEthereum 2.0 and the Road to Serenity\n\nThe Shanghai upgrade is part of a broader roadmap for Ethereum 2.0, which is a major upgrade and transformation of the network. Ethereum 2.0 promises to address some of the most significant challenges and limitations of the current network, including scalability, security, and energy efficiency. Ethereum 2.0 will introduce several new technologies and protocols, including proof of stake (PoS) consensus, sharding, and a new virtual machine (VM) called eWASM. These changes will allow Ethereum to handle significantly more transactions and users, while also reducing energy consumption and improving security and decentralization.\n\nThe Shanghai upgrade is an essential step on the road to Serenity, which is the final phase of the Eth 2.0 roadmap. Serenity is expected to bring even more significant improvements and enhancements to the network, including the ability to handle millions of transactions per second, support for private transactions, and much more. Eth 2.0 and Serenity are highly anticipated by the Ethereum community, and they are expected to play a significant role in the future of decentralized finance (DeFi), non-fungible tokens (NFTs), and other blockchain-based applications and services.\n\nPreparing for the Future of Ethereum\n\nAs the community prepares for the Shanghai upgrade and the broader Eth 2.0 roadmap, there are several important considerations to keep in mind. One of the most critical considerations is the need for effective and reliable testing and auditing of smart contracts and other applications that will be running on the new Ethereum network. There is also a need for continued innovation and experimentation with new protocols, technologies, and applications that can take advantage of the enhanced capabilities of Eth 2.0.\n\nOverall, the announcement of the official date for the Shanghai upgrade is an exciting development for the Eth community and the broader blockchain ecosystem. The Ethereum network has come a long way since its launch in 2015, and the upcoming upgrades promise to bring even more significant improvements and enhancements. As the network continues to evolve and mature, it is likely to play an increasingly important role in shaping the future of decentralized finance, non-fungible tokens, and other blockchain-based applications and services."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vZmluYm9sZC5jb20vYmFua2luZy1jb250YWdpb24tc3BhcmtzLWNyeXB0by1mcmVuenktaW52ZXN0b3JzLXJ1c2gtdG8taG9kbC1iaXRjb2luLWFuZC1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Banking contagion sparks crypto frenzy: investors rush to 'HODL' Bitcoin and Ethereum - Finbold - Finance in Bold",
        "content": "After the widely publicized collapse of the Silicon Valley Bank (SVB), accompanied by two other major banking institutions crashing and more at risk, investors seem to be increasingly flocking to the alternative solution – cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH).\n\nAs evident from the declining portion of Bitcoin and Ethereum reserves on crypto exchanges, investors are seeking refuge in these digital assets out of fear that the banking crisis could spread to crypto businesses, as noted by blockchain and financial analysis platform Glassnode in a weekly newsletter sent out on March 13.\n\nSpecifically, the report stated that around “0.144% of all BTC and 0.325% of all ETH in circulation was withdrawn from exchange reserves, demonstrating a similar self-custody response pattern” to the collapse of the crypto trading platform FTX.\n\nBTC and ETH balance on exchanges. Source: Glassnode\n\nOn top of that, the platform’s team stressed that these numbers spoke volumes about the growing level of investor confidence in crypto in recent weeks:\n\n“On a USD basis, the last month saw over $1.8B in combined BTC and ETH value flow out of exchanges. This is not necessarily large in relative scale. However, observing net exchange withdrawals, especially within the current hostile regulatory environment, does speak to a degree of investor confidence that is worth noting.”\n\nBTC and ETH exchange net position change. Source: Glassnode\n\nBitcoin price analysis\n\nMeanwhile, Bitcoin has put some breaks on its recent progress, gaining only 0.17% on the day and at press time trading at the price of $24,674, as it began to consolidate the weekly increases of 13.64% and of 13.14% on its monthly chart.\n\nBitcoin 7-day price chart. Source: Finbold\n\nEthereum price analysis\n\nAt the same time, Ethereum has lost 1.17% in the last 24 hours, trading at the price of $1,672, but still up 8.97% compared to the previous seven days and 11.02% across the last month, as per the latest information retrieved on March 16.\n\nEthereum 7-day price chart. Source: Finbold\n\nWhether crypto manages to retain investors’ interest remains to be seen and will largely depend on the developing situation in the banking sector, in addition to the developments directly related to the cryptocurrency market and the wider macroeconomic landscape.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNyeXB0b2dsb2JlLmNvbS9sYXRlc3QvMjAyMy8wMy9ldGhlcmV1bS1ldGgtc3VwcGx5LWRyb3BwZWQtYnktbW9yZS10aGFuLTEwMC1taWxsaW9uLXNpbmNlLXRoZS1tZXJnZS1kYXRhLXNob3dzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Ethereum ($ETH) Supply Dropped By More Than $100 Million Since the Merge, Data Shows - CryptoGlobe",
        "content": "Over $100 million worth of the second-largest digital currency by market capitalization Ethereum ($ETH) have been burned since the cryptocurrency’s network transitioned from a Proof-of-Work (PoW) consensus algorithm into a Proof-of-Stake (PoS) consensus algorithm.\n\nThe cryptocurrency’s deflationary trend has been growing over time, with its supply having dropped by over 64,457 ETH since the network’s merge upgrade over 180 days, to the point there are now 120,456 ETH circulating on the market.\n\nAccording to data from Ultrasound.money, Ethereum’s supply has been dropping by 0.1% per year since the Merge, while without it, it would be rising at a rate of 3.42% per year.\n\nThe website’s projections suggest Ethereum’s supply could drop to 117 million ETH by 2025, with issuance rewards for stakers on the network being expected to be about 4% per year. A significant portion of the ETH burn resulting in the decrease in supply can be attributed to transfers from major DeFi applications, including Uniswap, Tether, and other projects burning tokens through transaction fees.\n\nEthereum transactions started burning ETH after the London hard fork, which included the implementation of Ethereum Improvement Proposal (EIP) 1559. The EIP changed the way transaction fees on the network work. Instead of an auction system, users now pay a base fee for their transaction to be processed by validators, and can alternatively tip them to get their transactions to be processed faster.\n\nEthereum staking has been seen a source of revenue for both cryptocurrency holders and exchanges. These platforms offer users a staking service allowing them to maintain liquidity through a separate token while locking their ETH on-chain to earn rewards, and collect a potion of the rewards in exchange.\n\nNasdaq-listed cryptocurrency exchange Coinbase has, for example, reported revenue of over $200 million in the fourth quarter of last year through its staking, earn, and custody products.\n\nNotably, Ethereum’s highly anticipated Shanghai upgrade is one step closer to being activated on the network’s mainnet, following a final dress rehearsal that was carried out on the Goerli testnet, which involved a simulation of staked ETH withdrawals.\n\nOnce activated, the upgrade will complete Ethereum’s full transition to a proof-of-stake (PoS) network, allowing validators to withdraw their staked ether and rewards earned from adding or approving blocks.\n\nImage Credit\n\nFeatured Image via Unsplash"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5vdXRsb29raW5kaWEuY29tL2J1c2luZXNzLXNwb3RsaWdodC91c2UtdmF1bHQtcGluLTMwMC10by1iZWNvbWUtYS1jcnlwdG8tbWlsbGlvbmFpcmUtYmlnLWV5ZXMtY29pbi13aW5rcy1hdC1iaXRjb2luLWV0aGVyZXVtLW5ld3MtMjcwNTgy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Mar 2023 07:00:00 GMT",
        "title": "Use VAULT PIN 300 To Become A Crypto Millionaire! - Big Eyes Coin Winks At Bitcoin & Ethereum - Outlook India",
        "content": "The generous Big Eyes cat keeps rewarding its community for making sure that by the time this coin formally launches, every BIG token member ends up becoming a crypto millionaire! First, the cat launched a vault pin that provided investors with a chance to get a free loot box of equivalent value. However, as the BIG coin is fast approaching its launch, the BIG cat has tripled the fun! Meaning that this vault pin gives the investors a chance to get 300% extra on BIG token purchases! With the vault pin 300, you can now get thrice the value of the amount that you’ve spent on the BIG coin purchase, which is insane! If you are planning to become a part of this fastest-growing meme coin community, we suggest that you get your BIG tokens instantly using this vault pin, as this is a very limited-time offer. Grab your BIG tokens now to get a chance to win 300% extra on your initial investment and join the crypto community that is predicted to be the next big sensation of the crypto world!"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbmNoYXB0ZXIuY29tL3Jhc3RhLWJlYWNoLWNsdWItbmZ0LWNvbGxlY3Rpb24tZ2VuZXJhdGl2ZS1hcnQtcGZwLWNvbGxlY3Rpb24tb24tZXRoZXJldW0tYmxvY2tjaGFpbi_SAXFodHRwczovL2NvaW5jaGFwdGVyLmNvbS9yYXN0YS1iZWFjaC1jbHViLW5mdC1jb2xsZWN0aW9uLWdlbmVyYXRpdmUtYXJ0LXBmcC1jb2xsZWN0aW9uLW9uLWV0aGVyZXVtLWJsb2NrY2hhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Rasta Beach Club NFT Collection: Generative Art PFP Collection on Ethereum Blockchain - CoinChapter",
        "content": "Rasta Beach Club, a generative art PFP collection on the Ethereum blockchain, has announced a significant rise in the value of its collection since its fair launch in late 2022. With a floor price increase of 136% and a community growth of 31%, the Rasta Beach Club team is excited to announce the continued execution of its planned roadmap.\n\nThe Rasta Beach Club NFT collection features 10,000 unique pieces of generative art, each with its own distinct look and feel. The collection was launched via a free mint and quickly sold out, creating a strong demand for the NFTs. The team behind the project has been busy working on its promised roadmap, which includes exciting features such as an auto-whitelist for upcoming projects, metaverse hangout and live event spaces, and app experiences.\n\nThe team has already purchased metaverse property in Decentraland and has started design work. They are also working on delivering a social NFT discovery app for Android and IOS, which will give Rasta Beach Club NFT holders special access. The team is also preparing to launch its follow-up NFT collection, “The Good Time Pals,” on the Polygon blockchain. Rasta Beach Club NFT holders are auto-whitelisted into that upcoming project, and holders will also receive planned airdrops of special NFTs created specifically for them.\n\nArtekalabs founder Sean Anderson, the creator of the collection, said: “We are pleased with the growth and excitement around the collection and are enjoying building our promised roadmap to the delight of our enthusiastic and growing community.”\n\nThe Rasta Beach Club team is also excited to announce its upcoming holders-only Beach Club giveaway, which will provide an exclusive experience for NFT holders. The team encourages all Rasta Beach Club NFT holders to stay tuned for more information. The Rasta Beach Club NFT collection is available on OpenSea at http://artek.al/opc. For more information, visit the Rasta Beach Club website or follow them on Twitter @rastabeachclub.\n\nContact:\n\nMedia Relations\n\nRasta Beach Club NFT Collection\n\n[email protected]\n\nhttp://www.rastabeachclub.com/\n\nTweets by rastabeachclub"
    }
]