[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8yLXN0b2Nrcy13YXRjaC1ldGhlcmV1bS1zaG93cy0xMzMwMDA0NDMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "2 Stocks to Watch as Ethereum Shows Promise for 2024 - Yahoo Finance",
        "content": "While Bitcoin (BTC) has had a great 2023, so has Ethereum (ETH), the second-most traded and recognizable crypto coin in the world. Ethereum is known for its uses as a blockchain-powered, open-ended decentralized software platform and has risen 89.4% in value as of date in 2023.\n\nThe crypto behemoth has paved its path to winning over new customers by making a significant update this year, known as the Shanghai Upgrade. Under this upgrade, ETH shifted its blockchain validation system from proof-of-work to proof-of-stake and marked one of the most significant developments in the relatively short history of cryptocurrency.\n\nIn the proof-of-stake system, miners of Ethereum will rely on Ether holders, who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption.\n\nPowered by this development and what promises to be a significant 2024 for cryptocurrency, analysts around the world have turned bullish on it. There is a consensus that ETH might outperform BTC in 2024 with regard to growth rate and will gain more market share based on its proposals to reduce transaction costs and boost the number of transactions per second. In fact, its planned upgrade, called EIP-4844, might ensure that transaction costs could fall to as low as $0.01.\n\nPer Bitwise Asset Management, the world's largest crypto index fund manager, ETH revenues could double from 2023, up to $5 billion in 2024. Also, a state of fast-rising interest rates has not proven conducive to the crypto market. However, with markets widely betting on rate hikes having come to an end and the first rate cut as early as first-quarter 2024, the crisis for crypto may have been averted.\n\nEthereum has already started to make good of the state of the market, and it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection of two stocks that we believe should be tracked. These currently carry a Zacks Rank #2 (Buy) or 3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nStory continues\n\nAccenture plc ACN: This global system integrator that provides consulting, technology and other services markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nAccenture’s expected earnings growth rate for the current year is 4.6%. The Zacks Consensus Estimate for its current-year earnings has improved by 0.1% over the past 60 days. ACN currently carries a Zacks Rank #2.\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchange, offers a wide range of derivatives contracts and provides various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 14.7%. The Zacks Consensus Estimate for its current-year earnings has improved by 0.6% over the past 60 days. CME currently carries a Zacks Rank #3.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9qcG1vcmdhbi1ldGhlcmV1bS1vdXRwZXJmb3JtLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "JPMorgan Says ETH will Outperform Bitcoin: Will The Flippening Ever Happen? - CCN.com",
        "content": "Key Takeaways\n\nEthereum could do surpass Bitcoin in performance next year due to the upcoming Protodanksharding upgrade.\n\nThe JPM report says the potential impact of Bitcoin halving on its price is already factored into current valuations.\n\nJPMorgan analysts are stating that the approval of spot Bitcoin ETFs may not lead to a significant influx of new capital.\n\nJPMorgan’s crypto outlook for 2024 is marked by caution, particularly regarding Bitcoin (BTC). The financial institution perceives Bitcoin as being overbought, driven by what they consider “excessive optimism” surrounding the potential approval of a spot Bitcoin ETF.\n\nIts new report suggests Ethereum (ETH), currently the world’s second-largest cryptocurrency, may surpass Bitcoin, the largest, in performance next year.\n\nProtodanksharding To Drive Ethereum’s Growth\n\nThe report, authored by JPMorgan analysts including Nikolaos Panigirtzoglo, cites the anticipated Ethereum network upgrade, dubbed “Protodanksharding ,” as a key factor in this potential shift. This upgrade, expected in the first half of 2024, aims to significantly enhance the efficiency of the Ethereum network.\n\nAccording to the JPMorgan report, Protodanksharding is the primary catalyst for this expected outperformance. Analysts believe that this upgrade will be a significant step in improving the activity on the Ethereum network, thereby boosting its performance relative to Bitcoin.\n\nThe report also addresses the upcoming 2024 Bitcoin halving. It notes that current valuations already factor the potential impact on Bitcoin’s price into their predictions.\n\nJP MORGAN EXPECTS ETH TO OVERSHADOW BTC AFTER PUBLIC CRYPTO SHADE Is JP Morgan’s CEO having a change of heart? – JP Morgan analysts expect the forthcoming EIP-4844 upgrade or “Protodanksharding” to be immensely bullish for #Ethereum – \"Protodanksharding\" is essentially a… https://t.co/RZGGTqvsWj pic.twitter.com/Q6d3gjOGTj — BSCN (@BSCNews) December 15, 2023\n\nDespite speculations that the halving event would lead to a substantial price increase for Bitcoin, JPMorgan suggests that this is not a certainty and that Ethereum’s advancements could position it for stronger performance in comparison.\n\nThe report said: “Given the current ratio of the Bitcoin price to production cost is around x2.0 at the moment, this would imply that the 2024 Bitcoin halving event is largely in the price.”\n\nSpot Bitcoin ETFs May Not Boost Crypto Markets\n\nThe JPMorgan report presents a skeptical view on the potential impact of Bitcoin exchange-traded funds (ETFs).\n\nIt says the approval of spot Bitcoin ETFs by the U.S. Securities and Exchange Commission (SEC), anticipated in 2024, may not lead to a significant influx of new capital into the crypto markets. This is based on observations from Europe and Canada, where the approval of spot crypto ETFs did not substantially increase investor interest or capital flow into the volatile Bitcoin or Ethereum markets.\n\nA few months ago, JP Morgan wasn't feeling Ethereum, and now they're singing a bullish tune. pic.twitter.com/1yPiiA9FSs — fity.eth (@Fityeth) December 14, 2023\n\nGrayscale ETF Woes Loom\n\nJPMorgan analysts believe that the approval of Bitcoin ETFs could redirect investments towards existing Bitcoin-related products. These include Bitcoin mining companies, the Grayscale Bitcoin Trust, or Bitcoin futures ETFs.\n\nThis conversion could lead to investors seeking to capitalize on the SEC’s approval. This could result in up to $2.7 billion in losses for the Trust. Such a scenario is expected to exert “severe downward pressure” on Bitcoin’s price.\n\nPerfect timing for @JSeyff note today on why cash creates kill one \"superpower\" of ETFs, and how Grayscale would be hit hardest given they have sitting on tons of bitcoin they bought at lower prices that they'd have to sell. pic.twitter.com/3Uvji7mMya — Eric Balchunas (@EricBalchunas) December 14, 2023\n\nAdding to the cautious stance on cryptocurrencies, JPMorgan CEO Jamie Dimon expressed his negative view during a Senate banking committee hearing last week. Dimon stated his willingness to “close [crypto] down,” indicating a strong skepticism towards the cryptocurrency market.\n\nDimon said: “The true use case for it [crypto] is criminals, drug traffickers, money laundering, tax avoidance, I’ve always been opposed to crypto, Bitcoin, et cetera.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLW5hbWUtc2VydmljZS1ub3ctZnVsbHktZGVjZW50cmFsaXplZC1hcy1kYW8tdGFrZXMtY29udHJvbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Name Service now fully decentralized as DAO takes control - CryptoSlate",
        "content": "Ethereum Name Service (ENS) has achieved decentralized governance, according to a message from the project’s creator on Dec. 14.\n\nENS is a naming system for the Ethereum blockchain that adds human-readable names to various resources, including crypto wallets and websites. Until now, the project’s root node was managed by members of the Ethereum community.\n\nNick Johnson, ENS founder, endorsed the change in ownership. He wrote on X:\n\n“[This is] truly the end of an era. Here’s the message I just sent to the ENS root keyholders, requesting the transfer of the last of their powers to the DAO.”\n\nJohnson’s attached email stated that the Decentralized Autonomous Organization (DAO) of ENS, which is a governance group formed and controlled by ENS token holders, voted unanimously to acquire control of the project’s root node.\n\nHe said that, in response to those voting results, he created a transaction to execute two actions that transfer root control to the DAO address (wallet.ensdao.eth). He wrote that this transaction transfers all remaining multisig responsibilities to the DAO, thereby “retiring the multisig entirely.” It is unclear whether the other multisig owners have approved the transaction.\n\nIndividuals who previously managed ENS’ multisig include Chainlink’s Sergey Nazarov, Metamask’s Dan Finlay, MyCrypto’s Taylor Monahan, Colony’s Aron Fischer, the Ethereum Foundation’s Jason Carver and Martin Swende, and Johnson himself. Johnson addressed those individuals in his message, writing: “Thank you so much … for your service to ENS over the years.”\n\nENS governance will be more open\n\nENS’ DAO is a governance group comprising token holders that vote on decisions and issues related to the project by staking tokens.\n\nAccording to the latest proposal, the DAO already has several ownership responsibilities but did not have control over the core ENS root name until now.\n\nThe DAO will gain specific capabilities by controlling the ENS root. The ownership change will allow the DAO to create, manage, and permanently lock top-level domains apart from the permanent and unchangeable .eth domain. It will also allow the DAO to update reverse resolutions that map addresses back to a name. The DAO may also introduce primary domain names on layer-2 networks.\n\nA snapshot indicates that voting concluded on Dec. 15, 2023. Virtually 100% of the staked tokens, or 1.9 million ENS, were staked in favor of DAO ownership. Johnson was one of the largest voters, staking 155,000 ENS in favor. Less than 17 ENS tokens were staked against the plan or were used to abstain."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTEyLTE3L2lmLXlvdS1oZWxkLXlvdXItYml0Y29pbi1hbmQtZXRoZXJldW0tYWZ0ZXItZnR4LWNyYXNoLWl0LXMtY3J5cHRvbWFz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "If You Held Your Bitcoin and Ethereum After FTX Crash, It's Cryptomas! - Bloomberg",
        "content": "It's Merry Cryptomas, everybody! Bitcoin is up 167% year-to-date. Ethereum is up 91%. If a massive crypto rally was one of your predictions for 2023 a year ago, I take my hat off to you. Compare those returns with other asset classes. The NASDAQ is up 36%. The S&P 500 is up 19%. Gold is up 10.7%. If you were long oil or a broad basket of commodities, you are down 10%-12%.\n\nA year ago, many of us thought — I certainly did — that it was game over for crypto and that the naysayers were going to be vindicated."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vdGhvdWdodC1sZWFkZXJzaGlwL2V0aGVyZXVtLXJlc3Rha2luZy1pcy1nYWluaW5nLXN0ZWFtLW9ldGgtam9pbnMtZWlnZW5sYXllci_SAXFodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL3Rob3VnaHQtbGVhZGVyc2hpcC9ldGhlcmV1bS1yZXN0YWtpbmctaXMtZ2FpbmluZy1zdGVhbS1vZXRoLWpvaW5zLWVpZ2VubGF5ZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Restaking is Gaining Steam: OETH Joins EigenLayer - Finance Magnates",
        "content": "Ethereum staking has taken the space by storm since 2021’s Merge. The new proof-of-stake consensus mechanism allows anyone to participate in securing Ethereum’s network in exchange for a share of rewards primarily derived from transaction fees.\n\nSince launching, ETH staking has garnered tremendous demand from individuals and institutions alike. The advent of liquid staking tokens (LSTs) has further boosted adoption by drastically lowering barriers to entry. As a result, nearly 24% of ETH’s supply is now securing the network, making it highly resilient.\n\nHowever, novel networks struggle to build similar staking support. This means that they’re forced to develop their products without the same resources or robust security.\n\nEnter EigenLayer. Launched in June 2023, the bleeding-edge restaking protocol allows new chains and protocols to share ETH’s network security and strengthen their offerings. The tokenless protocol has seen impressive demand, garnering more than $260M in TVL thus far.\n\nKeep Reading Lisk Announces New Partnership with Indonesian Ministry of Communications & Informatics\n\nIn line with this growing interest, EigenLayer has onboarded a host of leading LSTs as collateral on the platform. Origin Ether (OETH), Ethereum’s second largest yield aggregator, is among the latest additions to the protocol, bringing restaking to a brand-new audience.\n\nHow Does Restaking Work?\n\nRestaking provides an avenue for developers to harness Ethereum’s robust security on novel chains and dApps.\n\nUsers can restake native staked ETH, LSTs, and ETH LP tokens on EigenLayer. These restaked assets are lent out to builders to provide a solid foundation for protocol security. Projects using restaked assets pay a premium for this service, which is distributed to restakers in the form of rewards.\n\nBeyond allowing projects to share ETH’s security, restaking also offers a unique opportunity for ETH stakers to compound their returns.\n\nIt’s important to note that restaking carries additional risks, as the same assets are being reused across multiple networks. As a result, restaked assets are exposed to heightened slashing risks, as each network carries its own set of rules and parameters.\n\nHowever, restakers are compensated for this risk in the form of heightened rewards.\n\nPreparing to Scale\n\nIn tandem with the addition of OETH and other LSTs, EigenLayer is raising its deposit cap on restaked assets. From Monday, users will be able to deposit a total of 200K ETH in assets per LST. However, should total LST deposits exceed 500K ETH, a pause mechanism will be activated.\n\nThis incremental approach allows EigenLayer to support new assets without compromising security.\n\nGiven the significant demand for EigenLayer’s services, it’s possible that the current caps may be reached soon after the new deposit caps go live.\n\nOETH’s EigenLayer Integration\n\nThe addition of OETH to EigenLayer is particularly exciting given Origin Ether’s rapidly expanding presence across DeFi. Since launching in May, OETH has garnered more than 30,000 ETH in TVL. The novel LSTfi protocol is backed by ETH and reserves of Lido stETH, Frax’s frxETH, and Rocket Pool’s rETH, offering LST holders a seamless platform to boost their returns.\n\nOETH’s incisive strategies generate yields well above base rewards rates for users, boasting a trailing 30-Day APY of over 6%.\n\nThe EigenLayer integration marks one of many milestones on OETH’s quest to become one of DeFi’s most integral money legos. Beyond restaking, OETH holders can also leveraged yield on Pendle Finance, and liquidity mine incentivized pools on Curve and Balancer.\n\nRestaking OETH via EigenLayer allows users to further compound their yield, while also participating in instruments at the very forefront of blockchain innovation.\n\nAs crypto continues its march toward mass adoption, primitives like restaking will be invaluable for new builders who lack the deep resources of established Ethereum projects. By harnessing OETH and leading LSTs for restaking, savvy investors could position themselves well for the sector’s future growth."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC1ldGhlcmV1bS1naXZlcy11cC1lYXJseS1nYWluLTEzOTYxOTnSAVhodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tcHJpY2UtZm9yZWNhc3QtZXRoZXJldW0tZ2l2ZXMtdXAtZWFybHktZ2Fpbi8xMzk2MTk5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Gives Up Early Gain - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiKmh0dHBzOi8vY29pbmRvby5jb20vaG93LXRvLXN0YWtlLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "How to Stake Ethereum? - Latest Cryptocurrency Prices & Articles",
        "content": "Crypto has come a long way since 2009, when Bitcoin was launched. So many things have changed, and thousands of new cryptocurrencies have been developed. Users now have endless options when it comes to crypto, blockchain, Web3, NFTs (Non-Fungible Tokens), mining, staking, yield farming, and many more. Even mentioning those crypto-related terms can show how much crypto has grown.\n\nWhile there are so many crypto projects on the market, some of them still remain in the spotlight thanks to their features, the many years they have been traded for, and the security and safety they provide. Among them, there is Ethereum, one of the cryptocurrencies that progressed the most and revolutionized many concepts in the crypto industry.\n\nSo, if you have been around for the littlest of time, you might have considered purchasing Ethereum. Are we right?\n\nAnd you may have also asked yourself what it takes to earn more by staking those ETH coins. Well, you are in the right place, as in this article, we will talk about Ethereum staking, its main requirements, benefits, and the best ways to stake your ETH.\n\nAbout Ethereum\n\nOfficially launched on July 30, 2015, by a team of 5 founders, Ethereum is the 2nd largest cryptocurrency by market cap after Bitcoin. Unlike some may think, Ethereum was not conceived with fast transactions in mind.\n\nHowever, the network’s initial developers, Vitalik Buterin, Jeffrey Wilck, and Gavin Wood, aimed to develop an ecosystem that can store decentralized applications (dApps) and help the DeFi industry evolve as much as possible.\n\nThe whitepaper of Ethereum, which was published in 2013, explained what dApps are, how they work, and how they can rely on the Ethereum blockchain. Currently, Ethereum is home to numerous decentralized applications and many other types of crypto projects, being the most developed blockchain.\n\nOver the years, Ethereum has passed through plenty of updates and new launches, but the most significant remains The Merge. While Ethereum first worked based on a PoW (Proof-of-Work) consensus mechanism, on September 15, 2022, the network switched to PoS (Proof-of-Stake), thus moving from mining to staking.\n\nThe Merge was a major change for Ethereum and came with various significant benefits, including reduced energy consumption. After switching from PoW to PoS, Ethereum’s energy consumption was reduced by approximately 99.95%, a tremendous decrease in carbon emissions.\n\nEthereum Staking\n\nOnce The Merge was completed, the Ethereum network moved to Ethereum 2.0, or the 2nd version of the blockchain. This way, users can now stake their ETH to earn staking rewards based on the amount of ETH they lock up and the lock-up period.\n\nStaking ETH implies using your coins to verify, secure, and validate transactions on the Ethereum network. Once a transaction is verified, you can receive a reward. That reward basically is the network fee required by the blockchain to complete that transaction.\n\nWhere and How to Stake Ethereum\n\nConsidering that Ethereum switched from Proof-of-Work to Proof-of-Stake, crypto enthusiasts can now stake their ETH coins.\n\nIt is widely known that, overall, the staking process is a little less complex than mining. Furthermore, you need less powerful (and expensive) hardware for staking than you do for mining.\n\nSo, many crypto investors were eager to start staking Ethereum once this was possible.\n\nAt the moment, there are multiple ways to stake ETH, and you have to choose the one that is most profitable and easy to complete, depending on your needs, holdings, and knowledge.\n\nThe most popular Ethereum staking options include solo staking, staking pools, staking through a centralized crypto exchange, or even SaaS (Staking as a Service).\n\nWe will take them one by one and highlight their features and advantages.\n\nStaking Ethereum on Crypto Exchanges\n\nThere are hundreds of cryptocurrency exchanges on the market, each one coming with new or improved features and products. Most of them also support Ethereum, among other cryptocurrencies, and some also allow users to stake their ETH tokens to improve the Ethereum network and earn extra coins.\n\nStaking on a crypto exchange is easier than you think. First, you have to sign up on a platform if you do not have an account already. Then, you should purchase ETH or move it from another platform. Afterward, all you have to do is select the amount of ETH you want to lock up and start staking it.\n\nTop Crypto Exchanges\n\nBinance\n\nBinance is the largest cryptocurrency exchange by trading volume, with over 168 million registered users. The platform is user-friendly, but it is most suitable for crypto investors who already have at least a little trading knowledge.\n\nBinance supports over 350 cryptocurrencies, including Ethereum (ETH). Furthermore, the platform allows users to stake their ETH coins on its platform. The minimum amount required is 0.1 ETH, and the reference APR varies, but it is approximately 3.5%. At the moment of writing, the reference APR was 3.22%.\n\nStaking ETH on Binance is as straightforward as possible. You do not need extensive knowledge of crypto to do this, and Binance is in to help its users stake their Ethereum coins by explaining the process on its official website.\n\nStep 1: Sign up on Binance\n\nFirst, if you do not have a Binance account, you should sign up. To do this, you will have to provide an email address, your phone number, and other similar information. However, Binance will never ask you to provide too much information, as it only requires what it needs to create your account.\n\nStep 2: Click on “Earn”\n\nOnce you are registered and signed in, you can go to the staking page. To do this, you will have to click on “Earn” from the top of the screen.\n\nStep 3: Click on Ethereum\n\nThen, you should see multiple cryptocurrencies available, each having a dropdown. Click on “Ethereum.”\n\nStep 4: Click on “ETH Staking”\n\nThen, you will see the staking option.\n\nStep 5: Start Staking Ethereum\n\nAfter you click on “ETH Staking,” you will be able to stake your Ethereum coins as desired. You will also notice the reference APR, the conversion ratio, and the total value staked on Binance.\n\nOf course, it is essential to note that you must hold ETH to stake it on Binance or any other platform. So, if you do not hold it yet, you can purchase it directly on Binance.\n\nCoinbase\n\nCoinbase is the 2nd largest crypto exchange on the market, being available almost worldwide and offering numerous trading services. Coinbase allows users to buy, sell, and trade over 250 cryptocurrencies through 2 main platforms: Coinbase Simple Trade and Coinbase Advanced Trade .\n\nStaking on Coinbase is pretty easy. The platform is user-friendly, and the staking feature is not significantly more complicated than other processes supported by the Coinbase exchange.\n\nOnce you have some ETH coins in your account, you can start staking it and earn ETH staking rewards. The estimated reward rate for Ethereum staking is 3.49%. Thus, depending on your holdings and the amount you lock up, you can earn approximately 3.49% of the amount of staked ETH.\n\nKraken\n\nKraken is one of the most trusted cryptocurrency exchanges, allowing users to buy, sell, and exchange over 220 cryptocurrencies, including the most popular, Bitcoin and Ethereum.\n\nAlthough the staking feature is a little affected at the moment by a lawsuit filed by the SEC against Kraken at the beginning of the year, the crypto exchange still offers staking for various cryptocurrencies, such as Ethereum (ETH), Cardano (ADA), Cosmos (ATOM), Polkadot (DOT), Polygon (MATIC), Solana (SOL), Tezos (XTZ), or Tron (TRX). However, it is essential to note that the feature is still not available for US citizens.\n\nStill, if you want to earn rewards by staking ETH, you can use Kraken, as the platform is extremely intuitive, so the process should not take too much. The yearly rewards for Ethereum staking range between 3% and 6%, depending on the amount of staked ETH and the period you decide to lock up your coins.\n\nCrypto Wallets\n\nStaking Ethereum through crypto wallets is as easy as with crypto exchanges. Things do not differ that much, the main requirement being to hold some ETH coins in your account. At the moment, numerous wallets allow users to stake ETH, some of the most popular being MetaMask and MyEtherWallet.\n\nMetaMask\n\nMetaMask may be one of the most popular cryptocurrency wallets on the market. It is available as a web browser extension (available on Chrome, Firefox, Brave, Edge, and Opera) and a mobile app (available on Android and iOS devices), and users usually praise the wallet for its user-friendliness. MetaMask allows you to stake crypto on both its extension and app.\n\nIn the app, for instance, you have to go to the “Explore” section and search for “MetaMask Portfolio.” Afterward, all you have to do is access the MetaMask dashboard and tap on “Stake.” Then, you can select Ethereum and choose a platform.\n\nAt the moment, you can choose from Lido and Rocket Pool. The rewards differ, too. Lido offers rewards of up to 3.83%, while Rocket Pool has a reward rate of approximately 3.65%.\n\nMyEtherWallet\n\nMyEtherWallet is one of the best Ethereum wallets on the market, supporting all ERC-20 and ERC-271 tokens. On MyEtherWallet, users can buy, sell, swap, and exchange crypto seamlessly, thanks to the user-friendly platform provided by the company. The wallet is free to use, and investors are required to support network fees.\n\nMyEtherWallet also allows users to stake ETH on the platform, offering 2 types of staking. Users can choose to run a validator node or stake smaller amounts of ETH through pooled or liquid staking.\n\nUsers can check their rewards on the MyEtherWallet platform, which is available on web and mobile devices. The rewards vary depending on the amount of staked ETH and the lock-up period.\n\nSolo Staking\n\nAlso called “native staking,” solo staking brings you the most significant rewards, but there is a catch: to be a solo staker, you have to get your own validator node, and this requires 32 ETH. Now, for some users, such an amount of crypto may be too much, considering that ETH exceeded $2,000.\n\nHowever, solo staking is quite profitable, and the hardware required for this type of staking is not that expensive, especially compared to the hardware you need to mine crypto.\n\nIf you decide to stake ETH on your own, you will have to do all the work. Solo Ethereum validators will have to wait a little bit more to earn rewards, as they also have to go through an activation process enforced by the protocol. The process might take a few days, but in some cases, it can also take a couple of weeks.\n\nOverall, solo staking is considered to be the least risky staking option, considering that you have full control over your staked ETH and validator rewards.\n\nStaking as a Service (SaaS)\n\nIf you hold at least 32 ETH and want to earn native block rewards but do not want to get directly involved with the staking process, you can choose SaaS (Staking as a Service). There are certain staking platforms that can manage the validator on your behalf.\n\nOf course, if you choose to do this through such staking services, you will have to pay a little commission to the company managing your validator. All in all, staking-as-a-service is a great option for those who aim to earn crypto through staking but do not have the time or the right hardware to do it themselves.\n\nOf course, once you give your ETH to a SaaS platform, the entire staking process becomes a little less safe. However, just like with any other crypto-related process, we strongly advise you to research the platforms available and choose the safest option.\n\nWith so many crypto platforms out there, you will surely find a trustworthy platform to manage the staking process for you.\n\nPooled Staking\n\nIf you do not have 32 ETH, you can join a staking pool, where users’ ETH coins are combined to get the total required for running a staking node. Pooled staking platforms offer many users the opportunity to join the Ethereum ecosystem without the burden of having to purchase 32 ETH (approximately $70,630).\n\nWhile the Ethereum network does not directly support pooled staking, there are various platforms that allow you to join staking pools in no time. This way, that platform will be responsible for activating and deactivating validators according to deposits and withdrawals. Furthermore, they will have to manage and ensure that it supports the pool.\n\nLiquid Staking\n\nLiquid staking is similar to pooled staking, but there are some differences worth considering. This staking method implies staking your coins into a pool, but the reward part is entirely different.\n\nIn liquid staking, rewards are distributed to users based on their percentage ownership. However, you will not receive tokens but transferable receipt tokens (also called liquid staking tokens). These tokens will act as proof of ownership and will allow you to withdraw your funds.\n\nKeep in mind that many consider liquid staking to be one of the riskiest staking methods, as it implies counterparty risks with the transferable receipt. However, once you get the ETH staked to a safe place, everything should be under control.\n\nFinal Thoughts\n\nStaking Ethereum is a great opportunity to earn passive income by locking up the coins you already hold for as much time as you want. With so many staking options, it may seem hard to choose the best option for your funds.\n\nSolo staking requires more advanced hardware and a minimum of 32 ETH to become a validator. However, with pooled or liquid staking, things get a whole lot easier.\n\nFurthermore, if you hold 32 ETH, you can choose staking-as-a-service, and a staking provider will manage your funds and complete the staking process.\n\nBesides, you can always consider staking through a crypto exchange or wallet, as many such platforms also provide staking services. On exchanges and wallets, things get a lot easier, but there is a possibility that the rewards will decrease once you choose such a staking method.\n\nShare this Post Twitter\n\nLinkedin\n\nFacebook\n\nReddit\n\n* The information in this article and the links provided are for general information purposes only and should not constitute any financial or investment advice. We advise you to do your own research or consult a professional before making financial decisions. Please acknowledge that we are not responsible for any loss caused by any information present on this website."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW1zLWRvbWluYW5jZS10by1wZXJzaXN0LWRlc3BpdGUtc29sYW5hcy1pbnZlc3Rvci1hcHBlYWwtY29pbmJhc2Utc2F5cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's dominance to persist despite Solana's investor appeal, Coinbase says - crypto.news",
        "content": "Although investors ‘have been heavily’ allocating to Solana throughout 2023, Ethereum will still be the top smart contracts platform in 2024, Coinbase says.\n\nIn a new report titled “2024 Crypto Market Outlook,” Coinbase noted that throughout 2023, net fund inflows to Solana-related (SOL) investment funds were second only to Bitcoin (BTC), surpassing Ethereum (ETH) and other multi-asset funds flows.\n\nAnalysts at the U.S.-based crypto exchange attributed the surge in Solana investment to the network’s ability to handle high transaction volumes and low fees, which they say are necessary to support a new wave of highly performant applications.\n\n“Indeed, we believe that improved transaction throughput and lower fees are necessary to improve UX to onboard a series of new use cases, and Solana has an early lead in that regard.” Coinbase\n\nDespite the growing popularity of Solana, Ethereum is still the most important smart contract platform in the cryptocurrency space, Coinbase noted. Processing an average of around 1 million transactions per day and maintaining a consistent daily transfer volume between $1 billion and $3 billion, Ethereum’s status as the top platform for decentralized applications “may not be displaced anytime soon,” Coinbase claims.\n\nAs of press time, ETH is trading at $2,280, demonstrating a 91% year-to-date increase, according to CoinGecko data. Solana’s SOL is trading at $78.3 with a staggering 697% increase in 2023.\n\nCoinbase noted, though, that while Ethereum’s dominance in the smart contract space is likely to persist in the near future, Solana’s scalability and performance could make it a viable alternative for some use cases in 2024.\n\nThe exchange’s experts added that in addition to Solana, a group of other layer-1 networks such as Aptos, Sui, Sei, and others are likely to increase competition in the space as they “handle scalability demands at the base layer.”\n\nFollow Us on Google News"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdS50b2RheS9wZXRlci1icmFuZHQtZW5kcy1ldGhlcmV1bS12cy1iaXRjb2luLWRlYmF0ZS13aXRoLXNjYXJ5LXByZWRpY3Rpb27SAVZodHRwczovL3UudG9kYXkvcGV0ZXItYnJhbmR0LWVuZHMtZXRoZXJldW0tdnMtYml0Y29pbi1kZWJhdGUtd2l0aC1zY2FyeS1wcmVkaWN0aW9uP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Peter Brandt Ends Ethereum vs. Bitcoin Debate With Scary Prediction - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLegendary trader and investor Peter Brandt has once again shown he is not a fan of Ethereum (ETH), with a mind-numbing forecast about the coin’s future. According to Peter Brandt, he did not foresee Ethereum living up to be a listed digital currency in the next 10 years, a rather gloomy projection for a coin that is currently the second largest, after Bitcoin (BTC).\n\nAdvertisement\n\nAt the time of writing, Ethereum is changing hands for $2,269.34, down 0.6% in the past 24 hours and by more than 3.7% in the trailing seven-day period. While Peter Brandt's decade prediction of Ethereum is a major concern to note, his differing position stems from the belief that the digital currency is not a worthy store of value.\n\nIn his post on X, Peter Brandt said ETH is not a comparable store of value when placed side by side with Bitcoin, and he acknowledged not understanding why traders often choose to HODL the coin.\n\nEther $ETH is not comparable to $BTC as a store of value. Why hodl ETH when you can hodl BTC\n\nAnd the functionality and gas price of ETH make the crypto a piece of junk\n\nMy prediction is that ETH may not even be a listed asset in 10 years https://t.co/4WQ7wnFWEO — Peter Brandt (@PeterLBrandt) December 14, 2023\n\nTo Peter Brandt, the bad functionality of Ethereum and the skyrocketing gas fees might eventually be its demise in the long run. With how relatively unusable ETH is, Brandt boldly labeled the asset as a \"piece of junk.\"\n\nEthereum on radar of most experts\n\nThe fact that Ethereum pioneered a different aspect of the industry makes it a subject of comparison for many experts in the space.\n\nBesides the gloom shared by Peter Brandt, Raoul Pal also waded into the Ethereum versus Solana debate recently. The top analyst labeled Ethereum as the Android of the crypto ecosystem while naming Solana as the iOS of the industry.\n\nUnlike Brandt, many experts foresee a brighter future for Ethereum, especially as it currently powers some of the most innovative layer-2 protocols in the industry, including Polygon zkEVM, Arbitrum (ARB) and Optimism (OP), among others."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1tYWludGFpbnMtZG9taW5hbmNlLWRlc3BpdGUtcmlzaW5nLWNvbXBldGl0aW9uLWZyb20tc29sYW5hLWNvaW5iYXNlLXNheXMv0gFvaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLW1haW50YWlucy1kb21pbmFuY2UtZGVzcGl0ZS1yaXNpbmctY29tcGV0aXRpb24tZnJvbS1zb2xhbmEtY29pbmJhc2Utc2F5cy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Maintains Dominance Despite Rising Competition from Solana, Coinbase Says - CryptoPotato",
        "content": "The latest report from Coinbase indicates that despite the emergence of competing networks like Solana, Ethereum remains the leading smart contract platform in the rapidly evolving world of cryptocurrency.\n\nEthereum presently accounts for around 57% of the total value locked in the cryptocurrency ecosystem, with its market capitalization being second only to that of Bitcoin.\n\nEthereum’s Resilient Position\n\nCoinbase’s 2024 Crypto Market Outlook reveals that Ethereum is still leading in the smart contract space.\n\nDespite the rapid expansion of Layer-2 scaling solutions and the emergence of new rollup stacks, Ethereum’s mainnet remains a hub of activity. The report highlights that these Layer-2 solutions are vying more with alternative Layer-1 platforms rather than detracting from Ethereum.\n\nNotably, the share of Ethereum (ETH) locked on rollup-linked bridges has surged, showing its steadfast position even as the landscape shifts.\n\nEchoing this sentiment, JPMorgan’s analysis projects a bright future for Ethereum. They predict a sustained market presence and a potential increase in Ethereum’s market share within the crypto ecosystem, possibly even outperforming Bitcoin.\n\nThis optimistic outlook is supported by the anticipated Proto-danksharding upgrade, set for release in the first half of 2024. This upgrade, pivotal for Ethereum’s scalability and efficiency, is particularly beneficial for Layer 2 networks like Arbitrum and Optimism.\n\nThe upgrade aims to improve the efficiency of these networks by promising to increase network throughput and decrease transaction fees.\n\nThe Rise of Solana\n\nOn the other hand, Solana has been getting attention for its potential rise. According to Finbold’s report, Solana is expected to continue its upward trajectory, potentially reaching 10% of Ethereum’s market cap, a milestone previously achieved.\n\nThis projection is based on Solana’s transaction speed and scalability, which outpaces Ethereum. Solana’s DeFi ecosystem has also been on a steady rise, reaching a new yearly peak in Total Value Locked (TVL).\n\nThese factors feed into the narrative that Solana might eclipse Ethereum in future bull markets, particularly in areas demanding high throughput, like decentralized exchanges and NFT marketplaces.\n\nThe crypto market’s landscape continues to diversify, with each platform establishing its niche based on distinct strengths and capabilities.\n\nEthereum’s anticipated upgrades and sustained dominance in the DeFi space solidify its position as a key player. However, the agility and scalability of Solana present a compelling narrative for its potential expansion in the years ahead."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1ob2xkcy0yMjAwL9IBQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1ob2xkcy0yMjAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Holds 100 SMA But Needs To Clear This For More Gains - NewsBTC",
        "content": "Ethereum price is consolidating above $2,250. ETH could start a fresh increase if there is a clear move above the $2,320 resistance zone.\n\nEthereum started a fresh increase above the $2,200 and $2,220 levels.\n\nThe price is trading above $2,240 and the 100-hourly Simple Moving Average.\n\nThere is a key rising channel with support near $2,275 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could start a steady increase if there is a close above $2,320 and $2,350.\n\nEthereum Price Eyes More Upsides\n\nEthereum price started a steady increase above the $2,180 resistance. ETH gained bullish momentum after there was a close above the $2,200 resistance.\n\nThe price even spiked above the $2,300 level and settled above the 100-hourly Simple Moving Average. A high was formed near $2,332 and the price is consolidating gains. There was a minor bearish wave below the $2,300 level. However, Ethereum is still above $2,240 and the 100-hourly Simple Moving Average.\n\nThere is also a key rising channel with support near $2,275 on the hourly chart of ETH/USD. The channel support and the 100 hourly SMA are close to the 23.6% Fib retracement level of the upward move from the $1,980 swing low to the $2,332 high.\n\nSource: ETHUSD on TradingView.com\n\nOn the upside, the price is facing resistance near the $2,320 level. The next key resistance is near the $2,350 level. The main resistance is still near $2,400. A clear move above the $2,400 zone could send the price toward the $2,500 level. The next resistance sits at $2,520. Any more gains could start a wave toward the $2,580 level.\n\nFresh Decline in ETH?\n\nIf Ethereum fails to clear the $2,320 resistance, it could start a fresh decline. Initial support on the downside is near the $2,275 level or the 100-hourly Simple Moving Average and the channel trend line. The next key support is $2,165.\n\nThe main support is now near $2,120 or the 61.8% Fib retracement level of the upward move from the $1,980 swing low to the $2,332 high. A downside break below $2,120 might start another major decline. In the stated case, Ether could revisit the $2,000 support.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,275\n\nMajor Resistance Level – $2,320\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbmdhcGUuY29tL3BldGVyLWJyYW5kdC1zdGlycy1kZWJhdGUtd2l0aC1oYXJzaC1jcml0aXF1ZS1vZi1ldGhlcmV1bS_SAVNodHRwczovL2NvaW5nYXBlLmNvbS9wZXRlci1icmFuZHQtc3RpcnMtZGViYXRlLXdpdGgtaGFyc2gtY3JpdGlxdWUtb2YtZXRoZXJldW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum News: Peter Brandt Stirs Debate with Harsh Critique of Ethereum - CoinGape",
        "content": "In the ongoing debate of Bitcoin versus Ethereum, renowned market trader Peter Brandt has expressed significant doubts about Ethereum’s future, contrasting sharply with other market experts. Brandt, known for his blunt analysis, questioned Ethereum’s long-term viability, particularly in comparison to Bitcoin.\n\nPeter Brandt Predicts Dim Future for Ethereum\n\nBrandt, a respected figure in market trading circles, has openly criticized Ethereum, challenging the popular notion that it might soon outpace Bitcoin. He raised a fundamental question regarding investors’ preference for Ethereum over Bitcoin, which he sees as a superior store of value. His comments come amidst bullish forecasts from other market experts and institutions, including JPMorgan. These predictions often highlight Ethereum’s potential growth, especially with its upcoming EIP-4844 upgrade, also known as Protodanksharding.\n\nadvertisement\n\nHowever, Brandt’s skepticism about Ethereum is rooted in its structural and functional aspects. He specifically pointed out the high transaction fees, or ‘gas fees,’ associated with Ethereum, labelling the digital currency as inefficient. These fees, in his view, severely detract from Ethereum’s value as an investment asset. Furthermore, he controversially suggested that Ethereum might lose its relevance entirely within the next decade.\n\nEthereum’s Fate Tied to Key Price Level\n\nBrandt’s stance starkly contrasts with other leading analysts like Raoul Pal, who have a more favorable outlook on Ethereum. Despite differing opinions, Brandt acknowledged his respect for these analysts but did not waver from his critical perspective.\n\nIn his analysis, Brandt emphasized the importance of the ETH/BTC price chart. He pointed out that Ethereum’s future could hinge on its performance relative to Bitcoin, specifically if it manages to maintain above the 0.04803 level. Should this level hold, Brandt conceded that the “imminent funeral” for Ethereum could be postponed, albeit temporarily.\n\nThis isn’t the first time Brandt has expressed skepticism about Ethereum. In previous statements, he has questioned its decentralization and even referred to it as a “piece of crap” cryptocurrency. His consistent critique of Ethereum has been a topic of discussion in trading circles, influencing perceptions among investors.\n\nRead Also: Ethereum Price Prediction As Bull Trap Puts $ETH At Risk of 12% Drop"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vdGhldG9rZW5pemVyLmlvLzIwMjMvMTIvMTUvZXJjMzY0My10b2tlbi1zdGFuZGFyZC1hY2hpZXZlcy1maW5hbC1zdGF0dXMtaW4tZXRoZXJldW0taW1wcm92ZW1lbnQtcHJvcG9zYWwv0gF1aHR0cHM6Ly90aGV0b2tlbml6ZXIuaW8vYW1wLzIwMjMvMTIvMTUvZXJjMzY0My10b2tlbi1zdGFuZGFyZC1hY2hpZXZlcy1maW5hbC1zdGF0dXMtaW4tZXRoZXJldW0taW1wcm92ZW1lbnQtcHJvcG9zYWwv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "ERC3643 Token Standard Achieves ‘Final’ Status in Ethereum Improvement Proposal - The Tokenizer",
        "content": "In a new development for the tokenization ecosystem, the ERC3643 standard has achieved ‘Final’ status in its Ethereum Improvement Proposal (EIP). The EIP process, essential for proposing and implementing upgrades, features, and standards, has seen the ERC3643 standard join the ranks of influential protocols like ERC20 and ERC721. What sets ERC3643 apart is its specialization in compliant tokenization, addressing the limitations of the widely-used ERC20 standard, particularly in the realm of securities activities.\n\nUnlike ERC20, ERC3643 integrates controlled advanced functions and compliance modules, making it the permissioned token standard for a wide array of use cases, including securities, real-world assets, payment systems, and loyalty programs. The standard dynamically verifies user eligibility through a self-sovereign identity (SSI) framework, ensuring compliance via anonymous but verifiable credentials. This empowers token issuers with continuous control over tokens, facilitating governance and adherence to regulatory requirements.\n\nThe association emphasizes that achieving ‘Final’ status for ERC3643 is a testament to their commitment to providing a robust standard for enterprises seeking to deploy permissioned tokens on any EVM-compatible blockchain efficiently and compliantly. This achievement is poised to enhance collaboration and interoperability, aligning with the overarching goals of the Ethereum ecosystem.\n\nThe ERC3643 standard is positioned to redefine how enterprises engage with blockchain technology, offering a secure and compliant framework for tokenizing diverse assets. Its recognition as an official standard underscores the Ethereum community’s dedication to meeting the diverse needs of its users and establishing a benchmark for institutions looking to leverage ERC3643 for their tokenization initiatives.\n\nFor those interested in delving deeper into the ERC3643 EIP, further information is available on the association’s platform.\n\nAbout ERC3643 Association\n\nThe ERC3643 Association is a non-profit organization regrouping industry leaders within a shared mission to advance the adoption of the ERC3643 standard and promote the development of a standardized, secure, and compliant tokenization framework. The association brings together the expertise and resources of its members to foster collaboration, drive innovation, and create a more inclusive, efficient, and secure financial landscape. By supporting the widespread adoption of the ERC3643 standard, the association aims to unlock the full potential of tokenization and pave the way for a new era of global asset management.\n\nRead other stories: Pave Bank Emerges with $5.2 Million Funding to Pioneer Programmable Banking\n\nProject Diamond Launches Smart Contract Platform for Digitally Native Assets"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXdoYWxlLXJlc3VyZmFjZXMtaW5pdGlhdGVzLW1ham9yLXNlbGwtb2ZmL9IBTGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXdoYWxlLXJlc3VyZmFjZXMtaW5pdGlhdGVzLW1ham9yLXNlbGwtb2ZmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Whale Resurfaces, Initiates Major Sell-Off - CoinGape",
        "content": "After a year of dormancy, a significant Ethereum whale has reemerged, creating ripples in the cryptocurrency market, with Lookonchain reporting this unexpected move. The whale, silent for over twelve months, initiated a substantial selling spree, offloading 18,865 ETH for a staggering 42 million DAI through four newly created wallets. This activity translates to an average selling price of $2,229 per ETH.\n\nThe market has been abuzz with speculation and analysis following this development. The revived whale’s actions have led to the sale of a considerable amount of Ethereum, amounting to a current value of $12.5 million, with 5,588 ETH remaining in their possession. This event has caught the attention of both investors and analysts, given the significant amount of cryptocurrency involved and its potential impact on the market.\n\nadvertisement\n\nContrasting Whale Behaviors\n\nThis selling trend by a dormant whale contrasts sharply with the behaviours observed in other segments of the Ethereum whale community. Crypto analyst Ali highlighted a contrasting scenario where several of the largest Ethereum whales have been actively accumulating ETH.\n\nETH/USD price chart\n\nOver the past week, these whales have reportedly added over 100,000 ETH, valued at approximately $230 million, to their holdings. This divergence in strategies underscores the varied approaches and sentiments prevalent among significant investors in the Ethereum ecosystem.\n\nEthereum’s Current Market Position\n\nAmidst these developments, Ethereum’s market performance remains a focal point. At the time of reporting, ETH experienced a slight upturn, with a 1.12% increase over the last 24 hours, bringing its value to $2,255.\n\nIntoTheBlock data suggests that Ethereum is trading in a crucial zone, with significant support and resistance levels identified. The $2,332 and $2,403 price points are key barriers in ETH’s potential ascent towards the $3,000 mark, while support is around $2,127.\n\nMoreover, Ethereum’s transaction fees continue to play a critical role in its market dynamics. The past week saw approximately 35,000 ETH burned, continuing a trend of negative net issuance that started in early November. These factors collectively contribute to the ever-changing landscape of Ethereum’s market as investors and analysts closely watch these developments unfold.\n\nRead Also: XRP Ledger (XRPL) Hosts Phase 2 of Palau Stablecoin Project"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1yYWxseS1zZXRzLWEtMTUtanVtcC_SAVBodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tcmFsbHktc2V0cy1hLTE1LWp1bXAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction As Post-Correction Rally Sees 15% Jump Ahead - CoinGape",
        "content": "Ethereum Price Prediction: The cryptocurrency market witnessed a surge in volatility as the digital assets Bitcoin and Ethereum entered into a minor correction. This pullback has plunged the ETH price from a recent top of $2400 to $2238, registering a 7.4% loss. However, this retracement lies within the range of a rising channel pattern and projects the recovery is intact.\n\nAlso Read: Peter Brandt Stirs Debate with Harsh Critique of Ethereum\n\nadvertisement\n\nChannel Pattern Hints Next Jump Above $2500\n\nA channel pattern leads the current recovery trend in the ETH price\n\nUntil the pattern’s lower trendline is intact, the coin holders can enjoy the bull rally\n\nThe intraday trading volume in Ether is $10.2 Billion, indicating a 78% gain.\n\nSince mid-October, Ethereum (ETH) has shown a robust recovery, beginning with a rebound from the $1522 support level. This rally is best understood through the lens of a channel pattern, characterized by two ascending trendlines that have been providing dynamic resistance and support to the price movements.\n\nOn December 13th, the Ethereum price marked its latest recovery from the lower trendline of this pattern, evidenced by a morning star candle formation. This reversal propelled the price to its current level of $2243, signaling the onset of a new bull cycle within the confines of the channel pattern.\n\nIf the ETH price continues to adhere to the trajectory set by this channel pattern, we could see a 12-15% surge, potentially reaching the upper trendline in the region of $2500 to $2600. As long as these two trendlines remain intact, Ethereum is likely to maintain its upward trajectory, albeit with minor pullbacks along the way.\n\nHowever, a breakout above the channel’s resistance could significantly amplify buying momentum, potentially leading to a more substantial recovery. In such a scenario, initial targets could be set at $2730, with a further potential rise to $3260, marking key milestones in Ether’s bullish journey\n\nCan ETH Price Fall Back to $2000\n\nWhile the current market outlook for Ethereum price seems strongly bullish, the rising channel pattern in a strong rally can commonly lead to a decisive breakdown from the lower trendline. This breakdown would likely intensify the selling pressure and trigger a significant correction in ETH price. Thus, under the influence of this pattern, the Ethereum coin may revisit $2000 coin again\n\nBollinger band: Despite the current retracement in the upper boundary of the Bollinger band indicator , indicates the recovery momentum is active.\n\nRelative Strength Index: A lower high formation in the daily RSI slope reflects the weakening of buyers’ strength in the market."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLXNob2NraW5nbHktZmxpcHMtZXRoZXJldW0tZXRoLWluLWRleC12b2x1bWXSAUpodHRwczovL3UudG9kYXkvc29sYW5hLXNvbC1zaG9ja2luZ2x5LWZsaXBzLWV0aGVyZXVtLWV0aC1pbi1kZXgtdm9sdW1lP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Solana (SOL) Shockingly Flips Ethereum (ETH) in DEX Volume - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThere is an ongoing dramatic shift in the decentralized finance (DeFi) world as power is changing hands between Solana (SOL) and the de facto industry leader Ethereum (ETH). Over the past 24 hours, data from DefiLlama shows that Solana has flipped Ethereum in total decentralized exchange (DEX) volume for the first time in history.\n\nAdvertisement\n\nThe data shows that Solana has recorded an impressive boost of $1.536 billion in 24 hours, while Ethereum has amassed only $1.164 billion. The weekly change in Solana comes in at 54.21% at the time of writing, while Ethereum suffered more than an 8% decline. This impressive flipping has been labeled by many as a rare occurrence, with Solana founder Anatoly Yakovenko acknowledging his disbelief at the huge milestone.\n\nSolana's growth tempo has been encompassing thus far this year as it previously surpassed Ethereum in the NFT sales stat. While the digital currency has the highest growth margin in the year-to-date (YTD) period among the cryptocurrencies in the top 15, it achieved this run at a time when its future was destabilized following the implosion of FTX and the accompanying SOL sell-offs.\n\nWhile the daily flipping has been recorded, Solana now sets sight on outranking XRP in market cap and Ethereum in total value locked (TVL) and cumulative volume.\n\nSolana price outlook\n\nSolana's price is shockingly buckling under its own weight with a menacing sell-off. At the time of writing, Solana is changing hands at a price of $74, down by 5.65%, according to data from CoinMarketCap.\n\nThe ongoing sell-off is reflected in the 5.5% slump in market cap to $31,636,851,169 and the over 20% drop in trading volume to $2,358,903,714. While the sell-off is a major concern, Solana is still relatively in a better place with the price generally trading at its highest level for the year.\n\nSolana's year-to-date growth is 657%, and many see the current price drop as a healthy correction."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbmdhcGUuY29tL3NvbGFuYS1mbGlwcy1ldGhlcmV1bS1kZXgtdm9sdW1lLWFzLXNhZ2EtbW9iaWxlLWdldHMtc29sZC1vdXQtYm9uay1wcmljZS1yYWxseS_SAWhodHRwczovL2NvaW5nYXBlLmNvbS9zb2xhbmEtZmxpcHMtZXRoZXJldW0tZGV4LXZvbHVtZS1hcy1zYWdhLW1vYmlsZS1nZXRzLXNvbGQtb3V0LWJvbmstcHJpY2UtcmFsbHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Solana News: Solana Flips Ethereum DEX Volume Amid Saga Mobile Sold Out & BONK Rally - CoinGape",
        "content": "Solana News: Solana makes history by surpassing Ethereum in 24-hour decentralized exchange (DEX) volume for the first time since its launch in 2020, grabbing the attention of crypto leaders and enthusiasts. The Solana community celebrates this milestone as all Saga Mobile are sold out and meme coin Bonk breaks multiple records.\n\nSolana Flips Ethereum in DEX Volume\n\nSolana chain has surpassed Ethereum chain in DEX volume for the first time in history, according to DeFiLlama data as of December 16. The Solana proof-of-stake (PoS) blockchain was founded by Solana Labs, which was co-founded by Anatoly Yakovenko and Raj Gokal in 2018.\n\nadvertisement\n\nNumerous factors contributed to the achievement of the milestone. It includes massive buying of Solana Mobile, huge trading volumes on Solana-based dog-themed meme coin Bonk, and bullish sentiment on the Solana ecosystem.\n\nCircle CEO Jeremy Allaire calls it a “big day for Solana” as it flips Ethereum and Saga Mobile gets sold out. Solana’s Raj Gokal also reacted to these milestones, saying “Incredible milestone. 6 years in, just getting started!”\n\nAnatoly Yakovenko said he agrees that Solana is better than Ethereum and developers have contributed immensely to the success of Solana. The ecosystem is underway for further improvements with “Solana DeFi 2.0.”\n\nAlso Read: US SEC To Inspect Binance.US Technical Infrastructure, Systems And Software\n\nSolana And BONK Price Action Amid Bullish News\n\nSOL price rallied 15% in a month and hit a high of $79.15. Solana currently trades at $74. The 24-hour low and high are $71.57 and $79.15, respectively. Furthermore, the trading volume has slightly decreased in the last 24 hours. to $1,840,546,027, indicating a rise in interest among traders.\n\nMeanwhile, BONK price fell 22% in the last 24 hours after a 1000% rally in a month, with the price currently trading at $0.0000231. The 24-hour low and high are $0.0000220 and $0.0000315, respectively. The trading volume is still increasing in the last 24 hours.\n\nCoinbase, Binance, and other exchanges listed BONK this week, with experts suggesting a further rally in BONK price.\n\nAlso Read: Tether Collaborates With US Regulators For Robust Crypto Security"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLWRlY2VtYmVyLTE10gE_aHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1wcmljZS1hbmFseXNpcy1mb3ItZGVjZW1iZXItMTU_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for December 15 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe bounce back has not lasted long as most of the coins are again in the red zone.\n\nAdvertisement\n\nTop coins by CoinMarketCap\n\nETH/USD\n\nThe rate of Ethereum (ETH) has fallen by almost 1% over the last 24 hours.\n\nImage by TradingView\n\nOn the hourly chart, the price of ETH might have set a local support level at $2,243. If the daily bar closes near that mark, there is a chance to see a breakout, followed a further decline to the $2,000 zone.\n\nImage by TradingView\n\nBulls could not keep the rise going after yesterday's bullish candle. If the situation does not change until the end of the day, the correction may continue to the nearest support level of $2,145.\n\nImage by TradingView\n\nOn the weekly time frame, the rate of ETH might need time to accumulate energy before a further sharp move.\n\nIn this case, sideways trading between $2,100-$2,300 is the more likely scenario for the second part of the month.\n\nEthereum is trading at $2,246 at press time."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1jb21tdW5pdHktYWRvcHRzLWVyYy0zNjQzLXN0YW5kYXJkLWNvbXBsaWFudC1hc3NldC10b2tlbml6YXRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum community adopts ERC-3643 as standard for compliant asset tokenization - Cointelegraph",
        "content": "The Ethereum community has officially signed off on the ERC-3643 Ethereum Improvement Proposal (EIP), establishing it as a recognized standard for compliant tokenization of real-world assets (RWAs).\n\nAccording to a Dec. 15 announcement, the proposal reached its final status, meaning it has been formally reviewed, discussed and agreed upon within the Ethereum community. It’s a similar process to the way ERC-20 and other popular standards were established in the past.\n\nEthereum Community Approves #ERC3643 as the First #Tokenization Standard\n\n\n\nWe're proud to announce that the ERC3643 standard has achieved 'Final' status in its #Ethereum Improvement Proposal (#EIP).\n\n\n\nRead more here: https://t.co/Z4XzijY6se#RWA pic.twitter.com/DhR3XmGrVU — ERC3643.org (@ERC3643Org) December 15, 2023\n\nERC-3643 is a standard for securities tokenization, RWAs, payment systems and loyalty programs. It verifies users’ eligibility for a token via a self-sovereign identity (SSI) framework, providing anonymous yet verifiable credentials, the association behind the proposal explained.\n\nThe approved standard, which was proposed in 2021, is built on top of ERC-20 and incorporates two distinct permission layers to enhance security and compliance.\n\nThe first layer focuses on the identity and eligibility of the transaction’s receiver, utilizing ERC-734/-735 standards to verify if the necessary claims are present on the identity and are authenticated by trusted claim issuers. The second layer implements global restrictions on the token itself, such as limits on daily token volume and the maximum number of token holders, providing controlled and regulated token circulation.\n\nAsset tokenization involves converting the value of a physical or digital asset into a digital token on a blockchain or distributed ledger. Possible benefits of asset tokenization include increased liquidity, faster settlements, transparency and accessibility to various markets. Real-world applications include enabling fractional trading of real estate, art, financial assets and intellectual property.\n\nManagement consulting firm Roland Berger estimates that asset tokenization will have grown to a market worth $10 trillion by 2030, a significant rise from the current value of around $300 billion.\n\nAsset tokenization is being considered by a wide range of traditional and crypto-native firms as one of the main trends in finance. Notable companies exploring the technology include JPMorgan, Goldman Sachs and Societe Generale. Data from VanEck Research shows the total market capitalization for RWAs reached $342 billion in September despite the crypto industry’s headwinds.\n\nMagazine: Beyond crypto — Zero-knowledge proofs show potential from voting to finance"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdS50b2RheS9kb3JtYW50LWV0aGVyZXVtLXdoYWxlLWNvbnRpbnVlcy10by1zZWxsLWV0aC1ob2xkaW5ncy1kZXRhaWxz0gFRaHR0cHM6Ly91LnRvZGF5L2Rvcm1hbnQtZXRoZXJldW0td2hhbGUtY29udGludWVzLXRvLXNlbGwtZXRoLWhvbGRpbmdzLWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Dormant Ethereum Whale Continues to Sell ETH Holdings: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nOn-chain analytics firm Lookonchain has drawn attention to a dormant Ethereum whale that is back to life after being inactive for a year.\n\nAdvertisement\n\nShortly after reviving, the dormant ETH whale went on a major selling binge: 18,865 ETH have been sold so far for 42 million DAI through four new wallets, with an average selling price of $2,229.\n\nA whale that has been dormant for 1 year is dumping $ETH on #DEX!\n\n\n\nSo far, 18,865 $ETH has been sold for 42M $DAI through 4 new wallets, the average selling price is $2,229.\n\n\n\nAnd currently has 5,588 $ETH($12.5M) left. pic.twitter.com/K6znM7pxxh — Lookonchain (@lookonchain) December 16, 2023\n\nAt the time of Lookonchain's reporting, the whale had 5,588 ETH worth $12.5 million remaining.\n\nDuring the week, as reported, a dormant Ethereum whale came back to life after more than three years of inactivity, depositing 5,000 ETH worth around $11.3 million to Coinbase shortly after.\n\nHowever, it should be kept in mind that the activities of one or two Ethereum whales may not represent the sum of Ethereum whale activity.\n\nIn contrast to the selling spree that these whales have been on, several ETH whales have been accumulating.\n\nCrypto analyst Ali reports that some of the largest Ethereum whales have been on a buying spree, acquiring over 100,000 ETH worth $230 million in the last week.\n\nEthereum (ETH) price action\n\nAt the time of writing, ETH was down 1.33% in the last 24 hours to $2,244. According to IntoTheBlock data, Ethereum trades in a crucial zone ranging from $2,216 to $2,302. Here, over 263,550 addresses hold nearly 2.9 million ETH.\n\nOn the upside, the $2,332 and $2,403 levels represent intermediate short-term barriers to ETH's price advance to $3,000. On the other hand, short-term support is envisaged at $2,127.\n\nAccording to IntoTheBlock, Ethereum's fees have remained high this week, affecting supply. Ethereum has burned approximately 35,000 ETH in the last seven days, continuing its negative net issuance pattern that began in early November."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY3J5cHRvLm5ld3MvYmxvb21iZXJnLWV4cGVydC1iaXRjb2luLWV0Zi1hcHByb3ZhbHMtYW50aWNpcGF0ZWQtaW4tamFudWFyeS1ldGhlcmV1bS1pbi11bmlxdWUtcG9zaXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bloomberg expert: Bitcoin ETF approvals anticipated in January; Ethereum in unique position - crypto.news",
        "content": "In a recent episode of The Scoop podcast, Bloomberg Intelligence analysts James Seyffart and Eric Balchunas predict a high likelihood of the SEC approving a series of spot Bitcoin ETFs between Jan. 5-10.\n\nSeyffart and Balchunas’s prediction aligns with the final deadline for the ARK and 21Shares application, initially filed in April, preceding other major players like BlackRock in June in a competitive field of 12 firms.\n\nSeyffart speculates that the Securities and Exchange Commission (SEC) has been strategically delaying decisions, possibly to align multiple approvals simultaneously. This approach would prevent any single firm from gaining an unfair advantage. Seyffart warns that if the SEC were to deny these applications, it would represent a significant shift in its approach, akin to “going nuclear.”\n\nhttps://twitter.com/Ashcryptoreal/status/1735690467126169851\n\nYou might also like: Goldman Sachs forecasts dramatic surge in blockchain asset trading volumes by 2025\n\nThe SEC’s reluctance to play kingmaker in the cryptocurrency ETF arena reflects its efforts to maintain neutrality and fairness. Seyffart, citing various sources, believes that the SEC’s pattern of behavior, especially observed during the approval of ether futures ETFs earlier this year, indicates a likelihood of mass approval of Bitcoin spot ETFs.\n\nThe conversation also touched on Grayscale Investments’ victory against the SEC, which could influence the approval of its Grayscale Bitcoin Trust (GBTC) product into a spot Bitcoin ETF. Seyffart notes that this case has backed the SEC into a corner, potentially accelerating approvals.\n\nHowever, the path for spot ether ETFs appears more complex, given the differences in market robustness and underlying technologies between Bitcoin (BTC) and Ethereum (ETH). While optimistic, Seyffart suggests that approvals for ether spot ETFs are more likely towards the end of May 2024, yet with less certainty compared to Bitcoin ETFs.\n\nYou might also like: SEC is taking ‘new look’ at spot Bitcoin ETF applications\n\nSeyffart also explains that following the SEC’s 19b-4 process approval, ETFs “must have their S-1 prospectuses cleared by the SEC’s Corporate Finance division before trading can commence.” This process could introduce delays, adding to the uncertainty of a precise timeline for the ETFs’ market debut.\n\nSeyffart anticipates a cautious initial uptake regarding market reception due to the rigorous due diligence processes of major brokerages and banks. However, he predicts that BlackRock might expedite the inclusion of these ETFs on various platforms, given its strong industry relationships.\n\nNice find here: Gensler's staff met with BlackRock yesterday to talk $IBTC but it wasn't normal crew, more public policy folks incl BlackRock's Public Policy Director Ben Tecmire who btw used to be senior counsel at the SEC's Division of Inv Mgmt https://t.co/bMePGpOufK — Eric Balchunas (@EricBalchunas) December 15, 2023\n\nSeyffart expressed confidence in the long-term success of these ETFs, projecting substantial capital inflows driven by both hype and the strategic interests of major asset owners.\n\nFollow Us on Google News"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtcHJpY2UtZWRnZXMtdG93YXJkLTI1MDAtc3VyZ2Utb3ItbWlyYWdlLWFoZWFk0gFLaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtcy1wcmljZS1lZGdlcy10b3dhcmQtMjUwMC1zdXJnZS1vci1taXJhZ2UtYWhlYWQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's Price Edges Toward $2,500: Surge or Mirage Ahead? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum market has recently witnessed a tempting approach toward the $2,500 mark. However, this price movement occurs amid a less-than-ideal backdrop for its decentralized finance (DeFi) sector, which is currently struggling and showing no imminent signs of regaining its lost positions.\n\nAdvertisement\n\nThe underperformance of Ethereum's DeFi sector can be attributed to several factors, one of which is the soaring transaction fees that have rendered the layer-1 platform challenging for average users.\n\nNetwork fees have escalated to levels that are widely considered unreasonable, severely impacting usability. In response to these persistent issues, Ethereum cofounder Vitalik Buterin has hinted at the integration of zero-knowledge Ethereum Virtual Machine (zkEVM) scaling solutions directly into the mainnet, an advancement eagerly anticipated by the community.\n\nAmid Ethereum's challenges, competitors like Solana are capturing attention, with its platform maintaining lower fees and higher transaction throughput. This competition has intensified the pressure on Ethereum to enhance its scalability and efficiency to maintain its leading position in the blockchain space.\n\nEthereum's price action offers a compelling narrative. The chart illustrates a notable uptrend, with the price having recently surged above multiple key moving averages, a bullish indicator for many traders. The convergence of the 50-day moving average above the 100-day and 200-day moving averages could suggest sustained bullish momentum. However, this positive trend is met with caution as the Relative Strength Index (RSI) hints at a market that is neither overbought nor oversold, leaving room for volatility.\n\nThe chart also reveals that Ethereum has encountered resistance as it approaches the $2,500 level. This resistance zone is critical, and a convincing breakout above it could signal the start of a new rally. However, with the current strain on Ethereum's DeFi ecosystem and the competitive heat from blockchains like Solana, the potential for a breakthrough to $2,500 is enveloped in uncertainty.\n\nBONK's meteoric meme rise\n\nThe meteoric rise of Bonk (BONK) has sent ripples across the crypto industry, with its valuation reaching the billion-dollar mark and positioning it as a serious contender in the meme coin space. The recent listings on Coinbase and Binance, two of the largest cryptocurrency exchanges, have played a pivotal role in propelling BONK to new heights, reminding us of the astonishing ascent of Shiba Inu (SHIB) during the previous year's bull run.\n\nThe price chart for BONK displays a sharp upward trajectory, indicating a frenzied accumulation phase that often accompanies a new listing's excitement. Such price action is not uncommon for meme coins, which can capture the imagination of the trading community and lead to explosive short-term gains. The high social media buzz and community backing seem to reinforce the potential of BONK as the next viral sensation.\n\nHowever, seasoned market observers and analysts caution that the meme coin sector is notorious for its boom-and-bust cycles. As BONK's market cap has eclipsed that of other well-known meme tokens like Dogecoin (DOGE) and PEPE, comparisons to SHIB's rise are inevitable. Yet, there is an air of skepticism about whether BONK can maintain this blistering pace or if it will succumb to the same fate that befalls many high-flying tokens after the initial euphoria fades.\n\nIt is also important to stay extremely cautious when interacting with assets like Bonk: meme coins often experience significant corrections after such rapid expansions in price. The historical performance of similar assets suggests that BONK could face a challenging road ahead, especially if broader market sentiment shifts. While the dream of dethroning SHIB as a top meme coin is alive, the path is fraught with the potential for high volatility and sudden market turns."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtZGVuY3VuLXVwZ3JhZGUtZXRoLWRldmVsb3BlcnMtcmV2ZWFsLW1ham9yLW1pbGVzdG9uZS1hcy0yMDIzLWJvd3Mtb3V00gFjaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtcy1kZW5jdW4tdXBncmFkZS1ldGgtZGV2ZWxvcGVycy1yZXZlYWwtbWFqb3ItbWlsZXN0b25lLWFzLTIwMjMtYm93cy1vdXQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's Dencun Upgrade: ETH Developers Reveal Major Milestone as 2023 Bows Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAs reported by Christine Kim, the vice president of research at Galaxy, Ethereum developers are teasing a key step as regards the Dencun upgrade before the end of 2023.\n\nAdvertisement\n\nPer a report detailing the latest Ethereum All Core Developers Consensus Call, Ethereum developers stated that they are on track to launch a Goerli shadow fork testing the Cancun/Deneb upgrade with all clients within the next one to two weeks.\n\ngm, here with another update on the eth cancun/deneb upgrade:\n\n- devnet #12 now hosts all EL/CL client combinations, incl. prysm\n\n- devs say they are on track to launch a goerli shadow fork before the end of the year\n\n- cont...https://t.co/3i4LpLDzRh — Christine Kim (@christine_dkim) December 15, 2023\n\nA shadow fork is a smaller test fork that focuses on some of the improvements that must be made before the Dencun upgrade is implemented on the main protocol.\n\nTesting for the Cancun/Deneb upgrade is well underway on Devnet 12. Currently, all execution layer (EL) and consensus layer (CL) client combinations, including the Prysm client, have been onboarded to Devnet 12. MEV-Boost software has been activated for the majority of these client combinations, except for Prysm client combinations.\n\nThe much-awaited Ethereum Dencun upgrade will bring changes across Ethereum's two mainnet layers: the execution layer (EL) and the consensus layer (CL).\n\nThe upgrade to the execution layer is dubbed Cancun, while the consensus layer will receive the Deneb upgrade, forming the name Deneb-Cancun (or Dencun).\n\nThe exciting Dencun upgrade aims to tackle Ethereum's scalability challenges by implementing an improvement proposal named EIP-4844.\n\nAs earlier reported, developers might most likely begin upgrading public Ethereum testnets after the holidays in Q1, 2024.\n\nThe Goerli testnet, as it is presently known, will be sunsetting soon. Teams will begin exiting their validators either three months after the Dencun activation or one month after the Dencun mainnet activation, whichever comes later. Notably, the Dencun network upgrade will be the last one implemented on the network."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWNvbW11bml0eS1lbWJyYWNlcy1uZXctdG9rZW5pemF0aW9uLXN0YW5kYXJkLWVyYy0zNjQzL9IBWGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWNvbW11bml0eS1lbWJyYWNlcy1uZXctdG9rZW5pemF0aW9uLXN0YW5kYXJkLWVyYy0zNjQzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Community Embraces Tokenization Standard ERC-3643 - CoinGape",
        "content": "The Ethereum network has reached a new milestone by adopting the ERC-3643 Ethereum Improvement Proposal (EIP). This development marks a significant step forward in compliant asset tokenization. Following rigorous review and discussions, the Ethereum community has officially recognized ERC-3643, mirroring the path previously taken by standards like ERC-20.\n\nDetails of the ERC-3643 Standard\n\nERC-3643 introduces a robust framework for tokenizing real-world assets (RWAs), securities, payment systems, and loyalty programs. It distinguishes itself by integrating a self-sovereign identity (SSI) framework. This feature verifies users’ eligibility for a token, offering anonymous yet verifiable credentials. The standard builds upon the foundation of ERC-20 and incorporates two critical layers of permissions to enhance security and compliance.\n\nadvertisement\n\nThe first layer scrutinizes the identity and eligibility of transaction recipients. It leverages ERC 734/735 standards to ensure that identities hold necessary claims authenticated by trusted claim issuers. The second layer places global restrictions on the token itself. These restrictions include limits on daily token volume and the maximum number of token holders, ensuring regulated token circulation.\n\nImpact on Asset Tokenization\n\nAsset tokenization, which involves converting the value of physical or digital assets into blockchain-based digital tokens, can benefit significantly from this development. Benefits of this process include heightened liquidity, faster settlements, increased transparency, and broader market accessibility. The applications span diverse fields, ranging from fractional trading of real estate and art to financial assets and intellectual property.\n\nThe market potential for asset tokenization is vast with Roland Berger, a management consulting firm, projecting the market to grow to $10 trillion by 2030, up from the current $300 billion. Traditional financial institutions and crypto-native companies alike are exploring this technology.\n\nMoreover, major firms like JPMorgan, Goldman Sachs, and Société Générale are already delving into this domain. Despite the crypto industry’s challenges, VanEck Research data indicates that the total market capitalization for RWAs stood at $342 billion as of September.\n\nRead Also: Coinbase vs SEC: XRP Lawyer Says SEC Chair is “Gas Lighting” Americans"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8xNS90cmFkZXItc2F5cy10b3AtMTAtYmx1ZS1jaGlwLWFsdGNvaW4tb24tdGhlLWN1c3Atb2YtYS1icmVha291dC11cGRhdGVzLW91dGxvb2stb24tYml0Y29pbi1hbmQtZXRoZXJldW0v0gGMAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzE1L3RyYWRlci1zYXlzLXRvcC0xMC1ibHVlLWNoaXAtYWx0Y29pbi1vbi10aGUtY3VzcC1vZi1hLWJyZWFrb3V0LXVwZGF0ZXMtb3V0bG9vay1vbi1iaXRjb2luLWFuZC1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Trader Says Top-10 Blue-Chip Altcoin on the Cusp of a Breakout, Updates Outlook on Bitcoin and Ethereum - The Daily Hodl",
        "content": "Crypto trader and analyst Ali Martinez is saying that a top-10 altcoin by market cap is potentially forming a bullish pattern and that it could appreciate by double-digit percentage points.\n\nMartinez tells his 35,500 followers on the X social media platform that Binance Coin (BNB) could be forming an inverted head and shoulders pattern, which is typically a bullish signal.\n\nAccording to Martinez, if Binance Coin manages a “sustained close above the neckline at $261,” the fourth-largest crypto asset by market cap could surge by nearly 20% towards the $310 price.\n\nBNB is trading at $251 at time of writing, up by around 10% over the past two weeks.\n\nTurning to Bitcoin (BTC), Martinez says that the flagship crypto asset’s recent fall in price to around $40,300 presented an opportunity for whales to accumulate. Citing data from blockchain analytics firm Glassnode, Martinez says that the number of entities holding 1,000 Bitcoin or more has increased since the price dip.\n\nBitcoin is trading for $42,897 at time of writing.\n\nTurning to Ethereum (ETH), Martinez says that approximately 5.58 million addresses purchased 39.87 million Ethereum at prices ranging between $1,934 and $2,160.\n\n“From an on-chain perspective, this is ETH’s most critical support level. For traders, this could be the ideal reloading point to aim for new highs.”\n\nEthereum is trading at $2,287 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ibG9ja2NoYWluLW1lZXRzLWFpLWV0aGVyZXVtcy1lYXJseS1pbnZlc3RvcnMtZGl2ZS1pbnRvLW5ldy1lcmEuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Blockchain Meets AI: Ethereum's Early Investors Dive into New Era - Cryptonews",
        "content": "Blockchain Meets AI: Ethereum’s Early Investors Dive into New Era\n\nInvestment firm cyber.Fund, known for its early support of Ethereum (ETH), has committed $100 million to projects at the intersection of blockchain technology, artificial intelligence (AI), and the Internet of Things (IoT).\n\nWith previous investments in Cosmos, Solana, and Polkadot, cyber.Fund aims to foster the growth of the “cybernetic economy,” where blockchain serves as the foundation, according to a recent press release.\n\nThe firm defines the cybernetic economy as an interconnected and automated economic framework that converges blockchain, AI, and IoT.\n\nThe move comes as AI-based tokens gained traction within the cryptocurrency industry, buoyed by the success of mainstream AI tools like ChatGPT earlier this year.\n\nThe increasing convergence between blockchain and artificial intelligence has sparked predictions of a potential bull cycle in the near future.\n\n“The cybernetic economy represents a new era of innovation and collective growth, and we at cyber.Fund are fully prepared to be at the forefront of this transformation,” Konstantin Lomashuk, co-founder of cyber.Fund, said.\n\nBy channeling significant investment into projects at the intersection of blockchain, AI, and IoT, cyber.Fund aims to drive advancements in these fields and shape the evolution of the cybernetic economy.\n\nAI and Crypto Represent New Opportunities\n\n\n\nBack in June, Coinbase released a research report stating that the intersection of artificial intelligence and blockchain represents a major opportunity for entrepreneurs.\n\nAt the time, the largest US-based cryptocurrency exchange highlighted the benefits of combining both techs to create new solutions for societal challenges presented by AI.\n\n“As applications within AI and blockchain mature, the disruptions these technologies represent may lead to areas of collaboration and the emergence of new use cases for crypto to help address specific societal challenges posed by AI,” David Duong, head of research at Coinbase, said.\n\nThe report mentioned several potential use cases that combine both AI and blockchain technology.\n\nIn the first place, it said decentralized data marketplaces could help generative AI meet the demand for a verified and diverse set of data to train its models.\n\nSimilarly, token-based incentive mechanisms could improve the quality of data sourced from those marketplaces.\n\nOther use cases include providing computational power from decentralized networks that utilize graphics processing units for AI projects to train their models, improving data authenticity, and making AI algorithm’s opaque decision-making process more auditable.\n\nFurthermore, the report claimed that the combination of AI and blockchain has the potential to address issues such as algorithmic bias and digital identity verification.\n\nIt is worth noting that blockchain technology also has the potential to address issues like disinformation risks. Blockchain and non-fungible tokens can be used to establish the provenance of images, video, music, and other media.\n\nMoreover, blockchain can help make the decision-making processes of generative AI models more transparent, allowing users to scrutinize the logic and reliability of the AI-produced outcomes."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzE2L2V0aGVyZXVtLWV0aC1sYXllci0yLXNjYWxpbmctc29sdXRpb24tYXJiaXRydW0tYXJiLXN1ZmZlcnMtbWFqb3Itb3V0YWdlLWFtaWQtc3VyZ2UtaW4tdHJhZmZpYy_SAYMBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTIvMTYvZXRoZXJldW0tZXRoLWxheWVyLTItc2NhbGluZy1zb2x1dGlvbi1hcmJpdHJ1bS1hcmItc3VmZmVycy1tYWpvci1vdXRhZ2UtYW1pZC1zdXJnZS1pbi10cmFmZmljL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Layer-2 Scaling Solution Arbitrum (ARB) Suffers ‘Major Outage’ Amid Surge in Traffic - The Daily Hodl",
        "content": "Arbitrum (ARB), a popular Ethereum (ETH) layer-2 scaling solution, suffered a major outage on Friday morning amid a “significant” surge in network traffic.\n\nThe protocol’s sequencer, which is responsible for ordering users’ transactions, stalled at 7:29 a.m. PST and didn’t resume operations until 8:57 a.m., according to Arbitrum’s status page.\n\nThe layer-2 scaling solution says it plans to release a post-mortem on the outage as soon as possible.\n\n“The team is actively investigating, but we can confirm that a sustained surge of inscriptions triggered the sequencer to stop relaying transactions properly.”\n\nThough the protocol resumed operations at 8:57 a.m., Arbitrum’s gas prices didn’t stabilize until around 1 p.m. PST.\n\nThe project’s native token, ARB, is down more than 6% in the past 24 hours, roughly double the average crypto price movement on Friday. The overall crypto market cap dropped 3.2% over the same period, according to CoinGecko.\n\nArbitrum currently ranks fourth among all chains in terms of total value locked (TVL), behind Ethereum, Tron (TRX) and Binance Smart Chain (BSC), according to the decentralized finance tracker DeFi Llama. The project currently registers $2.345 billion in TVL.\n\nTVL refers to the amount of capital deposited within a protocol’s smart contracts and is often used to gauge the health of a crypto ecosystem.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2V0aGVyZXVtLWlzLWEtcGllY2Utb2YtanVuay13aGVuLWNvbXBhcmVkLXRvLWJpdGNvaW4tc2F5cy1wZXRlci1icmFuZHQv0gFmaHR0cHM6Ly9jb2lucGVkaWEub3JnL25ld3MvZXRoZXJldW0taXMtYS1waWVjZS1vZi1qdW5rLXdoZW4tY29tcGFyZWQtdG8tYml0Y29pbi1zYXlzLXBldGVyLWJyYW5kdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum “Piece of Junk” When Compared to Bitcoin, Says Peter Brandt - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights Brandt finds Ethereum's high gas fees and functionality issues concerning.\n\nHe bluntly calls Ethereum a \"piece of junk\" due to its perceived lack of usability and effectiveness.\n\nWhile Brandt is skeptical, others like Raoul Pal see Ethereum as an innovative ecosystem with potential.\n\nVeteran trader Peter Brandt isn’t optimistic about Ethereum’s future, predicting it won’t become a recognized digital currency in the next ten years. Despite being the second-largest cryptocurrency, Brandt questions Ethereum’s ability to serve as a reliable store of value, especially when compared to Bitcoin.\n\nHe criticizes Ethereum for its functionality issues and high gas fees, foreseeing potential challenges ahead. In straightforward terms, Brandt labels Ethereum as a “piece of junk” due to what he sees as its lack of usefulness.\n\nEthereum Under the Slammer\n\nIn a recent X post, Peter Brandt voiced his dissatisfaction with Ethereum, deeming it an inferior store of value compared to Bitcoin. He expressed confusion about traders choosing to hold onto the coin.\n\nEther $ETH is not comparable to $BTC as a store of value. Why hodl ETH when you can hodl BTC\n\nAnd the functionality and gas price of ETH make the crypto a piece of junk\n\nMy prediction is that ETH may not even be a listed asset in 10 years https://t.co/4WQ7wnFWEO — Peter Brandt (@PeterLBrandt) December 14, 2023\n\nAccording to Brandt, Ethereum’s poor functionality and soaring gas fees could potentially lead to its downfall in the long run. He boldly went so far as to label the asset a “piece of junk” due to its perceived lack of utility and usability. This critical stance from a seasoned trader like Brandt adds to the ongoing debate about Ethereum’s future.\n\nAs of now, Ethereum is trading at $2,274.34, experiencing a 0.6% dip in the past 24 hours and a more substantial 3.7% decrease over the last seven days, as per Coinpedia news.\n\nBrandt’s skepticism about Ethereum’s long-term prospects is grounded in his assertion that digital currencies, in general, do not serve as reliable stores of value.\n\nHere’s A Contrasting View: JPMorgan Claims Ethereum Will Outshine Bitcoin in 2024; Here’s Why\n\nPutting the Spotlight on Ethereum\n\nEthereum’s unique position as a pioneer in the blockchain industry has made it a focal point for comparison among experts. While Peter Brandt’s assessment paints a gloomy picture, other industry figures, such as Raoul Pal, have engaged in the Ethereum versus Solana debate.\n\nI do think there is a >20% chance that this cycle in Crypto and Exponential Age tech is an Everything, Everywhere, All at Once adoption cycle. The narrative/price will probably outrun the reality however, but by 2030 all forecasting will go out the window…1/ — Raoul Pal (@RaoulGMI) December 10, 2023\n\nPal characterized Ethereum as the “Android” of the crypto ecosystem, contrasting it with Solana, which he likened to the “iOS” of the industry.\n\nThere Is Still Hope!\n\nDespite Brandt’s less optimistic stance, a group of experts remains hopeful about Ethereum’s future. The blockchain keeps innovating through various layer-2 protocols, including Polygon zkEVM, Arbitron (ARB), and Optimism (OP). These developments show a lively and robust ecosystem within the Ethereum network, countering the prevailing doubt and hinting at potential breakthroughs.\n\nAs Ethereum faces skepticism, we’ll see if it can overcome the hurdles pointed out by Brandt. What do you think?"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbmdhcGUuY29tL2Z0eC1hbmQtY2Vsc2l1cy1kZXBvc2l0LWxhcmdlLWFtb3VudHMtb2YtZXRoZXJldW0tb24tZXhjaGFuZ2VzLWV0aC1wcmljZS1kcm9wLXNvb24v0gFsaHR0cHM6Ly9jb2luZ2FwZS5jb20vZnR4LWFuZC1jZWxzaXVzLWRlcG9zaXQtbGFyZ2UtYW1vdW50cy1vZi1ldGhlcmV1bS1vbi1leGNoYW5nZXMtZXRoLXByaWNlLWRyb3Atc29vbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price: FTX and Celsius Deposit Large Amounts of Ethereum on Exchanges, ETH Price Drop soon? - CoinGape",
        "content": "The world’s second-largest cryptocurrency Ethereum (ETH) has been showing some good price action with the ETH price shooting all the way to $2,300 earlier this week. At press time, ETH is trading at $2,281 with a market cap of $274 billion.\n\nFTX and Celsius Deposit Large Amounts of ETH to Exchanges\n\nAs per the latest data, two bankrupt crypto firms FTX and Celsius Networks have been depositing large amounts of ETH to the crypto exchanges. Both FTX and Celsius Network have initiated substantial Ethereum (ETH) transfers following the resurgence of ETH prices above $2,300.\n\nadvertisement\n\nAs per data by SpotonChain, bankrupt crypto lender Celsius Network executed a substantial ETH deposit of 7,500 ETH (equivalent to $17.4 million) to FalconX approximately 8 hours ago. This move comes on the heels of Celsius depositing a staggering 25,000 ETH (equivalent to $57 million) to both FalconX and Coinbase in the past week. The strategic transfers indicate notable activity and investment decisions within Celsius Network.\n\nOn the other hand, FTX made a significant move by transferring 1,593 ETH (equivalent to $3.66 million) to the address labeled 0xCeF around 55 minutes ago. Notably, the destination address 0xCeF currently holds 2,244 ETH (equivalent to $5.16 million) and hints at a potential ETH deposit to Coinbase in the near future. FTX’s timely and sizable transactions add to the dynamic landscape of crypto exchanges responding to market movements.\n\nThese substantial ETH transfers from Celsius Network and FTX underscore the evolving strategies and positions of major crypto entities amid the cryptocurrency market’s continuous fluctuations. Investors and enthusiasts are keenly observing these movements for potential insights into market trends and upcoming developments.\n\nEthereum Price Action Ahead\n\nThe Ethereum (EHT) price has been able to sustain above $2,300 and has been facing rejection at those levels. On the downside, the crucial demand zone for ETH is from $1,934 to $2,160. Within this demand zone, 5.58 million addresses have been holding a total of nearly 40 million $ETH.\n\nIf there is a decline below the $2050 level, where the 50-Day Exponential Moving Average (EMA) is positioned, it would signal a negative development, prompting a reassessment of the overall situation. However, the likelihood of such a scenario occurring in the near term appears low. Therefore, the current perspective suggests adopting a strategy of buying on market downturns. The $2100 level is anticipated to act as a significant support zone. In the event that prices approach this level, there is an expectation that a considerable number of buyers will seize the opportunity to acquire “discounted Ethereum,” contributing to a substantial upward movement in the market. Baking giant JPMorgan believes that Ethereum could outperform Bitcoin in the coming year 2024."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy0zLW91dC1vZi00LWV0aC1ob2xkZXJzLWFyZS1pbi1wcm9maXQtdGltZS10by1idXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price prediction as 3 out of 4 ETH holders are in profit; Time to buy? - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) is the largest and most used decentralized finance (DeFi) and Web3 layer-1 blockchain infrastructure. Its native token, ETH, is also the second-largest cryptocurrency by market cap, with $270 billion at the time of publication.\n\nNotably, Ethereum’s price is up 85% in the last year, now trading at $2,249 per token. This surge has rewarded ETH holders, who are now 76% in profit, according to data by IntoTheBlock on December 16.\n\nIn particular, the percentage of Ethereum investors in profit is the same as long-term holders, who have kept their positions for over a year. Both data sets are achieved by looking at all active addresses in the network from the received and spent transactions.\n\nHowever, 23% of all Ethereum wallets are holding a losing ETH position, while 1% acquired the token at current prices. At the same time, 21% of Ethereum holders have held their position for between one and 12 months, while 3% just recently bought ETH.\n\nEthereum (ETH) holders data. Source: IntoTheBlock\n\nIs it time to buy ETH with 76% of Ethereum holders in profit?\n\nIt is important to understand that the higher the number of Ethereum holders in profit, the higher the likelihood of a sell-off, as they might want to realize the, so far, unrealized profit. Therefore, buying ETH right now could mean becoming the profitable exit liquidity for 76% of all Ethereum holders.\n\nMeanwhile, only 46% of the tokens are concentrated in the hands of addresses holding at least 0.1% of its supply. The low concentration of whales and institutional investors lowers the risk of huge coordinated sell-offs. Balancing the previous analysis.\n\nCryptocurrency traders controversially believe we are experiencing either a bull rally in a bear market or a bull market already. Understanding the current status of cryptocurrencies is essential to make a profitable decision of buying or not buying ETH.\n\nMoreover, further developments and DeFi ecosystem growth for Ethereum could generate more demand for its token. An increased demand would drive ETH prices up, while a reduced demand would create an opposite outcome.\n\nAll things considered, the decision to buy ETH is personal, and investors must be aware of the risks. Essentially, having a good risk management start is necessary while investing in such a volatile and experimental market.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1ldGhlcmV1bS10b2tlbnMtc29sYW5hLWFtZXJpY2FuLXdyYXAtMTUtZGVjZW1iZXItMjAyMzEyMTUxOTE00gGSAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2NyeXB0b2N1cnJlbmNpZXMtcHJpY2UtcHJlZGljdGlvbi1ldGhlcmV1bS10b2tlbnMtc29sYW5hLWFtZXJpY2FuLXdyYXAtMTUtZGVjZW1iZXItMjAyMzEyMTUxOTE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Tokens & Solana – American Wrap 15 December - FXStreet",
        "content": "Greed remains the main driving force of the crypto market in recent days, and the corresponding index is on its way to the extreme greed zone. Its cap has risen by 0.3% in the last 24 hours. Bitcoin has seen about zero change, with trampling around $42.8K.\n\nThe BRC-20 token standard was designed specifically for the Bitcoin blockchain and tokens like RATS, SATS and ORDI are BRC-20 tokens. One of the key reasons for BRC-20 popularity is that the token standard unlocks new capabilities for the Bitcoin blockchain when used in DeFi applications.\n\nEthereum (ETH) price is likely to overshadow Bitcoin price performance in 2024 said JP Morgan analysts in a recent note. Ether traded in the $2,400 region after nearly three weeks of consolidation but this uptrend seems to have lost momentum as Bitcoin price takes a hit this week . Despite the Bitcoin ETF approval hype, ETH continues to remain largely neutral as other altcoins outperform Ether. In the near future, ETH is likely to slip into sideways movement due to a few reasons: a slump in on-chain activity, a delay in ETF approval from the US Securities and Exchange Commission (SEC), a fast-approaching holiday season, and a lack of momentum to push Bitcoin price higher.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL2V0aGVyZXVtLWV0aC1wcmljZS1zdXJnZS10by0yMzAwLXNwYXJrcy1tYXJrZXQtb3B0aW1pc20td2hhdHMtbmV4dC_SAWJodHRwczovL2NvaW5wZWRpYS5vcmcvbmV3cy9ldGhlcmV1bS1ldGgtcHJpY2Utc3VyZ2UtdG8tMjMwMC1zcGFya3MtbWFya2V0LW9wdGltaXNtLXdoYXRzLW5leHQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Surge to $2,300 Sparks Market Optimism: What’s Next? - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nEthereum (ETH), the 2nd-largest digital asset, made a strong surge earlier this week, briefly reaching $2,300 before settling at $2,281, boasting a hefty market cap of $274 billion. Ethereum’s price action has been crucial, consistently testing the $2,300 mark while encountering resistance.\n\nWith 5.58 million addresses holding nearly 40 million ETH in the critical zone from $1,934 to $2,160, ETH’s resilience remains noteworthy. The Relative Strength Index (RSI) hovering around 60 levels indicates upward momentum, reflecting a favorable scenario for the bulls.\n\nHowever, the market is on high alert for potential downtrends, eyeing support levels at $2,050 and $2,100. A drop below these thresholds might trigger a shift in market sentiment, potentially leading to ETH’s price falling further to $1,531 or $1,369.\n\nDespite the downtrend, Ethereum’s price performance is promising today, there’s an air of caution among investors. The prevailing strategy suggests capitalizing on market downturns, reinforcing the belief that opportunities arise amidst volatility.\n\nFTX, Celsius Network ETH Transfers Caused Market Ripples\n\nSimultaneously, bankrupt crypto firms FTX and Celsius Networks caused ripples in the market by executing significant ETH transfers. Celsius Network, in particular, conducted massive ETH deposits, funneling 7,500 ETH (worth $17.4 million) to FalconX and another substantial 25,000 ETH (valued at $57 million) to FalconX and Coinbase within the past week.\n\nFTX also joined the party, initiating a sizable move by transferring 1,593 ETH (equivalent to $3.66 million) to an address labeled 0xCeF, hinting at a potential ETH deposit to Coinbase shortly. These transactions from both entities reflect their strategic positions in response to Ethereum’s market dynamics, closely observed by investors for future market trends.\n\nIn a Negative Market, Can Ethereum Hit $3,000?\n\nDespite recent fluctuations, Ethereum’s daily chart showcases a promising green candle, hinting at potential price growth. Altcoin Sherpa, the crypto analysts speculate that the current scenario might be an opportune moment to acquire Ethereum before an anticipated rally. Some even predict Ethereum could soar to $3,000 in this impending uptrend.\n\n$ETH: I still think that #Ethereum is 1 of the easiest trades you can take. It consolidated under the 2kish mark for almost 2 years and finally out of that range.\n\n\n\nThis is going to catch up for sure and I think that ETHUSD goes to $3k in the coming months. pic.twitter.com/ddX8l2s5Ux — Altcoin Sherpa (@AltcoinSherpa) December 12, 2023\n\nThe crypto market’s current positive sentiment fuels optimism for Ethereum’s trajectory, igniting speculations on whether the ETH rally will continue with more consecutive green candles or retrace amidst fluctuating market sentiments. The next moves for Ethereum are being closely monitored as the crypto space braces for potential market shifts and ETH’s continued price action. Will you buy before it rallies to $3K?"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9hcmUtZXRoZXJldW0tYmVhcnMtZW1lcmdpbmctZnJvbS10aGUtc2hhZG93cy_SAUdodHRwczovL2FtYmNyeXB0by5jb20vYXJlLWV0aGVyZXVtLWJlYXJzLWVtZXJnaW5nLWZyb20tdGhlLXNoYWRvd3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Are Ethereum bears emerging from the shadows? - AMBCrypto News",
        "content": "ETH’s supply has dropped to its lowest level since the merge.\n\nA key indicator has shown the re-emergence of the bears in the ETH spot market.\n\nEthereum’s [ETH] supply has fallen to its lowest since the blockchain transitioned from the proof-of-work consensus mechanism (PoW) to a proof-of-stake (PoS) network in an event popularly referred to as “The Merge.”\n\nAlthough the week has witnessed an elevated cost of sending and receiving ETH, the network has also burned a significant amount of the cryptocurrency, leading to a shrinking overall supply.\n\nAccording to data from Ultrasound.money, 31,829.06 ETH worth around $71.58 million have been burned in the last week. Within the same period, newly issued coins totaled 16,535 ETH.\n\nAMBCrypto found that since the merge, 320,870.92 ETH worth $721.68 million at the coin’s current price has been removed from circulation. At press time, the leading altcoin’s supply was 120.2 million ETH.\n\nProfit-takers control the market\n\nAt press time, the network’s native coin traded at $2,249. Sharing a statistically significant correlation with Bitcoin [BTC], whose value has fallen by 5% in the last week, ETH’s value has dipped by 6% within that period.\n\nAs profit-taking activity intensifies, there has been a steady decline in ETH accumulation. An on-chain assessment of the coin’s network activity on a seven-day simple moving average revealed a drop in demand for the altcoin.\n\nData from Santiment showed that in the last week, the daily count of active addresses involved in ETH transactions has decreased by 2%.\n\nThe decline in ETH’s network activity coincides with the re-emergence of the bears, as readings from the coin’s Moving Average Convergence/Divergence indicator (MACD) showed.\n\nOn 12th December, the MACD line crossed below the trend line. This movement signaled the weakening of the coin’s upward momentum, which ushered in the bears.\n\nSince then, ETH’s Relative Strength Index (RSI) and Money Flow Index (MFI) have trended downwards, suggesting that coin distribution has exceeded accumulation.\n\nRead ETH’s Price Prediction 2023-24\n\nMoreso, amid the decline in demand for the alt, there has been an increase in its supply on exchanges in the past few days. According to data from CryptoQuant, ETH’s exchange reserve has seen a 0.35% uptick in the last week.\n\nThis confirmed the trend of ETH holders sending their coins to exchange for onward sales to take a profit. As of this writing, ETH’s exchange reserve was 14.27 million ETH."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8yMDk5OTYvZXRoZXJldW0tc2NhbGVyLWFyYml0cnVtLXN1ZmZlcnMtb3V0YWdlLWluc2NyaXB0aW9ucy1ibGFtZdIBWmh0dHBzOi8vZGVjcnlwdC5jby8yMDk5OTYvZXRoZXJldW0tc2NhbGVyLWFyYml0cnVtLXN1ZmZlcnMtb3V0YWdlLWluc2NyaXB0aW9ucy1ibGFtZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Scaler Arbitrum Suffers Outage—And Inscriptions Are to Blame - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum scaling network Arbitrum reported a \"partial outage\" Friday, bringing activity on the Arbitrum One blockchain to a standstill for the first time since June.\n\nOffchain Labs, the company that developed Arbitrum, announced that the network stalled at 10:29am ET Friday due to “a significant surge in network traffic.” The issue remained unresolved for well over an hour, ultimately resuming at 11:57am ET.\n\nFriday afternoon, Offchain Labs confirmed that the cause of the activity surge was indeed an abundance of \"inscriptions,\" as widely suspected—that is, artwork and media being etched onto the blockchain, akin to NFTs but entirely on-chain.\n\nAD\n\nAD\n\n\"We can confirm that a sustained surge of inscriptions triggered the sequencer to stop relaying transactions properly,\" the Arbitrum account tweeted. \"We've resolved this issue, but due to the backlog, gas prices are recovering from the transaction volume. These should normalize soon.\"\n\nThe Arbitrum One sequencer is up and running after a temporary outage starting at 10:29 AM EST and resuming at 11:57 AM EST. The team is actively investigating, but we can confirm that a sustained surge of inscriptions triggered the sequencer to stop relaying transactions… — Arbitrum (💙,🧡) (@arbitrum) December 15, 2023\n\nOn Twitter, numerous Arbitrum users and Arbitrum-based services reported a complete inability to process transactions on the network since the outage began.\n\nArbiscan, a blockchain explorer for Arbitrum, initially attributed the network’s failure to a “surge in activities due to inscriptions,” according to multiple Twitter users. It has since adjusted language on its website to match Arbitrum’s official statement, deleting the reference to inscriptions.\n\nInscriptions, first popularized by the massive success of Bitcoin Ordinals earlier this year, are detailed images or other pieces of media that are carved into denominations of cryptocurrency. While incredibly costly and a major lift for blockchains to process, inscriptions made a fair deal of sense for the Bitcoin network, which due to its lack of smart contract capabilities has never been able to support NFTs.\n\nAD\n\nAD\n\nBut recently, some users have begun embarking on the incredibly energy-intensive project of creating inscriptions on networks that already support NFTs. Last week, inscriptions on the Polygon, BNB Chain, and Avalanche blockchains accounted for a whopping 57% of traffic across the three major networks, according to the pseudonymous blockchain analyst Hildobby.\n\n.@arbitrum is down. All DLN trades into Arbitrum are pending fulfillment until the network is up again pic.twitter.com/DUdVwelkLo — deAlex (@AlexSmirnov__) December 15, 2023\n\nIn the last week, inscription transactions have accounted for 30% of all traffic on Arbitrum One specifically, according to data from Dune Analytics.\n\nPrior to official confirmation of the cause, numerous Twitter users expressed their frustration at the possibility that inscription-related traffic brought down Arbitrum, as they feel the innovation is both unduly costly and fails to serve a practical function.\n\nWhat's the value prop of inscriptions on a layer two like Arbitrum? I need to know who is this fucking bored. — themovingavg (@themovingavg) December 15, 2023\n\nif this is because of inscriptions I will lose my shit lmao this is the 4th time that these things have totally destroyed a blockchain — mert | helius.dev (d/acc) (@0xMert_) December 15, 2023\n\nEdited by Andrew Hayward\n\nEditor's note: This story was updated after publication with additional details after the cause was confirmed.\n\nAD\n\nAD"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8xNi90b3AtY3J5cHRvLWFuYWx5c3Qtc2F5cy10d28tYWx0Y29pbnMtcHJpbWVkLXRvLWV4cGxvZGUtYnktb3Zlci04MC11cGRhdGVzLW91dGxvb2stb24tYml0Y29pbi1hbmQtZXRoZXJldW0v0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzE2L3RvcC1jcnlwdG8tYW5hbHlzdC1zYXlzLXR3by1hbHRjb2lucy1wcmltZWQtdG8tZXhwbG9kZS1ieS1vdmVyLTgwLXVwZGF0ZXMtb3V0bG9vay1vbi1iaXRjb2luLWFuZC1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Top Crypto Analyst Says Two Altcoins Primed To Explode by Over 80%, Updates Outlook on Bitcoin and Ethereum - The Daily Hodl",
        "content": "A trader who accurately called Bitcoin’s (BTC) 2018 price floor is predicting massive moves to the upside for two top 50 altcoins.\n\nStarting with Solana (SOL), the analyst and trader pseudonymously known as Bluntz tells his 232,000 followers on the social media platform X that the sixth-largest crypto asset by market cap will surge in value against Bitcoin (SOL/BTC).\n\nAccording to the analyst, the bullish SOL/BTC chart indicates that Solana will likely soar against the US dollar.\n\nThis was another banger SOL/BTC picolow call. Since the original post, it has rallied impulsively from the low in five waves and has now done yet another ABC down. SOL/BTC is about to full send in my opinion.\n\nI have no idea where USD pair goes in terms of levels, but I genuinely think it will be $140+.”\n\nSolana is trading at $73.65 at time of writing and would need to appreciate by over 90% to hit the target of at least $140.\n\nTurning to the governance token of the decentralized finance (DeFi) lending protocol Aave (AAVE), Bluntz says that the 50th-largest altcoin by market cap looks poised for a big breakout rally.\n\n“Monster three-day candle on AAVE. Legit gearing up to gigasend.\n\nPlenty of juice in the tank in my opinion, shouldn’t be aiming for anything less than $200 in my opinion.”\n\nAAVE is trading at $108.13 at time of writing and would need to go up by 85% to reach a target of $200.\n\nOn Bitcoin and Ethereum (ETH), Bluntz says he’s now bullish on the two crypto assets after initially expressing reservations. Initially, the pseudonymous crypto analyst had warned of a possible downward move for Bitcoin and Ethereum after the two leading crypto assets pulled back from their ascending channel highs.\n\n“Overnight price action made me do a 180 on this take. Sh*t looks bullish as f**k again.”\n\nBitcoin is trading at $42,113 at time of writing while Ethereum is worth $2,244.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3Mvc29sYW5hLWFuZC1ldGhlcmV1bS1wb2lzZWQtdG8tMjUtMzAtY29ycmVjdGlvbi0yMDIzMTIxNTEyMDfSAW5odHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9zb2xhbmEtYW5kLWV0aGVyZXVtLXBvaXNlZC10by0yNS0zMC1jb3JyZWN0aW9uLTIwMjMxMjE1MTIwNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Solana and Ethereum poised to 25-30% correction - FXStreet",
        "content": "Share:\n\nMarket picture\n\nGreed remains the main driving force of the crypto market in recent days, and the corresponding index is on its way to the extreme greed zone. Its cap has risen by 0.3% in the last 24 hours. Bitcoin has seen about zero change, with trampling around $42.8K.\n\nEthereum has given up 0.2%, retreating deep under $2300. Within a broad ascending channel, the upper boundary of which the second cryptocurrency touched last week. The lower boundary of this range passes through the levels of $1700-1750.\n\nThe movement was provided by the top ten altcoins, following Solana (+9%). This is one of the few altcoins that managed to hit the highs since May 2022 in the last hours. At the $78 level, it has a chance to hit resistance. Here, we saw significant support for the declines in the first half of 2022, and its overcoming triggered a solid downward momentum.\n\nSo even now, we should be ready for a prolonged recharge with a potentially deep correction down to $55. But this is only possible against the backdrop of a widespread sell-off in traditional financial markets - a very risky bet right now.\n\nNews background\n\nBitcoin will set a new all-time high of $80K in 2024 thanks to the approval of spot bitcoin-ETFs and halving, Bitwise predicts.\n\nNext year, Ethereum will reassert itself and regain crypto market share. The primary catalyst will be the EIP-4844 update, which is expected to take place in the first half of 2024, according to JPMorgan. This update should be a big step towards improving the scalability, performance, and activity of the ETH network.\n\n‘Regulation of cryptocurrencies should be a priority on the global agenda’, commented Kristalina Georgieva, head of the International Monetary Fund. She called for coordinated efforts by international regulators to control crypto assets.\n\nCryptocurrency exchange Binance has challenged the legality of the US Securities and Exchange Commission's (SEC) lawsuit. Binance has filed two documents in the case against the SEC, claiming the agency's actions were improper.\n\nHardware wallet developer Ledger reported the compromise of a software library used by decentralised applications. A hacker was able to inject malicious code into their interfaces. The damage from the attack is estimated at $600K. Tether froze the Ledger code cracker's funds."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW0tYnVsbC1yYWxseS1taWdodC1lbmQtc29vbmVyLXRoYW4tZXhwZWN0ZWQv0gFRaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3doeS1ldGhlcmV1bS1idWxsLXJhbGx5LW1pZ2h0LWVuZC1zb29uZXItdGhhbi1leHBlY3RlZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Why Ethereum’s rally might end sooner than expected - AMBCrypto News",
        "content": "Ethereum’s liquidation level increased once its price reached the $2,170 mark.\n\nIts exchange reserve was increasing, but the derivatives metrics looked bullish.\n\nEthereum’s [ETH] price has once again gained bullish momentum as its price registered an increase in the last 24 hours.\n\nHowever, a short while ago, the token fell into a critical demand zone. When ETH dropped to that level, did investors choose to sell their holdings, or were they confident in ETH and expected a price hike?\n\nEthereum reaches a critical demand zone\n\nAli, a popular crypto analyst, posted a tweet on 13th December highlighting an interesting development.\n\nAs per the tweet, ETH has dipped into a crucial demand zone, ranging from $1,934 to $2,160. In that range, over 5.58 million addresses were holding nearly 40 million Ethereum.\n\n#Ethereum has dipped into a crucial demand zone, ranging from $1,934 to $2,160. Here, over 5.58 million addresses are holding nearly 40 million $ETH. From an on-chain perspective, this is #ETH's most critical support level. For traders, this could be the ideal reloading point to… pic.twitter.com/Qh1P8lQMhk — Ali (@ali_charts) December 13, 2023\n\nSince ETH was in a critical demand zone, AMBCrypto took a look at Hyblock Capital’s data to see whether there were any sell-offs near those marks.\n\nAs per our analysis, when ETH’s price reached the $2,170 mark, the token’s liquidation did increase, as evident from the fluorescent lines. However, soon after that, the token’s price rebounded and went up.\n\nThanks to that, ETH’s price rallied by more than 4% in the last 24 hours. At the time of writing, ETH was trading at $2,264.32 with a market capitalization of over $272 billion.\n\nHowever, if ETH has to sustain its bull rally, it does have to cross a few resistance levels. AMBCrypto’s analysis of Ethereum’s liquidation heatmap revealed that it has to cross a crucial resistance level at the $2,300 mark in the near term.\n\nIf ETH manages to go above that, then ETH has to encounter another crucial roadblock at $2,450.\n\nSelling pressure on ETH is increasing\n\nHowever, the viability of ETH maintaining its bull rally looked slim if supply distribution was to be considered.\n\nAccording to an analysis of CryptoQuant’s data, Ethereum’s exchange reserve was increasing, meaning that selling pressure was high.\n\nIts aSORP was also red, clearly suggesting that more investors were selling at a profit. In the middle of a bull market, it can indicate a market top.\n\nIs your portfolio green? Check the ETH Profit Calculator\n\nNonetheless, Ethereum’s derivatives metrics looked bullish as its taker buy/sell ratio remained green. Additionally, ETH’s funding rate also remained green while its price increased.\n\nThis meant that futures investors were buying ETH while its price rose, which can be interpreted as a bullish sign."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctdml0YWxpay1idXRlcmlucy1wbGFucy1mb3ItZXRoZXJldW0tY2FtZS10by1mcnVpdGlvbi_SAVNodHRwczovL2FtYmNyeXB0by5jb20vaG93LXZpdGFsaWstYnV0ZXJpbnMtcGxhbnMtZm9yLWV0aGVyZXVtLWNhbWUtdG8tZnJ1aXRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "How Vitalik Buterin’s plans for Ethereum came to fruition - AMBCrypto News",
        "content": "Buterin’s proposal to restrict the maximum supply to 120,204,432 was rejected earlier.\n\nAs of this writing, 120,203,611 ETH coins were in circulation.\n\nEthereum’s [ETH] supply dipped below the hard cap proposed by co-founder Vitalik Buterin some five years ago, sparking discussions about the asset’s monetary policy within the community.\n\nNoted Ethereum developer Evan Van Ness took to social platform X to draw attention to this intriguing development.\n\nVitalik’s dream comes to life!\n\nButerin’s proposal to restrict the maximum supply to 120,204,432 was rejected in April 2018. However, little did he know that his objectives would ultimately come to fruition albeit through a different approach.\n\nAs of this writing, 120,203,611 ETH coins were in circulation, AMBCrypto discovered using ultra sound money data.\n\nUnlike Bitcoin [BTC], ETH doesn’t have an issuance limit. Buterin’s case for limiting ETH supply stemmed from concerns about centralization in the then proof-of-work (PoW) mechanism, as well as a desire to improve the coin’s long-term market prospects.\n\nAs per the proposal, the supply would exponentially approach the max cap and the rewards would exponentially approach zero, much on the lines of Bitcoin.\n\nHowever, much water has flown under the bridge. Three years after his suggestion was dismissed, Ethereum implemented EIP-1559 as part of the London Hardfork. This included burning a portion of gas fees paid to miners, thus driving coins out of circulation.\n\nA year later, the Merge was executed, marking a shift from the PoW to the proof-of-stake (PoS) model. The pivotal event applied considerable deflationary pressure on ETH.\n\nAs seen by AMBCrypto, more than 307,000 ETH have exited circulation since the event, causing the net supply to shrink at an annual rate of 0.211%. The circulating supply was projected to drop to 117 million by the end of December 2025.\n\nRead ETH’s Price Prediction 2023-24\n\nETH looks set to push higher\n\nAs of this writing, ETH stayed strong above $2,200, according to CoinMarketCap data. Profit-taking by weak hands pulled the crypto down by more than 3% over the week.\n\nHowever, the broader sentiment still tilted towards buying. AMBCrypto’s examination of Hyblock Capital revealed a predominantly greedy ETH market. This could continue to sustain the momentum in the days to come."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL2V0aGVyZXVtLWNvbW11bml0eS1hcHByb3Zlcy1maXJzdC1ldmVyLWNvbXBsaWFudC10b2tlbml6YXRpb24tc3RhbmRhcmQtZXJjLTM2NDMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum community approves first-ever compliant tokenization standard, ERC-3643 - Crypto Briefing",
        "content": "Share this article URL Copied\n\nThe Ethereum community has approved the ERC-3643 standard. This standard is the first-ever designed specifically for compliant tokenization. This new standard improves upon the widely used ERC-20 standard, particularly in securities activities. It enhances ERC-20 tokens with controlled advanced functions and compliance modules.\n\nJoachim Lebrum, Chair of the Technology Working Group ERC-3643 Association, stated that:\n\n“The ERC3643 standard is a groundbreaking step towards integrating advanced blockchain solutions into the enterprise sector, and this validation sends echoes across the ecosystem that ERC3643 is the superior standard for such use cases.”\n\nERC-3643 is a permissioned token standard for tokenizing securities, real-world assets (RWAs), payment systems, and loyalty programs. The standard uses a self-sovereign identity (SSI) framework to verify users’ token eligibility dynamically. This feature ensures compliance through anonymous but verifiable credentials.\n\nThe new ERC-3643 standard sets out to revolutionize how companies leverage blockchain technology. It provides them with a secure, compliant framework to tokenize various assets. Ethereum’s official recognition of this standard demonstrates its goals to address users’ diverse needs. It also establishes a benchmark for institutions implementing this framework in tokenization projects.\n\nCompanies now have an approved standard to actively deploy to bring real-world assets onto blockchains while integrating the necessary compliance controls and permissions.\n\nLooking ahead to 2024, experts predict the momentum behind asset tokenization will accelerate. HSBC’s research group forecasts the market for tokenized assets will swell to trillions of dollars by 2030. Governments and significant investment funds are demonstrating growing interest in this area. The next wave of tokenization will likely see bonds, equities, and other mainstream financial assets transitioning to blockchain-based models."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aHktZXRoZXJldW1zLXBvdy1uZXR3b3JrLWhhcy10aHJpdmVkLW9mLWxhdGUv0gFIaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3doeS1ldGhlcmV1bXMtcG93LW5ldHdvcmstaGFzLXRocml2ZWQtb2YtbGF0ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Why Ethereum’s PoW network has thrived of late - AMBCrypto News",
        "content": "The last month has seen resurging activity in Ethereum’s Proof-of-Work network.\n\nThis has been due to the general market rally.\n\nThe EthereumPoW [ETHW] network has witnessed a significant upsurge in activity due to the recent market rally, on-chain data has revealed.\n\nThis comes after an extended period of decline, during which demand for the chain plummeted to its lowest levels.\n\nEthereumPoW has seen traction in the last month\n\nA major indicator of the uptick in demand for the EthereumPoW network has been its hashrate, which has risen consistently since the 20th of November.\n\nAccording to data from 2Miners.com, in the 14 months prior, the network’s hashrate had declined by 65%.\n\nThe drop in a network’s hashrate is often due to a decline in the value of its native cryptocurrency. This makes mining less profitable, leading to miners leaving the network.\n\nInasmuch, in the 14 months preceding the hike in hashrate, ETHW’s price had fallen by 98%.\n\nHowever, since the 20th of November, EthereumPoW’s mining hashrate has grown. At 16.28TH/s at press time, it has since climbed by 52%.\n\nThe steady increase in the network’s mining hashrate coincided with the rally in the value of its native coin. According to data from CoinMarketCap, ETHW’s price has grown by 70% in the last month.\n\nAs expected, the uptick in mining activity on the blockchain has also resulted in a similar uptrend in the chain’s mining difficulty.\n\nAt press time, EthereumPoW’s network difficulty was 209.59T, recording a 55% growth since the 20th of November.\n\nFurther, the total value of assets (TVL) locked by decentralized finance (DeFi) protocols housed within EthereumPoW has also increased, data from DefiLlama showed.\n\nThe uptrend began on the 22nd of November, and the network’s DeFi TVL has since gone up by 90%.\n\nHowever, EthereumPoW’s DeFi TVL remained significantly lower than its October 2022 peak of $6 million at press time. The network’s TVL was $215,294 at the time of writing, logging a 72% decline year-to-date (YTD).\n\nNetwork activity in the last 24 hours\n\nPer data from OKLink, EthereumPoW saw an influx of new addresses in the last 24 hours.\n\nIs your portfolio green? Check out the ETHW Profit Calculator\n\nAccording to the on-chain data provider, 2469 new addresses were created on the blockchain, bringing the total number of addresses on the chain to 381 million.\n\nHowever, out of the 381 million total addresses on the chain, only 9,369 were deemed to be active."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmRhaWx5Zm9yZXguY29tL2ZvcmV4LXRlY2huaWNhbC1hbmFseXNpcy8yMDIzLzEyL2V0aGVyZXVtLWZvcmVjYXN0LTE1LWRlY2VtYmVyLTIwMjMvMjA1MTcz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Forecast: Looks Bullish - DailyForex.com",
        "content": "In this journey, we must keep an eye on the $2050 level, which is where the 50-Day Exponential Moving Average sits. If Ethereum drops below this level, it could spell trouble.\n\nEthereum has been on a roll lately, and it's not just a fluke.\n\nThe reason behind this rally is the growing speculation around central bank policies worldwide. You might wonder how these bank policies are connected to a digital currency like Ethereum, but the answer is simple.\n\nWhen central banks make big decisions, it affects the entire financial world, and Ethereum is part of that world.\n\nForex Brokers We Recommend in Your Region See full brokers list\n\nSo, what's the deal with Ethereum's recent price surge? Well, it's all about risk appetite. When people are feeling bold and ready to take risks, they tend to invest in assets like Ethereum. It's like a rollercoaster ride for investors, and Ethereum is one of the exciting markets when it comes to momentum and risk appetite aspects.\n\nBut here's the catch: even rollercoasters have their ups and downs. Ethereum is no different. We can expect a short-term pullback in its price. Think of it as a small dip in the rollercoaster ride. However, this dip can be a golden opportunity for smart investors. If Ethereum's price gets close to $2100, many buyers will swoop in to grab some \"cheap Ethereum.\"\n\nNext Target: $2500\n\nNow, let's look at the next target: $2500. This is the level that Ethereum enthusiasts are eyeing in the short term. If Ethereum manages to break above this level, we could see it go even higher. But breaking that barrier won't be a piece of cake; it's like reaching the summit of a challenging mountain. Nevertheless, it's not impossible, and Ethereum could conquer it eventually.\n\nIn this journey, we must keep an eye on the $2050 level, which is where the 50-Day Exponential Moving Average sits. If Ethereum drops below this level, it could spell trouble. We'd have to rethink our whole strategy. However, the chances of that happening in the near future seem slim. So, for now, it's best to see this as a \"buy on the dips\" opportunity.\n\nBut Ethereum isn't alone in this crypto adventure. Bitcoin, often considered the leader of the crypto pack, can influence the entire crypto world. So, if you plan to trade Ethereum, keep a watchful eye on the Bitcoin market as well. The two are closely connected, and what happens in one can affect the other.\n\nUltimately, Ethereum's recent rally is tied to the global speculation surrounding central bank policies. While we can expect some short-term ups and downs, Ethereum has the potential to reach new heights. Keep an eye on key levels, pay attention to Bitcoin, and stay aware of the US Dollar's influence.\n\nReady to trade our ETH/USD forecast? We’ve made a list of the best Forex crypto brokers worth trading with."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9idGMtdnMtZXRoLWNhbi1ldGhlcmV1bS1vdXRwZXJmb3JtLXRoZS1raW5nLWNvaW4tYmVmb3JlLTIwMjMtZW5kcy_SAVxodHRwczovL2FtYmNyeXB0by5jb20vYnRjLXZzLWV0aC1jYW4tZXRoZXJldW0tb3V0cGVyZm9ybS10aGUta2luZy1jb2luLWJlZm9yZS0yMDIzLWVuZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin vs Ethereum – Can one’s price outdo the other’s prediction in 2023? - AMBCrypto News",
        "content": "The ETH/BTC chart has been in a long-term downtrend.\n\nIn comparison, the strength of Bitcoin was clear and is likely to continue.\n\nSince October, Bitcoin [BTC] has rallied by an impressive 57.5% as of press time. In the same period, Ethereum [ETH] gains measured 48.34%. The difference is not much, but ETH has been underperforming for close to a year now.\n\nThis means that during times when Bitcoin runs higher, Ethereum doesn’t achieve equivalent or higher gains. During periods of a downturn, Ethereum prices suffer more than Bitcoin’s.\n\nIs this trend likely to reverse?\n\nTechnical analysis of the ETH/BTC chart underlined gloom\n\nThe ETH/BTC chart on the one-day timeframe highlighted the downtrend that has been present since early June. The inference was that ETH just wasn’t able to keep up in terms of performance. And the story doesn’t end there.\n\nThe zone of resistance highlighted at the 0.055 region represented a key resistance zone that ETH bulls will need to breach to reverse their fortunes. However, the market structure was bearish.\n\nThe 61.8% Fibonacci retracement level was tested on 10th November. It was followed by a rapid reversal.\n\nA move below the 0.051 mark would signal that ETH/BTC was headed much further lower. If that happens, traders and investors could exit the ETH market if a higher timeframe bearish market structure break occurs.\n\nAssuming Bitcoin climbs above the $45k key resistance but ETH/BTC falls, participants could look to shift their funds to BTC to ride the trend higher.\n\nAssessing sell pressure on ETH and BTC\n\nA sign that sell pressure is imminent on an asset is if we spot large inflows to exchanges. If that happens, the exchange reserve for the asset would shoot skyward. In the case of both Bitcoin and Ethereum, this has not yet occurred.\n\nThe BTC exchange reserve has consistently trended lower since June. Despite the downtrend, there was a noticeable spike from 5th December to 12th December. Just after this spike, Bitcoin prices tumbled from $43.7k to $41.2k.\n\nThe Ethereum reserves saw less volatility. It, too, was in a downtrend and has been since February 2023.\n\nEthereum saw a small spike in the reserve between 11th-13th December, but the increase came during and after the price drop. This suggested that some holders panicked due to what they perceived as a shift in trend, while BTC’s inflows preceded the fall.\n\nThe inference was Bitcoin reserves and flow could be a more accurate gauge of the next price direction than Ethereum.\n\nHowever, this was based only on the recent spike, and is not a practical finding with a large sample size. Nevertheless it is something to look out for.\n\nWhat is the sentiment of BTC and ETH like?\n\nA look at the social volume for both crypto assets revealed that, as expected, Bitcoin’s social volume was far higher than Ethereum’s. Even so, their trends were pretty similar. This could be because of their price performances being closely interrelated.\n\nWhen Bitcoin rallies, so does Ethereum, but just not as much.\n\nThe MVRV ratio for Bitcoin and Ethereum also showed similar trends, but their magnitudes were vastly different. At press time, BTC stood at 41.17% while ETH was at 26.45%.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nBoth values were at their respective six-month highs despite the recent dip in prices. The conclusion was that both assets were overvalued, with Bitcoin holders being at a greater profit, and hence, the happier.\n\nIt remains to be seen if these holders choose to realize their profits en masse and cause a large wave of selling."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vYnJhdmVuZXdjb2luLmNvbS9pbnNpZ2h0cy9iaXRnZXQtd2FsbGV0LXBhcnRuZXJzLXdpdGgtbGluZWEtZm9yLWV0aGVyZXVtLWxheWVyLTLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitget Wallet Partners with Linea for Ethereum Layer 2 - Brave New Coin",
        "content": "Bitget Wallet Partners with Linea for Ethereum Layer 2\n\nBitget Wallet (formerly BitKeep), a leading global Web3 trading wallet, has announced a collaboration with the Ethereum Layer 2 network, Linea, to jointly advance the development and growth of the Linea ecosystem.\n\nBitget Wallet has integrated with the Linea mainnet, providing wallet connectivity and support for the Linea mainnet and ecosystem projects. Wallet users can now easily connect to the Linea mainnet via their mobile app and browser extension, manage their assets on the Linea ecosystem, engage in multi-chain swaps for Linea mainnet tokens and view real-time candlestick data, and interact with projects on the Linea ecosystem.\n\n“The partnership with Bitget Wallet is a great step for Linea, enhancing user interaction with our zkEVM Layer 2 solution. This collaboration simplifies asset management and ecosystem engagement for the network, aligning with our goal to make web3 more accessible and efficient. We’re excited about this collaboration and the positive impact it will have in the Linea ecosystem.” – Declan Fox, Product Lead\n\nDeveloped by Consensys, Linea is a developer-friendly Ethereum Layer 2 network built on zero-knowledge proof technology that aims to provide efficient scaling solutions to enhance Ethereum’s performance and usability.\n\nAs part of this collaboration, Bitget Wallet has launched an extension of Linea’s DeFi Voyage Wave 9 through its own event on its Task2Get platform, signaling the commencement of the second phase of Bitget Wallet’s Task2Get initiative. By exploring the Linea ecosystem within the wallet and completing tasks like token swaps and DApp interactions, users can earn Task2Get NFT rewards distributed by Bitget Wallet and share in a total prize pool of US$10,000. The event runs from December 14th to December 28th. Task2Get NFT holders will qualify for additional airdrops from this campaign as well, including tokens from partnered projects and more.\n\nTask2Get, a Web3 exploration incentive platform introduced by Bitget Wallet, rewards users for participating in various on-chain interaction tasks, offering an effective way for users to both learn and earn from various ecosystems, while also providing growth opportunities for these projects.\n\n“As active participants in the Web3 ecosystem, we not only curate and showcase promising mainnets and projects for users to better interact and claim future airdrops, but also launch various incentivised task events in collaboration with these parties,” Alvin Kan, Chief Operating Officer of Bitget Wallet states. “This will allow users to explore and interact with decentralised ecosystems while earning rewards at the same time.”\n\nBesides offering an easy-to-use user interface and comprehensive interaction guides, Task2Get also provides convenient access to interaction records and interaction reminders. Users can also stand to earn exclusive NFTs for completing various tasks, which will qualify them for rewards such as vouchers and even airdrops in the future.\n\nAs one of the top global-leading Web3 trading wallets, Bitget Wallet provides reliable and powerful services for over 12 million users worldwide. Bitget Wallet’s mobile app is also ranked fourth in global downloads in recent months. Leveraging its vast user base and strong market influence, it has built up a robust growth and exposure platform for Web3 mainnets and projects through its Task2Get incentive. With the continuous deepening of collaboration between Bitget Wallet and Linea, it is predicted that Task2Get will be a key driver in fostering further innovations and market growth, cultivating sustained user engagement and active interaction in the ecosystem.\n\nLearn More At Bitget Academy\n\nExploring the Linea Mainnet with Bitget Wallet\n\nPreviously known as ConsenSys zkEVM, Linea is an innovative Layer 2 (L2) solution, presenting new opportunities for developers to craft dApps more efficiently. Learn how to add the Linea Mainnet to the Bitget Wallet App.\n\nThe Future of Cryptocurrency: How to Safely Store Your Crypto: A Beginner’s Guide to your Web3 Wallet\n\nBitget Wallet is a secure and user-friendly wallet that allows you to store, send, and receive cryptocurrencies. Discover the importance of safely storing your crypto with our beginner’s guide to Bitget Wallet.​\n\nBitKeep Upgrades to Bitget Wallet: A Letter From the Team\n\nIn March 2023, Bitget acquired a controlling stake in BitKeep through a successful US$30 million capital raise to form Bitget Wallet. Learn more about the new Web3 wallet features.\n\nAbout Bitget Wallet (Web3 Trading Wallet)\n\nFormerly known as BitKeep, Bitget Wallet stands as Asia’s largest and global frontrunner among all-in-one Web3 trading wallets. We offer a comprehensive range of on-chain products and DeFi services to our users, including wallet functionality, Swap feature, NFT trading, DApp browsing, MPC Wallet and more.\n\nWith a 5-year legacy, Bitget Wallet has garnered acclaim from over 12 million users worldwide and has secured partnerships with prominent industry leaders including Bitcoin, Ethereum, TRON, BNB Chain, Solana, Base, and others. This success stems from our commitment to consistently delivering secure and convenient products and services.\n\nIn March 2023, Bitget, a leading cryptocurrency exchange made a substantial US$30 million investment in BitKeep, acquiring a controlling stake. Following this strategic move, BitKeep underwent a transformative and strategic brand evolution in August, officially rebranding itself as Bitget Wallet.\n\nFor more information, visit: Website | Twitter | Telegram | LinkedIn | Discord | Bitget Wallet\n\nFor media inquiries, please contact: [email protected]"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vZmluYm9sZC5jb20vY2hhaW5saW5rcy15ZWFyLWVuZC1idWxsLXJ1bi1wb3RlbnRpYWwtZXRoZXJldW0td2hhbGVzLXR1cm4tYXR0ZW50aW9uLXRvLWJvcnJvZWZpbmFuY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Chainlink's Year-End Bull Run Potential; Ethereum Whales Turn Attention to BorroeFinance - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nWith Chainlink’s staking pool going through the roof based on a more than $690 million investment, LINK seems set to end the year on a high. On the other hand, BorroeFinance ($ROE) is attracting significant investor attention to the extent of Ethereum whales trickling into the network.\n\n>>BUY $ROE TOKENS NOW<<\n\nOptimism Continues to Engulf the BorroeFinance Network\n\nSince BorroeFinance’s presale success cannot go unnoticed, the network is depicting heighted investor interest and confidence based on its novel approach of tackling traditional financing challenges.\n\nHaving crafted a name for itself in the decentralized cryptocurrency list, BorroeFinance is changing stakes in the Web3 revenue financing field by ensuring that immediate funding is the norm.\n\nThis is achieved thanks to BorroeFinance deploying artificial intelligence (AI), smart contracts, blockchain technology, and non-fungible tokens on its marketplace where revenue buyers and sellers are linked.\n\nAs a result, Web3 players get instant funds since their future earnings are generated as NFTs that are sold off on BorroeFinance’s marketplace, enabling them to get upfront cash to fund their projects and prospects.\n\nWith BorroeFinance depicting itself as one of the best DeFi coins, investors are trickling into this network, as evidenced by the high success rate in its presale.\n\nFor instance, the network’s native token called $ROE is already enjoying a 75% gain from the Beta Stage where the price was $0.01, making it a good crypto to buy.\n\nAt the current Stage 3, $ROE is retailing at $0.0175, and it serves as the gateway to the BorroeFinance ecosystem that enables users to enjoy premium features like advanced analytics, enabling the coin to be one of the best cryptos to invest in today.\n\nBorroeFinance’s long-term objective of breaking barriers in Web3 has not gone unnoticed because the network is a stone’s throw away from exiting Stage 3 since more than 80% of $ROE tokens have been bought at this level.\n\nThis explains why Ethereum whales are entering the BorroeFinance ecosystem because it’s one of the best cryptos to buy.\n\n>>BUY $ROE TOKENS NOW<<\n\nChainlink Is Experiencing Significant Inflows\n\nSince more than $690 million has been stashed in Chainlink’s Staking V0.2 Community Pool, the fourteenth-largest cryptocurrency is eyeing ending the year on a bullish trend.\n\nChainlink highlighted, “We want to thank the community — both V0.1 migrators and new stakers — for participating in the V0.2 launch and putting 40,875,000 LINK to work to help secure the Chainlink Network and the verifiable web.”\n\nThis development is making Chainlink to stand out as one of the most notable Oracle networks in the crypto sector.\n\nPositive sentiments also continue to engulf the Chainlink network, given that whales recently bought LINK tokens worth approximately $50 million.\n\nOn the other hand, Chainlink’s Cross-Chain Interoperability Protocol (CCIP) is gaining steam based on its simplified and seamless token transfer solution, with Swell being one of the latest companies to deploy this cross-chain strategy. Therefore, LINK is one of the altcoins to watch.\n\nLearn more about BorroeFinance ($ROE) here:\n\nVisit BorroeFinance Presale | Join The Telegram Group | Follow BorroeFinance on Twitter"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLW5hdmlnYXRlcy1jcml0aWNhbC1kZW1hbmQtem9uZS1hbmFseXN0cy1leWUtMzAwMC1yYWxseS_SAVlodHRwczovL3p5Y3J5cHRvLmNvbS9ldGhlcmV1bS1uYXZpZ2F0ZXMtY3JpdGljYWwtZGVtYW5kLXpvbmUtYW5hbHlzdHMtZXllLTMwMDAtcmFsbHkvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Navigates Critical Demand Zone: Analysts Eye $3,000 Rally - ZyCrypto",
        "content": "Advertisement\n\nEthereum, the second-largest cryptocurrency by market capitalization, encountered a pivotal market moment as its price dipped to approximately $2,148 early Wednesday.\n\nThis descent ushered the altcoin into a crucial demand zone, eliciting significant interest and predictions among market analysts foreseeing a potential rally to the $3,000 mark.\n\nWhat Defines Ethereum’s Current Position?\n\nThe decline in Ethereum’s price follows a broader sell-off across the crypto market since the start of the week.\n\nMarket experts attribute this downturn to investors’ de-risking strategy as the US awaits crucial economic events such as the release of the US Consumer Price Index (CPI) data for November and the US Federal Reserve (Fed) final meeting of the year.\n\nWithin this tumultuous landscape, Ethereum found itself within a price range between $1,934 and $2,160, delineated as a critical demand zone.\n\nAdvertisement\n\nInsight from crypto intelligence tracker IntoTheBlock revealed a staggering accumulation of nearly 40 million ETH tokens across 5.58 million wallet addresses within this pivotal range, underscoring its importance as a key support zone for Ethereum.\n\nAnalysts’ Bullish Outlook on Ethereum’s Rally\n\nMarket analysts, buoyed by Ethereum’s breakout past the psychological barrier of $2,000, are now steadfast in their predictions of an impending rally to the $3,000 level. Notable voices within the crypto space, including analysts from platforms like X, have echoed sentiments of a bullish trajectory for Ethereum.\n\n@CryptoJelleNL, a prominent crypto analyst, has confidently proposed an upward movement for Ethereum, asserting that the altcoin is poised for a rally to the coveted $3,000 mark within the current market cycle.\n\nOther experts, including @AltcoinSherpa, align with this optimistic viewpoint, identifying Ethereum’s recent exit from a consolidation period below $2,000 as a precursor for the anticipated ascent towards $3,000 in the months ahead.\n\n$ETH: I still think that #Ethereum is 1 of the easiest trades you can take. It consolidated under the 2kish mark for almost 2 years and finally out of that range.\n\n\n\nThis is going to catch up for sure and I think that ETHUSD goes to $3k in the coming months. pic.twitter.com/ddX8l2s5Ux — Altcoin Sherpa (@AltcoinSherpa) December 12, 2023\n\nChallenges Along Ethereum’s Rally Path\n\nHowever, this bullish outlook faces potential hurdles in the form of resistance levels between $2,160 and $2,247.\n\nIntoTheBlock’s data highlights that approximately 1.04 million wallet addresses hold 5.49 million ETH tokens within this range, suggesting a formidable barrier that Ethereum must surpass to validate the optimistic rally projections.\n\nSource: IntoTheBlock\n\nAt the time of writing this, Ethereum’s trading price lingers around $2,230.38 on Binance, hovering in proximity to the $2,100 threshold, marking a weekly loss of nearly 5% for holders.\n\nIn conclusion, Ethereum’s current positioning within this pivotal demand zone sets the stage for a potentially transformative market movement. Analysts’ bullish sentiments and the altcoin’s resilience in the face of recent market turbulence paint an intriguing picture, as the crypto community eagerly anticipates Ethereum’s journey towards the sought-after $3,000 milestone."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXByaWNlLWxpa2VseS10by1jb25zb2xpZGF0ZS1hcy1vbi1jaGFpbi1hY3Rpdml0eS1zbHVtcHMtYW5kLWV0Zi1nZXRzLWRlbGF5ZWQtMjAyMzEyMTQwODU30gGVAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLXByaWNlLWxpa2VseS10by1jb25zb2xpZGF0ZS1hcy1vbi1jaGFpbi1hY3Rpdml0eS1zbHVtcHMtYW5kLWV0Zi1nZXRzLWRlbGF5ZWQtMjAyMzEyMTQwODU3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price likely to outperform BTC says JP Morgan report, but short-outlook remains flat despite ETF hype - FXStreet",
        "content": "Share:\n\nInvesco Digital’s Ethereum spot ETF’s approval is delayed.\n\nEthereum price is likely to hover between the $2,030 and $2,539 levels for the next few weeks.\n\nOn-chain metrics note a decline in user activity, which could add headwinds to the uptrend.\n\nEthereum (ETH) price is likely to overshadow Bitcoin price performance in 2024 said JP Morgan analysts in a recent note. Ether traded in the $2,400 region after nearly three weeks of consolidation but this uptrend seems to have lost momentum as Bitcoin price takes a hit this week. Despite the Bitcoin ETF approval hype, ETH continues to remain largely neutral as other altcoins outperform Ether. In the near future, ETH is likely to slip into sideways movement due to a few reasons: a slump in on-chain activity, a delay in ETF approval from the US Securities and Exchange Commission (SEC), a fast-approaching holiday season, and a lack of momentum to push Bitcoin price higher.\n\nAlso read: Ethereum revenue could double to $5 billion and fee may fall to $0.01 in 2024: Bitwise prediction\n\nSEC delays Ethereum ETF\n\nAs noted by Bloomberg Analyst James Seyffart, the Commission has decided to delay the Invesco Galaxy Ethereum ETF. The analyst adds that “this was early but completely expected.”\n\nUpdate: SEC delayed @InvescoUS / @galaxyhq Ethereum ETF application -- This was early but completely expected. (Wasn't due until Dec 23rd I think) pic.twitter.com/jFCjnND3Rf — James Seyffart (@JSeyff) December 13, 2023\n\nInvesco and Galaxy Digital filed for an Ether spot ETF in September, but like Bitcoin’s ETFs, Ether’s is likely to be delayed before the SEC gives a decision. Additionally, the Commission remains unclear on its stance as to whether Ether is a security or a commodity, which makes the approval of an Ethereum ETF highly speculative.\n\nRead more: Hashdex tips spot Bitcoin ETF s to trade by Q2, followed by Ethereum\n\nEthereum price remains neutral-to-bullish\n\nEthereum price action between June 2022 and November 2023, created an ascending triangle setup. This technical formation is a bullish pattern in which the asset price creates higher lows and equal highs. In Ether’s case, three distinctive higher lows and three equal highs formed.\n\nConnecting the equal highs shows a horizontal resistance level at $2,030. This level was broken on November 20, indicating the upside potential of the pattern was activated. The ascending triangle setup forecasts a 43% upswing to the $2,943 level, obtained by measuring the distance of the widest part of the triangle and extrapolating it higher.\n\nEthereum price’s breakout was succeeded by a 16% rally to a local top at $2,403. Since then, ETH has dropped 6.3% and currently trades at $2,252. Going forward, the smart contract token is likely going to move sideways between the ascending triangle’s base at $2,030 and the weekly resistance level at $2,539.\n\nA decisive flip of the $2,539 will open the path for Ethereum price to continue rising to its theoretical target of $2,943 or the $3,000 psychological level.\n\nETH/USDT 1-week chart\n\nEthereum’s Social Dominance metric has been trending lower since September 30, showing a decline in interest for ETH among investors.\n\nETH Social Dominance\n\nAccording to data from Santiment, On-chain Volumes saw a spike on November 10 but has been steadily slumping since then. The same can be said about Whale Transaction Count, which has also seen a decline.\n\nETH On-chain Volume, WTC\n\nWhile this is bearish in the short term, the Active Addresses have been in an uptrend since mid-September. Network Growth has also remained consistent, which shows that the investors are being patient about the mid-to-long term outlook.\n\nETH Active Addresses, Network Growth\n\nA decisive breakout above $2,539 could signal a bullish outlook for ETH. In such a case, the Ethereum price could eye a retest of the $3,000 psychological level.\n\nOn the other hand, a breakdown of the $2,030 support level could trigger a 15% crash in Ethereum price to $1,727."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vdGVjaGNhYmFsLmNvbS8yMDIzLzEyLzE1L2V0aGVyZXVtLWV0aC1hbmQtc29sYW5hLXNvbC1wYXZlLXRoZS13YXktZm9yLXB1bGxpeC1wbHgtYS10cmlmZWN0YS1vZi1jcnlwdG8tc3VjY2Vzcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) and Solana (SOL) Pave the Way for Pullix (PLX): A Trifecta of Crypto Success - TechCabal",
        "content": "The blockchain cryptocurrency industry has evolved substantially since the launch of Bitcoin in 2009. Ethereum (ETH) and Solana (SOL) are two top altcoins that have contributed to the industry’s growth.\n\nWhile Ethereum was the first to implement smart contracts, Solana expanded the possibilities by increasing scalability. Both have contributed to the emergence of Pullix (PLX), the new trifecta of crypto success. Let’s find out why Pullix is now referred to as one of the best cryptocurrencies to invest in right now.\n\nEthereum Introduces a New Phase in Crypto\n\nEthereum (ETH) is widely considered as the blockchain industry’s backbone. This is because the Ethereum network was the first to provide smart contracts and decentralized apps. The infrastructure has extended throughout the bitcoin industry.\n\nThe Ethereum network’s popularity has propelled it to the top altcoins in the market today. Ethereum (ETH) is the project that led to the idea of a decentralized future since it created the framework for the launch of many projects.\n\nSolana’s Scalability Increased the Possibilities\n\nWhile Ethereum introduced smart contracts, scalability remained a long-standing issue. In 2017, the Solana network was launched as a game changer. While Ethereum can only handle 8-18 transactions per second (TPS), the Solana network has the potential to handle 65,000 TPS.\n\nThis scalability caused the Solana coin to gain traction. It also led to a massive expansion of the network. The growth of the network has established the Solana coin as one of the top altcoins in the cryptocurrency market today.\n\nThe Emergence of Pullix (PLX)\n\nPullix is now being referred to as a trifecta of crypto success as it combines both concepts introduced by Ethereum and Solana. As an exchange, it combines the decentralization of Ethereum with the great scalability of Solana.\n\nPullix has thus unveiled an exchange platform that exceeds the competitors. As a result, the exchange functions in a safe and decentralized environment. Furthermore, it promotes a transparent trading system that eliminates intermediaries and lowers transaction fees.\n\nThe exchange’s great scalability has enabled it to enter new markets. Users will be able to trade more than just cryptos on Pullix. Users will be able to trade assets from the stock, FX, commodities, and exchange-traded fund (ETF) markets.\n\nPullix has linked its DeFi cryptocurrency, PLX, to the trading platform in order to bring additional incentives to customers. PLX token holders will receive regular passive income transfers via providing liquidity.\n\nDue to these amazing features, there has been great interest in the platform’s DeFi cryptocurrency, PLX. Over the last few days, almost a million PLX tokens have been snapped up. Fortunately, PLX is still available at a great price of $0.042 per token before its projected rally.\n\nFinal Thoughts\n\nThe combination of successful two models has made Pullix one of the best cryptocurrencies to invest in at the moment. This is the reason why it is referred to as a trifecta of crypto success. Now is a great time to join the project before its projected rally of 100x.\n\nFor more information regarding the Pullix Presale see links below:\n\nVisit Pullix\n\nJoin The Pullix Communities\n\nKeywords: top altcoins, best cryptocurrencies to invest in, DeFi cryptocurrency, altcoins, Ethereum, Ethereum (ETH), Ethereum network, Solana, Solana network, Solana coin\n\nMeta Title: Crypto Trifecta: Ethereum (ETH) and Solana (SOL) Forge the Path for Pullix (PLX) Success\n\nMeta Description: Find out how Ethereum (ETH) and Solana (SOL) have paved the way for the success of Pullix (PLX).\n\nShare this article"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLWNhc2lub3MtdW5sZWFzaGluZy10aGUtcG93ZXItb2Ytc21hcnQtY29udHJhY3RzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Casinos: Unleashing the Power of Smart Contracts - Analytics Insight",
        "content": "Ethereum Casinos: Revolutionizing Online Gambling through the Power of Smart Contracts\n\nIn the ever-evolving landscape of online gambling, Ethereum Casinos have emerged as pioneers, harnessing the transformative power of smart contracts. As the second-largest cryptocurrency by market capitalization, Ethereum’s blockchain technology enables casinos to operate with unparalleled transparency, security, and efficiency.\n\nUnderstanding Smart Contracts:\n\nSmart contracts are self-executing contracts with the terms directly written into code. Ethereum’s blockchain allows for the creation and execution of these contracts, automating various processes in a trustless and tamper-proof manner. In the context of casinos, smart contracts bring an unprecedented level of transparency to the gaming experience, ensuring fairness and eliminating the need for intermediaries.\n\nTransparency and Fairness:\n\nEthereum Casinos leverage smart contracts to achieve provably fair games. The code governing each game is visible on the blockchain, allowing players to independently verify the fairness of outcomes. This transparency not only builds trust but also addresses longstanding concerns about the integrity of online casino games.\n\nEnhanced Security:\n\nThe decentralized nature of Ethereum’s blockchain enhances the security of transactions and player funds. Traditional casinos often rely on centralized systems, making them susceptible to hacking and fraud. Ethereum Casinos, powered by smart contracts, distribute control and eliminate single points of failure, providing players with a secure and trustworthy gaming environment.\n\nEfficiency in Transactions:\n\nSmart contracts enable automatic and instantaneous transactions, reducing the need for manual processing and third-party intermediaries. Deposits, withdrawals, and even payouts can be executed seamlessly, enhancing the overall efficiency of Ethereum Casinos. Players experience faster and more convenient transactions without the delays associated with traditional banking methods.\n\nDecentralized Platforms:\n\nEthereum Casinos operate on decentralized platforms, reducing the risk of censorship or interference. These platforms are not governed by a central authority, giving players more control over their funds and gaming experiences. The decentralized nature of Ethereum Casinos aligns with the principles of blockchain technology, providing a level playing field for all participants.\n\nTokenization and Digital Assets:\n\nEthereum Casinos facilitate the tokenization of in-game assets and casino chips. Players can own and trade these digital assets securely on the Ethereum blockchain. This introduces a new dimension to the gaming experience, allowing players to have true ownership of their in-game items and participate in broader digital ecosystems.\n\nChallenges and Opportunities:\n\nWhile Ethereum Casinos present exciting opportunities for innovation, they also face challenges, including scalability issues and gas fees. As Ethereum continues to evolve, solutions are being explored to address these challenges and unlock the full potential of smart contracts in the gambling industry.\n\nConclusion:\n\nEthereum Casinos, powered by smart contracts, are at the forefront of a revolution in online gambling. The transparency, security, and efficiency brought by Ethereum’s blockchain and smart contracts are redefining the gaming experience. As the technology continues to advance and scalability challenges are addressed, Ethereum Casinos are poised to shape the future of online gambling, providing players with a new standard of fairness and trust in the digital realm.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vdGVjaGNhYmFsLmNvbS8yMDIzLzEyLzE1LzMtdHJhbnNmb3JtYXRpdmUtY3J5cHRvcy1jaGFuZ2luZy10aGUtd29ybGQtZXRoZXJldW0tZXRoLWV2ZXJsb2RnZS1lZGxnLXRvbmNvaW4tdG9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "3 Transformative Cryptos Changing The World: Ethereum (ETH), Everlodge (EDLG), Toncoin (TON) - TechCabal",
        "content": "Cryptocurrency was originally created to transform how we make payments. Now, innovative new projects like Ethereum, Everlodge, and Toncoin are taking things one step further. Each project offers an innovative new solution, and as a result could be extremely profitable for early investors. Here’s why investors should consider each for their portfolios.\n\nEthereum Continues To Pioneer DeFi Developments\n\nEthereum is the largest blockchain in the world. Over 1,500 active decentralized apps have been built on the network, with a total value locked (TVL) of over $1 billion. Many analysts believe that Ethereum is now more important than Bitcoin, and could play a more important role in the future of decentralized finance.\n\nEthereum recently experienced its largest price increase of 2023, rising to over $2,350. It has since declined to $2,232, though Ethereum’s value has still increased by 8.65% in the last month. With huge plans for 2024, including a potential spot ETF, experts believe that Ethereum’s value could surge over the next year. Predictions range from $3,000 to $4,000+, though most experts agree that Ethereum’s value will rise.\n\nToncoin Blockchain Slows Following New Protocol Release\n\nToncoin was created to provide seamless DeFi transactions, offering speeds of over 100,000 transactions per second. However, a recent issue with Toncoins transaction processing has cast a shadow of doubt around the project.\n\nLast Tuesday, a new protocol inspired by Bitcoin Ordinals caused a spike in activity on the Toncoin network. This caused the blockchain’s speed to crash to less than 1 transaction per second on Thursday, during which over 2.5 million transactions were pending.\n\nDue to congestion Tonkeeper, a popular Toncoin wallet, had to suspend its services. Later reports suggest that network usage increased by 61 times in just 30 minutes, causing issues for Toncoin. Since this setback, Toncoin’s value has fallen by 8% to $2.17, and Toncoin’s daily trading volume has fallen to $50 million.\n\nCould Everlodge Revolutionize A Trillion Dollar Market?\n\nWhile most crypto projects focus on finance or the blockchain, Everlodge applies DeFi technology to an entirely new market– travel properties. As a pioneer in this industry, Everlodge is expected to gain significant traction throughout 2024 as thousands of investors discover a new way to build their property portfolios.\n\nEverlodge looks to disrupt the travel property market by minting properties as NFTs. This is designed to streamline the buying and selling process. Once minted, NFTs are fractionalized so investors can buy a percentage of the property instead of the entire property outright. For example, a holiday home in the U.K. worth $1 million could be split into 5 fractions, after which 5 individuals can own a 20% share in the property.\n\n<blockquote class=”twitter-tweet”><p lang=”en” dir=”ltr”>We're thrilled to announce that our website just got a makeover! 💻<br><br>Check out the fresh look and discover the NEW features we've added. It's all about making your experience even better!<br><br>Plus, remember that our Presale is still ON. <br><br>Explore now: <a href=”https://t.co/SIYWBylwQD”>https://t.co/SIYWBylwQD</a><a href=”https://twitter.com/hashtag/RWA?src=hash&ref_src=twsrc%5Etfw”>#RWA</a> <a href=”https://t.co/aTuT8x7z36″>pic.twitter.com/aTuT8x7z36</a></p>— Everlodge (@EverlodgeHQ) <a href=”https://twitter.com/EverlodgeHQ/status/1716543605576241503?ref_src=twsrc%5Etfw“>October 23, 2023</a></blockquote> <script async src=”https://platform.twitter.com/widgets.js” charset=”utf-8″></script>\n\nThis unique application reduces how much an investor needs to get started, and removes traditional barriers to entry, such as location. Properties available on Everlodge will include luxury villas, hotels, and holiday homes, with plans to add more property types in the future.\n\nEverlodge is currently in stage 8 of its presale, having sold out at record rates during its previous seven rounds. Its native token, ELDG, is currently available for just $0.027, and will offer numerous benefits to holders once Everlodge officially launches.\n\nInvestors who buy ELDG tokens during the Everlodge presale will automatically be granted access to the Everlodge private members club, which will offer lucrative rewards such as free stays at properties within the Everlodge ecosystem.\n\nVisit Everlodge\n\nShare this article"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3RlY2hjYWJhbC5jb20vMjAyMy8xMi8xNS9nb29nbGUtYmFyZC1yZXZlYWxzLXNlY3JldHMtZXRoZXJldW0tZXRoLWNhcmRhbm8tYWRhLWFuZC1tZW1lLW1vZ3Vscy1tZ2xzLWF0dHJhY3QtY3J5cHRvY3VycmVuY3ktd2hhbGVzLWRpc2NvdmVyLXdoeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Google Bard Reveals Secrets: Ethereum (ETH), Cardano (ADA), and Meme Moguls (MGLS) Attract Cryptocurrency ... - TechCabal",
        "content": "Meta title: Google Bard: Ethereum, Cardano, & Meme Moguls – Crypto Whales Top Picks\n\nMeta Description: Google Bard shares exclusive insights into the latest cryptocurrency trends, including the attraction of Ethereum, Cardano, and Meme Moguls for crypto whales.\n\nEthereum keywords: Ethereum, Ethereum price, Ethereum price prediction\n\nCardano keywords: Cardano, Cardano news, Cardano price, Cardano price prediction\n\nRegarding cryptocurrencies, some tokens attract traders more than others. Ethereum (ETH), Cardano (ADA), and the emerging Meme Moguls (MGLS) have become major hotspots for cryptocurrency whales, drawing significant attention. Google Bard, the AI chatbot, will let you know why.\n\nEthereum (ETH): Vitalik Buterin Makes New Announcements\n\nEthereum (ETH) has long been the flagship of smart contracts and decentralized applications. Recently, Vitalik Buterin made new announcements at Devconnect in Turkey. Buterin disclosed his plans to revamp Ethereum staking protocols, addressing performance-related concerns.\n\nHe aims to enhance Ethereum’s efficiency by embracing the UTXO payment model and integrating innovations like ZK-EVMs and liquid staking. Google Bard mentioned this forward-looking approach in its analysis.\n\nOver the past month, the Ethereum price surged from $1,788 on October 28 to $2,011 on November 27. Analysts are optimistic with Ethereum now trading above its 100 and 200-day EMAs. Their Ethereum price predictions forecast a potential surge to $2,200 before 2023 ends. According to Google Bard, this is why whales are gravitating to Ethereum.\n\nCardano (ADA): Massive Surge\n\nAccording to Google Bard, Cardano (ADA), often dubbed Ethereum’s competitor, has been catching the eyes of whales.\n\nIn recent Cardano news, Charles Hoskinson discussed a potential collaboration with Javier Milei during an AMA session. He also mentioned the possibility of presenting Cardano’s solutions to Milei. Hoskinson emphasized their shared economic views centered around reducing government intervention and sparked optimism.\n\nOver the last month, the Cardano price surged from $0.29 to $0.37 – a 27% increase. With Cardano exhibiting 18 out of 30 green days and a 9.33% price volatility during that time, analysts have made a bullish Cardano price prediction. They estimate the Cardano price to reach $0.39 in December 2023.\n\nMeme Moguls (MGLS): The Newcomer with a Twist\n\nGoogle Bard believes that the newest contender, Meme Moguls (MGLS), represents the evolving nature of the crypto space. As the world’s first meme-backed stock market, Meme Moguls is bringing something new by allowing users to trade their favorite memes and earn rewards through MGLS tokens.\n\nYou will soon be able to make connections, share tips, and collaborate on strategies with countless traders from around the globe. Traders will have one objective: reaching the top spot on the Meme Moguls Wealth Leaderboard.\n\nAlthough this exchange is the central aspect of Meme Moguls, the team behind its project has also announced three major ecosystem components:\n\nMogul Land: A unique metaverse experience that will provide you with financial activities, be it joining liquidity pools or token mining.\n\nA unique metaverse experience that will provide you with financial activities, be it joining liquidity pools or token mining. Meme Moguls Fantasy Trader: The place where you experiment and learn new strategies by challenging other traders.\n\nThe place where you experiment and learn new strategies by challenging other traders. Moguls Casino: A game where you can engage in various casino activities using meme-based assets.\n\nEngaging in this ecosystem will bring you many rewards, such as extra MGLS tokens and even unique NFTs, which can be sold on on-chain platforms. Meanwhile, the MGLS token holders will also receive staking rewards or governance voting rights. It is now worth just $0.021 in Stage 1 of its presale.\n\nHowever, whales gravitate to it as some analysts forecast a 100x value rise before its presale finishes. This fact, plus a $10,000 giveaway at the end of each presale stage, has caused a frenzy among traders. According to The Crypto Basic, Shiba Inu produced a 1.6M% ROI in the past three years. Meme Moguls has the same potential, and whales have taken notice.\n\nVisit Meme Moguls\n\nShare this article"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tdml0YWxpay1idXRlcmluLXRva2Vucy_SATtodHRwczovL2JpdGNvaW5pc3QuY29tL2V0aGVyZXVtLXZpdGFsaWstYnV0ZXJpbi10b2tlbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Sells Trillions Of Tokens | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum founder, Vitalik Buterin has undertaken a large-scale transaction involving trillions of meme tokens, leaving the broader cryptocurrency space curious about the motives behind the founder’s decision.\n\nEthereum Founder Executes Massive Memecoin Sales\n\nEthereum inventor and founder, Vitalik Buterin has made new headlines as reports surface of his substantial memecoin sales. According to blockchain security company, PeckShield Alerts, a Vitalik labeled wallet address was seen swapping 100,000,000,000,111.111 DOBE tokens worth approximately $22,900 for 10.44 Ethereum tokens (ETH). Additionally, the wallet also initiated another sale of 1,858,140,000,000 DOJO tokens worth $6800 for 3.12 ETH.\n\nThe motivation behind the sell-offs remains unknown however the large-scale memecoin transaction has adequately caught the attention of cryptocurrency investors and the market as a whole.\n\nThe substantial meme coin sale follows a recent loss experienced by Buterin earlier this week. The Ethereum founder’s publicly known crypto wallets became short of $29 million between December 15 and 21.\n\nThe loss was reported by blockchain analytics service, Arkham Intelligence. According to the analytics platform, the reason for the loss was due to crypto market fluctuations which saw Buterin’s wallets losing 5% of the total value of its assets.\n\nETH price chart at $2,300 | Source: ETHUSD on Tradingview.com\n\nButerin Crypto Sell-Offs\n\nIn addition to Buterin’s recent large-scale meme coin sell-off, there have been many other crypto sales executed by the ETH founder. Earlier this year, Buterin sold about 9.9 billion CULT tokens worth $332,420 at the time of the sales. The Ethereum founder subsequently revealed reasons for the sell-off, stating that the cryptocurrency held no cultural or moral value.\n\nLater in October, rumors surfaced about Buterin allegedly selling off his ETH holdings after the Ethereum founder sold about 500,000 USDC worth approximately $14.93 million at the time, to the Gemini exchange. Buterin clarified the sell-off allegations stating that the transactions were made to charitable organizations and other initiatives.\n\nMore times than not, large-scale crypto transactions from prominent leaders in the crypto space tend to capture the attention of investors as these sales could lead to a shift in the market. However, Buterin has also revealed that he has never sold Ethereum tokens (ETH) for his gain since 2018.\n\nThe Ethereum founder is known for making multiple ETH donations to charity organizations and COVID-related causes. Buterin is also known for purchasing and constantly dumping meme coins, causing the value of these tokens to plummet in several cases.\n\nFeatured image from Newsway, chart from Tradingview.com"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vZXRoZXJldW0tYW5kLWJuYi1ob2xkZXJzLXNoaWZ0LWZvY3VzLXRvLW51Z2dldHJ1c2gtZm9sbG93aW5nLWl0cy1yZW1hcmthYmxlLWVhcmx5LWJpcmQtc3VjY2Vzcy_SAYcBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL2V0aGVyZXVtLWFuZC1ibmItaG9sZGVycy1zaGlmdC1mb2N1cy10by1udWdnZXRydXNoLWZvbGxvd2luZy1pdHMtcmVtYXJrYWJsZS1lYXJseS1iaXJkLXN1Y2Nlc3MvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum and BNB Holders Shift Focus to NuggetRush Following Its Remarkable Early Bird Success - Crypto News Flash",
        "content": "Demand for Spot crypto ETFs could boost Ethereum’s (ETH) current rally.\n\nBNB’s Binance Exchange has withdrawn its application for a financial license in Abu Dhabi.\n\nNuggetRush’s (NUGX) mining adventure could set a new standard for quality gaming and reward earning in the play-to-earn sector.\n\nEthereum (ETH) could soar to $2500 in early 2024 following the growing demand for crypto ETFs. BNB holders hope the recent regulatory issues around its exchange don’t worsen its market performance.\n\nAnalysts now say NuggetRush’s (NUGX) mining game could be the best option for making long-term profits. It features an innovative play to earn experience. Yet, can NUGX emerge as one of the top DeFi projects? Let’s discuss.\n\n>> Buy NuggetRush Now <<\n\nEthereum Eyes $2500 By Year End\n\nBullish Ethereum (ETH) investors believe the token can reach $2500 before the start of January 2024 due to the ongoing bullish rally in the market. Like other top altcoins, Ethereum has risen sharply since early November due to calls for spot crypto exchange-traded funds. Trading activity on Ethereum has since shot up leading to a sharp ETH rise.\n\nETH traded at $1,816 on October 31. A month later, ETH jumped by 14.9% to $2,087 on December 1. However, ETH has maintained its bullishness, rising by 12.6% to $2,352 by December 10.\n\nEthereum could capitalize on the growing bullishness due to the popularity of ETH staking in 2023. Since January, Over $40 billion worth of ETH has been staked, thus representing nearly 50% of total staked assets across all blockchains. Furthermore, analysts expect the first approved spot crypto ETFs to come in Q1 2024. This would further boost demand for Ethereum, thus pushing ETH up by 17.0% to $2,752.\n\nNuggetRush: Ethereum-Backed Gaming Ecosystem Takes Market by Storm\n\nThe play-to-earn gaming industry eagerly anticipates the upcoming launch of NuggetRush (NUGX), an adventure game that offers a deep dive into artisanal mining. NuggetRush (NUGX) offers super realistic gameplay where players will comb vast lands, looking for valuable mineral resources to extract. Players will use NFT characters to set up their mining operations.\n\nThe overall aim is to make each mining operation profitable. NFT characters will possess mining and business management skills. Using appropriate machinery, players will mine resources in return for high-value rewards like extra NFTs, game funds, and other in-game collectibles. Players will get to participate in various forms of solo challenges. They can also participate in group tasks and challenges, thus earning more rewards.\n\nNuggetRush (NUGX) is unrivaled in its play-to-earn mechanisms. Players can easily trade assets received from the game on its high-quality marketplace. They can also earn money from staking their game NFTs.\n\nThis would allow them to earn extra income without selling their assets. Finally, players who find special NFTs called RUSHGEMS can trade them for real gold. NuggetRush (NUGX) will then arrange the delivery of gold rewards to chosen locations.\n\nAnalysts say features like these could make NuggetRush (NUGX) one of the most popular NFT projects. Already, its ongoing blockchain ICO has sold over 80 million tokens, as many investors are eager to join its ecosystem.\n\nNuggetRush’s (NUGX) presale has entered its third round, rising by 30% from its first-round price of $0.01. NUGX currently costs $0.013, but it would jump again in round four of its presale.\n\n>> Buy NuggetRush Now <<\n\nBNB Holders Bemoan Mounting Regulatory Issues\n\nBinance exchange has faced a long list of financial troubles in 2023, which has caused great anxiety among BNB holders. One of its latest issues is the resignation of its founder as CEO over the exchange’s involvement in money laundering. The negative news caused a dip in BNB’s performance despite its sharp recovery.\n\nBNB was trading at $253.64 on November 20 following the market-wide bullishness. It fell by 9.4% to $229.69 on November 28, shortly after the resignation of its ex-CEO. As of December 10, BNB had recovered by 4.3%, reaching $239.73.\n\nBinance troubles have increased following the withdrawal of its bid for an investment management license. The company said the bid was no longer necessary for its global needs. Yet several BNB holders say the move might be related to its legal troubles in the US. The negative news could further dampen BNB’s prospects, pushing it down by 10.1% to $215.43.\n\nVisit NuggetRush Presale Website\n\n."
    }
]