[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjQvY2hpbmVzZS1ldGhlcmV1bS1jb25mbHV4LWRyYXdzLXNwb3RsaWdodC1hcy1ob25nLWtvbmctd2VsY29tZXMtcmV0YWlsLXRyYWRlcnMv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNS8yNC9jaGluZXNlLWV0aGVyZXVtLWNvbmZsdXgtZHJhd3Mtc3BvdGxpZ2h0LWFzLWhvbmcta29uZy13ZWxjb21lcy1yZXRhaWwtdHJhZGVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "'Chinese Ethereum’ Conflux Draws Spotlight as Hong Kong Welcomes Retail Traders - CoinDesk",
        "content": "“Plus, today we heard good news from Hong Kong’s SFC that retail crypto trading will be permitted under regulatory supervision. While those rules are restricted to BTC and ETH for now, this series of bullish news for the Greater China region work highly in Conflux’s favor,” Mei added."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvcGVvcGxlLWN1bHR1cmUvYml0Y29pbmVycy0ybS1iZXQtb24tZXRoZXJldW0tbmV2ZXItZmluYWxpc2VkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Bitcoiner Jimmy Song just won a $1.9m bet on Ethereum — or did he? - DLNews",
        "content": "Bitcoin evangelist Jimmy Song and Ethereum co-founder Joe Lubin made a bet in 2018 now worth between $1.5 million and $1.9 million in crypto\n\nBut the details were “never finalised,” Song tells DL News\n\nFive years ago, Ethereum co-founder Joe Lubin and Bitcoin evangelist Jimmy Song made a high stakes bet on the future of Ethereum. The results are in, and it appears Song would have won.\n\nBut “the bet was never finalised,” Song said.\n\n“We needed to finalise the arbiter and specific terms,” he told DL News. “I chased him for months on those and I couldn’t pin him down.”\n\nLubin did not respond to requests for comment sent to public relations representatives at his company, ConsenSys.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nIn 2018, the pair shared a stage at Consensus, a crypto conference organised by CoinDesk. Song, a so-called Bitcoin maximalist, said he saw no future for Ethereum. Lubin said he would bet “any amount of Bitcoin” Song was wrong.\n\nNOW READ: Why Ethereum is so dominant — and why it’s not going anywhere\n\nA year later, they hammered out the details: If Ethereum had five unique decentralised applications, or dApps, with at least 10,000 daily users and 100,000 monthly users during any six months in any calendar year before May 23, 2023, Lubin would win 810.8 ETH. That was worth about $600,000 in 2018, and about $1.5 million today.\n\nIf Ethereum did not have five popular applications, Song would win 69.74 Bitcoin, worth about $600,000 in 2018 and almost $1.9 million Tuesday.\n\nJoin the community to get our latest stories and updates\n\nIt seems as though Song would have won, though technicalities — are layer 2 blockchains, such as Optimism, dApps? — could have tipped the bet in Lubin’s favour. It was disagreement over those technicalities that apparently killed the bet.\n\n”He was trying to include all sorts of stuff into the active user metric, like posting an offer on some centralized server,” Song said. “I disagreed and I never heard back.”\n\nWithout layer 2 blockchains, it appears only Uniswap, the preeminent decentralised exchange, and NFT marketplace OpenSea have regularly hit 10,000 daily users and 100,000 monthly users, according to data from DappRadar.\n\nFrom August 2020 through the end of 2021, more than 20,000 crypto wallets interacted with Uniswap V2 almost every day, according to DappRadar. During the final seven months of 2021, the tail-end of crypto’s bull run, more than 10,000 crypto wallets interacted with a newer version of the Uniswap protocol, Uniswap V3, daily.\n\nInterest in V3 dropped along with crypto hype in 2022, but traders flocked back during a recent memecoin frenzy.\n\nNOW READ: ‘Sandwich bots’ filch millions off unwitting investors during meme coin rally\n\nBetween July 2021 and April, more than 10,000 crypto addresses interacted with OpenSea daily, according to DappRadar. Over the past month, about 5,000 crypto addresses interacted with OpenSea daily.\n\nThen there’s the issue of measuring an application’s user base. One person can control multiple crypto wallets. And few — if any — decentralised applications perform know-your-customer checks, making it difficult to measure how many users they actually have.\n\nHigh stakes bets are popular with industry high-rollers. Last year, pseudonymous crypto trader GCR made a $10 million bet on the future of Terra with Do Kwon, who was recently arrested in Montenegro.\n\nThe money was put in escrow, and GCR officially won in March of this year.\n\nThis story has been updated to include an additional comment from Song.\n\nHave tips? Contact the author at aleks@dlnews.com."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LnVzYXRvZGF5LmNvbS9zdG9yeS9tb25leS9pbnZlc3RpbmcvMjAyMy8wNS8yNC9iaXRjb2luLWV0aGVyZXVtLWxpdGVjb2luLXRvZGF5LzcwMjUyNjMyMDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Crypto, the Fed and the debt ceiling: Why Bitcoin, Ethereum, and Litecoin are falling today - USA TODAY",
        "content": "Bram Berkowitz\n\nThe Motley Fool\n\nWhat happened with cryptocurrencies today?\n\nSeveral of the largest cryptocurrencies fell today in what appeared to be a move driven by macro fears, uncertainty about the debt ceiling, and ahead of the release of the Federal Reserve's May meeting minutes today.\n\nSince late afternoon yesterday, the price of the world's largest cryptocurrency Bitcoin (CRYPTO: BTC) traded 3% lower as of 11:45 a.m. ET today. Meanwhile, the price of the world's second-largest cryptocurrency Ethereum (CRYPTO: ETH) traded 3.2% lower, while the price of Litecoin (CRYPTO: LTC) was down 5.3%.\n\nSo what\n\nPart of what's been dogging cryptocurrencies today is the constant tug-of-war investors are having about their view on the Fed and interest rates and whether on not the Fed will pause its rate-hiking campaign at its next meeting. Currently, roughly 72% of investors are betting on a pause but that's a smaller percentage than it had been recently.\n\nFast-rising interest rates over the last year have crushed the likes of crypto and Bitcoin because they make riskier assets less appealing. Crypto has rallied this year largely on the belief that the Fed is preparing to end its rate-hiking campaign.\n\nWill they raise them again?Powell says Fed interest rates may not need to rise as much amid banking stress\n\nInflation has slowed a good amount this year but is still far away from the Fed's 2% target and the job market still looks extremely strong, which has investors questioning whether or not the Fed has seen enough data to end its rate-hiking campaign.\n\n\"Most developed markets are grappling with a shared problem. Core inflation is proving more stubborn than expected and remains well above central banks' 2 per cent targets,\" BlackRock analysts wrote in a recent research note. \"We think that means central banks can't undo any of their inflation-fighting rate hikes any time soon, even if financial markets think the Federal Reserve will start cutting rates before the end of the year.\"\n\nOn top of all of this, U.S. lawmakers still haven't reached an agreement to raise the debt ceiling, and the June 1 deadline when the U.S. could potentially default on its debt is rapidly approaching. Treasury yields have risen as a result of the uncertainty, which usually leads investors to take a risk-off approach.\n\nNow what\n\nCryptocurrencies have been rising all year on the belief that a Fed pause is near, but now investors are less sure that a pause and the rate cuts the market had been pricing in will actually materialize.\n\nAt 2 p.m. ET today, the Fed will release the minutes from its meeting earlier this month, which could shed light on whether or not the Fed will pause rates at its June meeting. The fact that we still don't have an agreement to raise the debt ceiling is concerning, but I'm hopeful lawmakers will eventually come to their senses. Cryptocurrencies tend to do well when the traditional financial system struggles, but if the U.S. defaults on its debt it's hard to know exactly what would happen.\n\nWhat happens if the US defaults?What you need to know as the debt ceiling deadline nears.\n\nI continue to believe Bitcoin and Ethereum are here to stay long term and like them as long-term investments. I own a little bit of Litecoin and there's talk that the altcoin may benefit from its upcoming halving event, but I really prefer Bitcoin and Ethereum.\n\nBram Berkowitz has positions in Bitcoin, Ethereum, and Litecoin. The Motley Fool has positions in and recommends Bitcoin and Ethereum. The Motley Fool has a disclosure policy.\n\nThe Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY.\n\nOffer from the Motley Fool:10 stocks we like better than BitcoinWhen our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\n\nThey just revealed what they believe are the ten best stocks for investors to buy right now... and Bitcoin wasn't one of them! That's right -- they think these 10 stocks are even better buys.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of May 22, 2023"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLXN0YWtpbmctZGVtYW5kLXNreXJvY2tldHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Ethereum Staking Demand Skyrockets Following Network Upgrade - Blockworks",
        "content": "Ether (ETH) is witnessing its highest levels of staking activity following a critical update earlier this year.\n\nThe network’s transition to Proof-of-Stake (PoS) late last year, coupled with Ethereum’s “Shapella” network upgrade in April, which enabled withdrawals of staked ETH as well as rewards, has led demand for new validators to reach its highest level in two and a half years.\n\nPreviously, users could stake their ETH to the Beacon Chain as early as December 2020, but it wasn’t until Shapella was fully implemented that it became possible to withdraw.\n\nAs a result, over 1 million ETH was withdrawn shortly after the upgrade, sparking temporary concerns as to whether demand would simply rush to the exit indefinitely and cause the price of ETH to dip.\n\nYet, this rush has been balanced by an influx of eager validators waiting for activation, indicating a sustained demand for Ethereum staking, an analysis by Coin Metrics shows.\n\n“The entry queue has reached its highest level since the Beacon Chain’s genesis in December 2020, with a total of 64,000 validators eagerly waiting to participate,” Coin Metrics said.\n\nIn contrast, there are effectively zero validators wishing to withdraw, that are stuck in the queue. That’s a stark contrast to withdrawal queues just last month, which stood at roughly 17,500.\n\nThe surge of new validators has helped drive the active validator count to a new high of nearly 584,000, data shows. This number has more than made up for the transient decrease in complete withdrawals that occurred when withdrawals were initially introduced.\n\nAs the number of active validators approaches the 589,000 mark, an internal protocol parameter, known as the Churn Limit, will rise, allowing for the daily activation of an extra 225 validators.\n\nHowever, even with this increased pace, individuals or staking pools spinning up new validators to join the queue today would still need just over a month to become active, Coin Metrics noted.\n\nLiquid staking tokens predicted to fuel staking value\n\nA budding narrative in the decentralized finance (DeFi) world underscores the escalating demand for Liquid Staking Tokens (LSTs).\n\nThese tokens, representative of staked assets, bring a new level of liquidity to the traditionally illiquid PoS model by allowing staked assets to participate in DeFi applications while still contributing to the network’s security.\n\nThey provide a bridge between staking and DeFi by offering liquid tokens that represent staked ETH, allowing holders to freely interact with DeFi protocols while still earning staking rewards.\n\nThe growing prominence of LSTs within DeFi is intricately linked to Ethereum’s staking ecosystem. Behind every LST, there is a staking operation, providing the required security and validation for the Ethereum network.\n\nSome of the established decentralized players are jockeying for market share, such as Lido DAO (LDO), Frax (FXS) and Rocket Pool (RPL), alongside centralized staking providers such as Coinbase, and a slew of others, with new offerings cropping up regularly post-Shapella.\n\nIn essence, the explosion of LSTs within DeFi implies a parallel increase in Ethereum staking activity. As the role of LSTs becomes more integral to DeFi’s future, it may inadvertently fuel the demand for ETH, Blockworks was previously told.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvZXRoZXJldW0taXMtd29lZnVsbHktdW5kZXJ2YWx1ZWQtYnV0LWdyb3dpbmctbW9yZS1wb3dlcmZ1bC1kZWZpLWRhZC1oYWxsLW9mLWZsYW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Ethereum is 'woefully undervalued' but growing more powerful: DeFi Dad, Hall of Flame - Cointelegraph",
        "content": "DeFi Dad has 152,100 Twitter followers. He’s a DeFi podcaster, head of portfolios at Fourth Revolution Capital and a prolific crypto YouTuber.\n\nWho is this guy anyway?\n\nPodcaster and influencer DeFi Dad has been actively making crypto content since 2019 and now has a whopping 152,100 Twitter followers.\n\nHe’s also the head honcho of marketing and portfolio support at Fourth Revolution Capital, an adviser for several Web3 projects, including Zapper and Push Protocol, and hosts two podcasts, The Edge Podcast and The DeFi Podcast.\n\nSomehow, he still manages to tuck his two kids into bed every night and fight off monsters for them – which is completely on brand.\n\nBeen fairly checked out this week on vacation with kids and I have to say, it feels good to tune out while still having FOMO for what I missed.\n\n\n\nGot asked “don’t you enjoy being away from work?” and answer is “nah, I love what I do. And I love crypto.”\n\n\n\n😁 pic.twitter.com/631kznAFSU — DeFi Dad ⟠ defidad.eth 🦇🔊🐼 (@DeFi_Dad) February 24, 2023\n\nDeFi Dad, or DD, is a jack of many trades but has defied the old saying and actually mastered some, too.\n\nAfter completing his studies at the University of Chicago, he started a chemistry Ph.D. program with aspirations of becoming a teacher. He got bored of that idea and started a food delivery business, which he says “was a great and horrific experience.”\n\n“This was before Uber Eats and before the whole food delivery craze started. It was an exciting business.”\n\n“I’m pretty convinced I would be divorced today and probably have no children if I had stayed in food delivery,” he jokes.\n\nSeeking new challenges, DeFi Dad transitioned to software startups and then unexpectedly found himself selling “all sorts of camera equipment” in a camera shop.\n\n“I definitely have a lot of experience hopping different industries, which is probably why I ended up in crypto at one point in my life.”\n\nIt was during yet another role as a project manager at an events company in New York, where he was assigned to blockchain events, that DD discovered his passion for crypto, and he hasn’t looked back since.\n\nWho knows? In five years’ time, we might catch up with him only to find out he has become an astronaut.\n\nWhat led to Twitter fame?\n\nDeFi Dad exudes the vibe of a hustler determined to ensure his kids have a full plate every night.\n\n“No doubt it’s the typical combination of a lot of focus, really hard work, grinding it out and being present across as many different parts of Crypto Twitter at the same time,” he explains.\n\nHis early DeFi videos began amassing over 10,000 views during the first surge of interest in the topic in the lead-up to “DeFi Summer” in 2020.\n\n“I was very lucky with the timing that I was into DeFi in, like mid-early 2019, and obviously, it took off within a year’s time. It has exploded and become a mainstream talking point and financial news — that’s luck. Right place, right time.”\n\nDeFi Dad loves Ethereum and his kids, too. (Supplied)\n\nWhat to expect from his Twitter content\n\nDD describes his Twitter content as “advice on how to get started and how to upscale yourself in relation to DeFi, and Web3 games,” adding:\n\n“I’m more there to kind of help tell the story of what’s being built and why games need Web3 elements because we’re just not there yet — it’s way too early.”\n\nHe warmly welcomes memecoin enthusiasts to follow him on Twitter but wants to make one thing clear: He won’t be pumping them anytime soon.\n\n“I’m not someone who’s going to trade a memecoin like PEPE. I’m more of a long-term investor, but I’m super happy for folks making money off it,” he says.\n\nEvery now and then, you might be lucky enough to catch DD throwing out a cheeky price prediction.\n\nI think ARB goes to near $5-$10\n\n\n\nMid take: But that would put FDV at $100B! And that's absurd if you compare it to Optimism, Polygon, and others.\n\n\n\nI think the ARB price could shock people. — DeFi Dad ⟠ defidad.eth 🦇🔊🐼 (@DeFi_Dad) March 21, 2023\n\nWhat do you enjoy on Crypto Twitter?\n\nDD is an unashamed fanboy of Guy Turner, the founder and face of Coin Bureau, whose ethics he admires.\n\n“He has a team that acts with a lot of integrity, at least in my experience, and they are such great storytellers,” he says.\n\nDD admits he is “definitely trying to emulate” what Guy is doing by being very objective and creating content that is “going to onboard as many folks in the space as possible.”\n\n“There is a really fine line to ensuring that you don’t compromise on your ethics and become something of a shill.”\n\nTwitter Beef\n\nDD proudly states that he holds no grudges against anyone and jokes that his lack of Crypto Twitter beefs is “not going to be good for engagement on this article.”\n\nHowever, he doesn’t shy away from throwing some shade every now and then. When crypto exchange FTX collapsed, he didn’t hold back, taking a dig at Sam Trabucco, co-CEO of Alameda Research, calling him a “f*cking terrible trader.”\n\nNo, you didn't \"reach the point in life where I have to prioritize other things.\"\n\n\n\nYou're only ~29 yrs old and worked a job for 3 years.\n\n\n\nYou misused customer deposits from FTX, lost 11 figures, and then left before shit hit the fan.\n\n\n\nYou're a liar and a f*cking terrible trader. pic.twitter.com/XVOGwUQOmD — DeFi Dad ⟠ defidad.eth 🦇🔊🐼 (@DeFi_Dad) November 11, 2022\n\nWhile he’s a fan of healthy debates to keep people informed, he tends to avoid confrontation.\n\n“I don’t like being in conflict with people; I’d rather be more of a cheerleader for these different DeFi protocols,” he says.\n\nHe also tries to rally the troops following negative events, like the collapse of FTX, telling his followers that “crypto is so much bigger than FTX.”\n\nCan we stop saying today was the worst day in crypto history?\n\n\n\nCrypto is so much bigger than FTX\n\n\n\nCrypto is trustless\n\n\n\nCrypto is permissionless\n\n\n\nCrypto is decentralized\n\n\n\nFTX and Alameda were none of this\n\n\n\nSo good riddance\n\n\n\nLet’s get back to crypto\n\n\n\nOnward and upward\n\n\n\n🚀 — DeFi Dad ⟠ defidad.eth 🦇🔊🐼 (@DeFi_Dad) November 9, 2022\n\nPredictions?\n\nDespite being a man who steers clear of making price predictions, DD has confidence that Bitcoin’s price will skyrocket in the next decade, declaring:\n\n“I would be shocked if Bitcoin doesn’t go to $500,000, to a million, in the next 10 years.”\n\nBut as a DeFi Dad, it’s probably unsurprising that his big love is Ethereum.\n\n“To me, Ethereum is just woefully undervalued because of all the economic activity built on it,” he says.\n\nHe even likens Ethereum to the network effects and moats of Customer Relationship management platforms Salesforce and Marketo.\n\n“People use [Salesforce] as a database of all their contacts and all of the deal flow that they’re tracking,” believing that it hooks people in by seamlessly integrating with their business operations.\n\n“If you track all of your contacts and all of your sales data in it, that’s going to be very difficult to migrate away from and use a different software in the world,” DD says.\n\nHe compares this to Ethereum, saying that the more time is invested and “resources and data put into Ethereum, the more powerful it becomes over time.”\n\nAs for Ether’s price, DD states that $10,000 “is a conservative [price for Ether] at this point.”\n\n“It could go to $20,000 to $30,000 easily.”\n\nDD takes pleasure in shooting down those who underestimate the price potential of Ethereum.\n\nWhat FUD campaign is this @BanklessHQ?\n\n\n\nIs this an $ETH price for ants? pic.twitter.com/qasmZsxS6s — DeFi Dad ⟠ defidad.eth 🦇🔊🐼 (@DeFi_Dad) November 3, 2022"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZGVjcnlwdC5jby8xNDI0MTMvYml0Y29pbi1ldGhlcmV1bS1pZi11cy1kZWZhdWx0cy1vbi1kZWJ00gFHaHR0cHM6Ly9kZWNyeXB0LmNvLzE0MjQxMy9iaXRjb2luLWV0aGVyZXVtLWlmLXVzLWRlZmF1bHRzLW9uLWRlYnQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "What Happens to Bitcoin and Ethereum If the US Defaults on Its Debt? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe United States is barreling toward a date that could have historic consequences for global markets, running the risk of its first-ever debt default. It's a potential black swan event that could have an outsized impact on Bitcoin, Ethereum, and the rest of the crypto market.\n\nU.S. Treasury Secretary Janet Yellen warned weeks ago that the government would soon run out of funds if the debt ceiling isn’t suspended or raised—possibly as early as June 1. If lawmakers remain deadlocked and can’t come to an agreement on spending, Washington won’t be able to pay its bills, she said.\n\nSimilar standoffs over the debt ceiling have rattled markets in the past, like a prolonged disagreement over the debt ceiling that sent the S&P 500 tumbling 16% in 2011, startling investors before a resolution was reached.\n\nAD\n\nAD\n\nThis time around, Wall Street has yawned. The S&P 500 is down less than 1% since Yellen issued her sobering remarks on May 1. However, Bitcoin has fallen more than 7% and Ethereum is down nearly 3% during the same period, according to CoinGecko.\n\nAmerica's “X-date”\n\nTypically, debt ceiling debacles create more noise than market-moving news, Amberdata’s Director of Derivatives Greg Magadini told Decrypt—but he acknowledged that a U.S. debt default is far from off the table.\n\n“It feels like a pretty intense game of chicken right now,” he said. “And given how crazy things have gone in the past couple of years, I think anything is possible.”\n\nIn the event that the government defaults on its debts, risk assets like stocks and crypto would face short-term pain, Magadini said. He explained that’s because a drop in the quality of government-backed debt would likely raise borrowing costs, counterintuitively increasing its yield and strengthening the dollar compared to other assets.\n\nSimilarly, the dollar could strengthen during a U.S. default as American traders tend to onshore their dollars—swapping foreign currencies and assets for the greenback—during risk-off events, CoinShares’ Head of Research James Butterfill told Decrypt.\n\nAD\n\nAD\n\n“Technically speaking, the dollar should sell off in the event of a default, but it won't because people tend to onshore their dollars in periods of market stress,” he said. “The dollar might actually strengthen, perversely, because people are getting worried, and that actually won’t be so great for Bitcoin.”\n\nButterfill envisions the dollar will strengthen and Bitcoin will slide as the U.S. approaches what the White House has described as America's “X-date,” the official date at which the government can no longer pay its bills.\n\n“This is a really complicated scenario,” Butterfill said, noting he doesn’t think a default is likely. “It’s not that obvious what exactly will happen.”\n\nBitcoin May Bounce\n\nBitcoin and Ethereum could react differently in the event of a default, Amberdata’s Magadini said. Bitcoin may bounce alongside gold after an initial slide—as a check on government-issued currency—while Ethereum would likely remain depressed alongside tech stocks, he said.\n\nThe sentiment was echoed by Genesis’ Co-Head of Trading Gordon Grant, who told Decrypt that Bitcoin has more upside than Ethereum if the government can no longer meet its debt obligations, but both coins would face pressure initially.\n\n“Maybe there's an initial wick down, as risk assets get absolutely trounced, because the stock market is going to get decimated,” he said. “But Bitcoin is probably going higher.”\n\nFor Ethereum, Grant said that the second largest crypto by market cap is often tied to indexes tracking tech stocks like the NASDAQ, making it likely to underperform compared to Bitcoin if a default takes place.\n\n“It doesn't matter whether I think that that's a fair comparison,” he said, noting that that’s how certain models trade the relationship between things like the NASDAQ and Ethereum. “So, we would tend to expect underperformance of Ethereum.”\n\nAD\n\nAD\n\nSVB and Sausage\n\nAs an example of how crypto has performed during recent risk-off events, Grant pointed to Bitcoin’s outsized gains compared to Ethereum in the wake of several bank collapses in March, including Silicon Valley Bank. However, he noted that there’s zero data to suggest how cryptocurrencies could react if the government defaults for the first time in history.\n\nBoth Grant and Magadini highlighted increased activity in the options market for Bitcoin as a potential default draws closer, saying it suggests that traders—mostly institutional ones—are betting the coin will see increased volatility.\n\nAt the end of the day, Grant said he’s confident that lawmakers will exhaust their differences on Capitol Hill and reach an agreement like they always have. But, pointing to the logic of Bloomberg’s Tom Keene, Grant said the bigger question is whether events like these become more common in an ever-more-polarized political climate, and if they’ll ever go away.\n\n“We can ruminate and pontificate, but the real story is this phenomenon of the US government, as a debtor nation, bumping up against a debt ceiling,” Grant said, adding it’s become “how the sausage gets made in the 21st century.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvY2FuLXlvdS1zdGlsbC1taW5lLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Can You Still Mine Ethereum? - Watcher Guru",
        "content": "The Ultimate Guide to Mining Ethereum in 2021: Can You Still Do It?\n\nCryptocurrency mining has been a popular and lucrative venture for many individuals over the years, and Ethereum (ETH) has been one of the most popular cryptocurrencies to mine.\n\nHowever, with the recent transition to proof of stake, many people wonder if mining Ethereum is still viable.\n\nIn this ultimate guide, we will explore the ins and outs of Ethereum mining, what the transition to proof of stake means for miners, and how to get started with mining Ethereum.\n\nIntroduction to Ethereum Mining\n\nEthereum mining is the process of verifying transactions on the Ethereum network and adding them to the blockchain. Miners are rewarded with a certain amount of Ethereum for each block they add to the blockchain.\n\nIn the early days of Ethereum, mining was done using graphics cards, and it was relatively easy for anyone with a computer to mine Ethereum and earn a profit.\n\nWhat Made Mining Ethereum So Popular?\n\nOne of the main reasons why mining Ethereum became so popular was its profitability. Miners could earn significant money by using their computing power to add blocks to the Ethereum blockchain.\n\nAdditionally, Ethereum’s use of smart contracts made it an attractive option for many people who were interested in blockchain technology.\n\nThe Transition to Proof of Stake\n\nIn December 2020, Ethereum began transitioning from proof of work to proof of stake. Proof of stake is a different consensus mechanism that requires validators to hold a certain amount of ETH to participate in the network.\n\nThe transition to proof of stake will make it more difficult for miners to earn rewards, as they will no longer receive block rewards for adding blocks to the blockchain.\n\nWhat Does This Mean for Ethereum Miners?\n\nThe transition to proof of stake means that miners can no longer earn rewards by adding blocks to the blockchain.\n\nInstead, they must become validators and hold a certain amount of ETH to participate in the network. This means that mining Ethereum will no longer be profitable for most people.\n\nHow Do I Start Mining Ethereum?\n\nIf you are still interested in mining ETH, there are a few things you will need to do to get started.\n\nFirst, you will need to understand the Ethereum blockchain and consensus mechanism. You will also need to have a certain amount of computing power to be able to mine Ethereum.\n\nYou will also need a private key to access your Ethereum rewards.\n\nUnderstanding the Blockchain and Consensus Mechanism\n\nThe ETH blockchain is a decentralized ledger that is used to record transactions on the Ethereum network. The consensus mechanism used by ETH is changing from proof of work to proof of stake.\n\nProof of work requires miners to use their computing power to solve complex mathematical problems to add blocks to the blockchain.\n\nOn the other hand, proof of stake requires validators to hold a certain amount of ETH to participate in the network.\n\nBlock Rewards and Ethereum 2.0\n\nSource: Pixabay\n\nBlock rewards are miners’ rewards for adding blocks to the blockchain. With the transition to proof of stake, block rewards will no longer be given to miners. Instead, validators will be rewarded with transaction fees.\n\nEthereum 2.0 is the new version of ETH that is being developed to support proof of stake. It is expected to launch in 2021 and will significantly change the network.\n\nThe Energy-Intensive Nature of Mining\n\nMining is an energy-intensive process that requires a lot of electricity. In fact, Ethereum mining consumes more energy than the entire country of Iceland. This has led to concerns about the environmental impact of Ethereum mining and has prompted many people to switch to more energy-efficient forms of cryptocurrency mining.\n\nMaximizing Profits: Reducing Electrical Costs and Transaction Fees\n\nIf you are still interested in mining Ethereum, there are a few things you can do to maximize your profits. One way to do this is by reducing your electrical costs. This can be done by using energy-efficient hardware and finding a cheap electricity source.\n\nAdditionally, you can reduce your transaction fees by using a mining pool.\n\nThe Future of ETH Mining: The Merge\n\nThe merge is the process by which they will transition from proof of work to proof of stake. It is expected to happen in 2023 and will significantly change the ETH network. The merge will make it more difficult for miners to earn rewards, as they will no longer receive block rewards for adding blocks to the blockchain.\n\nLong-Term Potential\n\nSource: CNBC\n\nWhile mining may no longer be profitable for most people, there is still long-term potential in investing in mining. As the network grows and evolves, there may be new opportunities for miners to earn rewards. Additionally, investing in mining can be a good way to support the ETH network and contribute to its development.\n\nConclusion\n\nIn conclusion, mining Ethereum is no longer profitable for most people. The transition to proof of stake means that miners will no longer receive block rewards for adding blocks to the blockchain.\n\nHowever, there is still long-term potential for investing in mining.\n\nAs the network grows and evolves, there may be new opportunities for miners to earn rewards. Additionally, investing in mining can be a good way to support the Ethereum network and contribute to its development.\n\nIf you are interested in getting started with mining Ethereum, be sure to do your research and understand the risks involved. While it may no longer be a profitable venture, there are still opportunities to contribute to the ETH network and support its growth."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2Nhbi1ldGhlcmV1bS1wcmljZS1yZWFjaC0xMDAwMDAtZXZlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Can Ethereum Price Reach $100,000 ever? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Ethereum has held up better in Bitcoin’s slipstream over the past few weeks than it did at the start of the year. The Ethereum price lost against Bitcoin in the first few weeks of 2023 and was able to keep up with Bitcoin again in the spring. With the Shanghai update, a more important step towards Ethereum 2.0 was recently taken. But how high is the potential for the Ethereum price in the coming years and is the $100,000 mark ever possible?\n\nHow has the Ethereum price moved in the last few weeks?\n\nThe Ethereum price has seen more of a sideways movement in the last few weeks. After strong gains in the first 6 weeks of the year and at the end of March, the Ether token price stabilized at a high level.\n\nEthereum (ETH) price in the last 30 days, source: gocharting.com\n\nWhile the Ethereum price was not able to rise as much as the Bitcoin price, especially in the first quarter of 2023, Ethereum has performed comparatively well in the second quarter so far as Bitcoin. In the last few weeks, the ETH price has mostly moved in the range between 1,800 and 1,850 US dollars.\n\nHow high can the ETH price rise in the coming years and decades?\n\nEthereum has existed since 2015 and has seen extremely strong price increases in the last 8 years . The next step for the Ethereum course would be a five-digit course and thus an increase to $ 10,000. Some analysts already saw this course in the last bull market. But in the coming bull market 2024 / 2025, Ethereum should be able to reach this value.\n\nHowever, it is difficult to predict whether the Ethereum price can continue to rise so strongly in the coming bull markets. For this, Ethereum would have to experience another adaptation. The Bitcoin course also has the Bitcoin Halvings a mathematical way to higher and higher courses. The Ethereum course should be able to keep up with the Bitcoin course in percentage terms or even increase more.\n\nIf Ethereum can continue to keep its promises in the coming years and decades, a price increase for the Ether token is still very likely. With a continuous growth of the network and more and more new applications and adaptations, the Ethereum price could increase as much as the Bitcoin price.\n\nCan Ethereum Price Ever Reach $100,000?\n\nThe question is whether the Ethereum price can actually reach $100,000 one day. The Bitcoin price should very likely be able to reach this value in the next bull market. Theoretically, there is nothing standing in the way of an Ethereum price of $100,000 in the coming bull markets.\n\nIf the Ethereum price ever reaches the $100,000 mark, this should probably not be the case for at least 10 years. This would be the bull market in the early 2030s, the third from now. At the moment it is extremely difficult to predict whether Ethereum can maintain this price development in the next 10 years. But the possibility still exists.\n\n\n\n\n\nYou might also like\n\nMore from Blockchain"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvLm5ld3MvY3J5cHRvLWNvbS1saXN0cy1ldXJvLXBhaXJzLWZvci1iaXRjb2luLWV0aGVyZXVtLXRyYWRlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Crypto.com lists euro pairs for bitcoin, ethereum traders - crypto.news",
        "content": "Crypto.com, a popular cryptocurrency exchange, is listing the Euro and pairing it with several crypto assets, according to an update on May 24.\n\nThe exchange is taping into Euro’s liquidity, enabling the trading of bitcoin (BTC), ethereum (ETH), and USDT.\n\nEuro pairs\n\nThe crypto-euro trading pairs would allow users to deposit, trade, and withdraw supported cryptocurrencies with the Euro.\n\nYou might also like: Crypto.com launches an AI-focused product in tense market\n\nBy incorporating Euro trading pairs, the exchange expands the range of trading options available to users. This move caters to traders who prefer conducting transactions in Euros, offering them increased flexibility to diversify their portfolios.\n\nCrypto.com offers low fees, deep liquidity, advanced tools, and rewarding events.\n\nLow fees allow users to maximize their trading profits. This creates a cost-effective solution for institutional and retail clients looking to capitalize on the dollar’s adverse fluctuations against the Euro.\n\nCrypto.com is client-facing\n\nFurthermore, Crypto.com’s liquidity is crucial for traders who want seamlessly executed trades. With deep liquidity, the exchange minimizes slippage. Subsequently, this enhances price stability, creating the optimal trading environment for traders, even those choosing the Euro.\n\nIt also has a comprehensive suite of advanced trading tools designed to empower traders. Subsequently, introducing Euro trading pairs allows users to leverage these powerful tools for analyzing and executing trades.\n\nMoreover, Crypto.com provides real-time market data, charting tools, diverse order types, and risk management features so traders can make informed decisions.\n\nCrypto.com is committed to rewarding its user base through various events and promotions, and traders participating in Euro trading pairs can take full advantage of these incentives.\n\nIt offers bonus trading rewards, and Euro-exclusive benefits, ensuring traders are continually incentivized to participate.\n\nThese benefits are set to encourage users to get involved in trading Euro with popular cryptocurrencies like BTC, ETH, and USDT.\n\nWhile Euro deposits and withdrawals are currently available exclusively to institutional clients, Crypto.com has plans to make this feature accessible to retail clients in the near future.\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtd2lsbC1ldGgtcHJpY2UtbG9zZS0xNzAwLXN1cHBvcnQtb3ItbWFrZS1hLWNvbWViYWNrL9IBbWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvZXRoZXJldW0tcHJpY2UtYW5hbHlzaXMtd2lsbC1ldGgtcHJpY2UtbG9zZS0xNzAwLXN1cHBvcnQtb3ItbWFrZS1hLWNvbWViYWNrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Will ETH Price Lose $1700 Support Or Make A Comeback? - CoinGape",
        "content": "Ethereum Price Analysis: In the midst of growing uncertainty within the cryptocurrency market, a short support trendline protected the Ethereum price from excessive downfall. The coin price bounced thrice from the rising trendline in the last two weeks, indicating the buyers were buying at minor dips to reclaim lost ground. However, a sudden downtick in the crypto market today increased the outflow in ETH price and breached the support trendline for an extended downfall.\n\nEthereum Price Daily Chart\n\nA bearish crossover between the 20-and-50-day EMA may increase selling momentum in the market\n\nA breakout above the wedge pattern resistance will signal an early sign of trend reversal\n\nThe intraday trading volume in Ether is $5.5 Billion, indicating a 7.4% loss.\n\nSource- Tradingview\n\nadvertisement\n\nWith an intraday loss of 3.35%, the Ethereum price shows a decisive breakdown from the support trendline of the 4-hour time frame chart. Losing this support accelerates the selling pressure on the ETH price and projects a significant possibility of a potential downfall.\n\nThe post-breakdown fall may plummet the coin price by 4.7% to hit the combined support of $1700 and lower trendline of the wedge pattern. A retest to the support trendline could trigger a new recovery cycle in ETH price but for a sustained bull run it needs a daily candle closing above the trendline.\n\nA bullish breakout from the resistance trendline will offer a key signal to uptrend resumption and wait for buyers for an entry opportunity.\n\nWill Ethereum Price Break Below $1700?\n\nA successful breakdown below the ascending trendline has set the ETH price downfall to $1700. However, this level is accompanied by a support trendline of wedge pattern and 200-day EMA creating a strong demand zone for buyers. Thus, a higher probability lies in a potential reversal from this psychological level.\n\nSuper trend: the trend-defining indicator projecting a red film indicates the sellers regain trend control.\n\nAverage Directional Index: An uptick in ADX slope reflects the strength in selling pressure and a higher possibility of a potential fall."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy95YXlvLWNvcnBvcmF0aW9uLWRvbWluYXRlcy1jYW50by1jaGFpbi0xODE2MDA1MTQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "YAYO Corporation Dominates Canto Chain and Announces Ethereum Bridge for YAYO NFTs - Yahoo Finance",
        "content": "MIAMI, May 24, 2023 /PRNewswire/ -- YAYO Corporation, a subsidiary of the distinguished Remilia Corporation, is thrilled to announce its game-changing decision to launch an Ethereum bridge for the YAYO NFT. This grand event is being held exactly 2 years since YAYO Corporation first debuted by raising $600,000 for the $YAYO Coin ILO in May 2021. This bridge comes after a remarkable display of market dominance on Canto's native marketplace, Alto, where YAYO NFTs have significantly outperformed all other assets.\n\nThe YAYO Man is an archetype representing various facets of masculinity, culture, industry, and themes within both fiction and history that molds the minds and hearts of young men across the world.\n\nThe YAYO NFT initially launched on the Canto chain for a mint price of 250 $CANTO, approximately $100 USD. After successfully minting out in mid-April, YAYO proceeded to completely outperform every other NFT project on the Canto ecosystem, exceeding the marketcap and floor price of Canto's premiere official project \"Canto Longnecks\" and consistently topping the 24-hour volume rankings every single day. Most recently, the YAYO NFT shot past the 10,000 $CANTO floor mark, achieving a 4,000% return on the mint price and placing it in the number one slot as the highest performing Canto NFT of all time, exceeding every other project in price, volume, and unique owners of all-time.\n\nDespite initial lower-than-expected support on Canto, YAYO NFT's success story is a testament to its inherent value and powerful design. The collection of 4000 figures, complete with vehicles, weapons, outfits, and backgrounds, carries meticulously accurate metadata labels mirroring real-world brands, makes, and models. The artistry, citation depth, and tasteful design make YAYO NFTs a prized asset for collectors and enthusiasts.\n\nAfter successfully reaching the number one spot on Canto and hitting every milestone the YAYO Corporation set out to achieve, they are now launching their planned Ethereum bridge on the two-year anniversary of their initial launch to find bigger fish to fry, in a one-way opt-in process which is set to further enhance YAYO's presence and value in the wider NFT ecosystem.\n\nStory continues\n\nAbout YAYO Corporation: The Yoshimoto Atlantic Yield Optimization Corporation is the premiere project of the Remilia Corporation, an iconic art collective and powerhouse in the fields of technology and finance. YAYO Corp has a distinguished history as a trend setting brand in crypto and has established a high energy community of motivated individuals looking to better themselves physically, mentally, financially, and spiritually. You can learn more about YAYO Corp through Twitter, https://twitter.com/YayoCorp, and can join the YAYO Community on their Discord: https://discord.com/invite/nbZtr7gcsg\n\nMedia Contact:\n\nMichael Dragovic\n\n727-275-0268\n\n359605@email4pr.com\n\nEvery YAYO NFT features assets that use real-world brands, makes, and models directly in the metadata.\n\nCision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/yayo-corporation-dominates-canto-chain-and-announces-ethereum-bridge-for-yayo-nfts-301833869.html\n\nSOURCE Remilia Corporation"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvYXJlLWV0aGVyZXVtLWFkZHJlc3Nlcy1jYXNlLXNlbnNpdGl2ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Are Ethereum Addresses Case-Sensitive? - Watcher Guru",
        "content": "Ethereum has remained a revered name in the digital asset sector and a widely used blockchain network. As the growth of the market continues and people gravitate toward the development, we break down some commonly asked questions related to these programs. Now, let’s delve into whether or not Ethereum addresses are case-sensitive.\n\nThere are few networks as adopted as Ethereum, and as such, addresses Subsequently, ensuring that you have the correct address is a vital part of transferring digital assets. Thus, knowing the case sensitivity of the addresses is a crucial aspect of it.\n\nEthereum Addresses\n\nSource: Redot.com\n\nNow, before we delve into case sensitivity, let’s understand these indicators a little more. An ETH address is kind of like your own ID on the blockchain. Moreover, this identifiable marker is how you are differentiated from every other entity operating within the network. Additionally, it allows the program to identify if the address is related to a wallet address, a smart contract, or a transaction.\n\nA wallet address is your own public account that holds your digital assets. Moreover, this is only accessible with private keys. Alternatively, your Ethereum address is derived from the last 20 bytes of the public key that controls that specific account.\n\nSpecifically, Ethereum addresses are indicated by a 42-character string of hexadecimal (HEX) figures. These can be both letters and numbers, and all represent sixteen values per individual character.\n\nThe address uses 0–9 to represent their sum value while using a–f to indicate the numbers 10–16. Moreover, these addresses typically start with 0x, which shows that the subsequent string is HEX.\n\nThese values are vital to get correct when inputting them into the Ethereum network. Moreover, sending ETH to a specific wallet relies on the correct input of the specific HEX string to maintain the correct address. Yet, does that mean that the letters of the string are case-sensitive?\n\nCase Sensitivity\n\nSource: Tech Republic\n\nEthereum addresses are not case-sensitive. Moreover, the string figures that represent the ETH address will only rely on the correct delineation of characters. Thus, the Ethereum network will not ensure that some figures are captured because it cannot differentiate between the two.\n\nIf you are sending ETH to an address that begins “0xJFJ754…” The system will not alter the destination if that is articulated as “0xjfj754” because the network identifies them as the same. Conversely, although the address in capital or lowercase letters is the same, there are addresses with potentially one character difference. Subsequently, to prevent withdrawals to a misspelled address, a checksum is displayed.\n\nMoreover, if you observe an Ethereum address with different case letters, it is an optional checksum. This cryptographic feature ensures that individual assets are being transferred to the correct addresses, as transfers to the wrong address are irreversible.\n\nConversely, although your Ethereum address is not case-sensitive, it is important to understand what funds you can or cannot receive on your network. Consequently, the Ethereum network can only support specific funds. Thus, it’s vital to know which those are and transfer them accordingly.\n\nConclusion\n\nLike most other networks, Ethereum addresses are not case-sensitive. However, there may be some letters capitalized in a specific address that represents a checksum. Ultimately, this is a way of ensuring that the address is valid and the transferred funds are arriving at the intended location."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGVjcnlwdC5jby8xNDIzOTcvYml0Y29pbi1ldGhlcmV1bS1sb3NlLXN0ZWFtLWdhbWluZy10b2tlbnMtcm5kci1zYW5kLWdhaW7SAVhodHRwczovL2RlY3J5cHQuY28vMTQyMzk3L2JpdGNvaW4tZXRoZXJldW0tbG9zZS1zdGVhbS1nYW1pbmctdG9rZW5zLXJuZHItc2FuZC1nYWluP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Lose Steam Amid Ledger Controversy and US Market Uncertainty - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum lost some momentum over the past week, cutting a three-week flatline amid the Ledger Recover controversy and growing concern over the U.S. debt ceiling deadline.\n\nBitcoin, the largest cryptocurrency, saw a 3.5% loss over the past week and is currently trading at $26,328 dollars. ETH fell to $1,786, marking a 1.3% loss on the week, according to Coingecko.\n\nAmid the top 50 cryptocurrencies, the market saw a lot of movement over the past seven days, with a few notable winners and some big losers.\n\nAD\n\nAD\n\nThe biggest gainer of the week is Render (RNDR), which has seen an impressive 19.3% growth on the week. In the past day alone, it has climbed 13.6%–currently trading at $2.82. The Render Network is a decentralized platform that enables users to contribute their unused GPU power to render motion graphics and VFX.\n\nRNDR has been trending on Twitter this week thanks to its recent partnership with Apple and its integration with Solana. The big green candle could also be fueled by Render’s work on the new Pudgy Penguins toy line video. Last week, Pudgy Penguins CEO Luca Netz celebrated the project's toy line launch on Amazon, saying \"I want Pudgy Penguins to be the face of NFTs.\"\n\nThe Sandbox game (SAND), a popular immersive Gamefi platform, commanded second place over the past 24 hours, gaining 5.4% and currently changing hands at $0.51. These gains come alongside recent partnerships announced by the team with BBC mainstays \"Top Gear\" and \"Doctor Who.\"\n\nNot everything is green, however, with notable losses on both weekly and daily markers for other top 50 assets besides Bitcoin and Ethereum.\n\nSomewhat expected after the unsustainable rocket ship it had become, meme coin superstar $PEPE has seen a not so impressive week, losing 10.5% of its value over the past seven days. But in the last 24 hours it saw a slight 3.3% jump, currently trading $0.00000143.\n\nAD\n\nAD\n\nBut Pepecoin isn’t alone in the red.\n\nNot long after its official mainnet launch, Sui’s native SUI token was one of the biggest losers on the week with a 15.8% drop, trading at $0.98 cents. Ethereum scaling solution Optimism (OP) also had a rough week, seeing a 12.6% red candle and swapping hands at $1.60. And decentralized app platform Algorand (ALGO) also saw double digit losses, trading at $0.15 after an 11% loss over the past week."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2RvbnQtb3ZlcnVzZS1zb2NpYWwtY29uc2Vuc3VzLXZpdGFsaWstd2FybnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Don't Overuse Social Consensus, Vitalik Warns - Blockworks",
        "content": "Ethereum co-founder Vitalik Buterin advised the developer community to guard against overburdening the networks’ social consensus — the ultimate arbiter of what the Ethereum network canonically is.\n\nStaked ether, so crucial to network security, is poised to become an important collateral asset in DeFi, through the use of liquid staking tokens (LSTs), such as Lido’s stETH and Rocketpool’s rETH. But it’s also expected to become useful in other contexts, thanks to bleeding edge tech, such as the restaking primitive from Eigenlayer, which will allow staked ETH to serve a dual function.\n\nIn his first blog post about Ethereum since March, Buterin extended the credible neutrality imperative to any attempt to leverage the Ethereum validator set — including, but not limited to restaking — warning against efforts to “recruit Ethereum social consensus for [an] application’s own purposes.”\n\nIn the form of a cautionary thought experiment using Harry Potter characters, Buterin outlined certain risks that could arise if proposals to rehypothecate staked ether are not carefully thought through.\n\nRe-using validators’ stake can be done safely, he argues, so long as the social consensus isn’t relied upon as a backstop.\n\n“If […] you have the intent to rope in the broader Ethereum ecosystem social consensus to fork or reorg to solve your problems, this is high-risk, and I argue that we should strongly resist all attempts to create such expectations,” Buterin wrote.\n\nAs an example of a “high-risk” gamble, Buterin pictured a layer-2 created by “Hermione” that grows to become the dominant scaling solution. The fictional Ethereum wizard claims that her layer-2 is thus the most secure, “because if there is a bug that causes funds to be stolen, the losses will be so large that the community will have no choice but to fork to recover the users’ funds.”\n\nArbitrum One currently has $5.77 billion in total value locked (TVL) according to L2Beat, more than triple the size of the next largest scaling solution, Optimism.\n\nRight now, there is no indication that a catastrophic bug in Arbitrum would prompt calls for Ethereum mainnet operators to take action. But since Arbitrum’s developer, Offchain Labs, also owns Prysmatic Labs — the company behind the second-largest Prysm consensus client — it’s not an absurd proposition, either.\n\nButerin doesn’t want a repeat of The Dao, or the Parity bug, both of which challenged Ethereum’s social consensus at a time when the network was much smaller.\n\nIn the former case, the network forked, leaving behind Ethereum Classic (ETC), which continues to operate at a $2.5 billion market cap to this day. In the latter, the network did not fork, and 513,774 ether were locked forever. That was a painful choice, but it set a precedent for the future: Ethereum transactions are immutable, what Buterin refers to in his post as the blockchain’s “purity.”\n\n“A blockchain’s ‘purity’ in the sense of it being a purely mathematical construct that attempts to come to consensus only on purely mathematical things, is a huge advantage,” he wrote.\n\nHe urged avoidance of “perverse too-big-to-fail mechanics,” to “preserve the chain’s minimalism, support uses of re-staking that do not look like slippery slopes to extending the role of Ethereum consensus, and help developers find alternate strategies to achieve their security goals.”\n\nEigenlayer co-founder Sreeram Kannan, was quick to agree, in a Twitter thread:\n\n“a) don’t build complex financial primitives on restaking — they can spiral out\n\nb) don’t rely on Ethereum to fork for application layer errors — this is a super important principle\n\nc) do not use subjective slashing — as it is subject to tyranny of the dishonest majority.”\n\nThere are “three underlying trust models underpinning Eigenlayer,” according to Kannan. These are economic trust, decentralization trust and ETH validator commitments, and each with their own potential use cases.\n\nBut it remains to be seen which, if any, will be embraced by Ethereum validators.\n\nBlockworks Research analyst Ren Yu Kong is skeptical that there will be a wide variety of restaking applications that will pass muster with Ethereum validators.\n\n“I believe that there won’t be many projects out there that are worth a validator to restake with given the additional risks incurred for a small marginal return, and now Vitalik has highlighted an important additional ‘social consensus’ risk,” he said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvY2FuLWV0aGVyZXVtLW92ZXJ0YWtlLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Can Ethereum Overtake Bitcoin? - Watcher Guru",
        "content": "They are the two pillars on which the industry is currently standing. Ethereum (ETH) and Bitcoin (BTC) have become two names synonymous with crypto and have risen to prominence as networks that are rivaled by few. Yet, with one clearly in front, could Ethereum ever truly overtake Bitcoin?\n\nFor anyone who has ever embraced blockchain technology or even inquired about it, these are probably the first two names you have heard. Yet, for as prominent as they both are, Bitcoin remains the standard bearer as the highest-priced crypto on the market. However, as Bitcoin and Ethereum remain the top two cryptocurrencies by market cap, could a change of guard ever truly take place?\n\nCould a Flip Ever Happen?\n\nSource: The Street\n\nEthereum is a protocol developed by Vitalik Buterin that has been among the most popular in the industry. Moreover, it has consistently been building on its own infrastructure and ecosystem to develop a highly sought-after blockchain network.\n\nAlternatively, Bitcoin is credited as the first cryptocurrency. Launched in 2009 by the pseudonymous Satoshi Nakamoto, it started it all. Thus, it has a kind of head start on all of its competition. However, Ethereum has consistently been on its tail and could justify a flip at some point.\n\nThe bull run of 2021 saw Bitcoin’s market cap exceed the $1.2 trillion mark. It was a significant moment in history, and it was followed up by 2022’s ravenous crypto winter. Contextually, Ethereum saw a rally to a $500 billion market cap that was equally impressive as BTC. However, the same treacherous 2022 saw it retreat below the $200 billion mark.\n\nMoreover, these kinds of discussions have been taking place for years within the industry. Creating two sides of the aisle: those who believe it could be done and those who do not. However, there is an inherent belief that if it were to be possible, it would require Ethereum to surpass Bitcoin in market cap.\n\nThat prospect seems incredibly far-fetched considering the positions of both, but is it impossible?\n\nCurrently, both assets are still first and second in overall market cap, respectively. Specifically, Ethereum has a market cap of $215 billion, while Bitcoin has a market cap of $509 billion.\n\nSubsequently, the difference is astounding, which makes the premise of a potential flip even more interesting. Ethereum would have to more than double its market cap in order to surpass Bitcoin. Thus, it would need to execute that step to eventually overtake it. Is it possible?\n\nEthereum (ETH) Functionality\n\nSource: Redot.com\n\nThe primary hope that lies in Ethereum’s prospect of overtaking Bitcoin is in its functionality. There were many who thought that the highly publicized Merge event could make ETH some headway. Specifically, its transition from a proof-of-work (PoW) consensus mechanism to a proof-of-stake (PoS) consensus mechanism\n\nAlthough the development did not flip the script, it presents the greatest chance that the protocol has. Bitcoin is primarily utilized as a wealth tool for investors, and that is the reason for its catapulting value since its inception. Alternatively, Ethereum is a programmable blockchain, that has become a haven for crypto developers.\n\nThus, as the industry continues to move forward and evolve, Ethereum has positioned itself at the forefront. The Ethereum blockchain has already been the preferred network for advanced decentralized applications and smart contracts which continue to enhance the pool of developers flocking to the platform.\n\nThere have been 3,000 dApps constructed on Ethereum, with statistics showing that the trend is likely to continue upward. Subsequently, as the entire Web3 ecosystem continues to develop and grow, much of that progression is taking place on Ethereum. Therefore, it is important to note that Bitcoin’s age could make it unable to match the utility provided by ETH.\n\nEthereum’s smart contract capabilities are at its core. In 2015, the functionality where added, and more than 3,900 developers joined the ecosystem in 2021. Thus, it had appropriately been perceived as the most active blockchain on the planet. Still, that growth is only continuing, not only with the Merge in 2022 but with the recently integrated Shanghai upgrade.\n\nBitcoin (BTC) Current Status\n\nSource: News18\n\nAlthough its functionality is certainly an aspect that it excels at, Ethereum does boast a host of competitors. Moreover, alternatives have emerged to challenge ETH in the avenue of functionality. Leading to protocols like Solana being labeled “Ethereum Killers.”\n\nConversely, although utility can breed competition, there is no competitor that can beat Bitcoin at being first. Moreover, the adoption and status that BTC has embraced since its development has granted it something that no other digital asset may ever be able to replicate.\n\nThe headstart it got over every alternative presents a nearly impenetrable lead over the competition. Subsequently, Ethereum potentially overtaking Bitcoin is something that could happen, but certainly not anytime soon.\n\nAdditionally, as fiat currency continues to be threatened by macroeconomic factors, Bitcoin only grows in necessity. The wealthy remain attached to the asset as the US dollar falls, and international tensions over currency mount. Bitcoin is poised to present a relatively safe alternative as an asset fixed in value."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL21ldi1wcml2YWN5LWluLWJsb2NrY2hhaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "MEV and the Dark Forest: Why We Need Privacy in Blockchain - Blockworks",
        "content": "Lurking in what is sometimes referred to as the “Dark Forest,” programmed predators seize value from unknowing victims as they attempt to perform blockchain transactions.\n\nThe concept of a “Dark Forest” originates from a novel written by Cixin Liu, describing a setting in which the discovery of someone’s location portends their inevitable doom at the hands of sophisticated predators. It is often compared to Ethereum’s hostile and murky block-building environment.\n\nHunting for victims in Ethereum’s public mempool, automated searchers prey on transaction orders as they are discovered in a practice called MEV, extracting value from their targets’ activities through frontruns and sandwich attacks.\n\nIn an interview with Blockworks on a recent Bell Curve podcast, Hasu, strategy lead at Flashbots, spoke with host Mike Ippolito about the necessity of building privacy mechanisms to protect users from MEV exploits.\n\nThe quest for privacy\n\n“I would say there are three different camps in crypto, when it comes to privacy, that have very different motivations,” Hasu says. First on his list is the “ideologically-driven crowd,” motivated primarily by the principle of privacy as a human right.\n\nSecondly, Hasu says, a more “academic camp” of curious, privacy-focused crypto researchers study zero knowledge, cryptography, and trusted execution environments in their quest for improving privacy.\n\n“They are in it,” he says, “for the intellectual challenge.”\n\nThe third camp consists of mechanism and market structure designers, Hasu explains, who strive for privacy to build “credible mechanisms that work.” As strategy lead at Flashbots, Hasu identifies himself as one such builder.\n\nPrivacy, Hasu says, is “extremely important when you want to build a good market structure.” This is especially the case in the MEV supply chain, he says. “Privacy is very important because there’s a lot of informational value in the bids.”\n\n“Just seeing the intent of a person, what they want to do,” he says, gives the searcher “a financial edge because you can frontrun them” and “do harm to them.”\n\nHasu believes that privacy is also crucial for successful collaboration in the building process. “We want validation and block production to be decentralized.”\n\nCentralized actors who could monopolize the MEV supply chain would wield extraordinary power, he says. Instead, he advocates for a broader distribution of smaller searchers and block builders to collaborate in the block-building process.\n\n“This collaboration doesn’t work without strong privacy because you always have to be very aware that others can steal your bundles and steal money from you.”\n\n“Privacy is of fundamental importance for the MEV supply chain,” Hasu says, noting, “We couldn’t achieve our goals” without solving “the privacy puzzle.”\n\nMEV-Share\n\nIppolito mentions the privacy innovations of Flashbots’ MEV-Share tool as an example, which enables users to “directly control which parts of their transaction they wish to share with searchers.”\n\nHasu explains that with MEV-Share, searchers are limited in their ability to see information about user orders, protecting the transactions from MEV exploitation.\n\n“We reveal some amount of information, not enough to frontrun, but just enough to constrain the search space, so that searchers are not completely blind.”\n\nThe block builders in this system, Hasu explains, are in charge of “running this simulation and matching the orders.”\n\n“For searchers, it’s a completely new paradigm,” he says. “Searching on private data is not what they’re used to, but we think it yields fundamentally better outcomes for users.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGgtY2FuLWJlLXNlY3VyaXR5LWFuZC1jb21tb2RpdHktc2F5cy1mb3JtZXItY2Z0Yy1jb21taXNzaW9uZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "ETH can be both a security and a commodity, former CFTC commissioner says - Cointelegraph",
        "content": "Ethereum’s native Ether (ETH) token may be both a commodity and a security, the former commissioner of the United States Commodities Futures Trading Commission has claimed.\n\nSpeaking on a May 23 episode of Laura Shin’s Unchained podcast, Dan Berkovitz, who is also the former general counsel at the Securities and Exchange Commission, said that it’s legally possible for ETH to fall under the jurisdiction of both regulatory agencies.\n\nLaura Shin, Dan Berkovitz and Colin Lloyd speaking on the Unchained podcast. Source: YouTube\n\nThe ongoing confusion over Ether’s legal status stems in large part from conflicting statements from the CFTC and the SEC. Over the course of the last six months, the CFTC has repeatedly called Ether, along with a number of other cryptocurrencies, a commodity.\n\nMeanwhile, the Gary Gensler-led SEC hasn’t explicitly provided Ether with a designated legal category. Gensler said at an oversight hearing in April that everything but Bitcoin (BTC) should be deemed a security and has refused to further elaborate.\n\nWhile the claim that Ether could be simultaneously a security and commodity may strike many as a contradiction, Berkovitz said that due to the overlapping legal definitions of commodities and securities it’s possible for an asset to be classified as both.\n\n“The law is clear. Something can actually be both a commodity and a security.”\n\nBerkovitz explained the confusion arises because commodities aren’t purely physical items like “wheat” or “oats” and that anything that falls under the purview of a “futures contract” can technically be defined as a commodity. This explains why the term “futures” is a part of the name of the CFTC itself.\n\nAlternatively, Berkovtiz said that a security, which is defined by the Securities Act and the Exchange Act — and includes things like notes and investment contracts — can also be the subject of a futures contract, which then places it under the purview of the CFTC as well.\n\nThe CFTC’s main regulatory purview captures the regulation of futures and swaps on commodities, while the SEC solely regulates securities. However, if something is a commodity in the eyes of the CFTC as well as a security under the SEC’s definition, it’s entirely possible for both regulatory bodies to have jurisdiction over it.\n\nOn the podcast, Collin Lloyd, a partner at multinational law firm Sullivan & Cromwell, took aim at the SEC’s claim that everything excluding Bitcoin should be designated a “security” status under federal ecurities law.\n\n“I don’t see anything in the case law that tells me that some string of digits that operates on a blockchain can natively just be a security,” said Lloyd.\n\n“It’s kind of a weird question to be asking, ‘Is this digital asset a security or not?’ I think you should be asking, ‘Is this digital asset being sold as part of a securities transaction?’ That depends on the facts and circumstances.”\n\nNotably, Sullivan & Cromwell is currently working on the FTX bankruptcy case and was hired by Coinbase on April 29 to aid the crypto exchange in its battle over opaque regulation with the SEC.\n\nMagazine: ‘Moral responsibility’ — Can blockchain really improve trust in AI?"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWNvbnRpbnVlcy1zeXN0ZW0tc3RhYmlsaXR5LXVwZ3JhZGVzLWRlc3BpdGUtcmVjZW50LWJsb2NrLWZpbmFsaXR5LWluY2lkZW50cy_SAW5odHRwczovL3p5Y3J5cHRvLmNvbS9ldGhlcmV1bS1jb250aW51ZXMtc3lzdGVtLXN0YWJpbGl0eS11cGdyYWRlcy1kZXNwaXRlLXJlY2VudC1ibG9jay1maW5hbGl0eS1pbmNpZGVudHMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Ethereum Continues System Stability Upgrades Despite Recent Block Finality Incidents - ZyCrypto",
        "content": "Advertisement\n\nThe Ethereum protocol recently experienced two incidents in which its Beacon Chain stopped finalizing blocks. This occurred on May 11, 2023, when the network was unable to fully confirm transactions for about 20 minutes and again on May 12, 2023, for over an hour.\n\nGenerally, block finality refers to a state where a supermajority of validators have attested to the final state of the blockchain, guaranteeing that a block and its processed transactions cannot be modified or eliminated from the blockchain.\n\nBlock finality implies that a block of data has been added to a blockchain with some negligible probability of being reversed or altered. Blockchains like Bitcoin and Ethereum show probabilistic transaction finality in that transactions are not automatically or instantly final, but the probability of being reversed decreases as more blocks are added to the chain.\n\nDuring the two finality incidents, Ethereum end users successfully continued to transact on-chain through the incident. Ethereum Developers released patches to resolve the block finality incidents but said an analysis was underway to determine the root cause of the problem.\n\nIn a May 21, 2023 blog, Ethereum co-founder Vitalik Buterin cautioned against overloading Ethereum consensus beyond its core functions of validating blocks and securing the network, as this could bring high systemic risks to the ecosystem. In the same blog, Buterin called for preserving the chain’s minimalism and helping developers find alternate strategies to achieve their security goals.\n\nAdvertisement\n\nThe Ethereum protocol has undergone several major upgrades and improvement plans to make it more robust and reliable.\n\nIn September 2022, the Merge upgrade was implemented. In the Merge, the Ethereum protocol moved from its original proof-of-work mechanism to a proof-of-stake mechanism. The merge aimed to make the Ethereum protocol less energy-intensive, more secure, and better suited to implementing new scaling solutions.\n\nIn November 2022, Buterin outlined an updated Ethereum protocol roadmap in line with its vision of enhancing scalability, security, and sustainability. Buterin said that the Ethereum protocol is undergoing several system upgrades and will ultimately enter a state of relative stability that optimizes safety and predictability.\n\nAccording to Buterin, the Ethereum protocol roadmap consists of six parallel running upgrades: the Merge, the Surge, the Scourge, the Verge, the Purge, and the Splurge.\n\nAnother upgrade known as the Ethereum ‘Shapella’ upgrade was implemented in April 2023. The Shapella upgrade enabled stakers to unstake ETH and validators to withdraw previously staked ETH. The Shapella upgrade was implemented with other Ethereum Improvement Proposals, including reducing gas fees during peak network periods."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vbmZ0cGxhemFzLmNvbS9iaXRjb2luLW5mdHMtcGFzcy1zb2xhbmEv0gEzaHR0cHM6Ly9uZnRwbGF6YXMuY29tL2JpdGNvaW4tbmZ0cy1wYXNzLXNvbGFuYS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Bitcoin NFTs Surpass Solana but Ethereum Retains Top Spot - NFT Plazas",
        "content": "Bitcoin NFTs Surpass Solana but Ethereum Retains Top Spot\n\nBitcoin NFTs monthly trading volume exceeded Solana this month, despite Ethereum still holding the top spot with an NFT volume of $393 million (double Bitcoin’s 30-day volume starting April 23). Nevertheless, Bitcoin now overrides notable blockchains like Solana, Polygon, ImmutableX and BNB Chain — a remarkable achievement for these recently launched collectibles.\n\nOver recent months, the NFT market observed a shift in media-based Bitcoin ordinals, otherwise known as Bitcoin NFTs. Following this success, the popular Bitcoin NFT marketplace, Magic Eden, is competing with UniSat’s volume, the world’s first open-source browser extension wallet for Bitcoin NFTs.\n\nThe implementation of #Bitcoin ordinals spurred NFT activity on $BTC. Over the past 30 days #Bitcoin has seen the second most NFT sales volume among all blockchains: h/t @cryptoslamio pic.twitter.com/q8qnHCcLfD — Osprey Funds (@OspreyFunds) May 23, 2023\n\nEthereum vs. Bitcoin\n\nOn the flip side, Bitcoin Frogs has been boosting Bitcoin’s trading volume. For example, Bitcoin Frog #2276 sold for 0.2 BTC ($5388.72) on Magic Eden on May 19. Significant sales like this one have led to the “crypto amphibians” overriding Bored Ape Yacht Club (BAYC), which only recorded $40 million in trading volume from April 23 to May 23. Regardless, the Bitcoin NFT ecosystem continues to lag behind Ethereum.\n\nOne of the critical reasons Ethereum remains at the peak for monthly trading volume includes holding numerous notable NFT projects: BAYC, Azuki, CryptoPunks and Milady Maker. BAYC and Azuki are NFTs associated with popular metaverse projects, whereas CryptoPunks and Miladys are in high demand due to having limited availability and early market entry. In addition, the blockchain network also supports numerous DAOs and integration benefits, stimulating the decentralized finance ecosystem to be worth $27.5 billion.\n\nDespite Milady already having a name for itself in the NFT realm, this month, the NFT collectibles noticed a rapid surge due to Elon Musk tweeting one of the customized PFPs, assisting Ethereum to continue claiming the prime position.\n\nAs the exciting NFT space continues to shift, progressing developments represent the unpredictability and potential of this blockchain-driven creative space.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvdG9ybmFkby1jYXNoLWRhby1hdHRhY2tlci1tb3Zlcy1zdG9sZW4tZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Tornado Cash DAO Attacker Moves Stolen Ethereum - Watcher Guru",
        "content": "The Tornado Cash DAO Hacker has begun to move the stolen Ethereum (ETH) and Torn (TORN) tokens. On Wednesday night, 100 ether (ETH) and 38,000 torn (TORN) tokens were moved by addresses connected to the hacker. According to Etherscan data, the hacker used the Tornado Cash protocol for the movement.\n\nAn unnamed attacker, or attackers, took control of the DAO responsible for the privacy-focused crypto mixer’s operations on Saturday. The hacker also took control of the DAO’s funds and future plans. The attacker continues to have access to potentially all of Tornado Cash’s treasury cash and currently has over 20 ether ($35,684) in their wallet.\n\nA fraudulent proposal was put out by the attacker, hiding a computer function that gave them a fake governance vote. Some components of Tornado Cash, including torn tokens held in the primary governance contract, were accessed using fake votes, and also the stolen Ethereum. The hacker could also withdraw locked torn tokens.\n\nHowever, the Tornado Cash protocol itself is unaffected by the attack. Moreover, this assault did not take advantage of any smart contracts or other Tornado Cash-related technology.\n\nTornado Cash users sue the U.S. Treasure amid haker moving stolen Ethereum\n\nSix Tornado Cash users have sued the U.S. Treasury for sanctioning the platform. As per the users, the sanctions violate the First Amendment. The plaintiffs contend that the Treasury lacks the jurisdiction to impose the mixer’s ban. Additionally, they claim that banning Tornado Cash infringes on the First Amendment’s protection of free expression. The individuals used open-source software to protect their privacy. According to the filing, punishing the crypto mixing platform is against US individuals’ fundamental rights.\n\nAs per the law which banned Tornado Cash, only a property might be blocked. However, the legal definition of a property is something that can be owned. But no one is able to own, manage, or alter the privacy-focused software. Founders, developers, and those who just so happen to have TORN in their wallets cannot alter or control the platform.\n\nLast year, the US Treasury imposed restrictions on Tornado Cash under the pretext that the firm was being used to finance terrorism and enable money laundering."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWNsaWVudC1yZWxlYXNlcy11cGRhdGUtcG93LXN1cHBvcnQtZXRoLXByaWNlL9IBT2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWNsaWVudC1yZWxlYXNlcy11cGRhdGUtcG93LXN1cHBvcnQtZXRoLXByaWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Ethereum Client Releases Major Upgrade To End PoW Support, ETH Price Jumps - CoinGape",
        "content": "Ethereum client Go-Ethereum has officially released the Geth v1.12.0 version (Krogam DMZ). The latest update will no longer support proof of work (POW), so it can no longer be used for PoW-based private chains or as a dependency on ethash PoW.\n\nEthereum has transitioned to proof-of-stake (PoS) but some related chains still use PoW consensus such as Ethereum Classic and EthereumPoW.\n\nadvertisement\n\nGo Ethereum Releases Major Update to End PoW Support\n\nEthereum’s execution layer client Go Ethereum in a tweet on May 25 revealed that it has released Geth v1.12.0 (Krogam DMZ) update, potentially a breaking change. Geth has decided to no longer support proof-of-work (PoW) chains. Moreover, Geth now defaults to use Pebble as a backend if no existing database is found.\n\nThe new version adds block coverage to eth_call, enabling batch state test execution. Various bugs have also been fixed. The details on the improvements and bug fixes can be found in the released notes.\n\nRecently, consensus layer client Nimbus released a v23.5.1 update for validator clients and node operators on May 21. The update aims to improve compatibility with 3rd party validator clients and beacon nodes. Moreover, it introduces support for incremental pruning.\n\nThese latest updates by clients will improve the network’s overall performance. After the Ethereum network suffered finality issues on May 11 and 12, Ethereum clients released critical updates to prevent the Beacon Chain nodes from high resource usage during turbulent times.\n\nAlso Read: Binance Suspends Crypto Deposits As Multichain CEO Remains Missing\n\nETH Price Stabilizes Near $1800\n\nEthereum price stability near $1800 despite market uncertainty indicates low volatility, which is preferred by institutional investors. ETH is likely to outperform Bitcoin in the future.\n\nETH price jumped 1% in the last 24 hours, with the price currently trading at $1,795. The 24-hour low and high are $1,763 and $1,808, respectively.\n\nAlso Read: Blockchain.com CEO Warns Of Bitcoin, Crypto Selloff After Debt Ceiling Deal"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiH2h0dHBzOi8vbWlsa3JvYWQuY29tL2V4Y2hhbmdlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "DeFi Exchanges 2024: List of Top Decentralized Exchanges - Milk Road",
        "content": "What Is A Decentralized Exchange (DEX)?\n\nA decentralized exchange is a trading platform that lets you swap cryptocurrencies offered by other traders. Sounds like a regular exchange, right? Not quite. Decentralized exchanges run as apps on the blockchain rather than being run by a centralized company. Traders like you provide tokens to what’s called a liquidity pool, allowing you as a trader to swap Token A for Token B from the pool’s supply. Cool. And all this happens from the security of your own crypto wallet. That’s right. You don’t have to transfer your crypto onto a centralized exchange to trade. Also cool. Decentralized exchanges don’t have withdrawal fees, withdrawal limits, or pesky trading rules that benefit the exchange rather than the traders. You know—by the people, for the people. But DEXs also come with a learning curve. Don’t worry. We’ll help you find your way around the developing DEX world in typical Milk Road style. Onward, and bring your adventure hat.\n\nTop DeFi Exchanges For March 2024\n\nUniswap: Best For Token Selection\n\nBest For Token Selection ParaSwap: Best For Low-Cost Swaps (Outside US)\n\nBest For Low-Cost Swaps (Outside US) CoW Swap: Best For Peer-To-Peer Swaps\n\nBest For Peer-To-Peer Swaps Firebird Finance: Best For DEX Newbies\n\nBest For DEX Newbies OpenOcean: Best For cross-Chain Swaps\n\nBest For cross-Chain Swaps 1inch: Best For Large Swaps (Outside US)\n\nDEX Fees Availability Supported Blockchains Uniswap 0.3% Worldwide Ethereum\n\nPolygon\n\nOptimism\n\nArbitrum\n\nCelo ParaSwap Varies Outside US Ethereum\n\nPolygon\n\nBSC\n\nAvalanche\n\nFantom\n\nArbitrum\n\nOptimism CoW Swap VariesFree limit orders Worldwide Ethereum\n\nGnosis Firebird Finance Varies Worldwide Ethereum\n\nFantom\n\nCronos\n\nBSC\n\nAvalanche\n\nArbitrum\n\nOptimism\n\nCanto OpenOcean Varies Worldwide 20 total, including:\n\nEthereum\n\nBSC\n\nArbitrum\n\nPolygon\n\nSolana\n\nTron 1inch Varies Outside US Ethereum\n\nBSC\n\nPolygon\n\nOptimism\n\nArbitrum\n\nGnosis\n\nAvalanche\n\nFantom\n\nKlaytn\n\nAurora\n\nUniswap Trade Now Uniswap is the largest DEX by trading volume, bringing a wider range of tokens and deeper liquidity pools. The DEX combines an easy-to-use interface with easy-to-understand fees. Uniswap’s new Auto Router helps you get the best price by using multiple pools if needed. Review 4.8 Token Fees 0.3% 0.3% Supported Blockchains Ethereum, Polygon, Optimism, Arbitrum Ethereum, Polygon, Optimism, Arbitrum Pros & Cons Pros Wide selection of tokens\n\nHelps users avoid scams with warnings when purchasing rarely traded tokens\n\nSimple fee structure Cons Fees higher than some competitors\n\nLimited blockchains\n\nNo limit orders Why we like Uniswap Want a DEX that’s so easy to use that you can recommend it to Mom? That’s Uniswap. But you might have to explain crypto wallets and ETH gas fees first. Uniswap has a massive user base, with about 5 million users to date and a huge selection of tokens. Quoted prices include both USD values and token values, removing the cost mystery you might find on other DEXs. Who is Uniswap Good For? People who want to keep things simple: DEXs can be as daunting as drunken Jenga, but Uniswap makes DEX swaps simple. You’ll find one box in the middle of the screen. No endless endless tables or complicated charts. Just enter your trade, and you’re swapping like a pro.\n\nDEXs can be as daunting as drunken Jenga, but Uniswap makes DEX swaps simple. You’ll find one box in the middle of the screen. No endless endless tables or complicated charts. Just enter your trade, and you’re swapping like a pro. People who need a larger selection of tokens: As the grandaddy of DEXs, Uniswap attracts hordes of eager traders, which also attracts liquidity providers hungry for yield. Whether it’s a common token or something new, there’s a good chance you’ll find it on Uniswap. Best Alternatives CoW Swap: If you live in the ETH world, your ETH is more valuable than gold. CoW Swap lets you save your precious ETH by paying for any fees with the tokens you’re selling.\n\nIf you live in the ETH world, your ETH is more valuable than gold. CoW Swap lets you save your precious ETH by paying for any fees with the tokens you’re selling. OpenOcean: OpenOcean is a DEX aggregator that helps you find the best swap rates on 20 supported blockchains. You can even do cross-blockchain swaps. (More on that later.)\n\nParaSwap Best For Low-Cost Swaps (Outside US) Trade Now ParaSwap is a DEX aggregator, meaning the platform compares swaps from across the DEX universe. Choose a token pair and quantity, and ParaSwap shows you a rank-ordered list of DEXs that can support the trade, routing your trade to the best choice. ParaSwap also supports limit orders. The downside: ParaSwap blocks transactions from US IP addresses. Review 4.7 Fees Varies Varies Availability Europe Europe Supported Blockchains Ethereum, Polygon, BSC, Avalanche Ethereum, Polygon, BSC, Avalanche Pros & Cons Pros Supports limit orders\n\nNo fee for limit orders\n\nAutomatically selects the best choice, but lets you compare Cons US traders blocked from transactions\n\nFees for outside DEXs not displayed Why We Like ParaSwap In a word: limit orders. Okay, two words. Other DEXs offer similar routing for swaps, choosing the most efficient swap out there. But many don’t support limit orders that let you choose an exact buy or sell price for your swap. The caveat: If you choose a limit price outside the trading range, your order might sit there until the end of time. Be sure to set a date for expiry. Who is ParaSwap Good For? People who want to use limit orders: Due to automated market makers (we discuss those in a bit), DEX pricing isn’t exactly a precise tool. If you’re an exacting type of trader. You can set the price you want with a limit order.\n\nDue to automated market makers (we discuss those in a bit), DEX pricing isn’t exactly a precise tool. If you’re an exacting type of trader. You can set the price you want with a limit order. People who want peer-to-peer orders: Struck up a deal with someone to swap some crypto? Use Paraswap’s OTC feature to set up a peer-to-peer transaction that’s safe. Your funds stay in your wallet until the trade is executed for both parties. Best Alternatives 1inch: Both ParaSwap and 1inch are available to non-US traders. 1inch can break up large swaps into smaller batches to help you get the most tokens for your trade.\n\nBoth ParaSwap and 1inch are available to non-US traders. 1inch can break up large swaps into smaller batches to help you get the most tokens for your trade. OpenOcean: If you need support for more blockchains, OpenOcean has you covered. In total, this DEX aggregator supports 20 blockchains ranging from Ethereum and layer 2 networks to Solana and Tron.\n\nCoW Swap Best For Peer-to-Peer Swaps Trade Now CoW stands for Coincidence of Wants, and it’s the key to low-cost swaps on CoW Swap. This clever protocol matches swaps without using liquidity pools whenever possible. If there isn’t anyone else who wants to swap the same tokens, then CoW Swap becomes a DEX aggregator, helping you find the best deal elsewhere. Nice. CoW Swap also supports limit orders, so you can just wait for the right price. Review 4.5 Fees Varies Varies Availability Worldwide Worldwide Supported Blockchains Ethereum, Gnosis Ethereum, Gnosis Pros & Cons Pros No charge for failed transactions\n\nNo fee for limit orders\n\nPeer-to-peer swaps\n\nPrevents frontrunning Cons Limited blockchain support Why We Like CoW Swap CoW Swaps does something different: The CoW protocol helps prevent frontrunning, which is a common occurrence that quietly costs traders money every day. Bots run around the internet looking for profitable trades that haven’t been validated yet. Then, these diabolical bots duplicate the trade with a higher gas fee, jumping ahead in line. The result: a sub-optimal trade for you — and profits for the bot. It’s called Maximal Extractable Value (MEV), and CoW prevents this from happening by executing peer-to-peer trades as well as using batch auctions. Who is CoW Swap Good For? Ethereum users: For now, CoW Swap is mostly an Ethereum thing. Gnosis is also supported, but Abritrum, Polygon, and Optimism users have to swap elsewhere. Mooo.\n\nFor now, CoW Swap is mostly an Ethereum thing. Gnosis is also supported, but Abritrum, Polygon, and Optimism users have to swap elsewhere. Mooo. People who want to use limit orders: The feature is still in Beta (read: might be broken), but limit orders are live on CoW Swap. And they’re free. CoW Swap executes the limit order trade with a small spread, giving you an exact-price swap without fees. Best Alternatives Uniswap: CoW Swap has something special with its matched trades, but sometimes you need more token choices. Just head on over to Uniswap, where the pools are deep.\n\nCoW Swap has something special with its matched trades, but sometimes you need more token choices. Just head on over to Uniswap, where the pools are deep. 1inch: If you’re looking for limit orders or direct peer-to-peer trades, you can set up both on 1inch.\n\nFirebird Finance Best For DEX Newbies Trade Now Earn cash back in FBA tokens while finding the best price and routing for your swaps. Firebird Finance gives you the big picture in a clean interface. This DEX aggregator also shows you how close your trade is to open market prices. If there’s an unfavorable change in price before your swap completes, Firebird Finance reverts the trade. Fire, indeed. Review 4.7 Fees Varies Varies Availability Worldwide Worldwide Supported Blockchains Ethereum, Fantom, Cronos, BSC Ethereum, Fantom, Cronos, BSC Pros & Cons Pros Compare swap price to outside market\n\nAutomatically cancels the trade if the price changes unfavorably\n\nEarn FBA tokens for trades Cons Easy-to-miss slippage settings\n\nDoesn’t display DEX choices for swaps\n\nLimited tokens Why We Like Firebird Finance Firebird Finance rewards users with tokens you can stake to earn a percentage of earnings from the protocol. And with nine popular blockchains supported, those earnings create passive income as the platform grows. The Firebird interface is pleasant to use and shows the routing for your trade. A handy price chart helps you understand the price direction before you click the swap button. Who is Firebird Finance Good For? People who want a passive yield: Buy or earn FBA tokens you can stake to earn a percentage of the protocol’s earnings.\n\nBuy or earn FBA tokens you can stake to earn a percentage of the protocol’s earnings. Traders on Cronos or Fantom blockchains: Ethereum and Abitrum DEX aggregators are easy to find. But for still-growing blockchains like Cronos (17 DEXs) or Fantom (16 DEXs), Firebird Finance can be a lifesaver, allowing you to find the best prices on swaps. Best Alternatives OpenOcean: Like Firebird Finance, OpenOcean supports some less common networks, like Tron, Fantom, and Cronos.\n\nLike Firebird Finance, OpenOcean supports some less common networks, like Tron, Fantom, and Cronos. Uniswap: Firebird Finance and Uniswap support a similar list of networks and Uniswap is a bit easier to use. The difference: Firebird is an aggregator, so you might get a better deal.\n\nOpenOcean Best For Cross-Chain Swaps Trade Now OpenOcean is reminiscent of UniSwap, with a clean interface that puts fine control over your trade just a click away. Where it differs from Uniswap is that OpenOcean is an aggregator. The app also supports cross-chain swaps. If you have tokens on Blockchain A, you can swap them for tokens on Blockchain B. That’s powerful stuff. Review 3.5 Fees Varies Varies Availability Worldwide Worldwide Supported Blockchains Ethereum, BSC, Arbitrum, Polygon Ethereum, BSC, Arbitrum, Polygon Pros & Cons Pros Cross-chain swaps\n\nLimit orders\n\n20 blockchains supported Cons Doesn’t always detect tokens in wallet\n\nConfusing for newbies\n\nMinimum trade amounts Why We Like OpenOcean Swaps, limit orders, cross-chain swaps, leveraged perpetual swaps — what’s not to like? The main downside to using OpenOcean is that maybe it does too much. This isn’t the place to send your buddy from work who wants to learn how to DeFi. But if you’ve got a bit of crypto experience under your belt, OpenOcean gives you plenty of toys to play with and a suite of tools to maximize your trading profits. Who is OpenOcean Good For? People who use multiple blockchains: Remember when you got to the register at a store and then realized you left your wallet in the car? Crypto is like that. Sometimes the funds you need are somewhere else, sitting on another blockchain. OpenOcean is like sending your buddy out to the car to get your wallet. Problem solved. Now you can use your funds. OpenOcean lets you swap tokens like a superhero, leaping across blockchains. And you only have to wait a few minutes.\n\nRemember when you got to the register at a store and then realized you left your wallet in the car? Crypto is like that. Sometimes the funds you need are somewhere else, sitting on another blockchain. OpenOcean is like sending your buddy out to the car to get your wallet. Problem solved. Now you can use your funds. OpenOcean lets you swap tokens like a superhero, leaping across blockchains. And you only have to wait a few minutes. People who use limit orders: OpenOcean aggregates the liquidity pool inventory of more DEXs than you can count, but sometimes you want a specific price point. OpenOcean lets you create limit orders at a specific price point, which can be handy in a volatile market. Best Alternatives Firebird Finance: Both OpenOcean and Firebird Finance expand their list of supported networks to include BSC (BNB Smart Chain), Cronos, and others, as well as Ethereum and popular compatible layer 2’s (Abitrum, Optimism).\n\nBoth OpenOcean and Firebird Finance expand their list of supported networks to include BSC (BNB Smart Chain), Cronos, and others, as well as Ethereum and popular compatible layer 2’s (Abitrum, Optimism). ParaSwap: If you live outside the US, ParaSwap is another powerful DEX aggregator with a simpler interface.\n\n1inch Best For Large Swaps (Outside US) Trade Now 1inch may be the best-known DEX aggregator. It looks a lot like Uniswap but pulls swap options from a plethora of DEXs. There’s a reason it’s so popular: In the background, 1inch is actually breaking up your trade (if needed) to prevent price spikes and get you the most tokens in your swap. The bad news: US users are in a “restricted jurisdiction” and can’t use the service. Review 4 1inch Review Token Fees No 1inch fees, pass-through fees for exchanges plus network fees No 1inch fees, pass-through fees for exchanges plus network fees Availability Worldwide Worldwide Supported Blockchains 11 chains, including Ethereum, BSC, Polygon, and Optimism 11 chains, including Ethereum, BSC, Polygon, and Optimism Pros & Cons Pros Simple-yet-powerful interface\n\nLimit orders\n\nPeer-to-peer trades Cons Not available in the US Why we like 1inch Price impact is one of the most challenging parts of using DEXs. Basically, as you buy more from the pool, the price increases — sometimes by a lot. 1inch automatically splits your swap between several pools if needed to minimize the price impact and get the tokens you need at the best price possible. Who is 1inch Good For? People outside the US: 1inch is one of our favorite DEX aggregators, but you can’t use it in the US. Rats. It’s really good.\n\n1inch is one of our favorite DEX aggregators, but you can’t use it in the US. Rats. It’s really good. People who want peer-to-peer transfers: Want a secure way to trade tokens once you’ve struck up a deal? 1inch lets you set up the swap and copy a link to the online trade. Nice and safe. Similarly, you can also set up limit orders on 1inch. Best Alternatives OpenOcean: If you need a more powerful set of tools, Give OpenOcean a look-see. You’ll still get limit orders for precise trades, but you’ll also get the ability to do cross-blockchain swaps (but you can’t do both at once).\n\nIf you need a more powerful set of tools, Give OpenOcean a look-see. You’ll still get limit orders for precise trades, but you’ll also get the ability to do cross-blockchain swaps (but you can’t do both at once). CoW Swap: Ethereum peeps will love CoW Swap, the DEX that lets you keep your ETH. Many trades can even be done without using a DEX through CoW Swap’s peer-to-peer trades.\n\nHow Do DEXs Work?\n\nA DEX holds a pool of tokens that traders can swap. Sometimes the pool holds just two types of crypto, like ETH and GMX, or sometimes they hold several types of tokens. If you had ETH and wanted to buy GMX, you could swap your ETH for GMX and vice versa.\n\nWhere do these pool tokens come from? Well, they come from other traders who want to earn a yield by providing liquidity to the pool. Liquidity just means the ability to trade. Without a pool, there’s nothing to trade, and what fun is that? Liquidity providers are key to the system.\n\nSome DEXs take a cut of the swap fees generated by the DEX, with the bulk of earnings going to the liquidity providers. But this doesn’t mean DEX fees are high. Uniswap, the top DEX by volume, charges a 0.3% fee on swaps. That’s less than you’ll pay to trade on Coinbase, and you don’t have to move your tokens onto a third-party platform to trade. Your tokens never leave your comfy crypto wallet until you confirm the swap in your wallet.\n\nAnother benefit: DEXs have hard–to–find tokens that haven’t made it onto major exchanges yet.\n\nHow Do DEXs Make Money?\n\nSome DEXs take a cut of the fees collected on the platform—but not all DEXs. For example, Uniswap doesn’t take a cut of fees. The 0.3% fee collected on Uniswap goes to the liquidity providers.\n\nBy contrast, Alium Finance takes a sliver of the fees for the treasury.\n\nDEXs work on a governance model, meaning that people who hold governance tokens can vote on future changes to the DEX. If the community votes for the DEX to keep a percentage of fees, the developers make it happen.\n\nIn other cases, like limit orders on CoW Swap, the trade executes with a small price buffer. The exchange or treasury keeps the spare change.\n\nIn general, the bulk of earnings typically goes to the liquidity providers, who are just traders like the rest of us. It’s a much different model compared to centralized exchanges, where the exchange keeps 100% of trading fees.\n\nAutomated Market Makers\n\nMost DEXs use a mechanism called automated market makers (AMMs) to calculate the swap exchange rate. The goal of an AMM is to keep the pool balanced. If the trade volume only went one way, the pool would quickly be drained of one of its tokens. For instance, in an ETH/GMX pair, the GMX tokens would go to zero while ETH piles up. No more trades for you. And no reason for liquidity providers to fund pools.\n\nAutomated market makers are designed to always provide liquidity (at any price). They do this by increasing or decreasing the price of swapped tokens based on demand in the pool. Under the hood, there’s a constant product formula at work that calculates the exchange rate for each swap.\n\nLet’s say you have a pool with ETH and MANA, the token for the Decentraland metaverse. Most DEXs require liquidity providers to fund the pool with a 50/50 split. Based on current prices, that would be 1 ETH to 2775.36 MANA.\n\nAs traders swap ETH to load up on MANA, the price of MANA in the pool increases and the price of ETH decreases to keep the pool value balanced. The creeping price of MANA in this example is called price impact, a price variance compared to the starting value. It’s something to watch out for on DEXs. Smaller pools can see a BIG difference in price as you buy more of a token from the pool.\n\nHere’s an example from Uniswap where the swap would have caused a HUGE price impact.\n\nCurrently, ETH is at $1,776, which means the swap should yield about 1,723 USDC (a stablecoin pegged to $1) after the 0.3% fee. Instead, we get only $653 USDC. Why? Because the swap is draining the small supply of USDC — and the AMM is raising the price of each additional USDC token. Liquidity at any price, remember?\n\nJust like in diving, deeper pools are better—and be careful about (price) impacts.\n\nThis is an extreme example, but the price for swaps can get a bit slushy compared to precise price limit orders on centralized exchanges that use order books.\n\nRemember, others are trading from the same liquidity pool, so prices can change for that reason as well. (The AMM adjusts prices to keep the pool balanced.) Most DEXs let you set the slippage, which helps keep your trade value closer to the DEX price quote when your trade executes. If the slippage value isn’t set, there’s no telling how much you’ll pay. Who likes surprises? But if you set the slippage too low, the transaction might fail — leaving you with nothing but the tokens you started with and a pile of fees.\n\nSome DEXs use order books instead of AMMs. Let’s have a look.\n\nOrder Book DEXs\n\nFixed prices on a DEX? How does that even work? It’s possible, and here’s how: Buyers and sellers submit orders to the DEX. Essentially, the orders are contracts to buy or sell a fixed quantity of tokens at a fixed price. This creates a book of orders. Sellers on the top, buyers on the bottom. If you’ve traded stocks or traded crypto on an advanced trading platform, it should look pretty familiar.\n\n(Crescent DEX on Cosmos)\n\nWith a book of open orders, traders can trade with more precision. At a glance, you can see the open orders and available quantities.\n\nA market order fills your order from the existing orders on the exchange’s order book.\n\nfills your order from the existing orders on the exchange’s order book. A limit order adds your order to the book.\n\nIf your limit order is within the trading range, there’s a good chance that market order traders will take some or all of your position, Or, your order might be matched up with another limit order on the other side of the trade. Awesome. There’s also a chance it might sit there forever, unmatched, like a shy teen at a high school dance. Yeah, that can happen if the trading range moves.\n\nTrading book DEXs are shiny, new stuff. The largest DEXs still use AMMs to manage swaps, which means you might not find less common tokens on order book DEXs, at least not yet. There just aren’t as many buyers and sellers. But that’s likely to change over time, giving traders the option of using either type of DEX (AMM or Order Book).\n\nYou may not need to use an order book DEX to get a precise trade. ParaSwap, OpenOcean, and CoW Swap are just a few DEXs that offer limit orders so you can set your own price.\n\nDEX Aggregators\n\nRemember when we talked about price impact and the effect AAMs can have on prices? It’d be cool if someone came up with a way to just find the best deal. Cool indeed, and that’s what DEX aggregators do.\n\nHere’s OpenOcean searching for the best deal on RDNT to ETH.\n\nDEX aggregators query the DEXs scattered all over the internet, so you don’t have to try the trade on each one manually. Some DEX aggregators show you a list of options. Others, like OpenOcean and 1inch, just show you the best swap available.\n\nMultichain DEXs/Layer 2 Support\n\nIt’s a big multichain crypto world out there, and DEXs can help you make swaps on multiple blockchains.\n\nLayer 2 Support: Most of the larger DEXs support multiple blockchains, meaning you can make swaps on Ethereum, Polygon, Abitrum, or others. Layer 2 blockchain chains offer faster and cheaper transactions compared to Ethereum. But what if you have tokens on Network A that you want to swap for tokens on Network B? That’s where Cross-chain DEXs come in.\n\nMost of the larger DEXs support multiple blockchains, meaning you can make swaps on Ethereum, Polygon, Abitrum, or others. Layer 2 blockchain chains offer faster and cheaper transactions compared to Ethereum. But what if you have tokens on Network A that you want to swap for tokens on Network B? That’s where Cross-chain DEXs come in. Cross-Chain DEXs: These DEXs can bridge tokens across blockchains and perform swaps at the same time. Be sure to check the exchange rate before you start clicking buttons, though. Cross-chain DEXs make several hops, so it can be a bumpy ride. But some cross-chain swaps work out great.\n\nHere’s a cross-chain swap on OpenOcean, Bridging RDNT on the Abitrum network to USDC on the Ethereum network.\n\nThe cost in this example is cheaper than doing an RDNT to USDC swap on Abitrum and then using a crypto bridge to move the USDC to Ethereum. Faster too.\n\nBenefits Of A DEX\n\nCheap Transactions: DEX swap fees are less costly than trading on most exchanges. Typically, you’ll pay about 0.25% to 0.3% in swap fees. By comparison, Coinbase Advanced charges 0.4% for limit orders and 0.6% for market orders.\n\nDEX swap fees are less costly than trading on most exchanges. Typically, you’ll pay about 0.25% to 0.3% in swap fees. By comparison, Coinbase Advanced charges 0.4% for limit orders and 0.6% for market orders. Better Token Selection: DEXs have more tokens than your typical exchange. Also, new tokens typically make their debut on DEXs or through airdrops. If you’re looking for the next 100x, the odds are probably better that you’ll find it trading on DEXs than on centralized exchanges.\n\nDEXs have more tokens than your typical exchange. Also, new tokens typically make their debut on DEXs or through airdrops. If you’re looking for the next 100x, the odds are probably better that you’ll find it trading on DEXs than on centralized exchanges. Trade Directly From Your Crypto Wallet: DEX swaps don’t require you to transfer your crypto to an exchange to trade (and hope it’s not the next exchange to crash). You trade directly from your wallet. Nice and secure.\n\nDEX Risks\n\nSlippage/Price Impact: DEXs that use AMMs (most of the DEX world) can lead to paying more than you expected for a swap. As you buy more, the price goes up. But this is less of an issue with larger pools. Always check the price against the outside market to be sure you’re still in the box.\n\nDEXs that use AMMs (most of the DEX world) can lead to paying more than you expected for a swap. As you buy more, the price goes up. But this is less of an issue with larger pools. Always check the price against the outside market to be sure you’re still in the box. Smart Contract Risk: DEXs run on smart contracts, which are just computer programs. Once you get past about one line of code, the chances of bugs or exploits increase. Smart contract risk is likely a bigger threat to liquidity providers than to traders, but you never know.\n\nDEXs run on smart contracts, which are just computer programs. Once you get past about one line of code, the chances of bugs or exploits increase. Smart contract risk is likely a bigger threat to liquidity providers than to traders, but you never know. Centralization: What if your decentralized exchange isn’t so decentralized at all? What’s to stop the developers from changing the code on the fly? Nothing, really. Word will get out quickly, but not before the damage is done.\n\nWhat if your decentralized exchange isn’t so decentralized at all? What’s to stop the developers from changing the code on the fly? Nothing, really. Word will get out quickly, but not before the damage is done. Rug Pulls: Not too long ago, the ArbiSwap DEX enticed users to buy and stake the ARBI token. Then, the developers pulled the liquidity from the ARBI pool. This same type of rug pull can happen with any scammy token. For example, someone can create a token, hype it as the next big thing on social media, sell a bunch through a DEX for valuable crypto (like ETH), and then pull the liquidity. The rug pullers now have ETH, and buyers have worthless tokens. Boooo.\n\nNot too long ago, the ArbiSwap DEX enticed users to buy and stake the ARBI token. Then, the developers pulled the liquidity from the ARBI pool. This same type of rug pull can happen with any scammy token. For example, someone can create a token, hype it as the next big thing on social media, sell a bunch through a DEX for valuable crypto (like ETH), and then pull the liquidity. The rug pullers now have ETH, and buyers have worthless tokens. Boooo. Fake Tokens: Anyone and their pet poodle can make an ERC-20 Ethereum-compatible token. And they can name it anything they want, including names similar to the token you want to buy. Some DEXs, like Uniswap, flash a warning message if a token you’re swapping to isn’t traded on major exchanges. That’s your cue to double-check your work before clicking any buttons.\n\nHow To Pick A Decentralized Exchange\n\nThere are more DEXs out there than you can shake a stick at these days, and that’s a good thing. But too many choices can be overwhelming. Chances are that you’ll choose one or two as your main squeezes — but you won’t need twenty. Before you start connecting wallets like Tim Taylor rewiring home appliances, there are a few things to consider.\n\nEase Of Use: Uniswap is still the top DEX for three reasons. It’s easy to use, it has A LOT of tokens, and everyone likes unicorns. Ease of use is what makes it sticky, though. Life’s hard enough. Why choose a difficult DEX?\n\nUniswap is still the top DEX for three reasons. It’s easy to use, it has A LOT of tokens, and everyone likes unicorns. Ease of use is what makes it sticky, though. Life’s hard enough. Why choose a difficult DEX? Blockchain Support: We really like Cow Swap, but it only supports Ethereum and Gnosis. If that’s enough for you, give it a try. Many of us need more options. The table at the top gives you a breakdown of supported networks. OpenOcean is particularly strong in this regard, with 20 supported blockchains.\n\nWe really like Cow Swap, but it only supports Ethereum and Gnosis. If that’s enough for you, give it a try. Many of us need more options. The table at the top gives you a breakdown of supported networks. OpenOcean is particularly strong in this regard, with 20 supported blockchains. Fees: Most DEXs charge 0.25% to 0.3% for swaps. Others offer some free options, like no charge limit orders. A better way to look at it is to examine how many tokens you get for your trade, fees included. That’s what really matters. DEX aggregators like OpenOcean are great at this.\n\nMost DEXs charge 0.25% to 0.3% for swaps. Others offer some free options, like no charge limit orders. A better way to look at it is to examine how many tokens you get for your trade, fees included. That’s what really matters. DEX aggregators like OpenOcean are great at this. Security: Visit the about page or the project page on GitHub and look for information on audits. DEXs run on smart contracts, and many projects use third-party audit firms to ensure the code is secure.\n\nVisit the about page or the project page on GitHub and look for information on audits. DEXs run on smart contracts, and many projects use third-party audit firms to ensure the code is secure. Additional Features: If all you’re doing is basic swaps, a well-established DEX like Uniswap or a DEX aggregator like 1inch will do the trick. But if you need limit orders or cross-chain swaps, you might want to consider OpenOcean.\n\nTo Sum It Up\n\nCentralized exchanges are a common onramp for crypto buyers, but once you have some crypto, the DEX world is your oyster. DEXs can even be a less costly way to trade, but you’ll want to learn the ropes first. Try some test trades without completing the swap. Like everything in crypto, once you get the hang of it, you’ll wonder why you waited so long.\n\nFrequently Asked Questions\n\nWhich DeFi Exchange Has The Lowest Fees? Some DeFi Exchanges, like CoW Swap, offer free limit orders. Most standard swaps range from 2.5% to 0.3% in swap fees. Fees are only part of the equation, though. Examine how many tokens you receive in exchange for your swap after fees. That’s what really matters. Is There A DeFi Swap App? Mobile wallets like Coinbase Wallet or MetaMask have built-in swaps. But you’ll have more control over the transaction when using a web app like Uniswap or OpenOcean. What Is The Cheapest DeFi Exchange? The real way to measure what’s cheapest is to compare how many tokens you’ll get in exchange when making a swap. Fees play a smaller role in this than you might think. Instead, it often comes down to how many tokens are in the liquidity pool you’re using with the exchange. Apps like Uniswap can use multiple pools to help ensure you get the most value for your swap. Is Binance A Decentralized Exchange? No. Binance is a centralized exchange with a management team making day-to-day decisions for users on the platform. A decentralized exchange runs on the blockchain using programs called smart contracts. Decisions for decentralized exchanges are made by the community through a voting process.\n\nStaff Writer Eric Huffman Eric Huffman is a staff writer for MilkRoad.com. In addition to crypto and blockchain topics, Eric also writes extensively on insurance and personal finance matters that affect everyday households. Read More"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDUvMjUvZXRoZXJldW0tcmFpbmJvdy1jaGFydC1ob3ctZG9lcy1pdC13b3JrLXdoYXQtYWJvdXQtbmV3LXJpc2luZy1zdGFyLWFwZW1heC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Ethereum Rainbow Chart. How Does It Work? What About New Rising Star ApeMax? - The Crypto Basic",
        "content": "Following the Shapella upgrades, which allowed unstaking of Ethereum (ETH) for the first time since its introduction in December 2020, the price of ETH crossed the significant $2,000 mark and maintained stability. This has left investors assessing its potential future trends, including its relationship with the ETH Rainbow Chart.\n\nSimultaneously new cryptocurrency coins are emerging, such as ApeMax, a new revolutionary staking token. In this guide, we will delve into the world of cryptocurrency and shed light on the Ethereum Rainbow Chart, as well as the new emerging star ApeMax.\n\nIn this article, we explore the much-debated Ethereum Rainbow and provide valuable market insights and data to assist readers in comprehending its significance. Furthermore, we examine the factors analysts consider when making Ethereum pricing predictions, offering readers a possible glimpse into the future of this groundbreaking digital coin.\n\n- Advertisement -\n\nThe cryptocurrency market is a constantly evolving ecosystem that has ignited a frenzy of excitement, drawing the attention of investors globally. Recent successes of new crypto coins have been nothing short of remarkable, as several groundbreaking tokens have experienced astronomical surges.\n\nWhat is the Ethereum Rainbow chart in a nutshell?\n\nThe Ethereum Rainbow is a concept that refers to the price levels of Ethereum (ETH) at different stages or milestones of its price appreciation. It is a metaphorical representation of Ethereum’s price chart that highlights various price levels as different colors of a rainbow.\n\nTypically, the Ethereum Rainbow is divided into different segments, with each segment representing a significant price milestone. It is important to note that the Ethereum Rainbow is not an officially recognized benchmark or standard to use when analyzing Ethereum price.\n\nWhat is ApeMax Coin? Why is this new coin causing so much excitement?\n\nPrepare for a monumental shift in the realm of cryptocurrency as ApeMax Coin takes the stage. This extraordinary coin presents a paradigm-shattering approach to staking with its innovative Boost-to-Earn tokenomics.\n\n- Advertisement -\n\nApeMax introduces a pioneering mechanism that expands the earning horizons for stakers, providing unprecedented opportunities. Coin holders can choose to boost or stake their ApeMax tokens across a spectrum of entities, including celebrities and their favorite Web3 projects.\n\nThe ApeMax presale is now live, offering an attractive opportunity to acquire ApeMax coins at a favorable presale price. It is worth noting that as the presale progresses, the presale price of ApeMax coins undergoes daily increases. Thus, it may be advisable to explore the ApeMax presale promptly. In the realm of cryptocurrencies, particularly with new coins, timing plays a pivotal role and could possibly significantly impact overall success.\n\nUnlock extraordinary savings during the limited-time presale by taking advantage of the Early Bird ApeMax Loot Boxes. Presale participants can enjoy discounts of up to 50% when purchasing ApeMax tokens through these exclusive Loot Boxes. If you’re looking to maximize your benefits from the presale, exploring the fun options presented by the Loot Boxes is an opportunity you may not want to miss.\n\nEthereum price predictions? What does the future look like for Ethereum?\n\nCrypto enthusiasts around the world are looking for a better understanding of what the future may hold for the price of Ethereum. Although no one has a crystal ball which may tell what the future holds, analysts agree that several factors can have a positive or negative impact on the price of Ethereum.\n\nThe first thing that will influence the price of Ethereum is the market demand for the token. Demand usually increases for Ethereum if ETH is needed for the many decentralized applications (dApps) and smart contracts that make use of the Ethereum blockchain. As a result, a better understanding of Ethereum’s future adoption and day-to-day usage will give a better understanding of the future demand and therefore possible price of Ethereum.\n\nInstitutional adoption, technological advancements, are also other import factors that could affect the price of Ethereum. One often cited grievance that users have with Ethereum is linked to the high gas fees that are needed to do any type of operation on the Ethereum blockchain. If Ethereum is able to resolve this issue in the future, then maybe more widespread use and adoption could be in the cards. Institutional adoption of Ethereum is also hard to predict, especially since users have a greater number of blockchain options and alternatives to opt for instead of Ethereum.\n\nConclusion\n\nIn summary, the Ethereum Rainbow is an interesting albeit not perfect or accurate means of predicting or assessing the future. In fact, it is important to note that predicting the future of Ethereum is no easy task as it is impacted by a great number of factors that analysts and experts may not be able to factor in. One thing is certain however, Ethereum has shown to be a useful and innovative blockchain technology that has had a major influence on the world of crypto.\n\nFor buyers interested in exploring newer and younger coins, examining the potential of ApeMax could present a possibly exciting and appealing adventure.\n\nOfficial ApeMax Website"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3NlYXJjaHNlY3VyaXR5L3RpcC9TbWFydC1jb250cmFjdC12dWxuZXJhYmlsaXRpZXMtYW5kLWhvdy10by1taXRpZ2F0ZS10aGVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "9 smart contract vulnerabilities and how to mitigate them - TechTarget",
        "content": "Smart contracts execute processes, transactions and other tasks when specific events, conditions and logic are met, depending on how they are programmed. Smart contracts are deployed on a blockchain, such as Ethereum or other distributed ledger infrastructure, where they listen for events and updates from cryptographically secure data feeds called oracles. These contracts often control the flow of large amounts of valuable data and resources, such as transferring money, delivering services and unlocking protected content. This naturally makes them an attractive target to malicious actors.\n\nSecurity must be a top priority when designing and developing a smart contract. Once a smart contract is deployed to a blockchain, it is difficult or impossible to patch; it must be removed, recreated and redeployed. Plus, vulnerabilities in a smart contract will be accessible to anyone once the smart contract is on a blockchain.\n\nWhen deploying a smart contract written in Solidity on the popular smart contract platform Ethereum, development teams need to be especially aware of the following attack vectors and how to eliminate them.\n\n2. Oracle manipulation Smart contracts access and consume external data from outside the blockchain via an oracle. This lets them interact with off-chain systems, such as stock markets. Incorrect or manipulated oracle data can erroneously trigger the execution of smart contracts; this is known as the oracle issue. Many decentralized finance applications have been exploited using this method, the favorite being a flash loan attack. Flash loans are essentially unsecured loans with no limit as to how much can be borrowed so long as the loan is repaid in the same transaction. Attacks use these loans to distort asset prices to generate profits while still abiding by a blockchain's rules. Fix: Using a decentralized oracle, such as Chainlink or Tellor, or even multiple oracles, is the easiest way to ensure a contract receives accurate data. Such oracles make it harder and more expensive for an attacker to interfere with the data.\n\n3. Gas griefing To perform a transaction or execute a smart contract on the Ethereum blockchain platform, users must pay a gas fee. It is paid to incentivize validators (miners) to commit the resources needed to verify transactions. The price of gas is determined by supply, demand and network capacity at the time of the transaction. Gas griefing occurs when a user sends the amount of gas required to execute the target smart contract but not enough to execute subcalls -- calls it makes to other contracts. If the contract does not check if the required gas to execute a subcall is available, the subcall will not execute as expected. This can have a significant effect on the application's logic. Fix: No effective technique to prevent gas griefing exists. All a developer can do is code the contract so it sets the amount of gas to be sent, not the user. A rise in gas costs, however, could mean that the transaction fails.\n\n4. Transaction order dependence attacks (frontrunning) Smart contracts are publicly visible from the moment they are submitted to the network as a pending transaction. This enables a miner of a block to select the transaction with the highest gas fees. For example, users can include a priority fee -- a tip -- to incentivize miners to prioritize their transaction ahead of other transactions in the same block. However, this also enables attackers to watch for opportunities where they can front run profitable contracts by submitting an identical contract, but with a higher gas fee, so their contract is processed first. Because these attacks have to be implemented in fractions of a second, they are usually performed by bots or miners themselves. Fix: These attacks are tricky to avoid. One option is to only accept transactions with a gas price below a predetermined threshold. Or use a commit-and-reveal scheme that involves a user first submitting a solution hash instead of the cleartext solution so the solution can't be viewed by potential frontrunners until it is too late. Various smart contract audit tools can detect if code introduces frontrunning vulnerabilities.\n\n5. Force-feeding attacks Force-feeding attacks take advantage of the fact that developers cannot prevent a smart contract from receiving Ether, Ethereum's native cryptocurrency. This makes it easy to transfer Ether to any contract -- force-feeding them -- to change the balance of Ether it holds and thereby manipulate any function logic that solely relies on the expected balance for internal accounting, such as paying out a reward if a balance increases above a certain level. Fix: It is impossible to stop contract balance manipulation in this way. A contract's balance should never be used as a check or guard within a function because the actual Ether balance may be higher than the balance expected by the contract's internal code.\n\n6. Timestamp dependence Timestamp values are generated by the node that executes the smart contract. Due to the distributed nature of the Ethereum platform, it is almost impossible to guarantee that the time on every node is correctly synchronized. A node can then manipulate the timestamp value it uses to craft a logic attack against any contract that relies on the block.timestamp variable to execute time-critical operations. Fix: To avoid this vulnerability, developers should not use the block.timestamp function as a control or logic check, or as a source of randomness.\n\n7. Denial of service Like any online service, smart contracts are vulnerable to DoS attacks. By overloading services, such as authentication, an attacker can block other contracts from executing or generate unexpected contract reverts, for example, where unused gas is returned and all state is reverted to the state before the transaction began to execute. This can result in auction results or values used in financial transactions being manipulated to the attacker's advantage. Fix: Making these attacks costly for attackers is the best way to deter them. Time-lock puzzles and gas fees are just some of the ways of increasing an attacker's costs. Ensuring calls are only made to trusted contracts also reduces the likelihood of a DoS attack causing serious problems.\n\n8. Integer underflows and overflows Integer underflows and overflows occur when the result of an arithmetic operation falls outside the fixed-size range of values: 0 to 255 in the case of integer type uint8. Values higher than 255 overflow and are reset to 0, while values lower than 0 reset to 255. This causes unexpected changes to a contract's state variables and logic and triggers invalid operations. Fix: Since version 0.8.0, the Solidity compiler no longer allows code that could result in integer underflows and overflows. Check any contracts compiled with earlier versions for functions involving arithmetic operations or use a library, such as SafeMath, to check for underflow and overflow issues.\n\n9. Information and function exposure Blockchains are accessible to anyone. Confidential or sensitive information should never be saved to a blockchain unless it is encrypted. Variables and functions within a smart contract can also be visible and accessible to other smart contracts, which leaves them open to possible misuse or abuse. Fix: Developers should always implement proper access controls and use the principle of least privilege by using Solidity's variable and function visibility modifiers to assign the minimum level of visibility as is necessary and no more."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktMjQtbWF5LWV0aC1mbGFnLXBhdHRlcm4tcGxheWluZy1vdXQtZXhhY3RseS13aGF0LW5vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (24-May): ETH Flag Pattern Playing Out Exactly! What Now? - Bitcoinsensus",
        "content": "Ethereum price prediction from a previous analysis ETH Just Invalidated This Key Pattern! What Now?\n\nIn our previous Ethereum analysis, ETH Just Invalidated This Key Pattern! What Now? we identified a larger bearish pattern in play in the 15-minute timeframe and warned our readers of a possible price sell-off sooner or later.\n\nWell, that sell-off has finally played out! In this Ethereum analysis, we will be talking about the key levels we are watching right now and the possible price scenarios we can expect.\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHas The ETH Sell-Off Begun?\n\nThe Pattern we are currently tracking is the Bearish Flag Pattern currently playing out in the 15-minute timeframe. The Ethereum price just broke through the last key support we need to confirm the start of this pattern sell-off in the coming days.\n\nIf this bearish prediction plays out, there is a very high probability that we might see the ETH price sell-off massively in the coming days.\n\nThis ETH sell-off could easily push the Altcoin price down to the $1,506 price level in the coming days. A more than -15% dump in the value of Ethereum.\n\nKey levels To Watch!\n\nThe most important key level right now for this Ethereum bearish prediction is the $1,875 previous highs in the 15-minute timeframe.\n\nThe ETH bears need to defend this key resistance at all costs if they want to see this price push down to continue for Ethereum.\n\nA price break back above this $1,875 key resistance only invalidates our bearish flag pattern in the 15-minute timeframe.\n\nETH Flag Pattern Playing Out Exactly! What Now? Watch this key resistance level in the 15-minute timeframe\n\nFinal Verdict!\n\nWe are still very bearish on Ethereum and believe right now we are seeing a bearish flag pattern play out in the 15-minute timeframe.\n\nIf this pattern plays out exactly, there is a very high probability that we might see a more than -15% dump in the value of Ethereum soon!\n\nBut for this bearish prediction to remain valid, we need to see the Altcoin respect and continue to trade below the $1,875 key resistance.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2JpdGNvaW4tYW5kLWNyeXB0by1ndWlkZS9hcmJpdHJ1bS1icmlkZ2UtYmVnaW5uZXJzLWd1aWRlLXBhcnQtMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Arbitrum Bridge Beginner's Guide - Part 2 - Altcoin Buzz",
        "content": "Arbitrum, a layer-two scaling solution for Ethereum, is an excellent way to solve speed, cost, and scalability problems with Ethereum.\n\nIn Part 1 of the Beginner’s Guide to the Arbitrum Bridge, we discussed what Arbitrum is and how the Arbitrum Bridge works. In Part 2, we take a look at cross-chain transfers and how to connect Arbitrum to other well-known blockchain networks. Whether you want to connect Arbitrum to Ethereum, Avalanche, Optimism, or zkSync, this detailed guide will show you how.\n\n1) Using the Arbitrum Bridge to Transfer Tokens to Ethereum\n\nTransferring ERC-20 tokens from the Ethereum blockchain to Arbitrum can provide numerous advantages. Firstly, the scalability allows for faster transaction times, with the capacity to handle 4500 TPS (Transactions Per Second).\n\nFurthermore, implementing “optimistic roll-ups” has resulted in lower transaction fees, making it a cost-effective scaling solution. On the Ethereum mainnet, the standard gas fee is $10 (on a normal day). While on Arbitrum, the typical gas fee is only about $0.10. So, Bridging tokens to Arbitrum allows token issuers to expand their user base and improve the overall user experience through enhanced scalability and reduced fees.\n\nHow to Usethe Aribtrum Bridge with Ethereum\n\nGo to the Arbitrum Bridge website. Connect your wallet to the platform. (Several wallets, including Ledger Live, Coinbase Wallet, and MetaMask, are available.) Select the asset ($ETH, $USDC, $USDT, and $DAI) you want to bridge. Input the number of tokens. Follow the prompts to finish the transaction.\n\nThe gas fee is paid in $ETH. So ensure your wallet has enough ETH to pay the gas fee.\n\n2) Using the Arbitrum Bridge to Transfer Tokens to Avalanche\n\nThe bridge between Arbitrum and Avalanche provides users with multiple advantages. The main advantage is lower gas fees compared to Ethereum mainnet. For instance, Gas fees on Arbitrum average around $0.10, while on Avalanche, they are even lower at approximately $0.05.\n\nArbitrum and Avalanche offer faster transaction speeds than Ethereum mainnet. In addition, Arbitrum and Avalanche offer faster transaction processing with average times of 2 seconds and 1 second, respectively.\n\nSo, using the Arbitrum bridge with Avalanche provides access to a broader selection of DeFi applications on Avalanche. According to DeFillama, Avalanche has more than 200 dApps, providing users with more options for yield farming and trading. However, Arbitrum also has more than 200 dApps. Moreover, Avalanche has better liquidity. As of May 2023, DeFi on Avalanche has surpassed $10B in total value locked, while Arbitrum has around $5B.\n\nHow to Use the Aribtrum Bridge with Avalanche\n\nUsers can transfer assets from one network to another by using a bridge service, such as Avalanche Bridge, to connect Arbitrum to Avalanche using the following steps:\n\nGo to the Synapse Protocol website. Connect your wallet to the platform. Select the asset you want to transfer. Input the number of tokens. Follow the prompts to finish the transaction.\n\nWhen it comes to bridging between Avalanche and Arbitrum, the Synapse protocol is one of the safest and most cost-effective options.\n\nSo, the costs of using Synapse for the bridge are about $10. This fee structure is noticeably less expensive than other platforms, which frequently charge between $20 and $35. Using $SYN, the Synapse native token, users can benefit from 0% slippage and lower transaction fees.\n\n3) Using the Arbitrum Bridge to Transfer Tokens to Optimism\n\nOptimism, a layer-two scaling solution for Ethereum, employs Optimistic Rollups to boost throughput and lower fees. This architecture lets Optimism handle transactions faster and cheaper than Ethereum.\n\nSo, using the arbitrum bridge with Optimism with lower gas fees than Ethereum mainnet, averaging around $0.10 and $0.05, respectively. Also, Optimism offers faster transactions in 1 second.\n\nHow to Use the Aribtrum Bridge with Optimism\n\nGo to the Across Protocol. Connect your wallet to the platform. Select the asset you want to transfer. Input the number of tokens. Follow the prompts to finish the transaction.\n\nSynapse, Hop, Anyswap, and Multichain protocols are all solid options for transferring assets from Arbitrum to Optimism. However, the Across protocol, a trusted Layer-2 cross-chain bridge, is the best way to connect Optimism and Arbitrum. The platform is the go-to bridge for layer 2 protocols on Ethereum, such as Optimism, Arbitrum, Boba, Polygon, and many others.\n\n4) Using the Arbitrum Bridge to Transfer Tokens to zkSync\n\nzkSync is an L2 scaling solution that utilizes zero-knowledge roll-up technology to enhance transaction throughput and reduce fees. As a result, zkSync makes transactions faster and cheaper. So, the Arbitrum bridge with zkSync provides several advantages for users, such as reduced gas fees, quicker transaction processing, enhanced security, and ease of use.\n\nHow to Use the Aribtrum Bridge with zkSync\n\nGo to the Orbiter Finance. Connect your wallet. Choose the token you want to bridge. Select the zkSync network as the destination network. Enter the number of tokens you wish to bridge and follow the instructions to complete the transaction.\n\nConclusion\n\nThe Arbitrum Bridge’s simplicity and security make it a valuable tool for exploring opportunities in layer-2 and layer-1 networks. Also, It enables users to navigate and bridge between different chains, including Ethereum, Polygon, Optimism, Avalanche, ZKSync, and more.\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Our popular Altcoin Buzz Access group generates tons of alpha for our subscribers. And for a limited time, it’s Free. Click the link and join the conversation today."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tZW5jb3VudGVycy1yZXNpc3RhbmNlLWF0LWNyaXRpY2FsLWxldmVsLXZpdGFsLXRyYWRpbmctbGV2ZWxzLXRvLW1vbml0b3Iv0gF7aHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1lbmNvdW50ZXJzLXJlc2lzdGFuY2UtYXQtY3JpdGljYWwtbGV2ZWwtdml0YWwtdHJhZGluZy1sZXZlbHMtdG8tbW9uaXRvci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Ethereum Encounters Resistance At Critical Level, Vital Trading Levels to Monitor - NewsBTC",
        "content": "Ethereum started the week with a promising performance, experiencing a gain of over 3%. However, the bullish momentum was short-lived as the altcoin failed to sustain its position above a key resistance level. Within the past 24 hours, ETH’s market value has declined by nearly 3%.\n\nThroughout the week, the ETH price has shown limited progress, with the bears dominating the price movement. The altcoin’s technical outlook indicates a decline in buying strength, accompanied by low demand and accumulation on the daily chart.\n\nTo prevent further strengthening of the bears, it is crucial for Ethereum to surpass its immediate resistance in the upcoming trading sessions.\n\nFailure to do so may lead to additional pressure from sellers, potentially causing Ethereum to breach its immediate support level and experience a significant loss in value during future trading sessions. Additionally, the fall in the ETH market capitalization suggests an increase in selling strength, as observed on the daily chart.\n\nEthereum Price Analysis: One-Day Chart\n\nAt the time of writing, the trading price of ETH was $1790. Despite attempting to trade within the $1800 price range, the altcoin encountered selling pressure, resulting in its depreciation. The current overhead resistance for Ethereum is $1810. If the altcoin surpasses this resistance level, it has the potential to trigger a rally in its price. On the other hand, if the present price level experiences a decline, Ethereum is likely to decline further to $1750 before eventually reaching the $1700 price mark. The recent session saw a decrease in the volume of Ethereum traded, indicated by the red colour, indicating a weak buying strength. Technical Analysis Throughout this month, Ethereum experienced a decline in demand, resulting in reduced buying strength. The Relative Strength Index (RSI) dropped below the midpoint line, suggesting a decrease in demand and an increase in selling pressure on the chart. Additionally, the price of Ethereum fell below the 20-Simple Moving Average (SMA), indicating that sellers were dominating the market’s price momentum. Given that Bitcoin’s price movement remains uncertain, several altcoins, including Ethereum, have followed a similar price trajectory. However, if Ethereum gains broader market strength, there is a possibility that demand could return, causing ETH to surpass the 20-SMA line and potentially climb higher. Due to the absence of demand, ETH did not exhibit significant buy signals. The Moving Average Convergence Divergence (MACD), a tool used to indicate price momentum and potential trend reversals, showed small green histograms that do not provide conclusive buy signals at this point. The Bollinger Bands, which measure price volatility and potential fluctuations, have maintained a parallel shape. However, they displayed slight convergence, suggesting that ETH may trade within a relatively stable range without substantial price fluctuations. Related Reading: Bitfinex And Crypto Bank OrionX Forged Partnership To Broaden Presence In Latin America To reclaim the $1800 price level, it is crucial for buyers to re-enter the market at the current price level. Their participation is essential for Ethereum to regain strength and potentially push the price higher. Featured Image From UnSplash, Charts From TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS90aGUtY2hvcHBpbmctYmxvY2std2h5LWV2ZXJ5b25lLWlzLXRhbGtpbmctYWJvdXQtZWlnZW5sYXllci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "The Chopping Block: Why Everyone Is Talking About EigenLayer - Unchained - Unchained",
        "content": "Episode 497\n\nEigenLayer is poised to be an easier way for teams to spin up dapps that are cryptoeconomically secure.\n\nWelcome to “The Chopping Block” – where crypto insiders Haseeb Qureshi, Tom Schmidt, Tarun Chitra, and Robert Leshner, chop it up about the latest news. In this episode, EigenLayer founder Sreeram Kannan explains his vision for providing “decentralized trust” to new projects on Ethereum. Was Vitalik Buterin’s recent “re-staking” post a shot across EigenLayer’s bow?\n\nListen to the episode on Apple Podcasts, Spotify, Overcast, Podcast Addict, Pocket Casts, Stitcher, Castbox, Google Podcasts, TuneIn, Amazon Music, or on your favorite podcast platform.\n\nShow highlights:\n\nhow Sreeram has transitioned from academia into the world of crypto\n\nwhy he believes that crypto is the “coordination highway”\n\nwhat EigenLayer is – explained to a five-year-old, a high schooler, a day trader, a developer, and a crypto professor\n\nhow middleware enables technology innovation\n\nwhere the value accrues if there’s no token for securing a blockchain\n\nwhether Vitalik is right in being concerned about the risk of corrupting validators\n\nwhat EigenLayer did to minimize risks and externalities to Ethereum\n\nwhether protocols and applications will fork if they get hacked and whether Ethereum will “bail them out”\n\nHosts\n\nHaseeb Qureshi, managing partner at Dragonfly\n\nRobert Leshner, founder of Compound\n\nTom Schmidt, general partner at Dragonfly\n\nTarun Chitra, managing partner at Robot Ventures\n\nGuest\n\nLinks\n\nDon’t overload Ethereum’s consensus by Vitalik Buterin\n\nPrevious coverage of Unchained on Ethereum staking:\n\nLearn more:"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI3NDgxL2xlYXJuLWhvdy10by10cmFkZS1ldGhlcmV1bS1jbGFzc2ljLXdpdGgtdGhlLWF2b3Jhay1haS10cmFkaW5nLWFsZ29zL9IBbGh0dHA6Ly9hbXAuY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI3NDgxL2xlYXJuLWhvdy10by10cmFkZS1ldGhlcmV1bS1jbGFzc2ljLXdpdGgtdGhlLWF2b3Jhay1haS10cmFkaW5nLWFsZ29zLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Learn How to Trade Ethereum Classic With the Avorak AI Trading Algos - CoinCodex",
        "content": "Trading Ethereum Classic can be challenging and requires a deep analysis of market trends and risk management. Avorak AI deploys machine learning to provide cutting-edge solutions to help traders make sound decisions. Its extensive research and development have resulted in sophisticated trading algorithms that analyze market data and make automated trading decisions.\n\nEthereum Classic\n\nLearning how to trade Ethereum Classic with Avorak AI trading algos can significantly enhance an investor's chances of success. Avorak AI trading algos can analyze market data, identify trends and patterns, and make informed decisions based on Ethereum Classic price. With Avorak AI trading algos, less experienced traders can generate profits without spending time analyzing market trends and conducting technical analysis. Avorak Trade serves everyone and makes newbies trade like pros. It can be a significant advantage for investors looking to take advantage of the changing market conditions and volatility of the cryptocurrency market. Avorak Trade is instrumental in the Ethereum classic price prediction.\n\nEthereum Classic Hashrate\n\nEthereum Classic hashrate measures the computational power dedicated toward mining ETC (Ethereum Classic) blocks. It is the rate at which miners are adding new blocks to the Ethereum Classic blockchain band measured in hashes per second (H/s). The Ethereum Classic network's hashrate varies depending on the number of active miners and the computational power used to mine Ethereum Classic. It is currently at 112.30 TH/s, meaning the network is processing about 112 trillion hash attempts per second to mine new ETC blocks. Ethereum Classic, like other cryptocurrencies, operates on a proof-of-work (PoW) consensus algorithm, requiring dedicated computational power and energy to maintain the blockchain. The more hash rate the network has, the more secure and resistant it is to attacks.\n\nAvorak AI\n\nAvorak AI is an AI crypto project with various blockchain and cryptocurrency trading tools making waves in the DeFi space. It provides Avorak Trade, Avorak Write, Avorak Chat, Avorak Create, NFTs, and various solutions across industries. Avorak Write helps content creators generate non-repetitive, plagiarism-free output, after editing and proofreading. In addition to internet scraping, Avorak Write utilizes API and a pre-written natural language bank.\n\nThe Avorak ICO has ushered phase six with a fast-rising AVRK value at $0.235, a 291.67 increase from its initial price. Many YouTube analysts have heaped praise on its performance terming it a 100x crypto. The project will launch on various exchanges, including Azbit, Coinsbit, PancakeSwap, and LAToken. The Avorak team expects its AVRK price to stand at $1 during the launch. The platform has been audited twice by CyberScope and SolidProof, assuring investors of a sound, secure and transparent project.\n\nWrap Up\n\nAvorak AI trading algos are a game-changer for traders looking to profit in the cryptocurrency market. These advanced trading algorithms can provide data-driven trading decisions, reduce risk, and increase the chances of generating significant returns. Traders can start by signing up for the Avorak AI trading platform and leveraging the power of AI-blockchain integration to make profitable trades in the Ethereum Classic market.\n\nFind more on Avorak AI and ICO here:\n\nDisclaimer: This is a sponsored article. The views and opinions presented in this article do not necessarily reflect the views of CoinCodex. The content of this article should not be considered as investment advice. Always do your own research before deciding to buy, sell or transfer any crypto assets."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5nYWRnZXRzMzYwLmNvbS9jcnlwdG9jdXJyZW5jeS9uZXdzL2JpdGNvaW4tYmFzZWQtb3JkaW5hbHMtbmZ0cy1zYWxlcy1zdXJnZS1ldGhlcmV1bS10b3Atc3BvdC1zdXBwb3J0aW5nLWRpZ2l0YWwtY29sbGVjdGlibGVzLTQwNjUwOTfSAZQBaHR0cHM6Ly93d3cuZ2FkZ2V0czM2MC5jb20vY3J5cHRvY3VycmVuY3kvbmV3cy9iaXRjb2luLWJhc2VkLW9yZGluYWxzLW5mdHMtc2FsZXMtc3VyZ2UtZXRoZXJldW0tdG9wLXNwb3Qtc3VwcG9ydGluZy1kaWdpdGFsLWNvbGxlY3RpYmxlcy00MDY1MDk3L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Bitcoin-Based Ordinals NFTs Surge in Sales; Ethereum Retains Top Spot as Digital Collectibles Host - Gadgets 360",
        "content": "Ethereum, for the longest time, has remained the top blockchain of choice for digital artists and NFT creators to host their Web3 content on. The Bitcoin blockchain is now picking pace in competing with Ethereum to make a significant mark on the NFT sector. Over the last month, the sales of NFTs based on Bitcoin marked a significant surge. With this, the Bitcoin blockchain became second on the list naming top blockchains to have emerged in the recent times, with Ethereum leading the list.\n\nBitcoin-backed NFTs managed to garner around $173.28 million (roughly Rs. 1,433 crore) in revenue in the last thirty days, a report by Bitcoin.com said, citing CryptoSlam.IO insights.\n\nAn energy intensive proof-of-work (PoW) blockchain, Bitcoin specially supports the Ordinals category of NFTs. When an NFT is inscribed on one Satoshi unit of the Bitcoin blockchain, it gets classified as an Ordinal NFT. Satoshi, named after Bitcoin's anonymous creator, is the smallest denomination of Bitcoin.\n\nThe Ordinals classification of NFTs is an up-and-coming category of NFTs that exploded in popularity after BAYC parent Yuga Labs announced its own Ordinals NFT collection called TwelveFold in March this year.\n\nBTC miners, who validated Ordinal inscriptions on the Bitcoin blockchain, managed to collect fees worth BTC 1,495 as of May 24. At a point, when BTC is trading at $26,077 (roughly Rs. 21.5 lakh), the amount that Ordinals validators made comes to $40.2 million (roughly Rs. 332 crore).\n\nNine out of the highest valued NFTs sold in recent weeks were supported by the Bitcoin blockchain.\n\nOrdinals NFT collections like Space Pepes, Bitcoin Frogs, and $NALS NFTs reportedly managed to fetch $12.2 million (roughly Rs. 101 crore), $9.8 million (roughly Rs. 81 crore), and $6.8 million (roughly Rs. 563 million), respectively.\n\nWith these staggering revenue collections via Ordinals NFTs, Bitcoin has surpassed usually preferred blockchains like Polygon and Solana in terms of capturing the digital collectibles market share.\n\nAs opposed to Ethereum, Polygon, and Solana — all of which are eco-friendly and green blockchains, Bitcoin is an energy-intensive blockchain that requires loads of electricity and advanced computers for miners to validate transactions and add newer blocks to the blockchain.\n\nIn recent weeks, NFT marketplaces like Binance NFT and Magic Eden have added support for the trade and sale of Ordinals NFTs. The OKX crypto exchange is also reportedly planning to debut its NFT marketplace that will support Ordinals NFTs.\n\nMeanwhile, Ethereum continues to be the reigning regent of the NFT kingdom.\n\nEthereum-based NFT sales bagged a whopping $392 million (roughly Rs. 3,245 crore) in the last 30 days.\n\nSolana and Polygon NFTs, on the other hand, managed to pull in $53.7 million (roughly Rs. 444 crore) and $27 million (roughly Rs. 223 crore) in sales over the last month.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nSamsung Galaxy A34 5G was recently launched by the company in India alongside the more expensive Galaxy A54 5G smartphone. How does this phone fare against the Nothing Phone 1 and the iQoo Neo 7? We discuss this and more on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTI1L2V4cGxhaW5pbmctd2h5LXBlcGUtZnJvZy1tZW1lY29pbi1jcnlwdG8tY3JhemUtaXMtYS1zdHJlc3MtdGVzdC1mb3ItYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Popular Pepe Frog Memecoin NFT Puts Pressure on Bitcoin (BTC) Value - Bloomberg",
        "content": "Bitcoin may be the most widely recognized name in crypto, but its chief rival Ethereum has cornered a bigger share of the recent innovation in digital assets, whether it’s nonfungible tokens or decentralized finance apps. That’s because Ethereum’s underlying software is seen as more versatile and better able to handle bursts of activity without getting clogged up and slowing down. Now Bitcoin finds itself playing host to crypto’s latest speculative frenzy, a frog-branded “memecoin” called Pepe, putting the original crypto network’s technology under strain.\n\nMemecoins are digital tokens depicted with an image — often an animated character or animal — that can quickly gain notoriety and soar in value. Although they have little practical use, they can draw an exuberant community of followers who hoard or trade them. (The name takes its cue from so-called meme stocks, such as Gamestop Corp., that were seized upon by retail traders during the pandemic and driven to stratospheric valuations based on social media chatter.) There are hundreds of memecoins, some worth almost nothing, others with market values of $100 million or more. Investors often leap upon a newly minted memecoin when it starts trading on a digital exchange such as Coinbase or Robinhood. Others pile in after them for fear of missing out. One famous memecoin, Dogecoin, ascended to stardom when Elon Musk tweeted memes based on the coin, which inspired a number of dog-themed memecoins such as Shiba Inu."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL3VuaXN3YXAtdjMtZGVwbG95bWVudC1vbi1mYW50b20v0gFFaHR0cHM6Ly9lbi5ldGhlcmV1bXdvcmxkbmV3cy5jb20vdW5pc3dhcC12My1kZXBsb3ltZW50LW9uLWZhbnRvbS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Temperature Check: Uniswap V3 Deployment On Fantom - Ethereum World News",
        "content": "Summary:\n\nA proposal to launch Uniswap’s third generation DEX or V3 on Fantom’s blockchain is currently undergoing a “temperature check” governance vote.\n\nThe proposal highlighted a market opportunity that could pull in $30-40 million in weekly trading volume while onboarding a scalable network with low transaction fees for users\n\nFantom seems next in line of EVM chains eyed by the leading decentralized exchange after expanding to BNB Chain, DeFi’s second-largest ecosystem by TVL.\n\nThe Uniswap DAO is currently considering launching the third iteration of its decentralized exchange protocol on Fantom, a layer 1 blockchain with a proof of stake (PoS) consensus model and Ethereum Virtual Machine-compatibility (EVM).\n\nUniswap’s Business Source License (BSL) expired on April 1 and will allow other entities to leverage the V3 design. This opportunity could lead to “potentially unsafe forks” of the startup’s DEX model, the proposal from Blockchain@Columbia in conjunction with Fantom and Axelar noted.\n\nWith the expiry of the Uniswap v3 BSL, other DEXs including Beethoven X, are eyeing the opportunity to seize market share on the Fantom chain. In order to stay ahead of the competition, Uniswap must establish its presence on Fantom quickly and efficiently.\n\nFantom’s low fees and developer-friendly architecture also offer Uniswap users wider access to larger liquidity pools and a basket of DeFi markets. Fantom users will also be able to access DeFi’s leading blue-chip trading venue and one of crypto’s most popular protocols.\n\nAxelar, a cross-chain bridge platform that connects multiple blockchain networks, will act as the bridge infrastructure provider.\n\nUniswap Expansion Frenzy\n\nSeveral proposals to expand Uniswap beyond Ethereum’s network have emerged in 2023, possibly propelled by the BSL expiry and a strategy to claim greater market share as the leading DEX. A 0XPlasma Labs plan to launch V3 on BNB Chain – another EVM-compatible network – was approved in January. Wormhole was chosen as the bridge provider.\n\nAnother proposal to launch V3 on Polygon’s zero knowledge EVM (zkEVM) garnered massive support from the governance community."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXBvbHlnb24tYW5kLWRvZ2V0dGktbWVtZS1jcnlwdG9zLWFuZC10aGVpci1mdXR1cmUtYXMtc3VjY2Vzc2Z1bC1wcm9qZWN0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Ethereum, Polygon, And Dogetti: Meme Cryptos And Their Future As Successful Projects - Analytics Insight",
        "content": "In the dynamic realm of cryptocurrencies, Ethereum, Polygon, and Dogetti (DETI) have emerged as prominent players, captivating the attention of investors and enthusiasts. This comparative article aims to dissect the features, offerings, and market potential of these meme cryptos while exploring their distinctive characteristics. By delving into the underlying technology, utility, and future prospects, readers looking for the next big crypto investment and meme coins with utility will gain a comprehensive understanding of these projects.\n\nEthereum – The Pioneer of Smart Contracts\n\nEthereum, the trailblazer of decentralized blockchain platforms, offers a versatile ecosystem for developers to create decentralized applications (DApps) and execute smart contracts. Powered by its native cryptocurrency Ether (ETH), Ethereum has gained widespread recognition for its robustness and security. Ethereum allows developers to build decentralized finance (DeFi) applications, non-fungible tokens (NFTs), and various other blockchain-based solutions, making it a frontrunner in the crypto industry.\n\nPolygon – Enhancing Ethereum’s Scalability\n\nRecognizing the scalability challenges faced by Ethereum, Polygon (formerly Matic Network) was developed as a layer 2 scaling solution. By leveraging a network of interconnected blockchains, Polygon provides a framework for creating Ethereum-compatible sidechains. This solution enables faster and more cost-effective transactions, alleviating the congestion and high fees associated with the Ethereum network. Polygon’s integration with popular DeFi projects and its growing adoption position it as a promising investment opportunity.\n\nDogetti – The Meme Coin with Utility\n\nDogetti, a rising star in the meme coin universe, brings a unique twist to the crypto market. Combining the lightheartedness of meme coins with practical utility, Dogetti aims to be more than just a speculative asset. With a strong emphasis on community-driven initiatives and charitable donations, Dogetti has successfully captured the attention of investors seeking both entertainment and a profound sense of purpose.\n\nIts tokenomics include automatic liquidity generation and redistribution to holders, fostering a vibrant ecosystem. What this means in practice is that those holding DETI, will be rewarded over time as they are given more tokens as others buy and sell it. As the trading volume of the token becomes higher and the price increases with the volume of trade, you have essentially created a form of passive income for just being a part of the project. Dogetti strives to create stability through its utility-driven approach, differentiating itself within the meme coin space.\n\nWhat Should You Do?\n\nEthereum, Polygon, and Dogetti offer distinct value propositions to investors and enthusiasts in the crypto market. Ethereum remains the powerhouse for smart contracts and DApp development, while Polygon addresses scalability issues with its layer 2 solutions. Dogetti stands out by combining meme coin appeal with utility and community involvement. Each project caters to a specific niche within the crypto space, and their futures hold promising potential.\n\nTo stay informed about the latest developments and investment opportunities in the crypto market, you can explore various platforms that provide comprehensive news, education, and updates on the crypto industry. Staying updated with the latest trends and developments will help you make informed decisions aligned with your investment goals.\n\nClick below to join the Dogetti family:\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvYmFua2luZy9maW5hbmNlL3VubG9ja2luZy10aGUtcG90ZW50aWFsLWJlc3QtbHNkLWNyeXB0by10b2tlbnMtdG8tYWRkLXRvLXlvdXItcG9ydGZvbGlvL2FydGljbGVzaG93LzEwMDUwNTg4OS5jbXPSAZoBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL2luZHVzdHJ5L2JhbmtpbmcvZmluYW5jZS91bmxvY2tpbmctdGhlLXBvdGVudGlhbC1iZXN0LWxzZC1jcnlwdG8tdG9rZW5zLXRvLWFkZC10by15b3VyLXBvcnRmb2xpby9hbXBfYXJ0aWNsZXNob3cvMTAwNTA1ODg5LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Unlocking the Potential: Best LSD Crypto Tokens to Add to Your Portfolio - The Economic Times",
        "content": "Thanks to the recent Ethereum Shanghai upgrade, liquid staking derivatives (LSDs) have become the latest trend in the decentralized finance space (DeFi), offering stakers unconventional ways to unlock liquidity for their staked crypto assets and earn additional yields.\n\nLiquid staking derivatives are gaining momentum across the Ethereum network and have the potential to dominate other ecosystems, including major layer-1 blockchains like Avalanche and Polygon.\n\nRecent data from DeFiLlama shows that approximately $17.99 billion is currently locked up in LSDs, with Lido (currently the largest liquid staking protocol) dominating the space with approximately $11.95 billion total value locked (TVL).\n\nFollowing the major ethereum upgrade (also known as the Shanghai or Shapella upgrade), there has been a sharp rise in interest in LSDs, which has led to a surge in cash flow in DeFi and made staking more accessible to a lot of people who can now take advantage of both staking rewards and liquidity. The upgrade enables withdrawals from Ethereum staking contracts, significantly reducing the risk of holding staked Ethereum (stETH).\n\nWhat are liquid staking derivatives (LSDs)?\n\nLiquid Staking Derivatives (or Liquid Staking Tokens) are a unique kind of token that allows stakers to earn yield without losing the liquidity of their staked assets. These liquid tokens can be used in various ways; they can be sold, traded or used in Defi applications just like regular ETH.Staking tokens in proof-of-stake blockchains means locking tokens as collateral to secure the network and earn rewards, however, due to the lock-up nature, these tokens become illiquid.\n\nThe Ethereum Shanghai Upgrade Revolution\n\nAfter the merge in September 2022, ethereum blockchain successfully swapped from Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoS) mechanism. By moving from PoW to PoS, the Ethereum blockchain now relies on validators instead of miners to run it.\n\nSince the launch of Ethereum's Beacon Chain in December 2020, the first phase of the PoS transition, individuals could stake their ETH and serve as validators to process transactions and secure the network. To become a validator, stakers needed a specialized hardware and at least 32 ETH stake to run nodes themselves and receive rewards in blocks. However, they were unable to unstake their tokens and withdraw their rewards. Thanks to the Ethereum Shanghai upgrade, validators can now unstake their staked ETH and withdraw their rewards.\n\nWhy are LSD tokens on the Rise?\n\nThe recent upgrade includes a code referred to as EIP 4895, which allows Beacon Chain staked ETH withdrawals, enabling a 1:1 exchange of staked Ether for Ether. With this development, ETH holders can now stake their tokens through liquid staking pools to generate yields, thus increasing the demand for LSDs and triggering rapid growth in DeFi TVL.\n\nLiquid staking derivatives solve the problem of capital inefficiency by providing users with a liquid and usable token representing their staked asset. They also eliminate the 32 ETH entry barrier, enabling anyone to stake any amount of ETH they can afford in exchange for additional yields.\n\nBest LSD Crypto Tokens In 2023\n\nLSD tokens have quickly become the biggest crypto trend in 2023. As such, an increasing number of DeFi protocols have rolled out to offer a more flexible way to stake and earn by providing LSDs.\n\nCurrently, 18.5 million ETH (~33.40 billion) are being staked in liquid staking pools. The annual percentage rate (APR) for staking ETH currently sits at around 8.98% today.\n\nAs Ethereum staking ratio increases, the use cases for liquid staking protocols and their tokens will also increase. Here are some of the best LSD protocols and their tokens for ETH holders looking to earn yield through staking.\n\n1) Lido ($LDO)\n\nAs a crypto trader, this is one of the best LSD tokens in the market to look out for. Lido is currently the largest liquid staking protocol dominating the space with an estimated $11.95 billion TVL at the time of writing. It has a market cap of about $2 billion, 85% of the total 1 billion LDO tokens are already in circulation.\n\nLido allows users to stake their ETH and earn additional rewards - with no lock ups and daily rewards. It supports Ethereum, Solana, Polygon, Terra, Kusama and Polkadot.\n\nLDO – the native utility token, is used for granting governance rights and managing fee distribution. The token is available for trading on various exchanges, with cryptocurrency and stablecoin pairs currently available.\n\nWith LSDs on the rise, LDO has the potential to offer higher annual yield and market share than other protocols.\n\n2) Rocket Pool ($RPL)\n\nRocket Pool is one of the largest decentralized Ethereum LSD protocols after the Lido protocol. The protocol aims to reduce both the capital and hardware requirements for staking on ETH 2.0, adding to the decentralization and security of Ethereum.\n\nRPL is the ERC-20 utility token of Rocket Pool, and it's used to govern the PDAO and can be staked by node operators.\n\nUsers can run their own nodes with only 16 ETH and 1.6 ETH worth of RPL. Node operators stake RPL as insurance, where users stake Ether and receive rETH, a liquid ERC-20 token, in return. This token automatically accrues staking rewards based on the performance of the entire network of node operators.\n\nOn Rocket Pool, node operatives receive a delegation of 15 per cent, which covers their operational costs and incentivizes them to provide high quality services to their users.\n\nThe current Rocket Pool market capis $958,730,935 with a circulating supply of 19,401,735 RPL. Over the last year, Rocket Pool price has increased by 102.20%. During the last month, the price of RPL has risen by 5.09%.\n\nRPL is available on UniSwap (V3), Hoo, BKEX, XT.COM, Hotbit, and Bvnex.\n\n3) Tenet Protocol ($TENET)\n\nTenet, the first layer-1 blockchain to create a DeFi ecosystem for LSDs. The DeFi ecosystem implants a unique model called Diversified Proof of Stake (DiPoS), which supports staking with any LSD asset from other chains, such as ETH, BNB, ATOM, SOL and ADA. As such, Tenet becomes partially secured by all its supported networks, thus improving security compared to standard single-token Proof of Stake.\n\n$TENET is the native token of TENET. It is used at the base layer of the blockchain to pay for transaction execution as a gas token. TENET can also be staked in a Validator to secure the blockchain through TENET's revolutionary DiPoS--mechanism. When you stake TENET you will receive an LSD of TENET called tTENET. tTenet also needs to be locked up with the corresponding staking provider to receive Validation rewards from securing the blockchain.\n\nBy participating in Tenet validation and earning network transaction fees with LSDs like stETH and cbETH, one can still benefit from the ETH staking yield that these LSDs provide.\n\nThe platform offers a zero management fee, that is, it eliminates the 10% management fee charged by protocols like Lido, as a form of security incentivization.\n\nWith its unique blockchain mechanism and utility, the token is sure to be a promising one with significant use cases.\n\n4) Ankr ($ANKR)\n\nAnkr is a leading blockchain infrastructure provider which offers multi-chain API connections and runs RPC nodes besides staking solutions. The LSD protocol aims to make the adoption of Web3 easier by offering a platform where users can deploy nodes on PoS blockchains, stake their PoS tokens and access decentralized finance (DeFi) applications.\n\nANKR, the native utility and governance token of Ankr, has many use cases, including as payment for services within the Ankr ecosystem and as a means of earning passive income by staking. The Ethereum token can be used for on-chain governance and also as an insurance for network participants.\n\nWith a market cap of over $250 million and a maximum supply of 10 billion (100%), Ankr is one of the largest Ethereum staker and go-to staking infrastructure providers for ecosystems like the BNB, Polygon, and more.\n\nConclusion\n\nThe Shanghai upgrade helped to bring back confidence in the Ethereum blockchain and served as fuel for LSD protocols. Issues like capital inefficiency and lock up periods that made stakes illiquid are now being resolved with the emergence of LSD protocols. By providing liquidity and yield opportunities for stakers, these protocols are unlocking the potential of the rapidly growing LSD market.\n\nDisclaimer\n\nThis is an advertorial. BCCL disclaims any and all warranties - expressed or implied - relating to the content and does not guarantee, vouch for, or endorse any of the content. The content does not promote, suggest or present Crypto products to be a way to solve financial difficulties / achieve financial security / act as an alternative to employment / income opportunity. Crypto products, crypto currencies, NFTs are unregulated and may be risky, with no legal recourse in case of monetary loss. Views expressed herein are independent opinions based on studies. You may act at your own risk while relying on the content of this advertorial. Should you make a decision to act, or omit to act, you should seek appropriate legal advice in the relevant jurisdiction.\n\nDisclaimer: Content Produced by Heylin Spark"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2Jlc3QtY3J5cHRvLXRvLWJ1eS1ub3ctdGhlLXVsdGltYXRlLWd1aWRlLXdpdGgtYXBlbWF4LWJpZy1leWVzLWNvaW4tZXRoZXJldW0tYW5kLW1vcmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Best Crypto to Buy Now: The Ultimate Guide with ApeMax, Big Eyes Coin, Ethereum, and more - Analytics Insight",
        "content": "Consumer interest in crypto has been increasing as the cryptocurrency market has been regaining momentum this year. Buyers are all looking for the best crypto to buy now in the hopes of finding an exciting opportunity which may lead to big returns. For savvy buyers with an understanding of the rewards and risks associated with the market, finding the best crypto to buy can lead to a big pay day.\n\nThis article is an ultimate guide, showcasing the best cryptocurrencies to buy now based on market research and fresh data from analysts in the field. This guide will showcase the best cryptocurrencies that are being sought after by buyers and that are getting increasing coverage in the press. It is important to understand that buying crypto is not for everyone, however, for buyers who understand the possible rewards and risks, this article showcases some exciting options worth exploring.\n\nHolding the leading spot for the best crypto to buy now is ApeMax, a trailblazing coin that delivers unparalleled opportunities for enhancing reward earnings through its staking tokenomics.\n\n8 Best Cryptocurrencies to Buy Now:\n\nApeMax Ethereum BigEyes Bitcoin Love Hate Inu Solana Polygon Matic Polkadot\n\nBest Crypto to Buy Now and why, full list:\n\nApeMax\n\nApeMax is a new coin and one of the best crypto to buy now. ApeMax has just started its presale, making it an ideal time to seize the golden opportunity to acquire ApeMax coins at unprecedentedly affordable presale rates.\n\nApeMax Coin revolutionizes the cryptocurrency landscape by introducing innovative tokenomics that empower users to earn rewards through staking on creators, defi projects, influencers, and charitable organizations.\n\nDue to the innovative nature of its tokenomics, ApeMax has been listed as one of the best crypto presales worth exploring.\n\nApeMax offers early adopters an exclusive advantage with the option to purchase Early Birds Loot Boxes. By acquiring ApeMax tokens through these boxes, presale buyers can enjoy discounts of up to 50% on their token purchases.\n\nThese Loot Boxes offer an enticing opportunity that enables early buyers to secure ApeMax at exceptionally favorable presale prices and receive additional tokens as part of the package. This is a great way to get the greatest the benefits of buying in ApeMax coins early on\n\n>>> Get ApeMax Loot Boxes Here <<<\n\n>>> Visit ApeMax Website to Learn More <<<\n\nIn a crypto world where most new coins are derivatives of old projects, or variants of Doge or Pepe, ApeMax is paving a new path by offering a token with real utility, interesting tokenomics, and a spectacular brand identity centered around their lovable character, a cute ape on a rocket.\n\nEthereum\n\nEthereum, often hailed as the ruler of utility crypto tokens, serves as the cornerstone of the decentralized economy.\n\nWith its resilient infrastructure and widespread acceptance, it stands tall as the preferred platform for decentralized applications (DApps) and smart contracts.\n\nBigEyes\n\nA darling in the crypto scene, Big Eyes has successfully raised over $41 million with its unique “cute as currency” concept and endearing cat theme. Operating on Ethereum, the Big Eyes Coin platform allows users to generate and distribute NFT content using their native $BIG tokens.\n\nNotably, Big Eyes demonstrates its commitment to environmental causes by allocating 5% of its supply to support environmental organizations. Stay tuned for forthcoming features as Big Eyes prepares for its official launch.\n\nBitcoin\n\nBitcoin, the original and widely recognized cryptocurrency, continues to serve as a prominent utility token and a reliable store of value.\n\nAs a decentralized digital currency, Bitcoin revolutionized the financial industry by providing a secure and efficient medium of exchange.\n\nLove Hate Inu\n\nSurpassing the $10 million mark in its presale, Love Hate Inu has experienced an extraordinary level of success. What makes this crypto different is the incorporation of a blockchain-based voting system for polls through which users can earn. This adds practical functionality to its meme-inspired token.\n\nLove Hate Inu coin users can actively engage in polls and earn token rewards by staking $LHINU tokens.\n\nSolana\n\nSolana is a high-performance crypto platform designed for decentralized applications and crypto-native solutions, offering fast transaction speeds and low fees.\n\nSolana focuses on providing scalability, security, and interoperability for developers and users.\n\nPolygon Matic\n\nRecognized as a great cryptocurrency for its scalability and interoperability, Polygon (formerly known as Matic) has emerged as a game-changer coin.\n\nFunctioning as a layer 2 scaling solution, Polygon enhances the performance of Ethereum-based applications by enabling faster transactions and reducing fees.\n\nPolkadot\n\nPolkadot is a crypto working on enabling multiple specialized blockchains, known as parachains, to operate in a scalable and interoperable fashion.\n\nPolkadot aims to facilitate seamless communication and data transfer between different blockchains, fostering a connected and decentralized ecosystem.\n\nBest Crypto to Buy Now – Conclusion\n\nIn this insightful guide, we have carefully evaluated the best cryptocurrencies to buy now, highlighting exceptional cryptocurrencies within the market. ApeMax stands out due to its unique and cutting-edge tokenomics, which empower holders to earn rewards by participating in staking. The ongoing ApeMax presale is an appealing opportunity to buy ApeMax coins at an affordable price, capturing the interest of cryptocurrency enthusiasts. However, it is vital to exercise caution and conduct thorough research, as crypto purchases may carry risks that necessitate careful consideration.\n\nApeMax Official Website: https://www.apemax.io\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iZXN0LWFsdGNvaW5zLXRvLWJ1eS1pbi0yMDIzLXRoZS1kZWZpbml0aXZlLWd1aWRlLXdpdGgtYXBlbWF4LWRvZ2Vjb2luLWV0aGVyZXVtLXBvbGthZG90LWZsb2tpLXNvbGFuYS1hbmQtY2hhaW5saW5rL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 May 2023 07:00:00 GMT",
        "title": "Best Altcoins to Buy in 2023 - The Definitive Guide with ApeMax, Dogecoin, Ethereum, Polkadot, Floki, Solana, and ... - Analytics Insight",
        "content": "As the cryptocurrency market gains momentum, there has been a surge in consumer interest, as buyers eagerly seek out the most promising altcoins to buy, with the anticipation of seizing exciting opportunities that could yield substantial returns. For astute buyers who possess a comprehensive understanding of the rewards and risks associated with altcoins, uncovering the best altcoin to buy holds the potential for a substantial windfall.\n\nPresented as the ultimate guide, this article unveils the top Altcoins to Buy in 2023, curated based on comprehensive market research and the latest insights from field analysts. Within this guide, you will discover sought-after altcoins that have received increasing attention in the media. It is crucial to acknowledge that investing in crypto is not suitable for everyone, but for buyers who comprehend the potential rewards and risks, this article presents enticing options worth delving into.\n\nApeMax tops the list of the best altcoins, thanks to its unique boost to earn staking tokenomics, empowering stakers to earn.\n\n12 Best Altcoins to Buy in 2023:\n\nApeMax Ethereum Solana Polkadot Big Eyes Love Hate Inu Cardano Polygon Matic Shiba Inu Dogecoin Floki Chainlink\n\nWhat are Altcoins?\n\nAn altcoin refers to any cryptocurrency other than Bitcoin, serving as an alternative digital currency with its own unique features and characteristics.\n\n12 Best Altcoins to Buy in 2023 and why, full list:\n\nApeMax\n\nEmbarking on its presale journey, ApeMax offers buyers a compelling chance to acquire its coins at the most affordable rates yet. ApeMax coin is one of the best altcoins to buy in 2023 as it introduces groundbreaking tokenomics that empower users to earn rewards by staking on various entities.\n\nRecognized for its groundbreaking tokenomics, ApeMax has secured a spot among the best crypto presales that warrants exploration.\n\nEarly adopters of ApeMax gain a distinct edge through the opportunity to acquire Early Birds Loot Boxes, allowing presale buyers to secure ApeMax tokens at discounts of up to 50% on their purchases.\n\nThese captivating Loot Boxes offer early buyers an irresistible opportunity to secure ApeMax at highly favorable presale prices, while also enjoying the added perk of receiving extra tokens. It serves as a fantastic means to fully harness the benefits of purchasing ApeMax coins early on.\n\nAmidst a sea of crypto projects that mimic existing ones or draw inspiration from Doge and Pepe, ApeMax breaks the mold by presenting a token that brings real utility, unique tokenomics, and a delightful brand persona featuring an endearing ape on a rocket.\n\nEthereum\n\nEthereum, commonly regarded as the king of altcoins, is the foundation of the decentralized economy.\n\nEthereum’s robust infrastructure and broad adoption make it the go-to platform for decentralized applications (DApps) and smart contracts.\n\nSolana\n\nSolana is an altcoin created for decentralized applications and crypto solutions demanding quick transaction speeds and affordable fees.\n\nSolana prioritizes scalability, security, and interoperability to cater to developers and users alike.\n\nPolkadot\n\nPolkadot is an altcoin that focuses on establishing a scalable and interoperable environment for multiple specialized blockchains, called parachains.\n\nPolkadot’s objective is to enable smooth communication and data exchange among various blockchains, fostering a connected and decentralized ecosystem.\n\nBig Eyes\n\nBig Eyes has emerged as a captivating force in the altcoin realm, amassing a staggering $41 million through its enchanting “cute as currency” presale.\n\nOperating on the Ethereum network, the Big Eyes Coin platform empowers users to create and distribute NFT content using their exclusive $BIG tokens.\n\nLove Hate Inu\n\nLove Hate Inu is another great altcoin, and has achieved exceptional success, raising over $10 million in its presale.\n\nWhat sets this cryptocurrency apart is its integration of a blockchain-based voting system, allowing users to earn rewards by participating in polls.\n\nCardano\n\nCardano is an altcoin that aims to provide a secure and scalable infrastructure for the development of decentralized applications and smart contracts.\n\nWith a strong focus on research-driven development and a layered architecture, Cardano aims to offer increased sustainability, interoperability, and transparency.\n\nPolygon Matic\n\nPolygon, previously known as Matic, is acknowledged for its impressive scalability and interoperability in the altcoin realm.\n\nOperating as a layer 2 cryptocurrency, Polygon improves the efficiency of Ethereum-based applications by facilitating quicker transactions and lowering fees.\n\nShiba Inu\n\nSHIB, known as Shiba Inu coin, is an altcoin that derives its popularity from its connection to the Shiba Inu dog breed and Dogecoin. Launched in 2020, its objective is to offer a decentralized and community-oriented platform for its holders.\n\nDogecoin\n\nDogecoin, a well-established and widely embraced altcoin, has an intriguing backstory. Originating as a lighthearted joke, it has captured significant interest and backing from the crypto community, aided by endorsements from influential figure Elon Musk, resulting in substantial media coverage. Dogecoin’s market cap is well over $9 billion according to the latest data from CoinGecko.\n\nFloki\n\nFloki, a relatively fresh altcoin, takes inspiration from Elon Musk’s canine companion while incorporating decentralized finance, non-fungible tokens (NFTs), and the concept of a Metaverse.\n\nWhat sets Floki apart is its support for both Ethereum and Binance Smart Chain, offering dual-chain compatibility.\n\nChainlink\n\nChainlink is an altcoin that strives to connect smart contracts with real-world data, facilitating the smooth integration of external information into blockchain networks.\n\nServing as a decentralized oracle network, Chainlink establishes trustworthy and secure links, guaranteeing the precision and integrity of data utilized in smart contract operations.\n\nBest Altcoins to Buy in 2023 – Conclusion\n\nThis comprehensive guide has offered an in-depth analysis of the top altcoins to consider buying in 2023, spotlighting noteworthy projects within the market. ApeMax emerges as a standout choice with its groundbreaking tokenomics, empowering holders to earn rewards through staking. The ongoing ApeMax presale presents an attractive opportunity at an affordable price. Nonetheless, it is crucial to recognize that crypto investments may not align with everyone’s financial objectives, necessitating thoughtful consideration.\n\nApeMax Official Website: https://www.apemax.io\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tdHJhZGVycy1zY3JhbWJsaW5nLWZvci10aGUtZXhpdHMtYWZ0ZXItcHJpY2UtY3Jhc2gv0gFXaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9ldGhlcmV1bS10cmFkZXJzLXNjcmFtYmxpbmctZm9yLXRoZS1leGl0cy1hZnRlci1wcmljZS1jcmFzaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Ethereum Traders Scrambling For The Exits After Price Crash - Bitcoinist",
        "content": "Ethereum prices unexpectedly crashed on May 24, sending the coin below last week’s lows towards the $1,800 psychological level.\n\nFollowing this dump, on-chain data from Coinanalyze reveals that there has been a sharp drop in open interest, suggesting that some traders were caught unaware and had to exit their positions.\n\nEthereum’s Open Interest Dropping\n\nOn May 24, ETH’s open interest stood at $5.2 billion across all major cryptocurrency exchanges like Binance and OKX. Out of this, $4.7 billion were from perpetual futures, while less than $450 million from futures.\n\n\n\nIn cryptocurrency derivatives trading, open interest is the total number of open positions. These positions can be long or short and drawn from perpetual futures and futures of leading platforms.\n\nBeing derivatives, open interest positions are often leveraged, meaning the trader borrows funds from the exchange to trade a bigger lot size. In this way, traders have to allocate collateral, which is margin, to fund the trade.\n\nDepending on the lot size of the trade and the leverage used, there can be “margin calls”. Here, when the underlying asset’s price moves against their predicated direction, the exchange can sell the collateral to protect itself if the trader doesn’t top up their margin.\n\n\n\nOn May 24, ETH prices, aligning with the general trend across the crypto markets, fell roughly 5%, dropping from highs of $1,875 to as low as $1,775. This reversed gains of the past two weeks, forcing the coin lower in sync with losses from late April and early May 2023.\n\nAs a result of this correction, Coinalyze data shows that the open interest in Ethereum positions crashed by 7.3%.\n\nThere is now $5.2 billion worth of ETH derivatives positions, most of which is in Binance, the world’s largest cryptocurrency exchange.\n\nBinance has $2.1 billion of ETH positions as of writing on May 24, while OKX and Bybit each have $1.1 billion and $1 billion, respectively.\n\nThere are roughly $189 million of ETH open positions on dYdX, a decentralized exchange (DEX).\n\nBased on available data, traders still prefer custodial cryptocurrency exchanges when trading ETH derivatives. There are non-custodial options like dYdX that are gaining momentum.\n\nMillions Worth Of ETH Longs Liquidated\n\nCoinalyze data also shows that only $18.7 million of “long” ETH positions have been liquidated by exchanges in the last 24 hours.\n\nIn total, there were $22.4 million in liquidations indicating that most traders were bullish, expecting prices to edge higher in the days ahead.\n\nEthereum prices are bearish, contracting in the past day and extending losses from late April when the coin soared to $2,100 despite positive on-chain data flow.\n\nAs of May 25, the total amount of ETH staked, securing the proof-of-stake network, is at record highs of over $41 billion.\n\nFeature Image From Canva, Chart From TradingView"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3ZpdGFsaWstY2FsbHMtZGZpbml0eS1ldGhlcnMtc2lzdGVyLW5ldHdvcmsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Vitalik Buterin calls DFINITY Ethereum's sister network - EDCON 2023 - Cryptopolitan",
        "content": "During the EDCON 2023 conference, Vitalik Buterin called the The Internet Computernetwork Ethereum’s sister network refuting competition claims. In the world of blockchain technology and crypto, Ethereum has emerged as a prominent player, revolutionizing the way we think about decentralized applications and smart contracts.\n\nHowever, another platform has recently gained significant attention in the crypto community, positioning itself as Ethereum’s sister network: the DFINITY project. DFINITY is a groundbreaking blockchain platform that aims to provide a highly scalable and efficient decentralized computing network. Created by a team of visionary developers, DFINITY offers a unique approach to blockchain technology.\n\nVitalik sees DFINITY as Ethereum’s sister network rather than a competition\n\nEthereum and DFINITY both strive to create a decentralized future, empowering individuals and businesses with the ability to interact directly, securely, and without intermediaries. While Ethereum has established itself as a leader in the field, DFINITY aims to complement its capabilities by addressing some of the scalability challenges that Ethereum currently faces.\n\nWhen it comes to Layer 1s that allow smart contracts, Ethereum is without a doubt the most popular. With a market valuation of approximately 216 billion dollars and 70 billion dollars in multiple DeFi protocols, Ethereum’s success has surely given door to many technical advances that other cryptocurrencies employ today.\n\nDFINITY, the future public blockchain-based cloud computing network that will seed a decentralized internet known as cloud 3.0. It is also completely compatible with the Ethereum Virtual Machine (EVM) and significantly reduces the cost of IT systems and business applications.\n\nIt’s incredible that DFINITY’s “Blockchain Nervous System” can mechanically adjust economic conditions as well as specific network settings to suit capacity needs. In brief, this network can evolve and address real-time issues, making it far more adaptable than present systems.\n\nDFINITY vs Ethereum VS\n\nEthereum is unquestionably the dominant decentralized public blockchain platform for running smart contracts. The Ethereum smart contract and EVM components added credibility to the technology. In addition, it possesses all the fundamental advantages that the conventional blockchain lacks. Here are the top 5 differences between Ethereum and Dfinity.\n\n1. On-chain governance VS off-chain governance – The The Internet Computer BNS is a built-in on-chain governance structure, whereas Ethereum discussions and decisions must be conducted off-chain.\n\n2. Proof of Stake (PoS) VS Proof of Work (PoW) – PoW is the requirement that block creators solve cryptographic riddles to earn the right to create a new block. PoS is a system that allows you to become the next bookmaker based on the stake fraction you own or deposit into the system.\n\nIn comparison to PoS, the PoW system requires more costly computations. Therefore, individuals produce evidence of their stake, which DFINITY will use. In certain circumstances, Ethereum uses both the PoW and the PoS. Note that Ethereum has transitioned to PoS.\n\n3. Security over Lifeness VS Lifeness over Security – Typically, DFINITY is so-called threshold groups, in which a random selection of 400 IDs manifest blocks and generate unique threshold signatures. When the threshold is not met, the entire system fails. In such circumstances, Ethereum takes a different approach using the proof of work architecture, which prioritizes life over security. The The Internet Computer, on the other hand, favors security over lifeness.\n\n4. Fixed-sized deposits VS variably sized deposits – There is a fixed sized deposit at DFINITY where the quantity of stake that you must deposit is fixed by the system and there is a requirement to create more than one ID. There are variously sized deposits in Ethereum where you can design the system with diverse affects.\n\nAs a result, in the never-ending war between The Internet Computer and Ethereum, both win according to different standards. It is also important to note that both are roughly equivalent in terms of their distinct individual characteristics.\n\n5. Actor model VS serialized contract execution – DFINITY, in general, follows the Actor Model because it allows for the execution of applications. This represents the fact that it provides both parallel contract execution and asynchronous message passing. On the other side, everything happens on Ethereum one after the other, and you need to store a lot of data in your memory, which puts a pressure on your machine’s memory."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMjQvY2FyZGFuby1ldGhlcmV1bS1jbGFzc2ljLXNjYW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 May 2023 07:00:00 GMT",
        "title": "Cardano vs Ethereum Classic: it's a scam - The Cryptonomist",
        "content": "Cardano co-founder Charles Hoskinson has made some comments on Twitter about Ethereum Classic (ETC), defining it as a scam.\n\nCardano’s Charles Hoskinson calls the Ethereum Classic crypto project a scam\n\nDirectly on the social network of crypto-lovers, Twitter, Charles Hoskinson, co-founder of Cardano, said that the Ethereum Classic crypto project is now a scam.\n\nETC is now a scam and it's only purpose is for insiders to dump on those they recruit with blind hope of some magical future that will never come. There is no roadmap, innovation, team, or vision. It's just anger and toxicity. The Twitter account was built up from years of effort… — Charles Hoskinson (@IOHK_Charles) May 19, 2023\n\nHoskinson’s remarks come in response to the release of a new “PoW Summit” event to be presented in September in Prague by the Litecoin Foundation and the Ethereum Classic Cooperative.\n\nNot only that, Hoskinson also intervenes after Ergo’s platform was mentioned in the comments, which was denied attendance by Bob Summerwill, executive director of the ETC Cooperative.\n\nApparently, Hoskinson’s claims referring to ETC are indirectly aimed at Summerwill.\n\nThe founder of ADA thus called the ETC crypto project a scam, which allows participants to make money from those they recruit, and which now has no roadmap, innovation, or a single vision.\n\nMoreover, Hoskinson added that what moves ETC is just “anger and toxicity.”\n\nCardano’s Hoskinson and the rant against the Ethereum Classic project in favor of Ergo\n\nHoskinson’s rant then also names Ergo, a next-generation PoW smart contract platform that enables new models of financial interaction.\n\nAnd indeed, in the eyes of Cardano’s founder, Ergo is what Ethereum Classic should have been, with plenty of purpose, willingness to innovate, good ethical leadership, and with funding for the future.\n\nThus, who knows whether the present outburst was intended to make Ethereum Classic look bad, or also to highlight the Ergo crypto project.\n\nIn any case, at the PoW Summit in Prague, other big crypto industry names such as Charlie Shrem, Jameson Lopp, Litecoin founder Charlie Lee, and Caitlin Long of Custodia Bank will also be present.\n\nADA vs ETC\n\nTrying to compare the two crypto assets Cardano (ADA) and Ethereum Classic (ETC), here is the situation.\n\nCardano (ADA) ranks 7th in market capitalization, which currently exceeds $12.7 billion. Ethereum Classic (ETC), on the other hand, is in the 25th position, with a market cap of above $2.5 billion.\n\nAt the time of writing, the price of ADA is $0.37, a 6% drop from last month. ETC’s price, on the other hand, is $18, with a 8% drop from last month.\n\nIt is worth mentioning that in terms of daily trading volume, ADA is trading for twice as much as ETC. And indeed, while ADA has a last 24-hour trading volume of nearly $150 million, ETC stands at $77.5 million."
    }
]