[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMDUvZXRoZXJldW0tYXJiaXRydW0tYW5kLXdoeS1sMi1zb2x1dGlvbnMtYXJlLXN1Y2gtYS1tZXNzL9IBYWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMDUvZXRoZXJldW0tYXJiaXRydW0tYW5kLXdoeS1sMi1zb2x1dGlvbnMtYXJlLXN1Y2gtYS1tZXNzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum, Arbitrum, and why L2 solutions are such a mess - Fortune",
        "content": "A hot topic in crypto circles these days is how to process more transactions on a blockchain, leading many pundits to say it can’t be done in a decentralized fashion. This opinion is a popular one but also belies a superficial understanding of the problem with Ethereum’s scaling solutions in particular—a problem that stems from the financing models driving these solutions.\n\nFor those unfamiliar with the debate, Ethereum and Bitcoin have for years struggled with congestion and high fees arising from their failure to keep up with demand on their blockchains. This has in turn created opportunities for projects offering “on-top” solutions as a means to handle that extra demand. The result is a plethora of so-called layer-2, or L2, sidechains—Arbitrum, Optimism, and Polygon among them—that are intended to increase transaction capacity while keeping the chain orderly.\n\nIn the Bitcoin network, these efforts have largely focused around Lightning, a system of secured peer-to-peer channels that allow for quick and cheap transactions. In the case of Ethereum, developers have taken a more baroque approach that typically looks like this: A technical team claims to have a novel solution to scale Ethereum by capturing transactions on their network, and that idea is pitched to venture capitalists. But instead of integrating this software directly into the main protocol, so Ethereum as a network can scale, a new token—an L2 token—is issued to transact using this new software.\n\nDoes this have to happen? Well, no. Strictly speaking, there is nothing stopping Ethereum leadership from incorporating scaling solutions at the protocol level to lower its costs and make the network more efficient. But instead of working to make the scaling happen directly, the Ethereum crowd has instead relied on the L2 route. (It’s worth noting that Tezos, the blockchain I cofounded, recently deployed an L2 solution without introducing a token.)\n\nWhile L2 solutions on Ethereum have succeeded in offering faster and cheaper transactions, their insistence on adding their own proprietary tokens add friction. To make matters worse, the L2 projects often rush to market with underdeveloped solutions, creating a reliance upon Ethereum contracts under their control and centralized oversight to address security issues later. While this tokenized approach funds development and generates hype, it quickly leads to disillusionment as inflated token market capitalizations fail to meet expectations.\n\nSo why does Ethereum continue to embrace these half-baked L2 solutions? Look no further than Sand Hill Road.\n\nTraditionally, venture capitalists offer financing for new businesses—the word “venture” connoting newer, riskier investments, unlike those perhaps preferred by other private equity firms. VCs typically look to exit their positions through IPOs or acquisitions, often on five- or seven-year time horizons.\n\nIf VCs had a chance speed up their exits—the big moment everyone gets paid—to an order of months, you can bet they would leap on it. And so enter a new model facilitated by crypto.\n\nIn Crypto VC speak, exit strategies don’t come from the creation of a useful, flourishing business. Since 2018 or so, VCs have acted as providers of bridge capital to teams until a token is created and sold. It’s about short-term storytelling because, ultimately, the value of the token isn’t defensible. Often, it’s a solution in search of a problem or, in the case of scaling, a source of additional friction. The last two months have served as testament to the instability of L2 tokens for a variety of business reasons.\n\n\n\nLast month, Coinbase announced it was launching an L2 solution based on Optimism. This was poetic: Optimism already has an unnecessary token and a staking mechanism for its distribution. Unfortunately, it lacks fraud proofs, or the basic security ingredient that makes a scaling solution more secure than a hope and a prayer. What we have here is a token in search of its own technology.\n\nMore recently, Arbitrum, an L2 on Ethereum that’s raised over $100 million from VCs such as Lightspeed, issued a governance token called ARB to justify its place outside the base Ethereum protocol. As part of its first “governing” act, the community was asked to vote on a proposal that would send 750 million of its tokens, worth around $1 billion, to its nonprofit foundation. When rank-and-file community members balked at this plan, the Arbitrum Foundation clarified that these funds were already being allocated—and, indeed, had been spent. It was a lucky day for those folks who gave them money last year in a private transaction, and virtually nobody else who bought into the gold-plated resumes of its founding team and the characterizations of their project.\n\nQuite the arbitrage, indeed.\n\nScaling solutions that create more costs and hoops to jump through for users by issuing pernicious tokens aren’t solutions at all. Ethereum will evolve once it weens off venture capitalists and embraces a model that seeks to disintermediate, rather than subsidize, the well-heeled financiers of Web2.\n\nKathleen Breitman is a cofounder of Tezos. The opinions expressed in Fortune.com commentary pieces are solely the views of their authors and do not necessarily reflect the opinions and beliefs of Fortune."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMDUvZXRoZXItcmVhY2hlcy1uaW5lLW1vbnRoLWhpZ2gtYWhlYWQtb2Ytc2hhcGVsbGEtdXBncmFkZS5odG1s0gFgaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDQvMDUvZXRoZXItcmVhY2hlcy1uaW5lLW1vbnRoLWhpZ2gtYWhlYWQtb2Ytc2hhcGVsbGEtdXBncmFkZS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ether is rallying ahead of major upgrade that will let holders more easily access their tokens - CNBC",
        "content": "Ethereum underwent a huge network upgrade called the merge which proponents say will make transactions much more energy efficient. Following the merge, ether prices have dropped following a huge run up ahead of the event. Jakub Porzycki | Nurphoto | Getty Images\n\nEther has spiked this week to a nine-month high, ahead of a major network upgrade that some crypto enthusiasts say will make the digital currency a more profitable long-term investment. The world's second-biggest cryptocurrency is up about 6% over the past three days, surpassing $1,900, while bitcoin is roughly flat over that stretch. Beginning next Wednesday, an upgrade to the blockchain, dubbed \"Shapella,\" will allow owners of ether to withdraw their assets. Up to this point, investors would have to use centralized exchanges like Coinbase or decentralized finance (DeFi) protocols like Lido, to essentially exchange their locked-up ether for a token of equivalent value. The recent rally has followed a similar pattern to past bouts of enthusiasm surrounding network upgrades. In September, ethereum ran up ahead of a historic transition to a more energy-efficient way of securing the network, called proof-of-stake. Ethereum previously had a vast network of miners all over the planet running highly specialized computers that crunched math equations in order to validate transactions. After the so-called \"Merge\" upgrade in September, ethereum migrated to a proof-of-stake system, swapping out miners for validators. Instead of running large banks of computers, validators leverage their existing cache of ether as a means to verify transactions and mint new tokens.\n\nwatch now\n\n\"Ether itself becomes a productive asset,\" said Danny Ryan, a researcher at the Ethereum Foundation, regarding the September upgrade. \"It's not something you might just speculate on, but it's something that can earn returns.\" In the post-merge era, ether has taken on some characteristics of a traditional financial asset, paying interest to holders. \"It's probably the lowest-risk return inside of the ethereum ecosystem,\" said Ryan, adding that yield in other corners of DeFi involve smart contracts and other types of counter-party risk. So far this year, ether has underperformed bitcoin , but recent gains have helped to close the gap. Ether is up nearly 59% this year, versus bitcoin's gain of 70% in 2023. Currently, over 18 million ether tokens worth about $32.5 billion are staked, meaning that 15% of ether's total supply are considered locked assets. While the coming upgrade will unlock much of that value, giving holders more control over their assets, there's some concern that the release of so many tokens will have a flooding effect of sorts on the market. Even with capped withdrawals, some $2.4 billion worth of ether could hit the open market, K33 Research said in a note on Tuesday. \"A plunge is likely to happen shortly after the completion of the upgrade, as a huge amount of ETH will be unlocked, and many people will also be selling their ETH,\" said Ilya Volkov, who runs a blockchain-based fintech platform. Volkov said he's bullish over the long term.\n\nwatch now\n\nThe ratio between the open interest of ether put and call options reached its highest level since May on Tuesday, according to data presented by crypto data analytics and news firm The Block. That could signal a buildup of bearish bets leading up to the network upgrade. According to research from Bernstein, of the 18 million ether tokens locked on the blockchain, almost 70% are staked through protocols like Lido, creating a measure of liquidity for investors. \"Liquidity for 70% of staked ETH is not new, they could do it anyways,\" Bernstein wrote. The firm described the remaining 30% of holders as \"original believers,\" who are unlikely exit their positions at this price. Having the ability to deposit and withdraw tokens might encourage more investors to stake ether, and some analysts said they expect a significant influx of capital onto the network once it proves that money that's been staked can be taken out with relative ease. WATCH: Bitcoin climbs as investors shrug off regulatory concerns"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA0LzA1L2ludmVudG9yLW9mLWV0aGVyZXVtcy1lcmMtMjAtdG9rZW4tc3RhbmRhcmQtcGxhbnMtbmV3LWJsb2NrY2hhaW4tbHVrc28tZm9yLWNyZWF0aXZlLXR5cGVzL9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA0LzA1L2ludmVudG9yLW9mLWV0aGVyZXVtcy1lcmMtMjAtdG9rZW4tc3RhbmRhcmQtcGxhbnMtbmV3LWJsb2NrY2hhaW4tbHVrc28tZm9yLWNyZWF0aXZlLXR5cGVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Inventor of Ethereum’s ERC-20 Token Standard Plans New Blockchain ‘LUKSO’ for Creative Types - CoinDesk",
        "content": "The universal profiles also get \"key managers,\" which can let users add multiple keys to their on-chain account that are assigned or execute different actions. The key manager checks which key can do what on the universal profile and can restrict specific activities of certain devices. In addition, having these multiple keys enables some kind of backup system in the event that a user loses access to a key."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS10dXJucy1idWxsaXNoLWFoZWFkLW9mLW5leHQtd2Vlay1zLXNoYW5naGFpLWFuZC1jYXBlbGxhLXVwZ3JhZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum price turns bullish ahead of next week's Shanghai and Capella upgrades - Cointelegraph",
        "content": "With one week to go until the Ethereum Shanghai and Capella upgrades on April 12, all eyes are on Ether(ETH). The second-largest cryptocurrency by market capitalization shrugged off rumors and regulatory action against exchanges to hit a seven-month high of $1,922 on April 5.\n\nEther price has momentum, and here are three strong reasons why.\n\nMultiple positive price achievements\n\nAccording to data from Cointelegraph Markets Pro and TradingView, Ether price has posted gains on the seven-day, one-month and three-month timeframes despite market volatility. Ether price gains are also notable from the year-to-date perspective, showing 59% growth.\n\nETH/USD price chart. Source: Cointelegraph Markets Pro\n\nEther’s ability to break resistance levels is leading some analysts to believe a $3,000 price target is on the horizon in Q2 2023. The trend shows that whale accumulation remains strong, growing by 0.5% in March, according to data from analytics provider Santiment.\n\nThe bullish buying activity may prove on-chain data correct that Ether sell pressure after the Shanghai hardfork will be a non-event.\n\nRelated: US enforcement agencies are turning up the heat on crypto-related crime\n\nThe uptick in proof-of-stake validation by placing Ether in staking contracts is bullish for the Ethereum ecosystem. Since launching on Aug. 4, 2021, the Ethereum network has witnessed over 18 million ETH staked on the blockchain.\n\nTotal Ether staked. Source: TradingView\n\nThe emergence of liquid staking derivatives has reduced the barrier to entry to participate in Ether staking. Lido, the leader in LSDs and the largest single entity by value, has close to one-third of all staked EtTH. Including interest received, Lido contracts hold 5.9 million ETH from 137,000 unique depositors.\n\nLido Ether deposits overview. Source: Nansen\n\nEthereum network TVL surges\n\nThe total value locked in the Ethereum network is also rising, partially as a result of Lido’s protocol comprising 22.4% of the TVL on the Ethereum network. Despite the TVL starting to drop on March 10 due to regulatory and macro headwinds, the decentralized finance market seems to be recovering.\n\nRelated: 3 key Ethereum price metrics cast doubt on the strength of ETH’s recent rally\n\nOn April 5, TVL reached $50.8 billion, nearly reaching the yearly high of $51.4 billion from Feb. 21.\n\nTVL dashboard. Source: DefiLlama\n\nThe strength of Ether price ahead of the Shanghai and Capella upgrades is visible on-chain through increased usage, whale accumulation and a steady uptick in staking. With only seven days remaining until the upgrade, traders expect continued volatility in Ether price.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1pcy1ldGhlcmV1bXMtc2hhbmdoYWktdXBncmFkZdIBRWh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1pcy1ldGhlcmV1bXMtc2hhbmdoYWktdXBncmFkZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "What Is Ethereum’s Shanghai/Shapella Upgrade? - Decrypt",
        "content": "In brief Ethereum’s Shanghai upgrade is a hard fork that took place in April 2023.\n\nThe Shanghai fork implemented EIP-4895, which allows validators to withdraw ETH that have been staked since as long ago as December 2020.\n\nAbout 14% of all ETH are currently staked, accounting for 16 million tokens and a current value of over $26 billion.\n\nThe Shanghai fork also has several other EIPs, mostly designed to reduce gas costs for Ethereum developers.\n\nThe fork notably does not include EIP-4844, which facilitates the “sharding” of the Ethereum blockchain into multiple chains in order to facilitate scalability.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum’s Shanghai upgrade, also known as the Shapella upgrade, is a hard fork that took place on April 12, 2023. One of the biggest developments associated with the fork is that it enables stakers and validators to withdraw assets from the Beacon Chain—a blockchain launched in 2020 to transition to the \"Merge.\" Shapella is a portmanteau word for \"Shanghai\" and \"Capella,\" two of the proposed Ethereum Improvement Proposals.\n\nBecause staked Ether accounts for about a seventh of the total supply of the token, or roughly 16 million coins, this has massive implications. The current value of all staked Ether is over $26 billion.\n\nEIP-4895\n\nAD\n\nAD\n\nThe most important development of the Shapella upgrade—allowing validators to withdraw staked tokens—is in line as Ethereum Improvement Proposal-4895, or EIP-4895. Validators have staked around 16 million ETH as a way of helping to secure the mechanism. Validators have been especially crucial to the Ethereum blockchain since September 2022, when the Merge began the process of shifting Ethereum’s consensus mechanism from proof-of-work to proof-of-stake. According to the new rules post-Merge, validators that stake 32 ETH in the chain can then participate in validating blocks, and each staked ETH ups the likelihood of a validator receiving block rewards.\n\nThe Merge required that validators lock up their ETH as well as any rewards they earned until a later chain update. Even though the Merge took place in 2022, validators have actually been staking ETH since December 2020. It was at this time that the Beacon Chain, relying on proof-of-stake as a mechanism, was released.\n\nWhat it Means for Validators\n\nThe most notable development of the Shapella hard fork for validators is that they can finally unlock all of their staked ETH. So validators could theoretically get in line to recover their staked tokens and pull them from the system. Some analysts view this outcome as unlikely, however, given Ethereum’s dominance in the DeFi space and the strong staking yield. Further, after the Shapella upgrade validators will be able to withdraw staked assets freely, so they won’t have to worry about locking up a significant sum of money (32 ETH has been valued at as much as $150,000 or so at its peak) for an indeterminate amount of time.\n\nValidators that do wish to unstake ETH after the Shapella fork can do so in a couple of ways. One is to create a “withdrawal credential” to unstake any rewards accrued in the last several years. The second and more consequential option is to exit the Beacon Chain completely by unstaking all 32 ETH.\n\nOther Improvements\n\nEIP-4895 is the key development for the Shapella fork, but there are several other smaller EIPs included as well. These other proposed improvements aim to reduce gas fees during periods of high activity to benefit Ethereum developers. They include EIP-3651, which proposes lowering gas costs related to Maximal Extractable Value payments when accessing the COINBASE address (COINBASE in this case is not related to the crypto exchange of the same name, but to software which allows developers to receive new tokens), EIP-3855, which aims to lower gas costs generally for developers, EIP-3860, which caps developer gas costs in certain cases, and EIP-6049, which addresses a similar concern.\n\nShapella remains a relatively small upgrade, particularly compared to the Merge. But it will have the potential for significant impact for those with staked ETH on the chain. And other upgrades to the Ethereum protocol are likely to come later in 2023, including some aiming to improve the Ethereum Virtual Machine and another hoping to split the Ethereum blockchain into several different “shards” in order to enhance scalability. This last proposed improvement, known as EIP-4844, had at one point been considered for inclusion in the Shapella upgrade, though it was later pushed back.\n\nAD\n\nAD"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1jcnlwdG8tY3J5cHRvY3VycmVuY3ktcHJpY2UtYml0Y29pbi1wcmljZS1zaGFuZ2hhaS11cGdyYWRlLTA4MzAxODYyMi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum soars 8% – closes in on $2k ahead of Shanghai upgrade - Yahoo Finance",
        "content": "Ethereum is edging towards $2,000. Illustration/Dado Ruvic/Reuters (Dado Ruvic / reuters)\n\nEthereum has gained 8% in the past 24 hours as it edges closer to the $2,000 (£1,602) mark ahead of the blockchain's Shanghai upgrade.\n\nEthereum (ETH-USD), the world's second largest cryptocurrency by market capitalisation, reached a high of $1,920 in the last 24 hours, a price level not seen since August 2022.\n\nThe upward trajectory comes despite uncertain macroeconomic conditions caused by successive US Federal Reserve rate hikes, and turmoil in the global banking sector following the collapse of Silicon Valley Bank (SIVB).\n\nWhat is Ethereum's Shanghai Upgrade?\n\nThe upcoming Shanghai upgrade will mark Ethereum's complete transition to a proof-of-stake network, further solidifying its position within the cryptocurrency landscape as the most widely adopted layer one blockchain.\n\nScheduled for April 12, the Shanghai upgrade, commonly known as 'Shapella', will signify the blockchain's complete shift from a proof of work (PoW) to a proof of stake (PoS) network. Proof of stake blockchains use over 99% less energy to validate than those that operate using proof of stake.\n\nThis transition follows the previous 'merge' upgrade in September, and for the first time, it will allow users to withdraw their staked ether, Ethereum's native cryptocurrency.\n\nRead more: Germany considers following Italy in banning ChatGPT\n\nBy moving to a proof of stake network, Ethereum will reduce its energy consumption by 99.9%, and enable users to generate passive income through staking their cryptocurrency.\n\nStaking involves earning financial rewards for contributing to the blockchain's network and supporting its functionality.\n\nThe Shanghai Upgrade will allow those ether 'stakers' who lock their funds to make the network function, to withdraw their staked ETH.\n\nThis is a relief to many stakers who experienced anxiety throughout the last quarter of 2022 when the price of the cryptocurrency was sent into a downward spiral after the collapse of the FTX exchange.\n\nStory continues\n\nToday's crypto prices\n\nThe global cryptocurrency market cap today stands at $1.25tn (£860bn), a gain of 2.5% in the last 24 hours, according to data from Coingecko.\n\nEthereum stands at $1,911 as of the time of writing, a gain of 8% in the past week.\n\nBitcoin (BTC-USD) is now priced at $28,531, up 5% in the past week.\n\nBitcoin has gained 70% since beginning of the year, and according to data from Coinglass, in the past 24 hours most traders of the digital asset hold long positions, suggesting market sentiment is currently in favour of more upward momentum.\n\nCoinglass data showed that in the past 24 hours, across the entire cryptocurrency market, 30,188 traders were liquidated, with the total liquidations comes in at $97.95m. The majority of these liquidations were of short positions as the whole market gained in value.\n\nRead more: Crypto live prices\n\nHowever, one of the most prominent losers in the past 24 hours was dogecoin (DOGE-USD).\n\nThe price of dogecoin shot up yesterday after Twitter changed the logo on the social media platform's website from the iconic blue bird to an image of a Shiba Inu dog associated with the dogecoin cryptocurrency.\n\nThe price of dogecoin, which is typically volatile, soared 35% in one day, however, it fell as day traders dumped the memecoin to take gains.\n\nDogecoin now sits at $0.096 per token, a fall of 2.2% in the past 24 hours, according to data from Coingecko.\n\nWatch: Polygon to 'overtake Ethereum in terms of economic activity,' claims co-founder | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLWV0aC1wcmljZS1zaG9vdHMtYW5vdGhlci02LWNsb3Nlci10by0yMDAwLXdhdGNoLXRoaXMtcmVzaXN0YW5jZS_SAWJodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1ldGgtcHJpY2Utc2hvb3RzLWFub3RoZXItNi1jbG9zZXItdG8tMjAwMC13YXRjaC10aGlzLXJlc2lzdGFuY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "As Ethereum Approaches $2,000, Watch These Resistance Levels - CoinGape",
        "content": "The world’s second-largest cryptocurrency Ethereum (ETH) has given another major breakout just a week before the Shanghai upgrade. As of press time, Ethereum (ETH) is trading up by 5.68% at a price of $1,911 and a market cap of $230 billion.\n\nOn the weekly chart, ETH has outperformed the rest of the altcoins as well as Bitcoin with 7.3% gains. It is for the first time since August 2022 that the ETH price has surged past the $1,870 level.\n\nadvertisement\n\nOn-chain data provider Santiment explains that this 8-month high comes due to the steady accumulation of ETH sharks over the past few months. It reported:\n\n“Ethereum jumped back over $1,870 today for the first time since August 17, 2022. This near 8-month high comes as sharks have been accumulating steadily since last summer. Addresses holding 100-10k $ETH have accumulated $4.24B in the past 9 months”.\n\nWith today’s price surge above $1,900, Ethereum (ETH) extends its 2023 gains to more than 60% closing the gap with Bitcoin. Popular crypto analyst Ali Martinez noted:\n\nOn-chain data reveals that the next critical resistance area is between $2,100 and $2,150, where over 200K addresses had previously purchased over 18M $ETH.\n\nEthereum Liquidity on the Downtrend\n\nAlthough the crypto market has registered a strong recovery this year in 2023, liquidity remains one of the major concerns for the top two digital assets – Bitcoin and Ethereum. Blockchain analytics firm Kaiko reported that ever since the FTX exchange collapse, the Ethereum market depth has been on a downtrend. The report notes:\n\nWhen charting the quantity of bids and asks within 2% of the mid price on USD/USDT order books, we can observe an unsurprisingly similar downwards trend. In mid-March, ETH market depth hits its lowest level since last May.\n\nWhen compared to Bitcoin, Ethereum’s drop in market depth is less extreme. While BTC’s drop in market depth is at 50%, ETH’s is at 41%. Kaiko adds: “Overall, both assets have suffered in the aftermath of the FTX collapse and banking crisis, with fewer market makers supplying liquidity to order books”."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLXJpc2VzLWFnYWluc3QtYml0Y29pbi1hcy1zaGFwcGVsbGEtdXBncmFkZS1uZWFycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum rises against Bitcoin as shappella upgrade nears - CryptoSlate",
        "content": "Ethereum (ETH) rose by around 5% during the past week against Bitcoin (BTC) as the community awaits the highly anticipated Shappella upgrade.\n\nDuring the last 24 hours, ETH increased 2.11% against BTC, rising to as high as 0.067965 on Binance before retracing to 0.067965 at the time of writing.\n\nThe improved performance has seen ETH’s dominance rise to 19.84% for the first time since March 12, according to CryptoSlate’s data.\n\nETH’s USD value rises to an 8-month high\n\nWhen ETH’s value is denominated in U.S. Dollars, it rose above $1900 for the first time since May 2022.\n\nHowever, the asset has retraced to $1894 as of press time, according to CryptoSlate’s data.\n\nThe price movement continues its positive performance for 2023. ETH spiked 7.1% in the last seven days and has risen 22% over the past month. On the year-to-date metric, ETH is up roughly 60%.\n\nMarket sentiments surrounding the Shappella upgrade\n\nWith the Shappella upgrade confirmed for April 12, market sentiment surrounding ETH has turned largely positive, while some analysts believe that the move would increase the selling pressure on the cryptocurrency.\n\nThe Shappella upgrade would allow Ethereum stakers to withdraw their staked tokens from the blockchain network.\n\nBlockchain analytical firm Nansen reported that the selling pressure on ETH from unstaking could be between $1.9 billion – $4.6 billion. According to the firm, this could hurt the asset because of the relatively thin liquidity of its spot markets.\n\nHowever, Nansen added that the positive effects of the Shanghai upgrade on ETH would likely counteract the initial selling pressure.\n\nMeanwhile, another blockchain analytical firm Santiment pointed out that ETH’s supply on exchange is currently at its lowest — 10.31%. The firm pointed out that investors are favoring self-custodial services for their assets.\n\nMarket analysts on Twitter have interpreted this to mean that holders strongly believe in ETH’s potential as a store of value. Since ETH completed the merge event in 2022, the asset has turned deflationary, and the volume held by long-term investors has risen.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1icmVha3MtMTkwMC1haGVhZC1vZi1zaGFwZWxsYS11cGdyYWRlLWxzZC10b2tlbnMtYm9vbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Breaks $1900 Ahead of Shapella Upgrade, LSD Tokens Boom - DailyCoin",
        "content": "ETH is trading above $1,900 for the first time since August 2022.\n\nEther is pumping despite ETH staking withdrawals being enabled next week.\n\nLSD tokens like LDO and RPL have also seen a significant increase in value in the past few days.\n\nThe crypto industry has been in one of the roughest bear markets ever. The majority of alternative tokens have plummeted more than 90% from their highs. Blue chip coins like Bitcoin (BTC) and Ethereum (ETH) also dropped over 70%.\n\nHowever, the market has been improving lately. For example, ether has just broken $1,900 despite the Shapella upgrade happening next week.\n\nEthereum Breaks $1,900 Ahead of Shapella Upgrade\n\nEthereum’s native currency has enjoyed a steady upside in the past few weeks. On Wednesday, ETH broke $1,900 for the first time since August 2022.\n\nETH is currently trading at $1,915, up 2.8% on the day and 7.6% on the week, according to data from CoinGecko. Ether’s market cap has climbed over $230 billion and currently stands at $230.7 billion.\n\nETH price action. Source: CoinGecko.\n\nEther pumping is exciting to see, given the upcoming Shapella upgrade. Shapella is a portmanteau of Shanghai and Capella, two Ethereum upgrades that are going to enable staked ETH withdrawals on April 12.\n\nSome believe that the enabling of ETH withdrawals will lead to a significant dump in ether’s price. That’s because there are currently 18 million ETH staked worth around $34.5 billion that will become available for withdrawing and, potentially, selling.\n\nOn the other hand, ETH staking withdrawals are bullish for liquid staking derivatives (LSDs), which offer a more convenient way of staking ETH. Many believe that at least some portion of the current locked ETH will be instead staked with LSDs.\n\nLSD Tokens Boom\n\nLSD governance tokens have also significantly increased in value in the past week.\n\nFor example, the most popular LSD protocol Lido’s governance token, LDO, is up 6.5% on the day and 15.2% on the week. It’s currently trading at $2.69 and is the 31st most valuable token.\n\nRocket Pool’s RPL is also trading at 6.5% higher than yesterday. One RPL is currently worth $48.26.\n\nThe increase in LSD token value aligns with the belief that the current stakers that have ETH locked will move it to LSDs. That’s because LSDs offer a liquid token in exchange for ETH that can be used across various decentralized finance (DeFi) platforms.\n\nOn the Flipside\n\nThe rise in ETH’s price can be a bull trap as weakening economic data points to a potential recession in the U.S. and worldwide.\n\nWhy You Should Care\n\nETH is one of the most desired assets in the crypto market. However, users should always do their own research before deciding where to invest and what asset to choose, especially in these uncertain economic times.\n\nRead more about Shapella’s potential impact on the price of ETH:\n\nETH Staking Withdrawals Confirmed: Ethereum Devs Reveal Date\n\nRead more about a huge NFT sale on Polygon:\n\nPolygon Sees Biggest 24-Hour NFT Sale with y00ts Fetching 75 ETH"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA0LzA2L2hlcmUtYXJlLXRocmVlLWJ1bGxpc2gtbWV0cmljcy1mb3ItZXRoZXJldW0tcml2YWwtc29sYW5hLXNvbC1hY2NvcmRpbmctdG8taW52ZXN0YW5zd2Vycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Here Are Three Bullish Metrics for Ethereum Rival Solana (SOL), According to InvestAnswers - The Daily Hodl",
        "content": "A popular crypto analyst says there are three metrics that are looking bullish for Ethereum (ETH) competitor Solana (SOL) right now.\n\nIn a new YouTube video, the anonymous host of InvestAnswers tells his 443,000 YouTube subscribers that Solana registered 446,000 daily active users in early April, a spike in activity that placed the project above all other smart contract platforms.\n\nThe analyst also notes that Solana has seen its seven-day moving average of non-vote transactions spike to nearly 30 million, a level it hasn’t neared since last August.\n\nAdditionally, the InvestAnswers host says Solana has the second-highest number of commits since the inception of any smart contract platform, after only Ethereum, which has the most by far.\n\nExplains the analyst,\n\n“What are commits? … When a developer does a commit in software development, it is the change made to code repository by a developer typically tracked to a version control system like GitHub or Git, and [the number of commits] helps analyze work volume, team performance, identify trends, it also helps understand where the project is going, how much resource allocation there is to the project in development, and it is an essential metric for tracking progress and quality of a chain and of course any software development.”\n\nSOL is trading at $20.79 at time of writing. The 11th-ranked crypto asset by market cap is down more than 2% in the past 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Rattanamanee Patpong/WhiteBarbie"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3MvZXRoZXJldW0tcHJvamVjdHMtbGF1bmNoLW1ldi1ibG9ja2VyLXRvLW1pbmltaXplLWludmlzaWJsZS10YXjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Projects Launch MEV Blocker to Minimize Invisible Tax - Blockchain.News",
        "content": "27 Ethereum projects have launched MEV Blocker, a solution to reduce maximally extractable value (MEV), or Ethereum's invisible tax. MEV Blocker is a free tool developed to counter MEV bots that hijack transactions and inflate prices for users. It sends at least 90% of profits back to users and can protect them from frontrunning and sandwiching when using any Ethereum DApp.\n\nOver 27 prominent Ethereum projects have come together to launch MEV Blocker, a solution that aims to tackle and minimize the amount of value extracted from their users. MEV, or maximally extractable value, is a tax imposed on decentralized finance (DeFi) users on transactions. MEV bots can hijack transactions midway, such as Ether (ETH) trades, nonfungible token (NFT) purchases, and ENS registrations, and inflate prices for the users.\n\nMEV Blocker was jointly developed by CoW Swap, Agnostic Relay, and Beaver Build as a free and censorship-resistant tool to counter this \"$1.3 billion dollar problem\" persistent across the Ethereum ecosystem. In total, 27 Ethereum projects joined the initiative as launch partners, including Balancer, Gnosis DAO, Shapeshift, and StakeDAO, to name a few.\n\nExplaining the intention behind launching MEV Blocker, Martin Köppelmann, CEO of Gnosis stated: \"With the launch of MEV Blocker, users can profit from the backrunning opportunities they create. Today all of that money is taken by the searcher, but why shouldn't it be split with the people who create the value?\"\n\nMEV Blocker can be added as a custom RPC endpoint to a crypto wallet, which, in turn, can protect users from frontrunning and sandwiching when using any Ethereum DApp. According to the official announcement, MEV Blocker sends at least 90% of the profits from winning bids back to users and 10% to validators as a reward — thus giving \"power back to Ethereum users.\"\n\nThis initiative comes at a time when entrepreneurs are attempting to reduce the taxation on users. Despite this, the excitement around the upcoming Shanghai and Capella upgrades resulted in a bull sprint for ETH. On April 5, Ether breached $1,900 for the first time in over seven months.\n\nWhile MEV Blocker is a step towards mitigating the impact of MEV on DeFi users, it is important to note that the price of ETH dropped sharply following the execution of the Merge on Sept. 15, 2022. This highlights the complexity of the Ethereum ecosystem and the need for ongoing solutions to address the challenges it faces.\n\nIn conclusion, the launch of MEV Blocker by 27 Ethereum projects is a welcome development for DeFi users. It has the potential to significantly reduce the impact of MEV and give power back to Ethereum users. However, it is important to continue developing solutions that address the complexities of the Ethereum ecosystem and ensure its continued growth and success."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9ldGhlcmV1bS1idWlsZGVycy1qb2luLWZvcmNlcy10by1sYXVuY2gtbWV2LWJsb2NrZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Builders Join Forces to Launch MEV Blocker - Unchained - Unchained",
        "content": "A joint initiative from several Ethereum protocols will protect everyday blockchain users from being front-run by MEV bots.\n\nMore than 30 Ethereum projects have come together to launch a tool that blocks Maximal Extractable Value (MEV) bots from front-running transactions.\n\nCoW Swap, Agnostic Relay and Beaver Build have jointly developed MEV Blocker – a solution for everyday Ethereum users to protect themselves from MEV bots.\n\nCoW Swap, in collaboration with @beaverbuild and Agnostic Relayer, is proud to announce MEV Blocker. https://t.co/WIhaaGtP0e ⛱️ MEV Blocker is a free RPC endpoint that *pays users* to protect themselves from MEV across a wide variety of use cases in DeFi, NFTs, and dApps. pic.twitter.com/Fa6cRNjrxf — CoW Swap | Better than the best prices (@CoWSwap) April 5, 2023\n\nJoining the initiative are several popular protocols building on Ethereum, including GnosisDAO, Balancer, ShapeShift and ParaSwap.\n\nThe MEV Blocker routes all transactions through a network of searchers, structured to block front running and sandwich attacks. The free service will send 90% of the profits that searchers bid to back run transactions on MEV Blocker to users, while 10% of profits will go to validators.\n\nAccording to MEV Blocker’s estimates, MEV bots have extracted more than $1.38 billion from users, whether they are traders, liquidity providers or minting NFTs on the blockchain.\n\nWith the customer Remote Call Procedure (RPC) endpoint added to crypto wallets, users will be shielded from MEV bots that extract value from their transactions.\n\nAccording to Martin Köppelmann, CEO of Gnosis, the only downside of using this RPC would be transactions potentially taking 10% more time than they normally would.\n\nnot really. Worst case you don't get the protection but then you simply end up in the same situation as with a regular RPC endpoint.\n\nOnly downside is that transaction inclusion will take ~10% more time. — Martin Köppelmann 🇺🇦 (@koeppelmann) April 5, 2023\n\n“MEV blocker protects from most kinds of front-running, but especially from trade sandwiching, which is when a searcher trades just before and just after your transaction to make a profit,” said the team.\n\nEarlier this week, a validator made headlines after successfully front-running MEV sandwich bots, earning $25 million worth of crypto in the process."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMDUvZXRoZXJldW1zLXNoYW5naGFpLXVwZ3JhZGUtY291bGQtYnJpbmctMjRiLW9mLXNlbGxpbmctcHJlc3N1cmUtdG8tZXRoZXItbWFya2V0L9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMDUvZXRoZXJldW1zLXNoYW5naGFpLXVwZ3JhZGUtY291bGQtYnJpbmctMjRiLW9mLXNlbGxpbmctcHJlc3N1cmUtdG8tZXRoZXItbWFya2V0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Upgrade Could Bring $2.4B Selling Pressure to Ether: Observers - CoinDesk",
        "content": "The chart by K33 shows 46.3% of ether staked is in profit as ether's going market rate is higher than the rate prevalent when these coins were locked in the network. Meanwhile, 28.04% of ether staked is sitting on a profit of more than 20%."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLWtleS1ldGhlcmV1bS1wcmljZS1tZXRyaWNzLWNhc3QtZG91YnQtb24tdGhlLXN0cmVuZ3RoLW9mLWV0aC1zLXJlY2VudC1yYWxsedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "3 key Ethereum price metrics cast doubt on the strength of ETH's recent rally - Cointelegraph",
        "content": "Ether’s (ETH) price had been battling the $1,850 resistance level, but it broke through on April 4 when Ether rallied to a seven-month high above $1,900. Recently there has been a lot of speculation on Ether price catalysts. Let’s see if it’s possible to identify any fundamental factors behind the price movement.\n\nThe upcoming Shanghai hard fork could be one factor in Ether’s recent bullish momentum. On April 12, the ability for validators to withdraw their deposits opens, giving staking participants freedom of movement but also creating a sell-off risk for Ether.\n\nThere are now 17.81 million ETH staked on the Beacon Chain, though some safeguards have been put in place to prevent a flood of Ether from disrupting the market. For example, because there is a daily limit of 2,200 withdrawals, the maximum daily unlocks are 70,000 ETH.\n\nScalability and selfish validator risks are still present\n\nThe upcoming Shanghai fork, however, does not address some of the most pressing issues currently plaguing the Ethereum network. Scalability continues to be a major issue for most users, as the average transaction fee has hovered around $5 in recent weeks, driving users away from decentralized applications (DApps).\n\nFurthermore, the current consensus mechanism favors rogue miners who outperform other network participants, a phenomenon known as miner extractable value (MEV). They can quickly duplicate all winning deals from the mempool and execute their transactions ahead of others by ultimately deciding which transactions are completed in the block.\n\nA recent example, highlighted on April 3 by security firm CertiK, resulted in $25 million in losses to arbitrage bots that were attempting to purchase and flip tokens in a short period of time for a profit as a selfish validator replaced the transactions.\n\nOver the last 30 days, the top 10 DApps running on the Ethereum network saw an 18% drop in active addresses, possibly reflecting investor dissatisfaction with the ongoing issues with miners front-running and high transaction costs.\n\n30-day Dapp activity. Source: DappRadar\n\nLet’s look at Ether derivatives data to understand if the $1,850 level can effectively become a support according to ETH investors’ sentiment.\n\nETH derivatives show no improvement despite the price rally\n\nThe annualized three-month futures premium should trade between 5% and 10% in healthy markets to cover costs and associated risks. However, when the contract trades at a discount (backwardation) versus traditional spot markets, it shows a lack of confidence from traders and is deemed a bearish indicator.\n\nEther 3-month futures annualized premium. Source: Laevitas.ch\n\nDespite ETH’s 35% rally in 25 days, the Ether futures premium has been unable to break above the 5% neutral threshold. However, the absence of leverage longs demand does not always imply an expectation of negative price action. As a result, traders should examine Ether’s options markets to understand how whales and market makers price the likelihood of future price movements.\n\nThe 25% delta skew is a telling sign when market makers and arbitrage desks are overcharging for upside or downside protection. For instance, in bear markets, options investors give higher odds for a price dump, causing the skew indicator to rise above 8%. On the other hand, bullish markets tend to drive the skew metric below -8%, meaning bearish put options are in less demand.\n\nRelated: Ethereum projects unite to protect users from MEV-induced high prices\n\nEther 60-day options 25% delta skew: Source: Laevitas.ch\n\nSince April 1, the delta skew has been close to zero, indicating a similar demand for protective put options and neutral-to-bearish call instruments. Since March 22, when Ether options last showed extreme optimism, this has been the norm.\n\nEven after adjusting for the additional negative pressure from the Shanghai hard fork token unlock, Ether faces serious problems due to scalability and transaction front-runs. As a result, derivatives and on-chain DApp metrics increase the likelihood of ETH falling below $1,850.\n\nMagazine: ‘Account abstraction’ supercharges Ethereum wallets: Dummies guide\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvZXRoZXJldW1zLWVyYy00MzM3LXN0YW5kYXJkLWEtZ2FtZS1jaGFuZ2luZy11c2VyLWZyaWVuZGx5LWlubm92YXRpb27SAWdodHRwczovL2RlY3J5cHQuY28vcmVzb3VyY2VzL2V0aGVyZXVtcy1lcmMtNDMzNy1zdGFuZGFyZC1hLWdhbWUtY2hhbmdpbmctdXNlci1mcmllbmRseS1pbm5vdmF0aW9uP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum’s ERC-4337 Standard: A Game-Changing, User-Friendly Innovation - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum is one of the most popular and widely-used blockchain protocols. While its native coin ether (ETH) can be used to make payments like cryptocurrencies such as litecoin (LTC) or bitcoin cash (BCH), Ethereum was designed to be a far more flexible and feature-rich blockchain protocol. Ethereum allows for the execution of smart contracts and decentralized applications (dApps). It also allows for tokens to be built on top of its core protocol.\n\nOne of the most innovative ERC standards to date is the ERC-4337 standard. Like earlier token standard releases, it was designed to enable additional features and options that weren’t possible using the previously available token options.\n\n\n\nEthereum’s tokens are one reason it has garnered such a sizeable share of the crypto market. These Ethereum Request for Comment (ERC) tokens create concrete rules and frameworks that allow ERC tokens to be sent and received on the Ethereum blockchain. One of the most popular token standards is ERC-20, which allows you to issue new fungible tokens on the Ethereum protocol. Another popular option is the ERC-721 token standard, which allows for the issuance of non-fungible tokens (NFTs). This is one reason why many of the most popular NFT collections and fungible tokens are found on Ethereum.\n\nThere are a number of ERC token standards (ERC-777, ERC-2222, and more) on Ethereum, with new suggestions called Ethereum Improvement Proposals (EIPs) continually being proposed and discussed. Some EIPs are ultimately rejected, while others end up being released on Ethereum. Once an EIP is improved and implemented, it becomes an ERC (ERC-4337 was previously EIP-4337).\n\nAD\n\nAD\n\nFunded through Ethereum Foundation grants, the launch of ERC-4337 was announced at WalletCon 2023. Let’s discover what ERC-4337 enables on the Ethereum protocol — and why the community decided it needed to be approved.\n\nERC-4337 Brings New Features to Ethereum\n\nERC-4337 makes enhanced crypto transaction options possible. To differentiate it from standard crypto transactions, these ERC-4337 transactions are referred to as UserOperations. This sort of blockchain enhancement would typically be done through a blockchain update and not through a new ERC standard release (more on that later).\n\n\n\nA core new feature is that it allows for account abstraction on Ethereum in a decentralized manner (more on that below). Additionally, it allows for dApp developers to partially or fully subsidize transaction fees for users; on many dApps the user must pay these fees. ERC-4337 also allows users to pay fees with ERC-20 tokens (as opposed to ETH). This should create a decentralized fee market for smart contract operations. On top of that, it enables some privacy-preserving features and supports the use of aggregated signatures. ERC-4337 is also available on networks compatible with the Ethereum Virtual Machine (EVM) such as Polygon, Avalanche, Arbitrum, and several others.\n\nFor sending transactions, ERC-4337 enables you to bundle (combine) multiple transactions to save time and lower transaction fee costs. You will also be able to pre-approve transactions in an automated way. Most current wallets require you to manually approve every transaction. Now, you can create review processes that require additional manual approval only for certain transactions — such as transactions that send over a specified amount of crypto (more than $1,000 USD equivalent, for example).\n\nERC-4337’s User-Friendly Wallet Features\n\nThrough a process known as account abstraction, ERC-4337 allows for the use of smart accounts that are expected to be more user friendly for beginners. This update is expected to catalyze crypto adoption as technical barriers to entry are continually being lowered — or removed. While somewhat technical, in essence, account abstraction turns a user’s crypto wallet into a smart contract-enabled account. For this reason, many don’t call ERC-4337 a “token standard” and simply call it an ERC standard; it doesn't really fit categorically with the previous ERC token standards.\n\nOne core benefit is how account abstraction simplifies both the use and creation of wallets. Prior to ERC-4337, users generally had to memorize a seed phrase (or store this phrase offline) to create a backup of their crypto wallet. Through abstraction, a crypto wallet’s private keys can be stored on a smartphone’s standard security module. This would create what some would consider a hardware wallet within their phone — although some express concerns about a smartphone’s vulnerabilities through the touchscreen or some other avenue.\n\nAD\n\nAD\n\nERC-4337 allows for the use of smart accounts that are expected to be more user friendly for beginners.\n\nERC-4337 allows you to sign transactions biometrically through a fingerprint or face scan as an additional safety measure. Should you lose your phone, you could regain access to your account through the use of time-locked social recovery. This requires multiple users to sign a recovery transaction through a multi-signature (multi-sig) wallet. You could give a group of trusted friends or family the ability to regenerate your account. If that doesn’t suit you, you could pay a commercial third-party service to recover your account should the need arise.\n\nLosing their wallet and the associated crypto — and being unable to recover it — is one fear people have when it comes to using non-custodial crypto wallets. There are horror stories of people losing large sums of crypto in this way. This safeguard is designed to give you some of the features and peace of mind you may have when using a bank — without having to trust a bank — thus preserving the core crypto ethos of trustlessness and permissionlessness.\n\n\n\nIn general, the implementation of account abstraction is intended to provide two benefits for wallets:\n\nMake crypto wallets more user friendly. Prevent the loss of crypto or crypto wallet access.\n\nWhy Not Update the Underlying Ethereum Protocol?\n\nFor many blockchain protocols, changes require a code update to the blockchain that is called a fork. Oftentimes, there is heated debate about whether to implement changes to a blockchain. These updates sometimes lead to a blockchain splitting into two separate networks. Called a hard fork, this has led to the 2017 Bitcoin fork that created Bitcoin Cash and even a previous splitting of Ethereum (which created Ethereum Classic). The other fork option is a soft fork. Soft forks are backwards compatible — giving users and validators the option to implement an update or not.\n\nWith the time and work that has gone into transitioning Ethereum from a Proof-of-Work (PoW) to a Proof-of-Stake (PoS) network (known as The Merge), the proposal for ERC-4337 noted that it may be some time before Ethereum goes through another significant update. For that reason, ERC-4337 was implemented as a way to enable updates that don’t change the core Ethereum protocol. Taking this innovative approach has ostensibly saved a lot of time and effort. In addition, ERC-4337 will not create compatibility issues in the way some blockchain forks have.\n\nBy taking these changes to a higher-abstraction layer (the ERC-4337 standard itself), it negates the need to implement changes to the core Ethereum protocol (the Ethereum blockchain). While this has sped up the implementation of account abstraction on Ethereum, the goal is to eventually implement this feature into the primary Ethereum protocol.\n\nWhat ERC-4337 Means for Ethereum Adoption\n\nWith its notable medley of ERC-20 tokens, the popularity of ERC-721 NFTs, and the outsized presence of Ethereum within decentralized finance (DeFi), ERC-4337 will likely help Ethereum remain one of the premier blockchains as the enhanced functionality will benefit all of these disparate — but connected — niches within the wider Ethereum ecosystem.\n\nWith crypto wallet security and user friendliness at the forefront of the ERC-4337 update, we may end up seeing newcomers to the crypto space choose to start with Ethereum (and EVM-compatible blockchains) as opposed to other blockchain ecosystems. Enticed by the core benefits and ease of use enabled by ERC-4337, this may allow Ethereum to keep — or grow — the already sizable market share that it occupies within the wider crypto market. For other blockchains to remain competitive and gain market share, they may need to incorporate their own versions of higher-level account abstraction. This will let them appeal to new crypto users that want to experience Web3 with the ease of use and simplicity more commonly found in the Web2 experience.\n\nAD\n\nAD\n\nCheat Sheet:\n\nERC-4337 allows you to bundle and automate transactions on Ethereum.\n\nERC-4337 allows for social recovery of crypto wallets, biometric authentication of transactions, and the ability to store a wallet’s private keys on a smartphone security module.\n\nThe features made possible by the ERC-4337 standard are also available on EVM-compatible blockchains.\n\nThe ERC-4337 standard adds new features to Ethereum without the need for a major Ethereum blockchain protocol update.\n\nThe goal is to eventually provide the features made possible through ERC-4337 through a major Ethereum protocol update."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1sc2QtdG9rZW5zLXJpc2UtYWhlYWQtMDk0OTUzODE4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum, LSD Tokens on the Rise Ahead of Next Week's Shanghai Upgrade - Yahoo Finance",
        "content": "The price of Ethereum jumped 4.7% overnight, per CoinGecko data, as the second-largest cryptocurrency approaches its much-anticipated Shapella upgrade on April 12.\n\nShapella is the joined term for two key improvements coming to the Ethereum network: Shanghai and Capella. These refer to unlocking withdrawals for staked Ethereum on the network at the execution layer and on the consensus layer, respectively.\n\nNotably, Ethereum’s price action has also outpaced Bitcoin's increase of 1.3% during the same period.\n\nNext week’s upgrade will enable ETH withdrawals from the staking contract, lowering the risk of holding staked Ethereum (stETH), also known as liquid staking derivatives (LSDs) via platforms like Lido Finance.\n\nAs such, governance tokens linked to various liquid staking platforms have also enjoyed a hefty rise in price. These platforms emerged to let Ethereum holders stake their ETH and earn a liquid staking token in return. This token could then be reused throughout the world of DeFi to earn additional yield.\n\nThe governance tokens of top liquid staking platforms in Lido DAO (LDO), Rocket Pool (RPL), and Frax Shares (FXS) enjoyed double-digit percentage gains in the last 24 hours.\n\nOverall, these LSD tokens have yielded higher percentage gains, at least twice that of ETH in 2023. The top LSD tokens have recorded up to 150% compared to Ethereum's near 65% gains year-to-date.\n\nETH (blue), FXS (yellow), LDO (orange), RPL (blue) price comparison. Source: TradingView.\n\nCurrently, decentralized liquid staking platforms account for 33.3% of the total staked ETH. Lido DAO is a clear leader within this space, with a 93.79% share.\n\nShapella is the most important Ethereum upgrade since the network’s merge event last September when the protocol moved from a proof-of-work (PoW) consensus mechanism to a proof-of-stake (PoS) mechanism.\n\nThe views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMDUvY29pbmRlc2tzLWV0aGVyZXVtLXZhbGlkYXRvci1lbnRlcnMtZmluYWwtd2Vla3Mtc2l0dGluZy1vbi1tb3JlLXRoYW4tMzBrLW9mLWdhaW5zL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMDUvY29pbmRlc2tzLWV0aGVyZXVtLXZhbGlkYXRvci1lbnRlcnMtZmluYWwtd2Vla3Mtc2l0dGluZy1vbi1tb3JlLXRoYW4tMzBrLW9mLWdhaW5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "CoinDesk’s Ethereum Validator Enters Final Weeks, Sitting on More Than $30K of Gains - CoinDesk",
        "content": "On April 12, Ethereum will undergo a key upgrade known as the “Shanghai hard fork” (referred to as “Shapella” by some insiders), and validators will now, for the first time, be able to withdraw the tokens in a process known as “unstaking.” It’s the biggest milestone for Ethereum since last September’s “Merge,” when the original proof-of-work blockchain was merged with the Beacon Chain to complete the transition to proof-of-stake. (Watch parties are already being planned for the big night. Geek out with the gang!)"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aGF0LXdpbGwtYmUtdGhlLW91dGNvbWUtb2YtdGhlLWV0aGVyZXVtLXNoYW5naGFpLXVwZ3JhZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "What will be the outcome of the Ethereum Shanghai upgrade? - Cointelegraph",
        "content": "In this week’s episode of Market Talks, Cointelegraph welcomes Justin Bram, co-founder and CEO of Astaria — which allows users to put up their nonfungible tokens (NFTs) as collateral to earn instant liquidity. Bram also has his own YouTube channel with over 30,000 subscribers.\n\nWe kick things off by getting Bram’s opinion on the most exciting thing happening in decentralized finance (DeFi) right now and follow it up by discussing the most important thing happening in DeFi.\n\nWe then get into Ethereum layer-2 protocols like Arbitrum and whether Bram is bullish on them or whether he has his eye set on something else.\n\nWith the next big Ethereum upgrade just around the corner, we ask Bram what his perspective is on the Shanghai upgrade and the potential of liquid staking derivatives. Is ut going to be as big as everyone hopes and thinks it will be? Does the unlocking of Ether (ETH) represent the offering of some new innovation in the crypto and DeFi space?\n\nBy the end of the chat with Bram, we hope the audience will have gotten a better understanding of the most exciting and important developments in DeFi, the potential outcomes of the Ethereum Shanghai unlocks, and the longer-term impact of this on the liquid staking derivatives space, and also the development within the Ethereum layer-2 platform.\n\nWe cover all this and more, so make sure to stay tuned until the end. Market Talks airs every Thursday. Each week, it features interviews with some of the most influential and inspiring people from the crypto and blockchain industry. So, head on over to Cointelegraph Markets and Research’s YouTube page, and smash those like and subscribe buttons for all our future videos and updates."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8xMjU0ODUvZXRoZXJldW0tbHNkLXRva2Vucy1yaXNlLWFoZWFkLW5leHQtd2Vla3Mtc2hhcGVsbGEtdXBncmFkZdIBWmh0dHBzOi8vZGVjcnlwdC5jby8xMjU0ODUvZXRoZXJldW0tbHNkLXRva2Vucy1yaXNlLWFoZWFkLW5leHQtd2Vla3Mtc2hhcGVsbGEtdXBncmFkZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum, LSD Tokens on the Rise Ahead of Next Week's Shanghai Upgrade - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe price of Ethereum jumped 4.7% overnight, per CoinGecko data, as the second-largest cryptocurrency approaches its much-anticipated Shapella upgrade on April 12.\n\nShapella is the joined term for two key improvements coming to the Ethereum network: Shanghai and Capella. These refer to unlocking withdrawals for staked Ethereum on the network at the execution layer and on the consensus layer, respectively.\n\nNotably, Ethereum’s price action has also outpaced Bitcoin's increase of 1.3% during the same period.\n\nAD\n\nAD\n\nNext week’s upgrade will enable ETH withdrawals from the staking contract, lowering the risk of holding staked Ethereum (stETH), also known as liquid staking derivatives (LSDs) via platforms like Lido Finance.\n\nAs such, governance tokens linked to various liquid staking platforms have also enjoyed a hefty rise in price. These platforms emerged to let Ethereum holders stake their ETH and earn a liquid staking token in return. This token could then be reused throughout the world of DeFi to earn additional yield.\n\nThe governance tokens of top liquid staking platforms in Lido DAO (LDO), Rocket Pool (RPL), and Frax Shares (FXS) enjoyed double-digit percentage gains in the last 24 hours.\n\nOverall, these LSD tokens have yielded higher percentage gains, at least twice that of ETH in 2023. The top LSD tokens have recorded up to 150% compared to Ethereum's near 65% gains year-to-date.\n\nETH (blue), FXS (yellow), LDO (orange), RPL (blue) price comparison. Source: TradingView.\n\nCurrently, decentralized liquid staking platforms account for 33.3% of the total staked ETH. Lido DAO is a clear leader within this space, with a 93.79% share.\n\nAD\n\nAD\n\nShapella is the most important Ethereum upgrade since the network’s merge event last September when the protocol moved from a proof-of-work (PoW) consensus mechanism to a proof-of-stake (PoS) mechanism.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zd2lzcy1iYW5rLXBvc3RmaW5hbmNlLXJvbGwtYml0Y29pbi0xMDM0NDQ0OTIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Swiss Bank PostFinance to Roll Out Bitcoin, Ethereum Services for Clients - Yahoo Finance",
        "content": "PostFinance, the financial services firm fully owned by the Swiss government, will offer its customers a range of regulated crypto services delivered through Sygnum's B2B banking platform.\n\nThanks to the partnership with digital assets bank Sygnum, its customers will now be able to buy, store, and sell cryptocurrencies such as Bitcoin (BTC) and Ethereum (ETH), according to an announcement. PostFinance is Switzerland’s fifth-largest financial services firm boasting more than 2.5 million customers.\n\n\"This partnership illustrates how digital assets are now an integral part of the financial landscape in Switzerland. In this sense, the PostFinance and Sygnum partnership represents an important, and fully regulated step, towards increased asset class adoption,\" Sygnum's chief B2B officer Fritz Jost told Decrypt. \"Switzerland as an investment ecosystem offers a number of strategic advantages, including regulatory clarity for cryptocurrencies and off-balance sheet segregation of crypto assets which eliminates credit risks.\"\n\nA PostFinance spokesperson told Decrypt that its \"analyses show that our customers want access to the crypto market. The past few months have shown that customers want more security, regulation, and trust. We can offer this. Our top priority is to offer trading and safekeeping within a secure framework for our customers and to ensure the highest level of regulatory compliance.\"\n\n📰📣 NEWS: @PostFinance partners with Sygnum, the world’s first digital asset bank, to offer its customers regulated digital asset banking services via Sygnum's B2B banking platform. Read the announcement here 👇 https://t.co/zuWRP3lXIS — Sygnum Bank (@sygnumofficial) April 5, 2023\n\nSygnum's B2B banking solution lets existing financial institutions crypto products and services, with PostFinance joining more than a dozen of the platform’s other banking partners.\n\nStory continues\n\n“Digital assets have become an integral part of the financial world, and our customers want access to this market at PostFinance, their trusted principal bank,” PostFinance's CIO Chief Investment Philipp Merkt said in a statement. “A reputable and established partner like Sygnum Bank with an excellent service offering is more important than ever.”\n\nHow Switzerland's Role in Global Finance Is Evolving With The Crypto Era\n\nPostFinance did not respond immediately to Decrypt's request for comment.\n\nInstitutional-grade staking services\n\nThe new partnership also enables PostFinance to provide revenue-generating services such as crypto staking—a process of locking crypto assets for a set period of time to help secure a blockchain network in exchange for rewards on users’ holdings.\n\nSygnum’s staking offerings include Ethereum, the industry’s second-largest cryptocurrency by market capitalization, Cardano (ADA), Internet Computer (ICP), and Tezos (XTZ).\n\n\"Our continually expanding B2B offering, which currently includes 25 leading cryptocurrencies including DeFi-focused, 60+ trading pairs, and four leading fiat currencies, is available for deployment by PostFinance on a flexible basis. Additional details about the token and staking offering roadmap will be communicated by PostFinance in the lead-up to launch,\" Jost told Decrypt.\n\nSygnum Adds Banking Services for DeFi Tokens Including Aave and Uniswap\n\nIn June 2021, Sygnum also launched institutional-grade custody and trading services for the USDC stablecoin, as well as for a portfolio of decentralized finance (DeFi) tokens, such as Aave (AAVE), Aragon (ANT), Curve (CRV), Maker (MKR), Synthetix (SNX), Uniswap (UNI), and 1inch (1INCH)."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8wNi90b3AtdHJhZGVyLXByZWRpY3RzLW1hc3NpdmUtbW92ZS1mb3Itb25lLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tc2F5cy1vbmUtYWktdG9rZW5zLWNoYXJ0LWlzLWNyYXp5LWJ1bGxpc2gv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Top Trader Predicts Massive Move for One Ethereum-Based Altcoin, Says One AI Token’s Chart Is ‘Crazy’ Bullish - The Daily Hodl",
        "content": "A widely followed analyst is predicting big moves to the upside for one Ethereum (ETH)-based altcoin and one artificial intelligence (AI) token.\n\nPseudonymous analyst Bluntz tells his 222,100 Twitter followers that blockchain indexing protocol The Graph (GRT) could soar by about 30% from its current value of $0.14.\n\nThe trader says GRT is setting the stage for a rally to $0.19 as it breaks to the upside out of a descending triangle.\n\n“Besides ETH I think GRT is probs one of my biggest bags, this chart is gagging for a monster move upwards in my opinion and I’m positioned for it.”\n\nNext, the crypto strategist says the AI-focused project Fetch.ai (FET) is likely to surge by more than 50% from its current value of $0.36.\n\nHe says that after FET has broken out of three downward triangle resistance levels it is poised to soar to $0.55.\n\n“Another I like is FET, literally so many crazy bullish charts out there, feels like we’re almost at the stage where we can start punting longs blindfolded I think.”\n\nLastly, the crypto trader weighs in on this month’s planned Shanghai upgrade for the Ethereum ecosystem, which will allow investors to sell their staked ETH. He says the upgrade could trigger a run to the upside similar to a run by Bitcoin (BTC) in 2019, noting a similarity in their price action patterns.\n\n“The ole ETH Shanghai upgrade is the perfect psyops to [fear, uncertainty, and doubt] people out of generational longs, it’s the perfect wall of worry scenario.\n\nWhen ETH inevitably breaks out from $2,000 you’ll want to be positioned accordingly because unfortunately, I doubt there will be retests.\n\nIt’ll most likely be a straight up GOD candle candle like BTC in 2019.”\n\nEthereum is trading for $1,912 at time of writing, up 2.5% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby8xMjU0OTIvc3dpc3MtYmFuay1wb3N0ZmluYW5jZS1yb2xsLW91dC1iaXRjb2luLWV0aGVyZXVtLXNlcnZpY2VzLWNsaWVudHPSAWFodHRwczovL2RlY3J5cHQuY28vMTI1NDkyL3N3aXNzLWJhbmstcG9zdGZpbmFuY2Utcm9sbC1vdXQtYml0Y29pbi1ldGhlcmV1bS1zZXJ2aWNlcy1jbGllbnRzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Swiss Bank PostFinance to Roll Out Bitcoin, Ethereum Services for Clients - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nPostFinance, the financial services firm fully owned by the Swiss government, will offer its customers a range of regulated crypto services delivered through Sygnum's B2B banking platform.\n\nThanks to the partnership with digital assets bank Sygnum, its customers will now be able to buy, store, and sell cryptocurrencies such as Bitcoin (BTC) and Ethereum (ETH), according to an announcement. PostFinance is Switzerland’s fifth-largest financial services firm boasting more than 2.5 million customers.\n\n\"This partnership illustrates how digital assets are now an integral part of the financial landscape in Switzerland. In this sense, the PostFinance and Sygnum partnership represents an important, and fully regulated step, towards increased asset class adoption,\" Sygnum's chief B2B officer Fritz Jost told Decrypt. \"Switzerland as an investment ecosystem offers a number of strategic advantages, including regulatory clarity for cryptocurrencies and off-balance sheet segregation of crypto assets which eliminates credit risks.\"\n\nAD\n\nAD\n\nA PostFinance spokesperson told Decrypt that its \"analyses show that our customers want access to the crypto market. The past few months have shown that customers want more security, regulation, and trust. We can offer this. Our top priority is to offer trading and safekeeping within a secure framework for our customers and to ensure the highest level of regulatory compliance.\"\n\n📰📣 NEWS: @PostFinance partners with Sygnum, the world’s first digital asset bank, to offer its customers regulated digital asset banking services via Sygnum's B2B banking platform. Read the announcement here 👇 https://t.co/zuWRP3lXIS — Sygnum Bank (@sygnumofficial) April 5, 2023\n\nSygnum's B2B banking solution lets existing financial institutions crypto products and services, with PostFinance joining more than a dozen of the platform’s other banking partners.\n\n“Digital assets have become an integral part of the financial world, and our customers want access to this market at PostFinance, their trusted principal bank,” PostFinance's CIO Chief Investment Philipp Merkt said in a statement. “A reputable and established partner like Sygnum Bank with an excellent service offering is more important than ever.”\n\nPostFinance did not respond immediately to Decrypt's request for comment.\n\nAD\n\nAD\n\nInstitutional-grade staking services\n\nThe new partnership also enables PostFinance to provide revenue-generating services such as crypto staking—a process of locking crypto assets for a set period of time to help secure a blockchain network in exchange for rewards on users’ holdings.\n\nSygnum’s staking offerings include Ethereum, the industry’s second-largest cryptocurrency by market capitalization, Cardano (ADA), Internet Computer (ICP), and Tezos (XTZ).\n\n\"Our continually expanding B2B offering, which currently includes 25 leading cryptocurrencies including DeFi-focused, 60+ trading pairs, and four leading fiat currencies, is available for deployment by PostFinance on a flexible basis. Additional details about the token and staking offering roadmap will be communicated by PostFinance in the lead-up to launch,\" Jost told Decrypt.\n\nIn June 2021, Sygnum also launched institutional-grade custody and trading services for the USDC stablecoin, as well as for a portfolio of decentralized finance (DeFi) tokens, such as Aave (AAVE), Aragon (ANT), Curve (CRV), Maker (MKR), Synthetix (SNX), Uniswap (UNI), and 1inch (1INCH)."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vdGhlZGVmaWFudC5pby9tZXYtYmxvY2tlci1ycGMtbGV0cy11c2Vycy1wcm9maXQtbWV20gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 20:34:31 GMT",
        "title": "Top Ethereum Teams Join Forces To Return MEV Profits To Users - The Defiant - DeFi News",
        "content": "Free MEV Blocker RPC “Pays Users To Protect Themselves”\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nMore than 30 teams representing the Ethereum ecosystem have joined forces to combat Maximal Extractable Value, on-chain arbitrage techniques that quietly siphon hundreds of millions of dollars from users’ trades.\n\nOn Wednesday, the consortium launched MEV Blocker, software designed to redistribute 90% of the profits from MEV capture back to ordinary Ethereum users.\n\n“When DeFi users make trades…, their transactions are at risk of being hijacked by MEV bots – resulting in significantly worse prices for the users,” MEV Blocker said.\n\nMEV Blocker submits transactions to a private network of searchers – network participants that monitor Ethereum’s mempool for profitable MEV opportunities and run bots to execute them – who compete for MEV on the condition that they share profits with Ethereum users.\n\n“MEV Blocker is a free RPC endpoint that *pays users* to protect themselves from MEV across a wide variety of use cases in DeFi, NFTs, and dApps,” tweeted CoW Swap.\n\nThe software redistributes 90% of the profits generated back to users, with searchers claiming the remaining 10%. It was developed by CoW Swap in partnership with Agnostic Relay and Beaver Build. Other launch partners include Balancer, Gnosis, 1inch, and Shapeshift.\n\nThe Dark Forest of MEV\n\nMEV bot operators, or “searchers,” use arbitrage techniques such as transaction front-running, reordering, or sandwiching to extract profits when users submit transactions to Ethereum’s public mempool.\n\nThe strategy is particularly lucrative when targeting DEX trades but results in on-chain traders paying the worst possible price for transactions.\n\nFlashbots, an MEV research team, estimates ordinary Ethereum users lost more than $617M to MEV since the start of 2021, with searchers raking in $5.1M over just the past month.\n\nEthereum Validator Slashed For Attacking MEV Bot\n\nThe launch comes just days after an Ethereum validator stole $25M in a malicious attack targeting an MEV searcher.\n\nThe validator funded their node using Aztec’s confidential transfer feature roughly three weeks earlier. OtterSec, a blockchain security firm, concluded the validator’s decision to hide the origin of their funds suggests they planned the attack prior to launching a node.\n\n“Now, MEV extractors will have to wonder, ‘is this validator malicious?’” tweeted Hudson Jameson, an Ethereum developer who previously worked for Flashbots. “There was an assumption, up to this point, that validators would not interfere with bundles.”\n\nThe Ethereum network slashed the malicious validator for proposing conflicting blocks the next day. However, Mudit Gupta, CISO at Polygon, slammed the initial slashing penalty imposed on the validator as being too lenient.\n\n“The initial slashing penalty is 1 ETH,” Gupta tweeted. “25,000,000 profit for 1,800 penalty? Sure, I’ll take that trade. The economic incentives are broken here…”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vY3J5cHRvLm5ld3MvYnV0ZXJpbi1hbmQteWFrb3ZlbmtvLWZhY2Utb2ZmLW9uLXNlY3VyaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Ethereum's Buterin and Solana's Yakovenko are at odds on security - crypto.news",
        "content": "After what seemed like an eternity, Anatoly Yakovenko, co-founder of Solana Labs, and Vitalik Buterin, co-founder of ethereum, have picked up where they left off in discussing bridge security.\n\nYakovenko Bridge claims to have pondered the issue for a year until he may have stumbled onto the answer.\n\nhttps://twitter.com/aeyakovenko/status/1643838814564286465\n\nYou might also like: Understanding the Interoperability Principles of Blockchain Technology\n\nA social layer of the bridge could be the solution\n\nIn late May 2022, blockchain activists were in a dialogue on potentially detecting and preventing efforts to cheat a system that enables funds to move between multiple networks by illegally utilizing the same money multiple times. This system allows funds to move between networks to facilitate transactions.\n\nThe conversation between Yakovenko and Buterin came to a standstill at that time. Nonetheless, all parties concluded that, in principle, a social layer of bridge management could address any difficulties.\n\nOn the other hand, both individuals admitted that they did not know how safe such a system would be, particularly when subjected to a 51% assault.\n\nYakovenko proposed a trust-minimized bridge between independent layer 1 blockchains to solve this problem. The design of this bridge ensures that local users can pull their bridged assets back into the local chain, even if the small chain has an unfair majority, withholds data, or conducts a 51% attack. The community well received Yakovenko’s solution.\n\nBecause what if 51% attack — vitalik.eth (@VitalikButerin) May 31, 2022\n\nYou may get a comprehensive explanation of Yakovenko’s bridge in a tweet that the co-founder of Solana posted. There should be an auction to choose who can address issues as issues develop. This is the core idea behind the proposed solution.\n\nAlso, system customers must hang tight until they get confirmation before accessing their funds. People can file a challenge to get access to their data if anything goes wrong. Vitalik Buterin still needs to respond to the proposition made by his colleague.\n\nFollow Us on Google News"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXhwZXJ0cy1leHBlY3QtZXRoZXJldW0tZXRoLXRvLWJyZWFrLTIwMDAtc2hvcnRseS_SAVxodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V4cGVydHMtZXhwZWN0LWV0aGVyZXVtLWV0aC10by1icmVhay0yMDAwLXNob3J0bHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Experts Expect Ethereum (ETH) To Break $2,000 Shortly, Here’s Why - NewsBTC",
        "content": "The price of Ethereum (ETH) is currently experiencing a strong upswing, outperforming Bitcoin, which has been able to extend its dominance on the crypto market in recent weeks. Even Bitcoin’s ongoing sideways phase does not seem to worry Ethereum investors, who managed a breakout above $1,900 today.\n\nThe psychologically important price target of $2,000 is thus within reach. Eight days before the highly anticipated Shapella update on April 12, the Ethereum chart looks extremely bullish.\n\nMoreover, the trading month of April is statistically one of the most bullish months of the year for the crypto market. Also, ETH is getting tailwinds from the continued weakness of the US Dollar Index (DXY).\n\nAnalysts Predict Ethereum To Break Above $2,000\n\nJonah Van Bourg, head of trading at the crypto asset trading firm Cumberland, published a very bullish analysis on Ethereum via Twitter. As the analyst explains, ETH (unlike Bitcoin) has just broken out of its trading range, which has been in place since mid-March.\n\nAnd the fact that this is happening against the backdrop of a generally bearish regulatory climate makes it even more special. Moreover, various metrics confirm the strong bullish momentum.\n\n“Doge-themed redesign of Twitter notwithstanding, ETH gas spiked to 68 gwei yesterday – the highest we’ve seen since the Luna crisis of 2Q22 and its associated flurry of DeFi activity,” Van Bourg declared, pointing to the Shapella update as an actually bearish event.\n\nAfter more than two years, numerous holders will be able to access their staked ETH for the first time, theoretically making large amounts of out-of-the-money ETH units liquid and available for sale. “That said, the exit queue is empty,” Van Bourg noted.\n\nAlso bullish is that leverage in the futures market is at a minimum and robust price action suggests that positioning is low and excess longs have already been flushed.\n\nAccording to the Cumberland analyst, Ethereum’s strength could also be an early indicator for an altcoin rally if the recent past repeats itself. Most recently, it has been seen time and time again how the initial BTC strength spilled over to ETH and then to altcoins.\n\nThus, all eyes are on ETH at the moment – a solid retracement would represent an important leading indicator and potentially herald a lucrative trading environment.\n\nCup & Handle Pattern Signals Buying Opportunity\n\nAksel Kibar, a chartered market technician (CMT) has tweeted that ETH/USD could be two days ahead of the BTC/USD trading pair, according to the bullish flag chart pattern breakout that ETH has is forming, while Bitcoin is trailing.\n\nAt the same time, Ethereum has also formed a Cup & Handle pattern over four months on the 1-day chart, as Kibar notes. As the name suggests, the chart pattern resembles a cup with a handle, with the cup shaped like a “U” and the handle drifting slightly downward.\n\nThe pattern is considered a bullish signal that extends an uptrend and is usually seen as a buying opportunity.\n\nAt press time, the Ethereum (ETH) price stood at $1,912, up 5% in the last 24 hours.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2luc2lnaHRzL2dyYXlzY2FsZS1pbnZlc3RtZW50LWZ1bmRzLW91dHNoaW5lLWJpdGNvaW4tZXRoZXJldW0taW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Grayscale investment funds outshine Bitcoin, Ethereum in 2023 - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Learn more ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZGVjcnlwdC5jby8xMjU1NDgvbXV0YW50LWFwZXMtdGFrZS1sZWFkLXNlcnVtLWNpdHktYXBlY29pbi1wb3dlcmVkLWV0aGVyZXVtLW5mdC1nYW1l0gFiaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTU0OC9tdXRhbnQtYXBlcy10YWtlLWxlYWQtc2VydW0tY2l0eS1hcGVjb2luLXBvd2VyZWQtZXRoZXJldW0tbmZ0LWdhbWU_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Mutant Apes Take the Lead in Serum City, an ApeCoin-Powered Ethereum NFT Game - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCompared to Yuga Labs’ primary Bored Ape Yacht Club NFTs, the grimier, sometimes psychedelic siblings in the later and larger Mutant Ape Yacht Club (MAYC) set aren’t considered nearly as valuable or prominent—and their lower floor price has mirrored that sentiment.\n\nBut Novel Labs and Mutant Cartel founder Lior Messika—who’s also a Mutant Ape collector himself and a Yuga Labs investor through his VC firm Eden Block—is leaning into that feeling of being an outcast among outcasts and turning it into Web3 gaming lore, with Serum City.\n\nNovel Labs is working with Faraway—developer of the Solana-based game Mini Royale: Nations—to create a city builder game called Serum City on Ethereum that will use ApeCoin as its primary in-game currency.\n\nAD\n\nAD\n\n“There’s a real gap here for Mutants,” Messika told Decrypt in an interview of his perception of the broader Yuga Labs ecosystem.\n\nA screenshot from Serum City. Image: Novel Labs\n\nIn Serum City, Mutant Apes are the main characters, and MAYC is among a few NFT collections that will provide owners access to the game. Bored Ape holders will, as well, along with owners of Novel Labs’ own derivative Genesis Oath and Mutant Hound NFT collections that aren’t official Yuga creations.\n\nOwning one of those NFTs is required to play the game at launch, although a Faraway representative confirmed to Decrypt that Serum City will gradually open up access with each new in-game season of content.\n\nBuilding Serum City\n\nSerum City will continue and expand upon Mutant Cartel’s lore, which Messika has developed and published in the form of comic strips and short video clips over the past 18 months.\n\n“We’re just a bunch of nerds coming up with cool stories about our Mutants,” Messika said. “The cool thing is that we’re now incorporating a lot of our community members, and people who have been playing, into our canon.”\n\nAD\n\nAD\n\nThe Mutant Cartel never sleeps !howl pic.twitter.com/9cbdY0bFEQ — Mutant Cartel (@mutant_cartel) February 28, 2023\n\nSerum City is set in a dystopian world where Bored Apes are the “ruling class” and the Mutant Apes are the underlings, relegated to the fringes of society because they’ve consumed the Serum. The main storyline explores the Mutant Cartel Expanded Universe and the characters Blaksoot and Darkfang, according to a statement.\n\nFaraway co-founder Alex Paley told Decrypt that Serum City will have an “illustrated” or comic book-inspired aesthetic, as seen in the first in-game screenshot embedded above.\n\n“This is more like a transmedia type of play,” Paley added. “It’s a game, but it’s also a story.”\n\nFaraway and Novel Labs haven't shared a lot of gameplay details, but Messika has joined other Web3 game devs in attempting to push back against the simplistic and superficial nature of early NFT-based games. He suggests that Serum City will be a richer and more appealing play experience.\n\n“We believe that, frankly, the reason why a lot of games have not reached the kind of adoption that we all have been hoping for is that many of them were just not that deep,” Messika said. “They’re just not that fun.”\n\nApe expansion\n\nWhile Yuga Labs is wholly unaffiliated with Serum City, the $4 billion startup lets NFT holders use and commercialize their owned artwork. That open policy towards its IP has enabled countless Ape holders to build brands around everything from packaged goods to restaurants to video games like this one.\n\n“We’re in touch with them,” Messika said of his relationship with Yuga Labs. But he added that Novel Labs “didn’t need to check in” with Yuga before building Serum City, given the license tied to Bored Ape and Mutant Ape NFTs.\n\nAD\n\nAD\n\nA screenshot from Serum City. Image: Novel Labs\n\n“We are, in a sense, a great example of what permissionless innovation—by Yuga’s standards and vision—really looks like,” Messika said, “and we’re really proud of that.”\n\nWhile Messika is determined to provide players with plenty of lore and narrative, Serum City players will also be able to create their own stories and game assets, and buy in-game (off-chain) currencies like gems using ApeCoin.\n\nSerum City’s developers also see the game as a step towards interoperability—a key selling point that Web3 gaming advocates frequently tout, but has faced skepticism due to few prominent working examples to date.\n\nIn this case, items crafted in Serum City will be NFTs that can be transferred and used in future Novel Labs games in the future. Furthermore, the Faraway Developer Platform potentially opens up expanded interoperability down the line, with a press release claiming plans for “cross-game and cross-universe events” once Serum City launches in August.\n\nA screenshot from Serum City. Image: Novel Labs\n\nThose interoperability plans are also the main reason why Serum City’s assets will be on Ethereum’s mainnet. While some other games have opted for Ethereum scaling networks like Polygon or Immutable X to avoid fees, Faraway and Novel Labs see greater benefit to being on Ethereum proper.\n\n“It was important for us to make the game on the most interoperable blockchain, which is ETH. So, is it expensive in terms of the gas fees? Definitely,” Paley said. “But is it worth it to have the ultimate interoperable asset, as a user or a player, [and] for me to say that your asset is interoperable everywhere? I think as a player, the answer is yes.”"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNC8wNS90b3AtdHJhZGVyLWZsaXBzLWJ1bGxpc2gtb24teHJwLXJldmVhbHMtcHJpY2UtdGFyZ2V0cy1mb3ItdW5kZXItdGhlLXJhZGFyLWV0aGVyZXVtLWFsdGNvaW4tcHJvamVjdC_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDQvMDUvdG9wLXRyYWRlci1mbGlwcy1idWxsaXNoLW9uLXhycC1yZXZlYWxzLXByaWNlLXRhcmdldHMtZm9yLXVuZGVyLXRoZS1yYWRhci1ldGhlcmV1bS1hbHRjb2luLXByb2plY3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Top Trader Flips Bullish on XRP, Reveals Price Targets for Under-the-Radar Ethereum Altcoin Project - The Daily Hodl",
        "content": "A widely followed crypto analyst is bullish on XRP and says one Ethereum (ETH)-based altcoin is about to surge.\n\nPseudonymous crypto trader Altcoin Sherpa tells his 194,400 Twitter followers that he is picking a support level for payments platform Ripple’s utility token XRP using the Fibonacci retracement tool.\n\nThe trader is predicting an XRP retracement to the $0.46 level, the 0.5 Fibonacci level, and then a move to the upside.\n\n“XRP: I’m bidding $0.466 for the standard.”\n\nXRP is trading for $0.50 at time of writing.\n\nAnother altcoin on the trader’s radar is the decentralized borrowing protocol Liquity (LQTY), which he says is forming a bottom and could soon break out.\n\n“LQTY: Still think this is one of the better-looking swing trade charts out there IMO. Looks like accumulation / big compression with all EMAs (Exponential Moving Averages) and lots of volume transacted here. Buy and hold for a bit and watch it go up. One downside is it could take a while though.”\n\nLiquity is worth $2.46 at time of writing.\n\nThe trader also weighs in on Ethereum, saying a bottom may have formed on the ETH/BTC chart. He says that based on historic patterns after a bottom ETH and other altcoins generally surge in the near term. However, he also predicts a dip for ETH/BTC in the long term.\n\n“ETH: Checking out the ETH/BTC chart here, if this one has short-term bottomed then we should see an altcoin run. I don’t know if this is going to happen here because I ultimately believe Ethereum eventually goes to the .055 level or lower.”\n\nAt time of writing, ETH/BTC is trading for $0.66 BTC, or $1,869.\n\nHe notes that if a bottom is forming, it could chop around at the current price level for a while longer before a surge.\n\n“It takes a while to form good strong bottoms. Days and weeks chopping is healthy and the longer the consolidation, the stronger the move. We’ve chopped here for about two weeks now and let’s see if this is a short term bottom or not.”\n\nLastly, Sherpa weighs in on Dogecoin (DOGE) following the meme token’s rally by more than 30% after its most famous supporter, tech billionaire Elon Musk, changed Twitter’s icon to the DOGE logo. He predicts Dogecoin will soon give up its gains.\n\n“DOGE: To be determined if this pump has any legs; typically we see some sort of illiquid move up followed by a swift retrace. First resistance area approaching; IMO this goes all the way down after the Twitter icon is changed.”\n\nDOGE is swapping hands at $0.0952 at time of writing, down from Tuesday’s high of $0.102.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vZm9ya2FzdC5uZXdzL292ZXJzZWFzLWNyeXB0by10cmFuc2ZlcnMtY29zdC05Ni03LWxlc3Mv0gFCaHR0cHM6Ly9mb3JrYXN0Lm5ld3Mvb3ZlcnNlYXMtY3J5cHRvLXRyYW5zZmVycy1jb3N0LTk2LTctbGVzcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Overseas crypto transfers cost 96.7% less - Forkast News",
        "content": "Americans spend more than US$12 billion in remittance fees each year when sending money to family and friends living overseas using the traditional financial system. However, overseas remittances using Bitcoin and Ethereum cost 96.7% less, according to research by Coinbase, one of the largest crypto exchanges based in the U.S.\n\nSee related article: Ripple partners Novatti to use XRP for remittances in Asia Pacific\n\nFast facts"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWNyeXB0b3MtZGF5LXRyYWRlcnMtbG92ZS0wMTQ1MjI5NzAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "3 Cryptos That Day Traders Love Right Now - Yahoo Finance",
        "content": "Cryptocurrencies delivered huge gains for investors during the previous bull market. Yet, more than a few got wiped out as they plunged from their late-2021 peaks. But with 2023 looking like it could be the start of the thaw following crypto winter, let’s look at the best cryptos for day trading.\n\nWhen it comes to ultra-short-term trading, nothing trumps liquidity. In that sense, the best cryptos for day trading are highly liquid and generally well-known. The smaller, low-volume cryptos can work during trending markets over a longer holding period. However, for in-and-out scalps, we need liquid cryptos.\n\nSo, you’re likely to recognize all of the best cryptos for day trading below.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nBTC Bitcoin $28,031.86 ETH Ethereum $1,871.62 DOGE Dogecoin $0.08\n\nBitcoin (BTC)\n\nman in glasses holding a coin that has the Bitcoin (BTC-USD) logo\n\nSource: Shutterstock\n\nIn the sense of size and liquidity, how can we not kick off the list with Bitcoin (BTC-USD)? Bitcoin is the largest crypto in the world, with a market cap of around $540 billion. It’s the most well-known cryptocurrency out there, garnering the bulk of the industry’s attention. Over the past three months, its trading volume has averaged $25.8 billion a day.\n\nDay traders focused on cryptos must keep Bitcoin on their watchlist, even if they’re not trading it. That’s because the movement in Bitcoin impacts other cryptocurrencies, similar to the way the movement in stocks like Apple (NASDAQ:AAPL) or Microsoft (NASDAQ:MSFT) can impact the rest of the tech sector.\n\nBitcoin had a stellar first quarter. According to Finbold, “Bitcoin’s return on investment (ROI) was 170.32% more compared to the average of five major stock indexes. During the quarter, Bitcoin’s returns stood at 69.4%, while average returns for the indexes stood at 5.5%.”\n\nThe bulls are certainly in charge at the moment, buying the dips and sending the crypto soaring higher. The next important level to watch is $30,000, which is just 7% above where BTC currently trades.\n\nStory continues\n\nEthereum (ETH)\n\nA concept image of mining an Ethereum (ETH) token.\n\nSource: Shutterstock\n\nEthereum (ETH-USD) also had a great Q1, rallying about 50% in the first three months of the year and more than doubling off of its 2022 low. It is the second-largest cryptocurrency after Bitcoin, with a market cap of about $224.5 billion.\n\nEthereum is also one of the most widely traded cryptocurrencies, with an average daily trading volume of $8.6 billion. That makes the token one of the best cryptos for day trading.\n\nFor what it’s worth, Ethereum deserves every bit as much attention as Bitcoin gets given that it has such a wide range of applications. It’s faster when it comes to transactions, and its smart contracts offer real-world solutions as technology continues to evolve.\n\nDogecoin (DOGE)\n\nDogecoin Cryptocurrency\n\nSource: Orpheus FX / Shutterstock.com\n\nAs silly as Dogecoin (DOGE-USD) is, it’s on the list of the best cryptos for day trading due to its large following and ample liquidity. After the tethered crypto holdings, Bitcoin and Ethereum, Dogecoin is next on the list for daily trading volume.\n\nIt has traded an average of $604.6 million a day over the past three months and commands a market cap of $11.9 billion. It may have started off as a joke, but its large following isn’t.\n\nIt certainly doesn’t hurt that Tesla (NASDAQ:TSLA) and Twitter CEO Elon Musk has a fascination with the cryptocurrency. In fact, he recently integrated the logo into the Twitter platform, adding a quick $4 billion to the token’s market value.\n\nDay traders thrive on volatility and massive moves like this. While I don’t personally believe in the long-term viability of Dogecoin, this one puts together enough moves for day traders to take advantage of.\n\nOn the date of publication, Bret Kenwell did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nBret Kenwell is the manager and author of Future Blue Chips and is on Twitter @BretKenwell.\n\nMore From InvestorPlace\n\nThe post 3 Cryptos That Day Traders Love Right Now appeared first on InvestorPlace."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDQvMDUvZXRoZXJldW0tcHJpY2Utc3VycGFzc2VkLTEtOWstaHlwZS1vZi1zaGFuZ2hhaS11cGdyYWRlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Price surpassed $1.9K, Hype of Shanghai upgrade? - Crypto Times",
        "content": "The second largest cryptocurrency Ethereum impressed the buyers as it recorded its latest 2023 high of $1,921 on April 05. Will the Shanghai upgrade, hype pump the market and take ETH above $2K.\n\nOverall cryptocurrency market capitalization increased by 1.44% to $1.21 trillion today. The bullish momentum in Bitcoin and Ethereum lead to this growth in the market. However, BTC already reached its new 2023 high of $29,184 on March 30 and ETH did the same today.\n\nEthereum today overcame its key seven-month resistance at $1,900 and headed for the next conceptual round level of $2,000. The Shanghai upgrade and rise in Bitcoin price are the two vital reasons behind the ETH surge.\n\nThe Shanghai Upgrade, the latest hard fork of Ethereum, scheduled for April 12, 2023, further implements the key Ethereum Improvement Proposal (EIP)-4895 and several others. As a result of this EIP-4895 implementation, validators and stakeholders in Ethereum will be able to withdraw staked ETH from the Beacon Chain.\n\nThe Shanghai upgrade also known as the Shapella upgrade, a combination of words “Shanghai” and Capella”, two of the anticipated Ethereum growth proposals.\n\nThe rise in the price of bitcoin since last night could also be another reason for the rise in ETH. Thus at that time the price of the ETH/BTC pair increased by 1.76% to 0.6724 satoshis.\n\nThe Ethereum price is currently sitting at $1,912 against the USDT pair along with 2.41% overnight gain. Thus market capitalization reached $230.3 billion.\n\nAmidst the bullish momentum, ETH price climbed above the 400-day simple moving average on the daily price chart. Furthermore, ETH bulls attempt to propel the asset further up the ascending parallel channel (mentioned above the chart) to record another higher peak."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXdoYWxlcy1wdXNoLWNob3Jlb2dyYXBoZWQtYnRjLXByaWNlLWFzLWV0aGVyLW5lYXJzLTJr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin whales push 'choreographed' BTC price as Ether nears $2K - Cointelegraph",
        "content": "Bitcoin (BTC) headed back toward $29,000 into April 5 as data showed whale orders guiding price action.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalysis: BTC price push still “bear market rally”\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it hit $28,780 on Bitstamp.\n\nThe pair continued a rebound from one-week lows under $27,300 at the start of the week courtesy of rumors around the Binance crypto exchange and its CEO, Changpeng “CZ” Zhao.\n\nAfter reclaiming $28,000, Bitcoin saw fresh momentum as Binance order book data showed large-volume “whale” traders buying.\n\n$BTC Binance Spot\n\nKeep an eye on the $28K area, those stacked buy walls will either support market buying here or will be pulled later.\n\n\n\nSupply is consistently being filled in these squeezes.\n\n\n\n6K BTC bought in past 1H candle pic.twitter.com/Dv7YzggCDu — Skew Δ (@52kskew) April 5, 2023\n\nThis was not all as it seemed for bulls, monitoring resource Material Indicators nonetheless warned, as those same traders could be artificially pushing the market higher in order to sell closer to $30,000.\n\n“Likely a choreographed attempt to push the distribution range up in the short term,” part of the accompanying commentary stated.\n\n“Personally still treating this as #BearMarketRally until proven otherwise.”\n\nA subsequent print of the order book with liquidity levels showed the spot price eating into a dense cloud of asks, potentially stranding latecomers choosing to go long BTC believing that the upside may continue.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nOthers were more hopeful that $30,000 could see a genuine challenge after being absent from the chart for nearly a year.\n\nAmong them was Michaël van de Poppe, founder and CEO of trading firm Eight.\n\n“Bitcoin looks eager to break the crucial barrier at $30K, while altcoins are also waking up,” he told Twitter followers on the day.\n\n“If Bitcoin makes that breakout, we'll probably see significant breakout across the board on altcoins as confidence comes back in the markets.”\n\nRelated: Crypto winter can take a toll on hodlers’ mental health\n\nAnalytics account IncomeSharks was similarly optimistic when it came to altcoins, in particular, opting to swap BTC exposure for alternatives at current prices.\n\n“Been waiting all year for this,” it announced.\n\n“If we can hold this and keep pushing up get ready to not care what Bitcoin does and make multiple X’s on alts. Part of me selling some $BTC at $28,000 is me wanting more exposure to alts.”\n\nTotal crypto market cap annotated chart. Source: IncomeSharks/ Twitter\n\nThe day prior, popular trader Crypto Tony had agreed that liquidity was “moving” away from Bitcoin on short timeframes.\n\nETH must hold crucial range high\n\nWith that, the largest altcoin Ether (ETH) looked primed for an attack on $2,000 at the time of writing, having gained nearly 5% in the past 24 hours.\n\nRelated: BTC price double top forming? 5 things to know in Bitcoin this week\n\nETH/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalyzing moves on ETH/USD, now at eight-month highs, trading suite DecenTrader noted that funding rates had already been hinting at the upside to come.\n\n#Ethereum Funding Rate functioning perfect as a leading indicator for the multiple moves higher. https://t.co/zypZt1kq5M pic.twitter.com/oYadIkIN44 — Decentrader (@decentrader) April 5, 2023\n\n“The goal now is for Ethereum to now stay above the range high at $1,840,” Crypto Tony added in his own ETH/USD analysis.\n\nETH/USD annotated chart. Source: Crypto Tony/Twitter\n\n“If we begin closing back below, the we have a deviation and we know what that means.”\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZmluYm9sZC5jb20vc3VicXVlcnktbGF1bmNoZXMtd2ViMy1kYXRhLWluZGV4aW5nLW9uLWV0aGVyZXVtLXRvLWNoYWxsZW5nZS10aGUtZ3JhcGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "SubQuery launches Web3 data indexing on Ethereum to challenge The Graph - Finbold - Finance in Bold",
        "content": "Support for Ethereum (ETH) has been added to the beta version of SubQuery, the global Web3 data indexing toolkit. SubQuery has already shown that it is quicker than The Graph (GRT) and provides Ethereum developers with another decentralized option with the imminent launch of the SubQuery Network.\n\nInstead of developing indexing solutions, developers can concentrate on product development and user experience thanks to SubQuery’s proprietary API, which abstracts the backend and frees users from the burden of designing their own indexing systems, as per information about its Web3 data indexing launch shared with Finbold on April 5.\n\nIn particular, the decentralized data indexing solution gives developers the tools they need to quickly organize and query on-chain data for their protocols and apps. Avalanche, Flare, Cosmos (Ethermint), and Polkadot (FrontierEVM) are among the networks that will benefit from this new integration, which expands on SubQuery’s current support for the Ethereum Virtual Machine (EVM) for other networks.\n\nSubQuery is actively working on making the protocol decentralized and tokenized so they may launch the SubQuery Network. From the get-go, the SubQuery Network will be able to index Ethereum projects, as well as those from any other supported Layer-1, and provide services to the worldwide community based on this data.\n\nThe Founder and CEO of SubQuery, Sam Zou, said:\n\n“Ethereum has been on our radar since day one. Our experienced engineering team has put a lot of hard work into this integration, so that we can guarantee Ethereum developers will have a smooth and seamless experience indexing with SubQuery’s open-source SDK, tools, and documentation. We can’t wait to collaborate with teams building on Ethereum with the power of our fast, flexible, and universal indexer.”\n\nSubQuery is 1.85 times faster than The Graph\n\nThird-party services like The Graph for Ethereum ecosystem developers had previously met data indexing needs. However, SubQuery is already 1.85 times quicker than The Graph for common projects like the default Ethereum Name Service project, with just beta support.\n\nSubQuery is 1.85x faster than The Graph. Source: SubQuery\n\nSubQuery can decrease the number of costly database writes by using multi-threading and optimizing the store. Developers may reduce the time between iterations and the release of new features by shortening the sync times.\n\nUnlike The Graph, SubQuery will not be sunsetted. It improves upon existing decentralized indexing solutions by giving developers more freedom to host their own projects and more control over those by supporting large-scale projects in its managed service, which hosts large-scale infrastructure and processes millions of daily requests."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiogFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vY3J5cHRvY3VycmVuY3kvd2hhdC1hcmUtc2FuZHdpY2gtYXR0YWNrcy1hbmQtaG93LWRpZC1hbi1ldGhlcmV1bS12YWxpZGF0b3ItZXhlY3V0ZS1vbmUtdG8tc3RlYWwtMjUtbWlsbGlvbi1pbi1jcnlwdG9jdXJyZW5jeS0xNjM0MTcyMS5odG3SAaYBaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L3doYXQtYXJlLXNhbmR3aWNoLWF0dGFja3MtYW5kLWhvdy1kaWQtYW4tZXRoZXJldW0tdmFsaWRhdG9yLWV4ZWN1dGUtb25lLXRvLXN0ZWFsLTI1LW1pbGxpb24taW4tY3J5cHRvY3VycmVuY3ktMTYzNDE3MjEuaHRtL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "What are sandwich attacks and how did an Ethereum validator execute one to steal $25 million in cryptocurrency - CNBCTV18",
        "content": "Cryptocurrencies have skyrocketed in popularity in recent years, with the sector currently worth a little over $1.2 trillion. Unfortunately, network security has lagged behind the expanding industry, leading to an increase in malicious network attacks.\n\nRecently, the crypto community was left shocked after an Ethereum validator stole crypto worth millions from a Maximal Extractable Value (MEV) bot — a software designed to churn profits by rearranging blocks. Furthermore, the culprit is yet to be apprehended and currently holds $20 million worth of stolen tokens.\n\nBut before addressing this issue, let’s discuss what sandwich attacks are and how they are carried out.\n\nHow are sandwich attacks carried out?\n\nSandwich attacks are a form of malicious blockchain attack that takes advantage of smart contract vulnerabilities. A sandwich attack, simply put, traps a user’s transaction between two transactions, which is then further manipulated to gain profits. Such assaults are frequently carried out with the assistance of MEV (maximum extractable value) bots operating in a network.\n\nBefore we take a look at an example, it’s important to understand how MEV bots function since they are a crucial component of sandwich attacks. MEV bots are automated software designed to exploit a network by detecting profitable transactional opportunities. They can initiate “sandwich trades” by spotting traders attempting to purchase tokens and slipping in between to make a profit. Such a method is often used by validators.\n\nFor example, if a trader places a transaction to buy $5,000 worth of ETH, the MEV bot detects it and places a transaction to buy ETH just before the trader can execute the transaction. These back-to-back buy transactions can inflate the price of ETH. The MEV bot then places a sell transaction after the trader’s buy transaction to make a profit from the price jump.\n\nCertain inefficiencies with how blockchains function make it possible for such attacks to occur. For instance, on the blockchain, transactions with the highest gas fees are picked up first to be added to the block. Thus, MEV places the first transaction with higher gas fees than the victim and places the second transaction with lower gas fees to make sure the first malicious transaction is picked before the victim’s, followed by the second malicious transaction.\n\nHow a rogue Ethereum validator pulled a $25 million theft?\n\nIn a recent sandwich attack, a bad player pretended to be an Ethereum validator by depositing 32 ETH just 18 days before the planned theft. The rogue validator then caused an MEV bot to launch a sandwich assault, replacing several automated trades and stealing $25 million.\n\nIt was later reported that eight addresses from the KuCoin exchange were involved in executing the said sandwich attacks on Uniswap liquidity pools. According to blockchain security firm PeckShieldAlert, the stolen amount is stored in three different addresses out of eight involved in the theft.\n\nAt the time of writing this article, the hacker has about $13.4 million worth of wrapped Ethereum (WETH), $1.8 million worth of Wrapped Bitcoin (WBTC), $3 million in USDT, $5 million in USDC and $1.6 million worth of DAI stablecoin.\n\nConclusion\n\nWhile rug pulls and Sybil attacks are frequently discussed in the crypto space, sandwich attacks have often been overlooked. Data security firm, CertiK, told CoinTelegraph that about $27 million worth of exploits have occurred via MEV bots (bots that execute sandwich attacks) since September 2022, with the latest attack accounting for a great majority."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL25ld3MuY2lzaW9uLmNvbS9maW5hbmNlLXByL3IvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi0tLXdpbGwtZXRoLXJhbGx5LWFzLXRyYWRlcnMtYmFjay1uZXctZ3JlZW4tdG9rZW4tZWNvdGVycmEtLGMzNzQ3OTAx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction - Will ETH Rally as Traders Back New Green Token Ecoterra? - Cision News",
        "content": "Ethereum Price Prediction - Will ETH Rally as Traders Back New Green Token Ecoterra? Wed, Apr 05, 2023 15:57 CET Report this content\n\nThe price of Ethereum (ETH) surged to $1,873 on Tuesday, up 4% over the previous 24 hours, and up 9.2% on the week.\n\nIts weekly gains have outcompeted Bitcoin’s, helping the #2 crypto asset regain some lost ground against the leading cryptocurrency by market cap. ETH/BTC has risen from 0.064 on April 3rd to 0.066 today – a 3.6% pump. This brings ETH market dominance up to 18.2%, versus Bitcoin’s 44.2%.\n\nTuesday’s pronounced rally applied to all risk assets, as stock market indices like the Nasdaq 100 and S&P500 continue to trade higher over the past week. In particular, futures contracts tied to the tech-focused Nasdaq index rose 0.35% to an eight month high.\n\nEthereum’s own trajectory mimics this, having not reached the upper $1800 price level since mid-August, when hype for its upcoming Merge upgrade was abounding.\n\nWith the network on the brink of another major upgrade this month – the Shapella upgrade – Ethereum may be poised for another bullish breakout back above $2000.\n\nFurthermore, the launch of eco-friendly tokens like ecoterra may continue to attract attention to Ethereum’s ecosystem from environmentally conscious investors – especially amid continuing fervor surrounding Ethereum’s proof of stake consensus mechanism.\n\nEthereum Remains Rangebound (TA)\n\nSince mid-March, Ethereum’s price has remain rangebound between the lower $1700 and mid $1800 price levels.\n\nThus far, the asset has shown a strong proclivity to sharply reverse trajectory whenever touching the lower end of that range, such as on March 22 and March 27. While there appears to be strong support at that price level, Ethereum’s movement so far indicates no upside bias.\n\nFrom a technical perspective, there are a range of likely possibilities for Ethereum’s next breakout. On one hand, if the market determines that it needs deeper support, it could retrace back to support found at the lower $1600 level.\n\nAlternatively, the asset may have experienced a shallow retracement to its established $1700 lows on Monday, before breaking out beyond its resitance.\n\n“As long as we’re holding $1717, I’m in favor of a breakout scenario,” said price analyst More Crypto Online on Tuesday. “It’s likely, but it’s not for sure.”\n\nShapella On the Way\n\nEthereum’s Shapella upgrade – the name for its joint “Shanghai” and “Copella” upgrades – is scheduled to roll out at block 6209536 on April 12th – less than a week from today.\n\nThe long awaited hardfork will allow Ethereum users to withdraw their staked assets from the network for the first time since the Beacon Chain rolled out in November 2020. Each upgrade will make changes to Ethereum’s execution layer and consensus layer, respectively.\n\nThe change is a follow up to the Ethereum’s “Merge,” which shifted the main network’s consensus mechanism from proof of work to proof of stake. This reduced the network’s energy consumption by 99.9%, a feat praised by environmentally conscious businesses and regulators as a step toward responsible innovation in crypto.\n\nPrior to the Merge’s rollout, Ethereum appreciated significantly compared to rival cryptocurrencies, rising from $1000 in July to nearly $2000 in August. Ethereum could experience a smaller, albeit significant price runup similar to that as Shapella makes proof of stake on the network fully functional.\n\nIts successful rollout could also make Ethereum a more attractive asset to investors who no longer need worry about being unable to withdraw their stake.\n\nThat said, Shapella could also mimic the Merge in terms of being a “buy the rumor, sell the news” event, meaning its price plummets directly after the upgrade actually takes place. Some have even theorized that the upgrade willspark a market dump, as it will unlock billions of dollars in ETH that can now be potentially sold and drive Ethereum’s price down.\n\nStill, a fully functional proof of stake Ethereum retains a strong value proposition to environmentalists who were once put off by the network’s energy intensive mining industry. Furthermore, environmentalist projects built atop the Ethereum blockchain – such as ecoterra – only strengthen that value proposition.\n\nNew Token Ecoterra Backed for Big Gains as it Enters the Recycle2Earn Economy\n\nEcoterra is a new crypto project that many people are backing to be the next big green crypto, having raised over $50,000 shortly after launching its presale. This initiative leverages blockchain technology and tokenization to encourage recycling and efficient energy use.\n\nThrough the ecoterra app, companies can reward consumers in ecoterra tokens (ECOTERRA) for proving that they have engaged in a number of green initiatives, including puchasing PET plastic, glass, aluminum, and green energy packages.\n\nUsers will also be rewarded for scanning barcodes of recyclable products, and for recycling and uploading their RVM receipts to their accounts. They are also provided with a carbon-offset marketplace to help all parties reach their emissions targets, even if personal efforts are not enough.\n\nOnce earned, ECOTERRA may be donated to fund green initiatives around the globe, such as tree planting, cleaning projects, and climate change education. It can even be used to purchase eco friendly products for everyday use.\n\nECOTERRA features a max supply of 2,000,000,000 tokens, and trades as an ERC-20 token on Ethereum. The token’s presale process is still active, now being offered on its website for $0.004, purchasable via USD, USDT, or ETH.\n\nWhile low right now, ECOTERRA’s price is being periodically increased as the presale continues, so new investors will need to enter early to get the best bargain.\n\nThe project is certified and audited by the blockchain security company Certik, including 90+% scores in code security and fundamental health.\n\nAmid continued public scrutiny and regulatory pressure against proof of work blockchains like Bitcoin, Ethereum will continue to benefit from its standout position as a low-energy network – and so may the tokens on its platform."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9ldGhlcmV1bS1ldGgtYW5kLXNoaWJhLWludS1zaGliLXB1bXAtb3JiZW9uLXByb3RvY29sLW9yYm4tZWFybHktaW52ZXN0b3JzLWVuam95LXJldHVybnMtYXMtb3Jibi1saXN0cy1vbi11bmlzd2FwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) and Shiba Inu (SHIB) Pump; Orbeon Protocol (ORBN) Early Investors Enjoy Returns As ORBN Lists ... - Analytics Insight",
        "content": "In the recent crypto market surge, Ethereum (ETH) and Shiba Inu (SHIB) experienced impressive pumps, while Orbeon Protocol (ORBN) early investors enjoyed high returns as ORBN has now listed on Uniswap. The Orbeon Protocol (ORBN) presale was a massive success, with the token’s price soaring from $0.004 to its current price of $0.1857 as the coin has launched on Uniswap.\n\nAs a blockchain-based platform, Orbeon Protocol (ORBN) aims to revolutionize engagement in companies by enabling anyone to participate in crowdfunding and venture capital investments without entry barriers.\n\n>>BUY ORBEON TOKENS HERE<<\n\nEthereum (ETH)\n\nEthereum (ETH) has grown remarkably, rising 55.82% year-to-date and 2.70% today to trade over $1,914.20. Demand for Ethereum (ETH) staking increases as the Shanghai Upgrade approaches, with 15% of Ethereum (ETH) staked.\n\nStaking Ethereum (ETH) has positively affected the Liquid Staking Derivative (LSD) market, enabling investors to keep their liquidity and earning potential.\n\nEthereum (ETH) smart contracts transformed decentralized apps, creating new options for corporations and developers. The Ethereum (ETH) community anxiously anticipates the Shanghai Upgrade, expecting more progress for Ethereum (ETH) as a result of its launch.\n\n>>BUY ORBEON TOKENS HERE<<\n\nShiba Inu (SHIB)\n\nShiba Inu (SHIB) is now gaining 7.82%, topping $6.7 billion in market capitalization. The increase started when Twitter, owned by Dogecoin backer Elon Musk, replaced its distinctive blue bird logo with the Shiba Inu symbol for Dogecoin. Shiba Inu (SHIB) has witnessed comparable gains in the past due to Musk’s tweets.\n\nAs Musk altered Twitter’s logo to the Dogecoin meme over the weekend, meme currencies skyrocketed. Shiba Inu (SHIB) and other meme currencies followed suit with a big rally, providing investors with considerable gains, including investors of Shiba Inu (SHIB).\n\nAs the Shiba Inu (SHIB) surge started, meme currencies separated from the wider crypto market. Shiba Inu (SHIB) rallied after Musk’s tweet, and investors raced to comparable assets to profit on the increase for Shiba Inu (SHIB).\n\n>>BUY ORBEON TOKENS HERE<<\n\nOrbeon Protocol (ORBN)\n\nOrbeon Protocol (ORBN) is a revolutionary blockchain-based platform that seeks to transform company investing by allowing anybody to engage in crowdfunding and venture capital investments with no minimum investment requirement. Orbeon Protocol (ORBN) provides an innovative method of investing, allowing ordinary people to purchase NFT-based stock in early-stage companies for as little as $1.\n\nUsing the NFTs-as-a-service (NFTaaS) functionality of the Orbeon Protocol (ORBN), firms may generate the required capital by constructing equity-based NFTs.\n\nIn addition, Orbeon Protocol (ORBN) has developed a “Fill or Kill” mechanism that prevents investors from incurring losses. This Orbeon Protocol (ORBN) safety procedure guarantees that all investors will get a full return if the investment process unexpectedly fails. In addition, blockchain technology ensures that only reputable firms that have been carefully screened will be displayed on the site.\n\nThe presale for Orbeon Protocol (ORBN) was a huge success ending with a 2713% rally. From its initial $0.004 presale price to its current trading price of $0.1857 following its listing on Uniswap, Orbeon Protocol (ORBN) has skyrocketed, raking in millions of dollars for holders. Analysts anticipate that the price of Orbeon Protocol (ORBN) will continue to climb, yielding even higher returns for early investors.\n\nFind Out More About The Orbeon Protocol\n\nWebsite: https://orbeonprotocol.com/\n\nUniswap: https://app.uniswap.org/#/swap\n\nTelegram: https://t.me/OrbeonProtocol\n\nTwitter: https://twitter.com/OrbeonProtocol\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2RlY3J5cHQuY28vbmV3cy1leHBsb3Jlcj9waW5uZWQ9MTQ0MzA0JnRpdGxlPWV0aGVyZXVtcy1zaGFwZWxsYS11cGdyYWRlLWRyaXZlcy1saXF1aWQtc3Rha2luZy10b2tlbi1nYWlucy1oaWdoZXItdGhhbi1ldGjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 10:42:03 GMT",
        "title": "News Explorer — Ethereum's Shapella Upgrade Drives Liquid Staking Token Gains Higher Than ETH - Decrypt",
        "content": "Apr 5, 9:49 am\n\nDecrypt\n\nEthereum's Shapella Upgrade Drives Liquid Staking Token Gains Higher Than ETH\n\nEthereum's price has jumped 4.7% overnight, outpacing Bitcoin's 1.3% increase, as the network prepares for its Shapella upgrade. This upgrade will enable ETH withdrawals from staking contracts, an upcoming event that appears to have also led to a rise in tokens linked to liquid staking platforms. These tokens have even yielded higher percentage gains than ETH, with some recording up to 150% year-to-date."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5iYXNlLmNvbS9pbnN0aXR1dGlvbmFsL3Jlc2VhcmNoLWluc2lnaHRzL3Jlc2VhcmNoL3dlZWtseS1tYXJrZXQtY29tbWVudGFyeS9zaGFuZ2hhaS1zaGFwZWxsYS1yZWFkeS1hcHJpbC03LTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Shanghai (Shapella) ready - Coinbase",
        "content": "Market View\n\nEthereum’s Shapella (Shanghai+Capella) Fork will be a major focus next week as the upgrade is scheduled for activation on April 12 at 10:27pm UTC. The network upgrade will enable validators to withdraw their staked ETH, some of which has been dormant on the Beacon Chain since the consensus layer went live in December 2020. The big question is how much selling pressure could materialize once withdrawals are enabled, as there are numerous variables involved in estimating both the supply that could be unlocked as well as the amount that could reasonably be expected to be sold.\n\nWe previously laid out our thesis in a report published February 14 ( “Staked ETH withdrawals: new math” ) that a sell-off on the back of this event should be relatively limited. Our revised estimates are that ETH selling directly from this source could amount to only around 1-2% of total average daily ETH volumes, and we’re biased towards the lower end of that range.\n\nChart 1. ETH/BTC cross has moved in ETH’s favor ahead of Shanghai Fork\n\nNevertheless, in our view, ETH performance around the Shanghai Fork will be less strictly dependent on technicals and more contingent on what risk actually does at that time. That is, if the trading environment sees risk assets selling off, people may decide to unstake and sell ETH just to de-risk, while institutions may not step in as aggressively on the buy side. Mid-April holidays may also constrain liquidity, while a lower stablecoin dominance ratio (of 11.2% of the total crypto market cap) suggests a lot of conversion into other tokens already took place in March.\n\nThere are however some mitigating factors that could limit the amount of ETH that could be immediately unlocked after the upgrade takes place. First, only 44% of validators have set their withdrawal credential prefixes to 0x01, which is necessary for both partial and full withdrawals to be enabled and funds unlocked. (Note: some of these address changes can only occur once the Shanghai Fork is activated.) Second, full withdrawals are rate limited to 8 validators per epoch at the moment or 1800 validators per day, given that there are around 563k validators at the moment. This figure changes as the total number of validators increases or decreases by 65,536.\n\nThird, staking platform Lido, which represents almost 23% of all staked ETH, has said that their withdrawal functionality will be ready no sooner than early May as they are still preparing their v2 upgrade. Crypto exchange Binance has also set daily ETH redemption quotas for its users with withdrawals only supported one week after the Shanghai Fork takes place. All of this could drag out the timeline for when staked ETH balances could actually be withdrawn. (Incidentally, if users want to unstake their ETH on Coinbase, they will be able to do so soon after the upgrade is complete – waiting periods will be determined by the protocol.)\n\nThere’s also the separate but related issue of why people may actually sell the staked ETH that’s deposited into their accounts and how much could make its way onto the market. Pressure on this front could be alleviated by the fact that more than 67% of all staked ETH is currently staked through third-party entities, and a lot of those could use those released rewards to set up new validators. Moreover, around 51% of all staked ETH was locked up at prices higher than they are today, which diminishes the risk of ETH selling to meet tax liabilities.\n\nChart 2. Amount of ETH staked per price level (ETH/USD)\n\nFinally, we are only considering the withdrawal side of the equation here. But as people withdraw, the base rewards on staked ETH increases which over time should also encourage people to stake ETH. The current staking participation rate in Ethereum is currently only 15% of total ETH circulating supply compared to an average of 65% across the top alternative layer-1s by market cap. That suggests that there is a very big opportunity to grow here, even if the ultimate staking ratio is still under 65% because of the relative amount of organic Ethereum usage."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3doeS1hcmUtc3RvY2stbWFya2V0LXdoYWxlcy1zZWxsaW5nLW9mZi1hbmQtYnV5aW5nLWV0aGVyZXVtLWV0aC1hbmQtcmVucS1maW5hbmNlLXJlbnEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Why are stock market whales selling off and buying Ethereum (ETH) and RenQ Finance (RENQ)? - Analytics Insight",
        "content": "The stock market has been experiencing a shift lately, as whales (big institutional investors) are selling off their stocks and buying into cryptocurrencies like Ethereum (ETH) and RenQ Finance (RENQ).\n\nThis shift has caused many to wonder what is behind it and why institutional investors are choosing these particular cryptocurrencies. In this article, we’ll explore the reasons behind the whale migration to crypto and what this means for the future of both the stock market and the crypto market.\n\nThe Pandemic’s Effect on the Stock Market:\n\nThe COVID-19 pandemic had a significant impact on the global economy, leading to widespread uncertainty and volatility in the stock market.\n\nMany institutional investors have been looking for ways to diversify their portfolios and mitigate their risks in this uncertain market. As a result, many of them have been selling off their stocks and looking for alternative investments, such as cryptocurrencies.\n\nOverview of RenQ Finance (RENQ) and Ethereum (ETH)\n\nRenQ Finance and Ethereum are two popular cryptocurrencies in the decentralized finance (DeFi) space. While both are built on blockchain technology, they differ in their approach and offerings.\n\nRenQ Finance, launched in 2023, is a decentralized exchange (DEX) that offers liquidity solutions for the crypto market. The platform’s main focus is to provide a secure and reliable way for users to exchange and trade digital assets.\n\nRenQ Finance uses advanced AI technology to provide users with the best possible price for their assets and offers a variety of features such as staking, lending, and borrowing. With its recent success in its presale stages and innovative use of AI technology, RenQ Finance is a promising investment opportunity for those interested in decentralized finance.\n\nOn the other hand, Ethereum is the second-largest cryptocurrency by market capitalization, and it is known for its smart contract capabilities. The platform allows developers to build decentralized applications (DApps) on top of its blockchain, making it a popular choice for the DeFi space. Ethereum also offers its native cryptocurrency, Ether (ETH), which is used as a means of payment for transactions on the network.\n\nOne of the key differences between the two is their approach to scalability. Ethereum has been facing scalability issues due to its limited transaction processing capacity, leading to higher gas fees and slower transaction times. However, Ethereum has recently upgrade its network to Ethereum 2.0, which aims to improve its scalability and efficiency.\n\nRenQ Finance, on the other hand, uses a multi-chain approach, allowing users to access financial products across different blockchains. This approach enables RenQ Finance to provide more scalability and interoperability, making it easier for investors to diversify their portfolios and take advantage of opportunities in different markets.\n\nEthereum’s Advancements and Potential\n\nEthereum has been a popular choice among institutional investors due to its recent advancements and potential for future growth. The Ethereum 2.0 upgrade improves the scalability and efficiency of the network, making it more attractive to investors.\n\nAdditionally, the development of decentralized finance (DeFi) applications on the Ethereum network has led to increased adoption and use cases, further driving up the price and demand for ETH.\n\nRenQ Finance’s Unique Value Proposition\n\nRenQ Finance is another cryptocurrency that has caught the attention of institutional investors. RenQ Finance’s unique value proposition lies in its use of advanced AI technology to provide users with the best possible price for their assets, offering features like staking, lending, and borrowing.\n\nAdditionally, its interoperability allows users to access various financial products across different blockchains, making it easier for investors to diversify their portfolios.\n\nThe Future of the Stock Market and Crypto Market:\n\nThe recent shift in institutional investors from stocks to cryptocurrencies like ETH and RENQ may signal a broader trend toward adopting crypto as a legitimate investment class.\n\nThe potential for higher returns and the diversification benefits that crypto provides are likely to attract more institutional investors in the future. This could lead to increased demand and higher prices for cryptocurrencies, which may cause a further shift away from traditional investments like stocks.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vZmludGVjaG5ld3MuY2gvYmxvY2tjaGFpbl9iaXRjb2luL2luY29yZS1iYW5rLXNpZ25zLW1hZXJraS1iYXVtYW5uLWFzLWZpcnN0LWNsaWVudC1mb3Itc2R4LWV0aGVyZXVtLXN0YWtpbmcvNTk0MzEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Incore Bank Signs Maerki Baumann as First Client For SDX Ethereum Staking - Fintech Schweiz Digital Finance News ... - Fintechnews Switzerland",
        "content": "Blockchain/Bitcoin Incore Bank Signs Maerki Baumann as First Client For SDX Ethereum Staking by Fintechnews Switzerland April 5, 2023\n\nInCore Bank can now offer Ethereum staking capabilities that are fully compliant with Know-Your-Client (KYC) and Anti-Money-Laundering (AML) regulations to their clients.\n\nIn this collaboration, InCore Bank provides crypto brokerage, banking operations and custody services, while SDX Web3 provides crypto custody and non-custodial-staking services.\n\nThe Zurich-based private bank Maerki Baumann launched its crypto strategy in 2019. Apart from corporate accounts for companies focusing on blockchain technology and crypto applications, it offers services in crypto trading and custody in collaboration with InCore Bank. Maerki Baumann will continue to expand its crypto offering by making the new Ethereum staking services available to its private and corporate tech banking clients.\n\nMark Dambacher, CEO InCore Bank, stated,\n\n«We perceive an increasing interest in staking and ways to participate in the decentralized economy. InCore Bank’s fully integrated and future-oriented staking services via segregated wallets, enable us to offer staking to our clients within a convenient, secure, regulated and tax compliant setting. We are proud to be part of this strategic alliance with SDX».\n\nDavid Newns, Head of SDX, adds,\n\n«This collaboration between established digital asset institutions is the first of its kind in Switzerland. We are strengthening the Swiss digital asset ecosystem by enabling key market players to provide value adding capabilities like Ethereum custody and staking that their clients are asking for».\n\nWhat is staking?\n\nBlockchain networks are based on the principle of decentralisation, there is no central entity that decides on the correct transaction history. Nevertheless, a consensus mechanism is needed to ensure in a decentralized pattern that transactions are validated in correct order and in a secure manner. Blockchains typically reach consensus in two ways, either by so-called Proof-of-Work (PoW) or Proof-of-Stake (PoS) mechanisms.\n\nIn PoS blockchains like Ethereum, to guarantee consensus, no power-intensive computing power is used. Rather, capital needs to be expended in the form of the blockchain’s own coin. These coins must be «staked», i.e. made available to the network and bound by it for the staking period. For individuals who hold digital assets of proof-of-stake networks, staking is mandatory in order to avoid dilution of their own position. Due to this fact, it can be assumed that in the near future, there will be an increasing merger of custody and staking.\n\nStaking is an umbrella term used to denote the act of pledging crypto-assets to a cryptocurrency protocol to earn rewards in exchange. Staking allows users to participate in securing the network by locking up tokens. The «stakers» become validators who add new transactions to the respective blockchain. At the same time, the validators follow the so-called consensus rules. These set the rules of the game according to which the various network participants have to comply. If, as a validator, you violate the network’s consensus rules during this process, you put your own capital at risk in the form of the coins you have staked. This ensures validators have an incentive to abide by the rules.\n\nFeatured image credit: Edited from freepik"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3MvYnVzaW5lc3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvY3VycmVuY3ktcHJpY2VzLXRvZGF5LWFwcmlsLTA1LWJpdGNvaW4tZXRoZXJldW0tdGV0aGVyLXVwLTEwMzI4ODIxLmh0bWzSAYsBaHR0cHM6Ly93d3cubW9uZXljb250cm9sLmNvbS9uZXdzL2J1c2luZXNzL2NyeXB0b2N1cnJlbmN5L2NyeXB0b2N1cnJlbmN5LXByaWNlcy10b2RheS1hcHJpbC0wNS1iaXRjb2luLWV0aGVyZXVtLXRldGhlci11cC0xMDMyODgyMS5odG1sL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Cryptocurrency Prices Today April 05: Bitcoin, Ethereum & Tether up - Moneycontrol",
        "content": "Bitcoin\n\nCryptocurrencies traded in mixed early today on April 5. The global crypto market cap is $1.20 trillion, a 2.88 percent increase over the last day. The total crypto market volume over the last 24 hours is $45.04 billion, which makes a 6.88 percent decrease.\n\nThe total volume in DeFi is currently $4.79 billion, 10.63 percent of the total crypto market 24-hour volume. The volume of all stable coins is now $39.50 billion, which is 87.69 percent of the total crypto market 24-hour volume.\n\nThe price of Bitcoin is currently Rs 24.24 lakh, with a dominance of 45.89 percent. This was a 0.16 percent decrease over the day, according to data from CoinMarketCap.\n\nStory continues below Advertisement Remove Ad\n\nAlso Read | Cryptocurrency roundup for April 5\n\nIn the news, Binance has lost 16 percent of its global market share amid a regulatory crackdown over the last two weeks. Trade volume is down after tthe company ended its zero-fee trading program and a lawsuit by the Commodity Futures Trading Commission (CFTC).\n\nNotably, despite the decline, Binance remains the largest exchange in the world with 54 percent dominance.\n\nAlso, Donald Trump's non-fungible token (NFT) collection has seen a 133 percent sales spike just hour ahead of the former US President's arraignment in Manhattan, according to data from CryptoSlam.\n\nThe digital cards, bearing Trump's image, were worth nearly $37,000 in the last 24 hours. However, the recent price spike is comparatively small, with Trump's 45,000-item NFT collection selling out within hours and generating $3.53 million in sales just months ago in December.\n\nAs off 8.40 am on April 5, these are the prices of largest cryptocurrencies (data from WazirX):\n\nNAME PRICE (INR) 24H % Bitcoin 24,24,725 0.61% Ethereum 1,61,000 3.2% Tether 85.99 0.62% Cardano 32.0000 1.52% Binance Coin 42,7500 -0.07% XRP 43.000 1.86% Polkadot 553.00 2.97% Dogecoin 8.1500 -1.8%\n\nFind more blockchain business and market related stories here"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMirQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaXRjb2luLXN3aW5ncy1iYWNrLWFuZC1mb3J0aC1hZnRlci1mZWRzLWludGVyZXN0LXJhdGUtaGlrZS1ldGhlcmV1bS1zdGFyaW5nLWF0LWRvd253YXJkLWNvcnJlY3Rpb24tYmlnLWV5ZXMtY29pbi1wcmVzYWxlLWhpdHMtMzItNS1taWxsaW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Swings Back-And-Forth After Fed's Interest Rate Hike – Ethereum Staring At Downward Correction, Big Eyes ... - Analytics Insight",
        "content": "The most recent increase in interest rates by the US Federal Reserve has rippled a downward momentum in the cryptocurrency industry and simultaneously raised fears it could add to the current financial turmoil triggered by a series of bank failures in the US and Europe.\n\nThe 0.25% interest rate hike is the US Federal Reserve’s ninth consecutive rate hike which lifts its key interest rate from 4.75% to 5%, up from near zero a year ago – the highest level since 2007.\n\nThe cryptocurrency industry is being driven by market sentiment as Bitcoin (BTC), the industry’s largest digital asset, dipped in daily trading after surging by roughly 40% since early March following the collapse of multiple banks in the US and Europe, which prompted depositors to withdraw their funds from banks and switch to digital currencies and Swiss lenders.\n\nEthereum (ETH), the second-largest cryptocurrency in the industry, also dipped in price prompted by a cloud of uncertainty over the global financial market, while in the meme coin space, Big Eyes Coin (BIG) was living up to its status of being the most exciting meme token in the market.\n\nBitcoin – March Madness Sends BTC Price on Roller Coaster Ride\n\nIn the aftermath of multiple banking failures in the US and Europe, Bitcoin (BTC) has been trading back and forth as its price hit lows of $19,628.25 and a high of $28,803.34 during 30 days caused by swaying confidence among investors who the SEC’s crackdown has at times impacted on digital assets and otherwise preferring virtual currency following the banking turmoil.\n\nAt the time of writing, Bitcoin had slumped by 2.86% in the past 24 hours to trade at $27,052.01, while its weekly rally was broken with a downward correction of 2.05%.\n\nEthereum – ETH Staring at Decline to $1,500?\n\nEthereum (ETH) dipped below the $1,750 mark and continues at an hourly rate of 0.33%. The second-largest cryptocurrency even briefly dipped below the $1,700 mark to post a 7-day low of $1,690.52.\n\nAt the time of writing, Ethereum had dipped by 1.48% in the last 24 hours to trade at $1,726.08, while experts suggest that a break below the $1,685 support could push the price to $1,600 and failure by bulls to the support $1,600, ETH is staring at a sharp decline towards $1,500.\n\nBig Eyes Coin – Cometh the Bulls, Cometh the BULLRUN250 Bonus Code\n\nBig Eyes Coin (BIG) is the latest ERC-20 meme token powered by the Ethereum blockchain. The project is currently having its Initial Coin Offer (ICO), and since its launch, the cat-based meme token has been recognized as the most successful presale in recent crypto history.\n\nThe project’s primary objective is to shift its community’s wealth into the Decentralized Finance (DeFi) ecosystem while self-propagating using Non-Fungible Tokens (NFTs), which offer its holders access to more content and events.\n\nIn stage 12 of its presale, Big Eyes Coin has raised over $32.5 million in presale tokens and will launch live after reaching its $50 million presale target.\n\nAs the project’s presale draws closer to its end as it plans to go live after stage 15, Big Eyes Coin wants to ensure that its community gets maximum returns during this period. Hence, Big Eyes Coin has launched the BULLRUN250 bonus code, which offers crypto users a massive 250% bonus when purchasing BIG tokens or Loot Boxes.\n\nBig Eyes Coin Loot Boxes is the project’s ongoing video game feature parallel to the BULLRUN250 bonus code, which offers its community a maximum ROI of 5000%. It features the Saver Tin, Cute Box, Kitty Vault, Super Saiyan Box, and Excali-Paw Master Chest, and each loot box carries a maximum return of $500, $5000, $25,000, $100,000, and $1,000,000 worth of BIG tokens, respectively.\n\nSo if a user enters the BULLRUN250 bonus code when purchasing a Cute Box loot box, the user will get a potential return of $5,000 plus $250 in BIG tokens.\n\nWe can see that while the use of cryptocurrency has seen overwhelming growth and popularity over the years, investors remain uncertain as the regulatory landscape surrounding the industry remains rather blurry as the heavy crackdown by the US Securities and Exchange Commission appears to take a heavy toll on digital currencies, creating challenges for investors and lenders alike.\n\nFind out more about Big Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiwgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWFwcmlsLTUtY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1sdGMtZXRoLWxkby1nYWluZXItbG9zZXItMTU5MzI5MdIBxgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWFwcmlsLTUtY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1sdGMtZXRoLWxkby1nYWluZXItbG9zZXItMTU5MzI5MS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Ethereum Scales 8-Month High, LDO Becomes Top Gainer - ABP Live",
        "content": "Ethereum (ETH), arguably the most popular cryptocurrency after Bitcoin (BTC), managed to scale the $1,900 mark, achieving an eight-month high early Wednesday. BTC, on the other hand, managed to remain stable within the $28,000 range. Other popular altcoins — including the likes of Dogecoin (DOGE), Ripple (XRP), Litecoin (LTC), and Solana (SOL) — landed in the greens across the board. The Lido DAO (LDO) token managed to become the top gainer, with a 24-hour profit of over 15 percent.\n\nThe global crypto market cap stood at $1.20 trillion at the time of writing, registering a 24-hour gain of 1.09 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $28,527.68, registering a 24-hour gain of 2.31 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 24.40 lakh.\n\nEthereum (ETH) price today\n\nETH price stood at $1,911.36, marking a 24-hour jump of 5.66 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.63 lakh.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 1.49 percent, as per CoinMarketCap data, currently priced at $0.09836. As per WazirX, Dogecoin price in India stood at Rs 8.25.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 1.62 percent. At the time of writing, it was trading at $93.89. LTC price in India stood at Rs 8,049.\n\nRipple (XRP) price today\n\nXRP price stood at $0.5057, seeing a 24-hour jump of 2.09 percent. As per WazirX, Ripple price stood at Rs 43.\n\nSolana (SOL) price today\n\nSolana price stood at $21.13, marking a 24-hour jump of 3.29 percent. As per WazirX, SOL price in India stood at Rs 1,910.\n\nTop crypto gainers today (April 5)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nLido DAO (LDO)\n\nPrice: $2.75\n\n24-hour gain: 15.04 percent\n\nBasic Attention Token (BAT)\n\nPrice: $0.301\n\n24-hour gain: 23.84 percent\n\nCurve DAO Token (CRV)\n\nPrice: $1.02\n\n24-hour gain: 11.30 percent\n\nRocket Pool (RPL)\n\nPrice: $48.48\n\n24-hour gain: 11.06 percent\n\nFrax Share (FXS)\n\nPrice: $9.90\n\n24-hour gain: 10.79 percent\n\nTop crypto losers today (April 5)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nSolar (SXP)\n\nPrice: $0.7949\n\n24-hour loss: 4.49 percent\n\nInjective (INJ)\n\nPrice: $5.47\n\n24-hour loss: 4.17 percent\n\nChiliz (CHZ)\n\nPrice: $0.1257\n\n24-hour loss: 1.11 percent\n\nUNUS SED LEO (LEO)\n\nPrice: $3.40\n\n24-hour loss: 0.74 percent\n\nPancakeSwap (CAKE)\n\nPrice: $3.66\n\n24-hour loss: 0.72 percent\n\nWhat crypto exchanges are saying about the current market scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin has experienced a surge despite the larger-than-expected decline in US job vacancies on Tuesday. BTC is currently trading up nearly 3 per cent in the past day and hovering around the $28,600 mark. Meanwhile, Ethereum has reached an 8-month high, trading above the $1,900 level. ETH must maintain its current level as a support and potentially consolidate above $1,900. Nevertheless, investors must keep a close watch on the upcoming nonfarm payroll data for March, which will offer further insight into the health of the labour market.”\n\nWazirX Vice President Rajagopal Menon said, “Amid banking uncertainties, Bitcoin traded over $28,000 as investors cautiously eyed a slight dip in the job market. Experts suggest it's at the upper end of its recent range, and traders are waiting to see its response to the banking crisis for potential benefits. On the other hand, Ether outperformed BTC and was trading above $1,900 for the first time since August last year. On WazirX, Icon (ICX) and 0x Protocol (ZRX) have been the top gainers in the last 24 hours.”\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3N1YnF1ZXJ5LWxhdW5jaGVzLXdlYjMtZGF0YS1pbmRleGluZy1pbi1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "SubQuery Launches Web3 Data Indexing in Ethereum - Analytics Insight",
        "content": "Singapore, Singapore, April 5th, 2023, Chainwire\n\nSubQuery, the universal web3 data indexing toolkit, takes a significant step forward with today’s announcement of beta support for Ethereum. Despite being a beta release, SubQuery has already proven to be faster than The Graph, offering Ethereum developers another decentralised alternative upon the impending launch of the SubQuery Network.\n\nSubQuery’s decentralised data indexing solution provides developers with the tools needed to easily organise and query on-chain data for their protocol and applications. Abstracting the backend, SubQuery provides a custom API and lets developers focus on product development and user experience rather than building their own indexing solutions. The latest integration builds on SubQuery’s existing Ethereum Virtual Machine (EVM) support for other networks including Avalanche, Flare, Cosmos (Ethermint) and Polkadot (FrontierEVM).\n\nSam Zou, the Founder and CEO of SubQuery, said: “Ethereum has been on our radar since day one. Our experienced engineering team has put a lot of hard work into this integration, so that we can guarantee Ethereum developers will have a smooth and seamless experience indexing with SubQuery’s open-source SDK, tools and documentation . We can’t wait to collaborate with teams building on Ethereum with the power of our fast, flexible and universal indexer.”\n\nUntil now developers in the Ethereum ecosystem have had to rely on services such as The Graph for their data indexing requirements. However, with its existing beta support, SubQuery is already 1.85x faster than The Graph for common projects such as the standard Ethereum Name Service project. SubQuery achieves this by using multi-threading and optimisation of the store to reduce costly database writes. With faster sync times, developers can iterate faster and deliver features to market quicker.\n\nSubQuery also brings some major improvements to existing decentralised indexing solutions which include far more flexibility and better controls for developers to run projects in their own infrastructure, plus the ability to support enterprise level projects in its managed service which provides enterprise-level infrastructure hosting and handles hundreds of millions of requests each day and unlike The Graph, will not be sunsetted.\n\nSince its founding in 2021, SubQuery established itself as the leading data indexing solution in Polkadot and has achieved rapid growth by serving hundreds of millions of queries each day to leading projects such as Moonbeam and Acala. The success in Polkadot spurred SubQuery to integrate with other Layer-1 blockchains to become a truly universal solution, which will also extend to other EVM chains and Layer-2 scaling solutions, like Polygon, BNB, and Arbitrum in future.\n\nSubQuery is currently focused on decentralising and tokenizing the protocol to build the SubQuery Network. The SubQuery Network will index and service data from projects to the global community in an incentivized and verifiable way and support indexing Ethereum projects, and those from any other supported Layer-1 from the outset.\n\nThe Ethereum integration is currently being tested with a small group of beta projects. If you would like to join SubQuery as an Ethereum launch partner or migrate from The Graph, please reach out to james.bayly@subquery.network.\n\nAbout SubQuery\n\nSubQuery is a blockchain developer toolkit enabling others to build Web3 applications of the future. A SubQuery project is a complete API to organise and query data from layer-1 chains. Currently servicing Polkadot, Substrate, Algorand, Cosmos, NEAR, Avalanche, and now Ethereum projects, this data-as-a-service allows developers to focus on their core use case and front-end, without needing to waste time on building a custom backend for data processing. The SubQuery Network proposes to enable this same scalable and reliable solution, but in a completely decentralised way.\n\n​​Linktree | Website | Discord | Telegram | Twitter | Matrix | LinkedIn | YouTube\n\nContact\n\nDan Edelstein\n\nPR@marketacross.com\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC0xMC1sZWdpdC1zaXRlcy10by1lYXJuLWV0aGVyZXVtLWZvci1mcmVlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Top 10 Legit Sites to Earn Ethereum for Free - Analytics Insight",
        "content": "The top 10 legit sites to earn Ethereum for free without mining it or investing money\n\nOne of the most well-known cryptocurrencies nowadays is Ethereum. And as you may already be aware, since it was created, the value of Ethereum has surged. There are a few websites you can join to earn Ethereum without mining it or spending money if you want to get in on the activity. All you have to do is put in a little time and work.\n\nThese are legit sites to earn Ethereum and are worth joining since these sites offer decent earning potential. This article will show you the best ways to earn Ethereum for free. In this article, we have mentioned the top 10 legit sites to earn Ethereum for free.\n\nCoinApp\n\nAs a geo-mining app, Coin App makes it incredibly simple to make a little money by just running on your phone while you’re out and about. You can earn more money if you drive a lot. If you wish to increase your profits, it also provides more engaging ways to make money. For instance, you may perform surveys, completely paid offers, and more.\n\nRewards1\n\nYou may earn rewards in a variety of ways on the GPT site Rewards1. You may get money on this website by doing surveys, finishing offers, viewing films, participating in daily polls, playing games, and many other activities.\n\nLatium\n\nThere are several jobs available on the freelancing network known as Latium. There are a variety of quick activities available, including completing surveys, registering for websites, social networking chores, user testing, and others. Yet, other tasks call for greater time and effort, such as translations, design, marketing, development, and more.\n\nPicoWorkers\n\nYou may get money on PicoWorkers by visiting websites, becoming a member of websites, reading articles, and many other things. This website is a fantastic choice because it has a low payment threshold ($5).\n\nBituro\n\nThe GPT software Bituro provides a variety of opportunities to get money. As you may receive incentives on a semi-regular basis, this is one of the better programs you can sign up for if you want to earn Ethereum.\n\nPrediqt\n\nYou may earn multiple cryptocurrencies, gift cards, and even cash with the GPT smartphone app Prediqt. It is a wonderful choice because there are many methods to generate money with it. You may watch movies, do surveys, complete offers from their offer walls, get idle rewards, and even take advantage of cashback deals.\n\nMicrowork\n\nA Get-Paid-To (GPT) software called Microwork will pay you for doing brief tasks. It only provides one type of income possibility, which is through their compensated jobs. Usually, you’ll need to snap photographs of specific products and upload them to the app to complete these jobs. Earning money is therefore rather easy.\n\nPeer2Proft\n\nFree Ethereum may be obtained passively with Peer2Profit. You only need to install the app on your device to start making money by allowing it to share your idle internet bandwidth in the background. If you want to earn Ethereum for free, Peer2Profit is an excellent option because it has a very low payment threshold; all you need to earn is $2 to request a payout.\n\nIdle-Empire\n\nIdle-Empire is a different website that was first created with gamers in mind but has subsequently transformed into a GPT site that welcomes all users. Being a GPT site, this one has several earning chances. You may make money by watching movies, doing surveys, completing offers, and inviting others to the website.\n\nFreecash\n\nA GPT website called Freecash was first created with gamers in mind. But since then, things have changed. By completing offers, responding to surveys, and inviting others to the site, you may make money from it. Ethereum is one of the many payment methods it provides. Your winnings may be transferred to gift cards, in-game products, Bitcoin, Litecoin, or PayPal for withdrawal.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDIzLzA0LzA1L3RvcC01LWNyeXB0b2N1cnJlbmNpZXMtdG8td2F0Y2gtaW4tYXByaWwtMjAyMy_SAVhodHRwczovL25haXJhbWV0cmljcy5jb20vMjAyMy8wNC8wNS90b3AtNS1jcnlwdG9jdXJyZW5jaWVzLXRvLXdhdGNoLWluLWFwcmlsLTIwMjMvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Top 5 Cryptocurrencies to watch in April 2023 if you want to make money - Nairametrics",
        "content": "Key Highlights\n\nThe cryptocurrency market posted a bullish performance in March, with Bitcoin leading the way with a 23.03% gain. The cryptocurrency market capitalization gained 10.19%, while the altcoin market gained 2.03%.\n\nFive cryptocurrencies to watch out for in April 2023 are Bitcoin, BNB Chain’s BNB, Ethereum’s Ether, XRP, and Conflux’s CFX.\n\nThe article provides an overview of the performance of each of these cryptocurrencies in March, highlighting key events that impacted their prices and market trends.\n\nThe cryptocurrency space in March, saw it post a bullish performance pushing it into the fourth consecutive month of gain.\n\nDespite the gains seen, the market was crowded with a lot of regulatory and market FUD. However, despite these occurrences, the market still posted a massive bullish performance to end the first quarter of the year.\n\nFlagship cryptocurrency asset, Bitcoin, posted a bullish performance, as the rest of the market followed in its trend. It began trading from $23,147.35 at the beginning of the month and ultimately ended the month at $28,478.48, representing a 23.03% gain.\n\nThe cryptocurrency market capitalization in March gained 10.19% for the month, from $1.08 trillion at the start of the month to the end of the month at $1.19 trillion. The cryptocurrency market capitalization traded as high as $1.20 trillion during the month.\n\nThe Altcoin market experienced similar bullishness, gaining 2.03% in March, from approximately $622.1 billion to currently standing at $634.7 billion at the end of the month. During the month, we saw the altcoin market capitalization trade as high as $646 billion.\n\nWith the current bullish trend seen in the market, here is a look at 5 cryptocurrencies investors should watch out for in April 2023:\n\nBitcoin’s BTC\n\nFor Bitcoin, a key point of resistance from earlier in its current halving cycle indicates that the current trading zone represents a major hurdle for bulls to overcome. Should they manage it, price targets extend beyond the $30,000 mark. Matthew Hyland, a crypto analyst, summarized in his latest tweet on BTC that, “Bitcoin has been consolidating below the biggest resistance/support of the last 2+ years. A whole new ballgame if BTC breaks it. NASDAQ & S&P went strong into the weekly close. Still, major pessimism and disbelief while major milestones are close to being made for Stocks/BTC.”\n\nPopular Twitter account Byzantine General predicted that a breakthrough of resistance immediately above the spot price would result in a sea of liquidations, leading to further upward momentum. The account tweeted, “It feels like some bear is very desperately trying to defend the 29k to 30k region. I think that when this level breaks massive liqs will come in. And it does feel like a matter of ‘when’ not ‘if’ because there’s zero froth in the market, only some spot supply.”\n\nTo add, according to data from Coinglass, the 23% gain seen in March almost matches its 2021 performance, with 2013 remaining its most volatile. This is relevant because Bitcoin’s trajectory mimics both years, seeing at least three months “in the green” before significant consolidation began.\n\nBitcoin ended the month’s trading at $28,478.48.\n\nBNB Chain’s BNB\n\nOn March 27, the United States Commodity Futures Trading Commission sued Binance and its CEO, Changpeng “CZ” Zhao, alleging that the company illegally offered crypto derivatives services to Americans and facilitated illicit financial activity.\n\nBNB dropped by over 5.5% to $305 on the announcement day, logging its worst daily performance since Feb. 13, when its price dropped by over 5.8% due to another regulatory crackdown involving Binance-branded stablecoin Binance USD. BNB’s price stabilized on March 28, wobbling between gains and losses as CZ refuted CFTC’s allegations. However, the BNB/USD pair risked falling further if one considers its recent response to regulatory actions. For instance, the New York regulator’s BUSD crackdown in February 2023 preceded a 15%-plus BNB price decline.\n\nBNB ended the month’s trading at $317.04.\n\nEthereum’s Ether\n\nIn the digital assets space, Ethereum remains the largest smart contract platform, hosting a plethora of financial products, innovation, and automation, with varying degrees of decentralization (generally referred to as DeFi).\n\nFrom an on-chain perspective, Ether’s short-term and long-term trends look skewed toward the bulls. Most Ethereum whale cohorts have increased their ETH accumulation in recent weeks, according to the latest data from Santiment. For instance, the supply of Ether held by addresses with a 1,000-10,000 ETH balance (blue in the chart below) has grown by 0.5% in March.\n\nSimilarly, the 1 million-10 million ETH and the 10 million-100 million ETH balance cohorts have witnessed 0.4% and 0.5% rises, respectively. The growth appeared amid what appears to be the absorption of selling pressure introduced by the 100,000-1 million ETH (pink) and 10,000-100,000 ETH address cohorts. At the same time, the growth could be attributed to the network’s proof-of-stake contracts, directly or by using third-party stakers such as Lido DAO (LDO).\n\nThe net Ether deposited at the official Ethereum 2.0 address crossed above 18 million ETH after rising about 3.5% in March. The deposits have grown ahead of Ethereum’s Shanghai and Capella upgrades on April 12, which would enable stakers to withdraw ETH from the PoS smart contract. Currently, this is not possible.\n\nEther ended the month trading at $1,822.02.\n\nXRP\n\nRipple’s chances of winning the court case against the Securities Exchange Commission (SEC) improved on March 21 after the presiding judge, Analisa Torres, decided to exclude an expert’s opinion explaining how could be a security. On March 27, another U.S. regulatory move was a blessing in disguise for XRP holders. The Commodity Futures Trading Commission (CFTC) in the U.S. charged Binance with improper compliance procedures and market manipulation.\n\nThe regulatory body classified Bitcoin, Ethereum, and Litecoin as commodities in the filing. Some believe that this classification will extend to XRP as well. Thus, effectively refuting the SEC’s claim of XRP being a security. The market’s expectation of Ripple winning the case against the SEC has pushed XRP’s price to new yearly highs already this month and if Ripple goes on to win the case against SEC, the bullish momentum in XRP will likely continue in the medium to long term. To add, XRP was the fourth largest gainer for March 2023, as it hit a 10-month high.\n\nXRP ended the month’s trading at $0.5385.\n\nConflux’s CFX\n\nConflux (CFX) is a public layer-1 blockchain that was made to power decentralized applications (dApps), e-commerce, and Web 3.0 infrastructure by being more scalable, decentralized, and secure than existing protocols. The protocol makes it easier to transfer valuable assets by making the process quick, effective, free of network congestion, and with low transaction costs. The platform is based on the Tree-Graph consensus mechanism, and it combines Proof-of-Work (PoW) and Proof-of-Stake (PoS) algorithms to achieve consensus. The protocol uses Turing-complete smart contracts written in Solidity, just like those on Ethereum, and is compatible with the EVM (Ethereum Virtual Machine).\n\nConflux Network continued its positive run from February, nearly doubling its price in March. The project’s team continued to strengthen its partnerships in China by adding XCMD, the world’s third-largest construction machinery manufacturer, and Zen Spark Technology. The Conflux team also supports the development of permissionless applications. It has established a grants program to promote its ecosystem development.\n\nOver the years, Conflux has earned the reputation of a Chinese enterprise blockchain with partners in Oreo China, McDonald’s China, and Chinese Instagram equivalent Little Red Book. The blockchain also hosts a stablecoin pegged to the Chinese yuan with the approval of the Chinese government, which is highly encouraging given the strict influence of the authorities over state policies.\n\nThe Conflux Network deploys both proof-of-work and proof-of-stake mechanisms to increase scalability and decentralization. The network processes between 3,000 to 6,000 transactions per second, which is considerably faster than Ethereum’s speed of 15 tps.\n\nWhile Conflux has established partnerships with leading Chinese brands, the activity on the blockchain has yet to justify the 500% increase in CFX’s price rally in the last two months. Data shows that the number of new Conflux addresses and NFTs minted on the platform has stayed at par with previous months with no evident spike.\n\nCFX ended the month’s trading at $0.4134."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vYml0Y29pbmlzdC5jb20vc2hpYmEtaW51LXNoaWJhcml1bS1tb3JlLWRlY2VudHJhbGl6ZWQtZXRoZXJldW0v0gFLaHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9zaGliYS1pbnUtc2hpYmFyaXVtLW1vcmUtZGVjZW50cmFsaXplZC1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Shiba Inu: Shibarium To Become More Decentralized Than ETH - Bitcoinist",
        "content": "Shibarium, the layer-2 scaling solution of Shiba Inu could become more decentralized than Ethereum – the layer-1 technology on which the Meme Coin is built – in the future. This is the goal of development firm Unification, which is considered the main developer of Shibarium.\n\nRingoshi Toitsu, a well-known validator of the Unification (FUND) network shared this news on Twitter. In a tweet dated April 5, Toitsu posted a screenshot of an interaction with a community user and the Unification Foundation.\n\nIn the conversation, Unification is addressing the critical issue of the centralization of Ethereum Virtual Machine (EVM) node operations. SHIB’s layer-2 technology will therefore use Unification’s upcoming tool UNODE for decentralized applications (dapps) in the Shibarium ecosystem.\n\nFUND, Unification’s native token will also play a major role. Toitsu explained that FUND will be the only cryptocurrency that UNODE will use. He also declares that UNODE will play an important role for the entire SHIB ecosystem. On Twitter, he wrote:\n\nUnification is now tackling the next major point of centralization for Shibarium operations – EVM node operations. UNODE’s launch in 2023 offers a more secure and decentralized infrastructure for developers & Dapps – using FUND as the gas!”.\n\nWhy This Is Of Major Importance For Shiba Inu\n\nNodes are a critical part of the Ethereum infrastructure. For quite some time, there have been discussions about how centralized Ethereum is in terms of nodes. A Messari study found in fall 2022 that over 70% of leading Ethereum applications run on just four centralized node providers.\n\nUnification picks up on this in a blog post, writing that centralized industry incumbents Alchemy, Infura, Moralis, and Quicknode provide the bulk of ETH nodes, creating a vulnerability in the technology stack of decentralized applications.\n\nAlso many are permissioned and identifiable because they require card payments through dapps. Thus, tracking could potentially be turned on at any time, the article notes and further explains:\n\nUnification’s UNODE addresses this Achilles’ Heel, by democratizing, decentralizing, and incentivizing EVM node operations. In accordance with our ethos, this will be pure Web3.\n\nUNODE is scheduled to launch before the end of 2023. This will not only be beneficial for the SHIB ecosystem but will also bring exclusive utilities to the FUND token.\n\nIn addition, Shiba Inu will receive other critical infrastructure from Unification. As Toitsu explained in an interview, Unification’s technology includes the Oracle of Oracles (OoO), a permission-free master oracle that combines data from centralized and decentralized exchanges to provide real-time asset prices.\n\nThe OoO service will be widely integrated into the SHIB ecosystem. This includes ShibaSwap, Shiboshi NFTs, and Shibarium.\n\nRegarding the current development status of the layer-2, Toitsu revealed:\n\nUnification is doing an excellent job with their technology for Shibarium, and no one else can match it. We’re still in an early beta stage with a focus on delegating/staking. People know that BONE is gas, there will be REAL governance, and TRUE SHIB users will be able to earn rewards from using the blockchain.\n\nAt press time, the SHIB price stood at $0.00001092, down 3.5% within the last 24 hours.\n\nFeatured image from ShibaSwap, chart from TradingView.com"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNC8wNS9ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlLXNoYXBlbGxhLWhhcmQtZm9yay1pcy1oZXJlLXJlcG9ydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Shanghai Upgrade / Shapella Hard Fork is here: Report - The Coin Republic",
        "content": "Ethereum to bring much-awaited Shanghai upgrade / Shapella Hard Fork on April 12.\n\nPeople are ambiguous about its effects on the market.\n\nEthereum is coming up with the Shanghai upgrade on April 12; investors and analysts are ambiguous about the results. Ethereum requires its validators to lock or stake their ETH for the blockchain’s functioning, and they are rewarded with ETH over time. These staked ETHs cannot be un-staked. The Shanghai upgrade would allow un-staking while providing efficiency to the blockchain.\n\nWhat Will Shanghai Upgrade or Shapella Hard Fork Do?\n\nWhen the update goes live, approximately 15% of all Ethereum in circulation shall be available for un-staking. Masses have different thoughts about its possible effect; some feel this could bring a negative influx and drop the value considerably. In comparison, bulls think the Shanghai upgrade would encourage staking.\n\nAfter the Shanghai upgrade, Ethereum is expected to reveal “sharding.” This would break the larger blockchains into smaller parts; after that, the capacity to handle transactions per second would noticeably increase, with a considerable drop in gas fees.\n\nShapella Hard Fork / Shanghai Upgrade Could Invite Sell-off\n\nWith the Shanghai upgrade or Shapella hard fork around the corner, the market seems afraid of the scenario where ETHs deposited on the network have been unlocked in the name of boosting security, which could invite holders for the liquidation of their tokens. Observers feel that the supposed selling pressure could be in billions of dollars.\n\nAnalysts say approximately 1.1 million ETH would come for withdrawal, and Celsius might sell their 158k staked balance to help their bankruptcy process. These two alone amounts to nearly 1.3 million ETH, or around $2.4 billion. Dealing with such intense selling pressure would not be easy for the Ethereum blockchain.\n\nIs the Phobia Legit?\n\nAlthough people claim impending influx and drop in ETH, the study shed light on the brighter side. Not every staker is expected to un-stake their assets all at once, but still, a partial withdrawal is supposed to take 5 to 6 days, while a full withdrawal is supposed to take anywhere from three weeks to four months.\n\nIn simpler terms, the much-hyped selling pressure force will be distributed in multiple days, where buyers can also match the selling pressure. There is already a fair limit of 16.27 million ETH per day, which could distribute the selling pressure over a longer period. Researchers found that the majority of stakers are, in fact, long-term investors and are not likely to liquidate their holdings.\n\nEthereum Prices are Rising as Shapella Nears\n\nAs the Shapella hard fork is nearing, ETH is experiencing a wave of positive sentiments supported by upward-moving EMA. If the signals from MACD were also towards the north, then chances for a rally would have been great. The price is closer to the supply zone and might enter or consolidate between immediate support present at 1717.77.\n\nSource: ETH/USDT; TradingView\n\nAfter the launch of Shapella, the prices could go either way; if it drops below immediate support, it might enter the demand zone, but a clean breakdown is highly unlikely.\n\nDisclaimer\n\nThe views and opinions stated by the author, or any people named in this article, are for informational purposes only and do not establish financial, investment, or other advice. Investing in or trading crypto assets comes with a risk of financial loss."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbmNoYXB0ZXIuY29tL2V0aGVyZXVtLXRva2VuLWV0aC1vbi1pdHMtd2F5LXRvLTJrLW91dHBhY2luZy1iaXRjb2luLWFsdHNlYXNvbi1haGVhZC_SAWJodHRwczovL2NvaW5jaGFwdGVyLmNvbS9ldGhlcmV1bS10b2tlbi1ldGgtb24taXRzLXdheS10by0yay1vdXRwYWNpbmctYml0Y29pbi1hbHRzZWFzb24tYWhlYWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Ethereum token ETH on its way to $2K outpacing Bitcoin – altseason ahead? - CoinChapter",
        "content": "Key Takeaways:\n\nEthereum token crosses the $1,900 threshold.\n\nETH/BTC sees the largest weekly boost since January 2023.\n\nIt is too early to call for an altseason.\n\nEthereum token ETH on its way to $2K outpacing Bitcoin – altseason ahead?\n\nYEREVAN (CoinChapter.com) – Ethereum’s token ETH enjoyed 12% weekly gains, broke the $1,900 resistance, and reached $1,910 in the European session on April 5, year-to-date gains to 60%.\n\nETH eyes a path to $2,000, charts say\n\nNotably, the Ethereum token traded in a technical pattern dubbed the ‘symmetrical triangle’ from May 2022 to January 2023. The setup entails two converging trendlines with a similar slope. The price action fluctuates between them, retesting the said lines consecutively.\n\nEthereum (ETH) is on its way to $2K. Source: TradingView.com\n\nAfter a break in either direction, the symmetrical triangle forecasts a move equal to the maximal triangle height without specifying the bias. ETH broke the setup’s resistance on Jan 12. Thus, the leading altcoin’s target price would be approximately $2,300 in Q2/2023.\n\nAlso read: What is Ethereum Shanghai Upgrade and How Does It Affect ETH Traders.\n\nMeanwhile, the Ethereum token inched its way to the $2,000 resistance, potentially within reach by Sunday, April 9. The daily trading volumes have been declining since mid-March, but several other factors point to a bullish scenario:\n\nETH/BTC chart prints consecutive green candles\n\nThe ETH/BTC chart showed a choppy performance year-to-date. However, the Ethereum coin gained a 7% weekly advantage against Bitcoin, the highest weekly achievement since January.\n\nIn retrospect, Bitcoin’s 2023 rally was mainly due to a questionable narrative that projects it as a safe haven against the banking crisis. As a result, BTC outperformed not just Ether but almost all the top-ranking cryptocurrencies amid the collapse of Silvergate, Silicon Valley Bank, Credit Suisse, and others.\n\nMeanwhile, Ethereum’s recent success raised speculation that the altcoin season might be approaching.\n\nToo soon to ring Altseason bells\n\nGenerally, altcoin season arrives when 75% of all altcoins outperform Bitcoin over 90 days. On the other hand, if Bitcoin beats more than 25% of all altcoins, the market is witnessing a Bitcoin season.\n\nAccording to BlockchainCenter.net, a platform tracking crypto ‘seasonality,’ the digital asset market left the Bitcoin season, but it is still early to call for an altseason. The platform’s altseason index stood at 27 out of the possible 100.\n\nAltcoin season index at 27. Source: blockchaincenter.net\n\nMeanwhile, a financial analyst with an extensive following,@tedtalksmacro, asserted that the market is moving towards “phase 2” of the path to altseason. Supposedly, during phase 2, investors would see “Ethereum outperforming Bitcoin, and we hear talks of the flippening.”\n\nAlso read: Ethereum Price Stuck In Crucial Range, Here’s What Could Propel It To $2K.\n\nFlippening is the occurrence of Ethereum flipping Bitcoin in market capitalization. As of April 5, the leading cryptocurrencies have a $320 billion gap in market cap, which could be difficult to breach. Moreover, Ethereum’s market dominance reached nearly 20, the largest advance since November 2022."
    }
]