[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LnVzYXRvZGF5LmNvbS9zdG9yeS9zcGVjaWFsL2NvbnRyaWJ1dG9yLWNvbnRlbnQvMjAyMy8wOS8yMi91bnJhdmVsaW5nLXRoZS1lbmlnbWEtaG93LWV0aGVyZXVtLWZ1bmN0aW9ucy83MDkyOTk4NDAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Unraveling the Enigma: How Ethereum Functions - USA TODAY",
        "content": "Jon Stojan\n\nContributor\n\nUnraveling the enigma that is Ethereum might seem like attempting to decode an ancient cipher, but the mystery is not as daunting as it appears. At its core, Ethereum functions as a decentralized platform, a digital soil from which digital contracts and decentralized applications (DApps) grow. To demystify this digital wizardry, let's delve deeper into the mechanisms of Ethereum, its smart contracts, and DApps.\n\nLet's begin our journey by picturing Ethereum as a grand ledger managing transactions and smart contracts. Like Bitcoin, it operates on blockchain technology, where blocks, akin to digital Lego pieces, assemble the chain. Each block contains a list of transactions, with Ethereum's blockchain offering a notable twist: every block also holds the most recent state of each smart contract.\n\nBut what makes a contract \"smart\"? Consider smart contracts as self-executing contracts, eliminating the need for intermediaries. They represent a kind of digital handshake that is only set in code and triggers once the conditions align. Let's visualize this with a rudimentary example: Bob, an online merchant, and Alice, his customer. Alice orders a book from Bob. The smart contract, coded into Ethereum, awaits Bob's confirmation of the shipment. Once confirmed, it automatically transfers Alice's payment to Bob's digital wallet. Thus, trust between strangers is achieved through lines of code.\n\nWith the foundation set, we can now introduce the progeny of these smart contracts: decentralized applications, or DApps. Akin to regular apps on your smartphone, DApps perform specific tasks, such as managing finances or even running virtual worlds. However, they flourish under a democratic, decentralized setup, free from the shackles of a central authority. As the parent, the Ethereum blockchain allows these DApps to interact with its smart contracts, functioning as the backbone for these autonomous entities.\n\nPicture Ethereum as a busy city bustling with activity. Here, DApps are the buildings, each with its own purpose and design. Some might be banks, others stores, or even casinos. These establishments, built atop Ethereum's solid foundation, interact with each other via smart contracts—the city's law. The blockchain acts as the ledger, the town records, if you will, keeping an accurate and tamper-proof log of all transactions, big and small.\n\nAt the heart of all these transactions, Ethereum's native cryptocurrency, Ether, plays a pivotal role. Imagine Ether as the city's currency, playing a role in exchanges and transactions, from purchasing a virtual sword in a gaming DApp to powering a transaction in a financial one. The value of Ether fluctuates, much like the Bitcoin price, and serves as a medium of exchange within the Ethereum ecosystem.\n\nThe beauty of Ethereum lies not only in its technology but also in the democratic spirit that pervades its operations. Its system fosters collaboration and incentivizes every participant, creating an ecosystem where innovation thrives.\n\nIn summary, the Ethereum enigma unwinds itself into a simple yet brilliant concept. It is a decentralized platform powered by smart contracts and Ether, enabling the creation of DApps that revolutionize how we interact and transact in the digital realm. So, the next time you come across the term Ethereum, imagine a thriving digital city, its skyline etched with a plethora of DApps, all functioning seamlessly within the secure and democratic boundaries of its blockchain. In the end, the mystery is just an awe-inspiring vista of technological advancement."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMjIvdml0YWxpay1idXRlcmluLWNuYmMtaW50ZXJ2aWV3LWV0aGVyZXVtLWZvdW5kZXItb24tdXMtY3J5cHRvLWNyYWNrZG93bi5odG1s0gFvaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDkvMjIvdml0YWxpay1idXRlcmluLWNuYmMtaW50ZXJ2aWV3LWV0aGVyZXVtLWZvdW5kZXItb24tdXMtY3J5cHRvLWNyYWNrZG93bi5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Vitalik Buterin, the man behind ethereum, talks crypto and the U.S. crackdown - CNBC",
        "content": "Ethereum co-founder Vitalik Buterin in Prague, where he finds refuge with like-minded programmers looking to change the world through cryptography-powered technology. CNBC\n\nPRAGUE — For Vitalik Buterin, the idea of home is fleeting. The Russia-born coder, who built ethereum in his late teens, doesn't stay long in any one city anymore. Meanwhile, the list of places he won't go keeps growing. \"There's definitely a bunch of countries that I would have very gladly visited three years ago, that I'm much, much more apprehensive about visiting today,\" Buterin told CNBC in an interview in the Czech Republic. Buterin singled out his homeland of Russia as one of the destinations he now avoids. The Canadian emigre has both Ukrainian and Russian roots but has actively supported the resistance movement in Ukraine. It has also become clear that pursuing privacy technologies and open-source code carries risk in certain global jurisdictions, giving Buterin new hesitation — for instance, the creators behind the open-source protocol Tornado Cash face charges in both the Netherlands and the U.S. Tornado Cash is used by some people to protect their privacy in the still-nascent crypto market, but a mixing service can also be used by criminals or nation-states to launder money. Many in the industry worry that targeting the developers who build a tool, instead of just the bad actors using that tool, sets a dangerous precedent. \"Even in countries that the mainstream considers to still be fairly normal places — I definitely worry about those more,\" Buterin says. The decentralized lifestyle suits Buterin, a 29-year-old programmer whose influence in the crypto sector transcends lines of code — or geography. Prague is one new center of gravity where he now finds refuge with like-minded programmers collectively looking to change the world through cryptography-powered technology.\n\nEthereum co-founder Vitalik Buterin speaks at ETHPrague 2023, an international conference drawing crypto developers from around the world. Photo: Pavel Sinagl\n\nWe met in a sparsely furnished room at the top of a sprawling industrial complex in the Holešovice district, a neighborhood once synonymous with slaughterhouses and steam mills, that's now home to Bohemian artists and some of crypto's most rebellious believers. The interior of this deceptively nondescript structure is a honeycomb of labyrinthine corridors and winding staircases that snake into its fortress-like belly, echoing the complexity of crypto to the unfamiliar. Today, the biggest challenge for Buterin and the ethereum community is making sure that it provides actual value to people. \"The way that I see the ethereum ecosystem in general is that the last decade was the decade of kind of playing around and getting ethereum right. This decade is the decade where we have to actually build things that people use,\" Buterin said, hands clasped, as he leaned forward from his perch on an ergonomic-friendly kneeling chair. He is arguably the most influential cryptographic developer alive today, but Buterin wasn't trying to step into the limelight when he wrote the ethereum white paper in 2013. Still, years after shunning public accolades and demurring countless invitations to speak to the press, he can't shake the fame — or the superlatives used to describe him. Buterin was named the world's youngest crypto billionaire at age 27 as the crypto market swelled to its peak in 2021. They call him \"V God\" in China, Time magazine dubbed him crypto royalty in its April 2022 cover story, and he faces mobs of fans desperate for a moment of his attention — and a selfie — virtually anywhere he goes on the planet. But Buterin isn't really any of those things. He isn't the prince of crypto. He isn't a cult leader of new gen cypherpunks. He isn't the wonkiest wonk, or the nerdiest nerd. He regularly gives away his fortune to worthy causes, knocking down his net worth. And he isn't, according to his own estimation, the be-all and end-all authority on the ethereum network. He is, however, someone who cares deeply about realizing his vision of a world where, among other things, humans have equitable access to money no matter who they are or where they live.\n\nZoom In Icon Arrows pointing outwards ETHPrague 2023 was held at Paralelní Polis in the Czech Republic. Pavel Sinagl\n\nButerin finds that cryptocurrencies realize their greatest utility in emerging economies — a phenomenon that has gained momentum in recent years. \"The stuff that we often find a bit basic and boring is exactly the stuff that brings lots of value to them right now, like making payments work, and savings,\" Buterin said, referring to lower-income countries. \"Just being able to plug into the international economy — these are things that they don't have, and these are things that provide huge value for people there,\" Buterin told CNBC. \"It's hard to even be interested in really abstract stuff like decentralized social media, when you don't really have those kinds of basics done.\" As U.S. investigators pressed criminal charges against the likes of Sam Bankman-Fried and federal regulators such as the Securities and Exchange Commission began cracking down on what they called the trade of unregistered securities, the action in crypto began to move overseas. Whereas investors in the U.S. tend to treat crypto as more of a get-rich-quick opportunity and a way to trade on volatility in a less-regulated market than traditional securities, Buterin typically gravitates to developing markets around the world — including Africa, where he traveled in February — where he sees tangible, day-to-day use cases for the technology he helped to build. \"When I visited Argentina back at the end of 2021, lots of people use crypto, lots of people love crypto,\" he said. \"I literally got recognized on the streets of Buenos Aires more often than I got recognized in San Francisco.\" But for crypto to become truly useful on a global scale, Buterin told CNBC, it ultimately has to move out of centralized entities such as custodial trading platforms and it must be simpler to use. \"I found coffee shops without even looking for them that just happened to accept bitcoin and ether — but the problem is, they were all using Binance,\" said Buterin. He said he appreciates centralized exchanges such as Binance for offering a smoother user experience to non-technical people living in countries where the average GDP is less than $10,000 per capita. Nevertheless, he believes that it must become more decentralized. \"Those centralized actors are vulnerable to, you know, both pressure from the outside and to themselves being corrupted,\" he said. Last year, a wave of bankruptcies in the crypto sector exposed grift throughout the industry. A lot of people got rich before the increase in interest rates and subsequent collapse of Luna in May 2022 set off a chain reaction that sent the entire market tumbling down, spurring a crypto winter that persists to this day. Bankman-Fried, the ex-CEO of now-bankrupt crypto exchange FTX, for example, faces criminal charges alleging that he promulgated a multibillion-dollar fraud scheme. Binance, the world's largest crypto exchange by trading volume, is being sued by both the SEC and the Commodity Futures Trading Commission over a raft of accusations, including the assertion that Binance commingled billions of dollars worth of user funds with its own money. Instead of placing blind trust in a central intermediary to act in the best interest of the customer, Buterin said, he believes the ideal solution comes down to writing better code so that users can deal directly on-chain. \"We need the experience on-chain to actually be good for regular people to use,\" Buterin said. \"We need it to actually be possible to do ethereum payments in a way where the transaction fee is less than five cents a transaction; in a way where the experience doesn't suck and randomly fail 2.3% of the time; in such a way that you need a Ph.D. in ethereum sciences to actually figure out what's going on,\" he said.\n\nEthereum co-founder Vitalik Buterin speaks at ETHPrague 2023, an international conference drawing crypto developers from around the world. Photo: Pavel Sinagl\n\nPrivacy and security are also key priorities. \"People need to have wallets that are actually secure, where if they lose the keys, they're not going to lose everything,\" Buterin added. A national digital currency could provide the ease of use he envisions, but he believes that decentralization is also critical, otherwise they'll devolve into another version of the existing banking system — only with more surveillance built in. \"That was a space where I think I had somewhat more hope, probably, naively, five years ago, because there were a lot of people who wanted to do things like make them blockchain friendly, give actual transparency and verifiability guarantees, and some kind of level of actual privacy,\" Buterin said, referring to central bank digital currencies, or CBDCs. CBDCs are a type of blockchain-based virtual currency that is fully regulated and has the backing of a country's central bank. The People's Bank of China, which is arguably the leader in CBDCs thus far, has been piloting its take on a CBDC for almost a decade. As of June, transactions using the digital yuan, or e-yuan, hit nearly $250 billion. But as CBDCs catch on, concerns have been raised about financial surveillance and monitoring tools which can be baked into these government-issued digital currencies. \"As each and every one of those projects come to a certain maturity,\" Buterin said, the privacy-preserving bits \"all sort of fall away as the thing comes closer and closer to being a 1.0. We get systems that are not actually much better than existing payment systems, because they just basically end up being different front-ends for the existing banking system.\" \"They end up being even less private and basically break down all of the existing barriers against both corporations and the government at the same time,\" he said.\n\nBuilding a new, brave world\n\nVitalik's father, Dmitry, introduced him to bitcoin in 2011. Both Vitalik and Dmitry Buterin, a computer scientist who had lived outside Moscow, were intrigued by the idea of a decentralized currency that operated outside the reach of governments or central banks. But Vitalik was keen to advance this new kind of decentralized ledger technology so that it could be put to greater use. What ultimately put him on the map was baking smart contracts — a programmable piece of code that aims to replace middlemen such as banks and lawyers in certain types of business transactions — into the blockchain. It was a game-changing innovation for the sector that led to an explosion of projects and initial coin offerings, or ICOs, built on ethereum. Today, the network serves as the primary building block for all sorts of crypto projects, including non-fungible tokens, or NFTs; decentralized finance, or DeFi; and web3, a still somewhat amorphous buzzword for a third generation of the internet that is decentralized and built using blockchain tech. Meanwhile, ethereum's native token, ether , is the world's second-biggest cryptocurrency by market cap after bitcoin.\n\nEthereum co-founder Vitalik Buterin speaks at ETHPrague 2023, an international conference drawing crypto developers from around the world. Photo: Pavel Sinagl\n\nIn ethereum circles, hackers are known as BUIDLers — an intentional misspelling of the word \"builders\" in a sort of homage to the bitcoin meme HODL, or \"hold on for dear life.\" The meme-off may seem silly, but it gets at the core of what separates these two very different sets of people. Bitcoiners tend to move more slowly on development, prioritizing security and decentralization above all else, while ethereum programmers tend to be more cavalier. While they aren't necessarily breaking things as they go, they do move fast and tinker aggressively. Last year, for example, the ethereum network fundamentally altered the way the blockchain secures its networks and verifies transactions, slashing its energy consumption by more than 99% in the process. Before this upgrade, both the bitcoin and ethereum blockchains had their own vast networks of miners all over the planet running highly specialized computers that crunched math equations in order to validate transactions. Proof-of-work uses a lot of energy, and it is one of the industry's biggest targets for criticism. But with the upgrade, ethereum migrated to a system known as proof-of-stake, which swaps out miners for validators. Instead of running large banks of computers, validators leverage their existing cache of ether as a means to verify transactions and mint new tokens. Buterin insisted that ethereum's move to a proof-of-stake model is more likely to stand up against government intervention. \"Proof-of-stake is actually easier to anonymize and harder to shut down than proof-of-work is,\" he said. \"Proof-of-work requires huge amounts of physical equipment and requires huge amounts of electricity. These are exactly the kinds of things that drug enforcement agencies have decades of experience detecting.\" About the ethereum network, he said, \"On the other hand, you've got your laptop. You just need a VPN somewhere, and you hide it in a corner. It's not perfect, but it's definitely much easier to hide.\"\n\nCoder behind the curtain\n\nIn previous appearances in Denver and Paris, Buterin's stage presence was colored with a subtle unease. But one-on-one in Prague, he really came alive, dropping the tics and effortlessly swapping the role of elusive coder for open-minded educator. His transparent communication style, coupled with his willingness to engage in profound philosophical discussions around concepts such as quadratic funding — a way to crowd-raise a central crypto treasury that is then used to fund public goods projects in ethereum, all with the help of an algorithm designed to optimize spending decisions — and soulbound digital identities on the blockchain have turned him into a trusted thought leader within the crypto community. Notably, Buterin is also very willing to field any question posed to him — especially those that address critiques of the network and of the scope of his leadership position today. Take the example of his own outsized role in the cryptocurrency he created. Unlike the pseudonymous and hidden Satoshi Nakamoto, who created bitcoin, Buterin is very much the face of ethereum. Some see this as a significant point of weakness for the network, because governments could target either Buterin or the Ethereum Foundation. But Buterin rejects those contentions. He said that five years ago a lot more was dependent on him personally and on the foundation, but today, clients — that is, software applications built on top of the blockchain that operate independently — have taken on a lot of the work. Ethereum has become its own self-governing ecosystem, with no single point of failure, he said. \"Even if the foundation got some magic freezing order in every jurisdiction at the same time, and if something happened to me at the same time, there's entire companies that are sole maintainers of ethereum clients that would totally be able to continue,\" explained Buterin. They call it the philosophy of subtraction. \"I think one of the ways of describing its aim is basically that the Ethereum Foundation isn't trying to kind of be a zealot, a long-term operator or dominator, or anything like that,\" he said. \"The goal of the Ethereum Foundation is to foster things that, once they start, can continue in a way that's totally independent.\" In terms of what's next for ethereum, Buterin said a big priority is focusing on privacy and scalability through zero-knowledge rollups. ZK-rollups are transactions bundled into sets and executed off-chain. This layer-two technology plays a major role in future upgrades that will ultimately help to make ethereum faster and cheaper to use. \"There's definitely an extent to which there are diverging interests and there is the extent to which I think the ecosystem does need to find a way to fight hard for the right to continue to build things with the kinds of privacy that we've been used to for thousands of years,\" Buterin said. Clarification: Buterin does not believe he's been targeted by any countries specifically and does not consider himself an outlaw, but is apprehensive about visiting certain countries because of his work."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjIvZXRoZXItdHVybnMtaW5mbGF0aW9uYXJ5LWFzLW5ldHdvcmstcmV2ZW51ZS1wbHVuZ2VzLXRvLTktbW9udGgtbG93L9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjIvZXRoZXItdHVybnMtaW5mbGF0aW9uYXJ5LWFzLW5ldHdvcmstcmV2ZW51ZS1wbHVuZ2VzLXRvLTktbW9udGgtbG93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ether Turns Inflationary as Network Revenue Plunges to 9-Month Low - CoinDesk",
        "content": "Crypto services provider Matrixport reiterated its negative outlook for the crypto asset compared to BTC in a Friday market update, citing “shockingly low revenues” and “lack of buzz” around the next protocol update. The firm forecasted earlier this month that ETH could fall to as low as $1,000 if the trend continues."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2VjbGlwc2Utc29sYW5hLXZpcnR1YWwtbWFjaGluZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Eclipse is using Solana's virtual machine to launch an Ethereum L2 - Blockworks",
        "content": "Eclipse will use Solana’s tech stack for its upcoming mainnet launch, the Ethereum layer-2 network project announced. Eclipse’s mainnet is expected to go live before the end of the year.\n\nBy design, a blockchain stack contains four different layers: execution, settlement, consensus and data availability.\n\nBlockchains, such as Bitcoin, Ethereum and Solana, carry out all these tasks in a single layer. This means that when a transaction is made, the blockchain executes, settles, reaches consensus, and ensures data availability all within the same layer.\n\nModular blockchains, on the other hand, are designed to focus on specific tasks.\n\nNeel Somani, founder of Eclipse, notes that he believes all layer-2s — validiums, optimiums and zk-rollups — should be considered “modular blockchains.”\n\n“At a minimum, they’ve all separated execution from settlement,” he said.\n\nNotably, Eclipse will use Solana Virtual Machine (SVM) for execution on its upcoming mainnet. The execution layer is the blockchain layer that holds the code and rules of a transaction; it enables transaction signing and smart contract execution.\n\nOn Ethereum, for example, transactions are executed sequentially. On Solana, however, there is a parallel execution environment. This means that more transactions can be processed at a lower cost.\n\n“That’s probably the biggest difference,” Somani said. “Another benefit is the ‘local fee markets,’ meaning if one application gets a ton of activity, it doesn’t impact fees for other apps. It is a smaller set of ‘opcodes,’ and it’s register-based which makes [zero-knowledge] proving easier.”\n\nElsewhere, Eclipse will use Risc Zero for proving. Settlement, like most rollups today, will take place on Ethereum — meaning that it will utilize Ethereum’s security properties to validate transactions. Data availability (DA) will be derived from Celestia.\n\nRead More: Why data availability sampling matters for blockchain scaling?\n\nUnlike many rollup solutions today, Celestia’s DA layer utilizes Data Availability Sampling (DAS) over having a Data Availability Committee (DAC), meaning there are fewer trust assumptions.\n\nThat said, the team at Eclipse will continue to keep a close eye on Ethereum’s EIP-4844 upgrade and consider migrating to Ethereum’s DA in the future.\n\n“It’s become clear that the single-threaded EVM is not sufficient to scale Ethereum, which is why apps are turning to their own app-specific rollups,” Somani told Blockworks. “Yet even the most sophisticated designs like Arbitrum are now seeing fee spikes — and it’s all because of the lack of parallelism and local fee markets.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ldGhlcmV1bS1zaGFuZ2hhaS1hY3Rpdml0eS1zbGFtbWVkLXdhbGwtc3RyZWV0LWJhbmsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's Shanghai Upgrade Activity Slammed by Wall Street Ban - CCN.com",
        "content": "Key Takeaways\n\nFor JPMorgan analysts, Ethereum’s behavior following the Shanghai upgrade has been “disappointing.”\n\nA future update may incorporate EIP-4844, according to Ethereum developers.\n\nEIP-4844 seeks to increase Ethereum’s scalability beyond what is possible with Layer 2 solutions.\n\nAccording to a study analysis released on Thursday, September 21, 2023, by JPMorgan (JPM), Ethereum’s Shanghai upgrade, which was introduced in April, does not seem to have increased activity on the biggest smart contract blockchain in the world as many had hoped.\n\nConcerns Over Ethereum’s Network Activity\n\nLead analysts Nikolaos Panigirtzoglou explained that while the energy consumption for the Ethereum network decreased by more than 99% as a result of the Merge upgrade’s switch from proof-of-work (PoW) to proof-of-stake (PoS), the Ether supply is decreasing, and staking increased significantly, the increase in network activity has been disappointing.\n\nAccording to JPM, following the Shanghai upgrade, daily Ethereum transactions have dropped by 12%, daily active addresses have decreased by over 20%, and the total value locked (TVL) in decentralized finance (DeFi) on the blockchain has fallen by approximately 8%.\n\nThe decline in network activity suggests that various “bearish forces” from the previous year, such as the Terra and FTX setbacks, the regulatory crackdown in the United States, and a contracting stablecoin market, may have offset the benefits of the Shanghai upgrade, the bank added.\n\nDespite a 50% increase in staking since the Shanghai update, which bolsters network security, the “prevalence of liquid staking protocols like Lido remains uncomfortably high, raising concerns about centralization,” the bank noted.\n\nThe Merge, which involved switching from a more energy-intensive PoW to the PoS consensus process, happened in September 2022.\n\nThe Shanghai upgrade, implemented in April of this year, enabled the withdrawal of staked ether (stETH). DeFi encompasses a wide range of blockchain-based financial activities, including lending, trading, and other transactions. The total value of digital assets deposited in a DeFi protocol is referred to as TVL.\n\nEIP-4844 Upgrade For Ethereum\n\nThe article suggested that the impending EIP-4844 upgrade, also known as Protodanksharding , holds the potential for a significant uptick in Ethereum network activity. However, it cautioned that “continuing bearish crypto forces remain a headwind.”\n\nWith the EIP-4844 upgrade or protodanksharding, the cryptocurrency sector is now anticipating for a significant rise in Ethereum network activity. According to the experts, “continued bearish crypto forces remain a headwind,” nonetheless.\n\nIn order to fully execute danksharding, which differs from the initially anticipated sharding method, protodanksharding is a necessary first step. Danksharding introduces data-containing blobs—temporary data packets linked to blocks that can hold more data than the blocks themselves—instead of slicing the Ethereum blockchain into numerous shard chains.\n\nLayer 2 networks like Arbitrum and Optimism, which bundle transactions before sending them to the main chain, could gain from this. While the data blobs won’t alter Ethereum block sizes, they’ll provide extra temporary data space for Layer 2 rollups, potentially enhancing network speed and reducing transaction costs.\n\nCurrently planned for the fourth quarter of this year, protodanksharding might now happen in the first quarter of 2024."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1wbHVuZ2VzLTE1NjUv0gFFaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXBsdW5nZXMtMTU2NS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Plunges After Rejection, Are Bears Back In Action? - NewsBTC",
        "content": "Ethereum price gained bearish momentum below $1,620 against the US Dollar. ETH is showing bearish signs and might decline further toward $1,540.\n\nEthereum declined further below the $1,600 support zone.\n\nThe price is trading below $1,620 and the 100-hourly Simple Moving Average.\n\nThere are two bearish trend lines forming with resistance near $1,600 and $1,620 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to move down and test the $1,540 support in the short term.\n\nEthereum Price Takes Hit\n\nEthereum’s price started a fresh decline from the $1,660 and $1,670 resistance levels. ETH declined below the $1,620 support level to enter a bearish zone and underperformed Bitcoin.\n\nThe bears even pushed the price below the $1,600 support and the 100-hourly Simple Moving Average. A low is formed near $1,568 and the price is now attempting a recovery wave. There was a move above the $1,580 level. The price is testing the 23.6% Fib retracement level of the recent decline from the $1,660 swing high to the $1,568 low.\n\nEther is now trading below $1,620 and the 100-hourly Simple Moving Average. There are also two bearish trend lines forming with resistance near $1,600 and $1,620 on the hourly chart of ETH/USD.\n\nOn the upside, the price might face resistance near the $1,600 level and the first trend line. The next resistance is near the $1,610 level, the second trend line, and the 100-hourly Simple Moving Average. The trend line is also near the 50% Fib retracement level of the recent decline from the $1,660 swing high to the $1,568 low.\n\nSource: ETHUSD on TradingView.com\n\nA close above the $1,620 resistance might send the price toward the $1,650 resistance. The next major barrier is near the $1,660 level. A close above the $1,660 level might send Ethereum further higher toward $1,750.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,620 resistance, it could start another decline. Initial support on the downside is near the $1,565 level.\n\nThe next key support is $1,540. A downside break below $1,540 might accelerate losses. In the stated case, there could be a drop toward the $1,440 level in the coming days.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,540\n\nMajor Resistance Level – $1,620\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL2lzLWV0aGVyZXVtLWRlYWQtYWxsLXBvdGVudGlhbC1iZWFyaXNoLXNjZW5hcmlvcy1jb3ZlcmVkL9IBWGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL2lzLWV0aGVyZXVtLWRlYWQtYWxsLXBvdGVudGlhbC1iZWFyaXNoLXNjZW5hcmlvcy1jb3ZlcmVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Is Ethereum Dead? All Potential Bearish Scenarios Covered - AMBCrypto Blog",
        "content": "The cryptocurrency market remains a tumultuous terrain for investors, with the fluctuating values of digital assets like Ethereum causing a stir. Amidst the volatility, a recurrent question echoes through the industry: Is Ethereum dead in 2023?\n\nThis article explores this concern, assessing Ethereum’s potential for long-term growth and the challenges it faces.\n\nUnderstanding Ethereum\n\nEthereum, a decentralized blockchain platform, was proposed in 2013 by Vitalik Buterin and officially launched in 2015. It brought to the forefront the concept of a programmable blockchain, enabling developers to build applications on its infrastructure.\n\nDespite being a leading player in the crypto industry, Ethereum is currently grappling with market difficulties and global economic policies, leading some to question its future.\n\nIs Ethereum dead?\n\nEthereum is the second-largest blockchain platform by market capitalization, and it has been the driving force behind the decentralized finance (DeFi) and non-fungible token (NFT) revolutions. However, in recent months, Ethereum has faced a number of challenges, including high gas fees, scalability issues, and competition from other blockchain platforms.\n\nSome people believe that these challenges are insurmountable and that Ethereum is on the decline. Others believe that Ethereum is still the best blockchain platform and that it will eventually overcome its challenges.\n\nHere are some reasons why people may think that Ethereum is dead:\n\nEthereum has high gas fees, which can make it expensive to use.\n\nEthereum is not very scalable, which means that it can be slow and expensive to process transactions during peak times.\n\nEthereum faces competition from other blockchain platforms, such as Solana, Avalanche, and Cardano.\n\nSo, is Ethereum dead? It’s too early to say. Ethereum is facing some challenges, but it is still the second-largest blockchain platform and has a large and active community. Ethereum is also undergoing a number of upgrades that could address its current challenges. However, it is important to note that Ethereum faces competition from other blockchain platforms, and it is possible that one of these platforms could eventually overtake Ethereum.\n\nUltimately, whether or not Ethereum is dead will depend on a number of factors, including the success of its upgrades, the adoption of other blockchain platforms, and the overall state of the cryptocurrency market.\n\nAre you wondering if cryptocurrency mining is dead after 2023? Find out the truth in our guide.\n\nEthereum’s rise and current situation\n\nEthereum has carved a niche for itself in the crypto landscape, especially with its transformative potential and innovative prowess. However, evaluating Ethereum’s current situation requires a nuanced understanding of its potential for long-term growth, innovation, and contribution to the crypto world.\n\nExperts maintain a positive outlook for Ethereum’s prospects due to its robust developer community, diverse applications, and potential long-term growth. However, investing in established cryptocurrencies like Ethereum provides diversification opportunities while mitigating risks and offering unique technology benefits. These go on to prove that Ethereum is not dead.\n\nPotential bearish scenarios in the Ethereum trading landscape\n\nHere are a few potential bearish trends that may have impacted the Ethereum trading landscape. These scenarios might have made traders believe that Ethereum is dead. Take a look:\n\n1. Market cycles and crypto winter\n\nThe cryptocurrency market cycle, like the stock market, follows four stages: accumulation, markup, distribution, and markdown. Crypto winter, a period characterized by bearish market conditions, can be attributed to factors such as regulatory ambiguity, diminishing institutional interest, and market saturation. Ethereum is currently experiencing a downtrend in the market cycle, leading to a decrease in its value.\n\n2. Global economic policies and their impact\n\nThe Federal Reserve’s policies can significantly impact the price of cryptocurrencies, including Ethereum. Initial FED meetings in 2023 led to a considerable decline in prominent coins, including Ethereum. In the current economic climate, it’s advised for investors to steer clear of meme currencies and focus on more established cryptocurrencies like Ethereum.\n\nFind out what is Ethereum 2.0 and explore how it works in our comprehensive guide.\n\n3. Mainstream adoption challenges\n\nEthereum’s adoption faces significant hurdles, such as high gas fees and scalability issues, which limit the platform’s appeal to small investors and app developers. Despite these challenges, Ethereum’s decentralized nature offers several benefits, such as preserving the state of the blockchain and preventing censorship.\n\n4. Ethereum loses its market share to other blockchain platforms\n\nEthereum is currently the leading blockchain platform for DeFi and NFTs. However, there are a number of other blockchain platforms that are emerging, such as Solana, Avalanche, and Cardano. These platforms offer a number of advantages over Ethereum, such as lower gas fees and higher scalability. If Ethereum loses its market share to these other platforms, it could lead to a decline in its price.\n\nLooking to know more about the mysterious demise of some cryptocurrency billionaires? We have got you covered!\n\nThe future of Ethereum\n\nEthereum 2.0 is an ambitious upgrade that aims to address current challenges and revolutionize the Ethereum network. With the rise of NFTs and the metaverse, Ethereum is at the forefront of digital innovation, further solidifying its position as a valuable player in the crypto world.\n\nEthereum after the Merge\n\nAfter years of delays, Ethereum Merge finally went live in September 2022, clearing the path for more technical improvements and greater adoption. Ethereum 2.0, a much-anticipated set of upgrades, aims to improve transaction speed, reduce gas fees, and enhance scalability.\n\nThe rise of NFTs and Metaverse\n\nNFTs are unique digital assets that cannot be replaced or exchanged on a one-to-one basis, while metaverses are virtual worlds built on blockchain technology used for gaming, art, and various other activities. The emergence of NFTs and the metaverse has had a positive impact on Ethereum’s value.\n\nDecentralized applications (dApps)\n\ndApps are powered by blockchain technology and smart contracts, bypassing intermediaries and offering users increased control over their data and the potential to create new business models.\n\nHere’s everything you need to know about Ethereum 2.0 and its use cases. Take a thorough look.\n\nFrequently asked questions\n\nWe have addressed a few questions that traders have been wondering about. Take a look:\n\nQ: Does ETH still have a future?\n\nA: Although Ethereum (ETH) has had some ups and downs, it is not dead. However, its current market indicators remain bullish long term. This suggests that it still has a strong future ahead.\n\nQ: Will Ethereum ever go back up?\n\nA: Analysis of the Ethereum market trends and historical data shows that ETH is likely to experience a steady appreciation in value.\n\nQ: Is it still safe to invest in Ethereum?\n\nA: Given the current market trends and potential risks ahead, Ethereum remains a volatile and potentially risky investment.\n\nConclusion\n\nIn conclusion, the rumors of Ethereum being dead are greatly exaggerated. Despite current challenges, Ethereum’s future looks promising, with its post-merge roadmap, the rise of NFTs and the metaverse, and the growing world of decentralized economy. We have also covered all bullish scenarios for Cardano too, in another blog that you might find interesting. Do check it out."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0taGFzLWJlZW4tZGlzYXBwb2ludGluZy1zaW5jZS1zaGFuZ2hhaS1qcG1vcmdhbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Has Been Disappointing Since Shanghai: JPMorgan - Watcher Guru",
        "content": "Ethereum has fallen short of expectations in terms of network activity following the much-anticipated Shanghai upgrade implemented in April. While the crypto community had high hopes for this upgrade, it appears that the results have left many disappointed, according to JPMorgan.\n\nJUST IN: JPMorgan says Ethereum has been disappointing since its Shanghai upgrade. — Watcher.Guru (@WatcherGuru) September 22, 2023\n\nNetwork Activity Declines Despite Energy Efficiency\n\nThe transition from proof-of-work to proof-of-stake, known as the Merge , was expected to revolutionize Ethereum. The upgrade was aimed at drastically reducing its energy consumption. In fact, it succeeded in reducing energy usage by over 99%. However, despite this remarkable achievement, the Ethereum network has not seen the surge in activity that was anticipated.\n\nAlso read: US Government Indicts Senator Bob Menendez For Bribery\n\nJPMorgan analysts, led by Nikolaos Panigirtzoglou, expressed their concerns in a recent note. They pointed out that while Ethereum’s energy consumption plummeted, the supply of Ethereum was shrinking. Additionally, staking had risen significantly, with a 50% increase since the Shanghai upgrade. Surprisingly, these positive developments did not translate into increased network activity.\n\nEthereum’s vital metrics, including daily transactions, daily active addresses, and the total value locked (TVL) in decentralized finance (DeFi) protocols, have all experienced declines. These numbers are crucial indicators of the network’s health and adoption, and their downward trend is a cause for concern.\n\nJPMorgan’s analysts attribute Ethereum’s lackluster performance to a combination of “bearish forces” that have plagued the cryptocurrency ecosystem over the past year. These include the collapses of platforms like FTX and Terra, the uncertainty surrounding U.S. regulatory measures and crackdowns, waning interest in crypto among institutional investors, and a drying up of venture capital funding."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtcy1kZW5jdW4tdXBncmFkZS1saWtlbHktZGVsYXllZC1pbnRvLTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ethereum's 'Dencun' upgrade likely delayed into 2024 - CryptoSlate",
        "content": "Ethereum’s next major upgrade, Dencun, will likely see a delayed launch according to statements from developers during a meeting on Sept. 21.\n\nThough Dencun is largely complete, it is still under development and in need of testing. Tim Beiko, a member of the Ethereum Foundation, said that Dencun still must be deployed to a testnet. He added that the timing of this step could delay Cancun’s launch on the Ethereum mainnet — where real transactions occur — into the new year.\n\nBeiko said during the meeting:\n\n“I think the implication is, if we don’t do a test net before Devconnect [Nov. 13-18] … it’s probably unlikely we can do mainnet before the … Christmas holidays … and people being gone so that’s probably not the best time for committment.”\n\nDevelopers previously did not give Dencun a definite date, but most previous estimates suggested that the upgrade would go live before the end of 2023.\n\nDevs consider target testnet\n\nNews of a possible Dencun delay comes shortly after Ethereum’s Holesky testnet experienced launch issues. Holesky continues to wait for a relaunch.\n\nDuring the current meeting, Developers addressed whether the Holesky testnet will be available for Dencun testing prior to Devconnect in November. Ethereum Foundation member Parithosh Jayanthi said that Holesky’s relaunch is set to take place on Sept. 28 and will be ready for Dencun testing before the upcoming conference.\n\nJayanthi nevertheless suggested testing Dencun’s first fork on an older testnet, Goerli, which will soon be discontinued. He noted that the end of Goerli’s lifespan means that any issues related to Dencun will be isolated to that testnet.\n\nJayanthi additionally suggested that Dencun’s second and third forks could be tested on the new Holesky testnet at a later date. “If [Dencun] goes badly on Holesky, then we have to figure out how to save it,” Jayanthi concluded.\n\nDencun will combine two upgrades, Deneb and Cancun, and will bring various new features. The most notable of those features is proto-danksharding, which will improve Ethereum’s scalability when finally arrives on mainnet."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLXNlcHRlbWJlci0yMtIBQGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLXNlcHRlbWJlci0yMj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for September 22 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe rates of most of the coins are rising; however, there are some exceptions to this rule.\n\nAdvertisement\n\nTop coins by CoinStats\n\nETH/USD\n\nThe rate of Ethereum (ETH) has risen by 0.73% over the previous 24 hours.\n\nImage by TradingView\n\nOn the hourly time frame, the rate of Ethereum (ETH) is approaching the resistance level of $1,601. If the rise continues and the daily bar closes near that mark, the accumulated energy might be enough for growth to the $1,620 area soon.\n\nImage by TradingView\n\nA different picture can be seen on the daily chart as today's slight rise has not affected the technical position of ETH. If bulls want to get back in the game, they need to fix the rate above the zone of $1,660.\n\nOnly in that case is a midterm rise possible.\n\nImage by TradingView\n\nA bearish situation remains more relevant on the weekly time frame. If the bar candle closes below the $1,600 zone, traders are likely to expect a support breakout, followed by a further drop to the $1,500 range soon.\n\nEthereum is trading at $1,597 at press time."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvZmlyc3QtZXRoZXJldW0tZnV0dXJlcy1ldGYtZXhwZWN0aW5nLWFwcHJvdmFsLWJ5LW9jdG9iZXItMi0yMDIzMDkyMjA3NDDSAXpodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9maXJzdC1ldGhlcmV1bS1mdXR1cmVzLWV0Zi1leHBlY3RpbmctYXBwcm92YWwtYnktb2N0b2Jlci0yLTIwMjMwOTIyMDc0MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "First Ethereum futures ETF expecting approval by October 2 - FXStreet",
        "content": "Share:\n\nHal Press of North Rock Digital says that the first Ethereum futures ETF will be approved on October 2.\n\nThe crypto hedge fund founder believes Valkyrie’s combined product will be the first ETH futures ETF product to market.\n\nEthereum price declined 2.33% over the past week as the altcoin trades sideways below $1,600.\n\nThe first Ethereum futures ETF (exchange-traded fund) is likely to be approved on October 2, according to crypto hedge funder Hal Press. The North Rock Digital founder’s thesis is based on the recent events in the crypto ecosystem.\n\nThe Valkyrie Bitcoin Strategy and Ether Strategy ETFs are awaiting approval from the Securities & Exchange Commission (SEC), with a deadline of October 3, 2023. Press believes this could be the first Ethereum Futures ETF to win the SEC’s approval.\n\nThe approval of a Bitcoin futures ETF in October 2021 had fueled bullish sentiment among market participants and acted as a catalyst for BTC’s price rally to a peak of $66,900. Traders have similar expectations from the approval of an Ethereum futures ETF, therefore, the date of approval is key to identify the trend in ETH price.\n\nAlso read: BASE chain likely to issue tokens in the future, Coinbase CLO Paul Grewal waits for regulatory clarity\n\nEthereum futures ETF approval likely to come in at the earliest\n\nHal Press expects the news of an Ethereum futures ETF approval as early as October 2, ahead of the deadline of Valkyrie’s combined ETF product application. Press explains that it is possible that some news comes out earlier, but the latest possible date to watch for the approval of this investment product is in October 2’s post-market.\n\nThe following table shows deadlines for approval of different ETF applications:\n\nETF application status and SEC date\n\nCrypto investment giant Grayscale is the latest to file for an Ethereum futures ETF with the SEC. Earlier this week on September 19, Grayscale proposed listing and trading shares of the Grayscale Ethereum Futures Trust ETF under the New York Stock Exchange Arca Rule 8.200-E.\n\nAn approval of the Ethereum futures ETF could open the floodgates to similar investment products and usher in a bullish sentiment among ETH holders and traders.\n\nAt the time of writing, Ethereum price is ranging below $1,600 at $1,589 on Binance. Over the past week, ETH yielded a 2.33% loss for Ethereum holders."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8yMy9pcy1ldGhlcmV1bS1ib3R0b20taW4tdG9wLWFuYWx5c3QtcmV2ZWFscy10aGUtbm8tcXVlc3Rpb25zLWFza2VkLWxldmVsLWhlLXdpbGwtc3RhcnQtcmVhY2N1bXVsYXRpbmctZXRoL9IBjQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8yMy9pcy1ldGhlcmV1bS1ib3R0b20taW4tdG9wLWFuYWx5c3QtcmV2ZWFscy10aGUtbm8tcXVlc3Rpb25zLWFza2VkLWxldmVsLWhlLXdpbGwtc3RhcnQtcmVhY2N1bXVsYXRpbmctZXRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Is Ethereum Bottom In? Top Analyst Reveals the ‘No Questions Asked’ Level He Will Start Reaccumulating ETH - The Daily Hodl",
        "content": "A top crypto analyst is detailing his outlook on Ethereum (ETH) amid tepid price movements in the crypto market.\n\nIn a new video, pseudonymous analyst Bluntz says that Ethereum is likely witnessing the final stage of a corrective move while trading within an ascending triangle pattern.\n\nAccording to the analyst, Ethereum could print a bullish higher low setup to cap off the correction before breaking out and rallying to a fresh all-time high.\n\n“If ETH did pop down to one more new low and wicked that level at $1,430, $1,440, I would definitely, no questions asked, be looking to buy for some longer-term bags because overall I do still think that the major bottom is in and this is probably some kind of accumulation period here [between roughly $1,400 to $2,000] and then that would then would be buying the bottom of the range.\n\nOn this next leg down, I’d be positioning myself to take longs to potentially new all-time highs.”\n\nOn the likely price action of Ethereum over the short term, the pseudonymous crypto analyst and trader says,\n\n“Right now I think probably we’re probably still in chop here. I do think we’re probably going to go sideways for a bit longer and then break down to a new low [at around $1,430].”\n\nEthereum is trading at $1,595 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjIvZXRoZXJldW1zLXNoYW5naGFpLXVwZ3JhZGUtaGFzLWZhaWxlZC10by1ib29zdC1uZXR3b3JrLWFjdGl2aXR5LWpwbW9yZ2FuLXNheXMv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOS8yMi9ldGhlcmV1bXMtc2hhbmdoYWktdXBncmFkZS1oYXMtZmFpbGVkLXRvLWJvb3N0LW5ldHdvcmstYWN0aXZpdHktanBtb3JnYW4tc2F5cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum’s Shanghai Upgrade Has Been ‘Disappointing,’ JPMorgan Says - CoinDesk",
        "content": "“While the shift from proof-of-work (PoW) to proof-of-stake (PoS) that resulted from the Merge upgrade meant that the energy consumption for the Ethereum network collapsed by more than 99%, the ether supply is shrinking and staking rose sharply, the increase in network activity has been rather disappointing,” analysts led by Nikolaos Panigirtzoglou wrote."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL21hdGljLWFuYWx5c2lzL2NlbG8tY29uc2lkZXJzLXRyYW5zaXRpb25pbmctdG8tZXRoZXJldW0tbGF5ZXItMi13aXRoLXBvbHlnb24tY2hhaW4v0gF4aHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvbWF0aWMtYW5hbHlzaXMvY2Vsby1jb25zaWRlcnMtdHJhbnNpdGlvbmluZy10by1ldGhlcmV1bS1sYXllci0yLXdpdGgtcG9seWdvbi1jaGFpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Celo Considers Transitioning To Ethereum Layer-2 With Polygon Chain - NewsBTC",
        "content": "Celo, a blockchain platform, is exploring migrating from its standalone blockchain to an Ethereum (ETH) Layer-2 (L2) network. Originally, Celo had planned to utilize Optimism’s OP Stack, a customizable toolkit similar to Polygon (MATIC) but based on Optimism’s technology.\n\nHowever, Sandeep Nailwal, co-founder of Polygon Labs, has proposed an alternative solution to the Celo community. Nailwal suggests leveraging Polygon’s Chain Development Kit (CDK), an open-source toolset that enables the creation of customizable Layer-2 chains powered by zero-knowledge (ZK) technology.\n\nCelo’s Potential Move To Ethereum Layer-2 Via Polygon\n\nIn a recent blog post, Polygon Labs suggested Celo could consider deploying an Ethereum Layer-2 solution using Polygon CDK.\n\nAccording to Polygon Labs co-founder Nailwal, this strategy would allow Celo to leverage the benefits of being an Ethereum Layer-2 platform while preserving the characteristics that have contributed to its success.\n\nThe proposal emphasizes several key advantages of adopting Polygon CDK. Firstly, it enables cross-community collaboration by integrating with an ecosystem of Layer-2 solutions powered by zero-knowledge technology.\n\nPolygon CDK enhances compatibility with Ethereum by providing an environment equivalent to the Ethereum Virtual Machine (EVM). This alignment ensures a seamless transition for Celo, closely matching Ethereum’s technical infrastructure and tooling.\n\nFurthermore, according to Nailwal, deploying with the protocol’s CDK offers increased security for Celo. It allows Celo to leverage Ethereum’s proven consensus layer while incorporating the security benefits of zero-knowledge proofs.\n\nRegarding fees and scalability, Celo can benefit from low fees by utilizing the zkEVM validium architecture and off-chain data availability supported by Polygon CDK. These features contribute to cost-efficient transactions while enabling scalability for Celo’s network.\n\nMoreover, according to Nailwal, Celo gains access to a unified Layer-2 economy by becoming a part of the Polygon ecosystem by combining Ethereum’s mainnet with Polygon’s ecosystem. This integration creates a seamless experience for developers and users, facilitating interaction with both networks.\n\nFast Transactions And Lower Fees?\n\nWith zero-knowledge technology, Celo users can enjoy near-instant withdrawals, faster finality times, and instant cross-chain interactivity.\n\nAccording to the blog post, these features enhance the speed, efficiency, and security of transactions, ultimately improving the user experience.\n\nThrough Polygon CDK, chains can achieve near-instant cross-chain interactivity with Ethereum, leveraging the power of ZK proofs to establish a secure and interconnected network.\n\nOverall, the proposed migration to Polygon CDK represents an opportunity for Celo to transition to an Ethereum Layer-2 solution while harnessing the advantages offered by Polygon’s ZK-powered technology. The proposal aims to initiate discussions between the Celo and Polygon communities to explore the potential benefits for all stakeholders involved.\n\nIt is important to note that no final decision has been made at this stage, and the proposal signifies the beginning of discussions between the Celo and Polygon communities.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzIyL3doYWxlcy1tb3ZlLW92ZXItNjYwMDAwMDAwLWluLWJpdGNvaW4tZXRoZXJldW0tYW5kLWNoYWlubGluay1oZXJlcy13aGVyZS10aGUtY3J5cHRvcy1oZWFkZWQv0gGBAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzIyL3doYWxlcy1tb3ZlLW92ZXItNjYwMDAwMDAwLWluLWJpdGNvaW4tZXRoZXJldW0tYW5kLWNoYWlubGluay1oZXJlcy13aGVyZS10aGUtY3J5cHRvcy1oZWFkZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Whales Move Over $660,000,000 in Bitcoin, Ethereum and Chainlink – Here’s Where the Crypto’s Headed - The Daily Hodl",
        "content": "Deep-pocketed crypto investors are moving hundreds of millions of dollars worth of digital assets as Bitcoin (BTC) dips below $27,000.\n\nNew data from whale-surveying platform Whale Alert shows that high-net-worth traders have abruptly moved over $660 million worth of Bitcoin, Ethereum (ETH), and Chainlink (LINK).\n\nNine of the 14 transactions moved digital assets to exchanges Binance, Coinbase, Gate.io and OKX.\n\nThe combined $426.9 million worth of BTC transactions on Whale Alert’s radar include:\n\nBitcoin is trading for $26,559 at time of writing, down 1.6% during the last 24 hours.\n\nMoving on to smart contract platform Ethereum, Whale Alert finds about $191.1 million worth of ETH transactions, including:\n\nEthereum is trading for $1,588 at time of writing, down 2.1% during the last day.\n\nLastly, Whale Alert notices two large transactions of decentralized oracle network Chainlink:\n\nChainlink is trading for $6.69 at time of writing, down 3.4% during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0td2hhbGUtOC0xLW1pbGxpb24tb2YtZXRoLWJpbmFuY2UtYnV5cy1uZnRzL9IBXmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0td2hhbGUtOC0xLW1pbGxpb24tb2YtZXRoLWJpbmFuY2UtYnV5cy1uZnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Whale Unfazed By Prices, Pulls $8.1 Million Of ETH From Binance And Buys NFTs - NewsBTC",
        "content": "Ethereum is under pressure and has just dropped below $1,600. However, on-chain data shows that a crypto whale, “0xb154”, has moved more coins from Binance, a cryptocurrency exchange, to a non-custodial wallet.\n\nOn September 21, the ETH whale transferred over $8.1 million of the coin.\n\nWhale Moves More Ethereum From Binance, Buying NFTs\n\nWhen crypto prices contract, outflows from non-custodial wallets to centralized ramps, including Binance and Coinbase, tend to rise. This is because centralized exchanges supporting stablecoins or fiat, including the Euro or JPY, offer an interface where they can easily swap for the “safety” of the less volatile fiat currencies or tokens designed to mirror them, including USDT.\n\nThat the holder is shifting tokens away from Binance regardless of the heightened volatility can signal confidence for ETH and the broader Ethereum ecosystem. It is not immediately clear what could have motivated the whale to move coins away from the exchange at this point.\n\nHowever, what’s evident is that ETH is down roughly 4% from September 21’s peak and moving further away from April 2023 highs when it rose to over $2,100.\n\nRecords show this is not the first time the whale moved funds. On September 6, the investor withdrew 9,688 ETH worth $15.8 million from Binance. Less than two weeks earlier, the whale notably transferred 22,340 ETH, worth $41.2 million, to Binance.\n\nA closer examination of the same address shows it has 24,556.59 ETH worth over $38.8 million at spot rates. Besides ETH, the address controls dust amounts of other periphery altcoins, including ZUM and SWISE.\n\nApart from simply HODLing ETH, the whale has also been active on the non-fungible token (NFT) scene, looking at historical purchases. Over time, the investor has held over 100 NFTs where, on average, spent 0.2641 ETH; the latest purchase was on September 21.\n\nThe investor has been actively accumulating NFTs since early April 2023 and has spent over 35 ETH.\n\nETH And NFTs Are Fragile\n\nThe whale has accumulated more ETH and NFTs when the crypto market is fragile. To illustrate, NFT trading volume is over 90% down from 2021 peaks.\n\nPresently, ETH prices are down 25% from April 2023 peaks. When writing, bears have successfully forced the coin below June 2023 lows as the coin moves further away from the psychological $2,000 level. Candlestick arrangement points to weakness, suggesting that ETH could dump even lower to $1,400—or March 2023 lows, if sellers press on.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1kZW5jdW4tZGF0ZS1taWdodC1iZS1wb3N0cG9uZWQtdW50aWwtbmV4dC15ZWFyLWhlcmVzLXdoedIBVWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1kZW5jdW4tZGF0ZS1taWdodC1iZS1wb3N0cG9uZWQtdW50aWwtbmV4dC15ZWFyLWhlcmVzLXdoeT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Dencun Date Might Be Postponed Until Next Year, Here's Why - U.Today",
        "content": "Advertisement\n\nEthereum Dencun, a hotly anticipated upgrade for the second largest blockchain, might be activated in 2024. The upcoming testing mechanism, Devnet-9, will include two new Ethereum Improvement Proposals (EIPs).\n\nEthereum Dencun mainnet activation might be delayed\n\nTim Beiko, chair of the ACDE calls, supposes that the Ethereum Cancun-Deneb (DenCun) upgrade might not be activated in 2023. If developers do not foresee launching Dencun on public testnet before Devconnect in November 2023, the update most likely would be activated in 2024.\n\n🚨 According to an Ethereum core developer, the activation of the Dencun mainnet may be delayed and might not occur this year as originally planned, citing the impact of the failed Holesky testnet launch. pic.twitter.com/PSe8o2PQnp — Camel_global (@Camel_global) September 22, 2023\n\nPreviously, Beiko had recommended activating Dencun upgrade on the following testnets in the following order: Holesky, Goerli and then, Sepolia.\n\nNext Wednesday, on Sept. 27, 2023, Ethereum (ETH) developers are going to launch Devnet-9, a crucial testbed for Q4, 2023, enhancements to Ethereum's (ETH) consensus design.\n\nParithosh Jayanthi, a DevOps Engineer at Ethereum Foundation, said that the consensus team is almost ready to launch Devnet-9. The new network might go live even without all clients being ready, Jayanthi stressed:\n\nWe can still start the devnet as long as we have at least a couple of clients ready and we can add the rest post [launch].\n\nAs covered by U.Today previously, Ethereum Dencun is the most anticipated upgrade in 2023. It includes the EIP 4844 and EIP 4788 upgrades crucial for the scaling and privacy of Ethereum (ETH) dApps.\n\nDevs give Holesky testnet second try\n\nAlso, Ethereum (ETH) developers discussed the activation of Holesky, a consensus testnet that is designed to replace Goerli. As the first launch of Holesky failed, developers are going to relaunch it on Sept. 28, 2023.\n\nOn Sept. 15, 2023, Holesky collapsed due to the misconfigiration and some other minor bugs.\n\nEthereum (ETH) core developers have been discussing the Dencun upgrade since April 2023. It is set to lay the ground work for the switch to the sharded design of the largest smart contracts platform."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9iaXRjb2luLXByaWNlLWV0aGVyZXVtLXByZWRpY3Rpb24tbWluaW1hbC0xLWZsdWN0dWF0aW9ucy1vZmZlci10cmFkaW5nLWluc2lnaHRzLWZvci1idGMtZXRoLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Price and Ethereum Prediction: Minimal 1% Fluctuations Offer Trading Insights for BTC and ETH - Cryptonews",
        "content": "Bitcoin Price and Ethereum Prediction: Minimal 1% Fluctuations Offer Trading Insights for BTC and ETH\n\nBitcoin and Ethereum, two paramount forces in the cryptocurrency realm, are currently experiencing minimal fluctuations of around 1%. They are trading near $26,500 and $1,600, respectively, with an intriguing neutrality, potentially influenced by a tempered trading volume.\n\nSuch a tight trading range can often serve as a harbinger for a breakout, and as investors eagerly scrutinize each shift, it becomes paramount to understand the underlying sentiments.\n\nAt the same time, the Fear & Greed Index remains neutral, suggesting indecision among investors. This could be one of the reasons behind the neutral trading bias in the cryptocurrency market.\n\nLet’s now dive into the technical aspects of the BTC/USD and ETH/USD pairs.\n\nBitcoin Price\n\nAs of the latest update, Bitcoin is priced at $26,557, boasting a 24-hour trading volume of $10 billion. Reflecting a modest decline, the digital asset has depreciated by 0.31% over the past day.\n\nIt retains its premier position on CoinMarketCap, supported by a live market capitalization of approximately $517.69 billion.\n\nThe available circulating supply registers at 19,493,312 BTC coins, approaching its predefined maximum of 21,000,000 BTC coins\n\nBitcoin Price Prediction\n\nFrom a technical perspective, Bitcoin demonstrates increased market sensitivity, recently surpassing the critical support level pegged at $26,600.\n\nThis benchmark previously acted as a resistance point. However, consistent confirmations, most notably on the 4-hour chart, have elevated its significance as a robust support zone for the cryptocurrency.\n\nFollowing its descent below the $26,650 mark, Bitcoin seems to gravitate towards an immediate support level of $26,300.\n\nAs evidenced on the 4-hour chart, the cryptocurrency now positions itself beneath the 50-day exponential moving average and has deviated from its prior ascending trajectory.\n\nBitcoin Price Chart – Source: Tradingview\n\nShould this downward trend continue, Bitcoin’s next target could potentially be the $25,511 mark.\n\nConversely, overcoming the $27,000 threshold might set Bitcoin on a trajectory towards $27,500.\n\nThis $27,000 juncture, underscored by the 50-day average, is a decisive pivot point dictating Bitcoin’s forthcoming market direction.\n\nEthereum Price\n\nEthereum is currently trading for $1,593, accompanied by a 24-hour trading volume of $3 billion. The cryptocurrency has seen a marginal appreciation of just under 0.10% over the preceding 24 hours.\n\nEthereum maintains its position as the second-ranked asset on CoinMarketCap, boasting a live market capitalization of $191 million.\n\nThere’s a circulating supply of 120,227,075 ETH coins, with its maximum supply data undisclosed.\n\nEthereum Price Prediction\n\nThe ETH/USD pair exhibits a turbulent trading pattern, encountering immediate resistance at $1,600 and support near the $1,575 mark.\n\nA breakout from this defined range could catalyse subsequent price movements.\n\nShould ETH successfully breach the $1,600 threshold, ensuing resistance may be anticipated around $1,625, with a more formidable barrier emerging near the double-top pattern of approximately $1,660.\n\nBitcoin Price Chart – Source: Tradingview\n\nConversely, if there’s a bearish descent beyond the $1,575 point, the trajectory might steer Ethereum’s price towards the $1,535 mark.\n\nConcurrently, the 50-day EMA, RSI, and MACD indicators all lean towards a bearish inclination, as is evident in the accompanying chart.\n\nInvestors would do well to monitor the $1,575 juncture, as a downward shift past this could unveil further selling prospects.\n\nTop 15 Cryptocurrencies to Watch in 2023\n\nGet ahead of the game in the world of digital assets by checking out our carefully curated selection of the top 15 alternative cryptocurrencies and ICO projects to watch for in 2023.\n\nOur list is compiled by industry experts from Industry Talk and Cryptonews, so you can expect professional recommendations and valuable insights for your cryptocurrency investments.\n\nStay updated and discover the potential of these digital assets.\n\nFind The Best Price to Buy/Sell Cryptocurrency\n\nCrypto Price Tracker – Source: Cryptonews\n\nDisclaimer: Cryptocurrency projects endorsed in this article are not the financial advice of the publishing author or publication – cryptocurrencies are highly volatile investments with considerable risk, always do your own research."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtZmVlcy1oaXQteWVhcmx5LWxvd3MtaGVyZXMtd2hlcmUtdGhpcy1taWdodC1sZWFk0gFRaHR0cHM6Ly91LnRvZGF5L2V0aGVyZXVtLWV0aC1mZWVzLWhpdC15ZWFybHktbG93cy1oZXJlcy13aGVyZS10aGlzLW1pZ2h0LWxlYWQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Fees Hit Yearly Lows, Here's Where This Might Lead - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to Santiment, an on-chain analytics firm, Ethereum's average fees have decreased to their lowest levels since 2023. It stated that the average Ethereum transaction fee has dropped to $1.15, the lowest since Dec. 26, 2022.\n\nAdvertisement\n\nSantiment emphasizes the historical significance of this as Ethereum's network fees reach yearly lows. Based on historical precedents, utility may begin to rise as ETH becomes less costly to circulate. This increased utility could ultimately contribute to market cap levels rebounding.\n\n🤑 #Ethereum network fees have dropped down to its lowest level of 2023, at just $1.15 per transaction. Historically, we see utility begin rising as $ETH becomes more affordable to circulate. Increased utility can then lead to recovering market cap levels. https://t.co/MpOLfMYKUp pic.twitter.com/JI8ZLhmb4p — Santiment (@santimentfeed) September 23, 2023\n\n\"Ethereum network fees have dropped down to its lowest level of 2023, at just $1.15 per transaction. Historically, we see utility begin rising as ETH becomes more affordable to circulate. Increased utility can then lead to recovering market cap levels,\" Santiment tweeted.\n\nAt the time of writing, Ethereum was trading near $1,594, just below $1,600. If the utility that arises from decreased fees impacts prices, ETH may attempt an upside move that targets the $1,692 and $1,804 levels next.\n\nIf this is accomplished, Ethereum may retest the $2,000 mark last seen in July. ETH, on the other hand, is gaining support just below its current level of $1,540.\n\nETH total fees drop to nine-month lows\n\nAccompanying the drop in average fees, Ethereum network fees, which refer to the sum of total fees spent to utilize the blockchain, also fell to a nine-month low of $22.1 million in the week.\n\nPer IntoTheBlock data, total fees on Ethereum fell during the week by 9.3%, while ETH saw negative exchange flows of $130 million, a decrease of $20 million. The net amount of inflows minus outflows of a certain crypto-asset going in or out of centralized exchanges is referred to as exchange netflows.\n\nEthereum's falling fees, which are being driven in part by L2 adoption, might be putting some pressure on the second-largest crypto asset, as its supply has been increasing over the last month, reversing its deflationary trend."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tbmV0d29yay1mZWVzLWhpdC0yMDIzLWxvdy13aGF0LWl0LWNvdWxkLW1lYW4tZm9yLWV0aC1wcmljZS_SAW5odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLW5ldHdvcmstZmVlcy1oaXQtMjAyMy1sb3ctd2hhdC1pdC1jb3VsZC1tZWFuLWZvci1ldGgtcHJpY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Network Fees Hit 2023 Low: What It Could Mean For ETH Price - NewsBTC",
        "content": "In recent weeks, Ethereum (ETH), one of the most valuable assets in the cryptocurrency market, has not enjoyed favorable sentiment due to its struggling price and unstable on-chain performance. The general market condition has not offered much reprieve either, as most altcoins have failed to maintain an upward momentum. Fortunately, the latest on-chain revelation offers some hope for the price of Ethereum.\n\nEthereum Average Fee Drops To Lowest Level In 2023\n\nOn-chain analytics have been helpful in providing real-time insights into crypto market trends. And the latest on-chain revelations have highlighted a plunge in Ethereum network fees, which might prove to be a turning point for the cryptocurrency’s market value and performance.\n\nAccording to the on-chain analytics platform, Santiment, the Ethereum network fees have dropped to their lowest levels in 2023, with each transaction averaging about $1.15 as of this writing. This reflects a significant fall from the huge fees seen in 2021 and 2022, with demand for processing power causing the average fees to reach above $50.\n\nHistorically, such a decline in fees is a positive sign for Ethereum’s utility and adoption, as lower costs make it more profitable and worthwhile to use the network. Santiment also noted that rising utility is often the case due to Ether tokens becoming more affordable to circulate.\n\nIt is worth noting that the impact of this development can spread to the overall market value of the digital asset. Increased utility and adoption can contribute to the recovery of Ethereum’s market capitalization and value.\n\nThe Effect On ETH Price?\n\nIndeed, the plunging network fees positively benefit Ethereum and its users, especially as it can improve other network metrics and parameters. However, this development has not significantly impacted ETH price, as it seems to be struggling to break out from under the current selling pressure.\n\nOn Thursday, September 21, the cryptocurrency fell beneath the psychological $1,600 level for the second time this month. And the Ether token continues to trade below this price mark, with a roughly 2.6% decline in the past three days.\n\nInvestors will be watching to see if Ethereum can build positive network momentum while fees are low. However, it remains to be seen whether this will be enough to propel the ETH price out of consolidation, especially as there are no signs of buying pressure from Ethereum whales.\n\nThere are no signs of buying pressure from #Ethereum whales yet! pic.twitter.com/oqBbdbaOlb — Ali (@ali_charts) September 21, 2023\n\nMoreover, the dwindling number of major ETH holders adds zero optimism to this scenario. This is because such a decline in whale holdings can make the Ethereum price increasingly susceptible to downward pressure.\n\nAccording to CoinGecko data, the Ether token trades for $1,593, reflecting a 2.6% price dip in the past week. Ethereum is currently the second-largest cryptocurrency, with a market capitalization of $191.6 billion.\n\nEthereum price trading below $1,600 on the daily timeframe | Source: TOTAL chart on TradingView\n\nFeatured image from The Economic Times, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbmdhcGUuY29tL3hycC1sYXd5ZXItam9obi1kZWF0b24tcmVwcmVzZW50aW5nLWV4LWV0aGVyZXVtLWFkdmlzb3Itb24tZXRoLWdhdGUv0gFdaHR0cHM6Ly9jb2luZ2FwZS5jb20veHJwLWxhd3llci1qb2huLWRlYXRvbi1yZXByZXNlbnRpbmctZXgtZXRoZXJldW0tYWR2aXNvci1vbi1ldGgtZ2F0ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "XRP Lawyer John Deaton Representing Ex-Ethereum Advisor? - CoinGape",
        "content": "The crypto market participants have in recent days began engaging in the debate around Ethereum Gate, which refers to the US Securities and Exchange Commission (SEC) allegedly giving preferential treatment to Ethereum Foundation. With XRP attorney John Deaton revealing that he had seen documents related to the alleged wrongdoings, it is being speculated that these developments mark just the beginning of a long drawn expose.\n\nAlso Read: OpenSea Reportedly Suffers Leak After Nansen Breach\n\nadvertisement\n\nAttorney Client Privilege: What It Means?\n\nThe talk around Ethereum Gate intensified as Steven Nerayoff, an early advisor at the Ethereum Foundation, said in a September 17, 2023 tweet that people at the Foundation were hiding the real number of ETH buyers during the cryptocurrency’s 2014 initial coin offering (ICO). Earlier, CoinGape reported XRP lawyer John Deaton’s revelation that he had seen some of the ‘receipts’ that may uncover truth about the ICO numbers.\n\nWhile agreeing to have seen the records, the lawyer apparently indicated Ethereum when he said he was not able to reveal the names as he was bounded by attorney client privilege. This means Nerayoff entered into an engagement agreement with attorney Deaton. This could essentially mean Deaton representing the former ETH advisor in the court if required.\n\nFred Rispoli, another attorney, clarified that the attorney client privilege could mean huge implications coming ahead. He warned that the partnership could lead to massive implications with “Very big things to come.” Does this mean Nerayoff suing the Ethereum Foundation over framing of fraud charges?\n\nXRP Lawsuit Impact\n\nAttorney Deaton, is known for his views that the US SEC favored Ethereum while making Ripple (XRP) project a scapegoat with the enforcement actions. Hence, a potential lawsuit filing on behalf of Nerayoff could be in the making over the next few months.\n\nAlso Read: Is Terra Co-Founder Do Kwon Coming To US? SEC Files Motion In Court"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vY29pbmdhcGUuY29tL3hycC1sYXd5ZXItam9obi1kZWF0b24tY3J5cHRvLW5ld3Mv0gE8aHR0cHM6Ly9jb2luZ2FwZS5jb20veHJwLWxhd3llci1qb2huLWRlYXRvbi1jcnlwdG8tbmV3cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "XRP Lawyer: Accessed Records On Alleged Ethereum ICO Scam - CoinGape",
        "content": "John Deaton, the attorney who represents the over 70,000 XRP token holders in the Ripple Vs U.S. Securities and Exchange Commission (SEC) lawsuit, had kept the crypto community guessing about this announcement. However, there were hints that the announcement involved Steven Nerayoff, who was an early adviser in the Ethereum network project.\n\nThe attorney revealed that a major part of the announcement was about some of the very interesting claims made by Nerayoff, describing him as the most talked about person within the XRP community currently. Nerayoff claimed to have evidence of wrongdoings during the Ethereum initial coin offering in 2014.\n\nadvertisement\n\nAlso Read: Tether CTO Slams WSJ Article On Restarting Loans\n\nWho Is Steven Nerayoff?\n\nIn May 2023, a New York judge dismissed criminal extortion charges against the Ethereum early advisor. He was accused of extorting a crypto startup that he was consulted to assist in an ICO process. However, the federal prosecutors had admitted that they were unable to prove the charges in the indictment beyond a reasonable doubt.\n\nThe Big Announcement: We’re Getting Closer\n\nIn a massive revelation, Deaton claimed that he had personally seen some of the receipts that Nerayoff claims to have, in relation to the allegations he made on the Ethereum ICO, although the attorney did not exclusively name the crypto project due to attorney client privilege. He concluded based on the records he saw that the insiders of the Ethereum ICO were not telling the truth.\n\n“I have seen some of the receipts Nerayoff claims to have. I understand that he was targeted by some people at a cryptocurrency project (ETH) and I understand why he feels that. I can conclude that people who distanced from Nerayoff are not telling the truth.”\n\nIn the recent days, Nerayoff had been making allegations about the irregularities involved in the Ethereum initial coin offering (ICO) and the corrupt practices at the US SEC. In a tweet dated September 17, 2023, Nerayoff revealed about someone at Etheruem hiding the real number of ETH ICO buyers. “Whales could disguise their large positions during the ICO,” he revealed. More importantly, he admitted to having some documental proofs about the same.\n\n“I might have the doc versions by the author of the TOS (Terms of Use) amongst countless documents, recordings, etc. all stored in a number of locations.”\n\nAlso Read: El Salvador Bitcoin Critic Sen Menendez Indicted for Corruption\n\nImpact Of The Records On XRP Lawsuit\n\nAttorney Deaton further explained that if the trial against Ripple chief executive officer Brad Garlinghouse and the company’s co-founder Christian Larsen goes forward, the cross examination of Bill Hinman records will be super difficult for the US SEC. The federal regulatory agency’s December 22, 2020 complaint in the XRP lawsuit also charged the two top executives for allegedly raising capital through the sale of XRP in the form of unregistered securities. Earlier, CoinGape reported there was a change of attorney representing the CEO in this regard.\n\n“Truth Will Come Out”\n\nDeaton said he was not able to reveal many other details due to legal restrictions but concluded saying that as a community, “We’re getting closer” in the fight against regulators. “The truth will come out and we are getting closer,” he said.\n\nIn this context, CoinGape had earlier reported that an Ethereum ICO participant sold as many as 6,000 ETH tokens worth around $10 million. In August, it was reported that an address labled with the name of Ethereum cofounder Vitalik Buterin saw a transfer of 3,000 ETH. Compared to a month ago, the ETH price is trading around 0.80% lower at the time of writing.\n\nAlso Read: Ethereum On-Chain Metrics Tank After Shanghai Upgrade, Should Investors Worry?"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGgtc3RydWdnbGVzLWRlc3BpdGUtcmVjb3JkLWxvdy1mZWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "ETH Price Struggles Continue Despite Record Low Network Fees - DailyCoin",
        "content": "While Ethereum struggles with challenges, an intriguing on-chain revelation has emerged.\n\nNetwork fees for Ethereum have experienced a sharp decline, hitting their lowest levels in 2023.\n\nDespite these developments, Ethereum’s price has grappled with substantial selling pressure.\n\nIn recent weeks, Ethereum (ETH), a prominent asset in the cryptocurrency market, has faced a downturn in sentiment, primarily due to its struggling price performance and the instability witnessed in its on-chain operations.\n\nUnfortunately, this unfavorable situation has extended to most other altcoins, with few sustaining upward momentum. However, a glimmer of hope is on the horizon, courtesy of a recent on-chain revelation.\n\nEthereum Average Fee Hits a New Low for 2023\n\nSantiment, a platform specializing in on-chain data analytics, has revealed a pivotal moment for Ethereum’s performance. The intelligence firm has noted that the network’s fees have fallen significantly, reaching their lowest levels in 2023, with each transaction now averaging around $1.15 at press time.\n\n🤑 #Ethereum network fees have dropped down to its lowest level of 2023, at just $1.15 per transaction. Historically, we see utility begin rising as $ETH becomes more affordable to circulate. Increased utility can then lead to recovering market cap levels. https://t.co/MpOLfMYKUp pic.twitter.com/JI8ZLhmb4p — Santiment (@santimentfeed) September 23, 2023\n\nThis sharp decline starkly contrasts the huge fees witnessed in 2021 and 2022, where the surge in demand for processing power drove average fees well above the $50 mark. Historically, such a fee reduction bodes well for Ethereum’s practicality and adoption, as lower transaction costs render the network more enticing and economically viable for users.\n\nSantiment has also underscored that enhanced utility often accompanies these reduced costs as ether tokens become more accessible for circulation. The utility and increased adoption of the Ethereum network have the potential to contribute to the recovery of its market capitalization and overall value.\n\nEthereum Price Struggles Despite Network Fee Decline\n\nWhile the decline in network fees brings tangible benefits to Ethereum and its user base, the impact on ETH’s price has remained relatively muted, with the cryptocurrency struggling to break free from the ongoing selling pressure.\n\nOn Thursday, September 21st, ETH dipped below the significant psychologically $1,600 threshold for the second time this month, and it continues to hover below this benchmark, exhibiting a modest 2.6% decline over the past week.\n\nOn the Flipside\n\nThe drop in Ethereum network fees may be driven by decreased network activity rather than increased efficiency.\n\nWith the rise of alternative blockchain networks offering lower fees and faster transaction times, Ethereum may face challenges in retaining its user base and attracting new users.\n\nWhy This Matters\n\nThe significant drop in Ethereum’s network fees holds substantial implications for the cryptocurrency community. This fee reduction not only enhances Ethereum’s utility and adoption but also has the potential to contribute to the recovery of its market capitalization and overall value, offering a glimmer of hope amid recent market challenges.\n\nTo learn more about Ethereum’s anticipated upgrade delay and its impact on the crypto community, read here:\n\nEthereum’s Next Major Upgrade Likely to Be Delayed: Core Devs\n\n\n\nFor insights into the recent $31 million move involving an ETH ICO wallet and its connections to Ethereum’s key figures, check out this article:\n\nETH ICO Wallet Linked to Dev Joins Buterin, Whales in $31M Move"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtaGlnaGxpZ2h0LW9mLWEtdm9sYXRpbGl0eS1maWxsZWQtd2Vlay1pcy1oZXJlLTIwMjMwOTIwMTc0ONIBnAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLWhpZ2hsaWdodC1vZi1hLXZvbGF0aWxpdHktZmlsbGVkLXdlZWstaXMtaGVyZS0yMDIzMDkyMDE3NDg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Opportunity will come and patience will be rewarded - FXStreet",
        "content": "Share:\n\nBitcoin price rests below the $27,500 level as those who profited in the September 12-18 rise recently await the next move.\n\nEthereum price is likely to fall 5% if BTC shows weakness, sending ETH for a liquidity grab below the $1,552 support level.\n\nRipple price must break and close above the mean threshold at $0.5337 or fall 10% retracing the $0.4600 level.\n\nBitcoin (BTC) price holds steady with reduced trading volume as the weekend mood sets in. Ethereum (ETH) price hackens to the BTC cue, with both cryptos engaging low gear. Meanwhile, Ripple (XRP) price is rejected from a key level but maintains an overall bullish outlook.\n\nAlso Read: Bitcoin Weekly Forecast: BTC downside likely after 20-week EMA culls bulls\n\nBitcoin price holds below $27,000\n\nBitcoin (BTC) price dropped below the $27,000 psychological level, with investors digesting the FOMC meeting reports following the Federal Interest Rate decision. The current stance could be attributed to the weekend mood, or more ideally, traders having taken profits from the September 12-19 upswing and are now waiting for the next move.\n\nIt is likely that Bitcoin price could extend the slump below the $26,000 psychological level before a possible pullback with the odds of a move below the $25,229 level increasing by the day. A decisive break and close below this level would confirm the downtrend.\n\nBTC/USDT 1-day chart\n\nHowever, if the Relative Strength Index (RSI) decisively moves above 50, Bitcoin price could shatter the downtrend line at $27,210, clearing the path for more gains. This could potentially deliver BTC above the $28,000 psychological level.\n\nAlso Read: Bitcoin trading volume in spot and derivatives market points to dwindling liquidity, limits price growth\n\nEthereum price follows BTC to the heel\n\nEthereum (ETH) price could have little to say as far as its next move is concerned, considering the Proof-of-Stake (PoS) token has been mirroring the price action of Bitcoin for quite some time now, owing to its strong correlation with BTC.\n\nIndependently, however, Ethereum price remains bare, with momentum falling as indicated by the RSI dropping. The immediate support at $1,624 is therefore critical for ETH, as losing it would plunge it back under a confining bearish trendline. The downtrend could go as low as the $1,552 level.\n\nETH/USDT 1-day chart\n\nOtherwise, if bullish momentum increases, Ethereum price could very well rise above the immediate hurdle at $1,682, then $1,791, with a confirmed daily candlestick close above the $1,900 likely to kickstart an uptrend. The steady climb of the AO is a good sign, with the sustained green shade solidifying the case for the bulls.\n\nAlso Read: Ethereum and Bitcoin are ready to dive\n\nRipple price repels the MT\n\nRipple (XRP) price has repelled the supply zone order block's mean threshold (MT) at $0.5337. However, the overall outlook is still bullish, with the RSI inclined north and the AO steadily climbing to the positive region. Nevertheless, investors should still wait for confirmation above the aforementioned level for the uptrend to be considered plausible.\n\nXRP/USDT 1-day chart\n\nA strong rejection from the mean threshold, potentially positioning Ripple price under $0.4600 could mean the supply zone will hold as a resistance level, with the ensuing selling pressure sending Ripple price toward the foot of the latest uptrend at $0.4600. In the dire case, the downtrend could continue, with the remittance token potentially tagging the May lows at $0.4191.\n\nAlso Read: XRP is the next Bitcoin if we solve a multi-trillion-dollar problem, Ripple CEO Brad Garlinghouse"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDkvMjIvZXRoZXJldW0tZGVuY3VuLXVwZ3JhZGUtbWlnaHQtYmUtZGVsYXllZC10by1uZXh0LXllYXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Dencun Upgrade Might Be Delayed To Next Year - Crypto Times",
        "content": "Dencun, the next major upgrade on Ethereum network could be delayed as late as next year as its testnet version has not been implemented yet.\n\nIn the 118th Consensus Layer Meeting yesterday, Ethereum developers talked over the potential release time for the upcoming Dencun upgrade. Tim Beiko, the prominent figure from the Ethereum Foundation hosted the meeting and he shared concerns on the to-be-delayed release of Dencun upgrade on mainnet.\n\nThe core Ethereum developers discussed that the upgrade is not yet introduced on testnets as it’s currently in devnet phase. The upgrade is set to be tested on a local developer network called ‘Devnet 9’ next week prior to its release on public testnets.\n\nBeiko expressed that if Dencun is not introduced on public testnet before Devconnect event taking place in November, 2023, the mainnet implementation for the upgrade might not occur this year as projected before.\n\nThe proposal EIP-4844 dubbed Dencun Upgrade was introduced in February 2022 and it aims to improve Ethereum scalability by introducing major updates in the execution layer and consensus layer.\n\nThe upgrade introduces a new transaction format called “shard blob transactions” which will allow storing off-chain data temporarily till Ethereum nodes access it and broadcast to the network. This will ultimately reduce gas fees even more on layer 2 rollups such as Arbitrum and Optimism.\n\nWith this upgrade, the execution layer – the smart contract execution engine – will be renamed to Cancun and the consensus layer – which sees the network decentralization via staking – will be renamed to Deneb. Hence the upgrade is named Dencun and its also known as proto-danksharding."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpbmFuY2UvdGhpcy1iaW5hbmNlLXdhbGxldC10cmlnZ2VyZWQtYS10ZW1wb3JhcnktMzB4LXN1cmdlLWluLWV0aGVyZXVtLWdhcy1mZWVzL9IBbWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpbmFuY2UvdGhpcy1iaW5hbmNlLXdhbGxldC10cmlnZ2VyZWQtYS10ZW1wb3JhcnktMzB4LXN1cmdlLWluLWV0aGVyZXVtLWdhcy1mZWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "This Binance Wallet Triggered A Temporary 30X Surge In Ethereum Gas Fees - NewsBTC",
        "content": "A cryptocurrency wallet associated with the prominent trading platform, Binance, has seen massive activity in the last 24 hours, leading to abnormally high transaction fees on the Ethereum network.\n\nBinance Wallet Incurs Nearly $850,000 Gas Fees In One Day\n\nA crypto wallet labeled “Binance 14” witnessed a significant transaction surge on September 21, rising above 140,000. As a result of this activity surge, transactions of the Binance-owned wallet consistently incurred gas fees of over 300 gwei, even though the network’s average fee was around 10 gwei.\n\nThis gas fee jump and significant wallet activity have resulted in around 530 ETH (equivalent to nearly $850,000) in gas used on the Binance 14 address today.\n\nThe increase in transactions on the Binance wallet had a broader, albeit temporary, impact on the Ethereum network. Gas fees on the blockchain momentarily jumped from less than 10 gwei to above 330 gwei per transaction, according to blockchain data tracker Etherscan.\n\nGas fees refer to the cost blockchain users incur or pay validators to conduct transactions or execute contracts on the Ethereum network. Fees depend on the blockchain’s demand and supply of processing power. This means when a network has many transactions, there is often a high demand for processing power, which increases gas fees.\n\nPossible Reasons For The Gas Fee Spike\n\nIn the wake of this incident, Wu Blockchain reported that Binance said it was carrying out its wallet aggregation process when the gas fees were low to facilitate withdrawals and ensure the safety of user funds. Nonetheless, some prominent crypto community members have weighed in on the situation, offering possible explanations for the gas fee spike.\n\nMartin Koppelmann, cofounder of the Gnosis chain, said on the X (formerly Twitter) platform that Binance might be using a “really inefficient script” to consolidate, leading to high transaction costs.\n\nGas prizes spiking because of a ton of regular ETH transfers related to Binance.\n\na) they are using a really inefficient script to consolidate funds and are massively overpaying transaction costs\n\nb) something fishy is going on — Martin Köppelmann 🦉💳 (@koeppelmann) September 21, 2023\n\nBlockchain analysts at Scopescan gave a similar prognosis on the gas incident. The on-chain analytics platform said:\n\nDue to Binance consolidating funds from long-inactive deposit addresses, the Ethereum network is experiencing congestion, causing Gas fees to surge to 300 gwei.\n\nAdam Cochran, a popular crypto investor, suggested that the abnormally high transaction fees might have been due to Binance’s subpar APIs. In his X post, Cochran criticized the exchange’s technological infrastructure while casting doubts on its capacity to safe-keep “hundreds of billions in coins across multiple protocols.”\n\nAccording to CoinGecko data, the price of Ethereum currently sits below $1,600, reflecting a 2.8% decline in the past 24 hours. Nevertheless, Ether maintains its position as the second-largest cryptocurrency, with a market capitalization of over $190 billion.\n\nEthereum price trading beneath $1,600 on the daily timeframe | Source: TOTAL chart on TradingView\n\nFeatured image from Unsplash, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wOS8zNDgzMDg5Mi9iaXRjb2luLWV0aGVyZXVtLWFuZC1kb2dlY29pbi10cmFkZS1tdXRlZC1pbi13YWtlLW9mLWZlZC1kZWNpc2lvbi1hLWxvb2stYXQtdGhlLWNyeXB0b3MtaW7SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzQ4MzA4OTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum And Dogecoin Trade Muted In Wake Of Fed Decision: A Look At The Crypto's Into The Weeke - Benzinga",
        "content": "Bitcoin BTC/USD was trading mostly flat during Friday’s 24-hour trading session in the wake of this week's Federal Reserve meeting, where the central bank applied a pause on hiking interest rates.\n\nEthereum ETH/USD and Dogecoin DOGE/USD also traded flat, in tandem with the S&P 500, while spot gold was lifting slightly, rising about 0.3%.\n\nWhile economists are mixed on whether the Fed will apply a rate hike at the November and December meetings, CME Group’s FedWatch Tool sees a likelihood that the central bank will hold rates steady into 2024.\n\nThe lower-than-average volume across the general market and the crypto sector on Friday indicates the bears may be losing steam and a period of consolidation may be in the cards. Of course, traders and investors will be watching the crypto sector over the weekend for indications of how the general market may trade on Monday.\n\nWant direct analysis? Find me in the BZ Pro lounge! Click here for a free trial.\n\nThe Bitcoin and Ethereum Charts: Bitcoin and Ethereum were consolidating with inside bar patterns during Friday’s 24-hour trading session after dropping over 2.5% on Thursday. The consolidation indicates both the bulls and the bears are taking a break.\n\nBitcoin’s and Ethereum’s inside bar patterns are neutral because although the cryptos dropped on Thursday, both are currently trading in uptrends and may have formed higher lows that day. Bullish traders want to see continued consolidation and then for Bitcoin and Ethereum to break up from Thursday’s mother bar.\n\nBearish traders want to see big bearish volume come in and drop Bitcoin and Ethereum down from Thursday’s low-of-day, which could accelerate downside pressure.\n\nEthereum has resistance above at $1,615 and at $1,717 and support below at $1,564 and at $1,421.\n\nThe Dogecoin Chart: Like Bitcoin and Ethereum, Dogecoin was consolidating on lower-than-average volume Friday but dropped from Thursday’s low-of-day, to break bearishly from an inside bar pattern.\n\nDogecoin’s fall caused the crypto to negate its uptrend by forming a lower low. On Friday, Dogecoin was working to print a hammer candlestick, however, which indicates a bounce may be in the cards for Saturday. If that happens, bullish traders want to see the crypto regain support at the eight-day and 21-day exponential moving averages (EMA).\n\nBearish traders want to see Dogecoin continue to reject the eight-day EMA and for the indicator to continue to push the crypto lower.\n\nDogecoin has resistance above at $0.061 and at $0.065 and support below at $0.057 and at $0.05.\n\nRead Next: ByBit Suspends Services In This Country Due To Stricter Rules, Banned Incentives"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LnRla2VkaWEuY29tL2V0aGVyZXVtLWhhcy1iZWVuLWRpc2FwcG9pbnRpbmctc2luY2UtaXRzLXNoYW5naGFpLXVwZ3JhZGUtanBtb3JnYW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ethereum has been disappointing since Shanghai upgrade, Hong Kong to release Stablecoin Regulations - Tekedia",
        "content": "JPMorgan, one of the largest banks in the world, has issued a report criticizing Ethereum’s recent network upgrade, dubbed Shanghai. The report claims that the upgrade, which was supposed to improve scalability, security and efficiency, has failed to deliver on its promises and has instead resulted in higher fees, lower throughput and increased complexity.\n\nAccording to JPMorgan, Shanghai has not addressed the fundamental challenges that Ethereum faces, such as the trade-off between decentralization and performance, the vulnerability to congestion and attacks, and the lack of interoperability with other blockchains. The report also questions the viability of Ethereum 2.0, the long-awaited transition to a proof-of-stake consensus mechanism that aims to solve many of these issues.\n\nThe Ethereum community was eagerly awaiting the Shanghai upgrade, which was supposed to bring significant improvements to the network’s scalability, security and efficiency. However, the upgrade has turned out to be a disappointment, as it failed to deliver on its promises and introduced new problems.\n\nOne of the main features of the Shanghai upgrade was the implementation of sharding, a technique that splits the network into smaller pieces, or shards, that can process transactions in parallel. This was expected to increase the network’s throughput and reduce congestion and fees. However, sharding has also created new challenges, such as increased complexity, coordination costs and security risks. Moreover, sharding has not solved the scalability issue completely, as the network still relies on a single shard, called the beacon chain, to coordinate the other shards and ensure consensus.\n\nAnother feature of the Shanghai upgrade was the transition from proof-of-work (PoW) to proof-of-stake (PoS), a consensus mechanism that replaces miners with validators who stake their ether to secure the network. PoS was supposed to make the network more secure, efficient and environmentally friendly, as it eliminates the need for costly and energy-intensive mining. However, PoS has also introduced new vulnerabilities, such as the possibility of validator collusion, censorship and attacks. Furthermore, PoS has not made the network more efficient, as it requires validators to run nodes 24/7 and keep their ether locked in a long period of time.\n\nThe Shanghai upgrade was also supposed to improve the network’s efficiency by implementing EIP-1559, a proposal that changes the fee structure of Ethereum transactions. EIP-1559 was designed to make fees more predictable and fairer, by introducing a base fee that adjusts dynamically according to network demand and a tip that users can pay to prioritize their transactions. EIP-1559 was also expected to reduce the supply of ether by burning a portion of the base fee. However, EIP-1559 has not achieved its goals, as fees remain high and volatile, users still overpay for transactions and ether inflation is not significantly affected.\n\nJPMorgan’s report is not the first time that the bank has expressed skepticism about Ethereum and its prospects. In 2017, JPMorgan’s CEO Jamie Dimon famously called Bitcoin, the leading cryptocurrency and Ethereum’s main rival, a “fraud” and said that he would fire any employee who traded it. However, since then, JPMorgan has softened its stance on crypto and has even launched its own digital currency, JPM Coin, which runs on a private version of Ethereum.\n\nThe report has sparked a heated debate among crypto enthusiasts and experts, who have different opinions on Ethereum’s performance and potential. Some agree with JPMorgan’s assessment and argue that Ethereum is losing its edge to newer and more innovative platforms, such as Solana, Cardano and Polkadot. Others disagree and defend Ethereum’s achievements and vision, pointing out that it is still the most widely used and developed blockchain in the world, with a vibrant ecosystem of applications, developers and users.\n\nThe Shanghai upgrade has failed to deliver on its promises of improving scalability, security and efficiency of the Ethereum network. Instead, it has introduced new problems and trade-offs that undermine the network’s performance and user experience. The Ethereum community should reconsider its roadmap and priorities and focus on finding solutions that can truly address the network’s challenges and fulfill its potential.\n\nHong Kong looks to release Stablecoin Regulations by mid-2024\n\nHong Kong is planning to introduce a regulatory framework for stablecoins by the middle of 2024, according to a lawmaker who is involved in the drafting process. Stablecoins are digital tokens that are pegged to a fiat currency or other assets and are widely used in the cryptocurrency sector for trading and payments.\n\nStablecoins are a type of cryptocurrency that are designed to maintain a stable value relative to a fiat currency, a commodity, or a basket of assets. They are often seen as a way to reduce the volatility and risk of holding cryptocurrencies, as well as to facilitate payments and remittances across borders. However, stablecoins also pose significant challenges and risks for the crypto industry and the broader financial system.\n\nThe lawmaker, who spoke on condition of anonymity, said that the Hong Kong government is aware of the growing popularity and potential risks of stablecoins, especially after the launch of Diem, the rebranded version of Facebook’s Libra project, which aims to create a global payment system based on a basket of currencies and assets.\n\nOne of the main challenges of stablecoins is ensuring that they are fully backed by the underlying assets or reserves that they claim to represent. This requires a high level of transparency, auditability, and regulation, which may not always be present or consistent across different stablecoin issuers and jurisdictions. For example, in 2019, the New York Attorney General accused Tether, one of the largest and most popular stablecoins, of misleading investors and regulators about its reserve backing and its relationship with Bitfinex, a crypto exchange that had suffered a massive hack.\n\nThis raised doubts about the credibility and solvency of Tether and its ability to maintain its peg to the US dollar. Similarly, in 2020, the UK Financial Conduct Authority (FCA) banned CryptoSpend, a crypto debit card provider that used Wirecard as its payment processor, after Wirecard filed for insolvency amid allegations of fraud and accounting irregularities. This left CryptoSpend users unable to access their funds, which were partly denominated in stablecoins.\n\nAnother challenge of stablecoins is managing the trade-off between stability and decentralization. Some stablecoins, such as DAI, are algorithmically governed by smart contracts and rely on overcollateralization and market incentives to maintain their peg. However, this also makes them vulnerable to technical glitches, governance disputes, and market shocks that could disrupt their stability or functionality. For instance, in March 2020, DAI experienced a sudden spike in demand and price due to the market crash caused by the COVID-19 pandemic.\n\nThis resulted in undercollateralized loans, liquidation penalties, and governance issues that threatened the viability of the DAI system. On the other hand, some stablecoins, such as USDC and GUSD, are centrally issued and regulated by reputable entities and follow strict compliance standards. However, this also exposes them to legal and regulatory risks, such as censorship, seizure, or sanctions by authorities that may not be favorable to crypto.\n\nA third challenge of stablecoins is balancing the benefits and costs of interoperability and innovation. Stablecoins offer a unique opportunity to bridge the gap between traditional finance and crypto, as well as to enable new use cases and applications for both sectors. For example, stablecoins can facilitate cross-border payments and remittances, enhance financial inclusion and access, enable decentralized lending and borrowing platforms, and support tokenization and digitalization of real-world assets. However, stablecoins also introduce new complexities and uncertainties for the crypto industry and the wider financial system.\n\nFor example, stablecoins could pose systemic risks if they become widely adopted and interconnected with other financial instruments or infrastructures, such as exchanges, wallets, or payment networks. Stablecoins could also create regulatory arbitrage or fragmentation if they operate across different jurisdictions or regimes without adequate coordination or oversight. Stablecoins could also disrupt or compete with existing monetary policies or currencies if they challenge the sovereignty or dominance of central banks or governments.\n\nThe Hong Kong lawmaker said that the government is studying the experiences and best practices of other jurisdictions, such as Singapore, the UK and the EU, which have already proposed or implemented regulations for stablecoins. The lawmaker added that the government is also consulting with the industry and the public on the matter and expects to release a consultation paper by the end of this year.\n\nThe lawmaker said that the main objectives of the regulation are to ensure the stability and security of stablecoins, to protect consumers and investors, and to prevent money laundering and terrorist financing. The lawmaker said that the regulation will likely cover issues such as licensing, governance, capital requirements, disclosure, auditing, risk management and consumer protection.\n\nThe lawmaker said that the regulation will apply to both centralized and decentralized stablecoins, as well as to domestic and cross-border transactions. The lawmaker said that the regulation will not stifle innovation or competition in the sector, but rather provide clarity and certainty for the market participants.\n\nStablecoins are a fascinating and promising innovation that have the potential to transform the crypto industry and the global financial system. However, they also entail significant challenges and risks that need to be carefully addressed and managed by all stakeholders involved. As the stablecoin market grows and evolves, it is crucial to foster a balanced and collaborative approach that ensures stability, security, transparency, compliance, innovation, and inclusion for all.\n\nThe lawmaker said that Hong Kong is well-positioned to become a hub for stablecoin innovation and adoption, given its status as a global financial center and its proximity to mainland China, where digital yuan trials are underway. The lawmaker said that Hong Kong can leverage its existing strengths in fintech and blockchain to attract more stablecoin projects and investors to the city.\n\nHong Kong is planning to introduce a regulatory framework for stablecoins by the middle of 2024, according to a lawmaker who is involved in the drafting process. Stablecoins are digital tokens that are pegged to a fiat currency or other assets and are widely used in the cryptocurrency sector for trading and payments.\n\nStablecoins are a type of cryptocurrency that are designed to maintain a stable value relative to a fiat currency, a commodity, or a basket of assets. They are often seen as a way to reduce the volatility and risk of holding cryptocurrencies, as well as to facilitate payments and remittances across borders. However, stablecoins also pose significant challenges and risks for the crypto industry and the broader financial system.\n\nThe lawmaker, who spoke on condition of anonymity, said that the Hong Kong government is aware of the growing popularity and potential risks of stablecoins, especially after the launch of Diem, the rebranded version of Facebook’s Libra project, which aims to create a global payment system based on a basket of currencies and assets.\n\nOne of the main challenges of stablecoins is ensuring that they are fully backed by the underlying assets or reserves that they claim to represent. This requires a high level of transparency, auditability, and regulation, which may not always be present or consistent across different stablecoin issuers and jurisdictions. For example, in 2019, the New York Attorney General accused Tether, one of the largest and most popular stablecoins, of misleading investors and regulators about its reserve backing and its relationship with Bitfinex, a crypto exchange that had suffered a massive hack.\n\nThis raised doubts about the credibility and solvency of Tether and its ability to maintain its peg to the US dollar. Similarly, in 2020, the UK Financial Conduct Authority (FCA) banned CryptoSpend, a crypto debit card provider that used Wirecard as its payment processor, after Wirecard filed for insolvency amid allegations of fraud and accounting irregularities. This left CryptoSpend users unable to access their funds, which were partly denominated in stablecoins.\n\nAnother challenge of stablecoins is managing the trade-off between stability and decentralization. Some stablecoins, such as DAI, are algorithmically governed by smart contracts and rely on overcollateralization and market incentives to maintain their peg. However, this also makes them vulnerable to technical glitches, governance disputes, and market shocks that could disrupt their stability or functionality. For instance, in March 2020, DAI experienced a sudden spike in demand and price due to the market crash caused by the COVID-19 pandemic.\n\nThis resulted in undercollateralized loans, liquidation penalties, and governance issues that threatened the viability of the DAI system. On the other hand, some stablecoins, such as USDC and GUSD, are centrally issued and regulated by reputable entities and follow strict compliance standards. However, this also exposes them to legal and regulatory risks, such as censorship, seizure, or sanctions by authorities that may not be favorable to crypto.\n\nA third challenge of stablecoins is balancing the benefits and costs of interoperability and innovation. Stablecoins offer a unique opportunity to bridge the gap between traditional finance and crypto, as well as to enable new use cases and applications for both sectors. For example, stablecoins can facilitate cross-border payments and remittances, enhance financial inclusion and access, enable decentralized lending and borrowing platforms, and support tokenization and digitalization of real-world assets. However, stablecoins also introduce new complexities and uncertainties for the crypto industry and the wider financial system.\n\nFor example, stablecoins could pose systemic risks if they become widely adopted and interconnected with other financial instruments or infrastructures, such as exchanges, wallets, or payment networks. Stablecoins could also create regulatory arbitrage or fragmentation if they operate across different jurisdictions or regimes without adequate coordination or oversight. Stablecoins could also disrupt or compete with existing monetary policies or currencies if they challenge the sovereignty or dominance of central banks or governments.\n\nThe Hong Kong lawmaker said that the government is studying the experiences and best practices of other jurisdictions, such as Singapore, the UK and the EU, which have already proposed or implemented regulations for stablecoins. The lawmaker added that the government is also consulting with the industry and the public on the matter and expects to release a consultation paper by the end of this year.\n\nThe lawmaker said that the main objectives of the regulation are to ensure the stability and security of stablecoins, to protect consumers and investors, and to prevent money laundering and terrorist financing. The lawmaker said that the regulation will likely cover issues such as licensing, governance, capital requirements, disclosure, auditing, risk management and consumer protection.\n\nThe lawmaker said that the regulation will apply to both centralized and decentralized stablecoins, as well as to domestic and cross-border transactions. The lawmaker said that the regulation will not stifle innovation or competition in the sector, but rather provide clarity and certainty for the market participants.\n\nStablecoins are a fascinating and promising innovation that have the potential to transform the crypto industry and the global financial system. However, they also entail significant challenges and risks that need to be carefully addressed and managed by all stakeholders involved. As the stablecoin market grows and evolves, it is crucial to foster a balanced and collaborative approach that ensures stability, security, transparency, compliance, innovation, and inclusion for all.\n\nThe lawmaker said that Hong Kong is well-positioned to become a hub for stablecoin innovation and adoption, given its status as a global financial center and its proximity to mainland China, where digital yuan trials are underway. The lawmaker said that Hong Kong can leverage its existing strengths in fintech and blockchain to attract more stablecoin projects and investors to the city.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ldHdvcmstZmVlcy1kcm9wLXRvLTIwMjMtbG93cy13aWxsLWV0aC1wcmljZS1yZWNvdmVyL9IBWGh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ldHdvcmstZmVlcy1kcm9wLXRvLTIwMjMtbG93cy13aWxsLWV0aC1wcmljZS1yZWNvdmVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Gas Fees At 2023-Lows Providing Boost to ETH Price - CoinGape",
        "content": "The world’s second-largest cryptocurrency Ethereum (ETH) has once again come under strong selling pressure and is trading under $1,600. While the Ether (ETH) price has struggled to keep up with the upside momentum, some network parameters like the gas fees are showing signs of cooling down.\n\nOn-chain data provider Santiment explained that the fees on the Ethereum network have reached their lowest point in 2023, with transaction costs now at just $1.15. This reduction in fees historically corresponds to an increase in Ethereum’s utility, as lower fees make it more cost-effective to use the network. As utility rises, it can contribute to the recovery of market capitalization levels.\n\nadvertisement\n\nWhile this is a positive development concerning the on-chain metrics, the Ethereum price continues to be under selling pressure. Earlier this week, on September 19th, Ethereum (ETH) encountered its third rejection from a descending trendline, signaling the formation of successively lower highs on the daily chart, which strongly suggests a prevailing bearish sentiment.\n\nOver the past three days, ETH, the second-largest cryptocurrency, has declined by 3.8%, currently priced at $1596. If this bearish trend persists, there is a possibility of Ethereum experiencing an additional 4% decline, potentially targeting the $1460 support level.\n\nAlso, the massive transfer of $31 million ETH through Vitalik Buterin’s wallet has stirred excitement within the Ethereum community. But on-chain data shows that there’s no buying pressure from the whales to lead to any kind of reversal on the upside.\n\nThere are no signs of buying pressure from #Ethereum whales yet! pic.twitter.com/oqBbdbaOlb — Ali (@ali_charts) September 21, 2023\n\nConcerns Around Ethereum Staking\n\nMembers of the Ethereum community have shared concerns over a major drop in the staking inflows along with the major concentration of Ethereum staking.\n\nThe staking inflow total, which quantifies the unique addresses transferring coins to the official Beacon Chain deposit address for staking, displayed a consistent growth trajectory, surging from approximately 5,952 on April 3 to 404,704 on June 1.\n\nThis remarkable increase was notably fueled by the activation of the Shapella upgrade on April 12. For instance, between April 12 and June 1, the staking inflow total escalated from 16,736 to 404,704, marking an astonishing more than 25-fold surge. But as seen in the below image, the total ETH staked has been consistently dropping since May 2023.\n\nAs reported by CoinGape, several on-chain metrics for Ethereum, including network activity, have dropped since the Shapella upgrade. Furthermore, there’s a massive concentration of ETH staking in the hands of a few liquid staking protocols like Lido Finance."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbmdhcGUuY29tL3ZpdGFsaWstYnV0ZXJpbi1ldGhlcnVlbS1pY28tc3RldmVuLW5lcmF5b2ZmL9IBRmh0dHBzOi8vY29pbmdhcGUuY29tL3ZpdGFsaWstYnV0ZXJpbi1ldGhlcnVlbS1pY28tc3RldmVuLW5lcmF5b2ZmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ex-ETH Advisor: Vitalik Buterin Coordinated Fraud Charges On Me - CoinGape",
        "content": "Former Ethereum advisor Steven Nerayoff unveiled a fresh attack against Ethereum cofounder Vitalik Buterin over the extortion charges he was previously alleged of. This follows XRP lawyer John Deaton’s massive revelation that he saw some of the receipts Nerayoff holds that show irregularities in the Ethereum initial coin offering (ICO) in 2014.\n\nAlso Read: LINK Price Shoots 5% Above $7.0 Amid Heightened Chainlink Address Activity\n\nadvertisement\n\nCoordinated Attack By Vitalik Buterin and Dmitry Buterin\n\nElaborating about fraud allegations made by Vitalik in a video, Nerayoff claimed that the Ethereum founder and his father Dmitry Buterin were involved in a coordinated and scripted character assassination attack against him. In the video, Vitalik is heard accusing Nerayoff of committing a huge amount of fraud related to extortion of a company’s ICO.\n\n“This is a Father/Son coordinated & scripted character assassination to make me their fall guy. Vitalik Buterin falsely accused me of committing a ‘huge amount of fraud’ – or was he just taking away attention from himself?”\n\nEarlier, CoinGape reported revelations by Nerayoff and Deaton about having documents that show corrupt practices at the U.S. Securities and Exchange Commission (SEC) and also around the Ethereum ICO. He said the people at Ethereum Foundation were not telling the truth around the Nerayoff extortion story. Indicating that there are more revelations to come, the XRP attorney said, “The truth will come out and we are getting closer.”\n\nDid Ethereum Foundation Abandon Employee After Arrest In North Korea?\n\nIn yet another shocking revelation, the former Ethereum advisor said Vitalik had abandoned Virgil Griffith, a senior researcher and developer at the Ethereum Foundation, after he was “Convicted of helping North Korea evade sanctions.” He also supported the allegation with a November 2019 article by Trust Nodes that said the Foundation has completely stayed away from the arrest of Griffith.\n\nAlso Read: Ethereum Network Fees Drop to 2023-Lows, Will ETH Price Recover?"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9kb2dlY29pbi1kb2dlLW5vLWxvbmdlci1vbi1ncmVlbmxpc3QtbmV3bWlncmF0aW9ucy10by1ldGhlcmV1bS1ldGgtY291bGQtdHJhZGVjdXJ2ZS1tYXJrZXRzLXRjcnYtZ3Jvdy1ieS0xMDB4L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Dogecoin (DOGE) No Longer on \"Greenlist,\" NewMigrations to Ethereum (ETH), Could Tradecurve Markets (TCRV ... - Analytics Insight",
        "content": "Dogecoin (DOGE) Faces Setback, New Migrations to Ethereum (ETH), Will Tradecurve Markets (TCRV) Surge by 100x?\n\nThe crypto world is abuzz with recent developments, as Dogecoin (DOGE) faces a setback with its removal from the token ‘greenlist’ by the DFS. Meanwhile, Ethereum (ETH) witnessed new migrations with the introduction of Canto and Astar blockchains. Additionally, there’s growing speculation about Tradecurve Markets (TCRV) potentially surging by 100x.\n\n>>Register For The Tradecurve Markets Presale<<\n\nDogecoin (DOGE): Removed from DFS’s ‘Greenlist’\n\nDogecoin (DOGE) recently encountered a hurdle as it was removed from the New York Department of Financial Services (DFS) ‘green list.’ This decision raised questions within the Dogecoin community, leading to discussions about its implications for the coin’s future. It remains to be seen how Dogecoin will adapt and whether it can overcome this setback.\n\nWhile stricter, the updated regulatory guidance by the DFS is part of a broader effort to enhance transparency within the cryptocurrency space. Dogecoin’s popularity and widespread adoption make it a resilient and recognizable asset. Thus, it could still be valuable to a diversified crypto portfolio.\n\nAs a result, experts remain bullish about the long-term growth of the Dogecoin value. Therefore, they predict that the Dogecoin price will reach $0.098 by December 2023.\n\n>>Register For The Tradecurve Markets Presale<<\n\nEthereum (ETH): New Migrations\n\nEthereum (ETH), the blockchain giant, continues to evolve by introducing new blockchains. Recently, there was some positive Ethereum news as the migration of Cosmos-native L1 blockchain Canto to it was announced.\n\nWith increased interoperability and improved speed, Ethereum remains at the forefront of blockchain technology. The network’s ability to attract projects from various ecosystems, like Astar’s expansion from Polkadot to Ethereum, showcases Ethereum’s prominence as a preferred blockchain platform.\n\nThese moves contribute to Ethereum’s resilience and solidify its position as a top token. Because of this, market analysts foresee the Ethereum price sitting between $2,048.41 and $2,335.71 within Q4 of 2023.\n\nTradecurve Markets (TCRV): A Potential 100x Surge?\n\nAmidst these developments, all eyes are on Tradecurve Markets (TCRV), a project gaining attention. TCRV is in the spotlight due to its potential for a 100x surge once listed on a Tier-1 CEX following its launch. With a low market cap and innovative solutions for online trading, Tradecurve Markets is capturing the imagination of traders worldwide.\n\nTradecurve Markets’ innovative approach allows users to trade all derivatives on a single account. This feat differentiates it from platforms like Coinbase, which predominantly focus on cryptocurrencies. This groundbreaking move opens up vast opportunities, especially in the global foreign exchange market, which IMARC Impactful Insights valued at $753.2B in 2022.\n\n🟢Exciting news\n\nThe #TradeCurve Demo Platform is NOW LIVE!\n\nDive in, explore, and experience the future of trading. We value your insights – sign up, give it a whirl, and share your feedback with us.\n\nLet’s shape the future together! 👉🏽https://t.co/nuKSMkeh21#Cryptotrading pic.twitter.com/HuMKbBeI7D — Tradecurve (@Tradecurveapp) September 11, 2023\n\nAdditionally, Tradecurve Markets addresses a critical concern in the online trading sector by prioritizing user privacy. For instance, many popular exchanges require intrusive sign-up KYC checks. Tradecurve Markets stands out by eliminating the need for these checks. Instead, users can create an account using an email only, link it to a crypto wallet, and make a deposit.\n\nMoreover, TCRV’s lower market cap presents an exciting growth potential. It has more room for substantial price growth compared to well-established giants like Dogecoin and Ethereum. One TCRV token costs just $0.025 as it is in Stage 5 of its presale. But Stage 6 is approaching fast and will increase the price to $0.03 – a 20% ROI for those who buy it now.\n\nFor more information about the Tradecurve Markets (TCRV) presale:\n\nWebsite: https://tradecurvemarkets.com/\n\nBuy presale: https://app.tradecurvemarkets.com/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMisAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0by1wcmljZS10b2RheS1zZXB0ZW1iZXItMjItY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tc29sLXRlcnJhLWNsYXNzaWMtYWJwLWxpdmUtdHYtMTYzMTE0MdIBtAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0by1wcmljZS10b2RheS1zZXB0ZW1iZXItMjItY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tc29sLXRlcnJhLWNsYXNzaWMtYWJwLWxpdmUtdHYtMTYzMTE0MS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $27,000, Terra Classic Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC), the world’s oldest and most valued cryptocurrency, dipped below the $27,000 mark. Ethereum (ETH) lost the $1,600 mark as well early Friday. The dips could largely be attributed to US Federal Reserve Chair Jerome Powell’s statement on the possibility of increasing interest rates. Popular altcoins — including the likes of Dogecoin (DOGE), Ripple (XRP), Solana (SOL), and Litecoin (LTC) — traded sideways across the board. Terra Classic (LUNC) went on to become the biggest gainer, with a 24-hour jump of over 5 percent.\n\nThe global crypto market cap stood at $1.06 trillion at the time of writing, registering a 24-hour dip of 1.33 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $26,640.35, registering a 24-hour loss of 1.53 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 23.02 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $1,594.62, marking a 24-hour dip of 1.73 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.39 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour loss of 2.01 percent, as per CoinMarketCap data, currently priced at $0.06164. As per WazirX, Dogecoin price in India stood at Rs 5.27.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.25 percent. At the time of writing, it was trading at $65.06. LTC price in India stood at Rs 5,460.12.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.513, seeing a 24-hour dip of 0.76 percent. As per WazirX, Ripple price stood at Rs 43.59.\n\nSolana (SOL) Price Today\n\nSolana price stood at $19.71, marking a 24-hour loss of 2.17 percent. As per WazirX, SOL price in India stood at Rs 1,700.\n\nTop Crypto Gainers Today (September 22)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nTerra Classic (LUNC)\n\nPrice: $0.00006156\n\n24-hour gain: 5.69 percent\n\nTHORChain (RUNE)\n\nPrice: $1.79\n\n24-hour gain: 1.16 percent\n\nZcash (ZEC)\n\nPrice: $26.35\n\n24-hour gain: 0.60 percent\n\nUNUS SED LEO (LEO)\n\nPrice: $3.88\n\n24-hour gain: 0.60 percent\n\nFrax Share (FXS)\n\nPrice: $5.38\n\n24-hour gain: 0.45 percent\n\nTop Crypto Losers Today (September 22)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nImmutable (IMX)\n\nPrice: $0.6684\n\n24-hour loss: 9.75 percent\n\nMultiversX (EGLD)\n\nPrice: $25.81\n\n24-hour loss: 7.17 percent\n\nLido DAO (LDO)\n\nPrice: $1.49\n\n24-hour loss: 5.47 percent\n\nGala (GALA)\n\nPrice: $0.01326\n\n24-hour loss: 5.21 percent\n\nXDC Network (XDC)\n\nPrice: $0.05158\n\n24-hour loss: 5.06 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin has been trading sideways in the past 24 hours, largely in response to statements made by US Federal Reserve Chair Jerome Powell regarding the prospect of raising interest rates. At the same time, market participants are digesting the US benchmark 10-year note yields, which have climbed to 4.49 percent — the highest since November 2007. Meanwhile, Ethereum's price has decreased but remains above the $1,550 mark.”\n\nParth Chaturvedi, Investments Lead, CoinSwitch Ventures, said, “Remarks by the US Feds on the monetary policy seem to have led to a sell-off within investors across markets, including crypto. As per CoinGecko, the global crypto M.Cap is down 1.5 percent but continues to be above $1 trillion. The crypto fear and greed index has re-entered the fear zone after dropping 4 points since yesterday. The index currently stands at a score of 43/100. The top 50 cryptos by M.Cap are trading in the red. BTC is down 1.6 percent in the last 24 hours and is currently trading below its support level of $27,000. ETH (-2.0 percent) too is trading below its support at $1,600.”\n\nRajagopal Menon, Vice President, WazirX, said, “Despite macro pressures, Bitcoin may gain support from ongoing spot Bitcoin exchange-traded fund (ETF) applications in the US, with a 70 percent probability of SEC approval in the next six months, potentially leading to a +20 percent price surge.”\n\nAtulya Bhat, CMO, BuyUcoin, said, “Bitcoin slipped below the $27,000 mark after the Fed chief hinted toward tight monetary policy and higher interest rates may be prolonged to tame inflation. Higher interest rates may discourage borrowing activity and may result in liquidity crunch. ETH, the largest altcoin slipped below the $1600 mark during the same period and is changing hands at $1,593.24 at the time of writing.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin, currently at $26,645, endured a tumultuous episode at 11:34 UTC (7:34 ET). It witnessed a stunning drop from around $65,760 to a stunning low of $8,200. Remarkably, within just minutes, the cryptocurrency rebounded and almost regained its original value. Interestingly, this flash crash selectively rocked Binance.US and left traders confused. The spokesman attributed the chaos to an \"institutional trader\" and a glitch in their trading systems. The event underscores the volatile nature of Bitcoin, where breathtaking price swings can quickly disrupt markets. It serves as a vivid reminder of the unpredictable terrain of the cryptocurrency realm, where fortunes can change in an instant.”\n\nCoinDCX Research Team told ABP Live, “In the last 24 hours, Bitcoin's price took a dip of 1.40 percent, now standing at Rs 23,65,000 ($26,600). This decline in the value of the bitcoin coincided with a drop in global stock markets. This occurred as investors responded to cautious remarks made by the US Federal Reserve regarding their monetary policies. Additionally, we saw an increase in the 10-year U.S. Treasury yields, reaching the highest point in 16 years. This change likely had an impact on how the overall financial markets were behaving.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi0wFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLXNlcHRlbWJlci0yMy1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNjMxMzg00gHXAWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktaW4taW5kaWEtc2VwdGVtYmVyLTIzLWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE2MzEzODQvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Above $26,000 Mark As ThetaNetwork Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to remain above the $26,000 and $16,000 marks, respectively, on early Saturday morning. However, in terms of percentage-wise performance, BTC saw a loss of 0.29 per cent. Other popular altcoins — including the likes of Litecoin (LTC), Solana (SOL) — landed in the negative as overall prices saw minor losses across the board. ThetaNetwork (THETA)\n\nemerged to be the biggest gainer, seeing a 24-hour jump of over 8.72 per cent. Immutable (IMX), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.05 trillion, registering a 24-hour loss of 0.43 per cent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $26,535.19 seeing a 24-hour loss of 0.37 per cent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 22 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,591.60, marking a 24-hour loss of 0.21 per cent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.36 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour loss of 0.11 per cent as per CoinMarketCap data, currently priced at $0.06155. As per WazirX, Dogecoin price in India stood at Rs 5.2569.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 0.31 per cent. At the time of writing, it was trading at $64.80. LTC price in India stood at Rs 5,438.39.\n\nRipple (XRP) price today\n\nXRP price stood at $0.5126, seeing a 24-hour gain of 0.01 per cent. As per WazirX, Ripple price stood at Rs 43.8400.\n\nSolana (SOL) price today\n\nSolana price stood at $19.41, marking a 24-hour loss of 1.49 per cent. As per WazirX, SOL price in India stood at Rs 1,686.81.\n\nTop crypto gainers today (September 23)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nThetaNetwork (THETA)\n\nPrice: $0.6464\n\n24-hour gain: 8.72 per cent\n\nCurve DAO Token (CRV)\n\nPrice: $0.4848\n\n24-hour gain: 7.60 per cent\n\nChainlink (LINK)\n\nPrice: $7.02\n\n24-hour gain: 4.67 per cent\n\nAlgorand (ALGO)\n\nPrice: $0.1017\n\n24-hour gain: 3.37 per cent\n\nKlaytn (KLAY)\n\nPrice: $0.1118\n\n24-hour gain: 2.38 per cent\n\nTop crypto losers today (September 23)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nImmutable (IMX)\n\nPrice: $0.6107\n\n24-hour loss: 8.20 per cent\n\nMultiversX (EGLD)\n\nPrice: $24.94\n\n24-hour loss: 3.36 per cent\n\nTHORChain (RUNE)\n\nPrice: $1.74\n\n24-hour loss: 2.58 per cent\n\nTerra Classic (LUNC)\n\nPrice: $0.00006056\n\n24-hour loss: 2.28 per cent\n\nOasis Network (ROSE)\n\nPrice: $0.04233\n\n24-hour loss: 2.18 per cent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tc3Rha2luZy1tb21lbnR1bS1mYWxsaW5nLXdoYXRzLWdvaW5nLW9uL9IBTGh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tc3Rha2luZy1tb21lbnR1bS1mYWxsaW5nLXdoYXRzLWdvaW5nLW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Staking Momentum Falling, What's Going On? - Bitcoinist",
        "content": "The number of Ethereum (ETH) holders choosing to stake, effectively locking their coins in the smart contracts platform, is falling. According to CryptoQuant data, as of August 23, the staking inflow total stood at 30,656, down from 404,704 registered on June 1.\n\nEthereum Staking Inflow Dropping, But There Are Over 813,000 Active Validators\n\nThe staking inflow total, which measures the number of unique addresses moving coins to the official Beacon Chain deposit address for staking purposes, rose steadily from around 5,952 on April 3 to 404,704 on June 1.\n\nThis spike was significantly buoyed, as data shows, with the activation of the Shapella upgrade on April 12. To illustrate, between April 12 and June 1, the staking inflow total rose from 16,736 to 404,704, a more than 25X increase.\n\nThe Shapella upgrade allowed Ethereum validators to withdraw their coins for the first time since they began locking in late December 2021. This update gave validators—tasked with validating transactions and keeping the network secure—an option to keep staking their coins or exit.\n\nHowever, according to Dune Analytics, the number of validators rose from around 568,000 on April 12 to over 913,000 as of early September 2023.\n\nIn September 2022, Ethereum powered off the proof-of-work consensus protocol to validate transactions to a proof-of-stake consensus. Instead of miners, Ethereum now relies on validators. When writing, there are over 813,105 active validators who have, in total, locked over 26 million ETH.\n\nWill This Make Ethereum Centralized?\n\nThe 92% contraction in staking count is concerning. However, it doesn’t necessarily mean the Ethereum network is now susceptible or flawed.\n\nSpecifically, while the metric tracks the number of ETH holders choosing to stake and earn rewards on Ethereum, the tracker doesn’t reveal the number of those who withdraw during this period.\n\nA sharp increment in the number of ETH unlocked—as shown by the number of validators deactivating their nodes—or choosing not to validate transactions could cause worry. This might open the network to centralization concerns since liquidity-staking providers like Lido Finance are increasingly popular following the Shapella upgrade on April 12.\n\nTo quantify, Lido Finance, a dominant decentralized finance (DeFi) protocol with a total value locked (TVL) of over $13.9 billion when writing on September 22, channels hundreds of thousands, if not millions of ETH, from holders, allowing them to earn staking rewards.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNyeXB0b2dsb2JlLmNvbS9sYXRlc3QvMjAyMy8wOS9ldGgtdml0YWxpay1idXRlcmluLW9uLWV0aGVyZXVtcy1jaGFsbGVuZ2VzLWZ1dHVyZS1hbmQtcmVndWxhdG9yeS1sYW5kc2NhcGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Discusses Ethereum's Future and Regulatory Hurdles - CryptoGlobe",
        "content": "In a recent interview with CNBC’s MacKenzie Sigalos in Prague, Ethereum co-founder Vitalik Buterin shared his thoughts on a range of topics, from the platform’s future to the regulatory landscape affecting the crypto industry.\n\nButerin began by discussing his nomadic lifestyle, stating that he avoids certain countries, including his native Russia, due to the risks associated with his work in cryptocurrency. He emphasized that the primary challenge for Ethereum is to offer genuine value to its users. According to him, the platform has spent the last decade experimenting and must now focus on building applications that people will actually use.\n\nButerin also touched upon his public persona. Despite not actively seeking fame, he stated that his primary focus is creating a world where people have equitable access to financial resources, irrespective of location. He added that his transparent communication style and willingness to engage in profound philosophical discussions have made him a trusted thought leader within the crypto community.\n\nDiscussing the utility of cryptocurrencies, Buterin said they are most useful in emerging economies where they can solve real-world problems like payments and savings. He cited his experiences in countries like Argentina, where crypto adoption is high, as evidence of its practical utility.\n\nOn the topic of regulatory shifts, Buterin observed that as U.S. regulators intensify their scrutiny of the crypto sector, the industry’s focus is shifting overseas. He noted that while U.S. investors often view crypto as a speculative asset, people in developing countries use it for practical purposes.\n\nButerin expressed concerns about the reliance on centralized platforms like Binance for crypto transactions. He argued that these centralized entities are vulnerable to external pressures and corruption. He also emphasized the importance of privacy and security in the Ethereum ecosystem, stating that people need to have wallets that are secure, and if they lose the keys, they shouldn’t lose everything.\n\nRegarding Central Bank Digital Currencies (CBDCs), Buterin stated that they end up being even less private and break down existing barriers against both corporations and the government. He also revealed that Ethereum is focusing on enhancing privacy and scalability through technologies like zero-knowledge rollups.\n\nButerin mentioned that Ethereum’s shift to a proof-of-stake model is more likely to withstand government intervention, as it is easier to anonymize and harder to shut down. He added that Ethereum has evolved into a self-governing ecosystem, resilient enough to function even if he or the Ethereum Foundation were targeted. He emphasized that there are entire companies that maintain Ethereum clients, making the platform resilient with no single point of failure."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vYml0Y29pbmlzdC5jb20vcHJvLXhycC1sYXd5ZXItZHJvcHMtYm9tYnNoZWxsLWFubm91bmNlbWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Pro-XRP Lawyer Drops Bombshell Announcement About Ethereum - Bitcoinist",
        "content": "Following days of building up anticipation for his “big announcement,” pro-XRP lawyer John Deaton finally dropped the bombshell on September 22. As some might have predicted, his announcement had much to do with the ETH Gate.\n\nPro-XRP Lawyer: Revelations About Ethereum\n\nIn a broadcast on his X (formerly Twitter) platform, Deaton mentioned that he had three announcements to make, with the first being about the Ethereum ICO (Initial Coin Offering) irregularities.\n\nJohn Deaton Live https://t.co/7Sj3RuySFO — John E Deaton (@JohnEDeaton1) September 22, 2023\n\nHe stated that he has been in communication with Steven Nerayoff, a prominent “OG” in the crypto space, as he has been around for a while and was actively involved in Ethereum’s ICO. According to him, Nerayoff showed him some of the “receipts,” which made him realize why Nerayoff feels he was targeted.\n\nThe pro-XRP lawyer noted that this communication and everything he has seen is protected by the attorney-client privilege. Because of this, he was limited in what he could say. However, he made some observations based on what he had heard and seen.\n\nAccording to him, some people who distanced themselves from Nerayoff during his indictment aren’t telling the truth. He chose not to mention any names, though.\n\nFurthermore, he stated that if the SEC’s case against Ripple’s founders were to go to trial, Bill Himman’s cross-examination would be of “epic proportions.” He even offered to join the Ripple legal team “free of charge” and be the one to handle that particular cross-examination. It is believed that Himman was at the center of the whole ‘regulatory pass’ that Ethereum might have gotten from the SEC.\n\nXRP market cap currently at $27 billion. Chart: TradingView.com\n\nMeanwhile, Deaton stated he is confident of getting Nerayoff on Crypto Law when he is “ready” to reveal the truth about everything that happened between the SEC and Ethereum. While he is unsure whether or not people will be held accountable (as the statute of limitation may apply to certain charges), Deaton is confident that the truth will come out and “we are getting closer” to it.\n\nNerayoff also tweeted in support of Deaton’s broadcast and stated that he looks forward to “the real truth coming out.” In response, Deaton stated that he was inviting Ethereum’s founders Vitalik Buterin and Joseph Lubin, alongside Nerayoff, to come on live where “nothing can be cut or manipulated, and we will get to the truth.”\n\nTwo Other Announcements\n\nJust as he had hinted before the big announcement, Deaton had something to say about the XRP Ledger. He revealed that he was joining the SpendTheBits team as an angel investor. SpendTheBits is a crypto mobile payment app built on the XRP Ledger. Deaton stated that he is excited to be part of what the founders are building.\n\nThe third announcement was about his Memoir, which he was finally launching after four years of writing. The book “Food Stamp Warrior” discusses “all the things we’re not supposed to talk about nowadays,” including poverty, violence, drugs, sex, addiction, abuse, and race. Deaton also pointed out that he talked about the “clown regulators” at the SEC in the book.\n\nFeatured image from Shutterstock"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDkvMjMvcmlwcGxlLW92ZXJhbGwtdHJhbnNhY3Rpb25zLWV4Y2VlZC1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Ripple: Overall transactions exceed those of Ethereum - The Cryptonomist",
        "content": "The Cryptonomist conducted an interview with Markus Infanger of RippleX during the annual APEX Dev Summit that was held in September in Amsterdam, to talk about the latest news about Ripple’s development and more.\n\nWhat is the latest news for RippleX?\n\nIn a nutshell, we are working on growth and innovation. The community is growing, we have more developers compared to last year, during this Apex Dev Summit we have hundreds of projects that are starting to build on the XRP Ledger, we have different programs like the grants program, new hackathons. All of this in a period where Web3 mainnets are probably not gaining but losing their hype.\n\nRegarding XRP Ledger, from a technical point of view, we are super excited about the AMM amendment voting that is gonna be up on the network in a couple of days. That was proposed by RippleX engineers and we will be able to introduce a native AMM that is gonna to bring interesting features with it. The community is super excited about that, about how seamlessly it has been integrated in a decentralized protocol and it can bring liquidity on the network overall.\n\nAlso in terms of interoperability we have a few things in the pipeline as a crosschain bridge proposal which should be later this year. We have the root network as well, which is basically a separate project building a metaverse oriented network that integrates with the NFT standard to the XRP Ledger using XRP gas token. So you can see in multiple directions that there are a lot of innovative things happening on the root network but on XRPL as well.\n\nHow decisive do you think tokenization will be in the coming years and how will it impact the web3 world?\n\nTokenization has a massive role. It’s the entrance gate from the world we know into Web3. When you look at the total sum of existing real world financial assets at large, we are talking about over a quadrillion dollars which in terms of total of the rest of the market is massive.\n\nBlockchain technology can really pave the way to remove the frictions within the traditional financial market and bring efficiency, reducing costs and making it more seamless for everybody to move, manage and store these types of assets.\n\nEven the larger top 20 banks in the world are having an active blockchain strategy and tokenization is one of the key areas they are looking into. Even BlackRock said this is gonna be the next generation for the financial market.\n\nHow are you working to accelerate the development of the XRP ledger infrastructure?\n\nTogether with this community. There are programs that drive community growth, whether it’s the one billion XRP fund to support the grant program or the XRP accelerator program which Ripple helps to run together with the community who review projects.\n\nI think there are more than a thousand of projects on the XRPL. There are also some key stakeholders that really help around the ledger performance such as XRP Labs that is helping to support a lot of infrastructure elements, and the XRPL Foundation.\n\nWhat are the scalability and interoperability limits of XRP ledger?\n\nI would say one of the key differences for the XRP Ledger is that it is a very efficient and scalable blockchain. That was really one of the design principles since the beginning: transactions happen in 3 to 5 seconds, very reliably for over a decade now. There are over a million transactions a day now and 2.6 billion transactions have been facilitated on the XRP Ledger. That is more than Ethereum by the way. From the outset it’s a very efficient blockchain.\n\nOf course XRPL impact on the real economy increases and so increasing performance will be an important aspect. So this ongoing work in terms of usage, improving fundamentally infrastructures, is something that Ripple X is focused on but is also something that the community is working on.\n\nCredefi.Finance 2.0 has just gone live on XRPL. How does the protocol make “innovative lending”? Could you summarize how the platform works for our readers?\n\nI would describe this as a Web 2.0 or CeFi solution so what is basically does is that stablecoin holders on the XRPL can lend their stablecoins on a centralized platform, Credefi, which has a rigorous risk management structure and it has zero failure so far and basically it gets fund, so whatever real world needs to have capital because they are struggling having capitals by the existing banking system. I think they are mainly focusing on the manufacturing areas."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wOS8yMy9tdWNoLWF3YWl0ZWQtZGVuY3VuLXVwZ3JhZGUtb2YtZXRoZXJldW0tbWF5YmUtYmVoaW5kLXNjaGVkdWxlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Much-Awaited Dencun Upgrade of Ethereum Maybe Behind Schedule - The Coin Republic",
        "content": "Ethereum announced a major upgrade called “Deneb-Cancun” or “Dencun” a while ago. Reportedly, it was supposed to fix the scalability issues while implementing an improvement proposal named EIP-4844. However, the development team recently revealed that the much-awaited upgrade may get delayed. Before getting into the nitty-gritty of it, let’s learn what Dencun really is.\n\nWhat Makes Dencun So Significant?\n\nAs mentioned above, the upgrade will help Ethereum to be more scalable. It will bring changes across the network’s two mainnet layers: the execution layer and the consensus layer. While the former will supervise smart contract execution, the latter will take care of consensus via staking. Moreover, the upgrade will be implemented in a categorized fashion.\n\nThe one that will be applied to the execution layer will be called Cancun. On the other hand, the consensus one will be known as the moniker Deneb. Thus, together they are called Deneb-Cancun. The most notable feature of this upgrade is the Ethereum Improvement Proposal 4844. Also known as proto-danksharding, this proposal will accelerate the network’s scalability.\n\nMoreover, it will take the existing capabilities of Layer 2 solutions ahead. The EIP-4844 will activate the retrieval of off-chain data and temporary storage by Ethereum nodes. By doing so, it will address the storage and data requirements of various blockchain applications. Also, developers are expecting that EIP-4844 will bring down the transaction costs on Layer 2 rollup solutions. Programs like Arbitrum and Optimism will benefit from this update.\n\nWhat is the Reason Behind the Delay?\n\nOn September 21, Ethereum’s consensus-layer team held a meeting to discuss the launch plan for Dencun. The moderator of the meeting, Tim Beiko from the Ethereum Foundation, expressed concerns about the delay. He said that the upgrade lacks exposure to public testnets like Holesky, Goerli, and Sepolia. He also underlined the significance of Dencun’s launch before Devconnect, an Ethereum-focused developer conference slated for November 2023.\n\nBeiko said that if Dencun isn’t launched before the conference, its mainnet activation may not happen this year. According to him, it could impact some other plans of the network as well. Nevertheless, he took cognizance of the current situation and accepted the impending eventuality. He said that there are many technicalities to reckon with and the time is not sufficient. So, probably, the Dencun’s deployment on the mainnet will happen after Christmas.\n\nAdditionally, he explained that Dencun’s seamless deployment will depend on different factors. From the readiness of client teams to consensus layers and software code, everything will have to be perfect. Additionally, they all have to be tested on public testnets. This exercise will take plenty of time. Currently, the upgrade work is going through the “devnet phase”.\n\nDuring the conclave, developers talked about a localized developer network called “Devnet 9”. The developers want to use this framework to assess the functionality of Dencun. The testing on Devnet 9 will probably happen next week before it goes to the public testnet phase. While the upgrade may get delayed, users would rather wait than use subpar functionalities."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY2FwdGFpbmFsdGNvaW4uY29tL2NvdW50aW5nLWRvd24tdG8tZXRoZXJldW0tYnVsbC1ydW4tYW5kLWJpdGNvaW4tc3BhcmstbGF1bmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Sep 2023 07:00:00 GMT",
        "title": "Counting Down To Ethereum Bull Run, and Bitcoin Spark Launch - Captain Altcoin",
        "content": "Home » Journal Counting Down To Ethereum Bull Run, and Bitcoin Spark Launch Journal Counting Down To Ethereum Bull Run, and Bitcoin Spark Launch Philipp Traugott\n\nTwo major events have investors and enthusiasts counting down the days with anticipation. Ethereum (ETH) is gearing up for a potential bull run, while the launch of Bitcoin Spark (BTCS) promises to bring new excitement to the crypto landscape\n\nEthereum (ETH) price prediction\n\nGrayscale, a leading crypto asset management firm, recently filed an application with the U.S. Securities and Exchange Commission (SEC) to establish a new Ether Futures Exchange Traded Fund (ETF) under the Securities Act of 1933. This move follows a previous filing under the Investment Company Act of 1940. With reports in the crypto sphere hinting at the SEC’s potential approval of multiple Ether Futures ETFs as early as October, market analysts are anticipating a substantial uptick in the value of ETH. This bullish sentiment is rooted in the belief that the increased accessibility of Ether Futures could stimulate demand for Ethereum (ETH) among institutional investors, who are likely to flock to these instruments once they become available.\n\nWhat is Bitcoin Spark?\n\nBitcoin Spark is the latest Bitcoin fork. However, this fork has captured the attention of the crypto community because it isn’t merely a copy of the previous network. It is a new and innovative blockchain on a mission to bring a new era of cryptocurrency transactions.\n\nBitcoin Spark boasts lightning-fast transaction speeds and low fees due to its high individual block transaction capacity, short block time, and vast nodes. It also primes itself as a robust platform by seamlessly integrating a smart contract layer that allows for multiple programming languages, fostering a diverse ecosystem of smart contracts and decentralized applications (Dapps).\n\nAdditionally, Bitcoin Spark introduces a novel concept of decentralized CPU and GPU rental through its groundbreaking Proof-of-Process (PoP) consensus mechanism. The PoP non-linearly rewards users for confirming blocks and contributing their processing power to the network. The network’s massive nodes and nonlinear dynamics will allow for a wider range of validators, even those with low-powered devices. The Bitcoin Spark team will provide an application that will enable Windows, Mac OS, Linux, iOS, and Android users to engage in network validation by permitting access to their device’s processing unit. The validators’ power will then be leased to organizations or individuals undertaking high CPU or GPU load tasks, with payments made in BTCS. The revenue generated will then be distributed among the validators.\n\nFurthermore, the Bitcoin Spark application and website will have small, unobtrusive slots for advertisements. The community will police the ads to ensure security, and advertisers will be required to pay with BTCS.\n\nBitcoin Spark (BTCS) price prediction\n\nBTCS is currently trading at $2.5 with a complimentary 9% bonus in Phase 5 of the Bitcoin Spark Initial Coin Offering (ICO). BTCS is set to launch at $10 on November 30th, indicating a 464% increase from its current price. Several factors suggest BTCS could witness a significant surge in price post-launch. First, Bitcoin Spark’s innovative technology is bound to attract more users as it gains more recognition. Many analysts believe that Bitcoin Spark is rewriting the history of Bitcoin (BTC), with its ICO being compared to the early days of BTC. Additionally, BTCS has a capped supply of 21 million, suggesting long-term price appreciation, as seen with BTC. Moreover, Bitcoin Spark has a low market cap, which allows the BTCS price to surge by unprecedented levels. This is further cemented by the project’s launch being close to the start of the next expected crypto bull run, which has historically led to massive rallies for low-cap gems.\n\nConclusion\n\nWhile Ethereum (ETH) and Bitcoin Spark (BTCS) have significant potential for price increases, conducting your own research before making any investment is advisable.\n\nTo get more information on Bitcoin Spark:\n\nWebsite | Buy BTCS\n\nDisclaimer: We advise readers to do their own research before interacting with any featured companies. The information provided is not financial or legal advice. Neither CaptainAltcoin nor any third party recommends buying or selling any financial products. Investing in cryptoassets is high-risk; consider the potential for loss. CaptainAltcoin is not liable for any damages or losses from using or relying on this content."
    }
]