[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDEvMTEvZXRoZXJldW0tdXBncmFkZS1jb3VsZC1tYWtlLWl0LWhhcmRlci10by1sb3NlLWFsbC15b3VyLWNyeXB0by_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAxLzExL2V0aGVyZXVtLXVwZ3JhZGUtY291bGQtbWFrZS1pdC1oYXJkZXItdG8tbG9zZS1hbGwteW91ci1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Upgrade Could Make It Harder to Lose All Your Crypto - CoinDesk",
        "content": "Some layer 2s on Ethereum are leading the way to natively integrate AA. StarkWare, the company behind the StarkNet blockchain, is already live with Account Abstraction. Eli Ben-Sasson, the co-founder and president of StarkWare, told CoinDesk that Account Abstraction could be used in the future to “use your facial recognition or biometrics to basically authorize [crypto] payments,” sort of like how FaceID can activate credit card payments for iPhone users. “The infrastructure for doing this is now possible on Starknet,” Ben-Sasson added."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vcHJvdG9zLmNvbS9ldGhlcmV1bS11bmxvY2staW4tbWFyY2gtd29ydGgtdGVucy1vZi1iaWxsaW9ucy1vZi1kb2xsYXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Ethereum unlock in March worth tens of billions of dollars - Protos",
        "content": "Listen to this article.\n\nA massive tranche of ether (ETH) is unlocking soon. During a meeting on December 8, Ethereum developers decided to make staked ETH on Ethereum’s Beacon Chain available for withdrawal with the Shanghai update as early as March 2023. The meeting was ratified last week.\n\nThe Beacon Chain holds $21 billion (over 15.9 million ETH) staked within Ethereum’s Proof-of-Stake (PoS) system. Additional ETH is voluntarily staked into the Beacon Chain daily and cannot be withdrawn until Shanghai activates. So, by the time March arrives, the Beacon Chain will far exceed 16 million ETH.\n\nThe Shanghai update will include five Ethereum Improvement Proposals (EIPs): EIP 3540, EIP 3670, EIP 4200, EIP 4570, and EIP 5450. These proposals describe updates to the Ethereum Virtual Machine (EVM) that will enable withdrawals of staked ether.\n\nEthereum 2 stakes to unlock after Shanghai allows withdrawals\n\nThe PoS Beacon Chain activated on the Ethereum mainnet with the Merge on September 15, 2022. It originally ran on a parallel blockchain and had no role in securing Ethereum’s Proof-of-Work (PoW) blockchain that operated since 2015. Activating the Beacon Chain switched Ethereum to a purely PoS algorithm giving stakers a direct role in confirming transactions.\n\nEthereum founder Vitalik Buterin claimed that Ethereum’s switch to PoS reduced worldwide energy consumption by 0.2%. (Nic Carter contested that figure, arguing that the switch saved a de minimus amount at least lower than 0.07%.)\n\nThe enormity of this Ethereum unlock can’t be overstated with only five crypto assets among thousands having a larger market cap than this tranche.\n\nCurrently, no ETH in the Beacon Chain can be sold but, subject to any withdrawal queues, Beacon Chain funds could become unrestricted for trading shortly after the Shanghai upgrade.\n\nRead more: Here’s why Ethereum 2 staking is risky and increases centralization\n\nThe Merge didn’t include any protocols for withdrawing staked ether from the Beacon Chain. Investors interested in staking had to choose between accepting proxy staking tokens like stETH or cbETH for depositing their ETH into a liquid staking pool. Or they could simply wait for their staked ETH to be unlocked via Shanghai.\n\nEven if a user was wealthy enough to stake the 32 ETH required to activate a solo set of validator keys, that user still wouldn’t have the ability to withdraw ETH from the Beacon Chain. Since its inception, the Beacon Chain has been deposit-only.\n\nLiquid staking pools like Lido theoretically keep their ‘staked ETH’ liquid tokens pegged to ETH. Lido’s Staked ETH token, stETH, typically does a fair job of staying within a few dollars of ETH’s value.\n\nSharding and Ethereum Virtual Machine Object Format delayed\n\nDuring their December meeting, Ethereum developers also discussed the possibility of activating EIP-3540, which would have introduced Ethereum Virtual Machine Object Format (EOF). The EIP describes EOF as “an extensible and versioned container format for EVM bytecode.”\n\nThey agreed to push it back; it seemed too complicated to be ready by March. During their January 5, 2023 meeting, Ethereum core developers agreed to remove EIP-3540 from the Shanghai update and save it for a later upgrade.\n\nProposed post-Shanghai upgrades also include sharding which will increase Ethereum’s scalability by dividing up the blockchain into more manageable pieces. Ethereum developers say sharding will improve the performance of some data-extensive operations like Layer 2 rollups. One proposal, EIP-4844, will introduce proto-danksharding as a way to handle more efficient data ‘blobs.’\n\nIn summary, the Shanghai update will activate as early as March 2023. It will enable withdrawals of tens of billions of dollars worth of staked ETH from the Beacon Chain, something that Ethereum stakers have long anticipated. Time will tell how much of this Ethereum unlock will actually be withdrawn by users and offered for sale on the order books of the world’s exchanges.\n\nFor more informed news, follow us on Twitter and Google News or listen to our investigative podcast Innovated: Blockchain City."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWxheWVyLTItdG9rZW4tcHJpY2VzLXVwLWRvdWJsZS1kaWdpdHMtdGhpcy15ZWFy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Layer-2 Token Prices Up Double Digits This Year - Blockworks",
        "content": "A handful of Ethereum-based layer-2 projects have been on a tear in the past week, with some of the sector’s associated token prices now up considerably in year-to-date (YTD) terms.\n\nTraders are now speculating on a March launch of the next major Ethereum upgrade, dubbed Shanghai, which would enable the withdrawal of staked ether from validators, a planned change that has been anticipated move from industry participants since the Merge.\n\n“Volatility has been at its lowest in the crypto market in the past weeks,” David Cicoria, head of quantitative development at crypto custodian Hex Trust, told Blockworks. “This coupled with the announcement of lower interest rates, Ethereum’s upcoming Shanghai upgrade, and FOMO from some investors has pushed prices up for layer-2 tokens.”\n\nAs such, several projects built around Ethereum are posting double-digit gains including the open protocol — aimed at decentralized exchange order books — Loopring whose token, LRC, is up more than 18% YTD.\n\nOptimism, an EVM-compatible optimistic rollup chain that batch transactions before settling to Ethereum’s mainnet, has seen its OP token rise more than 25% over the same period. Daily transactions for the network hit an all-time high on Monday, etching just below 700,000.\n\nRival optimistic rollup Arbitrum’s daily transaction count has been ranging between 200,000 and 400,000, per data from Nansen.\n\nEthereum liquid staking solution Lido DAO’s token, LDO, is also up an eye-watering 80% since the new year and has continued to post considerable gains in the past week, clocking a 65% gain when viewed over a seven-day period. The project now stands as a top contender for total value locked at $6.5 billion, DeFiLlama data show.\n\nAnd layer-2 scaling solution designed for NFTs using zero-knowledge rollup (zk-rollup) technology, Immutable X, is flashing 23% gains on its token since the new year began.\n\nThe sector seeks to increase the value of Ethereum and related networks by reducing fees, improving scalability and bolstering transaction throughput — often a gripe levied at blockchain infrastructure that optimizes for security and decentralization.\n\nIt comes as digital assets have continued to struggle under the weight of an industry-wide blowout courtesy of FTX in the fourth quarter of 2022, as well as recent questions hanging over Digital Currency Group and its subsidiaries.\n\nThe spot market for most digital assets also experienced a brief reprieve on Monday, sending the price of bitcoin higher on the day, establishing itself above the pivotal $17,000 level.\n\nNone of this impresses Bitcoin maximalists like Samson Mow, Founder and CEO of Pixelmatic, who instead anticipate a market rebound to finally take shape courtesy of bitcoin’s next halving event.\n\n“Ethereum and its layer two tokens are created and tweaked to bring hype and price movement to satiate high-time preference speculators,” Mow told Blockworks. “None of it is very interesting to Bitcoiners.”\n\nCicoria also remains skeptical of the latest upturn: “The crypto market remains fragile, with a lot of unknowns still to consider.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1zaGFuZ2hhaS10ZXN0bmV0LWlzLWV4cGVjdGVkLXRvLWxhdW5jaC1pbi1mZWJydWFyeS1oZXJlcy13aGF0LXlvdS1uZWVkLXRvLWtub3fSAWtodHRwczovL3UudG9kYXkvZXRoZXJldW0tc2hhbmdoYWktdGVzdG5ldC1pcy1leHBlY3RlZC10by1sYXVuY2gtaW4tZmVicnVhcnktaGVyZXMtd2hhdC15b3UtbmVlZC10by1rbm93P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Shanghai Testnet is Expected to Launch in February, Here's What You Need to Know - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn 2022, Ethereum (ETH) was one of the most prominent topics on the cryptocurrency market because of The Merge. The update came to change the altcoin's consensus model from proof of work (PoW) to proof of stake (PoS). It was an episode that went down in blockchain industry history, as it was the first time that a 100% functional network changed its consensus model.\n\nAdvertisement\n\nThis was a big step toward Ethereum 2.0, and more developments are due in 2023. First on the list is the Shanghai hard fork. It aims to withdraw ETH deposited in staking at Beacon Chain, which has been locked since 2020.\n\nThe altcoin development team has set a deadline for this update to occur in March. As with The Merge, a testnet must occur first to ensure that the delivery date is met and that Shanghai happens without any problems.\n\nIn this year's first developer call, they announced that a test will come in February. In addition, they decided to reject any additional Ethereum Improvement Proposals (EIPs) from Shanghai.\n\nDevelopers should incorporate the EVM Object Format (EOF) to rule out delay concerns with the hard fork. This proposal can improve the Ethereum Virtual Machine (EVM) programming environment and help everything run smoothly in the month ending Q1, 2023.\n\nBut preparations for Shanghai did not begin just now.\n\nWhat will be released is a public test network. In December, testing already began with developers in a closed environment. By Jan. 6, the advance had reached block 4,000.\n\nWhat are expectations for Shanghai's arrival?\n\nThe most anticipated factor is the drop in Ethereum's decentralization in staking. This is a major concern for investors in the market's leading altcoin because, since the Beacon Chain era, few crypto companies control the amount of ETH in staking.\n\nWith altcoin leaving these platforms, less centralization should occur. One of the factors that may help this is more investors seeing that, starting in Q2, 2023, ETH staking will have liquidity, and this move may drive more people to decide to invest in helping the network and earn passive income for this service.\n\nIn addition, more shared staking platforms for Ethereum are expected to emerge. Lido DAO has been very successful because it allows small investors to stake the crypto without the need to invest 32 ETH. But this facility has made it the major centralizer of cryptocurrency staking.\n\nOf course, this would not be the fault of the Lido. After all, it is fulfilling its purpose. However, the blockchain market already knows how problematic it is to trust its cryptocurrencies to just one player. In other words, the arrival of more platforms to staking is crucial for this Ethereum process to become more distributed and not concentrated in one company or one cryptocurrency exchange."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9vcHRpbWlzbS1hbmQtYXJiaXRydW0tZmxpcC1ldGhlcmV1bS1pbi1jb21iaW5lZC10cmFuc2FjdGlvbi12b2x1bWXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Optimism and Arbitrum flip Ethereum in combined transaction volume - Cointelegraph",
        "content": "Ethereum layer-2 on-chain activity has been increasing to the extent that the leading two networks now process more transaction volume than mainnet Ethereum.\n\nLayer-2 networks Arbitrum and Optimism have seen an increase in transactions over the past three months. Comparatively, aside from a few spikes, transactions on the Ethereum network have declined by around 33% since late October, according to Etherscan.\n\nThis has enabled the two L2s combined to flip Ethereum for this metric, according to Dune Analytics data.\n\nThe chart shows Ethereum processed over 1.06 million transactions on Jan. 10, whereas Arbitrum and Optimism combined processed over 1.12 million transactions.\n\nAdditionally, Optimism has now surpassed Arbitrum in terms of daily transactions following a steady uptrend in activity since September.\n\nLayer-2 ecosystem analytics website L2beat reported all L2 activity in terms of transactions per second (TPS) surpassed that of Ethereum in October, and has remained above it since.\n\nL2 activity in TPS - l2beat.com\n\nOn Jan. 10, Ethereum processed an average of around 12 TPS, compared to the L2’s average of nearly 16.5 TPS.\n\nArbitrum and Optimism combined represent almost 80% of the entire layer-2 ecosystem, according to L2beat.\n\nArbitrum One remains the market leader in terms of total value locked (TVL) with around $2.34 billion in collateral, giving it a 52.5% market share.\n\nOptimism is in second place with a TVL of $1.28 billion and a 28.6% market share.\n\nAccording to Nansen researcher Martin Lee, decentralized finance (DeFi) protocols are one of the key drivers of the adoption of the Optimism chain.\n\nRelated: Can the Optimism blockchain win the battle of the rollups?\n\nOther layer twos such as zk-rollup StarkNet have also been processing more transactions recently. StarkWare technology also powers other solutions including ImmutableX and dYdX.\n\nIn October, it was reported StarkNet was processing more transactions per week than the Bitcoin (BTC) network.\n\nAdditionally, Starkscan reports the network is at an all-time high in terms of TVL at $5.2 million."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vdGhlZGVmaWFudC5pby9vcHRpbWlzbS10cmFuc2FjdGlvbnMtYXRo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 07:10:54 GMT",
        "title": "Optimism Activity Hits New Highs As Layer 2s Close In On Ethereum - The Defiant - DeFi News",
        "content": "OP Is Up 32% In the Past Week\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nLayer 2 adoption is booming, with Optimism setting new records for activity and the combined transaction volume of optimistic rollups closing in on Ethereum’s mainnet.\n\nOn Jan. 7, Optimism’s daily transaction count hit a new all-time high of almost 700,000, according to Etherscan. The milestone marks a 700% increase in activity since September 2022.\n\n“As blockchain technology is gaining more mainstream recognition, L2s will outshine Ethereum Mainnet, especially for consumer and retail-facing applications and use cases,” Kamado, the CEO of Integral, a decentralized exchange, told The Defiant. “Ethereum mainnet will lean more towards settlement and gear towards institutional use cases such as large transfers and large order transactions.”\n\nOptimism is the second largest Layer 2 by total value locked, representing $1.3B or nearly 29% of the sector’s TVL, according to L2Beat. Its TVL grew 11% over the past week while its OP token rallied by 32%, according to The Defiant Terminal.\n\nOptimism’s transaction volume consistently grew throughout the fourth quarter of 2022, surpassing Arbitrum in December. Arbitrum is currently the top L2, hosting $2.3B or 52% of combined Layer 2 TVL.\n\nBut Arbitrum’s daily transactions peaked at 576,000 in November and have since slumped by half. Transactions hit a low of 160,000 on Jan. 1.\n\nCatching Up To Ethereum\n\nDespite Arbitrum activity receding, the combined transaction volume of Arbitrum and Optimism is coming close to overtaking Ethereum.\n\nArbitrum and Optimism processed 941,000 transactions on Jan. 7, lagging behind Ethereum’s 1.1M transactions by about 15%. A record 1.05M transactions were processed by optimistic rollups on Nov. 8.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nRollups improve Ethereum’s scalability by bundling together transactions on Layer 2 and submitting them in batches for final settlement on the Ethereum mainnet, significantly reducing transaction fees for users.\n\nOptimistic rollups have gained a dominant market share thanks to their high interoperability with the Ethereum Virtual Machine, Ethereum’s core smart contract engine, meaning that developers can easily port their code from mainnet to Layer 2 with minimal changes.\n\nDynamo Patrick of Clip Finance shared a chart showing that total transactions settled on Ethereum grew steadily throughout 2022 in spite of the bear market because of growing L2 adoption.\n\nCombined transaction volume of Arbitrum, Optimism, and Ethereum. Source: Dynamo_Patrick\n\nThe combined on-chain activity of Ethereum L2s and mainnet peaked above 2.5M daily transactions in December. That figure currently sits near 2M, representing a 50% increase year-over-year.\n\n“There is a clear long-term uptrend in the total number of transactions settled on Ethereum,” Patrick wrote."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8xMS9iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoLXRvZGF5LWFyZS1saWtlLXRoZS1lYXJseS1kYXlzLW9mLW5ldGZsaXgtYmxvb21iZXJnLWNvbW1vZGl0eS1zdHJhdGVnaXN0L9IBigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8xMS9iaXRjb2luLWJ0Yy1hbmQtZXRoZXJldW0tZXRoLXRvZGF5LWFyZS1saWtlLXRoZS1lYXJseS1kYXlzLW9mLW5ldGZsaXgtYmxvb21iZXJnLWNvbW1vZGl0eS1zdHJhdGVnaXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Top Bloomberg Strategist Says He’s ‘Shocked’ By Ethereum’s Performance, Details Outlook on ETH and Bitcoin - The Daily Hodl",
        "content": "Bloomberg Intelligence senior macro strategist Mike McGlone says the top two crypto assets by market cap remind him of the early days of Netflix.\n\nIn a new interview with crypto influencer Scott Melker, McGlone says that promising new technologies historically find success over time.\n\nMcGlone predicts Bitcoin (BTC) and Ethereum (ETH) will survive the turbulent market conditions and outperform commodities.\n\n“The key thing is that I like to point out is people are bullish commodities and like to look at cryptos. Commodities have a problem with the elasticity of supply and demand. You will always be able to create more for less unless you expect humans to be stupid. Commodities are stupid. But cryptos are the opposite. You look at the declining supply of Ethereum… The declining supply of Bitcoin… this adoption is still so fractional.\n\nI look at this 5,10 years from now like I remember Netflix when it first came out and I remember when the first day I walked into trading pits in Chicago and said there’s a better way, and this is a better way.”\n\nMcGlone says that the value of Bitcoin and Ethereum are likely to rise in the future, but they will face resistance as long as the stock market declines. Crypto markets have generally mirrored the performance of the S&P 500 (SPX) in the current bear market.\n\n“I fully expect Bitcoin and Ethereum are going to come out ahead, but they still have to be pressured if the stock market goes down.\n\nThe key thing is one of the best-performing assets I’ve been shocked by and still stick with is Ethereum. Ethereum is up 10% this year. Yes, it might give some of that back. But it’s holding that $1,000 support.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY2FwaXRhbC5jb20vZXRoZXJldW0tc2hhbmdoYWktY2FwZWxsYS1wdWJsaWMtdGVzdG5ldC1mZWJydWFyeS1sYXVuY2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Date set for Ethereum's Shanghai Public Testnet: here's the latest details - Capital.com",
        "content": "Part of this upgrade is to allow blockchain validators to withdraw their 32 ether from staking contracts – Photo: Getty Images\n\nThe Ethereum (ETH) Shanghai/Capella upgrade is set to arrive in March 2023 with the Shanghai Public Testnet expected to begin in February.\n\nThis is according to numerous news outlets with regards to the Shanghai upgrade, while U.Today reported the Shanghai Public Testnet is coming next month.\n\nAn aspect of this upgrade is to allow blockchain validators to withdraw their 32 ether from staking contracts.\n\nCurrently those who stake ETH and are a validator cannot withdraw their stake. The Shanghai upgrade will introduce a code that will allow Ethereum Network validators to withdraw this staked ether.\n\nThe upgrade was originally scheduled for launch in September 2023 at the latest. It will also allow withdrawals of staked ether in the Beacon Chain since December 2020.\n\nTwitter profile CroissantEth said on 2 January: “Most recently liquid staking derivatives have had a nice uptrend. This is thanks to the Shanghai upgrade expected in a few months which will enable withdrawals of staked ETH. As withdrawals are enabled, many believe more users will stake their ETH.”\n\nAs of 11:47 GMT on 11 January, ETH was trading at $1,335, up by 0.42% compared with the previous day, according to CoinMarketCap.\n\nETH to USD\n\nHas The Merge made ETH a security?\n\nThe Merge – the move from a proof-of-work (PoW) to a proof-of-stake (PoS) consensus mechanism which took place in September 2022 – may now mean that ETH falls under the category of a security, according to the chair of the US Securities and Exchange Commission (SEC) Gary Gensler.\n\nGensler, speaking on 15 September 2022, said cryptocurrencies and intermediaries that allow holders to “stake” their coins might pass the Howey test, which is a way to assess if a transaction qualifies as an “investment contract” and is therefore considered a security. He said:\n\n“From the coin’s perspective… that’s another indicia that under the Howey test, the investing public is anticipating profits based on the efforts of others.”\n\nHowever, at the Financial Times Crypto and Digital Assets Summit: Winter Edition on Monday 28 November 2022, Rostin Behnam, chair of the Commodity Futures Trading Commission (CFTC) said the opposite to Gensler.\n\nBehnam detailed that he felt numerous cryptos were securities, but both bitcoin (BTC) and ETH were commodities.\n\nBTC to USD\n\nWhat is your sentiment on BTC/USD? 72057.75 Bullish or Bearish Vote to see Traders sentiment! Market sentiment: Bullish Bearish 84% 16% You voted bullish. You voted bearish. Give BTC/USD a try Start trading Start trading Start trading or Try demo\n\nWithdrawals staked on ETH increases in run-up to Shanghai\n\nDavid Alexander of Binance Labs, the venture-capital arm of crypto exchange Binance said towards the end of 2022 that as withdrawals staked on ETH “now have a tentative release date, this has led to increased staking activity, the highest monthly volume since April”."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYXJlLXRoZS1ldGhlcmV1bS1raWxsZXJzLXN0aWxsLWRlYWRseS_SAVlodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L2FyZS10aGUtZXRoZXJldW0ta2lsbGVycy1zdGlsbC1kZWFkbHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Are the Ethereum Killers Still Deadly? - Finance Magnates",
        "content": "Back in 2021, and heading into 2022, there was a dominant crypto narrative around the idea of Ethereum killers.\n\nThis referred to rival Layer 1 blockchains that were geared towards smart contract transactions and could be used for all the things that Ethereum was known for, enabling networks of decentralized applications.\n\nEthereum killers would run DeFi, facilitate NFT creation and trading, and open up new landscapes for web3 development.\n\nWhat made these competitors a supposedly existential threat to Ethereum was that they would be so technically superior, cheaper more efficient and at least equally secure, that, with crypto still in a formative stage, Ethereum itself might become obsolete.\n\nThe Takeover Never Happened\n\nLooking back from the start of 2023, we can see that this proposed takeover, after which Ethereum would be relegated to the sidelines, never occurred.\n\nIn the heat and euphoria of an extended bull run, ambitious proclamations can sound viable, but as sentiment shifted ever downwards throughout 2022, there was a sense that time had run out on the Ethereum killers’ opportunities to take the top spot.\n\nWhat’s more, Ethereum successfully, after many delays and amid constant doubt, completed the Merge, a process which saw it switch from a Proof of Work to a Proof of Stake consensus mechanism.\n\nThis shift sets the path for Ethereum to scale better, and, eventually, bring down its unsustainable high transaction costs.\n\nSupporters of alternative blockchains will point out that their preferred networks can already scale better than Ethereum and have lower transaction costs built in, and they’d be right to do so: the entire point of an Ethereum killer is that it has better tech than its rivals.\n\nHowever, with hugely significant network effects already on Ethereum’s side, simply enabling the capacity for future improvements is enough to further embed its dominant position.\n\nAs we tentatively begin to consider the possibilities that might arise in a future bullish period, where does this all leave the Ethereum killers?\n\nSolana\n\nA few weeks ago, Solana looked for the count. Having crashed in price from an all-time high of around $260 down to $8 briefly, the network was suffering partly from having been favored by the disgraced Founder of FTX, Sam Bankman-Fried.\n\nTwo of the network’s top NFT projects, DeGods and y00ts, were migrating to other blockchains, and previous criticisms of the network’s unreliability and lack of robust decentralization remained unresolved.\n\nHowever, since then, there has been a much-needed blast of frivolity (and profit-taking) thanks to airdrops of the ridiculously-named, Solana-based BONK token, a supportive tweet from the Founder of Ethereum Vitalik Buterin, and an upwards jump in the price of SOL.\n\nCrypto is a deeply unpredictable space in which the atmosphere can flip overnight via surreal triggers that seem to come out of nowhere, and that’s exactly what is happening with Solana.\n\nThat said, such shifts are not always superficial, the substance of Vitalik’s tweet, that Solana has a ‘smart developer community’ and has been cleansed of ‘awful opportunistic money people’, was well received, and it seems increasingly unlikely that the lights have gone out for good on Solana.\n\nThe network still has a loyal community, particularly (and despite the departures of DeGods and y00ts) when it comes to its NFT ecosystem, and it looks capable of riding out current distress.\n\nCheck out the recent London Summit session on \"To Crypto or Not to Crypto: Will Crypto Fizzle Out or Here To Stay.\"\n\nCardano\n\nUnlike Solana, Cardano is not associated with the collapses and scandals of 2022, but nonetheless saw its price crash dramatically throughout the year just gone. In sync with Solana, January has brought Cardano an outsized price boost.\n\nIt’s striking that both Solana and Cardano prices should break out at the same time, since they are, arguably, the two most prominent Ethereum rivals, and perhaps this coupled competitive action is a shape of things to come.\n\nWhere Cardano is distinct, though, is that it now is looking at tackling some very specific real-world problems, perhaps taking Cardano down a unique path.\n\nMost notably, there are Cardano projects working on using the blockchain to enable self-custodial digital identity solutions, and there is also a strong emphasis on reaching new users in Africa.\n\nAtala Prism and IAMX are examples of the former while World Mobile utilizes Cardano for its work in rural Africa.\n\nThe Layer 2 Factor\n\nThe other alternative option for developers, besides utilizing a so-called Ethereum killer, such as Solana or Cardano, is to build on a Layer 2 solution.\n\nLayer 2 refers to a secondary blockchain built on top of or alongside a main blockchain, which takes transactions off the main network to improve efficiency, before finally settling transactions back to the base layer.\n\nPrime among these is Polygon, which operates alongside Ethereum, and recently partnered with Mastercard to become the network of choice for the finance company’s upcoming artist incubator program.\n\nThis news comes after a period in which a stream of famous brands have opted to use Polygon for their web3 strategies.\n\nLooking around the various Layer 1s and sidechains, a possible scenario now starts to resolve into view, sketching out the direction in which smart contract blockchains may be heading.\n\nEthereum looks firmly placed, but activity relating to incoming brands may take place on Polygon, while Arbitrum is another notable Layer 2 option.\n\nMeanwhile, Solana and Cardano look likely to remain relevant, but rather than superseding Ethereum (which was always a tall order), can instead start to define their own specialties and niche applications.\n\nBeyond these protocols, further alternatives are in the mix too, including Avalanche and BNB Chain, and they should be kept in mind when the market picks up, always remembering that narratives can shift quickly."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjAwNjI1L2JpdGRhby1sYXVuY2hlcy10ZXN0bmV0LWZvci1ldGhlcmV1bS1sYXllci0yLW5ldHdvcmstbWFudGxl0gFjaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjAwNjI1L2JpdGRhby1sYXVuY2hlcy10ZXN0bmV0LWZvci1ldGhlcmV1bS1sYXllci0yLW5ldHdvcmstbWFudGxl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "BitDAO launches testnet for Ethereum Layer 2 network Mantle - The Block",
        "content": "BitDAO has launched the testnet for its modular Ethereum Layer 2 network project called Mantle with 37,000 developers already signed up for the launch, the DAO stated on Tuesday.\n\nDubbed “Wadsley,” the testnet will enable Mantle to test and implement new features for the chain before the mainnet launch scheduled for later in the year. The testnet is available to the public and developers have been urged to sign up to test their apps on the chain.\n\nBitDAO announced Mantle in November as a modular Ethereum Layer 2 network. Modular networks have separate layers for handling network functions such as consensus, transaction execution and settlement. They are a newer take on blockchain design that is different from older monolithic chains where all network functions occurred on the same base layer.\n\nBitDAO’s announcement on Tuesday reiterated that Mantle will deliver faster finality at cheaper transaction costs. The chain will also utilize multi-party computation, the announcement added. This type of computation sees the use of nodes specially designed to handle off-chain transactions correctly. Multi-party computation is one of the ways Layer 2 networks try to minimize the risk involved in transactions executed outside the base layer of a blockchain network.\n\nBitDAO token utility\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe Mantle launch is also expected to boost the utility of BitDAO’s governance token, called bit. This is because bit will function as the native token of the Layer 2 network. Improving bit utility has become a major focus for the DAO. The community voted in favor of a $100 million token buyback in December 2022.\n\nA BitDAO spokesperson told The Block that using bit as the native token for Mantle will foster the growth of the DAO’s ecosystem. BitDAO is an outlier in the DAO space as it is set up to support a single DeFi project as is the case with most DAOs. Instead, BitDAO is an investment DAO that seeks to grow its ecosystem by supporting a network of projects. It holds the second-largest treasury among DAOs with $1.9 billion currently in its reserves.\n\n“A large ecosystem of partners already exists and will continue to grow within BitDAO. Mantle is the blockchain that binds all of this together and helps build value for each moving part,” said a BitDAO spokesperson."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyZXVtLWNhcmRhbm8tcmlzZS1jcnlwdG8tcmFsbHktY29udGludWVzLTEyMTIwOTQ0Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Crypto prices: Bitcoin, ethereum and cardano rise - Yahoo Finance UK",
        "content": "Cryptocurrency Cardano is currently basking in the limelight, with a 25% surge in the past seven days. Photo: Getty (Dennis Diatel Photography via Getty Images)\n\nThe cryptocurrency market hit the ground running in 2023, shrugging off the tragedies of the previous year with some tokens posting double digit gains in the past week.\n\nTop 10 cryptocurrencies such as ethereum (ETH-USD) and cardano (ADA-USD) have gone green this week, with bitcoin (BTC-USD) also steadily climbing since the beginning of the year.\n\nCheck: Crypto live prices\n\nOn Wednesday, the cryptocurrency market capitalisation was at $895bn (£738bn), a rise of around 1% in the last 24 hours, according to Coingecko.\n\nBitcoin was above the $17,000 mark, up 4.7% in the past week to $17,468 as of the time of writing.\n\nADVERTISEMENT\n\nEthereum, the second largest cryptocurrency by market cap, posted gains of over 10% in the past week, to $1,336.\n\nRead more: How crypto fell to earth in 2022: Eight charts that tell the story of a cruel crash\n\nMemecoin dogecoin (DOGE-USD) spiked 9.5% in the past week, to $0.077.\n\nCardano made the most gains with a 25% surge in the past seven days to $0.316.\n\nCardano founder Charles Hoskinson took to Twitter to discuss the rally.\n\nReferring to an upcoming update for the smart contract blockchain he said: \"Just you wait until CIP 1694 and the MBO unlocks the community.\n\n\"Millions of people working together for growth and utility.\"\n\nJust you wait until CIP 1694 and the MBO unlocks the community. Millions of people working together for growth and utility — Charles Hoskinson (@IOHK_Charles) January 8, 2023\n\nThe Cardano \"Voltaire Upgrade\" will see millions of people collaborating for the growth and utility of ADA, the blockchain's native cryptocurrency, according to Hoskinson.\n\nBut the early year rally has been overshadowed by signs of ill-health in the burgeoning industry.\n\nCoinbase (COIN) has been forced to slash its workforce and is closing the bulk of its operations in Japan as part of a move to adjust international investment amid a slump in the digital-asset sector.\n\nStory continues\n\nThe crypto market took a reputational hit in 2022 after the collapse of the FTX cryptocurrency exchange.\n\nRead more: Crypto: Can stablecoins keep dollar peg after terra debacle?\n\nThe Bahamas-based exchange imploded in early November 2022, bringing down the once crypto-tycoon Sam Bankman-Fried.\n\nThis added to the industry's struggles after the fall of Terra's UST algorithmic stablecoin in the summer of 2022.\n\nTerra's fall led to the collapse of several crypto firms and resulted in a slump in the sector's combined market cap, which fell by over $2tn in 2022.\n\nWatch: Web3 sectors to watch in 2023 | The Crypto Mile"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2FyYml0cnVtLW9wdGltaXNtLWV4Y2VlZC1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Arbitrum and Optimism Transactions Now Exceed Ethereum Mainnet - Blockworks",
        "content": "Ethereum layer-2 rollups Arbitrum and Optimism have seen an uptick in their daily transactions over the past few months. Ethereum, meanwhile, is seeing a slight downtrend.\n\nArbitrum and Optimism are optimistic rollups designed to reduce the cost of transactions for the use of Ethereum dapps.\n\nBoth platforms have seen an uptick in daily active users recently, data compiled by Blockworks Research shows, with Optimism recently overtaking Arbitrum for daily active addresses and transactions per day.​​\n\nLoading Tweet..\n\nMartin Lee, data journalist at Nansen, told Blockworks that as time goes by, these ecosystems are becoming more developed — which may be one of the reasons as to why they are seeing a spike in active users and transactions.\n\n​”DeFi protocols GMX for example is one of the key protocols driving Arbitrum’s active users and transactions,” Lee said. “Sushiswap’s activity on Arbitrum is seeing an increase as well due to the recent spike and revival of MAGIC,” a gaming-related token.\n\nThe number of transactions on Arbitrum has been steadily increasing since its Nitro upgrade in August, information on blockchain analytics platform Nansen shows.\n\nThis upgrade, which was completed prior to the Ethereum Merge, increased Arbitrum’s throughput capacity by more than 7-to-10 times that of the Ethereum mainnet — hastening transaction speeds and reducing costs and requirements to run nodes.\n\nThese improvements may also be the reason why many new projects have decided to launch on Arbitrum.\n\nSome of the most recent projects that have been onboarded to the network include: Bebop DEX, which specializes in one-to-many and many-to-one token trading; automated money flow provider Cask Protocol; on chain-asset management platform Factor; and NFT platform OpenSea.\n\nIn the case of Optimism, Lee says that, “we’re seeing a similar trend where DeFi protocols are one of the key drivers of adoption of the chain — Perpetual Protocol, Velodrome, Pika Protocol. Another key driver for both chains is Galxe, the on-chain identity and credentials project.”\n\nThe ecosystems also have the two highest total value locked (TVL) across all layer-2 networks, with Arbitrum having a TVL of $2.34 billion, making up over 52% of the entire market share. Optimism has a TVL of $1.27 billion, totaling almost 30% of the entire market share, according to L2beat data.\n\nArbitrum does not yet have its own governance token, but Optimism’s OP token has posted double-digit gains since the start of 2023.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMS8xMC9ldGhlcmV1bS1zb2Z0d2FyZS1maXJtLWNvbnNlbnN5cy10by1jdXQtdXB3YXJkcy1vZi0xMDAtc3RhZmYtYXMtY3J5cHRvLWJlYXItbWFya2V0LXRha2VzLWFub3RoZXItY2FzdWFsdHkv0gGbAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzEwL2V0aGVyZXVtLXNvZnR3YXJlLWZpcm0tY29uc2Vuc3lzLXRvLWN1dC11cHdhcmRzLW9mLTEwMC1zdGFmZi1hcy1jcnlwdG8tYmVhci1tYXJrZXQtdGFrZXMtYW5vdGhlci1jYXN1YWx0eS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Software Firm ConsenSys to Cut Upwards of 100 Staff - CoinDesk",
        "content": "It’s adding to what's already a bad week for crypto employment, with U.S. exchange Coinbase also announcing cuts of 20% of its staff, or around 950 jobs, on Tuesday. CoinDesk estimates nearly 27,000 jobs have been lost across the industry since April of last year."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hLWtleS1jaGFuZ2UtaW4tZXRoZXJldW0tb3B0aW9ucy1wcmljaW5nLWhpbnRzLXRoYXQtZXRoLXByaWNlLWNvdWxkLXJpc2UtYmV5b25kLTEtMzUw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "A key change in Ethereum options pricing hints that ETH price could rise beyond $1,350 - Cointelegraph",
        "content": "The price of Ethereum’s native cryptocurrency, Ether (ETH), gained 10.2% from Jan. 4 to Jan. 10, breaching the $1,300 resistance without much effort. But has the Ether price move cast a light on whether the altcoin is ready to begin a new uptrend?\n\nWill Ether’s former resistance level turn to support?\n\nAfter testing the $1,200 support on Jan. 1, the eight-week ascending channel has displayed strength, but Ether bulls fear that negative newsflow might break the pattern to the downside.\n\nEETH/USD price index, 12-hour. Source: TradingView\n\nDespite the positive price trend, the sentiment around Ether and other cryptocurrencies hasn’t been very enticing. For example, Xiao Yi, the former Chinese Communist Party secretary of Fuzhou, confessed on Jan. 8 to “acting recklessly” in support of crypto mining. Xiao spoke from what appeared to be a prison, apologizing for causing “grave losses” to the Fuzhou region.\n\nOn Jan. 10, South Korean tax agents reportedly raided crypto exchange Bithumb’s offices to explore a potential tax evasion case. On Dec. 30, Park Mo — an executive at Bithumb’s parent company — was found dead, though he was under investigation for embezzlement and stock price manipulation.\n\nAlso on Jan. 10, Cameron Winklevoss, co-founder of the Gemini exchange, issued an open letter to Barry Silbert, CEO of Digital Currency Group. In the letter, Winklevoss makes some serious fraud accusations and requests that the Grayscale fund management holding company dismiss Silbert to provide a resolution for Gemini’s Earn users.\n\nThe ongoing crypto winter left another scar on Jan. 10 as the leading U.S. cryptocurrency exchange, Coinbase, announced a second round of layoffs, impacting 20% of the workforce.\n\nHowever, the exchange’s CEO, Brian Armstrong, tried to minimize the damage by stating that Coinbase remains “well capitalized” and tranquilize investors with business-as-usual messages.\n\nConsequently, some investors believe Ether could revisit prices below $600 as fear remains the prevalent sentiment. For instance, trader Crypto Tony expects the current triangle formation to cause another “leg down later this year.”\n\n$ETH / $USD - Update\n\n\n\nUnless we take out $2,200 on the macro level I am treating this as consolidation for a B or X wave, before we get one more leg down later this year\n\n\n\nVolume is contracting and I also expect this to dwindle down lower. Pay attention pic.twitter.com/LTik7GXEYa — Crypto Tony (@CryptoTony__) January 10, 2023\n\nLet’s look at Ether derivatives data to understand if the bearish newsflow has caused traders to avoid leverage longs and neutral-to-bullish option strategies.\n\nLeveraged bulls lagged the recent rally\n\nRetail traders usually avoid quarterly futures due to their price difference from spot markets. Meanwhile, professional traders prefer these instruments because they prevent the fluctuation of funding rates in a perpetual futures contract.\n\nThe two-month futures annualized premium should trade between +4% and +8% in healthy markets to cover costs and associated risks. When the futures trade at a discount versus regular spot markets, it shows a lack of confidence from leverage buyers, which is a bearish indicator.\n\nEther 2-month futures annualized premium. Source: Laevitas\n\nThe chart above shows that derivatives traders using futures contracts exited the negative premium on Jan. 1, meaning the extreme bearish sentiment is gone. However, the current 1.5% premium remains below the 4% threshold for a neutral market. Still, the absence of leverage buyers’ demand does not mean traders expect a sudden market downturn.\n\nFor this reason, traders should analyze Ether’s options markets to understand whether investors are effectively pricing in odds of a $600 retest.\n\nOptions traders have stopped overcharging for downside protection\n\nThe 25% delta skew is a telling sign when market makers and arbitrage desks are overcharging for upside or downside protection.\n\nIn bear markets, options investors give higher odds for a price dump, causing the skew indicator to rise above 10%. On the other hand, bullish markets tend to drive the skew indicator below -10%, meaning the bearish put options are discounted.\n\nEther 60-day options 25% delta skew: Source: Laevitas\n\nThe delta skew currently sits at 11% after flirting with the neutral range on Jan. 9, meaning that whales and market makers no longer charge excessive premiums for protective put options. That is a stark contrast from late 2022 when those trades were running up to 19% more costly than equivalent bullish strategies using options.\n\nRelated: Navigating the crypto crash can be challenging, but there are tools to help you in 2023\n\nOverall, both options and futures markets point to pro traders becoming more confident and increasing the odds of $1,300 becoming a support level. So, even if the newsflow doesn’t seem appealing, traders are unwilling to add bearish bets, which might fuel further positive momentum for Ether.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAxLzEwL2J1bGxpc2gtc2lnbmFsLWZsYXNoaW5nLWZvci10d28tb2YtZXRoZXJldW1zLWJpZ2dlc3Qtcml2YWxzLXNheXMtY3J5cHRvLWluc2lnaHRzLWZpcm0v0gF7aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDEvMTAvYnVsbGlzaC1zaWduYWwtZmxhc2hpbmctZm9yLXR3by1vZi1ldGhlcmV1bXMtYmlnZ2VzdC1yaXZhbHMtc2F5cy1jcnlwdG8taW5zaWdodHMtZmlybS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Bullish Signal Flashing for Two of Ethereum’s Biggest Rivals, Says Crypto Insights Firm - The Daily Hodl",
        "content": "A leading analytics firm says that crypto trader sentiment surrounding Cardano (ADA) and Binance Coin (BNB) suggests that both assets could be poised for rallies.\n\nSantiment notes that the crypto community has a bearish sentiment regarding both Ethereum (ETH) competitors, compared to a bullish crowd outlook on ETH and payments network XRP.\n\n“With crypto market caps bouncing very much in independent directions, we’re seeing notably euphoric crowd sentiment on XRP and ETH. Traders are less interested in BTC, BNB, and ADA. Historically, bearish sentiment projects perform better on average.”\n\nADA is trading at $0.311 at time of writing. The eighth-ranked crypto asset by market cap is down more than 6% in the past 24 hours.\n\nBNB is changing hands at $272.49 at time of writing. The fourth-ranked crypto asset by market cap is down over 2% in the past day.\n\nSantiment says the altcoin price rallies that happened over the weekend went against crowd expectations, which the firm says is a common occurrence.\n\n“As we have seen time and time again, markets move in the direction of the crowd’s unlikeliest expectation.”\n\nSantiment also notes that crypto trading volume has hit its lowest level in over two years.\n\nExplains the analytics firm,\n\n“There are two ways of looking at crypto’s 2.5-year low level of trading volume:\n\nLess resistance and sell walls, leading to whales pumping prices easily\n\nUtility is limited with less order book activity, which could cap long-term bull run potential.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL25ld3MvbGVhcm4taG93LW1vZHVsYXItbGF5ZXItMi1ibG9ja2NoYWlucy1hcmUtaGVscGluZy1kZXZlbG9wZXJzLWJ1aWxkLXNlY3VyZS1kYXBwcy1mb3ItdGhlLXdlYjMtZnV0dXJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Learn how modular Layer-2 blockchains are helping developers build secure dApps for the Web3 future - Cointelegraph",
        "content": "Arguably the most popular blockchain amongst developers building decentralized applications (dApps), the Ethereum Network is credited with introducing the Web3 community to innovations like smart contracts while maintaining robust security standards.\n\nHowever, in order to solve Ethereum’s scalability issue, a new type of Layer-2 (L2) blockchain was introduced that relies on the Ethereum Mainnet (Layer-1) for its security but processes transactions on separate third-party networks in order to increase throughput speeds.\n\nEVM compatibility for higher transaction speeds\n\nImportantly, developers had to ensure that these L2 blockchains were compatible with the Ethereum Virtual Machine (EVM), a run-time environment where Ethereum’s application code and smart contracts are executed, EVM compatibility ensures that smart contracts can be executed in a cross-chain environment, enabling Web3 developers to build dApps that can interact seamlessly with each other.\n\nAs a result, a number of decentralized finance (DeFi), gaming, and social dApps are built and hosted on L2 blockchains, marking a decided shift in Web3 developers’ preferences away from the Ethereum mainnet.\n\nEventually, L2 blockchains started innovating with new solutions and technologies that could reduce transaction fees or gas and ramp up the network’s speed to cater to a wider audience. However, L2 blockchains have found it difficult to achieve hyper-scale without compromising on security standards because of the bridges or sidechains they employ. Therefore, in order to achieve both hyper-scale performance and Ethereum’s unparalleled security, a new kind of modular L2 blockchain had to be envisaged to provide a future-proof building platform for Web3 innovators.\n\nNext-gen Layer 2 solutions\n\nIntroducing Mantle - a high-performance Ethereum Layer-2 network that leverages a separate decentralized data availability layer and combines it with Ethereum roll-ups to open up even more use cases for developers building on the Mantle ecosystem.\n\nBy separating execution, data availability, and transaction finality into separate layers, Mantle offers Ethereum-level security while increasing transaction speeds through reduced inefficiencies. In fact, transaction-related data is solidified on Mantle’s L2 before being broadcasted onto Ethereum, effectively trimming the challenge period and providing faster finality to the end user. In this way, Mantle is able to effectively utilize Ethereum’s massive trust network while eliminating possible blockspace congestion through its modular design.\n\nAs a result of these improvements, game developers can now build more elements on-chain without worrying about high transaction fees or struggling with poor end-user experience. Even advanced DeFi protocols that provide margin trading and other complex DeFi strategies can be developed and operated at a low cost, paving the way for much wider user adoption.\n\nA product of BitDAO, Mantle is one example of how L2 blockchains can make Web3 technology more accessible. Moreover, the project shows how a blockchain built by a community-owned DAO can leverage member feedback and crowdsourced decision-making to constantly upgrade.\n\nAs more users and developers gravitate towards platforms like Mantle, the future of Web3 will focus more on modular L2 blockchains that can offer Ethereum’s trust while delivering lightning-fast speeds.\n\nMaterial is provided in partnership with Mantle"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtYW5hbHlzaXMtZm9yLWphbnVhcnktMTHSAT5odHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLXByaWNlLWFuYWx5c2lzLWZvci1qYW51YXJ5LTExP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Analysis for January 11 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBears remain more powerful than bulls, according to the CoinMarketCap ranking.\n\nAdvertisement\n\nETH/USD\n\nThe rate of Ethereum (ETH) has declined by $0.08 over the last 24 hours.\n\nOn the hourly chart, the rate is about to close below the local support level at $1,328. If buyers fail to seize the initiative, the accumulated energy might be enough for a continued correction to the critical zone of $1,300.\n\nOn the bigger time frame, the price has made a false breakout of yesterday's peak at $1,345 against high trading volume. If the closure happens near the $1,320 mark with no long wicks, the fall is likely to continue to the $1,310 zone.\n\nEthereum (ETH) keeps trading in the bullish zone on the daily chart against Bitcoin (BTC).\n\nUntil the rate is above the 0.076133 mark, buyers are more powerful than sellers. Likewise, traders have a chance to see a return to the 0.077 area shortly.\n\nEthereum is trading at $1,324.80 at press time."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmZpbnRlY2huZXh1cy5jb20vc28tZ2FyeS1hcmUtY3J5cHRvY3VycmVuY2llcy1zZWN1cml0aWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "So Gary, are cryptocurrencies securities? - Fintech Nexus",
        "content": "The regulatory context for cryptocurrencies continues to be vague, with many considering it a significant barrier to the mainstream development of the sector.\n\nAt the center of the issue for some jurisdictions (the U.S. specifically) is the definition of whether they are securities.\n\nMike Castiglione, Director of Regulatory Affairs and Digital Assets at Eventus\n\nWhile much of the world has decided on its definitions, the SEC continues to grapple with the idea, caught in endless battles with Ripple and additional cases.\n\n“One of the big questions is, why do we define this thing? It’s an emergent technology. It’s still being applied to the real world, so what’s the value of defining it?” said Mike Castiglione, Director of Regulatory Affairs for Digital Assets at Eventus. “The answer is to align incentives better so businesses can understand the rules.”\n\nThe year ahead could bring several defining conclusions on this matter, which could shape the crypto world as we know it.\n\nEurope says, ‘No’\n\nIn late November 2022, Belgium’s Financial Services and Markets Authority (FSMA) made their conclusive announcement that bitcoin, ethereum, and other decentralized coins are not securities. The opinion was a result of the introduction of a “stepwise plan” applying a series of questions as to the token’s functionality to define them on a case-by-case basis.\n\nAmong other parameters, the report accompanying the announcement stated, “If there is no issuer, as in cases where a computer code creates instruments and this is not done in execution of an agreement between issuer and investor (for example, bitcoin or Ether), then in principle the Prospectus Regulation, the Prospectus Law and the MiFID rules of conduct do not apply.”\n\nYves Longchamp, Head of Research at SEBA Bank\n\nThis does not leave the tokens exempt from all regulation, but it resolves a defining issue surrounding digital currencies that has the SEC stumped.\n\nBelgium is one of many jurisdictions to come to a similar conclusion.\n\n“In the Swiss law, you fundamentally have three types of currency,” said Yves Longchamp, Head of Research at SEBA Bank. “You have a payment token, you have utility tokens, and you have security tokens. We see all these layer one cryptocurrencies like bitcoin and ethereum are either payment tokens or utility tokens.”\n\nHe explained that to acquire this definition, the tokens are seen as currencies in a “digital country.” This extends to the introduction of staking (in the case of ethereum) as they are considered similar to bank deposits gaining interest.\n\n“A lot of these definitions, whether commodity or security, hinge on whether someone has a right to the profits of an entity or profits of the company,” said Castiglione, commenting on the U.S. problem. “Another part is can you transfer it? Is there a secondary market in the crypto asset?”\n\n“Additionally, whether something is a security or a commodity, there are rules about how you can treat investors, purchasers, or issuers in the marketplace. However, there are activities, irrespective of the definition, that are illegal and against regulations.”\n\nThe U.S.’s Ongoing Battle\n\nChairman of the SEC, Gary Gensler, among others, continues to debate the definition. On multiple occasions, the SEC has attempted to prove statements that various cryptocurrencies are securities. (Note: Gensler has admitted that bitcoin is not)\n\nHowever, on Dec. 13, 2022, the Commodity Futures Trading Commission (CFTC) of the United States defined bitcoin, ethereum, and Tether, among others, definitively as commodities. This statement was included as part of the filing against FTX.\n\nOne would assume that this settles matters. Alas, this is not the case.\n\nThe thorn in everyone’s side\n\nA conversation on the classification of cryptocurrencies would not be complete without a mention of Ripple.\n\nThe SEC has been caught in a seemingly endless battle following a case filed in December 2020 where they stated that Ripple was selling unregistered securities. A ruling is hoped to be passed in early 2023.\n\nAccording to the SEC, on applying the Howey test to XRP, the coin could be considered a security. They have determined that the business, Ripple Labs, sold the tokens, and investment in the tokens would constitute an investment in a joint enterprise. Due to the marketing efforts and supply manipulation, investors could have expected the value of their investment to rise.\n\nThe case is significant because many consider the ruling to be definitive of a decision on the rest of the digital token industry. Regardless of the verdict, it could provide clarity on which others can base their model. However, many are concerned that an unfavorable ruling may constrict the development of the crypto industry.\n\nThe deadline for judgment is set for late January 2023.\n\nEthereum’s Merge created confusion\n\nBefore the CFTC’s statement, ethereum was also thrust into the SEC’s firing line due to their shift to a Proof of Stake consensus mechanism, an event titled “The Merge.”\n\n“There seems to be an agreement that bitcoin is a commodity, therefore not a security. Why? Because we don’t know who the issuer is. It’s fully decentralized right now,” said Castiglione.\n\n“On the other side, there seems to be an agreement that the ICOs, or initial coin offerings that you saw in 2017, are securities. There’s a regulatory mess that came with that because that looked like organized, defined entities issuing tokens to raise funds to develop their protocol and develop their business. So that looked very much like security.”\n\n“Then there’s a theory from the SEC that a token can morph. It can start as a security. And then, if it’s sufficiently decentralized, it could lose this classification.”\n\nA “security” stamp was staved off by apparent decentralization.\n\nEthereum, in its infancy, was wrapped up in the debate due to this ICO issue. The coin prevailed, but due to the Merge in September, their classification was brought back into question. The shift of consensus mechanism found much of the staking activity to reside within the US. This was used in an insider trading lawsuit against Ian Balina to define ethereum, once again, as a security.\n\nRELATED: Merge happened; now what?\n\nUltimately the community has rejected this definition; however, it could mark a deficiency in the definition to date. The Howey test, traditionally used to make the determination, may not be up to the task given the blockchain development.\n\nWhere do we go now?\n\n“There are many ways this can go,” said Castiglione.\n\n“Scenario one is we muddle through still, which is doable but costly. If you don’t know whether there’s a referee on the field or what rules the referee will call, it’s just hard to operate with competence.”\n\n“Scenario two is that all of this is adjudicated by the courts, so there is more precedent about how to define a crypto security versus commodity. But that can be lengthy and costly, and confrontational. The court option would probably come in response to an enforcement action that someone decides to fight.”\n\n“Scenario three involves better definitions based on legislation. In the current environment, there’s consensus that any legislation should come with better definitions, and getting this right is a key element”.\n\nCastiglione explained that both the Digital Commodities Exchange and the U.S. Token Taxonomy bill attempt to clarify this. He believes 2023 will bring a more structured approach that could assist the mainstream adoption of crypto.\n\n“In the US, several bipartisan pieces of legislation will be reintroduced in early 2023. The main thrust is how to assign regulatory responsibilities between the Securities and Exchange Commission (SEC) and Commodities Futures Trading Commission (CFTC).”\n\n“The core lesson is that regulation is coming. U.S.-based firms can rebuild trust by proactively being transparent and verifying they are following the hard-learned compliance lessons from other, non-crypto financial crises.”"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vYXBwbGVtYWdhemluZS5jb20vbWFzdGVyaW5nLXRoZS1ldGhlcmV1bS1hbmQtaXRzLWJsb2NrY2hhaW4vNTU2MzjSAU1odHRwczovL2FwcGxlbWFnYXppbmUuY29tL21hc3RlcmluZy10aGUtZXRoZXJldW0tYW5kLWl0cy1ibG9ja2NoYWluLzU1NjM4L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Mastering the Ethereum and its Blockchain - AppleMagazine",
        "content": "Ethereum is a platform that provides comprehensive trading mechanisms, oracles, and smart contracts. Websites like the Ethereum Code app cater their UI and strategies for experienced and new bitcoin traders. The platform has paid extraordinary attention to detail while designing its user interface. The below-mentioned portion will focus on how it works and the power of its blockchain to redefine value chains and transform the global finance industry.\n\nBlockchain technology has progressed exponentially at an unbelievable rate over the past few years, with Bitcoin being the first application of blockchain usage. Ethereum came into play in response to bitcoin’s inability to process transactions without fees.\n\nWhen running on Ethereum, the dApps developers are not limited to functions that a conventional blockchain such as bitcoin can offer. For example, rather than being limited to only processing payments, Ethereum allows developers to create intelligent contracts supporting applications such as supply chain tracking.\n\nEthereum’s supply chain management\n\nSupply chains are a core part of the global economy, and their growth and expansion require networks that ensure fast information flow in real time for all involved parties. Supply chains can be found in almost every industry, from manufacturing to logistics and everything in between. Blockchain technology can completely revolutionize supply chains by making them more efficient while reducing costs and increasing trust between stakeholders.\n\nBuilding decentralized apps\n\nDecentralized apps (DAPPs) are the most successful use case of the Ethereum blockchain. Unlike conventional apps, which depend on an app store, a mobile app store, or another centralized service, they can be created and hosted in the blockchain. Many of these applications have resulted in increased cooperation between people, contract automation, and trust among parties involved in a transaction.\n\nThe value chain is just a transfer chain\n\nThe single-asset blockchain (also known as the supply chain blockchain) can track any transaction without ever having to trust any third-party intermediary. This direct flow of data within the blockchain is known as a “transaction chain, and if one entity within the chain would be able to become corrupted, then malicious actors could potentially steal or manipulate the chain also. As a result, it can lead to a loss of trust and reliability in an organization.\n\nBehind Ethereum’s blockchain\n\nEthereum offers an open, general, public blockchain platform that allows developers to build and deploy decentralized applications with various scripting languages, databases, and utilities. In addition, the customized blockchains can run complex, intelligent contracts, and formal verification techniques.\n\nDecentralized world\n\nAlthough Ethereum has limited bandwidth compared to the general mass market, people can use blockchain-powered platforms for big-scale web hosting services. Companies can achieve it by adding more nodes into the network, which helps improve the efficiency at which transactions are processed. However, it will also require infrastructures of transaction processing nodes that provide power and storage of blockchain data.\n\nProof of stakes\n\nProof-of-Stake (PoS) is a consensus mechanism that uses the resources of validators in the system. Validators are smart contracts that enable stakeholders to enforce the system’s integrity through delegation. Therefore, unlike other proof methods such as Proof-of-Work (PoW), PoS allows for micropayments, which can be generated by validators and delegated to any pre-configured user.\n\nAdvantages of Ethereum\n\nEthereum’s most significant advantage is that it has a very active community that assists in improving the dApps they compile. Another benefit is the ease with which brands can build decentralized apps on top of its platform. Ethereum’s architecture allows for constant growth and development of its blockchain to improve functionality and create a safer platform.\n\nIn the future, it will continue to inspire innovation through its applications and other platforms built on top of its open-source codebase. For example, Microsoft Azure has built on the ethereum blockchain to provide alternative authentication factors for user access.\n\nBut despite all of these benefits, there are some things to be aware of before utilizing dApps that Ethereum powers. For example, it’s easy for a developer to make a mistake in the coding or for a malicious actor to exploit it to own those intelligent contracts.\n\nPossible threats & vulnerabilities\n\nThe biggest problem with any blockchain is that it is public and has no central points of vulnerability. However, it is essential to note that the algorithms that run on top of the blockchain are vulnerable.\n\nIn this case, the code must be flawless, and there should be no holes in it that could allow hackers to steal users’ private information or other assets. Unfortunately, Ethereum is not immune to these problems, and there have been instances where malicious actors exploited vulnerabilities, resulting in losses for users who transacted with such dApps."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZm9ya2FzdC5uZXdzL2RpZ2l0YWwtY3VycmVuY3ktZ3JvdXAtc3BvdGxpZ2h0LWZ1bmQtdHJhbnNmZXJzL9IBSWh0dHBzOi8vZm9ya2FzdC5uZXdzL2RpZ2l0YWwtY3VycmVuY3ktZ3JvdXAtc3BvdGxpZ2h0LWZ1bmQtdHJhbnNmZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Digital Currency Group in spotlight over fishy transfers - Forkast News",
        "content": "In this issue\n\nDCG: End of empire? Lido DAO: Energized by Ethereum Hong Kong: Crypto mojo\n\nFrom the Editor’s Desk Dear Reader, It’s often said that good things come in threes. Developments in the cryptocurrency industry in the past few days suggest that the reverse may also be true. The murky goings-on around Barry Silbert-led crypto empire Digital Currency Group (DCG) may not have attained FTX- or Terra-like levels of gut-wrenching awfulness — at least not at the time of writing. But the news that U.S. federal prosecutors are digging into transfers between DCG and one of its subsidiaries may presage a third nausea-inducing twist in the shakeout that has convulsed the crypto industry in recent times. If there’s a bright spot amid the potential for another big crypto collapse, it’s that authorities appear to have been paying attention to possible problems at DCG for at least two months — crucially, before the implosion of FTX. One can only hope that justice, should its application be required, be served swiftly and that crypto investors are spared yet more undue suffering. Meanwhile, proof of the endurance of the digital asset industry continues to emerge, even amid its numerous recent woes — this time in the form of another eagerly-awaited Ethereum upgrade. The Shanghai hard fork, as it’s known, promises to address concerns among investors staking ETH over whether they can withdraw their assets, and it has prompted a spike in interest in ETH-linked products and services as well as sharp price upticks for a number of tokens. And in good news for a city that has needed some for a while, financial authorities in Hong Kong have reiterated their determination to reclaim ground lost to other jurisdictions — chiefly Singapore — in the crypto hub rankings. Hong Kong has a long history of picking winners, despite the privations inflicted on the city and its people in recent years, and its bet on digital assets is not on a whim. We welcome more of that confidence as the industry works through its issues. Until the next time, Angie Lau,\n\nFounder and Editor-in-Chief\n\nForkast\n\n1. Here we go again?\n\nDigital Currency Group has been on the radar of U.S. authorities since the collapse of crypto hedge fund Three Arrows Capital last year. Image: DCG website/Canva\n\nBy the numbers: DCG — over 5,000% increase in Google search volume.\n\nCrypto-focused conglomerate Digital Currency Group (DCG) is under investigation by the U.S. Department of Justice as well as the Securities and Exchange Commission (SEC) over questionable transfers between DCG and a subsidiary, according to a Bloomberg report that cited unnamed sources.\n\nAlthough authorities haven’t made any accusations of wrongdoing, the investigations come a week after DCG reportedly shut down a wealth management subsidiary named HQ.\n\nDCG, among the largest companies in the cryptocurrency space, owns crypto lender Genesis Global Trading, digital currency asset management giant Grayscale, crypto news outlet CoinDesk, and Foundry, the world’s largest Bitcoin mining pool.\n\nDCG has been in the spotlight over debt issues stemming from the collapse of crypto hedge fund Three Arrows Capital last year.\n\nDCG chief executive Barry Silbert got into a Twitter spat with crypto exchange Gemini co-founder Cameron Winklevoss last week over claims that DCG had borrowed US$1.675 billion from Genesis that it hadn’t repaid, which Winklevoss said had led to Gemini users having hundreds of millions of dollars in assets frozen at Genesis.\n\nIn an open letter posted on Twitter last Monday, Winklevoss wrote that Genesis owed Gemini users US$900 million and claimed that the funds had been frozen by Genesis because it lacked liquidity due to DCG’s failure to repay the loan.\n\nSilbert responded: “DCG did not borrow $1.675 billion from Genesis” and added that “DCG has never missed an interest payment to Genesis and is current on all loans outstanding; next loan maturity is May 2023.”\n\nIn a letter to shareholders in November, DCG said it had taken out a US$575 million loan from Genesis and that it owed Genesis a US$1.1 billion promissory note to cover a liquidity crunch due to exposure to Three Arrows Capital.\n\nGenesis paused withdrawals on Nov. 16 due to “abnormal withdrawal requests” while revealing that it had US$175 million locked up in the bankrupt exchange FTX.\n\nGemini also halted withdrawals of its interest-bearing Earn program, which used Genesis as a trading partner. Last month, investors filed a class-action lawsuit against the company for alleged fraud and violations of securities laws.\n\nForkast.Insights | What does it mean? The crypto contagion is still spreading. Although much of the focus of the DCG story has been the very public spat between two of the crypto industry’s most Wall Street-friendly companies — and leaders — one key development is that authorities have stepped in quickly. According to Bloomberg, U.S. authorities have been looking into the practices of DCG since before the collapse of FTX. And even though no formal accusations of wrongdoing have (yet) been made, it’s heartening to know that regulators are becoming more active in the crypto industry and holding participants that break the law to account. But perhaps the biggest takeaway from the saga is how one of crypto’s founding ideals appears to be faltering. “WAGMI,” or “We’re all going to make it,” has been a maxim and rallying cry among crypto believers for years. It also became a slogan for a group of crypto enthusiasts that bought the English Football League club Crawley Town. More recently, the FTX collapse has led some companies in the sector to turn against one another for advantage and survival. For instance, Binance’s decision to call out FTX and dump the assets it held in FTX — a company it had previously nurtured — played a critical role in the now-defunct exchange’s implosion. As the Crypto Winter stubbornly refuses to thaw, expect the nastiness to continue.\n\n2. Upgrade uptick\n\nEthereum’s upcoming Shanghai hard fork is lifting the fortunes of Lido DAO. Image: Lido/Canva\n\nBy the numbers: Lido DAO — over 5,000% increase in Google search volume.\n\nLiquidity staking protocol Lido DAO (LDO) has surged over 50% over the past week ahead of an Ethereum upgrade that is expected to enable Ether stakers to withdraw their assets and resolve other risks related to ETH. The upgrade, named the Shanghai hard fork, is expected to be implemented by March.\n\nLido DAO provides rewards to ETH stakers by pegging Lido Staked ETH (stETH) to the value of the assets they locked into smart contracts. Lido is currently the largest decentralized finance (DeFi) protocol, with US$6.6 billion in total value locked, according to DefiLlama.\n\nBlockchain platform BitDAO (BIT) has rallied 13.7% during the same period following a proposal approved by the BitDAO community last week that approved a buyback of US$100 million worth of BIT in USDT for supply maintenance. The 50-day, US$2 million per day buyback started on Jan. 1.\n\nBitDAO is an Ethereum-based DAO that enables BIT holders to vote on proposals related to investment decisions in the DeFi space. It is backed by crypto exchange Bybit and billionaire venture capitalist Peter Thiel.\n\nThe Shanghai hard fork will enable Ether stakers to withdraw their assets from the Beacon Chain, an ability they currently lack.\n\n“The risk of not knowing when they can withdraw their [staked] assets is a factor of price discount,” Paik Hoon-jong, the chief operating officer of South Korea-based blockchain fintech firm DA:Ground, told Forkast in a video interview. “The announcement resolved a lot of anxiety about ETH 2.0.” He added that the sense of relief had prompted many investors to look into ETH-related products and services, such as Lido.\n\nDAOs, or decentralized autonomous organizations, are a new form of organization that allows communities of like-minded people to work together toward a common goal and make decisions without central leadership. There are now more than 2,300 DAOs, but the vast majority are small with less than US$1 million in assets under management.\n\nForkast.Insights | What does it mean? As centralized exchanges and companies appear to be falling out of favor, DeFi has found itself once again in the ascendent. According to recent data, the total value locked in DeFi protocols has been slowly ticking up since it hit year-lows last December. Although the increase is small and just a fraction of where the DeFi market was in its heyday in November 2021, it’s a welcome sign of life in a market segment that’s still in the grip of the Crypto Winter. But DeFi is still a long way from replacing the role of centralized exchanges as the main conduit through which new crypto users enter the space. The user experience is cumbersome, and the lack of centralized entities to vet new tokens has made it a haven for funny business. Uniswap, one of the largest decentralized exchanges, was a hotbed of fraud, according to a recent study, with nearly 98% of all tokens listed on the platform being nothing more than scams designed to defraud investors. Poorly run centralized companies are bad, but decentralized ones with no oversight or accountability aren’t any better. Developers and proponents of DeFi should take the crisis of confidence that has engulfed centralized crypto businesses as an opportunity to prove they represent a viable alternative.\n\n3. Hong Kong adds oil\n\nHong Kong’s plan to grow its cryptocurrency industry stands in stark contrast to how China has tried to stamp it out. Image: Canva\n\nHong Kong is pushing ahead with the development of its Web3 industry as part of a plan to re-establish itself as a global cryptocurrency hub, despite recent high-profile crypto exchange collapses, Paul Chan, the city’s financial secretary, told a forum in the city this week.\n\nHong Kong is maintaining its Web3 ambitions as rival crypto hub Singapore, spooked by the fallout created by the collapse of FTX, is backtracking on its efforts.\n\n“As certain crypto exchanges collapsed one after another, Hong Kong became a quality standing point for digital asset corporates,” Chan told attendees at the POW’ER Hong Kong Web3 Innovator Summit, adding that the city had a robust regulatory framework that “matches international norms and standards.”\n\nChan added that in the past two months, many top technology firms had contacted city authorities to discuss setting up international headquarters or expanding their businesses to Hong Kong.\n\n“We have recently completed the legislative work for licensing virtual asset service providers and the new measure will come into effect in June,” Chan said, adding that under the new arrangements, the requirements for crypto exchanges to combat money laundering and implement investor protections would be aligned with standards for traditional financial institutions.\n\nChan said Hong Kong was also preparing to issue more licenses for crypto trading firms and planning a consultation on how retail traders could participate in digital asset trading.\n\nThe city is hosting numerous pilot projects, including some that examine cross-border uses of the e-HKD, Hong Kong’s central bank digital currency, and the tokenization of government-issued green bonds, Chan added.\n\nChan’s remarks come a month after Hong Kong’s legislature amended a bill to include a licensing regime for virtual asset service providers that will come into effect on June 1.\n\nTwo of Asia’s first exchange-traded funds tracking crypto futures debuted on the Hong Kong Stock Exchange last month.\n\nHong Kong authorities last October announced a plan to reposition the city as a global crypto hub and released a series of policy documents touting the benefits of blockchain."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3Jlc2VhcmNoLXVzZGMtYWRvcHRpb24tZ3Jvd3MtcG9zdC1mdHgtY29sbGFwc2UtdXNkdC1yZW1haW5zLWZsYXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Research: USDC adoption on Ethereum grows post-FTX collapse; USDT remains flat - CryptoSlate",
        "content": "After a brutal sequence of events led to the collapse of several crypto-related firms in 2022, FTX’s bankruptcy dealt a massive blow to public trust in centralized crypto entities.\n\nDuring this period of heightened market volatility, crypto investors preferred Circle’s USD Coin (USDC) to Tether’s USDT. According to Glassnode’s data, while USDT is the largest stablecoin by market cap, USDC has more transfer volume.\n\nAccording to the data, USDC has a transfer volume of $15 billion, while USDT’s volume is $3 billion. Cumulatively, USDC outpaces USDT by $7 trillion.\n\nMeanwhile, the Glassnode chart below shows that the disparity in transfer volume was not always like this. USDT’s volume outperformed that of USDC in 2020 and early 2021. But that changed in 2022 when the Circle-backed stablecoin’s volume started growing.\n\nAt the time, USDT began to face increased regulatory scrutiny about its reserves coupled with Terra’s LUNA collapse, which birthed fears of whether the stablecoin wouldn’t lose its Dollar peg.\n\nUSDC’s balance on exchanges reach $5 billion\n\nIn terms of exchange balances, Glassnode data shows that USDC is beginning to enjoy more adoption post-FTX collapse. According to the data, the USDC on exchanges is approaching $5 billion.\n\nPreviously, USDC’s adoption in 2022 had declined thanks to Binance’s decision to convert its users’ balances in USDC and other stablecoins to its BUSD. However, with the FTX collapse birthing FUD that led to record withdrawals from Binance, USDC’s adoption began to see an uptrend towards the end of the year.\n\nBesides that, Coinbase also urged its users to convert their USDT to USDC for free.\n\nOn the other hand, USDT’s balance on exchanges stayed flat throughout the period –it even saw a slight decline in early January 2023.\n\nPost FTX’s crash, USDT has seen more questions raised about its reserves, with several hedge funds shorting the stablecoin. However, its issuer said Tether would continue to show resilience even in the face of uncertainty.\n\nWith 2023 set to be a risk-off year, the market could likely see further growth among stablecoins. This could set the stage for a fight for dominance between USDT and USDC.\n\nMentioned in this article"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvY3J5cHRvLWNpdHktdWx0aW1hdGUtZ3VpZGUtdG9yb250by_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Your guide to crypto in Toronto: Crypto City - Cointelegraph",
        "content": "Toronto embraced digital assets sooner than most and is home to more crypto projects than anywhere else in Canada.\n\nContents\n\nOverview\n\nCrypto culture in Toronto\n\nWhere can I spend crypto in Toronto?\n\nCrypto projects and companies in Toronto\n\nToronto’s crypto controversies\n\nToronto crypto education and community\n\nNotable crypto figures from Toronto\n\nOverview\n\nThe city lies at the center of the so-called Golden Horseshoe, a large urban area around the shore of Lake Erie that 9.76 million people — about a quarter of all Canadians — call home. Consistently rated among the world’s most livable cities, Toronto, much like Vancouver on the west coast, is notable for its ethno-cultural diversity brought on by waves of immigration. It’s within a short flight of the capital Ottawa, as well as Montreal to the north and New York to the south. Toronto is seen as the country’s financial and cultural capital.\n\nToronto was where Ethereum founder Vitalik Buterin grew up. Source: Pexels\n\nPlaying home to notable battles between indigenous peoples in the late 1600s, French traders from the mid-1700s and the British later that century, Toronto has seen a lot. In 1834, around the time of a failed rebellion against the British, it was incorporated as Toronto, which was a First Nations name, and the city became a destination for slaves escaping the American South. In the late 1800s, the city became a railway hub. Today, it is served by Pearson International Airport.\n\nAs a global hub of business and culture, Toronto resembles a northern version of New York, to the extent that many movies set in New York are filmed in the city due to their similar appearance. Winter weather can be formidable, with freezing rain in 1999 requiring the army to be called in for road clearing. The city is well-known as the birthplace of Ethereum and today hosts a majority of Canada’s blockchain companies.\n\nCrypto culture in Toronto\n\n“Vitalik Buterin, an elongated Toronto young man who looked brainy in a very literal way, had attended Anthony’s first meetup and later brought to him an idea for a blockchain platform he called Ethereum.”\n\nSo writes author Ethan Lou in his memoir, Once A Bitcoin Miner, much of which takes place in Toronto. Anthony Di Iorio, an early Bitcoin investor, started a crypto meetup named after his software company Decentral in a “redbrick house in Toronto’s historical fashion district” — this is where the young Buterin walked in with his idea for Ethereum, which is, of course, another story entirely.\n\nWith the founding of Ethereum, Toronto cemented its position in the crypto canon. By 2018, Canadian startup blog BetaKit wrote there was a divide in Canada between the areas that embraced the cultural aspects of crypto on one side, and the financial aspects on the other.\n\n“While Toronto and Waterloo are understood to be lively crypto hubs, Vancouver is known for companies that privilege crypto-collectibles over currency, and blockchain art over tokens.”\n\nThis makes sense, considering Toronto is a city oriented primarily toward finance, while Waterloo, the birthplace of BlackBerry, is a tech hub an hour’s drive away. That’s where Buterin attended university briefly and was the home of the author of this article for nearly 20 years.\n\nToronto’s famous Bitcoin sign at Decentral headquarters. Source: Decentral\n\nIn 2014, Decentral opened a physical location on the prominent Spadina Avenue, making it and its large Bitcoin sign something of an institution and a way in which Bitcoin touched the lives of average Torontonians. Featuring a Bitcoin ATM, the spot became almost a Bitcoin embassy in the city, hosting meetups and other events.\n\nAs a financial hub, Toronto regularly plays host to blockchain conferences including the annual Blockchain Futurist Conference, the largest in the country. In 2022, the event coincided with ETH Toronto. The year also saw the Web3 & Blockchain World summit, AIBC Toronto and the Cardano Summit 2022. A quick browse of Meetup.com will reveal that there are dozens of cryptocurrency-, blockchain- and NFT-themed meetups in the city and surrounding area.\n\nSo excited to be in Toronto for The Blockchain Futurist Conference with The #bettertraders_\n\nPodcast. Come say hi ☺️ pic.twitter.com/xk6TRLw88Q — Rune (@cryptorunes__) October 30, 2022\n\nThe corporate nature of the city means there is more funding available than in most other comparable destinations, explains Charlie Aikenhead, senior vice president of marketing at WonderFi. And unlike south of the border in the United States, there is a general sense of regulatory certainty, which encourages a willingness to bet on the industry.\n\n“Canadian investors and citizens seem to have a more favorable view of the industry and have less worries about customer protections than other countries.”\n\nWhere can I spend crypto in Toronto?\n\nAccording to Coinmaps, there are a number of businesses in the city and surrounding areas that happily accept cryptocurrency as payment. In addition to crypto ATMs and various shopping outlets specializing from sportswear to TV antennas, one can have their teeth repaired at Downtown Dental Hygiene Clinic, with the same service available for their homes at B & B Cleaning Service. Down the street from both, Grossman’s Tavern is happy to exchange beer for bits, while Toronto Brewing will sell you all you need to make drinks at home. Even cryotherapy is available at Vital Cryotherapy Toronto.\n\nIt looks like there are plenty of places to spend crypto around Toronto 😉 Or you can search the whole world on Coinmap! pic.twitter.com/678AsIoU4h — Coinmap (@thecoinmap) March 22, 2021\n\nCoffee can be purchased at the nearby Snakes and Lattes board game cafe a few blocks away, while Urban Living Suites offers a good night’s rest for crypto tourists roaming the streets without loonies or toonies — what locals call $1 and $2 dollar coins, featuring a loon and two polar bears, respectively. Online services such as those offered by WebRocker Web Design are also available.\n\nWhile crypto acceptance is by no means the norm, it is notable to say that it appears very reasonable that one could go cashless and survive on cryptocurrency for the majority of their needs by seeking out crypto-friendly businesses in the region.\n\nIf one is determined, just about anything can be purchased with crypto in the Toronto region. Source: Coinflip\n\nCrypto projects and companies in Toronto\n\nToronto has the largest concentration of blockchain startups in the country, to the extent that startupill.com published a list titled 82 Best Toronto Cryptocurrency Startups. Among the biggest ones include exchanges Coinsquare, CoinSmart, Tokens.com, Bitbuy, BitSwap, 3Commas, Coinberry and Coinlet among several others. Angel.co also lists 39 “Top Blockchain / Cryptocurrency Startups in Toronto in 2022,” many of which appear to be actively hiring.\n\nOn the mining side, Hut8 Mining is perhaps the most established player, being listed on the Toronto Stock Exchange with a market cap above $400 million. Bitfarms is also listed at a market cap of just under $200 million. DigiMax, Digihost and Cryptoster are also involved in mining.\n\n#HIVE Blockchain Technologies Ltd\n\n\n\n🔸First publicly traded crypto miner, listing on the Toronto Venture Exchange in 2017\n\n🔸HIVE uses 100% green energy to mine $BTC\n\n🔸In 2022, HIVE mined 2,368 BTC & 32,397 $ETH — RR2Capital (@RR2Capital) November 1, 2022\n\nAndrew Kiguel, CEO of Tokens.com and former CEO of Hut8 Mining, explains that the mix of crypto companies and several large universities is the secret sauce to the city’s industry success, which, he says, has a “young and sophisticated crypto population.”\n\n“There are several large universities, and many crypto companies are headquartered here. As a result, there’s a large, active crypto community,” he says. “There are regular meetups and businesses that have launched in the city. It has a young and sophisticated crypto population.”\n\n“The crypto environment is generally cooperative and friendly. There is a large talent pool in Toronto seeking employment in crypto. Many crypto companies were launched in Toronto, and others, such as Galaxy Digital and Hive, were financed out of Toronto.”\n\nIn addition to exchanges and mining, Toronto also hosts many financial services and advisory companies specializing in cryptocurrency. These include Signal, a market intelligence firm, Bitcoinblack, which provides crypto-backed credit cards, and payment transfer company Biquiti.\n\nJaxx Wallet, which allows users to easily manage cryptocurrency holdings via smartphone, is also based in Toronto.\n\nLower cooling costs are one positive note for the crypto mining industry in Canada. Source: Pexels\n\nToronto’s crypto controversies\n\nEarlier in 2022, authorities seized a Lambo and $2 million from local 23-year-old “Crypto King” Aiden Pleterski, whose company AP Private Equity Limited was accused of being a $35-million fraud according to court documents. Pleterski was allegedly renting out a lakeside mansion for $45,000 per month even as some locals say they lost money earmarked for their grandchildren’s education.\n\nIn early 2020, a Los Angeles billionaire named Josh Jones became a victim of a so-called SIM-swap attack, according to Ryk Edelstein, founder of 5-L Technologies, in Montreal. The attacker took $45 million in Bitcoin but was eventually tracked down to nearby Hamilton via a PlayStation username and IP address, where authorities found a teenager who later pleaded guilty. A friend, who witnessed the arrest, later recounted the story to local news:\n\n“He told me, after the SIM swap, that he thought he got only $1 million. But when he looked at the total amount and saw it was $45 million, he panicked.”\n\nThe city has seen a few crypto crimes from investment scams to SIM-swaps. Image: Pexels\n\nToronto also served as part of the stage for the infamous case of QuadrigaCX, whose late founder, Gerald Cotten, lived in the city while running the exchange. He reportedly died in India in 2018, seemingly taking the private keys to nearly $200 million with him to the grave — which victims have later fought to exhume in a search for answers. In June 2020, the Ontario Securities Commission officially concluded that QuadrigaCX was a fraud and a Ponzi scheme.\n\nToronto crypto education and community\n\nIf you want to be a blockchain dev, at George Brown University’s Casa Loma campus, you can participate in a one-year full-time Blockchain Development Program, which comes with a mandatory on-the-job training element. Tuition is only about $5,000 per year.\n\nToronto Metropolitan University offers a course called “Blockchain for Business,” which promises to “help fill a knowledge gap for professionals seeking essential knowledge in the ways in which blockchain technology works and how it can be applied effectively to solve business problems.” York University has a dedicated Blockchain Academy and offers a Certificate in Blockchain Development, which is more geared toward building than understanding, through its School of Continuing Studies.\n\nToronto’s chapter of the International Institute of Business Analysis has provided its members with educational seminars on Blockchain Fundamentals, and Intellipaat provides a 27-hour IBM Blockchain Course. BlockGeeks also offers some free online courses.\n\nThere is also CryptoChicks, a nonprofit that has grown from Toronto to encompass chapters around the world “helping thousands of women around the globe to learn and invest in blockchain, build new careers and businesses.”\n\nNotable crypto figures from Toronto\n\nVitalik Buterin (at least sometimes when he visits family, including father Dmitry Buterin), Ethereum co-founder Anthony Di Iorio; Author of Once A Bitcoin Miner and occasional Magazine contributor Ethan Lou; Tokens.com CEO Andrew Kiguel; Cannabanc founder Paresh Khatri; Bitbuy President and CEO Dean Skurka; Kylin Network co-founder Dylan Dewdney; Newton CEO Dustin Walper; CoinSmart CEO Justin Hartzman."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vY2FwaXRhbC5jb20vd2hhdC1pcy1saWRvLXlvdXItdWx0aW1hdGUtZ3VpZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "What Is Lido (LDO)? | What You Need To Know - Capital.com",
        "content": "Lido’s LDO token surged over 50% in the first week of 2023 Photo: thinkhubstudio / Shutterstock\n\nLido (LDO) emerged as the leading Ether (ETH) staking platform in the world by contributing over 30% of all ETH staked, as of January 2023.\n\nThe staking platform’s governance token LDO gained over 50% in the first week of 2023 on expectations that more users will stake their ETH as Ethereum completes its upcoming ' ‘Shanghai’’ upgrade in March 2023.\n\nWhat is Lido and how does it work? Here we take a look at LDO coin price history, latest news and risks involved with Lido staking.\n\nWhat is Lido?\n\nLido (LDO) is a crypto staking solution currently available on Ethereum, Solana (SOL), Polkadot (DOT) and Kusama (KSM).\n\nStaking is the process of depositing cryptocurrencies as collateral in order to verify and create blocks on proof-of-stake (PoS) blockchains like Ethereum. Stakers gain the chance to earn rewards by validating blocks.\n\nAs of January 2023, staking on Ethereum requires users to lock up their ETH. Ether stakers can withdraw their tokens after the network upgrade called Shanghai, which is expected in the first half of 2023, according to Ethereum’s website.\n\nLido is managed by the Lido Decentralised Autonomous Organisation (DAO). According to its whitepaper, the Lido DAO is responsible for the following:\n\nWhat is your sentiment on ETH/USD? 4036.60 Bullish or Bearish Vote to see Traders sentiment! Market sentiment: Bullish Bearish 91% 9% You voted bullish. You voted bearish. Give ETH/USD a try Start trading Start trading Start trading or Try demo\n\nDeploying Lido smart contracts\n\nSetting platform fees and protocol parameters\n\nRecruiting node operators and validators\n\nManaging insurance and development funds\n\nManaging withdrawals\n\nHow does Lido work?\n\nLido provides liquid staking solutions to users by issuing stETH tokens for ETH staked on its platform on a 1:1 basis.\n\nStakers can use their stETH tokens like regular ETH for trading on crypto exchanges and for various activities across decentralised finance (DeFi) websites.\n\n“Liquid staking protocols allow users to earn staking rewards without locking assets or maintaining staking infrastructure. Users of these protocols can deposit staking tokens and receive tradable liquid tokens in return,” said Lido.\n\nHowever, stakers will only be able to retrieve their staking rewards and redeem stETH for ETH after the completion of Ethereum’s Shanghai upgrade.\n\nAs of 9 January 2023, ETH stakers using Lido were earning at 4.6% annual percentage rate (APR) compared to 4.8% across the Ethereum ecosystem.\n\nThe Lido DAO manages the entire staking fund. The platform charges a 10% fee on the earnings which is split between node operators and the Lido DAO. Lido also supported the staking of SOL, DOT and KSM on their native blockchains. At the time of writing, Lido supported MATIC staking on Ethereum.\n\nThere were 54 node operators on Lido across Ethereum, Solana and Polygon. Lido had 29 permissioned node operators on Ethereum, 11 on Solana and 6 on Polygon. As of 9 January 2023, Lido offered a yield of 7.2% APR on SOL staking, 6.3% APR on MATIC staking, 14.8% on DOT staking and 13.9% on KSM staking.\n\nUsers need web3 wallets to stake on Lido. There is no minimum staking amount on Lido.\n\nWhat is LDO coin?\n\nThe LDO coin is the governance token of the Lido DAO.\n\nWhat is lido coin used for? The main purpose of the LDO coin is for voting on Lido’s key parameters like platform fees and other proposed upgrades.\n\nAccording to its whitepaper, LDO voting weight is equal to the amount of LDP a voter stakes in the voting contract.\n\nThe LDO coin launched in December 2020 with a supply of 1 billion tokens. The initial token distribution was as follows:\n\nDAO Treasury - 36.3%\n\nInvestors - 22.2%\n\nDevelopers - 20%\n\nFounders and future employees - 15%\n\nValidators and withdrawal key signers - 6.5%\n\nAs of 9 January 2023, LDO was the 33rd largest cryptocurrency in the world at a market capitalisation of $1.32bn. The current circulating supply stood at about 824 million tokens representing 82% of the max LDO supply.\n\nAccording to CoinMarketCap, over 52% of LDO supply was held by the top 10 holders, as of 9 January 2023.\n\nLDO coin price history and news\n\nThe earliest data on CoinMarketCap showed lido cryptocurrency trading at about $1.8 in early January 2021.\n\nThe token traded range-bound between $0.50 and $3.28 from January to April 2021. LDO saw its first big break in May 2021 as it rose over $5 amid a broader crypto market rally.\n\nAs ETH surged to an all-time high of over $4,800 in November 2021, LDO posted an all-time high of $11.\n\nThe crypto bear market that followed in 2022 saw LDO slump to an all-time low of $0.406 on 18 June. The fall of Terra in the first half of the year affected Lido – Terra was one of the blockchains that Lido staking supported.\n\nLido soon after announced that it would shut down its Terra operations.\n\nThe biggest driver for the lido cryptocurrency in 2022 was Ethereum’s transition from the proof-of-work to proof-of-stake consensus in a process commonly known as ‘The Merge’.\n\nIn July 2022, LDO gained about 375%, its biggest monthly gain ever after Ethereum developers confirmed the September 2022 launch date for The Merge.\n\nHowever, LDO price saw losses again as investor sentiment soured following multiple bankruptcies in the crypto industry. LDO closed the year at $0.95 having posted a yearly loss of nearly 75% in 2022.\n\nLDO started 2023 on a strong note by surging over 50% in the first seven days of the year. Tokens of rival staking platforms StakeWise and Rocket Pool saw similar gains during the period.\n\nAnalysts pointed to the upcoming Ethereum upgrade ‘Shanghai’ which will allow ETH stakers to withdraw their deposits as the major catalyst for LDO and other staking platform tokens.\n\n“As withdrawals are enabled, many believe more users will stake their ETH,” tweeted CroissantEth.\n\nMost recently liquid staking derivatives have had a nice uptrend.\n\n\n\nThis is thanks to the Shanghai upgrade expected in a few months which will enable withdrawals of staked ETH.\n\n\n\nAs withdrawals are enabled, many believe more users will stake their ETH.\n\n\n\nLDO +26%\n\nRPL +12%\n\nSWISE +66% pic.twitter.com/tl2d3KSlRC — ????‍????.eth (@CroissantEth) January 2, 2023\n\nAs of 9 January 2023, over 30% of all ETH staked was on Lido making it the most dominant ETH staking platform in the world.\n\nRisks of staking on Lido\n\nAccording to Lido, the risks of staking with Lido are as follows:\n\nDistributed custody : Funds staked on Lido are locked in smart contracts. The keys to enable ETH withdrawals are held by 11 individuals.\n\nSmart contracts : There is a risk that smart contracts used for staking on Lido could contain vulnerabilities and bugs which hackers can exploit.\n\nTechnical risk : ETH staking on Lido is dependent on Ethereum’s proof-of-stake chain. There are no guarantees that it has been developed error-free, said Lido.\n\nAdoption risk : The value of ETH and stETH is dependent on the growth and adoption of Ethereum.\n\nDAO key management risk : Lido said over 600,000 ETH is held across multiple multi-signature accounts. If signatories lose their keys or get hacked or go rogue the funds risk becoming locked, said Lido.\n\nSlashing risk : ETH staking comes with a slashing penalty where 1/32 of a validator’s ETH stake is immediately burned if the validator acts against the protocol rules. Validators risk losing their entire staked balance, said ethereum.org. Validator inactivity can also lead to slashing.\n\nstETH price risk: The price of stETH can trade at a lower value than ETH on the market due to withdrawal restrictions.\n\nFinal thoughts\n\nIf you are interested in the Lido (LDO) token, you should always conduct your due diligence by reading the latest news, conducting technical and fundamental analysis, and studying a wide range of commentary.\n\nRemember that your decision to trade or invest in any asset should depend on your attitude to risk, your expertise in the market, the spread of your portfolio, and how comfortable you feel about losing money. You should never trade more than you can afford to lose\n\nFAQs"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90b3AtZXRoZXJldW0tZXJjMjAtdG9rZW5zLXRvLWJ1eS1pbi0yMDIzLXNoaWJhLWludS1zaGliLWNoYWlubGluay1saW5rLWFuZC1vcmJlb24tcHJvdG9jb2wtb3Jibi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Top Ethereum ERC20 Tokens to Buy in 2023: Shiba Inu (SHIB), Chainlink (LINK) and Orbeon Protocol (ORBN) - Analytics Insight",
        "content": "The mass adoption of crypto can only come if cryptocurrencies have real world use cases. Although Shiba Inu, a memecoin, may seem to be the antipathy of this, the decentralized Shiba Inu community keeps adding exciting new ways to use Shiba Inu. Chainlink’s blockchain can be seen as a backbone of crypto projects that rely on oracles to keep everything accurate, safe and secure.\n\nOrbeon Protocol is disrupting traditional finance (TradFi) by offering a new way to invest in early stage businesses, and is in the final stage of presale. These diverse but important use cases are what makes me bullish on Shiba Inu, ChainLink and Orbeon Protocol for 2023.\n\nOrbeon Protocol (ORBN) is widening access to decentralized finance\n\nHave you ever wished you could invest in businesses way before they go public on the stock market? Or have you heard of presales or IDOs in crypto but don’t know how to invest? This is the problem that Orbeon Protocol is here to solve. Orbeon Protocol will carefully vet web2 and web3 startups, and then offer them to their community to invest in.\n\nThe method is unique as they allow these startups to offer equity or reward based NFTs. These NFTs are available from as low as $1 and provide access to the venture capital industry for everyday investors. This is an exciting new paradigm for DeFi (decentralized finance) that takes us one step closer to the mass adoption of crypto.\n\nThe projects native ORBN token fuels this ecosystem and grants holders various benefits from staking bonuses to governance rights and more.\n\nOrbeon Protocol finishes its final round of presale mid January, after which the price of ORBN will rise by up to 6000% according to analysts. So for the best gains, now is the time to get in on ORBN.\n\nYou can now pay for subscription services like Netflix using Shiba Inu (SHIB)\n\nShiba Inu is in many ways, a very decentralized coin and ecosystem, one of the important things in maintaining network safety, but also a boon in terms of the team spirit. The Shibarmy (aka supporters of the Shiba Inu crypto), are relentless in their development of the ecosystem. The latest bullish news is that SHIB can now be accepted as payment for Netflix, Spotify and other subscription services, using the payment gateway NOWPayments.\n\nShiba Inu can also be used to buy cars like Aston Martin and Bentley. As impressive as luxury cars may sound, the number of paying subscribers of Netflix and Spotify add up to an impressive 360 million users. This is a huge market, and if SHIB can capture some of it then this is a bullish sign for Shiba Inu and crypto in 2023.\n\nChainLink’s (LINK) Decentralized Oracles Explained\n\nTo understand Chainlink, we must understand smart contracts. The Ethereum blockchain really made its mark on the world by creating smart contracts. Smart contracts are self-executing contracts that automatically execute the terms of a contract when certain conditions are met. Ultimately they power all Ethereum and EVM compatible chains, as well as non EVM chains like Solana.\n\nHowever, smart contracts are limited by the code inside, meaning that they cannot pull from outside sources. This becomes an issue, when for instance, someone wants a smart contract to execute at the moment a coin reaches a certain price. This is where oracles and Chainlink come in.\n\nOracles provide the outside data to the smart contracts, but what happens if an oracle is incorrect? It leads to exploits and security issues. Chainlink is a decentralized network of oracles, meaning that the smart contracts do not have to rely on just one oracle but instead can use Chainlink to ensure that the data received is accurate and reliable.\n\nAs crypto continues to grow, I predict that Chainlink will become more and more vital to the world of cryptocurrency, making Chainlink, in many investors opinion, a good buy for 2023.\n\nFind Out More About The Orbeon Protocol Presale\n\nWebsite: https://orbeonprotocol.com/\n\nPresale: https://presale.orbeonprotocol.com/register\n\nTelegram: https://t.me/OrbeonProtocol\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3NvbGlkaXR5LXByb2dyYW1taW5nLXRoZS1zbWFydC1jb250cmFjdC1sYW5ndWFnZS1pbi1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Solidity Programming: The Smart Contract language in Ethereum - Analytics Insight",
        "content": "Know more about Solidity programming which is the smart contract language in Ethereum\n\nThe Solidity programming language was created expressly for use on the Ethereum blockchain network. It is a high-level, contract-oriented language with syntax similar to JavaScript, making it reasonably simple to learn for developers who are familiar with web development. Solidity is used to create smart contracts, which are self-executing agreements with terms which put straight into code. These contracts are subsequently deployed on the Ethereum blockchain, where any Ethereum user can invoke and execute them.\n\nAbout Ethereum:\n\nThe most popular Blockchain is Ethereum, mainly to its adaptability in permitting the development of dApps on the platform. Not only that, but the smart contracts feature within Ethereum, which is the platform’s USP, is the icing on the cake. Smart contracts are designed to make it easier to execute essential business logic or rules on the network. Developing a dApp, like any other app, necessitates programming and executing codes on the system.\n\nHowever, Solidity programming stands out as the most popular and widely used programming language on Ethereum. One of Ethereum’s most important features is its support for smart contracts. A smart contract is a contract that self-executes, with the terms of the agreement written directly into code. Smart contracts can be used to help with contract negotiation, verification, and enforcement. This enables the automation of many types of business transactions, such as asset transfers, financial contract execution, and supply chain logistics management.\n\nBenefits of Solidity:\n\nThe ability to construct decentralized apps (dApps) on the Ethereum network is one of the key advantages of using Solidity. dApps are apps that run on a distributed network rather than a centralized server. Because there is no single point of failure in the system, they are more resistant to censorship, outages, and hacker efforts. Furthermore, because they are built on the blockchain, dApps are transparent and auditable, making them perfect for applications involving financial transactions or other sensitive data.\n\nThe ability to create coins on the Ethereum network is another advantage of utilizing Solidity. Tokens are digital assets that can represent anything from a tangible object, such as a commodity or a stock, to a virtual asset, such as a point or a vote. Tokens can be used to build decentralized exchanges (DEXs), which allow users to purchase and sell digital assets with one another directly. They can also be used to form decentralized autonomous organizations (DAOs), which allow a group of people to make choices and govern a digital asset collectively.\n\nSolidity supports multiple inheritances via C3 linearization, which uses an algorithm to choose which method to employ in the event of multiple inheritances. The ‘Natural Language Specification’ is used in Solidity programming to translate user-centric specifications to machine-intelligible language.\n\nWhen working with Solidity, keep in mind that, as a relatively new programming language, there is still a lot of uncertainty and risk associated. Because the Ethereum platform and ecosystem are still in development and change often, compatibility issues may arise, resulting in the breach of the contract and the smart contracts that you’ve created. Furthermore, because smart contracts are self-executing, it is critical to thoroughly test and audit the code before publishing it to the blockchain, as flaws in the code can result in funds being lost or other unforeseen effects.\n\nConclusion: Despite these concerns, many developers are enthusiastic about Solidity and the Ethereum platform. We should expect to see a wide range of new and innovative dApps and tokens established on the Ethereum network utilizing Solidity as blockchain technology evolves and more developers learn how to deal with smart contracts. However, like with any new technology, it comes with its own set of dangers and uncertainties, therefore smart contract code should be extensively tested and audited before being deployed to the blockchain.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL2NvaW5jb2RleC5jb20vYXJ0aWNsZS8yMzA0My9wb2xrYWRvdC1wb3dlcmVkLWFub3RoZXItd2F2ZS1vZi1pbm5vdmF0aW9uLWluLXE0LTIwMjItc3VycGFzc2luZy1ldGhlcmV1bS1hbmQtb3RoZXJzLWluLWRldmVsb3BtZW50LWFjdGl2aXRlcy_SAZYBaHR0cDovL2FtcC5jb2luY29kZXguY29tL2FydGljbGUvMjMwNDMvcG9sa2Fkb3QtcG93ZXJlZC1hbm90aGVyLXdhdmUtb2YtaW5ub3ZhdGlvbi1pbi1xNC0yMDIyLXN1cnBhc3NpbmctZXRoZXJldW0tYW5kLW90aGVycy1pbi1kZXZlbG9wbWVudC1hY3Rpdml0ZXMv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Polkadot Powered Another Wave of Innovation in Q4 2022, Surpassing Ethereum and Others in Development Activites - CoinCodex",
        "content": "Polkadot (DOT) is undoubtedly one of the biggest projects in the Web 3 scene. The multichain ecosystem continues to drive innovations and developments within the sector, and the final quarter of 2022 was a particularly busy period. A good number of experienced teams, for instance, are building and launching Polkadot parachains that are use-case specific.\n\nBesides the creation of new, innovative Polkadot blockchains (parachains), a lot is happening within the ecosystem. The barrier of entry for native staking has been significantly lowered by nomination pools. This implies that users can now help to secure the network with minimal upfront cost without going through a third party. Some strategic partnerships have emerged as well, even as impressive developer stats round off a series of landmark achievements for Polkadot.\n\nLandmark Moments within Polkadot Network in Q4 2022\n\nWithout further ado, here are some of the landmark moments in the final quarter of 2022 within the Polkadot ecosystem:\n\nNomination Pools Help Drive Growth\n\nNomination pools went live on 1st November 2022 as a new feature of the Polkadot staking system. This feature allows users to pool DOT tokens together (on-chain) in order to nominate validators and receive accompanying rewards. It lowers the minimum stake for individual users from 200 DOT to 1 DOT token.\n\nIn addition to strengthening the decentralization and security of the Polkadot network, Nomination Pools help improve the system’s scalability. It also improves staking opportunities within the network. Of course, it was an instant hit as about 3,475 pool members participated with 854,495 DOT before the end of 2022.\n\nAstar Partners Japan’s Biggest Mobile Phone Operator\n\nAstar, a Polkadot parachain and smart contract platform, closed a major deal with NTT Docomo, which is one of Japan’s biggest mobile phone operators, towards the end of 2022. The two will, henceforth, collaborate on mass Web3 adoption and its social implementation.\n\nIt is expected that the Japanese company will invest about $4 billion in decentralized technology as the two entities work together to sustain developmental goals. Potentially, the partnership will expedite Web3 adoption through the education and nurturing of Web3 talents.\n\nKILT Becomes the First Parachain to Migrate from Kusama to Polkadot\n\nKILT Protocol is officially the first parachain to achieve a full migration from Kusama to Polkadot. This is the first time a live blockchain will migrate from one network to another, and it is a big win for Polkadot. The parachain, which is a blockchain identity protocol, made the move when large-scale enterprises started using its services. It needed top-of-the-class security and stability as the big players arrived.\n\nDOT Morphs from a Security to a Non-Security\n\nOn the regulatory front, Polkadot’s native token, DOT, has metamorphosed from a security to a non-security. This was announced by Web3 Foundation, which funds development teams within the decentralized web space. This is the fruit of a three-year engagement with the U.S. Securities and Exchange Commission (SEC).\n\nWith the latest announcement, Polkadot has strengthened its value proposition to token holders. It now provides safety, even as the token becomes compliant with the law. It is also setting the pace for other tokens as the Foundation has helped achieve SEC’s vision of token morphing. It should be noted, however, that Polkadot has always been vertical agnostic and use-case agnostic, primarily serving as a base layer where developers can build other blockchains and applications.\n\nPolkadot Ecosystem Leads on Development Activities\n\nIn terms of development activities, Polkadot is the ecosystem to beat in the evolving Web3 scene. Data from Electric Capital indicate that there are about 1,128 weekly active developers on the Polkadot ecosystem, and they produce about 13,934 weekly commits, which is higher than what obtains on other Web3 projects, including the all-mighty Ethereum.\n\nA good number of Polkadot affiliates are doing great too. Manta Network, a Web3 privacy hub built on Polkadot and Kusama, which is Polkadot’s canary network, came out third and fifth, respectively, in Electric Capital’s report. Manta also established the largest Trusted Setup in the history of Zero-Knowledge technology, with more than 13,000 participants from 177 countries.\n\nPolkadot is arguably the biggest winner when it comes to use-case specific layer-1 blockchains and apps. 74 parachains won auctions on either Polkadot or Kusama throughout 2022. They currently support as many as 300 unstoppable applications. The final quarter of the year was obviously the busiest period, but Polkadot was booming throughout the year, in terms of developments. About 550 projects, in total, are either launched or in development within the ecosystem."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9rYWJvc3UtbGF1bmNoZXMta2Fib3N1LWludS10b2tlbi0xODE3MDA3OTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Kabosu Launches Its Kabosu Inu Token and Celebrates Its Legacy - Yahoo Finance",
        "content": "Summary: Kabosu is an emerging crypto platform. Recently, it launched an ERC20 token that allows users to celebrate the legacy of Kabosu. The newly launched coin is called Kabosu Inu Token.\n\nSouthall, United Kingdom--(Newsfile Corp. - January 11, 2023) - In the latest progress, Kabosu is pleased to announce the launch of its exclusively digital currency known as Kabosu Inu Token. It is developed as an ERC20 token dedicated to the appreciation and awareness of Kabosu. Also, the newly developed token is now available for purchase.\n\n\n\n\n\nSHIBA\n\nIn honor of Kabosu's legacy, the Kabosu Inu token was created to bring together a community of meme crypto enthusiasts. With a 1% buy tax and 1% sell tax, the Kabosu Inu token not only celebrates Kabosu, but also supports it in its final days.\n\n\n\n\n\nSHIBA\n\nTo purchase Kabosu Inu, people will need to first buy Ethereum from an exchange such as Coinbase or Binance. Next, install a wallet like Metamask or Trust Wallet, and users are required to send their Ethereum to their wallet address. From there, users can connect their wallet to uniswap and paste the contract address in, making sure to use 5-10% slippage to ensure their purchase goes through.\n\nConsequently, with the tokeneconomics of 1% buy tax and 1% sell tax, it brings together a community of meme lovers to pay tribute to Kabosu. People can join the Kabosu Inu community and HODL onto their Kabosu Inu tokens and be a part of the community honoring the Shiba Inu.\n\nAbout the company – Kabosu\n\nKabosu Inu is a company dedicated to celebrating and raising awareness for Kabosu, the Shiba Inu dog that inspired meme coins. The company was created in honor of Kabosu's legacy and to bring together a community of meme lovers. Through the creation of the Kabosu Inu token, the company provides a way for individuals to show their appreciation and support for Kabosu.\n\nFurthermore, the company is committed to using a portion of the proceeds from the sale of Kabosu Inu tokens to care for Kabosu and ensure that she is comfortable in her final days. Kabosu Inu is a company that not only pays tribute to a dog, but also works to make a positive impact in its life.\n\nStory continues\n\nFor further information, visit the following links:\n\nhttps://welovekabosu.com/\n\nhttps://twitter.com/KabosuInuETH\n\nhttps://www.dextools.io/app/en/ether/pair-explorer/0x35ca4d410acc2be7e59613f20dfec7b7dfe2c149\n\nhttps://t.me/KabosuInuEntry\n\nhttps://app.uniswap.org/#/swap?outputCurrency=0xd34a2051ac17bdd44d76aa84ea7fcf8419130e55\n\nMedia Details:\n\nName: Gareth Jones\n\nAddress: Armstrong Way Great Western Industrial, Southall UB3 4CD, UK\n\nEmail Address: kabosu.inu.erc@gmail.com\n\nWebsite: https://welovekabosu.com/\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/151014"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3doYXQtaXMtZXRoZXJldW0td2hhdC1hcmUtaXRzLWJlbmVmaXRzLWluLWJsb2NrY2hhaW4tdGVjaG5vbG9neS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "What Is Ethereum What Are Its Benefits in Blockchain Technology? - Analytics Insight",
        "content": "What is Ethereum what are the Benefits of using Ethereum in Blockchain Technology?\n\nEthereum is a decentralized blockchain technology platform that creates a peer-to-peer network for securely executing and verifying application code known as smart contracts. Smart contracts help participants to negotiate with one another without the need for a trusted central authority.\n\nTransaction records are immutable, verifiable, and securely distributed across the network, providing participants with complete ownership and visibility over transaction data. User-created Ethereum accounts send and receive transactions. As a cost of processing transactions on the network, a sender must sign transactions and spend Ether, Ethereum’s native cryptocurrency.\n\nThe Merge\n\nThe Merge was completed on September 15th, 2022 06:42:42 UTC at block 15537393, transitioning Ethereum from Proof of Work (PoW) to Proof of Stake (PoS) (PoS). The Ethereum PoS network is used by Amazon Managed Blockchain’s Ethereum Mainnet nodes.\n\nThe Merge transforms Ethereum’s consensus from PoW to PoS by combining the Ethereum Mainnet and the Beacon Chain Proof of Stake system. This upgrade improved Ethereum’s sustainability by reducing energy consumption. And it was part of the Ethereum foundation’s ongoing upgrades to improve security, scalability, and sustainability, as described here.\n\nThe Advantages of Building on Ethereum\n\nUsing the native Solidity scripting language and Ethereum Virtual Machine, Ethereum provide an extremely flexible platform for developing decentralised applications. Decentralized application developers who use Ethereum to deploy smart contracts benefit from the rich ecosystem of developer tooling and established best practices that have come with the protocol’s maturity.\n\nThis maturity extends to the quality of user experience for the average user of Ethereum applications, with wallets such as MetaMask, Argent, Rainbow, and others providing simple interfaces for interacting with the help of the Ethereum blockchain and smart contracts deployed there.\n\nThe large user base of Ethereum encourages developers to deploy their applications on the network, further cementing Ethereum as the primary home for decentralised applications such as Defi and NFTs.\n\nThe Ethereum 2.0 protocol, which is currently in development, will provide a more scalable network on which to build decentralised applications that require higher transaction throughput in the future.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vcHJlc3MtcmVsZWFzZXMvc3RhZGVyLXJlbGVhc2VzLWxpdGVwYXBlci1mb3ItZXRoeC1pdHMtZXRoLWxpcXVpZC1zdGFraW5nLXNvbHV0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Stader releases Litepaper for ETHx, its ETH liquid staking solution - Cointelegraph",
        "content": "Stader, a multi-chain, non-custodial liquid staking protocol with ~100mn $+ in TVL, will soon launch its liquid staking token, ETHx. Stader released its Litepaper for ETHx highlighting how ETHx will boost home stakers, with the lowest bonding requirement in the ecosystem of just 4 ETH and also deliver best-in-class staking yield and DeFi for users.\n\nThe Ethereum staking ecosystem is mature with multiple protocols and entities providing services, however, an evaluation of the current state of Ethereum staking highlights some key challenges:\n\nHigh concentration of ETH staked with few entities:\n\nTop 3 entities having over 50% of ETH staked through them. A top liquid staking protocol that has nearly 90% market share and works exclusively with permissioned node operators.\n\nLiquid Staking Deposit (LSD) protocols that work with permissionless node operations have struggled to keep up with user demand.\n\nBeyond the top protocol, LSDs have yet to achieve meaningful acceptance in the DeFi space.\n\nStader’s ETHx has been thoughtfully designed to address these challenges:\n\nHome stakers will be the backbone of ETHx with only 4 ETH required for bonding: Stader did an extensive data analysis in collaboration with SSV on the bond requirement and concluded 4 ETH is sufficient to cover key tail risks that impact staked funds.\n\nScalability and Resilience: ETHx will have a multi-pool architecture that includes permissionless and permissioned pools solving for decentralization and scalability at the same time. In the future, ETHx will also support a dedicated Distributed validator technology (DVT) pool that will improve node operator resilience.\n\nBest-in-class staking yield to users with exposure to staking rewards, MEV and tips at a competitive commission of 10% (to be shared equally between node operators and Stader).\n\nFull fledged DeFi, leveraging Stader’s expertise from building DeFi ecosystems for its liquid tokens across 6 chains. Stader has 40+ protocols supporting its LSDs including AAVE v3 (Polygon market), Balancer, Beefy, Quickswap, Apeswap, BeethovenX and more!\n\nAmitej Gajjala, Co-founder and CEO, Stader Labs, CEO of Stader, said:\n\n\"We are excited to launch ETHx soon. ETHx is meticulously designed to address key challenges in the Ethereum ecosystem. ETHx will be decentralized, yet scalable with home stakers as the backbone and permissioned operators supplementing home stakers and providing scalability. ETHx will also provide best-in-class staking and DeFi yield for its users, building on our strong, multi-chain track record in liquid staking.\"\n\nStader’s ETHx mainnet launch is scheduled for Q1 2023.\n\nAbout Stader\n\nFounded in April 2021, Stader Labs (https://www.staderlabs.com/) is a non-custodial multi-chain liquid staking platform with over USD 110 Mn+ PoS assets staked. Currently live on 6 chains (including BNB Chain, Polygon, Hedera, Fantom, Near, etc.), users can stake PoS tokens, earn staking yields, and also amplify yields across several DeFi opportunities like Aave, Balancer, etc.\n\nOver 25,000+ wallets have staked with Stader. Stader is backed by notable funds including Coinbase Ventures, Pantera, Jump Crypto, Accel Partners and Accomplice.\n\nWebsite: https://www.staderlabs.com/\n\nSocial Links: Twitter | Telegram | Discord\n\nContact: Vibin P, Business Head (ETH, Matic)\n\nEmail: stader_eth@staderlabs.com"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3R3by1tYWpvci1jcnlwdG8tcHJpY2UtcHJlZGljdGlvbnMtYml0Y29pbi1hbmQtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Two Major Crypto Price Predictions: Bitcoin and Ethereum - Analytics Insight",
        "content": "BTC/USDT 1-Hour Price Analysis (Source – TradingView)\n\nLooking at the Bitcoin 1-Hour chart, the analysis shows that Bitcoin has been trading above the 200-day MA and the 50-day MA. It means that we are now experiencing an introduction to the bull reign. And the 50-day MA is over the 200-day and the distance between the two moving averages is wide, which are good signs for a bull run.\n\nThe resistance of BTC lies at $17550.46 and $17597.18, while the support is at the previous strong low, $16889.01. Moreover, there is an order block placed around $17222.60 and $17139.74, whereas buyers are waiting for a reversal miracle to happen. The RSI of Bitcoin is positioned at 62 which is a strong area, so we can expect a price reversal at an RSI level of 70.\n\nETH/USDT 1-Hour Price Analysis (Source – TradingView)\n\nAnother major cryptocurrency in the market, Ethereum has been positively fluctuating since the start of 2023. Moreover, the RSI of Ethereum is at 57.24. Seeing the price trading closely above the 50-day MA indicates that we can expect a sideways market for a while. It is more advisable to wait for a certain breakout to one side of the channel and take the trade to achieve a better risk-to-reward ratio.\n\nThe price is also above 200-day MA since the bulls can reverse the price from the downtrend. The bearish scenario is likely to happen if Ethereum breaks the lower trendline of the rising wedge. If so, we can expect Ethereum’s bearish price will be $1,270. Another possible scenario is that Ethereum’s price can reach $1,380.\n\nHowever, investors need to look out for the Consumer Price Index data which will be released tomorrow, January 12, 2023, for more liquidity pull and rugs.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91c2RjLXRyYW5zZmVyLXZvbHVtZS1oaXQtNXgtdXNkdC1zLWluLWZhbGxvdXQtZnJvbS1mdHgtY29sbGFwc2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "USDC's ERC-20 transfer volume hit 5X USDT's in fallout from FTX collapse - Cointelegraph",
        "content": "Circle's Stablecoin USD Coin (USDC) has grown in popularity on Ethereum since the collapse of FTX. USDC's ERC-20 variant now frequently reaches daily transfer volumes four to five times that recorded by major competitor Tether (USDT) on the network according to data from blockchain analytics firm Glassnode.\n\nThat’s despite the total market cap of USDT being $23 billion greater than USDC. As of Jan. 10, the difference was in USDC’s favor by a margin of four and a half times.\n\nBoth stablecoins recorded surges in transfer volumes following an infamous tweet from Binance CEO Changpeng Zhao on Nov. 6 announcing Binance would liquidate its entire FTX Token (FTT) holdings. FTX went into bankruptcy soon after.\n\nSince then, USDC has been the preferred choice for crypto users, averaging over $12.5 billion more in transfer volume per day than USDT on Ethereum, according to Glassnode data.\n\nTotal transfer volumes for USDC (In blue) and USDT (In green) from Oct. 8, 2022, to Jan. 10, 2023. Source: Glassnode.\n\nIt is worth noting however, most of USDT's total trading volume seems to be hosted on other networks, as the asset's total 24-hour trading volume hovered around $25 billion on Jan. 10, according to data from CoinMarketCap.\n\nWhile each stablecoin is designed to trade as close to one U.S. dollar as possible and is backed by reserves held by its issuers, USDC is regarded by some in the crypto community as a potentially safer option.\n\nSupporters point to USDC’s assets, which are backed by cash or short-term United States treasuries and its monthly audits by global accounting firm Grant Thornton.\n\nTether has faced criticism over several years for not providing a proper audit and being less transparent about its reserves.\n\nThe company behind USDT was fined $41 million in October 2021 by the Commodity Futures Trading Commission, which accused it of only holding sufficient reserves 27.6% of the time between 2016 and 2018 despite claiming its tokens were fully backed by fiat currencies.\n\nTether has been reducing the commercial paper backing its issued tokens in favor of safer alternatives, with the latest asset breakdown on Nov. 10 shows that nearly $46 billion of its reserves consist of cash, bank deposits and U.S. treasuries.\n\nRelated: Crypto.com delists USDT for Canadian users following OSC ban\n\nUSDT briefly lost its peg to the U.S. dollar following the FTX collapse amid fears of exposure to Alameda Research and FTX, which Tether denied.\n\nOn-chain evidence suggests the two firms were attempting to short the stablecoin.\n\nUSDT had been recording transfer volumes much higher than USDCs up until May 2021, after Tether had increased the supply of the token from $8.79 billion to $61.82 billion in the previous year, representing an increase of 603%.\n\nMarket cap of USDT from May 2018 to January 2022. Source: TradingView\n\nDespite the subsequent change in consumer preferences, Tether had referred to the growth in market capitalization as an indication of “the market’s continued trust and confidence in Tether.” It noted every token could be redeemed for U.S. dollars on a 1:1 basis.\n\nUpdate Jan. 12, 9:30 am UTC: Amended the article to clarify that the data only reflected ERC-20 transaction volumes and not those on other chains"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmZvcmJlc2luZGlhLmNvbS9hcnRpY2xlL2NyeXB0b2N1cnJlbmN5L2FsdGNvaW5zLWV4cGVyaWVuY2Utc3Ryb25nLWdhaW5zLXRyaWdnZXItc2hvcnQtc3F1ZWV6ZS84MjQzNy8x0gF1aHR0cHM6Ly93d3cuZm9yYmVzaW5kaWEuY29tL2FtcC9hcnRpY2xlL2NyeXB0b2N1cnJlbmN5L2FsdGNvaW5zLWV4cGVyaWVuY2Utc3Ryb25nLWdhaW5zLXRyaWdnZXItc2hvcnQtc3F1ZWV6ZS84MjQzNy8x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Altcoins experience strong gains, trigger short squeeze - Forbes India",
        "content": "\n\n\n\nAfter a period of little activity and reduced volatility, the crypto market saw a resurgence on Monday as coins with lower market values experienced strong gains, performing better than the more established currencies like Bitcoin and Ethereum.\n\n\n\nSeveral smaller crypto saw significant gains in recent trading, including FTT, the token of a failed crypto exchange, which rose 55 percent in the past 24 hours despite being down 96 percent over the past year.\n\nOther notable performers included Serum (SRM), the token of a decentralised exchange built on the Solana blockchain, which rose 28 percent, Zilliqa's native token ZIL, which gained 37 percent, and APT, the token of the Aptos blockchain project, which rose 30 percent.\n\n\n\n\n\nThe unexpected increase in crypto prices caught many traders betting on crypto prices to fall by surprise. In response, traders closed out $245 million worth of short positions within the past 24 hours. This was the largest daily liquidation of short positions since November 10th, when market volatility was caused by the struggles of the crypto exchange FTX.\n\n\n\n\n\nThe recent surge in crypto prices occurred after the largest crypto by market capitalisation, Bitcoin, regained a value of $17,000 after remaining relatively stable for three weeks, which helped to improve overall market sentiment.\n\n\n\n\n\nThis sudden price action was seen as a relief rally for smaller tokens due to the exhausted sellers and limited buying options. Popular crypto analyst Alex Kruger stated on Twitter that this price action was caused by a combination of factors, including year-end sales of alternative coins and derivative traders anticipating such sales. Additionally, shorts, or bets on price decreases, were also squeezed.\n\n\n\n\n\nHistorically, when small-cap tokens and meme coins experience strong gains, it is a sign of an impending downturn in the market, as traders tend to shift their profits from leading digital assets to these smaller projects and then sell them off.\n\n\n\n\n\nHowever, crypto analyst Alex Kruger believes that the current recovery in crypto prices will continue and that it is similar to the early days of 2019 when the market bottomed out. He also stated that the exceptional performance of alternative coins in comparison to Bitcoin and Ethereum might come to an end soon because of the funding rate normalising.\n\n\n\n\n\nFurthermore, he pointed out that it is still a bear market, so traders should be cautious.\n\n\n\n\n\nThe writer is the founder at yMedia. He ventured into crypto in 2013 and is an ETH maximalist. Twitter: @bhardwajshash"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9nYWxhLXRoZS1yYWxseS1pbi1wcmljZS1pcy1lbnRpY2luZy1idXQtdGhlcmUtaXMtbW9yZS10aGFuLW1lZXRzLXRoZS1leWUv0gFjaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2dhbGEtdGhlLXJhbGx5LWluLXByaWNlLWlzLWVudGljaW5nLWJ1dC10aGVyZS1pcy1tb3JlLXRoYW4tbWVldHMtdGhlLWV5ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "GALA: The rally in price is enticing, but there is more than meets the eye - AMBCrypto News",
        "content": "GALA’s price has gone up by over 100% since 30 December\n\nProfit-taking has, however, commenced, so a price drawback is imminent\n\nGALA, an Ethereum [ETH]-based asset, has seen a significant price increase of 194% since 30 December. The king of altcoins reached a new high of $0.048 since mid-September, joining the ranks of other altcoins experiencing growth in 2023, data from Santiment revealed.\n\n? Amongst the many surging #altcoins in 2023, $GALA has been making a tremendous run. The price of the #Ethereum-based asset is up +194% since December 30th, and has exceed $0.048 for the first time since mid-September, backed by big whale transactions. https://t.co/Oe7XYd88gq pic.twitter.com/sFnvvPhkOv — Santiment (@santimentfeed) January 9, 2023\n\nRead GALA’s Price Prediction 2023-2024\n\nThe significant surge in GALA’s price can be attributed to the rise in whale transactions involving the token. According to the on-chain analytics platform, since the year began, the count of whale transactions involving GALA that exceeded $100,000 went by over 10,000%.\n\nSimilarly, for whale transactions that exceeded $1 million, the count went up by over 500%. For cryptocurrency assets, a strong correlation exists between increased whale activity and positive price action.\n\nLikewise, growth in network activity can positively impact an asset’s price, as the former typically initiates a rally in the latter. Since the close of the 2022 trading year, GALA witnessed increased network activity.\n\nAs a result, the count of unique addresses trading GALA tokens daily witnessed a surge. Similarly, new demand for the altcoin rallied together with the number of GALA transactions completed.\n\nPer Santiment, the count of daily active addresses trading GALA has since increased by 500%. As of 9 January, 7655 unique addresses traded GALA tokens.\n\nAlso, GALA saw an influx of new demand as the number of new addresses created daily on the network to trade the altcoin jumped by 672%. Moreover, the number of completed transactions involving GALA tokens since the end of 2022 rallied by 646%.\n\nGALA set to be guillotined\n\nAn assessment of GALA’s price movement on the daily chart revealed that its current price hovered in the overbought region.\n\nAt press time, key momentum indicators Relative Strength Indicators (RSI) and Money Flow Index (MFI) were spotted at overbought highs, which was often difficult for buyers to sustain. The RSI rested at 88.75, while the MFI laid at 97.13.\n\nHow many GALAs can you get for $1?\n\nOverbought conditions are often considered a warning sign that the asset’s price may be due for a correction, as the high prices may not be sustainable in the long term. In addition, it can be a signal that market sentiment is too optimistic and can’t maintain the current levels.\n\nFurther, an analysis of GALA’s exchange activity on the blockchain revealed that profit-taking was underway at press time as investors have closed their trading positions. In the last four days, GALA’s supply on exchanges has rallied by 5%.\n\nConversely, the number of GALA tokens held outside exchanges dropped by 0.38%. This indicated that GALA holders were sending their holdings to exchanges for sale.\n\nInterestingly, despite the surge in price in the past few weeks, many holders still incurred losses. GALA’s MArket Value to Realized Value (MVRV) ratio showed that the alt was undervalued for August 2022."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vbGVhcm4uYnliaXQuY29tL2FsdGNvaW4vYXN0YXItbmV0d29yay1hc3RyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Astar Network (ASTR): Shining Brightly With Scalable Interoperability - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vaW52ZXN0b3JwbGFjZS5jb20vMjAyMy8wMS90aGUtdG9wLTctY3J5cHRvcy10by1idXktYmVmb3JlLXRoZS1uZXh0LWJpdGNvaW4taGFsdmluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "The Top 7 Cryptos to Buy Before the Next Bitcoin Halving - InvestorPlace",
        "content": "Tune in Wednesday, March 13th at exactly 1 PM ET for Louis’ Emergency Briefing and receive his #1 stock pick for 2024 FREE."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2Jlc3QtZGVjZW50cmFsaXplZC1leGNoYW5nZXMtb2YtMjAyMy10b3AtZGV4cy1mb3ItdHJhZGluZy1jcnlwdG9zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Best Decentralized Exchanges of 2023- Top DEXs for Trading Cryptos - Analytics Insight",
        "content": "The cryptocurrency market has seen massive growth in the last few years, with decentralized exchanges (DEXs) becoming increasingly popular among users for their superior security and decentralization. The recent meltdown of FTX, one of the leading crypto exchanges in the world, left investors scrambling to find a secure and advanced way to trade digital assets. With no single point of control or control in the hands of third parties, the Best decentralized exchanges of 2023 will allow users to trade freely and securely with no interference from external parties.\n\nThe Best Decentralized Exchanges (DEXs) in 2023 with Highest Users:\n\nCovo – Best DEX for trading cryptocurrencies with upto 50X leverage\n\n– Best DEX for trading cryptocurrencies with upto 50X leverage Uniswap – DEX with the Highest number of trading pairs\n\n– DEX with the Highest number of trading pairs Curve Finance – Best Exchange for swapping and trading stablecoins\n\n– Best Exchange for swapping and trading stablecoins Pancake Swap – Best DEX on Binance Smart Chain (BSC)\n\n– Best DEX on Binance Smart Chain (BSC) DYDX\n\nKyber Swap\n\n1) Covo Finance\n\nCovo Finance is a 100% decentralized spot and perpetual swap exchange where users can trade Bitcoin, Ethereum, and other popular cryptocurrencies directly from their wallets with no custodial risk. What sets Covo apart from its competitors is its commitment to safeguarding users’ funds while providing trading solutions with low-fee swaps and leveraged trading up to 50x.\n\nCovo Finance has launched a COVO Token reward system, which acts as a governance utility token. Stakers are rewarded in the form of 30 percent of the platform’s generated protocol fees in Matic tokens, esCOVO tokens, which can be staked or vested to earn COVO Tokens, and Multiplier Points, which boost yield without contributing to token inflation. Multiplier Points increase yield as if a user was staking the same COVO tokens, thus increasing long-term holders’ returns and reward without contributing to token inflation.\n\nWith its 50X leverage features on trading BTC, ETH, etc., Covo Finance is slowly emerging as the number one choice for traders looking for the best decentralized exchanges in 2023.\n\nCovo Finance could become the default decentralized hub of DeFi activities, making it easier for users to swap tokens, leverage trades, manage liquidity, and mint new tokens.\n\nCovo Finance has also set up multiple pools for liquidity providers. Here, 70 percent of the platform’s revenue, generated from leverage trading and trading fees, is distributed among the liquidity pools, which consist of 50% stablecoins like USDC and the rest in BTC, ETH, etc. In the pool, participants can mint COVOLP tokens with any currently underweight asset, thus counterparty-ing trades and mitigating risk to traders. Redeeming COVOLP tokens also comes with rewards, as users can choose to receive current overweight tokens in the pool with fee discounts.\n\nTo facilitate a low-friction experience, Covo has put users’ security at the forefront, emphasizing that all funds are fully protected, so users don’t have to worry about their crypto being exposed.\n\n2) Uniswap\n\nSince 2018, Uniswap has been the market’s most widely used decentralized exchange platform. Powered by the Ethereum blockchain, Uniswap provides a platform for developers, traders, and liquidity providers to create, build and swap tokens. Compared to traditional centralized exchanges, Uniswap is completely decentralized, eliminating the risk of hacking and preventing users from having to give up control of their private keys. In addition, Uniswap also allows users to list tokens on their exchange for free.\n\nUniswap is also available as an open-source prototyping protocol, which makes it easier to create decentralized exchanges. Uniswap is driven by two main smart contracts: an “Exchange” contract and a “Factory” contract. It does not require an oracle problem as it is integrated with TWAP price oracles. This proof-of-stake oracle creates gas usage and price delivery efficiencies. The latest version, V3, is widely adopted as it has consumed 15.5 million transactions and 2.8 million gas. It is also the most popular Ethereum contract, ranking first amongst all Ethereum decentralized applications.\n\nOverall, Uniswap is one of the best-decentralized exchanges platforms out there, with a wide range of features. One of the unique features of Uniswap V3 is the newly introduced Permit2, which allows users to swap any ERC20 or NFT-type token. This feature eliminates the smart contracts mismatch and thus removes the oracle problem. In addition, the Uniswap platform provides liquidity mining access, allowing users to earn rewards for providing liquidity.\n\n3) DyDx\n\nDyDx is a non-custodial decentralized exchange (DEX) protocol that allows users to trade various cryptocurrencies without giving up control of their private keys. With the help of its layer-2 solution, DyDx has become a well-known platform for fast and efficient trading with up to 20x leverage. The low trading fees, minimum trade size, and decentralized governance structure make it an attractive choice for users.\n\nDue to its layer-2 solution, the DyDx protocol offers high transaction speed with minimal gas costs. It also allows users to trade with perpetual instruments in which two parties agree to exchange one financial asset for another at a specific time. On the DyDx exchange, users have access to BTC-USD, ETH-USD, LINK-USD, and more trading pairs. In addition, the platform also offers low trading fees and slippage.\n\nIn August 2020, the Curve protocol introduced a decentralized autonomous organization (DAO) to manage changes to the protocol. Through its native token CRV, holders can vote on protocol changes. Finally, on DyDx, users can stake their tokens in liquidity pools and get rewarded for adding liquidity to the platform.\n\n4) Curve Finance\n\nCurve Finance is a decentralized exchange for a trading cryptocurrency focused on stablecoins. The Curve platform leverages automated market maker (AMM) technology to maintain low fees and slippage costs to users. It offers a variety of stablecoins, including DAI, USDT, USDC, BUSD, and TUSD.\n\nIn addition, users have access to the Curve token, known as CRV. This token is used to incentivize liquidity providers on the platform and encourage users to participate in the protocol’s governance. Curve also offers crypto pools which allow users to pool their assets together and trade them at current prices. These pools also allow variable fees, ranging from 0.04% to 0.4%.\n\nFinally, Curve is integrated with the Dai Savings Rate (DSR), allowing users to earn interest on DAI deposited in the protocol. It is an attractive feature for users looking to earn passive income from their crypto investments.\n\n5) Pancake Swap\n\nPancake Swap (CAKE) is the leading decentralized exchange operating on the Binance Smart Chain. On the PancakeSwap platform, users can swap tokens, stake CAKE in Syrup Pools, partake in Initial Farm Offerings (IFOs), engage in perpetual trading, and buy/sell NFTs via the NFT Marketplace. The platform is open-source and has been audited by top blockchain security firms, such as Certik and Slowmist.\n\nPancakeSwap is powered by the native token CAKE, which rewards users who provide liquidity. The platform has gained considerable popularity due to the low transaction costs and high liquidity in the tradable assets. In terms of user experience, PancakeSwap is simple and easy to use and provides an intuitive UI.\n\n6) Kyber Swap\n\nKyberSwap is a decentralized exchange aggregator that supports multiple blockchains, including Ethereum, Binance Smart Chain (BSC), Polygon, Avalanche, Fantom, Cronos, Arbitrum, Velas, and Aurora. On KyberSwap, users can swap tokens and earn rewards from liquidity mining. KyberSwap provides an intuitive UI and a highly secure platform for users to trade tokens with just a few clicks.\n\nKyberSwap is also integrated with the Dai Savings Rate (DSR), allowing users to earn interest on DAI deposited in the protocol. Users can also liquidate their tokens in the most capital-efficient manner via the liquidity pools, earning them fees. Finally, KyberSwap is powered by the native token KNC, which rewards KyberSwap users and incentivizes liquidity providers.\n\nThis list of the best decentralized exchanges DEXs in 2023 highlights the developments in the decentralized exchange market over the years and the promise of more secure and user-friendly alternatives to the more traditional centralized exchanges. Despite the emergence of DEXs, the centralized exchange market still takes up the lion’s market share due to brand recognition, larger trade volumes, and user confidence. However, with the ever-growing number of DEXs, this could be set to change soon as DEXs continue to develop and improve their functionality and user experience.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LnRoZW5ld3NtaW51dGUuY29tL2JpdGNvaW4tYW5kLWNyeXB0by9maXZlLWNyeXB0by1wcmVkaWN0aW9ucy1oZWxwLXlvdS10cmFkZS1iZXR0ZXItMjAyMy0xNzE3NzDSAXRodHRwczovL3d3dy50aGVuZXdzbWludXRlLmNvbS9hbXAvc3RvcnkvYml0Y29pbi1hbmQtY3J5cHRvL2ZpdmUtY3J5cHRvLXByZWRpY3Rpb25zLWhlbHAteW91LXRyYWRlLWJldHRlci0yMDIzLTE3MTc3MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Five crypto predictions to help you trade better in 2023 - The News Minute",
        "content": "Bitcoin and Crypto\n\nFive crypto predictions to help you trade better in 2023\n\nOur focus is on: Bitcoin, Ethereum, Regulations, Passive Earning and NFTs."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wMS8xMS9oaWdoZXItbG93cy10cmVuZC1wYXVzZS1vbi1yZXNpc3RhbmNlLXdoYXRzLW5leHQtZm9yLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Higher Lows Trend Pause on Resistance, What's Next for Ethereum? - The Coin Republic",
        "content": "The bullish momentum in Ethereum price is facing resistance at the $1350 resistance.\n\nThe buyers have immediate support at $1300.\n\nThe trading volume saw a decrease of 18% in the last 24 hours.\n\nThe second largest cryptocurrency Ethereum has produced a bullish price structure this month. So far, the crypto market is influenced by positive vibes as the capitalization remains above $850 billion, as the largest crypto BTC cleared the key short-term resistance this week.\n\nBuyers are back in the game after a massive consolidation phase. While the buyers pushed through the crypto valuations above the short-term resistance, the next bullish hurdle hindered the upward momentum.\n\nEthereum Price Hit $1350 Resistance\n\nEthereum price struggled against the $1350 resistance in the intraday session against USDT. The buyers should break this hurdle as soon as possible to gain the $1660 level before the end of this month. The rising trading volume suggests further continuation of the uptrend. Meanwhile, the price action on the hourly time frame is making higher lows.\n\nAt that time Ethereum price (ETH) was trading at $1333 with neutral changes. Notably, the crypto price is nearing its December high with an 11.5% monthly gain. Thus, the price of Ethereum relative to bitcoin is down 0.67% to 0.7646 satoshis. Market capitalization rose 0.68% to $163.2 billion as of paper overnight data.\n\nAfter the breakout, the $1300 area is looking good for immediate support but trading volume has decreased by 18% in the last 24-hours, indicating a lack of sellers from the market. At the current price point, there could be a price correction if trading volumes increase.\n\nOn the daily chart, Ethereum investors accumulate the coin towards the 200-day exponential moving average. Conversely, ETH price stability above 100 EMA is influencing the bulls to dominate the trend of the crypto.\n\nThe daily RSI peak is approaching the entrance of the overbought zone. According to the RSI, Ethereum price is trading in the demand zone. Similarly, ADX remains near the 25 mark, favoring buyers for more accumulation.\n\nSummary\n\nEthereum close story looks good for swing trading up to the $1500 resistance area. Technical indicators are turning bullish on ETH and the RSI indicator is about to enter the overbought zone. The bulls must hold the $1300 support to protect themselves from the second phase of the price correction.\n\nSupport level – $1300 and $1000\n\nResistance level – $1500 and $1800\n\nDisclaimer\n\nThe views and opinions stated by the author, or any people named in this article, are for informational ideas only, and they do not establish financial, investment, or other advice. Investing in or trading crypto assets comes with a risk of financial loss."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL2V0aGVyZXVtLWwycy10cmFuc2FjdGlvbi12b2x1bWUv0gE_aHR0cHM6Ly93d3cudHJvbndlZWtseS5jb20vZXRoZXJldW0tbDJzLXRyYW5zYWN0aW9uLXZvbHVtZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Ethereum L2s Beat ETH In Transaction Volume - TronWeekly",
        "content": "Ethereum layer-2 networks Arbitrum and Optimism have recorded a surge in transaction volume in the span of just three months, surpassing even that of the mainnet Ethereum.\n\nData from Dune Analytics showed that Arbitrum and Optimism combined processed over 1.12 million transactions while Ethereum processed over 1.06 million transactions on Jan. 10.\n\nOn the other hand, since late October, transactions on the Ethereum network have decreased by roughly 33%, according to Etherscan.\n\nWith regards to the l2s, Optimism [OP] for one, has kickstarted the year on an optimistic note as it enjoys a bull run. But, has suffered stagnancy in terms of total value locked [TVL].\n\nIn comparison to that, Arbitrum has reportedly outpaced the other top Layer 2 blockchains, such as Optimism and Polygon, when it comes to TVL. The former, however, is unaffected as it continues to increase in tempo and rule the L2 region.\n\nNonetheless, L2 transactions boost Ethereum’s appeal when they are included in the mix.\n\nEthereum’s Layer-2 And Staking Fuels Usage\n\nL2beat data showed that towards the middle of October, the number of L2 transactions per second actually surpassed that of Eth layer 1 transactions, and it remained higher for the vast majority of the time afterward.\n\nThe term “Layer 2” is used to describe an additional framework or protocol that is implemented on top of an existing blockchain system.\n\nOverall, 2022 was a mixed bag for the leading smart contract platform Ethereum [ETH] as the network eventually shifted from proof-of-work [PoW] to proof-of-stake [PoS].\n\nThis includes its first-ever price slide below the high of the previous cycle.\n\nAnother factor driving up ETH usage is the upcoming Shanghai hard fork of the most popular altcoin, which is anticipated to occur in March. Staking risk will be reduced with this upgrade by withdrawing staked Ether [stETH] from the Ethereum Beacon chain.\n\nIn preparation for the upgrade, the prices of the Lido DAO [LDO] and Stakewise [SWISE] tokens, two systems that permit Ether staking, have increased by double digits over the previous week.\n\nWith $23.06 billion in value locked on the multiple dApps running on the network, Ethereum remains to be the most valuable protocol in terms of total value locked (TVL), according to data from Defi Llama."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vYmxvY2tjaGFpbnJlcG9ydGVyLm5ldC93aGljaC1ibG9ja2NoYWluLWlzLXRoZS1iZXN0LWZvci1kZXZlbG9wZXJzLWluLTIwMjMtc29sYW5hLXZzLWV0aGVyZXVtLXZzLWNhcmRhbm8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Which Blockchain is the Best for Developers in 2023? (Solana vs Ethereum vs Cardano) - Blockchain Reporter",
        "content": "One of the first steps for building any Web3 project is to choose a blockchain you’re going to work with. This stage is essential since this choice would greatly impact your future product. In this article, we’re going to compare the three most popular blockchains from a developer’s point of view: Solana, Ethereum, Cardano.\n\nSolana\n\nSolana is the most popular Ethereum alternative for running smart contracts and decentralized applications, which stands out for its incredibly low transaction costs, huge bandwidth, and high scalability. It is worth noting that the first DeFi bond market on Solana, SuperStable, had its smart contract audited for security by ULAM LABS.\n\nEase of development and deployment\n\nTo create smart contracts and dApps on Solana, you’d have to utilize Rust, one of the world’s most often used programming languages.\n\nIn addition, it is also worth noting that the project team has developed a protocol called LLVM (Low-Level Virtual Machine) for compiling smart contracts and applications written in other languages for WASM:\n\nC;\n\nC++;\n\nC#;\n\nGo;\n\nothers.\n\nUsing LLVM, you can easily and quickly migrate your smart contracts and applications from WASM networks (Dfinity, EOS, Polkadot, and Eth2) to the Solana environment.\n\nNo problems with the mempool\n\nA mempool is a kind of “waiting zone” where all initiated but not yet confirmed transactions are waiting for their confirmation. Solana outperforms other networks (including Ethereum, Bitcoin, BSC, Avalanche, and Tron) in a way that it doesn’t have such a zone.\n\nIn Solana, operations are processed so quickly (400 ms) that they simply do not have time to cause any queue. Whereas in Ethereum and Bitcoin, such queues are considered to be the norm. Because of these queues, users must compete with each other to confirm their transactions and ultimately increase their costs.\n\nLow resource consumption\n\nSolana solved the resource consumption problem with a Turbine protocol, which acts like a torrent network. It breaks each block into many small pieces, after which each node downloads one of the pieces and distributes it to other participants.\n\nEthereum\n\nEthereum is a community-driven technology that powers the Ethereum (ETH) cryptocurrency and thousands of decentralized applications. There are two accounts available through Ethereum, one is an external account, and the other is a contract account. Also, the network allows developers to use all kinds of decentralized applications.\n\nSimple\n\nBlockchain code recipes for developing Ethereum applications are simple and easy to deploy, reducing the overall development cost.\n\nModular\n\nEthereum contracts can be developed as small modules that can be combined to provide the desired functionality. It is convenient to make changes to a module rather than to the entire protocol, so the modular structure keeps the development faster and more robust.\n\nEthereum Virtual Machine\n\nThe Ethereum Virtual Machine is built to handle the runtime environment for compiling and implementing smart contracts based on Ethereum. This type of engine is run on Solidity, the language of smart contracts for Ethereum.\n\nEthereum virtual machines run in an environment known as a sandbox. Therefore, you can test smart contracts and see if they work for your specific case. If you are satisfied with the performance, you can implement your code on the main Ethereum network.\n\nCommunity\n\nThe Ethereum ecosystem is the most developed one in the industry. Thus there is the highest number of developers and resources here. All this makes development smooth and streamlined. For any question you might have, there will be an answer out there.\n\nCardano\n\nCardano is a next-generation blockchain platform for smart contracts and dApps that claims to be a faster and more scalable counterpart to Ethereum.\n\nTwo-layer network architecture\n\nOne of the biggest advantages of using Cardano to develop your web3 applications is that the blockchain is divided into two related but entirely independent layers:\n\nThe first one is the Cardano Settlement Layer (CSL). Responsible for running Cardano wallets and processing transactions. In the future, it is planned to add an exchange of ADA for coins of custom side chains and other cryptocurrencies. The second one is the Cardano Computation Layer (CCL). Responsible for the operation and calculation of smart contracts and dApps. It uses the Haskell programming language, which is considered one of the most advanced and secure.\n\nThis separation allows significant changes to be made to the blockchain without unnecessary forks. In addition, this also means that errors and failures in the operation of dApps or smart contracts will not affect the processing of transactions in any way and vice versa.\n\nOuroboros consensus mechanism\n\nAccording to the Cardano team, the main advantage of their project is the Ouroboros consensus algorithm. This is a proven safe variation of Proof-of-stake, where transactions are not verified by every node (as in Proof-of-work) but by a selected group of network participants — slot leaders.\n\nScalability\n\nThanks to the Ouroboros consensus mechanism and sidechain technology, Cardano has the potential to process a trillion transactions per second.\n\nWith this scaling potential, Cardano can become the basis for developing applications and websites of any level, from small web3 blogs to blockchain-based versions of Amazon or Alibaba.\n\nInteroperability\n\nThis is a property of the Cardano network, which implies the possibility of several heterogeneous shards and blockchains working together. Thanks to it, you can create smart contracts and applications that are very closely related to each other but at the same time remain independent.\n\nOverall comparison chart\n\nBottom line\n\nIf you choose to work on a public blockchain, you will spare yourself a huge amount of expensive blockchain development and maintenance work. Which means that you can focus only on business logic and processes of your business.\n\nIf you decide to develop your own blockchain or fork an existing one, you should be well aware that it is expensive and quite difficult. The fork in the future will have to be maintained, bug fixes applied, related software forks, and their code updated as well.\n\nAll three described blockchains are extremely specific and have many internal nuances. We recommend that you carefully consider how your project will use the blockchain. Consulting professionals can help you make the best decision for your project https://www.ulam.io/software-services/crypto-software-development . Blockchain software development is challenging but much easier and safe with dedicated blockchain company."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDEvMTEvYml0Y29pbi1ldGhlcmV1bS1nYWxhLXByaWNlLWZvcmVjYXN0aW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Gala Price Forecasting - The Cryptonomist",
        "content": "Bitcoin Analysis\n\nBitcoin’s price closed Tuesday’s daily session in green figures for the seventh time over the last ten days and +$257.\n\nToday we’re looking back at Bitcoin’s previous two bear markets on the weekly time frame and Bitcoin’s price now relative to the BTC/USD 1W chart below from Roral. BTC’s price is trading between the 0 fibonacci level [$15,743.1] and the 0.113 [$21,751.9], at the time of writing.\n\nTraders will note from the two previous bear markets that once the bottom was made on BTC there were months of consolidation and accumulation from bullish traders.\n\nFor bullish market participants to signal the bottom’s potentially in, they want to regain the 0.113 fib level followed by 0.236 [$28,292.5], 0.382 [$36,056.0], 0.5 [$42,330.7], and the 0.618 fib level [$48,605.3].\n\nThe bearish perspective is much different and bearish traders are still in control of the larger trend until bullish BTC market participants regain Bitcoin’s previous cycle high of $19,891. They’ve a primary target to the downside of the 0 fibonacci level. If they can push BTC’s price below that mark then there will be a new multi-year low on BTC and further downside becomes statistically more probable.\n\nThe Fear and Greed Index is 26 Fear and is equal to Tuesday’s reading.\n\nBitcoin’s Moving Averages: 5-Day [$16,997.07], 20-Day [$16,922.89], 50-Day [$17,211.63], 100-Day [$18,532.56], 200-Day [$23,412.14], Year to Date [$16,912.99].\n\nBTC’s 24 hour price range is $17,155-$17,506 and its 7 day price range is $16,689-$17,506. Bitcoin’s 52 week price range is $15,505-$48,162.9.\n\nThe price of Bitcoin on this date last year was $42,725.\n\nThe average price of BTC for the last 30 days is $16,914.5 and its +0.5% over the same period.\n\nBitcoin’s price [+1.50%] closed its daily candle worth $17,445 and in positive figures for the third consecutive day on Tuesday.\n\nEthereum Analysis\n\nEther’s price has marked-up 5.54% over the last three days and when traders settled-up on Tuesday, ETH’s price was +$14.65.\n\nThe ETH/USD 1D chart below by DannyC914 is the next chart we’re analyzing for this Wednesday. At the time of writing, ETH’s price is tucked between the 0.618 fibonacci level [$1,303.99] and the 0.382 fib level [$1,446.43].\n\nThe next significant level for bulls to reclaim is ETH’s 2018 all-time high and the 0.382 fib level [$1,446.43]. Above the 0.382 fibonacci level the secondary target for bulls of the Ether market is a full retracement to where the pattern broke down last time at the 0 fib level [$1,677.00].\n\nBearish ETH traders are attempting to pivot before or at the 0.382 fib level before attempting to push ETH’s price below the 0.618 fib level [$1,303.99]. The second target for those shorting ETH is the 1 fib level [$1,073.42]. If they have success in breaking the 1 fib level to the downside their focus shifts to 1.272 [$909.25], 1.382 [$842.45], and the 1.618 fibonacci level [$700.41].\n\nEther’s Moving Averages: 5-Day [$1,282.50], 20-Day [$1,238.19], 50-Day [$1,266.90], 100-Day [$1,359.11], 200-Day [$1,643.22], Year to Date [$1,263.30].\n\nETH’s 24 hour price range is $1,316.8-$1,347.69 and its 7 day price range is $1,214.55-$1,347.69. Ether’s 52 week price range is $883.62-$3,579.96.\n\nThe price of ETH on this date last year was $3,237.93.\n\nThe average price of ETH for the last 30 days is $1,236.77 and its +4.30% for the same duration.\n\nEther’s price [+1.11%] closed its daily candle on Tuesday worth $1,335.14 and in positive figures for a third day in a row.\n\nGala Analysis\n\nGALA’s price has climbed higher for ten of the last twelve days and marked-up +$0.00101 on Tuesday.\n\nThe GALA/USD 1D chart via MonoCoinSignal shows GALA’s price trading between the 38.20% fibonacci level [$0.03744] and 50.00% [$0.04423], at the time of writing.\n\nAs we can see below, over the last few days bullish GALA traders broke the upper ceiling of a long-term descending channel. Since, bullish traders have bumped up against the 50.00% fibonacci level and closed just below that mark when Tuesday’s candle was painted. Above the 50.00% fib level bulls have targets of 61.80% [$0.05102], 78.60% [$0.0609], 100.00% [$0.07301], and 161.80% [$0.10858].\n\nTargets for bears of the GALA market are the 38.20% fib level, 23.60% [$0.02903], and a full retracement at the 0 fibonacci level [$0.01545].\n\nGALA’s 24 hour price range is $0.04-$0.046 and its 7 day price range is $0.0176-$0.046. GALA’s 52 week price range is $0.0155-$0.394.\n\nGALA’s price on this date in 2022 was $0.32.\n\nThe average price of GALA over the last 30 days is $0.021 and its +61.36% during the same duration.\n\nGALA’s price [+2.49%] closed at $0.0416 when its daily candle was printed on Tuesday."
    }
]