[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY3J5cHRvLm5ld3MvYml0Y29pbi1hbmQtZXRoZXJldW0tb3V0cGVyZm9ybS10cmFkaXRpb25hbC1hc3NldHMtaW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum outperform traditional assets in 2023 - crypto.news",
        "content": "A new report from on-chain analytics firm Glassnode highlights the strong performance of Bitcoin (BTC) and Ethereum (ETH) compared to traditional markets in 2023.\n\nAccording to a Nov. 1 Glassnode report, Bitcoin has appreciated 93% against gold so far this year. When priced in gold, Bitcoin is trading at the highest levels since September 2021, right before the major crypto market correction. The data illustrates Bitcoin’s potential as a hedge against inflation and economic uncertainty.\n\nEthereum has also significantly outperformed gold in 2023, appreciating 39% against the precious metal. Glassnode notes that in 2023 ETH and BTC returns have been tightly correlated on a 30-day rolling basis, experiencing similar magnitude drawdowns but with Bitcoin seeing stronger performance during uptrends.\n\nNotably, both Bitcoin and Ethereum have also experienced relatively shallow corrections compared to prior crypto cycles. Glassnode highlights that Bitcoin’s maximum drawdown in 2023 has only been 20.1%, compared to over 60% corrections in previous bull markets. For Ethereum, the deepest drawdown has been 44% against the US dollar, much less than the over 60% downturns seen in previous market cycles.\n\nThis data suggests there is growing investor support and more positive capital inflows into Bitcoin and Ethereum this cycle. The coins are not seeing the same extreme volatility and selling pressure compared to the past.\n\nHowever, Glassnode points out that within crypto markets, Bitcoin dominance continues to increase in 2023. Bitcoin’s market capitalization has grown 110% year-to-date, compared to a 37% increase for the altcoin market cap excluding stablecoins. While altcoins have rallied against the dollar recently, Bitcoin remains the clear leader in terms of capital rotation between digital assets.\n\nRead more: Why everyone is talking about Solana in 2023\n\nFollow Us on Google News"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1saWZ0b2ZmLWlmLTE4NTAv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLWxpZnRvZmYtaWYtMTg1MC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Price is About to See “Liftoff” if It’s Able to Hold One Crucial Level - NewsBTC",
        "content": "Ethereum price is still struggling to clear the $1,850 resistance against the US dollar. ETH might rally again if it clears $1,820 and $1,850.\n\nEthereum is still facing a key barrier near the $1,850 zone.\n\nThe price is trading above $1,785 and the 100-hourly Simple Moving Average.\n\nThere is a major rising channel forming with support near $1,800 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could extend its increase if it clears the $1,820 resistance.\n\nEthereum Price Remains Supported\n\nEthereum started a slow and steady increase from the $1,740 zone. ETH was able to reclaim the $1,800 resistance zone and avoided a major downside correction, like Bitcoin.\n\nThe bulls even pushed the price above the 50% Fib retracement level of the downside correction from the $1,865 swing high to the $1,740 low. Moreover, there is a major rising channel forming with support near $1,800 on the hourly chart of ETH/USD.\n\nEthereum is now trading above $1,785 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $1,820 level. It is close to the 61.8% Fib retracement level of the downside correction from the $1,865 swing high to the $1,740 low.\n\nIf ETH surpasses the $1,820 resistance, it could rise toward the key barrier at $1,850. A close above the $1,850 resistance could start a fresh rally. In the stated case, the price could rally toward $1,950.\n\nSource: ETHUSD on TradingView.com\n\nThe next key resistance is near $2,000, above which the price could accelerate higher. In the stated case, the price could rise toward the $2,120 level. The main hurdle sits at $2,250.\n\nBearish Wave in ETH?\n\nIf Ethereum fails to clear the $1,820 resistance, it could start another decline. Initial support on the downside is near the $1,800 level, the 100-hourly Simple Moving Average, and the trend line.\n\nThe next key support is $1,770. The main support is now forming near the $1,750 and $1,740 levels. A downside break below the $1,740 support might spark a bearish wave. In the stated case, Ether could drop toward the $1,650 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $1,740\n\nMajor Resistance Level – $1,820\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zLXJlYXNvbnMtd2h5LWV0aGVyZXVtLXByaWNlLWlzLWRvd24tYWdhaW5zdC1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "3 reasons why Ethereum price is down against Bitcoin - Cointelegraph",
        "content": "The price of Ethereum’s native token, Ether (ETH) is trading around a 15-month low versus Bitcoin (BTC), and the lowest since Ethereum switched to proof-of-stake (PoS).\n\nCointelegraph takes a closer look at some of the reasons for the continuous drop of the ETH/BTC pair.\n\nEther’s historical price action has changed\n\nIn previous market cycles, Ethereum often outperformed BTC during bullish market trends, but this relationship began to change at the start of 2023. Ether and numerous altcoins struggled as the narrative around altcoins use within Web3, DeFi and NFTs came under pressure in 2022 and 2023.\n\nStringent regulations against the crypto industry, severely muted inflows from retail and institutional investors, an uptick in investors seeking shelter in US-dollar-pegged stablecoins also impacted sentiment for Etheruem.\n\nBitcoin dominance rises\n\nIn addition to a change in Ether’s performance in its BTC pair, ETH was negatively impacted by the steady rise in Bitcoin dominance. As reported by Cointelegraph,\n\n“Bitcoin’s market dominance has reached 54%, its highest in the last 30 months, indicating the top cryptocurrency is strengthening just before the halving event scheduled for April 2024.”\n\nBitcoin market dominance chart. Source: TradingView\n\nBitcoin dominance is a measure of BTC’s market capitalization relative to the overall crypto market and it highlights the assets’s strength and if often used by investors as a sentiment gauge. With the Bitcoin halving fast approaching (April 2024) and investors’ belief that a spot BTC ETF is imminent, the drop in Ether’s value in its BTC pair suggests that investors feel more bullish about BTC and possibly allocating less money to Ether investments.\n\nRelated: Bitcoin dominance hits 54% — Highest in 2.5 years as BTC halving approaches\n\nEthereum price breaks below critical support vs. Bitcoin\n\nThe ETH/BTC pair dropped to 0.050 BTC on Oct. 23 and has remained in a downtrend since then. A notable occurrence was the pair’s fall below its 200-week exponential moving average near 0.058 BTC,which raises the possibility for further downside in the short-term.\n\nAccording to Cointegraph contributor Yashu Gola,\n\n“The 200-week EMA has historically served as a reliable support level for ETH/BTC bulls. For instance, the pair rebounded 75% three months after testing the wave support in July 2022. Conversely, it dropped over 25% after losing the same support in October 2020.”\n\nThese factors are likely to continue impacting Ethereum's price relative to Bitcoin. The multifaceted market dynamics, investor sentiment and staunch regulatory environment could remain the dominant headwinds against the ETH/BTC pair for the foreseeable future.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3Byb3NoYXJlcy1sYXVuY2hlcy1zaG9ydC1ldGhlcmV1bS1saW5rZWQtZXRmL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "ProShares launches short Ethereum-linked ETF - CryptoSlate",
        "content": "ProShares, a prominent player in the crypto-linked exchange-traded fund (ETF) market, launched the first short Ethereum (ETH) ETF on Nov. 2.\n\nThe ProShares Short Ether Strategy ETF (SETH) is the world’s first short ETH-linked ETF, designed to provide investors with an opportunity to profit when the price of Ether experiences a decline.\n\nSETH will be listed on the New York Stock Exchange and has been strategically developed to deliver the inverse of the daily performance of the S&P CME Ether Futures Index. Like the other ProShares crypto-linked ETFs, SETH seeks exposure through ETH futures contracts.\n\nProShares CEO Michael L. Sapir said:\n\n“SETH is designed to address the challenge of acquiring short exposure to ether, which can be onerous and expensive. With today’s launch of SETH, ProShares now offers investors opportunities to profit both on days when ether increases and when it drops—all through the convenience of a traditional brokerage account.”\n\nRisks\n\nIt’s important to note that investments in cryptocurrency-related assets come with unique risks. Both bitcoin and ether, along with their respective futures, represent relatively new asset classes and are subject to rapid changes and uncertainty, according to the press release.\n\nProShares added that its actively managed ETFs, including BITO, EETH, BETH, and BETE, face additional challenges associated with using futures contracts, imperfect benchmark correlation, leverage, and market price variance. These factors can increase volatility and affect performance. Notably, SETH is expected to experience losses when the daily price of ether futures rises.\n\nInvestors interested in these ETFs should know that shares are generally bought and sold at market price, not Net Asset Value (NAV), and are not individually redeemed from the fund. It’s also essential to consider brokerage commissions, which may reduce overall returns.\n\nSubdued interest\n\nDespite the launch of the ProShares Short Ether Strategy ETF (SETH), interest in ether futures ETFs remains subdued. The six ETH-based futures ETFs introduced recently have a combined AUM of around $20 million.\n\nExperts suggest investors might be waiting for spot exposure to Ethereum, which the SEC could consider approving by May.\n\nThe macroeconomic environment during the launch of ether futures ETFs may have contributed to their modest performance, unlike the ProShares Bitcoin Strategy ETF (BITO), which debuted during a bullish Bitcoin period and quickly amassed assets.\n\nThe simultaneous approval of multiple ether futures ETFs from different providers may have diluted their impact. However, the launch of SETH underscores the industry’s commitment to innovative crypto-linked investment opportunities.\n\nAs optimism grows for spot Bitcoin ETF approval, it’s expected that spot ether ETFs could follow, rendering ether futures ETFs potentially “obsolete.”\n\nThe SEC has until Jan. 10 to rule on a proposed spot Bitcoin ETF, and a decision on spot ether ETFs could follow in May. Several companies are awaiting SEC approval for spot ether ETFs, setting the stage for increased diversity in cryptocurrency investments."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMDEvY29pbmJhc2UtYml0Y29pbi1ldGhlcmV1bS1idGMtZXRoLWZ1dHVyZXMtdW5pdGVkLXN0YXRlcy_SAWJodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzExLzAxL2NvaW5iYXNlLWJpdGNvaW4tZXRoZXJldW0tYnRjLWV0aC1mdXR1cmVzLXVuaXRlZC1zdGF0ZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Coinbase now lets smaller investors in the U.S. trade Bitcoin and Ethereum futures - Fortune",
        "content": "The largest crypto exchange in the U.S. announced on Thursday that smaller investors, otherwise known as retail traders, are now be able to trade Bitcoin and Ethereum futures on its U.S. platform.\n\nCustomers can access the two new financial products through Coinbase Advanced, an offshoot of the exchange’s main platform that lets investors trade more financially complex crypto products. As opposed to CME, a U.S. derivatives exchange that also sells Bitcoin and Ethereum futures, Coinbase’s offering targets shallower-pocketed traders.\n\n“These contracts offer lower upfront capital requirements and can be an affordable investment option for a broader range of retail customers,” the company wrote in a blog post announcing the products.\n\nCoinbase’s unveiling of a futures contract in the U.S. for both Bitcoin and Ethereum, the two largest cryptocurrencies by market capitalization, comes as the exchange looks to diversify its products to compete with the likes of Binance, the largest cryptocurrency exchange in the world.\n\nFutures allow traders to not only speculate on the future price of an asset but to gamble with more assets than they actually own. Customers can front, for example, $100 as collateral and trade $200 worth of crypto, magnifying their losses and gains as a cryptocurrency’s price waxes and wanes.\n\nBy most estimates, the global trading volume of the crypto derivatives markets, which include futures, far outpaces that of crypto spot markets, or the simple purchase or sale of cryptocurrencies. As of Wednesday, the 24-hour trading volume of crypto derivatives was approximately $37 billion on Binance compared with just about $9 billion in spot, according to CoinMarketCap.\n\nBinance dominates the crypto derivatives market. The 24-hour trading volume of its nearest competitors OKX and BitMart was a little more than a fourth of Binance’s. If its recent product announcements are any indication, Coinbase, which has historically been more willing than Binance to play nice with regulators and avoid risky crypto financial instruments, is looking for a slice of that pie.\n\nIn April, the publicly traded crypto exchange announced that it had obtained a regulatory license in Bermuda. In May, it then launched a Bermuda-based offshore exchange, which specializes in futures. And then, in late September, it opened up its offshore exchange to retail investors.\n\nThe exchange’s most recent unveiling of crypto futures, however, is in the U.S., where it obtained a license to sell the risky financial instruments earlier this year."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc2F5bG9ycy1taWNyb3N0cmF0ZWd5LWJpdGNvaW4tYmFnLWJhbGxvb25zLWJ5LSUyNDkwMG0lM0EtY291bGQtZXRoZXJldW0taGF2ZS1iZWVuLXRoZS1iZXR0ZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Saylor's MicroStrategy Bitcoin Bag Balloons By $900M: Could Ethereum Have Been The Better Bet? - Nasdaq",
        "content": "Business intelligence firm MicroStrategy Inc (NASDAQ:MSTR) has reported a substantial paper gain of $900 million on its stack of 158,400 Bitcoin (CRYPTO: BTC), profiting from the recent surge in Bitcoin’s price and fueled by optimism surrounding the potential approval of spot Bitcoin exchange-traded funds (ETFs).\n\nWhat Happened: As of now, Bitcoin is trading above $35,400. The apex cryptocurrency has confidently surpassed the $35,000 resistance level, which had previously limited its upward movement over the past two weeks.\n\nSince the third quarter, MicroStrategy, founded by Michael Saylor, has added 6,067 Bitcoin (BTC) to its holdings, with another 155 acquired in October, according to the company’s November 1 results filing.\n\nAlthough the firm’s revenue increased by 3% year-on-year to $129.5 million over the quarter, it recorded a net loss of $143.4 million. Notably, digital asset impairment losses and income taxes accounted for $33.6 million and $109.6 million of the total net losses, respectively.\n\nDuring the third quarter (July 1 to September 30), while Bitcoin experienced a price decline of 11.5% from $30,480 to $26,970, MicroStrategy capitalized on this downward period by purchasing the 6,067 BTC at an average price of $27,590.\n\nCurrently, MicroStrategy’s BTC holdings amount to 158,245 BTC, with an original investment of $4.715 billion. The current value of the holdings stands at $5.640 billion, reflecting a 20% increase. However, had MicroStrategy invested the same amount in Ethereum (CRYPTO: ETH), they would now possess 3,971,678 ETH, resulting in a value of $7.40 billion, significantly higher than the current BTC holdings, data from blockchaincenter.net shows.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: Considering staking as an alternative approach, MicroStrategy could have earned 387,460 ETH at a 4% return. This ETH would be worth approximately $722.4 million, bringing the total value (with staking) to 4,359,138 ETH, equivalent to $8.127 billion.\n\nWhile MicroStrategy continues to benefit from the rise in Bitcoin’s value, the narrative raises the question of what might happen if the company were to invest in ETH at the present moment. If MicroStrategy were to trade its BTC for ETH, it could potentially hold 3,025,059 ETH. Moreover, the annual revenue from staking this amount would amount to approximately $282 million, showcasing the significant potential returns that could be achieved.\n\nPrice Action: At the time of writing, Bitcoin was trading at $35,728.12, up 3.66% in the last 24 hours, according to Benzinga Pro.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9wcm9zaGFyZXMtbGF1bmNoLXNob3J0LWV0aGVyZXVtLWV0Zi0wNTQ1MTk2MTIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "ProShares Launch Short Ethereum ETF - Yahoo Finance",
        "content": "ProShares Launch Short Ethereum ETF\n\nProShares, a U.S.-based ETF provider, has launched the ProShares Short Ether Strategy ETF (SETH), which allows investors to profit from drops in the price of Ethereum (ETH). SETH, which will be traded on the Arca platform of the New York Stock Exchange, intends to achieve the inverse performance of its underlying benchmark, the Standard & Poor's CME Ether Futures Index.\n\nThe summary prospectus for the ETF informs investors that if the index rises, they will lose money, emphasizing that gaining short exposure is an aggressive investment strategy. At the time of writing, Ethereum was trading at $1,816 per coin, up 1.5% on the day.\n\nOther crypto-linked ETFs, such as a Bitcoin short ETF, have also been introduced by ProShares. The company emphasizes the benefits of ETFs, such as regulated trading, transparency, and compliance with typical ETF laws.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9jYW4tZXRoZXJldW0tZXRoLXByaWNlLXJlYWNoLTIwMDAtc29vbi1oZXJlcy13aGF0LXRvLWV4cGVjdC0xMzg1NjU00gFfaHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2Nhbi1ldGhlcmV1bS1ldGgtcHJpY2UtcmVhY2gtMjAwMC1zb29uLWhlcmVzLXdoYXQtdG8tZXhwZWN0LzEzODU2NTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Can Ethereum (ETH) Price Reach $2,000 Soon? —Here’s What to Expect - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLW5ldHdvcmstZ3Jvd3RoLXNob290cy13aXRoLW5ldy1hZGRyZXNzZXMtZXRoLXByaWNlLXRvLTIwMDAv0gFdaHR0cHM6Ly9jb2luZ2FwZS5jb20vZXRoZXJldW0tbmV0d29yay1ncm93dGgtc2hvb3RzLXdpdGgtbmV3LWFkZHJlc3Nlcy1ldGgtcHJpY2UtdG8tMjAwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Price May Break $2000 In November; Here's Why - CoinGape",
        "content": "The Ethereum price has shot another 2% in the last 24 hours moving to $1839 with a market cap of $221 billionAs Solana, XRP, and Cardano grab all the limelight in the altcoin market rally, Ethereum (ETH) has been making silent moves in the meanwhile.\n\nEthereum Network Growth Jumps\n\nAs per on-chain data from Santiment, Ethereum’s recent surge above the $1,800 mark is supported by a significant increase in the creation of new addresses, marking the highest daily number since October 7th.\n\nadvertisement\n\nIf this long-term trend of network expansion persists and the available supply on exchanges continues to decrease, Ethereum’s price ($ETH) could have a strong case for surpassing the $2,000 threshold once more.\n\nA Look Into Ether Derivatives Market\n\nRecently, Vitalike Buterin moving Ethereum to Coinbase sparked the discussion around the ETH price rally. Also, the Ethereum derivatives data shows growing bullish sentiment despite the recent selling pressure.\n\nEthereum (ETH) has experienced a 14.7% decline in its price, dropping from its peak at $2,120 on April 16, 2023. However, two key derivatives metrics indicate a significant increase in investor bullishness, reaching levels not seen in over a year.\n\nFirstly, the Ether futures premium, which measures the variation between two-month futures contracts and the spot price, has surged to its highest point in over a year. In a robust market, the annualized premium, also known as the basis rate, generally falls within the range of 5% to 10%.\n\nThis data signifies a growing demand for leveraged long positions in Ethereum futures, as the futures contract premium skyrocketed from 1% on October 23 to 7.4% on October 30, surpassing the neutral-to-bullish threshold of 5%. This remarkable surge in the metric follows a 15.7% price rally for ETH over a two-week period.\n\nFurthermore, analysis of the options market provides additional insights. The 25% delta skew in Ether options serves as an indicator of when arbitrage desks and market makers might overcharge for upside or downside protection. An Ethereum price drop typically causes the skew metric to rise above 7%, while periods of optimism tend to exhibit a negative 7% skew.\n\nOf particular note, the Ethereum options 25% delta skew reached a negative 16% level on October 27, marking the lowest point in over 12 months. During this period, protective put (sell) options were trading at a discount, reflecting excessive optimism among traders. Additionally, the current 8% discount for put options represents a notable shift from the previously persistent 7% or higher positive skew that extended until October 18."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vYmxvZy5rcmFrZW4uY29tL3Byb2R1Y3QvbmV3LWZlYXR1cmVzL2V0aC1kZXBvc2l0cy1hbmQtd2l0aGRyYXdhbHMtbm93LWF2YWlsYWJsZS1vbi16a3N5bmMtZXJh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "ETH deposits and withdrawals now available on zkSync Era! - Kraken Blog",
        "content": "We’re thrilled to announce that Kraken now supports deposits and withdrawals of Ethereum (ETH) on zkSync Era!\n\nWhat is zkSync Era?\n\nzkSync Era is an Ethereum virtual machine-compatible Layer-2 rollup protocol by Matter Labs. Formerly known as zkSync 2.0, the project rebranded to zkSync Era in February, 2023. ZkSync Era employs zero knowledge (ZK) rollups to significantly improve Ethereum’s transaction throughput capabilities and lower fees.\n\nEra ZK rollups work by batching together transactions and verifying their validity off-chain (separate from Ethereum’s blockchain). An operator produces a single cryptographic proof, known as a succinct non-interactive argument of knowledge (SNARK), for the block of transactions and submits it on-chain to the Ethereum blockchain.\n\nUnlike other Ethereum Layer-2 protocols, zkSync is EVM-compatible, meaning it can easily integrate with Ethereum’s existing ecosystem of projects and decentralized applications.\n\nFunding\n\nETH funding using zkSync Era is already live. You can transfer Ethereum (ETH) to your Kraken account by navigating to Funding, selecting ETH and in the drop-down box the desired deposit method (network): zkSync Era.\n\nNote: as a security measure during the alpha phase, 7,200 confirmations (typically 24 hours) on layer 1 are required before the funds are available for trading.\n\nGot ETH on zkSync Era? ⤵️\n\nHere’s what you need to know about the assets\n\nEthereum (ETH) is a global, open-source platform for decentralized applications. Ethereum is a marketplace of financial services, games and apps that is trustless, decentralized and secure. ETH is the cryptocurrency powering the Ethereum network. It’s used to pay for transactions, as a store of value or peer-to-peer payment method, or as collateral to generate entirely different crypto tokens that run on Ethereum.\n\nLearn how to add ETH to your crypto portfolio with our Learn Center article How to Buy Ethereum (ETH).\n\nReady to deposit but don’t have a Kraken account yet? Sign up today!"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vdS50b2RheS9zb2xhbmEtZm91bmRlci1naXZlcy1ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLWhpcy1mbG93ZXJzLWFmdGVyLXRoaXMtaGFwcGVuZWTSAWJodHRwczovL3UudG9kYXkvc29sYW5hLWZvdW5kZXItZ2l2ZXMtZXRoZXJldW1zLXZpdGFsaWstYnV0ZXJpbi1oaXMtZmxvd2Vycy1hZnRlci10aGlzLWhhcHBlbmVkP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Solana Founder Gives Ethereum's Vitalik Buterin His Flowers After This Happened - U.Today",
        "content": "In a surprising turn of events, Anatoly Yakovenko, the cofounder of Solana, took to X to express his appreciation for Ethereum's visionary founder, Vitalik Buterin. The post comes in the wake of a pivotal moment in SOL's history that shook the crypto world.\n\nAdvertisement\n\nThe focal point of Yakovenko's tweet can be traced back to a message Buterin shared on Dec. 30 last year, where he acknowledged the earnest and smart developer community at Solana. At that time, Solana was grappling with the consequences of the collapse of the crypto exchange FTX, which was closely intertwined with the blockchain.\n\nSOL to USD by CoinMarketCap\n\nThis unfortunate incident resulted in a significant drop in the price of SOL, hitting a three-year low of $7.78 per token.\n\nWhat added to the challenge was the dwindling number of developers within the Solana ecosystem, with only approximately 70 left. This raised concerns about the platform's future viability.\n\nCrypto unity\n\nYakovenko's appreciation for Buterin's message extends beyond the competition and rivalry between the Ethereum and Solana communities. He emphasizes that even though the two blockchain ecosystems may have their differences, they are united by the common goal of advancing the industry.\n\nWith all fairness @chainyoda, my read is that Mert isn’t attacking ethereum folks or the community.\n\n\n\nWe are supposed to argue about tech and vision in the search of truth. Maybe it’s not possible to build the best world computer and best stateless money in one design.\n\n\n\nThere… — toly 🇺🇸 (@aeyakovenko) November 1, 2023\n\nThe Solana cofounder asserts that these disputes should revolve around technological advancement and vision, ultimately contributing to the betterment of the entire crypto industry.\n\nIn essence, the message highlights the significance of collaboration and unity within the crypto space, reminding us that even in times of competition, the industry thrives on collective efforts to push the boundaries of what's possible."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3ZpdGFsaWstYnV0ZXJpbi1zYXlzLWV0aGVyZXVtLWxheWVyLTItc29sdXRpb25zLXdpbGwtYmVjb21lLW1vcmUtZGl2ZXJzZS1hbmQtc3BlY2lhbGl6ZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Vitalik Buterin says Ethereum layer-2 solutions will become more diverse and specialized - CryptoSlate",
        "content": "The Ethereum layer-2 ecosystem continues to expand and diversify, according to Ethereum co-founder Vitalik Buterin in a recent blog post. As new scaling solutions emerge, Buterin predicts increasing heterogeneity in layer 2 designs based on specific security and cost tradeoffs.\n\nRollups, validiums, sidechains, and other layer-2 constructions offer different balances between decentralization, security, and scalability. Financial applications demand the highest security guarantees, while social media and gaming can accept some downtime in exchange for lower fees.\n\nButerin notes that projects transitioning from independent layer-1s to Ethereum layer-2s will likely take a gradual, multi-stage approach. Moving all activity to a rollup at once would hurt usability, but waiting too long risks missing the opportunity. Centralized projects and niche layer 1s also want enough decentralization for added security assurances without sacrificing high throughput.\n\nHow differing layer-2s interact with Ethereum\n\nValidiums rely on zero-knowledge proofs to ensure correct computation without storing all data directly on Ethereum. This saves costs compared to rollups, but validiums face data availability risks if operators fail to make data available. Rollups guarantee users can always withdraw funds to the Ethereum mainnet.\n\nDisconnected systems like sidechains offer even lower costs but require trust in a small set of validators. Hybrid approaches are also emerging, such as validiums that allow users to pay for periodic Ethereum data availability.\n\nButerin emphasizes the importance of external chains maintaining tight links to Ethereum. This reduces security risks when bridging Ethereum-native assets and enables shared account abstractions across chains.\n\nValidating bridges can provide validium-level security, proving correct state transitions. However, handling edge cases like 51% of attacks requires a social commitment to coordinate upgrades. Reading Ethereum data and reverting when Ethereum reverts is also critical. Chains that only read Ethereum’s finalized blocks avoid some complexity but give up functionality during periods of low finality.\n\nOverall, Buterin sees merit across a spectrum of layer-2 designs. Applications will continue tailoring solutions to their specific security, scalability, and decentralization needs. However, maintaining connections to Ethereum provides benefits regardless of the architecture. He believes that, as technology progresses, projects can strengthen their ties to Ethereum in stages over time."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY291bGQtYml0Y29pbi1zcGFyay1hbmQtZXRoZXJldW0tcG90ZW50aWFsbHktYmUtb25lLW9mLXRoZS1nYWluZXJzLXRoaXMtY3ljbGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Could Bitcoin Spark And Ethereum Potentially Be One Of The Gainers This Cycle? - Nasdaq",
        "content": "Among the many digital currencies, Bitcoin and Ethereum have particularly stood out due to their innovative technology and increasing popularity. This article will delve into why Bitcoin Spark and Ethereum could one of the gainers this cycle.\n\nEthereum - Layer Zero Potential\n\nEthereum, since its inception, has gained considerable attention due to powerful smart contracts and scalability. Experts believe that Ethereum has ‘Layer Zero potential,’ functioning as the foundation of DeFi that enables the existence of numerous other blockchains and applications to run on it.\n\nThe potential of Ethereum lies in its decentralized, secure, and scalable infrastructure for a new generation of applications. It enables the creation of smart contracts, decentralized applications (dApps), and even other cryptocurrencies. Developers can build and launch their projects and create a thriving ecosystem of innovation within the Ethereum ecosystem. However, the Ethereum network can only process a limited number of transactions per second, leading to congestion and high fees during peak times. Once these obstacles are resolved, Ethereum is likely to be a top gainer this upcoming bull season.\n\nBitcoin Spark Fusing PoW and PoS\n\nBitcoin Spark is another contender for one of the biggest gainer this cycle, thanks to its innovative fusion of Proof of Work (PoW) and Proof of Stake (PoS) consensus mechanisms. This combination aims to harness the strengths of both systems and mitigate their weaknesses, creating a more secure, efficient, and sustainable blockchain.\n\nPoW, used by Bitcoin, involves miners solving complex mathematical problems to validate transactions and create new blocks. While this system has proven secure, it is resource-intensive, leading to criticisms about its environmental impact. On the other hand, PoS, employed by Ethereum, allows coin holders to validate transactions based on the number of coins they hold and are willing to 'stake' as collateral. This system is less resource-intensive but has been criticized for potentially favoring the 'rich' who can stake more coins.\n\nBitcoin Spark's fusion of PoW and PoS aims to create a balance, offering the security of PoW with the efficiency of PoS. This innovative hybrid approach culminates in the Proof-of-Process (PoP) consensus mechanism and could make Bitcoin Spark a significant player in the cryptocurrency market, leading to substantial gains in this cycle.\n\nTraders Convinced Smartphone Mining Is The Next Big Thing\n\nThe rise of smartphone mining is another trend that traders are keeping a close eye on. As the name suggests, smartphone mining involves using smartphones to mine cryptocurrencies. This method makes mining more accessible to the masses, as it does not require expensive hardware or high energy consumption.\n\nThe potential of smartphone mining lies in its convenience and accessibility. With billions of smartphone users worldwide, the potential user base for smartphone mining is massive. Furthermore, smartphone mining apps are typically user-friendly, making it easy for even non-tech-savvy individuals to participate in the cryptocurrency market.\n\nThis is where Bitcoin Spark convinces new but also veteran crypto traders to be on top of the next bull run with its innovative Spark App that will enable users to simply mine BTCS via their smartphones.\n\nBottom Line\n\nIn conclusion, the cryptocurrency market is dynamic and ever-evolving, with Bitcoin Spark and Ethereum potentially being the one of the gainers this cycle. Ethereum’s Layer Zero potential and the upcoming upgrades promise a more scalable and efficient platform, while Bitcoin Spark's fusion of PoW and PoS offers a balanced and innovative approach to blockchain technology.\n\nFor more information:\n\nWebsite: https://bitcoinspark.org/\n\nBuy BTCS: https://network.bitcoinspark.org/register\n\nThis post was authored by an external contributor and does not represent Benzinga's opinions and has not been edited for content. This contains sponsored content and is for informational purposes only and not intended to be investing advice.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1mdXR1cmVzLXByZW1pdW0taGl0cy0xLXllYXItaGlnaC13aWxsLWV0aC1wcmljZS1mb2xsb3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum futures premium hits 1-year high — Will ETH price follow? - Cointelegraph",
        "content": "Ether (ETH) price has declined by 14.7% since its peak at $2,120 on April 16, 2023. However, two derivatives metrics indicate that investors have not felt this bullish in over a year. This discrepancy warrants an investigation into whether the recent optimism is a broader response to Bitcoin (BTC) breaking above $34,000 on Oct. 24.\n\nOne possible reason for the surge in enthusiasm among investors using ETH derivatives is the overall market's excitement regarding the potential approval of a spot Bitcoin exchange-traded fund (ETF) in the United States. According to analysts from Bloomberg, the ongoing amendments to the spot Bitcoin ETF proposals can be seen as a “good sign” of progress and impending approvals. This development is expected to drive the entire cryptocurrency market to higher price levels.\n\nInterestingly, comments issued by the U.S. SEC Chair Gery Gensler's in 2019 reveal his perspective. During the 2019 MIT Bitcoin Expo, Gensler termed the SEC's position at the time as \"inconsistent\" because they had denied multiple spot Bitcoin ETF applications, while futures-based ETF products that do not involve physical Bitcoin had been in existence since December 2017.\n\nAnother potential factor in the optimism of Ethereum investors using derivatives may be the pricing of the Dencun upgrade scheduled for the first half of 2024. This upgrade is set to enhance data availability for layer-2 rollups, ultimately leading to reduced transaction costs. Moreover, the upgrade will prepare the network for the future implementation of sharding (parallel processing) as part of the blockchain's \"Surge\" roadmap.\n\nEthereum co-founder Vitalik Buterin highlighted in his Oct. 31 statement that independent layer-1 projects are gradually migrating and potentially integrating as Ethereum ecosystem layer-2 solutions. Buterin also noted that the current costs associated with rollup fees are not acceptable for most users, particularly for non-financial applications.\n\nChallenges for Ethereum competitors\n\nEthereum competitors are facing challenges as software developers realize the associated costs of maintaining a complete record of a network's transactions. For instance, SnowTrace, a popular blockchain explorer tool for Avalanche (AVAX), announced its shutdown supposedly due to the high costs.\n\nPhillip Liu Jr., head of strategy and operations at Ava Labs, pointed out the difficulties users face in self-validating and storing data on single-layer chains. Consequently, the substantial processing capacity required often leads to unexpected issues.\n\nFor example, on October 18, the Theta Network team encountered a \"edge case bug\" after a node upgrade, causing blocks on the main chain to halt production for several hours. Similarly, layer-1 blockchain Aptos Network (APT) experienced a five-hour outage on October 19, resulting in a halt in exchanges' deposits and withdrawals.\n\nIn essence, the Ethereum network may not currently offer a solution to its high fees and processing capacity bottlenecks. Still, it does have an eight-year track record of continuous upgrades and improvements toward that goal with few major disruptions.\n\nAssessing bullish sentiment in ETH derivatives markets\n\nAfter evaluating the fundamental factors surrounding the Ethereum network, it's essential to investigate the bullish sentiment among ETH traders in the derivatives markets, despite the negative performance of ETH, which has dropped 14.7% since its $2,120 peak in April.\n\nThe Ether futures premium, which measures the difference between two-month contracts and the spot price, has reached its highest level in over a year. In a healthy market, the annualized premium, or basis rate, should typically fall within the range of 5% to 10%.\n\nEther 1-month futures basis rate. Source: Laevitas.ch\n\nSuch data is indicative of the growing demand for leveraged ETH long positions, as the futures contract premium surged from 1% on Oct. 23 to 7.4% on Oct. 30, surpassing the neutral-to-bullish threshold of 5%. This surge in the metric follows a 15.7% rally in ETH's price over two weeks.\n\nAnalyzing the options markets provides further insight. The 25% delta skew in Ether options is a useful indicator of when arbitrage desks and market makers overcharge for upside or downside protection. When traders anticipate a drop in Ether's price, the skew metric rises above 7%. Conversely, phases of excitement tend to exhibit a negative 7% skew.\n\nRelated: 3 reasons why Ethereum price is down against Bitcoin\n\nEther 30-day options 25% delta skew. Source: Laevitas.ch\n\nNotice how the Ether options 25% delta skew reached a negative 16% level on Oct. 27, the lowest in over 12 months. During this period, protective put (sell) options were trading at a discount, a characteristic of excessive optimism. Moreover, the current 8% discount for put options is a complete turnaround from the 7% or higher positive skew that persisted until Oct. 18.\n\nIn summary, the drivers behind the bullish sentiment among Ether investors in derivatives markets remain somewhat elusive. Traders may be expecting approval for Ether spot ETF instruments following Bitcoin's potential approval, or they may be banking on planned upgrades that aim to reduce transaction costs and eliminate the competitive advantage of other blockchain networks like Solana (SOL) and Tron (TRX).\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5meGVtcGlyZS5jb20vZm9yZWNhc3RzL2FydGljbGUvZXRoZXJldW0tYWF2ZS1hbmQtdW5pc3dhcC1wcmljZS1mb3JlY2FzdC10ZWNobmljYWxzLXBvaW50LXRvLWltbWluZW50LWJ1bGxpc2gtcnVucy0xMzg1Nzgy0gF2aHR0cHM6Ly9hbXAuZnhlbXBpcmUuY29tL2VuL2V0aGVyZXVtLWFhdmUtYW5kLXVuaXN3YXAtcHJpY2UtZm9yZWNhc3QtdGVjaG5pY2Fscy1wb2ludC10by1pbW1pbmVudC1idWxsaXNoLXJ1bnMvMTM4NTc4Mg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Ethereum, Aave and Uniswap Price Forecast: Technicals Point to Imminent Bullish Runs - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tZXRmLWJlY29tZXMtbW9zdC1hdHRyYWN0aXZlLXByb3NwZWN0LXBvbGwtc2hvd3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Ethereum ETF becomes most attractive prospect, poll shows - crypto.news",
        "content": "CoinShares conducted a survey according to which investors consider the Ethereum ETF to be the most attractive prospect at the moment.\n\nDigital asset fund managers who participated in a CoinShares survey this week were asked which digital asset they thought had the most attractive prospects.\n\nThe result revealed that almost 45% of survey respondents said that broadcast. In comparison, about 39% of survey respondents said Bitcoin (BTC) had the most upside potential, while a small but significant 6% of participating fund managers preferred Solana (SOL).\n\n“Ethereum is seen to be the digital asset with the most compelling growth outlook. This is reflected in the recent large validator entry queue which indicated a high demand for its yield.” CoinShares report\n\nHowever, the report notes that this sentiment is not reflected in CoinShares’ latest fund flow report, which states that Ethereum was the most disliked altcoin. According to CoinShares, Ether funds have had net outflows of over $10m over the past month and $125m year-to-date.\n\nYou might also like: Vitalik Buterin publishes article discussing dimensions of connectedness to Ethereum\n\nAt the same time, Bitcoin remains unchanged regarding its views among survey respondents. The report states that Bitcoin and Ethereum remain the two largest assets in fund managers’ portfolios.\n\nVarious institutions, including Valkyrie Bitcoin ETF, a boutique alternative asset management firm, have amended their prospectus for spot Bitcoin ETFs, joining industry giants BlackRock, Ark Invest, WisdomTree, Fidelity, VanEck and Bitwise. The SEC has not yet decided on these applications for spot BTC ETFs.\n\nYou might also like: Analyst says Bitcoin ETF approval may be coming within days\n\nFollow Us on Google News"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tc2hha2Utb2ZmLWJlYXItaGFuZ292ZXItZ2xhc3Nub2RlL9IBVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tc2hha2Utb2ZmLWJlYXItaGFuZ292ZXItZ2xhc3Nub2RlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Yet To Shake Off 2022 Bear Hangover: Glassnode - NewsBTC",
        "content": "Data from Glassnode shows Ethereum is still experiencing negative momentum despite the year-to-date rise that the asset has observed.\n\nEthereum MVRV Ratio Has Recently Indicated Negative Momentum\n\nAccording to the latest weekly report from Glassnode, the MVRV ratio has recently been below its 180-day moving average (MA). The “Market Value to Realized Value (MVRV) ratio” refers to an indicator that measures the ratio between the Ethereum market cap and realized cap.\n\nThe “realized cap” here is a capitalization model for ETH that assumes the true value of any coin in circulation is the price at which it was last moved on the blockchain. This is unlike the market cap, of course, which calculates the asset’s total value using the current spot price.\n\nSince the price at which each coin was last moved on the network can be assumed to be the price it was bought, the realized cap can be looked at as a sum of the total capital that the investors have used to purchase ETH.\n\nAs the MVRV ratio compares the value that the holders are carrying right now (the market cap) against the amount that they have invested into the cryptocurrency, it can provide us with information about their profit/loss status.\n\nNow, here is a chart that shows the trend in the Ethereum MVRV ratio, as well as its 180-day MA, over the last few years:\n\nThe two metrics have gone through a cross in recent days | Source: Glassnode's The Week Onchain - Week 44, 2023\n\nWhen the MVRV ratio is above the 1 mark, it means that the average investor is sitting on some profits right now, while it being below the level implies the dominance of loss in the market.\n\nFrom the graph, it’s visible that the Ethereum MVRV ratio observed some rise as the rally started at the start of this year. During this period, the indicator remained above its 180-day MA.\n\n“Periods, where the MVRV Ratio trades above this long-term mean, indicate investor profitability is increasingly meaningful, and is often a signal of a rising market,” explains Glassnode.\n\nIn the last few months, though, as the Ethereum price has found some struggle, the metric has gone under its 180-day MA. The analytics firm notes, “despite the positive market performance for ETH YTD, by this metric the market is still experiencing negative momentum.”\n\nAs is apparent from the chart, the Ethereum MVRV ratio has very recently just started to break above this mark, following the rally towards the $1,800 level. It’s still very early in the breakout, though, so it’s unclear if it will actually sustain there.\n\n“It seems that the hangover from the 2022 bear is still being slowly worked through,” says the report. It’s not something new that ETH is going through a phase like this; as the graph highlights, the asset has also faced similar periods of uncertainty in the past.\n\nETH Price\n\nAt the time of writing, Ethereum is trading around $1,800, up 1% in the past week.\n\nETH has enjoyed some bullish momentum recently | Source: ETHUSD on TradingView\n\nFeatured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5meGVtcGlyZS5jb20vZm9yZWNhc3RzL2FydGljbGUvZXRoZXJldW0tdGhvcmNoYWluLWFuZC1uZWFyLXByb3RvY29sLXByaWNlLWZvcmVjYXN0LW1peGVkLXRyZW5kcy1pbi10b2RheXMtbWFya2V0LXdhdGNoLTEzODU1MjHSAXtodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vZXRoZXJldW0tdGhvcmNoYWluLWFuZC1uZWFyLXByb3RvY29sLXByaWNlLWZvcmVjYXN0LW1peGVkLXRyZW5kcy1pbi10b2RheXMtbWFya2V0LXdhdGNoLzEzODU1MjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum, THORChain and NEAR Protocol Price Forecast: Mixed Trends in Today’s Market Watch - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vaGFja2Vybm9vbi5jb20vZXRoZXJldW0tdmlydHVhbC1tYWNoaW5lcy15b3VyLWd1aWRlLXRvLWNyZWF0ZS1jcmVhdGUyLWFuZC1jcmVhdGUz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Virtual Machines: Your Guide to create, create2 and create3 - hackernoon.com",
        "content": "955 reads\n\nEthereum Virtual Machines: Your Guide to create, create2 and create3\n\nNovember 2nd 2023 3 m by @ adamboudj 955 reads"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLW5vdC15ZXQtcmVhZHktdG8tcHV0LWV2ZXJ5dGhpbmctb24tYS1yb2xsdXAtc2F5cy1idXRlcmluLWFzLWxheWVyLTItcHJvamVjdHMtc3VyZ2Uv0gF1aHR0cHM6Ly96eWNyeXB0by5jb20vZXRoZXJldW0tbm90LXlldC1yZWFkeS10by1wdXQtZXZlcnl0aGluZy1vbi1hLXJvbGx1cC1zYXlzLWJ1dGVyaW4tYXMtbGF5ZXItMi1wcm9qZWN0cy1zdXJnZS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum “Not Yet Ready to Put Everything on A Rollup”, Says Buterin as Layer 2 Projects Surge - ZyCrypto",
        "content": "Advertisement\n\nEthereum co-founder Vitalik Buterin has provided insights into the dynamic and evolving landscape of Ethereum’s layer-2 ecosystem. Buterin’s analysis, published on his blog on Tuesday, October 31, delved into the diverse approaches to scale the Ethereum network while maintaining security and usability.\n\nThe Ethereum layer-2 ecosystem has grown significantly over the past year, with multiple layer-2 protocols and solutions emerging. Among the notable advancements have been Ethereum Virtual Machine (EVM) rollups, including Arbitrum, Optimism and Scroll, which have made substantial progress in enhancing security and scaling capabilities. Additionally, there are “almost-EVMs” like zkSync, extensions like Arbitrum Stylus, and broader efforts like Starknet and Fuel.\n\nHowever, one of the significant trends in the layer-2 space has been the increasing heterogeneity of projects. Buterin noted that he expects this trend to continue for several reasons. First, some projects operating as independent layer-1 blockchains want to integrate with the Ethereum ecosystem and transition into layer-2 solutions.\n\nHowever, Buterin noted that a gradual transition is preferred, as the technology is not yet fully ready to transition everything to a rollup.\n\n“Transitioning all at once now would cause a decrease in usability, as the technology is not yet ready to put everything on a roll up. Transitioning all at once later risks sacrificing momentum and being too late to be meaningful.” Buterin wrote.\n\nAdvertisement\n\nThe crypto mogul also highlighted that centralized projects explore blockchain-based solutions to enhance user security. While these projects may not require the full decentralization of a rollup, they still seek a middle-ground solution. Their high throughput and specific needs may not be suitable for rollups in the short term, as per Buterin.\n\nHe further noted that Non-financial applications, such as games and social media, desire decentralization but may not require the same level of security as financial applications. Different parts of these applications can be treated differently, with high-value activities like username registration and account recovery being done on a rollup. In contrast, lower-value activities like posts and votes may require less security.\n\nButerin also emphasized that the cost of using rollups is a crucial consideration, especially for users from outside the blockchain world. Users are more likely to accept higher fees if they are already accustomed to paying higher prices for on-chain interactions.\n\nThat said, as Ethereum continues to evolve, it is clear that layer-2 scaling solutions will play a critical role in the network’s development. With Ethereum’s next scheduled hard fork introducing “proto-dank sharding” and improving data availability, the ecosystem is poised for further growth and development in the coming years."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2RlYnJpZGdlLWxhdW5jaGVzLWlhYXMtc29sdXRpb24tZm9yLWNyb3NzLWNoYWluLWNvbW11bmljYXRpb24tYmV0d2Vlbi1ldGhlcmV1bS1hbmQtc29sYW5hL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "deBridge launches IaaS solution for cross-chain communication between Ethereum and Solana - CryptoSlate",
        "content": "Web3 interoperability layer deBridge has launched an Infrastructure as a Service (IaaS) turnkey solution that offers a subscription-based interoperability service to facilitate cross-chain movements on Ethereum (ETH) and Solana (SOL) Virtual Machines, according to a Nov. 1 statement shared with CryptoSlate.\n\nThe newly launched IaaS is designed to tackle key challenges hampering interoperability between the Ethereum and Solana ecosystems. To do this, the service is packaged as an all-in-one solution relying on some of deBridge’s products.\n\nAs a result, the service will facilitate the transfer of authenticated messages via deBridge and promote high-performance cross-chain trading and value transfers using its DeSwap Liquidity Network (DLN).\n\nAlso, the IaaS would promote cross-chain asset custody with dePort, a native protocol for bridging and creating utility for assets on other blockchains.\n\nMeanwhile, deBridge also noted that IaaS will help project developers cross the hurdle of composability for their blockchains. By providing composability, deBridge hopes the product would help chains attract more users, developers, and liquidity from outside their ecosystem.\n\nOnboards Neon Labs\n\ndeBridge said it has onboarded Neon Labs, an Ethereum Virtual Machine on Solana, as its first client.\n\nThis strategic use of IaaS positions Neon for increased adoption, encompassing activities like cross-SVM contract calls from the EVM, native bridging from Solana, and the integration of cross-NFTs (cNFTs).\n\nHowever, it is worth noting that deBridge’s new IaaS platform comes amid new partnerships for its DLN trade product. On Oct. 30, the interoperability layer announced that DLN has partnered with RockawayX and Fordefi to bring institutional-grade liquidity to cross-chain.\n\nAccording to DLN, the partnership will allow easy and fast movement of multi-million dollar cross-chain transfers."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wMi9ibG9vbWJlcmctYW5hbHlzdC1zYXlzLWV0aGVyZXVtLXBvbHlnb24tYW5kLXNvbGFuYS11bmxvY2tpbmctb3Bwb3J0dW5pdGllcy1mb3ItZW1lcmdpbmctbWFya2V0cy1oZXJlcy1ob3cv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzAyL2Jsb29tYmVyZy1hbmFseXN0LXNheXMtZXRoZXJldW0tcG9seWdvbi1hbmQtc29sYW5hLXVubG9ja2luZy1vcHBvcnR1bml0aWVzLWZvci1lbWVyZ2luZy1tYXJrZXRzLWhlcmVzLWhvdy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Bloomberg Analyst Says Ethereum, Polygon and Solana Unlocking Opportunities for Emerging Markets – Here’s How - The Daily Hodl",
        "content": "A Bloomberg crypto analyst says that Ethereum (ETH) and two other altcoins are creating unprecedented financial opportunities for emerging markets.\n\nBlockchain analyst Jamie Coutts says on the social media platform X that ETH, Polygon (MATIC) and Solana (SOL) are unlocking greater access to the private credit market.\n\n“Public blockchains hold immense potential for empowering global citizens. The $850 billion private credit market is just the beginning. Currently, there are $568 million in active loans issued through credit funds on platforms like Ethereum, Polygon, and Solana. Who’s investing? Demand primarily stems from equatorial regions, specifically emerging markets (EM), with minimal participation from developed markets (DM).\n\nHistorically, private credit was reserved for accredited investors. But now, thanks to public blockchains and the rise of stablecoins, regions plagued by inflation and starved of yields can tap into USD private credit opportunities. While Bitcoin is rightly the leading asset and network for this movement, other blockchains will introduce invaluable opportunities to a global populace that has been underserved and deliberately excluded from the mainstream economy and its outdated regulatory protectors.”\n\nCoutts also says that the private credit market does come with risks and that transparency by issuers is vital to protect investors.\n\n“Private credit isn’t risk-free. Just last month, [decentralized lending platform] Goldfinch experienced a write-down in its fund. However, as long as issuers maintain transparency and risks are well-communicated, private investors of all backgrounds can access this traditional asset class in a contemporary, inclusive manner.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZGVjcnlwdC5jby8yMDQxMzkveW91LXdhbnQtc2hvcnQtZXRoZXJldW0tdGhlcmVzLWV0Zi1mb3ItdGhhdNIBS2h0dHBzOi8vZGVjcnlwdC5jby8yMDQxMzkveW91LXdhbnQtc2hvcnQtZXRoZXJldW0tdGhlcmVzLWV0Zi1mb3ItdGhhdD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "So You Want to Short Ethereum? There's an ETF for That - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nProShares, a U.S.-based issuer of exchange-traded funds, today announced the launch of ProShares Short Ether Strategy ETF (SETH), letting investors profit from declines in the price of Ethereum (ETH), the second-largest cryptocurrency by market capitalization.\n\nSETH, which is set to start trading on the New York Stock Exchange’s (NYSE) Arca, seeks to deliver the inverse of the daily performance of its underlying benchmark—the Standard & Poor's CME Ether Futures Index.\n\n“You will lose money when the Index rises—a result that is the opposite from a traditional index fund,” reads the product’s summary prospectus. “Obtaining inverse or ‘short’ exposure may be considered an aggressive investment technique.”\n\nAD\n\nAD\n\nIt further states that an investment in SETH “may not be suitable for all investors” because if the Index approaches a 100% increase at any point in the day, “you could lose your entire investment.”\n\nEthereum was trading at $1,816 by press time, up 1.5% over the day, data from CoinGecko shows.\n\nEarlier this year, ProShares also introduced Bitcoin Short ETF (BITI), a similar product whose performance is inversely correlated to the S&P CME Bitcoin Futures Index. In other words, investors profit when the price of Bitcoin (BTC) drops.\n\nDecrypt has reached out to ProShares for additional comments.\n\nProShares’ crypto-linked ETFs\n\nSETH joins ProShares’ lineup of other crypto-linked ETFs, which also includes ProShares Bitcoin Strategy ETF (BITO), the first U.S. Bitcoin futures ETF, ProShares Ether Strategy ETF (EETH), a futures-based fund tracking the performance of ETH, as well as BETH and BETE—the two ETFs that target the blended performance of Bitcoin and Ethereum, with market cap-weighted and equal-weighted exposure, respectively.\n\nAD\n\nAD\n\nAn ETF, or exchange-traded fund, provides investors with indirect exposure to an underlying asset. This can be useful for investors seeking exposure to commodities or cryptocurrencies, which can be difficult to transfer or store.\n\nAccording to the firm, its crypto-linked ETFs offer investors several advantages over other ways of accessing the crypto market, such as direct ownership, trusts, or funds.\n\nAmong those advantages, ProShares said, is the fact that crypto-linked ETFs are traded on regulated exchanges, have transparent pricing and liquidity, and are subject to the same rules and regulations as traditional ETFs.\n\nEdited by Liam Kelly."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbnZkYS1hbWQtYm9vbWVkLXRoYW5rcy10by1jcnlwdG8tbWluaW5nLWJ1dC13aGF0LWhhcHBlbmVkLWFmdGVyLWV0aGVyZXVtcy1iaWctbW92ZS1mcm9t0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "NVDA, AMD Boomed Thanks To Crypto Mining, But What Happened After Ethereum's Big Move From Proof-Of-Work ... - Nasdaq",
        "content": "Semiconductor companies NVIDIA Corp (NASDAQ:NVDA) and Advanced Micro Devices Inc (NASDAQ:AMD), known for their graphics processing units (GPUs), saw their stock prices benefiting from the boom in cryptocurrencies.\n\nWhat Happened: These GPUs, originally designed for high-end video game graphics, have now become essential for computationally intensive applications such as data centers, artificial intelligence, and the creation of crypto assets.\n\nCryptography and blockchain creation require substantial computational power, making GPUs an ideal choice for these tasks. In 2018, as cryptocurrency prices soared, miners rushed to purchase GPUs, driving up the stock prices of Nvidia and AMD. GPUs played a vital role in the creation and management of crypto assets, to the extent that Nvidia even introduced a dedicated lineup of chips specifically for crypto mining in early 2021.\n\nThe Merge and Proof-of-Stake Approach\n\nThe Ethereum Foundation on September 15, 2022, completed “The Merge” process, which means Ethereum was switched from a Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoW).\n\nWith this development, the validation of new transaction blocks no longer relies on hardware mining, making the millions of high-end graphics cards previously used for this purpose redundant. Consequently, a large number of these GPUs were expected to flood the used card market.\n\nHowever, since 2023, the AI industry experienced a remarkable upswing. With machine learning at the forefront, AI applications penetrated diverse sectors, capturing investors’ attention and fueling the sector’s success.\n\nAccording to PwC, the potential economic impact of AI is substantial, with an anticipated contribution of $15.7 trillion to the global economy by 2030. This projection encompasses a $6.6 trillion boost in productivity and a staggering $9.1 trillion surge in consumption.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nExamining the performance of both AMD and NVDA in the aftermath of “The Merge,” we delve into which of these stocks emerged as the stronger contender.\n\nNVDA vs AMD: Price Performance Comparison\n\nPerformance-wise, both Nvidia (NVDA) and AMD have witnessed significant changes in their stock prices over the past year.\n\nAs of September 15, 2022, NVDA’s stock price increased by 215.61% ($129.21 to $407.8), while AMD’s stock price rose by 28.49% ($76.66 to $98.5).\n\nNVDA Or AMD: 1 Year Performance (Photo: Benzinga)\n\nNVDA vs AMD: Returns Comparison\n\nWhen it comes to returns, a $1000 investment in NVDA would have resulted in a final value of $3156.08, whereas the same investment in AMD would have yielded $1284.89.\n\nNVDA Or AMD: Which Offers Better Returns? (Photo: Benzinga)\n\nCo-Movement of NVDA and AMD\n\nHistorically, NVDA and AMD have shared a reasonably high correlation in their stock price movements. The coefficient of determination (R2) between the two stocks is calculated to be 0.8464, suggesting a strong relationship between their price fluctuations.\n\nDo NVDA And AMD Often Move Together? (Photo: Benzinga)\n\nPrice Action: At the time of writing, ETH was trading at $1,785.941 up 0.66% in the last 24 hours, according to Benzinga Pro. During Tuesday’s session, AMD closed at $98.50, showing a positive gain of $2.32 (2.41%), while Nvidia ended at $407.80, recording a slight decrease of $3.81 (0.93%).\n\nImage Source – Shutterstock\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWZvbGxvd2luZy1zZWNzLWV4ZW1wdGlvbi1vZi1ldGgtYXMtc2VjdXJpdHktYmluYW5jZS1sYXdzdWl0LXRpbWUtYnV5Lmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Following SEC's Exemption of ETH as a Security in Binance Lawsuit – Time to Buy? - Cryptonews",
        "content": "Ethereum Price Prediction Following SEC’s Exemption of ETH as a Security in Binance Lawsuit – Time to Buy?\n\nSource: TradingView\n\nThe price of Ethereum (ETH) has dropped by 3% in the past 24 hours, slipping to $1,816 as the cryptocurrency market reels from the news that the SEC has sued Binance and its founder Changpeng Zhao with 13 violations.\n\nETH hasn’t been as badly affected as other cryptocurrencies by this news, with the altcoin down by 4.5% in the past week, but still up by 51% since the beginning of the year.\n\nAnd in contrast to other altcoins, ETH has arguably benefitted from not being named as an unregistered security in the SEC’s charges against Binance, with such rivals as Cardano (ADA), Algorand (ALGO), Solana (SOL) and Cosmos (ATOM) being included (and suffering more as a result).\n\nAs such, once the dust has settled on the SEC’s latest legal action, ETH could find itself recovering more strongly than many other utility tokens, particularly when combined with an increase in staking.\n\nEthereum Price Prediction Following SEC’s Exemption of ETH as a Security in Binance Lawsuit – Time to Buy?\n\nETH’s indicators are all in a pretty weak position right now, in line with the rest of the market.\n\nSource: TradingView\n\nThis includes its relative strength index (purple), which declined below 30 yesterday and has only just begun creeping slowly back up.\n\nSimilarly, ETH’s 30-day moving average (yellow) is now dropping sharply towards its 200-day average (blue), and is likely to fall below the longer-term average in a few days, at which point a rebound is due.\n\nIt’s possible that ETH won’t fall much further in price than it already has, in that its support level (green) has held up fairly well around $1,800.\n\nAnd unlike BNB and various other coins which have been named in the SEC’s charges against Binance, ETH has effectively been provided with a clear path towards recovery.\n\nThe SEC named 10 tokens in addition to $BNB as securities in the Binance lawsuit\n\n\n\nSome big name tokens are on this list such as $ADA, $MATIC, $ALGO, $SOL, $ATOM\n\n\n\nOnce again they are not litigating each of these tokens, just indirectly litigating them which is a scumbag move.\n\n\n\nWe… pic.twitter.com/avBqdSxBOQ — Tony Edward (Thinking Crypto Podcast) (@ThinkingCrypto1) June 5, 2023\n\nIn addition to BNB and Binance USD (BUSD), the altcoins cited as securities in the SEC’s complaint are the following:\n\nSOL\n\nADA\n\nMATIC\n\nFIL\n\nATOM\n\nSAND\n\nMANA\n\nALGO\n\nAXS\n\nCOTI\n\nIt’s worth highlighting that the tokens above have fallen harder than many other in the market, with The Sandbox and Axie Infinity, for example, down by 14% and 9% in the past 24 hours.\n\nThe fact that ETH coin was not named in the list above suggests that it may escape any future SEC action against it and/or its founders.\n\nThe SEC will come for $ETH next. The SEC lawsuit mentions the fee burning mechanism of Solana and Polygon, stating that the deflationary effect has led investors to view their purchase of the tokens to have potential for profit. Polygon's fee burning mechanism (EIP-1559) in… — Pete Kim (@petejkim) June 5, 2023\n\nHowever, some observers are concerned that the SEC complaint highlights burning as a mechanism which creates an expectation of profit, something which may result in it turning on ETH in the not-too distant future.\n\nOn the other hand, it’s not only an expectation of profit that qualifies something as a security (otherwise BTC would be a security), so it’s certainly not a certainty that ETH will one day face its own data with the SEC.\n\nIn fact, some commentators are actually optimistic that the SEC’s complaint provides a relatively clear outline on how cryptocurrency platforms and organizations can avoid offering unregistered securities in the future.\n\nThrough its complaint against Binance, the SEC just gave crypto projects a 136 page roadmap on how not to be seen as a security.\n\n\n\nIt makes me insanely bullish for the prospects of current and future crypto projects.\n\n\n\nMost people are aware of the Howey Test, which outlines 4… — jonwu.eth (@jonwu_) June 6, 2023\n\nEither way, ETH has been less severely affected today by the SEC’s latest legal foray, and it’s likely that it will recover strongly in the coming weeks and months.\n\nAs we’ve written before, it successfully introduced staking withdrawals last month, and in the aftermath of this update Ethereum staking has actually increased.\n\nSince April 11, the total number of #ETH staking deposits has grown by 657%#ETH staked has surged despite last month's Shapella hard fork, a network upgrade that enabled withdrawals from staking\n\n\n\nToday, ~18% of #ETH supply is staking and/or in the activation queue pic.twitter.com/NMsw7zEstB — Wakem Capital Management (@WakemCapital) June 5, 2023\n\nSuch an increase in staking will inevitably reduce the circulating supply of ETH, and in conjunction with reported increases in ETH outflows away from exchanges, it suggests that the altcoin’s price will recover steadily in the near and more distant future.\n\nFrom its current price of around $1,800, it’s likely to return to $1,900 in the next few weeks, before passing $2,000 in the next few months.\n\nBuy Ethereum Now\n\nHedging Bets with Other High-Growth Alts\n\nWhile ETH continues to have good prospects, even with some uncertainty hanging over it, its recovery may be gradual and may require several months to develop.\n\nAccordingly, some investors may prefer to buy newer altcoins that show more potential in terms of above-average in the shorter term.\n\nSuch altcoins include presale tokens, with some of the best of these likely to experience big rallies once they list on exchanges for the first time.\n\nOne example of such a presale token is Wall Street Memes (WSM), a new cryptocurrency associated with the meme stocks movement that emerged out of the 2021 GameStop and AMC rallies.\n\nWall Street Memes has already raised more than $4.4 million in its presale, which kicked off only last week.\n\nhttps://www.twitter.com/wallstmemes/status/1665448546273820673\n\nAs a meme token, WSM has no real fundamentals other than the community which will support it, and given that it has already raised a large sum of money so quickly, it seems as though its community of holders will be a healthy one.\n\nThis suspicion is also supported by the fact that the Wall Street Memes Twitter account now has more than 225,000 followers, all of which are potential WSM buyers.\n\nWSM could therefore rally big once it lists, with investors able to join its presale by visiting its official website.\n\n1 WSM token is currently selling at a discounted price of $0.0274, although this will climb to $0.03370000 by the time the sale reaches its 30th stage.\n\nVisit Wall Street Memes Now"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHVzaC1hYm92ZS0xODAwLWRyaXZlbi1ieS10aGlzLWRyaXZlci1yZXBvcnTSAU1odHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLXB1c2gtYWJvdmUtMTgwMC1kcml2ZW4tYnktdGhpcy1kcml2ZXItcmVwb3J0P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Rise Above $1,800 Caused By This Driver: Report - U.Today",
        "content": "Advertisement\n\nA recent tweet by on-chain data agency Santiment has revealed an important driver that pushed the second largest crypto, Ethereum, up, helping it to regain the $1,800 price mark.\n\nReport reveals what pushed Ethereum above $1,800\n\nA recent X post by Santiment revealed that the major driver, moving ETH over $1,800 was the day when the biggest number of new wallets emerged since early October.\n\nThe analytics team of the company reckons that should the Ethereum network keep growing long-term with the ETH supply on exchanges declining further, “ETH has justification to cross $2,000 once again”. Currently, the supply of Ethereum remains at the lowest level since ETH Genesis.\n\n📈 #Ethereum's rise above $1,800 has been aided by its largest day of new addresses created since October 7th. If the long-term trend of network growth continues, and exchange supplies continue to drop, $ETH has justification to cross $2,000 once again. https://t.co/SWAC3BVzz8 pic.twitter.com/xRjYUfpkyO — Santiment (@santimentfeed) November 1, 2023\n\nVitalik Buterin deposits ETH to Coinbase\n\nAs reported by U.Today earlier, Ethereum co-founder Vitalik Buterin transferred a small amount of ETH to the largest US-based crypto exchange Coinbase – 100 ETH worth $181,000. When Vitalik transferred them at $1,810 per coin.\n\nIn September this year, he also moved 400 ETH to the same crypto trading venue. In August, Buterin deposited 600 ETH to Coinbase also – that amount of ETH was worth approximately $1 million back then.\n\nIn October, Buterin moved 1,000 ETH to Bitstamp, selling it for $1.67 million. Overall, over the past two months, the Ethereum frontman moved roughly 4,400 ETH to Bitstamp, selling it for approximately $7.23 million in fiat.\n\nAt the time of this writing, ETH is changing hands at $1,798, according to the data provided by CoinMarketCap."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW1zLWRlbmN1bi11cGdyYWRlLWVpcC03NTE0LWFuZC1pdHMtaW1wYWN0LW9uLWV0aC1wcmljZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum's Dencun upgrade: EIP-7514 and its impact on ETH price - crypto.news",
        "content": "Ethereum core developers have included EIP-7514 in the upcoming Dencun upgrade. This proposal slows the growing ETH staking while allowing developers to explore long-term solutions for unchecked staking.\n\nEIP-7514 is an Ethereum Improvement Proposal co-authored by Tim Beiko and Dapplion that is meant to slow down the rate of Ether (ETH) staking.\n\nThe proposal is part of Ethereum’s Dencun upgrade slated for activation in October 2023, and it is essentially an attempt to buy the community time to come up with a more practical reward scheme for stakers on the network.\n\nNext up, we continued a conversation from last week's ACDC call, about whether to add a constant cap to the validator activation queue. The proposal had since then been formalized as EIP-7514: https://t.co/sd4D4GlMRY — timbeiko.eth ☀️ (@TimBeiko) September 14, 2023\n\nAccording to some Ethereum developers, if the pace of staking remains unchecked, it will be possible to witness half of all ETH staked by May 2024, which could escalate to three-quarters by September 2024 and potentially hit 100% by December 2024.\n\nThe Beacon chain is growing exponentially\n\n\n\nWe all like up-only, but not when the safety of Ethereum is at stake. By doing nothing, next year we will enter unknown economic territory with >50% of total ETH stake\n\n\n\nToday ACD will vote to bound max growth to buy research time pic.twitter.com/iA7T6BHjak — Lion ⟠ dapplion .eth (@dapplion) September 14, 2023\n\nWhile at first glance, this might appear positive, it could apply undue pressure on the network and render the rewards for staking less attractive.\n\nEIP-7514 is meant to bring changes to the way new validators, those responsible for processing transactions and creating blocks, can join the network.\n\nIt is a temporary fix to manage the increasing number of validators while also allowing developers to look for more permanent solutions. These future solutions could lead to big changes in Ethereum’s economic rulebook, potentially sparking a new age of staking in the system.\n\nSo, how did it get to the point where a squeeze on ETH staking became necessary? And more importantly, what are the possible future ramifications of EIP-7514 on the price of ETH? Read on to find out more.\n\nThe Merge and the staking surge\n\nIn 2022, the Ethereum network successfully executed a large-scale software upgrade, commonly referred to as the “Merge,” that moved it from the energy-intensive proof-of-work (PoW) consensus mechanism to the more sustainable proof-of-stake (PoS) mechanism.\n\nFor those not in the know, a consensus mechanism is a protocol used in a blockchain network to ensure all computers or nodes making up the network agree on a single data set. It serves as the standard for verifying and approving each transaction on the blockchain.\n\nThe Ethereum upgrade involved merging the original Ethereum mainnet with a separate PoS blockchain called the Beacon Chain, allowing the network to transition from a mining-based PoW blockchain to a staking-based PoS model.\n\nStaking is when users lock up their ETH tokens as a way of validating transactions on the network. In return, these validators are rewarded with more ETH tokens.\n\nThis feature is central to Ethereum because it provides the mechanism for achieving consensus in the network. It encourages security by ensuring validators have a vested interest in the network, particularly since they risk losing their staked ETH if they try to cheat the system.\n\nTo become a validator requires staking a minimum of 32 ETH, which is worth approximately $52,000 at current rates.\n\nYou might also like: Ethereum goes red as active addresses, deposits spike\n\nStaked ETH withdrawal and the rise of liquid staking\n\nThe introduction of staking was met with soaring demand, sparking concerns regarding the potential for the Ethereum network to become overly congested.\n\nDriving this fervor for staking was EIP-4895, introduced as part of the April 2023 Shanghai upgrade, which allowed validators to withdraw staked ETH and staking rewards.\n\nAccording to Dankrad Feist, a researcher at the Ethereum Foundation, while the implementation of EIP-4895 was anticipated to grow Ethereum’s validator network, the widespread impact of liquid staking was not fully realized at the time.\n\nLiquid staking is a solution that allows users to stake their ETH directly on Ethereum in exchange for an ERC-20 liquid staking token (LST) that represents their staked ETH. It enables the staked ETH to remain liquid or movable rather than locked on the blockchain.\n\nThe three biggest liquid staking derivatives (LSDs) on the Ethereum mainnet are stETH by Lido, rETH by RocketPool, and SETH2 by Stakewise. They allow users to stake and unstake any amount of ETH without waiting for a specific unlock period.\n\nIn Feist’s opinion, the unwillingness of staking pools to self-regulate, especially those holding a dominant position in the liquid staking arena, could potentially jeopardize Ethereum’s decentralization.\n\nThe researcher suggested a governance attack on a major staking protocol might pose significant challenges for Ethereum.\n\nMy reasoning on why I'm for EIP-7514. It is currently unclear if (especially liquid) staking will keep growing indefinitely. In the case that the withdrawal queue does not empty over the next few months, the lower churn limit will give the Ethereum community the time needed to… — Dankrad Feist (@dankrad) September 14, 2023\n\nETH developers foresee exponential growth in validator sets\n\nIn the PoS version of Ethereum, validators are randomly chosen to confirm transactions and create a set of consecutive blocks called an epoch.\n\nAn epoch is important as it helps in the management of the blockchain, ensuring not all validators are active at the same time, which would be inefficient and unnecessary. Each epoch lasts about 6.4 minutes and is made up of 32 slots, with each slot allocated 12 seconds.\n\nAt each slot, the system allows a validator to propose a block, even though not all slots may contain a block.\n\nAs mentioned previously, validators earn their status by staking ETH, and the potential for profit has seen more and more users joining as validators and increasingly staking higher amounts of ETH.\n\nHowever, this rapid growth in validators has raised a couple of issues. First, it could burden Ethereum’s peer-to-peer (P2P) networking infrastructure, increasing the chances that nodes making up the network may fail due to higher computational and bandwidth demands caused by increased “gossip messages” among validators.\n\nSecondly, the expanding number of validators could complicate Ethereum’s attempts to achieve single-slot finality, the quest to make a transaction final and irreversible in just one slot.\n\nThere are currently more than 795,000 active validators. With the next upgrade following Dencun not anticipated until May 2024 at the earliest, Dankrad Feist fears there may be more than 2 million validators by then.\n\nMoreover, he believes that the Ethereum community will find itself in uncharted waters if the combined LST market cap surpasses that of unstaked ETH.\n\n“This technical problem is exacerbated by an economical one: liquid staking tokens exceeding the remaining (unstaked) Ether market cap brings us in an untested economic regime. A point of no return might be reached when incentives lead to them having similar liquidity and utility in DeFi – even a staking yield close to 0% (but still positive) might be enough to keep the LST attractive” Dankrad Feist, Ethereum Foundation researcher\n\nAt present, approximately 25.8 million ETH, representing 21% of all ETH in circulation and equivalent to a staggering $41.8 billion, has been staked, per data from beaconcha.in.\n\nAccording to projections by Ethereum developers Tim Beiko and Dapplion, should the current momentum persist, the percentage of staked ETH in relation to total ETH supply could mushroom to 50% by May 2024 and escalate to 100% by the end of that year.\n\nProjected validator set | Source: ethereum.org\n\nIf Beiko and Dapplion’s projections were to hold true, the Ethereum network might find itself devoid of ETH, meaning that users will have no way to pay for transactions on the network.\n\nYou might also like: Ethereum unveils new testnet called ‘Holešky’\n\nThe EIP-7514 solution\n\nEIP-7514 doesn’t directly address the potential technical and economic problems emanating from the unprecedented growth of ETH staking. Instead, it seeks to buy the Ethereum community a bit of time to find lasting solutions for them.\n\nIt essentially puts the brakes on the growth of staked ETH by restricting the churn limit, which is the number of validators that can enter or exit the network during an epoch.\n\nUsually, Ethereum’s churn limit is dynamic, determined by calculations based on the total number of active validators divided by 65,536. As of Sept. 11, 2023, the upper churn limit was 12 per epoch, with the next determination set for Oct. 4.\n\nYesterday, the churn limit increased from 11 to 12. Next churn limit increase projected to occur around October 4!\n\n\n\nH/t: @dapplion pic.twitter.com/ftwhRxbGFE — Christine Kim (@christine_dkim) September 11, 2023\n\nBeiko and Dapplion’s proposal seeks to do away with the dynamic calculations and instead establish a fixed maximum churn limit of 8 per epoch.\n\nIn so doing, EIP-7514 could theoretically extend the time it would take for staked ETH to reach 50% of total ETH supply by at least one year and as many as four years for it to get to 100%, therefore giving the community enough time to find lasting solutions for the imperfections in the validator reward system.\n\nThis proposed cap will not interfere with the churn limit that controls validator exits. That limit will keep adjusting dynamically, maintaining a balance with the expansion of the validator set.\n\nThe goal is to prevent a scenario where the staking withdrawal queue is constantly full, therefore complicating the efficient administration of validator rewards.\n\nWhile the proposal has largely been positively received, some sections of the Ethereum community have been critical of its rushed nature and have suggested it could compromise Ethereum’s neutrality.\n\nhttps://twitter.com/ryanberckmans/status/1702336972700942366\n\nPotential EIP-7514 impact on ETH price\n\nThe immediate impact of EIP-7514 on the price of ETH is unclear at this point, but some market watchers think it could have a noteworthy long-term effect.\n\nThe proposal is intended to slow down the rate of ETH staking, which, in turn, could potentially influence the coin’s supply-demand dynamics.\n\nIf successfully executed, EIP-7514 could significantly reduce the amount of ETH being staked, therefore alleviating the potential pressure on the Ethereum network and making staking rewards more attractive.\n\nSome analysts believe the enhanced attractiveness of staking rewards and the reduced supply of ETH in the market could potentially increase its price.\n\nHowever, the proposal is only a temporary fix for managing an increased number of validators, and the Ethereum community will still have to find a more permanent solution. As such, the long-term effects of EIP-7514 on the price of ETH may be speculative at best, depending on what these future solutions could be.\n\nIf they result in a more efficient and secure network, it can potentially boost Ethereum’s overall value, resulting in a price increase for ETH. Conversely, if these changes are not well-received or cause network instability, it could put downward pressure on the ETH price.\n\nRead more: Ethereum exchange deposits surge while staked ETH hits ATH\n\nFollow Us on Google News"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3RoZWNyeXB0b2Jhc2ljLmNvbS8yMDIzLzExLzAyL3Byby10cmFkZXItcGV0ZXItYnJhbmR0LXByZWRpY3RzLWV0aGVyZXVtLXRvLXJhbGx5LXRvLTE5OTMtdXBvbi1icmVha291dC1vZi1yaWdodC1hbmdsZWQtZXhwYW5kaW5nLXRyaWFuZ2xlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Peter Brandt Predicts Ethereum Rally to $1,993 Upon Breakout of Right-Angled Expanding Triangle - The Crypto Basic",
        "content": "Peter Brandt, a veteran trader with over 40 years of experience, has set a target of $1,993 for Ethereum (ETH) following the asset’s breakout of a recently formed right-angled expanding triangle.\n\nBrandt made this projection yesterday during his latest analysis of Ethereum’s recent price movements. The trader shared a daily ETH chart on X, identifying the formation of a right-angled expanding triangle pattern, which was completed on Oct. 23.\n\nA right-angled expanding triangle, or a right-angled broadening wedge, features an upper trendline and a lower trendline, with both lines expanding apart. The pattern can either signal a potential continuation of the previous trend or a reversal.\n\n- Advertisement -\n\nData from Brandt’s chart suggests that the beginning of this pattern dates back to Aug. 17. Notably, ETH collapsed 6.76% on the day, dropping to a low of $1,683.5. However, this massive red candlestick formed the base of the right-angled expanding triangle.\n\nAmid Ethereum’s swings and lows since Aug. 17, the asset formed the broadening triangle, as it continued to trade within its confines until Oct. 23. Brandt’s analysis emphasizes that ETH completed the formation of the triangle on Oct. 23 amid a 6.17% increase that day.\n\nETH Forms Flag Pattern, Poised to Rally 8.6%\n\nInterestingly, ETH broke above the upper trendline of the triangle, signaling a potential continuation of an uptrend that began on Oct. 12. However, after the breakout, Ethereum formed a flag pattern that lasted for nine days, from Oct. 24 to Nov. 1.\n\nBrandt identified this flag pattern in his analysis. According to him, ETH recently completed the flag pattern, which is a further re-confirmation of the right-angled expanding triangle, which the asset completed on Oct. 23.\n\n- Advertisement -\n\nNotably, flags are typically consolidation patterns that suggest a brief pause in the prevailing trend before a potential resumption of that trend. Since breaking above $1,800, ETH has consolidated between $1,744 and $1,865, but with an upward trajectory.\n\nThe asset has now completed the nine-day flag, and a bullish continuation of the uptrend is expected. Brandt’s chart suggests a target of $1,993 for when Ethereum engineers another massive run. ETH would need to appreciate 8.5% from its current price to hit $1,993.\n\nEthereum trades for $1,836 as of press time, per CoinMarketCap data. The asset is up 1.76% over the past 24 hours, with its eyes set on conquering the $1,874 resistance. Impressively, ETH’s trade volume has increased 71.30% to a current value of $11.6 billion, ranking it third in volume."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wMS93aGFsZXMtYWJydXB0bHktbW92ZS1vdmVyLTMwNTAwMDAwMC13b3J0aC1vZi1zaGliYS1pbnUtYW5kLWV0aGVyZXVtLWhlcmVzLXdoZXJlLXRoZS1jcnlwdG8taXMtZ29pbmcv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzAxL3doYWxlcy1hYnJ1cHRseS1tb3ZlLW92ZXItMzA1MDAwMDAwLXdvcnRoLW9mLXNoaWJhLWludS1hbmQtZXRoZXJldW0taGVyZXMtd2hlcmUtdGhlLWNyeXB0by1pcy1nb2luZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Whales Abruptly Move Over $305,000,000 Worth of Shiba Inu and Ethereum – Here’s Where the Crypto Is Going - The Daily Hodl",
        "content": "Crypto whales have transferred Ethereum (ETH) and Shiba Inu (SHIB) worth hundreds of millions of dollars in multiple transactions that occurred within hours of each other, according to the blockchain tracker Whale Alert.\n\nStarting with Ethereum, on-chain data obtained by Whale Alert shows that a large crypto holder moved 150,000 ETH from an unknown wallet to the Kraken crypto exchange in three different transactions of equal amounts.\n\nAt the time of the transfer, the total value of the ETH moved was approximately $269.8 million.\n\nEthereum is trading at $1,803 at time of writing.\n\nTurning to the Shiba Inu memecoin, on-chain data retrieved by Whale Alert shows that a whale moved nearly 4.5 trillion SHIB worth slightly under $36 million from an unknown wallet to another unknown wallet.\n\nShiba Inu is trading at $0.00000799 at time of writing.\n\nOn-chain data also shows that large crypto holders relocated varying amounts of XRP and Solana (SOL), with a combined value of over $98 million, according to Whale Alert.\n\nCrypto.com and Bitstamp are both centralized cryptocurrency exchanges.\n\nXRP is worth $0.604 at time of writing while Solana is trading at $36.60.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9pbnRyb2R1Y2luZy1jaGltcHotdWx0aW1hdGUtc2FmZS1oYXZlbi0xNzAwMDAzNDguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Introducing $CHIMPZ: The Ultimate Safe Haven for Risk-Takers on Ethereum Blockchain - Yahoo Finance",
        "content": "Chimpz\n\nGeorge Town, Cayman Islands, Nov. 01, 2023 (GLOBE NEWSWIRE) -- In an exciting leap towards the moon, $CHIMPZ , the crypto community's newest sensation, is thrilled to announce its upcoming launch on the Ethereum Blockchain. This digital sanctuary for risk-takers worldwide is set to redefine the world of cryptocurrencies and propel its community into the next moon mission.\n\nInspired by the historic journey of Ham the Chimp, Chimpz is a cryptocurrency project dedicated to risk-takers and daredevils who are ready to join the ranks of the audacious. Just as Ham challenged the boundaries of space exploration, Chimpz challenges the conventional in the world of crypto. It's time for the primates to take over.\n\nSuccessful Presale and Anticipated Launch\n\n$CHIMPZ recently conducted a groundbreaking presale event on PinkSale, garnering significant interest and support from investors, enthusiasts, and risk-takers who are ready for the adventure of a lifetime.\n\nWith the presale completed, $CHIMPZ now gears up for the grand moment that the crypto world has been waiting for. $CHIMPS is scheduled to launch on Uniswap on November 01, 2023, 18:00 UTC. This exciting milestone is just around the corner, and the project thrilled to invite everyone to be part of the journey.\n\nChimpz - More Than Just a Token\n\nChimpz, with its symbol $CHIMPZ, is more than just a token; it's a ticket to an exclusive community. As a $CHIMPZ holder, users can gain access to a private Discord group where they can engage with peers, chart analysts, and the Chimpz team directly. This exclusive membership offers a gateway to future ICOs, NFT whitelists, early alpha releases, and risk management groups.\n\nIn a world where opportunities often seem reserved for the privileged few, Chimpz levels the playing field, allowing everyone to be a part of this exciting journey.\n\nUnwavering Security and Transparency\n\nChimpz takes financial safety seriously. The project has partnered with industry leaders such as InterFi, BlockSaFu, Coinscope, SolidProof, and Consult for contract security. With their backing, Chimpz is fortified against potential risks, ensuring a secure and reliable environment for its community.\n\nStory continues\n\nAdditionally, Chimpz has teamed up with Pinksale for its presale and KYC verification, adding an extra layer of security and trust. Ownership will be renounced post-launch, and liquidity will be locked for an entire year.\n\nTokenomics - A Win-Win for Everyone\n\nChimpz boasts a total supply of 1,000,000,000 tokens and an impressive array of features to safeguard its community. The contract comes equipped with Anti-Bot, Anti-Sandwich, Anti-Gas, and Safu Code, all developed by the renowned contract creator Trynos.\n\nThe tax structure at launch is designed to benefit all holders. There is a 3% fee for both purchases and sales, with 2% allocated for long-term marketing and development. The remaining 1% is distributed as reflections to holders, effectively putting the power in the hands of the Chimpz community.\n\nChimpz - A Community of Dreamers\n\nChimpz's mission revolves around three core pillars: Security, Transparency, and Inclusivity. This project isn't just about making money; it's about creating a supportive ecosystem where individuals from all backgrounds can come together and thrive.\n\n100x Potential in 2023?\n\nThe burning question on everyone's mind: Does Chimpz have the potential to soar to new heights in 2023? With a successful presale, and the official launch scheduled for November 1, 2023, 18:00 UTC, the Chimpz team is gearing up for an exciting ride.\n\nThe presale funds are allocated wisely, with 60% going into the liquidity pool, ensuring stability and sustainability, and 40% will be distributed in various ways to further propel Chimpz:\n\nMarketing/Partnerships (20%): A significant portion will be invested in marketing and forging strategic partnerships to boost the project's visibility and reach.\n\nDapp Development (10%): Innovation is at the heart of Chimpz. The funds allocated for Dapp development will ensure that the Chimpz ecosystem continues to evolve, providing exciting opportunities for its community.\n\nInitial CEX Funds (10%): To make Chimpz accessible to a broader audience, 10% of the funds will be allocated to initial Centralized Exchange listings.\n\nIn a world where cryptocurrencies have the potential to change lives, Chimpz emerges as a project that combines audacious dreams with solid fundamentals. The potential for 100x gains in 2023 is an exciting prospect, and the Chimpz team is dedicated to making this journey a reality for its community.\n\nDon't miss the opportunity to join the Chimpz community and become a part of a revolution in the world of crypto. Visit the Chimpz website at https://www.chimpzerc.com/ , and connect with them on Twitter ( https://twitter.com/ChimpzERC ) and Telegram ( https://t.me/ChimpzPortal ). The moon is waiting, and the Chimpz are ready to take you there. Apes together strong!\n\nAbout Chimpz\n\nChimpz is more than just a cryptocurrency; it's a daring mission inspired by the legendary journey of Ham the Chimp. It has created a vibrant, inclusive community for risk-takers and crypto enthusiasts who dare to dream big. Holding $CHIMPZ not only gives users a ticket to the exclusive Discord, where they can connect with peers and experts but also grants them priority access to exciting ICOs, NFT whitelists, and early alpha releases.\n\nCHIMPZ’s commitment to security, transparency, and inclusivity sets Chimpz apart, ensuring that the audacious dreams of our community members are within reach.\n\nWebsite | Twitter | Telegram | Discord\n\n\n\nhttps://www.chimpzerc.com/\n\n\n\nDisclaimer: This announcement is not directed at any investors or potential investors, and does not constitute an offer to sell — or a solicitation of an offer to buy — any securities or cryptocurrencies, and may not be used or relied upon in evaluating the merits of any investment. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in this release are subject to change without notice. The contents herein should not be construed as or relied upon in any manner as investment, legal, tax, or other advice.\n\nCONTACT: Macho Randy Chimpz contact(at)chimpzerc.com\n\n\n\n"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wMS90cmFkZXItcHJlZGljdHMtbGVncy11cC1mb3ItdGhvcmNoYWluLWFuZC1vbmUtZXRoZXJldW0tYmFzZWQtYWx0Y29pbi11cGRhdGVzLW91dGxvb2stb24tcG9seWdvbi_SAYUBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMDEvdHJhZGVyLXByZWRpY3RzLWxlZ3MtdXAtZm9yLXRob3JjaGFpbi1hbmQtb25lLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4tdXBkYXRlcy1vdXRsb29rLW9uLXBvbHlnb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Trader Predicts Legs Up for THORChain and One Ethereum-Based Altcoin, Updates Outlook on Polygon - The Daily Hodl",
        "content": "A widely followed crypto analyst is taking a look at Polygon (MATIC) while predicting upward moves from two altcoins.\n\nPseudonymous crypto trader Altcoin Sherpa tells his 197,400 followers on the social media platform X that THORChain (RUNE) is ready to move up.\n\n“RUNE: Next area up is $3.”\n\nTHORChain is a decentralized liquidity protocol designed to facilitate the exchange of assets across different blockchain networks without the need for centralized intermediaries, such as traditional crypto exchanges. RUNE is worth $2.86 at time of writing, up 35% in the last week.\n\nTurning to privacy-focused crypto Blur (BLUR), the analyst thinks BLUR could reach $0.30 despite being down 10% in the last 24 hours.\n\n“BLUR: I think this keeps going until $0.30.\n\nStill probably undervalued relative to OpenSea but don’t know if NFTs (non-fungible tokens) are really a great narrative right now.”\n\nBLUR is worth $0.235 at time of writing, down big in the last day but still up 43% in the last month.\n\nFinally, Altcoin Sherpa lays out his outlook on the Ethereum (ETH) layer-2 scaling solution Polygon. According to the trader, now may not be the best time to trade MATIC.\n\n“Looks ok but the 200W EMA (200-week exponential moving average) is right at this current price and it’s kind of in no man’s land. I don’t see this as a great buy relative to other coins at this time.”\n\nMATIC is trading for $0.629 at time of writing, down 1.7% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/MiinMT/WindAwake"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc3dpc3Mtc2drYi1iYW5rLWxhdW5jaGVzLWJpdGNvaW4tZXRoZXJldW0tY3VzdG9keS1zZXJ2aWNlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Swiss SGKB Bank Launches Bitcoin & Ethereum Custody Services - Watcher Guru",
        "content": "One of the largest cantonal banks in Switzerland, St. Galler Kantonalbank (SGKB), has announced the launch of Bitcoin (BTC) and Ethereum (ETH) custody and trading services. In partnership with SEBA Bank, the financial institution has unveiled its newly devised crypto service offerings for select clients.\n\nAdditionally, SGKB announced that it has plans to expand its offerings. Specifically, they have noted that select cryptocurrencies will grow based on increasing client demand. Still, developing crypto dealings for the bank is an important international development for the market as a whole.\n\nJUST IN: 🇨🇭 Swiss Bank St.Galler Kantonalbank to offer #Bitcoin and Ethereum custody services. November 2, 2023\n\nAlso Read: France, Singapore, and Switzerland’s CBDC Experiment Achieves Success\n\nOne of Switzerland’s Largest Banks to Offer Bitcoin and Ethereum Services\n\nThe year for digital assets has certainly been an interesting one. Regions across the globe have pondered developing regulations while more and more traditional finance entities are adjusting their infrastructure to include the growing interest in digital assets. Now, a Swiss bank is doing just that.\n\nSpecifically, SGKB Bank, one of Switzerland’s largest cantonal banks, has announced it will launch Bitcoin and Ethereum custody and trading services. Moreover, they are set to initially only support the industry’s most prominent digital assets. However, they have assured the public that the list of cryptocurrencies it works with will grow based on client demand.\n\nSource: Crypto News\n\nAlso Read: Switzerland Considers Nationalizing Credit Suisse\n\nSGKB will work alongside the Swiss-based SEBA bank amid the venture into digital assets. Specifically, the partnership will utilize SEBA’s digital asset brokerage and custody operations. Subsequently, the development is the first venture into digital assets that the fifth largest Swiss bank, SGKB, has ever made.\n\n“We are very pleased to be able to support St.Galler Kantonal Bank with our expertise in expanding their services around digital assets,” SEBA Bank head of B2B and Custody Solutions, Christian Briere, told The Block. Thereafer, assuring that “other currencies will follow shortly,” after Bitcoin and Ethereum."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vZXRoZXJldW0tbmV0d29yay1ncm93dGgtdGFrZXMtZXRoLXRvLTEtOGstMmsv0gFLaHR0cHM6Ly9lbmcuYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1uZXR3b3JrLWdyb3d0aC10YWtlcy1ldGgtdG8tMS04ay0yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Ethereum: Network growth takes ETH to $1.8K – $2K - AMBCrypto English",
        "content": "ETH’s Supply on Exchanges dropped to its ATL\n\nThere was a steady rise in Open Interest as well\n\nEthereum [ETH] made a decisive move past $1,800 after the U.S. Federal Reserve’s (Fed) decision to keep the interest rates unchanged at 5.25%-5.50%.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAt press time, the king of altcoins exchanged hands at $1,848, up 2.33% in the last 24 hours, reaching levels last seen before the mid-August crash, per CoinMarketCap.\n\nEthereum sees network growth\n\nApparently, the latest upside was boosted by new participants on the network. According to on-chain analytics firm Santiment, new ETH addresses climbed to a 24-day high at the end of October.\n\nTypically, a spike in Network Growth indicates that a project is gaining considerable traction.\n\nAt the same time, ETH’s liquid supply sank to new depths. Indeed, the supply on centralized exchanges was just 8.38% of the total circulating supply as of press time, the lowest since ETH started to move between public hands.\n\nThe fall in exchange supply meant that there was no imminent sell pressure on ETH’s price.\n\nAs things stand, ETH has nearly recouped all the losses made since the market crash in August. Santiment futher noted that if the network continues to grow steadily, and exchange supply falls further, there were strong chances of ETH breaching $2000 in the near future.\n\nETH whales step up their game\n\nMeanwhile, the price rise grabbed the interest of whale investors. Transactions worth more than $1 million in ETH jumped 37% on 1 November. Notably, this was one of the largest single-day spikes in whale transfers over the last three months.\n\nDerivatives market gives bullish signals\n\nThe shift in ETH’s market structure was reflected in the derivatives sectors as well. Open Interest (OI) in ETH futures contracts rose to $5.36 billion, the highest since 17 August, according to Coinglass.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nThe steady upward trajectory of OI, coinciding with a jump in price, implied that new money was coming into the market at press time.\n\nFurthermore, ETH’s funding rates across most exchanges were positive, meaning long traders paid fees to short traders. When funding rates are positive and increase over time, it’s a strong indicator of a bullish market."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8wMi9zdGdhbGxlci1rYW50b25hbGJhbmstd29ya3Mtd2l0aC1zZWJhLWJhbmstdG8tb2ZmZXItc3dpc3MtY3VzdG9tZXJzLWJpdGNvaW4tZXRoZXJldW0v0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzAyL3N0Z2FsbGVyLWthbnRvbmFsYmFuay13b3Jrcy13aXRoLXNlYmEtYmFuay10by1vZmZlci1zd2lzcy1jdXN0b21lcnMtYml0Y29pbi1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "St.Galler Kantonalbank Works With SEBA Bank to Offer Swiss Customers Bitcoin, Ethereum - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTEvMDIvZ29vZ2xlLXRyZW5kcy1yZXZlYWxzLWdyZWF0ZXItZW50aHVzaWFzbS1hbW9uZy1hbWVyaWNhbnMtZm9yLXhycC1vdmVyLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "XRP Google Searches on Rise: Google Trends Reveals Greater Enthusiasm Among Americans for XRP Over Ethereum - The Crypto Basic",
        "content": "Data has shown that Americans are exhibiting a greater degree of enthusiasm toward XRP compared to Ethereum (ETH).\n\nSpecifically, Google Trends data reveals that XRP commands a significantly higher search volume among Americans than ETH and blanket terms like ‘cryptocurrency.’ Over the past 30 days, XRP consistently ranked higher in search volume by a considerable margin.\n\nGoogle search volume for XRP from the United States peaked on October 24. Interestingly, the date coincided with when the firstborn crypto, Bitcoin, broke out significantly from its passive trend to over $34k for the first time in more than 15 months.\n\n- Advertisement -\n\nOrdinarily, crypto enthusiasts would expect that ETH, the closest rival to Bitcoin, would have taken the spotlight as Bitcoin led the market.\n\nHowever, such a scenario failed to materialize. Instead, XRP emerged as the center of attention, with more people from the U.S. showing interest in the asset, as evidenced by Google search data.\n\nFurthermore, Google Trend data indicates that the interest of Americans in XRP is evenly distributed rather than concentrated in a few specific regions across the country. As depicted in the map below, more than 90% of Americans are interested in XRP than Ethereum.\n\nNotably, the regions in the United States leading the ranking of XRP search volumes include Iowa, West Virginia, Louisiana, Montana, and Delaware. Moreover, XRP similarly trumped Ethereum in search interest year-to-date (YTD).\n\n- Advertisement -\n\nXRP and Ethereum Search Interest Worldwide\n\nWhile XRP defeated Ethereum in search interest from Americans, both in the last 30 days and YTD metrics, the battle becomes close on a worldwide scale.\n\nGlobally, the search interest for XRP and Ethereum has been neck and neck in the last 30 days, with no decisive winner. However, when delving into regional breakdowns, it becomes evident that more countries exhibit interest in XRP than Ethereum.\n\nThe regions with the highest search volume for XRP include Japan, South Africa, the Philippines, the United Kingdom, and Australia. Meanwhile, on a YTD scale, Ethereum slightly towers above XRP despite ETH being about seven times bigger than XRP in market valuation."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9kaXNuZXktc3F1YXJlLWJhY2tlZC1nYW1lcy10YXAtMTYwMDAwMjgyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Disney And Square-Backed Games Tap Immutable And Polygon For Ethereum Scaling - Yahoo Finance",
        "content": "Immutable, a gaming-focussed Ethereum scaling team, said it is receiving a flurry of interest web3 games seeking to launch on its upcoming Polygon-powered Layer 2 rollup, Immutable zkEVM, ahead of its mainnet launch early next year.\n\nAnnounced on Nov. 2, the three new titles include Sailwars, a multiplayer strategic war game backed by Disney China and Alibaba Cloud among 27 investors. At least a dozen game developers have now committed to building on Immutable zkEVM.\n\n“We’re delighted to announce that these exciting new titles have already recognized the immense potential of [zero-knowledge] technology, choosing it to power the next phase of their development.” said Andrew Sorokovsky, VP of Global Business Development at Immutable. “Based out of Australia and Asia, these visionary teams align perfectly with Immutable's strategic focus.”\n\nImmutable’s IMX token is up 8.6% in the past 24 hours.\n\nThe news comes as GameFi tokens recently began staging a comeback.\n\nIn the past fortnight, IMX gained 30%, SAND rallied 31%, GALA gained 52%, and Axie Infinity’s AXS and SLP tokens added 36% and 92% to their value respectively, according to CoinGecko. For comparison, BTC and ETH are up 24% and 18% respectively over the same period.\n\nImmutable zkEVM will also onboard GensoKishi Online, a metaverse-based reimagining of the popular Elemental Knights Online title — which won awards in Taiwan and garnered 8M downloads to-date.\n\nGensoKishi recently began collaborating with Symbiogenesis, the NFT art project of major Japanese game developer, Square Enix.\n\nFinally, Cursed Stone is a 3D open world web3 MMORPG offering players unique and upgradable NFTs they can equip on in-game characters. In-game NFTs can be freely traded between users, providing the recipient with all items and unlockables associated with the asset.\n\nImmutable outlined its mainnet launch roadmap for its zkEVM network in a blog post last month, tipping a public deployment for the end of January.\n\nTo continue reading this as well as other DeFi and Web3 news, visit us at thedefiant.io"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdGhlZGVmaWFudC5pby9ldGhlcmV1bS1tYWlubmV0LXJlY2xhaW1zLWRvbWluYW5jZS1mcm9tLWxheWVyLTJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 11:17:27 GMT",
        "title": "Ethereum Mainnet Reclaims Dominance From Layer 2s - The Defiant - DeFi News",
        "content": "L2 throughput sinks 32% in six weeks\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nEthereum is reclaiming dominance relative to its Layer 2 ecosystem, with the daily activity on L2s falling by one-third in the last six weeks.\n\nAccording to L2beat, combined Layer 2 throughput is down 32% since peaking at 64.2 transactions per second (TPS) on Sept. 14, currently sitting at 43.8TPS. For comparison, Ethereum averages 12.6 TPS, a 1.6% increase over the same period.\n\nEthereum posted a brief spike to 18.8 TPS on Sept. 13 — buoyed by users bridging assets over to Base — but has consistently trended near 12 TPS throughout 2023.\n\nDaily TPS for Ethereum mainnet (blue) and Layer 2s (Red). Source: L2beat.\n\nL2 hype dies down\n\nMuch of the Layer 2 drawdown can be attributed to freshly deployed networks experiencing a retraction in activity after an initial wave of hype and incentives.\n\nThe initial frenzy of activity on Base, Coinbase’s OP Stack-based L2, has well and truly died down following its August mainnet launch. Base is now processing just at 3 transactions per second, down from 21.3 TPS on Sept. 14.\n\nZkSync Era’s throughput has slumped 50% since peaking at 15.2 TPS on Aug 26, despite Era now leading the Layer 2 sector by activity. Starknet is also down 53% from its Sep. 9 high at 4.7 TPS.\n\nThe top L2s by total value locked, long-standing incumbents Arbitrum and Optimism, suffered similar retracements. Arbitrum closely follows ZkSync Era with 7.3 TPS, down from a record high of 31.6 TPS amid the airdrop for its ARB token in March.\n\nThe OP Mainnet currently sits at 2.5 TPS, down from 10.4 in late July. However, the OP Labs team has since shifted its focus to supporting other L2s, including Base, with its OP Stack.\n\nDespite the pull-back, Ethereum’s Layer 2 project is emerging has succeeded in its mission.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nLayer 2 networks are driving more than 4.6 times as much activity than Ethereum’s base layer, meaning Ethereum’s ecosystem is facilitating far greater throughput at a fraction of the cost compared to before its L2 sector took off."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vYW5hbHlzdC13aHktZXRoZXJldW0tdW5kZXJwZXJmb3JtaW5nLWJpdGNvaW4v0gFXaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9hbmFseXN0LXdoeS1ldGhlcmV1bS11bmRlcnBlcmZvcm1pbmctYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Analyst Reveals Why Ethereum Is Underperforming Against Bitcoin - NewsBTC",
        "content": "Ethereum has been notably underperforming Bitcoin through this latest rally. Here’s why this is so, according to a CryptoQuant analyst.\n\nEthereum Net Taker Volume Has Been Mostly Negative Recently\n\nIn a new post on X, CryptoQuant Netherlands community manager Maartunn has pointed out what the “net taker volume” for Ethereum is looking like.\n\nThe net taker volume here is an indicator that keeps track of the difference between the taker buy volume and taker sell volume on the Bitcoin futures market.\n\nWhen the value of this metric is positive, it means that the taker buy volume is dominating the taker sell volume right now. Such a trend implies buying pressure may be strong in the market currently.\n\nOn the other hand, negative values could suggest the presence of a bearish sentiment among the investors, as selling pressure is higher than the buying pressure.\n\nNow, here is a chart that shows the trend in the 30-day moving average (MA) Ethereum net taker volume over the past few years:\n\nLooks like the 30-day MA value of the metric has been near the neutral mark in recent days | Source: @JA_Maartun on X\n\nAs displayed in the above graph, the Ethereum net taker volume has been mostly negative during the past few months, implying that sentiment around the asset has remained bearish.\n\nBitcoin, on the other hand, has enjoyed periods where the taker buy volume has surpassed the taker sell volume, as the chart shared by the analyst a few days back showed.\n\nThe 30-day MA value of the indicator seems to have been green in the last few weeks | Source: @JA_Maartun on X\n\nMost notably, the net taker volume of Bitcoin is significantly positive right now, suggesting the strong buying pressure present in the market. Unsurprisingly, BTC’s sharp rally has come alongside these positive values of the metric.\n\nEthereum has no such buying pressure present at the moment. Maartunn believes this is why the ETH price has been performing considerably poorly against BTC recently.\n\nEthereum Has Still Not Touched The Highs Set Earlier In The Year\n\nEthereum’s underperformance against Bitcoin is easily visible in the asset’s year-to-date chart.\n\nETH has enjoyed some rise during the past month | Source: ETHUSD on TradingView\n\nAt the same time as Bitcoin observed its rally off the back of the highly positive net taker volume, Ethereum also saw a surge of its own. This rise, though, has been nowhere near as sharp as that of the original cryptocurrency, as ETH is still just trading around $1,800, which is notably less than the top of around $2,100 that the asset set back in April.\n\nNot only has Bitcoin surpassed the $31,000 top it set back in July, it has also done so in spectacular fashion, as it’s now trading above the $34,000 level, which is significantly higher.\n\nIf the net taker volume is anything to go by, the second largest cryptocurrency may continue to underperform versus the largest, so long as investor sentiment around it remains negative.\n\nFeatured image from DrawKit Illustrations on Unsplash.com, charts from TradingView.com, CryptoQuant.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tYmVhcnMtZ2Fpbi1uZXctd2VhcG9uLXdpdGgtZmlyc3QtZXRoLXNob3J0LWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Ethereum bears gain new weapon with first ETH short ETF - Finbold - Finance in Bold",
        "content": "Amidst ongoing speculation about the potential approval of the first-ever spot Bitcoin (BTC) exchange-traded fund (ETF) by US regulators, the world of cryptocurrencies has witnessed a significant development.\n\nNotably, ProShares has introduced the first ETF that offers investors the opportunity to take a bearish stance on Ethereum (ETH), the second-largest cryptocurrency by market cap, Reuters revealed on November 2.\n\nHow does it work?\n\nProShares, a leading issuer of ETFs, is launching a ‘ProShares Short Ether Strategy’ – an Ether futures ETF designed to deliver the inverse of the daily performance of the Standard & Poor’s CME Ether Futures Index.\n\nPut simply, if the index drops 3%, the ProShares’ ETF will strive to return 1%.\n\nIt is important to note that this is not an ETF tied to Ether’s spot price. Instead, it works like the majority of other crypto ETFs available in the US, focusing on futures contracts on the second-biggest crypto asset.\n\nThe move comes, roughly a month after a batch of first Ether ETFs debuted. Out of a total of nine funds that were launched in early October, three of them belong to ProShares. However, unlike its previous two that combine exposure to both Ether and Bitcoin, the newest one provides investors with exposure to ETH only.\n\nTepid debut\n\nIn contrast to its previous two funds, the launch of the ProShares Short Ether Strategy failed to attract as much attention on its first day. For comparison, the ProShares Bitcoin Strategy saw an influx of $1 billion in assets within its first couple of days, while the largest of the new Ether futures ETFs is yet to clock $10 million in assets.\n\nProShares CEO Michael Sapir said the new inverse Ether investment vehicles are meant “to address the challenge of acquiring short exposure to ether, which can be onerous and expensive.”\n\nThe company also launched an inverse Bitcoin ETF, which currently manages around $74 million in assets.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzAxL2V0aGVyZXVtLWV0aC1yaXZhbC1jYXJkYW5vLWFkYS1oaXRzLW9uLWNoYWluLW1pbGVzdG9uZS1hcy1vbGQtd2FsbGV0cy1zdGFydC10by1tb3ZlLXNhbnRpbWVudC_SAYMBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMDEvZXRoZXJldW0tZXRoLXJpdmFsLWNhcmRhbm8tYWRhLWhpdHMtb24tY2hhaW4tbWlsZXN0b25lLWFzLW9sZC13YWxsZXRzLXN0YXJ0LXRvLW1vdmUtc2FudGltZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Rival Cardano (ADA) Hits On-Chain Milestone As Old Wallets Start To Move: Santiment - The Daily Hodl",
        "content": "New data from market intelligence firm Santiment shows that Ethereum (ETH) competitor Cardano (ADA) just hit a major milestone.\n\nIn a new post on the social media platform X, the crypto analytics firm says that long-time ADA holders have suddenly started moving the largest amount of tokens in more than a year.\n\nThe firm also noticed that deep-pocketed Cardano holders aggressively accumulated nearly 44 million ADA tokens worth about $12.67 million in just two weeks.\n\n“Cardano has hit a major dormant coin activity milestone. Monday marked the highest amount of older wallets moving ADA since April 2022, indicating more coins are moving back into circulation. 100,000-10,000,000 ADA wallets are also accumulating again.”\n\nCardano is trading for $0.29 at time of writing.\n\nThe firm also says that Ethereum’s upward momentum is strengthening based on key indicators, including a decline in supply held on crypto exchanges.\n\n“ETH’s supply on exchanges saw a decent drop as price rocketed, suggesting that investors’ confidence have increased and are buying to hold.”\n\nSocial dominance, which tracks the percentage of discussion about a crypto asset circulating on social media platforms, is heating up for ETH as well. According to the firm, traders are starting to take notice of ETH.\n\n“ETH’s social dominance continues to grow as price moves upwards but it still remains lower than the previous peak, which may suggest there can be some room for it to go before things cool down. Excitement is certainly building up.”\n\nEthereum is worth $1,809 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLTEwLWJpbGxpb24tdHJhZGluZy12b2x1bWUtZmxvb2RzLWluLWFyZS13aGFsZXMtYnV5aW5nLWFnYWluLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction as $10 Billion Trading Volume Floods In – Are Whales Buying Again? - Cryptonews",
        "content": "Ethereum Price Prediction as $10 Billion Trading Volume Floods In – Are Whales Buying Again?\n\nThe Ethereum price has held still over the past 24 hours, with the altcoin struggling to rise above the $1,800 level.\n\nAt $1,803, ETH is now 2% up in a week and 14% up in a fortnight, with the market’s biggest altcoin also having risen by 50% since the beginning of the year.\n\nAnd with its 24-hour trading volume remaining high at $10 billion, there’s enough underlying activity to cause another rise in the coming days.\n\nEthereum Price Prediction as $10 Billion Trading Volume Floods In – Are Whales Buying Again?\n\n\n\nEthereum’s chart continues to look promising, in that its technical indicators lean more towards further gains than losses right now.\n\nFor instance, its 30-day average (yellow) is rising strongly towards its 200-day average (blue), a sign that more price gains will come as the shorter term indicator climbs over its longer term counterpart.\n\nETH’s relative strength index (purple) is also looking good, having kept around the 70 level for over a week now.\n\nWhat this indicates is that buying pressure is still with Ethereum, which could therefore see further gains in the near term.\n\nThe coin’s 24-hour trading volume supports this view, with it remaining just above $10 billion, compared to around $5 billion a week ago.\n\nThis suggests that whales remain interested in ETH, which has seen several transfers to exchanges in the past couple of days.\n\nWhile the Ethereum price has struggled to crack the $1,850 resistance level (red) in the past few days, it also looks like its support level (green) is holding up nicely, so significant falls aren’t likely.\n\nIt had risen in the context of increasing positivity regarding Bitcoin ETF applications, yet its strong fundamentals also mean it should recover soon.\n\nIndeed, its total value locked in accounts for more than half of the entire crypto sector, while it has celebrated a number of high-profile adoptions this year, including PayPal and Coinbase.\n\nSuch developments bode very well for its future, while it also needs to be remembered that Ethereum has had a deflationary tendency ever since its shift to proof-of-stake last year.\n\nAs such, the Ethereum price is likely to reach $1,900 in the next few weeks, with the formal approval of Bitcoin ETFs potentially helping it reach $2,500 in the first couple of months of 2024.\n\nHigh-Potential Alternatives\n\n\n\nProbably the only downside with Ethereum is that, as a well-established token, it may not rise as aggressively as other, newer coins.\n\nTraders looking for quicker above-average profits may therefore prefer to look elsewhere, with several promising alts holding their presales right now.\n\nPossibly the most promising of these is Bitcoin Minetrix (BTCMTX), a tokenized cloud mining platform that has already raised more $2.9 million in its presale.\n\nChoosing #BitcoinMinetrix for effortless mining! 💎 Through cloud mining, bid farewell to worries about reselling equipment.#BTCMTX handles upgrades, enabling users to focus on their $BTC journey without the hassles of outdated hardware. ⚙️ pic.twitter.com/eT3BGAq4Wu — Bitcoinminetrix (@bitcoinminetrix) October 31, 2023\n\nThis figure suggests plenty of market confidence in Bitcoin Minetrix, which will enable users to mine Bitcoin (BTC) by staking its native token, BTCMTX.\n\nBy offering a stake-to-mine platform, Bitcoin Minetrix aims to widen access to Bitcoin mining, with the staking of BTCMTX providing users with tokenized mining credits in returns.\n\nUsers can then use these credits to buy Bitcoin hashpower, which can earn them newly minted BTC in exchange.\n\nStakers of BTCMTX will also receive new BTCMTX as well, making the token potentially very lucrative.\n\nThis perhaps explains why its presale has already done so well, with new buyers able to join the sale by going to official Bitcoin Minetrix website.\n\nEmbarking and discovering the ease of #Bitcoin cloud mining with #BitcoinMinetrix! 🚀⛏️ ✨ Perfect entry point for beginners.\n\n💸 Cost-effective, no equipment expenses.\n\n🏠 Say goodbye to space, noise, and heat worries.\n\n🔁 Effortless, seamless upgrades. pic.twitter.com/PvmKeOweCY — Bitcoinminetrix (@bitcoinminetrix) October 31, 2023\n\nBTCMTX will have a capped supply of four billion tokens, with 1.4 billion going to the presale and another 10% going to community rewards.\n\nIts sale will have ten stages in total, with 1 BTCMTX currently costing $0.01130, although this will rise to $0.01190 by the final stage.\n\nAs for where the price could end up in the future, Bitcoin Minetrix’s originality as a platform could help it climb much higher, making its early investors a big profit.\n\nVisit Bitcoin Minetrix NowDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vdGhlbWVya2xlLmNvbS9ldGhlcmV1bXMtcG9zaXRpdmUtdHJlbmQtYW4taW5jcmVhc2UtaW4tbmV3LWFkZHJlc3Nlcy1hbmQtYS1kZWNsaW5lLWluLWV4Y2hhbmdlLXN1cHBseS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum's Positive Trend: An Increase In New Addresses and A Decline In Exchange Supply - The Merkle Hash",
        "content": "About The Author\n\nWill is a News/Content Writer and SEO Expert with years of active experience. He has a good history of writing credible articles and trending topics ranging from News Articles to Constructive Writings all around the Cryptocurrency and Blockchain Industry."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wMi9za3licmlkZ2UtY2FwaXRhbHMtYW50aG9ueS1zY2FyYW11Y2NpLXNheXMtYml0Y29pbi1hbmQtb25lLWV0aGVyZXVtLXJpdmFsLWhhdmUtYm9vc3RlZC10aGUtZmlybXMtcmV0dXJucy_SAY4BaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMDIvc2t5YnJpZGdlLWNhcGl0YWxzLWFudGhvbnktc2NhcmFtdWNjaS1zYXlzLWJpdGNvaW4tYW5kLW9uZS1ldGhlcmV1bS1yaXZhbC1oYXZlLWJvb3N0ZWQtdGhlLWZpcm1zLXJldHVybnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "SkyBridge Capital’s Anthony Scaramucci Says Bitcoin and One Ethereum Rival Have Boosted the Firm’s Returns - The Daily Hodl",
        "content": "The founder of SkyBridge Capital says that Bitcoin (BTC) and one Ethereum (ETH) competitor have helped the firm see strong returns on its investments.\n\nIn a new interview on Bloomberg Television, Anthony Scaramucci says that October 2023 was the best month SkyBridge Capital has had on record due to BTC and smart contract platform Solana (SOL) rebounding.\n\n“We’re on a good run right now. The month of October [has] probably been the best month in SkyBridge’s history for that matter. A lot of it is Bitcoin, some of it is tech, some of it is [a] newer economy – things that have rebounded aggressively since the beginning of the year. But of course, Bitcoin has had a spectacular month.\n\nYou know, we own a lot of Solana. I think Solana is probably up 70% this month. And so this is just another explanation [for] people stay in things, stay convicted. Don’t listen to the chin music throughout the day, but have a very long-term focus on what you’re doing. We never sold a Bitcoin. In fact, if anything, we accumulated Bitcoin this year at lower prices and it served us and our clients well.”\n\nScaramucci goes on to say that SkyBridge would “love” to buy back the 30% stake of the company purchased by bankrupt crypto exchange FTX in 2022.\n\n“We would love to buy the stake back. Of course, we were defrauded by that company FTX. And so we have issues with that transaction. We’d like to get the stake back. They’re not ready to transact with us. We’ve reached out to them many times. There’s only so much we can do.”\n\nBitcoin is trading for $34,553 at time of writing while SOL is moving for $45.20, a 25% increase on the day.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2V0aGVyZXVtLW5ld3MvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hbmFseXN0LXJldmVhbHMtd2hlcmUtZXRoLXdpbGwtYmUtYnktZW5kLW9mLTIwMjMtMi_SAXdodHRwczovL3d3dy5uZXdzYnRjLmNvbS9ldGhlcmV1bS1uZXdzL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYW5hbHlzdC1yZXZlYWxzLXdoZXJlLWV0aC13aWxsLWJlLWJ5LWVuZC1vZi0yMDIzLTIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Analyst Reveals Where ETH Will Be By End of 2023 - NewsBTC",
        "content": "Prominent cryptocurrency analyst Dmitry Noskov from the European-based trading platform StormGain has recently shed light on his predictions concerning Ethereum (ETH) and has revealed where the digital asset ought to be by the end of the year.\n\nDmitry Noskov On Ethereum (ETH) Price Movement\n\nThe crypto analyst predictions were fueled by the current growth of the cryptocurrency market due to the forthcoming Bitcoin halving in 2024. He highlighted that the market growth will continue to grow till the end of the year, and Ethereum is set to grow with it.\n\n“We can say that the cryptocurrency market is now on a wave of growth, which may continue until the end of the year. The target for Ethereum before the new year may be $1800-$1900. It can also break the psychological level of $2,000,” Noskov stated.\n\nDmitry’s recent ETH predictions can also be traced back to the excitement and propaganda from the cryptocurrency community and the positive development encompassing a potential approval of Spot Bitcoin exchange-traded fund (ETF).\n\n“The positive developments around the potential approval of a Bitcoin (BTC) spot exchange-traded fund (ETF) have boosted other cryptocurrencies, including ETH,” Noskov stated.\n\nDmitry Noskov is not the only one who has shared projections on the price of Ethereum by the end of the year. Several other analysts have also shed light on their optimism about how Ethereum is expected to finish the year.\n\nIn July, finance platform Finder sought 32 fintech and cryptocurrency analysts for them to offer their year-end price predictions for Ethereum. From the details shared with Finbold, the experts believe that the digital asset will finish the year at $2,451, presenting over 30% price surge from the current price of Ethereum.\n\nThe future predictions for Ethereum were much more promising. Specifically, the experts predict that ETH will reach $5,845 by the end of 2025.\n\nOne of the finance experts Mitesh Shah, Chief Executive Officer and founder of Omnia gave his end-of-year predictions for Ethereum, which appeared to be in check with the panel’s consensus projections. Shah also believes that the digital asset is the exceptional second choice of investment for institutional and ordinary investors alike.\n\n“Ethereum remains the standout second choice investment for both the retail and institutional investors alike. Following the successful upgrade to proof of stake, akin to “changing a jet plane engine, mid-flight,” ETH has become more efficient and deflationary, to mention a few,” Shah stated.\n\nLately, the cryptocurrency has garnered momentum, slowly heading toward the $1850 resistance level. The digital asset is set to go higher if it crosses the $1850 resistance level. Ethereum is currently sitting at approximately $1797 as of the time of writing.\n\nFeatured image from Seeklogo, chart by Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi10b3BzLTM1NTAwLWV0aGVyZXVtLWJlbG93LTE5MDAtYWx0Y29pbnMtcmFsbHktdXAtdG8tMTEtNDA0MjM4LTIwMjMtMTEtMDLSAZcBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3Rva2VuL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXRvcHMtMzU1MDAtZXRoZXJldW0tYmVsb3ctMTkwMC1hbHRjb2lucy1yYWxseS11cC10by0xMS00MDQyMzgtMjAyMy0xMS0wMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin tops $35,500; Ethereum below $1,900; Altcoins rally up to 11% - Business Today",
        "content": "Bitcoin and other crypto tokens continued their bullish momentum on Thursday as the oldest crypto asset hit 17-month high after Fed's dovish tone. Crypto tokens posted big gains following the completion of one year of Sam Bankman-Fried's crypto empire- FTX exchange.\n\n\n\nBitcoin continued to remain firm as the largest crypto token surged more than 3 per cent and managed to race-past strongly above 35,500-levels. However, its largest peer, Ethereum, was also seen about 3 per cent up but remained below $1,900-level. Majority of the altcoins were trading with sharp gains.\n\n\n\nBitcoin's price rose to trading above the $35,500 threshold after the U.S. Federal Reserve's Federal Open Market Committee (FOMC) confirmed the anticipated interest rates. This announcement has infused the market with optimism, leading to a steady rise in Bitcoin's price over the past day, said Edul Patel, Co-founcer and CEO at Mudrex.\n\n\n\nBarring the US dollar pegged USD Coin, all of the majority of top crypto tokens were trading sharply higher on Thursday. Solana surged more than 11 per cent, while Polygon was up 8 per cent. Cardano and Polkadot jumped 7 per cent, and Chainlink and Tron gained about 4 per cent each in the early trade.\n\n\n\nThe global cryptocurrency market cap was trading significantly higher, rising up to $1.32 trillion-mark, as it jumped more than 3 per cent in the last 24 hours. However, the total trading volumes surged about 43 per cent to $57.45 billion.\n\n\n\nThe crypto market reacted positively to the unchanged interest rates by the Federal Reserve, pushing the global crypto market cap up by over to around $1.35 trillion. The top 20 cryptos are currently trading in the green, said Parth Chaturvedi, Investments Lead, CoinSwitch Ventures\n\n\n\n\"Despite a strong investor sentiment, amongst the top losers was SafeMoon (SFM) which is down by over 50% in the last 24 hours. The decline, however, comes as the company’s CEO and CTO have been taken into custody for fraud. The defendants are now facing criminal charges,\" he said.\n\n\n\n\n\nTech View by WazirX Trade Desk\n\nSolana(SOL), is an open-source project that leverages the unrestricted nature of blockchain technology and offers decentralized finance (DeFi) solutions. Solana was formally introduced in March 2020 under the stewardship of the Solana Foundation, headquartered in Geneva, Switzerland.\n\n\n\n\n\nOn the daily time-frame, the SOL/USDT chart had been traversing within an ascending channel pattern. The trend has broken above the upper trendline with a significant momentum in price. The RSI indicates that the token is in the oversold zone, however we expect the momentum to continue into the coming week. The next resistance is expected at 48.6 USDT and an immediate support is expected at 38 USDT.\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1jb2ZvdW5kZXItdml0YWxpay1idXRlcmluLW1vdmVzLWxhcmdlLWV0aC1jaHVuay10by1jb2luYmFzZdIBWGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1jb2ZvdW5kZXItdml0YWxpay1idXRlcmluLW1vdmVzLWxhcmdlLWV0aC1jaHVuay10by1jb2luYmFzZT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Cofounder Vitalik Buterin Moves Large ETH Chunk to Coinbase - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBlockchain sleuth account on X app @OnchainDataNerd has reported that it had noticed another piece of ETH sent by Ethereum co-creator Vitalik Buterin to the largest crypto exchange in the US — Coinbase.\n\nButerin keeps depositing ETH to Coinbase\n\nThis is not the first sale of ETH Buterin has made this year so far. He has been sending ETH not only to Coinbase but also to Bitstamp platforms. Previously, as reported by U.Today, he moved a substantial chunk of his brainchild crypto to Coinbase at the end of September this year.\n\n2 hours ago, Vitalik Buterin deposited 100 $ETH ($181K) to #coinbase at $1810. pic.twitter.com/vsEyN7sbbV — The Data Nerd (@OnchainDataNerd) November 1, 2023\n\nButerin has been selling ETH in small portions — 400 ETH on Coinbase in September — and he has moved 100 ETH there now. According to the aforementioned source, Vitalik sold 100 ETH for $181,000 at the price of $1,810 per coin.\n\nIn August this year, Buterin deposited approximately 600 ETH (worth roughly $1 million) to Coinbase. On Oct. 7, he moved 1,000 ETH to the Bitstamp exchange and sold it for roughly $1.64 million. Overall, Buterin's wallet transferred 4,400 ETH to that centralized crypto exchange in September and October, per data shared by \"Smart Money\" tracker @lookonchain. This amount of ETH is the equivalent of approximately $7.23 million.\n\nZero impact on Ethereum price\n\nToday's ETH transaction to Coinbase made by Buterin and the likely sale that followed have not had any visible impact on the price of the second-largest cryptocurrency, Ethereum.\n\nSince Oct. 24, after experiencing a peak of 12.87% rise within 48 hours, when ETH surged to $1,848, Ethereum has lost 2.3% in total, still trading above the $1,800 price level.\n\nIn late October, the above-mentioned source reported that several new wallets made a remarkable ETH purchase on exchanges as they withdrew 47,760 ETH worth $82.97 million at that time to their cold wallets.\n\n$8,000 prediction for Ethereum\n\nAs reported by U.Today recently, global banking giant Standard Chartered stated that they expect Ethereum price to spike up to $8,000 within the next couple of years.\n\nThe grounds for making this bold prediction were the leading role of the Ethereum blockchain in the world of smart contracts, gaming, DeFi and the tokenization of traditional assets.\n\nAlso, recently, several large fund managers submitted filings to the U.S. regulatory agency, the SEC, to get permission to launch Ethereum spot ETFs. Many market players expect that should they be approved, the ETH price may skyrocket. So far, the SEC has around a dozen filings for Bitcoin spot ETFs under consideration, but Mike Novogratz, head of Galaxy Digital, expects the first BTC ETF to be approved this year."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0tbWF5LWhpdC0yNTAwLXRoaXMtbm92ZW1iZXItaW52ZXN0b3JzLXJhbGx5LXRvLWlucXViZXRhLXByZXNhbGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum May Hit $2,500 This November; Investors Rally to InQubeta Presale - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nGiven the recent gains made by the cryptocurrency market, analysts are optimistic that its bull run isn’t going to be short-lived. Based on their observations and market indicators, many of them feel that Ethereum can potentially cross $2,500 in November.\n\nExperts are also full of praise for the newly launched decentralized platform InQubeta (QUBE) which has impressed investors with its strong presale performance. The decentralized platform helps startups leveraging artificial intelligence find investors for their projects.\n\nEven though it was rolled out just a few months ago, it is now on every analyst’s best cryptocurrency ICO list after its presale funding hit the $ 4.1 million mark.\n\nInQubeta: Fast-tracking startup growth with blockchain\n\nInQubeta is among the altcoins to watch out for this year as it seeks to disrupt the startup and AI sectors with a dose of DeFi potential. By making a user-friendly DeFi solution more accessible to startups, it ensures that these budding companies don’t have to stall their plans due to lack of funding.\n\nInvestors who back these projects also gain by investing in future-forward projects. Its native cryptocurrency QUBE token is used for all transactions, be it taxes or regular payments.\n\nPowered by the ERC-20 standard, the QUBE token is more than just a cryptocurrency facilitating transactions for a decentralized platform. It’s a mainstay of InQubeta’s governance structure that’s based on the decentralized autonomous organization model. Under the model, community members are consulted on all major decisions, and their views are incorporated for all key protocol changes.\n\nIf a community member has a suggestion that could enhance the capability of the platform, they can forward it as a proposal. While the community discusses the proposal, token holders get the final say if it should be implemented.\n\nAll token holders get voting privileges that they can use during the voting process for a proposal. Using these voting privileges, token holders can act in the best interests of the platform.\n\nThe hype around the QUBE token is understandable when you consider its anti-inflationary character. The token supply is regulated to keep it intentionally scarce so that the asset’s price doesn’t fluctuate much. The feature helps keep token holders’ returns intact when the markets are turbulent or inflation is high.\n\nInQubeta has become one of the best cryptocurrencies to buy in today’s market with its transparent model. Its transparency ensures that startups and investors do not feel short-changed and get a fair deal. Before startups connect with investors, they submit a proposal that contains the reward they are ready to offer the investor.\n\nThese offers are then minted into NFTs and uploaded on InQubeta’s online marketplace. Investors can assess, compare, and buy these NFTs. It’s not necessary that an investor buys the entire NFT, they can also purchase a smaller part of the asset. This is made possible with fractionalization. InQubeta allows even retail users to invest in startups.\n\nEthereum-based spot ETFs may hit the market next: Raoul Pal\n\nEthereum is among the most versatile cryptocurrencies that you can find in today’s market. It powers not just blockchain protocols but dApps, virtual machines, cryptocurrencies as well as NFTs.\n\nEthereum’s key USP is that it’s an entire ecosystem backed by a strong blockchain network with smart contract capability. The use of blockchain for smart contract execution further improves its efficiency. The platform’s native token is called ETH and it is among the most demanded cryptocurrencies in the world.\n\nIt seems it’s not just crypto analysts who are smitten by Ethereum but other experts too. In a recent media interview, macro expert Raoul Pal said it is only a matter of time before Ethereum-based spot ETFs hit the market. He said Ethereum spot ETFs could be seen as ‘trade agreements’ that could fetch great capital returns on investments.\n\nConclusion\n\nWith its ongoing successful run, the crypto market is a happening place with its fair share of cutting-edge financial instruments. As the recent performance of tokens like InQubeta and Ethereum shows, there is no dearth of options for anyone, whether you are an experienced or an amateur investor.\n\nIf you are wondering what cryptos to buy now, then consider the two coins described above as they have strong utilities and are guided by unique ecosystems.\n\nHowever, users must remember that diversification can help in reducing the risk in the long term.\n\nVisit InQubeta Presale"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9yZW5kZXItbmV0d29yay1tb3Zlcy1mcm9tLWV0aGVyZXVtLXRvLXNvbGFuYS1ibG9ja2NoYWluLWluLW1ham9yLXdpbi13aGVyZS1uZXh0LWZvci1zb2wuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Render Network Moves From Ethereum to Solana Blockchain in Major Win – Where Next for SOL? - Cryptonews",
        "content": "Render Network Moves From Ethereum to Solana Blockchain in Major Win – Where Next for SOL?\n\n3D content rendering platform Render Network has relocated from the Ethereum blockchain to Solana in order to benefit from the latter’s high throughput and lower transaction costs.\n\nAs per an update in a blog posted to Medium, the Render Foundation said that it had successfully implemented an upgrade to its core infrastructure to Solana from Ethereum.\n\nRNDR token holders can now migrate their tokens from the Ethereum blockchain to the Solana blockchain using the Upgrade Assistant at upgrade.rendernetwork.com.\n\nThe Render Network is a decentralized global network of GPUs that come together to offer rendering services for 3D content creators.\n\nThe protocol’s foundation said in its blog post that it had set aside up to 1.14 million RNDR tokens worth over $2.6 million at the current price to facilitate the upgrade and cross-blockchain shift.\n\nAccording to the Render Network Foundation, users will be awarded a share of the 1.14 million tokens based on a points system designed to incentivize upgrading as soon as possible.\n\n“Moving Render’s core infrastructure to Solana is a watershed moment that unlocks major new capabilities like real-time streaming and dynamic NFTs,” commented Jules Urbach, the Render Network’s founder.\n\n“Solana’s incredible transaction speeds, low costs, and commitment to web-scale architecture make it a perfect fit for the Render Network as we continue building a scalable and decentralized metaverse infrastructure,” he added.\n\nA Watershed Moment For the Solana Blockchain Too?\n\nThe fact that the Render Network, a protocol boasting one of the crypto industry’s most promising use cases, is moving to Solana is huge news for the blockchain.\n\nThough it saw explosive growth in late 2021 to reach a market cap high of more than $75 billion, as per CoinMarketCap, Solana has largely lived in Ethereum’s shadow for its entire existence.\n\nIts trade value locked was last around $1.7 billion, more than 20x lower than Ethereum’s TVL of more than $60 billion, as per DeFi Llama.\n\nAs recently as last November, analysts had declared the blockchain a failed project thanks to the collapse of a few key protocols running on it that had liquidity ties to failed crypto exchange FTX and its ex-CEO Sam Bankman-Fried (SBF).\n\nSBF had been a big proponent of the blockchain and his also failed hedge fund Alameda had been a major provider of liquidity there.\n\nWhere Next for Solana (SOL)?\n\n\n\nThe fact that major protocols like the Render Network are opting to utilize Solana’s underlying blockchain infrastructure rather than more trusted networks like Ethereum suggests belief in Solana’s future is returning, a bullish sign for the coin.\n\nAs Ethereum continues to struggle with scaling issues (like high fees and slow transactions), rival protocol’s like Solana may continue to steal market share.\n\nSolana’s native SOL token recently vaulted to 14-month highs above $40, and could be in for further swift gains assuming it can break above key resistance around $48.\n\nBut Solana does have one problem.\n\nEthereum layer-2 scaling solutions like Arbitrum, Polygon and Optimism offer equally cheap and fast transactions, but also the underlying security of the older and more widely used Ethereum network.\n\nSolana may struggle to one up these protocols and take a more serious swipe at Ethereum’s market dominance in the space."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbmdhcGUuY29tL3ZpdGFsaWstYnV0ZXJpbi1tb3Zlcy1ldGhlcmV1bS10by1jb2luYmFzZS1ldGgtcHJpY2UtdG8tcmFsbHkv0gFXaHR0cHM6Ly9jb2luZ2FwZS5jb20vdml0YWxpay1idXRlcmluLW1vdmVzLWV0aGVyZXVtLXRvLWNvaW5iYXNlLWV0aC1wcmljZS10by1yYWxseS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "ETH Price Rally: Vitalik Buterin Moves Ethereum To Coinbase, ETH Price To Rally? - CoinGape",
        "content": "The recent move of Vitalik Buterin, transferring 100 Ethereum (ETH) coins to Coinbase has raised eyebrows in the crypto community. The co-founder of Ethereum, Vitalik is known for his transfers to several cryptocurrency exchanges and once again came into light.\n\nOn November 1, Vitalik’s Ethereum transfers to Coinbase were worth around $181,000.\n\nadvertisement\n\nCrypto Community Cryptic About ETH Transfer:\n\nThe move has been taken as a suspicion of something coming up, as Vitalik had previously stated that he had not sold ETH for personal benefit since 2018.\n\nSpeculative about the transaction, a few crypto analysts said that it could be for personal reasons or to fund another project. However, the main reason or truth behind this cryptic transfer of 100 ETH worth $181,000 to Coinbase remains unclear.\n\nFurthermore, it is also not sure if Vitalik will continue to sell his holdings or if this is a one-time event.\n\nRead Also: XRP and Solana Continue to Rally Defying Crypto Market Consolidation\n\nVitalik Clarifies, Says Did Not Sell ETH for Personal Gains:\n\nIn a tweet shared on X, formerly known as Twitter, Vitalik Buterin said, he has not made any transaction with the purpose of business or personal benefits since 2018.\n\nHowever, he further clarified that the move of transferring ETH coins in the past few years is for charity and donations. Vitalik further informed that if there is any information with titles like “Vitalik sends XXX ETH to [exchange]”, it’s not for selling, but always donating to some charity or nonprofit or other projects. Whereas the receiver will eventually make money by selling the ETHs because they have to cover expenses.\n\nMeanwhile, overall, since September 17, 2023, Vitalik Buterin has deposited 3,700 ETH, worth around $6.12M to Bitstamp, Paxos, and Coinbase.\n\nThe Ethereum price traded at $1,804.02, noting a surge of 0.62% over the past 24 hours, while its volume from yesterday fell 13.47% to $6.65 billion. The market cap of the second largest crypto was at $216.90 billion as of writing.\n\nNotably, over the past seven days, the crypto’s price soared nearly 2%.\n\nRead Also: Crypto Prices Today: Pepe Coin Falls, BTC & THETA Boost Market"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wMS90b3AtYW5hbHlzdC1wcmVkaWN0cy1icmVha291dC1yYWxseS1mb3IteHJwLXVwZGF0ZXMtb3V0bG9vay1vbi1zb2xhbmEtYW5kLWV0aGVyZXVtLWJhc2VkLWFsdGNvaW4v0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzAxL3RvcC1hbmFseXN0LXByZWRpY3RzLWJyZWFrb3V0LXJhbGx5LWZvci14cnAtdXBkYXRlcy1vdXRsb29rLW9uLXNvbGFuYS1hbmQtZXRoZXJldW0tYmFzZWQtYWx0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Top Analyst Predicts Breakout Rally for XRP, Updates Outlook on Solana and Ethereum-Based Altcoin - The Daily Hodl",
        "content": "A crypto strategist who accurately called the top of Bitcoin’s (BTC) 2021 bull market is expecting another leg up for XRP.\n\nPseudonymous analyst Pentoshi tells his 706,900 followers on the social media platform X that XRP looks bullish after taking out a key resistance level at $0.548.\n\n“XRP fans.\n\nA breakout above $0.548 should lead towards $0.62-$0.63.”\n\nAt time of writing, XRP is trading for $0.59, up about 3% in the last 24 hours.\n\nThe analyst is also updating his forecast on the layer-1 protocol Solana (SOL). According to Pentoshi, the bulls are already celebrating SOL’s big rallies as of late which tells him that the crypto asset may be close to witnessing a pullback.\n\n“The timeline is getting a little loud on this one. Probably local top soonish, in the purple box.”\n\nLooking at the trader’s chart, he seems to predict that SOL will likely meet resistance at $38.70. At time of writing, SOL is worth $38.59.\n\nAnother altcoin on the analyst’s radar is the governance token of the Ethereum (ETH)-based decentralized finance lending protocol Aave (AAVE). According to Pentoshi, AAVE will see a big breakout rally if it manages to breach resistance at $90.\n\n“This one likely consolidates a bit more. A break above $90 likely brings $112-$115. For now, it’s under resistance that opens that up.”\n\nAt time of writing, AAVE is trading at $81.81.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LnRpZ2h0cG9rZXIuY29tL3doYXRzLXRoZS1iZXN0LWNyeXB0by1mb3ItcGxheWluZy1vbmxpbmUtcG9rZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Best Crypto for Online Poker: Bitcoin, Ethereum, or Stablecoins? - Tight Poker",
        "content": "Of course there’s more than one crypto. Bitcoin is easily the most famous crypto but Ethereum, Solana and USDC all have compelling features for playing online poker.\n\nToday we’ll take a closer look at the most popular coins for online poker and which one might be right for you.\n\nThe Basics\n\nThere’s a decent amount of variety between the different coins you can buy but if you’re using it primarily for online there are some common features you’ll likely prize highly including the following:\n\nAccessibility\n\nThe more exchanges or apps that offer a cryptocurrency the easier it will be for you to buy it. For instance Bitcoin is available on every crypto exchange and many apps like PayPal and Cash app. In addition an online poker site has to have built-in support for accepting the coin of your choice.\n\nReliability\n\nCrypto is already extremely volatile so it’s best to pick the most stable assets (at least for crypto) when picking a coin for online poker use. You’ll want to stick to the top coins by market cap and avoid meme coins that might not even exist in a few years.\n\nSpeed\n\nA faster coin means faster deposits and withdrawals, which is ideal for online poker. This is the one major downside of Bitcoin, which takes minutes or hours to settle. Altcoins can potentially settle in seconds.\n\nThe Easy Choice – Bitcoin\n\nIf you don’t want to spend too much time on researching cryptocurrency then just use Bitcoin.\n\nBitcoin is, by far, the most popular crypto in the world with a market cap that has exceeded a trillion dollars at various times in its existence.\n\nYou’ll find support for Bitcoin and every major exchange as well as payment apps such as PayPal, Venmo or Cash App. In other words: It’s easy to buy.\n\nBitcoin, while still volatile, is significantly less risky than some of the smaller altcoins. It has the most impressive price performance over the longest period of time. Whenever the crypto market moves it tends to be Bitcoin at front and center with other coins playing catch up.\n\nFinally the two major downsides of using Bitcoin for online poker: 1. Bitcoin remains one of the slowest coins with transactions potentially taking hours. 2. It’s not near as stable as stablecoins.\n\nPros\n\nThe most popular crypto in the world.\n\nAvailable everywhere crypto is sold as well as PayPal, Venmo Cash App and more.\n\nExceptional price performance over the last decade.\n\nCons\n\nSlow\n\nPrice still volatile compared to traditional currency or stocks\n\nNot as stable as stablecoins\n\nThe Faster Choice – Ethereum or Other Altcoins\n\nIf you’re not interested in Bitcoin than the next best choice might be Ethereum.\n\nEthereum is the second most popular crypto in the world and it does offer some advantages over the venerable BTC.\n\nFor online poker the biggest reason to use Ethereum over Bitcoin will likely come down transaction speed. Ethereum is 2X to 3X faster than Bitcoin and transactions usually settle in seconds or a couple minutes meaning it’s easy to confirm your online poker deposit.\n\nThe other major feature of Ethereum is that, outside of Bitcoin, it’s probably proven to be the most reliable crypto over the last decade.\n\nThe major downside of Ethereum is that the fees can be quite expensive during peak times on the network. It’s not unheard of for an Ethereum transaction to cost $5-$10 during busy times.\n\nOf course you could pick an altcoins like Solana (SOL) or Avalanche (AVAX) if you want even faster settlement times and cheaper fees but those are significantly less proven than Bitcoin or Ethereum and online poker sites don’t always accept the more obscure coins.\n\nPros\n\nFaster than Bitcoin\n\nAvailable on every major crypto exchange and some apps\n\nUsable for NFTs, Decentralized Finance (DeFi) or Staking\n\nCons\n\nHigh fees\n\nVolatile\n\nNot as available as Bitcoin\n\nThe Stable Choice – Stablecoins\n\nStablecoins might be the best possible choice for online poker if you don’t want to invest in crypto and just want a stable method of deposit and withdrawal. Stablecoins, unlike traditional crypto, are pegged to a real-world asset (such as USD) and always hold their value to that asset.\n\nThere are many different stablecoins — Tether (USDT) and USD Coin (USDC) are the most popular — but the all share similar traits.\n\nStablecoins eschew the volatility of traditional cryptocurrencies like Bitcoin or Ethereum for a completely stable value. Stablecoins work on a variety of different networks including Ethereum, Solana, Avalanche and others and offer extremely fast transactions and extremely low fees.\n\nThe downside of stablecoins is that you will never experience any of that legendary price appreciation of coins like Bitcoin or Ethereum.\n\nOn the other hand, if you’re just looking to play poker than stablecoins might be the best possible choice.\n\nPros\n\nCompletely stable with no volatility\n\nFast transactions with low fees\n\nAvailable on most crypto exchanges\n\nCons\n\nStablecoins never appreciate\n\nMore regulation is coming for stablecoins\n\nNot available on all payment apps\n\nWhat’s the Right Choice for Me?\n\nAt the end of the day only you will know what’s right for you when it comes to picking a cryptocurrency for playing online poker.\n\nBitcoin is probably the most widely accepted and most supported crypto in the world and that makes it an easy choice for poker players.\n\nYou could argue that if you’re only interested in playing online poker and don’t want to speculate on the crypto market than stablecoins like USDC or USDT are actually the best choice.\n\nFinally if you’re really interested in crypto and blockchain technology than you might want to learn about some of the newer coins such as Ethereum, Solana or Avalanche and buy some units of each.\n\nThe only thing we’ll say for sure is that it’s probably a good idea to avoid lesser-known coins for online poker. You can take your chances at the poker tables instead of on risky coins."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RlY3J5cHQuY28vbmV3cy1leHBsb3Jlcj9waW5uZWQ9MzY0MDExJnRpdGxlPWV0aGVyZXVtLWtpbGxlci1zb2xhbmEtaGFzLWxpZmUtaW4taXQteWV0LXByaWNlLXJhbGx5LWFuZC1ncm93aW5nLWRldi1zdXBwb3J0LXN1Z2dlc3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 23:04:22 GMT",
        "title": "News Explorer — ‘Ethereum Killer’ Solana Has Life in It Yet, Price Rally and Growing Dev Support Suggest - Decrypt",
        "content": "Nov 1, 10:51 pm\n\nDecrypt\n\n‘Ethereum Killer’ Solana Has Life in It Yet, Price Rally and Growing Dev Support Suggest\n\nSolana has experienced a significant rally, with a 24% increase in the past 24 hours and nearly 80% growth in the past 30 days. Despite facing challenges such as the FTX debacle and the departure of its showcase NFT project, Solana has continued to attract developers and investors. The narrative surrounding Solana suggests that it has the potential to replace Ethereum due to its faster, more scalable, and cheaper technology."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9hcmJpdHJ1bS1mb3VuZGF0aW9uLWV5ZXMtamFwYW5lc2UtbWFya2V0LWZvci1ldGhlcmV1bS1sYXllci0yLWV4cGFuc2lvbi5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Arbitrum Foundation Eyes Japanese Market for Ethereum Layer 2 Expansion - Cryptonews",
        "content": "Arbitrum Foundation Eyes Japanese Market for Ethereum Layer 2 Expansion\n\nThe Arbitrum Foundation and Fracton Ventures partner to accelerate Ethereum Layer 2 adoption in Japan. / Image by Arbitrum Foundation\n\nToday, the Arbitrum Foundation, an organization dedicated to supporting Arbitrum, an Ethereum Layer 2 network, announced a strategic partnership with protocol studio Fracton Ventures.\n\nThe collaboration seeks to establish Arbitrum’s footprint in Japan, an outcome to be achieved through the launch of Arbitrum Japan, a platform designed to kickstart ecosystem growth and community education initiatives.\n\nCollaboration to Accelerate Blockchain Adoption in Japan\n\nArbitrum Foundation’s Head of Ecosystem Development, Nina Rong, noted the vast potential inherent in the Japanese market in the press release.\n\n“In our collaboration with Fracton Ventures, we feel we are uniquely positioned to reach a new demographic of developers, innovators, and blockchain-curious consumers that haven’t previously been exposed to the benefits of blockchain technology,” she said. “And how Arbitrum has leveraged that tech to become the leading Layer 2 scaling platform throughout the industry.”\n\nIf you don’t want to miss out Arbitrum’s new growth plan with Fracton in Japan 🇯🇵 few accounts you should follow:@Arbitrum_jpn – Arbitrum Japan account@wecandaoit – Fracton, trusted partner in Japan@9dai_5 – fren of da show at Fracton@vvinyll – fren of da show at Fracton — Nina Rong | Arbitrum (💙,🧡) (@nina_rong) September 29, 2023\n\nSiddharth Pillai, Head of Partnerships at Fracton Ventures, expressed confidence in the ability of his organization to successfully deliver the vision of Arbitrum Japan.\n\nPillai noted the untapped potential in the Japanese blockchain sector, which has not experienced a great amount of exposure to leading technology and developer tools. The introduction of Arbitrum Japan, he believes, will provide the opportunity to fully harness the power of blockchain within the region.\n\nThe partnership between the Arbitrum Foundation and Fracton Ventures is set to adopt a two-pronged approach towards achieving its goals. The first aspect involves business development and ecosystem building, while the second focuses on education and community support.\n\nFracton Ventures, operating out of Japan, will utilize its network of experts, investors, and developers in the region to grow the Arbitrum ecosystem in the Japanese market. This will involve fostering collaboration between companies operating in the web2 and web3 spaces and is expected to drive business development.\n\nThe second prong of the strategy involves the expansion of technical education content through Ask-Me-Anything (AMA) sessions and hackathons. University ambassadors and community managers will also be charged with leading activities to promote the adoption of Arbitrum among consumers.\n\nJapan has established itself as a friendly environment for the growth of the crypto industry. Prime Minister Fumio Kishida expressed optimism about the potential of web3 to transform the internet and contribute to societal change during the WebX conference held in July.\n\nArbitrum’s Journey so Far\n\nArbitrum’s journey began with a token airdrop in March 2023, coinciding with the launch of the Arbitrum Foundation. The airdrop saw 1.16 billion tokens made available as a reward for early users of the Layer 2 network, granting them governance powers on the DAO which controls the Arbitrum One and Nova networks.\n\nDespite experiencing some controversy early on, Arbitrum has made important progress, dominating the Ethereum Layer 2 scaling market in terms of total value locked (TVL).\n\nArbitrum L2 TVL Chart by L2Beat\n\nAs of today, Arbitrum boasts a TVL of $5.9 billion across Layer 2 chains, according to L2BEAT, placing it ahead of rivals such as Optimism and Coinbase’s Base.\n\nThe strategic partnership between the Arbitrum Foundation and Fracton Ventures holds great promise for the expansion of the Arbitrum ecosystem in Japan. With the right execution, this collaboration could boost the adoption of blockchain technology in the region, creating new opportunities and expanding possibilities for developers and investors."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vdS50b2RheS9uZXctYXRoLWluLXExLTIwMjQtYW5hbHlzdC1zaGFyZXMtYm9sZC1wcmVkaWN0aW9uLWZvci1iaXRjb2luLWFuZC1ldGhlcmV1bdIBXmh0dHBzOi8vdS50b2RheS9uZXctYXRoLWluLXExLTIwMjQtYW5hbHlzdC1zaGFyZXMtYm9sZC1wcmVkaWN0aW9uLWZvci1iaXRjb2luLWFuZC1ldGhlcmV1bT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "New ATH in Q1, 2024? Analyst Shares Bold Prediction for Bitcoin and Ethereum - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAs the cryptocurrency world remains in a state of perpetual flux, one analyst has recently shared a bold prediction that has piqued the interest of both optimists and skeptics alike. The prediction revolves around the prospect of Bitcoin (BTC) and Ethereum (ETH) reaching new all-time highs (ATHs) by Q1, 2024. While some may see this as an enticing proposition, it is essential to examine the validity of such a forecast by juxtaposing it with historical data and current market sentiment.\n\nAdvertisement\n\nComparing past with future: Drawing parallels with mid-2019 can be a risky approach. The cryptocurrency landscape has evolved immensely since then, with institutional investors taking center stage and governmental regulations becoming more defined. While history might repeat itself, the drivers behind the market movements may vary significantly.\n\n\"Everything else follows\": The assertion that if BTC and ETH surge, the rest will follow might be too simplistic. The digital asset ecosystem now comprises a multitude of coins and tokens, each with its unique use cases, partnerships and technological advancements. While BTC and ETH undeniably hold sway over the market, newer assets like Polkadot, Cardano or even niche NFT-based tokens can exhibit independent behavior.\n\n\"Final wipeout\": The concept of a final wipeout in Q1, 2024, leading to the establishment of higher lows, can be seen as a cautious approach, hinting at a potential bear market. While market corrections are natural, predicting an exact timeframe for such an event is challenging, given the volatile nature of cryptocurrencies.\n\nCurrent narket indicators: Most commonly used market metrics indicate a relatively stable capitalization with a mild upward trend. Volume fluctuations and the Crypto Fear & Greed Index suggest that while there is a mix of optimism and caution, we are far from a state of \"extreme greed\" that typically precedes a sharp correction."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9zb2xhbmEtZXRoZXJldW0tYW5kLWV2ZXJsb2RnZS1wcmljZS1jb21wYXJpc29uLWZvci1xNC0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Solana, Ethereum, and Everlodge: Price Comparison for Q4 2023 - CryptoPotato",
        "content": "Three cryptos, Solana, Ethereum, and Everlodge have stood out in the recent crypto market rally. With the crypto market now in bull territory, all three coins might be in for more gains.\n\nIt’s interesting to take a look at their perspective in the context of a bull market in the last quarter of 2023.\n\nVisit the Everlodge presale and win a luxury holiday to the Maldives\n\nSolana (SOL) Continues Its Uptrend\n\nSolana (SOL), the Ethereum killer, has been gaining a lot of attention lately despite its FTX fiasco in 2022. In the last month alone, its value went up by 50%, catching the interest of the crypto community.\n\nThe Solana price has outperformed most of the crypto market, rallying above $35 in October. What has been the driving force of this upward trend? Analysts explained that more investors have shown interest in Solana again. To back this claim, a report showed that Solana trading volumes reached $1.7 billion. This is the highest value recorded in over 100 days.\n\nIn addition, the SOL price recorded an increase of 80% on the 30-day chart. However, the price of Solana had retracted as some investors cashed out of the recent rally.\n\nEthereum (ETH) Fights at $1,800\n\nEthereum (ETH), the largest altcoin by market capitalization, is under bullish momentum and heading to the $2,000 mark. Ethereum has shown positive momentum in October. On the daily chart, Ethereum’s price has been on a decline since it touched its highest point of $2,141 in April.\n\nHowever, starting from its low point of $1,521 on October 12th, ETH began to climb upward. ETH is currently found at around $1835, up 2.2% in the past 24 hours but down slightly on the weekly chart.\n\nStill, Ethereum technical indicators are bullish. Its RSI is in the overbought position at 74, a sign that the bulls are still in control. Besides, Ethereum has recorded a 3% price increase over the last 30 days.\n\nWhat About Everlodge (ELDG)?\n\nWhile Solana and Ethereum have potential, they depend entirely on the crypto sector. This is not the case with Everlodge. The platform is connected to the crypto market (worth $1.25 trillion) and the real estate sector (worth $280 trillion).\n\nAccording to some analysts, this has made Everlodge a token with interesting potential. It is a platform that is aimed at changing how people invest in real estate. Their plan is to transform valuable properties into digital assets.\n\nThese NFTs will then be divided into smaller portions, each representing a share of property. Unlike other NFTs, the value of these NFTs goes up as the property’s value goes up. As a result, these NFTs can bring in money for NFT holders over the long haul. Additionally, users can choose to sell them whenever they want.\n\nCurrently, Everlodge’s ELDG token is in its sixth presale stage, priced at just $0.023. Meanwhile, the ELDG token has benefits for those who buy it. They include discounts, rewards for staking, VIP membership, and more.\n\nVisit Everlodge\n\nJoin The Everlodge Community\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vdGVjaHJlcG9ydC5jb20vcHJpY2UtcHJlZGljdGlvbi9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWV0aC1uZWFycy0yMDAwLW1hcmstd2hhdC1pcy10aGUtYmVzdC1hbHRlcm5hdGl2ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction as ETH Nears $2000 Mark, what is the Best Alternative? - The Tech Report",
        "content": "Since BTC’s price tested $35,000, the broader cryptocurrency market has been moving positively. The positive sentiment influenced the price of the second-largest crypto asset, Ethereum. Today, ETH is approaching the key level of $2,000.\n\nAs Ethereum edges closer to the $2,000 mark, investors are eager to forecast its future trajectory. The question now is, will ETH hit the price mark soon, or will there be a retracement?\n\nFind out more.\n\nRecent Ethereum Price Action\n\nOver the past 24 hours, as reported by CoinGecko, Ethereum has recorded an increase of almost 3% in its trading session. Despite the volatility in the market, ETH maintained its position as the second-largest crypto asset.\n\nLooking at the longer timeframes, Ethereum exhibits a positive strength likely to persist for some time. Over the last week, ETH has gained slightly, signaling signs of improvement in its performance.\n\nAlso, in its two-week price trend, ETH showcased an even more remarkable growth of 18%. In the past 30 days, ETH has consistently displayed a growth rate of 10.7%, solidifying its status as a key player in the broader cryptocurrency market.\n\nMeanwhile, as of 8:2 a.m. EST on November 2, ETH is valued at $1,830, with a trading volume exceeding $20 billion. Notably, CoinGecko reports a trading volume increase of more than 98% within the past 24 hours.\n\nEthereum Price Analysis: Can ETH Hit the $2,000 Price Mark Soon?\n\nLooking at Ethereum’s chart below, the coin has exhibited bullish momentum since October 19, 2023. This has fueled investor confidence and might continue this way if the momentum is sustained.\n\nCurrently, ETH is trading above a key level that used to be a resistance point but is now acting as support at $1,755. This indicates a positive shift in market sentiment.\n\nFurther, the chart shows that there’s an attempt to break through a strong trendline, which, if successful, could push the price toward $2,000. The coin is trading above the Simple Moving Average (SMA) indicator, further reinforcing the optimistic outlook within the market.\n\nLooking at the MACD indicator, it’s above the signal line with green histogram bars, signaling strong bullish momentum. Additionally, ETH’s Relative Strength Index is at 80, validating the bullish pressure in the market.\n\nThe analysis suggests that considering the current momentum, ETH/USDT might reach $2,000 before the end of the year. However, note that if buyers or investors can’t sustain this momentum, the price may drop towards support levels at $1,531 or potentially even down to $1,359.\n\nSo, while ETH’s price is growing today, there’s a need to consider other analyzing tools before deciding. This is because the crypto market is highly volatile, and several factors can affect the price of an asset.\n\nSignificant ETH Transfers to Exchanges: Implications for Price Behaviour\n\nRecently, Whale Alert reported that there have been large movements of ETH to centralized exchanges (CEX). These transactions have sparked reactions among investors and traders alike.\n\nBased on previous actions, when significant amounts of ETH are transferred to exchanges, it often suggests that either investors are preparing to sell or they are positioning themselves for potential trades or transactions.\n\nAccording to Whale Alert, the first transaction was over $15,000 worth of ETH.\n\nThis amount of ETH was moved to the Gate.io exchange on November 1, potentially indicating a readiness to trade or sell ETH. This increased supply of ETH on the exchange can potentially exert downward pressure on its price as more sellers might enter the market.\n\nFurther, the next transaction was more than 20,000 ETH, which was moved to the Coinbase exchange on November 2. Again, this influx of ETH into the exchange could lead to increased selling pressure, potentially influencing the price.\n\nHowever, these transactions are originating from unknown wallets, which means the intentions behind these movements are not clearly stated. Despite this large ETH movement, Santiment data revealed that since October, there has been growth in new Ethereum addresses.\n\nAccording to Santiment, more than 38,000 new addresses have been created in the network. This shows that investors’ confidence is growing significantly.\n\nImportantly, this could potentially affect Ethereum’s price, driving it up to the $2,000 mark. But while all that remains uncertain, investors could diversify to coins on presale.\n\nEthereum Alternative: Meme Kombat Surges Past $1 Million in Presale\n\nThe new web3 meme project, Meme Kombat, has achieved major success in its presale. This project, inspired by the famous Mortal Kombat franchise, has raised $1 million through the presale of its own $MK token.\n\nTraders are eager to get in before the price goes up in a few hours and before the launch of Meme Kombat’s $MK token staking program.\n\nImpressively, the meme project promises high annual percentage yields (APYs) for early participants. Meme Kombat aims to gather at least $5 million by selling 50% of the $MK tokens, currently priced at $0.1667.\n\nEarn 112 APY Via Meme Kombat Staking Feature\n\n>>>Visit Meme Kombat Presale<<<\n\nMeme Kombat’s staking dashboard is set to launch soon, but the date and time have not been revealed by the team. According to the project’s site, early stakers could earn annual percentage yields (APYs) up to 112%.\n\nInvestors who bought $MK tokens in the presale will automatically be part of Meme Kombat’s staking program, so they’ll start earning rewards immediately. Out of all the $MK tokens available, 30% are reserved for staking and rewards, 10% for community rewards, and 10% for providing liquidity on DEX.\n\nThe founder of the project, Matt Whiteman, also serves as the Chief Operations Officer at North Technologies, a Netherlands-based NFT trading and analytics platform. This further strengthens investor’s confidence in the project.\n\nWith that in mind, interested prospects should visit the project’s website and follow the instructions to purchase the token. Note that you can buy the token with USDT or ETH."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9pbnN0aXR1dGlvbmFsLWZpcm1zLXByb2plY3RzLWV0aGVyLWFzLWNyeXB0by13aXRoLXRoZS1iaWdnZXN0LWdyb3d0aC1vdXRsb29rLXN1cnZleS5odG3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Institutional Firms Project Ether As Crypto with The Biggest Growth Outlook: Survey - Cryptonews",
        "content": "Institutional Firms Project Ether As Crypto with The Biggest Growth Outlook: Survey\n\nGlobal wealth fund managers have backed Ethereum (ETH) as the asset with the highest growth projection despite a slow price increase in recent months, a new survey shows.\n\nA new CoinShares Digital Asset Quarterly Fund survey shows an analysis of market-related activities, regulation, and institutional investment in the ecosystem amongst others.\n\nAccording to the study, big investment firms believe that Ether has the best growth prospects amongst other top coins even as its products record a poor run this year.\n\nOf the 55 participants, 45% viewed ether with the most growth while 39% sided with the market leader, Bitcoin. Solana, which has been described as an institutional investor favorite in terms of related products, notched 6% of the votes.\n\nThis recent survey shows positive sparks around the biggest altcoin following weekly outflows in its investment products earning the tag “least loved altcoin in 2023.”\n\n”Although this sentiment has not been reflected in our fund flows report, which indicates $127 million of outflows this year, taking the place as the most unloved altcoin.”\n\nInvestors eye yield\n\n\n\nMost institutional investors base their analysis on the high rate of validator entry queue due to profits from yields. Ethereum remains the largest decentralized blockchain and with many applications, users stand to gain from its ecosystem.\n\nAlthough this has been popular for years, the ETH Merge one year ago that saw the network transition to a Proof-of-Stake blockchain replacing miners with validators increased talks of wider adoption as investors looked to make more profit.\n\nThis was not reflected in the price of the asset as the asset plunged for most of last year due to wider market factors and slow growth.\n\nBitcoin remained fairly unchanged in terms of outlook despite many analysts describing it as a safe asset in the wake of the recent regulatory onslaught by the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC).\n\nInvestments in Ripple (XRP) have seen growth making up about 14% of the participant choices due to its legal victory over the SEC. Multi-asset positions declined by 6% culminating in outflows of $35 million.\n\nRegulation remains a major concern\n\n\n\nThe recent actions taken by authorities have led to an increase in confidence of some investors although many remain skeptical that overzealous regulators may scare users from the ecosystem.\n\nAccording to the survey, regulators remain a top risk for most fund managers although this quarter recorded a 7% drop in sentiments of a wider government ban. Other risks include accessibility and the general crypto winter.\n\nThe majority of participants delved into the crypto market as a result of the growth of blockchain technology while an increasing number bought assets for speculative reasons and good value.\n\nThe survey was conducted from responses by 58 global asset managers with over $500 billion in assets under management."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLWZvcmVjYXN0LXdpbGwtdml0YWxpay1idXRlcmlucy0xMDAtZXRoLXRyYW5zZmVyLXRvLWNvaW5iYXNlLWFmZmVjdC1ldGhlci_SAXFodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1wcmljZS1mb3JlY2FzdC13aWxsLXZpdGFsaWstYnV0ZXJpbnMtMTAwLWV0aC10cmFuc2Zlci10by1jb2luYmFzZS1hZmZlY3QtZXRoZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Price Forecast: ETH Bears Stop Bullish Party At $1,800 - CoinGape",
        "content": "Ethereum (ETH) price ran out of momentum slightly above $1,800 dampening investor optimism for a run-up above $2,000. While declines have been minor below the immediate support/resistance at $1,800, bulls lack the momentum to resume the uptrend.\n\nMeanwhile, a report of the co-founder of Ethereum, Vitalik Buterin, transferring 100 ETH to Coinbase is raising concerns over the future of the ecosystem, with some expecting headwinds. Chinese reporter was the first to mention the transaction worth around $181,000 at the time of transfer.\n\nadvertisement\n\nThe Vitalik holding address vitalik.eth transferred 100 ETH ($181,000) to Coinbase today. Previously, Vitalik stated that he had not sold ETH for personal benefit since 2018, mainly donating it to a charity or non-profit organization or other projects.https://t.co/jmuDIPOOTM — Wu Blockchain (@WuBlockchain) November 1, 2023\n\nWhy Is Buterin Moving Ethereum\n\nThis is not the first time the co-founder has transferred his Ethereum holdings. He recently addressed similar concerns, saying that he had not sold any Ether since 2018 at least not for business or personal gain.\n\nButerin mainly donates his ETH holdings to charity, non-profit organizations, and other projects.\n\nHowever, the community accepted Buterin’s statement with a grain of salt, with some like @JasonWavesRider (a user on X (formerly Twitter) raising more concerns that something bigger could be coming.\n\nInteresting to see Vitalik moving ETH, especially since he said he hadn't sold ETH for personal benefit since 2018. Wonder what he's up to. #ethereum #vitalikbuterin — Maket Waves Rider (@JasonWavesRider) November 1, 2023\n\nHe may be moving ETH due to personal reasons or it could be that he is financing another project. Either way, the real reason behind these frequent transfers remains unknown.\n\nWhere Is Ethereum Heading Amid Uncertainty\n\nThe uncertainty around the lack of transparency regarding transactions made by Buterin is not helping the token which must regain the ground above $1,800 to ensure investor confidence in the uptrend is not lost.\n\nBased on the Relative Strength Index (RSI) retreating from the overbought region, the price of Ethereum is likely to slide significantly below $1,800. Support at $1,740 may provide the necessary liquidity to create the momentum for a larger breakout toward $2,000.\n\nAs Ethereum rebounds above $1,800 traders will start to identify critical levels such as the descending trendline that stopped the bullish party in October. A successful breakout is needed at this price point to affirm the positive outlook as well as the uptrend.\n\nThe next key level would be the seller congestion at $1,900 which will either pave the way for the climb to $2,000 or delay the breakout for a period of consolidation, not to mention, the possibility of a correction back to $1,800 or a lower support area like $1,740.\n\nRelated Articles"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzAyL3VwLTI2NS10aGlzLXllYXItY2FuLXNvbGFuYS1yZWdhaW4taXRzLWFsbC10aW1lLWhpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Up 300% This Year, Can Solana Regain Its All-Time High of $260? - The Motley Fool",
        "content": "Solana (SOL -1.04%) has easily been one of the top performing cryptos of the year. If you think Bitcoin is red hot at the moment, just consider Solana's remarkable performance: The crypto is up 70% over the past 30 days and more than 300% for the year. Solana now trades at about $41, roughly where it was when cryptocurrency exchange FTX imploded last November.\n\nSolana's recent stellar performance has analysts trying to figure out how much higher this crypto might go. Some have suggested that Solana will eventually make a run at its all-time high of $260, which it reached back in 2021 during the peak of the last crypto bull market rally. From my perspective, two key things need to happen for that to occur.\n\nWin back investor trust\n\nFirst and foremost, Solana needs to win back investor trust. Due to the role that failed crypto exchange FTX (and former FTX Chief Executive Officer Sam Bankman-Fried) played in the rise of Solana, there is still quite a bit of uneasiness about this crypto. Complicating matters is the Securities and Exchange Commission (SEC), which suggested back in June that Solana might actually be an unregistered security. As a result, there is arguably more fear, uncertainty, and doubt hanging over Solana than many of its rivals.\n\nA big point in Solana's favor, though, has been its ability to win over large institutional investors. CoinShares, which tracks the inflow and outflow of institutional funds into different cryptocurrencies, has found that there have been net inflows into Solana in 28 of 32 weeks this year. Even more impressive, Solana seems to be beating out Ethereum as the altcoin of choice of institutional investors. While Solana has been seeing net inflows, Ethereum has actually been seeing net outflows.\n\nDisplace Ethereum as the top blockchain\n\nHowever, winning back investors is the easy part for Solana. The hard part is creating a world-class blockchain that can take on Ethereum. That was the initial promise of Solana back in 2021, when it was routinely being touted as an Ethereum killer. But that simply hasn't happened. Ethereum, with a $216 billion market cap, still dwarfs Solana, which has a $17 billion market cap.\n\nMoreover, if you take a quick look at blockchain niches where Solana was supposed to challenge Ethereum, the numbers are disappointing. For example, within the world of non-fungible tokens (NFTs), Solana was supposed to overtake Ethereum. But the latest data from CryptoSlam shows that Ethereum is still doing six times more monthly NFT sales volume than Solana, and the figure is even higher when you add in the NFT sales volume from the Layer-2 blockchains reside on top of Ethereum.\n\nBut that doesn't mean that Solana won't eventually overtake Ethereum. After all, Solana has a new mobile crypto strategy that is trying to make Solana the world's first mobile-optimized blockchain. As part of this strategy, Solana recently released its first hardware product, the Saga crypto phone. If successful, continued hardware product launches on an annual basis could drive rapid growth.\n\nInvestment firm VanEck, which recently published a report suggesting that Solana might soar in value by more than 10,000% by 2030, says that Solana needs to develop a \"killer app\" capable of onboarding 100 million users. This could be a new payment app or a new social networking app.\n\nIn a world where ChatGPT was able to attract 100 million users in just two months, it's certainly not out of the range of possibility that Solana might be able to develop a similar type of killer app. But it's not very likely. When discussing Solana in its report, VanEck brought up the Infinite Monkey Theorem. The theorem says that an infinite number of monkeys, incessantly banging away on typewriters, will eventually be able to produce the complete works of William Shakespeare. In the case of Solana, an infinite number of developers banging away on their keyboards might be able to develop a killer app.\n\nWhat is the probability of hitting $260?\n\nUltimately, thinking about Solana's future price requires thinking about probabilities. It's important to assign a range of probabilities to different outcomes to determine which scenario is most likely to happen next. For example, while there is a scenario where Solana increases in value by 10-fold and blows past $260, there's also a scenario where Solana collapses and falls all the way back to $10.\n\nSo keep your expectations for Solana in check. While it's quite likely that Solana will continue its recovery into 2024, especially if Bitcoin continues to rally, a lot needs to go right for Solana to make a realistic run at its all-time high of $260."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JuYi1hbmQtZXRoZXJldW0tbGFnLWJlaGluZC1uZXctbWVtZS1jb2luLWZvbGxvd2luZy0zMHgtZ3Jvd3RoLXByb2plY3Rpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "BNB and Ethereum Lag behind New Meme Coin Following 30x Growth Projection - Analytics Insight",
        "content": "TLDR\n\n– BNB, Ethereum (ETH), and other top crypto assets are down more than half from their 2021 peaks.\n\n– Amid the market contraction, some meme coins, such as PepeCoin (PEPE) and BALD, have flourished.\n\n– NuggetRush (NUGX), a meme coin, is increasingly coming to the fore for what it offers. Supporters are bullish, expecting NUGX to expand gains by up to 30X versus ETH and BNB in the coming months.\n\nBNB, Ethereum (ETH), and other top crypto assets were not spared in the recent bear market. The battering was brutal, and most are yet to make a “full” recovery per traders’ assessments.\n\nOf note, BNB and ETH, the priming currencies of some of the world’s most active crypto ecosystems, are down more than half from their 2021 peaks. This development highlights how crypto can be volatile and why positioning investments in top crypto coins, including NuggetRush (NUGX), as a hedge can be worthy.\n\nAlthough the market was unforgiving, amid the contraction, some of the top crypto to buy and meme coins flourished. Specifically, PepeCoin (PEPE), the meme coin launched in early Q2 2023, remains one of the key highlights.\n\nThe ERC-20 coin exploded in April and peaked in May before falling to spot levels. Meanwhile, crypto users also have stories to tell about BALD, the first popular meme coin on Base–the Ethereum layer-2 solution backed by Coinbase.\n\nThough the meme coin “fever” seems to be cooling off, NuggetRush is increasingly coming to the fore for what it offers.\n\nNotably, its supporters are bullish on its prospect, expecting NUGX, the native token of the meme coin platform, to further expand gains by up to 30X versus Ethereum and BNB in the coming months.\n\nTop Reasons NuggetRush is Rallying\n\nNUGX is a meme coin, but unlike competitor tokens, it is not a joke since investors view it as an asset to consider when diversifying portfolios. But why NuggetRush is rising in prominence in the early stages of a bull market, outperforming Ethereum and BNB, boils down to these features:\n\nNuggetRush has an active community, spurred mainly by how the platform’s developers are setting up the project.\n\nIn social media, including X and Telegram, its supporters actively highlight NuggetRush’s community-led approach, the desire to reward participation, and the eventual objective of eventually renouncing its smart contracts so that NUGX holders take over.\n\nThe optimism is further solidified by the protocol’s clear roadmap, where all plans have been defined and are ready for implementation.\n\nNuggetRush also aims to change the perception of meme coins, releasing a unique value proposition. For years, meme coins have been considered “unserious” projects, tapping on hype. However, NuggetRush is rolling out a serious project where NUGX will serve as a utility and governance token.\n\nIn this setup, players of the NuggetRush play-to-earn (P2E) game and holders of the platform’s in-game assets existing as non-fungible tokens (NFTs) will be rewarded using NUGX. Since NUGX is fungible, it will be listed on exchanges where, over time, its liquidity will likely increase as prices float higher. This could make it one of the best coins to invest in.\n\nNUGX, by itself, is also deflationary and compliant with the ERC-20 standard, meaning it can be stored in any EVM-compatible wallet, just like Ethereum (ETH). This will be convenient for users.\n\nMoreover, since it is critical for the entire ecosystem, there will be no buy or sell tax imposed. Holders have to “HODL” and enjoy capital gains in the ongoing presale. Thus far in stage 1, over 180 million NUGX have been sold, helping the project raise over $180,000. At the end of the presale, considered a top ICO, NUGX is expected to double to $0.02.\n\n>> Buy NuggetRush Now <<\n\nWhy are BNB and Ethereum Lagging?\n\nNUGX is soaring and outperforming BNB and ETH because of multiple reasons. NUGX is a low market cap token, which is relatively more volatile and can edge higher faster. Moreover, since holders are optimistic, more investors are exploring the project, adding the token to the ongoing presale, and selling it at a discount.\n\nBeyond liquidity difference, BNB is native to the BNB Chain whose supporter, Binance, a crypto exchange, has been under regulatory scrutiny, especially in the United States.\n\nThe SEC and CFTC are suing the exchange with the former, in particular, alleging that Binance CEO Changpeng Zhao should be investigated for enabling market manipulation and allowing the trading of unregistered securities.\n\nSince the start of the year, BNB has been declining, finding support at $200, over 65% down from 2021 highs.\n\nMeanwhile, ETH is struggling due to the winter, which saw DeFi and NFT activities plunge. Though there is a market recovery, with the SEC recently approving the first Ethereum Future ETFs, the expansion has been relatively slower.\n\nConclusion\n\nEthereum and BNB are some of the most liquid assets. However, crypto, in general, is volatile. While ETH and BNB are lower, emerging projects, including NuggetRush, are rolling out new products that support their native tokens. NUGX could outperform BNB and ETH by the end of the ongoing presale, where prices are expected to double.\n\nVisit NuggetRush Presale Website\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vYW5hbHlzdC1yYXRpbmdzL2FuYWx5c3QtY29sb3IvMjMvMTEvMzU1NjAyODAvZXRoZXJldW0tc2V0LWZvci03NS1zdXJnZS1wcmVkaWN0cy1tYWNyby1ndXJ1LXJhb3VsLXBhbC10aGFua3MtdG8tdGhpcy1nb3JnZW91cy1jaGHSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzU1NjAyODA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Set For 75% Surge, Predicts Macro Guru Raoul Pal Thanks To This 'Gorgeous Chart'— Veteran Peter - Benzinga",
        "content": "Former Goldman Sachs executive and macro guru, Raoul Pal, has made a bold prediction, projecting that Ethereum ETH/USD could surge by over 75% by December.\n\nWhat Happened: Pal took to X, to share his thoughts on the matter, “Technically speaking – ETH is a gorgeous, gorgeous chart.”\n\nAccording to his chart, Pal envisions ETH reaching $3,250 by the end of the year. At the time of writing, ETH was trading at $1833.\n\nAs Pal shares his optimistic outlook, he is not alone in his beliefs. Analysts in the crypto community are also pinpointing a bullish streak for Ethereum. Crypto Tony expressed his perspective on Twitter, stating, “$2,000 $ETH is only a few weeks away, I would say personally. The Altcoin market looks to be heating up nicely.”\n\nAnother analyst, under the pseudonym Mayne, highlighted the strength of Ethereum’s signal within their system. They tweeted, “$ETH This is a really strong HTF (high time frame) signal for my system. Weekly SFP (swing failure pattern) + breaker on ETH. I’m already super longer, looking to add more.”\n\nAdding weight to these sentiments, veteran trader Peter Brandt chimed in, saying, “Another example of classical charting principles. Completion today of a small 9-day flag reconfirms Oct 23 completion of right-angled expanding triangle $ETH.”\n\nBrandt’s statement about the completion of a small 9-day flag and a right-angled expanding triangle for Ethereum suggests a positive outlook. These chart patterns are commonly seen as bullish signals in classical technical analysis. Their completion indicates potential upward momentum for ETH, further supporting the predictions of a bullish streak in the near future.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: Pal’s bullish perspective on Ethereum is in line with his previous statements about the crypto market. Speaking at Mainnet 2023 in September, he expressed his belief that Ethereum is a faster-growing asset than Bitcoin over time.\n\nAdditionally, Pal predicted that Solana SOL/USD would outperform Bitcoin BTC/USD significantly. “SOL will massively outperform BTC. The bulk of my investments are in ETH, then SOL, BTC, etc.,” he commented.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmdvYmFua2luZ3JhdGVzLmNvbS9pbnZlc3RpbmcvY3J5cHRvL3doYXQtaXMtdGhlLW5leHQtYmlnLWNyeXB0b2N1cnJlbmN5L9IBWGh0dHBzOi8vd3d3LmdvYmFua2luZ3JhdGVzLmNvbS9pbnZlc3RpbmcvY3J5cHRvL3doYXQtaXMtdGhlLW5leHQtYmlnLWNyeXB0b2N1cnJlbmN5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "What Is the Next Big Cryptocurrency To Explode? - GOBankingRates",
        "content": "Capuski / Getty Images\n\nCryptocurrency might have started as a Wild West of investing dominated by mavericks, but it’s now firmly in the financial mainstream. Institutional investors and big banks treat it as a serious asset despite its volatility, the collapse of a major exchange and regulatory crackdowns. But how do you know what crypto is worth investing in? Keep reading to learn about the next big cryptocurrency.\n\nWhat Is the Next Big Cryptocurrency? 9 To Watch for 2023\n\nIf you’re looking to get involved in the cryptocurrency market, you might be wondering which one will bring the biggest potential return. Although bitcoin might be the obvious choice, it’s not necessarily the best one in 2023. Your chances of having a big payoff might be better with a smaller coin that hasn’t already been pumped up by institutional investors.\n\nHere are nine cryptocurrencies to keep on your radar for 2023:\n\nEthereum (ETH) BNB (BNB) Tether (USDT) Decentraland (MANA) Algorand (ALGO) Render Token (RNDR) Everlodge (ELDG) Shiba Inu (SHIB) Aptos (APT)\n\n1. Ethereum (ETH)\n\nEthereum, commonly known as ether, is the world’s second-largest cryptocurrency behind bitcoin, even outperforming bitcoin at times. In 2021, Ethereum instituted a major upgrade that reduced the supply of ether, currently at 120.26 million coins as of Nov. 1. The upgrade also allowed the Ethereum network to handle more transactions per second, improve the platform’s scalability and lower transaction fees.\n\nCompared to bitcoin, ethereum lacks scarcity — bitcoin’s supply is capped at 21 million coins — and widespread acceptance by companies and governments. However, unlike bitcoin, ethereum isn’t just a store of value. It also powers an infrastructure on which apps can be built. Other cryptocurrencies are issued on Ethereum, and it serves as the foundation of decentralized finance.\n\nInvesting for Everyone\n\nMany metaverse projects, including Star Atlas, Axie Infinity and The Sandbox, use the Ethereum blockchain, as do most NFTs. Another upgrade, this one launched in September 2022, transitioned Ethereum to a Web3-ready proof-of-stake mechanism that reduced energy consumption by about 99.95% and further increased security and scalability.\n\nEthereum experienced a major slump last year, losing 70% of its value between November and June, which is about on par with other major cryptocurrencies. The price is on the rise again, so this might be the right time for investors who’ve been waiting to test the cryptocurrency waters. The coin might also appeal to current investors who bought high and would benefit from dollar-cost averaging.\n\n2. BNB (BNB)\n\nBinance is the largest cryptocurrency exchange in terms of trading volumes. Formerly called binance coin, BNB puts about one-fifth of its profits each quarter into permanently getting rid of, or “burning,” BNB tokens, which raises the value of the remaining tokens. It burned 2.14 million BNB tokens — almost $482 million worth — in mid-October and expects to eventually burn 50% of the maximum supply.\n\nBinance has two blockchains, which reduce the kind of bottlenecks Ethereum is vulnerable to. It’s also fast and scalable, and Binance is in the process of making the platform more regulator-friendly, according to Seeking Alpha — a feature that could be crucial to its longevity and widespread adoption, especially in light of the collapse of rival exchange FTX.\n\nIn addition, Binance recently launched Bifinity, a fiat-to-cryptocurrency payment platform that will help merchants prepare to accept digital assets as payments, CoinMarketCap reported. The payment processing platform supports more than 50 cryptocurrencies and major payment networks like Visa and Mastercard.\n\nOn the downside, the Securities and Exchange Commission is looking at whether Binance acted improperly in its launch of BNB, mishandled investor funds and lied to regulators. A major fine or other sanction could hurt BNB prices.\n\nInvesting for Everyone\n\n3. Tether (USDT)\n\nTether is a type of “stablecoin” designed to provide a less volatile alternative to bitcoin because it is linked to another asset. In tether’s case, that asset is the U.S. dollar. In valuation terms, tether usually has a 1-to-1 ratio with the dollar, meaning it is less volatile than cryptos such as bitcoin and ether — “usually” being the operative word.\n\nWith an $84.82 billion market cap, Tether is the largest stablecoin and the third-largest coin overall. It’s also the most traded coin — cryptocurrency investors use it to hold funds or make transactions using funds they want to protect against the price swings to which bitcoin, ether and other non-stable cryptocurrencies are vulnerable.\n\n4. Decentraland (MANA)\n\nDecentraland is a virtual reality game on the Ethereum blockchain that uses the MANA token as an in-game currency. Users can purchase goods and services, buy land and visit other players, as well as create and monetize their content. MANA is also the fifth-largest gaming cryptocurrency in terms of market cap.\n\nAlthough Decentraland does have competition from the likes of The Sandbox and Axie Infinity, and in-game assets are quite expensive, it has some benefits that could push the MANA token forward. For example, users retain ownership of the digital assets they create in Decentraland and can convert them to cryptocurrencies other than MANA.\n\nIf the Decentraland metaverse needed a legitimacy boost, it got one in May 2022, when Millennium Hotels and Resorts launched M Social on the platform. According to a press release, this was the first metaverse hotel operated by a hospitality group. Decentraland has also signed a deal to integrate the upcoming film “The Infinite Machine” and its NFT collection into its metaverse, Variety reported.\n\nInvesting for Everyone\n\n5. Algorand (ALGO)\n\nAlgorand, founded by noted computer scientist Silvio Micali, might be the next big cryptocurrency as it has positioned itself as a competitor to the Ethereum blockchain. Hundreds of companies, including the International Federation of Association Football, use it, as do the governments of El Salvador and the Marshall Islands.\n\nOne of Algorand’s biggest advantages is its “proof-of-stake” algorithm, which offers a high degree of security and scalability and requires less electricity than Bitcoin and other platforms. This feature will only grow in importance as cryptocurrencies face more criticism — and possible regulation — for their massive energy consumption.\n\n6. Render Token (RNDR)\n\nRender Token is a graphic rendering network that lets miners with excess graphics processing unit bandwidth parcel it out to artists and creative studios that need extra computing power. RNDR is the native token creators and miners use in their transactions on the Render Network.\n\nThe cloud graphics company Otoy is behind Render. To further level the graphics-processing playing field, Otoy recently launched its Octane X RNDR app for iOS. The app includes the same Otoy GPU renderer that studios like Disney and Marvel use, Fast Company reported. This could help forge a path for RNDR to become a major player in metaverse rendering.\n\nRNDR was launched in a public sale in 2017, and despite fairly recently getting its listing on the Coinbase exchange, it’s already the No. 1 gaming cryptocurrency by market cap, according to CoinMarketCap. While highly speculative, RNDR could benefit from the increased exposure it’s getting on Coinbase, as well as the extraordinary rise of non-fungible tokens for digital art.\n\nInvesting for Everyone\n\n7. Everlodge (ELDG)\n\nEverlodge describes itself as being “where Airbnb meets Web3.” Indeed, the company is moving vacation rental ownership to the blockchain, where investors soon will be able to purchase fractional shares of short-term rental properties via NFTs.\n\nWhile backed by physical real estate, Everlodge investments will differ from traditional real estate investments in that they’ll be completely decentralized and anonymous, and transactions will execute instantaneously — no paperwork or closings to contend with.\n\nEach property’s NFT will be divided into fractional shares that investors can purchase for as little as $100. The NFTs will be linked to promissory notes representing the amount invested, according to the project’s whitepaper. Investors will be able to trade their NFTs on third-party marketplaces such as OpenSea.\n\nEverlodge tokens, which will trade under the ELDG ticker, power the Everlodge platform and will serve as the official currency — investors will purchase their NFTs using ELDG tokens. Presale coins are currently available directly from Everlodge. As of Nov. 1, about 25 million of a total 40 million ELDG coins had sold, and the token price had risen to $0.025 from an initial offering price of $0.01. The launch price is expected to be 0.038.\n\nThis is a new, unproven project and a highly speculative investment. But if the idea takes off, it could revolutionize vacation rental ownership and drive up demand for the token. If that happens, investors could see gains not only from property appreciation, but from appreciation of the coin’s value as well. Investors will also get use of the properties they invest in.\n\nInvesting for Everyone\n\n8. Shiba Inu (SHIB)\n\nShiba inu is a meme token developed to capitalize on the popularity of the dog breed that appears on dogecoin, the cryptocurrency hyped by Elon Musk. The coin’s meme status is the result of an enthusiastic community of supporters who call themselves the ShibArmy. Despite having little or no practical use beyond raising awareness about the benefits of decentralization and cryptocurrency in general, SHIB is the 19th-largest cryptocurrency by market cap, according to CoinMarketCap.\n\nThe project’s lead developer, who uses the pseudonym Shytoshi Kusama, recently emerged on the social media platform Telegram after a lengthy “quiet mode,” touting some new projects and suggesting that collaborations are in the works for the next stage in the development of the Shibarium blockchain.\n\nFor a typical floundering cryptocurrency, a lack of any specifics about what’s in store for the project might raise suspicion that there’s nothing in the pipeline. But with shiba inu, which has never really had a pipeline, riling up the community might be all it takes to trigger a rally. In fact, SHIB “whales” — major holders — recently bought up 4.5 trillion tokens according to Watchter.Guru, citing data from IntoTheBlock.\n\n9. Aptos (APT)\n\nThe Aptos blockchain is a layer 1 blockchain like Bitcoin and Ethereum, but its developers say it can do what they haven’t — follow a cloud infrastructure model for security, scalability and reliability to facilitate the widespread adoption of Web3. Its developers made and built Aptos’ predecessor, Diem, which was backed by Meta but, stymied by regulatory issues and opposition from the Federal Reserve, sold off its assets in January 2022, The Verge reported.\n\nInvesting for Everyone\n\nA flood of over $350 million in venture capital, including a $200 billion seed round led by Andreessen Horowitz, and lack of transparent tokenomics has led to criticism from the cryptocurrency community, according to The Crypto Times, and some analysts think aptos, the native token, is already overcapitalized. However, Aptos is already faster and more reliable than Ethereum and seems well positioned to emerge as a major force if it can live up to its hype. For example, the development team claims Aptos will eventually process 160,000 transactions per second — transactions users will pay for in Aptos’ native token, APT.\n\nHow To Buy Cryptocurrency Buying cryptocurrency is relatively easy. Here are the steps you can take to buy the next big crypto: Open an account with a cryptocurrency exchange or broker: Exchanges such as Coinbase or Binance.US are easy to use and match buyers with sellers. Alternatively, you can choose a broker like Robinhood or SoFi, which execute the trades for you and typically have low fees but feature complicated interfaces. Fund your account: Before you can trade crypto, you’ll need a way to pay for your purchases, such as a linked bank account, a wire transfer or a debit or credit card payment. Place your cryptocurrency order: Select the cryptocurrency you want to buy and indicate how many coins you want to purchase. To purchase fractional shares of cryptocurrency, specify a dollar amount instead of the number of coins.\n\nFinal Take To GO\n\nDespite the crypto market being highly volatile, many investors remain on the lookout for the next big payoff. In the crypto space, big crypto risks can come with big crypto rewards. No matter how you feel about the nuances of investing in crypto such as blockchain technology, decentralized applications, smart contracts or even just meme coins, it’s good to familiarize yourself with the territory and stay on the lookout for the next big cryptocurrency.\n\nFAQ Here are the answers to some of the most frequently asked questions regarding the next big cryptocurrency. Which crypto will explode in 2023? To navigate which crypto will explode soon, you need to first analyze the profit and gains of that asset. When trying to identify the next big cryptocurrency, two things to keep an eye on are similar to what a stock investor would keep an eye on: market capitalization and price. Market cap shows how much has been invested in a specific network. As a general rule, the larger the market cap, the more stable the asset, though it also means the coin has less room to grow. It's also important to keep an eye on the price to determine whether investors are bullish or bearish on the cryptocurrency.\n\nWhat's the next big crypto to invest in 2023? Here are some cryptocurrencies to keep in mind and possibly invest in for 2023: Ethereum (ETH) Binance Coin (BNB) Tether (USDT) Decentraland (MANA) Algorand (ALGO) Render Token (RNDR)\n\nWhat is the next big cryptocurrency in 2024? Here are a few metrics to help you analyze what the next big cryptocurrency will be in 2024 or 2025: Volatility: The less volatile the price, the better for the crypto's value to remain stable. 24-hour volume: The total dollar value of all transactions over the past 24 hours can help you determine a coin's liquidity. Supply: As bitcoin's meteoric rise attests, scarcity can drive demand and prices. Increasing or infinite supply can have a dampening effect.\n\nHere are the answers to some of the most frequently asked questions regarding the next big cryptocurrency.\n\nDaria Uhlig and Caitlyn Moorhead contributed to the reporting for this article.\n\nData is accurate as of Nov. 1, 2023, and is subject to change."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMipwFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0by1wcmljZS10b2RheS1ub3ZlbWJlci0yLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLXNvbGFuYS1ta3ItYWJwLWxpdmUtdHYtMTYzOTg4M9IBqwFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0by1wcmljZS10b2RheS1ub3ZlbWJlci0yLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLXNvbGFuYS1ta3ItYWJwLWxpdmUtdHYtMTYzOTg4My9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Rises Above $35,000, Solana Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) crossed the $35,000 mark early Wednesday, as the overall market’s 'Fear & Greed Index' stood at 74 (greed) as per CoinMarketCap. Popular altcoins — including the likes of Ethereum (ETH), Dogecoin (DOGE), Ripple (XRP), and Litecoin (LTC) — saw noteworthy jumps across the board. Solana (SOL) went on to become the top gainer, with a 24-hour jump of over 17 percent. Maker (MKR), on the other hand, became the biggest loser with a 24-hour dip of nearly 2 percent.\n\nThe global crypto market cap stood at $1.31 trillion at the time of writing, registering a 24-hour gain of 2.67 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $35,614.53, registering a 24-hour gain of 3.21 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 30.30 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $1,863.53, marking a 24-hour jump of 2.55 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.60 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 2.58 percent, as per CoinMarketCap data, currently priced at $0.06969. As per WazirX, Dogecoin price in India stood at Rs 5.97.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 1.89 percent. At the time of writing, it was trading at $70.18. LTC price in India stood at Rs 5,902.17.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.6107, seeing a 24-hour jump of 2.53 percent. As per WazirX, Ripple price stood at Rs 52.\n\nSolana (SOL) Price Today\n\nSolana price stood at $41.94, marking a 24-hour gain of 10.04 percent. As per WazirX, SOL price in India stood at Rs 3,540.01.\n\nTop Crypto Gainers Today (November 2)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nSolana (SOL)\n\nPrice: $42.73\n\n24-hour gain: 17.73 percent\n\nUniswap (UNI)\n\nPrice: $4.79\n\n24-hour gain: 16.61 percent\n\nNEAR Protocol (NEAR)\n\nPrice: $1.52\n\n24-hour gain: 15.75 percent\n\nInjective (INJ)\n\nPrice: $15.13\n\n24-hour gain: 13.20 percent\n\nQuantum (QTUM)\n\nPrice: $3.45\n\n24-hour gain: 12.78 percent\n\nTop Crypto Losers Today (November 2)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nMaker (MKR)\n\nPrice: $1,339.33\n\n24-hour loss: 1.80 percent\n\nConflux (CFX)\n\nPrice: $0.1648\n\n24-hour loss: 1.53 percent\n\nBitTorrent(New) (BTT)\n\nPrice: $0.0000004637\n\n24-hour loss: 1.31 percent\n\nToncoin (TON)\n\nPrice: $2.19\n\n24-hour loss: 1.24 percent\n\nBitget Token (BGB)\n\nPrice: $0.4808\n\n24-hour loss: 0.76 percent\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LnNhbWFhLnR2LzIwODczMzY5My1jcnlwdG8tcHJpY2VzLXRvZGF5LWJpdGNvaW4tZXRoZXJldW0tc29sYW5hLWFsdGNvaW4tcmF0ZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Crypto prices today: Bitcoin, Ethereum, altcoin rates - 2 Nov, 2023 - latest rates - SAMAA",
        "content": "Photo: File\n\nIn today's cryptocurrency market, optimism abounds, with a sea of green dominating on Thursday, November 2.\n\nInvestors are eagerly awaiting the Federal Reserve's upcoming meeting, which could either fuel the ongoing crypto rally or potentially dampen market sentiment.\n\nThe Federal Reserve's recent announcement was met with applause from the market.\n\nDuring Wednesday's FOMC meeting, the central bank decided unanimously to maintain its benchmark interest rates at their current levels, keeping the key federal funds rate within the 5.25%-5.5% target range, where it has remained since July.\n\nNotably, this decision followed a series of 11 rate hikes, including four in 2023.\n\nCrypto enthusiasts have much to celebrate as Bitcoin's price experienced a 2.77% increase, reaching $35,363.40, and its trading volume surged by 60.64% to $25.03 billion over the last 24 hours.\n\nThe market cap also received a boost of 2.80%, reaching $690.77 billion. Over the past week, Bitcoin's price has appreciated by over 2%.\n\nEthereum's price didn't lag behind, with a 2.29% increase, now trading at $1,846.22, accompanied by a 66.85% rise in one-day volume, reaching $11.38 billion.\n\nSimultaneously, XRP's price also saw a 3.24% rise, landing at $0.606, while its 24-hour volume decreased by 14.42% to $1.87 billion.\n\nAmong other prominent cryptocurrencies, Solana's price surged by 9.94% to $41.82, while Cardano's price witnessed a 6.42% jump, with trading volumes rising by 151.41% and 13.46% to $3.74 billion and $357.96 million, respectively.\n\nEven meme coins joined in on the optimism, with Dogecoin's price increasing by 2.62% to $0.06889, although with a 0.23% decrease in trading volume to $483.85 million.\n\nOn the other hand, Shiba Inu's price surged by 3.53% to $0.000007959, with trading volume up 5.58% from the previous day, reaching $169.30 million.\n\nThese gains across major cryptocurrencies contributed to a notable upswing in the overall crypto market.\n\nThe global cryptocurrency market cap rose by 2.85% from the previous day, reaching $1.31 trillion, with a market fear and greed index reading of 74, indicating a \"greed\" sentiment.\n\nThe total market cap increased by 43.49% in the last 24 hours, now standing at $57.9 billion.\n\nThe crypto market's surge underscores the growing interest in digital assets, with all eyes on the Federal Reserve's forthcoming stance, set to have a significant impact on the market's future trajectory."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2N5cHJ1cy1tYWlsLmNvbS8yMDIzLzExLzAyL2lzLWFuZHJldy10YXRlcy1jcnlwdG8tZW5kb3JzZW1lbnQtYS1yZWxpYWJsZS1pbmRpY2F0b3ItdG8taW52ZXN0LWluLWV0aGVyZXVtLWFuZC12Yy1zcGVjdHJhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Is Andrew Tate's Crypto endorsement a reliable indicator to invest in Ethereum and VC Spectra? - Cyprus Mail",
        "content": "Cookies Policy\n\nPlease read this Cookie Policy carefully as it contains important information on who we are and how we use cookies on our website. This policy should be read together with our Privacy Policy which sets out how and why we collect, store, use and share personal information generally, as well as your rights in relation to your personal information and details of how to contact us and/or the supervisory authorities in case you have any complaint.\n\nThis Cookie Policy applies to the access and use of the Cyprus Mail Website hosted at https://cyprus-mail.com/ (hereinafter referred to as the “Website”), which is operated by NEO CYMED PUBLISHING LIMITED (hereinafter the “Company”, “we” or “us”).\n\nOur Company strives to protect personal data and apply high standards of conduct when it comes to privacy issues. We ensure that we provide our employees and staff with the appropriate training to handle personal data promptly and in accordance with the laws. Furthermore, we endeavour to ensure that any parties with whom we co-operate apply the same high standards when it comes to data protection and privacy as we do.\n\nCookies\n\nA cookie is a small text file which is placed onto your device (e.g. computer, smartphone or other electronic device) when you use our Website. We use cookies on our Website. These help us improve your experience and at the same time help us to support our security features i.e. detect for malicious visitors, recognize you and your device and store some information about your preferences or past actions.\n\nFor example, we may monitor . This information helps us to identify trusted web traffic, generate statistical and analytical data on how our visitors use our Website, our reach and click on links. We also uses cookies to personalize your online experience. Some of this data will be aggregated or statistical, which means that we will not be able to identify you individually.\n\nFor further information on our use of cookies, including a detailed list of your information which we and others may collect through cookies, please see below.\n\nFor further information on cookies generally, including how to control and manage them, visit the guidance on cookies published by the Office of the Commissioner of Personal Data Protection in Cyprus, or www.allaboutcookies.org/.\n\nConsent to use cookies and changing settings\n\nWe will ask for your permission (Consent) to place cookies or other similar technologies on your device, except where they are essential for us to provide you with a service that you have requested (enabling basic functions like page navigation and access to secure areas of the Website) and ensure the security of our website and users.\n\nYou may withdraw any consent provided regarding the use of cookies or manage any other cookie preferences by clicking on the Cookie Settings icon at the bottom end of any page on our Website. You can then adjust the sliders regarding the cookies as per your preferences. It may be necessary to refresh the page for the updated settings to take effect.\n\nFor more information on how you can change your preferences via browser settings please see ‘How to turn off all cookies and consequences of doing so’ below. It may be necessary to refresh the page for the updated settings to take effect.\n\nOur use of cookies\n\nCategories of Cookies:\n\nNecessary cookies are absolutely essential for the Website to function properly. These cookies ensure basic functionalities and security features of the Website, anonymously.\n\nAnalytical cookies are used to understand how visitors interact with the Website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\n\nFunctional cookies help to perform certain functionalities like sharing the content of the Website on social media platforms, collect feedbacks, and other third-party features.\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website to improve user experience.\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\n\nOther uncategorized cookies are being analyzed and have not yet been categorized.\n\nThe table below provides more information about the cookies we use and why:\n\nCookie Name Domain Category Purpose Necessity and Consent Duration _ga cyprus-mail.com Analytics The _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors. Read https://policies.google.com/technologies/partner-sites Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 year, 1 month and 4 days _gid cyprus-mail.com Analytics Installed by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously. Read https://policies.google.com/technologies/partner-sites Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 day _gat_gtag_UA_* cyprus-mail.com Analytics Installed by Google Analytics, to store a unique user ID. Read https://policies.google.com/technologies/partner-sites Not essential for the functionality of the website - will therefore request your consent before placing this cookie Less than a minute _ga_* cyprus-mail.com Analytics Installed by Google Analytics, to store and count page views. Read https://policies.google.com/technologies/partner-sites Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 year, 1 month and 4 days __gads cyprus-mail.com Analytics Google sets this cookie under the DoubleClick domain, tracks the number of times users see an advert, measures the campaign's success, and calculates its revenue. This cookie can only be read from the domain they are currently on and will not track any data while they are browsing other sites. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 year, 24 days advanced_ads_page_impressions cyprus-mail.com Analytics Advanced Ads sets this cookie to measure the number of previous page impressions. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 year, 1 month, 4 days uid adform.net Analytics This is a Google UserID cookie that tracks users across various website segments. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 2 months CONSENT youtube.com Analytics YouTube sets this cookie via embedded YouTube videos and registers anonymous statistical data. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 2 years CONSENT google.com Analytics YouTube sets this cookie via embedded YouTube videos and registers anonymous statistical data. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 2 years __cf_bm cyprus-mail.com Functional Cloudflare set the cookie to support Cloudflare Bot Management. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 29 minutes __gpi cyprus-mail.com Advertisement Google Ads Service uses this cookie to collect information about from multiple websites for retargeting ads. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 year, 24 days test_cookie doubleclick.net Advertisement doubleclick.net sets this cookie to determine if the user's browser supports cookies. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 14 minutes YSC youtube.com Advertisement Youtube sets this cookie to track the views of embedded videos on Youtube pages. Not essential for the functionality of the website - will therefore request your consent before placing this cookie Session VISITOR_INFO1_LIVE youtube.com Advertisement YouTube sets this cookie to measure bandwidth, determining whether the user gets the new or old player interface. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 5 months, 27 days advanced_ads_browser_width cyprus-mail.com Advertisement This cookie is set by Advanced ads plugin. This cookie is used to measure and store the user browser width for adverts. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 month IDE doubleclick.net Advertisement Google DoubleClick IDE cookies store information about how the user uses the website to present them with relevant ads according to the user profile. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 year, 1 month, 4 days yt-remote-device-id youtube.com Advertisement YouTube sets this cookie to store the user's video preferences using embedded YouTube videos. Not essential for the functionality of the website - will therefore request your consent before placing this cookie Never yt-remote-connected-devices youtube.com Advertisement YouTube sets this cookie to store the user's video preferences using embedded YouTube videos. Not essential for the functionality of the website - will therefore request your consent before placing this cookie Never yt.innertube::nextId youtube.com Advertisement YouTube sets this cookie to register a unique ID to store data on what videos from YouTube the user has seen. Not essential for the functionality of the website - will therefore request your consent before placing this cookie Never yt.innertube::requests youtube.com Advertisement YouTube sets this cookie to register a unique ID to store data on what videos from YouTube the user has seen. Not essential for the functionality of the website - will therefore request your consent before placing this cookie Never OAID adsbydelema.com Advertisement Cookie set to record whether the user has opted out of the collection of information by the AdsWizz Service Cookies. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 year TPC adform.net Other Used to determine if browser of user accepts third party cookies or not Not essential for the functionality of the website - will therefore request your consent before placing this cookie 7 days C adform.net Other No description provided. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 month advanced_ads_visitor cyprus-mail.com Other No description provided. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 month _pbjs_userid_consent_data cyprus-mail.com Other No description provided. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 month __jid disqus.com Other Cookies set on website by the third-party commenting platform Disqus. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 30 minutes disqus_unique disqus.com Other These cookies are set by Disqus so that users can comment on website/platform. Not essential for the functionality of the website - will therefore request your consent before placing this cookie 1 year\n\nThird party access to the cookies\n\nThe cookies we use will only be accessed by us and those third parties named in the table above for the purposes referred to in this Cookie Policy. Those cookies will not be accessed by any other third party.\n\nHow to turn off all cookies and consequences of doing so\n\nIf you do not want to accept any cookies, you may be able to change your browser settings so that cookies (including those which are essential to the services requested) are not accepted. If you do this, please be aware that you may lose some of the functionality of our Website.\n\nHow to contact us\n\nPlease contact us if you have any questions about this Cookie Policy or the information we hold about you.\n\nIf you wish to contact us, please send an email to [email protected], write to us at 195, Arch. Makariou III, Neocleous House, 1st-5th floor, 3030, Limassol, Cyprus, or call us at ++357 22818585.\n\nChanges to this policy\n\nThis policy was last updated on 4/7/2023.\n\nWe may change this policy from time to time, when we do so we will inform you via notification on our Website."
    }
]