[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vcm1pLm9yZy9jcnlwdG9jdXJyZW5jeXMtZW5lcmd5LWNvbnN1bXB0aW9uLXByb2JsZW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Cryptocurrency’s Energy Consumption Problem - Rocky Mountain Institute",
        "content": "Shares\n\nCryptocurrency’s Energy Consumption Problem\n\nWhat has been done and what still needs to be done to decarbonize crypto.\n\nCryptocurrency has an energy consumption problem. Bitcoin alone is estimated to consume 127 terawatt-hours (TWh) a year — more than many countries, including Norway. In the United States, cryptocurrency activity is estimated to emit from 25 to 50 million tons of CO 2 each year, on par with the annual emissions from diesel fuel used by US railroads.\n\nDecarbonizing the crypto industry thus remains essential to achieving a safe climate future. Yet, while RMI is proud to have played a role in initial decarbonization efforts in the crypto industry, moving forward, we will focus on decarbonizing the grid rather than crypto transactions.\n\nIn this article, we reflect on the state of the crypto industry: what work has been done so far, the challenges of decarbonizing crypto, and how RMI will continue to pursue this goal as part of our larger effort to decarbonize global supply chains.\n\nProgress to Date\n\nAs exorbitant electricity consumption from crypto mining became a public concern, RMI’s first step was to act as a co-convener of the Crypto Climate Accord (CCA), along with our partners Energy Web, the Alliance for Innovative Regulation (AIR), and the World Economic Forum. The CCA serves as a “private sector-led initiative focused on decarbonizing the cryptocurrency and blockchain industry,” where solutions and technologies for crypto decarbonization are created collaboratively among players across the web3 and crypto space.\n\nAs part of the CCA, RMI spearheaded the development of the CCA Accounting Guidance, a foundational guide to allocating emissions for the crypto industry. The guidance highlights the importance of a consequential accounting approach and the use of marginal emissions rates as a key to understanding crypto’s emissions impact. The guidance further supports the need to gauge grid impact rather than average emissions when assessing emissions impact.\n\nThis initial work was followed by participating in a roundtable during the drafting of the Crypto Climate Impact Accounting Framework, developed by the Crypto Carbon Ratings Institute (CCRI) and South Pole. This framework sought to define a methodology for allocating GHG emissions for crypto transactions and holdings. Because institutional investors hold an outsized stake of the crypto market, allocating emissions for these activities is vital to pressure both investors and crypto industry leaders to change their current practices.\n\nChallenges with Crypto Decarbonization\n\nProof-of-work energy usage\n\nWith lawmakers increasingly looking at the effects of Bitcoin mining, from both an environmental and grid-resiliency perspective, lowering energy usage of this crypto currency is a must. Bitcoin is the only major currency that uses proof-of-work mining. The large energy usage associated with proof-of-work mining is an inevitable consequence of the fundamental nature of its algorithms.\n\nEthereum moved to a far less energy intensive proof-of-stake consensus mechanism, reducing that network’s electrical usage by over 99.9 percent. (Here’s a discussion of the difference between proof-of-work and proof-of-stake.) A single transaction on Ethereum’s proof-of-stake network is now similar to the electrical usage of a Mastercard transaction. As a result, when we speak of the emissions impact of “crypto,” we are now largely speaking about the emissions impact of Bitcoin.\n\nTo mitigate crypto industry emissions, RMI supports the “Change the Code, Not the Climate” campaign, launched by Greenpeace and the Environmental Working Group, intended to motivate Bitcoin to move away from proof-of-work and toward a less energy-intensive consensus mechanism.\n\nA co-benefit of Bitcoin changing its consensus mechanism would be to mitigate Bitcoin’s significant e-waste problem. As proof-of-stake and other low energy protocols require less computing power and no specialized equipment, Bitcoin ditching proof-of-work would mean the network would require far less hardware — an additional win for the climate.\n\nPrice volatility\n\nIn addition to energy usage and e-waste, the price volatility associated with Bitcoin and other cryptocurrencies is a cause for concern. When prices are high, Bitcoin miners may be willing to power their operations with clean electricity. But as the price of Bitcoin comes down, smaller profit margins mean industry players are likely to seek out the cheapest electricity possible, which may not always be the cleanest. Digiconimist currently estimates a “cost percentage” of Bitcoin mining, which shows that miners spend a majority of their income on electricity.\n\nFurthermore, there are attempts to use Bitcoin for demand response on power grids, with Texas’ ERCOT being the prime example. There are concerns, however, about the ability of Bitcoin miners to be relied upon for these services. If prices are too high, miners won’t prioritize limiting power usage, putting increased pressure on a grid that has experienced significant stress in recent years.\n\nElectricity procurement\n\nWith emissions on the scale of entire countries, it is imperative for Bitcoin mining, in the absence of changing to a low-energy consensus mechanism, to be powered by new renewable energy, rather than drawing from existing renewable capacity. Because of the flexibility of Bitcoin’s load, or its ability to be mined anywhere in order to balance energy supply and demand, miners who are conscious about their footprint should be able to contract renewable energy to power their operations. Unfortunately, as public data from Greenpeace shows, this is not currently the case. Bitcoin miners are largely contracting energy from fossil sources and claims of sustainability tend to be based on being co-located near renewables.\n\nSome Bitcoin miners may not have direct control over their electricity usage if their mining computers are contracted out to larger data centers. This, combined with the fact that miners are not longstanding businesses with well-established credit, may make it difficult to dictate their electricity supply. In order to drive further renewable energy generation, rather than take credit for an existing portion of renewable capacity, Bitcoin miners must contract renewable energy directly.\n\nBut while energy usage remains high in Bitcoin mining, it is imperative that this energy is clean, sustainable, and additional. To ensure this, RMI developed the Renewable Energy (RE) Emissions Score, designed to assess the material impact of renewable energy procurement. By measuring the emissions impact, as well as the value provided by off-takers of renewable energy, the RE Emissions Score will allow any company, not just Bitcoin miners, to make meaningful claims about renewable energy procurement, prioritizing investment in high emissions areas and low-cost renewable projects. If Bitcoin mining is to continue, it must be powered by additional renewables so that it does not inadvertently increase required grid capacity and lead to more fossil generation.\n\nThe RE Emissions Score was born out of a need to allow Bitcoin miners to make quantifiable claims of renewable energy use and investment, but its implications are much wider. Any company currently procuring renewable energy can use this approach to show its commitment to total grid decarbonization. Focusing on the decarbonization of the grid as a whole is vital to any strategy for reducing crypto emissions.\n\nMoving Forward\n\nThe climate effects of crypto, especially Bitcoin, are no secret. With an extremely large appetite for energy, crypto has the potential to serve as an impediment to climate progress. Price volatility has hampered climate action in the space, and without proactive procurement by miners, regulatory pressure is inevitable. Campaigns such as the CCA show an interest in addressing these issues within the community. Participating organizations cannot afford to allow these pledges to be mere words, they must act. Guidance on measuring emissions, such as the CCA Accounting Guidance and the Crypto Climate Impact Accounting Framework, are vital first steps toward allowing industry participants to understand their own climate impact and take action to reduce it. The dictum applies: you can’t manage what you can’t measure.\n\nUntil such a time that a less energy-intensive consensus mechanism for bitcoin is developed and available, current Bitcoin mining operations should be powered by additional, renewable energy. The RE Emissions Score provides miners with the means to help ensure that contracted power is renewable and additional, which will be necessary to decarbonize US electricity grids by 2035.\n\nThough our direct engagement with crypto is coming to a close, RMI’s work to decarbonize the grid and transform the global energy system will continue."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9hbnRpY2lwYXRpb24tZm9yLWV0aGVyZXVtLWV0aC0yLTAtcmlzZXMtYXMtbWV0cmljLXJpc2VzLXRvLWFsbC10aW1lLWhpZ2gv0gFjaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2FudGljaXBhdGlvbi1mb3ItZXRoZXJldW0tZXRoLTItMC1yaXNlcy1hcy1tZXRyaWMtcmlzZXMtdG8tYWxsLXRpbWUtaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "Anticipation for Ethereum [ETH] 2.0 rises as metric reaches all-time high - AMBCrypto News",
        "content": "Ethereum (ETH) total value staked has surpassed 15.9 million.\n\nThe increase in the value of ETH might be a major contributor to the increase in stake inflow.\n\nSince the merge, validators have been able to contribute to network security by staking their Ethereum [ETH]. However, the total amount of ETH that has been staked has increased and now stands at a record high. Is there any reason to expect more stake increases, and what could be driving the current ones?\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nTotal value staked hit record-high\n\nThe second-largest blockchain, Ethereum, reached a significant new milestone on 27 January, nearly four months after it transitioned to a proof-of-stake network. According to Crypto Quant, over 15.9 million ETH have been staked on the Ethereum Beacon Chain.\n\nThe total number of ETH staked has reached a new all-time high of 15,9 million • Accounting for more than 13% of the total ETH supply. 1/6 ?? pic.twitter.com/wesx84E2hK — CryptoQuant.com (@cryptoquant_com) January 27, 2023\n\nAt press time, the total amount staked is over $25.3 billion, and this also represented over 13% of the total ether supply. This is about two years after the launch of Ethereum’s staking contract in 2020, when the network’s proof-of-stake Beacon Chain was introduced.\n\nETH Staking Inflow and New Depositors see constant activities\n\nAdditional examination of several other charts, such as the Staking Inflow Total chart, revealed some intriguing findings. The documented staking influx increased at the beginning of the week. It reached over 69,000, the most significant level since November 2022.\n\nJanuary has had a higher stake inflow than December of the prior year overall.\n\nEven though there were no spikes, a peek at the New Depositors chart provided further information about Ethereum staking. As of the time of this writing, 46 new depositors were listed for 27 January. Even while this may not be a large amount, the chart demonstrated a steady stream of new depositors. With this in mind, one could wonder why stakes are constantly entering the network.\n\nPossible reasons for an increased stake\n\nEthereum was trading at about $1,590 at the time of this writing. Since the beginning of January, the asset’s worth has increased by 33%, as shown by the current price level. One cause of the rise in staking may be a price surge similar to the one Ethereum recently saw.\n\nThis was paired with the perception that the Shanghai Upgrade, which would allow the withdrawal of staked ETH, is imminent. To provide incentives, staking payouts will rise in response to a significant ETH withdrawal when the withdrawal feature is activated.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nStaking rewards for ETH decrease as more of the cryptocurrency is staked. Until the merge’s completion, Ethereum validators have an APY of roughly 5%. However, APY is highest for individuals running their validator nodes.\n\nStaking ETH through a centralized exchange or a staking pool would likely result in reduced earnings because of the validator fees that will be paid. The only time this is different is when centralized exchanges use promotional strategies to increase their reward APYs above on-chain rates to attract staking market share."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8zMC9pcy1zb2xhbmEtZm9sbG93aW5nLWV0aGVyZXVtcy1lYXJseS1kYXlzLXRvcC10cmFkZXItY29tcGFyZXMtc29sLWFuZC1ldGgtdXBkYXRlcy1zdGFuY2Utb24tY3J5cHRvLW1hcmtldHMv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAxLzMwL2lzLXNvbGFuYS1mb2xsb3dpbmctZXRoZXJldW1zLWVhcmx5LWRheXMtdG9wLXRyYWRlci1jb21wYXJlcy1zb2wtYW5kLWV0aC11cGRhdGVzLXN0YW5jZS1vbi1jcnlwdG8tbWFya2V0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Is Solana Following Ethereum’s Early Days? Top Trader Compares SOL and ETH, Updates Stance on Crypto Markets - The Daily Hodl",
        "content": "A trader who continues to build a large following with his timely altcoin calls says that one of Ethereum’s biggest competitors may be following ETH‘s early stages of growth.\n\nPseudonymous trader Cantering Clark shares a chart with his 159,000 Twitter followers showing uncanny similarities between the price action of Solana (SOL) today and Ethereum’s in 2018.\n\n“Early ETH vs SOL.”\n\nThe trader’s chart shows both assets bouncing off a support level mutiple times, then collapsing through it before making a lower low and then a rebound.\n\nFrom its 2018 low, Ethereum ultimately rallied 5,777% to its all-time high, from $83 to $4,878. With Solana’s recent low of $8, a similar move for SOL would suggest a rally to roughly to $462 before the next bear market.\n\nLooking at the rest of crypto markets, Cantering Clark says that the “January effect,” referring to cypto’s tendency to rally at the beginning of the year, is likely over. He predicts a correction in the near term, potentially triggered by poor earnings reports or other macroeconomic announcements.\n\n“The January effect is done. Historically big months like this follow with some mean reversion, and what better way to start the next month with a gamut of events: FOMC and earnings for Amazon, Apple, Google, Meta, Exxon, Pfizer, Merck…\n\nIf I had to guess.\n\nTake it back to 20k area, and chop people up left and right before continuing.”\n\nThe trader says BTC lacks a lot of liquidity between $23,000 and about $21,000 which could mean price falls rather quickly until the next major level.\n\n“I don’t really care to do anything aggressive while Bitcoin is at the top of the range.\n\nFlipping 25k might change my mind.\n\nThere are some really imbalanced areas that price likes to revisit and could cut through like butter.\n\nEyes on anchored yearly vwap (volume weighted average price) and Jan 23rd low.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Shacil/WhiteBarbie"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDEvMzAvZXRoZXJldW0tMi0wLW5ldy1ibG9ja2NoYWluLXZlcnNpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Ethereum 2.0: What Exactly is this New Blockchain Version? - Crypto Times",
        "content": "Ethereum — the second most popular blockchain after Bitcoin — has continually deduced methods to update its network to become better than its predecessor and major rival.\n\nAnd after a long wait, the upgraded version launched in mid-September 2022 called “Ethereum Merge”. Originally referred to as Ethereum 2.0, the merge is an upgraded version of the Ethereum network that now uses proof-of-stake consensus.\n\nThe upgrade will allow Ethereum to scale its transaction throughput, enable new applications to drive greater utility on-chain, and further reduce cost. Let’s understand how this revolutionary Merge upgrade will gear up to be future-proof to follow mass adoption.\n\nWhat is Ethereum 2.0?\n\nEthereum 2.0 is simply an upgrade to Ethereum’s network. It is a multi-phased project that intends to make the blockchain network faster, cheaper, more accessible, more secure, and more effective.\n\nThis upgrade heralded the switch of Ethereum’s consensus mechanism from the Proof-of-Work (PoW) model to the Proof-of-Stake (PoS) model, and brought about “Sharding.” Sharding is reportedly the last phase of the Ethereum 2.0 transition which should be finalized by 2023.\n\nThe transition from Ethereum 1.0 to 2.0 was always in the works, and not a random event. To be honest, you hardly find any unplanned incident in the crypto space. Even the rising platform Xbitcoincapex.app (which recently made headlines in several crypto media websites) admits that no events go unprepared for in the ecosystem.\n\nIt commenced in December 2020 with the launch of the Beacon Chain, which introduced staking and PoS to the Ethereum network. Using the proof-of-stake (PoS) model over the proof-of-work (PoW) model was a major game changer for the network.\n\nNormally, with the PoW model — which was the primary consensus method used by all networks, as started by Bitcoin — miners use their sophisticated computing power to decipher complicated equations and validate blocks, which are then added to the blockchain. Each block had to be proven unique to prohibit duplication of transactions. This process rendered the whole PoW process expensive, in terms of financial resources and time to undergo.\n\nIn addition, blockchain mining utilizes a lot of electricity which isn’t environmentally friendly. Then there’s the issue of miners who are inferiorly stacked against their competitors, as they don’t have enough resources to compete to solve these equations. There is, however, the option of miners collaborating with other miners in a ‘mining pool’ to solve these equations. But, the reward is shared amongst the miners.\n\nWith the PoS model, users ‘validate’ transactions (just like PoW mine) by ‘staking’ crypto into the network. The more funds the validators stake, the higher their rewards for participating.\n\nIn this method, the bar for entry is low as long as you have the funds to participate, (and there are other ways to get the 32 ETH needed to stake), unlike PoW which involves having expensive hardware and utilizing copious amounts of electricity.\n\nThis level of network accessibility (of Ethereum 2.0) enables better scalability, as more users are connected to the network and validate blockchain transactions. Ultimately, this leads to a higher level of security and decentralization due to multiple peoples’ participation.\n\nUsing the PoS model also prevents a 51% attack, something which is prevalent in PoW models. It simply means when a user commands control of 51% of nodes and validates transactions wrongly. Since it is practically impossible to HODL 51% of tokens on the Ethereum network, the PoS model is more secure.\n\nGenerally speaking, upgrading to Ethereum 2.0 will help secure the network and allow participants, collectors, and cryptocurrency owners to stake their ETH tokens and earn rewards.\n\nWhen did Ethereum 2.0 Start?\n\nWork on Ethereum 2.0 had begun early, as previously stated. It can be summarized into four phases:\n\nPhase 0\n\nIt commenced in 2020 with what was called “Beacon Chain” — which introduced the PoS model to the Ethereum blockchain — enabling users to stake their ETH and become validators. Beacon Chain didn’t disrupt the Ethereum 1.0 blockchain but existed alongside Ethereum’s mainnet.\n\nThe first Phase provided three major technological implementations to the Ethereum ecosystem: the Beacon Chain, the PoS consensus mechanism, and validator nodes.\n\nPhase 1\n\nThe next phase was purported to launch in mid-2021 but it was delayed to early 2022, with the Ethereum developers mentioning unfinished work. In Phase 1, there was meant to be a merge of the Mainnet into the Beacon Chain, therefore switching the consensus mechanism from PoW to PoS. Miners were expected to take their holdings and stake them to evolve into validators.\n\nIn addition, the Ethereum developers intended to introduce “Sharding” in this Phase. This is because it has a significant effect in ensuring the Ethereum network can handle an increased number of transactions.\n\nRather than settling all operations on just one blockchain, “Shard” chains disperse these operations across 64 new chains. This enables parallel processing to decrease the latency that originates from linear processing utilizing a single blockchain.\n\nInvariably, this would lead to an increase in the transaction speed and reduce the load on the network as validators could run their Shards. Also, processing any transactions would become easier from a hardware purview, as there would be reduced data to be stored on a particular machine.\n\nPhase 2\n\nUltimately, Phase 2 came with the introduction of Ethereum Web Assembly (eWASM). It was designed to make the Ethereum 1.0 network more efficient, a subset of the proposed Ethereum smart contract execution layer.\n\nEthereum 1.0 was equipped with an Ethereum Virtual Machine (EVM). This software interacts with dApps, evaluates gas fees for every transaction, and computes the network after each block is added to the blockchain. A fundamental constituent of the Ethereum blockchain, the EVM wears many hats. For one, it executes and terminates smart contracts, and detects if a dApp is deterministic or if a smart contract is isolated and is used by users globally.\n\nAs a result of numerous transactions occurring at once on the Ethereum blockchain, the EVM has become slow. Unfortunately, it is difficult to upgrade since it was written in complicated code, i.e Solidity. So the most likely option was to replace it.\n\nThat’s where eWASM comes in. It was designed to replace the EVM in the Ethereum hierarchy. It speeds up the network process by computing codes fast and it is effectively compatible with various coding languages like C and C++. All of these are poised to make eWASM more accessible for the Ethereum blockchain, which in turn makes the network faster and more efficient.\n\nPhase 3\n\nThis phase — a miscellaneous stage — was reserved for any extra upgrade that might have been needed before Ethereum 2.0 was launched completely. For example, creating extra Shard chains to add to the original 64 chains, heightened privacy on the network, or improving the overall technology on the blockchain.\n\nIt was estimated that each phase of Ethereum 2.0 would require about six to eight months to come to total fruition. Admittedly, the long-awaited Ethereum merge finally came, in mid-September 2022. The Ethereum Foundation however remarked that the complete transition to Ethereum 2.0 would occur in 2023, as the network was highly dynamic and ever-evolving.\n\nWhy Shift to Ethereum 2.0?\n\nOver time, the Ethereum network was faced with some constraints that were affecting its efficiencies like scalability, accessibility, and security.\n\nUsers, at times, had to pay over 100% in gas fees and extra costs just to undergo minimal transactions. Plus, the network struggled to approve transactions rapidly too.\n\nAll of these necessitated the need to improve its blockchain network to achieve an expansive level of adoption from investors. This is because Ethereum finds use in dApps — which are beneficial in governance, supply chain, finance, education, etc.\n\nTherefore, Ethereum developers — led by the creator, Vitalik Buterin — established a proposed upgrade (Ethereum 2.0) and worked towards it. It is simply the transition of Ethereum’s consensus mechanism from a proof-of-work (PoW) model to a proof-of-stake (PoS) model.\n\nThis was in hopes to reduce the blockchain’s energy consumption by 99%, and make the network faster, more scalable, and more secure to utilize.\n\nWhat Are the Benefits of Ethereum 2.0?\n\nPreviously, Ethereum was held back by some technical limitations, but all these changed with the advent of Ethereum 2.0. These are the benefits:\n\nLess Computation Power, More Eco-friendly\n\nAs opposed to the proof-of-work (PoW) model which involves using sophisticated power to solve complex equations, the proof-of-stake (PoS) model — which Ethereum 2.0 utilizes — doesn’t require such. This in turn makes it to be more eco-friendly as a single PoW transaction is reportedly said to consume as much energy as an average U.S. household in a week. Moreover, the hardware is said to generate electronic waste also.\n\nIncreased Scalability and Efficiency\n\nEthereum 1.0 computed about 25 to 30 transactions per second, but Ethereum 2.0 is said to handle 100,000 transactions per second. This increased Scalability is possible due to the Sharding technique.\n\nSharding enables Ethereum to store and access data, plus “Shard chains” would be utilized in transactions which makes it reportedly 64 times faster than the previous blockchain version.\n\nMaking ETH a more Deflationary Asset\n\nDue to the merge, issuing Ether as block rewards would greatly reduce. There are reportedly about 13,000 ETH mined daily. The number would reduce to 1,600 ETH daily as a result of the Merge. All of which would ensure less ETH is in circulation, thereby reducing its inflationary quality.\n\nHigher Security Level\n\nEthereum 2.0 needs a minimum of 16,384 validators, enabling a decentralized network and thus securing the blockchain, by reducing the attack surface area. This prevents a 51% attack from occurring on the network.\n\nMore Network Participation\n\nWith lower hardware requirements, more people can participate in Ethereum 2.0. By using Sharding, validators don’t need to store data by themselves. They can instead employ data techniques to confirm that the data has been made usable by the network. Moreover, more users can join in the staking process — provided they have 32 ETH to lock in — thereby increasing network participation.\n\nReduced Costs\n\nWith the PoW model, there was a high cost of hardware equipment, gas fees, and electricity bills. All of these are not present in Ethereum 2.0, as the PoS model doesn’t require as much hardware (with Sharding) and doesn’t have to pay miners gas fees, as the validators who stake ETH secure the network indirectly.\n\nWhat Are the Risks of Ethereum 2.0?\n\nThe Ethereum merge is the most significant upgrade to a blockchain network and it doesn’t come without its risks:\n\nPossible Scams\n\nSome crypto-related organizations pretend as though ETH (Ether) was what was updated to Ethereum 2.0, by calling it “ETH 2.” This is in a bid to get users to swap their ETH for the so-called ETH 2 and scam them.\n\nFeasible drop in ETH Value\n\nIf things go awry after the merge, it is possible that the value of ETH would drop, as well as other cryptos that are built on the Ethereum blockchain.\n\nWhat is the Future of Ethereum?\n\nThe crux of an updated Ethereum network (Ethereum 2.0) is to enable it to process more transactions speedily while being secure and accessible.\n\nWith the transition to a PoS model from the PoW model and the advent of Sharding, expectations — from industry experts and enthusiasts alike — are high. It is expected that the merge would have an all-encompassing impact on the DeFi space. Time would tell what would happen though."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMzAvZGVmbGF0aW9uYXJ5LWV0aGVyLWlzLXVuZGVycGVyZm9ybWluZy1iaXRjb2luLWhlcmUtYXJlLTMtcmVhc29ucy13aHkv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8zMC9kZWZsYXRpb25hcnktZXRoZXItaXMtdW5kZXJwZXJmb3JtaW5nLWJpdGNvaW4taGVyZS1hcmUtMy1yZWFzb25zLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Deflationary Ether Is Underperforming Bitcoin, Here Are 3 Reasons Why - CoinDesk",
        "content": "\"For most macro investors, BTC is the obvious on-ramp into the crypto market – the most liquid, the widest range of on-ramps. We see this in the strong increase in BTC spot volumes (while ETH spot volumes have not risen much), surge in the open interest on CME and stronger positioning in the options market,\" Noelle Acheson, author of the popular \"Crypto Is Macro Now\" newsletter, said."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LnlhaG9vLmNvbS9lbnRlcnRhaW5tZW50L2V0aGVyZXVtLW5hbWUtZXZlcnl0aGluZy1rbm93LWxhdGVzdC0yMzAwMDAwOTkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Name Service- Everything You Need to Know About the Latest Trends & Milestones - Yahoo Entertainment",
        "content": "2022 was an incredible year for ENS, with record amounts of new users, name registrations and revenue. New trends in web3 brought together communities to rally around different categories of ENS names, and marketplaces evolved to provide support including new categories, analytics capabilities, and tools to improve the user experience. Major companies, influencers and celebrities began to adopt ENS names as they explored the metaverse and built their web3 identities. This article spotlights recent trends, metrics, builders & adopters in the space, and all of the latest from ENS Labs including an interview with ENS Labs’ Executive Director, Khori Whittaker.\n\nCore ENS Updates\n\nENS by the numbers:\n\n2.8m ENS domains created\n\n70k ENS have set an avatar\n\n$72m spent on registrations\n\n$13m spent on renewal\n\n74% of eligible addresses have claimed the ENS token airdrop from fall 2021\n\nThese stats were provided from ENS Labs developer Makoto’s expansive Dune analytics dashboard for ENS, which contains numerous charts, data points and other analytics resources. There are also useful public financial reports by ENS Labs founder Nick.eth on Google, including DAO token holdings and adjustable charts to view their current revenue.\n\nBack in the fall, the company behind ENS Domains changed their name from True Names Limited to ENS Labs. The normalization process led by ENS Labs developer Raffy.eth, which will further standardize which ENS names are acceptable for registration, is ongoing. He said recently that the registration of invalid names has decreased, which will lead to less impact on users once normalization goes live. Some of the more speculative activity around ENS trading revolves around predicting which currently invalid names will be valid once normalization is completed.\n\nCommunity members are strongly encouraged to participate in the DAO, which hosts several categories of content rich discussions that anyone can join. For a one stop shop of the main issues being discussed at any given time, the DAO has a useful dashboard on their discussion forum which contains a calendar, proposal drafts, and information on their 3 working groups including budget requests, public DAO calls, and names of the current stewards of each group. One recent notable discussion includes the sale of 10,000 ETH for USDC, which represents 25% of the DAO’s Ethereum holdings.\n\nA Conversation With ENS Director, Khori Whittaker\n\nONE37pm recently sat down with Khori Whittaker, Executive Director of ENS Labs, for an interview about the past, present and future of the highly successful Ethereum blockchain based domain service. Khori joined ENS Labs just before the surge of interest in ENS in early 2022. His prior experiences in business development, recruiting, and education have helped him scale the company, which has grown tremendously since its humble beginnings in 2017. In the interview, Khori highlighted how the DAO functions similarly to the board of a traditional company. Due to the elevated level of scrutiny and input going into each decision, ENS Labs is uniquely positioned to grow in a transparent, ethical and sustainable way.\n\nKhori sees ENS expanding into an “every day, everyone” name service. The NFT and blockchain space can be cumbersome at times, and the new, in-house educational materials being created by ENS Labs will become an essential first step for new users entering web3. Gamifying the experience and earning achievements, POAPs or badges for setting your primary ENS, adding an avatar & contact information, and utilizing other features will help new users begin to make their web3 imprint in a fun and exciting way.\n\nOn the topic of TLDs, Khori doesn’t anticipate ENS following the path of some competitors and issuing additional TLDs for sale, though he mentioned private businesses or government entities may opt to use personalized TLDs for application of blockchain based domain technology, similar to the Coinbase integration of .id domains. There are potential Government use cases being actively explored such as permits, identification, registration for various services, and even taxes. For that reason, he mentioned place names as one of the more interesting categories in ENS right now.\n\nOne exciting recent integration of ENS is by the .ART domain extension, which was the first TLD to receive permission from ICANN to extend the WHOIS (Registration Data) field for the purpose of identifying assets, a patented technology they call the .ART Digital Twin. They seek to use web3 technology to help creators create certificates of authenticity for their artwork. Another new use case for ENS involves Mailchain, an open source protocol dedicated to helping web3 users communicate via email.\n\nENS integrations are so popular with web3 users to the point that without them, the user experience becomes more complicated. Many users who played Yuga Lab’s recent Dookey Dash game remarked that the leaderboard hadn’t integrated their primary ENS names, making it difficult for players to flex their scores.\n\nSoon: Name Wrapper\n\nOn January 16th, jefflau.eth posted an update on the ENS DAO forum announcing that the highly anticipated name wrapper for ENS domains was redeployed on Goerli testnet after a thorough audit. The contracts are being tested for at least two weeks before consideration for deployment on mainnet, which is also contingent upon the release of the highly anticipated ENS V3 contract. ENS Labs developer domico.eth recently posted a thread on Twitter explaining some of the technical aspects of how subdomains work and how it ties into V3. Based on the information provided, it doesn’t appear the name wrapper will be released until after Q1 2023.\n\nWhat's New with ENS Vision?\n\nIn May of 2022, the Ethereum Name Service hit a milestone that took over five years to achieve since its launch – one million name registrations. With the release of ENS Vision’s bulk registration tool at the end of May, ENS registrations saw explosive growth in numbers. In a matter of a few months, the number of ENS registrations quickly doubled and surpassed over two million names created at a record pace. Impressively, ENS Vision’s bulk registration contract continues to facilitate over 30% of all monthly ENS registrations since its release.\n\nENS Vision launched its ENS exclusive aggregated marketplace in late July of 2022 and has since quickly grown from 0% of all ENS volume to now over 70% of all ENS daily volume over time in a short 6-month period. The exchange is set to surpass 20k ETH in total volume, 100k total sales, and 10k total users in Q1 2023. With over 17.5 million page views and over 700,000 unique users, ENS Vision has rapidly become the one-stop shop for everything ENS.\n\nNew features include a sweep feature, bulk renewal, bulk listings, and bulk transfer. One of the most interesting new features includes a “renewal sync,” allowing you to renew multiple names at different intervals to sync their expiration on the same day. Using usewinter’s new service, domains can now be purchased via credit card. More tools, features and verified collections are planned for 2023.\n\nImage credit: reservoir0x\n\nThanks to work by Reservoir0x, ENS Vision is now integrated with Dune Analytics. Some of the stats include:\n\nTotal ENS Names fill volume over time for all marketplaces (measured in ETH)\n\nPercentage of sales filled by ENS Vision\n\nPercentage of volume by ENS Vision\n\nMeetups, Builders & Advocates\n\nIn November, the ENS Labs team represented at the ETHGlobal hackathon in San Francisco with a booth, stickers, swag and printable ENS nametags. They also offered 5 bounty tiers for the best integration, giving away over $10k USD. They plan to attend ETHDenver in February and ETHDubai coming up later in March. Keep an eye out for exclusive POAPs for attending ENS related events, including this one for DEVCON BOGATA by @theaxents.\n\nImage credit: ENS Bogata POAP\n\nBack in July, Gregskril.eth created a website to assist ENS advocates in onboarding new users. The ENS Fairy UI allows you to register and gift an ENS name, saving the user 3 transactions. The ENS Ecosystem Working Group recently announced an expansion of the ENS Fairy concept with a proposed allocation of 174 ETH for ENS DAO to purchase domains off of premium expiration, to help the adoption of ENS and compete with speculators. Join the discussion in this thread and if you hold ENS tokens, make sure to vote.\n\nSadaf.eth, who has been featured in ONE37pm’s prior ENS articles and previously served as Community Manager for ENS Vision, has taken a role at the Ethereum Name Service as a community advocate.\n\nBishara.eth, an Arabic speaker and ENS domain researcher, recently made a channel dedicated to ENS with daily analysis, instructional videos, and resources in both English and Arabic. I recently used his video guide and a guide on the official ENS support site to make a decentralized website which links to my primary ENS. Bishara’s ENS DAO proposal for an Arabic educational channel recently passed, receiving 540k votes in the second round.\n\nAuthor of The Network State Balaji Srinivasan recently made a thread about ENS which garnered attention, saying “Email lists are good, ENS lists will be better.” He lamented the centralized nature of email and possibility of censorship, saying “email has become largely centralized by things like sender reputation.” He recently discussed use cases for ENS domains on Lex Fridman’s podcast.\n\nDecashed, an organization run by ENS advocate Sean Murray, had their first 10k club meetup in NYC during the 2022 Thanksgiving break.\n\nImage credit: Decashed\n\nTop Recent Sales & Notable Milestones\n\nPokemon Gen1 and trainers are trending, and other collectible related ENS names are gaining interest.\n\n333.eth for 100Ξ, 021.eth for 38Ξ and American.eth for 31Ξ\n\nIn the past 30 days, the 10k club had ~1200Ξ volume and 999 had ~600Ξ.\n\nArabic 999 club recently passed 3000Ξ total volume. Matt Higgins recently joined the community, purchasing ٤٣٣ (433) in Arabic. His recent thread calling for users to share their reasonable single word domains went viral. Fine art & documentary photographer Princess Reem alFaisal, the granddaughter of King Faisal of Saudi Arabia, has recently been sporting digit ٧٩١ (791) in Arabic.\n\nImage credit: ENS Vision\n\nENS Competitors\n\nLas Vegas based Unstoppable Domains Inc. recently received a patent for Resolving Blockchain Domains on January 17th, 2023. Unstoppable Domains was one of the first domain services on Ethereum, founded in 2018. They released 7 new TLDs in late 2022, adding to their existing Ethereum TLD .crypto and Zilliqa TLD .zil, partnering with Gemini (crypto exchange), Opera (Browser), Circle (USDC) to attempt to onboard more users into web3.\n\n\n\nA few NFT projects sprung up recently with intentions to become domain services on Ethereum. EPBTO uses IPTokenRenderer to place all of their .IP extension metadata on-chain, and has special protections against special character registrations that have traditionally resulted in attempts at fraudulent domain sales. Linagee domains, one of the earliest Ethereum contracts, saw a spike of interest in October after its “rediscovery” and release of a new wrapper, but has seen only a few Ethereum in .OG purchase volume over the past 30 days. With no integrations, projects like these should be considered aspirational domain projects, and users are encouraged to scrutinize any new blockchain based protocols closely before getting involved.\n\nENS in 2023\n\nThe Ethereum Name Service continues to expand its global reach and adoption in 2023, and according to Executive Director Khori Whittaker, “ENS has a solid, bright future ahead.” The release of the name wrapper this year will open new doors with integration possibilities, and change marketplace dynamics, with some trading volume likely moving into grail subdomains. ENS trading volume saw record highs in 2022 despite a bearish macro market in the crypto sector, and that trend is likely to continue as developers continue to expand the marketplaces, tools, and data available to the community. To create the best customer experience, integrating of ENS is a must for web3 projects, and the ENS Labs footprint is sure to expand exponentially as ENS Labs developers explore the possibility of deployment on Layer 2 solutions built on Ethereum."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vaGFja2Vybm9vbi5jb20vd2hhdC1pcy10aGUtZG93bnNpZGUtdG8tc3Rha2luZy1ldGhlcmV1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "What Is the Downside to Staking Ethereum? - hackernoon.com",
        "content": "What Is the Downside to Staking Ethereum?\n\nToo Long; Didn't Read The process of staking Ethereum has become increasingly popular in recent years. As with any investment or financial decision, staking has potential downsides. These include the risk of losing your stake if the network is compromised, the potential for high volatility, the need for significant technical knowledge, and the lack of liquidity."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tLzYwLW9mLWludmVzdG9ycy1iZWxpZXZlLWV0aC1oYXMtYmV0dGVyLWdyb3d0aC1wb3RlbnRpYWwtdGhhbi1idGMtY29pbnNoYXJlcy1zdXJ2ZXktcmV2ZWFscy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "60% of investors believe ETH has better growth potential than BTC – CoinShares survey reveals - CryptoSlate",
        "content": "Around 60% of investors believe that Ethereum (ETH) has a more compelling growth outlook, according to a survey by CoinShares.\n\nAs opposed to the 60% siding with ETH, only 30% of the respondents said Bitcoin (BTC) had the most compelling growth outlook, according to the CoinShares survey.\n\nThe survey included 43 investors who managed a total of $390 billion worth of assets. Among the participants, those who identified as Wealth Managers (25%) and Family Office (25%) accounted for half of the group. Another 22% and 17% identified as Hedge Fund and Institutional, respectively.\n\nYear-to-year changes\n\nIt can be seen that a bulk of investors shifted to ETH from BTC when comparing the latest results with results from 2022.\n\nThe blue columns on the chart below represent the latest results, while the red marks show the results from last year’s survey.\n\nOnly 40% of the respondents said ETH had more compelling growth potential, while only a little less than 40% chose BTC in the 2022 survey. In one year, investors who opted for ETH spiked to 60%, while the ones who voted for BTC fell to 30%.\n\nEven though investors distanced themselves from BTC, this year’s results show an increase in the number of investors who invested in it. 30% of the participants own BTC, which marks an increase from 24% in 2022, according to CoinShares.\n\nDigital assets in portfolios\n\nThe latest numbers indicated that digital assets accounted for 1.1% of portfolios, which marks a significant increase from last year’s 0.7%.\n\nHedge Funds especially have considerably increased their investments in digital assets, CoinShares data revealed. In the meantime, institutional investors reduced their digital assets to below 1%.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vdS50b2RheS81NS1vZi1ldGhlcmV1bS1ldGgtaG9sZGluZ3Mtbm93LW9uLXRoZXNlLXR3by1leGNoYW5nZXMtZGV0YWlsc9IBUmh0dHBzOi8vdS50b2RheS81NS1vZi1ldGhlcmV1bS1ldGgtaG9sZGluZ3Mtbm93LW9uLXRoZXNlLXR3by1leGNoYW5nZXMtZGV0YWlscz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "55% of Ethereum (ETH) Holdings Now on These Two Exchanges: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to the blockchain analytics platform Nansen, 55% of Ethereum (ETH) exchange holdings are held on Coinbase and Binance crypto exchanges.\n\nAdvertisement\n\nAccording to a chart provided by the blockchain analytics platform, 35% of Ethereum balances on exchanges are held on Coinbase Exchange, while those held on Binance accounted for 20%. Together, both exchanges account for 55% of the Ethereum balances held on exchanges.\n\nWhere do you keep your $ETH?\n\n\n\n55% of the 24.9M ETH exchange holdings are on Coinbase and Binance\n\n\n\nTop 5 ETH Balances:\n\n\n\nCoinbase: 8.72M\n\nBinance: 4.94M\n\nKraken: 1.97M\n\nBitfinex: 1.82M\n\nOKX: 1.25M pic.twitter.com/r4ORRmpeKG — Nansen 🧭 (@nansen_ai) January 29, 2023\n\nThe Ethereum balance on Kraken's crypto exchange accounted for 7.89%, while Bitfinex accounted for 7.31%. That held on the OKX and Gemini exchanges accounts for 5.02% and 4.66% of the total, respectively.\n\nCumulatively, 24.9 million ETH are held on exchanges. This implies that 55% of the total ETH exchange holdings are on Coinbase and Binance.\n\nNansen gives a breakdown of the top five ETH balances: 8.72 million ETH are held on Coinbase; Binance's crypto exchange retains a holding of 4.94 million ETH; Kraken, Bitfinex and OKX account for balances of 1.97 million, 1.82 million and 1.25 million, respectively.\n\nEthereum small addresses increase\n\nFollowing the mid-September Merge update, which transitioned the ETH network from proof of work to proof of stake, the number of small-sized Ethereum holders has increased.\n\nIn Q4, 2022, the number of over-one-ETH addresses climbed from 1.57 million to 1.73 million, an increase of 10.4% QoQ.\n\nThe comparatively greater percentage growth for addresses holding more than one ETH could be attributed to optimism following Ethereum's successful Merge in September and anticipation for its planned Shanghai upgrade.\n\nOn Tuesday, Ethereum engineers revealed that they had made significant advancements toward the network's expected Shanghai update, which is scheduled for around March. Stakeholders will be able to withdraw their ETH and accrued rewards after the Shanghai update."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvLm5ld3MvZW5zLWRvbWFpbnMtbWltaWNraW5nLW1ham9yLWV4Y2hhbmdlcy13YWxsZXRzLWluZGljYXRlLWEtbmV3LXR5cGUtb2Ytc2NhbS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "ENS domains mimicking major exchanges' wallets indicate a new type of scam - crypto.news",
        "content": "Today crypto.news has been investigating the activity involving the wallets of defunct cryptocurrency exchange FTX. While examining the blockchain data, we found an apparent attempt at nefarious activity involving the Ethereum Name Service (ENS).\n\nWhat is an ENS domain?\n\nThe ENS is a decentralized domain name service built on the ethereum blockchain. It provides a more human-readable format for ethereum addresses, allowing users to send and receive funds at addresses like “myname.eth” instead of the traditional long string of numbers and letters. ENS aims to make interacting with the ethereum network more accessible and more user-friendly by providing a mapping between names and ethereum addresses.\n\nThe service is decentralized and operates on a blockchain, making it resistant to censorship and control by a single entity. ENS is an important infrastructure component of the Ethereum ecosystem, facilitating the widespread adoption of decentralized applications and services built on the Ethereum network. The service does not only support ethereum addresses but also other blockchains and centralized services such as websites and instant messaging profiles.\n\nHow ENS addresses can impersonate wallets\n\nA single address registered 50 different ENS domains — most of those, if not all, are the complete hexadecimal addresses of highly active addresses with the addition of “.eth” at the end. One example is FTX address 0x2FAF487A4414Fe77e2327F0bf4AE2a264a776AD2 which is present among this peculiar collection as “0x2FAF487A4414Fe77e2327F0bf4AE2a264a776AD2.eth.”\n\nOne likely reason why those ENS domains were registered is in the hope of intercepting payments meant for the addresses that those use as domain names. Many wallets support ENS domains as addresses to which users send assets. It implies that a user sending assets to one such address would only need to misclick once to transfer tokens to the ENS domain mimicking the wallet.\n\nAlleged scammers create ENS domains mimicking crypto exchanges\n\nA quick review of the addresses with the help of blockchain analysis service Arkham Intelligence reveals that they tend to be internal addresses of cryptocurrency exchanges. We can find a Coinbase address, an FTX address, a Binance address, and many other high-profile on-chain addresses — usually multiple per entity.\n\nThe mentioned address bought a total of 50 ENS domains in March 2022 for well over $3,000 — all in compliance with the scheme described above. However, the address failed to mislead any network participant into sending funds to the wrong recipient. It has been involved in 102 transactions in total: two for funding its ENS domain shopping and 100 for acquiring and receiving the domains in question.\n\nA visualization of the on-chain activity: funding address (top left), compulsive ENS shopper (bottom left), ENS smart contract (top right.)\n\nThere is one possible reason why no funds were mistakenly sent to the owner of those ENS domains. The addresses involved tended to be ones meant for internal use. Due to this choice, the transactions that could have been misled were sent by those working in the crypto industry. Most likely, they were using a very specific wallet infrastructure that only sent to whitelisted addresses and probably did not support ENS in the first place.\n\nDespite this, there is still plenty of time for somebody to make a mistake considering that those ENS domains will only expire in about four years.\n\nThe findings follow a recent report that Reddit users on the r/CryptoCurrency subreddit raised alarm bells regarding a potential Shiba Inu (SHIB) airdrop scam.\n\nFollow Us on Google News"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbmdhcGUuY29tL3ByZW1pZXItbGVhZ3VlLXNpZ25zLW5mdC1kZWFsLXdpdGgtdGhpcy1ldGhlcmV1bS1wcm9qZWN0L9IBUmh0dHBzOi8vY29pbmdhcGUuY29tL3ByZW1pZXItbGVhZ3VlLXNpZ25zLW5mdC1kZWFsLXdpdGgtdGhpcy1ldGhlcmV1bS1wcm9qZWN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Premier League Signs NFT Deal With This Ethereum-based Game - CoinGape",
        "content": "The Premier League and Sorare, a $4.3 billion fantasy soccer game, have agreed to a multi-year agreement under which the Premier League will license official player cards. According to the exclusive multi-year arrangement, players of the game will be able to buy and use NFTs that the prestigious football league officially licenses. People can participate in five-a-side fantasy soccer matches through the Paris-based startup Sorare, which has 3 million users globally. The players’ on-field performance in the present determines the likelihood of success.\n\nPremier League’s NFT Deal With Sorare\n\nIn addition to this, the Ethereum-based fantasy sports game has announced that it would be adding two additional features to the game. These include the opportunity to compete using player cards that are particular to a league and a feature called “financial fair play” that restricts users from picking all-star teams.\n\nadvertisement\n\nRead More: Check Out The Top Crypto Telegram Channels Of 2023\n\nIn October of 2022, it was rumored that Sorare was in licensing deal discussions with the Premier League, which is the top level of men’s soccer competition in England. The conclusion of these matters took longer than expected, according to Nicolas Julia, the CEO of Sorare. This was due to the fact that the Premier League already had an NFT licensing arrangement in place with another company. It was rumored that ConsenSys won the bid to secure the deal worth as much as UK£400 million or $459 million. But as the “crypto winter” wiped off a large portion of the formerly enormous resources accessible to businesses in the blockchain sector, this deal came crashing down.\n\nWhile speaking on Sorare, Julia was quoted as saying:\n\nSorare trended very differently from the rest of the space. Total exchanges of cards on the platform amounted to $500 million last year, almost doubling from $270 million in 2021.\n\nGrowing Sports Deal In Crypto\n\nAccording to the data provided by CryptoSlam, the Sorare NFT collection is the third largest in the world. And, as per the numbers provided by the platform, the company handles approximately one million dollars worth of transactions in a single day. The venture capital companies Accel and Benchmark, as well as Japan’s SoftBank, are among the prominent organizations that have invested in Sorare. In addition to these, well-known athletes like Lionel Messi, Serena Williams, and Kylian Mbappe are stockholders in the company.\n\nThe Premier League’s collaboration with Sorare is a recent example of the growing number of deals happening between different sports leagues and crypto platforms. In the past, Sorare has announced partnerships with both Major League Baseball and the National Basketball Association.\n\nAlso Read: Yuga Labs Co-Founder Steps Down From Everyday Operations Due To This Reason"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZXh0ZW5kLWdhaW5zLXNvbGFuYS1sZWFkcy_SAUFodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWV0aGVyLWV4dGVuZC1nYWlucy1zb2xhbmEtbGVhZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin, Ether extend gains; Solana leads among top 10 - Forkast News",
        "content": "Author profile\n\nPradipta Mukherjee is a business reporter and has worked for Bloomberg News and Business Standard in India. An MBA and a post-graduate in Economics, Mukherjee focuses on financial markets and corporates. She is a Mary Morgan Hewett award recipient for Women in Journalism. She has also won the Jefferson Fellowship; the Thomson Reuters Foundation fellowship on ‘Social Media and Digital Journalism’ at The Chinese University of Hong Kong; the Kiplinger Fellowship at Ohio University, USA; and most recently, the National Press Foundation's fellowship on 'International Trade.'\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy0yMzYwMC1zb2xhbmEtZXRoZXJldW0tYm5iLXJpc2VzLXVwLXRvLTYtMzY4MDQ4LTIwMjMtMDEtMzDSAYgBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWhvbGRzLTIzNjAwLXNvbGFuYS1ldGhlcmV1bS1ibmItcmlzZXMtdXAtdG8tNi0zNjgwNDgtMjAyMy0wMS0zMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $23,600; Solana, Ethereum, BNB rises up to 6% - Business Today",
        "content": "Top crypto tokens were trading higher on Monday, thanks to gains in Bitcoin which flirted with $24,000 level over the weekend. Markets have remained largely hopeful the past week despite conflicting economic data and worrisome fourth quarter earnings reports.\n\nBitcoin was able to hold weekend gains and was firm above $23,500 level. Its largest peer, Ethereum was comfortable above $1,600-mark. Other Altcoins also posted decent gains.\n\nBitcoin hovered at $23,946 level over the weekend as markets continued to react to the US personal consumption data and the rise of investor sentiment. It is the highest level since August 2022, said Edul Patel, CEO and Co-founder at Mudrex.\n\n\"However, BTC is currently trading above the $23,600 level and rose by 2 per cent over the previous day. If bulls can hold BTC above the current level, the impulse may continue towards $24,000 and $25,000 soon. The volume is also high, indicating the buyers' strength in the market,\" he said.\n\nBarring the US dollar pegged stablecoins, all top crypto tokens were trading higher on Monday. Solana surged 6 per cent, followed by Ethereum and BNB. Bitcoin and Polygon also added 2 per cent each during the early trade.\n\nThe global cryptocurrency market cap was trading higher at $1.08 trillion mark, rising about 2 per cent in the last 24 hours. However, the total trading volumes surged 24 per cent close to $49.64 billion.\n\nBitcoin is hitting new three month highs, boosted by institutional buying, wider adoption, and infrastructure improvements. Institutional investors are increasingly taking notice of cryptocurrencies, with companies like Tesla and Square investing in Bitcoin, contributing to demand and higher prices, said Sathvik Vishwanath, co-founder & CEO at Unocoin.\n\n\"Market sentiment plays a big role in the value of Bitcoin, with rising demand and belief that the price will rise to cause a self-fulfilling cycle. However, there is always the risk of market volatility and regulatory changes that may impact growth,\" he said.\n\nCrypto updates\n\nLawyers for Sam Bankman-Fried have argued he should be allowed access to assets and crypto held by his former company FTX, saying there's no evidence he's responsible for previous alleged unauthorized transactions.\n\nEmails obtained by CoinDesk shed new light on the ongoing debate over the opaque and disputed ownership of WazirX, India’s largest crypto exchange. In November 2019, the ownership of WazirX was uncontested: Binance published a blog post saying that it had purchased the Indian exchange. WazirX’s executives talked openly about the acquisition.\n\nTech View by Giottus Crypto Platform\n\nPolygon (MATIC), the popular layer 2 blockchain, has had a great 2022 in terms of its adoption and partnerships. Now, its token seems to be reflecting the added value, having gone from $0.75 earlier this month to nearly $1.2 today.\n\nOn its way, it has cleared several resistance levels, made higher highs and higher lows, and continued to hold its price. With such momentum, short term target of $1.3 (its last high in November) is certainly in play, but with its 200-day EMA untested throughout the month ever since its breakout, there may be some consolidation first. A confluence of resistances and an overbought RSI in the vicinity of the $1.2 level also suggest a path that may see a test of $1.04 first for MATIC.\n\nMajor Levels:\n\nSupport: $1.10, $1.04, $1.0\n\nResistance: $1.25, $1.30\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: ‘NFTs can help bring art closer to people': Actor Lisa Ray\n\nAlso read: Stocks in news: Tata Motors, NTPC, Vedanta, L&T, Tech Mahindra and more"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8zMC90b3AtYW5hbHlzdC1zYXlzLW9uZS1ldGhlcmV1bS1iYXNlZC1hbHRjb2luLWlzLXJlYWR5LXRvLWJyZWFrLW91dC11cGRhdGVzLW91dGxvb2stb24tdGhyZWUtYWRkaXRpb25hbC1hbHRjb2lucy_SAZQBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDEvMzAvdG9wLWFuYWx5c3Qtc2F5cy1vbmUtZXRoZXJldW0tYmFzZWQtYWx0Y29pbi1pcy1yZWFkeS10by1icmVhay1vdXQtdXBkYXRlcy1vdXRsb29rLW9uLXRocmVlLWFkZGl0aW9uYWwtYWx0Y29pbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Top Analyst Says One Ethereum-Based Altcoin Is Ready To Break Out, Updates Outlook on Three Additional Altcoins - The Daily Hodl",
        "content": "An analyst closely followed in the crypto space says that one altcoin operating on the Ethereum (ETH) blockchain is ready to run, and has updates on three other digital assets.\n\nMichaël van de Poppe tells his 647,000 Twitter followers that Ethereum scaling solution Polygon (MATIC) is likely presenting an opportunity for a 60% gain if it provides the right entry at around $1.\n\n“This looks ready to break upwards significantly.\n\nWould be interested in buying around $1 for a retest and then it could run towards $1.60 quite easily.”\n\nThe analyst also has his radar locked on Ethereum competitor Avalanche (AVAX). According to Van de Poppe, AVAX bulls may want to wait for about a drop to a demand level near $17.50 before going long on the smart contract protocol.\n\n“Same point here. We could be looking at a case of continuation, but you’d definitely don’t want to chase the trade. Entries around $17.50 are doable.”\n\nNext on the trader’s radar is decentralized exchange protocol Injective (INJ). Van de Poppe says that INJ, which is already up about 40% in the last seven days, may not present any playable opportunities until it corrects to $2.30 or to $2.08 for longer-term trades.\n\n“Strong runner here, but points of interest are a bit lower.\n\nI’d be interested for a bounce play at $2.30 and for swing plays at $2.08″\n\nLastly, Van de Poppe looks at Verasity (VRA), an Ethereum-based altcoin focused on serving the e-sports, gaming, non-fungible token (NFT) and video economies. He says that while VRA looks very strong, bulls should wait for a roughly 40% correction down to the $0.004 range before opening a position.\n\n“This one looks strong and made a massive 250% run already.\n\nThrough that, I’d be patient on entering honestly.\n\nYou’d be interested once a correction takes place towards $0.004.\n\nThat’s the region for me before a new expansion upwards happens.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Terablete\n\nGenerated Image: DALLE-2"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9vcGVuc2VhLXNlZXMtYS1zcGlrZS1pbi1ldGhlcmV1bS1iYXNlZC1uZnQtc2FsZXMtdGhhbmtzLXRvLXRoZXNlLWZhY3RvcnMv0gFjaHR0cHM6Ly9hbWJjcnlwdG8uY29tL29wZW5zZWEtc2Vlcy1hLXNwaWtlLWluLWV0aGVyZXVtLWJhc2VkLW5mdC1zYWxlcy10aGFua3MtdG8tdGhlc2UtZmFjdG9ycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "OpenSea sees a spike in Ethereum-based NFT sales, thanks to these factors - AMBCrypto News",
        "content": "Ethereum-based NFTs on OpenSea saw its highest monthly sales volume since August 2022.\n\nOpenSea saw increased activity in the last 30 days.\n\nWith Blue Chip non-fungible tokens (NFTs) collections at the forefront, the year has so far seen a resurgence of interest in profile-picture (PFP) NFTs.\n\nEthereum-based NFT sales have soared to a four-month high on leading marketplace OpenSea, according to data from Dune Analytics. The monthly sales volume is expected to close the trading month at its highest level since August 2022.\n\nSo far this month, the sales volume of Ethereum-minted NFTs on OpenSea has totaled $409 million. This represented a 21% increase from the $283 million logged as sales volume at the end of 2022.\n\nThe recent increase in sales volume can be attributed to a surge in the number of Ethereum-based NFTs sold on the OpenSea marketplace.\n\nIn the last 28 days, 1.03 million Ethereum-minted NFTs have been sold on the leading NFT marketplace. According to data from Dune Analytics, this represented a two-month high in the sales count of Ethereum-based NFTs on OpenSea.\n\nIn addition to the surge in the sales volume and count of Ethereum-based NFTs on OpenSea, the marketplace itself has seen increased traction since the commencement of the 2023 trading year. Per data from DappRadar, in the last month, the transactions count on OpenSea grew by 9%.\n\nThe growth in transactions count of the decentralized application (dApp) resulted in a rally in sales volume. In the last 30 days, sales volume on OpenSea grew by 62%. All of these happened, despite the 1.21% decline in the count of unique active wallets within the period under consideration.\n\nEthereum is king\n\nIn the NFT vertical of the crypto ecosystem, Ethereum-based NFTs have seen the most sales in the last month. According to data from CryptoSlam, NFTs sales from the Ethereum chain in the last 30 days totaled $745 million.\n\nWithin this period, 207,719 buyers and 211, 813 sellers participated in 1.91 million sales transactions on the chain.\n\nWhat is the market saying?\n\nBlue Chip NFTs have grown in value since the year started. These NFTs are a subcategory of the broader NFT market that is of high quality and value. Examples include Bored Ape Yacht Club [BAYC], Mutant Ape Yacht Club [MAYC], Crypto Punks, and Meebits.\n\nAccording to NFTGo, the Blue Chip Index is calculated by weighing the market capitalization of Blue Chip NFT collections to determine their performance. So far this year, the Blue Chip Index has climbed by 6%.\n\nAs for the general market, market capitalization and sales volume have gone up by 7% and 21%, respectively, in the past 28 days."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZGFpbHljb2luLmNvbS9wcmVzcy1yZWxlYXNlcy9idWRibG9ja3otYmx1bnQtaXMtZ2V0dGluZy1tb3JlLXRyYWN0aW9uLWFuZC1jcnlwdG8tZXhwZXJ0cy1jb21wYXJlLWl0LXRvLWV0aGVyZXVtLWV0aC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "BudBlockz (BLUNT) Is Getting More Traction and Crypto Experts Compare It to Ethereum (ETH) - DailyCoin",
        "content": "Crypto analysts are constantly assessing new cryptocurrencies to find market potential. Their goal is to recognize and recommend tokens that may soon be claiming the top spot. It is tough to predict which tokens will deliver multifold returns.\n\nAnalysts make predictions based on business plans shared by new projects. For example, BudBlockz (BLUNT) has come up with a unique solution for millions of cannabis enthusiasts around the world. It aims to be the world’s first e-commerce platform for cannabis trading. Experts believe it may experience the same success as Ethereum ($ETH) and other top-ranked tokens.\n\nBudBlockz: Inviting Cannabis-Enthusiasts to Invest in the Fast-Growing Cannabis Industry\n\nPeople have been using cannabis since ancient times. Experts believe that people from central Asia started using this plant for medicinal and recreational purposes. It gradually became popular across the globe and attracted millions to its euphoric effects.\n\nA report reveals that up to 80% of Americans wish to legalize marijuana. They want to buy it legally and use it wisely to experience associated benefits. Eighteen states have already legalized this product, with many new states possibly decriminalizing it in the upcoming months or years.\n\nBudBlockz aims to benefit crypto investors by offering ways to invest in cannabis-related businesses. It has a solid roadmap to succeed and if it works, that success will make BLUNT an extremely popular cryptocurrency.\n\nUsing decentralized technologies to unite the cannabis industry\n\nThere is no other decentralized platform trying to unite the cannabis industry. BudBlockz is the first of its kind to offer a complete ecosystem for the marijuana sector and will grant opportunities to trade and invest in top-quality products. In addition, it will open licensed dispensaries across the globe to make top-quality cannabis products available.\n\nBudBlockz will use decentralized technologies to protect users’ information and provide easy access to logistics data. It is currently focusing on building a community of cannabis enthusiasts. The BLUNT community will play an essential role in growing and popularizing BudBlockz across the world.\n\nDevelopers have ensured that every potential user can easily access and navigate this platform. It helps users learn the latest legislation in their jurisdictions and provides information on products, and where they can access them legally. BudBlockz is establishing itself as a one-stop destination for learning everything about cannabis trading.\n\nProviding Ganja Guruz NFTs for fractional ownership\n\nBudBlockz will establish cannabis farms and dispensaries and will partner with local businesses to produce top-quality products. Licensed dispensaries will distribute products sourced from all over the world.\n\nSince the cannabis industry is growing fast, many people want to invest in marijuana-related businesses. BudBlockz is using NFT technology to provide fractional ownership – with users needing the Ganja Guruz NFTs to invest in cannabis enterprises.\n\nUsers who complete the KYC process will get the opportunity to have a stake in farms or dispensaries. However, they must be eligible to own such businesses in their regions.\n\nThe Blunt Token\n\nBudBlockz has introduced the BLUNT cryptocurrency which is currently available on presale. It is a new cryptocurrency offering access to all the services offered by BudBlockz.\n\nPeople have started buying and storing the BLUNT token in their crypto wallets to gain significant returns in the long term. There is a limited supply, so invest early to gain maximum returns. Cannabis enthusiasts and crypto investors are already buying and holding large chunks of the total supply, looking to huge potential profits in the future.\n\nEthereum displays signs of recovery in 2023\n\nEthereum has been in recovery mode since the market crashed. Many unfortunate events occurred that prevented Ethereum from regaining its lost value. Even though its value is low and the recovery is pretty slow, experts believe Ethereum may soon cross the $2,000 mark.\n\nEthereum is supporting thousands of projects that require a reliable network to operate. Demands for the Ether Token may increase rapidly, and the ETH token may benefit millions of investors. As per reports, the Ethereum Foundation is sponsoring several grants to accelerate Ethereum-related academic work. The current round has funds worth $1 million and it is due February 27th, 2023.\n\nBudBlockz is the first decentralized platform for cannabis enthusiasts. Just like Ethereum, the BLUNT token is required to access valuable services provided by BudBlockz. It may soon compete with top-ranked altcoins to claim the top position and benefit investors in the long term."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vdS50b2RheS9wb3J0YWwtZmFudGFzeS10aGUtbWFnaWNhbC1waXhlbC1ycGctdG8tYmUtbGl2ZS1vbi1ldGhlcmV1bS1ldGgtYW5kLWF2YWxhbmNoZS1hdmF4LWluLTIwMjPSAW5odHRwczovL3UudG9kYXkvcG9ydGFsLWZhbnRhc3ktdGhlLW1hZ2ljYWwtcGl4ZWwtcnBnLXRvLWJlLWxpdmUtb24tZXRoZXJldW0tZXRoLWFuZC1hdmFsYW5jaGUtYXZheC1pbi0yMDIzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Portal Fantasy, the Magical Pixel RPG to be Live on Ethereum (ETH) and Avalanche (AVAX) in 2023 - U.Today",
        "content": "Advertisement\n\nPortal Fantasy, a community-based narrative-driven RPG supercharged by leading smart contract platforms, aims at redefining blockchain gaming with a player-first approach.\n\nPortal Fantasy invites GameFi enthusiasts to journey into the lands of the unknown\n\nUnveiled in Q1, 2023, Portal Fantasy is a free-to-play browser-based pixel RPG powered by the Ethereum (ETH) and Avalanche (AVAX) network. The game is set in a backdrop of a riveting and deeply engaging narrative that weaves its plot and gameplay seamlessly to create a familiar yet unique experience. Players can explore, battle, and create in the virtually unlimited number of worlds as they join hands with the brave Heroes and Architects.\n\n✨We're thrilled to reveal the Portal Fantasy trailer!✨\n\n⸜(｡˃ ᵕ ˂ )⸝\n\n\n\nA quiet day. A flickering monitor. A mysterious portal and a cat that wished he had thumbs. Through a series of dangerous and magical quests - uncover the secret of Portal Fantasy in this brave new world. pic.twitter.com/p9hA0kEo9q — Portal Fantasy 🔺 (@PortalFantasyio) November 28, 2022\n\nPlayers can choose from two completely unique but equally rewarding platsyles. Explore, train, and fight alongside Porbles (the magical creatures who roam these lands) as Heroes, or create brand-new worlds of their own design as Architects.\n\nImage by Portal Fantasy\n\nHeroes are tasked with exploring the vast worlds that are accessible via portals, and Architects are the ones tasked with creating them. As Heroes explore Architects' creations, they will be rewarded.\n\nThe developers had a “player first” approach when designing Portal Fantasy. The game is meant to offer a fun and memorable experience through its immersive quests and engaging narrative. The replayability offered by multiple playstyles and the potential for a long-lasting in-game community is the cherry on top. The design of the game is inspired by classic metroidvania-sque titles that offer a lot of freedom to the player. The hand-drawn classic-style pixel art harkens back to the original Pokemon titles.\n\nThe game features 30 original soundtracks designed to make the Portal Fantasy experience even more immersive. They also have a webcomic on Webtoon called Portal Fantasy with 11 chapters published at the time of writing. The events portrayed cover the epoch that started 2000 years after the War of the Goddesses between Ravenna and the Pyli Kingdom.\n\nBalanced and sustainable economy for maximum inclusiveness\n\nSimilar to many other GameFi and play-to-earn heavyweights, in Portal Fantasy , players can buy and breed their own Porbles from six different elements. New Porbles can be customized by Heroes and used to battle each other. The ultimate goal as Heroes is to capture all 100 Porbles in the Porble Index and build the best team. Porbles are Pokemon-style creatures that would be minted as NFTs. People would be able to trade Portal Fantasy NFTs outside the game on third-party platforms.\n\nImage by Portal Fantasy\n\nThe team behind Portal Fantasy aimed to create an inclusive game that was welcoming to players of all backgrounds, be it crypto enthusiasts or hardcore gamers.\n\nImage by Portal Fantasy\n\nPortal Fantasy invites both Web2 and Web3 natives: players can enjoy the game on its own without ever having to be exposed to its NFT and crypto functionalities. This allows the game to avoid the common pitfalls of the DeFi segment. For instance, the game does not depend on a constant inflow of new players. As a result, Portal Fantasy manages to entirely avoid the common criticism of crypto games being “Ponzi schemes' ' that rely on its user base rewarding itself.\n\nAdditionally, no mechanism of directly extracting value from the game exists in Portal Fantasy. Players are not required to attach their wallets prior to playing the game, this is entirely voluntary and can be done at any point.\n\nThis approach both builds trust within the gaming community and protects the game from being overrun by whales who sully the economy.\n\nMeanwhile, the game’s tokenomics is built on the top of the dual-token model: the Portal Fantasy Token (PFT) is a membership utility and governance token, while the game’s in game currency, Portal Orbs (ORB) are completely off-chain and require no monetary input from players. The total supply of PFT will be capped at 1 billion tokens. Moreover, the game’s cost of entry will remain at $0 for its entire lifespan.\n\nBeyond what has already been designed by the developers, the Portal Fantasy team is focused on building a solid, thriving and passionate community around the product. In the future, a new generation of enthusiasts will be able to create their own spin-offs of the game, with new maps, puzzles, quests and stories.\n\nPortal Fantasy release backed by suite of reputable VCs\n\nThe team behind Portal Fantasy boasts a number of heavy-hitters in the industry, with dozens of years of expertise combined among them. With alumni from veteran studios such as Ubisoft, Haemimont Games, and Ironward, who are behind some of the most notable AAA releases of recent years; it's safe to say that Portal Fantasy is in good hands.\n\nFurthermore, the development of the game has solid VC backing: its list of investors include Avalanche creators Ava Labs, top GameFi venture capitalists YGG SEA, Makers Fund, Blizzard Fund, Avalaunch, GFR Fund, Infinity Ventures, Genesis Block Ventures, Keychain Capital, C2 Ventures, Miranа, Wave Financial, D1 Ventures to name a few.\n\nWith such massive support, Portal Fantasy is set to push the boundaries in play-to-earn gaming, and will undoubtedly thin the distinction between blockchain and traditional games."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC1jcnlwdG9jdXJyZW5jeS1wcmljZXMtdG9kYXktYml0Y29pbi1hbmQtZXRoZXJldW0tdHJhZGUtaGlnaGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Jan 2023 08:00:00 GMT",
        "title": "Top Cryptocurrency Prices Today: Bitcoin and Ethereum Trade Higher - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    }
]