[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9vcGluaW9uLTMtdGlwcy1mb3ItdHJhZGluZy1ldGhlcmV1bS10aGlzLXllYXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "3 tips for trading Ethereum this year - Cointelegraph",
        "content": "Cryptocurrency is a notoriously volatile industry, regardless of what coin you’re trading. During periods of extreme volatility, it’s easy to become disheartened when trades don’t go your way. It’s also easy to become overconfident when you get lucky, falsely attributing it to your trading strategy — when, in reality, the price often rose or fell for reasons other than you assumed.\n\nDespite the uncertainty, there are sometimes still strategies you can use to trade certain tokens successfully. Ether (ETH) is arguably where you might be able to succeed this year. Here are three tips that might help.\n\nUnderstand what actually affects ETH price movements\n\nThere are many ways to analyze the price of a given cryptocurrency, and different price valuations will be given depending on the model used and how much weight is given to a specific set of conditions.\n\nBut incorrect weighting can produce erroneous conclusions. For instance, a cryptocurrency can generate positive buy signals across the board, but other factors can send the entire market tanking.\n\nNew daily reminder: $ETH will at some point clean up this $1072 area. Whether we go higher first or not pic.twitter.com/786H6iprmB — Pentoshi (@Pentosh1) January 7, 2023\n\nThis is precisely what happened with Ethereum’s Merge, where a successful transition to proof-of-stake that reduced consumption by 99.9% was not really reflected in the price. In fact, bearish traders ran the price into the ground.\n\nThe crypto market also tends to correlate heavily with Bitcoin (BTC), which is traded by a lot of institutional and hedge fund money that is tied to interest rates and traditional financial markets. ETH currently holds a 0.9 correlation with Bitcoin.\n\nLeading up to May 2021 and November 2021, ETH experienced significant price increases. This was attributed to announcements from big firms, such as the decision of the European Investment Bank to offer a two-year bond on the Ethereum blockchain. Visa also announced plans to transact in USD Coin (USDC) over Ethereum.\n\nRelated: Bitcoin will surge in 2023 — But be careful what you wish for\n\nA summary of the factors that affect the price of Ether is that it will be affected most heavily by Bitcoin’s price movement, interest rate decisions, institutional investment and macroeconomic conditions that discourage investment.\n\nFundamental blockchain indicators, however, can strongly point toward medium-term appreciation, perhaps over one to three years. Based on these indicators, Ethereum is a very powerful blockchain with a thriving ecosystem set for growth.\n\nAnticipate the seasonality\n\nLike other cryptocurrencies, ETH has specific months where it performs well, and others where it performs poorly. It performs the worst in September, June and March, meaning those may be good times to become a buyer.\n\nIn contrast, it performs well in February, April and May. This is a time for traders to issue sell orders, while buy-and-hold investors might simply avoid these months in terms of investment (though other criteria should also be taken into account).\n\nWhile there are claims that certain hours of the day are more lucrative than others for investment, studies have shown this is not the case, at least where Bitcoin is concerned. The same applies to days of the week.\n\nSeasonality of Ether pricing. Source: FXStreet\n\nEven if there are certain days or times to trade Ethereum, only active traders will be able to gauge this information correctly and withstand the increased fees of more regular trades. More realistically, seasonality can be applied on a monthly and perhaps quarterly basis for most.\n\nSeasonality is something to keep in mind as there are definite monthly trends.\n\nConsider dollar-cost-averaging\n\nA popular and research-backed means to trade Ether (and any other asset) is dollar-cost-averaging (DCA), a technique first popularized by Benjamin Graham and applied to the equity market.\n\nDCA is a means of investing smaller amounts at specific intervals. You could, for instance, invest a specific amount at the start of each month. This ensures that you get all the highs and lows (at least on a month-to-month basis), smoothing out volatility.\n\nRelated: Post-Merge ETH has become obsolete\n\nIt’s a great way for newcomers to enter the market because it requires no technical expertise or time investment. You don’t have to conduct research or learn statistical models or correlations (though you can obviously do this on the side).\n\nDCA can also be a great baseline for more creative investments, providing a stable foundation. For example, you can combine it with seasonality, choosing the three to four months where Ether has historically been priced on the low end.\n\nAt the very least, DCA can help you to avoid the volatility of the cryptocurrency markets with investment spread out across time. Holding on to your investment is as important as making profits, a fact often missed in an industry often overtaken with hype and profits.\n\nOther points to keep in mind\n\nThe upcoming Ethereum Shanghai upgrade in March will allow users to withdraw staked ETH, valued at more than $20 billion as of mid-January, though it isn’t clear whether investors will capitalize on the opportunity — which would be bearish — or continue holding their ETH, which would be bullish.\n\nFundamental indicators with regard to a given blockchain — active addresses, forks, functional upgrades, node diversification, speed, etc. — are often not factored into the price on a short time horizon. Ethereum’s Merge, for instance, reduced waste by 99.9% but did nothing for the price, being overshadowed by wider economic factors.\n\nBut these are certainly useful indicators on a longer time horizon. The work that has been done to enhance the Ethereum blockchain and ecosystem will, eventually, be reflected in its price.\n\nIn this regard, Ether is a wonderful investment opportunity for late 2023 and perhaps 2024, given recent innovations.\n\nIt is, in many ways, a perfect token for a patient investor.\n\nDaniel O’Keeffe worked for three years as a compliance analyst for JPMorgan and State Street. He holds a master’s degree in computer science from the University College Dublin and a legal degree from the University of Limerick.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzI3L2RlZmktbGVuZGVyLWFhdmUtZGVwbG95cy12My1vbi1ldGhlcmV1bS1uZXR3b3JrL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzI3L2RlZmktbGVuZGVyLWFhdmUtZGVwbG95cy12My1vbi1ldGhlcmV1bS1uZXR3b3JrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "DeFi Lender Aave Deploys Version 3 on Ethereum Network - CoinDesk",
        "content": "The upgrade is also focused on gas optimization, with Aave stating that it will reduce gas costs across all functions by 20%-25%. Gas is a transaction fee on Ethereum that is paid to validators."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vdS50b2RheS93aHktY2FuLWNvc21vcy1hdG9tLW5vdC1ncm93LWFzLWV0aGVyZXVtLWtpbGxlctIBQ2h0dHBzOi8vdS50b2RheS93aHktY2FuLWNvc21vcy1hdG9tLW5vdC1ncm93LWFzLWV0aGVyZXVtLWtpbGxlcj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Why Can Cosmos (ATOM) Not Grow as Ethereum Killer? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCosmos (ATOM) is one of the Ethereum (ETH) competitors with one of the best market capitalizations. However, it has failed to draw much attention to itself and is losing the popularity contest and capital to other so-called “Ethereum killer” networks such as Cardano (ADA), Solana (SOL) and Tron (TRX).\n\nCosmos had its launch in 2019 and was developed to be an ecosystem where multiple networks can talk to each other, as well as overcome the scalability and interoperability problems that affect many cryptocurrencies, including Bitcoin (BTC) and its rival Ethereum.\n\nThe cryptocurrency is built around a hub-based architecture, where each hub is an independent blockchain that acts as a bridge between other networks. This allows different cryptocurrencies to be exchanged and used with each other without the need for a centralized crypto exchange, strengthening the idea of an ecosystem free of a centralizer.\n\nBut why does Cosmos not grow like an Ethereum killer?\n\nFirst of all, Cosmos solves the problem of lack of communication between networks only in its ecosystem or hubs. Thus, not just any blockchain can reach Cosmos and exchange smart contracts, for example. This breaks the expectation that Cosmos could be a powerful Layer 0 network.\n\nAnother factor hindering Cosmos’ growth is the value of the token to its ecosystem. You have probably heard that developing on the Ethereum blockchain is expensive and that fees are paid through the network’s native token, ETH. However, the same importance that Ether has for the leading smart contract platform, ATOM does not have for Cosmos.\n\nOn the altcoin network, appchains can create their own logic, which makes ATOM unnecessary since this technology runs its sovereign blockchain instead of a smart contract implemented on another chain.\n\nMoreover, the ATOM community is far removed from the supporters of other ETH rivals such as Solana and Cardano. The community around it is very important for a cryptocurrency because, without it, hardly any project — even a serious one like Cosmos — can survive.Without being able to attract more of an audience to itself, the cryptocurrency may continue to lose ground not only to smart contract platforms but also to altcoins with no real value proposition, such as Dogecoin (DOGE) and Shiba Inu (SHIB).\n\nDoes this mean that Cosmos is a bad project?\n\nNo. The altcoin, even though it needs to overcome some challenges, remains in the top 10 assets with the most development activity, proving that its network is growing and that more people may soon use it.\n\nIt is also worth noting that, although it is not one of the cryptocurrencies with a large community, Cosmos is regularly present on social media, something that is also very important.\n\nIn addition, it has made important partnerships, and blockchain industry projects are using its network. A great example of this is the arrival of the DeFi dYdX protocol on its blockchain.\n\nOther advantages of Cosmos are:"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTI3L2NyeXB0by1zLWhvdHRlc3QtdHJhZGUtcmlza3Mtc3B1cnJpbmctYW5vdGhlci1sZXZlcmFnZS1idWJibGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Crypto Speculators Stoke Risks By Betting On Ethereum’s Shanghai Upgrade - Bloomberg",
        "content": "Memories are proving to be short once again in the cryptocurrency market , where speculators are piling into tokens that are helping to magnify bets on the success of the next upgrade of the Ethereum network.\n\nCoin prices have jumped across the board in recent weeks, just months after an industrywide meltdown that prompted skeptics to dust off predictions for the demise of the embryonic asset class. Among the biggest gainers — with some coins posting triple-digit increases - are tokens tied to so-called liquid staking apps, which provide Ether holders a way of earning yield without having to sell their tokens."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3NlYXJjaGNpby9kZWZpbml0aW9uL2RlY2VudHJhbGl6ZWQtYXV0b25vbW91cy1vcmdhbml6YXRpb24tREFP0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 23:00:22 GMT",
        "title": "What is a Decentralized Autonomous Organization (DAO)? - TechTarget",
        "content": "A decentralized autonomous organization (DAO) is a management structure that uses blockchain technology to automate some aspects of voting and transaction processing.\n\nDAOs are a key component of important blockchain applications, including cryptocurrency, as well as Web 3.0, a proposed architecture for the next generation of the web that relies on the decentralization enabled by blockchain.\n\nThe grand vision is that DAOs could make it easier to create decentralized organizations that respect the interests of stakeholders outside the control of any one party. They have been used to raise money for specific projects and form new kinds of business structures. They can also automate many financial processes on blockchain platforms like Ethereum to ensure that stakeholders are compensated according to rules that everyone agrees to. They are also good at automatically facilitating shared votes based on a particular level of investment, support or engagement.\n\nA blockchain-based smart contract governs a DAO's decision-making and execution.\n\nProponents talk about using DAOs to replace trust that's based on personal relationships or a central authority with a type of specially crafted blockchain program called a smart contract. However, the goal of replacing trust with code is still a work in progress. DAOs don't directly automate physical and legal processes or the communications with government entities required for filing papers, paying taxes and getting permits. Furthermore, the smart contracts that govern DAO decision-making and execution are software code, not legally binding contracts. In most cases, the consensus reached must be carried out by human agents who the participants are willing to trust. And the DAO organization itself must be incorporated to support the desired legal, business and tax structure independent of the actual code.\n\nLooking at them from another perspective, DAOs could automate the Hollywood model for making movies. The movie industry pioneered a model that enables hundreds of participants to quickly come together and develop a new film with uncertain prospects. Each participant, from A-list actor to costume designer, gets immediate compensation and a stake in the long-term success of the project. DAOs could help automate this model for other industries. People could get compensated not just at a labor rate but also for the business's success as a whole, even after they stopped actively working on it.\n\nHow do DAOs work? To start, programmers code the smart contract to describe the process for automating financial transactions, minting new coins and allocating votes. For example, should votes be allocated by total investment, grouped by cryptocurrency wallets, or based on some logarithmic curve that reduces the risk of super investors dominating the voting process? A DAO also needs a legal structure, and the U.S. Securities and Exchange Commission has declared that selling crypto tokens in a DAO requires registering them as securities. States including Tennessee and Wyoming have begun designating DAOs as entities having legal status. Investment firm Andreessen Horowitz developed a guide to the benefits and limitations of various DAO legal structures. A DAO's proponents then have to get the word out to interested investors and participants. Depending on the structure, people can participate through direct cryptocurrency contributions or by performing work that is validated through a portal or some other kind of resource. For example, a new environmental monitoring app might reward participants for contributing sensor data. A storage service might reward users for providing storage space using the interplanetary file system protocol. Once the business is running, participants may at least feel good about helping to buy some rare thing or support the legal effort for a cause they believe in. But it's also possible for a DAO to both positively impact the world and earn returns that get converted into the core cryptocurrency underpinning the token. In this case, participants would either see an appreciation in the token's value or realize some payment in the token itself or a disbursement via Ether or another cryptocurrency.\n\nBenefits of DAOs A DAO can do the following: automate the financial processes associated with a distributed organization;\n\nspeed up the fundraising process for a new idea;\n\nensure that everyone gets a fair vote in the organization;\n\nstreamline distribution of returns and gains; and\n\nimprove visibility into rules for allocating investments and decisions.\n\nDownsides of DAOs However, a DAO carries these downsides and risks: Automated smart contracts can be difficult to change when a problem is discovered.\n\nHackers can discover loopholes to legally misappropriate funds against the interests of shareholders.\n\nParticipants can pay high transaction fees of up to $100 per transaction in early DAOs.\n\nHumans are still required to execute physical and legal processes, which can thwart the intent of the DAO.\n\nGovernments are still sorting out the legal status of DAOs, which presents tax and legal risks for investors. For more on Web 3.0, read the following articles: 10 core features of Web 3.0 technology The biggest advantages and disadvantages of Web 3.0 The 10 most promising tools for Web 3.0 development 10 Web3 courses to try\n\nDAOs' effects on organizations DAOs are still a work in progress. In the near term, they will likely have the most significant impact on fundraising for specific goals. Today, services like GoFundMe can help individuals participate in causes they find worthy to pursue. DAOs could further guide such initiatives by allowing participants to vote on strategies that align with their intentions. DAOs could also soon facilitate new kinds of investment organizations and automate the process of returning funds to participants. For example, people in a particular city could commit to a decentralized loan app for their city and guide some of the decision-making about the types of loans or advertisements they want to support. If the project is successful, they could be rewarded based on the financial investment, labor or expertise they contribute to the project. Down the road, DAOs could enable the decentralized Hollywood model of investment and support. For example, participants could earn tokens for their financial support, specific expertise or the success of marketing programs as measured in user engagement."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2V0aGVyZXVtLXByZWRpY3Rpb24tZm9yLWZlYnJ1YXJ5LTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Prediction for February 2023 – Are things looking good for ETH? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Just like Bitcoin, the Ethereum price has risen sharply in recent weeks. After gaining more than 30%, the price is now above $1,550. Now it’s February and the price is faced with a decision: will Ethereum price continue to rise or will there be a crash? Let’s analyze in this Ethereum prediction for February 2023.\n\nIs Ethereum UP in 2023?\n\nIn the last few weeks, we have seen a strong increase in the Ethereum price. From under $1,200, the price has risen to over $1,500 within the last 3 weeks. Within this time, the Ethereum course was able to increase in value by more than 30 percent. The increase started in the first days of 2023 and continued relatively continuously in the 3 weeks.\n\nEthereum price in the last 30 days, source: gocharting.com\n\nThis increase was relatively parallel to the Bitcoin price increase. Bitcoin was able to rise from $16,500 to $23,000. In percentage terms, the increase in bitcoin was even higher than the increase in Ethereum. Nevertheless, the Ether token rose to a value higher than before the Ethereum merge in September.\n\nWhy will Ethereum price continue to increase?\n\nIn the past few weeks, the crypto market in general has seen a sharp rise. This was of course due to an increase in the Bitcoin price. This triggered the subsequent surges in Ethereum and other altcoins.\n\nThe increase was supported particularly strongly by falling inflation in the USA. With rising prices, many speculative investors also liquidated their positions on the foreign exchange market, which led to a further jump in prices.\n\nMost recently, a particularly large number of Chinese brought capital into the market on the Chinese New Year , which gave the market a final boost. In the last few days, prices then stabilized.\n\nWhat is the Ethereum forecast for February?\n\nAt the moment, the Ethereum price could be at a turning point. If the market remains bullish, the Ether token could go in a positive direction. However, the Ethereum price could crash again below the $1,300 mark in the coming weeks.\n\nA crash could also take on different dimensions. A slight correction would bring the Ethereum price closer to $1,400. A severe crash, for example due to a possible insolvency of the Digital Currency Group (DCG) , could even drop the Ethereum price down to $1,000 again.\n\nIf there is no correction or a crash, the Ethereum forecast for February would be slightly positive. The price could continue to rise above $1,600.\n\nEthereum Prediction for February 2023\n\nThe Ethereum forecast for the end of February depends on the scenario that will occur in the next few weeks:\n\n1st scenario: The Ethereum price sees a slight increase again and no correction. In this case, the Ethereum price should be between 1,600 and 1,800 US dollars in our forecast .\n\nThe Ethereum price sees a slight increase again and no correction. In this case, the Ethereum price should be between 1,600 and 1,800 US dollars in our . 2nd scenario: Ethereum sees another crash or correction. Barring a massive crash for now, a correction would take Ethereum price to $1,300-$1,450 on our forecast for late February 2023.\n\nIs Ethereum a good buy?\n\nAn investment in the ether token should probably be made from a long-term perspective at the moment. Because right now is a time when the Ethereum price can go in different directions, which our forecast shows.\n\nIf you believe in a further increase in the Ethereum course, you can also invest in the short term and possibly take profits in a few weeks. However, we believe that the price can increase with greater certainty in the medium term, i.e. in a few months.\n\nOffer from CryptoTicker\n\nAre you looking for a chart analysis tool that doesn’t distract you with community messages and other noise? Check out GoCharting! This is an easy-to-use online charting tool that requires no downloads or prior knowledge.\n\nClick here to get a 10% discount on your first payment (monthly or yearly)!\n\nCLICK HERE TO TRADE ETHER WITH BITFINEX!\n\n\n\n\n\nYou might also like\n\nMore from Blockchain"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24td2lsbC1pdC1jcm9zcy10aGUtMmstbWFyay1pbi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Will it Cross the $2k Mark in 2023? - Analytics Insight",
        "content": "This article features a long-term Ethereum price prediction from cryptocurrency experts\n\nEthereum is the second largest cryptocurrency in the world. It’s also one of the best altcoins, and went on a massive bull run in 2021 and increased by almost $4,000 at its highest, reaching its current all-time high (ATH) of $4,840. The coin has made new lows since then, but the project’s future has given investors hope of another price spike. But before we deep dive into our Ethereum price prediction, let’s take an overview of Ethereum.\n\nWith the recent Ethereum Merge being hailed a success, 2023 could be an excellent year for ETH. This upgrade enables Ethereum to implement sharding, which, amongst other exciting improvements, will supercharge transaction speeds on the network. Expected in the second half of 2023, sharding will push ETH transactions from 15 per second to roughly 100,000 per second.\n\nEthereum price prediction 2023\n\nEthereum’s value decreased in 2022 to US$ 1,781, but most experts predict that the price will rebound in the future. Here’s a long term Ethereum price prediction from experts below:\n\nWallet Investor, an algorithm-based crypto-asset prediction website, projected that ETH’s price could grow to over US$10,000 in November 2023 and even reach US$16,391 by the end of 2025.\n\nThe same was said by DigitalCoin, which predicts that the ETH price will average around US$7,569 in 2025 before rising to US$16,858 in 2028.\n\nAccording to net, Ethereum is forecasted to reach an average price of US$18,213 in 2025.\n\nEthereum Shanghai upgrade\n\nOne of the biggest developments coming up on the Ethereum chain is the widely anticipated Shanghai upgrade. This is an upgrade that is going to increase the number of stakers on the Ethereum platforms as well as the number of validators.\n\nThe Ethereum Shanghai upgrade will enable the validators that have staked their ETH to easily withdraw them whenever they want. At the moment, the staked Ethereum coins cannot be accessed in terms of withdrawals. This is the problem that the Shanghai upgrade is solving.\n\nThe Ethereum team is also working on the Surge upgrade, which is a protocol upgrade that will improve the chain scalability. This is another major Ethereum development that will see Ethereum price surge upon launching.\n\nConclusion\n\nUndoubtedly, much of the crypto market is very bullish on Ethereum price prediction. The coin is an essential part of the industry and without it, many of the top applications and services that have risen to popularity in the last few years would not be here today.\n\nOf course, not everyone feels the same and there are plenty of reasons some investors will not touch ETH. You don’t necessarily have to agree with them, but you must hear them out. You should be fully aware of ETH’s pitfalls as well as its benefits.\n\nDespite these bullish fundamentals, Ethereum could still struggle in the short term. Recently, ETH tapped into the $1600 resistance zone after a surge in buying activity. With prices looking extremely overextended, ETH will likely fall to between $1275 and $1225 in the coming days and weeks. From there, ETH could tumble even further if adverse macroeconomic conditions worsen.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtcmVzaXN0cy10aGUtZG93bnNpZGUtZGVzcGl0ZS1zdW5zLTE1bS10cmFuc2Zlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Ethereum [ETH] resists the downside despite Sun's >$15M transfer - AMBCrypto News",
        "content": "Tron founder Justin Sun transferred $15.5 million ETH out of his wallet to Poloniex.\n\nDespite the exchange inflow, ETH was able to resist sell pressure.\n\nOn 25 January, Justin Sun transferred 10,000 worth of Ethereum [ETH] to his Poloniex account, Lookonchain disclosed. Such large transfers were usually with the intention to sell and probably push the asset price down. Still, the Etherscan information showed that the Tron [TRX] founder had $347 million worth of the altcoin.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nThe altcoin’s strength\n\nInterestingly, ETH was able to resist the selling pressure. At press time, CoinMarketCap data showed that the altcoin registered a 3.47% uptick in the last 24 hours.\n\nFurthermore, Glassnode data revealed that the Ethereum investor capitalization was 131.22 billion. The metric measures the difference between the realized cap and thermocap.\n\nIt also serves as an indicator to evaluate bottoms in bear markets. The information from the on-chain platform showed that the capitalization has steadied around the same region since November.\n\nDespite Sun’s large inflow, Ethereum’s exchange inflow was not a notable exception. At the time of writing, the exchange inflow was 7300. This condition inferred that Sun only formed a part of those who transferred into exchanges, as others were minimal.\n\nHence, there might be a cause for increased selling pressure to send the ETH price down.\n\nThe exchange outflow was, however, lower at 5211. This implied that not many investors had recently increased their ETH long-term holdings.\n\nSlow volume and a circulation dip\n\nHowever, the uptick recovered by ETH was not followed by a significant volume spike. The volume shows the data spanning the aggregate amount of tokens involved in transactions within an interval. At press time, the volume increased by 11% to $10.25 billion.\n\nAlthough the volume increased, it was a different scenario with the circulation. The circulation shows the number of unique tokens used during a period. For the one-day circulation, Santiment showed that it was down 263,000. This means that the increase in ETH value was not enough reason to improve unique user input.\n\nHow many are 1,10,100 ETHs worth today?\n\nPrior to the time of writing, Ethereum validators ready for the Shanghai upgrade hit 500,000. However, the number seemed to have slowed down especially since it required 32 ETH to deposit into the Beacon chain.\n\nAt press time CryptoQuant data showed that there have been only 49 new depositors. With the event billed for March, investors would expect a positive outcome from it."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY3J5cHRvLm5ld3MvZGVmaS1wcm90b2NvbC1hYXZlLXYzLWdvZXMtbGl2ZS1vbi1ldGhlcmV1bS1tYWlubmV0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "DeFi protocol Aave V3 goes live on ethereum mainnet - crypto.news",
        "content": "Aave has announced the successful launch of Aave V3 on the ethereum mainnet. The latest iteration of the DeFi protocol comes with several improvements, including gas fee optimization and more.\n\nAave V3 launches on the ethereum mainnet\n\nFollowing strong backing and support from members of the Aave community, the development team has successfully integrated the third iteration of the decentralized finance (DeFi) protocol, dubbed Aave V3, on the ethereum mainnet.\n\nPer a Twitter thread by Stani Kulechov, Aave founder and CEO, Aave V3 comes with several improvements and features, including gas optimization (reduces gas cost by 20 to 25%), a high-efficiency mode for increased capital efficiency, and more.\n\nhttps://twitter.com/AaveAave/status/1618903037761945601\n\nTo make Aave V3 as hack-proof as possible, the team revealed last October that it had spent about $1.6 million on audit operations for the platform between 2020 and 2022.\n\nAt the time of filing this report, Aave protocol is the world’s 4th-largest DeFi ecosystem, with $4.56 billion in total value locked (TVL), only dwarfed by Lido (TVL $8.03 billion), MakerDAO ($7.15 billion) and Curve ($4.72 billion), according to Defi Llama.\n\nFollow Us on Google News"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNyeXB0b25pbmphcy5uZXQvMjAyMy8wMS8yNi9jYW4taS1idXktZXRoZXJldW0tb3ItaW50ZXJhY3RpdmUtYnJva2Vycy_SAVZodHRwczovL3d3dy5jcnlwdG9uaW5qYXMubmV0LzIwMjMvMDEvMjYvY2FuLWktYnV5LWV0aGVyZXVtLW9yLWludGVyYWN0aXZlLWJyb2tlcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Can I Buy Ethereum or Interactive Brokers? - CryptoNinjas",
        "content": "Interactive Brokers (IBKR) is a brokerage organization whose objective is to keep an eye on the cheap cost, brilliant transactions, and the maker’s access. The users can trade bitcoins through the platform website . Along with other options like stock, bonds, FX, and funds on more than 135 marketplaces. Moreover, this firm allows users to analyze the lines with the help of socially responsible investment (SRI). Recently, these brokers added some new features, making crypto funds part of their trading platform, which is an excellent thing in the world of crypto exchange.\n\nIn this blog, we are going to discuss the interactive broker from its functionality to accessibility, so don’t leave it in the midst; read the blog thoroughly. It will be beneficial for you to read the guide thoroughly.\n\nHow Interactive Brokers Crypto Work?\n\nIBKR, or Interactive broker, functions as the crypto exchange and broker that offers direct crypto trading. This platform allows users to access the data of their accounts with the help of a desktop platform, mobile, or any online platform.\n\nFurthermore, there is a company called Paxos Trust Company That gives crypto trading execution and also its custody. Therefore IBKR allows not only trading of bonds, options, and stocks but also crypto with quick crypto trading. Many Brokers Like Fidelity is a platform that does not offer crypto but gives access to funds like BTC future.\n\nWhat Cryptocurrencies Can I Trade on Interactive Brokers?\n\nIBKR does not have enough resources for crypto coins but whatever it offers are the best-rated and finest type of cryptocurrencies. Compared to other crypto exchanges, it lacks, but if traders are just looking for investment, then IBKR can be the best platform.\n\nTrading pair Industry Current price Bitcoin BTCUSD Payments $58,706.27 Ethereum ETHUSD Blockchain platform $4,433.35 Litecoin LTCUSD Payments $208.61 Bitcoin Cash BCHUSD Payments $579.24\n\nInteractive Brokers Crypto Cost or Commission\n\nIBKR fees include meager profit which ranges around 0.12%-0.18% for crypto trade with no additional cost or other custody fees. But if you go after other crypto exchanges or any other broker exchange, then typically the commission is around 2% or may vary and typically add more markups.\n\nTherefore, Paxos on Interactive Brokers’ account range from 0.12 – 0.18 percent with a minimum of 1.75 dollars per order, and IBKR offers BTC for the later Us market and growth, and each CMC bitcoin costs a commission of 10.20 dollars.\n\nSimple Steps to Buy Crypto on Interactive Brokers\n\nHere we have simple steps to help you easily buy crypto on Interactive Brokers:\n\nStep 1. First, create an account on the IBKR and let it verify and then find your client portal and ask them about crypto trading. Wait for their request, which accounts for one day at max.\n\nStep 2. Now add funding to your IBKR account to initiate crypto buying.\n\nStep 3. Look around for cryptocurrency’s ticker via the search option and scroll through the crypto market site.\n\nStep 4.\n\nFinally, enter the assets you want to buy, the funding source, and other things. You have bought the desired cryptocurrencies on the Interactive broker platform.\n\nHow to Withdraw from My Interactive Brokers Account?\n\nIt is possible while moving the asset from other crypto assets, Paxos, however, charges the users with current market cost, and this cost is cut for the Total amount your transfer to anybody or a third party while making a purchase. This applies to all types of cryptocurrency, which you transfer through Paxos and IBKR.\n\nTo Sum Up,\n\nIBRK (Interactive broker) is a specific brokerage business that leads and operates on market access, low fees, and other transaction facilities. IBKR operates as a cryptocurrency exchange and brokers, so you use this if you want to lend, invest, transfer, or buy something. It costs less commission and helps with better investment. Moreover, users can access the interactive broker and Paxson daily to find out about the current market condition, their assets, and others. This is just advice if you want further information. It is compulsory to go with your research before diving into the world of crypto and IBKR."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29ycG9yYXRlZmluYW5jZWluc3RpdHV0ZS5jb20vcmVzb3VyY2VzL2NyeXB0b2N1cnJlbmN5L2Rhby1oZWlzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 03:13:55 GMT",
        "title": "What Was the Famous DAO Heist? - Overview, The Hack - Corporate Finance Institute",
        "content": "What Was the Famous DAO Heist? A real-life cryptocurrency heist from the early days of Ethereum that shook up the crypto world Over 1.8 million professionals use CFI to learn accounting, financial analysis, modeling and more. Start with a free account to explore 20+ always-free courses and hundreds of finance templates and cheat sheets.\n\nStart Free Written by Andrew Loo\n\nThe DAO Heist\n\nWhile many people might not know what it is, a DAO, or “decentralized autonomous organization,” is an extremely powerful, interconnected, and modern way for investors to make a difference in the world while capitalizing on businesses they believe in.\n\nConceptually and financially, they represent a wellspring of great potential; however, a significant heist and series of fraudulent actions have spooked many, even ardent proponents.\n\nBut what was the famous DAO Heist? And in the aftermath, how did the community that created it come together to right the wrongs and repair the damage?\n\nKey Highlights In 2016, the Genesis DAO was formed as an automated cooperative crowdfunding organization built onto the Ethereum blockchain.\n\nDuring the initial stages of raising capital, a hacker or group of hackers managed to steal almost USD70 million by exploiting the smart contracts that underpinned the DAO.\n\nThe community eventually agreed to a hard fork of the Ethereum blockchain, spinning off the Ethereum Classic cryptocurrency and causing embarrassment and unwanted attention to the DAO.\n\nGenesis DAO\n\nIn 2016, the first DAO was launched on the Ethereum blockchain. Commonly called the Genesis DAO because it was the first one, many were excited by the possibilities it presented to the community. This development was a cutting-edge and forward-thinking project that was previously unthinkable.\n\nThe basic premise behind the DAO was that it could directly fund companies and projects that members of the organization believed in. Anyone who bought into the DAO and invested money into a pool would be granted a “token” representing their share of the DAO and permission to vote on capital deployment.\n\nSo, in essence, a DAO would act as a virtual crowdfunding cooperative where profits would be shared amongst the DAO members.\n\nThe concept was brilliant and revolutionary, but a famous heist soon cast doubt over its validity and viability and caused widespread investor fear.\n\nCreating the DAO\n\nA decentralized autonomous organization is a collection of funds run by numerous decentralized individuals worldwide. The cooperative is run by a series of computer programs and rules established and voted upon by those in the organization.\n\nAll the rules, regulations, and funds deposited into the DAO are safely maintained on a blockchain. Blockchain-based security, correctly applied, is typically seen as “unhackable” and provides an avenue for disenfranchised younger or smaller investors to invest in alternative assets.\n\nWhen anyone bought into the DAO and invested their virtual currency (backed by cash), their token represented potential capital gains and involvement in community affairs, including capital allocations to investments.\n\nBusiness pitches would be heard from all the investors, and a voting process would either approve or deny the proposal. For the Genesis DAO, if the project received more than 20% of all tokens as proxies for approval, the DAO would automatically transfer the cryptocurrency Ether to the winning proposal. Any excess Ether that was later created by the funded proposal (as profit or similar) would be given back to the investing parties as capital gains.\n\nThose who created the Genesis DAO also wanted to ensure that minority voters were protected. Since 20% was the bare minimum needed to approve a proposal, there could be many investors who didn’t approve of it despite its passage.\n\nThe developers of the Genesis DAO created a way for minority investors to get their funds back if the DAO approves and funds a project they don’t support. The minority interest would split their tokens into a “child DAO.” After 48 days of waiting, they would get their Ether back. The concept of a child DAO would later become a critical part of the heist.\n\nEarly Success\n\nWith the Genesis DAO up and running, it began to drum up much interest and an equal amount of investment cash.\n\nThe DAO was hugely successful immediately, generating over USD150 million worth of Ether, and soon had more than 11,000 investors by May 2016. Initially, the tokens sold to investors would be held for 28 days before the DAO began formal operations.\n\nThe Hack\n\nAround this time, some began to speculate that there was possible hacker infiltration. They saw weaknesses in the system and pointed them out to DAO developers and leadership. But before developers could fix the security holes concerned investors highlighted, a group of hackers broke into the smart contracts built into the system.\n\nThe hack let the bad actors steal more than 3.6 million coins of the total 12.7 million Ether that had been raised. At the time, that amount was the equivalent of USD70 million[1].\n\nHow did the black hats do it? The hacker or hackers took advantage of the ability to split into a child DAO and two loopholes in the faulty smart contract. The first vulnerability in the coding of the smart contract was that the programmers did not consider the possibility of a recursive call exploit, which is a type of function where it calls part or itself directly again and again.\n\nThe other vulnerability that the hacker or hackers took advantage of was that the smart contract would send out ETH funds first and then update the balance remaining afterward.\n\nThe attacker was able to initiate a split into a child DAO where the smart contract would move the Ether from the Genesis DAO and move it into a child DAO first and then check the balance later. Combined with a recursive loop, the hacker was able to retrieve the funds multiple times before getting to the step where the smart contract code would check the balance, resulting in the loss of the 3.6mm Ether.\n\nInexplicably, the hacker stopped their attack without draining the entire 12.7mm Ether raised.\n\nThe Response\n\nWhen the community noticed the heist, those invested weren’t sure what to do. Part of the indecision was due to the relative newness of the Ethereum network, which powered Ether. Additionally, about 17% of the total amount of Ether was tied up in the DAO. This served to heighten the tension and fear caused by the heist.\n\nVitalik Buterin, the founder of the Ethereum network, attempted to reassure investors by suggesting a “soft fork” and coding that would prevent the hackers from moving the funds to their hidden accounts.\n\nThings got even tenser when a letter from the alleged hacker group was released to the Ethereum community. It stated that everything the hackers did was legitimate and that the funds waiting for them were rightfully theirs. The hackers went as far as to threaten legal action if the DAO attempted to get the funds back. Additionally, the miners who ran the blockchain system were allegedly offered a collective reward of 1mm Ether and 100 BTC to NOT comply with any soft forks.\n\nThankfully, as the funds had been siphoned into the child DAO, the hacker needed to have enough time pass before he could request that the Ether be transferred into an account that he controlled. Before this could happen, the majority of the Ethereum community agreed that something needed to be done. After much deliberation and debate, eventually, the community decided on a hard fork to overwrite the blockchain history and restore the stolen Ether to the original investors, reversing all the transactions done on the entire Ethereum blockchain.\n\nNot all nodes followed the main branch, so the hard fork created a new blockchain and crypto, Ethereum Classic.\n\nConclusion\n\nAt the core of it all, this attempted heist was a consequence of the smart contracts that were part of the Genesis DAO. The loopholes inside the system were the problem, and they were noted, but the fixes to repair them weren’t created fast enough.\n\nThe damage done by this major hack and heist was immediate. It was the first time that the world saw the vulnerability of blockchain and potential issues with cryptocurrency systems. It created a slew of nasty headlines, speculation, and rumors about how hackers could get ahold of funds after breaking through loopholes.\n\nAdditionally, the DAO heist attracted the attention of regulators to this sort of crowdfunding and created a huge amount of embarrassment for the fledgling Ethereum; the hard fork also changed the perception that cryptocurrencies were immutable.\n\nLearn More\n\nThank you for reading CFI’s guide to The DAO Heist. To keep learning and developing your knowledge base, please explore the additional relevant resources below:"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8yNy9pbnN0aXR1dGlvbmFsLWludmVzdG9ycy1iZWxpZXZlLW9uZS1jcnlwdG8tYXNzZXQtaGFzLXRoZS1tb3N0LWNvbXBlbGxpbmctZ3Jvd3RoLW91dGxvb2staW4tMjAyMy1jb2luc2hhcmVzL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8yNy9pbnN0aXR1dGlvbmFsLWludmVzdG9ycy1iZWxpZXZlLW9uZS1jcnlwdG8tYXNzZXQtaGFzLXRoZS1tb3N0LWNvbXBlbGxpbmctZ3Jvd3RoLW91dGxvb2staW4tMjAyMy1jb2luc2hhcmVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Institutional Investors Believe One Crypto Asset Has the Most Compelling Growth Outlook in 2023: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares says most institutional investors believe one crypto asset has the most growth potential this year.\n\nIn the latest Digital Asset Quarterly Fund Manager Survey, CoinShares says there is a 20% increase in bullish sentiment among investors for smart contract platform Ethereum (ETH).\n\n“Ethereum has seen a dramatic rise in investor sentiment, with a record 60% of survey respondents believing it has the most compelling growth outlook.”\n\nJust about 30% of those surveyed said Bitcoin (BTC) had the most compelling growth outlook.\n\nThe survey is based on 43 responses from investors who cover $390 billion of assets under management.\n\nThe sentiment behind Ethereum jumped significantly since the October 2022 survey, when only 40% of those surveyed believed ETH had the most compelling growth outlook.\n\nCoinShares says Ethereum may be headed for a “comeback” this year after experiencing an outflow of $401 million in 2022.\n\nPer the survey, investors were mostly investing in Bitcoin and Ethereum in the last quarter, which may have “come at the expense of altcoin competitors to Ethereum.”\n\n“Action speaks louder than words, so it’s worth noting what investments respondents made in the last quarter. Bitcoin and Ethereum have solidified their leading positions against other coins.”\n\nInvestors are also less concerned about an outright ban on crypto since the last survey.\n\n“Regulatory concerns have increased, although far few expect political blockers and a government ban. This suggests investors see regulation being the solution rather than an outright ban.”\n\nAt time of writing, Ethereum is changing hands at $1,595.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbmdhcGUuY29tL2hvdy1ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlLXdpbGwtaW1wYWN0LWV0aC1ob2xkZXJzLTEwMDI1L9IBVWh0dHBzOi8vY29pbmdhcGUuY29tL2hvdy1ldGhlcmV1bS1zaGFuZ2hhaS11cGdyYWRlLXdpbGwtaW1wYWN0LWV0aC1ob2xkZXJzLTEwMDI1L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "How Ethereum Shanghai Upgrade Will Impact ETH Holders? - CoinGape",
        "content": "For ETH stakers, the Ethereum Shanghai upgrade is a well-awaited change as they will be able to remove their staked funds as validators. Aside from its effects on staking, it’s also ETH to new heights in the cryptocurrency market.\n\nEthereum, an open-source blockchain with smart contract functionality used to run on Proof-of-work, which made the mining process expensive and energy intensive. After the merge, Ethereum’s mechanism shifted from Proof-of-Work to Proof-of-Stake, a method for validating entries into a distributed database and keeping the database secure. Now, what changes Ethereum Shanghai Upgrade brings for ETH holders?\n\nThe Ethereum Shanghai Upgrade Will Have a Huge Impact on ETH\n\nIn March 2023, the Shanghai/Capella fork will go live. Jack Niewold, Founder of Crypto Pragmatist, an email newsletter on the narratives and assets shaping crypto, recently tweeted,\n\n“about 14% of total ETH supply is staked, and it can be unstaked after the Shanghai fork. This makes some people bearish”\n\nOn Monday, Ethereum’s core developers deployed the first mainnet shadow fork designed to test the readiness of ETH staking withdrawal capability. This brought ETH holders one step closer to accessing the $26 billion worth of Ethereum.\n\nRead More: Ethereum Shadow fork Goes Live: Here’s 7 Things You Need to Know\n\nWithdrawals and ETH Developers Feud\n\nWhere the Ethereum merge introduced the ability for users to deposit ETH with the network, The Shanghai upgrade will allow ETH holders to stake their coins since the Beacon Chain, Ethereum’s Proof of Stake consensus layer. However, some of Ethereum’s devs believe the team is rushing the Shanghai upgrade. Micah Zoltu, an Ethereum dev, stated that the current Shanghai code does not allow ETH withdrawals to be compatible, and a rushed launch will create more problems for both developers and holders. They believe that the unstaking of ETH is acceding to public demands and not so much about the long-term health of Ethereum.\n\nAlso Read: 5 Ethereum Stocks To Indirectly Reap The Benefits Of Ether’s Surge"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hYXZlLWRlcGxveXMtdjMtb24tZXRoZXJldW0tYWZ0ZXItMTAtbW9udGhzLW9mLXRlc3Rpbmctb24tb3RoZXItbmV0d29ya3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Aave deploys v3 on Ethereum after 10 months of testing on other networks - Cointelegraph",
        "content": "The third version of the crypto lending app Aave has now been deployed to Ethereum for the first time, according to a Jan. 27 Twitter thread from the Aave team. “Aave v3” was originally released in March 2022 and deployed on multiple Ethereum Virtual Machine (EVM)-compatible blockchains shortly afterward. Until now, Ethereum users only had access to the app's older “v2” version.\n\nAave Protocol V3 is now live on the Ethereum market\n\n\n\n”The most exciting aspect of V3 is its flexible design, which enables a variety of new risk mitigation features, and its improved capital efficiency & decentralized liquidity – all while reducing gas costs.” @StaniKulechov pic.twitter.com/QsSnnlhEMr — Aave (@AaveAave) January 27, 2023\n\nAave v3 includes several features intended to help users save on fees and maximize the efficiency of users’ capital. For example, high-efficiency mode allows the borrower to avoid some of the app’s more stringent risk parameters if the borrower’s collateral is highly correlated with the asset being borrowed. Developers say this may be useful for borrowers of stablecoins or liquid staking derivatives.\n\nIn addition, the “isolation” feature allows certain riskier assets to be used as collateral as long as they have their own debt ceiling and are only used to borrow stablecoins. Under the previous version, there was no way to limit what type of asset could be borrowed given a certain type of collateral. This meant that lower market cap and illiquid coins often couldn’t be used as collateral.\n\nRelated: Aave purchases 2.7M CRV to clear bad debt following failed Eisenberg attack\n\nv3 also includes a gas optimization algorithm that the developers say will reduce gas fees by 20% to 25%.\n\nThe code for v3 was published back in November 2021. In March 2022, the Aave DAO approved an initial vote to deploy the new version. Over the next few months, v3 was deployed to Avalanche, Arbitrum, Optimism and Polygon. However, the Ethereum version of Aave has always had the most liquidity and v3 was not available on it previously.\n\nAccording to the official proposal, the initial launch only has seven coins. The vote to launch began on Jan. 23 and lasted for two days. After supporters won the vote, the execution of the proposal was able to move forward on Jan. 27. Less than 0.01% of decentralized autonomous organization (DAO) members voted against the proposal.\n\nIn November 2022, Aave changed its governance procedures after it was hit by a $60 million short attack that ultimately failed."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAxLzI3L2Nhbi1jcnlwdG8tbWFya2V0LWhlbHAteW91LXJldGlyZS1lYXJseS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Can the Crypto Market Realistically Help You Retire Early? - The Motley Fool",
        "content": "The crypto market may be in a slump right now, but it still has plenty of potential. If it's headed for a rebound, investing now could prove to be lucrative.\n\nCryptocurrency, in general, is one of the fastest-growing assets in history. Between 2020 and 2022 alone, Bitcoin (BTC 0.76%) earned returns of nearly 600%. Ethereum (ETH 0.32%) was up more than 2,200% in that time frame, and Solana surged by a staggering 17,760%.\n\nBut crypto is also notorious for its extreme volatility, so can you realistically depend on it to help you retire early? Here's what you need to know.\n\nIs crypto still a safe investment?\n\nCryptocurrency has always been high risk simply because it's still speculative. Nobody knows where it will be a decade or two from now, or whether the sector will survive at all. Investors are still divided over its future, and that uncertainty has led to some wild price fluctuations.\n\nIn the short term, then, don't expect to see any significant returns. While the market could rebound in the relatively near future, crypto has proven that it can sink as quickly as it can surge.\n\nThat said, crypto's long-term potential is far more promising. For example, while Ethereum is currently down nearly 70% from its all-time high, it's still up by close to 52,000% since it was launched in 2015.\n\nIn other words, if you had invested $1,000 in Ethereum in 2015, you'd have more than $519,000 today -- and that's despite the crypto market meltdown over the past year.\n\nOf course, there are no guarantees that you'll see these types of returns again, even if the market does bounce back. But if investors have learned anything from crypto over the past few years, it's to expect the unexpected.\n\nCan crypto help you retire richer?\n\nCrypto can potentially help you earn enough to retire early. However, it's crucial to have the right outlook and strategy.\n\nAgain, this is a risky investment, and there are no guarantees it will even exist in a few decades, let alone deliver life-changing returns. If you're going to include crypto in your portfolio, it's important to ensure you're limiting as much risk as possible -- and there are a few ways to do that:\n\nOnly invest what you're willing to lose: Crypto is still in its early stages, so there's always a chance you could lose whatever money you invest if it fails. Before you buy anything, consider how much you can realistically afford to risk.\n\nCrypto is still in its early stages, so there's always a chance you could lose whatever money you invest if it fails. Before you buy anything, consider how much you can realistically afford to risk. Double-check your diversification: A well-diversified portfolio can help protect your savings if crypto doesn't pan out. While everyone's investments will look different, it's wise to invest in at least 20 to 25 stocks from a variety of industries. In other words, make sure you're not putting all your eggs in one basket with crypto.\n\nA well-diversified portfolio can help protect your savings if crypto doesn't pan out. While everyone's investments will look different, it's wise to invest in at least 20 to 25 stocks from a variety of industries. In other words, make sure you're not putting all your eggs in one basket with crypto. Invest in the right places: Although all cryptocurrencies are speculative to a degree, the ones with the most real-world potential are the most likely to succeed. Right now, the two safest bets are Bitcoin and Ethereum, as they're the largest and most widely used.\n\nCryptocurrency can potentially be lucrative, and if the market takes off again, you could stand to make a lot of money by investing now when prices are lower.\n\nWhile there are still no guarantees that crypto will help you retire early, the right strategy can limit your risk as much as possible. By keeping realistic expectations and investing in the right places, you'll improve your chances of potentially making a lot of money over time."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaWctZXllcy1jb2luLWV4Y2VlZHMtMTgtbWlsbGlvbi1kb2xsYXJzLWluLXByZXNhbGUtY2FuLXRoaXMtY2F0LXRoZW1lZC1tZW1lLWNvaW4tcmVhY2gtdGhlLWhlaWdodHMtb2YtZXRoZXJldW0tYW5kLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Big Eyes Coin Exceeds 18 Million Dollars In Presale! Can This Cat-Themed Meme Coin Reach The Heights Of ... - Analytics Insight",
        "content": "Big Eyes Coin (BIG) has continued to make serious waves in the crypto industry by raising over 18 million dollars in presale.\n\nNow in stage 9 after appearing on a 3D billboard in New York City and securing a tier 1 CEX launch for its official release, the sky seems to be the limit for Big Eyes Coin.\n\nAnd during a time when the cryptocurrency industry is not on top form, it could be the perfect time for this cat-themed meme coin to capitalize.\n\nAfter all, so-called crypto powerhouses like Ethereum (ETH) and Bitcoin (BTC) are no way near their all-time high prices.\n\nAt the time of writing, Ethereum is at a measly $1,604.22, considerably less than its peak of $4,724.31 back in November 2022. Likewise, Bitcoin displays a current price of $22,959.19, more than 40,000 dollars less than its max record of $66,953.34 over 12 months ago.\n\nFurthermore, thanks to the 200% bonus code (LAUNCHBIGEYES200) Big Eyes Coin is offering, the number of presale orders is only going to increase in the next few weeks.\n\nBitcoin: A Vast History Of Remuneration\n\nBitcoin might be going through a rough patch but no one can deny how profitable it has been for investors in previous years.\n\nDespite starting at a price of less than $1 in 2009, Bitcoin surpassed $19,000 in December 2017, giving a lot of crypto enthusiasts a healthy return.\n\nAnd just when many believed Bitcoin could not become any more profitable, it reached around $40,000 in January 2021 and over $63,000 in April 2021.\n\nThroughout these periods Bitcoin did have many fluctuations, yet it always bounced back impressively and could do the same in the near future.\n\nEthereum: A Cryptocurrency With Multiple Uses\n\nEthereum is one of the most practical cryptocurrencies on the market due to its role in the development of decentralized applications, the allocation of other cryptocurrencies on its blockchain, and the creation of notorious NFTs like the Bored Ape Yacht Club (BAYC).\n\nPlus, following its merge upgrade in September, when it went from proof-of-work to proof-of-stake, Ethereum has a much lesser carbon footprint and is a lot more eco-friendly.\n\nHence, even though Ethereum is struggling to resurge, its sheer use and practicality in the universe could allow it to become incredibly enriching again.\n\nBig Eyes Coin: A Meme Coin With Unique Selling Points\n\nBig Eyes Coin has the potential to blow its competition away with its planned release of top ten NFTs, ocean-saving charity donations, and facilitation of an exciting, fun-filled community.\n\nYou only need to check out the Big Eyes website for a moment to get a feel for the inexplicably adorable cat-related NFTs to come.\n\nAnd the amazing part is, every time an investor purchases a Big Eyes NFT, some of this will passively go towards saving the oceans and various sealife.\n\nIf that’s not enticing enough, individuals will get to meet like-minded investors at a range of in-person events.\n\nFinal Thoughts\n\nIt is not through divine intervention that Ethereum and Bitcoin are so successful in the crypto economy.\n\nNevertheless, Big Eyes Coin’s presale success suggests the cat-themed meme coin can catch up to these leading cryptos thanks to its unique and innovative features.\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiqAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jb3VsZC10aGlzLWJlLXRoZS1tb21lbnQtYmlnLWV5ZXMtY29pbi1qb2lucy10aGUtcmFua3Mtb2YtdGhlLWVsaXRlLWNyeXB0by1ldGhlcmV1bS1hbmQtYml0Y29pbi1yZW1haW4tdGhlLW5vcnRoZXJuLWFuZC1zb3V0aGVybi1zdGFycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Could This Be The Moment Big Eyes Coin Joins The Ranks Of The Elite Crypto? Ethereum And Bitcoin Remain The ... - Analytics Insight",
        "content": "What do a dead racoon, a red fire hydrant and Kate Winslet have in common? The answer isn’t obvious to us either. But now we have your attention it’s time to discuss the large heaving mud sodden elephant in the room – the current state of crypto. The last 12 months have been tough, they’ve given even the most adept and well researched crypto whale pause for thought.\n\nIn the late 1800’s families travelled across the broad stretch of coarse, unrelenting American dustbowl in search of that rare commodity – gold. Back breaking work was carried out in order to sift what might only be a few tiny nuggets no bigger than that of a finger nail. Today, mining of crypto exists on a digital plane, the geography and metrics have changed but the ethos and sense that – for a select and determined few gargantuan gains can be made – remains the same.\n\nBig Eyes Coin (BIG) has so far teased 9 presale stages with growing anticipation and interest. This tiny anime kitten has many in the inner crypto sanctum salivating for its impending arrival. The token boasts strong utility coupled with a bold faced tongue out meme aesthetic and approach. Millennials and Gen Z alike have demonstrated they intend to change the (un)natural order of things…posting a letter? Nope – social media direct messaging, heavy cumbersome cameras to take pictures – nah, a smart phone with a megabillion pixel camera will do the job nicely. The point is – change is upon us. It happens sometimes slowly and incrementally, sometimes with the full force of a wrecking ball rolling through the interior of a museum of historical artefacts..sometimes slow and then very..very.. fast.\n\nBig Eyes is building a loyal community who appreciate its charitable pivot offering 5% of its wallet to causes relating to environmental collapse and marine preservation. This mischievous kitten enjoys her fish, and as such wants to ensure that there is a plentitude of healthy fish in this world.\n\nUnlike Big Eyes two bigger brothers Doge and Shiba Inu, this token is yet to launch meaning its current token price is devastatingly and disgustingly low. This, however won’t be the case for very much longer as the team have announced they’ll be releasing Big Eyes into the world imminently, given they have repeatedly surpassed presale stage targets – $17.5million so far raised. You’d be foolish to hedge your beds and place some of your capital into what crypto clerks are calling – “the 2nd generation of decentralised meme coin with utility”.\n\nThere Is A Light That Never Goes Out – Ethereum\n\nEthereum (ETH) is a decentralised blockchain being utilised to both store your money but also in the creation of interesting apps. The crypto currently has a market cap of $154billion. So despite the dip it has been experiencing, its financial stability is of no serious concern. Ethereum has no cap on the number of tokens it can supply hitting 122 million currently, despite this its price is inestimably high.\n\nIf what youre looking for is a little less sweat on the back of your neck and hands that dont feel quite so clammy as the latest market news lands on your phone – then Ethereum makes total sense. A stable coin, its price isn’t subject to the same bipolar jittery fluctuations that you see with other disposable coins that enter the market hourly.\n\nCommunity built, this team have harnessed the power of decentralisation in the truest sense. From each of the furthest and most far flung corners of the internet enabled world – kindred souls have been adding to and improving its infrastructure.\n\nEthereums move to a proof of stake merger is now beginning to bear fruit as it launches a tasty and it must be said secretive upgrade to its network known exotically as Shanghai. In the pithiest and simplest sense this upgrade will allow stakers to withdraw their holdings from the network. A big, bold and beautiful move forward.\n\nBit By Bit With Bitcoin\n\nThe macdaddy, the Godfather, the Czar. Bitcoin (BTC) has held the top spot in crypto since records began. Unlikely to be budged, nudged, tripped or surpassed any time soon this decentralised currency offers more than just a glimpse into the future of the financial sector.\n\nA consolidation seems to be underway and all signs and smoke signals suggest if Bitcoin can hold to $23,000 the market will respond generously and we could see its slow and steady escalation back towards its euphoric heights of November 2021 when it hit above $65,000. If however, it dips below $23,000 the market confidence could trigger a domino effect and immediate sell off that could see its value dwindle paving the way for Ethereum to exercise more bolshy market dominance having been seen as the little tike to Bitcoins (BTC) big bully brother for so long.\n\nThe token to keep your eyes on and your wallets aligned with is Big Eyes. There’s an argument to say the tortoise – slow and steady won the race, but here the hare not only lapped the tortoise it, it ran so fast it span the poor tortoise the wrong way.. That’s Big Eyes.. its success has been hard and fast and immediate and doesn’t look to be slowing. Don’t. Miss. Out.\n\nYou can obtain 200% bonus tokens with your order if you use the ‘LAUNCHBIGEYES200’ promo code at the checkout!\n\nFor more information on Big Eyes Coin (BIG), please visit the following links:\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmlzbGFuZGVjaG8uY28udWsvZW5lcmd5LWVmZmljaWVuY3ktcHJvbWlzZXMtZXRoZXJldW0tbWVyZ2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "ENERGY EFFICIENCY PROMISES ETHEREUM MERGE - Island Echo",
        "content": "According to market capitalization, Ethereum, the second cryptocurrency, has captured more attention from users and followers of the crypto market; this time, it does so with The Merge. If you are into bitcoin and want to trade, then you may start by using a safe and secure platform like this trading app.\n\nA new way of using the blockchain, leaving behind the solution of mathematical algorithms through network consensus to Proof of Participation ( PoS ).\n\nThe expectations of a change could provide an effective solution to the fundamental problems of Ethereum and position it as a more efficient option from the perspective of energy consumption. Enter the Bitcoin-Prime trading system for more information.\n\nArticle continues below this advertisement\n\nWhat is the Ethereum merge about?\n\nThe merge of Ethereum is the long-awaited transformation of the technological bases that have characterized this digital currency and that today undoubtedly leaves many attentive to the changes that are approaching.\n\nEthereum is characterized by, like Bitcoin and other cryptocurrencies, having an energy consumption that undoubtedly leaves a mark on the environment; one of the main changes is the conversion of ETH into a much more ecological digital currency, reducing its energy consumption by almost 99%.\n\nThis indicates that Ethereum could become an environmentally friendly digital currency, increasing its adoption after the sustainability it will offer.\n\nIt is important to note that this cryptocurrency is the base platform for DApps-type projects, decentralized finance projects, and the now popular Non-Fungible Tokens.\n\nArticle continues below this advertisement\n\nETH Network with Beacon Chain, where the way of reaching consensus for the mining of new digital currencies will change from Proof of Work (PoW) to Proof of Stake (PoS); this implies that traditional mining will no longer apply to Ethereum.\n\nThe miners will stop operating as those in charge of extracting new coins; now, this function will be in the order of the investors who own ETH, who, through staking with their coins, will be the ones who validate the transactions.\n\nImportance of The Merge\n\nThe Ethereum Foundation is not only challenging the traditional way of mining digital currencies but also hopes to overcome the limitations that the blockchain has experienced by involving PoS as a validating process, breaking down the barriers between users and the network itself.\n\nArticle continues below this advertisement\n\nThe importance of such a promoted merger is because the concept of mining and its participants are left out, as well as the expensive equipment used to carry out this economic activity that has benefited many.\n\nThe creation of new blocks and the complete validation of the transactions will be in charge of the users of the Ethereum network, which will possibly transform the way of obtaining rewards for creating new coins.\n\nOn the other hand, it is considered that the impact on the carbon footprint will decrease significantly; leaving Bitcoin as the Blockchain network that uses Proof of Work.\n\nThis proposal will benefit not only Ethereum and its energy consumption. Still, it will open the field to NFTs by eliminating the barriers that have been speculated regarding the environmental impact that they could produce.\n\nAdvantages and disadvantages\n\nAccording to analysts and experts in the cryptographic market, the changes expected with The Merge may not even be appreciated by users because there will be no drastic changes to show them.\n\nPossibly we are facing a highly publicized scenario where what is expected is to encourage crypto investments to dissipate a little the effects that macroeconomic factors have had on the market so far this year.\n\nThe expectations are many; everything revolves around whether the changes achieved the stated objectives.\n\nEvaluating the global scenario at the time of the merger, a set of sales and disadvantages is considered that can be contrasted as follows:\n\nThe decrease in energy consumption is undoubtedly a positive aspect, which could generate controversy in the face of possible network centralization.\n\nThe ease of staking from any computer is a point in its favor; what has not been made clear is the possibility that hackers will have access to obsolete keys and carry out a long-range attack.\n\nThe possibility that inflation decreases concerning the emission of ETH could become a disadvantage since it would delay the processes.\n\nConclusion\n\nThe long-awaited merger has achieved its primary objective of reducing energy consumption, making this cryptocurrency a highly ecological and competitive digital financial instrument.\n\nEthereum has decreased its consumption from over 20 million megawatts to just 2,500-megawatt hours per year.\n\nThe cryptographic market constantly evolves despite the explosive economic and financial landscape that never ceases to surprise its followers."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3dlYi1zdG9yaWVzL2V0aGVyZXVtcy1zaGFuZ2hhaS1tYWlubmV0LW1vdmVzLW9uZS1zdGVwLWNsb3Nlci1hcy1zaGFkb3ctZm9yay1nb2VzLWxpdmUv0gF3aHR0cHM6Ly93d3cuYW5hbHl0aWNzaW5zaWdodC5uZXQvd2ViLXN0b3JpZXMvZXRoZXJldW1zLXNoYW5naGFpLW1haW5uZXQtbW92ZXMtb25lLXN0ZXAtY2xvc2VyLWFzLXNoYWRvdy1mb3JrLWdvZXMtbGl2ZS8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 18:07:16 GMT",
        "title": "Ethereum’s Shanghai Mainnet Moves one Step Closer as “Shadow Fork” Goes Live - Analytics Insight",
        "content": "The shadow fork will allow validators to start testing withdrawals and preparing for the official launch."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vd2lsbC1zaGliYS1pbnUtbDItYmUtbGlua2VkLXRvLWV0aGVyZXVtLWJ5LXNoaWJhcml1bS1icmlkZ2UtaW5mbHVlbmNlci10b3V0cy1tYXNzaXZlLW5ld3MtaWYtdHJ1ZS_SAYoBaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3dpbGwtc2hpYmEtaW51LWwyLWJlLWxpbmtlZC10by1ldGhlcmV1bS1ieS1zaGliYXJpdW0tYnJpZGdlLWluZmx1ZW5jZXItdG91dHMtbWFzc2l2ZS1uZXdzLWlmLXRydWUvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Will Shiba Inu L2 be linked to Ethereum by Shibarium Bridge? Influencer touts massive news if true - Crypto News Flash",
        "content": "Popular crypto influence said that the Shibarium bridge will allow easy transfer of assets between Ethereum and Shibarium.\n\nAs the launch of Shibarium nears, more market payers are coming to the front to extend support to the Layer-2 protocol.\n\nThe Shiba Inu developers have been working hard on the development of the Layer-2 scalability platform Shibarium recently. Popular crypto influencer SHIB Knight also noted that the team behind the crypto project is also working on a bridge that will allow users to move assets between Ethereum and Shibarium.\n\nSHIB Knight shared information and details regarding a new meme-based crypto project willing to expand the utility of Shibarium. In his tweet today, SHIB Knight noted that the team behind the community-focused project – Kai Ken Inu – will be building the Shibarium Bridge.\n\nWith the bridge solution that links the Shiba Inu Layer-2 network and Ethereum, users will be able to “port assets” directly from the Ethereum blockchain to Shibarium. “[Kai Ken Inu is] building a Shibarium bridge, which will allow holders to port assets from [Ethereum] to Shibarium when it launches,” SHIB Knight tweeted.\n\nNote that Shiba Inu has yet to confirm the launch of such a bridge solution in the market. There’s been a lot of uproars recently as the launch of Shibarium nears. Much recently, crypto hardware wallet provider Ledger also stated that it will be offering support to the Shibarium protocol. Shibarium is slowly getting recognition in the market as crypto enthusiasts are eager to know how well it can cater to the requirements of the Web3 space.\n\nKAIK Token Value Jumps 1000x\n\nAlthough the news of Shibarium bridge is not yet official, the members of Shiba Inu community celebrated and showed excitement regarding the upcoming project. The excitement has led to the widespread adoption of KAIK, the native cryptocurrency of Kai Ken Inu.\n\nCrypto influencer SHIB Knight claimed that the price of the KAIK token has jumped by 1000x since its launch. Additionally, the Shiba Inu influencer also noted that Kai Ken Inu’s market cap jumped from $2 million to a staggering $10 million yesterday. “KAIK is already 1000x up from launch. [It] ran to a $10M [market cap]yesterday from $2M [market cap], with a healthy and bullish chart,” SHIB Knight noted.\n\nhttps://twitter.com/army_shiba/status/1618106378362695680\n\nThe community team behind Kai Ken Inu has also confirmed the massive rally and the appreciation of the token’s valuations. Besides, the community also expressed gratitude to all members of the crypto community, especially the SHIBArmy.\n\nThey also assured the KAIK holders that there are greater things to come ahead in the market.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDEvMjcvdGVjaG5pY2FsLWFuYWx5c2lzLWJpdGNvaW4tZXRoZXJldW0tNC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Technical analysis of Bitcoin and Ethereum - The Cryptonomist",
        "content": "The cryptocurrency market is experiencing a very positive moment, with the Fear&Greed Index marking 55 points, the first “greed” signal since April 2022. This is a promising signal after months of fluctuations between fear and neutrality, confirming a promising start to the year for cryptocurrencies.\n\nIn less than a month, cryptocurrency capitalization has managed to recover more than 30%, rising from $797 billion at the end of 2022, to about $1,050 billion today.\n\nMost of the credit for this increase has gone to Bitcoin, which has surpassed $23k, recovering its August 2021 prices and wiping out the decline caused by the FTX crisis.\n\nEthereum, on the other hand, is returning to the highs of early November 2022 at $1,600, maintaining a market share of 18%.\n\nAltcoins are also performing well, with some of the major and best-known ones such as Solana (SOL) and Decentraland (MANA) each gaining more than 120% since the beginning of the month. Over the past week, all of the top 50 cryptocurrencies by capitalization are on their way to closing with gains.\n\nIn particular, should Sunday night’s close confirm current levels, it would be the fourth consecutive weekly close above par for Bitcoin, an event that has not occurred since August 2021.\n\nAlso noteworthy is the rise of XRP, a cryptocurrency launched in 2012, which has recovered 20% since the beginning of the new year, with current prices above $0.40 per token, allowing it to climb back to 6th position in the overall crypto capitalization ranking.\n\nHowever, the company behind XRP, Ripple Labs, is engaged in a legal dispute with the US SEC, which is objecting to the XRP token as a security, and the final ruling is expected to be published in the coming weeks.\n\nFinally, the Aptos (APT) token deserves mention, which is putting up another triple-digit weekly rise, gaining more than 400% since the beginning of the year and earning the top spot among the month’s best rises. The Aptos blockchain was created in 2021 by a team of former developers of the Diem project (a payment system devised by Facebook in 2019) who decided to leverage their experience in building a decentralized and easily scalable payment network.\n\nIn the last week, the price of APT rose above $20 for the first time. At the opening on 1 January, the price of APT was $3.4 per token.\n\nBitcoin (BTC)\n\nDespite the slowdown in its rise, the price of BTC remains firmly above $22,500. Signal of possible consolidation that will have to find confirmation until early next week.\n\nIf confirmed, the current levels will become the basis of a valid support to be stored for the coming weeks while waiting to see again the $25,500, historical resistance level.\n\nOtherwise, the decline should not extend below $20,500 in order not to jeopardize the excellent work done since the beginning of the year.\n\nEthereum (ETH)\n\nThe queen of altcoins fails to keep up with BTC and stumbles with prices returning below $1,600 in recent hours.\n\nIt is important for ETH to get through the weekend unscathed with prices above $1,500 otherwise the bullish technical structure that began in early January will deteriorate.\n\nThe holding of the $1,500 in the coming days of the week could become the springboard to overcome the $1,680, resistance that coincides with the recent highs and early November."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3Lm91dGxvb2tpbmRpYS5jb20vYnVzaW5lc3Mtc3BvdGxpZ2h0L3RoZS1ldGhlcmV1bS1jb2RlLXJldmlldy1oZXJlLXMtd2hhdC15b3UtbmVlZC10by1rbm93LWFib3V0LWl0LW5ld3MtMjU3MTg20gGEAWh0dHBzOi8vd3d3Lm91dGxvb2tpbmRpYS5jb20vYW1wL3N0b3J5L2J1c2luZXNzLXNwb3RsaWdodC90aGUtZXRoZXJldW0tY29kZS1yZXZpZXctaGVyZS1zLXdoYXQteW91LW5lZWQtdG8ta25vdy1hYm91dC1pdC1uZXdzLTI1NzE4Ng?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "The Ethereum Code Review – Here’s What You Need To Know About It - Outlook India",
        "content": "That is what we’re here to check out. the Ethereum Code is surely one of the most reliable applications that one can count on and we’re here to illustrate its features to help you understand how it works and what should be considered while using it. So, without further ado, let’s begin:"
    }
]