[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0taW4tYW4tb2J2aW91cy1hY2N1bXVsYXRpb24tcmFuZ2Utb2YtYWxsLXRpbWUtcHJlcGFyaW5nLWZvci01MDAwL9IBc2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0taW4tYW4tb2J2aW91cy1hY2N1bXVsYXRpb24tcmFuZ2Utb2YtYWxsLXRpbWUtcHJlcGFyaW5nLWZvci01MDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "Ethereum In An ‘Obvious Accumulation Range Of All Time’ – Preparing For $5,000? - NewsBTC",
        "content": "Ethereum is in an “obvious accumulation range of all time,” this crypto analyst notes on a Twitter post on March 3.\n\nWill Ethereum Spring To $5K?\n\nCrypto analyst “Moon” thinks there could be more upside potential for ETH in the near future, strongly believing that many would want to get involved once the coin has broken out, rallying to the $5,000 and $7,000 trade range. As it is, ETH prices are within a bear formation in higher timeframes. Still, it is relatively solid from its lows in November 2022.\n\n$ETH in one of the most obvious accumulation ranges of all time, lot of hindsight analysis will be done when its at $5k, $7k, whatever in a few years why you didnt buy more here, and people are flipping out over $100 moves pic.twitter.com/HS9fJuHTfx — moon (@MoonOverlord) March 3, 2023\n\nETH is trading at around $1,580 and has failed to breach the $1,700 resistance level marking February highs. On the lower end, the coin has support at about the $1,500 line.\n\nFor the uptrend to take shape, buyers need to push ETH above February resistance lines and register new Q1 2023 highs. This would comprise a bullish breakout, setting the base for another leg up that may thrust ETH to new all-time highs above $5,000 to $7,000. It is a preview that ETH proponents hold, citing technical and fundamental factors.\n\nAccording to the analyst, at present levels, traders and investors wishing to hold the coin for months and years should be buying the dips lest they be left by the ETH bull train.\n\nEven though proponents are optimistic about the ETH’s prospect, it should be noted that it must break above the current range, ideally with expanding participation. Should this be the case, then not only will ETH rally above $2,000, but it stands to possibly more than double, rallying to retest 2021 highs.\n\nAt that time, ETH soared to retest $4,900, a high, more than tripling from 2017 peaks when ETH tested $1,300. Presently, the coin is above that critical high of late 2017, acting as support.\n\nWhat Will Make Or Break ETH?\n\nStill, traders and investors should proceed with caution. Several fundamental factors, as the events of 2022 reveal, could impact the crypto markets, including ETH.\n\nFor instance, despite decreasing inflation, the United States Federal Reserve has said it could increase interest rates as a tool. Besides, the economy remains weak with relatively weak labor conditions, factors that the central bank might consider.\n\nOn the more positive side, ETH bulls cite the network’s “burn rate.” So far, billions of ETH have been taken out of supply. Over the months, ETH’s inflation could drop even further, making the coin deflationary.\n\nFeatured Image From Canva, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvLm5ld3MvY2hyaXMtYnVybmlza2Utc2hvd3MtZ3JlYXQtb3B0aW1pc20tZm9yLXRoZS1mdXR1cmUtb2YtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Mar 2023 08:00:00 GMT",
        "title": "Chris Burniske shows great optimism for the future of ethereum - crypto.news",
        "content": "In a recent Twitter thread, Chris Burniske, a partner at venture capital firm Placeholder, has expressed a quite bullish forecast for ethereum.\n\nThe ethereum Shanghai Upgrade is an optimistic development for ether investors, according to Chris Burniske. He believes that the fact that ethereum stakers can exercise control over their own assets is positive for the whole ecosystem.\n\nI’m shocked it’s a debated question that *de-risking $ETH staking by allowing for unlocks* is bullish. And unfortunately for doubtoooooors, the fact it’s even a question makes me more bullish. — Chris Burniske (@cburniske) April 3, 2023\n\nThe BR Capital fund creator, Rezo, expressed an opinion quite similar to this one on Twitter. The flexibility to stake and unstake ETH will positively impact the long run, as observed by Rezo. He thinks that the Shanghai Upgrade will enhance general trust in ethereum.\n\nExperts agree that stakeholders will have more control over their assets after the ethereum Shanghai update, which is expected to be a key milestone for the entire ethereum community. Several market analysts have a favorable outlook on the long-term prospects for ethereum, even though the market has a degree of uncertainty and anxiety.\n\nEthereum, widely regarded as the preeminent platform for smart contracts and decentralized financial ecosystems, is getting ready to implement a big update to its network. The ethereum community will reach a significant new point of significance on April 12 when the ethereum Shanghai update goes live.\n\nYou might also like: How ethereum has fared 200 days after it transitioned to PoS\n\nThis upgrade will allow speakers to withdraw ethers from the PoS beacon chain. As a result of this news, investors who are bullish on ethereum have seen a remarkable gain of fifty percent so far this year, according to statistics from TradingView’s market.\n\nTraders of ethereum have an optimistic perspective as the first quarter ended. They anticipate that the Shanghai upgrade will cause more upward swings.\n\nNevertheless, there is a concern that the staked ethereum may be sold on the secondary market. It could result in an increase in the total amount of pressure to sell. In addition, the price of ethereum has decreased by more than 61% since the beginning of the staking program two years ago.\n\nEthereum price today\n\nAs the Shanghai upgrade draws closer, the price of ethereum is currently trading at $1,822 as bulls try to grip the market. The asset has recorded a price increase of close to 1% as of presstime, with the trading volume surging by 28%, revealing the increased whale activity in anticipation of the upgrade.\n\nETH 24-hour charts | Source: CMC\n\nCurrently, over 561 thousand ethereum validators have wagered a total of approximately 17.9 million ETH. Experts anticipate greater volatility during the event; however, it is unknown how the market will respond to the upgrading at this time.\n\nFollow Us on Google News"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzA1L3RvcC1jcnlwdG8tYW5hbHlzdC1pc3N1ZXMtZXRoZXJldW0td2FybmluZy1zYXlzLWV0aC1wcmljZS1hY3Rpb24tY291bGQtZ2V0LXVnbHkv0gF1aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDMvMDUvdG9wLWNyeXB0by1hbmFseXN0LWlzc3Vlcy1ldGhlcmV1bS13YXJuaW5nLXNheXMtZXRoLXByaWNlLWFjdGlvbi1jb3VsZC1nZXQtdWdseS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "Top Crypto Analyst Issues Ethereum Warning, Says ETH Price Action Could Get Ugly - The Daily Hodl",
        "content": "A crypto strategist who nailed the end of the Bitcoin bull market in 2021 is warning Ethereum holders, saying that ETH could witness significant downside risk.\n\nPseudonymous analyst Pentoshi tells his 677,100 Twitter followers that bearish momentum could go to the next level for Ethereum if it trades below a key support level.\n\n“Below the gray area COULD get ugly. I’ll talk a long down there with a tight stop. It’s a nice spot for some short to mid term invalidation for longs. If we start to close, below it’s an easy out and a paper cut.”\n\nLooking at Pentoshi’s chart, he appears to be referring to support around $1,480. At time of writing, Ethereum is worth $1,576.\n\nFellow analyst Smart Contracter is also bearish on Ethereum. According to the crypto trader, Ethereum has taken out the diagonal support of a bearish continuation pattern.\n\n“Bear flag structure breaking down on ETH.”\n\nLooking at the analyst’s chart, he appears to be predicting a move down for Ethereum toward the $1,480 price level.\n\nAs for Bitcoin (BTC), Pentoshi believes that the king crypto is not yet done correcting. According to the crypto strategist, he sees BTC going all the way down to $21,500 before bulls could mount a small bounce.\n\n“I’d love to see this and would be wanting to play it for a bounce.”\n\nAt time of writing, Bitcoin is trading for $22,490.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Terablete"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lmpwb3N0LmNvbS9idXNpbmVzcy1hbmQtaW5ub3ZhdGlvbi9hbGwtbmV3cy9hcnRpY2xlLTczMzM4NtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "Western Wall NFT creators suspected of large-scale tax evasion - The Jerusalem Post",
        "content": "Israel's Tax Authority in Jerusalem is investigating the possibility that two NFT (non-fungible token) creators did not report revenues of approximately NIS 8 million from the sale of an NFT based on a 3D scan of the stones of the Western Wall, according to a Friday report from the Tax Authority.\n\nThe suspects are Avraham Cohen from Jerusalem and Antony Polak from Har Adar. They are the owners of the website holyrocknft.com, which -according to its own literature- works to \"combine the business world and technological progress with Jewish faith and spirit.\" Through this site, according to the Tax Authority, the two sold their NFTs.\n\nThe investigation revealed that the suspects have sold 1,700 works since 2021 and obtained 620 Ethereum in payment which, at the time of the transactions, was equivalent to approximately NIS 8m. According to these findings, these revenues are, in fact, business earnings - but the pair did not report them as such.\n\nSome of the funds received by the suspects were even transferred between digital wallets, which raises additional suspicion of criminal concealment of property. Women are seen walking across the Western Wall site in a photo taken February 9, 2023 (credit: MARC ISRAEL SELLEM/THE JERUSALEM POST)\n\nThe judge presiding over the case, Judge Amir Shaked of the Jerusalem Magistrate's Court, released the suspects under restrictive conditions, reported the Tax Authority. These conditions included the suspects' turning over their digital wallets where the Ethereum is stored.\n\nThe Tax Authority reported that the investigation is ongoing.\n\nAs of press time, the Holy Rock NFT Project's website reads: \"In accordance with the settlement we reached with the State of Israel (Ministry of Religions), as part of the proceedings 67258-11-21, we would like to update that we have decided to agree to leave the temporary restraining order, which prevents us from selling additional Holy Rocks NFT, valid until the end of legal proceedings with the state Israel, however, we will make it clear that all other activities planned for the community will take place as scheduled.\"\n\nRecent Western Wall NFT criminal activity\n\nBen Benhorin, a graphic designer from Tel Aviv who specialized in creating and selling NFT-type digital art, was arrested on Feb. 26 for not reporting his revenues totaling approximately NIS 3 million from his sales as well as not reporting the conversion of 30 Ethereum-type digital currencies that he received as payments.\n\nBenhorin creates and sells NFT art on the Opensea International platform under the brand name WUWA. It was found during the investigation that as part of the annual report to the tax authorities in 2021, the suspect did not report any income from sales on the platform at all. Advertisement\n\nAccording to the suspicion, Benhorin converted some of the cryptocurrency he received for the sale of the NFT into other currencies, using the Uniswap platform and didn't report this to the tax authority, an action that is considered a sale and taxable.\n\nNo reports of such conversions were found in the tax returns submitted by the suspect.\n\nWalla! contributed to this report."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2V1cm93ZWVrbHluZXdzLmNvbS8yMDIzLzAzLzA1L2lmLWJpdGNvaW4taXMtcHJlZGljdGVkLXRvLXJlYWNoLWF0LWxlYXN0LTEwMGstYnktMjAyNC13aGF0LWRvZXMtdGhhdC1tZWFuLWZvci1ldGhlcmV1bS1hbmQtZG9nZXR0aS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "If Bitcoin is predicted to reach at least $100k by 2024, What does that mean for Ethereum and Dogetti? - Euro Weekly News",
        "content": "By EWN • Published: 05 Mar 2023 • 10:15\n\nBitcoin (BTC), the cryptocurrency that started it all, has been on a wild ride since its inception in 2009. It has gone from being worth just pennies worth a couple of pizzas to reaching a high of nearly $65,000 in 2021! So, what does the future hold for Bitcoin and other cryptocurrencies like Ethereum (ETH) and the newest meme-coin gem Dogetti (DETI)?\n\nBullish Bitcoin Predictions…\n\nWell, according to some experts, Bitcoin is going to the moon! And no, I don’t mean literally, but in terms of price. Some analysts predict that by 2024, Bitcoin could reach anywhere from $100,000 to $500,000. That’s right, folks, we’re talking Lambo money!\n\nBut what’s causing this sudden surge in optimism for Bitcoin? Well, there are a few factors at play. First, institutional investors are starting to take notice of Bitcoin’s potential as a store of value. Companies like Tesla, MicroStrategy, and Square have all invested in Bitcoin, and more are sure to follow.\n\nSecond, there’s the limited supply of Bitcoin. There will only ever be 21 million Bitcoins in existence, and with the halving that occurs every four years, the rate at which new Bitcoins are created is slowing down. This scarcity is driving up demand and, in turn, the price.\n\nEthereum To Follow Suit!\n\nNow, what does all of this mean for other cryptocurrencies like Ethereum (ETH)? Bitcoin’s success will likely lead to increased interest and investment in other cryptocurrencies. After all, the more people are familiar with crypto, the more likely they will branch out and explore other options. And as we have seen many times, as Bitcoin increases in price, the entire crypto market generally follows suit!\n\nAs for Ethereum, it has been making waves of its own lately. The Ethereum network is the foundation for many decentralised applications (dApps) and smart contracts, making it a valuable tool for developers. Ethereum’s price already hit all-time highs in 2021, and some analysts predict that it could reach $10,000 or more in the coming years.\n\nDogetti – The Latest Ultra Low-Cap Gem that could 100x\n\nAre you ready to join the latest addition to the meme coin family? Well, hold on to your leashes because Dogetti (DETI) is here, and it’s not playing fetch! Inspired by the Mafia theme, Dogetti promises to reward its loyal family with a 2% reflection protocol. That means the more you invest, the more you get to eat, so make sure you bring your appetite!\n\nBut Dogetti isn’t just about food; it’s also about trading. With DogettiSwap, you can exchange any ERC20 token with ease, thanks to its user-friendly interface. And if you’re looking for a new furry companion, DogettiNFTs will let you mint your very own Dogetti pet.\n\nBut what does Bitcoins blow up mean for ultra-low cap gems, such as Dogetti (DETI)? Similar to Ethereum’s outcome, Bitcoins increased gains will only lead to an increase of interest in the other altcoins; therefore, everyone will be on the hunt for the next gem – which is obviously the coin you are reading about! As Dogetti hasn’t seen gains yet, there is a chance this coin could explode, giving you a 100x return…\n\nWith all these exciting features, you may want to consider joining their family soon. Who knows, you might just get an offer you can’t refuse!\n\nFinal Thoughts\n\nThere you have it! As Bitcoin rises, as experts predict – the rest of the crypto market should follow suit. As this happens, you want to be ahead of the crowd and choose coins with great potential, such as Ethereum and Dogetti!\n\nIt’s difficult to put timings on these things, and predictions are never certain, but one thing is for sure: Bitcoin and other cryptocurrencies are here to stay, and they’re only going to become more prominent as time goes on. So, grab your moon boots, and let’s blast off into the future of finance!\n\nFor More Information On Dogetti (DETI):\n\nPresale: https://dogetti.io/how-to-buy\n\nWebsite: https://dogetti.io/\n\nTelegram: https://t.me/Dogetti\n\nTwitter: https://twitter.com/_Dogetti_\n\nSponsored\n\nWARNING: The investment in crypto assets is not regulated, it may not be suitable for retail investors and the total amount invested could be lost\n\nAVISO IMPORTANTE: La inversión en criptoactivos no está regulada, puede no ser adecuada para inversores minoristas y perderse la totalidad del importe invertido"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzUtcGxhY2VzLXRvLWVhcm4tZnJlZS1ldGhlcmV1bS1jb2lucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "5 Places to Earn Free Ethereum Coins - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vc3BvcnRzLnlhaG9vLmNvbS9qdXN0LTE2LWV0aGVyZXVtLXN0YWtlcnMtcHJvZml0LTE2MTQwNTA1NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Mar 2023 08:00:00 GMT",
        "title": "Just 16% of Ethereum Stakers Are in Profit Ahead of Shanghai Upgrade - Yahoo Sports",
        "content": "Just 16% of Ethereum Stakers Are in Profit Ahead of Shanghai Upgrade\n\nDecrypting DeFi is Decrypt's DeFi email newsletter. (art: Grant Kempster)\n\nEthereum’s Shanghai upgrade is just around the corner and that means users are starting to place their bets.\n\nAll of the attention on this specific upgrade revolves around one thing: withdrawing staked Ethereum. Since staking launched back in December 2020, the network just embarking on its journey to a proof-of-stake consensus algorithm, those who locked up their funds haven’t been able to withdraw those funds.\n\nThat’s expected to change in April. But is it bearish or bullish?\n\nSome have argued that folks are going to quickly withdraw their ETH and dump to realize some gains.\n\nThose gains won’t be much though. If you’d locked in your holdings on December 1, 2020, the price of ETH was $612. Selling at current prices means you’d still nab a whopping 156% win.\n\nETH price from day of Beacon Chain launch to present. Source: CoinGecko .\n\nThose are certainly respectable gains, but for a pretty slim majority of users.\n\nIn fact, in dollar terms, since staking began, just 16% of stakers are in the money, per Dune. Were the upgrade to be executed today, the vast majority of users would be hit with some pretty serious losses.\n\nHow much staked money is in profit since staking began? Source: Dune .\n\nIt’s impossible to know what people will do when faced with potentially double-digit losses. Still, there are about $6.25 billion staked that’s in the money; it’s likely some of them sell.\n\nThat’s the bear argument.\n\nThe bull argument is this: after nearly three years, during which the devs finally delivered the highly-anticipated merge event, people are going to double down. The risk profile of staking drops tremendously once people can see that, yes, if they put their money into this black box they can earn a yield and can take the money out of that black box whenever they like.\n\nSome DeFi projects are also making this bet too, rolling out a unique levered mechanism.\n\nAave’s latest upgrade does precisely this. Here’s how it works: Deposit your Ethereum into liquid staking protocol Lido Finance to receive staked ETH (stETH); use that stETH to borrow more Ethereum on Aave; restake the Ethereum on Lido; and repeat the cycle depending on how degenerate you are.\n\nSpark Lend, a not-yet-launched product from a handful of MakerDAO engineers, will also offer a similar tool.\n\nThis is obviously hugely risky and if Ethereum hits any volatility, consider yourself liquidated.\n\nDecrypting DeFi is our DeFi newsletter, led by this essay. Subscribers to our emails get to read the essay before it goes on the site. Subscribe here."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoLWRlbnZlci11cGRhdGVzLWVyYy00MzM3LWxhdW5jaGVkLXRvLWRyaXZlLWFkb3B0aW9uLWFyYml0cnVtLWN0by10YWxrcy1hYm91dC1sYXllci0yLXNjYWxpbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "ETH Denver updates: ERC-4337 launched to drive adoption, Arbitrum CTO talks about layer-2 scaling - crypto.news",
        "content": "Per recent updates, the ETH Denver event is in progress with even more announcements and features being released to the crypto community.\n\nERC-4337 launched\n\nEthereum has for years supported three different iterations of smart contracts, that is, ERC-20, ERC-721, and ERC-1155. However, at this year’s ETH Denver, a new class of ERC-20 tokens was launched, ERC-4337.\n\nReports suggest that ERC-4337 aims to bring a new solution of providing investors with accounts that can be easily managed, offering bank-like features. It is reported that this standard would allow investors to set limits for their accounts, just like in banks.\n\nProponents claim this standard will make crypto more user-friendly, promoting faster adoption as people can now use standard passwords and simple two-factor authentication. With ERC-4337, investors will no longer need to write down long seed phrases.\n\nEthereum Foundation security researcher Yoav Weiss said the standard will be revolutionary since “the next billion users are not going to write 12 words on a piece of paper.” He also highlighted that better usability is critical to cryptographic keys.\n\nWhat else happened?\n\nThe launch of ERC-4337 was one of the many standout events at ETH Denver. Many discourses and panel discussions explored the crypto landscape.\n\nFor instance, Robert Habermeier, Polkadot’s founder, took centerstage at ETH Denver, discussing various aspects of technology, tooling, and scaling for an hour.\n\nCult DAO has also played a significant role in making ETH Denver successful, presenting a small presentation. There have been lots of mentions of CULT DAO’s presence.\n\nhttps://twitter.com/iamcomingundone/status/1632016243921395713\n\nPolygon, another popular crypto network, also participated in the ETH Denver. Polygon’s presentation was done on Mar. 4, where they discussed their Polygon ID. Another layer-2 scaling solution, Arbitrum, made an appearance. Its CTO and co-founder, Harry Kalodner, discussed the latest developments in the layer-2 realm.\n\nThere was also a panel discussion between crypto influencers, including David Palmer, Victor Rortvedt, and Aaron Wright.\n\nThe theme was “Investment DAOs in Adolescence – Lessons from the Early Days of a New Form of Human Coordination Panel.” They looked into the possibility of a new organizational form for DAO.\n\nPerhaps to lighten the mood, a toilet paper with Sam Bankman Fried’s face was seen in the washrooms.\n\nFollow Us on Google News"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpZy1leWVzLWNvaW4tYml0Y29pbi1hbmQtZXRoZXJldW0tY2FwaXRhbGlzaW5nLW9uLXRoZS1tb21lbnR1bS1mcm9tLWphbnVhcnkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "Big Eyes Coin, Bitcoin and Ethereum Capitalising On the Momentum from January - Analytics Insight",
        "content": "The year 2022 was nothing short of a catastrophic year for digital assets, with the crypto world caught up in the chaos of one of the industry’s largest scams. One of the biggest crypto exchanges FTX was a two-week nightmare that experts and analysts predicted will damage and have a long-term effect on crypto users around the world. Albeit, as we just start the month of March, crypto investors may be able to breathe a sigh of relief. Because since January a few coins have been experiencing a bullish-like trend, which crypto enthusiasts hope will continue.\n\nAs crypto users want to invest in the market’s more established digital assets, a ‘big-eyed’ feline is purring away and grabbing the attention of investors. Because of its enticing features and advantages for investors, Big Eyes Coin (BIG) is becoming more and more well-known.\n\nNonetheless, several well-known cryptocurrencies had a difficult 2022 as a result of the collapse of the FTX exchange. In this challenging time, new cryptocurrencies like Big Eyes Coin saw great improvements.\n\nMake BIG Returns with Big Eyes Coin Loot Boxes\n\nA meme coin project called Big Eyes Coin (BIG) seeks to bolster the crypto market by bringing wealth and more users. It is a cat meme coin that aims to become accepted on the Ethereum blockchain and offer more benefits to its community. Big Eyes Coin is a DeFi solution that promises to combine exchanges, liquidity pool purchases, staking, and other features like NFTs and the metaverse. Since the start of its presale, the meme coin has raised a sizable sum of money and has already gained widespread attention.\n\nLoot boxes will be available for the Big Eyes Coin community. Several adventure-style video games feature mystery boxes called loot boxes. These may be used to unlock new in-game goods, weapons, or clothes. They come randomly when playing a game.\n\nA fortunate member of the BIG community might win up to $100,000 in tokens from one of the three available loot boxes, which are all filled with $HUGE tokens. Today a fourth box has been launched called the “Excali-Paw Master Chest” worth $9,999 and will have rewards ranging from $10k to $1,000,000.\n\nBitcoin – Where It All Began\n\nAfter running a mining network for almost two years, Satoshi Nakamoto established the Bitcoin (BTC) blockchain in 2009. The coin’s introduction as a proof-of-work currency ushered in a new era of decentralised finance in which crypto tokens will dominate a sizable portion of the world financial market.\n\nBefore being made accessible for trading and exchanging, Bitcoin (BTC) was once a token that users had to mine. As users held power over the token’s future, the mining was compatible with its decentralisation aims. Specialised graphics processing units like ASICs can still mine Bitcoin, even though doing so on mobile devices is no longer cost-effective. This has drastically restricted mining to large companies.\n\nBTC relied on scarcity rather than the qualities of the protocol to climb the cryptocurrency rankings. Its main contribution to DeFi was the development of private, secure blockchain technology, which increased user security and promoted the transfer of assets throughout the world.\n\nBlockchains also record each transaction that users make. Only for security reasons may the data be obtained; they cannot be used to identify somebody. Public keys are generated for each transaction, and each user has a private key. For tracing transactions on the blockchain, the public keys operate as reference points.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5mYXoubmV0L2FrdHVlbGwvZmluYW56ZW4vZGlnaXRhbC1iZXphaGxlbi93YXMtZXRoZXJldW0tZW50d2lja2xlci1idXRlcmluLWFuLWtyeXB0b3dhZWhydW5nZW4tdWViZXJyYXNjaHQtMTg3MjAxMDMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Mar 2023 08:00:00 GMT",
        "title": "Was Ethereum-Entwickler Buterin an Kryptowährungen überrascht - FAZ.NET",
        "content": "Auch in turbulenten Zeiten ist es keine Hexerei, 500.000 Euro solide in Anleihen und Aktien anzulegen. Man sollte es selbst in die Hand nehmen und sich zunächst drei Fragen beantworten."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYm9sZC5jb20vc2hpYi13aW5zLXRvcC1zcG90LWFzLXRoZS1tb3N0LXBvcHVsYXItdG9rZW4taGVsZC1ieS1ldGhlcmV1bS13aGFsZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "SHIB wins top spot as the most popular token held by Ethereum whales - Finbold - Finance in Bold",
        "content": "The price of Shiba Inu (SHIB) has been struggling recently, much like the general market, which has been impacted by various macroeconomic factors and increased regulatory uncertainty. However, the price movement has partly sparked investor interest in accumulating the meme coin, as exhibited by Ethereum (ETH) whales.\n\nIn this regard, Shiba Inu has emerged as the top cryptocurrency held by the top 100 Ethereum whales at 12%, with a value of $601.2 million worth of SHIB, according to data shared by WhaleStats on March 5.\n\nSHIB accounts for the top spot excluding stablecoins USDC and USDT, which have a share of 16% and 14%, respectively, among Ethereum whales.\n\nTop Ethereum whale holding. Source: WhaleStats\n\nThe latest development comes after previous data by WhaleStats on March 3 indicated that SHIB had flipped Chainlink (LINK) for the most traded token among the top 100 Ethereum whales.\n\nOther top cryptocurrencies held by ETH whales include Bitpanda Ecosystem Token (BEST) at $155.9 million, Polygon (MATIC) at $150.2 million, SwissBorg (CHSB) at $131.7 million, Chainlink at $130.9 million, Uniswap (UNI) at $72.7 million, Locus Chain (LOCUS) at $70.1 million, and Decentraland (MANA) at $63.3 million.\n\nImplication of SHIB ranking among Ethereum whales\n\nShiba Inu’s ability to emerge on top among the Ethereum whales has potentially renewed investor interest, which could impact SHIB’s price, which has been dominated by bearishness.\n\nThe meme coin now finds itself in a distinctive position, with the potential to reap the rewards of the heightened trading volume. However, it also implies that any abrupt decline in volume could harm the coin’s price.\n\nMoreover, the development complements other Shiba Inu on-chain activities, specifically the upcoming launch of Shibarium, a layer-2 scaling solution that the Shiba Inu community eagerly anticipates. While there is no official release date yet, Shibarium is highly anticipated for the enhancements it will provide to the network.\n\nShiba Inu price analysis\n\nBy press time, SHIB was trading at $0.000011, with daily losses of almost 1%. On the weekly chart, Shiba Inu is down about 10%.\n\nSHIB seven-day price chart. Source: Finbold\n\nOn the other hand, SHIB’s technical analysis on TradingView is mainly bearish. The summary of the one-day gauges aligns with ‘sell’ at 12. Moving average sites are recommending the ‘strong sell’ sentiment at 11. Oscillators are for ‘buy’ at 3.\n\nSHIB technical analysis. Source: TradingView\n\nMeanwhile, regarding SHIB’s price projection, machine learning algorithms at CoinCodex indicate that SHIB is likely to experience bearish sentiments towards the end of the year. As per the projection, the token might trade at $0.00000361 on December 30, 2023.\n\nWith SHIB still lacking significant use cases, the token heavily relies on the adoption and success of network development. At the same time, the token will depend on the general market sentiment. Moreover, based on historical price movements, SHIB has the potential to reclaim previous highs that ushered in a new crop of crypto millionaires.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]