[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA4LzE5L3Nob3VsZC15b3UtYnV5LWV0aGVyZXVtLXdoaWxlLWl0cy1zdGlsbC1iZWxvdy0zMDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Below $2,000? - The Motley Fool",
        "content": "For the year, Ethereum (ETH 0.59%) is up 45%. While that recent performance is impressive, there are still plenty of skeptics out there. After all, a a recent price of about $1,730, Ethereum is 64% below its all-time high of $4,892 from two years ago, and hasn't had the type of monster rally many investors were expecting when it completed The Merge, a system upgrade, last September.\n\nIn fact, Ethereum is trading at almost exactly the same price it was one year ago. And it has had unexpected difficulty breaking through the $2,000 price level. So is Ethereum undervalued or not? To answer that question, there are three important factors to consider.\n\nInnovation leader\n\nEthereum recently celebrated its eighth birthday, and it's fascinating to look back and see how far Ethereum has come in such a relatively short time. Ethereum has become the de facto benchmark standard that all other Layer-1 blockchains measure themselves against. There have been a large number of blockchains that have attempted to become \"the next Ethereum\" and failed -- and that list includes Cardano, Avalanche, and Solana.\n\nBy investing in Ethereum, you are investing in the innovation leader with a clear competitive advantage. Ethereum pioneered the concept of smart contracts for the blockchain and has consistently been first to market with new innovations. That includes the launch of non-fungible tokens (NFTs), new decentralized finance exchanges, and new gaming and metaverse experiences. Given Ethereum's track record of innovation, I'm confident that there's plenty of upside potential ahead.\n\nDiversification benefits\n\nAll of that innovation happening on the Ethereum blockchain means that the size and scope of the Ethereum ecosystem continues to grow. Ethereum still has the largest community of blockchain developers in the world, and the number of use cases for Ethereum continues to grow. For example, Wall Street firms are experimenting with Ethereum as a new form of payment network, while manufacturing companies are experimenting with Ethereum's blockchain technology to improve their supply chains.\n\nFrom my perspective, Ethereum is simply the most diversified crypto that you can own in your portfolio. You're not investing in a one-trick pony, and that is really the key to Ethereum's allure for both retail and institutional investors. That's an important consideration during volatile and uncertain market conditions, when diversification is the key to riding out the tough times.\n\nRoadmap for success\n\nOne other key consideration is that Ethereum has a roadmap for success, so you can see exactly where Ethereum has been, and where it's headed. After The Merge, Ethereum co-founder Vitalik Buterin unveiled an updated roadmap that includes five new distinct stages, known as the Surge, Scourge, Verge, Purge, and Splurge. Even if each of those stages only lasts six months, that's still a three-year strategic vision. If you're a buy-and-hold investor, that's exactly what you want to see: a long-term plan for success.\n\nWhen you dig into the specific milestones on Ethereum's roadmap, that's when things get really interesting. For example, the current phase of development (\"The Surge\") has a goal of boosting Ethereum's transaction processing abilities to 100,000 transactions per second. That's blazingly fast speed, even faster than the theoretical maximum speed of the Visa card payment network (65,000 transactions per second). Eventually, says Buterin, the goal is to hit 1 million transactions per second.\n\nWhat could possibly go wrong?\n\nInvesting in crypto can be risky and speculative, and it's no different with Ethereum. So, yes, there's actually quite a bit that could go wrong for Ethereum. The Securities and Exchange Commission, for example, might decide that Ethereum is actually a security, thereby sending it to crypto purgatory and upending future plans for development. There's also a risk that an upstart \"Ethereum killer\" might truly emerge, dooming Ethereum to the dustbin of history.\n\nBut, as noted above, Ethereum has a strong track record of innovation, growth, and diversification. At recent prices it seems remarkably undervalued. Just two years ago, Ethereum was trading for nearly $5,000. So I'm very confident buying Ethereum now, while it still seems to be trading at a discount. Over the long haul, Ethereum's upside potential is just too high to ignore."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaXMtZXRoZXItdGhlLXNhbWUtYXMtZXRoZXJldW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Is Ether the Same as Ethereum? - Watcher Guru",
        "content": "Is Ether the Same as Ethereum?\n\nCryptocurrency enthusiasts and investors often come across the terms Ethereum and Ether.\n\nHowever, there is a common misconception that these two terms are interchangeable.\n\nIn reality, Ethereum and Ether are distinct entities within the realm of digital currency.\n\nThis article aims to clarify the differences between Ethereum and Ether, providing a comprehensive understanding of their roles and functionalities in the cryptocurrency ecosystem.\n\nAlso read: Why are Ethereum Network Fees so High?\n\nSource: Forbes\n\nUnderstanding Ethereum\n\nWhat is Ethereum?\n\nEthereum is a blockchain-based platform that revolutionizes the way we interact with digital assets and decentralized applications (dApps).\n\nIt serves as a decentralized global platform for developers to create smart contracts and dApps without the need for intermediaries.\n\nEthereum’s blockchain technology allows for secure, transparent, and tamper-proof transactions and operations.\n\nFeatures and Benefits of Ethereum\n\nDecentralization: Ethereum operates on a decentralized network of nodes, eliminating the need for a central authority or third-party intermediaries. This decentralized approach ensures transparency and reduces the risk of censorship or manipulation. Smart Contracts: Ethereum introduced the concept of smart contracts, which are self-executing contracts with the terms of the agreement directly written into code. These contracts automatically execute transactions and enforce agreements without the need for intermediaries, offering efficiency and automation in various industries. Decentralized Applications (dApps): Ethereum provides a platform for developers to build decentralized applications that operate on the blockchain. These dApps leverage the security, transparency, and immutability of the Ethereum network while offering a wide range of functionalities and use cases. Interoperability: Ethereum allows for interoperability with other blockchain networks, enabling seamless integration and communication between different decentralized platforms. This interoperability expands the potential for collaboration and innovation within the cryptocurrency ecosystem.\n\nUnderstanding Ether\n\nSource: CNN\n\nWhat is Ether?\n\nEther (ETH) is the native cryptocurrency of the Ethereum network.\n\nWhile Ethereum is the platform, Ether serves as the fuel that powers transactions and operations within the network.\n\nEther stands as a digital asset that is purchasable, tradable, and usable for investment, payments, and exchange trading.\n\nAlso read: Ethereum: Donald Trump Holds Up To $500k ETH\n\nFunctions and Uses of Ether\n\nPayment Method: Ether is used as a means of payment for on-chain transactions within the Ethereum network.\n\n\n\nWhen users initiate transactions or execute smart contracts on Ethereum, they need to pay gas fees, which are calculated in Ether. These gas fees compensate the network participants, including miners, for their computational resources and effort in securing the blockchain. Investment: Ether can be seen as a digital asset that individuals can invest in for potential capital appreciation. Similar to other cryptocurrencies, the value of Ether is subject to market fluctuations and can provide opportunities for investors to generate profits.\n\n\n\nYet, remember that engaging in cryptocurrency investments involves risks and requires prudent consideration. Trading: Ether is listed and traded on various cryptocurrency exchanges, allowing users to buy, sell, and trade the digital asset. Traders can take advantage of price movements and volatility in the cryptocurrency market to potentially profit from their trading activities. Medium of Exchange: Some merchants and online retailers accept Ether as a form of payment for goods and services.\n\n\n\nThe use of Ether as a medium of exchange provides an alternative to traditional fiat currency transactions, offering faster and more secure transactions, especially for cross-border payments.\n\nEther vs. Ethereum: The Differences\n\nIt is crucial to understand the distinction between Ethereum and Ether to avoid confusion. Ethereum refers to the blockchain-based platform that enables the creation of decentralized applications and smart contracts.\n\nOn the other hand, Ether is the specific cryptocurrency that operates within the Ethereum network.\n\nWhile Ethereum is the infrastructure, it also serves as the digital asset and means of value exchange within that infrastructure.\n\nConclusion: Is Ether the Same as Ethereum?\n\nIn summary, Ethereum and Ether are integral components of the cryptocurrency ecosystem, but they are not interchangeable terms.\n\nFurthermore, Ethereum is a blockchain-based platform that facilitates the development and deployment of decentralized applications and smart contracts. Ether, on the other hand, is the native cryptocurrency of the Ethereum network, serving as a digital asset and payment method within the ecosystem.\n\nUnderstanding the distinctions between Ethereum and Ether is essential for anyone navigating the world of cryptocurrencies, enabling informed decision-making and participation in this evolving digital landscape."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ob3NraW5zb24tdml0YWxpay1jYXJkYW5vLWZvdW5kZXItdGhpbmtzLWV0aGVyZXVtLW91dGRhdGVkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Hoskinson vs. Vitalik: Cardano Founder Believes Ethereum Is an Outdated 'Dumpster Fire' - CCN.com",
        "content": "Key Takeaways\n\nCardano founder Charles Hoskinson says Ethereum has terrible programming\n\nThe CEO highlights the power of his layer-2 solution Hydra\n\nADA survives despite removal from key exchanges\n\nIf Elon Musk was right about one thing when it comes to Twitter it would be about its potential as a town square. No other social media platform allows everyday folk to interact with celebrities, CEOs, and multi-millionaires/billionaires the way Twitter does. For that reason, one may find several instances where influential figures on the platform voice their opinions in a candid non-corporate-like manner.\n\nOn August 17th, Twitter became home to a daring statement by Charles Hoskinson, CEO of Cardano. Hoskinson quote-retweeted a user who outright mocked Cardano, Hydra, and Hoskinson. The CEO then responded by highlighting key advantages Cardano has over Ethereum, the blockchain the user seemingly preferred.\n\nCool, let’s make a bet. My prediction is that within six months time, Charles will: Stop talking about Hydra “We never actually said that was a viable solution for everything, it’s only good for a few specific things”, has level set on Input Endorsers “That’s the long term… — 0xNLY.arf (@0xNLYFANS) August 17, 2023\n\nCardano: A Better Way Of Handling Transactions\n\nHoskinson’s response focused both on criticizing Ethereum, and on highlighting the capabilities of his technology.\n\n“Hydra is live on mainnet and evolving fast. Mithril is live as well and the first step towards a rich DA and light client strategy. We already designed a significantly better way of handling transactions via tiered pricing and Babel fees.\n\nThere’s been a roll-up strategy since Midnight was conceived 4 years ago. The protocols and primitives had to catch up and are getting there,” tweeted Hoskinson.\n\nHydra refers to the layer-2 scaling solution that uses sidechains to offload transactions from the main chain. This allows Cardano to process more transactions per second at a lower cost.\n\n“Meanwhile Ethereum has a dumpster fire of a consensus layer, has a terrible programming model that they can’t change, and are getting eaten alive by their own layer 2 ecosystem.“\n\nIt's getting delusion town now. Hydra is live on mainnet and evolving fast. Mithril is live as well and the first step towards a rich DA and light client strategy. We already designed a significantly better way of handling transactions via tiered pricing and Babel fees. There's… https://t.co/2cJa8ivJGu — Charles Hoskinson (@IOHK_Charles) August 17, 2023\n\nIn a 2020 video, Hoskinson changed up the trend on his Youtube channel from updates about his personal life to a talk about his company’s innovations.\n\n“Simulations have shown that each ‘Hydra head’ can currently process about 1,000 transactions per second (TPS). With 1,000 stacking pools, each of which processes 1,000 TPS, Cardano could achieve a throughput of up to one million transactions per second,” said Hoskinson in his video.\n\nHydra was first revealed during an AMA video on Hoskinson’s Youtube channel in 2020. When asked about updates on the layer-2 solution his company has been working on, he had this to say:\n\n“We are going to keep adding resources to Hydra, and we’ve been trying to identify some teams so we can parallelize the workstream because it’s such a high commercial priority. And it’s going to be very important that we’ll be able to offload a large number of the transaction traffic that’s going to come from all of the apps that are coming.”\n\nHoskinson did not immediately respond to a request for comment.\n\nCardano’s ADA Token Thrives Despite Outcasting\n\nCardano’s native token ADA has been subject to several attacks due to its status in the eyes of the US Securities and Exchange Commission and its leader, Gary Gensler. Gensler sees any token besides Bitcoin, Bitcoin Cash, Ethereum, and Litecoin as a security. Accordingly, the SEC is willing to sue any exchange that trades in significant sums of these supposed ‘unregistered securities.’\n\nAs a result, many exchanges, such as Revolut, have been seen suspending trading of tokens such as ADA, SOL, and MATIC.\n\nHowever, Cardano and Hoskinson look at the application of ADA and its corresponding blockchain as technologies beyond the simple potential of financial investment.\n\nFor example, in 2021, Hoskinson tweeted his celebration of Cardano technology being used in Ethiopian schools as a form of encrypted credentials for five million students.\n\nDropped by the MOE today to discuss the digital transformation of Ethiopia's educational credentials. Five million students on schedule pic.twitter.com/FGhguPDW2q — Charles Hoskinson (@IOHK_Charles) October 28, 2021\n\nOn top of that, Cardano’s ADA is doing relatively well. Reports show that ADA is on an upward price trajectory and that bulls might be holding ADA in anticipation of a price increase."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9ob3ctZXRoZXJldW0tZnV0dXJlcy1ldGZzLW1heS10cmlnZ2VyLWJydXRhbC1mZWUtd2FyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "How arrival of Ethereum futures ETF may trigger 'brutal fee competition' between fund providers - DLNews",
        "content": "The SEC is reportedly set to approve Ethereum futures exchange-traded funds.\n\nInvestors traded $12.5 billion in Ethereum futures contracts in July.\n\nA futures product in the US may increase demand for Ethereum.\n\nWhile Bitcoin futures exchange-traded funds have been around for nearly two years, Ethereum is yet to have one — but that may be about to change.\n\nOn Thursday, Bloomberg News reported that the US Securities and Exchange Commission is poised to approve the sale of futures contracts for ETH, the token used in the Ethereum blockchain network and the second most valuable cryptocurrency.\n\nThat’s good news for the dozen firms that have long desired to roll out an ETH futures ETF. They include Bitwise, Roundhill, and ProShares, and some funds might be approved as soon as October, Bloomberg reported. Moreover, funds in the hunt for investors may slash fees to capture market share as soon as possible.\n\nDemand influx\n\nAn Ether futures ETF could also be a bright spot for DeFi investors who have been whipsawed this year by an endless stream of hacks and heists in the Ethereum-inspired precinct of the crypto world. The futures product could “increase the demand influx for Ethereum in the US,” according to K33 Research. Translation: more volume, and more action.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nThe advent of ETH futures ETFs may also bolster confidence that the SEC is looking kindly on the many applications filed by asset management firms such as BlackRock for a Bitcoin spot price fund.\n\nNOW READ: Coinbase and Binance crank up lobbying push as Congress prepares to debate crypto bills\n\nThat would be a seismic event because ETFs offer investors an affordable way to bet on the performance of stocks, commodities, and perhaps, cryptocurrencies. Plus, ETFs, which trade in the securities markets, tend to be highly liquid.\n\nThe hope is that a Bitcoin ETF would finally vault the asset class into the mainstream, and take the rest of crypto along with it.\n\nJoin the community to get our latest stories and updates\n\nUnlike a spot ETF, a futures version would offer investors a chance to bet on where the price of ETH will be months from now. These products, which are technically derivatives, are tailored for institutional investors rather than retail traders.\n\nThis is why the SEC and its hard charging chair, Gary Gensler, are probably green-lighting their sale even as the agency continues to review the applications for spot BTC funds.\n\nRobust market\n\nWhile ETH fans may like the news, futures contracts for the token may follow the same trajectory as their Bitcoin counterparts, analysts say. And that could be worrisome for investors.\n\nTwo years after their introduction, Bitcoin futures-related ETFs have less than $1.5 billion in total assets under management, Nate Geraci, president of investment advisor ETFStore, told DL News.\n\n‘I believe investors want the real deal.’ — Nate Geraci\n\nStill, there is a robust market in Ethereum futures contracts. In July, investors traded more than $12.5 billion in Ethereum futures on the Chicago Mercantile Exchange, according to Coinglass data. That may be far less than the record high of $34 billion in November 2021, but the action has been consistently greater than $10 billion a month this year.\n\nFee war\n\nThe SEC’s approval is likely to spur a race by asset managers to attract investors. That means a fee war is probably coming.\n\nRoundhill, an asset management firm vying for an Ethereum futures ETF, could take a chunk of the action if its fees are anything to go by. The asset manager disclosed a 0.19% management fee for its fund, Bloomberg Intelligence analyst James Seyffart tweeted.\n\nNOW READ: Aave stablecoin GHO struggles to hold dollar peg. ‘The focus on peg should come later,’ founder says\n\n“This is very low compared to Bitcoin futures ETFs like ProShares’ 0.95%,” Seyffart said. And it may be “drastically lower” than VanEck’s Bitcoin futures product which charges 0.76%.\n\nETFStore’s Geraci said he thought fees would be below 0.4%, but it “might end up way lower than that.”\n\n“Will be brutal fee competition,” he concluded.\n\nNot as simple as Bitcoin\n\nIt will be important to see how investors size up an Ethereum futures ETF compared to its Bitcoin counterpart, Geraci said. Ethereum isn’t as simple as Bitcoin.\n\nAs the linchpin of the Ethereum network — and by extension, much of the DeFi ecosystem — Ethereum is more of a software play. Its proposition is wrapped up in providing financial utility to users, whether it’s for payments or loans or collateral for loans or buying NFTs. In contrast, Bitcoin is now widely seen as a speculative asset.\n\nInvestors should come at the two digital assets with an entirely different approach, CoinShares’ said last year.\n\n‘Ethereum should be valued differently, assigning a level of utility demand, while Bitcoin is a form of money.’ — Marc Arjoon\n\n“Ethereum should be valued differently, assigning a level of utility demand, while Bitcoin is a form of money and should be valued via a monetary demand model,” research associate Marc Arjoon wrote.\n\nPut another way, Ethereum is a closer match to tech companies than it is to Bitcoin, Arjoon argued. As a result, its correlation to the Nasdaq will “likely rise above that of Bitcoin over time as investors grasp its complexities.”\n\nThe upshot: Ethereum’s futures ETFs might decouple from the course Bitcoin’s futures products took. And there is another consideration — if the SEC approves a spot BTC ETF, there could be a big shift in assets from futures to the spot market.\n\n“I believe investors want the real deal,” Geraci said, referring to spot ETFs.\n\nDecent proxy\n\nAnalysts are already trying to figure out the scale of the Ethereum futures ETF marketplace. Bitcoin’s market cap is around $500 billion, while Ethereum’s is a little less than half that. “I think that’s a decent proxy for what to expect from Ethereum futures ETFs,” Geraci said.\n\nMatt Kunke, a research analyst at market maker GSR, is also making estimates.\n\n“We anticipate the upper bound on demand will similarly be around $1 billion,” he told DL News. This is a fraction of what the market maker would expect for a spot ETF, he added.\n\nHave a tip about the crypto markets? Contact the author at adam@dlnews.com."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vZGVjcnlwdC5jby8xNTI5MTgvZXRoZXJldW0tbGF5ZXItMi1hcmJpdHJ1bS1zZWVzLW9uZ29pbmctaW5mbHV4LW5ldy11c2Vycy1hZnRlci1hcmItYWlyZHJvcC1uYW5zZW7SAXBodHRwczovL2RlY3J5cHQuY28vMTUyOTE4L2V0aGVyZXVtLWxheWVyLTItYXJiaXRydW0tc2Vlcy1vbmdvaW5nLWluZmx1eC1uZXctdXNlcnMtYWZ0ZXItYXJiLWFpcmRyb3AtbmFuc2VuP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Layer-2 Arbitrum Sees Ongoing ‘Influx’ of New Users After ARB Airdrop: Nansen - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nArbitrum, an Ethereum rollup with assets worth $5.77 billion bridged to it, continued to see increased growth last quarter.\n\nThe activity comes after a highly anticipated airdrop in March this year.\n\nThe layer-2 blockchain witnessed strong activity based on the “consistently higher” transaction count and “influx of new participants,” according to a Nansen report shared with Decrypt.\n\nAD\n\nAD\n\nNotably, the blockchain has supported more activity since the airdrop in March.\n\nThe number of new wallets transacting for the first time on the network has surged since the start of the year.\n\nNansen analysts noted that it “points towards more organic activity” as new users have been increasing, even “surpassing Ethereum on certain days in Q2.”\n\nIn contrast, Optimism, which conducted its airdrop on May 31, 2022, didn’t see the same rise in activity following its airdrop.\n\nLike Arbitrum, the Optimism network is a popular layer-2 scaling solution for Ethereum. After releasing its OP Stack, a variety of builders have spun up their very own networks including the Coinbase-incubated Base network.\n\nAD\n\nAD\n\nThe continued influx of new participants also points to “the resilience and thriving ecosystem that Arbitrum has built,” said Nansen analysts\n\nThe launch of Arbitrum Orbit, a permissionless framework for deploying Orbit Chains, or so-called layer-3 chains, atop Arbitrum One or Arbitrum Nova, also appears to have helped boost user activity.\n\nUnpacking Arbitrum Orbit\n\nLaunched on June 21, Arbitrum Orbit lets users create their own Arbitrum-based rollup.\n\nOrbit is similar to Optimism’s OP Stack in enabling the creation of new blockchains with its own privacy, permissions, fee token, and governance specifications.\n\n“These solutions collectively aim to offer faster, more cost-effective, and secure transactions, fostering innovation and supporting Ethereum’s growth as a sustainable and scalable blockchain,” said the analysts.\n\nThe main difference between the two designs is that Optimism chains are “geared towards the layer-2 market,” whereas Arbitrum’s design is more application-specific.\n\nNansen analysts added, “By having less congestion on the base layer, removing app-specific transactions to an L3. Arbitrum Orbit might be able to further aggregate transactions and optimize computation, significantly increasing the transaction throughput.”"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtdG8tYXBwcm92ZS1ldGhlcmVydW0tZXRoLWZ1dHVyZXMtZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Ethereum surges 11% after report SEC is set to approve Futures ETF - Cointelegraph",
        "content": "The price of Ether (ETH) surged around 11% to $1,700 following news that the United States Securities and Exchange Commission is set to allow the first exchange-traded funds (ETFs) based on Ether Futures.\n\nAccording to an Aug. 17 report from Bloomberg — which cited anonymous sources familiar with the matter — the regulator does not look as though it will block the applications of nearly twelve companies, including ProShares, Volatility Shares, Bitwise and Roundhill, that have filed to launch Ether (ETH) futures ETFs in recent weeks.\n\nBreaking\n\n\n\nThe SEC is expected to green light an ETH futures ETF\n\n\n\nThe beginning of something potentially massive here… pic.twitter.com/x9KtOpCqei — Bankless (@BanklessHQ) August 17, 2023\n\nIt remains unclear which ETF applications would be approved by the SEC; however, officials indicated that several of the filings may be approved by as soon as October.\n\nETF analyst Eric Balchunas said he wasn't surprised by the SEC's move to approve Ether futures ETFs, adding that the decision shows how the regulator's views on different products, such as a spot Bitcoin ETF can change over time.\n\nThis not surprising to us, we had said they would approve Ether Futures early on in race. Nice to be validated. Now what does it mean for spot? Hard to say beyond it shows that their views/policy/tolerance can change. https://t.co/JXCxNUpj2U — Eric Balchunas (@EricBalchunas) August 17, 2023\n\nThe SEC has been inundated with applications for Ether futures ETFs, with more than 12 filings for such products being submitted to the regulator since late July.\n\nRelated: Donald Trump’s Ethereum wallet holds $2.8M, new statement shows\n\nThe news pushed ETH's price back up 11% to $1,717 just 20 minutes after the market took a tumble two hours earlier.\n\nThe price of Ether jumped 11% following the news that the SEC would approve Ether futures ETFs. Source: TradingView\n\nBig Questions: Did the NSA create Bitcoin?"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1mb3VuZGF0aW9uLWFubm91bmNlcy05bS1pbi1xMi1wcm9qZWN0LWFuZC1jb25mZXJlbmNlLWZ1bmRpbmcv0gFjaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLWZvdW5kYXRpb24tYW5ub3VuY2VzLTltLWluLXEyLXByb2plY3QtYW5kLWNvbmZlcmVuY2UtZnVuZGluZy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Foundation Announces $9M in Q2 Project and Conference Funding - CryptoPotato",
        "content": "On Aug. 15, the Ethereum Foundation listed projects and community events that received funding in Q2.\n\nFurthermore, the Foundation spent a total of $9.2 million supporting projects, conferences, and industry research.\n\nThe largest number of recipients were community and education projects which included more than ten summits and conferences.\n\nTime to round up all the projects that received funding last quarter 🤠 Read all about ‘em in our Allocation Update: Q2 2023 blogpost! https://t.co/fjgkXXAiod — EF Ecosystem Support Program (@EF_ESP) August 15, 2023\n\nEthereum Foundation Promoting Education\n\nConferences and hackathons across the world, including ETH Barcelona, ETH Belgrade, ETH Prague, Ethereum Singapore, and ETH Rome, were funded.\n\nConsensus Layer research on data availability sampling, distributed systems, and staking infrastructure tools received grants. There was also continued development of Nimbus and Lighthouse Ethereum clients.\n\nCryptography and zero-knowledge proofs were a big category for funding. Toolings like Chiquito and Hypernova to build zk circuits more easily and privacy-preserving protocols like Lambdadelta, Isokratia, and zkEmail were included.\n\nFurthermore, continued work on foundational protocols like halo2, Semaphore, and others was mentioned.\n\nThere was also funding for developer experience and tooling, such as Recovery Pulse for smart contract recovery.\n\nExecution Layer projects such as Fluffy light client were supported, as were Nethermind internships.\n\nFinally, there was funding for the Nimbus execution layer development and layer-2 Beacon Chain blockchain explorer.\n\nThe Ethereum Foundation ecosystem support program (ESP) continues to back the growing environment on crypto’s largest smart contract network despite the ongoing bear market.\n\nETH Price Outlook\n\nIn related news, it was recently reported that former U.S. President Donald Trump holds between $250,000 and $500,000 worth of ETH. The content of his crypto wallet is likely to be tied to the sale of his self-themed NFT collection.\n\nUnfortunately for traders, there has been very little activity on Ethereum markets for the past few weeks.\n\nETH has dipped marginally on the day to trade at $1,826 at the time of writing. The asset is currently sitting at support levels in a sideways channel that it has been stuck in for almost two months.\n\nMoreover, ETH has not been below $1,800 since a brief dip in mid-June when the SEC unleashed its barrage of lawsuits targeting crypto exchanges. There is further support at $1,740 should the markets dip further this week.\n\nAnalysts have highlighted a number of bullish fundamentals for Ethereum, but markets have yet to respond."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjQ2MjQ4L2V0aGVyZXVtLWxheWVyLTItYmFzZS1kYWlseS10cmFuc2FjdGlvbnMtZmxpcC1vcHRpbWlzbS1hcmJpdHJ1bdIBZ2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI0NjI0OC9ldGhlcmV1bS1sYXllci0yLWJhc2UtZGFpbHktdHJhbnNhY3Rpb25zLWZsaXAtb3B0aW1pc20tYXJiaXRydW0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Layer 2 Base daily transactions pass Optimism and Arbitrum - The Block",
        "content": "Ethereum Layer 2 network Base, incubated by the crypto exchange Coinbase, jumped past the dominant Optimistic Rollup scaling solutions Arbitrum and Optimism this week in terms of average daily transactions.\n\nBase's seven-day moving average daily transaction count reached 610,000 on Aug. 15, compared to Optimism’s 597,000 and Arbitrum's 576,000, before falling back, according to The Block's data dashboard.\n\nBase saw daily active users surge to over 100,000 within a day of its public mainnet launch, boosted by the social network friend.tech.\n\nBase also led the pair for the first six days following launch by new daily unique addresses and profits generated, but these metrics have also fallen back over the last few days as the initial hype surrounding the Layer 2 dies down.\n\nThe latest data for Aug. 17 shows 24,000 new addresses generated for Base, compared to 32,000 and 29,000 for Optimism and Arbitrum, respectively.\n\nData from the same date shows Base generating daily revenue of $93,000 compared to Arbitrum's $358,000 and Optimism’s $231,000.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nHowever, in terms of value locked, Arbitrum and Optimism continue to dominate, with $4.2 billion and $1.4 billion in assets, respectively, compared to the newly-launched Base's $244 million.\n\nOnchain Summer\n\nBase officially opened to the public on Aug. 9, featuring over 100 dapps and service providers. DeFi protocols Uniswap, SushiSwap and Compound were among the first to go live on the network. Developed on Optimism’s software stack known as the OP Stack, Base is designed to offer lower transaction fees and faster transaction speeds compared to Ethereum.\n\nAlongside the public mainnet launch, the network rolled out its \"Onchain Summer\" initiative, with a series of onchain art, gaming and music projects powered by Base — aiming to demonstrate the efficiency and cost-effectiveness of the Layer 2 chain.\n\nCoca-Cola’s \"Masterpiece\" NFT collection — combining artwork such as \"The Scream\" by Edvard Munch with the famous Coca-Cola bottle to form an onchain collectible — and projects like Friends With Benefits — featuring \"New Era ETH\" and \"New Era BTC\" NFTs in partnership with pseudonymous crypto individual Cozomo de' Medici — are participating in the multi-week event, which ends on Aug. 30.\n\nIt remains to be seen if Base can maintain this initial traction over the coming months."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtcy1uZXctaG9sZXNreS10ZXN0bmV0LXRvLWxhdW5jaC1pbi1zZXB0ZW1iZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Ethereum's new 'Holesky' testnet to launch in September - CryptoSlate",
        "content": "In an Aug. 17 meeting, Ethereum developers discussed developments around a new testnet — named ‘Holesky’ — that is set to launch on Sept. 15.\n\nParithosh Jayanthi, DevOps at the Ethereum Foundation, said that developers tested 1.4 million validators on the Holesky testnet and were able to finalize the network. Jayanthi said this is now recommended as the starting size for the testnet.\n\nJayanthi also asked developers how many testnet tokens should circulate on Holesky. Ethereum developers decided to introduce 1.6 billion Holesky ETH into circulation, as large supplies have previously been supported on testnets. Developers decided not to reduce that number to match the Ethereum mainnet’s 120 million ETH supply, though this option was briefly under consideration.\n\nHolesky will launch in mid-September\n\nGitHub documentation indicates that Holesky will launch on Sept. 15, 2023 at 14:00 UTC. This incidentally was the date of Ethereum’s Merge launch in 2022.\n\nThe testnet will remain in use for several years, with long-term service (LTS) support lasting until 2027 and end-of-life (EOL) lasting until 2028.\n\nDocumentation additionally states that Holesky will replace Ethereum’s Goerli testnet, which was introduced in 2019 as the project prepared to launch its proof-of-stake features and abandon proof-of-work mining. Goerli and Holesky — as well as the current Ethereum mainnet — all act as proof-of-stake chains. However, unlike Ethereum’s mainnet, the two testnets do not use ETH tokens with real market value.\n\nHolesky will also pave the way for two future Ethereum upgrades: an execution layer upgrade called Cancun and a consensus layer upgrade called Deneb.\n\nThe testnet’s unusual name is not “hole-sky” but is named after a train station in the Czech Republic city of Prague. That station is often casually referred to as “Holešky.” Ackee Blockchain Security discovered that the testnet’s code contains an easter egg: the chain ID of the testnet, 17000, is also the area’s postal code.\n\nMentioned in this article"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzE5L2hhY2tlci1leHBsb2l0cy1vcHRpbWlzbS1iYXNlZC1kZWNlbnRyYWxpemVkLWNyZWRpdC1tYXJrZXQtZm9yLTcyMDAwMDAtd29ydGgtb2YtZXRoZXJldW0tZXRoL9IBggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8xOS9oYWNrZXItZXhwbG9pdHMtb3B0aW1pc20tYmFzZWQtZGVjZW50cmFsaXplZC1jcmVkaXQtbWFya2V0LWZvci03MjAwMDAwLXdvcnRoLW9mLWV0aGVyZXVtLWV0aC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Hacker Exploits Optimism-Based Decentralized Credit Market for $7,200,000 Worth of Ethereum (ETH) - The Daily Hodl",
        "content": "An Optimism-based (OP) decentralized credit market protocol has been hacked to the tune of millions of dollars worth of Ethereum (ETH).\n\nAccording to the security department of web3 protocol De.Fi, bad actors have stolen about $7.2 million worth of the leading smart contract platform by exploiting Exactly (EXA), an open-source credit market project.\n\n“After a thorough review of the Exactly protocol hack, we have concluded that the total of stolen amount up to date is ~$7.2 million (4,323.6 ETH) Eventually, they bridged ~1,490 ETH, using Across Protocol, and 2,832.92 ETH to Ethereum via Optimism Bridge.”\n\nAccording to Exactly, the protocol has been temporarily paused as the issue is investigated, though investors will still be able to withdraw funds.\n\n“We’re actively investigating a security issue within our protocol. To ensure user safety, the protocol is temporarily paused (you can still withdraw assets). Our team is on top of this and will share more details as soon as possible.”\n\nBlockchain security firm Beosin explains how the hacker found a way to bypass the protocol’s security measures.\n\n“Root cause of the Exactly Protocol exploit: the market address in DebtManager contract could be manipulated. The attacker passed in a malicious market contract address, bypassing the permit check, and executed a malicious deposit function to steal the USDC deposited by users. Finally liquidated users’ assets to make a profit.”\n\nNews of the hack had an impact on EXA’s price as the altcoin fell sharply during the last 24 hours. EXA is trading for $4.28 at time of writing, a 32% decrease in the last day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbmdhcGUuY29tL2JyZWFraW5nLXNlYy1hbGwtc2V0LXRvLWFwcHJvdmUtZmlyc3QtZXRoZXJldW0tZnV0dXJlcy1ldGYtaW4tdXMv0gFaaHR0cHM6Ly9jb2luZ2FwZS5jb20vYnJlYWtpbmctc2VjLWFsbC1zZXQtdG8tYXBwcm92ZS1maXJzdC1ldGhlcmV1bS1mdXR1cmVzLWV0Zi1pbi11cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Breaking: SEC All Set to Approve First Ethereum Futures ETF in US - CoinGape",
        "content": "As crypto community awaits a spot Bitcoin ETF, US SEC is all set to approve a Ethereum Futures ETF as reported by Bloomberg. The first Ether Futures ETF is expected to list on Oct. 3rd or Oct. 4th by Valkyrie.\n\nCrypto to Have It’s First Ethereum Futures ETF In October\n\nIn a remarkable update today US SEC has signaled that it will allow first crypto futures ETF based on world’s second largest cryptocurrency, Ethereum. As per Bloomberg, it is unlikely that SEC will block the products based on Ether Futures to be released in October. Multiple firms including ProShares, Volatility shares, Bitwise and Roundhill have also applied for Ethereum based ETFs.\n\nadvertisement\n\nA Ether Futures ETF will allow investors to gain exposure to ethereum through stock exchanges just like Apple or Tesla stocks. The current marketcap of Ether is $192 Billion which can substantially increase once an futures ETF is approved.\n\nCrypto Market Crash; Ethereum Price Bounces Back\n\nEarlier today, reports of Bitcoin sell-off by SpaceX led to crypto market wide crash with Bitcoin price dropping by more than 10%. Bitcoin price soon recovered and is currently trading at $26,774 while Ethereum price is trading at $1695 after dropping to $1550 for a short time.\n\nAs the story builds, Ethereum price is expected to surge and a successful approval of a ETH futures ETF will be extremely bullish."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvZWh0ZXJldW0td2hhbGVzLW5vdC1wYW5pY2tlZC05LTVtaWxsaW9uLWJvdWdodC1kaXAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Whales Not Panicked by Market Crash -- $9.5 Million Bought on Dip - CCN.com",
        "content": "Key Takeaways\n\nEthereum has already bounced back by almost 10% following market collapse\n\nWhales are buying the dip\n\nA recovery is expected to at least $1760\n\nThe price of Ethereum has sharply declined from yesterday’s (August 17) opening, decreasing by 14.88% to its lowest point on August 18. This crash came suddenly and left many guessing where the price is headed next.\n\nWhile some have been panic selling, others have been using this opportunity to buy up crypto at a discount price. This was especially the case among the Ethereum whales.\n\nAs their activity has shown bullish sentiment, could this mean that the price is ready for a bounce?\n\nAre whales buying?\n\nAs reported by Lookonchain in a Twitter thread, BlockTower Capital deposited 5K of ETH worth $8.4M to Coinbase to sell, while other whales have bought the dip.\n\n1/ After the market crashed, BlockTower Capital panicky deposited 5K $ETH ($8.4M) to Coinbase.https://t.co/8xgOWrI1yA But the other 2 whales bought a total of 5,631 $ETH ($9.5M) from the bottom. Are you bullish or bearish? pic.twitter.com/xmBC5yFO4Z — Lookonchain (@lookonchain) August 18, 2023\n\nMeanwhile, more buying whale activity was seen. Two whales bought a total of 5,631 ETH worth $9.5M on the dip. One whale deposited 3998 ETH worth ($6.72M) to Compound and borrowed $5M stablecoins only to buy back 3,027 ETH ($5.09M) at $1,652.\n\nAnother deposited $4M in USDC to Binance and withdrew 2,604 ETH ($4.4M) after the market crashed. A Whale named Cumberland was mostly selling a total of 8K in ETH ( worth $14.4M) before the market dumped and then bought back 4K ETH ($6.72M), withdrawing it from Binance.\n\nPer Messari data, looking at the supply distribution charts, we can clearly see that whales haven’t been dumping, and instead, they have been increasing their holding. The price has already made a bounce off almost 10% from its dip, so the whales have definitely been offering support.\n\nEthereum Price Analysis\n\nThe price of Ethereum fell sharply and came down from $1,800 on its open yesterday to $1543 at its lowest wick today, decreasing 14.64%. It has already recovered by 8.5%, measured to the level on which it’s currently trading at $1,675.\n\nETH fell to the 0.786 Fibonacci retracement level of the previous ascending move, but the 4-hour candle closed at 0.618, leaving an 8.2% wick on the 4-hour chart. This is in itself the sign that the support is strong at the $1,670 territory as the dip was immediately bought back with a strong supply, as evident from the previous paragraph from the ETH whales.\n\nThe RSI is signaling extreme oversold conditions as it fell to 6.4% on the 4-hour chart and 20% on the daily. The last time we saw those values was in June 2022, when the market started recovering significantly.\n\nElliott Wave count points out that we could have seen the end of the correctional pattern WXY from mid-April. Due to all of these indicators signaling that the price is undervalued, a bounce will be expected shortly.\n\nThe first target for the expected recovery would be close, to the lower level of the resistance zone above at $1780. What happens at those levels will dictate the next sustainable uptrend, as if a rejection occurs it could set up the price into a larger downtrend. But if it manages to enter the resistance zone again, it will likely mean that it is headed further beyond it, above the mid-April high of $2130.\n\nDisclaimer\n\nPlease note that the contents of this article are not financial or investing advice. The information provided in this article is the author’s opinion only and should not be considered as offering trading or investing recommendations. We do not make any warranties about the completeness, reliability and accuracy of this information. The cryptocurrency market suffers from high volatility and occasional arbitrary movements. Any investor, trader, or regular crypto users should research multiple viewpoints and be familiar with all local regulations before committing to an investment."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9zZWMtcmVwb3J0ZWRseS1wcmVwYXJpbmctdG8tYWxsb3ctZXRoZXJldW0tZXRmcy1idXQtZXRoLWZsYXNoLWNyYXNoZXMv0gFjaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3NlYy1yZXBvcnRlZGx5LXByZXBhcmluZy10by1hbGxvdy1ldGhlcmV1bS1ldGZzLWJ1dC1ldGgtZmxhc2gtY3Jhc2hlcy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "SEC Reportedly Preparing to Allow Ethereum ETFs, but ETH Flash Crashes - CryptoPotato",
        "content": "On Aug. 18, Bloomberg cited ‘people familiar with the matter’ claiming that the regulator is not likely to block the products which many companies have been waiting on.\n\nEthereum futures ETFs are not entirely bullish for ETH because they allow institutional investors to short the asset. However, approval will be a big win for the crypto industry, which has been under heavy fire from the SEC over the past year or so.\n\nBloomberg crypto reporter Ally Versprille shared the news.\n\nScoop w/ @VildanaHajric. SEC poised to allow the first exchange-traded funds based on Ether futures, a major win for several firms that long have sought to offer the products. pic.twitter.com/41OmsWOYnP — Ally Versprille (@allyversprille) August 17, 2023\n\nEthereum Futures ETF Greenlight\n\nOfficials have indicated that several might get approved by October but didn’t specify which, reported Bloomberg.\n\nMany firms, including Volatility Shares, Bitwise, Roundhill, VanEck, Valkyrie, and ProShares, have filed to launch Ethereum-based ETFs.\n\nThe SEC has repeatedly blocked spot-based crypto ETFs but has approved futures-based Bitcoin funds.\n\nETF expert James Seyffart posted a list of current ETF applications pending approval. Valkyrie should be the first ETF with ETH futures on Oct. 3 or 4, he said before adding that the fund will be a mixed Bitcoin and Ethereum product.\n\nThis is what the dates look like as far as we’re aware for #Ethereum Futures ETFs. Valkyrie should be first ETF with Eth futures on Oct 3 or 4 but will be #Bitcoin & Ethereum. Vol Shares looks to be first pure Eth Futures ETF on ~Oct 12. (Including past failed launch attempts) https://t.co/DQQYJnVpLp pic.twitter.com/obnwMrYFEC — James Seyffart (@JSeyff) August 17, 2023\n\nFellow ETF analyst Eric Balchunas said he wasn’t surprised:\n\n“This not surprising to us, we had said they would approve Ether Futures early on in race. Nice to be validated. Now what does it mean for spot? Hard to say beyond it shows that their views/policy/tolerance can change.”\n\nMeanwhile, CEHV partner and crypto exchange critic Adam Cochran labeled it as a “big win” and had implications in all of the crypto litigation.\n\n“The SEC cannot really both simultaneously argue that ETH is some new intrinsic ‘crypto asset security’ that is unregistered and approve an ETH Futures ETF,” he said before adding, “So if the SEC is approving an Ethereum futures ETF they are intrinsically conceding that Ethereum itself is not a security.”\n\nETH Flash Crash\n\nHowever, the bullish developments didn’t stop Ethereum prices dumping to their lowest levels since mid-June. In early Asian trading on Friday morning, ETH dumped to $1,576 before recovering on the SEC news.\n\nStill, the asset is down 6% on the day, trading at $1,688 at the time of writing, so the promise of an ETF still hasn’t prevented the massive selloff.\n\nEthereum spent around two months hovering around $1,850 before this week’s declines. However, it could return to those levels if support can be found where it currently trades."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvMS1iaWxsaW9uLXdpcGVkLW91dC1vZi1jcnlwdG8tbWFya2V0LWFtaWQtYml0Y29pbi1ldGhlcmV1bS1jcmFzaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "$1 Billion Wiped Out Of Crypto Market Amid Bitcoin, Ethereum Crash - Watcher Guru",
        "content": "The crypto market underwent a brutal crash during the late U.S. hours on Thursday, August 17. Bitcoin and Ethereum created lows around $25,100 and $1,550, respectively. Most other crypto assets also mirrored the bearishness. As a result, the aggregate crypto market cap slipped below the $1 trillion threshold and created a low of around $996.9 billion. A modest recovery was noted right after. However, bearish pressure was still prevalent at press time.\n\nAlso Read: 1005 ‘Virgin’ Bitcoins Moved After 13 Years: Is Satoshi Back?\n\nOwing to the sudden dip in prices, more than $1 billion worth of trades were liquidated over the past 24-hours. In fact, more than 75% of the trades were rekt in a window of merely 30 minutes. Individually, BTC trades worth $493.52 million and Ether trades worth $306.98 million were wiped out of the market.\n\nData from Coinglass revealed that the largest single liquidation order took place on Binance. An ETH/BUSD pair valued at $55.92 million was liquidated. Even DeFi exchanges were affected and went on to register “peak” liquidations.\n\nAlso Read: Can Bitcoin Realistically Cross $150,000-$180,000?\n\nDid insufficient liquidity trigger Bitcoin’s crash?\n\nThere have been several instances in the past where Bitcoin and other assets have registered long red candles in fairly short durations. The infamous flash crash of May 19, 2021, is one such instance. On that day, BTC lost 14.38%. The loss was much higher when viewed from the daily high to daily low perspective. From $43,584, the asset dropped to $30,000 in a single day.\n\nHowever, that crash was preceded by a period where Bitcoin created a series of higher highs on the chart. In fact, a couple of weeks before the crash, the asset also scripted history by attaining a peak at $64,854. This time, the conditions were completely different. Bitcoin had been consolidating in a horizontal range for more than a month, trying to amass liquidity. However, it could not garner enough buying momentum, and eventually lost its support by around $28,585. This, in turn, triggered the crash.\n\nAlso Read: Coinbase: Base Scammers Earn $2 Million Profit From 500 Scam Tokens"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNTMwNTMvdGhpcy13ZWVrLWluLWNvaW5zLWZsYXNoLWNyYXNoLWJpdGNvaW4tZXRoZXJldW0tYWx0Y29pbnMtZG93btIBXWh0dHBzOi8vZGVjcnlwdC5jby8xNTMwNTMvdGhpcy13ZWVrLWluLWNvaW5zLWZsYXNoLWNyYXNoLWJpdGNvaW4tZXRoZXJldW0tYWx0Y29pbnMtZG93bj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "This Week in Coins: Flash Crash! Bitcoin and Ethereum Shed 10% as Altcoins Tumble - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nThe prices of leading cryptocurrencies took another downturn this week after briefly inching upwards the week before.\n\nMarket leader Bitcoin (BTC) posted a mild overnight drop of 2% to below $29,000 on Thursday, after minutes of the latest Federal Reserve policy meeting were released the day before. The document indicatesthat the U.S. central bank will continue its conservative monetary policy in an ongoing effort to rein in inflation.\n\nAD\n\nAD\n\nLater that day, Bitcoin dropped below $28,000 for the first time in two months. By the afternoon, it appeared to be in the midst of a flash crash, reaching a bottom of $25,649 before rebounding a little.\n\nAnalysts told Decrypt that market liquidity has been in decline for a while now, leaving the entire market vulnerable to a sudden big sell-off.\n\nAnd a huge sell-off is just what occurred. News that Chinese property giant Evergrande filed for Chapter 15 bankruptcy protection in a Manhattan court prompted institutional investors and big holders to dump riskier assets, like stocks and Bitcoin, causing the sudden drop.\n\nAll told, Bitcoin ends the week at $25,935, posting a seven-day drop of 11.9%.\n\nClosest contender Ethereum (ETH) fared similarly, with an intraweek drop of 10.2% to $1,662.\n\nBroadly speaking, these were some of the lightest price movements. Altcoins generally tumbled harder, with most other leading cryptocurrencies posting losses of between 10% and 20%, including BNB, XRP, Dogecoin (DOGE), Solana (SOL), Polkadot (DOT), Polygon (MATIC), and Avalanche (AVAX).\n\nAD\n\nAD\n\nLosses of over 20% were felt by holders of Uniswap (UNI), Litecoin (LTC), and Shiba Inu (SHIB), which dropped over 23%.\n\nThe most resilient cryptocurrency in the top twenty by market cap was TRON (TRX), which only fell 4.8% and currently sells for $0.073810.\n\nIn the news…\n\nThe regulatory uncertainty around crypto continued apace as the news cycle in the U.S. and beyond gave crypto hopefuls very little to chew on.\n\nOn Monday, the Federal Deposit Insurance Corporation–a leading U.S. bank regulator–dedicated two out of ninety pages to crypto in its annual report. Insignificant as it may seem, this was a first for the FDIC, which used the slim space to point out that crypto may pose “novel and complex” risks to the financial system.\n\nArgentinian Bitcoin fans enjoyed a different week than the rest of us. The world’s favorite cryptocurrency reached its Argentine all-time-high of 10.2 million Argentine Peso (ARS) on Wednesday, piggybacked by a surprise victory in the country's presidential primaries by hopeful Javier Milei, a professed libertarian known for his pro-Bitcoin stance."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8xNTI5MDMvc2VjLWV4cGVjdGVkLXRvLWFwcHJvdmUtZXRoZXJldW0tZnV0dXJlcy1ldGZzLWJ5LW9jdG9iZXItcmVwb3J00gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzE1MjkwMy9zZWMtZXhwZWN0ZWQtdG8tYXBwcm92ZS1ldGhlcmV1bS1mdXR1cmVzLWV0ZnMtYnktb2N0b2Jlci1yZXBvcnQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "SEC Expected to Approve Ethereum Futures ETFs by October: Report - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe U.S. Securities and Exchange Commission (SEC) is reportedly set to greenlight Ethereum futures exchange-traded funds (ETFs) in the coming months.\n\nAccording to a Bloomberg report, which cites anonymous sources familiar with the matter, the regulator is not expected to block the applications of around twelve companies, including ProShares, Volatility Shares, Bitwise, and Valkyrie, that have recently applied to launch Ethereum futures ETFs.\n\nSuch an ETF would track the price of Ethereum futures that are traded on the Chicago Mercantile Exchange, rather than direct spot exposure to the digital asset.\n\nAD\n\nAD\n\nWhile it is not clear which specific ETF applications will be approved, officials have reportedly indicated that some of the filings could receive approval as early as October.\n\nThe SEC and Valkyrie declined to comment. ProShares confirmed with Decrypt their application submission, adding that \"we are in the quiet period and due to Securities and Exchange Commission (SEC) regulations are not allowed to discuss products currently in the registration period with the SEC.\"\n\nBitWise and Volatility Shares did not immediately respond to Decrypt's request for comment.\n\nOver a dozen applications for Ethereum futures ETFs hit the SEC’s door in recent weeks, with the Valkyrie’s dual Bitcoin and Ether Strategy ETF, which is a proposed conversion of the financial services firm’s existing Valkyrie Bitcoin Strategy ETF, being first in the line for a possible launch as early as on or around October 3.\n\nEarlier this week, Valkyrie also filed for its Ethereum Strategy ETF, however, the first “pure” Ethereum futures ETF sponsored by Volatility Shares could go live around October 11.\n\nAD\n\nAD\n\nETF analyst Eric Balchunas has meanwhile commented he was not surprised by the SEC's expected move to approve Ethereum futures ETFs.\n\n“This not surprising to us, we had said they would approve Ether Futures early on in race. Nice to be validated. Now what does it mean for spot? Hard to say beyond it shows that their views, policy, and tolerance can change,” wrote Balchunas.\n\nThis not surprising to us, we had said they would approve Ether Futures early on in race. Nice to be validated. Now what does it mean for spot? Hard to say beyond it shows that their views/policy/tolerance can change. https://t.co/JXCxNUpj2U — Eric Balchunas (@EricBalchunas) August 17, 2023\n\nThe SEC has thus far declined to approve any spot crypto ETFs. However, there has been a notable shift in the regulator's approach in late 2021, when the SEC greenlit several Bitcoin futures funds that invest in contracts trading on the Chicago Mercantile Exchange (CME).\n\nBloomberg analyst James Seyffart also pointed to Roundhill, which is also on the list of Ethereum futures ETF hopefuls, disclosing a 0.19% management fee for their proposed fund.\n\n“This is very low compared to BTC futures ETFs like Proshares' $BITO's 0.95%. And is still drastically lower than VanEck's $XBTF which at 0.76%. Fee war already starting in crypto ETFs,” wrote Seyffart.\n\nUPDATE: @roundhill discloses a 0.19% management fee for their Ethereum Futures ETF ( $ETHX). This is very low compared to BTC futures ETFs like Proshares' $BITO's 0.95%. And is still drastically lower than VanEck's $XBTF which at 0.76%. Fee war already starting in crypto ETFs https://t.co/toBBGkPpZd pic.twitter.com/5Fk34F2qAN — James Seyffart (@JSeyff) August 18, 2023\n\nDespite the positive news of the potential approval of Ethereum futures ETFs, the world’s second-largest cryptocurrency last night experienced a significant price drop to its lowest levels since mid-June.\n\nAD\n\nAD\n\nAmid the latest market sell-off, which also saw Bitcoin (BTC) plunge below $26,000, ETH dropped to as low as $1,576 before recovering to $26,533 at the time of writing.\n\nDespite the recovery, Ethereum remains down 7% on the day, according to CoinGecko."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vYmxvY2tjaGFpbm1hZ2F6aW5lLm5ldC90aGUtZXRoZXJldW0tY29tbXVuaXR5LXdob3MtYmVoaW5kLXRoZS1kZWNlbnRyYWxpemVkLXBsYXRmb3JtLWFuZC13aGF0LXRoZXlyZS1idWlsZGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "The Ethereum Community: Who's Behind The Decentralized Platform And What They're Building - Blockchain Magazine",
        "content": "Ethereum is a decentralized blockchain platform that has gained immense popularity over the years. At the heart of the platform lies the Ethereum community, a group of developers, investors, entrepreneurs, and enthusiasts who are passionate about building a more decentralized and open world. In this article, we’ll take a closer look at the Ethereum community,\n\nEthereum is a decentralized blockchain platform that has gained immense popularity over the years. At the heart of the platform lies the Ethereum community, a group of developers, investors, entrepreneurs, and enthusiasts who are passionate about building a more decentralized and open world. In this article, we’ll take a closer look at the Ethereum community, who’s behind the platform, and what they’re building.\n\nThe Birth of Ethereum\n\nEthereum was founded in 2015 by Vitalik Buterin, a Russian-Canadian programmer who was just 19 years old at the time. Buterin had previously been involved in the Bitcoin community, but he became frustrated with the limitations of the Bitcoin blockchain, which did not allow for the development of more complex applications. Buterin believed that a new blockchain platform was needed that would allow for the creation of smart contracts, which could automate the execution of agreements between parties.\n\nButerin’s vision for a new blockchain platform gained the support of a group of like-minded developers, including Gavin Wood, Joseph Lubin, and Jeffrey Wilcke. Together, they formed the Ethereum Foundation, a nonprofit organization dedicated to developing and promoting the Ethereum platform.\n\nThe Ethereum Community Today\n\nSince its launch in 2015, the Ethereum community has grown to include thousands of developers, entrepreneurs, and enthusiasts worldwide. The community is known for its passion, creativity, and commitment to building a more decentralized and open future.\n\nOne of the defining features of the Ethereum community is its open-source nature. All of the code that powers the Ethereum blockchain is freely available for anyone to view, use, and modify. This has led to a vibrant ecosystem of developers building on top of the Ethereum platform.\n\nThe Ethereum community is also known for its strong culture of collaboration and innovation. Developers from all over the world work together to build new applications and services on the Ethereum blockchain. This has led to the development of a wide range of decentralized applications, including decentralized finance (DeFi) platforms, prediction markets, social networks, and more.\n\nThe Ethereum Ecosystem\n\nThe Ethereum ecosystem is made up of a wide range of projects and initiatives, all working together to build a more decentralized and open future. Here are a few of the key players in the Ethereum ecosystem:\n\nThe Ethereum Foundation: The Ethereum Foundation is a nonprofit organization dedicated to developing and promoting the Ethereum platform. The foundation provides funding and support to developers working on the platform. ConsenSys: ConsenSys is a venture studio that builds decentralized applications on top of the Ethereum platform. The company has developed a wide range of applications, including decentralized finance (DeFi) platforms, identity solutions, and more. MakerDAO: MakerDAO is a decentralized finance (DeFi) platform built on the Ethereum blockchain. The platform allows users to borrow and lend cryptocurrency without the need for a centralized intermediary. Uniswap: Uniswap is a decentralized exchange built on the Ethereum blockchain. The exchange allows users to trade a wide range of cryptocurrency pairs without the need for a centralized intermediary. Golem: Golem is a decentralized marketplace for computing power. The platform allows users to buy and sell computing power on the Ethereum blockchain.\n\nAlso, read – All About The Relationship Between: Ethereum And NFTs\n\nThe Future of Ethereum\n\nThe Ethereum community is constantly working to improve and expand the capabilities of the platform. One of the most exciting developments on the horizon is the transition to Ethereum 2.0, which will introduce a number of improvements to the platform, including increased scalability and security.\n\nEthereum 2.0 will also introduce a new consensus mechanism known as Proof of Stake (PoS), which will replace the current Proof of Work (PoW) mechanism. PoS is more energy-efficient than PoW, which will make the Ethereum platform more sustainable and environmentally friendly.\n\nThe top 5 things likely to happen in the future of ethereum:\n\nEthereum 2.0 and Proof-of-Stake: The transition to Ethereum 2.0 will be a major milestone for the platform, as it moves away from the current Proof-of-Work consensus mechanism to a more energy-efficient Proof-of-Stake model. This will allow for faster and more cost-effective transactions, while also increasing network security and decentralization. Increased Adoption of Decentralized Finance (DeFi): The DeFi ecosystem has exploded in popularity over the past few years, and Ethereum has been at the forefront of this movement. As more people become aware of the benefits of decentralized finance, we can expect to see continued growth in this area, with Ethereum as the primary platform for DeFi applications. Integration with Centralized Finance (CeFi): While DeFi has been the focus of Ethereum’s development in recent years, there is also potential for integration with centralized finance. This could include partnerships with traditional financial institutions or the development of hybrid systems that combine the benefits of both decentralized and centralized finance. Increased Interoperability with Other Blockchains: As the blockchain industry continues to grow, there is a need for greater interoperability between different platforms. Ethereum is already working on interoperability solutions, such as the Ethereum-to-Polkadot bridge, which will allow for seamless transfers of assets between the two platforms. We can expect to see more of these types of solutions in the future, as the industry matures. Continued Innovation and Development: The Ethereum ecosystem is a hub of innovation and development, with new ideas and applications emerging all the time. As more developers and entrepreneurs get involved with the platform, we can expect to see even more groundbreaking projects and applications being built on top of Ethereum in the years to come.\n\nGary Gensler teached to the public that Joseph Lubin bought 10% of the ICO for himself. Whats his source? Lubin claims he never even owned half a percent of Ethereums supply. So whats up with this 10%? And did he know about how Lubin called to disguise all major investors? pic.twitter.com/zpYgnOaWNP — Mr. Huber🔥🦅🔥 (@Leerzeit) April 19, 2023\n\nConclusion\n\nThe Ethereum community is a diverse and dedicated group of individuals who are working tirelessly to build a decentralized future. They come from all corners of the world and bring with them a variety of backgrounds, experiences, and perspectives.\n\nThrough their efforts, the Ethereum platform has grown from a simple idea to a revolutionary technology that is transforming industries and challenging traditional power structures. From decentralized finance to NFTs, the possibilities of what can be built on Ethereum are endless.\n\nThe community’s commitment to decentralization and openness has allowed for a vibrant ecosystem of developers, entrepreneurs, and enthusiasts to thrive. With a focus on collaboration, innovation, and inclusivity, the Ethereum community is driving the next wave of technological advancement and paving the way for a more equitable and just world.\n\nAs Ethereum continues to evolve and mature, we can expect to see even more groundbreaking developments emerge from this dynamic community. From scaling solutions to new applications, the future of Ethereum is bright, and the community is poised to lead the charge towards a more decentralized and equitable world."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vdmFsa3lyaWUtZXRoZXJldW0tZXRmLWZpbGluZy_SAUdodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL3ZhbGt5cmllLWV0aGVyZXVtLWV0Zi1maWxpbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Valkyrie Taps Into Ethereum Momentum With New ETF Filing - NewsBTC",
        "content": "In a filing dated August 4, Valkyrie applied to add an Ethereum futures ETF to its Bitcoin Strategy ETF (BTF). However, it would seem this move was pushed back by the SEC as the asset manager has now filed a separate application to offer an Ether futures ETF.\n\nValkyrie Moves To Offer Ethereum Futures ETF\n\nIn an application dated August 16, Valkyrie seeks the United States Securities and Exchange Commission’s (SEC) approval to offer an Ethereum futures exchange-traded fund (ETF).\n\nIf approved, the fund will not directly invest in Ether. Instead, it will focus on purchasing several ether futures contracts to match the total value of the ether underlying the futures contracts with the net assets of the fund.\n\nWhile this fund is relatively similar to the Bitcoin futures ETF, which has existed since 2021, it differs from the Spot Bitcoin ETF, which prominent institutional firms have filed for. Spot ETFs track the crypto asset’s price, while futures ETFs focus on the asset’s future contracts.\n\nValkyrie categorically noted this fact as part of its application and stated that investors looking to invest in the price of ether directly should consider investments other than this particular fund.\n\nThe application also highlighted the risks involved in investing in this fund as, according to Valkyrie, “the Fund’s investments could decline rapidly, including to zero.” As such, investors should understand that they could lose their entire investment.\n\nAs is common with applications such as this, applicants must prove to the SEC that the underlying asset has a regulated market of significant size. And Valkyrie’s filing stated that its fund would be guided by the futures contracts traded on the Chicago Mercantile Exchange (CME).\n\nETH price recovers to $1,685 | Source: ETHUSD on TradingView.com\n\nNo First Mover Advantage?\n\nValkyrie failed to clarify the status of its initial filing in its most recent application. The asset manager had previously tried to add ETH futures contracts to its Valkyrie Bitcoin Strategy ETF (BTF) in a bid to gain a first-mover advantage over other applicants.\n\nSeveral other asset managers, including Bitwise, ProShares, Grayscale, and Volatility Shares, have also applied to offer an Ethereum futures ETF. However, it remains uncertain in what order the SEC is likely to approve (if it does) these applications, especially with this recent development.\n\nJust like Cathie Wood has suggested regarding the pending Spot Bitcoin ETF applications, the SEC can approve multiple applications at once, which will likely eliminate the first mover advantage, or it can decide to approve them in the order in which these applications came in.\n\nDespite expectations that the regulator will approve an Ether ETF this year, the probability of the SEC approving any of these applications remains uncertain as optimism dwindles.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1iYXNlZC1idGN4LXRva2VuLXJhaXNlcy0xNTU1MDQ4NjAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Ethereum-Based BTCX Token Raises $1.5M to Build the World's First Bitcoin Xin Blockchain - Yahoo Finance",
        "content": "Granite city, U.S. Outlying Islands --News Direct-- Chainwire\n\nBTCX Token, a revolutionary platform inspired by the rebranding of Twitter and the visionary influence of Elon Musk, has secured $1.5 million in pre-seed and seed funding to address inefficiencies in the cryptocurrency market. With the aim of upgrading Bitcoin by introducing hyper-deflationary features, BTCX Token seeks to redefine the future of cryptocurrency, tackling key challenges such as volatility, inefficiency, scalability, and sustainability.\n\nThe recently concluded funding, with a valuation of $10 million, is backed by prominent names in the industry by following the steps of the early-staged Bitcoin, enabling BTCX Token to fully enhance its technological foundation and expand both within and outside the cryptocurrency ecosystem. The involvement of experienced Advisory Board members ensures that BTCX Token will solidify its innovative presence in the market.\n\nBTCX Token's unique approach in the form of the combustion model represents a systematic means of controlling supply. By permanently reducing the circulating supply through burning, it creates a scarcity that drives value, echoing transformative moves by tech giants and industry leaders. Unlike arbitrary burning mechanisms, BTCX Token's strategy is thoughtfully aligned with its core ideology, crafting a stable and thriving cryptocurrency ecosystem that promises future appreciation.\n\nThe BTCX Token also introduces a novel concept in staking, offering investors a chance to earn BTCX tokens passively by holding them using BTCX's disrupting algorithm. This simplification and democratization of staking marks a significant milestone, setting it apart from more traditional and volatile avenues. By rewarding stakers, BTCX Token aligns user interests with network growth, creating a mutually beneficial environment. This alignment of incentives fosters community participation and engagement, a crucial factor for enduring success in the rapidly changing crypto world.\n\nStory continues\n\nThe Tokenomics of BTCX Token are intricately woven into the fabric of its design, ensuring long-term viability and a deep commitment to growth. With a total supply of 21,000,000 BTCX Token, the structure includes 5,250,000 BTCX Token for presale, 8,610,000 BTCX Token for burning, 5,040,000 BTCX Token as a reward for staking, and 2,100,000 BTCX Token for liquidity. The presale of BTCX Token Token allowed investors to buy at attractive prices, reflecting the community's confidence in this groundbreaking project. By staying attuned to market needs and trends, BTCX Token demonstrates adaptability, a vital factor in the rapidly evolving crypto landscape.\n\nThe platform's ideology is firmly rooted in inspiration and innovation, and it's poised to pave the way for the next Bitcoin era, offering solutions, opportunities, and a vision for the future. By focusing on adaptability, security, and performance, BTCX Token connects diverse liquidity hubs without fragmentation, ensuring relevance and resilience. The revolution has begun, and BTCX Token is leading the charge.\n\nAfter months of development and testing, BTCX Token is ready to embark on a new chapter in crypto history, signifying a leap in thinking and evolution in the cryptocurrency space. As the project's public mainnet is set to open, the world watches with anticipation, recognizing BTCX Token as more than just a new Token; it's the beginning of a new era.\n\nFor more information about BTCX Token, please visit: BTCX.IO\n\nAbout BTCX Token\n\nBTCX Token is more than just a cryptocurrency; it signifies a leap in thinking and an evolution inspired by innovative leadership. By addressing industry needs and introducing innovations in staking, combustion, and presale strategies, BTCX Token is poised to pave the way for the next Bitcoin era.\n\nWebsite | Twitter | Telegram\n\nContact Details\n\nBitcoin Xin\n\nMason Callahan\n\npr@btcx.io\n\nView source version on newsdirect.com: https://newsdirect.com/news/ethereum-based-btcx-token-raises-1-5m-to-build-the-worlds-first-bitcoin-xin-blockchain-405848223"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1vcHRpbWlzbS1hcm91bmQtZnV0dXJlcy1ldGYtYXBwcm92YWwtZnVlbHMtcmVjb3Zlcnkv0gFXaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLW9wdGltaXNtLWFyb3VuZC1mdXR1cmVzLWV0Zi1hcHByb3ZhbC1mdWVscy1yZWNvdmVyeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Ethereum: Optimism around futures ETF approval fuels recovery - AMBCrypto News",
        "content": "The SEC may approve the several Ethereum ETF applications it has received.\n\nETH’s price jumped as the news broke.\n\nAccording to a Bloomberg report, Ethereum [ETH] futures Exchange-Traded Fund (ETF) may be approved by the U.S. SEC sooner than expected. The report, which came out on 17 August, noted that the regulatory is unlikely to block the product that has seen a lot of applications by numerous firms.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nRecall that BlackRock’s Bitcoin [BTC] futures ETF has already paved. So, the Ethereum community has also been eagerly awaiting a similar development. At the time of writing, firms including BitWise, Volatility Shares, Roundhill, and Grayscale had already filed applications for the ETF.\n\nInterestingly, the development broke when the entire crypto market was undergoing a massive correction. During that time, ETH’s price had fallen to $1,600. But as soon as the public got wind of the report, a renewed sense of optimism entered the market. This, in turn, acted as a catalyst for the cryptocurrency’s recovery.\n\nThis propelled ETH to gain as much as 10% within a short period. Although the report has not been confirmed by the SEC, many believe that if approved, it could bring some stability to the crypto market.\n\nHowever, the Ethereum community may need to be careful about being overly excited about the development. This is because the SEC has been slow to authorize derivative products, as the regulator continues to express skepticism over the potential manipulation of cryptocurrencies like ETH.\n\nBut what else is happening with Ethereum?\n\nAccording to Santiment, Ethereum’s network growth had decreased to 26,600. Network growth measures the number of new addresses joining a network. When the metric increases, it means that there is a good level of traction on the network.\n\nBut a decrease in the network growth suggests that new addresses joining the network have refrained from making transactions.\n\nIf approved, there could be a positive change in network growth. This is because more investors might trust ETH, and institutional liquidity would come into the ecosystem.\n\nFurthermore, the Market Value to Realized Value (MVRV) ratio showed that ETH could be undervalued at its current price. The MVRV ratio represents the ratio between the current price of an asset and the realized prices.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nWhen it rises into the positive region, it means that market participants have made a lot of unrealized gains. But when the metric falls into the red area, it suggests that the average holder is coping with losses.\n\nAt press time, the 30-day MVRV ratio was -8.01%. This indicates losses for ETH holders. At the same time, it offers a buying opportunity for those looking to hold for a long period."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iYWJ5c2hpYmEtbmV4dC1tZW1lY29pbi1zZW5zYXRpb24tbGF1bmNoaW5nLTIzMDAwMDY2NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "BabyShiba, the next memecoin sensation is launching on Ethereum - Yahoo Finance",
        "content": "BabyShiba\n\nBabyShiba Coin Rockets in Tribute to Shiba Inu: Outperforms Competitors Post Launch.\n\nSAITAMA, JAPAN, Aug. 19, 2023 (GLOBE NEWSWIRE) -- Babyshiba, an ERC-20 memecoin, was launched on the 16th of August, seeing an incredible price growth of 13,000% in just 24 hours as a tribute to the well-known Shiba Inu coin. Its goal is to outdo the famous Babydoge, and it gained immediate traction.\n\nA little bit of background for context: The Shiba Inu coin was released two years ago as a memecoin centered around decentralization, by an anonymous founder called Ryoshi. Recently, it evolved beyond a simple meme and launched its own Layer-2 blockchain, Shibarium. Interestingly, the Shibarium blockchain went live the same day as the Babyshiba launch, sparking speculation about the individuals behind this new project. Additionally, BabyShiba was also launched in August, coinciding with the same month as the Shiba Inu launch.\n\nWith the crypto world's attention on Shiba Inu due to the Shibarium blockchain, Babyshiba emerged at the perfect time. This impeccable timing suggests the launch was a well-calculated plan by its creators. Babyshiba not only pays tribute to Ryoshi's vision embodied in Shiba Inu but also aims to surpass Babydoge, a derivative of the renowned Doge Coin.\n\nThe project quickly gained substantial momentum and attracted a community aptly named the BabyShibArmy. Some are suggesting a repeat of the Babydoge magic, as the project's Telegram group experiences ongoing growth and the community remains highly active on Twitter (X). As the community plays a vital role in any memecoin and was initially the driving force behind Shiba Inu, BabyShiba likely has a promising future.\n\nOn the technical side, BabyShiba is tradable on Uniswap, an Ethereum DEX, and imposes a 1% tax allocated for marketing. Daily updates on marketing initiatives are visible in their Telegram group, with full transparency maintained on expenditure. Already, over 20 significant crypto influencers have talked about their project, and this figure is steadily rising. The project's website is meticulously designed, and they have published a whitepaper elaborating on their vision.\n\nStory continues\n\nGiven its potential to become the top memecoin of summer 2023 and perhaps one of the most successful ever (alongside its rival Babydoge), the BabyShiba project deserves close attention. We encourage you to monitor its progress over the coming weeks and judge its potential for yourself.\n\nSocials:\n\nWebsite: https://babyshib.vip\n\n\n\nTelegram: t.me/babyshiberc\n\n\n\nX (Twitter): https://twitter.com/babyshiberc\n\n\n\nWhitepaper: https://babyshiba-1.gitbook.io/babyshiba-shibpaper/\n\n\n\nEmail: contact@babyshib.vip\n\n\n\n\n\nCONTACT: Adams joshua Babyshiba contact@babyshib.vip\n\n\n\n"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2JpdGNvaW4tdnMtZXRoZXJldW0tbWFya2V0LWNhcC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Vs Ethereum: Is ETH Ever Going to Flip BTC in Market Cap? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The crypto world has been buzzing with the notion of “flipping,” referring to the hypothetical event in which Ethereum (ETH) overtakes Bitcoin (BTC) in terms of market capitalization. Such a scenario would symbolize a significant shift in the crypto landscape. Here, we analyze if and how this might be possible, based on the provided current market cap figures. Let’s take a look at this Bitcoin vs Ethereum article in more detail.\n\nBitcoin Vs Ethereum: Current Market Landscape\n\nETH Market Cap – TradingView\n\nBitcoin Market Cap – TradingView\n\nBitcoin Vs Ethereum: Understanding Market Capitalization and the ‘Flippening’\n\nWhat is Market Capitalization?\n\nAt its core, market capitalization (often shortened to market cap) represents the total value of an asset in the market. In the world of cryptocurrencies, it’s calculated by multiplying the current price of a single unit of a cryptocurrency by the total number of units in circulation.\n\nLet’s break it down with a simple analogy. Imagine you have a box of apples, and each apple is priced at $2. If you have 100 apples in that box, the total value (or ‘market cap’) of all the apples would be $200. Similarly, if each Ethereum (ETH) coin is priced at $1,670.99 and there are about 120 million ETH coins in circulation, the total value of all ETH coins would be its market cap, which is currently $200,734,697,617.\n\nThe Concept of ‘Flipping’ in Market Cap\n\nNow, if you had another box of oranges, and the total value of all oranges was $300, this box would have a higher market cap than the box of apples. The act of one asset (like our box of oranges) surpassing another asset (like our box of apples) in market cap is colloquially referred to as ‘flipping’.\n\nIn the crypto world, the term “flippening” specifically refers to the potential scenario where Ethereum’s market cap surpasses that of Bitcoin. So, if the total value of all ETH in circulation becomes higher than the total value of all BTC in circulation, then Ethereum has “flipped” Bitcoin in terms of market cap.\n\nWhy Does This Matter?\n\nThe idea of Ethereum flipping Bitcoin is a significant talking point because Bitcoin has historically been the dominant cryptocurrency in terms of market cap since its inception. A flippening would symbolize a shift in market perception, indicating that the market values Ethereum more than Bitcoin. This could be due to various factors, including technological advancements, user adoption, or broader trends in the decentralized finance space.\n\nSo, when people discuss the possibility of Ethereum “flipping” Bitcoin, they’re speculating on a major shift in the crypto landscape, where Ethereum becomes the most valuable cryptocurrency by total market value.\n\nBitcoin Vs Ethereum: What Does It Mean for ETH to “Flip” BTC?\n\nFor Ethereum to surpass Bitcoin in market capitalization, its market cap needs to be greater than that of Bitcoin. This can happen if:\n\nEthereum’s price rises while Bitcoin’s price remains stable or decreases.\n\nBitcoin’s price drops significantly, even if Ethereum’s price remains stable.\n\nThe Mathematical Calculation\n\nTo determine how much Ethereum’s price must rise for it to overtake Bitcoin’s market cap, we can start with the formula for market capitalization:\n\nMarket Cap=Price×Total Supply\n\nAssuming the total supply of both ETH and BTC remains constant (ignoring ongoing mining or issuance), the price change needed can be calculated.\n\nGiven:\n\nETH Market Cap = $200,734,697,617\n\nBTC Market Cap = $512,982,754,980\n\nTo equate ETH’s market cap to BTC’s at the current supply:\n\nNew ETH Price=BTC Market Cap/ETH’s Current Supply\n\n\\text{ETH’s Current Supply} = \\frac{\\text{ETH Market Cap}}{\\text{Current ETH Price}} = \\frac{$200,734,697,617}{$1,670.99}\n\nSolving for ETH’s current supply gives approximately 120,128,341 ETH.\n\nUsing this supply figure to solve for the new ETH price:\n\n\\text{New ETH Price} = \\frac{$512,982,754,980}{120,128,341}\n\nThis yields a New ETH Price of approximately $4,272.22.\n\nThus, for ETH to flip BTC at their current respective supplies, the price of ETH would need to rise to approximately $4,272.22, more than double its current price, assuming the price of BTC remains stable.\n\nBitcoin Vs Ethereum: Factors to Consider\n\nEthereum’s Ongoing Development\n\nEthereum 2.0 and the transition to a proof-of-stake consensus mechanism could have profound implications on ETH’s price and market cap. Enhancements in scalability and energy efficiency might attract more users and developers to the Ethereum network.\n\nBitcoin’s Store of Value Narrative\n\nBitcoin’s primary narrative as “digital gold” and a store of value might maintain or increase its market cap, even if Ethereum experiences growth.\n\nDeFi and NFTs\n\nDecentralized finance (DeFi) and non-fungible tokens (NFTs) have propelled Ethereum into the spotlight. If these sectors continue to grow and evolve, they could significantly increase Ethereum’s market cap.\n\nConclusion\n\nWhile the potential for Ethereum to flip Bitcoin in market cap exists, several factors, including market dynamics, technological developments, and macroeconomic events, will determine if this occurs. As of now, based on pure arithmetic, ETH would need to see a significant price surge to surpass BTC’s market cap. Only time will tell if the “flippening” becomes a reality.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0td2hhbGUtYXZvaWRzLW1hcmtldC1jcmFzaC_SAU1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL2V0aGVyZXVtLXdoYWxlLWF2b2lkcy1tYXJrZXQtY3Jhc2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Whale Avoids Market Crash, Do They Know Something You Don’t? - NewsBTC",
        "content": "While the broader cryptocurrency market recently took a nosedive, some mysterious Ethereum whale successfully escaped with $41 million worth of ETH. Days later, the price of ETH went down, along with BTC and other cryptocurrencies. Did this whale know something the rest of the market didn’t?\n\nEthereum Whale Sells $41 Million Before Market Crash\n\nIn the early hours of August 18, the crypto market saw investors reacting to SpaceX selling its $373 million Bitcoin holdings, pushing down Bitcoin by more than 8% in a matter of minutes. During this period, the crypto market cap dropped to $1.1 trillion, and Ethereum also saw its value plummet by almost 6%.\n\nOn-chain data provided by Lookonchain reveals that a smart Ethereum whale dumped 22,341 ETH worth $41 million just prior on August 14. On-chain investigation shows that the whale moved their ETH holdings to the Binance exchange and then withdrew $41 million worth of Tether USDT.\n\nWhile this whale still made a loss of $1.7 million in the sale, if they hadn’t moved their funds, they would have lost at least $5 million in the crash.\n\nThe whale was very smart and dumped 22,341 $ETH ($41M) before the market crashed. Even though he lost ~$1.7M this time, he successfully avoided the market crash. Perhaps he will buy $ETH back at a cheaper price in the future. Follow this smart whale.👇https://t.co/S4Wv8XRlhW pic.twitter.com/BcdzdpmbIA — Lookonchain (@lookonchain) August 18, 2023\n\nCoincidentally, this isn’t the first time this trader has made headline trades. This savvy Ethereum whale has shown signs of being able to predict market movements before and has had a 100% winning rate in recent months.\n\nThe whale profited from the SEC and Spot Bitcoin ETFs saga. When ETH plummeted in reaction to news of the SEC rejecting spot Bitcoin applications from BlackRock and other investment companies, this whale saw this as an opportunity to buy the dip on June 30.\n\nThey bought 8,188 ETH worth $15.23 million at $1,860 per ETH, and ETH would later rise to $1948.60 in the hours after.\n\nA smart whale deposited 25K $ETH ($47.24M) to #Binance and withdrew 15.9M $USDT 12 hrs ago. The whale is very good at buying $ETH at low prices and selling at high prices to make a profit. He has a 100% win rate of trading $ETH in the past 2 months.https://t.co/dT9p6jeCtr pic.twitter.com/pTuJAwL81O — Lookonchain (@lookonchain) June 28, 2023\n\nDo Whales Sometimes Have Insider Knowledge?\n\nWhile we can’t know for sure if whales have access to insider information, their actions are worth paying attention to. It could be that this whale knew something was going to trigger a price crash or was just making the right trading decision at the right time.\n\nNevertheless, whale moves could signal future price action due to the sheer size of their holdings. So by closely following the on-chain activity of major holders, investors might gain useful insights.\n\nThe market is still yet to bounce back from the recent dip. At the time of writing, ETH is down by 1.80% in the past 24 hours and down by 10.19% in a 7-day timeframe. Bitcoin and XRP are also down by 11.87% and 19.87%, respectively in a 7-day timeframe.\n\nETH price jumps to $1,681 | Source: ETHUSD on Tradingview.com\n\nFeatured image from iStock, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vc2Vjcy1ldGhlcmV1bS1mdXR1cmVzLWV0Zi1hcHByb3ZhbC1hLXJlc291bmRpbmctdmljdG9yeS1mb3ItZXRocy1zZWN1cml0eS1zdGF0dXMv0gF7aHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9zZWNzLWV0aGVyZXVtLWZ1dHVyZXMtZXRmLWFwcHJvdmFsLWEtcmVzb3VuZGluZy12aWN0b3J5LWZvci1ldGhzLXNlY3VyaXR5LXN0YXR1cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "SEC’s Ethereum Futures ETF Approval: A Resounding Victory For ETH’s Security Status? - NewsBTC",
        "content": "According to Bloomberg, in a key development for the cryptocurrency industry, the US Securities and Exchange Commission (SEC) is reportedly set to allow the launch of exchange-traded funds (ETFs) based on Ethereum (ETH) futures.\n\nThis move marks a significant win for numerous firms that have long sought to introduce such products. While the SEC has previously hesitated to approve ETFs directly tied to cryptocurrencies, the decision to greenlight an Ethereum futures ETF could have profound implications for Ethereum’s classification as a non-security.\n\nThis development also holds potential ramifications for other cryptocurrencies, as the SEC’s stance on where the line between security and non-security lies becomes a subject of litigation.\n\nEthereum Paradigm Shift\n\nAccording to Bloomberg’s report, sources familiar with the matter claim the SEC is unlikely to block the ETFs based on futures contracts for Ethereum, which is currently the second-largest cryptocurrency by market capitalization.\n\nNearly a dozen companies, including prominent names like Volatility Shares, Bitwise, Roundhill, and ProShares, have filed applications to launch these ETFs. While it remains unclear which funds will receive approval, insiders suggest that several may be granted the green light as early as October.\n\nThis anticipated approval of an Ethereum futures ETF by the SEC could have far-reaching implications for the regulatory treatment of cryptocurrencies.\n\nThe SEC’s reluctance to approve ETFs directly tied to cryptocurrencies has spurred speculation that derivative-based products would offer a potential pathway to market access.\n\nOn this matter, crypto analyst Adam Cochran has highlighted that the SEC potentially approving an ETF based on Ethereum futures contracts implicitly acknowledges that Ethereum itself is not considered a security.\n\nThis decision challenges the notion that Ethereum should be regulated as a traditional financial security, considering its proof-of-stake mechanism, purpose, and usage.\n\nCochran further believes that the SEC’s approval of an Ethereum futures ETF bolsters Ethereum’s non-security status and sets a precedent that could impact other cryptocurrencies facing regulatory scrutiny.\n\nThe ongoing legal battle between the SEC and Grayscale Investments over rejecting their Bitcoin trust’s conversion into an ETF highlights the agency’s concerns regarding investor protection, manipulation risks, and price volatility.\n\nHowever, this approval could provide a compelling argument in favor of distinguishing between the underlying asset and how it is sold, bolstering the Torres Doctrine and potentially influencing the outcome of similar cases, such as the XRP appeal.\n\nThe SEC’s approval of an Ethereum futures ETF holds tremendous significance for the cryptocurrency industry. If confirmed, it would mark a pivotal moment for Ethereum’s classification as a non-security, further solidifying its position as a commodity or currency.\n\nThe decision also highlights the regulatory challenge of defining clear boundaries between securities and non-securities in crypto.\n\nAs the industry evolves, approving an Ethereum futures ETF could shape the regulatory landscape, paving the way for increased adoption and investment opportunities in the cryptocurrency market.\n\nHowever, the news is not entirely favorable for ETH as it trades at $1,660, following a downward trend similar to Bitcoin and the overall cryptocurrency market. The market has experienced a substantial outflow of liquidity, leading to a significant decline in most digital currencies.\n\nOver the past 24 hours, ETH has declined more than 4% after breaking its previously established range between $1,895 and $1,830. Additionally, it has suffered a notable loss of 10% within the seven-day timeframe.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ldGhlcmV1bS1ibGVlZC1hZnRlci1zdWRkZW4tbGlxdWlkYXRpb24tYWx0Y29pbnMtdHVtYmxlLXVwLXRvLTE4LTM5NDU5MS0yMDIzLTA4LTE40gGhAWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuaW4vYW1wL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ldGhlcmV1bS1ibGVlZC1hZnRlci1zdWRkZW4tbGlxdWlkYXRpb24tYWx0Y29pbnMtdHVtYmxlLXVwLXRvLTE4LTM5NDU5MS0yMDIzLTA4LTE4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum bleed after sudden liquidation; Altcoins tumble up to 18% - Business Today",
        "content": "Bitcoin and other top crypto tokens were trading in deep red on Friday. A sudden liquidation over the last few hours led to suffering of $1 billion as digital-asset markets suffered one of their worst sell-offs of the year and bitcoin's price fell to a two-month low. Trading volumes of the crypto market spiked suddenly.\n\n\n\nBitcoin was under deep selling pressure as the largest crypto tokens dropped as much as 8 per cent to slip below $26,500-levels. Its largest peer, Ethereum plunged 7 per cent to barely hold $1,675-mark. Pain in the altcoins was intense as the host of tokens were bleeding up to 18 per cent.\n\n\n\nThe crypto market has continued to sharply fall for the second consecutive day. The mass sell-off in the crypto market has led to a plunge in the crypto fear and greed index, which is down 13 points and has entered the fear zone after over 5 months, with a score of 37/100, said Parth Chaturvedi, Investments Lead at CoinSwitch Ventures.\n\n\n\n\"A US judge granted approval to the SEC to file a motion to appeal the recent ruling which favored Ripple Labs regarding retail sales of XRP,\" he added. \"In other news, there has been a potential devaluation of the Chinese Yuan, which is trading at the weakest level since 2007.\"\n\n\n\nAll other top crypto tokens were bled on Friday. XRP plunged as much as 17 per cent, while Litecoin tumbled 14 per cent. Shiba Inu and Dogecoin also posted double-digit cuts to tank up to 12 per cent. Toncoin and Polygon shed 9 per cent each, while Solana was down 8 per cent.\n\n\n\nThe global cryptocurrency market cap was trading sharply lower, falling down to $1.06 trillion-mark as it dropped as much as 7 per cent in the last 24 hours. However, the total trading volumes surged almost 77 per cent to $65.1 billion.\n\n\n\nImage: Crypto-chart-price\n\n\n\nTech View by Giottus Crypto Platform\n\nBitcoin’s price experienced a sharp decline today following wider negative sentiments in the market post Evergrande bankruptcy filing and reports of SpaceX selling off their BTC portfolio.The asset plunged to two-month lows near $25,200, as traders reacted to unfavourable macro conditions. It has quickly regained some value and is currently trading at $26,500.\n\n\n\nImage: Chart-BTC\n\n\n\nThe price action has experienced a valid bearish entry asBTC broke below the key 200-day EMA range yesterday. If there is any upside momentum, additional gains could potentially drive the price towards the resistance levels of $27,000 and $27,750. BTC’s RSI is currently below21 and has been on a downward slope in the past week, which also indicates that the asset has officially entered bearish territory.\n\n\n\nMajor Levels:\n\nSupport: $26,500, $26,125\n\nResistance: $27,200, $27,750, $28,200\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: JSW Steel tops Nifty pack in terms of earnings upgrade. Should you buy this stock?\n\nAlso read: 140% return in 2023! Zensar Tech stock rally defies broader IT sector weakness"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlci1mdXR1cmVzLWV0ZnMtY291bGQtZ2V0LWFwcHJvdmFsLXNhbWUtdGltZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Ether Futures ETFs could all get approval at same time: Report - Cointelegraph",
        "content": "The United States Securities and Exchange Commission (SEC) is likely to approve multiple applications for Ether futures exchange-traded funds (ETFs) at the same time, The Wall Street Journal reported, citing sources familiar with the matter.\n\nSince July, the regulator has been flooded with applications from several investment firms, including requests combining futures Bitcoin (BTC) and Ether (ETH) strategies. So far, the SEC has not instructed the firms to withdraw their applications, unlike in 2021, when firms were instructed to withdraw similar applications. This suggests that the regulator won’t block the fund’s launch within a few weeks, according to WSJ sources.\n\nAt least 16 applications for Ether or Bitcoin-Ether futures ETFs are awaiting regulatory approval. Ether is the native coin of the Ethereum blockchain, used for peer-to-peer transactions within the decentralized network. A crypto futures ETF tracks the performance of crypto futures contracts. For example, instead of investing directly in Bitcoin or Ethereum, a crypto futures ETF invests in futures contracts that are tied to the price of these digital assets.\n\nUPDATE: Here's what the #Ethereum futures ETF filings race looks like. This is a list of all filings including withdrawn AND the 16 active filings. Notice @ValkyrieFunds' date on $BTF currently looks to be the leader absent some action from SEC -- 10/3/23 https://t.co/DgZpDVbEqO pic.twitter.com/CYEcTJnkx8 — James Seyffart (@JSeyff) August 16, 2023\n\nWith the prospect of crypto futures approval looming, the SEC keeps receiving requests. Earlier this week, asset management firm Valkyrie filed for an Ether futures ETF and a previous application combining a Bitcoin-Ether futures strategy. Valkyrie is the first in line in this race and could see its BTC-ETH ETF debuting in early October.\n\nIn the ETF industry, first-mover advantage is important. According to the WSJ, citing data from Morningstar, the first futures Bitcoin ETF approved from ProShares has gathered $1 billion in assets under management since its inception in October 2021, while Valkyrie’s similar product, launched a few days later, amassed nearly $28 million in assets under management.\n\nIn another major decision affecting the crypto industry, the SEC has yet to decide whether to approve a spot Bitcoin ETF in the United States. Players waiting for approval include Wall Street giants Fidelity and BlackRock. According to the application’s timeline, the SEC has until January to deliver a final verdict.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtbWFya2V0cy1hY2hlLWZvci1jYXRhbHlzdC1hcy1zZWMtZGVsYXlzLWdyYXlzY2FsZS1kZWNpc2lvbi0yMDIzMDgxODIxMjfSAakBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLXJpcHBsZS1tYXJrZXRzLWFjaGUtZm9yLWNhdGFseXN0LWFzLXNlYy1kZWxheXMtZ3JheXNjYWxlLWRlY2lzaW9uLTIwMjMwODE4MjEyNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bad timing for BTC slump as markets weekend tranquil sets in - FXStreet",
        "content": "Share:\n\nBitcoin price wants back above the crucial support above $26,300, but waning momentum characteristic of the weekend won't let it.\n\nEthereum price can do nothing but follow BTC cues, with the $1,714 presenting as a hard nut to crack\n\nRipple price passes time around $0.5048; a drop to $0.4181 may be imminent amid gloomy macroeconomics in the XRP camp.\n\nBitcoin (BTC) price is down, but not out, only that the recent slump happened to close to the weekend, denying the market a chance for a rebuttal. As retail transitions to the weekend mode, the volume of trade is expected to reduce, with chances of few isolated large orders as whales step in. If they don't, BTC could step into the next week within the current low range. With it, Ethereum (ETH) price could follow suit, and for Ripple (XRP), unless something significant happens in the case against the US SEC, the remittance token may continue to mark time pending Monday August 21 updates.\n\nAlso Read: Bitcoin Weekly Forecast: More BTC liquidations than during FTX fallout, what's next?\n\nBitcoin price looks for a possible tow\n\nBitcoin (BTC) price is yet to recover from the 14% slump recorded during the evening hours of the US session. Currently auctioning at $26,036, BTC is below a crucial support level, the ascending trendline, which provided support for months, as indicated in the chart below.\n\nWith the Relative Strength Index (RSI) position at 18 and the histograms of the AO flashing red in growing volume, bears remain in the driver's seat. This means that Bitcoin price may still have a long ways to go before securing an uptrend.\n\nOne possible fundamental that could have steered Bitcoin price in the right direction is a favorable decision from the US Securities and Exchange Commission (SEC) concerning Grayscale's application for its Bitcoin Trust (GBTC) to be converted into an Exchange Traded Fund (ETF). However, considering the commission has delayed for the second time, the weekend may not record any significant action unless whales step in to take advantage of the weekend tranquility.\n\nBTC/USDT 1-day chart\n\nIf sidelined investors and investors come in, Bitcoin price could find a footing to push north. While flipping the $$26,300 and $27,300 levels from resistance back to support would be a good sign, only a decisive candlestick close above the ascending trendline at $28,738 would invalidate the current gloom, with a possible foray to the $30,400 presenting next.\n\nAlso Read Bitcoin price dips to the $25,100 range with $820 million long positions liquidated across the market.\n\nEthereum price follows BTC on the heels\n\nEthereum (ETH) price reflects an almost similar outlook as BTC, indicating a long candlestick for the August 17 trading session and a short one for August 18 as the largest altcoin continues pulling north. This points to a tight correlation between BTC and ETH, with capital overflows from Bitcoin likely to drive Ethereum if the capital does come.\n\nAs in the case of BTC, the RSI is at 19, pointing to a weak price strength. The AO histogram bars do not inspire optimism either, pointing to the bears' position in the front row seats. Without a significant catalyst to drive Bitcoin price, ETH holders may remain within the $1,714 to $1,627 range for a while, possibly across the weekend.\n\nETH/USDT 1-day chart\n\nOn the other hand, should Bitcoin price start moving, ETH would easily follow suit, drawing north to breach the $1,813 resistance level. Higher, it could traverse the $1,891 and $1,941 resistance levels, respectively, before an attempt to reclaim the May 6 and mid-July highs above the $2,000 psychological level. A decisive daily candlestick close above this level invalidates the current bearish outlook. It would constitute a 20% flight from the current level.\n\nAlso Read: Ethereum Price Forecast: Indication of a 45% crash of bear trap?\n\nRipple price mark times around $0.5010\n\nRipple price has been stuck around the $0.5010 level for the better part of the day after pulling back 20% from the August 17 low of $0.4226. While the token also looks to Bitcoin for influence, a lot depends on the ongoing lawsuit between Ripple and the US SEC after the court approved the regulators' request for an interlocutory appeal.\n\nAs reported, the SEC wants the Howey Test revisited, with a potential overturning of the Ripple victory on July 13. Just as the partial victory sent XRP north by unprecedented margins, the possibility of an overturn inspires fears. With this, Ripple price could hover around the current level for a while or draw toward the $0.4191 support floor.\n\nThe RSI at 23, coupled with the bars of the AO histograms in the negative zone, bolsters the bears' case, indicating a possible slump.\n\nXRP/USDT 1-day chart\n\nConversely, a resurgence by XRP bulls could send Ripple price north, possibly foraying above the $0.5752 resistance level or higher past the $0.6840 level. In a highly bullish case, XRP could reclaim the $0.8193 resistance level, levels last seen around July.\n\nAlso Read: SEC vs Ripple, the legal battle intensifies as XRP holders expect new changes from SEC appeal"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDgvMTkvZXRoZXJldW1zLWhvbGVza3ktdGVzdG5ldC10by1sYXVuY2gtaW4tc2VwdGVtYmVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Ethereum’s Holesky Testnet To Launch in September - Crypto Times",
        "content": "On August 17, Ethereum Foundation held a pivotal meeting to discuss developments around a new testnet, Holesky, that is launching on 15th September. The launch of the new testnet offers to initiate a new stage of experimentation and progress within the Ethereum ecosystem.\n\nThe testnet has a unique name, not “Hole-sky,” but it comes from a train station in Prague, Czech Republic. People casually call this station “Holešky.” Ackee Blockchain Security found something interesting in the testnet’s code: the code number, 17000, is the same as the area’s postal code.\n\nParithosh Jayanthi, the DevOps expert at the Ethereum Foundation, said that the development team had conducted all tests involving an astounding 1.4 million validators on the Holesky testnet.\n\nThis hard work helped make the network stable and reliable. Jayanthi said that this big achievement would be the starting point for the Holesky testnet’s size. This shows that Ethereum is serious about making its technology handle lots of things and work better.\n\nAt the center of the discussions was the task of determining how many testnet tokens should be integrated into the Holesky testnet. Ultimately they decided against introducing a 1.6 billion Holesky into circulation. Developers opted not to decrease the supply of 120 million ETH on the Ethereum mainnet.\n\nThe testnet is scheduled to remain operational for an extended duration, offering Long-Term Service (LTS) support until 2027, followed by an End-of-Life (EOL) phase that stretches until 2028.\n\nThe Holseky would probably replace Ethereum’s Goerli testnet, introduced in 2019, transitioning from proof-of-work to proof-of-stake. Both Goerli and Holesky, in addition to the established Ethereum mainnet, operate as proof-of-stake networks. However, it’s crucial to understand that, unlike the Ethereum mainnet, these two testnets don’t use ETH tokens that hold real-world market value."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9ldGhlci1mdXR1cmVzLWV0ZnMtcmVjZWl2ZS1zZWMtYXBwcm92YWwtaW4tbWFqb3ItY3J5cHRvLW1pbGVzdG9uZdIBVWh0dHBzOi8vdS50b2RheS9ldGhlci1mdXR1cmVzLWV0ZnMtcmVjZWl2ZS1zZWMtYXBwcm92YWwtaW4tbWFqb3ItY3J5cHRvLW1pbGVzdG9uZT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Ether-Futures ETFs Receive SEC Approval in Major Crypto Milestone - U.Today",
        "content": "The US Securities and Exchange Commission (SEC) is on course to greenlight the first-ever exchange-traded funds (ETFs) based on Ether (ETH) futures.\n\nAdvertisement\n\nThis decision marks a substantial victory for several financial firms that have been advocating for the introduction of these products for some time.\n\nThe regulator is unlikely to obstruct the launch of these ETFs, which will be grounded in futures contracts of Ether, the world's second-largest cryptocurrency, Bloomberg reports.\n\nProminent companies such as Volatility Shares, Bitwise, and others are among the nearly a dozen entities that have submitted applications to initiate these ETFs.\n\nNotably, Valkyrie is anticipated to be the first to introduce an ETF featuring Ether futures around Oct. 3 or Oct. 4, although it will encompass both Bitcoin and Ethereum. Meanwhile, Vol Shares is projected to debut the first exclusive Ether Futures ETF approximately on Oct. 12.\n\nThe approval of an Ethereum futures ETF by the SEC carries broader implications for the crypto sector. As pointed out by crypto analyst Adam Cochran, this move inherently suggests that the SEC does not classify Ethereum as a security.\n\nHe emphasized that this decision is a monumental win for Ethereum, regardless of its initial sale method, its proof-of-stake mechanism, or its primary function and application.\n\nCrypto futures ETFs allow investors to speculate on the future price of cryptocurrencies through contracts, without owning the actual coins. In contrast, spot ETFs provide investors with direct exposure to the current market price of the cryptocurrency by holding the actual digital assets.\n\nThe SEC approved several Bitcoin futures ETFs in October 2021, further fueling the bull run. However, the regulator is yet to greenlight a spot ETF."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tdGltZS1pcy1ydW5uaW5nLW91dC1mb3ItZXRoLW1heGlzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction – Time Is Running Out For ETH Maxis - Analytics Insight",
        "content": "Ethereum (ETH) price is retesting a key demand zone after failure to break above the $1,900 resistance level. The smart contract cryptocurrency is changing hands at $1,787 on Thursday as the altcoin sell-off intensifies. The latest technical analysis suggests time is running out for the ETH maxis as the price hangs by a thread.\n\nOn Thursday, ETH to USD price plummeted to $1,775 before showing a brief recovery. This was the lowest level for the native asset of the top L1 platform since 21st June. On a weekly timeframe, the leading cryptocurrency is down 2.85% this week, which depicts the intensity of the downtrend.\n\nETH/BTC Pair Remains Sideways\n\nThe ETH/BTC pair shows Ethereum’s strength against Bitcoin. The following chart shows that the crypto pair has been trading sideways since June 2023 in a narrow trading range. The bottom of this trading range lies at 0.0605, and the top lies at 0.0645. Currently, the pair is retesting the mid of the trading range, which might act as a support level.\n\nIn case of a breakdown below the 0.0624 level, the next stop would be the range lows of $0.0605. For Ethereum price prediction to turn bullish, ETH must break above the range highs of 0.0645 soon. A failure to break above this level could send the leading L1 asset to its fresh yearly lows in the coming months.\n\nDonald Trump Holds $2.8M In Ethereum Wallet\n\nAccording to the latest Ethereum news, the former president of the United States, Donald Trump, has been revealed to be holding $2.8M worth of ETH. The digital assets held inside his Ethereum wallet are much more than the previously disclosed figure of $250,000 to $500,000.\n\nMost of the cryptocurrency in the wallet has been received through licensing fees from the Trump NFTs collection. The former president launched his NFT collection, Trump Digital Trading Cards, in December 2022. Till now, 14,303 ETH worth of these NFTs have been exchanged on the NFT marketplace Opensea.\n\nEthereum Price Prediction\n\nA look at the following chart reveals that the Ethereum price is currently hovering within a significant demand zone. Price has retested this demand zone multiple times, resulting in solid rebounds. However, the support level is likely to break soon if the selling pressure keeps increasing in the coming days.\n\nA breakdown below the $1,780 level will be very bearish for ETH price. Therefore, the bulls need to hold this level. On a higher timeframe, the biggest resistance remains the $2,100 level, which has resulted in multiple rejections this year. Close attention must also be given to the BTC price action, which precedes the altcoin price action.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9yZWd1bGF0b3J5LXdhdmVzLWltcGFjdC1idGMtYW5kLWV0aC1saXF1aWRpdHktaW4tdGhlLXUtcy1hc3Nlc3Npbmcv0gFdaHR0cHM6Ly9hbWJjcnlwdG8uY29tL3JlZ3VsYXRvcnktd2F2ZXMtaW1wYWN0LWJ0Yy1hbmQtZXRoLWxpcXVpZGl0eS1pbi10aGUtdS1zLWFzc2Vzc2luZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "Regulatory waves impact BTC and ETH liquidity in the U.S. Assessing… - AMBCrypto News",
        "content": "Bitcoin and Ethereum’s liquidity has continued to drop on US crypto exchanges.\n\nRegulatory uncertainty has persisted, which might lead to more drops.\n\nNavigating the regulatory environment in the U.S. has proved challenging for most cryptocurrency projects. And the consequences are becoming apparent. The Securities and Exchange Commission (SEC) published lists of cryptocurrencies classified as securities months ago.\n\nNonetheless, assets like Bitcoin [BTC] and Ethereum [ETH], which were not categorized as securities, appear to be experiencing the effects of these regulatory developments.\n\nBitcoin Ethereum liquidy declines\n\nAccording to a recent report from Kaiko, Bitcoin and Ethereum liquidity in the U.S. witnessed a decline. The data revealed that the portion of liquidity for these assets on U.S.-based exchanges decreased to approximately 43%.\n\nThis was down from the 49% recorded at the start of 2023. Conversely, the liquidity depth on exchanges outside the US had risen to 57% from the initial 51%.\n\nPotential causes of the Bitcoin Ethereum liquidity decline\n\nThe ongoing legal action initiated by the CFTC and SEC against Binance and Coinbase could contribute to the liquidity decline. Back in March, lawsuits were filed alleging that Binance had operated a derivatives trading platform in the US, facilitating trades for cryptocurrencies classified as commodities.\n\nFurthermore, in conjunction with the CFTC’s lawsuit, the SEC sued Binance and Coinbase. This was on the grounds of offering unregistered securities to the general public, among other accusations.\n\nFurthermore, these legal actions referenced multiple tokens. The accusations also U.S.-based exchanges should refrain from trading these tokens. Considering that Binance and Coinbase are the largest exchanges in the U.S. and globally, halting the trading of these listed tokens can significantly impact liquidity, even for flagship cryptocurrencies like BTC and ETH.\n\nMoreover, the U.S. faced the collapse of Silvergate and Signature banks earlier in the same year. These banks had been crypto-friendly and instrumental in facilitating liquidity flows into exchanges. Their demise created increased difficulty for institutional players to acquire Bitcoin, Ethereum, and other cryptocurrencies using fiat currencies. Following their collapse, most crypto exchanges temporarily suspended USD deposits.\n\nDecline likely to persist\n\nWhile the 6% reduction in Bitcoin and Ethereum liquidity on US exchanges might seem modest, there exists a likelihood of this trend intensifying. This potential increase could be attributed to the growing uncertainty surrounding the regulatory landscape within the country."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG8tZ2lhbnRzLWNsYXNoLWNhbi1hbmFyY2h5LWFuYS1vdXRzaGluZS1zaGliYS1pbnUtc2hpYi1hbmQtZXRoZXJldW0tZXRoLXdpdGgtcm9pLXBvdGVudGlhbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Crypto Giants Clash: Can Anarchy (ANA) Outshine Shiba Inu (SHIB) and Ethereum (ETH) With ROI Potential? - Analytics Insight",
        "content": "With the ‘Summer of Shibarium’ coming up soon, there has been noticeable whale activity on Shiba Inu’s network and within the meme coin market. The SHIB price has been bullish for some weeks, and even experts believe its recent price pullback means a bigger rally is coming.\n\nEthereum (ETH) has also re-entered the news scene, with the Bitcoin (BTC) price having a hard time breaking through its $30,000 resistance. But never mind all that, as Anarchy’s ROI potential could answer every crypto trader’s prayers. But only if you act fast.\n\nEarly investors in the Anarchy (ANA) world can gain 100x profits from their presale investments, and there’s no telling what potential the ANA token price will have after it launches. We could be in for another Pepe coin (PEPE)!\n\nHere’s what we have on the budding meme project.\n\n>>> BUY $ANA NOW <<<\n\nShiba Inu (SHIB) Price Shows Promise For the Summer, While Ethereum (ETH) Remains Undecided\n\nThe Ethereum (ETH) network is about to get a lot busier, as meme coins Shiba Inu (SHIB) and Anarchy (ANA) are looking to deliver shockers this summer. Shiba Inu is finally looking to make a big break since its launch in 2021, and the community is delighted to launch its layer-2 solution, Shibarium, in August.\n\nThe SHIB price has enjoyed some price rallying lately, as the whales have moved trillions worth of tokens in the past month. However, the Shiba Inu (SHIB) price dipped by about 11% in the past two days, according to Coin Gape, although analysts have stated that it could be a pullback indicating a bullish run.\n\nOn the other hand, the Ethereum (ETH) price is dipping following Bitcoin’s decline. The decline has affected most altcoins, and Ethereum (ETH) may not be crossing the $2,000 mark very soon. The ETH price could be headed for as low as $1,600, as it has been testing new supports lately, according to FXStreet reports.\n\nEven PayPal’s announcement to host their stablecoin, PYUSD, on the Ethereum (ETH) blockchain is not rescuing the ETH price from its drop. With Ethereum (ETH) out of the competition, Anarchy (ANA) has only Shiba Inu (SHIB) to compete with for profits in the cryptocurrency market. Shiba Inu’s price rally can’t be estimated yet, but experts are convinced Anarchy (ANA) can deliver 100x gains for its investors this year.\n\nThe race is on, but Anarchy (ANA) seems to be some steps ahead. Let’s have more from the budding meme coin.\n\nSomething huge is coming.\n\nIf you see this 👀\n\nThen your early! pic.twitter.com/HssZ4ywwrJ — ANARCHY (@anarchycoineth) June 10, 2023\n\nAnarchy’s ROI Showdown Has Begun, But The Token Has More To Offer\n\nAnarchy (ANA) has been the most exciting thing in the cryptocurrency market since the Pepe coin (PEPE) launch in April. The meme coin is not making PEPE’s mistakes, though. The developers have created a protocol that will serve as the standard for incoming meme coins, and this is only the start.\n\nAnarchy (ANA) seeks to dominate the meme coin sector by offering utility for its users while it encourages them to fight the oppressive system around them using memes. The meme coin is fed up with the rich and powerful ones leaving the majority at the bottom of the pyramid, and it is out to do something about that. With its DAO and memes, Anarchy (ANA) will empower its users with the capital and confidence to leave the corrupt system and pursue their dreams and passions.\n\nAnarchy’s memes will come with a lot of creativity, sarcasm, and fun. The memes will call out the government and criticise its corrupt policies and officials while offering the rest of the crypto-verse the best of entertainment. With the memes, Anarchy’s users will be able to fight the system with confidence. As for profits, each member of Anarchy’s DAO is entitled to a share of the gains from the platform’s projects. Users will also earn passively from the ANA price spikes from the token burns.\n\nThe Anarchy (ANA) token is built on the Ethereum blockchain, so the platform will enjoy a popularity boost from being part of the Ethereum blockchain. Also, Anarchy’s developers will have an easier task creating apps on the network from Ethereum’s vast dApp collection. Ethereum (ETH) also contributes to the token’s security, so however you see it, Anarchy (ANA) is set for the stars.\n\nHow to get started?\n\n>>> BUY $ANA NOW <<<\n\nStart From Anarchy’s Presale!\n\nAnarchy’s offering massive returns in a bargain deal that could see you fulfil all your financial dreams before the year even runs out. Think about that vacation in Venice, that Ferrari sports edition, or that business you always wanted–all that could begin by investing in Anarchy (ANA)!\n\nEach token costs $0.00024; you can get them here on the presale website.\n\nAnarchy Website Anarchy Twitter Anarchy Telegram\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vZmluYW5jaWFsaXQubmV0L25ld3MvZnVuZHJhaXNpbmctbmV3cy96ZXRhY2hhaW4tcmFpc2VzLTI3bS1pbnRlcm9wZXJhYmxlLWxheWVyLTEtYmxvY2tjaGFpbi1jb25uZWN0cy1hbGwtY2hhaW5z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "ZetaChain Raises $27M for Interoperable Layer-1 Blockchain That Connects All Chains, Including Bitcoin, Cosmos ... - Financial IT",
        "content": "ZetaChain Raises $27M for Interoperable Layer-1 Blockchain That Connects All Chains, Including Bitcoin, Cosmos, and Ethereum\n\nZetaChain, the layer-one blockchain that brings universal interoperability to crypto, has closed a $27 million equity funding round from a range of top participants. The participants in the equity round include Blockchain.com, Human Capital, VY Capital, Sky9 Capital, Jane Street Capital, VistaLabs, CMT Digital, Foundation Capital, Lingfeng Capital, GSR, Kudasai, Krust, and others.\n\nZetaChain started in 2021 and has close to 150 contributors from all over the world. Some of the core contributors include Ankur Nandwani (ex-Coinbase, Brave, 0x, and co-founder of Basic Attention Token), Panruo Wu (early contributor to THORchain), and Brandon Truong (ex-BuzzFeed, Udacity, Yada). Other core members include former employees of Cosmos, Ignite, Consensys, and multiple other blockchain projects.\n\nZetaChain’s mission is to establish a new standard for blockchain interoperability and enable users to manage all of their assets and data from a single platform, regardless of the blockchain they were created or stored on and without the need for bridges or wrapped tokens. This includes non-smart contract chains like the Bitcoin network and Dogecoin. Standardized interoperability provides developers with significant advantages as they can manage a single contract for all chains and reduce the attack surface. ZetaChain’s Ethereum Virtual Machine compatible smart contract layer and omnichain toolkit empower developers to seamlessly implement Bitcoin smart contracts. This unlocks a whole world of users who were previously solely in Bitcoin, enabling them to utilize their Bitcoin within the broader DeFi ecosystem.\n\nThe ZetaChain ecosystem is thriving, with more than 27,000 dApp contracts currently deployed on the platform. These represent a diverse range of third-party decentralized applications, including cross-chain DeFi, NFTs, universal web3 social, identity, and gaming protocols. Already, more than 1.7 million users have participated on the ZetaChain testnet, which has seen over 13 million transactions completed to date.\n\n“ZetaChain’s purpose is to simplify managing assets and data across multiple blockchains, which remains a complicated and fragmented process that’s hindering hundreds of millions of new users joining the web3 ecosystem,” said Ankur Nandwani, ZetaChain core contributor. “Our EVM-compatible cross-chain smart contracts alleviate these issues by allowing decentralized app developers to build services that are faster, more secure, and easy to use.”"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDIzLzA4LzE4L2hvdy10by1maW5kLXRoZS1iZXN0LWV4Y2hhbmdlLXJhdGUtZm9yLWV0aGVyZXVtLXRvLW5haXJhL9IBY2h0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDIzLzA4LzE4L2hvdy10by1maW5kLXRoZS1iZXN0LWV4Y2hhbmdlLXJhdGUtZm9yLWV0aGVyZXVtLXRvLW5haXJhLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "How To Find The Best Exchange Rate For Ethereum To Naira - Nairametrics",
        "content": "Ethereum, being the second largest cryptocurrency in the world, means that it is high in demand.\n\nSo, being an ETH investor/trader, you’re also in for a profitable venture. Naturally, your priority will be finding the best exchange rate especially if you’re converting from Ethereum to Naira.\n\nIn this post, we’ll discuss all the crucial factors and where you can find the best exchange rate for Ethereum to Naira (or Cedis). So, if you’re trying to preserve the value of your crypto, you’ll find the Breet app to be the most suitable for your needs. You’ll see why as you read on.\n\nFactors to Consider When Finding the Best Exchange Rate\n\nThe current market price of Ethereum\n\nIt is common knowledge that the higher the value of Ethereum, the more Naira you’ll get. But remember that ETH is volatile, so the exchange rate constantly fluctuates. Keep a close watch on ETH’s value and try to sell when you’re at a profit when possible.\n\nThe fees charged by the exchange platform\n\nTransaction fees are super important when finding an exchange rate with the best value. These fees are charged by the exchange platform to process your transaction. However, they vary from platform to platform.\n\nTo maximise your profit, it’s best to trade with an exchange with low transaction fees.\n\nThe liquidity of the exchange\n\nLiquidity is when you can buy and sell an asset quickly and easily without affecting the price. Ethereum is a high-liquidity crypto in itself.\n\nHowever, the liquidity of the exchange should also be considered.\n\nAn exchange with high liquidity means that there are a significant amount of trades on the platform, so the exchange rate is more stable, and volatility is lower.\n\nBut, an exchange with lower liquidity will suffer more volatility.\n\nThe effect of a low-liquidity exchange on your Naira will be unfavourable, while a high-liquidity exchange will have you smiling at the bank.\n\nThe reputation of the exchange platform\n\nAn exchange platform with an excellent reputation means there’s a good track record of reliability, security and customer satisfaction. With a reputable exchange, there’s a greater chance of getting excellent returns and peace of mind while converting your Ethereum to Naira.\n\nWhere to Find the Best Exchange Rate for Ethereum to Naira\n\nCrypto-to-fiat conversion already has its own challenges, but it is even more challenging for a Nigerian.\n\nThis is mainly due to the tight regulations, so getting the most out of crypto in Naira has been a struggle.\n\nMost options are either too restrictive, expensive, or offer poor rates in exchange for crypto.\n\nThis is why I started with some factors you should consider when looking for the best exchange rates for your Ethereum to Naira conversion.\n\nThe Breet app, apart from offering one of the best exchange rates, also has a built-in crypto rates calculator that lets you see the real-time value of your Ethereum in Naira.\n\nThis is a look-before-you-leap situation where the Breet app is transparent about the rates.\n\nYou should also know that the Breet app is an Over-The-Counter (OTC) crypto trading platform that offers immediate crypto-to-fiat conversion in Nigeria and Ghana.\n\nThis means you jump several obstacles and get an almost immediate conversion to your preferred currency (Naira or Cedis) straight to your bank account.\n\nThis crypto-to-Naira solution (Breet) is highly secure, fast, and one of the most seamless transactions you can make. You can check out the crypto rates calculator and expect only the most competitive rates!\n\nYou’d also be pleasantly surprised to see that after a quick sign-up, you automatically get an Ethereum wallet address generated for you.\n\nWrapping it up\n\nYou may have spent some time looking for the best exchange rate for your Ethereum to Naira (or Cedis), but that ends now.\n\nWith the Breet app, you’ll get the best exchange rate, and a crypto exchange app that suits your trading needs perfectly.\n\nStart getting the most out of your Ethereum investment; use the Breet app today. Happy trading!"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZmluYm9sZC5jb20vZXRoZXJldW0td291bGQtdHJhZGUtYXQtdGhpcy1wcmljZS1pZi1pdC1oaXRzLWl0cy1hbGwtdGltZS1oaWdoLW1hcmtldC1jYXAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Ethereum would trade at this price if it hits its all-time high market cap - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) reached an all-time high price of $4,878 on November 10, 2021, as well as an all-time high market cap of $548.4 billion on the same date. Two years ago, the Ethereum Network implemented a few updates that drastically changed the supply dynamics for Ether, the native token.\n\nHowever, even with all the changes, ETH is still affected by its token’s inflation. Considering data retrieved by Finbold on August 18, with a circulating supply of around 120.21 million ETH, one Ether would be worth close to $4,570 — $308 (6.3%) less than its price all-time high in US dollars.\n\nETH supply stats. Source: ultrasound.money (registered on August 18, at 12pm UTC)\n\nThe first change to Ethereum’s code to impact the token’s supply was called the London Upgrade, made on August 5, 2021, which introduced the burning mechanism as described by the Ethereum Foundation:\n\n“The London upgrade introduced EIP-1559, which reformed the transaction fee market, along with changes to how gas refunds are handled and the Ice Age schedule.”\n\nWhile the second relevant change was called The Merge (or Paris), which took place on September 15, 2022 — one year after the ‘burn.’ Paris merged Ethereum’s blockchain with the Beacon Chain, switching the old Proof-of-Work (PoW) consensus mechanism to a more efficient Proof-of-Stake (PoS), reducing ETH’s emission through block subsidy, as entities’ costs to maintain the network were drastically reduced.\n\nEthereum supply inflation and gas fees\n\nSince then, a little over 3 million ETH have been added to Ether’s circulating supply. As a result of 6.56 million ETH issued through the payment of the block subsidy to Ethereum’s validators, less an amount of 3.55 million burned ETH from the share of the gas fees paid by Ethereum users.\n\nIt’s estimated that Ether has a yearly inflation rate of 1.26%, as opposed to an expected yearly inflation rate of 3.16%, in case ‘The Merge’ did not take place.\n\nAt current rates, it’s also expected that the network burns an average of 1.75 million ETH per year, but these numbers are directly correlated to the network usage. The more people use the Ethereum Network, paying more gas fees to transact or deploy smart contracts, the more ETH will be burned — and the opposite is equally true.\n\nRecently, Visa (NYSE: V) introduced the possibility for users to pay their gas fees on Ethereum with a Visa Credit Card, thanks to another change in the protocol called Address Abstraction (ERC-4337). This could also impact fee expenditures, impacting the burn amount, and the projected price for 1 ETH in the future, according to its all-time high market cap.\n\nETH analysis\n\nETH was changing hands as low as $1,680 on August 18, after massive losses that affected the whole crypto market, registering over 11% in losses in the last 30 days.\n\nThere are no guarantees that ETH will ever reach its all-time high market cap of $548.4 billion, depending entirely on further development, news, sentiment, and demand for the Ethereum ecosystem. Therefore, it’s also possible that the second-largest cryptocurrency could overcome this historic mark.\n\nAll in all, a few experts were foreseeing a price drop (as happened), in anticipation of a further price appreciation. Moreover, two positive signs were spotted on Ethereum.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDgvMTgvNDEtbWlsbGlvbmktc29sZC1iZWZvcmUtZXRoZXJldW0tZXRoLXByaWNlLWNhc2gv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "$41 Million Sold Before Ethereum (ETH) Price Crash - The Cryptonomist",
        "content": "The cryptocurrency market has once again sent shockwaves through the investment world with a substantial drop in the market in 2023, in an unexpected turn of events, both Bitcoin (BTC) and Ethereum (ETH) suffered a sharp drop in their price by more than 7%, plunging their respective market capitalizations to $515 billion and $202 billion.\n\nIn the midst of this drop, a major market participant managed to protect himself from the collapse through strategic actions.\n\nThe tactical move of the investor before the Ethereum (ETH) price collapse\n\nIn the midst of the recent cryptocurrency market crash, an intriguing and strategic maneuver was made by a whale-a term used to describe individuals or entities that hold a substantial amount of a cryptocurrency.\n\nThis particular whale demonstrated a shrewd understanding of market dynamics by dumping 22,241 ETH, valued at as much as $41 million, just before the flash crash occurred. The twist is that this move was not profitable; in fact, the whale suffered a loss of $1.7 million due to the timing of the sale.\n\nHowever, it is important to note that this decision, although costly, turned out to be beneficial as it helped the whale avoid the impending market crash.\n\nInsights into this move were unveiled by Lookonchain, an on-chain analytics platform renowned for its in-depth analysis of blockchain data.\n\nTheir findings highlighted how this whale’s actions can be seen as a calculated risk. By selling its assets before the collapse, this investor was able to protect its portfolio from subsequent value depreciation.\n\nIn fact, this strategy may allow the whale to buy back assets at a significantly lower price in the future, taking advantage of market fluctuations.\n\nThe market dynamics surrounding this scenario extend beyond Ethereum. In particular, Coinbase’s premium for Bitcoin (BTC) has increased by 3%, indicating potential buying activity among whales associated with the Coinbase exchange.\n\nThis raises the question of whether these participants are already exploiting the market decline to their advantage. Conversely, another possibility is that a whale entity may have initiated a dump on the Binance exchange, contributing to the increase in Coinbase’s premium.\n\nQuantifying the decline and rise of the buy-the-dip mentality\n\nTo understand the intensity of bearish market trends, several metrics need to be analyzed. One such metric is Bitcoin‘s Open Interest (OI)-weighted funding rate, which fell below -0.01% for the first time since 12 March 2023.\n\nThis indicates substantial bearish sentiment, as it implies that traders are more inclined to short rather than long positions. Ethereum’s funding rate, even lower at -0.0273, amplifies the narrative of pessimism surrounding these cryptocurrencies.\n\nHowever, the cryptocurrency world is renowned for its ability to view adversity as opportunity. Bearish market conditions are often seen as a prime time to accumulate assets due to their discounted values.\n\nThis sentiment is currently echoing on social media platforms, with nearly 1% of all cryptocurrency-related discussions revolving around the concept of “buying the dip.”\n\nThis percentage is the highest recorded since April 2023 and indicates that investors are seizing the opportunity to strengthen their cryptocurrency portfolios amid market turmoil.\n\nThe psychology of the buy-the-dip mentality\n\nThe psychology behind the buy-the-dip mentality is rooted in the belief that market downturns are transitory and that assets will eventually recover value.\n\nThis perspective suits long-term investors who aim to capitalize on market volatility by buying assets at lower prices, with the expectation that their value will appreciate over time.\n\nWhile not without risk, this strategy is emblematic of the resilience and optimism of the cryptocurrency community.\n\nIn conclusion, the recent events surrounding the $41 million ETH dump and subsequent market crash highlight the intricate strategies whales employ to navigate the volatile cryptocurrency landscape.\n\nThe ability to anticipate market changes and act accordingly underscores the sophistication of cryptocurrency market participants.\n\nIn addition, the prevalence of buy-the-dip sentiment illustrates the resilience of investors who are willing to accept temporary setbacks to pursue long-term gains.\n\nAs the cryptocurrency market continues its roller-coaster ride, these insights offer a glimpse into the mindset and actions that shape this evolving financial ecosystem."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDgvMTgvbmV3cy1zZWMtbWF5LWFwcHJvdmUtZXRoZXJldW0tZXRmcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "News: SEC may approve Ethereum ETFs - The Cryptonomist",
        "content": "ETFs based on Bitcoin futures contracts were approved by the SEC in late 2017: now it seems to be the turn of those based on Ethereum futures as well, according to the latest news.\n\nBloomberg reports this, citing anonymous sources familiar with the situation.\n\nNews: ETFs on Ethereum and SEC approval\n\nJust as was the case with Bitcoin, these ETFs would not be collateralized directly in ETH, but in futures contracts on the price of ETH.\n\nIndeed, to be honest, it seems a bit strange that almost five years after the approval of Bitcoin futures ETFs, those on Ethereum futures have not yet been approved.\n\nThe thing is, with regard to Ethereum, the approval path for these ETFs has been more troubled, because apparently there is a fear that the ETH market may be manipulated.\n\nHowever, as of today there does not seem to be much difference between the BTC and ETH markets anymore, so if the SEC has already approved the BTC price ETFs there seems to be no reason to believe that it could refuse to approve the ones on the price of ETH.\n\nInstead, in both cases, there is no sign any time soon that the US agency will allow ETFs collateralized directly in BTC or ETH (i.e., based on Bitcoin and Ethereum spot) to land on US markets, although in early 2024 this could happen.\n\nIn late 2021, when the first futures-based ETFs were launched on the price of BTC, the price of Bitcoin was close to its all-time high, but then the bear-market of 2022 began. However, it does not seem that something like that can happen now with ETH, as market conditions are completely different.\n\nA total of twelve companies have applied to the SEC to be allowed to issue an ETF based on ETH price futures contracts in the US markets, including ProShares, Volatility Shares, Bitwise and Valkyrie.\n\nAccording to Bloomberg’s reported speculation, Valkyrie’s could be approved around 3 October.\n\nWhat are the benefits of ETFs\n\nSo-called Exchange-Traded Funds (ETFs) are funds whose shares are traded on an exchange.\n\nIf the fund is fully collateralized with a single asset, the trend in the price of its shares actually follows that of the price of the underlying asset, allowing those who buy them to take a position on that price without having to buy the underlying asset.\n\nThe latter is especially important with regard to cryptocurrencies, both because many people want to invest in crypto without having to worry about their custody, and because ETFs can be traded on traditional exchanges bypassing crypto exchanges.\n\nHowever, to date, no ETFs collateralized directly in tokens, whether BTC, ETH or other cryptocurrencies, have yet been approved in the US.\n\nHowever, some have already been launched on Canadian exchanges, and recently also on Euronext Amsterdam.\n\nIt is worth pointing out that in addition to ETFs, there are also similar products (ETNs, ETPs) that replicate the price movement of an asset without being actual stock funds.\n\nSo while in the US there are neither ETFs, ETNs or ETPs, on spot Bitcoin or Ethereum, there are, however, ETFs collateralized with futures contracts on the price of Bitcoin.\n\nIn contrast, abroad there are also ETFs, ETNs or ETPs collateralized directly in BTC.\n\nThe comments\n\nThe news of the SEC’s possible impending approval of an ETF based on ETH futures contracts apparently had no effect on Ethereum’s price.\n\nHowever, the news has prompted several comments.\n\nAccording to Bloomberg Senior Analyst Eric Balchunas, this news is not a surprise, although the real game is being played on the approval of ETFs on spot BTC and ETH.\n\nThis not surprising to us, we had said they would approve Ether Futures early on in race. Nice to be validated. Now what does it mean for spot? Hard to say beyond it shows that their views/policy/tolerance can change. https://t.co/JXCxNUpj2U — Eric Balchunas (@EricBalchunas) August 17, 2023\n\nJames Seyffart of Bloomberg Intelligence, on the other hand, points out that the fee costs of the ETF on ETH futures are definitely low.\n\nUPDATE: @roundhill discloses a 0.19% management fee for their Ethereum Futures ETF ( $ETHX).\n\n\n\nThis is very low compared to BTC futures ETFs like Proshares' $BITO's 0.95%. And is still drastically lower than VanEck's $XBTF which at 0.76%. Fee war already starting in crypto ETFs https://t.co/toBBGkPpZd pic.twitter.com/5Fk34F2qAN — James Seyffart (@JSeyff) August 18, 2023\n\nOverall, the news has been well received, although this has not done much to lift the price of ETH back up after yesterday’s plunge.\n\nWhat is clear is that traditional markets are increasingly interested in cryptocurrencies, but that at the same time traditional investors still tend not to want to get their hands dirty with these new technologies, as they are clearly somewhat afraid of not knowing how to handle them properly."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3NpbXVsdGFuZW91cy1hcHByb3ZhbC1vZi1hbGwtZXRoZXJldW0tZXRmcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Simultaneous approval of all Ethereum ETFs on the horizon | - Cryptopolitan",
        "content": "The Ethereum ETF scene is on the brink of a revolution. The U.S. Securities and Exchange Commission (SEC), historically cautious and skeptical about the crypto world, seems to be shifting its stance.\n\nThe wave of change hints that the agency might give the green light to a barrage of Ether futures exchange-traded fund (ETF) applications.\n\nThe Flood of Applications: What Changed?\n\nOver the past several months, a barrage of applications related to the Ethereum ETF has crashed upon the SEC’s doorstep. Among these, a slew encompasses combined strategies of both Bitcoin and Ether futures.\n\nIf we took a time machine back to 2021, the atmosphere was entirely different; the SEC consistently nudged companies to pull back their similar applications.\n\nHowever, whispers from those with their ear to the ground suggest that this past reticence might have transformed into a more accommodating approach. This evolution in attitude signals that the SEC could potentially let these Ethereum ETFs out of the gate in the coming weeks.\n\nAnd the sheer number? We’re talking about 16 applications revolving around either Ether or a combination of Bitcoin-Ether futures ETFs. Now, for the uninitiated, these aren’t just standard ETFs but represent a nuanced segment of the market.\n\nInstead of thrusting money directly into the crypto giants like Bitcoin or Ethereum, these crypto futures ETFs leverage futures contracts linked to the crypto prices.\n\nValkyrie: Leading the Ethereum ETF Charge?\n\nOne notable player in this Ethereum ETF frenzy is Valkyrie. They aren’t newcomers; the asset management giant recently put forward an application for an Ether futures ETF.\n\nThis wasn’t their first foray either; a prior bid for a combined Bitcoin-Ether futures strategy ETF was already in the mix. If rumors are to be believed, Valkyrie might be inching ahead, potentially launching its BTC-ETH ETF by October.\n\nBut why the mad dash? The ETF domain operates on a simple mantra: the early bird catches the worm. A case in point is ProShares. Being the premier futures Bitcoin ETF to get the SEC’s nod, it raked in a staggering $1 billion in assets within its inaugural year.\n\nContrast that with Valkyrie’s similar offering, which entered the market slightly later and managed nearly $28 million. The difference is glaring. This dance with the Ethereum ETF isn’t the SEC’s only tête-à-tête with the crypto domain.\n\nAnother mammoth decision dangles in the balance: will the SEC bestow its blessings on a spot Bitcoin ETF in the U.S.? It’s not just fledgling entities hanging in the balance, but Wall Street behemoths like Fidelity and BlackRock too. The anticipation is palpable, and the SEC’s final word on this is expected by January.\n\nBottomline is the Ethereum ETF landscape in the U.S. teeters on the brink of a seismic shift. With the SEC’s potential mass approval of a multitude of applications, a new era for crypto-based ETFs might dawn. The financial world waits with bated breath, eyes trained on the SEC’s next move."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNyeXB0b2dsb2JlLmNvbS9sYXRlc3QvMjAyMy8wOC9jcnlwdG8td2hhbGUtc2VsbHMtNDEtbWlsbGlvbi1vZi1ldGhlcmV1bS1ldGgtYWhlYWQtb2YtbWFya2V0LWNyYXNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Crypto Whale Sells $41 Million of Ethereum ($ETH) Ahead of Market Crash - CryptoGlobe",
        "content": "A large cryptocurrency whale has liquidated over $41 million worth of the second-largest cryptocurrency by market capitalization Ethereum ($ETH) shortly before the cryptocurrency market crashed and lost over 6% of its value in just 24 hours.\n\nAccording to on-chain analysis service Lookonchain, the whale dumped 22,341 ETH then valued at $41 million in a move that realized a loss of $1.7 million for the whale, but successfully avoided a market crash.\n\nThe whale was very smart and dumped 22,341 $ETH ($41M) before the market crashed.\n\n\n\nEven though he lost ~$1.7M this time, he successfully avoided the market crash.\n\n\n\nPerhaps he will buy $ETH back at a cheaper price in the future.\n\n\n\nFollow this smart whale.👇https://t.co/S4Wv8XRlhW pic.twitter.com/BcdzdpmbIA — Lookonchain (@lookonchain) August 18, 2023\n\nThe whale realized its loss by moving the ETH tokens to leading cryptocurrency exchange Binance, where it sold the funds and then withdraw them in the form of leading stablecoin USDT.\n\nThe move came ahead of a cryptocurrency market crash that saw the total capitalization of the space drop by over 6% to $1.1 trillion, the lowest level in at least two months, that came amid reports SpaceX sold all of its Bitcoin – even though these remain unconfirmed – and as China’s struggling property giant Evergrande filed for Chapter 15 bankruptcy protection in the United States.\n\nWhile the price of Bitcoin is down by around 7.3% in the last 24-hour period and over 10% in the last seven days, Ethereum’s price dropped by 9.5% in the past week and 6% over the last 24-hour period as it outperformed the flagship cryptocurrency.\n\nEthereum’s performance is tied to reports that suggest the U.S. Securities and Exchange Commission (SEC) is set to approve the listing of exchange-traded funds (ETFs) indirectly offering exposure to the cryptocurrency through ETH futures contracts.\n\nNotably earlier this week, Nasdaq-listed cryptocurrency exchange Coinbase gained regulatory approval to offer Bitcoin and Ether futures trading to customers in the United States. Coinbase’s foray into the derivatives sector isn’t a recent endeavor. In September 2021, the company submitted an application to the National Futures Association (NFA) seeking FCM registration.\n\nFeatured image via Pixabay."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmtyeXB0b21vbmV5LmNvbS9ldGhlcmV1bS1mb3VuZGF0aW9uLWFubm91bmNlcy1xMi1mdW5kaW5nLWZvci1wcm9qZWN0cy1hbmQtY29uZmVyZW5jZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Foundation Announces Q2 Funding for Projects and Conferences - - KryptoMoney",
        "content": "Ethereum Foundation Announces Q2 Funding for Projects and Conferences\n\nTomiwabold Olajide By August 19, 2023\n\nThe Ethereum Foundation released details of its funding in Q2, revealing an allocation of $9.2 million to support various projects, conferences and industry research. Among the recipients, community and education projects took precedence, encompassing over ten summits and conferences.\n\n\n\nThe scope of funded activities extended globally, with conferences and hackathons like ETH Barcelona, ETH Belgrade, ETH Prague, Ethereum Singapore and ETH Rome benefiting from the Foundation’s financial backing. The allocation of grants extended to Consensus Layer research focused on data availability sampling, distributed systems and staking infrastructure tools. Key Ethereum clients, Nimbus and Lighthouse, saw ongoing development efforts.\n\n\n\nSignificant funding was channeled into cryptography and zero-knowledge proofs, aiding the development of tools like Chiquito and Hypernova for streamlined zk circuit construction. Additionally, privacy-centric protocols such as Lambdadelta, Isokratia, and zkEmail were supported. Foundational protocols like Halo2 and Semaphore continued to receive backing.\n\n\n\nDeveloper experience and tooling improvements remained priorities, as evidenced by the funding of Recovery Pulse for smart contract recovery.\n\n\n\nExecution Layer projects, including the Fluffy Light client, and Nethermind internships, were also recipients of financial support. Developing the Nimbus execution layer and the layer-2 Beacon Chain blockchain explorer also secured funding.\n\n\n\nDespite the ongoing bear market, the Ethereum Foundation‘s ecosystem support program (ESP) remains committed to fostering growth within the expansive ecosystem of the largest smart contract network in the cryptocurrency landscape.\n\n\n\nIn related news, reports surfaced indicating that former U.S. President Donald Trump possesses Ethereum holdings ranging from $250,000 to $500,000. These holdings are likely linked to the sale of his self-themed NFT collection.\n\nImage Credit: Shutterstock"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMDgvYWRhLWNhcmRhbm8tZm91bmRlci1jaGFybGVzLWhvc2tpbnNvbi1zbGFtcy1ldGhlcmV1bXMtZHVtcHN0ZXItZmlyZS1vZi1hLWNvbnNlbnN1cy1sYXllci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "$ADA: Cardano Founder Charles Hoskinson Slams Ethereum's 'Dumpster Fire of a Consensus Layer' - CryptoGlobe",
        "content": "The founder of Cardano ($ADA) Charles Hoskinson has seemingly seen a comment from a cryptocurrency investor touch a nerve after they threw shade at Cardano’s developmental trajectory and alleged parallels with Ethereum.\n\nIn response to a cryptocurrency investor who suggested Cardano is following Ethereum’s roadmap but was “a few years behind,” Hoskinson said “it’s getting delusion town now,” and added that the Cardano community is “living rent-free in the maxi minds.”\n\nOn the topic, Hoskinson added:\n\nEthereum has a dumpster fire of a consensus layer, has a terrible programming model that they can’t change, and are getting eaten alive by their own layer 2 ecosystem. Cardano’s sidechain plans mutually benefit both Cardano and the sidechain.\n\nor context, in March 2020, the Cardano Foundation unveiled an insightful research paper detailing Hydra, Cardano’s Layer 2 scaling solution. Matthias Benkort, Technical Director of Open Source Development at Cardano Foundation, has described Hydra as an open-source framework designed to create off-chain ledgers, thereby enhancing the efficiency of blockchain usage.\n\nDeveloped jointly by the Cardano Foundation and IOG, Hydra is a state-channel solution that allows for fast-paced transactions on a private network, known as a Hydra Head. The transactions can then be settled on the main Cardano chain, making the results of the interactions available to the rest of the network.\n\nHoskinson has commented on the Hydra Head, saying simulations “have shown that each ‘Hydra head’ can currently process about 1,000 transactions per second (TPS). With 1,000 stacking pools, each processing 1,000 TPS, Cardano could very well reach a throughput of a staggering one million transactions every second.”\n\nAs CryptoGlobe reported, the total value locked on Cardano’s decentralized finance (DeFi) ecosystem has recently reached a new milestone above the 600 million $ADA mark, with the amount of the network’s native tokens locked on DeFi applications having tripled since the beginning of the year.\n\nFeatured image via Unsplash."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wOC8xOC9zZWMtaGFzLXJlcG9ydGVkbHktYXBwcm92ZXMtZXRoZXJldW0tZnV0dXJlcy1ldGZzLWZpbmQtZGV0YWlscy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 18 Aug 2023 07:00:00 GMT",
        "title": "SEC has Reportedly Approves Ethereum Futures ETFs; Find Details - The Coin Republic",
        "content": "The U.S. Securities and Exchange Commission (SEC), a government agency, is almost on its way to approving the first Ethereum Futures-based exchange-traded funds or ETFs, reportedly. Whereas specific funds to be approved stays uncertain, while a dozen companies await the green light.\n\nNotably, this development comes in between the anticipation for the SEC’s decision on many spot price Bitcoin ETFs. However, the U.S. government agency did not make any comment, while those familiar with the matter shared about the same.\n\nMultiple Reports About Ethereum ETF\n\nAccording to a report of August 17, 2023, shared by familiar sources, “several firms could receive approval to launch an Ether-Futures ETF by October. Although, the SEC is reportedly not likely to hinder the process in any way.”\n\nAccording to the report, “the regulator isn’t likely to block the products, which would be based on futures contracts for the second-largest cryptocurrency, according to people familiar with the matter.” It is still not clear which firms will receive the approval.\n\nThe sources have provided limited information whereas the SEC has not announced it yet. “It couldn’t immediately be determined which funds would get green lights. Officials have indicated that several may by October, said one of the people, who asked not to be identified discussing information that hasn’t been made public.”\n\nAccording to a report on August 2, 2023, regulatory approval is pending for six Ether-Futures filings. Whereas the firms seeking approval include “Ether Strategy ETF, Bitwise Ethereum Strategy ETF, Roundhill Ether Strategy ETF, VanEck’s Ethereum Strategy ETF, ProShares Short Ether Strategy ETF, and the Grayscale Ethereum Futures ETF.”\n\nAnother ETF Decision is Waiting\n\nThe following ETF news comes in between a standstill with Bitcoin ETFs. Many firms are eagerly waiting for a response from the SEC, regarding the decision on ETFs directly linked to Bitcoin.\n\nThe CEO of Ark Invest, Cathie Wood, thinks that the SEC will not grant approvals for firms’ Bitcoin ETFs individually. It must be noted that Wood’s Ark Invest is currently awaiting a decision on its own spot price Bitcoin ETF. As she opined that “If the SEC is going to approve a Bitcoin ETF, will approve more than one at once.”\n\nA report released in late June 2023 further pointed out that the SEC was not satisfied with the transparency and information presented in several filings submitted by asset managers seeking to launch a Bitcoin ETF. The government agency reportedly declared that the documents were not “clear and comprehensive.”\n\nLast but not least, according to CoinMarketCap, at press time, Ethereum is trading at $1,680.54 with a 24-hour trading volume of $16.33 Million. Ethereum is down 5.97% in the last 24 hours with a current market cap of $201.75 Billion."
    }
]