[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2NyeXB0b3NsYXRlLmNvbS90aGUtZXRoZXJldW0tcXVlc3Rpb24td2h5LWRvZXMtdGhlLXNlYy1hdm9pZC10YWtpbmctYWN0aW9uLWFnYWluc3QtZXRoZXJldW0td2hlbi1hbGwtZWxzZS1hcmUtZmFpci1nYW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "The ETH Question: Why does the SEC avoid taking action against Ethereum when all else are fair game? - CryptoSlate",
        "content": "The U.S. Securities and Exchange Commission (SEC) filed suit against Binance today in a move that has rocked the cryptocurrency industry.\n\nThe complaint notably includes language in which the SEC clearly elucidates that it considers many of the tokens that traded on Binance to be unregistered securities and lays out its case against several it considers notable offenders. The SEC identifies these “crypto asset securities” as including (but not limited to) Solana, Cardano, Polygon, Filecoin, Cosmos, The Sandbox, Decentraland, Algorand, Axie Infinity, and Coti.\n\nToday’s filing contains some of the SEC’s most explicit language to date in clarifying its judgment, but once again avoids taking on the big question: is Ethereum a security or not? If so, why is the SEC silent on it? And if not, what is it?\n\n“Crypto Asset Securities”\n\nThe SEC’s argument for designating these tokens as “crypto asset securities” is exhaustively outlined in Section VIII of the complaint (pages 85 through 123). Notable patterns emerge from the filing: the process of initial coin offerings (ICOs), vesting of tokens, allocations for the core team, and the promotion of profit generation through ownership of these tokens, are all repeated themes.\n\nBut Ethereum is not listed among these. Gensler has remained consistently vague on the question of whether Ethereum and its namesake coin count as securities. ETH is commonly held as an investment, suggesting it could be classified as a security, but it is also extensively used day-to-day as a medium of exchange across protocols, making its function more akin to cash or ACH settlement.\n\nGensler has previously suggested that “everything other than Bitcoin” in the crypto space could be seen as a security, but has notably refused to clearly state as much about Ethereum. When pressed to say the words, “I believe Ethereum is a security,” the Hon. Chair just will not do it. Gensler’s reluctance to classify Ether is curious when his SEC is so eager to claim as much for others. Why?\n\nThe Ethereum problem\n\nIt might be a simple matter of intragovernmental contention. Ethereum could potentially fall under the purview of the Commodity Futures Trading Commission (CFTC), which regards Bitcoin, Ethereum, and Tether as commodities, not securities. Not only do the two categories differ wildly from one another, this overlap could create a regulatory tug-of-war that would Gensler’s public stance on Ethereum while trying to avoid the appearance of infighting within the federal government.\n\nAnother analysis from Protos, argues that Gensler’s evasion on the matter may be a consequence of the SEC’s earlier inaction following the infamous DAO hack, which saw the blockchain fork into Ethereum Classic and put the entire ecosystem at risk. However, at the time the SEC did nothing, and now Gensler finds himself in the unenviable position of making up for his predecessors’ oversights. Now that the Ethereum ecosystem has spent years recovering and building credibility, retroactively declaring it an unregistered security would have unforeseen, but no doubt disastrous, consequences for investors.\n\nIn other words, protecting investors in this case would mean protecting them from the protector.\n\nHowever, perhaps another reason could lie beneath Gensler’s reluctance to clearly classify Ethereum: he may not know.\n\nCryptocurrencies and their underlying technologies are innovative and novel. They represent a fundamental shift in how we understand finance and asset ownership, and in the case of decentralized ecosystems like Ethereum, they introduce entirely new paradigms.\n\nIf this is true, it’s not unreasonable to suspect that most people—even those deeply involved in the space—may not fully understand the implications of these innovations just yet. Anything that is fundamentally new will resist categorization, and Ethereum does so—this lack of a concrete “concept” that both defines Ethereum but fits into previous understandings is the core problem around regulating it.\n\nThis regulatory ambiguity presents a complex challenge for Ethereum, but it does not lessen the urgency to address it. The advancement of the crypto industry hinges on obtaining clear legal definitions for Layer 1 (L1) tokens, such as Ethereum, that function simultaneously as mediums of daily exchange and investment vehicles within their respective ecosystems. The ambiguity in their status poses a significant hurdle, stalling progress and fostering uncertainty in a space that is ripe for growth and innovation.\n\nThe dichotomy of these tokens’ roles blurs the boundary between conventional asset classes, forcing us to confront inadequacies in existing legal structures. To propel the crypto industry forward, regulators must acknowledge and address this nuanced reality. Until a refined framework emerges that accurately captures the dual functionality of these L1 tokens, regulatory ambiguity will continue to shroud the industry, stifling its full potential and deterring mainstream adoption. This unique crypto space requires equally unique rules—ones that can encapsulate its dynamism and complexity.\n\nMaking meaningful progress\n\nThe path towards comprehensive crypto regulation is obscured by two significant obstacles, which must be addressed urgently for the sector’s responsible advancement.\n\nFirstly, the U.S. Securities and Exchange Commission (SEC) must establish a formal position on Ethereum. Given the SEC’s historical inaction in restraining Ethereum’s growth when opportunities were present, it has inadvertently fostered an environment where investors are left in regulatory limbo. The SEC, as the protector of investors, has a duty to provide some form of regulatory guidance—even if it proves to be temporary—to offer a foundational starting point and eliminate the current state of speculation. The lack of clear regulation is not merely an inconvenience; it is a failure to provide the necessary protections for participants in an increasingly significant market.\n\nSecondly, authentic, open-ended discussions about the nature of digital assets are crucial. This implies engaging in conversations devoid of preconceived notions, biases, ideological posturing, or empty rhetoric. We often speak of making space to “have the conversation,” but acknowledging that conversation needs to take place and actually having one are two very different exercises indeed. Perhaps everyone in the industry—as well as those watching over it—would benefit from practicing the latter.\n\nMentioned in this article"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMDYvYml0Y29pbi1hbmQtZXRoZXJldW0tc2FnLWFzLXNlYy1zdWl0LWFnYWluc3QtY29pbmJhc2Utd2VpZ2hzLW9uLWNyeXB0by1tYXJrZXQv0gF4aHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8wNi8wNi9iaXRjb2luLWFuZC1ldGhlcmV1bS1zYWctYXMtc2VjLXN1aXQtYWdhaW5zdC1jb2luYmFzZS13ZWlnaHMtb24tY3J5cHRvLW1hcmtldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum sag as SEC suit against Coinbase weighs on crypto market - Fortune",
        "content": "The prices of Bitcoin, Ether, and other top cryptocurrencies dropped marginally just after the Securities and Exchange Commission sued U.S. crypto exchange Coinbase—just one day after the agency filed another blockbuster lawsuit against Binance, the world’s largest cryptocurrency exchange.\n\nBitcoin was immediately down about 1%, Ether 0.7%, and BNB, Binance’s digital currency, dipped to a low of 1%. Bitcoin began the day at $25,700 and dropped to a low of $25,400. The total market capitalization of all cryptocurrencies sagged about 0.7%.\n\nIn the lawsuit against Coinbase, the SEC specifically detailed “a non-exhaustive list” of 13 cryptocurrencies that it argued were securities, including pages of details outlining these tokens’ releases. The most prominent include Solana (SOL), Cardano (ADA), and Polygon (MATIC). After the SEC’s lawsuit became public, SOL was down approximately 2%, ADA 0.6%, and MATIC 2.6%.\n\n“From the time of their first offer or sale, each of these Crypto Asset Securities was\n\noffered and sold, and continues to be offered and sold today, as an investment contract and thus a\n\nsecurity,” wrote the SEC.\n\nThe depression in the market mirrors the price action seen on Monday, when the SEC sued Binance, as both cryptocurrencies and the share prices of publicly traded crypto companies, including Coinbase, took a hit.\n\nIn its suit against the U.S. crypto exchange, the SEC alleges Coinbase was operating as a broker, national securities exchange, and clearing agency without registering with the agency.\n\n“You simply can’t ignore the rules because you don’t like them or because you’d prefer different ones: The consequences for the investing public are far too great,” Gurbir S. Grewal, director of the SEC’s Division of Enforcement, said in a statement.\n\n“The SEC’s reliance on an enforcement-only approach in the absence of clear rules for the digital asset industry is hurting America’s economic competitiveness and companies like Coinbase that have a demonstrated commitment to compliance,” said Paul Grewal, Coinbase’s chief legal officer, in a statement shared with Fortune."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaW5hbmNlLW5ldC1vdXRmbG93cy1vbi1ldGhlcmV1bS1ibG9ja2NoYWluLWFmdGVyLXNlYy1sYXdzdWktbmFuc2Vu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Binance net outflows hit $778M on Ethereum since SEC charges: Nansen - Cointelegraph",
        "content": "The United States Securities and Exchange Commission’s (SEC) lawsuit against Binance — accusing the crypto exchange of violating various securities laws — has directly impacted the crypto market and the exchange’s balance sheet.\n\nAccording to data from crypto analytic firm Nansen, Binance saw negative netflows of over $778 million on the Ethereum blockchain, with $871 million of inflows dominated by $1.6 billion flowing out of the exchange.\n\nAs of 9.15 am UTC at the time of writing, in the 24 hours since the SEC charges, Ethereum-based tokens have seen negative netflows, with $14.8 million of assets flowing in and $50.5 million worth of assets flowing out of the exchange in the past hour alone.\n\nBinance netflow on Ethereum. Source: Nansen\n\nBinance’s reserve assets had a net outflow of approximately $1.4 billion in the first hour after news broke of the SEC’s charges, amounting to 2.6% of its total reserve assets of $52.9 billion.\n\nThe outflow of funds from Binance across all protocols has reached $999 million in the past 24 hours. Deteriorating confidence in Binance, on the other hand, has helped OKX become a preferred destination for traders, with the exchange registering a significant inflow of over $190 million.\n\nBinance outflows accelerate. Source: DefiLlama\n\nCompared with the Commodity Futures Trading Commission’s lawsuit against Binance in March, the recent net outflow is substantial but smaller. The same goes for December 2022, when Binance experienced large outflows in the wake of the FTX collapse. Additionally, the net outflows are still lower than the exchange’s reserve. The crypto exchange holds a healthy stablecoin balance of over $8 billion.\n\nAside from outflows on Ethereum, Binance also saw the largest outflow of Bitcoin (BTC) from the platform since the FTX collapse. Over 20,000 BTC were withdrawn from the exchange in the last 24 hours.\n\nBitcoin netflow on Binance. Source: Glassnode\n\nAnother on-chain analysis shared by CryptoQuant revealed that the total amount of user transactions to withdraw funds spiked after the SEC lawsuit announcement. However, they still hadn’t surpassed the levels seen in December 2022 when self-custody became increasingly popular in the crypto market.\n\n3/4\n\nThe total amount of user transactions to withdraw funds (#Bitcoin, #Ethereum, and #Stablecoins) has spiked after the SEC lawsuit announcement, but they are still within historical normal levels. pic.twitter.com/fHKMmKAyWI — CryptoQuant.com (@cryptoquant_com) June 6, 2023\n\nMarket pundits predicted that the significant surge in the withdrawals of assets from the crypto exchange reflects the declining trust of investors in centralized exchanges.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvY2FuLXlvdS1idXktZXRoZXJldW0tb24tY2FzaC1hcHDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Can you Buy Ethereum on Cash App (2023) - Watcher Guru",
        "content": "A Comprehensive Guide to Buying Ethereum on the Cash App in 2023\n\nAs we move towards a more digital economy, cryptocurrencies like Ethereum are becoming increasingly popular. If you’re a crypto enthusiast, you may wonder, “Can you Buy Ethereum on Cash App?”\n\nWith its potential for smart contracts and decentralized applications, Ethereum is quickly becoming a favorite among investors and developers alike.\n\nBut with so many options out there, it can be tough to know where to start.\n\nIn this guide, we’ll take a look at how you can buy Ethereum on the Cash App in 2023 and whether it’s the right choice for you.\n\nSource: CNBC\n\nUnderstanding Ethereum and its Potential in 2023\n\nBefore we dive into the specifics of buying Ethereum on the Cash App, let’s take a look at what makes Ethereum so special and why it’s worth investing in.\n\nEthereum is a blockchain platform that allows developers to build and deploy decentralized applications, or dapps, on the blockchain. These dapps can be anything from financial applications to social networks, and they’re all built on top of Ethereum’s blockchain.\n\nOne of the most exciting things about Ethereum is its potential for smart contracts. Smart contracts are self-executing contracts, with the terms of the agreement between buyer and seller being directly written into lines of code.\n\nThis means that once the contract conditions are met, the contract is automatically executed. Smart contracts can potentially revolutionize many industries, from finance to real estate. In 2023, we can expect to see even more innovation in the Ethereum ecosystem.\n\nWith the continued growth of decentralized finance, or DeFi, investors will have more opportunities to earn passive income through lending and staking. Additionally, we can expect to see more dapps being built on Ethereum as developers continue to explore the potential of this powerful blockchain platform.\n\nCan you buy Ethereum on the Cash App in 2023?\n\nSource: Pixabay\n\nYes, you can buy Ethereum on the Cash App in 2023.\n\nCash App is a mobile payment service that allows users to send and receive money and buy and sell Bitcoin and other cryptocurrencies. While Cash App started as a way to send and receive money, it has since expanded to include cryptocurrency trading.\n\nTo buy Ethereum on the Cash App, you must have a Cash App account and some fiat currency in your bank account or linked debit card. From there, you can easily convert your fiat currency into Ethereum and start investing in this exciting cryptocurrency.\n\nHow to Buy Ethereum on the Cash App in 2023: A Step-by-Step Guide\n\nIf you’re new to Cash App or cryptocurrency trading, the process of buying ETH on Cash App may seem intimidating.\n\nBut don’t worry; it’s quite simple. Here’s a step-by-step guide to buying Ethereum on the Cash App in 2023:\n\nDownload the Cash App from the App Store or Google Play Store and create an account. Link your bank account or debit card to your Cash App account. Go to the “Investing” tab on the home screen and select “Cryptocurrency.” Select Ethereum from the list of available cryptocurrencies. Enter the amount of ETH you want to buy and confirm your purchase. Congratulations! You now own Ethereum on the Cash App.\n\nSetting up your Cash App account for buying Ethereum\n\nYou’ll need to set up your account before you can start buying Ethereum on the Cash App.\n\nHere are some tips for setting up your Cash App account for buying Ethereum:\n\nMake sure your account is verified. To verify your account, you must provide some personal information, including your full name, date of birth, and social security number. Link your bank account or debit card. This will allow you to convert your fiat currency into Ethereum. Enable two-factor authentication. Two-factor authentication adds extra security to your account and helps protect your funds from hackers and scammers. Familiarize yourself with the app. Take some time to explore the different features of the Cash App and get comfortable with the interface.\n\nTips for buying Ethereum on the Cash App in 2023\n\nSource: Paxful\n\nNow that you know how to buy Ethereum on the Cash App, let’s take a look at some tips for making the most of your investments:\n\nDo your research. Before you invest in any cryptocurrency, it’s important to do your research and understand the risks involved. Invest only what you can afford to lose. Cryptocurrency investing is highly volatile, and there is always the risk of losing your entire investment. Consider using dollar-cost averaging. Dollar-cost averaging is a strategy where you invest a fixed amount of money at regular intervals, regardless of the asset’s price. This can help you avoid buying at the top of the market and potentially losing money. Keep your cryptocurrency in a custodial wallet. While Cash App provides a crypto wallet, keeping your investments in a separate, custodial wallet is generally safer. Stay up-to-date on the latest news and developments in the Ethereum ecosystem. By staying informed, you can make more informed investment decisions.\n\nBuying and selling Bitcoin on the Cash App\n\nIn addition to buying ETH, you can also buy and sell Bitcoin on the Cash App.\n\nBitcoin is the most well-known and widely-used cryptocurrency, and it can be a great investment for those looking to diversify their portfolio.\n\nTo buy or sell Bitcoin on the Cash App, follow the same steps as you would for buying Ethereum. However, remember that Bitcoin and Ethereum have different prices and different levels of volatility, so it’s important to do your research before investing.\n\nConclusion\n\nBuying Ethereum on the Cash App can be a great investment in this exciting cryptocurrency. However, it’s important to do your research and understand the risks involved before investing.\n\nBy following the tips and strategies outlined in this guide, you can make more informed investment decisions and potentially earn a solid return on your investment."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NvdXRoLWtvcmVhLXhycC10cmFkZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "South Korea Has Traded Way More XRP Than Ethereum This Year - Blockworks",
        "content": "People who trade crypto in South Korea are far from bitcoin (BTC) or ether (ETH) maxis. In fact, based on the latest data from Kaiko, they might be XRP maxis.\n\nOutside of BTC and ETH, collective volume for the top 20 most-traded cryptocurrencies listed on South Korea’s biggest crypto exchanges — Upbit, Bithumb, Coinone and Korbit — was $201.8 billion from the start of the year up to May 30, according to Kaiko data exclusively provided to Blockworks.\n\nBitcoin and ether saw $36.7 billion and $8.9 billion in trade, respectively.\n\nSouth Korea has a storied history in trading cryptocurrencies outside of the top two by market cap. Those digital assets typically account for 70% to 80% of total South Korean trade volume, according to Kaiko senior analyst Dessislava Aubert.\n\nAside from BTC, Ripple’s XRP is the most popular in South Korea by far.\n\nXRP captured 12% of the non-BTC and ETH volume.\n\n$24.5 billion XRP traded over the first five months of the year.\n\nXRP saw 66% of bitcoin’s volume and nearly three times ether’s.\n\nSouth Korea has traded more than $3.8 billion in Serum so far this year, one of the ill-fated ‘Sam Coins’ wrecked by the FTX scandal\n\nDogecoin (DOGE) was second at nearly 4%, with payments-focused network Solar (SXP) trailing with 3.4%. (Solar was rebranded from Swipe.io after Binance acquired the firm in 2020).\n\nEthereum Classic (ETC) and metaverse play The Sandbox (SAND) followed closely behind with about 3% each.\n\nSouth Korea watches XRP-SEC case\n\nTo explain XRP’s dominance in the peninsula nation, Aubert said its “largely due to the surge in XRP trading volume in late March and early April, when volumes in the Korean markets hit a multi-month high.”\n\nAlso during that time, markets were anticipating that Ripple’s contentious legal battle with the SEC was coming to a head. In an Apr. 3 Kaiko newsletter, analysts claimed traders were betting on Ripple to triumph, which sent the token soaring and led the entire altcoin sector to its peak year to date.\n\n‘Altcoin’ has become a derogatory term for crypto which isn’t bitcoin or ether — South Korea isn’t phased\n\nThe case persists without any clear indication for when it might find a conclusion. Ripple Labs CEO Brad Garlinghouse in January said he anticipated the case would be resolved within the first half of the year.\n\nAs for whether the top traded cryptocurrencies are trading at a premium — as they’ve done over the years from time to time — Aubert told Blockworks that “XRP has traded at an average premium of 1.8% in Korean markets over the past year.”\n\nBitcoin saw an average 1.4% premium across the same period.\n\nDogecoin is the worst performing of South Korea’s top five most-traded\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS94cnAtbGVkZ2VyLWhpdHMtbmV3LW1pbGVzdG9uZS1hcy1pdC1wcmVwYXJlcy10by1kZXRocm9uZS1ldGhlcmV1bdIBVWh0dHBzOi8vdS50b2RheS94cnAtbGVkZ2VyLWhpdHMtbmV3LW1pbGVzdG9uZS1hcy1pdC1wcmVwYXJlcy10by1kZXRocm9uZS1ldGhlcmV1bT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "XRP Ledger Hits New Milestone as It Prepares to Dethrone Ethereum - U.Today",
        "content": "XPPL Labs has made a breakthrough in its efforts to enhance XRP Ledger and establish it as a strong competitor to Ethereum. Its most recent accomplishment involves the successful conclusion of a comprehensive security audit on the Hooks amendment, a vital element that will expand the range of services available to users.\n\nAdvertisement\n\nIn partnership with cybersecurity firm FYEO, the cutting-edge framework underwent an external security evaluation. The primary aim of this audit was to obtain an impartial assessment of the overall security status of the amendment and identify any potential risks or vulnerabilities.\n\nThe assessment was conducted remotely from Jan. 31 to March 14, 2023, and the results were extremely positive. XRPL Labs has reported that no significant security issues were uncovered. Although a few moderate and several minor issues were detected, the team of developers promptly addressed and resolved them.\n\nWhat is the point?\n\nAccording to Wietse Wind, a prominent ecosystem developer, Hooks play a pivotal role in bridging the gap between XRPL and Ethereum. This amendment allows for the creation of customized logic and automation within the core ledger, granting transactions increased intelligence and convenience.\n\nBy incorporating the amendment, users gain the ability to add tailored on-ledger functionalities, exercise control over transaction flow, generate new transactions and retrieve information from the ledger. Hooks brings smart contract capabilities to XRP Ledger's foundational layer, significantly enhancing the ecosystem's inherent capabilities."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZGFpbHljb2luLmNvbS94cnAtbGVkZ2VyLWRldmVsb3Blci10b3V0cy1ob29rcy1rZXktZGV0aHJvbmUtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "XRP Ledger Developer Touts Hooks as Key to Dethrone Ethereum - DailyCoin",
        "content": "XRP developer Wietse Wind has sparked a discussion on the gap between XRPL and Ethereum ecosystems.\n\nHooks V3 testnet has already incorporated this technology.\n\nThe XRP community has been discussing token representation and genuine utility.\n\nRenowned XRP Ledger developer and contributor Wietse Wind recently took to Twitter to express his thoughts on the perceived disparity between the XRP Ledger (XRPL) and Ethereum or EVM ecosystems regarding introducing innovative features and concepts.\n\nXRPL Hooks: A Catalyst for Developer Creativity\n\nWind acknowledged the remarkable talent and creativity possessed by XRPL developers. Yet, he shed light on the obstacles they encountered when implementing core XRPL code and gaining approval for integrating ideas from side developers.\n\n🧵 Why is it always the ETH/EVM ecosystems coming up with new cool features and ideas, and why is the XRPL always playing catch up?\n\n\n\nBecause of smart contracts.\n\n\n\nYou don't have to change the entire blockchain protocol: you get a blank canvas, come up a new feature and build it. — WietseWind (🛠 Xumm @ XRPL Labs) (@WietseWind) June 1, 2023\n\nTo tackle this issue and ensure that the XRP Ledger remains competitive amidst the rapidly evolving landscape of decentralized technologies, Wind emphasized the significance of Hooks.\n\nAccording to Wind, Hooks will catalyze developers, giving them a blank canvas to unleash their ideas and creativity. This groundbreaking technology enables developers to imbue their own logic into accounts on XRPL protocol chains.\n\nWind also informed his audience that Hooks is already available on the Hooks V3 testnet, and a thorough security audit has been completed, with plans to release it soon.\n\nXRP Community Embraces Sidechains\n\nWind clarified that the side chain would incorporate a representation of XRP, dismissing any notion of issuing a separate token as redundant. He stressed the importance of ensuring genuine utility for any additional tokens that may be introduced.\n\nOther XRPL developers also joined the conversation, with Neil Hartner highlighting the strength of the XRPL ecosystem in avoiding smart contract bugs and subsequent thefts that have plagued Ethereum-based ecosystems.\n\nSame reason ETH/EVM ecosystems have repeatedly had millions stolen due to smart contract bugs but you never hear about that happening in the XRPL ecosystem. — Neil Hartner (@illneil) June 1, 2023\n\nAnother Ripple developer, who goes by the nickname “Bias Goose,” welcomed the emergence of a competing standard within the XRPL ecosystem. Filled with optimism, he expressed his belief in the success of both side chains and pledged his unwavering support to foster their growth.\n\nOn the Flipside\n\nThe perceived gap between the XRPL and Ethereum or EVM ecosystems may not be as significant as portrayed, pointing out that both platforms have their own unique strengths and areas of focus.\n\nWhile Hooks may offer developers more freedom and flexibility, it could introduce complexities and security risks if not implemented and monitored carefully.\n\nWhile commendable, the emphasis on avoiding smart contract bugs and thefts in the XRPL ecosystem should not overshadow the immense innovation and growth witnessed in Ethereum-based ecosystems.\n\nWhy This Matters\n\nBy providing a blank canvas for ideas and logic, Hooks has the potential to revolutionize the XRPL ecosystem and propel it forward in the ever-evolving world of decentralized technologies.\n\nTo learn more about Ripple CTO’s unveiling of an automated market maker network on XRPL, read here:\n\nRipple CTO Unveils Automated Market Maker Network on XRPL\n\nTo stay updated on the latest Bitcoin price updates, breakdowns, and projections, read here:\n\nDailyCoin Regular: Bitcoin Price Updates, Breakdowns, and Projections"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1nYXMtcmVhY2hlcy1uZXctbG93LXdoYXQtaXQtbWVhbnMtZm9yLWV0aC_SAU1odHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tZ2FzLXJlYWNoZXMtbmV3LWxvdy13aGF0LWl0LW1lYW5zLWZvci1ldGgvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Ethereum gas reaches new low – What it means for ETH - AMBCrypto News",
        "content": "ETH’s daily active addresses and daily transactions have declined of late.\n\nOn-chain metrics gave hope for a price uptick in the coming days.\n\nEthereum [ETH] has witnessed quite a few interesting developments over the last few days. At first glance, it seemed that network usage had increased, while the rest of the metrics suggested otherwise. Not only that, but ETH underwent a price correction as well.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nLooking at the bigger picture\n\nGlassnode Alert’s 5 June tweet revealed that Ethereum’s mean gas price had reached a one-month low at press time. A lower gas price can lure new users onto the network and, in turn, increase the number of transactions.\n\nHowever, that has not been the case, as other datasets revealed that Ethereum’s key network stats have declined. For instance, Artemis’ data revealed that ETH’s number of daily transactions had declined since the end of May.\n\nAdditionally, after spiking on 2 June, ETH’s daily active addresses also waned. The blockchain’s TVL and DEX volumes also followed the same trend, which did not look good for the blockchain’s overall health.\n\nEthereum has more challenges to tackle\n\nEthereum witnessed yet another price correction on 6 June. The correction caused ETH’s price to decline by nearly 3% in the last 24 hours. At press time, it was trading at $1,816.79, with a market capitalization of over $218 billion.\n\nThis happened after the Securities and Exchange Commission (SEC) sued Binance, one of the most prominent crypto exchanges.\n\nLookonchain’s data revealed an interesting whale transaction. As per the tweet, an ETH holder quickly dumped 10,265 ETH worth $19.1 million before the market crashed after the SEC sued Binance, with an average selling price of $1,861.\n\nWill the declining trend continue?\n\nCryptoQuant’s data gave hope for a trend reversal as a few on-chain metrics were positive. ETH’s exchange reserve was decreasing. A decline in the metric suggests that the token was not under selling pressure.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nMoreover, ETH’s taker buy/sell ratio was green, indicating that buying sentiment was dominant in the derivatives market. However, the recent price dip was accompanied by a surge in its trading volume, which could cause trouble over the coming days.\n\nMarket sentiment around Ethereum remained unaffected\n\nHowever, Santiment’s data revealed that ETH’s price action made news in the community, as evident from the rise in its social volume. Still, most mentions seemed to have been positive, as ETH’s weighted sentiment shot up."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmJpdHJhdGVzLmNvbS9uZXdzL3AvdHJvbi10cngtY2FuLW5vdy1iZS11c2VkLW9uLWl0cy1yaXZhbC1ibG9ja2NoYWluLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "TRON's TRX Token Has Been Bridged to the Ethereum Blockchain - Bitrates",
        "content": "TRX has been bridged to Ethereum, according to an announcement from TRON founder and former CEO Justin Sun.\n\nTRON’s TRX token has been introduced to the competing Ethereum blockchain thanks to an official effort to bridge the asset across the two networks.\n\nTRX Is Live On Ethereum\n\nJustin Sun, the founder and former CEO of TRON, wrote on Twitter:\n\n“[TRON] has now expanded its reach by going live on the Ethereum blockchain ... TRX is now fully accessible within the Ethereum ecosystem.”\n\nSun said that TRX was added to Ethereum via BitTorrent Bridge, a feature of TRON's BitTorrent Chain (BTTC). Sun and TRON began to acquire the BitTorrent brand in 2018 and have launched numerous products under the BitTorrent banner since then.\n\nTRX’s price has seemingly benefited from the news. The token's value gained 10% over 24 hours on June 2 — the same day that the feature was announced. Bitcoin and the rest of the crypto market saw gains of just 1.2% over the same 24-hour period.\n\nThough market speculation may have boosted prices, the actual use of TRX on Ethereum appears to be limited. Etherscan data indicated that just 29 addresses held the coin and that just 119 transfers took place on the first day of availability.\n\nEthereum Remains Dominant\n\nTRON's blockchain went live in 2018, about three years after Ethereum’s 2015 launch. The two chains share some features, such as support for custom tokens, support for decentralized applications, high transaction throughput, and staking support.\n\nThough both blockchains are generally considered competitors, Ethereum (ETH) is by far the more successful project. Its token, ETH, is the second largest cryptocurrency by market cap, with a total supply valued at $228 billion.\n\nTRON (TRX) has a considerably lower market cap of $7.5 billion but remains squarely among the top ten assets by market cap as it ranks at #7.\n\nEthereum (ETH) also has a higher trading volume. ETH had a $6.8 billion 24-hour trading volume on June 2, while TRON (TRX) reported a $580 million trading volume.\n\nTRON is also highly controversial. The most recent of those controversies concerns a lawsuit from the U.S. Securities and Exchange Commission (SEC). It alleged that Sun, TRON, and related parties illegally offered securities and engaged in wash trading."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8wNS9wb3B1bGFyLWFuYWx5c3Qtc2F5cy1saXRlY29pbi1vbi10aGUtZWRnZS1vZi1icmVha2luZy1vdXQtdXBkYXRlcy1vdXRsb29rLW9uLWV0aGVyZXVtLWhlcmUtYXJlLWhpcy10YXJnZXRzL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8wNS9wb3B1bGFyLWFuYWx5c3Qtc2F5cy1saXRlY29pbi1vbi10aGUtZWRnZS1vZi1icmVha2luZy1vdXQtdXBkYXRlcy1vdXRsb29rLW9uLWV0aGVyZXVtLWhlcmUtYXJlLWhpcy10YXJnZXRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Popular Analyst Says Litecoin on the Edge of Breaking Out, Updates Outlook on Ethereum – Here Are His Targets - The Daily Hodl",
        "content": "A widely followed crypto strategist believes that both Litecoin (LTC) and Ethereum (ETH) are on the verge of igniting breakout rallies.\n\nIn a new strategy session, Michaël van de Poppe says that Litecoin’s halving narrative could push the peer-to-peer payments network to a level last seen in December 2021.\n\nAccording to the crypto strategist, LTC is one resistance area away from a rapid price expansion.\n\n“Litecoin is doing absolutely great, too. It is on the edge of having a breakout…\n\nI think the halving is going to take place in (August), which means that we still have six to eight weeks before it takes place. I think having a very strong rally is definitely likely if it breaks through $100.\n\nIf it breaks through $100… so then I’m assuming we’re going to peak out around the area of $160 to $180.”\n\nAt time of writing, Litecoin is trading for $93.39, a slight decrease in the last 24 hours.\n\nVan de Poppe also says that the leading smart contract platform Ethereum is also in the same boat. According to the crypto strategist, ETH has a chance to take out its immediate resistance as long as it is trading above $1,800.\n\n“Once we start to take these out ($1,903), I think we can start accelerating towards $2,800. So as long as Ether stays above $1,800, I think this can actually go quite fast.”\n\nAt time of writing, Ethereum is worth $1,881, a fractional decrease on the day.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/C4Dart"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vaW5ub3ZhdGlvbi1jaXJjbGUvdGhlLWV0aGVyZXVtLXNoYW5naGFpLXVwZ3JhZGUtZXZlcnl0aGluZy15b3UtbmVlZC10by1rbm930gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "The Ethereum Shanghai upgrade: Everything you need to know - Cointelegraph",
        "content": "Ethereum has just had its first major upgrade, or “hard fork,” since transitioning to a proof-of-stake system. The Shanghai upgrade allows validators to withdraw the staked ether (ETH) that has been locked in the network.\n\nWhile the primary objective of the upgrade is to implement Ethereum Improvement Proposal-4895, which unlocks validator withdrawals, the changes include other significant upgrades that will impact Ethereum app developers and many of the chain’s users.\n\nThe evolution of the ethereum blockchain\n\nThe Ethereum blockchain network has undergone a number of upgrades and changes since its initial launch in July 2015. Some of the most significant:\n\nFrontier (2015): This was the initial release of the Ethereum network, allowing users to create and deploy their own smart contracts and decentralized applications.\n\nThis was the initial release of the Ethereum network, allowing users to create and deploy their own smart contracts and decentralized applications. Homestead (2016): This introduced several improvements, including security enhancements, gas optimizations and network stability improvements.\n\nThis introduced several improvements, including security enhancements, gas optimizations and network stability improvements. Metropolis (2017-2019): This was a two-part upgrade consisting of Byzantium and Constantinople. Byzantium introduced key improvements, such as a new mining algorithm, enhanced privacy features and a reduction in block rewards. Constantinople included updates to reduce transaction fees, increase efficiency and introduce new features like off-chain transactions.\n\nThis was a two-part upgrade consisting of Byzantium and Constantinople. Byzantium introduced key improvements, such as a new mining algorithm, enhanced privacy features and a reduction in block rewards. Constantinople included updates to reduce transaction fees, increase efficiency and introduce new features like off-chain transactions. Istanbul (2019): This introduced several new features, including the integration of zk-SNARKs (a form of zero-knowledge cryptography), a new mining algorithm and various protocol upgrades to improve efficiency and network security.\n\nThis introduced several new features, including the integration of zk-SNARKs (a form of zero-knowledge cryptography), a new mining algorithm and various protocol upgrades to improve efficiency and network security. Beacon Chain (2020): To ensure secure functioning, the Beacon Chain required 16,384 deposits of 32 staked ETH, which was successfully made in November 2020. As a result, the Beacon Chain started generating blocks on December 1, 2020, marking a crucial milestone toward realizing the Ethereum vision.\n\nTo ensure secure functioning, the Beacon Chain required 16,384 deposits of 32 staked ETH, which was successfully made in November 2020. As a result, the Beacon Chain started generating blocks on December 1, 2020, marking a crucial milestone toward realizing the Ethereum vision. Berlin (2021): This was a protocol upgrade that introduced several new features, including gas fee optimizations, enhanced security measures and a reduction in transaction costs for certain types of transactions.\n\nThis was a protocol upgrade that introduced several new features, including gas fee optimizations, enhanced security measures and a reduction in transaction costs for certain types of transactions. London (2021): This introduced EIP-1559, which changed the way transaction fees are calculated on the Ethereum network. This upgrade included a fee burn mechanism, which helps to reduce the overall supply of ETH and introduces a more predictable fee model for users.\n\nThis introduced EIP-1559, which changed the way transaction fees are calculated on the Ethereum network. This upgrade included a fee burn mechanism, which helps to reduce the overall supply of ETH and introduces a more predictable fee model for users. Paris (The Merge — 2022): The Paris upgrade was initiated when the proof-of-work blockchain achieved a terminal total difficulty of 58750000000000000000000, which occurred at block 15,537,393 on September 15, 2022. The upgrade was triggered on the next block and marked a major milestone for Ethereum as it transitioned from proof-of-work to proof-of-stake. Along with this shift, the upgrade included improvements to the execution clients, similar to Bellatrix on the consensus layer, enabling the execution clients to receive instructions from their connected consensus clients through the activation of a new set of internal API methods known as the Engine API.\n\nThese upgrades have brought numerous improvements to the Ethereum network across security, efficiency and scalability and have enhanced the functionality of the network.\n\nWhy is the upgrade important?\n\nThe upgrade is set to change the way the blockchain functions. One of the key changes is a reduction in gas fees for layer-2 solutions like Polygon and Optimism. This update aims to enhance the overall functionality of the blockchain while reducing transaction costs.\n\nAnother significant change is the ability for users to access and unstake their Ethereum tokens, which were previously locked in a smart contract when they became validators on the proof-of-stake-based Ethereum blockchain known as the Beacon Chain. This update provides users with more flexibility when managing their staked ETH tokens.\n\nThe Shanghai update brings technical improvements to the smart contract feature, which will help to position Ethereum as a major player, reflecting Ethereum’s ongoing efforts to improve its technology and enhance value to users.\n\nInstitutions preparing for upgrades\n\nThe Shanghai upgrade is expected to have a positive effect on the institutional adoption of cryptocurrencies as it addresses concerns about security and reliability. It is likely that this increased level of trust will lead to further investment in this space.\n\nAs Ethereum continues to evolve, institutions need to be aware of potential impacts on investments and understand how to prepare for upgrades.\n\nUpgrades can impact assets in a variety of ways:\n\nUpgrades are not always successful. The network may experience downtime or technical issues, temporarily impacting investment value.\n\nUpgrades may change the way the network operates, directly impacting assets (e.g., reducing the cost of transactions or increasing the efficiency of dApps).\n\nUpgrades may include new features and functionality, attracting new users and developers to the network—potentially increasing asset value.\n\nInstitutions preparing for an upgrade should review available documentation, including timelines for rollouts of updates, code commits and network changes. They should also ensure wallet and service compatibility.\n\nHow could the upgrade impact investors and ETH prices?\n\nThe option for full withdrawal may lead to a reduction in the number of validators on the network, but the extent of its impact will depend entirely on the number of validators who actually choose to withdraw. It is possible that the Total Value Locked on the Beacon Chain could decrease as stakers claim their rewards and unstake their assets, which could lead to a drop in ETH prices.\n\nOn the other hand, allowing the unstaking of ETH will attract more investors to staking, resulting in an increase in the amount of ETH staked. This is due to the rising popularity of liquid staking derivatives that provide stakers with liquidity flexibility while earning rewards on their staked ETH, without worrying about when they can withdraw assets.\n\nThis may increase the price of ETH, or at least help it recover further from the loss in value that occurred with the recent bank failures. The impact of these changes ultimately depends on the actions of the majority of validators regarding their rewards and unstaked assets.\n\nHowever, the daily withdrawal limit prevents a run on ETH withdrawals and will hopefully mitigate the effect of the upgrade on the market price of Ethereum. The market is notoriously hard to predict, and popular assumptions may prove to be inaccurate.\n\nThe Shanghai upgrade brings significant changes to Ethereum, marking an important moment for the crypto industry, reshaping the way Ethereum functions and granting stakers newfound accessibility to their ETH holdings.\n\nThe information provided here is not investment, tax or financial advice. You should consult with a licensed professional for advice concerning your specific situation.\n\nTammy Paola is a financial services, blockchain and crypto markets executive and thought leader.\n\nThis article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvY2FuLXlvdS1idXktZXRoZXJldW0tb24tY2FzaC1hcHAtMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Can you Buy Ethereum on Cash App (2023) - Watcher Guru",
        "content": "Ethereum has grown in popularity over time. Because of its rising usage, ETH has become a popular cryptocurrency and has evolved into the second-largest one. Even though there are multiple sites for buying, trading, and sending Ethereum, users wonder whether they can do the same on the Cash App.\n\nEven though the application is called “Cash App,” it allows users to send and receive Bitcoin. However, can users buy Ethereum using the app? Before that, let us get to know the app a little better.\n\nWhat is Cash App?\n\nThe Cash App, which was formerly known as Square Cash, is a mobile payment service that was released in 2013. It was developed by Square, Inc., with its services available in the US and the UK.\n\nUsing a smartphone app, users can send and receive money between and among friends, family, and companies. Peer-to-peer money transfers, the opportunity to buy and sell Bitcoin, a card to make purchases, and the choice to invest in stocks and cryptocurrencies are just a few of the features offered by the app.\n\nTo ensure smooth transactions, users may connect their bank accounts or debit cards to their Cash App account. Because of its straightforward layout and practical payment alternatives, it has become increasingly popular.\n\nAlso read: How to Stake BNB?\n\nCan you buy Ethereum on Cash App?\n\nThe app does not currently support the purchase of Ethereum. While users can buy Bitcoin and Bitcoin Cash through the app, Ethereum is not available for direct purchase on the platform.\n\nTo acquire Ethereum, individuals will need to utilize alternative cryptocurrency exchanges such as Coinbase or Gemini. Both of these offer Ethereum trading options. It’s important to note that cryptocurrency offerings can change over time, so it is recommended to verify the available options on the app to always double-check."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtbWlnaHQtcmVhY2gtMTE4MDAtdmFuZWNrLXByZWRpY3RzLXdoZW7SAUdodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRoLW1pZ2h0LXJlYWNoLTExODAwLXZhbmVjay1wcmVkaWN0cy13aGVuP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Might Reach $11,800, VanEck Predicts When - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nGlobal investment manager VanEck predicts that the price of ETH will reach $11,800 in 2030 and that ETH will become a competitor to U.S. Treasury bonds.\n\nAdvertisement\n\nVanEck discounted Ethereum at 12% to calculate its value in current dollars, finding that in the base case, the discounted price today is $5,359.71.\n\nVanEck, which manages a $69 billion ETF, predicts that the price of ETH will reach $11,800 in 2030, and ETH will become a competitor of U.S. Treasury bonds. The specific valuation methods are cash flow forecast and FDV calculation. https://t.co/bxTUJ3T4t3 — Wu Blockchain (@WuBlockchain) June 5, 2023\n\nThis is stated in a report written by Matthew Sigel, head of digital assets, and Patrick Bush, a research senior investment analyst for digital assets.\n\nIn this report, VanEck presents the results of its analysis and offers a clear valuation methodology for Ethereum, taking into account transaction fees, MEV and \"security as a service.\"\n\nAdditionally, it evaluates market share across key sectors and investigates Ethereum's potential as a store of value in the burgeoning cryptocurrency market.\n\nVanEck projects that by 2030, ETH network revenue will have increased from a yearly average of $2.6 billion to $51 billion. This is predicated on the assumption that ETH controls 70% of the market for smart contract protocols.\n\nAccording to VanEck researchers' base case, Ethereum would generate $51 billion in revenue during the fiscal year that ends on April 30, 2030. It subtracts 1% for a validator fee and 15% for the global tax rate from this amount to get cash flows to Ethereum of $42.90 billion.\n\nThus, it arrives at a base-case 2030 price target of $11,848 per token. This is discounted to a current price of $5,300 at a 12% cost of capital derived from ETH's recent beta.\n\nEthereum to see economic shift\n\nThe main objective of Ethereum's EIP-4844, often known as \"proto-danksharding,\" is to increase the scalability of Ethereum.\n\nIt is intended to be deployed during the Deneb-Cancun upgrade, which is scheduled to occur in the latter half of Q3 or the first quarter of Q4, 2023.\n\nAccording to IntoTheBlock, the introduction of EIP-4844 is expected to dramatically cut the costs associated with using Ethereum Layer 2 solutions, which are predicted to be at least 10 times lower and possibly even up to 100 times lower.\n\nAlthough there may be a short-term decrease in ETH burning due to the fee reduction on L2 solutions, the development of Ethereum's total economic activity is anticipated to lead to greater value accumulation in the medium term."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1nYXMtZmVlcy1jb29sLWRvd24tYWZ0ZXItbWF5LW1lbWVjb2luLWZyZW56edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Ethereum gas fees cool down after May memecoin frenzy - Cointelegraph",
        "content": "The average gas fee — transaction fee — on the Ethereum network has cooled substantially in the first week of June after reaching a multimonth high in May, owing to the memecoin frenzy and much maximal extractable value (MEV) bot activities.\n\nThe average gas fee has decreased to $7.34, an almost one-third drop from last month’s high of $20. In terms of gwei — a denomination of Ether (ETH) that represents one-billionth of one ETH — the daily median gas price has decreased to 24 gwei from a peak of almost 140 gwei last month, according to Dune Analytics.\n\nAverage gas fees on Ethereum in the past six months. Source: Dune Analytics\n\nThe memecoin frenzy started in late April and took center stage in May, leading to multiple new memecoins hitting the markets, such as Aped (APED), Bobo Coin (BOBO) and others. The dominance of memecoins in network activity was so high that it created an unusual shift in the top 10 gas-burning altcoins. Instead of ETH, Wrapped Ether (WETH), or Tether (USDT), memecoins such as Troll (TROLL), APED and BOBO became the top 10 spenders.\n\n⛽️ A highly unusual shift in top 10 gas burning #altcoins has emerged today. Instead of $ETH, $WETH, and $USDT being at the top of the fee distribution list, we're seeing new assets like $TROLL, $APED, and $BOBO among them. Read our latest deep dive. https://t.co/7SlmJ59k2m pic.twitter.com/Y2kaLKZTrL — Santiment (@santimentfeed) April 19, 2023\n\nAnother prominent reason for the rise in the Ethereum gas fees was the surging popularity of memecoins on decentralized platforms, with mainstream centralized exchanges taking longer to list them.\n\nMay was not just about the Ethereum memecoin frenzy; Bitcoin Ordinals also gained significant popularity. Ordinals enable decentralized storage of digital art on the Bitcoin blockchain. As a result, the Bitcoin network registered many new memecoins, with Pepecoin (PEPE) achieving a billion-dollar market capitalization.\n\nRelated: Bitcoin metrics to the moon: ATH for hash rate, daily transactions and Ordinals\n\nOrdinals were introduced in January, and by the end of May, the number of Ordinal inscriptions on the Bitcoin blockchain had surpassed 10 million. Total fees paid for Ordinals inscriptions rose 700% in May to currently sit at 1,639 Bitcoin (BTC).\n\nTotal Ordinals inscriptions on the Bitcoin network. Source: Dune Analytics\n\nWith the memecoin frenzy dying down, Ethereum gas fees have cooled, and Ordinals inscriptions have also decreased significantly.\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1iZWFyaXNoLWJyZWFrZG93bi0xNzc1L9IBT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1iZWFyaXNoLWJyZWFrZG93bi0xNzc1L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Bearish Breakdown – Why Drop Isn’t Over Yet - NewsBTC",
        "content": "Ethereum price gained bearish momentum below $1,860 against the US Dollar. ETH is showing a lot of bearish signs and might drop to $1,720.\n\nEthereum is down over 4% and trading well below $1,900.\n\nThe price is trading below $1,840 and the 100-hourly Simple Moving Average.\n\nThere was a break below a connecting bullish trend line with support near $1,900 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to move down toward the $1,720 and $1,700 levels.\n\nEthereum Price Drops Over 4%\n\nEthereum’s price failed to clear the $1,920 resistance. ETH started a strong decline below the $1,900 and $1,880 levels to move into a bearish zone, similar to Bitcoin.\n\nThe bears were able to push the price below the key $1,840 support. Besides, there was a break below a connecting bullish trend line with support near $1,900 on the hourly chart of ETH/USD. The price is down over 4% and it traded close to the $1,775 support.\n\nA low is formed near $1,777 and the price is now consolidating losses. It is slowly moving higher above the 23.6% Fib retracement level of the downward move from the $1,912 swing high to the $1,777 low.\n\nEther is now trading below $1,840 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,840 zone. The next major resistance is near the $1,850 level or the 50% Fib retracement level of the downward move from the $1,912 swing high to the $1,777 low.\n\nSource: ETHUSD on TradingView.com\n\nA proper move above the $1,840 and $1,850 resistance levels might send Ether toward $1,900. The next resistance sits near $1,920, above which Ethereum could rise toward $1,965. Any more gains above the $1,965 resistance zone might send the price toward the $2,000 resistance.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,840 resistance, it could continue to move down. Initial support on the downside is near the $1,775 level.\n\nThe next major support is near the $1,740 zone. If there is a break below the $1,740 support, the price could decline toward the $1,700 support. Any more losses may perhaps send the price toward the $1,660 level or even $1,640.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is below the 50 level.\n\nMajor Support Level – $1,775\n\nMajor Resistance Level – $1,850\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tNjctb2YtbmV3LW5mdHMtbWludGVkLWFyZS1wcm9maXRhYmxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Ethereum: 67% of New NFTs Minted Are Profitable - Watcher Guru",
        "content": "A recent report from Nansen revealed that 67% of new NFTs minted last month on Ethereum are currently in a profitable state. Well, this might seem to be an optimistic development, however, there’s a catch. Zooming out and shedding light on the whole picture, the blockchain data and research platform tweeted,\n\n“New NFT mints have been on a decline since summer, with NFTs minted in May being 65% lower than that in April, AND the lowest it’s been since June ’21.”\n\nTypically, whenever a new collection is minted, the percentage of new mints in profit is higher in the first month. However, that starts dropping after a few months, as illustrated below.\n\nAlso Read: Crypto, NFTs: UAE Central Bank Issues New AML, CTF Guidance for Institutions\n\nMacro state of affairs in the NFT market\n\nThe mint downtrend typically signifies that people are steering away from the NFT market currently. In fact, even secondary sales are on the drop. According to data from Dune Analytics, the monthly active traders have been dropping on markets like OpenSea. From January’s 359.2k, the number dipped down by more than half, to 149.4k, in May.\n\nOn the Ethereum blockchain, the NFT sales have dropped by more than 15% over the past month. Specifically, the 30-day sales volume stood at $416.8 million. The number of buyers and sellers has also been on a downtrend. Specifically, they’ve diminished by 30-50% each in the same period and reflected respective values of 65.5k and 55.4k at press time.\n\nDespite the not-so-appealing trends, Ethereum is currently the top blockchain in terms of sales volume. Other counterparts like Bitcoin, Solana, and Polygon rank lower, for they’ve only managed to settle $40 million to $188 million in volume in the same monthly window.\n\nAlso Read: Bitcoin Flips Cardano, Solana to Claim 2nd Spot in NFT Sales"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdS50b2RheS9lbG9uLW11c2stZ2l2ZXMtZXBpYy1kb2dlY29pbi1yZXBseS10by10d2l0dGVyLWZvdW5kZXItd2hvLXNheXMtZXRoZXJldW0taXMtc2VjdXJpdHnSAWhodHRwczovL3UudG9kYXkvZWxvbi1tdXNrLWdpdmVzLWVwaWMtZG9nZWNvaW4tcmVwbHktdG8tdHdpdHRlci1mb3VuZGVyLXdoby1zYXlzLWV0aGVyZXVtLWlzLXNlY3VyaXR5P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Elon Musk Gives Epic Dogecoin Reply to Twitter Founder Who Says Ethereum Is Security - U.Today",
        "content": "In the midst of the SEC's lawsuit against Coinbase, industry experts and prominent figures have shared their opinions on the matter. Pierre Rochard, vice president of research at Riot Platforms, suggested that Coinbase refocus its attention on Bitcoin.\n\nAdvertisement\n\nEchoing Rochard's sentiment, Twitter founder Jack Dorsey, known for his advocacy of Bitcoin, also expressed support for prioritizing the main cryptocurrency amid regulatory challenges. The founder of Twitter further emphasized the scarcity of censorship-resistant technologies at scale, including Tor, Bitcoin and Nostr.\n\nElon Musk, the world's richest man and current owner of Twitter, promptly responded to Dorsey's pro-Bitcoin stance with a concise yet attention-grabbing tweet, injecting his characteristic wit into the conversation. Musk, who has previously expressed interest in Dogecoin, a meme-inspired cryptocurrency, tweeted: \"DOGE ftw,\" an abbreviation for \"for the win.\" With this simple reply, Musk emphasized his ongoing enthusiasm for Dogecoin, adding an interesting twist to the ongoing discussion surrounding Bitcoin's prominence.\n\nWhile Dorsey has yet to respond directly to Musk's tweet, he made a notable comment regarding Ethereum. In response to a question about ETH's classification, Dorsey affirmed its status, implying that he believes Ethereum should be considered a security. This statement adds a new layer of complexity to the ongoing debates surrounding the regulatory treatment of cryptocurrencies and may spark further discussions within the industry."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvd2lsbC1ldGhlcmV1bS1nby11cC1pbi0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Will Ethereum Go Up in 2023? - Watcher Guru",
        "content": "The Ethereum network has made the switch from proof-of-work mining to proof-of-stake mining. The transition was completed successfully on September 15, 2022. Additionally, the blockchain went through some major changes as validators replaced the miners.\n\nRecently, the much-awaited Shapella upgrade went live, allowing these speakers to withdraw their staked Ethereum 2.0. Additionally, with numerous developments on the Ethereum blockchain, let us learn about ETH a bit more.\n\nAlso read: How To Change Slippage Tolerance on PancakeSwap?\n\nEthereum in a nutshell\n\nVitalik Buterin built the decentralized blockchain platform Ethereum in 2015, along with the Ethereum Foundation, to support the development and execution of smart contracts and decentralized applications (dApps). Additionally, it has developed to become one of the biggest and most popular cryptocurrencies in the world. Ethereum is distinguished from Bitcoin by its programmability.\n\nThe blockchain has grown to accommodate a wide range of applications. Developers on the ETH network can design decentralized applications by using smart contracts, which are self-executing contracts with predefined rules. Additionally, over time, ETH has grown to be the second-largest cryptocurrency in the world.\n\nAlso read: Is MetaMask Safe (2023)?\n\nSource: CNN\n\nETH Price Performance\n\nSome of the early investors in ETH enjoyed a mind-boggling ROI. Early investors witnessed substantial rewards when the Ethereum coin, trading at $0.4209 in 2015, surged in value.\n\nETH touched an all-time high of $4,891.70 on November 16, 2021, according to CoinMarketCap data. Investors enjoyed an ROI of 64222.32%.\n\nSource: CoinMarketCap\n\nWill Ethereum Go Up in 2023?\n\nCryptocurrency experts at Changelly have predicted the price of ETH for 2023. Analysts expect ETH to reach a minimum of $1,533 and a maximum of $1,771. Experts also predict Ethereum’s average cost to sit around $2,009.\n\nWhether Ethereum can go up in 2023 can vary greatly depending on market sentiment. The SEC’s crackdown on cryptocurrency exchanges, including Binance and Coinbase, has sent shockwaves through the cryptocurrency market. This has also affected the price of major crypto assets. However, if the market proves to be bullish moving forward, ETH’s price can shoot up."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmdlZWt3aXJlLmNvbS9wYXJ0bmVyLWNvbnRlbnQvY2FuLWNhcmRhbm9zLXByaWNlLWhpdC0xMDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Can Cardano's Price Hit $100? – GeekWire - GeekWire",
        "content": "Cardano is one of the most popular cryptocurrencies today. A dedicated community of investors and users back this long-standing top-10 cryptocurrency. With smart contracts enabled on Cardano, we’re seeing more DeFi, NFT, and other projects choosing Cardano.\n\nEven with its many advantages, ADA’s price has decreased since the mainnet launched in 2017. After surviving the bear market of 2018-2019, the coin enjoyed a great rally in 2021.\n\nThere was about $95 billion in market capitalization when Cardano reached its all-time high at $3.10. On the other hand, some Cardano investors think the upside is much higher, and $100 is a common price target. Can it happen?\n\nBefore we decide whether the Cardano coin price can hit $100, let’s talk about how it compares to Ethereum’s market cap.\n\nCardano – Proof-of-Stake smart contract platform\n\nCharles Hoskinson, the co-founder of Ethereum, launched the Cardano blockchain project in 2015. An Initial Coin Offering (ICO) raised nearly $62 million for Cardano’s development.\n\nThe Cardano mainnet launched in September 2017 with limited functionality. Cardano got a series of upgrades over the next few years that improved its decentralization and added smart contracts and Proof-of-Stake.\n\nThe Cardano blockchain uses ADA as its native asset. The ADA token helps the network pay transaction fees, incentivizing validators to keep it secure.\n\nCardano’s ambitious roadmap and methodical development approach are heavily influenced by peer review. The Cardano blockchain’s consensus protocol, Ouroboros, is a provably secure Proof-of-Stake protocol.\n\nCardano uses the EUTXO (Extended Unspent Transaction Output) model for its transactions, which makes it unique. The smart contract language Cardano uses, Plutus, is suited to formal verification because it’s written in Haskell.\n\nCan Cardano reach $100?\n\nCardano should be compared to Ethereum if you’re looking for a smart contract platform. Ethereum was worth $550 billion at its peak.\n\nCardano’s native asset ADA is currently circulating at approximately 34 billion coins. If ADA were $100, Cardano’s market cap would be $3.4 trillion, about six times greater than Ethereum.\n\nADA Price Implied Market Cap $5 $170 Billion $10 $340 Billion $20 $680 Billion $50 $1.7 Trillion $100 $3.4 Trillion\n\nThe calculations say there are 34 billion ADA in supply.\n\nCardano’s low adoption makes it hard to match Ethereum’s market capitalization and surpass it by a factor of 6. Cardano users make about 62,000 transactions daily, while Ethereum users make about 950,000.\n\nThe market cap for all cryptocurrencies was $2.9 trillion in November 2021. By January 2023, Cardano will also have $3.4 trillion in market capitalization at $100 per ADA. Apple has a market cap of $2.2 trillion, Saudi Aramco has a market cap of $1.9 trillion, and Microsoft has a market cap of $1.8 trillion.\n\nADA has a hard time reaching $100 based on these two comparisons alone. An asset with a market cap of $12.7 billion must rise 270x to reach $100. ADA can only reach $100 by reducing its supply. Since there’s no burning mechanism, ADA’s supply will only decrease slightly in the future.\n\nCardano price prediction – Will Cardano rise?\n\nThe price of Cardano still has the potential to rise, even though it seems unlikely in practical scenarios.\n\nThe project has a lot of key milestones to hit, so Cardano still has lots of upside potential. There are five major phases in Cardano development, also known as eras. Here’s how they work:\n\n● Byron – Foundation\n\n● Shelley – Decentralization\n\n● Goguen – Smart contracts\n\n● Basho – Scaling\n\n● Voltaire – Governance\n\nWhile progress along these roadmap phases is sometimes linear, the Cardano project is now in the smart contracts phase. Currently, the project is focusing on improving Cardano’s smart contract capabilities.\n\nConclusion\n\nCardano does not have a realistic chance of hitting $100 since that would mean a market cap of about $3.4 trillion. There needs to be more adoption or potential for Cardano to speculate on such a valuation.\n\nCan Cardano go high? Well, some crypto investors do not think Cardano is dead, but if there is a major cryptocurrency bull run shortly, it will reach and surpass its current high. It’s more likely to happen if Cardano developers keep executing their ambitious roadmap.\n\nEven though the crypto market is cyclical, no cryptocurrency is guaranteed to reach its all-time highs. Crypto projects peaked during the 2017 bullish run and still have not matched their all-time highs.\n\nDisclaimer: GeekWire newsroom and editorial staff were not involved in the creation of this content.."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS95b3Utc2hvdWxkbnQtaWdub3JlLXRoaXMtY3J5cHRvLXRyYWRpbmctcGFpci1oZXJlcy13aHnSAUpodHRwczovL3UudG9kYXkveW91LXNob3VsZG50LWlnbm9yZS10aGlzLWNyeXB0by10cmFkaW5nLXBhaXItaGVyZXMtd2h5P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "You Shouldn't Ignore This Crypto Trading Pair, Here's Why - U.Today",
        "content": "Crypto trading pairs often provide valuable insights into market sentiment and dynamics. One such pair that has been gaining attention is Ethereum (ETH) and Bitcoin (BTC). The ETH/BTC pair has been showcasing quite a unique behavior, becoming a significant risk indicator on the crypto market. If you are a crypto trader or investor, this is a pair you should not ignore. Here's why.\n\nAdvertisement\n\nOver the past 60 days, the ETH/BTC pair has seen a 12% increase, an impressive performance given the current market volatility. Moreover, its Exponential Moving Average (EMA), a popular technical indicator used by traders to gauge market trends, is about to perform a golden cross. This occurs when a short-term moving average crosses above a long-term moving average, often seen as a bullish signal in technical analysis.\n\nBut it is not just the technical indicators that make this pair intriguing. The ETH/BTC pair's performance has been hinting at a broader shift in the crypto market. Ethereum is gradually cementing its place as a potential safe haven asset in the crypto landscape. Traditionally, Bitcoin has held the safe haven mantle, but recent trends suggest Ethereum may be ready to share the podium or even take the lead.\n\nInterestingly, Ethereum has begun to outperform Bitcoin during certain risk-off events, a phenomenon rarely observed on the crypto market. This shift could suggest growing investor confidence in Ethereum's long-term prospects, bolstered by the successful upgrades and the ecosystem's ongoing development.\n\nNonetheless, the ETH/BTC pair's performance offers an essential viewpoint for assessing the health and direction of the crypto market. By tracking its trend, traders can gain valuable insights into the relative strength of these two dominant cryptocurrencies and better inform their investment decisions."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vY29pbmdhcGUuY29tL2NmdGMtZXRoZXJldW0tY3J5cHRvLW5ld3MtYmluYW5jZS1jb2luYmFzZS_SAURodHRwczovL2NvaW5nYXBlLmNvbS9jZnRjLWV0aGVyZXVtLWNyeXB0by1uZXdzLWJpbmFuY2UtY29pbmJhc2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "CFTC Chair Says Ethereum Is Commodity Amid SEC Lawsuits - CoinGape",
        "content": "Crypto Market News: US Commodity Futures Trading Commission (CFTC) Chairman Rostin Behnam on Tuesday reiterated his stance that Ethereum is a commodity and not security. This comes at a time when the U.S. Securities and Exchange Commission (SEC) filed back to back complaints against two of the world’s top crypto exchanges, Binance and Coinbase over violation of financial regulations. The SEC had been emphasizing that crypto businesses operating in the United States come forward and register digital asset trade related operations with it. However, there is no clarity as to which laws would the crypto assets fit under.\n\nAlso Read: “We Don’t Need More Digital Currencies”: SEC Chairman Gary Gensler\n\nadvertisement\n\nGary Gensler, the SEC Chair had recently stirred a controversy in the crypto market by saying that everything other than Bitcoin is a security. He maintains that Bitcoin is not a security but a commodity under the CFTC’s jurisdiction. On the contrary, CFTC Chair Behnam had been saying that Ethereum qualifies as a commodity. This confusion and uncertainty, as things stand, is still not resolved although efforts are on with a draft bill to categorize which assets are securities and commodities.\n\n“Ethereum Is A Commodity”\n\nSpeaking in a US House Committee hearing on “The Future of Digital Assets: Providing Clarity for Digital Asset Spot Markets,” Behnam reiterated his stance on Ethereum being a commodity. The question arose when Congressman Austin Scott said crypto assets were clearly not securities and that the assets should be regulated by the CFTC and not the SEC. The CFTC Chair replied,\n\nInterestingly, the debate around altcoins being securities Vs commodities emerged on Monday with the SEC Binance lawsuit mentioning as many as 10 altcoins including Solana (SOL), Cardano (ADA), Polygon (MATIC) saying they were being traded on the platform as securities.\n\nAlso Read: Elon Musk Shills Dogecoin as SEC Designates Top Cryptos as Securities"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtY3J5cHRvLWxpcXVpZGF0aW9ucy1oaXQtMzExLW1pbGxpb24td2hhdHMtbmV4dC0yMDIzMDYwNjA0MTDSAZ0BaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdG9wLTMtcHJpY2UtcHJlZGljdGlvbi1iaXRjb2luLWV0aGVyZXVtLXJpcHBsZS1jcnlwdG8tbGlxdWlkYXRpb25zLWhpdC0zMTEtbWlsbGlvbi13aGF0cy1uZXh0LTIwMjMwNjA2MDQxMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Crypto liquidations hit $311 million, what’s next? - FXStreet",
        "content": "Share:\n\nBitcoin price liquidations cross $100 million after the SEC’s recent lawsuit against Binance.\n\nEthereum price could retest the $2,000 psychological level if sidelined buyers join the fray.\n\nRipple price to get boring for a few days before XRP reveals its directional bias.\n\nBitcoin (BTC) price has suffered a fatal setback after the recent lawsuit that the Securities and Exchange Commission (SEC) filed against Binance and its founder, Changpeng “CZ” Zhao. The suit caused the markets to cascade, triggering a massive sell-off and causing roughly $311 million in liquidations across the entire crypto landscape.\n\nBTC Liquidations\n\nOut of the $311 million in liquidations, BTC takes the largest share with $112.27 million in liquidations, Ethereum (ETH) sits at $37.92 million and Ripple (XRP) at $6.72 million. Other altcoins make up roughly $50.16 million.\n\nLiquidations heatmap\n\nAlso read: Binance responds to SEC claims, plans to defend the platform vigorously\n\nBitcoin price remains rational\n\nBitcoin (BTC) price action over the last 50 days has set up four distinctive lower highs and lower lows. Connecting these swing points using trend lines reveals a falling wedge formation. This technical formation is a bullish setup, but considering BTC has breached the lower trend line, investors need to wait for more information.\n\nAdditionally, Bitcoin price has come close to retesting $25,290, which is the midpoint of the 59% rally witnessed between March 10 and March 27. Hence, the likely direction Bitcoin price will head next is south to find a stable support level. The $25,290 barrier will likely provide some respite from bears.\n\nA recovery inside the falling wedge could see Bitcoin price try and retest the upper limit of the wedge at roughly $27,395. A flip of this hurdle into a support floor could trigger a swift move to $30,048. This uptick is likely going to target the buy-side liquidity resting above this level.\n\nBTC/USD 1-day chart\n\nA bearish case scenario for Bitcoin (BTC) price will include BTC sliding lower to retest the 62% and 70.5% retracement levels of the 59% rally at $23,905 and $22,925, respectively. While in the short-term, this move might seem bearish, a revisit to these levels will be an opportunity for long-term holders to accumulate BTC.\n\nRead more: Bitcoin Weekly Forecast: BTC delays inevitable crash to $25,000\n\nEthereum price could dip lower before a bounce\n\nEthereum (ETH) price currently sits below a critical support level at $1,817, leaving investors guessing where it will head next. A recovery of ETH above the aforementioned level, combined with Bitcoin’s bounce, sounds plausible and could trigger a rebound rally for Ether.\n\nIf successful, Ethereum price could continue its ascent and target the $2,028 hurdle.\n\nETH/USD 12-hour chart\n\nIf the after-effects of the recent sell-off continue to impact the crypto markets, Ethereum (ETH) price could slide lower. In such a case, a retest of the $1,703 support level seems likely. The aforementioned level and the zone, extending from $1,563 to $1,478, are places where long-term holders are likely to accumulate ETH.\n\nRead more: Ethereum exchange supply hits multi-year lows, VanEck analysts predict a rally to $11,800\n\nRipple price to move sideways before revealing its move\n\nRipple (XRP) price has successfully hit targets of the inverse head-and-shoulders, as forecasted in previous publications. The recent sell-off pushed the XRP price into an inefficiency above the $0.483 support level.\n\nGoing forward, Ripple price is likely to consolidate between the $0.483 and $0.515 support levels before making a move to the upside. A successful flip of the $0.515 hurdle is likely to trigger a sweep of the $0.548 hurdle to collect the buy-side liquidity.\n\nXRP/USD 12-hour chart\n\nA failure to move higher after consolidation will signal a waning bullish momentum for Ripple (XRP) price. In such a case, a breakdown of the $0.483 support floor will be the obvious outcome. A further spike in selling pressure could send XRP down to retest the $0.466 barrier.\n\nAlso read: Pro-XRP attorney says Ripple has 25% chance of winning against SEC, Judge could announce verdict by September"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby8xNDM1ODUvaGF1bi12ZW50dXJlcy1sZWFkcy1hcmd1cy1sYWJzLTEwbS1yYWlzZS1ldGhlcmV1bS1nYW1pbmctbmV0d29ya3PSAWFodHRwczovL2RlY3J5cHQuY28vMTQzNTg1L2hhdW4tdmVudHVyZXMtbGVhZHMtYXJndXMtbGFicy0xMG0tcmFpc2UtZXRoZXJldW0tZ2FtaW5nLW5ldHdvcmtzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Haun Ventures Leads Argus Labs' $10M Raise for Ethereum Gaming Networks - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto gaming startup Argus Labs has raised $10 million in seed funding in a round led by Haun Ventures, the firm announced today, with Robot Ventures, Anagram, Dispersion Capital, and Alchemy also participating in the round.\n\nThe raise also included angel investors like Gitcoin co-founder Scott Moore, Sandbox VR co-founder Siqi Chen, and Osmosis co-founder Sunny Aggarwal in the mix, to name a few.\n\nArgus Labs' flagship product is its World Engine, a software development kit (or SDK) that will enable game developers to create their own dedicated layer-2 blockchain networks using zero-knowledge proofs (ZKP) on Ethereum. Developers can customize their chains and decide exactly to what extent they want their game to live “on-chain.”\n\nAD\n\nAD\n\nZero-knowledge proofs verify zk-Rollup transactions, which is a technical innovation in crypto that allows more transactions to be processed simultaneously to help scale networks and add more transaction privacy.\n\nArgus founder Scott Sunarto co-created Dark Forest, a crypto game launched back in 2020 that uses ZKPs. He believes that many more game elements can be on-chain than the average person might think.\n\nIn an interview with Decrypt, Sunarto said that World Engine will be able to support user-generated content through the blockchain and allow even more complex games like massively multiplayer online role-playing games (MMORPGs) to exist fully on-chain.\n\nAnd in a time following the sudden rise and fall of play-to-earn smash Axie Infinity—when many Web3 game developers are shying away from going fully crypto and instead offering optional NFTs—Sunarto is doubling down on the new ways that crypto elements can be used in video games.\n\n“Right now, the only ingredients that you’re really putting on-chain as a game developer are the NFT assets,” Sunarto told Decrypt. “But now, if you have more parts of the games on-chain, you’re essentially giving more ingredients for players, for other developers to really extend and build on top of the game.”\n\nAD\n\nAD\n\nSunarto envisions blockchain games in which players creating user-generated content (UGC) are more crypto-literate, and can code their own smart contracts (which power decentralized apps) to add new game elements and features.\n\nAnd crypto scaling features like sharding will be able to help adapt games for growing audiences and effectively add new servers, Sunarto said. The goal is to offer game developers customization while empowering players to develop their own communities and initiatives around Web3 games.\n\n“They built their own guild system,” Sunarto said of Dark Forest’s players, who also formed their own DAOs or decentralized communities around the title. He added that players took the initiative to create their own smart contract and “pool their resources together” in the game.\n\nWhen it comes to other blockchains protocols like Solana, Avalanche, and even Ethereum scaling network Polygon, Haun Ventures suggested that none are optimized for gaming. Argus is attempting to fill that claimed void.\n\n\"Current blockchains are not designed to run games,” lead investor Haun Ventures said in a statement. “Scott and team, with our support, envision the World Engine as an open source, connected layer-2 of sharded blockchains that will serve as the backbone for the 'Internet of Games.'\""
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDYvMDYvZXgtdHdpdHRlci1jZW8tc2F5cy1ldGhlcmV1bS1pcy1hLXNlY3VyaXR5LWFza3MtY29pbmJhc2UtdG8tZm9jdXMtb24tYnRjLWFtaWQtc2VjLXN1aXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "EX-Twitter CEO Says Ethereum is a Security, Asks Coinbase to Focus on BTC Amid SEC Suit - The Crypto Basic",
        "content": "Former Twitter CEO Jack Dorsey says Ethereum (ETH) is a security while supporting a Bitcoin-focused approach for Coinbase amid the SEC lawsuit.\n\nIn a noteworthy development, Jack Dorsey, the founder and former CEO of Twitter, has publicly stated his belief that Ethereum (ETH) should be classified as a security amid the latest lawsuit against the US-based crypto exchange, Coinbase, alleging the exchange’s unregistered operations.\n\n- Advertisement -\n\nIn addition, given Coinbase’s entanglement with the US securities regulator, Dorsey, who is widely known as a Bitcoin (BTC) maximalist, agreed with a statement that the American exchange should pivot to a Bitcoin-only business model.\n\nSpecifically, Pierre Rochard, the VP of Research at Riot Platforms, a prominent Bitcoin mining firm, shared a 2015 tweet from Coinbase CEO in which he remarked:\n\n“Ripple, Stellar, and Altcoins are all distractions. Bitcoin is way too far ahead. We should be focused on Bitcoin and sidechains.”\n\nQuoting Armstrong’s statement, Rochard suggested that Coinbase should pivot back to being focused on Bitcoin, to which the former Twitter CEO expressed a 100% agreement.\n\n- Advertisement -\n\nCoinbase’s Case with the SEC\n\nInterestingly, the discussion surrounding Coinbase’s focus on BTC occurred shortly after the US Securities and Exchange Commission (SEC) filed a lawsuit against the exchange.\n\nThe lawsuit accuses Coinbase of operating as an unregistered national securities exchange, broker, and clearing agency, as well as failing to register its crypto asset staking-as-a-service program.\n\nThis development particularly stirred the crypto community, given that the SEC had filed a civil action against Binance, a top rival of Coinbase, barely 24 hours before launching the movement against Coinbase, as reported by The Crypto Basic.\n\nIndustry leaders such as Charles Hoskinson, the founder of the Cardano network, have described the SEC’s recent action as a threat to financial freedom. Hoskinson particularly believes the SEC aims to replace mainstream crypto assets with a government-controlled CBDC."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmFmci5jb20vdGVjaG5vbG9neS90aGUtaW5zaWRlLXN0b3J5LW9mLWV0aGVyZXVtLXMtcHJpY2UtcmVjb3ZlcnktMjAyMzA1MTAtcDVkN2Jz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "How ethereum survived its biggest test - The Australian Financial Review",
        "content": "“It was a major change, but there’s a lot of talent and trust in the ethereum team,” said Richard Galvin, the co-founder and chief executive officer of DACM. “We’d been staking for several months and things were going pretty well.”\n\nEach pledge helped secure the ethereum network, which was handling tens of millions of transactions per day, and in return, those “pledgers”, would generate a kind of interest rate.\n\nBut those behind the ethereum protocol – a group of developers called the Ethereum Foundation – had restricted those rewards until the underlying technical upgrades were secure enough to open the floodgates.\n\nOn April 12, the developers glued to their screens were awaiting the opening of those floodgates.\n\n“It was a long time coming, the upgrade had been pushed back many times as they tested everything,” said Sally Yu, investment associate at King River Capital, a web3 venture capital fund based in Sydney.\n\n“But finally users were going to be able to withdraw ether from the network. It’s quite a milestone in the development of this technology.”\n\nAdvertisement\n\nBitcoin vs ethereum\n\nEthereum, which operates like a global computer, allows developers to publish and execute applications powered by smart contracts. These are programmable scripts that facilitate the flow of digital assets.\n\nSince its inception in 2015, ethereum had operated like its older crypto-cousin bitcoin.\n\nThousands of computers had been crunching through mathematical puzzles to secure and verify an enormous, decentralised ledger that tracked the movement of these immutable but programmable digital assets.\n\nRather than a bank monitoring and recording money transactions, a decentralised network of computers did. And rather than individual dollars, they were tiny computer programs.\n\nBut in 2020, the Ethereum Foundation decided to change this model. Rather than rely on thousands of “miners” in the Proof-of-Work system, they wanted to reduce the power consumption and move to what’s known as a Proof-of-Stake system.\n\nAdvertisement\n\nInstead of crunching through mathematical problems, chewing up power, ethereum would invite users of the network to “pledge” their money – in the form of ether – to verify and confirm blocks of transactions as they passed across the ledger.\n\nThese pledges were made through a kind of server called a “node”. Theoretically, anybody could set up a node, and across Australia several companies were quick to try it out.\n\nValidating transactions\n\nDavid Lavecky, chief executive of Canvas Digital, a payments provider helping the Reserve Bank of Australia with its crypto experiments, had previously been a large ethereum miner.\n\n“But when the mining stopped all that equipment became obsolete,” Lavecky said. “But it didn’t bother us too much because this new mechanism is much more efficient.”\n\nCanvas was quick to begin running nodes out of Sydney, as were DACM and a distributed ledger technology provider called Trovio.\n\nAdvertisement\n\nAnd The Australian Financial Review spoke with two individual software engineers in Brisbane who confirmed they were running one node apiece from their respective offices.\n\nAs it stands, there are roughly 156 validator nodes running across Australia, which account for about 2.2 per cent of all Ethereum activity. In total, there are around 7211 nodes, with the bulk of validators coming from the United States and Germany.\n\nIn return for correctly verifying the millions of ethereum transactions that take place every day, node validators receive a financial reward, paid in ether.\n\nBut if you, or your node, incorrectly verified a transaction block, your “pledged” stash of cryptocurrency would be burnt and lost. The idea was to hold the money to ransom and incentivise participants to keep the system honest.\n\nIt’s also touted as a deflationary system.\n\n“There’s an inbuilt mechanism that means a certain amount of ether is burned as part of the transaction. This helps stabilise the total circulation,” Canvas’ Lavecky said.\n\nAdvertisement\n\nTo participate, each participant is required to stake at least 32 ether, which was worth about $60,000 at the time, or pool funds through some third parties.\n\nIn September last year, the switch to the proof-of-stake system took place. The Ethereum mainnet merged with the Beacon Chain, the original “proof-of-stake” blockchain, and the miners were switched off.\n\nThe rush of those wanting to sign up to validate the new network was immediate. Within two months, 15 million ether – worth about $US18 billion at the time – was staked.\n\nAt the time, the network calculated it would begin paying yields returning about 5 per cent on average per validator.\n\nBut the Ethereum Foundation, run by the blockchain’s Russian-Canadian creator Vitalik Buterin, held back on allowing the participating nodes to withdraw their rewards.\n\nAt the time, Buterin and his team outlined the risk of placing too much stress on the network all at once.\n\nAdvertisement\n\nBut after many months of work, and a steady stream of new “stakers” signing up to secure and benefit from Ethereum’s new ‘proof of stake’ system, the Shanghai upgrade was ready to launch.\n\nYouTube party\n\nThat’s what brings us to April 12. And the thousands of node participants were able to begin withdrawing their staking rewards. At the time, there was about $US36.7 billion of ether locked up for staking.\n\nAs the minutes ticked by, the Ethereum Foundation was reminding participants that they needed to have upgraded their software to be compatible with the changes.\n\nA watch party on YouTube sprang up, with more than 25,000 onlookers from around the world. Buterin and the developer team took questions. And while it was mostly a celebratory mood, there was an underlying tension.\n\nThe price of ethereum, which had been under pressure for months thanks to the collapse of high-profile crypto exchanges like FTX and Celsius, could take a hit if things didn’t go to plan.\n\nAdvertisement\n\nOne analyst said: “This could still be volatile. There is a queue forming for [ether] withdrawals, and the looming sell pressure from Kraken, Celsius and others – that have to un-stake.”\n\nBut as 8.30am ticked over, the software upgrade loaded, and it was done. The YouTube watching party broke out into applause and cheers.\n\nA musician called Jonathan Mann launched into a song, singing the YouTube comments out in a real-time performance.\n\n“For something that was securing billions of dollars, with huge teams working on it all around the world, it all went as expected,” Lavecky said.\n\n“I suppose you can say it was a bit of anticlimax, though a very welcome one.”\n\nThe price of ethereum began rallying immediately. Hours after the upgrade, it rallied above $US2,000 for the first time in almost a year. In the following days, it jumped higher and higher.\n\nAdvertisement\n\nThat laid to rest concerns that potential heavy selling pressure would hit the market after the Shanghai upgrade because locked ether would suddenly flood into the market.\n\nBut the withdrawal process doesn’t happen instantly or overnight, and much of the staked ether was sitting at a loss.\n\n“The amount of ETH entering the market from Shanghai withdrawals is much lower than what was previously expected,” said Matt Maximo, research analyst at Grayscale."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZWplY3Rpb25zLTE5MjAv0gFIaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXJlamVjdGlvbnMtMTkyMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price at Clear Risk of Further Losses After Multiple Rejections - NewsBTC",
        "content": "Ethereum price started a fresh decline from the $1,920 resistance against the US Dollar. ETH is moving lower and might dive below the $1,850 support.\n\nEthereum is struggling to gain bullish momentum above the $1,920 resistance.\n\nThe price is trading below $1,900 and the 100-hourly Simple Moving Average.\n\nThere was a break below a key bullish trend line with support near $1,895 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to move down toward the $1,840 and $1,800 levels.\n\nEthereum Price Faces Another Rejection\n\nEthereum’s price attempted another increase above the $1,900 resistance. However, ETH struggled to clear the $1,920 resistance and started another decline, similar to Bitcoin.\n\nThere was a move below the $1,900 support zone. The bears pushed the price below the 50% Fib retracement level of the upward move from the $1,838 swing low to the $1,914 high. Besides, there was a break below a key bullish trend line with support near $1,895 on the hourly chart of ETH/USD.\n\nEther is now trading below $1,900 and the 100-hourly Simple Moving Average. It is also testing the 61.8% Fib retracement level of the upward move from the $1,838 swing low to the $1,914 high.\n\nIf the price stays above the $1,865 support, it could attempt a fresh increase. Immediate resistance is near the $1,900 zone and the 100-hourly Simple Moving Average. The next major resistance is near the $1,900 level. A proper move above the $1,900 and $1,920 resistance levels might send Ether toward $1,940.\n\nSource: ETHUSD on TradingView.com\n\nThe next resistance sits near $1,965, above which Ethereum could rise toward $2,000. Any more gains above the $2,000 resistance zone might send the price toward the $2,120 resistance.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,900 resistance, it could continue to move down. Initial support on the downside is near the $1,868 level.\n\nThe next major support is near the $1,855 zone. If there is a break below the $1,855 support, the price could decline toward the $1,840 support. Any more losses may perhaps send the price toward the $1,800 level or even $1,740 in the coming sessions.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is below the 50 level.\n\nMajor Support Level – $1,840\n\nMajor Resistance Level – $1,900\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vdS50b2RheS9iaXRjb2luLWFuZC1ldGhlcmV1bS1nYXJuZXItcmlzaW5nLWludGVyZXN0LW9uLXR3aXR0ZXLSAUpodHRwczovL3UudG9kYXkvYml0Y29pbi1hbmQtZXRoZXJldW0tZ2FybmVyLXJpc2luZy1pbnRlcmVzdC1vbi10d2l0dGVyP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Garner Rising Interest on Twitter - U.Today",
        "content": "Twitter has been aflutter with conversations around Bitcoin and Ethereum, the two largest cryptocurrencies by market capitalization, according to data analytics firm IntoTheBlock.\n\nAdvertisement\n\nImage by @intotheblock\n\nThe rise in discussions could be indicative of burgeoning interest in these digital assets, despite their lackluster performance over the past week.\n\nPer CoinGecko data, Bitcoin is currently trading at $26,780 after recording a 4% decrease over the last seven days. Ethereum experienced a slightly less drastic drop of 1.6%, trading at $1,870.\n\nInterestingly, this uptick in social media chatter stands in stark contrast to recent trends in the global interest in cryptocurrencies.\n\nAs reported by U.Today, excitement surrounding cryptocurrencies has noticeably cooled off. Google Trends data shows that global interest in cryptocurrency has dipped to levels not seen since December 2020, marking a significant downturn in public engagement with the crypto sphere.\n\nDespite waning search interest, the increased Twitter conversations might hint at sustained or resurgent interest among a specific group of internet users. It is worth noting that Twitter, with its characteristic brevity and real-time updates, has often been the platform of choice for crypto enthusiasts and experts alike.\n\nNevertheless, it is still too early to declare a definitive rebound in wider public interest in cryptocurrencies based on this social media metric. It would be far-fetched to assume that Twitter chatter might forecast a revival of the struggling crypto market."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZGVjcnlwdC5jby9uZXdzLWV4cGxvcmVyP3Bpbm5lZD0xODAyOTImdGl0bGU9ZXRoZXJldW0tY28tZm91bmRlci1tb3Zlcy00MW0taW4tZXRoLXRvLWtyYWtlbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 16:42:03 GMT",
        "title": "News Explorer — Ethereum Co-Founder Moves $41M in ETH to Kraken - Decrypt",
        "content": "Jun 5, 1:54 pm\n\nThe Block\n\nEthereum Co-Founder Moves $41M in ETH to Kraken\n\nAn Ethereum address reportedly belonging to network co-founder Jeffrey Wilcke has transferred 22,000 ETH, worth $41.1 million, to an address on the Kraken exchange. Multiple sources have confirmed the address, and Wilcke's address still holds over 150,000 ETH, worth nearly $280 million. The transfer occurred roughly two hours ago, and the price of ETH has decreased by 2.25% over the past week."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctZXRoZXJldW0tb24tZXhjaGFuZ2VzLWRyb3BwZWQtdG8tYS01LXllYXItbG93L9IBTGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctZXRoZXJldW0tb24tZXhjaGFuZ2VzLWRyb3BwZWQtdG8tYS01LXllYXItbG93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "How Ethereum on exchanges dropped to a 5-year low - AMBCrypto News",
        "content": "Ethereum on exchanges hits a five-year low.\n\nThe number of ETH holders grows steadily as the price hovers around $1,900.\n\nNew data indicated a dwindling influx of Ethereum onto exchanges in the past few weeks. The most recent chart analysis revealed that the current balance of Ethereum on exchanges reached a new nadir, indicating a decline in overall liquidity on these platforms.\n\nEthereum on exchanges decline\n\nGlassnode Alerts recently unveiled a chart showcasing the ongoing decline of Ethereum on exchanges. It also showed that each passing day marked a new record low.\n\nThe latest data from Glassnode indicated that the current balance of ETH on exchanges stood at approximately 17.2 million, marking the lowest point witnessed in the past five years.\n\nComparatively, back in January, the balance on exchanges exceeded 19 million; at the start of May, it surpassed 18 million.\n\nThis downward trend implied a reduction in available liquidity within exchanges. However, it is important to note that a decrease in ETH on exchanges does not necessarily indicate a decrease in ETH holders.\n\nEthereum holders remain steady\n\nWhile it may seem that Ethereum is leaving exchanges at a higher rate than it is being deposited, the dynamics surrounding the total number of ETH holders tell a different story.\n\nThe Santiment chart showed a steady increase in the number of ETH holders. Currently, approximately 100 million individuals hold varying amounts of ETH.\n\nThis growth has been gradual, with around 98.4 million holders reported at the end of April.\n\nThe declining balance on exchanges and the simultaneous growth in the number of holders can be attributed to two main factors: self-custody and staking.\n\nFirstly, more individuals opt for self-custody, holding their ETH in personal wallets rather than leaving them on centralized exchanges. It provides users with greater control and security over their assets.\n\nSecondly, staking has become increasingly popular. Staking involves locking up a certain amount of Ethereum to participate in the network’s proof-of-stake consensus mechanism.\n\nIn return for securing the network, stakers receive rewards in the form of additional ETH. It incentivizes users to hold their ETH in staking contracts rather than on exchanges. As of this writing, the total number of ETH deposits for staking was over 780,000 and growing.\n\nThe ETH TVL and price\n\nAccording to data from DefiLlama, Ethereum’s dominance in terms of Total Value Locked (TVL) remained steadfast. As of this writing, the TVL stood at approximately $27.35 billion, accounting for over half of the overall TVL.\n\nThis signified a continual influx of liquidity into the Ethereum ecosystem, emphasizing ETH’s ongoing relevance and significance.\n\nHow much are 1,10,100 ETHs worth today\n\nAdditionally, a glance at CoinMarketCap data revealed that ETH boasted the third-highest trading volume in the last 24 hours. The total volume of the entire cryptocurrency market surpassed $19 billion, with ETH contributing over $3 billion in trading volume.\n\nFurthermore, ETH maintained its position as the second-largest cryptocurrency by market capitalization, trailing behind Bitcoin. As of this writing, ETH was trading at approximately $1,900."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctbWVtZWNvaW5zLWFmZmVjdGVkLWV0aGVyZXVtcy1nYXMtcHJpY2VzL9IBRmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ob3ctbWVtZWNvaW5zLWFmZmVjdGVkLWV0aGVyZXVtcy1nYXMtcHJpY2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "How memecoins affected Ethereum’s gas prices - AMBCrypto News",
        "content": "Memecoins and MEV bot activity affected Ethereum’s gas usage.\n\nRise in NFT trades, increased selling pressure on ETH holders, and shifting trader behavior observed.\n\nEthereum’s [ETH] historically high gas prices have often deterred users from using the network, leading them to explore alternative protocols. However, the recent decline in gas usage could have positive implications for both Ethereum and ETH in the future.\n\nEthereum is gassed up\n\nAccording to Dune Analytics, Ethereum’s daily average gas reached its lowest point in the past two months. As of 3 June, the average gas stood at 24gwei, with the press time gas at 17gwei.\n\nThe decrease in gas fees may be attributed to the recent hype surrounding memecoins, which has increased activity on the network. The utilization of Miner Extractable Value (MEV) bots could have further contributed to the decline as well.\n\nMEV bots are automated systems that leverage transaction sequencing to exploit profitable opportunities in the Ethereum network. The prevalence of these bots can impact gas fees by optimizing transaction execution, potentially reducing costs for users.\n\nThe NFT angle\n\nThere was consistent gas usage in the Ethereum protocol, facilitated by low gas fees. Moreover, the number of NFT trades on the Ethereum network rose alongside.\n\nNotably, prominent blue-chip NFTs like MAYC and Azuki drove the surge in NFT volume. DappRadar’s data indicated that over the past week, the volume of these NFTs increased by 29.9% and 129% respectively.\n\nMeanwhile, Ethereum’s native cryptocurrency, ETH, was trading at $1,873 at press time. The coin’s MVRV (Market-Value-to-Realized-Value) ratio increased over the last month, suggesting that the profitability of addresses holding ETH is relatively high.\n\nThis could incentivize these address holders to sell and secure profits, potentially impacting the price of ETH in the near future.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nLastly, the put-to-call ratio for Ethereum has declined during this period. This indicates a shift in trader behavior, with a decreased interest in protective put options relative to call options.\n\nSuch a trend may suggest growing optimism among traders regarding the future price movement of Ethereum."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8wNi93aGFsZXMtYWJydXB0bHktbW92ZS1uZWFybHktNDAwMDAwMDAwLWluLWV0aGVyZXVtLWFzLWNyeXB0by1tYXJrZXRzLXBsdW5nZS1oZXJlcy13aGVyZS10aGUtY3J5cHRvLWlzLWdvaW5nL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNi8wNi93aGFsZXMtYWJydXB0bHktbW92ZS1uZWFybHktNDAwMDAwMDAwLWluLWV0aGVyZXVtLWFzLWNyeXB0by1tYXJrZXRzLXBsdW5nZS1oZXJlcy13aGVyZS10aGUtY3J5cHRvLWlzLWdvaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Whales Abruptly Move Nearly $400,000,000 in Ethereum As Crypto Markets Plunge – Here’s Where the Crypto Is Going - The Daily Hodl",
        "content": "Whales are suddenly moving hundreds of thousands of Ethereum (ETH) as the crypto markets witness a serious sell-off event.\n\nThe blockchain-surveying service Whale Alert spotted a string of Ethereum transactions adding up to 353,579 ETH and worth almost $400 million.\n\nOne of the largest transactions in the past day involved a deep-pocketed investor abruptly relocating 149,999 ETH worth $276.16 million from a wallet of unknown origin to US-based crypto exchange Coinbase.\n\nWhale Alert shows that the crypto whale paid about $3 in transaction fees to move the massive Ethereum stack.\n\nA different entity also moved 149,999 ETH worth $276.16 million from an unknown wallet to Coinbase. The crypto whale shelled out a little over $3 for the transfer.\n\nWhale Alert also reports three other large Ethereum transactions that saw the movement of tens of thousands of ETH from unknown wallets to Coinbase.\n\nSince all of the ETH mentioned were moved to a crypto exchange, they could potentially be sold on the open market.\n\nAt time of writing, Ethereum is trading for $1,809, down nearly 4% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney\n\nShutterstock/Tomasz Makowski"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vdGhlZGVmaWFudC5pby9ob3ctYXJiaXRydW0taXMtc2NhbGluZy1ldGhlcmV1bS1sYXllci0yLWNoYWxsZW5nZXMtZ292ZXJuYW5jZS1zY2FuZGFsLWFuZC16ay10aHJlYXRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 23:49:24 GMT",
        "title": "How Arbitrum is Scaling Ethereum, Layer 2 Challenges, Governance Scandal, and ZK Threats - The Defiant - DeFi News",
        "content": "Steven Goldfeder is the founder of OffChain Labs. OffChain Labs is a company focused on Ethereum scaling solutions and known primarily for building Arbitrum, which is currently Ethereum's biggest Layer 2. In our conversation Steven will explain how OffChai...\n\nBy: Camila Russo • Loading...\n\nDeFi Podcasts\n\nSteven Goldfeder is the founder of OffChain Labs. OffChain Labs is a company focused on Ethereum scaling solutions and known primarily for building Arbitrum, which is currently Ethereum's biggest Layer 2. In our conversation Steven will explain how OffChain Labs is addressing the scalability challenges of Ethereum by utilizing off-chain computation and optimistic rollups. We get into the Arbitrum airdrop, its governance drama, the big vision for Arbitrum and Layer 2s as a whole, and what the next milestones are for the scaling solution. But first, Steven starts the interview by explaining the basics of Arbitrum.\n\n"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1jby1mb3VuZGVyLW1vdmVzLTQxbS13b3J0aC1vZi1ldGgtdG8ta3Jha2VuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Co-Founder Moves $41M Worth of ETH to Kraken - DailyCoin",
        "content": "Jeffrey Wilcke sent 22,000 ETH to a Kraken address.\n\nThe 22,000 ETH was worth around $41 million at the transfer time.\n\nWilcke’s transfer occurred just hours before the SEC sued Binance.\n\nThe current crypto bear market has been one of the most brutal ones. Multiple companies have gone bust, and digital asset prices have plummeted.\n\nThe price has somewhat rebounded for Ethereum (ETH) since the local bottom of around $850.\n\nHowever, on Monday, one of Ethereum’s co-founders transferred millions of dollars worth of ETH to a Kraken address, causing speculation that the ETH had been dumped.\n\nEthereum Co-Founder Transfers 22,000 ETH\n\nETH has been enjoying quite steady growth since the start of the year, being up by around 51%.\n\nHowever, the recent move by one of the co-founders of Ethereum has made ETH investors uneasy. Jeffrey Wilcke transferred 22,000 ETH on Monday to another address, then moved it to Kraken.\n\nAt the time of the transfer, 22,000 ETH was worth around $41 million.\n\nJeffrey Wilcke ( the co-founder of Ethereum ) deposited 22K $ETH($41M) to #Kraken 2 hrs ago.\n\n\n\nAnd the price of $ETH dropped by 0.4%.\n\n\n\nAccording to the -2% Depth data on #Kraken, he should not have sold all of the $ETH.https://t.co/ps5Th79BWu pic.twitter.com/HVbEV5IMrf — Lookonchain (@lookonchain) June 5, 2023\n\nMore interestingly, Wilcke transferred the ETH just hours before the U.S. Securities and Exchange Commission (SEC) announced its lawsuit against Binance. The price of ether then dropped by around 5%.\n\nETH is currently trading at $1,816, according to data from CoinGecko.\n\nThis was Wilcke’s first transaction on that address in more than two years. In January 2023, Wilcke transferred 9,999 ETH to a different address, from which he then moved to a Kraken-labeled address.\n\nWilcke’s transfer of 22,000 ETH comes just a month after the Ethereum Foundation sold 15,000 ETH.\n\nOn the Flipside\n\nWilcke still holds over 150,000 ETH, worth around $272 million.\n\nWhy This Matters\n\nSeeing what ETH insiders do helps better position oneself as a trader and investor. However, nowadays, a $41 million sale doesn’t significantly impact the price of ETH.\n\nRead more about Rocket Pool’s deployment on zkSync Era:\n\nRocket Pool to Allow Users to Stake ETH on Ethereum Layer-2 zkSync Era\n\nRead more about Circle deploying USDC on Arbitrum:\n\nCircle to Deploy USDC on Arbitrum: Here’s What This Means"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3Lm5mdGdhdG9ycy5jb20vdHdvLXRoaXJkcy1vZi1mcmVzaGx5LW1pbnRlZC1ldGhlcmV1bS1uZnRzLXByb2ZpdGFibGUtZGVzcGl0ZS10aGUtYmVhci1tYXJrZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Two-Thirds of Freshly Minted Ethereum NFTs Profitable Despite the Bear Market - NFT News and Insights from the Industry - NFTgators",
        "content": "Quick take:\n\nA report by Nansen indicates that 67% of newly minted Ethereum NFTs are profitable.\n\nThe report also points out the declining number of new NFTs mints since the summer.\n\nThe current number of mints is the lowest since June 2021.\n\nThe NFT market has plummeted since June last year. Some say NFTs are dead, while others try to avoid being associated with the term completely. Yet despite the slump, Nansen Research has come up with some interesting statistics.\n\nAccording to a report published Monday, 67% of freshly minted Ethereum NFTs are profitable, which means their floor prices remain above the auction price.\n\nHowever, according to Nansen Research, new NFT mints have been on a decline since the summer, which could explain why the profitability rate remains high.\n\n“New NFT mints have been on a decline since summer, with NFTs minted in May being 65% lower than that in April, AND the lowest it’s been since June ’21,” the company wrote in a tweet.\n\nSource: Nansen.ai/Twitter\n\nAs demonstrated in the graph above, NFT profits tend to be higher in the first few days after the mint before declining in the days after.\n\nEthereum NFTs still dominate the industry in terms of volume traded. According to a Dune Analytics board prepared by Hildobby, Ethereum NFTs generated nearly $139 million in transaction volume in May 2023, excluding wash trading. That is a significant decline from this year’s best month of more than $650 million reported in February.\n\nSource: Hildobdy/Dune Analytics\n\nNonetheless, the data shows that the NFT market has rebounded significantly since the start of the year compared to the decline experienced in the second half of 2022.\n\nThe NFT market registered the best period during the first quarter of 2022, largely driven by the launch of the LooksRare NFT marketplace and X2Y2, albeit with significant volume driven by wash trading activity.\n\nA significant bump witnessed in February this year was a result of a ripple effect created by the emergence of Ordinals NFTs, which seemed to reignite the market.\n\n****\n\nStay up to date:\n\nSubscribe to our newsletter using this link – we won’t spam!"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vdG9rZW5wb3N0LmNvbS9FdGhlcnNjYW4tSW5ub3ZhdGVzLXdpdGgtQWR2YW5jZWQtRmlsdGVyLWZvci1TdHJlYW1saW5lZC1CbG9ja2NoYWluLUFuYWx5c2lzLWFuZC1SZXNlYXJjaC0xMDE0MNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Etherscan Introduces Advanced Filter Tool to Enhance Ethereum Data Analysis - TOKENPOST",
        "content": "Etherscan Introduces Advanced Filter Tool to Enhance Ethereum Data Analysis\n\nEtherscan has unveiled a cutting-edge tool, the \"Advanced Filter,\" currently in its testing phase. This innovative application empowers users to customize their search results by setting specific parameters using publicly available data from the Ethereum blockchain.\n\nThe Advanced Filter acts as a search spotlight, allowing users to narrow down results based on their specific requirements. This focused search tool enables users to delve into the most relevant data points for their research, transaction tracking, or investigative needs.\n\nOne notable advantage of the Advanced Filter is its potential to enhance monitoring capabilities for non-fungible token (NFT) lending operations on platforms like Blur. Analysts can swiftly identify leading NFT collections utilized as loan securities using the filters. The tool also provides data on loan requests, identifying popular NFT collections in the lending sphere and assessing the demand for NFT-backed loans.\n\nWhile this tool shows promise, it is still a work in progress and requires refinement. Presently, the filter does not exclude tokens with unfavorable reputations, and there is no option to maintain a blacklist. Nonetheless, news of this development has generated enthusiasm among data analysts and blockchain investigators on Twitter. Many believe that this tool could significantly streamline the process of tracing fund movements associated with fraudulent activities and breaches.\n\nSuggestions for further enhancements have also emerged, including integrating public address name tags into Etherscan's API. Such enhancements could reduce the time spent manually combing through the website for on-chain sleuths. If realized, these advancements could pave the way for more intuitive, efficient, and user-friendly blockchain analysis tools in the future.\n\nTokenPost | [email protected]"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW50cnVzdC5jb20vbWFya2V0LW5ld3MvZXRoZXJzY2FuLWltcHJvdmVzLWV0aGVyZXVtLWJsb2NrY2hhaW4tc3R1ZHktd2l0aC1sYXVuY2gtb2YtYWR2YW5jZWQtZmlsdGVyc9IBdmh0dHBzOi8vd3d3LmNvaW50cnVzdC5jb20vbWFya2V0LW5ld3MvZXRoZXJzY2FuLWltcHJvdmVzLWV0aGVyZXVtLWJsb2NrY2hhaW4tc3R1ZHktd2l0aC1sYXVuY2gtb2YtYWR2YW5jZWQtZmlsdGVycy9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Etherscan Improves Ethereum Blockchain Study with Launch of Advanced Filters - CoinTrust",
        "content": "Etherscan has recently implemented an advanced filter as a means to streamline and expedite the process of blockchain analysis. The advanced filter facilitates quick access to desired data by enabling users to refine their searches. Etherscan serves as a platform for exploring blocks and analyzing data on the Ethereum blockchain. The platform encompasses a range of features such as transaction history, smart contract data, a block explorer, token information, analytics, and an API.\n\nIndividuals who are keen on expanding their knowledge about the Ethereum blockchain or undertaking research on Ethereum-driven initiatives will discover that the analytical tool is an indispensable asset. It is a common practice among traders and investors to frequently utilize it for monitoring the price of Ethereum and other cryptocurrencies.\n\nEtherscan is an open-source project that is free of cost and is maintained by a team of software engineers. With a global user base of millions, this Ethereum blockchain explorer is among the most extensively utilized. According to Etherscan, the advanced filter enables users to search for transactions based on various criteria such as transaction type, function name, duration, amount, assets, and address sensitivity (sending and receiving addresses). In addition, users have the ability to save their filter queries for future use.\n\nThe significance of the Web3 analytics sector has grown progressively over the years. They are advantageous in terms of understanding the decentralized web ecosystem and making well-informed decisions. Their services encompass network monitoring, data analysis, smart contract auditing, portfolio tracking, and real-time monitoring of blockchain networks. These tools offer insights into user engagement, network usage patterns, and market trends. Additional examples comprise CryptoQuant, Covalent, the Graph, Dune Analytics, Nansen, and Alethio, alongside Etherscan.\n\nIn April 2023, Etherscan implemented a feature to hide token transfers with zero value as a means of enhancing its user experience. Recently, the platform has also broadened its scope by collaborating with the WEMIX3.0 ecosystem.\n\nTo utilize Etherscan’s latest functionality for filtering transaction types, adhere to the following steps:\n\nBegin by selecting “All” to include all transaction types.\n\nNext, focus on transactions where an Externally Owned Address (EOA) or wallet address sends ETH directly to other addresses.\n\nThen, consider “Internal Txs,” resulting from smart contract logic triggered by regular transactions.\n\nDirect your attention to “ERC-20” transactions involving transactions related to ERC-20 tokens.\n\nFinally, explore “ERC-721” transactions, which involve transactions related to non-fungible ERC-721 tokens (NFTs).\n\nFurthermore, the latest filter feature includes the following transaction types:\n\n“ERC-1155” encompasses transactions involving semi-fungible ERC-1155 tokens (SFTs).\n\n“Deposit” narrows down transactions involving the deposit of ETH into the Beacon Chain Contract for Ethereum validation purposes.\n\n“Withdrawal” covers transactions related to the withdrawal of ETH from the Beacon Chain. This can include automatic reward withdrawals or exiting as a validator.\n\nThe analysis of DeFi exploits can be a complex task, often involving multiple addresses and requiring a comprehensive understanding of the incident. Previously, executing this process necessitated the simultaneous opening of numerous Etherscan windows.\n\n🆕 Advanced Filter (Beta) Refine your Ethereum transaction search with rich filters 🔍 pic.twitter.com/DIb5ESYmNP — Etherscan (@etherscan) June 2, 2023\n\n\n\nThe Advanced Filter tool offered by Etherscan is a valuable resource for community members as it allows them to streamline their analysis by combining results from various filter fields. This results in a more comprehensive understanding of the exploit at hand. Please take into account the Euler attack that transpired in March of 2023. Prioritizing key transactions was crucial given the involvement of a flash loan and multiple tokens in this breach. Achieving this is feasible by utilizing the Advanced Filter feature, which encompasses regular transactions (txs), ERC-20 tokens, and internal transactions."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNS1qdW5lLTIwMjMvYXJ0aWNsZXNob3cvMTAwNzYyMDIzLmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNS1qdW5lLTIwMjMvYW1wX2FydGljbGVzaG93LzEwMDc2MjAyMy5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $26,800; Litecoin, BNB decline over 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were majorly trading mixed on Monday. Bitcoin, Ethereum, and BNB were trading with cuts, while XRP , Solana, and Tron were trading with gains.Bitcoin (BTC) fell 1.20% to $26,797, whereas Ethereum (ETH) was below the $1,900 level. BTC volume stood at approximately $11.57 billion, falling 39.42% in the last 24 hours.\"Crypto markets have continued to be tightly range-bound as overall market capitalization remained just below $1.2 trillion over the weekend, without any change in the last 24 hours. Investors are currently displaying a lack of initiation for trend control. It is because of this that we can expect the market to perform sideways till a prominent narrative picks up,\" Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said.The total volume in DeFi is currently $2.29 billion, 8.67% of the total crypto market 24-hour volume. The volume of all stablecoins is now $24.44 billion, which is 92.65% of the total crypto market 24-hour volume.The global cryptocurrency market cap was trading higher around $1.12 trillion, declining 0.92% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $519 billion. Bitcoin’s dominance is currently 45.83%, a decrease of 0.08% over the day, according to CoinMarketCap.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 45, with a neutral outlook. The Stochastic %K (14, 3, 3) at 44 and the Average Directional Index (14) at 18 indicate a Neutral outlook as well.\"The MACD Level (12, 26), at −151, indicates “Sell”. The Stochastic RSI Fast (3, 3, 14, 14) is “Neutral” at 46 and William's Percentage is “Neutral” at 62 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.24 hours, IST on June 5, 2023)Bitcoin $26,796 -1.20%Ethereum $1,871 -1.43%Tether $1.00 -0.02%BNB $301 -2.01%XRP $0.5376 2.72%Cardano $0.3723 -1.36% Dogecoin $0.07211 -1.54%Polygon $0.867 -1.78%Solana $21.53 0.18% Litecoin $93.37 -2.1%Polkadot $5.26 -1.53%Tron $0.08147 0.71%Shiba Inu $0.000008539 -1.15%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tZ2FzLWZlZXMtcmlzaW5nLWFtaWQtbWVtZS1jb2luLWh5cGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Ethereum gas fees rising amid meme coin hype - crypto.news",
        "content": "It is widely recognized that cryptocurrencies are subject to volatility, which is no longer a surprising fact. The crypto winter in 2022 led to several incidents and events that brought digital currencies to the forefront of discussions. As anticipated, much of the attention revolved around bitcoin (BTC) and ethereum (ETH), the two largest coins in terms of market capitalization.\n\nWhile in the case of bitcoin, the focus fell entirely on the price drop, Ethereum made the news for several other reasons.\n\nThere are plenty of resources out there on how to open an account on an exchange platform or how to buy Ethereum. However, the most crucial step when getting into crypto is research. One must learn about the project’s history and development to understand its pros and cons and make informed trading and investing decisions.\n\nYou might also like: Binance launches 10 week summer internship program\n\nSo, Ethereum’s evolution over the past months has been interesting. After undergoing its biggest upgrade since inception, known as the Merge, on Sep. 15, 2022, Ethereum managed to complete the final step in the long-awaited transition from proof-of-work (POW) to proof-of-stake (POS) with its latest upgrade, Shanghai, which took place on April 12, 2023.\n\nEthereum is again in the spotlight due to its rising gas fees that reached a 12-month high of 240 gwei on May 5; an increase most likely fueled by the buzz surrounding meme coins.\n\nEthereum gas fees explained\n\nFor individuals not well-versed in the Ethereum network, explaining gas fees and their significance is crucial. Ethereum encompasses more than just a cryptocurrency that can be purchased or traded on exchange platforms.\n\nIt is a decentralized open-source blockchain platform with numerous use cases and applications, accompanied by its native coin called ether (ETH).\n\nAlthough “Ethereum” and “Ether” are sometimes used interchangeably, they refer to distinct entities, which can lead to confusion.\n\nTherefore, the Ethereum platform can be used to develop other crypto projects, conduct transactions and run smart contracts. However, to carry out these actions, users must pay certain fees for utilizing the network’s resources, commonly called gas.\n\nThis represents the computational effort required for the execution of an operation on the Ethereum network. The gas price is expressed in gwei, tiny fractions of ether. One gwei is worth 0.000000001 ETH.\n\nGas prices also vary based on supply and demand and the volume of validation requests on the network.\n\nOn top of that, gas fees serve as an incentive for Ethereum validators, as they get to receive these fees for staking their tokens, verifying transactions, and adding new blocks to the blockchain. As a result, higher gas fees may lead to faster transactions on the Ethereum network.\n\nHow the new meme coin season is rising Ethereum gas fees\n\nPaying gas fees is not a new practice for Ethereum users since this feature has been embedded in the platform’s structure since the beginning. However, using the Ethereum network has become costlier as gas fees rise, reaching unprecedented levels. A recent analysis shows that a user had to pay a whopping $118,600 worth of ETH for only one transaction.\n\nGas fees have fluctuated significantly, so these rising values are expected. In May 2022, the gas price hit a high of 150 gwei. In the months leading to the Merge, the price gradually dropped and hovered around 20 gwei.\n\nTherefore, it was less common for gas fees to spike after the completion of the upgrade. Although the Merge didn’t target this issue directly, lowering gas fees was viewed as a by-product of the overhaul, given that switching from miners to validators was expected to help de-congest the Ethereum network.\n\nHowever, since gas fees have gone up by more than 50% since April, it’s clear that these expectations haven’t been met. This unexpected surge is probably caused by the latest meme hype that has taken over the crypto sphere. The rise in activity on the Ethereum network coincides with listing the newly-launched meme coin, PEPE, on Binance can’t be just a mere coincidence.\n\nAfter being pushed to the fringes of the crypto industry, the meme scene has entered a period of revival with the emergence of the PEPE token, an Ethereum-based meme coin that has been making waves in the crypto sphere. It began in April this year when the number of active addresses on Ethereum increased by 20,000 since November 2021.\n\nSince PEPE is now listed on all major crypto exchanges and its price soared over a few days, traders wanted to take advantage of the opportunity to cash in on the hype. With more people jumping on the meme bandwagon, the Ethereum network saw a spike in user activity. As a direct consequence, gas fees rose in tandem.\n\nHigher gas prices translate into higher revenue for the network. The fact that users are also eager to trade new coins shows that they’re gaining more confidence, which can help solidify Ethereum’s position in the market. However, there’s also a downside to these events.\n\nGas fees have always been a highly debated topic among crypto enthusiasts and for a good reason. As the gas price rises, it can impede users who want to perform low-value transactions or smart contracts.\n\nIt’s difficult to say if gas fees will return to more reasonable values as the meme craze cools off. However, it’s helpful to monitor this association closely from now on.\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vYml0Y29pbmtlLmlvLzIwMjMvMDYvd2ViMy1jbHVicy1ncmFkdWF0ZXMtZXRoZXJldW0tZGV2ZWxvcGVyLWNvaG9ydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Kenya's Web3 Clubs Graduates 15 Ethereum Smart Contract Developers - bitcoinke.io",
        "content": "Web3 Clubs, an initiative focused on championing Web3 developer education in Africa, officially completed its second cohort when 15 students graduated, out of which, 4 were female developers.\n\nThe cohort training kicked off in March 2023 with 20 developers onboarded to learn how to build decentralized applications (dApps) on the Ethereum blockchain and install several more Web3 Clubs across various universities.\n\nThe students put in 90 hours of daily programming time over the course of 3 months. In addition, the course also included an additional 28 hrs of full-day bootcamps where they were able to interact one-on-one with the lead trainer.\n\nCongratulations to the 15 Kenyan 🇰🇪 #ETH developers for a successful graduation after putting in over 100 hours of development training time for a period of 3 months.@Web3Clubs pic.twitter.com/syGNzC6wtG — BitKE (@BitcoinKE) June 5, 2023\n\nA lack of skilled developers is a major bottleneck hindering the growth of the ecosystem on the African continent. Web3 Clubs is addressing this challenge in this second cohort expected to produce a new crop of developers who will be able to build innovative dApps that will solve real-world problems on the Ethereum blockchain.\n\nThe graduation event also included a showcase of the outstanding projects drawn from the students. Some of the projects built by the students included:\n\nArtsy, an NFT marketplace developed using Ethers.js and React, with Pinata as the decentralized file hosting service\n\n“By integrating Etheres.js, Pinata, React, and MetaMask, I created a secure, transparent and visually captivating platform where artists can showcase their unique creations, and art enthusiasts can collect and appreciate these unique digital assets,” said Esther, one of the graduates.\n\nEsther, one of the graduates from the @Web3Clubs #ETH cohort presents her #NFT marketplace project tha she built pic.twitter.com/sxHUII2e1R — BitKE (@BitcoinKE) June 3, 2023\n\nQwame, a blockchain-based, decentralized crowdfunding platform specifically designed to uplift research in Africa\n\n“In Africa, individual scientists and researchers lack access to necessary funding to advance their groundbreaking research,” said geneticist cum blockchain developer, Cyndie Kamau.\n\n“Traditional funding mechanisms are often centralized, leading to bias towards well-established institutions. Qwame provides a transparent and efficient conduit for direct funding from individuals, organizations, and stakeholders to the researchers who need it.”\n\nCindy showcases Qwame, a platform for scientists and researchers in Africa to crowdfund for their projects. #ETH Cohort by @Web3Clubs pic.twitter.com/G4HmoCQcYU — BitKE (@BitcoinKE) June 3, 2023\n\nBesides students drawn from across universities in Kenya, the program also targets a wide net of participants including experienced developers, entrepreneurs, and business professionals.\n\nThe participants, drawn from across Kenya, have now gained a comprehensive understanding of the following:\n\nThe basics of Ethereum and how it works\n\nThe Solidity programming language and how to write smart contracts using Solidity\n\nAdvanced Solidity concepts such as modifiers, inheritance, and error handling\n\nEthereum development tools and environment setup using Truffle and Ganache\n\nInteracting with smart contracts through web3.js library\n\nAdvanced contract topics such as events and optimization\n\nSecurity and best practices for writing secure and efficient smart contracts\n\nBuilding and deploying a fully functional smart contract that solves a real-world problem\n\nWeb3 Clubs ran a successful first cohort in 2022 which saw 30 developers graduate as NEAR protocol developers.\n\n_____________________________________\n\nFollow us on Twitter for the latest posts and updates\n\nJoin and interact with our Telegram community\n\n_____________________________________\n\n_____________________________________"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2hvdy10by1zdG9yZS15b3VyLWV0aGVyZXVtLXNhZmVseS1pbi0yMDIzLXRoZS0xMC1iZXN0LXdhbGxldHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "How to Store Your Ethereum Safely in 2023: The 10 Best Wallets - Analytics Insight",
        "content": "Ethereum wallets are applications that let you interact with your Ethereum account\n\nEthereum is one of the most popular blockchain platforms in the world, and its native cryptocurrency, Ether, is among the top digital currencies in terms of market capitalization. Ethereum wallets are applications that let you interact with your Ethereum account. Think of it as an Internet banking app – without the bank. Your Ethereum wallet lets you read your balance, send transactions, and connect to applications. You need a wallet to send funds and manage your ETH.\n\nMyEtherWallet\n\nMyEtherWallet, or MEW for short, is a popular Ethereum wallet that allows you to store and manage your Ether securely. The wallet is open source, which means that the code is publicly available for anyone to review and audit. This gives users peace of mind, knowing that the wallet is transparent and secure.\n\nAtomic Wallet\n\nAtomic Wallet is the ultimate solution for Ethereum and ERC20 tokens. The wallet enables you to store, exchange, and buy ETH with a bank card. In the future, Ethereum will be available for swapping with Atomic Swaps, a fully decentralized way of exchanging cryptos without involving intermediaries. Atomic Wallet supports over 300 cryptocurrencies and provides you with its interface for all ERC20 tokens.\n\nLedger Nano X\n\nThis is the most modern ETH hardware wallet that you could get. Ledger has been a pioneer in the industry of hardware wallets and they support Ethereum and all the tokens of the Ethereum chain. Right now, Ledger Ethereum integration is available via MyEtherwallet which makes it easier for you to manage your Ethereum coin.\n\nLedger Nano S\n\nThe Ledger Nano S is a hardware wallet that offers top-of-the-line security for your Ether. The device stores your private keys offline, which makes it virtually impossible for hackers to steal your funds. The Ledger Nano S is also easy to use and can be accessed through a USB port.\n\nTrrezo\n\nTrezor is another hardware wallet that offers top-notch security for your Ether. The device is designed to protect your private keys from physical and virtual theft. Trezor also has an easy-to-use interface that makes it simple to manage your Ether.\n\nGuarda\n\nGuarda is a non-custodial wallet for storing Ethereum. The Guarda wallet has an intuitive interface and offers a high degree of protection. The wallet is available for Desktop, mobile, and web interfaces is also available. When you set up a Guarda wallet, you are the only one who controls the private key.\n\nArgent\n\nArgent is the most modern mobile wallet for Ethereum. This is one unique ETH wallet that is non-custodial but it doesn’t let you store the private key. The wallet is configured using your Email address and mobile number and can be recovered using the same.\n\nExodus\n\nExodus is a desktop wallet that supports multiple cryptocurrencies, including Ether. The wallet offers a user-friendly interface and allows you to manage your Ether and other digital assets easily. Exodus also offers a built-in exchange feature that enables you to trade your Ether for other cryptocurrencies.\n\nMestaMask\n\nMestaMask is like a browser to access the Ethereum network. It not only enables you to store and send Ethereum but also allows you to access decentralized Ethereum apps. It has an intuitive design where you can switch quickly between a test network and the main Ethereum network.\n\nTrust Wallet\n\nTrust Wallet is a mobile wallet that offers a convenient way to manage your Ether on the go. The wallet is available for both iOS and Android devices and supports multiple cryptocurrencies. Trust Wallet also offers a built-in dApp browser, which makes it easy to access decentralized applications directly from the wallet.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZGFpbHktNi1qdW5lLXRoaXMtZXRoLWtleS1zdXBwb3J0LWlzLXN0aWxsLWhvbGRpbmctc3Ryb25nLXdoYXQtbm93L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction Daily (6-June): This ETH Key Support Is Still Holding Strong! What Now? - Bitcoinsensus",
        "content": "Ethereum price prediction from a previous analysis ETH Price Sells Off Aggressively on News Of SEC Binance Law Suit\n\nIn our previous Ethereum analysis, ETH Price Sells Off Aggressively on News Of SEC Binance Law Suit we made it clear to our readers that\n\nDespite the bad news of the SEC suing the Binance crypto exchange, this in no way means ETH sell-off after the news panic will continue.\n\nFor that ETH bearish sell-off to continue, we need to see the Altcoin price breakthrough and close below the $1,755 major support level in the 4-hour timeframe.\n\nWell, since publishing that TA, we have seen the Ethereum price sell off to that major support and then bounce! What does this mean for the ETH price and what can we expect in the coming days?\n\nTo trade ETH with leverage, sign-up to Bybit right now! Bybit’s BIGGEST Bonus Campaign is now live! You can get up to a $30,000 Bonus when you fund your Bybit account with our Bybit link\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nETH Bearish Flag Pattern Is Still Valid!\n\nThis ETH Key Support Is Still Holding Strong! What Now? Watch this price prediction in the 4-hour timeframe\n\nThe pattern we are still tracking right now is the Ethereum Bearish Flag Pattern currently playing out in the 4-hour timeframe.\n\nThe Ethereum price is still respecting this key pattern! However, we do not have our bearish confirmation to indicate the completion of the pattern and the start of the ETH sell-off.\n\nFor that bearish confirmation to play out, we need to see the ETH price break through the $1,755 key support in the 4-hour timeframe and continue to push lower.\n\nThe image below is the kind of price action we are expecting to see play out on Ethereum in the coming days.\n\nSide Note: For a full breakdown of why the $1,755 key support is so important to the ETH bulls read this previous TA where we break down the levels the ETH price is ranging in right now ETH Ranging Market Continues! What Now?\n\nFinal Verdict!\n\nWe are still very bearish on Ethereum right now and believe there is a very high probability for us to see the Altcoin price begin to push lower in the coming days.\n\nThe key pattern we are currently tracking is the ETH bearish Flag pattern forming in the 4-hour timeframe. For this bearish pattern to be confirmed, we need to see the Altcoin price breakthrough and close below the $1,755 key support level.\n\nA bearish breakdown like this would confirm the end of the ETH-ranging phase and the resumption of the push lower in price.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nHow to Trade Bitcoin (BTC)?\n\nTo understand the basics of Bitcoin trading, you can read our How To Trade Bitcoin Guide. It can prove helpful for traders who are just getting started with Bitcoin trading. You can also check out our list of top Bitcoin Exchanges To Trade With.\n\nPrimeXBT Covesting: Trade Hassel Free\n\nSign-up on PrimeXBT today to trade Bitcoin hassle-free. You can copy experienced traders and access hundreds of different strategies on the platform! Don’t forget to claim your 25% bonus by using the promo code “bitcoinsensus50” when you sign-up with our link PrimeXBT Covesting"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNi1qdW5lLTIwMjMvYXJ0aWNsZXNob3cvMTAwNzg3OTk5LmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNi1qdW5lLTIwMjMvYW1wX2FydGljbGVzaG93LzEwMDc4Nzk5OS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin slips below $25,800 after SEC sues Binance; BNB, Dogecoin shed over 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading in the red on Tuesday after the U.S. Securities and Exchange Commission (SEC) filed suit against Binance, accusing the exchange giant of violating securities laws.Bitcoin (BTC) declined 4% to $25,764, whereas Ethereum (ETH) was below the $1,850 level. BTC volume stood at approximately $20.32 billion, rising 76% in the last 24 hours.\"The latest development between Binance and SEC has spooked the global crypto market resulting in a bloodbath across digital assets. The market will respond sharply as the Binance-SEC saga unfolds; we should brace ourselves for a choppy market in the coming weeks. Regulatory clarity is the need of the hour for the global crypto ecosystem,\" Shivam Thakral, CEO of BuyUcoin, said.The world's biggest cryptocurrency exchange Binance and its CEO Changpeng Zhao have been sued by the US Securities and Exchange Commission (SEC), which alleged in a June 5 court filing that the firm operated a \"web of deception\" that included artificially inflating its trading volumes and commingling customer funds.The US Commodity Futures Trading Commission (CFTC) also sued Binance over regulatory violations in March.Other top crypto tokens were also trading lower. BNB and Solana declined by over 7%. Meanwhile, Dogecoin XRP , Cardano, Polygon and Polkadot also traded with cuts. The global cryptocurrency market cap was trading lower around $1.09 trillion, falling 4% in the last 24 hours.The total volume in DeFi is currently at $3.46 billion, which is 7.5% of the total crypto market 24-hour volume. The volume of all stablecoins is now $43.78 billion, which is 94% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $499 billion. Bitcoin’s dominance is currently 45.78%, a decrease of 0.08% over the day, according to CoinMarketCap.\"The sell-off in crypto markets as a reaction to US SEC suing Binance has brought Bitcoin to its 3-month low. There is a strong confluence of support for BTC at the $25,200 range that will likely hold to form a 'higher low' for the asset and provide a bounce for the next leg up. Markets will likely remain volatile in the upcoming week,\" Vikram Subburaj, CEO of Giottus Crypto Platform, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 37, with a neutral outlook. The Stochastic %K (14, 3, 3) at 24 and the Average Directional Index (14) at 21 indicate a Neutral outlook as well.\"The MACD Level (12, 26), at −317, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 18 and William's Percentage indicates Buy at -88,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.43 hours, IST on June 6, 2023)Bitcoin $25,764 -3.94%Ethereum $1,816 -2.96%Tether $1.00 0.01%BNB $277 -7.92%XRP $0.5115 -4.95%Cardano $0.3513 -6.36%Dogecoin $0.06659 -7.18%Polygon $0.8318 -6.14%Solana $19.96 -7.32% Litecoin $87.57 -6.1%Polkadot $5.08 -3.6%Tron $0.07886 -3.17%Shiba Inu $0.000008019 -6.07%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnRyYWRpbmd2aWV3LmNvbS9uZXdzL2NvaW50ZWxlZ3JhcGg6YTRmZmYxNzNjMDk0YjowLWV0aGVyZXVtLWdhcy1mZWVzLWNvb2wtZG93bi1hZnRlci1tYXktbWVtZWNvaW4tZnJlbnp5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Ethereum gas fees cool down after May memecoin frenzy - TradingView",
        "content": "The average gas fee — transaction fee — on the Ethereum network has cooled substantially in the first week of June after reaching a multimonth high in May, owing to the memecoin frenzy and much maximal extractable value (MEV) bot activities.\n\nThe average gas fee has decreased to $7.34, an almost one-third drop from last month’s high of $20. In terms of gwei — a denomination of Ether ETHUSD that represents one-billionth of one ETH — the daily median gas price has decreased to 24 gwei from a peak of almost 140 gwei last month, according to Dune Analytics. Cointelegraph\n\nThe memecoin frenzy started in late April and took center stage in May, leading to multiple new memecoins hitting the markets, such as Aped (APED), Bobo Coin (BOBO) and others. The dominance of memecoins in network activity was so high that it created an unusual shift in the top 10 gas-burning altcoins. Instead of ETH, Wrapped Ether (WETH), or Tether USDTUSD, memecoins such as Troll (TROLL), APED and BOBO became the top 10 spenders.\n\nSantiment @santimentfeed ⛽️ A highly unusual shift in top 10 gas burning #altcoins has emerged today. Instead of $ETH, $WETH, and $USDT being at the top of the fee distribution list, we're seeing new assets like $TROLL, $APED, and $BOBO among them. Read our latest deep dive. https://t.co/7SlmJ59k2m pic.twitter.com/Y2kaLKZTrL\n\nAnother prominent reason for the rise in the Ethereum gas fees was the surging popularity of memecoins on decentralized platforms, with mainstream centralized exchanges taking longer to list them.\n\nMay was not just about the Ethereum memecoin frenzy; Bitcoin Ordinals also gained significant popularity. Ordinals enable decentralized storage of digital art on the Bitcoin blockchain. As a result, the Bitcoin network registered many new memecoins, with Pepecoin (PEPE) achieving a billion-dollar market capitalization.\n\nOrdinals were introduced in January, and by the end of May, the number of Ordinal inscriptions on the Bitcoin blockchain had surpassed 10 million. Total fees paid for Ordinals inscriptions rose 700% in May to currently sit at 1,639 Bitcoin BTCUSD. Cointelegraph\n\nWith the memecoin frenzy dying down, Ethereum gas fees have cooled, and Ordinals inscriptions have also decreased significantly."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiKGh0dHBzOi8vY2xlYXJ0YXguaW4vcy9ldGhlcmV1bS12cy1zb2xhbmHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Ethereum vs Solana: Which is Better for Investment? - ClearTax",
        "content": "Ethereum has been one of the most popular blockchains dominating the scene of dApps development. It also facilitates faster and safer payments across the globe. But now, another blockchain has been raging the market – Solana.\n\nReleased on 16 March 2020, Solana has addressed many issues that Ethereum users have been facing and has risen to a position to act as a viable alternative. Indeed, 2021 has been the year of Solana.\n\nHere’s a competitive analysis between Ethereum and Solana.\n\nEthereum vs Solana: Mechanism\n\nThe performance of both these blockchains depends a lot on the mechanism they use. Ethereum uses the Proof-of-Work (PoW) consensus mechanism that Bitcoin uses. The network miners take part in this process. This ensures that the network stays decentralised, but there is a catch. The participating barrier within the network is high. This leads to fewer transactions on the network per second and reduces the network’s performance as a whole.\n\nOn the other hand, Solana uses the Proof-of-History (PoH) mechanism. This protocol cryptographically determines the time passage between two events. The mechanism further adds timestamps to track the order of each transaction.\n\nThis difference in mechanism solves the problem of Ethereum and Bitcoin, where transactions on the blockchain are not logged promptly.\n\n\n\nEthereum vs Solana: Architecture\n\nEthereum uses a ‘stateful’ architecture in which all the miners on the network must update their copy of the network each time a new transaction occurs.\n\nThis may seem like a decentralised way to maintain records; however, it slows down the entire process.\n\nSolana solves this problem by using a ‘stateless architecture’. As all the transactions are time-stamped, the entire network does not need to update itself for each transaction. The updates are processed sequentially, leading to an overall speeding up of the entire process.\n\n\n\nEthereum vs Solana transaction: Speed\n\nThe current version of Ethereum can process approximately 13-15 transactions per second. However, platforms like Polygon serve as a multi-chain Ethereum scaling platform. It helps increase the number of nodes in the network, thereby enhancing the transaction load.\n\nSolana, on the other hand, does not need Layer-2 solutions to speed up its transactions. It uses a Turbine block propagation protocol that breaks data into smaller fragments. This process, in turn, makes data transfer across the network an easy task. The entire mechanism helps the blockchain perform at a whopping 50,000 transactions per second.\n\n\n\nEthereum vs Solana: Smart contracts\n\nEthereum is considered to be Turing complete. This unique feature helps it support a variation in programmability, which helps it to create different smart contracts. Ethereum also uses Solidity as a base programming language for coding its smart contracts.\n\nOn the other hand, Solana uses Sealevel to manage its smart contracts. Compared to the traditional EVM-based contracts, Sealevel uses a stateless mode and contains only program logic.\n\n\n\nEthereum vs Solana: NFTs\n\n\n\nIf you are interested in NFTs, you probably have heard of Ethereum-based NFT marketplaces. OpenSea is a famous example in this respect. It runs on the ERC-721 and ERC-1155 standards and aims to build a vibrant open digital economy. This platform supports cryptocurrencies like Ethereum (ETH/WETH), SOL, USDC, and DAI. The wallets that support OpenSea are:\n\nMetaMask\n\nCoinbase Wallet\n\nWalletConnect\n\nPhantom\n\nGlow\n\nFortmatic\n\nKaikas\n\nBitski and many more\n\nFor minting NFTs on OpenSea, there is no fee. On the final sale, you must pay 2.5% as a service fee. There is also a Creator’s fee of 10%.\n\nSolSea is Solana’s NFT marketplace with integrated minting. It uses ALL.ART Protocol has embedded licenses called NFT-PROs for its non-fungible tokens. You can buy NFTs on this marketplace with fiat currencies using Moonpay or FTX Pay. The compatible wallets are:\n\nPhantom\n\nCoin98\n\nLedger\n\nSolflare\n\nTorus\n\nSollet\n\nSlope\n\nSolSea does not have bidding options like OpenSea, but they plan to implement them soon.\n\nThere is a 3% marketplace fee for every successful NFT sale. You can also choose your own creator’s fee.\n\nEthereum and Solana have transaction fees for minting, listing and delisting, which are not refundable. The method to open an account and mint NFTs is similar on both platforms.\n\n\n\nEthereum vs Solana: DeFi ecosystem\n\nEthereum has many decentralised finance applications that cater to billions of users. Top Ethereum DeFi apps are:\n\nMetaMask Swap\n\nSushi\n\nPolygon POS Bridge\n\nBungee\n\nLibera.Financial\n\nCowSwap\n\nHEX\n\nAave V2\n\nShibaSwap and many more\n\nComparatively, Raydium, Saber, Serum, etc., are a few DeFi apps available on Solana. Being new to the blockchain world, this platform’s DeFi ecosystem is yet to grow to a larger scale.\n\n\n\nEthereum vs Solana: Investment\n\n\n\nEthereum and Solana both have their pros and cons. The former has been an older player in this field and thus has a larger market cap than the latter. However, with its new technologies, Solana has addressed many issues that Ethereum users face.\n\nFirstly it’s the network congestion. On busy days, Ethereum transactions can be a real pain to process. Additionally, the higher gas fees are also an issue that needs addressing. However, with its vast DeFi marketplace, Ethereum gives its users many opportunities to diversify their assets.\n\nThe growth of Solana has been worth noticing, especially throughout 2021. It is too early to judge as the ecosystem is relatively new. However, it does have the potential to make its mark in the future.\n\nBoth the native tokens of Solana (SOL) and Ethereum (Ether) are available for purchase from the following exchanges:\n\nKuCoin\n\nBinance\n\nUphold and many more\n\nAs an investor, you should look at the opportunities present in both ecosystems. Conducting thorough research on these blockchains and planning your investment accordingly is the best way to proceed.\n\n\n\n\n\n"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2hvdy1ldGhlcmV1bS1nYXMtcHJpY2VzLXNvYXJlZC1kdWUtdG8tbWVtZWNvaW4tY3JhemUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "How Ethereum Gas Prices Soared Due to Memecoin Craze? - Analytics Insight",
        "content": "Ethereum gas prices surged to another level after the memecoin craze became more prominent and the talk of the town\n\nMemecoin Craze reaching its glory caused Ethereum gas prices to surge to another level. Last year’s merge to ETH 2.0 was supposed to fix high gas-fee issues, and while it went a long way in addressing them—recent buyer demand has shown that they can still become expensive. While ETH might not be the best investment right now when it comes to price action, it’s still the backbone of the defi token world and home to countless innovative projects on its blockchain. That’s why there will always be a place for ETH in the crypto world, and there should arguably always be a place for it as part of a diversified portfolio.\n\nNotably, prominent blue-chip NFTs like MAYC and Azuki drove the surge in NFT volume. DappRadar’s data indicated that over the past week, the volume of these NFTs increased by 29.9% and 129% respectively.\n\nMeanwhile, Ethereum’s native cryptocurrency, ETH, was trading at US$1,873 at press time. The coin’s MVRV (Market-Value-to-Realized-Value) ratio increased over the last month, suggesting that the profitability of addresses holding ETH is relatively high.\n\nThis could incentivize these address holders to sell and secure profits, potentially impacting the price of ETH shortly.\n\nLayer 2 Ethereum (ETH) solutions are gaining interest as they solve the scalability difficulties within Ethereum (ETH), which have resulted in high Ethereum (ETH) gas prices since 2020.\n\nEthereum (ETH) smart contract implementation on Layer 2 has increased by 160% yearly, indicating increased Ethereum (ETH) development activity. Some experts say sharding the Ethereum (ETH) network may also assist in cutting gas prices.\n\nFollowing the execution of the Shanghai update last week, approximately 1 million staked ETH worth more than US$2 billion were removed. The long-awaited update went live on April 12th, allowing the withdrawal of staked ETH. At the time of writing, the price of Ethereum (ETH) is rest at the US$1.8k barrier.\n\n5 ways to reduce the Ethereum gas prices\n\nUse Simulation Through DeFi Saver\n\nYou don’t know the actual gas fee until you carry out the transaction and pay for the gas. However, you could use the DeFi Saver app to simulate your transactions. First, you’ll create a recipe for Ethereum activities and then run it virtually.\n\nUse a Layer-2 Blockchain\n\nThe Ethereum Mainnet, also known as Layer One, is frequently congested, making transactions costly. Layer-two blockchains offer users the ability to scale up their transactions, and they do so by utilizing technologies such as Rollups and side chains.\n\nPick your transaction times carefully\n\nWhen it comes to Ethereum transaction fees, timing matters. According to gasprice.io, a handy resource for checking real-time gas fees, gas prices usually peak sometime between 8 a.m. and 1 p.m. Eastern Time. Saturdays and Sundays are usually the cheapest days to transact in ETH. A good rule of thumb is that the cheapest time to make ETH transactions is typically outside of working hours in the U.S. and Europe.\n\nUse DApps That Offer Rebates and Discounts\n\nOne of the easiest ways to avoid Ethereum gas fees is to use Ethereum projects and dApps that offer fee subsidies or nominal fees. If you are looking for such a platform, Balancer is a great one. The platform refunds the gas fees up to 90 percent in the form of BAL tokens. Balancer minimizes the gas fees for high-frequency traders by carrying out traders that don’t leave the vault.\n\nSort Transaction Types\n\nDepending on the sort of transaction, the gas fee varies on the Ethereum blockchain. To save money on gas fees, users may wish to organize and implement similar transactions simultaneously. Consider that they have two Ethereum addresses, each containing 1,000 tokens. Now, if users intend to store all tokens in a new DApp’s crypt to earn higher returns.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC90aGlzLWFpLWNvaW4taGFzLWEtYmlnZ2VyLWxvbmctdGVybS1ncm93dGgtcG90ZW50aWFsLXRoYW4tZXRoZXJldW0tZXRoLWFjY29yZGluZy10by10b3AtYW5hbHlzdHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "This AI Coin has a bigger long-term growth potential than Ethereum (ETH) according to top analysts - Analytics Insight",
        "content": "As the world witnesses the meteoric collision of artificial intelligence and blockchain technology, one project is emerging with the potential to revolutionize the investment landscape. InQubeta, a groundbreaking initiative, aims to harness the power of AI.\n\nWhile Ethereum has undoubtedly made its mark, InQubeta is positioned as a promising contender with a brighter futurel, as it bridges the gap between the two worlds of AI and web3. Here’s why…\n\nWhat Is InQubeta?\n\nThe InQubeta project is an exciting movement combining the power of artificial intelligence and the blockchain to create a transparent and inclusive investment ecosystem. By utilizing ETH and smart contracts, InQubeta aims to simplify and democratize the world of investments, particularly in the field of AI.\n\nTraditionally, investing in AI startups has been challenging for individuals who lack extensive resources or connections. InQubeta wants to change that by introducing fractional investment opportunities through QUBE tokens. These tokens serve as the currency within the platform and enable investors to participate in the growth of AI startups.\n\nThe InQubeta platform features an NFT marketplace that allows AI startups to raise funds and offer unique reward and equity-based NFTs. Investors holding QUBE tokens can easily navigate the marketplace and invest in projects that align with their interests and beliefs. This mutually beneficial ecosystem fosters collaboration between startups and investors, driving innovation and growth in the AI industry.\n\nQUBE tokens offer an exceptional investment opportunity for individuals passionate about the advancement of AI technology. These tokens follow a deflationary model, where a 2% tax is imposed on both buy and sell transactions, with the funds going into a burn wallet. Over time, this mechanism gradually increases the value of the tokens. Additionally, a 5% tax on sell transactions contributes to a dedicated reward pool, allowing investors to earn rewards by staking their tokens.\n\nInQubeta recognizes the potential of blockchain technology and smart contracts in creating a more transparent, secure, and democratic investment ecosystem. By embracing these technologies, the platform streamlines the investment process, benefiting both investors and startups alike. Investing in QUBE tokens and participating in the InQubeta platform allows individuals to support AI innovation and be part of the future of the industry.\n\nFor crypto investors seeking to diversify their portfolios, QUBE tokens and the InQubeta platform offer a unique investment opportunity. The platform provides fractional investment opportunities, allowing individuals to participate in the growth of AI technology through reward and equity-based NFTs. By leveraging the potential of AI and blockchain, InQubeta paves the way for a more accessible and inclusive investment landscape in the AI industry.\n\nVisit InQubeta Presale\n\nETH On The Other Hand…\n\nWhile we all know and love ETH, many experts are doubting its ability to grow exponentially in the next bull run, especially in comparison to InQubeta. If you think about it, ETH has been around for almost 9 years now, and many are speculating that its golden days have come and gone despite the potential for more updates in the future.\n\nETH has certainly made significant contributions to the world of blockchain and smart contracts. However, some analysts argue that InQubeta has even greater long-term growth potential in comparison.\n\nOne key factor in this argument is the unique value proposition offered by InQubeta’s QUBE tokens. While ETH has established itself as a leading cryptocurrency, its growth may be limited due to its maturity and the perception that its best days are behind it.\n\nFurthermore, InQubeta’s integration of blockchain technology and smart contracts creates a more transparent and inclusive investment ecosystem. By leveraging the power of AI and blockchain, InQubeta is paving the way for a new wave of innovation and collaboration in the AI industry.\n\nVisit InQubeta Presale\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZmluYm9sZC5jb20vdmFuZWNrLXByZWRpY3RzLWV0aGVyZXVtLXRvLXJlYWNoLTExODAwLWJ5LTIwMzAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "VanEck predicts Ethereum to reach $11,800 by 2030 - Finbold - Finance in Bold",
        "content": "Ethereum’s (ETH) recent hard fork, enabling users to withdraw staked Ether, is poised to position the cryptocurrency as a formidable contender against US treasury bills in the coming years, according to VanEck, a US asset manager controlling a $69 billion exchange-traded fund (ETF).\n\nBecause of this, along with expectations that ETH will account for 70% of smart contract protocols, the world’s second-largest cryptocurrency could hit $11,800 in 2030, VanEck said in its recently released Ethereum price prediction report.\n\n“Assuming ETH takes a 70% market among smart contract protocols, this implies a token price of $11.8k in 2030, which we discount to $5.3k today at a 12% cost of capital derived from ETH’s recent beta.” – VanEck wrote in the report.\n\nIf VanEck’s projections were to materialize, it implies that Ethereum would see a price increase of 531% by 2030 from its current levels.\n\nFurther, VanEck also sees ETH network revenues surging from an annual rate of $2.6 billion to as high as $51 billion in 2030.\n\nVanEck’s Calculations\n\nVanEck said the latest price forecast was made using cash flow projections and fully diluted valuation (FDV) calculations. More specifically, the fund manager evaluated Ethereum by estimating cash flows for the year that ended on April 30, 2030.\n\nThe asset manager arrived at its cash flow figures by projecting Ethereum revenues and deducting a global tax rate and a validator revenue cut. Then, VanEck said it used multiple estimates by applying a long-term estimated cash flow of 7%, minus the long-term crypto growth rate of 4%.\n\nFinally, the investment arrived at the FDV in 2030, divided that figure by the expected number of tokens in circulation, and discounted the final number by 12%.\n\nEthereum price analysis\n\nAt press time, ETH was changing hands at $1,870, down 1.82% in the past 24 hours.\n\nETH 1-day price data. Source: Finbold\n\nOver the past month, the cryptocurrency fell more than 6.2%, although its year-to-date gains remain strong at 55.8%.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL2RlY3JlYXNlZC1nYXMtZmVlcy1vbi1ldGhlcmV1bS1uZXR3b3JrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Decreased gas fees: Ethereum network sees significant drop in transaction costs - Cryptopolitan",
        "content": "The first week of June the crypto market experienced a sharp decline in Ethereum network gas fees, which fell to $7.34 from a peak of $20 in May. Miner Extractable Value (MEV) bot usage and the waning memecoin mania are blamed for the fall. This decrease in gas costs might benefit Ethereum and its native currency, ETH, in the long run.\n\nMemecoin frenzy and MEV bots contribute to lower gas prices on Ethereum\n\nAccording to on-data, the average gas price, or transaction fee, on the Ethereum network dramatically dropped in the first week of June after reaching a multimonth high in May. This occurred as a result of the memecoin frenzy and multiple maximal extractable value (MEV) bot activity.\n\nThe typical gas price is now $7.34, down almost a third from the peak of $20 last month. The market experienced the release of numerous new memecoins, including Aped (APED), Bobo Coin (BOBO), and others, as a result of the memecoin frenzy, which began in late April and gained prominence in May.\n\nSource: Dune Analytics\n\nAverage gas fees on Ethereum in the past six months. Source: Dune Analytics\n\nThere was an interesting movement in the top 10 gas-burning altcoins as a result of memecoins’ overwhelming dominance in network activity. Memecoins like Troll (TROLL), APED, and BOBO ranked in the top 10 spenders rather than ETH, Wrapped Ether (WETH), or Tether.\n\n⛽️ A highly unusual shift in top 10 gas burning #altcoins has emerged today. Instead of $ETH, $WETH, and $USDT being at the top of the fee distribution list, we're seeing new assets like $TROLL, $APED, and $BOBO among them. Read our latest deep dive. 👇 https://t.co/7SlmJ59k2m pic.twitter.com/Y2kaLKZTrL — Santiment (@santimentfeed) April 19, 2023\n\nAccording to the report, memecoins are becoming increasingly popular on decentralized platforms. As a result, mainstream centralized exchanges are taking longer to list them, which is another significant factor in the increase in Ethereum gas fees.\n\nNot only was the Ethereum memecoin craze in May, but Bitcoin Ordinals also saw a substantial increase in popularity. On the bitcoin blockchain, ordinals allow for decentralized storage of digital art. The bitcoin network, as a result, recorded numerous new memecoins, with Pepecoin (PEPE) reaching a $1 billion market cap.\n\nThe first Ordinals were released in January, and by the end of May, there were over 10 million inscriptions of them on the bitcoin blockchain. In May, the total fees paid for inscriptions on Ordinals increased by 700%, and they now stand at 1,639 Bitcoin.\n\nSource: Dune Analytics\n\nDue to the waning memecoin mania, Ethereum gas fees have been reduced and there have been sharp drops in both Ordinals inscriptions and gas fees.\n\nHow the rise of memecoins influenced Ethereum’s gas charges\n\nETH’s historically high gas prices have frequently discouraged users from utilizing the network, prompting them to investigate alternative protocols. However, the current drop in gas consumption may have favorable long-term effects for both Ethereum and ETH.\n\nEthereum is gassed up\n\nAccording to Dune Analytics, the daily average gas price for Ethereum dropped to its lowest point in the preceding two months. As of June 3, the national average gas price was 24 gwei; at press time, it was 17 gwei. Gas prices may have fallen as a result of the current hullabaloo surrounding memecoins, which has increased activity on the network. The use of MEV bots (Miner Extractable Value) may have also contributed to the decline.\n\nSource; Dune Analytics\n\nThe NFT Angle\n\nAutomated systems called MEV bots use transaction sequencing to take advantage of lucrative Ethereum network opportunities. By enhancing transaction execution, these bots’ ubiquity may have an effect on gas prices, possibly lowering user expenses.\n\nLow gas prices made it possible for the Ethereum protocol to have consistent gas usage. The quantity of NFT trades on the Ethereum network also increased at the same time.\n\nSource; Santiment\n\nNotably, the increase in NFT volume was driven by well-known blue-chip NFTs like MAYC and Azuki. According to DappRadar’s data, these NFTs’ volume climbed by 29.9% and 129%, respectively, over the previous week.\n\nAt the time of publication, the price of ETH, the native crypto of Ethereum, was $1,873. The coin’s MVRV (Market-Value-to-Realized-Value) ratio grew over the previous month, indicating that addresses holding ETH are profitable to some extent.\n\nThis would encourage the owners of these addresses to sell and collect gains, which might have an effect on the price of ETH soon.\n\nShapella hard fork and ETH’s price surge: Uncertain impact\n\nHopes that ETH would prosper after switching from a proof-of-work (PoW) to a proof-of-stake (PoS) consensus mechanism were dashed, at least temporarily. The price of the coin dropped by 25% in the three months from the date of The Merge to the beginning of 2023, and it didn’t recover to its pre-transition levels until six months later.\n\nThe price of ETH threatened to surpass $2,000 for the first time since May 2022 after the Shapella hard fork on April 12, 2023, but given the post-Merge depression, it is unclear what effect the move will have on the price of the coin.\n\nFollowing a planned takeover by Binance (BNB) and its eventual cancellation, the FTX (FTT) exchange filed for bankruptcy in November 2022, causing a market drop that negatively impacted ETH."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tL3BvbHlnb24tdnMtb3B0aW1pc20tZW5oYW5jZW1lbnRzLXRvLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Polygon vs Optimism: How Do They Provide Enhancements to Ethereum? - Cryptopolitan",
        "content": "In the ever-evolving landscape of blockchain technology, scalability solutions have come to the fore as the key to widespread adoption. Ethereum, one of the leading smart contract platforms, has given birth to an array of Layer 2 solutions, two of which are Polygon and Optimism. Both of these platforms provide enhancements to Ethereum’s scalability, transaction speed, and cost-efficiency, albeit through distinct approaches.\n\nThis article will delve deep into both technologies, exploring their architecture, scalability solutions, transactional efficiencies, security measures, and more. We will also compare these platforms head-to-head, allowing you to understand which might better serve your needs in the diverse world of decentralized applications.\n\nPolygon vs Optimism: Major Differences\n\nPolygon, formerly known as Matic Network, is an Ethereum-compatible blockchain network designed to provide a platform for Ethereum scaling and infrastructure development. It transforms Ethereum into a fully-fledged multi-chain system by leveraging layer 2 technologies.\n\nOptimism, also known as Optimistic Ethereum, is another layer 2 scaling solution that increases the scalability of the Ethereum network, significantly reducing transaction costs and enhancing speeds. It uses a technology called Optimistic Rollups to accomplish these benefits.\n\nPolygon offers the Proof of Stake blockchain network as its primary product. This network serves as a layer 2 and a layer 1 blockchain aimed at reducing transaction fees and improving confirmation speeds for Ethereum. Since Polygon has its own consensus mechanism and deals with transaction security issues like double spends and 51% attacks, it can be considered as a layer 1 blockchain.\n\nHowever, Polygon is also classified as a layer 2 blockchain because it addresses Ethereum’s congestion problem and enables asset bridging through plasma checkpoint-enabled bridges. To achieve this, Polygon uses smart contracts in its Ethereum layer to connect to the Ethereum network.\n\nPolygon’s architecture includes two layers: Heimdall and Bor. Heimdall is the proof of stake layer where block finalization and transaction validation happen. The Merkle root hash is published on the Ethereum Blockchain as well. The Bor layer’s responsibility is to produce blocks by collecting all the transactions. The Heimdall layer validates these blocks.\n\nOn the other hand, Optimism is a layer 2 blockchain protocol that operates independently from Ethereum. Its purpose is to alleviate congestion on Ethereum and assist with its scaling. Optimism achieves this by processing transactions and grouping them into batches, which are then verified on the Ethereum network. However, it is important to note that Ethereum still incurs costs for validating these transactions. Despite this, Optimism’s transaction fees are significantly lower than Ethereum’s.\n\nThe Optimism network is a layer 2 network that operates under the assumption that transactions are valid and not fraudulent, hence the term “optimistic.” However, if a transaction is found to be invalid, there is a 7-day window to challenge it before it becomes permanent and considered valid.\n\nUnderstanding the Technology Behind Polygon and Optimism\n\nPolygon and Optimism are both Ethereum Layer 2 solutions. Layer 2 refers to a secondary framework or protocol built on top of an existing blockchain. The main goal of these technologies is to solve the transaction speed and scalability issues that currently exist in the Ethereum network.\n\nPolygon uses a technology known as ‘secured chains’ and ‘standalone chains’ based on the Ethereum protocol. It implements a four-layer system comprising the Ethereum layer, security layer, Polygon Networks layer, and Execution layer.\n\nOptimism uses Optimistic Rollup technology. It’s a Layer 2 solution that operates on top of the Ethereum blockchain, where computation is handled off-chain and data is stored on-chain. Optimism inherits the same security guarantees as Ethereum.\n\nHow do they achieve scalability?\n\nPolygon achieves scalability by utilizing side chains for off-chain computations while ensuring asset security using the Plasma framework and a decentralized network of Proof-of-Stake (PoS) validators.\n\nOptimism improves scalability by running smart contracts off-chain and only posting a small amount of data per transaction to the Ethereum mainnet. This approach significantly increases transaction throughput.\n\nTransaction Speed and Cost\n\nPolygon provides a higher transaction speed due to its unique layered architecture. Optimism, while faster than Ethereum, still trails behind Polygon in raw throughput.\n\nBoth platforms offer significantly reduced transaction costs compared to Ethereum. However, due to the batch processing of transactions, Polygon tends to be cheaper than Optimism.\n\nSecurity Measures\n\nPolygon combines the Plasma framework and PoS consensus mechanism to ensure security. It also includes optional ‘checkpoints’ to the Ethereum main chain for added security.\n\nOptimism leverages the security of the Ethereum mainnet by posting transaction data (not computation) to the chain, allowing disputes to be resolved as per Ethereum’s consensus rules.\n\nTherefore, Optimism is more secure than Polygon because Optimism is built on Ethereum which has a larger number of validator nodes compared to Polygon. This means that all transactions on Optimism are validated and finalized on Ethereum, which is one of the most secure cryptocurrencies in the world after Bitcoin.\n\nOptimism, being a layer 2 built on the security of Ethereum, also has strong security. However, this does not imply that Polygon has poor security, as it is a network protocol with good security measures in place.\n\nNetwork Consensus Models\n\nPolygon employs a PoS consensus mechanism with validators who stake tokens for network security. It also utilizes Heimdall and Bor for block production and validation.\n\nOptimism does not have its own consensus mechanism. Instead, it relies on the underlying Ethereum network’s consensus protocol.\n\nDeveloper Experience\n\nPolygon provides a variety of developer-friendly tools like the Polygon SDK, and fosters a vibrant community. It is compatible with Ethereum tools, reducing the learning curve for developers.\n\nOptimism also supports Ethereum tooling and community infrastructure, providing a seamless experience for developers already familiar with the Ethereum ecosystem.\n\nExploring Decentralization: Optimism vs Polygon\n\nPolygon is more decentralized than Optimism, particularly because Optimism has one node called the sequencer. The sequencer is the block producer of Optimism; it submits all transactions from the Optimistic network to Ethereum.\n\nOptimism also remains decentralized as users can submit transactions to Ethereum through the CanonicalTransactionChain smart contract. However, linking Optimism to Ethereum through the smart contract eliminates the advantage of using Optimism instead of Ethereum, as individuals would have to pay the complete Ethereum transaction fee.\n\nOptimism is a network that maintains a degree of decentralization because it’s built on Ethereum’s decentralized platform. On the other hand, Polygon is made up of two layers, Heimdall and Bor, which makes it more decentralized compared to Optimism.\n\nAs Polygon operates on a proof of stake model, validation of transactions is carried out by validator nodes that are under the control of different parties. On the other hand, validation of blocks is the responsibility of Heimdall nodes, which are individual nodes chosen to validate the blocks produced by the Bor layer.\n\nAdoption and Use-cases\n\nPolygon hosts several high-profile projects, including Aavegotchi, Polymarket, and QuickSwap, showcasing its versatility in DeFi, NFT, and DAO applications. Notable projects on Optimism include Uniswap and Synthetix, reflecting its capability to handle complex financial applications.\n\nFuture Roadmap\n\nPolygon aims to continue its efforts to expand and diversify its multi-chain ecosystem. It plans to invest in ZK-based solutions, privacy-preserving technologies, and data availability solutions. Optimism plans to further enhance its infrastructure, interoperability, and developer tooling. It also aims to remove the current whitelisting of contracts, opening the platform for broader use.\n\nAdvantages and Limitations\n\nPolygon’s advantages include high scalability, low transaction costs, and Ethereum compatibility. However, it faces criticism over centralization concerns due to its PoS consensus and validator system.\n\nOptimism also offers reduced gas fees and increased transaction speed while maintaining Ethereum-level security. The main disadvantage is the current seven-day withdrawal period due to fraud proofs, which may be a hindrance for some applications.\n\nDeeper Dive into the Technology\n\nPolygon’s architecture includes four main layers. The Ethereum layer enables communication with Ethereum, while the security layer provides validators for PoS consensus. The Polygon Networks layer consists of PoS blockchains and other chains secured by the security layer. The execution layer executes smart contracts and processes transactions.\n\nOptimism uses an architecture known as Optimistic Rollups, which allows it to run computations off-chain and store the results on-chain. This offloading reduces the load on the Ethereum network, improving scalability and speed.\n\nThe Role of Native Tokens\n\nMATIC, the native token of Polygon, is used for transaction fees and participation in the network’s PoS consensus mechanism. It also empowers users to participate in network governance. In Optimism, ETH is used to pay for transaction fees, just like on Ethereum. The gas fee model is identical to Ethereum’s EIP-1559 model, ensuring fee predictability and improved user experience. Optimism has a native token with the ticker OP. It is used for rewards and governance.\n\nInteroperability\n\nPolygon is designed to provide full Ethereum interoperability. It supports Ethereum standards and protocols, which allows for seamless interaction between assets and applications across both ecosystems.\n\nOptimism also offers full Ethereum interoperability. All Ethereum smart contracts can be directly ported to Optimism, preserving the connections and functionalities of Ethereum’s rich ecosystem.\n\nGovernance\n\nPolygon uses a DAO model for governance, allowing MATIC token holders to propose and vote on network upgrades, modifications, and other important decisions. Optimism is also governed through a DAO model. OP is the project’s primary token. It’s used for governance, with OP holders voting on key decisions. It’s also distributed as rewards to supporters of the Optimism ecosystem and to finance future Optimism-based projects.\n\nCommunity and Partnerships\n\nPolygon has a large and active community, and it has forged partnerships with prominent blockchain projects like Chainlink, Decentraland, and Aave, among others. Optimism’s community is vibrant and growing, thanks to its ties to the Ethereum community. It also has partnerships with major projects like Uniswap and MakerDAO.\n\nConclusion\n\nPolygon and Optimism both represent crucial advancements in Ethereum’s Layer 2 solutions, bringing significant improvements to the blockchain’s scalability and transaction efficiency. These platforms aim to preserve Ethereum’s decentralization and security while paving the way for mass adoption through higher transaction throughput and lower costs.\n\nWhether it’s Polygon’s flexible Layer 2 chains or Optimism’s Optimistic Rollups, both solutions have their own unique merits and limitations. The choice between them largely depends on the specific requirements of the users or developers. As the blockchain landscape continues to evolve, Polygon and Optimism will undoubtedly play pivotal roles in shaping Ethereum’s future.\n\nChoosing between Polygon and Optimism depends largely on your specific needs. Both offer scalable solutions with reduced transaction costs. If high throughput is your priority, Polygon may be the better choice. If maintaining security levels comparable to Ethereum is paramount, Optimism may be more suitable."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmNyeXB0b3BvbGl0YW4uY29tLzMwLXF1ZXN0aW9ucy1hbmQtYW5zd2Vycy1hYm91dC16a3N5bmMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "30 Questions and Answers about ZkSync, Layer-2 Solution for Ethereum - Cryptopolitan",
        "content": "Layer-2 solutions such as ZkSync are emerging as critical components for scalability and efficiency. Built on the principles of zero-knowledge proofs, ZkSync aims to improve transaction speed and decrease costs without sacrificing the security of the Ethereum mainnet.\n\nThis Cryptopolitan guide gives you in-depth information about ZkSync, addressing a range of questions about its capabilities, features, challenges, and potential use cases.\n\nWhat is ZkSync?\n\nZkSync is a Layer-2 scaling solution designed for Ethereum, the world’s second-largest blockchain platform by market capitalization. It is designed to bring a Visa-scale level of throughput to Ethereum while preserving the strong security properties of Layer-1. ZkSync utilizes zkRollups technology, a zero-knowledge proof methodology that allows for increased data privacy and transaction scalability.\n\nHow does ZkSync operate as a Layer-2 solution for Ethereum?\n\nAs a Layer-2 solution, ZkSync processes transactions off the main Ethereum chain, hence, significantly improving transaction speed and reducing costs. It bundles multiple operations into a single proof, which is then posted to the Ethereum mainnet. This method greatly enhances Ethereum’s transaction capacity without overloading the network.\n\nWhat technology underpins ZkSync?\n\nZkSync is built on a technology known as zkRollup. ZkRollup is a Layer-2 scaling solution that uses zero-knowledge proofs to validate all transactions off-chain, while storing only the minimal data on-chain. It’s a way to perform many computations off-chain while ensuring the security of the main Ethereum network.\n\nHow does ZkSync enhance transaction speed on the Ethereum network?\n\nZkSync enhances transaction speed by processing transactions off-chain. Instead of each transaction needing to be processed by every node on the Ethereum network, ZkSync aggregates multiple transactions into a single proof that is posted on-chain. This means transactions can be confirmed much faster.\n\nCan ZkSync address Ethereum’s high gas fees issue?\n\nYes, ZkSync can address Ethereum’s high gas fees. By moving transactions off-chain, ZkSync drastically reduces the amount of computational work that needs to be done on the Ethereum mainnet, leading to lower gas fees. Transactions are processed in batches, meaning users only have to pay a fraction compared to executing transactions directly on Ethereum.\n\nWhat is the role of zkRollups in ZkSync’s operation?\n\nZkRollups play a vital role in ZkSync’s operation. They allow for the aggregation of multiple transactions into a single proof that can be verified on-chain. ZkRollups maintain the security of the Layer-1 blockchain while increasing transaction throughput. All the transaction data is available on-chain but the computation and storage are performed off-chain, providing a balance of efficiency and security.\n\nHow does ZkSync contribute to the scalability of Ethereum?\n\nZkSync significantly enhances Ethereum’s scalability. It achieves this by taking most of the computational and storage load off of Ethereum’s Layer-1, processing transactions off-chain, and then posting a single proof to the Ethereum network. This allows more transactions to be processed per second, thereby contributing to the scalability of Ethereum.\n\nCan ZkSync support smart contracts?\n\nMatter Labs, the team behind ZkSync, announced plans for ZkSync 2.0, which is expected to support EVM-compatible smart contracts. This feature would allow developers to write and deploy smart contracts just as they would on Ethereum’s mainnet, but with the scalability benefits of ZkSync.\n\nWhat are the potential use cases for ZkSync?\n\nZkSync can be used for a variety of applications that require high transaction throughput and lower fees. These can include decentralized exchanges, gaming platforms, and other decentralized applications (dApps) that need to manage a high volume of transactions. It’s also useful for microtransaction scenarios, such as pay-per-use services, where the high fees on the Ethereum mainnet would otherwise make such transactions prohibitively expensive.\n\nHow is security maintained in ZkSync?\n\nSecurity in ZkSync is maintained through the use of zero-knowledge proofs and the inherent security of the Ethereum mainnet. With zkRollups, all the data necessary to prove the validity of each transaction is stored on-chain, while the computation is performed off-chain. This ensures that even if the Layer-2 system were to fail, users could still recover their assets directly from the data stored on the Ethereum blockchain.\n\nIs ZkSync interoperable with other blockchains?\n\nWhile ZkSync is specifically designed as a Layer-2 solution for Ethereum, the principles behind its design could potentially be applied to other blockchains that support smart contracts and have similar architecture to Ethereum. However, each implementation would require careful consideration of the unique characteristics and security models of the underlying blockchain.\n\nWhat makes ZkSync unique compared to other Layer-2 solutions?\n\nZkSync stands out due to its implementation of zkRollups, providing a unique balance between security, scalability, and decentralization. It provides high throughput without sacrificing the strong security of Ethereum’s Layer-1. Another distinctive feature is its anticipated support for EVM-compatible smart contracts, enabling existing Ethereum developers to deploy their applications on ZkSync with minimal changes.\n\nWhat role does zero-knowledge proof technology play in ZkSync?\n\nZero-knowledge proof technology plays a fundamental role in ZkSync. It’s the mechanism that allows ZkSync to validate transactions off-chain, reducing the computational load on the Ethereum network. In ZkSync, this principle is used to prove the validity of transactions without having to process each transaction on the Ethereum mainnet.\n\nHow does ZkSync handle consensus and validation of transactions?\n\nIn ZkSync, transactions are initially processed off-chain by validators who maintain the state of the ZkSync network. These validators batch multiple operations together into a single zkRollup proof, which is then posted to the Ethereum mainnet. The Ethereum network then validates this proof, reaching consensus on the updated state of the ZkSync network. This process ensures both efficiency and security for the ZkSync Layer-2 system.\n\nWhat are the limitations or challenges of using ZkSync?\n\nOne potential limitation of ZkSync, and Layer-2 solutions in general, is the additional complexity they introduce. Users and developers must understand how to interact with a Layer-2 system on top of the underlying Layer-1 blockchain. Another challenge lies in achieving widespread adoption: for Layer-2 solutions to be effective, they must be widely used, which requires integration with wallets, exchanges, and other parts of the blockchain ecosystem. Also, while Layer-2 solutions can drastically improve scalability, they still rely on the underlying Layer-1 for security and finality.\n\nIs ZkSync suitable for enterprise applications?\n\nZkSync, with its enhanced scalability and lower transaction fees, can certainly be suitable for enterprise applications. For businesses requiring a high volume of transactions, particularly those that are considering the use of Ethereum for its robust smart contract capabilities, ZkSync could provide the scalability solution needed to make such applications practical. However, each enterprise has unique needs and should consider the implications of Layer-2 solutions carefully.\n\nHow can ZkSync enhance privacy and confidentiality in blockchain transactions?\n\nZkSync uses zero-knowledge proofs, a cryptographic technology that can provide enhanced privacy. The technology allows validators to verify transactions without needing to know the content of the transactions themselves. However, it’s important to note that like Ethereum, ZkSync is not designed to be a privacy-centric blockchain where transaction details are hidden. The details of transactions are transparent, but the technology provides certain privacy-enhancing characteristics.\n\nWhat are the costs associated with using ZkSync?\n\nBy processing transactions off-chain, ZkSync can greatly reduce the transaction fees of the Ethereum network. Instead of paying gas fees for every single transaction, users in ZkSync pay fees only when they deposit into or withdraw from the Layer-2 environment. Within ZkSync, transaction fees are paid in the token being transacted, which can provide a more predictable and user-friendly experience.\n\nHow does ZkSync handle token transfers and asset management?\n\nZkSync can handle token transfers and asset management much like Ethereum, but more efficiently. Any ERC-20 or ERC-721 token can be sent on ZkSync just like on the Ethereum mainnet, but with higher speed and lower costs. This makes it a compelling solution for applications involving frequent token transfers or complex asset management, like decentralized exchanges or gaming platforms.\n\nHow does ZkSync address the issue of transaction finality?\n\nZkSync relies on the security and finality of the underlying Ethereum Layer-1. Once a zkRollup proof is posted and accepted on Ethereum, the transactions included in that proof are considered finalized. By tying the finality of transactions to Ethereum, ZkSync leverages the robust security and decentralized nature of the Ethereum network.\n\nWhat are the potential risks associated with ZkSync?\n\nAs with any Layer-2 solution, there are potential risks associated with ZkSync. One risk involves user error: if users are not familiar with the workings of Layer-2, they could make mistakes when interacting with it. Also, there could be smart contract bugs or vulnerabilities in the Layer-2 solution itself, though such risks are mitigated through rigorous auditing and formal verification. Finally, there’s always the risk of insufficient adoption, which could limit the utility of ZkSync.\n\nHow does ZkSync impact decentralization in Ethereum’s network?\n\nZkSync is designed to preserve the decentralization of the Ethereum network. By offloading computational work from Ethereum, ZkSync can help ensure that running an Ethereum node remains feasible for as many participants as possible, thereby supporting the decentralization of the network. Meanwhile, ZkSync’s reliance on Ethereum for security and finality means that it does not introduce additional points of centralization.\n\nHow is ZkSync different from other zkRollup solutions?\n\nZkSync sets itself apart from other zkRollup solutions through a focus on user and developer experience, including planned support for EVM-compatible smart contracts. ZkSync also emphasizes security, using a process of rigorous testing, formal verification, and third-party audits to minimize the risk of smart contract bugs or other vulnerabilities. Furthermore, the team behind ZkSync has a strong commitment to open-source development and community engagement, which helps foster a healthy ecosystem around the project.\n\nAre there any regulatory considerations specific to ZkSync implementations?\n\nRegulatory considerations for ZkSync implementations will largely be similar to those for other blockchain and Layer-2 technologies. These could include considerations around the transmission of digital assets, privacy regulations, and potential securities law implications for certain types of transactions. As with any blockchain technology, it’s important to consider the regulatory landscape of the specific jurisdictions in which the technology will be used.\n\nCan ZkSync achieve the same level of security as Ethereum’s Layer-1?\n\nZkSync is designed to inherit the security of Ethereum’s Layer-1. By leveraging zkRollup technology, it ensures that all transaction data is stored on-chain, even though computation and storage are performed off-chain. This means that even in the event of a failure of the Layer-2 system, users would still be able to recover their assets based on the data stored on the Ethereum mainnet.\n\nHow does ZkSync impact user experience in blockchain applications?\n\nZkSync can significantly improve the user experience in blockchain applications by providing faster transaction confirmation times and lower fees. It also enables users to pay transaction fees in the token they are transferring, instead of having to hold and pay fees in ETH. Furthermore, with its planned support for EVM-compatible smart contracts, ZkSync will allow developers to create more complex applications, further enhancing the potential user experience.\n\nWhat are the future developments and trends in ZkSync technology?\n\nThe most significant future development for ZkSync is the introduction of ZkSync 2.0, which is expected to support EVM-compatible smart contracts. This will allow developers to write and deploy smart contracts in a similar way to Ethereum, but with the benefits of Layer-2. Beyond that, the team behind ZkSync is continuously working on enhancing its technology, and we can expect further advancements in scalability, security, and usability as the project evolves.\n\nCan ZkSync handle network congestion and scalability issues?\n\nYes, ZkSync is specifically designed to address network congestion and scalability issues. By processing transactions off-chain and aggregating them into zkRollup proofs posted on the Ethereum mainnet, ZkSync significantly improves the scalability of the Ethereum network, reducing congestion and allowing for a higher throughput of transactions.\n\nWhat are some notable projects or companies that are using ZkSync?\n\nSeveral notable projects and companies are utilizing ZkSync for their blockchain applications. Some examples include 1Inch, a decentralized exchange aggregator that picks the cheapest crypto prices; Mini Mini Dungeon, a layer-2 play-to-earn game; and Forward Protocol, the WordPress for Web 3.0. These projects leverage ZkSync to enhance transaction speed, reduce costs, and provide a better user experience.\n\nHow can developers build on ZkSync?\n\nDevelopers can build on ZkSync by utilizing the developer documentation, tools, and SDKs provided by the ZkSync team. They can leverage the ZkSync software development kit to integrate ZkSync functionality into their applications, enabling faster and more cost-effective transactions. The ZkSync ecosystem also encourages collaboration and community engagement, offering support and resources for developers looking to leverage the capabilities of ZkSync in their projects.\n\nConclusion\n\nZkSync is a pioneering Layer-2 solution, introducing innovative ways to enhance Ethereum’s scalability while preserving its inherent security. As the world of blockchain technology continues to mature and evolve, solutions like ZkSync are set to play a pivotal role in shaping the future of digital transactions, applications, and services. By understanding the nuances of ZkSync, we can better appreciate the potential of Layer-2 solutions and their capacity to address some of the most pressing issues within the blockchain ecosystem."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vYmxvY2t6ZWl0LmNvbS9uZXctMTAweC1tZW1lLWNvaW4td2lsbC1vdXRzaGluZS1ldGhlcmV1bS1ldGgtYW5kLWxpdGVjb2luLWx0Yy1pbi0yMDIzLWFjY29yZGluZy10by10b3AtYW5hbHlzdHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "New 100x Meme Coin Will Outshine Ethereum (ETH) and Litecoin (LTC) in 2023 According to Top Analysts - Blockzeit",
        "content": "The year 2023 has surpassed the expectations of crypto enthusiasts and analysts by breaking records. Moreover, the launch of many new cryptocurrencies has sweetened the deal. With the market gearing up for the third quarter of 2023, many crypto experts feel that its DigiToads moment to shine as the best cryptocurrency to invest in.\n\nAs investors seek guidance on which crypto to buy today for long-term gains, this emerging trend in meme coins presents a unique opportunity. Analysts foresee it surpassing the established cryptocurrencies in terms of popularity and market performance, signaling a shift in the crypto landscape.\n\nWhen it comes to most old market favorites, such as Litecoin and Bitcoin, they are blindly trusted by crypto users. These cryptos had been launched a decade back and might be old but one cryptocurrency that has given these projects tough competition is DigiToads. It is one of the ERC 20 tokens that has grabbed global attention with its next-gen features and unique economic framework. Analysts are impressed by its varied utilities and it has raised millions in its presale.\n\nDigiToads has Set the Market on Fire\n\nDigiToads has made a name for itself because of its unique features. Its economic design sports the utility of three types of cryptocurrencies – a play-to-earn, meme coin, and stake-to-earn portal. Thus, you don’t have to switch from one platform to the other to stake cool NFTs, play Web3 games, and trade tokens. You can do this and a lot more.\n\nTOADS, its native token will enable the users to access these opportunities. Additionally, TOADS token holders are going to be eligible for rewards every month that will be added to their wallets. Apart from these, users can also win prize draws and giveaways. Taking these features into account, it isn’t surprising to see the DeFi project features on the list of top altcoins of analysts and experts.\n\nDigiToads has established itself as a worthy contender in the evolving crypto space by transcending the limitations of standard meme coins. Its gaming platform lets users collect and nurture their digital amphibians competing against others for achieving the largest and most formidable creatures.\n\nDigiToads is backed by a strong foundation, making sure its gaming ecosystem caters to an extensive range of user preferences and fosters its future growth. Its presale growth mechanism enables early investors to benefit from the potential success of the project. DigiToads is presently in its presale stage and has already raised more than $4.6 million. It’s the perfect time for those who are looking for the best cryptocurrency to invest in.\n\n>> Buy DigiToads Now <<\n\nDrop in the Demands of Litecoin and Ethereum\n\nBoth Litecoin and Ethereum have experienced a notable drop in demand recently, albeit for different reasons. Litecoin, often considered the silver to Bitcoin’s gold, has faced challenges due to increased competition from other altcoins offering similar features and improved scalability. Regardless of its several advantages, the token’s foundation faces strong competition from other projects in the market. Litecoin has been working diligently to stay ahead of Ethereum and other competitors.\n\nEthereum is still a dominant force in the crypto space. Its new developments promise increased efficiency, growth, and security that can solidify its position as the top platform for decentralized applications and smart contracts. However, Ethereum, a leading smart contract platform, has encountered scalability issues, leading to high gas fees and slower transaction times. This has resulted in users seeking alternatives that offer faster and more cost-effective solutions. The Ethereum network is striving to address these issues. Its failure to address these issues can lead to a decrease in its market share. This, in turn, can cause its popularity to drop.\n\nBottom Line\n\nIn case you are struggling to find out which crypto to buy, you can consider DigiToads. Among Litecoin and Ethereum, analysts predict that it is DigiToads, which has the highest potential. What makes it the best cryptocurrency to invest in is the financial freedom that users get to enjoy with it. Be it trading, staking, or playing Web3 games, users can explore the opportunity as much as they want and then leverage it to create a steady source of passive income.\n\n>> Buy DigiToads Now <<"
    }
]