[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8wOS9jb2luZGVzay10dXJucy0xMC1ob3ctdGhlLWRhby1oYWNrLWNoYW5nZWQtZXRoZXJldW0tYW5kLWNyeXB0by_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDUvMDkvY29pbmRlc2stdHVybnMtMTAtaG93LXRoZS1kYW8taGFjay1jaGFuZ2VkLWV0aGVyZXVtLWFuZC1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "CoinDesk Turns 10: 2016 - How The DAO Hack Changed Ethereum and Crypto - CoinDesk",
        "content": "What was lost in the shift from DAO to ICOs was any sort of expert oversight or vetting, Jentzch argues. “The DAO was kind of a mix of the wisdom of the crowd and these mature investors who were doing due diligence, and know what they’re doing. Something like 50% [of investors] were retail and small holders, and roughly 50% was owned by 51 people. The idea was projects will go to the DAO, and they won’t just get a check, they’ll get a smart contract that sends money over time.”"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA1LzA4L3doeS1jcnlwdG8tcGx1bmdlZC1vbi1tb25kYXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Plunged on Monday - The Motley Fool",
        "content": "What happened\n\nThe crypto market had a turbulent weekend, which has extended into trading on Monday. The drop has been caused by some insiders selling Ethereum (CRYPTO: ETH) and Bitcoin (CRYPTO: BTC) transactions slowing to a crawl.\n\nAt 2:40 p.m. ET on Monday, Bitcoin has dropped 5.3% in the last 24 hours, Ethereum is down 5%, and Dogecoin (CRYPTO: DOGE) has lost 7.8% of its value. A lot of altcoins are down by double digits, so this is the best corner of the market right now.\n\nSo what\n\nThe drop in Ethereum really started on Saturday when the Ethereum Foundation transferred nearly $30 million of tokens to the Kraken exchange, indicating they may sell tokens to fund operations, which the organization does periodically. This selling pressure is something traders were getting out in front of over the weekend, and that continues today.\n\nBitcoin fell in part because on Sunday, Binance temporarily closed withdrawals. The Bitcoin network was extremely congested, and on Sunday, there were 395,000 transactions waiting to be confirmed. According to Coindesk, the average transaction fee on the Bitcoin network jumped from $1.20 last week to $20 on Monday, which was the first time it hit that level since Bitcoin was over $60,000.\n\nDogecoin is one of the most emblematic memecoins or altcoins, and it's following its larger competitor today. But it's only down a small amount compared to the altcoins down double digits today.\n\nNow what\n\nThe last few months have seen a rapid recovery across cryptocurrency assets, and some of the drop today may simply be profit-taking. New tokens like Pepecoin have captured the market's attention and skyrocketed, but that euphoria rarely lasts.\n\nAt the same time, some of the biggest problems with crypto's wider adoption are being seen in just the last few days. Gas fees on Ethereum, which are the fees paid to complete a transaction, have gone up, and Bitcoin is facing the same problem. High fees make crypto almost unusable for anything but the largest transactions, and that's long been a criticism of the industry.\n\nI also think we need to be aware of what Binance does in crypto. When companies like FTX and Celsius froze withdrawals, it was a sign of future collapse. That hasn't happened at Binance, but as the largest crypto exchange, it's a critical cog to the industry.\n\nThe crypto industry seems to be in much better shape than it was a year ago before a lot of leverage was exposed in the ecosystem, but that doesn't mean there won't be similar drops in the market. That's what investors were concerned about, given the activities on Ethereum and Bitcoin. Whether they will have long-term impacts will take time to tell."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1nYXMtc2t5cm9ja2V0aW5nLWFzLXRyYWRlci1wYWlkLTY0LWV0aC1pbi1mZWVzLXdoYXRzLWhhcHBlbmluZ9IBW2h0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1nYXMtc2t5cm9ja2V0aW5nLWFzLXRyYWRlci1wYWlkLTY0LWV0aC1pbi1mZWVzLXdoYXRzLWhhcHBlbmluZz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Ethereum Gas Skyrocketing as Trader Paid 64 ETH in Fees, What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum (ETH) blockchain network is giving traders enormous concerns at this time as the incidence of skyrocketing gas fees appears to be returning. According to a shared insight from crypto analytics service provider WhaleAlert, one trader paid as much as 64 ETH worth approximately $118,600 at the time of writing in fees for a single transaction.\n\nAdvertisement\n\n💸 A fee of 64 #ETH (119,121 USD) has just been paid for a single transaction!https://t.co/3w4UD0AZbw — Whale Alert (@whale_alert) May 8, 2023\n\nThe high gas fee is not a new thing on the Ethereum network; however, it is notably rare since the transition from the proof-of-work (PoW) protocol to proof-of-stake (PoS) through The Merge. While not an immediate dividend, the high gas fee was one of the major considerations for transitioning the protocol to PoS. The rationale is that a different transaction validation method can help in decongesting the network effectively.\n\nWith the high gas fees being recorded at the moment, the opposite appears to be the case. The cause may be linked to the massive meme coin hype that stirred intense network activity, causing a clog during the weekend.\n\nThis network activity reached a peak when Binance exchange listed PEPE tokens as well as Floki Inu for trading on its platform. This congestion, fueled in part by panic selling by whales and the accompanying soaring prices may reduce the gains accrued by these meme coins, especially for retail traders.\n\nPlace of Layer 2 solutions\n\nThe skyrocketing price of gas fees on Ethereum contributed to the birthing of innovative Layer 2 protocols like Polygon zkEVM, Arbitrum and Optimism. While the transaction fees on these protocols are a fraction of what it costs on the main Ethereum chain, users still bypass these L2s to carry out transactions on Ethereum.\n\nThe rationale for this remains unclear, but with innovative or community-focused protocols building on Ethereum mainnet, it generally becomes quite difficult for L2s to serve the purpose for which they are designed, lowering gas fees and championing scalability."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hYXZlLXYzLWxhdW5jaGVzLW9uLWV0aGVyZXVtLWxheWVyLTItbmV0d29yay1tZXRpc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Aave v3 launches on Ethereum layer-2 network Metis - Cointelegraph",
        "content": "Decentralized liquidity protocol Aave has deployed on Ethereum layer-2 scaling platform Metis, bringing a host of decentralized finance (DeFi) features and products to its ecosystem.\n\nAave’s (AAVE) community recently voted in favor of a proposal deploying on zero-knowledge Ethereum Virtual Machine (zkEVM) platform zkSync Era, paving the way for the DeFi protocol to tap into powerful performance improvements delivered by the scaling infrastructure.\n\nA number of different zk-proof-powered layer-2 protocols are being developed by Ethereum ecosystem participants, providing developers with a choice of infrastructure to scale their respective platforms.\n\nWhile Aave has yet to deploy on zkSync Era, it has announced its deployment of v3 of its protocol on Optimistic Rollup scaling protocol Metis. The latest version of Aave’s protocol is touted to benefit users across both protocols, with Metis users set to benefit from the provision of DeFi borrowing and lending services.\n\nEthereum.org highlights the main difference between Optimistic Rollups and zk-Rollups. The former processes transactions off-chain before publishing data on-chain, with a timeframe for network participants to challenge the validity of transaction data.\n\nZk-Rollups, meanwhile, execute transactions off-chain and submit large batches on-chain using a single proof-of-validity, with no need for the network to validate the data.\n\nThe team from Metis highlighted a number of ways in which users of its ecosystem can benefit from Aave’s deployment. This includes borrowing assets with less collateral with Aave’s “high efficiency” mode, improved risk management with supply and borrowing caps, and siloed borrowing to reduce exposure to potential market contagion.\n\nAave’s “isolation” mode also increases the pool of collateral assets, its cross-chain portals provide access to wider DeFi solutions, and its gas optimization also reduces transaction fees.\n\nPodcast: Layer-2 project exec zooms in on the capabilities of Ethereum scaling solutions\n\nAave is renowned in the DeFi space, with over $5.5 billion in total value locked in the protocol. V3 of the DeFi liquidity protocol was deployed on Ethereum’s mainnet in January 2023 following its launch on a number of Ethereum layer-2 protocols, including Avalanche (AVAX), Arbitrum (ARB), Optimism (OP) and Polygon (MATIC).\n\n1inch Network, another prominent DeFi player, also opted for zkSync to deploy its aggregation and limit-order protocols, while Uniswap (UNI) tokenholders voted in favor of deploying on Polygon’s zkEVM roll-up solution in April 2023.\n\nMagazine: ZK-rollups are ‘the endgame’ for scaling blockchains: Polygon Miden founder"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGFpbHljb2luLmNvbS9ldGhlcmV1bS1oaXRzLXJlY29yZC1nYXMtZmVlcy1hcy1wZXBlLW1hbmlhLXN3ZWVwcy1jb21tdW5pdHktcmVhY3RzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ethereum Hits Record Gas Fees as PEPE Mania Sweeps: Community Reacts - DailyCoin",
        "content": "Ethereum gas fees have hit record highs in the past few weeks.\n\nMeme coin mania, led by PEPE, has been the main culprit for high gas fees.\n\nThe community joked about being priced out of Ethereum.\n\nJust a few weeks ago the crypto industry seemed to be dead with little on-chain activity compared to the bull market of 2020/2021.\n\nHowever, the recent meme coin mania that seemingly came out of nowhere changed the status quo: Crypto activity picked up, especially on Ethereum, where gas fees increased to record levels.\n\nEthereum Hits Record Gas Fees Amid PEPE Mania\n\nThe Ethereum blockchain has become unusable, at least to most people trying to use it. The gas fees have gotten so high during the ongoing meme coin PEPE mania that some users have become priced out.\n\nOver the past few weeks, amid the PEPE hysteria, the average Ethereum gas price went to levels not seen since May 2022. Since PEPE launched on April 18, the average gas price has been 74 gwei. On May 5, the average gas price hit 155 gwei, according to data from Etherscan.\n\nEthereum average gas price chart. Source: Etherscan.\n\nSome users paid hundreds of dollars for a single transaction. One user even paid 64 ETH in gas fees for a single transaction, equivalent to $120,000.\n\nPEPE has since gone down 60% in the past few days. However, gas is still high and fluctuating between 145-190 gwei while PEPE has dumped 60% in the past few days.\n\nCommunity Reacts to High Ethereum Gas Fees\n\nThe crypto community on Twitter reacted to the astronomical gas fees on Ethereum. One user cried for help about paying $100 in gas fees for a $10 purchase.\n\n$10 purchase, gas fees $101+\n\n\n\nETH miners or devs, pls make it make sense to me. 😤😤 pic.twitter.com/4JBYxp4dbm — Officialjioke 📉📊📈💰 (@official_jioke) May 5, 2023\n\nAnother one joked that selling their left kidney is the only way to pay the high Ethereum gas fees.\n\nA new option to pay eth gas fees pic.twitter.com/R2M9QA3x4I — Sadie (@SadieCalls) May 5, 2023\n\nA Cardano community member mocked the high Ethereum fees and sarcastically asked whether Ethereum users have heard of Cardano, a blockchain with lower fees.\n\nEstimated gas fees for a tx on Eth right now: $187.71\n\n\n\nHey guys, ever heard of Cardano? pic.twitter.com/mTZ2KW9xOe — Rami (@CardanoRami) May 8, 2023\n\nOn the Flipside\n\nThere lies a paradox in the saying that “no one is using Ethereum because the gas fees are so high.” Gas fees are high precisely because there’s an increased demand for Ethereum block space.\n\nWhy You Should Care\n\nHigh gas fees on Ethereum indicate higher activity on the network. However, many users get priced out of using Ethereum when gas prices are high. At the same time, there are multiple Ethereum Layer-2 solutions that are working towards scaling Ethereum and eliminating high gas fees.\n\nRead more about PEPE dumping in the past few days:\n\nMeme Coin PEPE Dumps 42% as Whales Continue to Exit\n\nRead more about Lido setting a date for st ETH withdrawals:\n\nLido Finally Sets Date for stETH Withdrawals"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LnJlYWx2aXNpb24uY29tL3Nob3dzL2NyeXB0by1kYWlseS1icmllZmluZy92aWRlb3MvZXRoZXJldW0tc3Rha2luZy1hLXBvc3Qtc2hhbmdoYWktdXBkYXRlLWJ5LWNvbnNlbnN5cy1sZUty0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Ethereum Staking: A Post-Shanghai Update by ConsenSys - Real Vision",
        "content": "Access Crypto Content\n\nThis content is reserved for the thousands of visionaries supporting the financial revolution. We'd love for you to join us. Interested?\n\nJoin Now\n\nAlready have an account? Log In"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9pbnNpZGUtZXRoZXJldW1zLWV0aC1zdGFraW5nLWNoYW1iZXItc3RhcnZlZC1vZi1iYWxhbmNlLXRhbGwtb24tZXhpdHMv0gFgaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2luc2lkZS1ldGhlcmV1bXMtZXRoLXN0YWtpbmctY2hhbWJlci1zdGFydmVkLW9mLWJhbGFuY2UtdGFsbC1vbi1leGl0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Inside Ethereum’s [ETH] staking chamber: Starved of balance, tall on exits - AMBCrypto News",
        "content": "Centralized staking pools experienced an array of farewells.\n\nValidators have opted not to cross the minimum balance required to stake.\n\nWithin Ethereum’s [ETH] ecosystem, staking activity has become a topic of increasing interest and scrutiny since the Shapella upgrade’s success. But contrary to projection, ETH did not witness a high level of sell pressure after staking withdrawals resumed. Instead, it was around that time that the altcoin surged to $2,000.\n\nHow much are 1,10,100 ETHs worth today?\n\nHowever, post Shapella and ETH’s loss of its hold on the price, there have been some notable changes in the Ethereum staking world.\n\nChange of plans for ETH?\n\nGlassnode, in its 8 May report, revealed that full withdrawals had now outpaced partial withdrawals, which were initially rampant. Unstaking all initially staked Ether means that validators, who deposited a minimum of 32 ETH, have decided to grab their rewards and take out their capital.\n\nFurthermore, the number of complete validator exits in the ecosystem determines the full withdrawals. And, as of 4 May, the complete exit from the system was as much as 1.23 million in ETH.\n\nBesides the departure, the has been a change in the validators’ contrition to equilibrium. According to the on-chain analytic platform, the validators’ balance, which was pegged at 32 ETH, enjoyed an average of 2 ETH addition before the upgrade.\n\nBut since Shanghai took center stage, the balance has reduced to 32.35 ETH. This inferred that those who had not deployed their assets had exchanged their rewards.\n\nDespite the withdrawals, which were as much as 48.341 validators, there were also instances of those waiting to enter the staking pool.\n\nIn fact, Glassnode showed that the number of waiting depositors was over 23,000, at the time of the report. This confirmed investors’ interest in staking, and a bid to balance the growth in the number of exits. Based on Glassnode’s data, exits from the staking pool had already been minimized.\n\nIndividual retirements, but Lido remains king\n\nAlthough the net validator count was near zero, Glassnode noted that it expected a positive return in the future. The report noted that:\n\n“Given the tapering off of exits and persistently high inflow of new staking entrants, we expect a net increase to validator counts in the near future.”\n\nHowever, it was noteworthy to mention that most of the exits came from exchange activity. Exchanges including Binance, Kraken, Coinbase, and Gate.io topped the list.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nLido Finance [LDO], which is the most effective liquid staking platform out of the lot, had not yet enabled withdrawals. Moreover, only 6.6% of the overall withdrawals were linked to the decentralized staking providers.\n\nIn addition, Lido remained the largest pool with the highest share of stakers. While a large number of exits were from individual stakers on centralized exchanges, Coinbase and Kraken could still rank second and third, respectively, in market share."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZW4uZXRoZXJldW13b3JsZG5ld3MuY29tL2FhdmUtdjMtZXRoZXJldW0tbDItbmV0d29yay1tZXRpcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Aave V3 To Launch On Ethereum L2 Network Metis Following Positive Community Vote - Ethereum World News",
        "content": "Summary:\n\nThe Aave DAO completely voted in support of a proposal to launch the third iteration of its lending service on Metis, an L2 scaling network built atop Ethereum’s blockchain.\n\nLaunching on Metis will allow users of the popular DeFi lender to access lower transaction fees and enjoy liquidity incentives offered by Metis.\n\nThe move could bootstrap activity on Metis and drive adoption on the L2 amid growing competition in Ethereum’s scaling protocol landscape.\n\nEthereum L2 scaling network Metis will welcome DeFi lending protocol Aave to its ecosystem after a community voted in support of the move. Indeed, members of the Aave DAO community backed deploying the lenders’ third iteration or version 3 service on Metis.\n\nThe proposal opened for voting on May 2 and concluded last Friday. Not a single voter or community member opposed the move, signaling total support for deploying V3 on Metis.\n\nAave’s launch on the Ethereum L2 network beckons fresh rewards for Metis users who borrow and lend digital assets via the decentralized finance service. The move could also galvanize activity on Metis as the protocol competes with other scaling networks like Arbitrum, Optimism, and Polygon.\n\nWhile the last bull run propelled Metis to the limelight, the network’s adoption has suffered blows amid market downturns and increased market competition. Metis boasts cheaper gas fees compared to Ethereum, giving users a more cost-effective alternative without giving up transaction security. Providing cheaper transaction costs is usually a common offering from L2 networks.\n\nIn a bid to encourage adoption and leverage Aave’s V3 launch, Metis will offer liquidity incentives to users. Liquidity miners will receive 100,000 METIS coins within a 6-month timeline after deployment. Also, 4,000 METIS tokens will be distributed to token miners as part of a reward program.\n\nAave Fuels Expansion Campaign\n\nThe DeFi lender seems on a mission to expand beyond Ethereum’s base layer with a dearth of governance proposals. In April, the governance DAO voted to launch V3 on BNB Chain, a major liquidity hub for decentralized finance users. The move was announced shortly after leading decentralized exchange Uniswap moved to launch on the Binance blockchain.\n\nAave DAO also voted to remove BUSD from lending markets on Ethereum. The proposal argued that regulatory actions against stablecoin issuer Paxos and the token’s declining supply greatly diminishes BUSD’s utility."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvLm5ld3MvZGVzcGl0ZS1wZXBlLW1hbmlhLXRoZXJlLWFyZS0yeC1tb3JlLWJpdGNvaW4tdXNlcnMtdGhhbi1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Despite PEPE-mania, there are 2x more bitcoin users than ethereum - crypto.news",
        "content": "Fresh data from blockchain analytics platform, Token Terminal, shows that bitcoin had two times more daily active users than ethereum as of May 8.\n\nBitcoin flips ethereum in user count\n\nAt the time of writing, bitcoin still leads ethereum in terms of daily active users.\n\nBitcoin has an average of 589,810 daily active users over a 30-day period, while ethereum has an average of 322,840 daily active users over the same time frame.\n\nToken Terminal is a platform that aggregates financial data on leading blockchains and decentralized applications, using traditional financial key performance indicators (KPI) to measure and evaluate their performance.\n\nWhile bitcoin and ethereum are popular, they offer different use cases. To illustrate, bitcoin is a currency and a store of value, while the ethereum network is a smart contracting platform for launching decentralized applications (dApps).\n\nBlame Ordinals for bitcoin woes, ethereum strained by PEPE\n\nData from Token Terminal suggests that despite the differences in their design and intended use cases, bitcoin is currently attracting more daily active users than ethereum.\n\nThis may be due to a variety of factors, such as bitcoin’s longer history and wider adoption, as well as its perception as a more stable and secure investment option.\n\nHowever, the introduction of the Bitcoin Ordinals platform and marketplace on Bitcoin’s blockchain could be the main reason for the spike in user adoption.\n\nThrough the Ordinals platform, users can attach files, such as videos, images, or texts, on every satoshi, effectively storing them on the mainnet. A satoshi is the smallest unit of a bitcoin (BTC).\n\nIn recent days, there has been a spike in the number of minted inscriptions from the Ordinals platform. The deluge has overwhelmed the network, forcing transaction fees high, even causing congestion on May 7.\n\nEven so, ethereum remains a significant player and is a go-to smart contracting platform.\n\nAs the Bitcoin network is inundated by Ordinals inscriptions, the popularity of meme tokens, including pepe coin (PEPE), has also forced ethereum’s gas fees higher after a lull of 2022.\n\nFollow Us on Google News"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXVuZGVydmFsdWVkLWNyeXB0b3MtYnV5LWRpcC0wMDQ5NTA3MjAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "3 Undervalued Cryptos to Buy On the Dip in May 2023 - Yahoo Finance",
        "content": "While cryptocurrencies can be alluring, investors should remain cautious in ensuring a safe and well-diversified portfolio. That said, owning undervalued cryptos with impressive upside is the way to go, for investors with a higher risk appetite. Among the undervalued cryptos I think are worth holding are the following three tokens. These are each projects that have outperformed this year, and have plenty of upside potential over the long-term.\n\nOf course, while these may be undervalued cryptos relative to their previous valuations, they’re also risky. Thus, they’re not for everyone. That said, for those with the stomach for volatility, these are three cryptos I think could continue to outperform over the very long-term.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nArbitrum (ARB-USD)\n\nImage of two glowing blue chains shaking hands. representing sto platforms\n\nSource: LuckyStep/ShutterStock.com\n\nArbitrum (ARB-USD) is a new and popular addition to the Ethereum blockchain ecosystem that aims to transform how transactions are conducted on the network. Using optimistic rollups, a unique method, Arbitrum’s Layer-2 scaling solution promises to enhance the speed, scalability, and cost-effectiveness of Ethereum transactions.\n\nAltLayer has been chosen as the first rollups-as-a-service provider to assist Arbitrum Orbit as the Ethereum Layer 2 scaling solution now moves into the Layer 3 space. Arbitrum has gained investors’ attention due to its ability to enhance the efficiency and speed of transactions on the Ethereum network.\n\nArbitrum stands out for being a fast and cost-efficient solution that sends all transaction data to the main Ethereum blockchain. With a speed of 40,000 transactions per second, Arbitrum outpaces Ethereum’s 14 TPS. Additionally, while Ethereum’s transactions can cost several dollars, Arbitrum’s transactions cost only about two cents. Arbitrum is shaking up the competition in the Ethereum L2 space, outpacing other competitors.\n\nStory continues\n\nSolana (SOL-USD)\n\nSolana logo on phone screen stock image. SOL-USD, Solana price predictions\n\nSource: sdx15 / Shutterstock.com\n\nSolana (SOL-USD) has emerged as a standout performer of the year, surging 33.58% in the first week after facing a decline of almost 94% in 2022. While this remarkable rebound is impressive, it remains to be seen if Solana can maintain its upward momentum throughout the remainder of 2023.\n\nSolana is currently undervalued in the crypto market and offers multiple use cases as a platform for decentralized finance, NFTs, gaming, and the metaverse. Despite its significant drop in value in 2022, Solana’s potential as a Layer 1 blockchain network makes it difficult to believe that investors consider it worthless.\n\nIn other SOL news, Solana Labs announced that Saga, a crypto-focused smartphone, will be available for public purchase on May 8. The smartphone was created with the understanding that smartphone gadgets will have a significant part in the development of the crypto sector and function as specifically designed wallets for digital currencies. The idea was first teased almost 10 months ago, and Solana hopes that Saga will have a positive impact on its entire ecosystem.\n\nIn my opinion, Solana has a positive outlook, especially with its innovative crypto phone. I have been optimistic about Solana since its initial announcement. While it is logical that mobile devices optimized for crypto will be the future of the industry, the question remains whether the broader public shares the same view.\n\nEthereum (ETH-USD)\n\nConcept graphic of Ethereum Classic (ETC) crypto logo in green techno style\n\nSource: shutterstock.com/BT Side\n\nThe second-largest digital currency, Ethereum (ETH-USD), remains alive for a while and is now facing major shifts. Its price trend is also unstable. However, is it a good time to buy or sell this digital asset?\n\nThe popularity of meme tokens based on Ethereum has led to fluctuations in transaction fees. These price shifts are beneficial for developers and users since the average fees have been decreasing over the last two years. Ethereum’s recent technological upgrades have positioned it well for future success. The switch from PoW to PoS has made it more energy-efficient and scalable. Additionally, upcoming developments such as cheaper transactions, increased security, and improved user experience make for an exciting roadmap ahead.\n\nIn summary, Ethereum appears to be a promising investment choice at present. Its growth potential is gaining attention, and its technological advancements are laying the foundation for long-term success. While investing in the volatile cryptocurrency market is never a certainty, Ethereum’s overall strength makes it a strong contender for generating wealth.\n\nOn the date of publication, Chris MacDonald had a position in SOL and ETH. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nChris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.\n\nMore From InvestorPlace\n\nThe post 3 Undervalued Cryptos to Buy On the Dip in May 2023 appeared first on InvestorPlace."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMDkvY29pbmJhc2Utd29ya3MtdG8tZml4LXdhbGxldC1zdXBwb3J0LWZvci1ldGhlcmV1bS1zdGFraW5nLXdpdGhkcmF3YWxzLXN0dWNrLWluLWxpbWJvL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzA5L2NvaW5iYXNlLXdvcmtzLXRvLWZpeC13YWxsZXQtc3VwcG9ydC1mb3ItZXRoZXJldW0tc3Rha2luZy13aXRoZHJhd2Fscy1zdHVjay1pbi1saW1iby9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Coinbase Works to Fix Wallet Support for Ethereum Staking Withdrawals Stuck in Limbo - CoinDesk",
        "content": "Coinbase offers its own staking services, including through public validators owned and operated by Coinbase Cloud. According to the blockchain-analysis firm Nansen, Coinbase “currently accounts for the greatest amount of ETH in the withdrawal queue (40% of the total).”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtaGl0cy1uZXctYWxsLXRpbWUtcmVjb3JkLWFmdGVyLWRpcC1mb3ItYW50c9IBTGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtaGl0cy1uZXctYWxsLXRpbWUtcmVjb3JkLWFmdGVyLWRpcC1mb3ItYW50cz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Hits New All-Time Record After 'Dip for Ants' - U.Today",
        "content": "Ethereum (ETH) recently achieved a new all-time record, as the amount of ETH locked reached a staggering 19,375,242 ETH. This milestone comes after what can be described as a \"dip for ants,\" as the recent withdrawals appear minuscule when viewed from a broader perspective. This achievement has significant implications for Ethereum and its investors, particularly in terms of the cryptocurrency's future growth potential.\n\nAdvertisement\n\nThe locked ETH includes several categories, such as ETH staked on the Beacon chain, ETH deposited to the Beacon contract but not yet validating and rewards on the Beacon chain. Collectively, these categories represent the ETH that is \"out of circulation,\" thereby reducing the available supply and potentially driving up demand and price.\n\nETH locked* hit an all-time recently at 19,375,242 ETH\n\n\n\nWhen you zoom out, the withdrawals seem like a dip for ants\n\n\n\n*All ETH that is \"out of circulation\":\n\n• ETH staked on Beacon chain\n\n• ETH deposited to the beacon contract but not validating yet\n\n• Rewards on the Beacon chain pic.twitter.com/N1jyR7hcBO — Nansen 🧭 (@nansen_ai) May 9, 2023\n\nThe fact that such a substantial amount of ETH is locked away demonstrates increasing interest in and adoption of Ethereum's proof-of-stake (PoS) system. As more investors stake their ETH on the Beacon chain, it showcases confidence in Ethereum's long-term viability and growth prospects. This trend could further solidify Ethereum's position as a leading cryptocurrency and smart contract platform.\n\nWhen analyzing recent withdrawals in the context of the broader Ethereum ecosystem, it becomes clear that these movements are relatively insignificant. The locked ETH has continued to grow despite minor fluctuations, suggesting that the cryptocurrency's overall health remains robust. For investors, this serves as a reminder of the importance of maintaining a long-term perspective when evaluating market movements.\n\nThe new all-time record for locked ETH underscores the strength of the Ethereum network and its potential for continued growth. As Ethereum 2.0 progresses and the transition to a PoS model becomes more firmly established, it is likely that the amount of locked ETH will continue to rise."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bXMtaW1wbGllZC12b2xhdGlsaXR5LWdvZXMtc291dGgtc2hvdWxkLWV0aC1ob2xkZXJzLWJlLXdvcnJpZWQv0gFgaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtcy1pbXBsaWVkLXZvbGF0aWxpdHktZ29lcy1zb3V0aC1zaG91bGQtZXRoLWhvbGRlcnMtYmUtd29ycmllZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ethereum’s Implied Volatility goes south- Should ETH holders be worried - AMBCrypto News",
        "content": "Implied volatility for Ethereum took a massive plunge.\n\nEthereum Foundation sold some of its ETH holdings.\n\nAs part of its growth roadmap, the Ethereum protocol is supposed to undergo numerous changes and upgrades. Now, interestingly, every time there is some upgrade on the network, the Implied Volatility (IV) of ETH increases.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nHowever, over the last few days, Ethereum’s Implied Volatility has declined.\n\nAccording to data provided by GreeksLive, the long-term implied volatility (IV) for ETH ATM (At-the-Money) options reached a historic low of 50%.\n\nConsequently, the IV levels for ETH now align with those of BTC, inferring that the market has assimilated future volatility expectations for ETH to be on par with BTC.\n\nFor context, Implied Volatility (IV) is a measure of the expected volatility of an asset, derived from the prices of options contracts. A decline in implied volatility for ETH may indicate a decrease in the market’s expectation of future price fluctuations of ETH.\n\nThis means that market participants perceive that the probability of large price swings in ETH is lower than before.\n\nDespite the low volatility experienced by Ethereum, the put-to-call ratio for Ethereum continued to increase for Ethereum across exchanges.\n\nAn increasing put-to-call ratio for Ethereum may suggest that market participants are becoming more bearish on the future price of ETH, as they are purchasing more put options to hedge their positions or speculate on a potential decline in price.\n\nEthereum Foundation and the bears\n\nYou wonder what is the reason behind the unprecedented high level of bearish sentiment around ETH. Well, you might as well thank Ethereum Foundations’ recent behavior.\n\nFor context, the Ethereum Foundation is a non-profit organization that supports the development and advancement of the Ethereum blockchain and its ecosystem.\n\nAt press time, the Ethereum Foundation sold 15,000 ETH. On the last two occasions when the Ethereum Foundation opted to divest its holdings, the market value of ETH decreased.\n\nIn terms of activity, the Ethereum network took a massive hit. Over the last month, the overall number of NFT trades occurring on the network declined materially. Consequently, there was a decline in gas usage as well.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nNotably, if the activity on Ethereum continues to decline, it could impact the protocol negatively in the future."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tYWtlcmRhby1sYXVuY2hlcy1zcGFyay1wcm90b2NvbC1hLW5ldy1kZWZpLWxlbmRpbmctc29sdXRpb24tZm9yLWRhaS11c2Vyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "MakerDAO launches Spark Protocol, a new DeFi lending solution for DAI users - Cointelegraph",
        "content": "MakerDAO, a decentralized autonomous organization that operates on the Ethereum blockchain and issues stablecoin DAI, has announced that it has launched the Spark Protocol, a lending solution for DAI users.\n\nAnnouncing the Spark Protocol launch ⚡️\n\n\n\nStarting May 9, 2023, Spark Protocol will be available to all DeFi users.\n\n\n\nAn end-user, DAI-centered DeFi product deployed on Ethereum with supply and borrow features for ETH, stETH, DAI, and sDAI. pic.twitter.com/oLa8oeBmL1 — Maker (@MakerDAO) May 8, 2023\n\nAccording to the Twitter announcement, the first version of the Spark Protocol will act as a “lending marketplace,” providing users with supply and borrowing features for cryptocurrencies such as Ether (ETH), staked Ether (stETH), DAI (DAI), and staked DAI (sDAI). The platform is specifically designed for DAI and aims to provide users with access to competitive interest rates.\n\nThe Spark Protocol is also linked to Maker’s D3M (Direct Deposit Dai Module), a system that enables interaction between the Maker ecosystem and third-party lending pools. The link between Spark Protocol and Maker’s D3M seeks to enable users to borrow DAI at more competitive rates, with an initial annual rate of just 1.11%.\n\nRegarding the connection between Spark Protocol and Maker’s D3M, the announcement noted: “This direct wholesale credit line in DAI injects and automatically balances fresh DAI liquidity into Spark Lend and enables its users to access the best rates in the market.”\n\nUltimately, the Spark Protocol lending solution promises to enhance MakerDAO’s DAI lending capabilities, increase liquidity, offer users improved rates, offer a yield-bearing version of DAI and provide more liquidity options.\n\nRelated: MakerDAO votes to keep USDC as primary collateral, rejects ‘diversification’ plan\n\nMakerDAO recently proposed a new “constitution” designed to establish and formalize its governance processes, as well as safeguard against potential threats from malicious actors who may attempt to take over the protocol.\n\nTo ensure the security and stability of the Maker Protocol and protect user funds from potential failures or losses due to human and institutional decisions, MakerDAO’s new constitution utilizes “alignment engineering” to solidify the core commitments of the Maker community.\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMDgvYWF2ZS1kYW8tcGFzc2VzLXByb3Bvc2FsLXRvLWRlcGxveS1vbi1ldGhlcmV1bS1sYXllci0yLW1ldGlzLW5ldHdvcmsv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8wOC9hYXZlLWRhby1wYXNzZXMtcHJvcG9zYWwtdG8tZGVwbG95LW9uLWV0aGVyZXVtLWxheWVyLTItbWV0aXMtbmV0d29yay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Aave DAO Passes Proposal to Deploy on Ethereum Layer 2 Metis Network - CoinDesk",
        "content": "The network will offer 100,000 native metis (METIS) tokens as a liquidity mining incentive for Aave users on the network that will be distributed over a six-month period. Elsewhere, a token mining reward program will distribute 4,000 METIS to participating protocols commensurate with the percentage of monthly transactions generated."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93b3J0aC1pdC10cmFkZXItc3BlbmRzLTEyMGstb24tZ2FzLWJ1eWluZy0xNTVrLXdvcnRoLW9mLWEtbWVtZWNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Worth it? Trader spends $120K on gas buying $155K worth of a memecoin - Cointelegraph",
        "content": "A single trader just spent a staggering 64 Ether — equivalent to $118,000 — in gas fees purchasing $155,000 worth of a memecoin called Four (FOUR).\n\nAccording to an update from the popular blockchain tracking service Whale Alert, the lone trader paid an astonishing $119,157 in Ether (ETH) to complete a Uniswap trade that swapped 84 Wrapped Ether (WETH) for 13.8 billion FOUR tokens.\n\nA fee of 64 #ETH (119,121 USD) has just been paid for a single transaction!https://t.co/3w4UD0AZbw — Whale Alert (@whale_alert) May 8, 2023\n\nIt appears as though the trader voluntarily increased their gas fee to speed up the transaction time to purchase the memecoin. According to pseudonymous Twitter user FlurETH, the trader in question is sitting on 133 ETH ($245,667) in unrealized profit on their investment in the memecoin.\n\nHigh gas fee transaction details. Source: Etherscan.\n\nGas fees on the Ethereum network have become the subject of debate amongst the crypto community, with a number of prominent Etheruem advocates praising the heightened activity for its revenue generating effects and long-term deflationary pressure on the supply of Ether.\n\nArbitrum One, an Ethereum layer 2 network, just did more daily fee revenue than Bitcoin.\n\n\n\nNot to mention that Ethereum itself did more than 28x the fee revenue of Bitcoin in the same time period. pic.twitter.com/plLEzdynNB — sassal.eth (@sassal0x) April 20, 2023\n\nOthers have leveled criticism at the fees, claiming that unless the network becomes more “affordable” mass adoption will never be achieved.\n\nAs reported by Cointelegraph, one of the main drivers behind the increase in Ethereum gas fees comes from the recent memecoin mania, driven in large part by the frenzied buying of a new memecoin called Pepe (PEPE). At the time of publication, the average Ethereum transaction fee is sitting at $22.98, the highest level recorded since May 12, 2022, when the average fee reached a peak of $31.11.\n\nAverage Ethereum transaction fees in the past year. Source: Etherscan\n\nAnother major reason behind the drastic uptick in gas fees comes from the maximal extractable value trading bot that is front-running memecoin trades en masse. The notorious MEV bot and “sandwich” attacker, known only by the pseudonym jaredfromsubway.eth, has been profiting significantly from the heightened network use.\n\nA sandwich attack occurs when an attacker “sandwiches” a victim’s transaction between their own two transactions in order to manipulate the price and profit from the user.\n\nOn April 18, Jared cleared a whopping $950,000 in profits from the sandwich attacks. Jared has also been one of the largest gas spenders on the Ethereum network. On April 20, Jared used 7% of the total gas on the network and spent 455 ETH in transaction fees.\n\nAsia Express: Justin Sun’s SUI-farming sins, PEPE’s wild run, 3AC’s oyster philosophy"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMDkvZXRoZXItc3Rha2luZy1kZXBvc2l0cy10b3Atd2l0aGRyYXdhbHMtZm9yLWZpcnN0LXRpbWUtc2luY2Utc2hhcGVsbGEtdXBncmFkZS_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA1LzA5L2V0aGVyLXN0YWtpbmctZGVwb3NpdHMtdG9wLXdpdGhkcmF3YWxzLWZvci1maXJzdC10aW1lLXNpbmNlLXNoYXBlbGxhLXVwZ3JhZGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ether Staking Deposits Top Withdrawals for First Time Since Shapella Upgrade - CoinDesk",
        "content": "In a proof-of-stake blockchain such as Ethereum, users stake, or lock, cryptocurrency – ether in this case – to help secure and confirm new data blocks. These stakers receive network rewards in the form of tokens, creating a form of passive investing strategy."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vMjQ3d2FsbHN0LmNvbS9pbnZlc3RpbmcvMjAyMy8wNS8wOS9ldGhlcmV1bS1nYXMtZmVlcy1zcGlrZS10by15ZWFybHktaGlnaC1hbWlkLWEtcmVuZXdlZC1tZW1lLWNvaW4tZnJlbnp5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ethereum Gas Fees Spike to Yearly High Amid a Renewed Meme Coin Frenzy - 24/7 Wall St.",
        "content": "Ethereum Gas Fees Spike to Yearly High Amid a Renewed Meme Coin Frenzy Public Domain / Wikimedia Commons\n\nThe recent surge in interest in meme coins like PEPE has sent the daily median Ethereum gas price, or transaction cost, above 12-month highs. The increased usage of the Ethereum network has also prompted a rise in the ETH burn rate. While the memecoin frenzy seems to return, what does it mean for Ethereum holders?\n\nETH Gas Fees Surge As Meme Coin Mania Kicks Off with Pepe\n\nThe recent launch of PEPE, a frog-themed meme coin that is an adaptation of the popular movie franchise “Pepe the Frog,” has sparked a renewed interest in meme coins. The token, which has seen massive success since its debut, is also primarily responsible for driving up the ETH gas fees.\n\nAccording to data by CoinGecko, PEPE has gained a staggering 555% over the past two weeks alone. The token surpassed the $500 million mark in market capitalization within three weeks of its launch and entered the top 100 largest cryptocurrencies by market capitalization on May 1.\n\nPEPE is the 57th largest cryptocurrency, with a market cap of over $823 million. In the last 24 hours, the trading volume for PEPE surpassed $143 million on Uniswap, higher than Wrapped Bitcoin (WBTC) and USDT stablecoin volumes.\n\nThe success of the PEPE coin has also renewed interest in other meme coins, including CHAD and 4TOKEN, which have rallied 450% and 250% in one week. Another cryptocurrency DINO has risen 500% in two weeks.\n\nThe new meme coin frenzy has sent ETH gas fees through the roof. As of May 9, the average cost of a single transaction on Ethereum stands at above $21. On May 5, the gas fee hit a multi-month high of above $27.\n\nThis is not the first time Ethereum’s mean transaction fees have reached such high levels. During the 2021 bull market, the gas fees hit as high as $70, though things have been quiet since the market crashed in May last year.\n\nETH Burn Rate Increases Amid Rising Demand\n\nThe increase in network demand has also prompted a rise in the Ethereum burn rate. Data from Ultrasound Money, a website dedicated to Ethereum’s activities post-Merge, shows that 115,939 ETH (around $214 billion) has been burned over the past 30 days.\n\nZooming out, the data shows that 197,728 ETH has been burned since the Merge occurred 236 days ago. This suggests that around 58% of the total burned ETH since the Merge was burned in the last month, triggered by increased activity in the network.\n\nUniswap, the largest decentralized exchange, has accounted for most of the recent burns. Data by Ultrasound Money shows that approximately 36,000 ETH has been burned by transactions on the DEX in the last 30 days.\n\nThe burn rate sits at around 4 ETH per minute over the 30-day timeframe. Over one day, the burn rate is at 6.82 ETH per minute.\n\nThe burning is related to the Ethereum Improvement Proposal (EIP)-1559, implemented in August 2021. The EIP-1559 changed how Ethereum calculates and processes network transaction fees, adding a mechanism to burn a portion of fees paid by users.\n\nThe Merge upgrade made the burning mechanism even more effective, putting ether on the path to becoming a deflationary asset by replacing miners with validators as entities responsible for running the blockchain and causing a drastic reduction in the newly minted ETH.\n\nAt the time of writing, ETH is trading at $1,847, almost flat over the past day. The token is, however, still down by more than 62% compared to its all-time high.\n\nThis article originally appeared on The Tokenist\n\nSponsored: Want to Retire Early? Here’s a Great First Step Want retirement to come a few years earlier than you’d planned? Or are you ready to retire now, but want an extra set of eyes on your finances? Now you can speak with up to 3 financial experts in your area for FREE. By simply clicking here you can begin to match with financial professionals who can help you build your plan to retire early. And the best part? The first conversation with them is free. Click here to match with up to 3 financial pros who would be excited to help you make financial decisions."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8venljcnlwdG8uY29tL2V0aGVyZXVtLWZvdW5kYXRpb24tc2VsbHMtMzAtbWlsbGlvbi13b3J0aC1vZi1ldGgtYXMtcHJpY2UtbmVhcmx5LWJyZWFrcy0yay_SAWVodHRwczovL3p5Y3J5cHRvLmNvbS9ldGhlcmV1bS1mb3VuZGF0aW9uLXNlbGxzLTMwLW1pbGxpb24td29ydGgtb2YtZXRoLWFzLXByaWNlLW5lYXJseS1icmVha3MtMmsvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ethereum Foundation Sells $30 Million Worth Of ETH As Price Nearly Breaks $2k - ZyCrypto",
        "content": "Advertisement\n\nThe Ethereum Foundation has transferred 30 million worth of ETH to Kraken igniting massive sell-off concerns among users.\n\nETH price plunged by 4%, hanging on to the $1,900 mark on May 7 before sliding below the resistance following the sell-off rumours.\n\nDigital asset analysts have drawn similar patterns with the last two sell-offs by the Ethereum Foundation and Vitalik Buterin.\n\nEthereum (ETH) trades at $1,832 after a rough weekend for digital assets plagued with congestion on the Bitcoin Network and massive sell-off concerns.\n\nAccording to data from crypto analytics firm Lookonchain, Vitalik Buterin transferred almost half a million worth of ETH to Kraken before the Ethereum foundation did the same with about $30 million worth of ETH.\n\nAt the time of both transactions, ETH exchanged hands at $1,960, with bulls holding on to the thoughts of $2,000. The price of ETH has trickled down weeks after the Shapella update, although its on-chain data still point upwards.\n\nThe transfer of millions worth of digital assets to exchange often indicates a rising balance springing up selling pressure from traders. In this case, despite the transfer of $30 million and mounting sell pressure, ETH balances on exchanges dropped from 18.22 million to 18.15 million over the weekend, showing signs of a strong recovery.\n\nSequel to the news, digital asset analysts compared market trends from past sales of ETH by the foundation and Buterin. The last big sale came in 2021, when 20,000 ETH was sold before the bear market kicked in. On the flip side, the foundation has also made large sales in the past during bull cycles, with the price surging.\n\nAdvertisement\n\nAlthough large sales in the past preceded ETH plunging into the red zone, little or no lines can be drawn to establish a connection between the sale and the market’s bearish outlook.\n\nETH bulls look toward a breakout above $2k\n\nETH now exchanges hands at $1,847, a 4.32% drop in the past 72 hours as the wider crypto market goes red. Despite this drop, on-chain indicators like ETH’s 200-day exponential moving average look good to push through the resistance.\n\nFurthermore, data aggregator Santiment believes that the huge inflow of ETH in exchanges could spark an initial uptick in price similar to the scenario in 2022. The firm took to Twitter to explain that ETH looks set to decouple from Bitcoin on the verge of breaking $2k.\n\n“Updating our report on #Ethereum’s sky-high active deposits, exchange addresses interacting on the network is now at its highest level since November 2021. As expected, $ETH is showing decoupling signs and on the cusp of breaking $2k once again,” the tweet reads."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS12cy1wb2x5Z29uLWhvdy10aGVpci1tdXR1YWwtaW5jbHVzaXZpdHktaXMtaW5mbHVlbmNpbmctcHJpY2VzLWluLTIwMjMv0gFpaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLXZzLXBvbHlnb24taG93LXRoZWlyLW11dHVhbC1pbmNsdXNpdml0eS1pcy1pbmZsdWVuY2luZy1wcmljZXMtaW4tMjAyMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Ethereum vs Polygon: How their mutual inclusivity is influencing prices in 2023 - AMBCrypto News",
        "content": "When talking about Ethereum vs Polygon, one must consider several metrics.\n\nETH’s prices remained neutral, while MATIC was bearish at press time.\n\nThe close relationship between Ethereum [ETH] and Polygon [MATIC] benefits both ecosystems. One is a main blockchain network bogged down by scalability issues, while the other is a scaling solution – a perfect match made in heaven.\n\nIs your portfolio green? Check ETH Profit Calculator\n\nBut to what extent does this relationship and mutual inclusivity affect their price performance? Can investors get a clue on this front to gauge the assets’ potential outlook in 2023? Read along for some answers.\n\nEthereum vs Polygon: Interdependency and price\n\nBefore evaluating the interdependence of these assets from a price action angle, it’s prudent to check how they reacted to Bitcoin’s [BTC] swings and overall performance in Q1 2023.\n\nFor perspective, BTC posted a stellar performance in Q1 2023 – offering over 70% gains after rallying from $16.5k to $28.5k.\n\nIn the same period, ETH posted 55% gains, rallying from $1,190.5 to $1,847.3. The measurement is taken from the lowest candlestick wick on 1 January and the highest wick on 31 March.\n\nOn the other hand, MATIC hiked 51%, jumping from $0.7477 to $1.1235 in Q1 2023. From the above performance, it’s clear BTC outperformed the altcoins. However, ETH posted 4% more gains than MATIC in the same period.\n\nThe altcoins also reacted differently to BTC’s drop in the second half of April. Notably, BTC plunged 11%, dropping from $30.5k on 18 April to $26.9k on 24 April, setting the market into correction.\n\nETH depreciated by 15% in the same period, dropping from $2,125 to $1,806. But MATIC suffered more losses, plummeting 17.8% as it slid from $1.5681 to $1.2431. In short, ETH outperformed MATIC during BTC’s swings.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nBack to our interrogation. How did MATIC perform after ETH crossed $2000?\n\nAlthough the upswing was tied to BTC’s new high of $31k in mid-April, ETH’s move above $2,000 saw MATIC hit $1.25. Based on percentage, ETH hiked 16%, jumping from $1824 to $2125 between 9 – 18 April.\n\nOn the other hand, MATIC posted 28.5%, rallying from $0.9700 to $1.25 in the same period. It outperformed ETH in this instance. However, the correlation is not always positive, and MATIC doesn’t outrightly follow ETH price action.\n\nFor example, on 5 May 2023, BTC rallied 2.3%, jumping from $28.8k to $29.7k. On the same day, ETH hiked by 6.2%, increasing from $1876 to $1998.\n\nBut MATIC only increased by 1.56%, rising from $0.9750 to $1.0085 on the same day. As such, ETH surged more than BTC and MATIC on this particular day. Therefore, MATIC and ETH price correlation fluctuates and is hardly determined by the ecosystem’s close relationship.\n\nThat said, what’s the price performance outlook in May? Let’s get some answers from the daily charts.\n\nETH price prediction: Bears gain ground\n\nAt press time, ETH has dropped to key support (white) near $1800. The RSI hovered near the median level while CMF (Chaikin Money Flow) dropped and moved southwards – an almost neutral position with increasing money outflows.\n\nSellers had the upper hand at press time. However, they will only dent the bullish sentiment if they crack the $1800 support. Any drop below $1800 could see ETH drop to $1700 or $1500 (cyan). The $1500 support is a bullish order block formed on 8 April.\n\nHowever, if bulls defend the $1800 support again, ETH could rally and retest $2000 and target the recent high of $2142.\n\nOverall, price action hovered near the $1800 support – a critical level in April.\n\nMATIC Price Prediction: Are sellers subdued?\n\nAt press time, MATIC dropped to key support and bullish order block at $0.9167. The level is a crucial support level in Q1 2023.\n\nThe RSI and CMF edged lower, reiterating the bearish sentiment at press time. However, the price retested the support and could affect sellers if MATIC sees some demand at the level.\n\nA rebound could set MATIC to rally towards the supply zone (red) near $1.2514 before experiencing some resistance.\n\nBut the price could slump to January lows of $0.7505 if the support cracks. Such a move will show a weakening structure.\n\nComparing both market structures, ETH was neutral, while MATIC was overly bearish at press time. Notably, ETH’s RSI hovered near mid-range while MATIC’s has been below the neutral level for the past few days.\n\nUnlike ETH, MATIC was close to dropping to its January lows if the support cracks. However, ETH’s drop could ease to $1700 before dropping to Q1 2023 lows.\n\nAs such, ETH had a better price performance in Q1 and could repeat the same in Q2 compared to MATIC.\n\nWhat did ChatGPT say?\n\nNevertheless, ChatGPT remained bullish on both assets, predicting ETH and MATIC could hit $5000 and $4 by June 2023.\n\nConclusion\n\nDespite the mutual inclusivity, the Ethereum vs Polygon relationship doesn’t affect their individual price actions. But both have a highly positive correlation with BTC.\n\nRead Polygon’s [MATIC] Price Prediction 2023-24\n\nNotably, ETH offers better returns during BTC upswings than MATIC. But there are instances where MATIC performs better than ETH, like during mid-April, where MATIC gained over 28% while ETH only posted 16%.\n\nHowever, ETH has been increasingly bearish lately and could see more short-term downsides. Despite all this, it can withstand bearish pressure than MATIC."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI2Nzc4L2V0aGVyZXVtLWNsYXNzaWMtcHJlZGljdGlvbi1tYXktMDktMjAyMy_SAU9odHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8yNjc3OC9ldGhlcmV1bS1jbGFzc2ljLXByZWRpY3Rpb24tbWF5LTA5LTIwMjMv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ethereum Classic Price Prediction – ETC Price Estimated to Reach $ 21.49 By May 14, 2023 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum Classic is up 3.56% today against the US Dollar\n\nETC/BTC increased by 4.47% today\n\nETC/ETH increased by 3.96% today\n\nEthereum Classic is currently trading 11.29% below our prediction on May 14, 2023\n\nEthereum Classic dropped -5.96% in the last month and is down -25.80% since 1 year ago\n\nEthereum Classic price $ 19.06 Ethereum Classic prediction $ 21.49 (12.84%) Sentiment Bearish Fear & Greed index 51 (Neutral) Key support levels $ 17.83, $ 17.27, $ 16.75 Key resistance levels $ 18.92, $ 19.44, $ 20.00\n\nETC price is expected to rise by 12.84% in the next 5 days according to our Ethereum Classic price prediction\n\nis trading at $ 19.06 after gaining 3.56% in the last 24 hours. The coin outperformed the cryptocurrency market, as the total crypto market cap increased by 3.67% in the same time period. ETC performed well against BTC today and recorded a 4.47% gain against the world’s largest cryptocurrency.\n\nAccording to our Ethereum Classic price prediction, ETC is expected to reach a price of $ 21.49 by May 14, 2023. This would represent a 12.84% price increase for ETC in the next 5 days.\n\nETC Price Prediction Chart\n\nBuy/Sell Ethereum Classic\n\nWhat has been going on with Ethereum Classic in the last 30 days\n\nEthereum Classic has been displaying a negative trend recently, as the coin lost -5.96% in the last 30-days. The medium-term trend for Ethereum Classic has been bearish, with ETC dropping by -16.72% in the last 3 months. The long-term picture for Ethereum Classic has been negative, as ETC is currently displaying a -25.80% 1-year price change. On this day last year, ETC was trading at $ 25.69.\n\nEthereum Classic reached its all-time high price on May 06, 2021, when the price of ETC peaked at $ 165.75. The current ETC cycle high is $ 45.11, while the cycle low is at $ 12.63. ETC has been displaying low volatility recently – the 1-month volatility of the coin is at 5.63. Ethereum Classic recorded 15 green days in the last 30 days.\n\nEthereum Classic technical analysis for today - May 09, 2023\n\nThe sentiment in the Ethereum Classic markets is currently Bearish, and the Fear & Greed index is reading Neutral. The most important support levels to watch are $ 17.83, $ 17.27 and $ 16.75, while $ 18.92, $ 19.44 and $ 20.00 are the key resistance levels.\n\nBearish sentiment for Ethereum Classic\n\n10 indicators are currently signaling a bullish prediction for Ethereum Classic, while 20 indicators are showing a bearish forecast. With 67% of indicators favoring a negative prediction. This results in an overall Bearish sentiment for Ethereum Classic.\n\nCrypto market is currently experiencing Neutral\n\nCurrently, the Fear & Greed index is at 51 (Neutral), which signals that investors have a neutral outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum Classic moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum Classic is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 18.74 (BUY) $ 18.39 (BUY) - - MA5 $ 19.03 (BUY) $ 18.71 (BUY) - - MA10 $ 19.25 (SELL) $ 19.09 (SELL) - - MA21 $ 19.63 (SELL) $ 19.56 (SELL) $ 19.99 (SELL) $ 20.52 (SELL) MA50 $ 20.36 (SELL) $ 20.08 (SELL) $ 23.10 (SELL) $ 23.47 (SELL) MA100 $ 20.70 (SELL) $ 20.43 (SELL) $ 32.95 (SELL) $ 25.73 (SELL) MA200 $ 20.44 (SELL) $ 21.59 (SELL) $ 22.24 (SELL) $ 23.69 (SELL)\n\nPeriod Value Action RSI (14) 35.93 NEUTRAL Stoch RSI (14) 39.63 NEUTRAL Stochastic Fast (14) 5.09 BUY Commodity Channel Index (20) -66.67 NEUTRAL Average Directional Index (14) 24.93 NEUTRAL Awesome Oscillator (5, 34) -1.12 NEUTRAL Momentum (10) -1.04 NEUTRAL MACD (12, 26) -0.06 NEUTRAL Williams Percent Range (14) -94.91 BUY Ultimate Oscillator (7, 14, 28) 49.46 NEUTRAL VWMA (10) 19.43 SELL Hull Moving Average (9) 19.20 SELL Ichimoku Cloud B/L (9, 26, 52, 26) 20.89 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum Classic is at 35.93, suggesting that ETC is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum Classic over the last 50 days. Currently, Ethereum Classic is trading above the SMA 50 trendline, which is a bullish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETC closing price for the last 200 days. ETC is now trading above the SMA 200, signaling that the market is currently bullish.\n\nThe bottom line about this Ethereum Classic prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum Classic price prediction is Bearish. ETC would have to increase by 12.84% to hit our $ 21.49 target within the next five days. Moving forward, it will be important to monitor the ETC market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum Classic price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGFpbHljb2luLmNvbS9zb2xhbmEtaG9sZGVycy1nbG9hdC1hcy1iaXRjb2luLWFuZC1ldGhlcmV1bS1oYWx0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Solana Holders Gloat as Bitcoin and Ethereum Grind to a Halt - DailyCoin",
        "content": "Bitcoin and Ethereum face major congestion issues, while Solana is doing fine.\n\nMemecoin and BRC-20 mania cause serious issues for major networks.\n\nSolana supporters boast about the network’s performance.\n\nAs the crypto markets are up, traders are rediscovering memecoins. The surge in speculative activity has caused congestion issues for major blockchains. The simultaneous development of ordinals has exposed even Bitcoin to the effects of the memecoin mania.\n\nAt the same time, Solana’s network is doing just fine, with investors eagerly pointing to that fact. Solana fans urged others to “Just use Solana” to avoid the issues.\n\nMemecoin Traders Should ‘Just Use Solana’ – Solana Fans\n\nSocial media is abuzz with comments from Solana enthusiasts, highlighting the network’s unclogged state. Multiple Solana fans urged traders to “Just use Solana” for a better trading experience.\n\n“Guess what chain isn’t congested and has the same activity on memecoins?” one user asked rhetorically. “That’s right, ”Solana.”\n\n“Ever tried trading meme coins on Solana?” one user asked, while another remarked: “Solana fixes this btw.”\n\nEthereum and Bitcoin Face Memecoin Congestion\n\nFollowing a surge in the price of the Pepe token, memecoin mania has led to significant congestion for Ethereum. At the same time, Bitcoin is grappling with congestion issues due to record inscriptions and demand for BRC-20 tokens.\n\nThis congestion has led to a staggering surge in pending transactions, with the blockchains grinding to a halt.\n\nBoth the Bitcoin and Ethereum blockchains are currently heavily congested\n\n\n\n~400,000 Bitcoin txs pending (~16hrs to clear at ~7tps)\n\n\n\n~200,000 Ethereum txs pending (~4hrs to clear at ~15tps)\n\n\n\nBoth are a direct result of memecoin speculation, interesting times we live in pic.twitter.com/bMRYgzL8sL — ChainLinkGod.eth (@ChainLinkGod) May 7, 2023\n\nWith approximately 400,000 Bitcoin transactions pending, one user estimated it would take 16 hours to clear everything. Ethereum also faces a backlog of around 200,000 transactions, which would take roughly four hours to complete.\n\nOn the Flipside\n\nAll blockchain networks face a trilemma between decentralization, security, and scalability. While Bitcoin and Ethereum favor decentralization, Solana favors scalability.\n\nSolana is not a stranger to technical issues itself. For instance, the entire Solana blockchain went offline for 20 hours in February. That was the latest of about a dozen times the network went offline.\n\nWhy You Should Care\n\nMemecoin and ordinals frenzy reveals a serious design issue with major blockchain networks, which struggle to scale to meet demand.\n\nRead about the memecoin craze that is causing congestion issues for Ethereum:\n\nPEPE Rips 69% to Hit New All-Time as Whales Buy Millions\n\nRead about what Binance is doing to mitigate Bitcoin’s surging fees:\n\nHere’s Why Binance Is Integrating the Bitcoin Lightning Network"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1zaGlmdGluZy10aWRlcy1pbi1kZXgtZG9taW5hbmNlLWFuZC10aGUtcmlzZS1vZi1sYXllci0yLXNvbHV0aW9ucy_SAWVodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tc2hpZnRpbmctdGlkZXMtaW4tZGV4LWRvbWluYW5jZS1hbmQtdGhlLXJpc2Utb2YtbGF5ZXItMi1zb2x1dGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Ethereum: Shifting tides in DEX dominance and the rise of Layer-2 solutions - AMBCrypto News",
        "content": "Ethereum’s grip on DEX dominance is slipping, signaling a new era in decentralized trading.\n\nHowever, Ethereum’s innovative Layer 2 solutions are recapturing lost traffic and solidifying its position as a dominant platform.\n\nEthereum emerged as a second-generation blockchain, revolutionizing the digital landscape by introducing smart contract functionality.\n\nIt ingeniously filled a void left by the Bitcoin network, which lacked this essential feature. Among its notable achievements, Ethereum solidified its position as the epicenter of Decentralized Exchanges (DEX).\n\nHowever, Ethereum’s stronghold on the DEX throne is gradually slipping away, giving rise to a new era in decentralized trading.\n\nRead Ethereum (ETH) Price Prediction 2023-24\n\nIs Ethereum lagging in DEX dominance?\n\nEthereum has long reigned supreme as the go-to network for Decentralized Applications (Dapps) and Decentralized Exchanges (DEX), with most smart contract platforms operating on its blockchain.\n\nHowever, recent data from Messari suggested that Ethereum’s grip on DEX dominance was waning. This shift can be attributed to two factors.\n\nFirstly, the decreasing dominance in DEX volumes could be attributed to the emergence of alternative Layer-1 (L1) DeFi ecosystems. Also, the strong bull market throughout 2021.\n\nHowever, when market downturns hit in 2022, many large entities were wiped out. It also caused trading volumes to shift back to the mainnet.\n\nFurthermore, this trend culminated in March 2023, during the USDC depeg. During this time its DEX volume dominance reached an impressive 80% – a level not seen since the beginning of 2021.\n\nSecondly, users who migrate from the Ethereum mainnet to L2 DEXs are less likely to revert to their previous course. L2s inherit their security properties and base assets (ETH) from Ethereum.\n\nEthereum L2s\n\nIn order to improve scalability and increase transaction throughput, ETH Layer 2 solutions have emerged as a potential solution. They exist to address the limitations of existing blockchain networks. These solutions are built on top of layer 1 networks to enhance performance.\n\nOne popular example of a Layer 2 solution on Ethereum is Polygon, which utilizes a side-chain approach. Another type of Layer 2 solution is rollups, which can be either Zero Knowledge (ZK) based, such as zkSync, or Optimistic Rollup, like Optimism.\n\nThese solutions allow for a higher volume of transactions to be processed while maintaining security and integrity.\n\nTotal Value Locked of mainnet and L2s\n\nAccording to data from L2 Beat, Ethereum rollups have been experiencing a notable upward trend in Total Value Locked (TVL). As of this writing, the TVL had surpassed the $9 billion mark, with Arbitrum and Optimism taking the lead in TVL. These leading Layer 2 (L2) solutions are categorized as Optimistic Rollups.\n\nFurthermore, data from DefiLlama revealed that the TVL of Ethereum stood at an impressive $28.73 billion, at the time of writing. This represented over half of the total TVL in the market, which amounted to $49.09 billion.\n\nHow much are 1,10,100 ETHs worth today?\n\nAlthough Ethereum’s DEX dominance may be diminishing, its Layer 2 (L2) solutions successfully recaptured the traffic it was losing.\n\nWhile attention may have shifted away from the mainnet, it remains a dominant platform thanks to the adoption of side chains and rollups.\n\nThe platform’s innovative approach to scaling through side chains and rollups has allowed it to maintain prominence."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1ldGgtbWVtZXMtdW53aW5kLWRvZXMtYml0Y29pbnMtYnJjLTIwLXdpZWxkLXRoZS1iYXRvbi1ub3cv0gFdaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWV0aC1tZW1lcy11bndpbmQtZG9lcy1iaXRjb2lucy1icmMtMjAtd2llbGQtdGhlLWJhdG9uLW5vdy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Ethereum [ETH] memes unwind: Does Bitcoin’s BRC-20 wield the baton now - AMBCrypto News",
        "content": "BRC-20’s support for fungible tokens resulted in the birth of meme tokens.\n\nThe crypto community called for lightning network adoption to solve the Bitcoin network jam.\n\nThe emergence of the BRC-20 token standard may have opened up new possibilities for the Bitcoin [BTC] network. Just a few days ago, traders were confident that Bitcoin’s limitation in allowing fungibility on its network would ensure that the meme token arena would not expand to it.\n\nHow much are 1,10,100 BTCs worth today?\n\nBut BRC-20, which only allowed the deployment of non-fungible smart contracts on the Bitcoin network, had changed that notion. At press time, over 14,000 tokens had been created under the token economy.\n\nThe BRC-20 standard, which is still in its early stages, saw incredible growth since supporting the minting of Bitcoin Ordinals and Inscriptions. The experiment, which only began around 8 March, with its first mint phase around 4 April, has now fully added the functionality to create tokens.\n\nMemes scaling the market cap like it’s nothing\n\nSince it was the period for meme tokens to flourish, most of the assets created via the network seemed like duplicates of the cryptocurrencies that have been making waves on Ethereum [ETH].\n\nBut it is noteworthy to point out that the memes created under the Ethereum network might be winding down their dominance. Recently, long positions on some of these assets suffered liquidation. So, could it be Bitcoin’s turn to light up the market?\n\nAccording to BRC-20.io, some of the created tokens include Oshi, xing, ordi, and pepe — a different token from the hyped-up ERC-20-based Pepe [PEPE]. These assets have performed exceptionally, driving the overall BRC-20 market capitalization above $550 million.\n\nThe hike in market capitalization means that the token developers have ensured supply distribution, coupled with price allocation. Before, the meme mint phase, which surfaced around the last week of April, produced an All-Time High (ATH) in daily inscriptions count.\n\nOver the last week of April, nearly every day saw #Ordinal Inscription counts eclipse previous all-time high daily inscription counts. pic.twitter.com/dIFOhprPA4 — Messari (@MessariCrypto) May 7, 2023\n\nBitcoin: Backlogs and a possible headway\n\nMeanwhile, Dune Analytics showed that Bitcoin’s network had gained from the progress made by the BRC-20 standard. At press time, the total fees generated by the network had increased to 382.47 BTC. This was a result of the rise in transactions, made possible by the memes, which were as much as 320,673.\n\nLike Ethereum, Bitcoin transactions have experienced a surge in transaction fees lately. But it did not end there. The network has had to deal with a backlog of transactions that have yet to pass confirmation at press time.\n\nThis traffic could, again, be linked to the surge in the thousands of BRC-20 transactions. As it was reported before, Glassnodes’ data showed that the resolve to pass through Taproot had also contributed a part.\n\nTaproot collates batches of transactions and signatures together to make transactions faster on the Bitcoin network. When this happens, it means block sizes would increase, and transaction costs would follow.\n\nAccording to mempool.space, there were over 450,000 unconfirmed transactions. And it would require about 192 blocks to clear the clogging. But with an average block time of 10.5 minutes, it could take more than a day to achieve.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nFollowing the event, many clamored for exchanges and self-custody providers to adopt the Bitcoin lightning network. Although considered highly priced, the feature solves the congestion issues faced by the network.\n\nFor instance, Paolo Ardoino, Chief Technology Officer at Tether [USDT], and Bitfinex encouraged other platforms to take the same step."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy95b3UtY2FuLW5vdy1jcmVhdGUtYS1zaGl0Y29pbi1pbi1sZXNzLXRoYW4tMjMtc2Vjb25kc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "You can now create a shitcoin in less than 23 seconds - Cointelegraph",
        "content": "With memecoins having captured the attention of the wider crypto industry in recent weeks, a viral video has emerged detailing just how easy it is for anyone with an internet connection to create a brand new cryptocurrency from scratch.\n\nA May 6 video from digital artist Johnny Shankman — who goes by whitelights.eth on Twitter — shows him completing a “speedrun” of creating and deploying an entirely new token, humorously dubbed “EASY_MONEY,” in just 27 seconds. The record was then beaten just a day later, clocking in at 22.45 seconds.\n\nThe term “speed run” originates from the gaming community and is typically used in reference to completing a game, or level in a game, as quickly as possible.\n\nIn the now-viral video, Shankman shows how any user can quickly create a new token by utilizing a program called Contracts Wizard, created by the crypto cybersecurity firm OpenZeppelin. The Contacts Wizard tool generates code for an ERC-20 token with a few quick clicks of a cursor. On the program, users can select a number of potential features for their token.\n\nAfter the code has been created, Shankman then uses an application called Remix, which compiles the token’s smart contract and deploys it on a given blockchain network. In the video, Shankman opts for deploying his EASY_MONEY (EZ) token on the Ethereum testnet.\n\nHe notes in the comments section that the video was “for educational purposes only” and clarifies that by deploying EASY_MONEY on the Ethereum testnet, it is not a real token to be speculated on.\n\nNotably, Shankman’s video was picked up by a number of large accounts on Crypto Twitter, being reposted by the likes of Loopifyyy, which has now seen the video gain more than 3 million views across a series of different accounts.\n\nThe viral popularity of Shankman’s post comes at a time where “shitcoins'' have gained drastically in popularity throughout the broader crypto ecosystem. The recent memecoin boom has been led in large part by an “entirely useless” frog-themed token called Pepe, which has seen its value surge more than 5,000% since its inception on April 14.\n\nIn a follow-up comment, Shankman pointed out that someone had actually created a token with the same name as his explainer but divulged that he “did not make it” and he would “not be buying it.”\n\nLess than 24 hours later, a new video emerged from another account on Twitter, that showed the same process being completed in just 22.45 seconds, setting a new unofficial record for the memecoin speedrun.\n\nMagazine: Joe Lubin — The truth about ETH founders split and ‘Crypto Google’"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS93aGF0LXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtZGVuY3VuLS1ldGhlcmV1bXMtbmV4dC1wbGFubmVkLXVwZ3JhZGUtMTY1OTgyNzEuaHRt0gF7aHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L3doYXQteW91LW5lZWQtdG8ta25vdy1hYm91dC1kZW5jdW4tLWV0aGVyZXVtcy1uZXh0LXBsYW5uZWQtdXBncmFkZS0xNjU5ODI3MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "What you need to know about Dencun – Ethereum’s next planned upgrade - CNBCTV18",
        "content": "After the successful implementation of 'Shapella,' the Ethereum network is set to undergo another transformation with the upcoming 'Dencun' upgrade.\n\nAccording to Ethereum Foundation community manager Tim Beiko’s May 3 blog post, Ethereum’s core developers are already in \"the final stages of planning\" for Dencun. While earlier upgrades sought to reduce energy consumption, increase scalability, and improve transaction speed, the major goal of the Dencun update is to lower transaction costs connected with the Ethereum network.\n\nWhat is the Dencun upgrade?\n\nThe Dencun upgrade gets its name from a combination of two elements: \"Deneb,\" the first-magnitude star in the constellation Cygnus, and \"Cancun,\" a city in Mexico. This naming convention follows a similar pattern to the Shapella upgrade, which combined the Chinese city Shanghai with “Capella,” the brightest star in the constellation Auriga.\n\nThe Dencun upgrade refers to the deployment of several Ethereum Improvement Proposals (EIPs), specifically EIP-4844, EIP-6780, EIP-1153, and EIP-6475. A quick reminder here is that these EIPs undergo a thorough review process within the Ethereum community and, if approved, are incorporated into the network's code. The four EIPs mentioned under the Dencun upgrade focus on enhancing Ethereum's execution layer, which is the blockchain that specialises in processing transactions for decentralised applications (dApps).\n\nAlso Read: What will happen to cryptocurrencies if the US economy crumbles\n\nEIP-4844: Proto-Danksharding or The Surge\n\nLet us begin with understanding EIP-4844, also known as Proto-Danksharding. This EIP introduces a new data layer to the Ethereum network, which will serve as an interaction point for both the current consensus layer and the execution layer. In simple terms, proto-Danksharding is another version of sharding, a process that divides data across multiple machines to enhance processing speed and improve network scalability.\n\nWith the introduction of EIP-4844, temporary \"data blobs\" are brought into the picture. These blobs are opaque string-byte strings with a maximum size of 125 KB. Their purpose is to alleviate the network's burden caused by growing block sizes and rising transaction costs.\n\nThe upgrade could have a big impact on layer 2 rollups as well. Layer 2 solutions are expected to leverage these blobs to retrieve data more efficiently, as the smaller size of the blobs allows for quicker data retrieval. Additionally, these blobs are not permanently stored on the blockchain, which in turn could lead to a reduction in gas fees.\n\nEIP-6780: SELFDESTRUCT deactivation\n\nThe Dencun upgrade introduces another change through EIP-6780, which involves the deactivation of the SELFDESTRUCT opcode. This opcode allows for the creation and deletion of contracts within a single transaction while preserving the functionality of SELFDESTRUCT. However, it is important to note that the opcode will not delete the storage or code of the contract in all other cases.\n\nEIP-1153: Transient Storage\n\nEIP-1153 proposes a solution that allows for the discarding of certain data from transactions instead of storing it on the blockchain. This is achieved through the implementation of two new opcodes, TSTORE and TLOAD, which provide temporary storage that is cleared at the completion of each transaction. These introductions could open up new possibilities, such as single-transaction ERC-20 approvals, improving the availability of block space, implementing re-entry locks, and reducing the costs associated with on-chain data storage.\n\nEIP-6475: SSZ Optionals\n\nEIP-6475, also known as Simple Serialize (SSZ) Optionals, works in conjunction with Danksharding to introduce new types of transactions. By utilizing SSZ encoding, the transaction format becomes compatible with future SSZ objects that will be introduced to the Ethereum network. This upgrade enhances the efficiency and compatibility of transactions, paving the way for future developments and improvements within the Ethereum ecosystem.\n\nConclusion\n\nDencun is still in development, and there is no set schedule for when the improvements will be deployed. Furthermore, the extent to which it could affect the Ethereum network and its users is still unknown. However, if Dencun is carried out effectively, it has the potential to be an important milestone for the Ethereum ecosystem. Users may enjoy a more cost-effective experience if transaction costs are reduced. The same might make Ethereum more accessible and appealing, reinforcing its market position."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC0xMC13YXlzLXRvLXJlZHVjZS1ldGhlcmV1bS10cmFuc2FjdGlvbi1mZWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Top 10 Ways to Reduce Ethereum Transaction Fees - Analytics Insight",
        "content": "Let’s find out what is ethereum transaction fees, and how can you save money on them\n\nEthereum transaction fees have been one of the most crucial issues for those who use the platform. Fees that consumers must pay for Ethereum transactions is called gas fees. The greater the fee, the quicker the transaction will be processed. However, gas prices can be an obstacle for some users, particularly those with modest transactions. Here are the top 10 ways to reduce ethereum transaction fees.\n\nUse Simulation Through DeFi Saver\n\nYou don’t know the actual gas fee until you carry out the transaction and pay for the gas. However, you could use the DeFi Saver app to simulate your transactions. First, you’ll create a recipe for Ethereum activities and then run it virtually.\n\nUse a Layer-2 Blockchain\n\nThe Ethereum Mainnet, also known as Layer One, is frequently congested, making transactions costly. Layer-two blockchains offer users the ability to scale up their transactions, and they do so by utilizing technologies such as Rollups and side chains.\n\nPick your transaction times carefully\n\nWhen it comes to Ethereum transaction fees, timing matters. According to gasprice.io, a handy resource for checking real-time gas fees, gas prices usually peak sometime between 8 a.m. and 1 p.m. Eastern Time. Saturdays and Sundays are usually the cheapest days to transact in ETH. A good rule of thumb is that the cheapest time to make ETH transactions is typically outside of working hours in the U.S. and Europe.\n\nUse DApps That Offer Rebates and Discounts\n\nOne of the easiest ways to avoid Ethereum gas fees is to use Ethereum projects and dApps that offer fee subsidies or nominal fees. If you are looking for such a platform, Balancer is a great one. The platform refunds the gas fees up to 90 percent in the form of BAL tokens. Balancer minimizes the gas fees for high-frequency traders by carrying out traders that don’t leave the vault.\n\nSort Transaction Types\n\nDepending on the sort of transaction, the gas fee varies on the Ethereum blockchain. To save money on gas fees, users may wish to organize and implement similar transactions simultaneously. Consider that they have two Ethereum addresses, each containing 1,000 tokens. Now, if users intend to store all tokens in a new DApp’s crypt in order to earn higher returns.\n\nCompare rates when buying ETH or ERC-20 tokens\n\nBitPay shows rates from multiple partners to make sure you get the best price when buying crypto. BitPay simplifies the process of buying Ethereum or ERC-20 tokens by showing multiple partner rates in one place. BitPay adds a “Best Offer” flag to help our customers sniff out the best deal presented by our marketplace partners.\n\nUtilize Gas Tokens\n\nIf you remove your storage variables on the blockchain, you can earn ETH and create gas tokens. This process forms the basis of gas tokenization. When the gas fees are low, you can mint a significant number of gas tokens. During the execution of your transaction on the blockchain, you can redeem your gas tokens for Ether, which can later be used to pay a gas fee.\n\nAssess Network Congestion to Plan Ahead\n\nFor time-sensitive transactions, keep an eye on the Gas Price by Time of Day chart on Ethereum Gas Charts to know the live pricing of gas fees based on the local timezone. Estimate the gas fee accurately and set the correct gas limit to avoid unnecessary fines.\n\nConsider alternative ETH scaling solutions\n\nPolygon (MATIC) is an alternative ETH scaling solution that offers a more affordable way to process transactions than the Ethereum network. It’s an ideal option for frequent or large transactions as it’s faster and more cost-effective than Ethereum’s mainnet.\n\nOptimized smart contracts\n\nThe smart contract can be optimized, which is a less extreme method. However, the more complicated the smart contract, the higher the cost is. As a result, a smart contract should be as straightforward and concise as possible. Remove all unnecessary functions and examine the code to see if it can be reduced.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vZGFpbHljb2luLmNvbS9saWRvLXNldHMtZGF0ZS1mb3Itc3RldGgtd2l0aGRyYXdhbHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Lido Finally Sets Date for stETH Withdrawals - DailyCoin",
        "content": "Lido DAO announced it would soon have the final vote for the Lido V2 upgrade.\n\nHalf a billion dollars worth of ETH is set to be unlocked.\n\nLido assures ETH withdrawals would be serviced quickly.\n\nThe Ethereum Shapella upgrade that enabled staked ETH (stETH) withdrawals has only one final puzzle left. That puzzle is Lido.\n\nThe largest liquid staking derivatives (LSD) protocol has set a date for enabling staking withdrawals, with half a billion dollars worth of ETH set to enter the market.\n\nLido DAO, the governing body of the protocol, shared on Twitter on Tuesday that it’s planning to enable staked ETH withdrawals next week.\n\nThe DAO said that the final vote for the Lido V2 upgrade is set for May 12. The vote will last three days, and if there are no last-minute changes and the vote is successful, Lido will enable withdrawals on May 15.\n\nA Lido V2 update:\n\n\n\nThe final on-chain vote for the V2 upgrade is scheduled for this Friday, May 12th.\n\n\n\nIf no last-minute findings are surfaced and the vote is successful, Lido V2 will be live after the vote enactment on May 15th 🏝️ — Lido (@LidoFinance) May 8, 2023\n\nThere are around 270,000 ETH, worth $500 million at the current ETH price of $1,844, locked in Lido’s smart contracts. After the upgrade, stakers who staked with Lido will be able to swap their stETH back for ETH for the first time since the launch of the Beacon Chain in December 2020.\n\nLido assured that withdrawal requests are “likely to be serviced more quickly during the first three days.”\n\nLido allows users to stake less than 32 ETH and is the most popular staking service in the market. According to data from Nansen, Lido currently has over 6.1 million ETH deposits. stETH is the eighth largest cryptocurrency with a market cap of almost $12 billion.\n\nThe Shapella upgrade that went live on Ethereum mainnet on April 12 enabled Ethereum validators to either fully or partially withdraw their staked ETH. The withdrawal queue has virtually been cleaned, with beaconcha.in showing only one validator looking to exit the staking program.\n\nOn the Flipside\n\nThe 270,000 ETH currently locked in Lido’s smart contracts can fluctuate. However, it’s unlikely that there will be a mass exodus of stETH holders since Lido has seen an uptick in deposits following the Shapella upgrade.\n\nWhy You Should Care\n\nLido is the largest staking services provider in the market. Lido stakers will now be able to finally swap their stETH for ETH.\n\nRead more about ETH staking deposits reaching an all-time high:\n\nETH Staking Withdrawals Wane as Deposits Hit New All-Time High\n\nRead more about Ethereum withdrawal queue dropping to 0:\n\nEthereum Withdrawal Queue Drops to 0 as Community Hails PoS Completion"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDUvMDkvYWF2ZS1kZXBsb3lzLXYzLW9uLWV0aGVyZXVtLWxheWVyLTItbmV0d29yay1tZXRpcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Aave Deploys V3 on Ethereum Layer-2 Network Metis - Crypto Times",
        "content": "In a recent tweet, Aave shared about bringing its decentralized liquidity protocol Aave V3 to Ethereum layer-2 scaling platform, MetisDAO, to expand its DeFi offerings. Metis users can now access Aave’s borrowing and lending services with improved risk management and gas optimization.\n\nA new era of Decentralized Finance is here.@AaveAave’s V3 lending markets are officially live in Metis👻\n\n\n\nTry it out now⚡️ pic.twitter.com/bS4F8thPhp — Metis🌿 (@MetisL2) May 8, 2023\n\nAave’s token-holders overwhelmingly voted in favor of launching version 3 of their lending and borrowing protocol on the Metis Network with 100% in favor when voting closed on May 5.\n\nMetis highlighted the benefits for its users with the deployment of Aave’s protocol on its Ethereum layer-2 scaling platform. These include better risk management with supply and borrowing limitations, and segregated borrowing to protect against market contagion, as well as the possibility to borrow assets with less collateral thanks to Aave’s “high efficiency” mode.\n\nAave will increase the pool of collateral assets, reduce transaction fees, and provide access to an increased range of DeFi solutions through its “isolation” mode, cross-chain portals, and gas optimization features.\n\nAave is now a vital part of the DeFi ecosystem, which has a total value of $5.5 billion locked in the protocol. The third version of the platform has been deployed on many other Ethereum layer-2 protocols, including Avalanche AVAX, Polygon, Optimism (OP), and Arbitrum (ARB), expanding the platform’s scope.\n\nAave’s token-holders overwhelmingly voted in favor of launching version 3 of their lending and borrowing protocol on the zkEVM, with more than 99% in favor when voting closed on April 16. While Aave has yet to deploy on zkSync Era, it is making strides in scaling infrastructure."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vaW52ZXp6LmNvbS9uZXdzLzIwMjMvMDUvMDgvc29sYW5hLXByaWNlLXByZWRpY3Rpb24tYXMtYml0Y29pbi1ldGhlcmV1bS1jb25nZXN0aW9uLWludGVuc2lmaWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Solana price prediction as Bitcoin, Ethereum congestion intensifies - Invezz",
        "content": "Solana (SOL/USD) price retreated to the lowest point since April 27th as concerns about Bitcoin and Ethereum congestion continued. The coin plunged to a low of $21, which was much lower than the year-to-date high of $27.13.\n\nBitcoin and Ethereum congestion\n\nCopy link to section\n\nThe biggest cryptocurrency news story on Monday was that congestion among Bitcoin and Ethereum continued. As a result, Binance announced that it had temporarily paused withdrawals of Bitcoin as the team handled the situation.\n\nBitcoin’s network fees have therefore soared. On-chain data shows that the total fees in Bitcoin surged to 6.13 BTC. Including subsidies, the fees have jumped to 12.38 BTC. It is unclear why this happened. However, data further data from Binance showed that the largest Bitcoin withdrawal on record happened during the weekend.\n\nA BTC holder withdrew 162,000 BTC valued at over $4.5 billion. Meanwhile, data compiled by DeFi Llama shows that Binance had outflows valued at over $293 million in the past 24 hours.\n\nBREAKING: #Binance outflow data confirms largest withdrawal in it's history, over 162,000 $BTC has left the exchange, valued at over $4.6 Billion. Are Whales/Insiders jumping ship? 👀 pic.twitter.com/QSXYAEvHkt Are you looking for fast-news, hot-tips and market analysis? Sign-up for the Invezz newsletter, today. Featured Broker Looking to invest? Invest and trade CFD stocks, ETFs, digital assets & commodities in minutes with our highest-rated broker. Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money. Open your account Buy or sell stock CFDs with Plus500. 82% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you can afford to take the high risk of losing your money. Ad — WhaleWire (@WhaleWire) May 7, 2023\n\nAll these developments are positive for Solana, a blockchain that is known for its speed and low transaction costs. While Bitcoin has over 400k transactions and Ethereum has over 200k transactions pending, Solana has zero. This could be a positive catalyst for Solana prices as demand rises.\n\nMeanwhile, the total value locked (TVL) in Solana has crawled back in the past few months. It stands at 47 million SOL, the highest point since December. It started the year at 25 million SOL. This happened as the number of active users jumped to over 200k, which was higher than the year-to-date low of about 100k.\n\nSolana price prediction\n\nCopy link to section\n\nSOL chart by TradingView\n\nThe 4H chart shows that the SOL price has lost the momentum it had a few months ago. It has already slipped by more than 20% from the highest point in March. This means it has moved into a bear market. The coin has moved below the 25-day and 50-day exponential moving averages.\n\nNotably, Solana has retested the ascending trendline that connects the lowest levels since March 15. Solana price has also formed a head and shoulders pattern. Therefore, from a technical perspective, the outlook remains a bit bearish, with the next key support to watch being at $20. A move above the right shoulder at $23 will invalidate the bearish view."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vaW52ZXN0b3JwbGFjZS5jb20vMjAyMy8wNS93aHktdGhlc2UtMy1zdG9ja3MtYW5kLWNyeXB0b3MtYXJlLXRyZW5kaW5nLW5vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Why These Trending Stocks and Cryptos to Buy Now Are Enticing - InvestorPlace",
        "content": "Tune in Wednesday, March 13th at exactly 1 PM ET for Louis’ Emergency Briefing and receive his #1 stock pick for 2024 FREE."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8xMzk0NzAvcHVkZ3ktcGVuZ3VpbnMtYnVja2VkLW5mdC1jcmFzaC1ub3ctcmFpc2VkLTktbWlsbGlvbtIBVGh0dHBzOi8vZGVjcnlwdC5jby8xMzk0NzAvcHVkZ3ktcGVuZ3VpbnMtYnVja2VkLW5mdC1jcmFzaC1ub3ctcmFpc2VkLTktbWlsbGlvbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Pudgy Penguins Bucked the NFT Crash—Now It’s Raised $9 Million - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nPudgy Penguins, an Ethereum NFT project that surged amid the 2021 bull run and then toppled into chaos, was purchased by a serial entrepreneur about a year ago and given a second life—right as the market collapsed. But the cartoon birds have persevered, and now the team has raised funding as its ambitions grow.\n\nToday, Pudgy Penguins announced that it has raised $9 million in seed funding in a round led by early-stage investment firm 1kx, with participation from Big Brain Holdings, Kronos Research, Old Fashion Research, CRIT Ventures, and the founders of LayerZero Labs, per a release.\n\nThe project launched in July 2021, just as the NFT market started putting up billions of dollars’ worth of trading volume each month, and Pudgy Penguins’ rise was propelled in part by a viral story in The New York Times.\n\nAD\n\nAD\n\nWe’re not waiting for mass adoption… We’re creating it. May 18th. pic.twitter.com/FjCS0WgTtd — Pudgy Penguins (@pudgypenguins) May 7, 2023\n\nBut the initial buzz didn’t last, and by early 2022, the community was in disarray amid controversy over a co-founder’s past Web3 actions and plans by some NFT holders to break away by “wrapping” their Penguins as another token. Pudgy prices fell sharply amid the drama.\n\nLuca Netz, a serial entrepreneur, purchased the project IP outright from the founders in April 2022 for $2.5 million, and told Decrypt that Pudgy Penguins didn’t have the millions of dollars’ worth of funds that some NFTs projects and startups had banked during the bull run.\n\n“When we bought it, we had no money in the bank,” he said. “And we knew that.”\n\nNetz said that Pudgy Penguins “needed a real operator” to steer the ship. Soon after, however, overall NFT sales volume plummeted amid a crypto market crash, generating fewer creator royalties from secondary market sales and diminishing broader enthusiasm in the space. His team had to be “really scrappy” to grow the project amid those conditions.\n\nAD\n\nAD\n\nMany NFT projects have lost considerable value over the last year. The Bored Ape Yacht Club, for example, fell from a peak starting price of about $429,000 (152 ETH) in late April 2022 to a current price of $82,600 (45 ETH). But Pudgy Penguins has bucked that trend, rising from $4,365 (1.55 ETH) to $8,170 (4.44 ETH) in the same span.\n\nAmid that market-defying growth, Pudgy Penguins has launched physical toy projects and other merch and built an advisory board with leaders from Meta and Hasbro. The project recently said that it signed with major Hollywood talent agency WME to pursue media projects and beyond, and it has generated some $250 million worth of total trading volume to date.\n\nAnd while those moves have set Pudgy Penguins up to explore mainstream plans, the project has also grown its cachet amongst NFT die-hards, no doubt helped in part by being one of the rare profile picture (PFP) projects that has actually gained value amid a broader freefall.\n\nWe’re proud to announce that @WME will be representing us as our official talent agency. Together, with WME’s relationships in film, TV, and gaming, we will focus on strategic partnerships that help Pudgy Penguins reach new audiences. pic.twitter.com/TtbkLexxAV — Pudgy Penguins (@pudgypenguins) May 5, 2023\n\nFrom his vantage point, Netz said that he understands what users want from the project. The first NFT he ever bought was a Pudgy Penguin, and he told Decrypt that he then went on to trade millions of dollars’ worth of NFTs after that.\n\nNetz later purchased the Pudgy IP thinking that it had all the pieces to drive both a Web3 community and mainstream extensions ranging from products to entertainment media. It’s family-friendly and inclusive, he said, with a fervent community of NFT holders behind it.\n\nMany NFT projects talk about creating major IP—for Netz, achieving that goal would mean ensuring that Pudgy Penguins has broad “influence.” Pudgy Penguins has notched over 3 billion views on its official GIFs and tens of millions of Instagram views, and now the seed funding and apparent WME deal may help it reach an even wider audience.\n\n“I look at the Pudgy Penguin like an influencer,” Netz said. “This character is transcendent in its ability to get where we want it to be.”\n\nAD\n\nAD"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wYXlwYWwtcy1jcnlwdG8taG9sZGluZ3MtaW5jcmVhc2VkLWJ5LTU2LWluLXExLTIwMjMtdG8tbmVhcmx5LTFi0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "PayPal's crypto holdings increased by 56% in Q1 2023 to nearly $1B - Cointelegraph",
        "content": "Financial technology company PayPal recently disclosed its cryptocurrency holdings in a quarterly report filed to the United States Securities and Exchange Commission.\n\nClaiming a combined total of $943 million in cryptocurrency assets as of March 31, 2023, the filing shows a 56% increase over the company’s previous quarter where PayPal disclosed $604 million.\n\nPayPal’s reported total financial liabilities for this quarter were $1.2 billion, with crypto assets making up 77.9% — up more than 10% from 2022’s reported fourth quarter liabilities.\n\nRelated: PayPal crypto partner Paxos raises $300M\n\nAccording to the report, PayPal considers its crypto assets a “safeguarding liability” due to the “unique risks associated with cryptocurrencies.” The disclosure also indicates that the specific cryptocurrencies held by the company remain unchanged since last quarter:\n\n“We allow our customers in certain markets to buy, hold, sell, receive, and send certain cryptocurrencies as well as use the proceeds from sales of cryptocurrencies to pay for purchases at checkout. These cryptocurrencies consist of Bitcoin, Ethereum, Bitcoin Cash, and Litecoin (collectively, ‘our customers’ crypto assets’).”\n\nCustody of the assets PayPal holds on behalf of its customers remains limited to third-party holding companies. PayPal recognizes that this presents a liability for customers in the event that third parties are unable to process transactions — a statement carried over from last quarter’s filing — however, the filing also indicates that no such fault has yet occurred:\n\n“As of March 31, 2023, the Company has not incurred any safeguarding loss events, and therefore, the crypto asset safeguarding liability and corresponding safeguarding asset were recorded at the same value.”\n\nThe Q1 2023 cryptocurrency asset breakdown for PayPal includes $499 million in Bitcoin (BTC) (up from December’s $291 million), $362 million in Ether (ETH) (up from $250 million), and $82 million composed of Bitcoin Cash (BCH) and Litecoin (LTC) (up from $63 million).\n\nScreenshot of PayPal’s quarterly financial disclosure.\n\nPayPal’s profitability also increased in the first quarter. On a generally accepted accounting principles (GAAP) basis, the company disclosed per-share earnings of $0.70, up from $0.43 in the first quarter of 2022. On a non-GAAP basis, PayPal’s per-share earnings were $1.17, up from $0.88 in the first quarter of 2022."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZGVjcnlwdC5jby8xMzk0MzkvZ2VybWFuLWZpbnRlY2gtdW5zdG9wcGFibGUtZmluYW5jZS1sYXVuY2gtZXVyb3Blcy1maXJzdC1kZWZpLW5hdGl2ZS1iYW5r0gFoaHR0cHM6Ly9kZWNyeXB0LmNvLzEzOTQzOS9nZXJtYW4tZmludGVjaC11bnN0b3BwYWJsZS1maW5hbmNlLWxhdW5jaC1ldXJvcGVzLWZpcnN0LWRlZmktbmF0aXZlLWJhbms_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "German Fintech Unstoppable Finance to Launch Europe’s First 'DeFi-Native Bank' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe ink still hasn’t dried on the passing of the EU’s new Markets in Crypto Assets (MiCA) bill, a landmark in comprehensive crypto legislation for the bloc’s 27 states, and already the furnaces of invention are fired up for at least one European crypto company.\n\nBerlin-based fintech startup Unstoppable Finance, currently most well known for its self-custodial crypto wallet called Ultimate, announced today it will be rolling out Europe’s first compliant \"DeFi-native bank\" alongside a fiat-backed Euro-pegged stablecoin following MiCA’s guidance.\n\nThe DeFI banking arm will ensure that the stablecoin is fully backed by reserves, as outlined by the new legislation from Brussels, says co-founder and CTO Peter Grosskopf in a call to Decrypt.\n\nAD\n\nAD\n\nPrior to founding Unstoppable, Grosskopf worked with Maximillian von Wallenberg-Pachaly and Omid Aladini to launch Börse Stuttgart Digital Exchange (BSDEX), Germany's first regulated crypto exchange in Germany.\n\nThe three then founded Unstoppable Finance in 2021. Their Ultimate DeFi wallet enables users to interact with Ethereumand Solana protocols, self-custody assets, and trade crypto from their smartphones.\n\nGrosskopg highlighted the recent liquidity crises that rocked Silicon Valley Bank, Signature Bank, Silvergate, and Credit Suisse earlier this year, highlighting how the chaos briefly depegged Circle's native stablecoin USDC “because [Circle holds] parts of its reserves in different bank accounts.”\n\n“With [Unstoppable’s DeFi bank] we are able at any time to deposit money to an European Central Bank (ECB) account,” said Grosskopf. “We try to put as much money as possible into an ECB account because we trust in [fiat] as the most stable form of money that we have today, so it’s not depending on the risk management of the bank. It's guaranteed money and that’s what we try to maximize.”\n\nThe company’s stablecoin is legally classified as an “e-money token,” which typically refers to any blockchain-based stablecoin that indexes its value to the price of the fiat currency it references.\n\nAD\n\nAD\n\nWhen asked about whether Unstoppable is acclimatizing itself to the EU’s new rules, Grosskopf answered in the affirmative, drawing on his previous history as part of the founding team and CTO of Solarisbank, the first tech company to get a German digital banking license seven years ago.\n\nAs for when exactly the trio plans to launch the bank, it's still unclear.\n\n“No timeline yet,\" an Unstoppable Finance spokesperson told Decrypt. \"As soon as possible obviously. Depends also on how fast we can get all the necessary licenses.”"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDUvMDkvYmFieWRvZ2UtdGVhbS1sYXVuY2hlcy1wcm9wb3NhbC10by1idXJuLTEwMC1xdWFkcmlsbGlvbi1jb2lucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "BabyDoge Team Launches Proposal to Burn 100 Quadrillion Coins - The Crypto Basic",
        "content": "The burn is expected to destroy 100 quadrillion BABYDOGE tokens on the Ethereum network to bolster the project’s security.\n\nThe Baby DogeCoin (BABYDOGE) team has submitted a proposal to burn up to 100 quadrillions of BABYDOGE tokens dormant on Ethereum since the project launched on the network last November. The proposal also seeks to reduce fees for BABYDOGE transactions on Ethereum to 0%.\n\nThe team unveiled the proposal today shortly after a Twitter poll suggested that the community agrees with the proposition. Although the poll consented to the proposition, a definite proposal is necessary to ensure that all formalities are observed.\n\n100 Quadrillion burn and 0% fee on ETH proposal is now live to be voted on by the DAO Vote here: https://t.co/bTWRzcaLmf\n\nOrhttps://t.co/ZEAKhKyJFg To spread awareness of the proposal we will give $500 USDT to 1 winner who: 1. Retweets this tweet\n\n2. Follows @BabyDogeCoin pic.twitter.com/ZzDfuMlG43 — Baby Doge (@BabyDogeCoin) May 9, 2023\n\n- Advertisement -\n\nAccording to the proposal, the 100 quadrillion token burn is expected to help enhance the project’s security and mitigate risks of unscrupulous individuals taking advantage of the tokens. The BABYDOGE team noted that the proposed move is in response to concerns raised by the community. The tokens to be burned are worth a whopping $209 million at current rates.\n\nThe BABYDOGE Burn Does not Involve Circulating Tokens.\n\nIt is important to note that although the tokens to be burned represent part of the asset’s total supply, they are not actually in circulation. This indicates that the burn would have little to no effect on the babydoge price actions the way burns involving circulating tokens would. The primary objective of the burn is security enhancement.\n\n- Advertisement -\n\nNotably, the team plans to leave some BABYDOGE tokens on the Ethereum network to allow investors to continue to bridge their assets between the Ethereum network and Binance Smart Chain. If the community passes the proposal and the 100 quadrillion tokens are burned, this will leave 85 quadrillions of BABYDOGE on Ethereum for bridging.\n\nOnce the proposal passes, BABYDOGE fees on Ethereum will be adjusted to 0% in 24 hours. However, the monumental burn will occur much later, on June 1. The team stressed that the move poses one concern: the fact that if there is an issue with BNB Chain, not all the BABYDOGE tokens will move to Ethereum.\n\nIf the proposal passes, this will be the largest burn in history. Besides the proposed burn, the BABYDOGE team remains committed to periodic burns to reduce the asset’s circulating supply. In March, the team burned one quadrillion tokens. The latest burn exercise involved 500 trillion BABYDOGE ($1.3 million) on May 2."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9saXF1aWQtc3Rha2luZy10b2tlbnMtdG8tZnVlbC10aGUtbmV4dC1kZWZpLWJvb23SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Liquid staking tokens to fuel the next DeFi boom - Cointelegraph",
        "content": "The decentralized finance (DeFi) space has been in correction mode, its current TVL of $50 billion representing less than a third of its peak in late 2021. The good news is that the market is preparing for another wave of DeFi adoption, primarily thanks to liquid staking tokens (LSTs), which have become the second-largest DeFi sector after decentralized exchanges (DEXs).\n\nLSTs revolve around the Ethereum ecosystem, enabling Ether (ETH) stakers to benefit from yield farming opportunities while their ETH tokens are locked to maintain the network that recently upgraded to a proof-of-stake (PoS) consensus mechanism. Liquid staking protocols provide users with LSTs in exchange for their locked ETH based on a 1:1 ratio to let them explore DeFi use cases during the staking process. Some protocols call these substitute tokens “liquid staking derivatives” (LSDs), but LST is a more accurate term since it represents ownership of staked ETH.\n\nHow will ETH’s Shanghai upgrade impact the DeFi space?\n\nFollowing the Shanghai upgrade (also called Shapella), more ETH is expected to be staked, which will stimulate the liquid staking sector and boost DeFi. We may see another DeFi boom similar to that of 2020 when Compound and its native token COMP made waves to trigger the DeFi summer. This time, LSTs have the chance to become the face of DeFi instead of DEXs and lending protocols.\n\nShanghai is a major Ethereum upgrade that allows stakers to withdraw their staked tokens for the first time since the Beacon Chain was integrated at the end of 2020. It is estimated that about 1.1 million ETH tokens have become instantly withdrawable. While some of it will likely be sold through exchanges, a great part of it might be used for staking purposes again, and this time, liquid staking protocols will be flooded.\n\nWith the Shanghai upgrade already live since mid-April, we can see a gold rush of LST adoption, with the DeFi community embracing LSTs for their ability to be the “internet bond” and provide a native form of yield. This can lead to DeFi protocols racing to get ahead by integrating LSTs. The sooner that DeFi protocols integrate LSTs, the greater the chance to secure a better place in the upcoming DeFi race, as the Shanghai update is expected to boost demand for staking services that also provide yield opportunities.\n\nThis liquid staking protocol addresses main obstacles in LST space\n\nEven before the impact of the Shapella upgrade becomes evident, liquid staking protocols are popular due to their unique functionality. Nevertheless, many of them deal with a range of pain points that impact user satisfaction. One of the challenges is the complexity of token models, which can create confusion for users who may struggle to understand the mechanics and implications of their investments. This complexity can stem from the varying tokenomics, reward structures, and risk profiles of different protocols, making it difficult for users to navigate the ecosystem and make informed decisions.\n\nAnother major issue is poor user experience, which can be attributed to the lack of user-friendly interfaces, inadequate documentation, and insufficient support services.\n\nHigh fees are also a concern in some liquid staking protocols, as they can significantly eat into staking yields and reduce the overall attractiveness of liquid staking.\n\nOne of the few liquid staking protocols that is working to address these challenges is Swell, which lets users stake ETH and receive swETH to start earning rewards in DeFi. While there are many liquid staking options, Swell aims to fix all the issues and compile the best offerings into a user-friendly experience. Swell focuses on simplicity, enabling ETH stakers to seamlessly dive into the journey of DeFi through its noncustodial decentralized application (DApp).\n\nSource: Swell\n\nBesides an improved user experience, Swell is reducing fees to unlock more rewards for users. As a rule, the fee rate for staking ranges from 10% to 25%, and may go even higher. With Swell, users can expect no protocol fees for a limited period.\n\nSwell is also putting a great emphasis on security, especially as the DeFi market has been plagued by hacking attacks and scams. The protocol is audited by high-profile blockchain security services including Sigma Prime.\n\nSwell can help DeFi projects, including lending protocols, DEXs and yield farming services, attract more users and secure a continual growth of the sector’s TVL. Meanwhile, individual stakers can start earning rewards without any deposit barriers.\n\nWith the DeFi race driven by liquid staking gaining traction, Swell will contribute to the next DeFi transformation by helping DeFi protocols grow their communities while offering stakers the best yield opportunities.\n\nLearn more about Swell"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDUwODAwNTI2MC9lbi9NZXRpc0RBTy1EZXBsb3lzLUFhdmUtUHJvdG9jb2wtVjMtdG8tQWNjZWxlcmF0ZS10aGUtRGVjZW50cmFsaXplZC1GaW5hbmNlLUVjb25vbXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "MetisDAO Deploys Aave Protocol V3 to Accelerate the Decentralized Finance Economy - Business Wire",
        "content": "TORONTO--(BUSINESS WIRE)--MetisDAO Foundation, an organization committed to building a robust and decentralized layer 2 infrastructure to power web3 enterprises, announced today that Aave Protocol V3 has now been deployed on Metis Layer 2 with overwhelming support from the Metis and Aave communities. By integrating the Aave V3 protocol for Metis markets, DeFi users will be able to take advantage of the combined benefits of Metis’ network speed and security and the Aave Protocol’s industry-leading features.\n\nThe deployment of Aave V3 to the Metis Layer 2 network will unlock new on-chain liquidity and DeFi capabilities for users across Aave and Metis. Aave V3 features can benefit the Metis ecosystem in several ways such as High-Efficiency mode for borrowing with less collateral, Supply and Borrow Caps for risk management, Siloed Borrowing for reducing contagion risks, Isolation Mode for increasing the pool of collateral assets, Cross-Chain Portals for accessing a wider range of DeFi solutions, Gas Optimization for reducing transaction fees, Modular Risk Controls for adjusting risk parameters, and DeFi Plug-and-Play for simplified integration with Aave V3.\n\n“The integration of Aave Protocol V3 brings enhanced capital efficiency with valuable new security and risk mitigation features,” says Metis co-founder, Kevin Liu. “We’re excited to see the expansion of Metis Layer 2’s DeFi offerings for the Web3 Economy.”\n\nResearch indicates the total number of DeFi users increased by 35% from January 2022 to January 2023 – growing to 6.7 million users. This past month’s successful implementation of the Shapella upgrade on the Ethereum network has fueled further optimism in the future of DeFi. Recent studies predict that the global DeFi market will surpass $232 billion USD by 2030. As sentiment grows and more users explore the potential of DeFi, it’s critical they are able to participate in DeFi across platforms, with consistent speed, security, risk mitigation and industry-leading features.\n\nThe Aave Protocol is widely recognized as an industry-leading DeFi liquidity protocol with $ 5.5 billion in total value locked (TVL). The deployment of the Aave Protocol on Metis brings users of the Layer 2 network an established platform to supply and borrow cryptocurrencies.\n\nFor more information about Metis and its Smart Layer 2 solution, see: metis.io. Follow Metis on Twitter, and join the conversation on Discord.\n\nTo learn more about the Aave Protocol, please see: aave.com. Follow Aave on Twitter.\n\nABOUT METIS DAO\n\nMetisDAO is an organization focused on building decentralized scaling infrastructure to power web3 enterprises, and accelerate the entirety of the Web3 economy. The MetisDAO infrastructure aims to empower all Web2 business models to seamlessly migrate to Web3. The MetisDAO technical framework is custom-built to provide scalable, secure, and user-friendly solutions to decentralized organization management and incentive alignment.\n\nABOUT AAVE PROTOCOL\n\nAave Protocol is a non-custodial, open-sourced decentralized liquidity protocol that enables users to supply and borrow crypto assets.\n\nABOUT METIS LAYER 2\n\nMetis Layer 2 is a first-of-its-kind, user-friendly platform built to scale Ethereum and facilitate infrastructure development. The Metis Layer 2 is the core component of the Metis Stack, followed by the Reputation Power System, and the Decentralized Autonomous Company (DAC) Framework. The Metis Stack will provide the ideal environment for infrastructure development, day-to-day businesses, and other forms of open collaboration to take place.\n\nWhen using Metis, users can rest assured that their transactions are being secured by Ethereum mainnet while uniquely inheriting the underlying benefits of Ethereum. Builders and users are truly interacting with, and secured by, Ethereum mainnet."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdG9rZW5wb3N0LmNvbS9FY29ub21pc3QtWmViZXJnLUZvcmVjYXN0cy1FdGhlcmV1bS1BbHRjb2luLVN1cmdlLUR1cmluZy0yMDIzLVN1cGVyLUV1cGhvcmlhLTk5NjnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Economist predicts Ethereum-based altcoin Jasmy to soar over 100 times its current value - TOKENPOST",
        "content": "Economist predicts Ethereum-based altcoin Jasmy to soar over 100 times its current value\n\nRenowned economist and Bitcoin supporter Henrik Zeberg has made predictions concerning the bullish course of cryptocurrencies for the remainder of the year. Zeberg believes that one particular Ethereum-based altcoin, Jasmy (JASMY), will reach new heights and has the potential to soar more than 100 times its present market value, stating that the overall cryptocurrency market is approaching a more optimistic phase, surpassing the previous bull market in 2021.\n\nJasmy is a Japan-based Internet of Things (IoT) project with the primary objective of joining blockchain and IoT technology in creating a secure and safe environment for data usage designed to benefit everyone. Jasmy is currently trading at $0.007, a substantial 99.8% decline from its peak value.\n\nZeberg's overall bullish stance on cryptocurrencies can be seen in his prediction that the cryptocurrency market's total capitalization could sway toward a whopping $4.4 trillion. This prediction for JASMY is consistent with the current market's status as we approach the end of the year.\n\nThe expert counters the widespread notion of an impending US economic recession, with a bullish macroeconomic outlook. Zeberg believes that with the Federal Reserve halting interest rate increases, risk assets such as cryptocurrencies are now due for a considerable upswing.\n\nAll the talk of upcoming euphoria has aroused excitement and optimism among cryptocurrency enthusiasts. In this time of uncertainty, the cryptocurrency market has displayed immense potential for growth and development in the long run.\n\nOther crypto analysts have stated on social media that the bear market of 2022 is soon over, and the continuous rally of Bitcoin and the rest of the altcoin market is well underway. However, their predictions can still be invalidated if black swan events occur.\n\nTokenPost | [email protected]"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3MvYnVzaW5lc3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvY3VycmVuY3ktcHJpY2VzLW9uLW1heS05LWJpdGNvaW4tZGlwcy1iZWxvdy0yODAwMC1ldGhlcmV1bS1hbmQtb3RoZXItdG9rZW5zLWZhbGwtMTA1NTIyMzEuaHRtbNIBogFodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3MvYnVzaW5lc3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvY3VycmVuY3ktcHJpY2VzLW9uLW1heS05LWJpdGNvaW4tZGlwcy1iZWxvdy0yODAwMC1ldGhlcmV1bS1hbmQtb3RoZXItdG9rZW5zLWZhbGwtMTA1NTIyMzEuaHRtbC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Cryptocurrency Prices on May 9: Bitcoin dips below $28,000, Ethereum and other tokens fall - Moneycontrol",
        "content": "Cryptocurrency roundup\n\nThe cryptocurrency markets were trading in the red on Monday after a better-than-expected April US jobs data. Bitcoin (BTC) fell 2.81 percent to $28,171, whereas Ethereum (ETH) was below the $1,900 level. BTC volume in the last 24 hours stood at approximately $13.28 billion, falling 11.59 percent in the last 24 hours.\n\n\"After the US Job growth remained strong in April, Bitcoin rose to US$29,800 on Saturday. However, Bitcoin and Ethereum fell in the past 24 hours following Binance halting Bitcoin withdrawals for the second time in a day, citing large volumes,\" Edul Patel, Co-founder and CEO at Mudrex, said.\n\nStory continues below Advertisement Remove Ad\n\nThe global cryptocurrency market cap was trading higher around $1.16 trillion, falling 2.53 percent in the last 24 hours.\n\nThe total volume in DeFi is currently 2.82 billion, 8.45 percent of the total crypto market 24-hour volume. The volume of all stablecoins is now $29.28 billion, which is 87.74 percent of the total crypto market 24-hour volume.\n\nThe market cap of Bitcoin, the world's largest cryptocurrency, was around $545 billion. Bitcoin’s dominance is currently 47.09 percent, a loss of 0.08 percent over the day, according to CoinMarketCap.\n\nBinance had suspended deposits and withdrawals in March due to technical issues, during that period BTC dropped by about 1 percent.\n\nFor BTC, the Exponential Moving Average for 10-day EMA indicates sell at 28,733, and the 200-day EMA indicates buy at 24,630. The Simple Moving Average for 10-day SMA indicates sell at 28,828, and the 200-day SMA indicates buy at 22,139.\n\nRajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 47, with a neutral outlook. The Stochastic %K (14, 3, 3) at 50 and the Average Directional Index (14) at 16 indicate a Neutral outlook as well.\"\n\nStory continues below Advertisement Remove Ad\n\nStory continues below Advertisement Remove Ad\n\n\"The MACD Level (12, 26), at 83, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 31 and William's Percentage is Neutral at −63 as well,\" Menon added.\n\nAt 11.00 am on May 9, these were the prices of the top cryptocurrencies (data from WazirX):"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC91bmRlcnN0YW5kaW5nLWhvdy1jb3JlLWluZmxhdGlvbi1hZmZlY3RzLWJpdGNvaW4tYW5kLWV0aGVyZXVtLWFuZC1ob3ctYXZvcmFrLWhlbHBzLXRyYWRlcnMtcHJvZml0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Understanding how core inflation affects Bitcoin and Ethereum and how Avorak helps traders profit - Analytics Insight",
        "content": "In today’s volatile financial landscape, investors are not surprised to turn to alternative assets like cryptocurrencies for stability and growth. With the rise of Bitcoin and Ethereum, understanding the impact of inflation on these digital assets has become increasingly important. We’ll explore the concepts of inflation, hyperinflation, and stagflation and how they affect Bitcoin and Ethereum. Additionally, we’ll discuss how Avorak AI can help traders navigate these uncertain times and profit from the ever-changing crypto markets.\n\nInflation, Hyperinflation or Stagflation?\n\nInflation is the rate at which the general level of prices for goods and services rises, and subsequently, purchasing power is falling. Central banks attempt to limit inflation and avoid deflation to keep the economy running smoothly. However, in extreme cases, inflation can lead to hyperinflation or stagflation.\n\nHyperinflation occurs when a country experiences very high and usually accelerating inflation, eroding the real value of the local currency and causing the population to minimize their holdings of the currency. This can lead to losing confidence in the currency and shifting towards alternative assets like gold or cryptocurrencies.\n\nOn the other hand, stagflation is a situation where stagnant economic growth is accompanied by high inflation and high unemployment. This can be particularly challenging for policymakers, as they must balance efforts to stimulate the economy with the need to control inflation.\n\nRegarding Bitcoin and Ethereum, both cryptocurrencies have shown potential as alternative assets during times of economic uncertainty. They offer a decentralized and secure store of value that isn’t tied to the traditional financial system. This makes them particularly attractive during times of inflation, hyperinflation, or stagflation, as they can potentially maintain their value better than traditional assets like stocks or bonds.\n\nHow the FED’s Interest Rate Hikes affecting Bitcoin and Ethereum\n\nThe Federal Reserve’s interest rate hikes can significantly impact the value of cryptocurrencies like Bitcoin and Ethereum. As the central bank raises interest rates, it becomes more expensive for businesses and consumers to borrow money. This can slow economic growth, negatively affecting the value of stocks and other traditional assets.\n\nAs investors seek alternative investments, cryptocurrencies like Bitcoin and Ethereum may become more attractive. However, it’s important to note that cryptocurrencies are still relatively new and untested assets. Their value can be extremely volatile, and their long-term performance during periods of economic uncertainty still needs to be determined.\n\nThat said, some analysts believe that the decentralized nature of cryptocurrencies may help protect them from the negative effects of central bank policies. Unlike traditional assets, which are often tied to a specific country or economic system, cryptocurrencies operate independently of any central authority. This means that the actions of central banks like the Federal Reserve don’t directly influence their value.\n\nAs a result, some investors see cryptocurrencies as a potential hedge against the negative effects of inflation and interest rate hikes. However, it’s important to remember that investing in cryptocurrencies carries significant risks, and their performance during periods of economic uncertainty is far from guaranteed.\n\nAvorak AI – Navigate Uncertain Financial Waters with Ease\n\nIn the face of economic uncertainty and volatile crypto markets, it can be challenging for traders to decide which assets to invest in. That’s where Avorak AI comes in. Avorak is an AI-powered crypto trading platform that uses advanced algorithms and machine learning to help traders navigate complex crypto markets.\n\nBy analyzing a wide range of data, including historical price trends, market sentiment, and real-time Crypto News, Avorak’s AI can identify patterns and make predictions about the future performance of cryptocurrencies like Bitcoin and Ethereum.\n\nMoreover, Avorak’s AI can quickly adjust its predictions and recommendations based on real-time data, ensuring that traders always have the most accurate signals at their fingertips. This can be particularly valuable during times of inflation or crisis when traditional financial indicators may be less reliable.\n\nIn addition to its AI-powered trading bots, Avorak also offers a range of other tools to help ease cumbersome tasks and enhance performance. These AI-powered tools include chatbots and image-generation modules.\n\nFinal Thoughts\n\nBy leveraging powerful AI Crypto tools like Avorak, traders can navigate the complex world of cryptocurrencies with greater confidence and insight. With its advanced algorithms, machine learning capabilities, and real-time Crypto News analysis, Avorak can help traders stay ahead of the curve and make smarter investment decisions in these uncertain times.\n\nLearn more here:\n\nWebsite: https://avorak.ai\n\nBuy AVRK: https://invest.avorak.ai/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vdHJpYnVuZW9ubGluZW5nLmNvbS92ZWNoYWluLXZzLWV0aGVyZXVtLXdoaWNoLW9uZS1pcy1tb3JlLXByb21pc2luZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "VeChain vs. Ethereum: Which One Is More Promising? - Tribune Online",
        "content": "As the world becomes more and more digitized, the importance of cryptocurrencies is becoming more apparent. Two of the most popular cryptocurrencies in the market today are VeChain and Ethereum. Both of these cryptocurrencies have their unique features and capabilities, and are often compared to each other. In this article, we will compare VeChain and Ethereum, and analyze which one is more promising. Like ETH and other crypto investment, you may also want to know about the Importance of Bitcoin\n\nVeChain: A Blockchain Platform for Business\n\nVeChain is a blockchain platform that was created to provide solutions for businesses. VeChain aims to help businesses streamline their operations and improve their supply chain management. VeChain uses a two-token system, VET and VTHO, which work together to facilitate transactions on the platform. VeChain is known for its advanced supply chain management capabilities and has partnerships with various global companies.\n\nEthereum: A Platform for Decentralized Applications\n\nEthereum is a blockchain platform that was created to facilitate the development of decentralized applications (dApps). Ethereum is the second-largest cryptocurrency by market capitalization, and it is known for its smart contract capabilities. Ethereum uses its native cryptocurrency, Ether (ETH), to facilitate transactions on the platform. Ethereum is widely used in the development of dApps and has a large developer community.\n\nComparison of VeChain and Ethereum\n\nNow, let us compare VeChain and Ethereum based on various factors:\n\nTechnology\n\nBoth VeChain and Ethereum use blockchain technology, but they have different implementations. VeChain uses a Proof of Authority (PoA) consensus algorithm, while Ethereum uses a Proof of Work (PoW) consensus algorithm. PoA is faster and more efficient than PoW, but it is also more centralized. Ethereum is also planning to move to a Proof of Stake (PoS) consensus algorithm, which will make it more efficient and eco-friendly.\n\nScalability\n\nScalability is a major issue for both VeChain and Ethereum. VeChain can process around 10,000 transactions per second (TPS), while Ethereum can process around 15 TPS. However, both platforms are working on solutions to improve their scalability. VeChain is planning to use a multi-party payment protocol to increase its TPS, while Ethereum is planning to implement sharding and other solutions.\n\nUse Cases\n\nVeChain is primarily focused on providing solutions for businesses, especially in the area of supply chain management. VeChain has partnerships with various global companies, including PwC, BMW, and DNV GL. Ethereum, on the other hand, is focused on facilitating the development of decentralized applications. Ethereum is used in various industries, including finance, gaming, and healthcare.\n\nTokenomics\n\nVeChain uses a two-token system, VET and VTHO. VET is used for transactions and is also staked for network security, while VTHO is used to pay for transaction fees. Ethereum uses Ether (ETH) as its native cryptocurrency, which is used to pay for transaction fees and as a store of value. Both VET and ETH have a limited supply, which makes them deflationary assets.\n\nConclusion\n\nIn summary, VeChain and Ethereum are both promising cryptocurrencies with unique features and use cases. While VeChain is focused on providing solutions for businesses, especially in the area of supply chain management, Ethereum is focused on facilitating the development of decentralized applications. If you are interested in investing in cryptocurrencies, it is important to do your research and understand the technology and use cases of each cryptocurrency before making any investment decisions."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC0xMC1jcnlwdG8tcHJpY2VzLW1vc3QtcG9wdWxhci1jb2lucy1iaXRjb2luLWV0aGVyZXVtLXNlZS1sb3NzZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Top 10 Crypto Prices: Most Popular Coins Bitcoin, Ethereum See Losses - Analytics Insight",
        "content": "Disclaimer: Any financial and crypto market information given on Analytics Insight are sponsored articles, written for informational purpose only and is not an investment advice. The readers are further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Conduct your own research by contacting financial experts before making any investment decisions. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Analytics Insight of being absolved from any/ all potential legal action, or enforceable claims. We do not represent nor own any cryptocurrency, any complaints, abuse or concerns with regards to the information provided shall be immediately informed here."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMDgvaW1wYWN0LXByaWNlLWV0aGVyZXVtLWV0aC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "The impact on the price of Ethereum (ETH) - The Cryptonomist",
        "content": "On 6 May 2023, the Ethereum Foundation transferred almost $30 million in Ether (ETH) to the Kraken exchange: the news caused a stir in the cryptocurrency market as traders and investors speculated on the potential impact on the price of ETH.\n\nEthereum’s non-profit foundation could affect the price of the token by transferring $30 million in ETH\n\nETH is the native cryptocurrency on the Ethereum blockchain, which is the second largest cryptocurrency by market cap after Bitcoin.\n\nETH is widely used in decentralised applications (dApps) and smart contracts on the Ethereum network, as well as for payments and as a store of value.\n\nIts price is subject to market forces such as supply and demand, adoption, innovation and speculation.\n\nThe Ethereum Foundation’s transfer of ETH to Kraken has raised questions about its motives and implications.\n\nSome observers have speculated that the Foundation is selling its fiat ETHs to fund its operations or diversify its portfolio.\n\nOthers have argued that the move could be part of a broader strategy to promote liquidity and stability in the cryptocurrency market by providing a large volume of ETHs to a reliable exchange.\n\nThe immediate impact of the news on the ETH price was a drop of 4.8 percent, from $1,978 to $1,878, according to CoinMarketCap data.\n\nThe drop was not significant in itself, given today’s market volatility, but reflected the nervousness of some traders and investors about a potential sell-off event.\n\nSome traders may have taken the news as a signal to sell their ETH holdings, either to lock in profits or to avoid potential losses.\n\nEthereum Foundation does not comment on the reasons for the transfer, leaving investors in doubt\n\nThe Ethereum Foundation did not comment on the reasons for the transfer of ETH to Kraken, nor did it reveal the amount or timing of other transfers.\n\nThe Foundation is known for its transparency and accountability in managing its resources, which include ETH holdings, grants and partnerships.\n\nThe foundation supports a wide range of initiatives related to research, development, education and community building on the Ethereum platform, as well as other blockchain and cryptocurrency projects.\n\nThe Ethereum Foundation’s transfer of ETH to Kraken highlights the importance of liquidity and trust in the cryptocurrency market.\n\nLiquidity refers to the ability to buy and sell assets quickly and at a fair price, without causing significant market volatility.\n\nTrust refers to the confidence investors have in the integrity and reliability of the exchanges and platforms on which they trade cryptocurrencies.\n\nKraken is one of the oldest and most trusted cryptocurrency exchanges, known for its security, reliability and ease of use.\n\nBy transferring its ETH to Kraken, the Ethereum Foundation could signal its support for a reliable and regulated exchange that promotes market liquidity and stability.\n\nThe Ethereum Foundation’s transfer of ETH to Kraken also raises broader questions about the role and responsibility of non-profit organisations in the cryptocurrency ecosystem.\n\nNon-profit organisations such as the Ethereum Foundation play a crucial role in supporting innovation, education and community building in the blockchain and cryptocurrency space.\n\nOften funded by donations, grants and partnerships, they use their resources to promote the public good and advance their missions.\n\nHowever, they also face challenges and risks such as financial sustainability, regulatory compliance and public scrutiny. The Ethereum Foundation in particular has been criticised for its governance.\n\nUpdates on ETH stakes on the Beacon chain since the Shanghai update\n\nIn addition to the Ethereum Foundation’s transfer of ETH to Kraken, there is another recent development in the Ethereum ecosystem that has caught the attention of the cryptocurrency community.\n\nThe total amount of ETH deposited into the Ethereum Beacon Chain since the Shanghai update has exceeded the withdrawals made during the same period.\n\nThe Ethereum Beacon Chain is a new blockchain that acts as a bridge between the Ethereum network, also known as Ethereum 1.0, and the Ethereum 2.0 network.\n\nThe Shanghai update, also known as EIP-3675, was a turning point in the development of the Beacon Chain as it allowed ETH to be transferred from the Ethereum 1.0 chain to the Beacon Chain.\n\nPrior to the upgrade, users had to go through a complex and risky migration process that involved depositing ETH in a smart contract and then withdrawing it from the Beacon Chain.\n\nThe upgrade simplified the process by allowing users to transfer their ETH directly to the Beacon Chain via a special contract.\n\nThe success of the Shanghai upgrade and the resulting increase in the amount of ETH directed to the Beacon Chain is significant for several reasons.\n\nFirst, it demonstrates that the Ethereum community is committed to the long-term vision of Ethereum 2.0 and the benefits it promises, such as faster and cheaper transactions, increased dApp and smart contract functionality, and a more sustainable and inclusive ecosystem.\n\nSecond, it shows that users have confidence in the security and reliability of the Beacon Chain and the Ethereum 2.0 roadmap, despite the risks and uncertainties of any new technology.\n\nThird, it suggests that betting on the Beacon Chain can be a profitable and rewarding activity for users, who can earn rewards and participate in governance decisions.\n\nIncreasing the amount of ETH staked on the Beacon Chain also has implications for the ETH price and the cryptocurrency market as a whole.\n\nStaking ETH on the Beacon Chain requires users to commit their ETH for a period of time, ranging from several months to several years, depending on the amount and validator status.\n\nThis reduces the supply of ETH available for trading and can put upward pressure on the price as demand for ETH from investors, traders and dApps increases.\n\nFurthermore, staked ETHs generate rewards in the form of new ETHs issued by the network, which can create a positive feedback loop for price appreciation and network adoption.\n\nHowever, the rise of staked ETH also poses some challenges and risks for the Ethereum ecosystem.\n\nIn conclusion, the Ethereum Foundation’s transfer of ETH to Kraken and the rise of ETH stakes on the Beacon Chain are two examples of the dynamic and complex nature of the Ethereum ecosystem and the cryptocurrency market.\n\nBoth developments reflect the interests, motivations and expectations of various stakeholders."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3dlZWtseS1tYXJrZXQtd2F0Y2gtYml0Y29pbi1ldGhlcmV1bS1ob2xkLXN0ZWFkeS1hcy1tZW1lLWNvaW5zLXJhbGx5L9IBZGh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL3dlZWtseS1tYXJrZXQtd2F0Y2gtYml0Y29pbi1ldGhlcmV1bS1ob2xkLXN0ZWFkeS1hcy1tZW1lLWNvaW5zLXJhbGx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 May 2023 07:00:00 GMT",
        "title": "Weekly Market Watch: Bitcoin, Ethereum Hold Steady As Meme Coins Rally - TronWeekly",
        "content": "During the previous week, there was a surge of optimism in the cryptocurrency market, with Bitcoin and Ethereum maintaining stability and resisting the bears. Additionally, meme coins rallied, contributing to the bullish trend and improving the general market sentiment.\n\nTwo meme coins with smaller market caps surpassed Bitcoin and Ethereum and showed remarkable growth in the weekly chart. These coins distinguished themselves in the crypto market by demonstrating impressive performance.\n\nSome low-cap coins on the list of weekly gainers have shown substantial growth, with Pepe (PEPE) leading the pack, followed by FLOKI.\n\nOver the last seven days, the Pepe (PEPE) cryptocurrency has experienced an astounding 300% surge. Despite being relatively new, PEPE has enjoyed a remarkable increase in spot trading volume in the last 24 hours, surpassing $2.9 billion and landing in fifth place among USDT, BTC, ETH, and USDC.\n\nBinance, among the biggest cryptocurrency exchanges globally, recently added this new coin on May 5th, and it is anticipated that it will be responsible for the most substantial trading volume going forward.\n\nWithin the last 24 hours, Binance has recorded a trading volume of $1.4 billion, positioning it as the third most significant cryptocurrency by trading volume, behind only BTC and ETH. Moreover, OKX has contributed the highest trading volume for this coin in the last 24 hours, amounting to an impressive $650 million.\n\nAt present, Pepe is trading at $0.000002778, demonstrating a 17.43% increase in the past 24 hours and a significant 15.45% surge in its marketcap, with a 45.12% decrease in the 24 hours trading volume. The token hit its peak of $0.000004354 after beginning the week at $0.0000004577, displaying a strong and remarkable weekly performance.\n\nSource: CoinMarketcap\n\nMeanwhile, FLOKI is also gaining attention from the community as a second-top weekly performer. Over the past week, FLOKI has experienced an impressive surge of approximately 2%. As of now, FLOKI is trading at $0.00004036; in the last 24 hours, the token has experienced a significant 3.08% increase.\n\nSource: CoinMarketcap\n\nThe price increase of FLOKI was initiated by various cryptocurrency exchange platforms announcing their decision to list the coin, including Binance and GEN 3.0 Crypto Exchange ixfi. Bitfinex, a prominent digital asset trading platform, also announced its support for FLOKI.\n\nThe cryptocurrency community has responded positively to the news of FLOKI’s addition to multiple trading platforms, and investors are hopeful for potential gains in the near future.\n\nMoreover, some popular coins are experiencing gains in weekly charts, including TRON at 4%, STX at 3%, and Rocket Pool, with an increase of 6%, according to the data from CoinMarketcap.\n\nBitcoin (BTC) & Ethereum (ETH) Weekly Review\n\nThe world’s largest cryptocurrency, Bitcoin, maintained a steady position within its crucial resistance range of $28,178.39 to $29,952.03 over the last week. Meanwhile, the second most valuable cryptocurrency, Ethereum, encountered a comparable scenario, hitting a 15-day high of $2k while trading within its key resistance levels.\n\nSource: CoinMarketcap\n\nOn May 4th, Ethereum’s active deposits hit an 8-month high, which Santiment predicts will increase volatility. On May 5th, exchange addresses interacting on the network reached a high point, indicating signs of decoupling and a potential $2,000 price point. ERC20 token transfers also hit a high point, indicating strong activity within the Ethereum ecosystem.\n\nSource: CoinMarketcap\n\nAccording to the data from CoinMarketCap, Bitcoin is currently trading at $28,771.36, with a 0.32% decrease over the past seven days and a 0.32% in the past 24 hours. While ETH is trading at $1,912.19, experiencing a 0.72% increase in the past 24 hours and 1.22% over the past seven days.\n\nRelated Reading | Bitcoin Transactions Break Records: On-Chain Activity Surges To Unprecedented Heights"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJpdGNvaW5zZW5zdXMuY29tL21lbWVjb2lucy1yZXN1cmdlbmNlLWRyaXZlcy11cC1ldGhlcmV1bS1nYXMtZmVlcy10by0xMi1tb250aC1oaWdoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Memecoins Resurgence Drives Up Ethereum Gas Fees to 12-Month High - Bitcoinsensus",
        "content": "Memecoins, created as a joke or a parody of established cryptocurrencies, have gained significant popularity in recent years due to social media and online communities. The well-known meme coin Dogecoin, which was created in 2013 and based on the Shiba Inu dog meme, saw its value soar over 6,000% in 2021 and briefly surpassed the market capitalization of some of the world’s largest companies. Other popular memecoins include Shiba Inu and SafeMoon.\n\nMemecoins are unique due to their strong community backing, low transaction fees, and ease of trading on decentralized exchanges. However, they are also highly volatile, with their value rapidly rising and falling based on social media hype. Investing in memecoins can be high-risk, high-reward, and it is crucial to research and understand the risks involved.\n\nOverall, while some investors have made significant profits from meme coins like Dogecoin, others have lost money due to market volatility.\n\nAlso, the median gas fee on the Ethereum network has hit a 12-month high, coinciding with the resurgence of meme coins such as Pepe, Farb, King and so on. Gas fees are paid by users to execute transactions on the Ethereum network, and the increased demand for transactions has caused the fees to skyrocket. The surge in memecoin popularity has also led to increased trading volume on decentralized exchanges, further contributing to the higher gas fees.\n\nThe high gas fees on Ethereum have prompted some users to seek alternative blockchain networks with lower transaction fees. This has led to increased interest in other networks such as Arbitrum and Solana, which offer lower fees and faster transaction times. However, Ethereum still remains the most widely used blockchain network for decentralized applications and smart contracts."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdHljb29uc3RvcnkuY29tL2F2YWxhbmNoZS12cy1ldGhlcmV1bS13aGljaC1vbmUtaXMtbW9yZS1wcm9taXNpbmcv0gFOaHR0cHM6Ly90eWNvb25zdG9yeS5jb20vYXZhbGFuY2hlLXZzLWV0aGVyZXVtLXdoaWNoLW9uZS1pcy1tb3JlLXByb21pc2luZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Avalanche vs. Ethereum: Which One Is More Promising? - Tycoonstory Media",
        "content": "The world of cryptocurrencies is an exciting and ever-evolving space. With new coins and tokens being introduced regularly, it can be challenging to keep up with the latest trends and innovations. Two of the most popular cryptocurrencies in the market today are Avalanche (AVAX) and Ethereum (ETH). Both of these platforms offer unique features and benefits, making it difficult to choose which one is more promising. In this article, we will take a closer look at Avalanche and Ethereum and compare them based on various factors to help you make an informed decision. If you want to invest in bitcoins then you can visit online trading platforms like https://bitqt-app.com/\n\nOverview of Avalanche and Ethereum\n\nAvalanche is a decentralized platform that aims to provide a faster, more scalable, and secure network for developers to build decentralized applications (dApps). It was launched in September 2020 and has gained significant attention from the crypto community due to its high-speed and low-cost transactions.\n\nOn the other hand, Ethereum is the most popular blockchain platform for building decentralized applications and smart contracts. It was launched in 2015 and has a vast ecosystem of developers and users who have built numerous projects on its network.\n\nTransaction Speed\n\nTransaction speed is a crucial factor in the world of cryptocurrencies, especially for developers building dApps that require fast and efficient transactions. Avalanche has a significant advantage over Ethereum in terms of transaction speed, as it can process up to 4,500 transactions per second (TPS) compared to Ethereum’s 15 TPS. This makes Avalanche a more suitable platform for building high-performance dApps that require fast and efficient transactions.\n\nScalability\n\nScalability is another crucial factor to consider when choosing a blockchain platform. Ethereum has been facing scalability issues due to its limited capacity to process transactions. This has led to high gas fees and slower transaction times, making it difficult for developers to build scalable dApps. Avalanche, on the other hand, has a unique architecture that allows it to scale its network according to demand, making it more suitable for building scalable dApps.\n\nSecurity\n\nSecurity is a critical factor when it comes to blockchain platforms. Ethereum is a well-established platform that has been battle-tested over the years, making it one of the most secure blockchain platforms in the market. However, Avalanche also offers robust security features, such as Avalanche-X, a consensus mechanism that ensures network security by allowing users to choose their validators.\n\nTokenomics\n\nTokenomics is another important factor to consider when comparing cryptocurrencies. Ethereum’s native token is Ether (ETH), which is used to pay for gas fees on the network. Ether is also used as a store of value and a means of exchange. Avalanche’s native token is AVAX, which is used to pay for gas fees on the network and also used as a governance token to vote on protocol upgrades and network changes.\n\nConclusion\n\nIn conclusion, both Avalanche and Ethereum have unique features and benefits that make them promising blockchain platforms. Avalanche’s high-speed transactions, scalability, and security make it a more suitable platform for building high-performance dApps that require fast and efficient transactions. Ethereum’s vast ecosystem, battle-tested security, and established reputation make it a more reliable platform for developers who want to build complex decentralized applications.\n\nUltimately, the choice between Avalanche and Ethereum depends on your specific needs and requirements. If you are a developer looking to build high-performance dApps that require fast and efficient transactions, then Avalanche may be the better option. However, if you value security, reliability, and an established ecosystem, then Ethereum may be the better choice."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbmNoYXB0ZXIuY29tL2V0aGVyZXVtLWxvY2tlZC1yZWFjaGVzLWFsbC10aW1lLWhpZ2gtYXMtZXRoLXN0cnVnZ2xlcy10by1yYWxseS_SAVxodHRwczovL2NvaW5jaGFwdGVyLmNvbS9ldGhlcmV1bS1sb2NrZWQtcmVhY2hlcy1hbGwtdGltZS1oaWdoLWFzLWV0aC1zdHJ1Z2dsZXMtdG8tcmFsbHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 May 2023 07:00:00 GMT",
        "title": "Ethereum Locked Reaches All-Time High As ETH Struggles To Rally - CoinChapter",
        "content": "Ethereum locked reaches all-time high, but ETH price struggles to rally\n\nKey Takeaways:\n\nStaked ETH reached a new all-time high despite Ethereum’s latest update\n\nBulls struggled to revive the token price rally.\n\nNEW DELHI (CoinChapter.com) — Ethereum’s latest Shanghai update had sparked fears of ETH tokens flooding the markets as stakers moved to book profits after withdrawing their staked tokens. However, it seems the fears were unwarranted.\n\nIn a post, blockchain analysis firm Nansen shared that the amount of locked ETH had reached a new ATH of 19.3 million tokens. The firm noted that the withdrawal frenzy following the Shapella update became insignificant in the longer timeframe.\n\nLocked ETH refers to Ether tokens staked on the Beacon chain, ETH that is “out of circulation,” rewards on the Beacon chain, and “ETH deposited to the Beacon contract but not validating yet,” as per Nansen.\n\nNansen shared that locked ETH reached a new record high.\n\nInterestingly, the current amount of ETH locked on the Beacon chain is equivalent to the amount during the Shapella update, suggesting the net impact of withdrawals has been zero. Furthermore, full withdrawals overtook partial withdrawals.\n\nPartial withdrawals involve accrued awards, while full withdrawals are withdrawals of the entire 32 ETH balance necessary to become a validator on the blockchain. To enable withdrawals, validators must set their withdrawal credential prefixes to 0x01 from 0x00.\n\nFull withdrawals have overtaken partial withdrawals post the Ethereum Shanghai update\n\nFull withdrawals now represent 59.2% of the total ETH withdrawal. An increase in full withdrawals suggests exiting validators now make up most of the withdrawal. Meanwhile, Kraken has one of the highest withdrawal volumes.\n\nThe exchange accounted for nearly 26.3% of all withdrawals, with users withdrawing 647,000 ETH. However, Kraken’s contribution might be due to the recent regulatory crackdown, which forced the exchange to shutter its staking operations.\n\nETH Price Forms Bullish Pattern\n\nETH price has been moving inside a bullish technical pattern called the ‘Ascending Triangle.’\n\nA horizontal trendline that connects swing highs and an ascending trendline connecting swing lows forms the pattern. Volume helps determine if a breakout is strong.\n\nETH price formed a bullish pattern with a 109% price target. Source: Tradingview.com\n\nIn an ideal world, buyers would enter the market as the trendlines close the gap, pushing prices above horizontal resistance with heavy volumes. Unfortunately, a low-volume breakout on the upside will likely fail, resulting in a pullback.\n\nPer the rules of technical analysis, the price target for a breakout is equal to the triangle’s height at its thickest point. Therefore, ETH price might rise to $3,862 after confirming the pattern, a jump of 109% from its current price levels.\n\nEther Price Struggled To Start A Rally\n\nLocked ETH reaching a new record high should ideally be bullish for the Ether token’s price since it means a lesser supply of ETH in the market. A decline in supply often helps a digital asset start a bullish rally.\n\nHowever, ETH price remained decidedly bearish. The Ethereum token extended its downtrend that began on May 6, falling nearly 9% from May 6’s high of $2,021 to form a daily low of $1,843 on May 9.\n\nMoreover, bulls failed to defend the 50-day EMA (purple wave) support level. If the downtrend continues, ETH price might drop to test the immediate support level near $1,810, the Ether token has tested multiple times since April 4.\n\nETHUSD daily chart with MACD. Source: Tradingview.com\n\nMoreover, breaching the immediate support level could force ETH price below its 100-day EMA (blue wave) to test support near $1,715.\n\nTrend-based momentum oscillator MACD continues to be bearish for ETH. The MACD histogram indicates that the MACD line (difference of 12-day and 26-day EMA) is moving away from its MACD signal line (9-day EMA of MACD).\n\nHence, a divergence in MACD lines might indicate market participants remained divided.\n\nConversely, an uptrend would require bulls to force ETH above its 20-day EMA (red wave) resistance near $1,910. Additionally, breaking and consolidating above its immediate resistance level could help the Ethereum token price rise to target resistance near $2,020 before retreating."
    }
]