[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8yOS9ldGhlcmV1bS1jb3VsZC1leHBsb2RlLWJ5LXVwLXRvLTE1NTYtaW4tYW4tYWktcG93ZXJlZC1lY29ub215LXNheXMtYXJ0aHVyLWhheWVzLWhlcmVzLXRoZS10aW1lbGluZS_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDcvMjkvZXRoZXJldW0tY291bGQtZXhwbG9kZS1ieS11cC10by0xNTU2LWluLWFuLWFpLXBvd2VyZWQtZWNvbm9teS1zYXlzLWFydGh1ci1oYXllcy1oZXJlcy10aGUtdGltZWxpbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Could Explode by Up to 1,556% in an AI-Powered Economy, Says Arthur Hayes – Here’s the Timeline - The Daily Hodl",
        "content": "BitMEX co-founder Arthur Hayes says the price of Ethereum (ETH) stands to benefit immensely from artificial intelligence (AI) technology.\n\nPainting a scenario where AI applications create decentralized autonomous organizations (DAOs) in order to execute smart contracts, Hayes says in a new blog post that Ethereum is the logical base of such a scenario since it is the most widely used decentralized virtual machine.\n\nAccording to Hayes, the tokens issued by the AI DAOs will trade on decentralized exchanges (DEXs), and mostly those built on top of Ethereum.\n\n“A DEX is naturally suited to support the trading of any type of equity, debt, utility, participation, etc. token issued by an AI-powered DAO…\n\nDAOs will fundraise and issue tokens on-chain. A plethora of new DAO tokens will trade on DEXs.\n\nAs DAOs capture more economic value than companies, DEXs will trade more than traditional CEXs.\n\nI believe the largest driver of on-chain activity will be an explosion of trading volume on DEXs hosted on Ethereum.”\n\nThe BitMEX founder says that if the above scenario plays out as he envisions, Ethereum could run up to 1,556%, from its current price of $1,875 to hit $31,063 if the DEX trading volumes were to reach 20% of traditional stock exchange volumes recorded in 2022.\n\nHayes says Ethereum could reach a five-figure price about half a decade from now.\n\n“Given the market is forward-looking, I want to guestimate the percentage that will be reached 5 years into the future. I am not concerned about getting this number exactly right. I want to be directionally correct and profit as the narrative shifts from “won’t happen” to “might happen”.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DreamStudio"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vdS50b2RheS9ob3ctbWFueS1ldGhlcmV1bS1ldGgtYWRkcmVzc2VzLXNob3ctcmVhbC1hY3Rpdml0eS15b3Utd291bGQtYmUtc3VycHJpc2Vk0gFdaHR0cHM6Ly91LnRvZGF5L2hvdy1tYW55LWV0aGVyZXVtLWV0aC1hZGRyZXNzZXMtc2hvdy1yZWFsLWFjdGl2aXR5LXlvdS13b3VsZC1iZS1zdXJwcmlzZWQ_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "How Many Ethereum (ETH) Addresses Show Real Activity? You Would Be Surprised - U.Today",
        "content": "Advertisement\n\nUsing a customized Dune Analytics dashboard, Jack Gorman tracked the paradigm of new Ethereum (ETH) wallets that were activated in the last 12 months. Simply put, it looks like the \"we are still very early\" motto of crypto veterans is still valid in late Q3, 2023.\n\nIn past year, 27 million new wallets were activated on Ethereum (ETH)\n\nIn the last 12 months, over 26.69 million wallets were created. As such, every 30 days, over 2 million new Ethereum (ETH) addresses started showing activity on the network. Such calculations were made by Jack Gorman, a data scientist at Variant Fund, a VC team that was among early backers of Uniswap (UNI), Polygon (MATIC), Aptos (APT), Worldcoin (WDC) and Matter Labs.\n\nEthereum Address Stats in Past Year\n\n\n\n-Monthly active addresses ranges from ~4.5M - 7M on Ethereum.\n\n\n\n-In the past year, more than 26.69 million wallets were created, averaging around 2 million new wallets per month.\n\n\n\n-The retention rate of new wallets is relatively modest, with… pic.twitter.com/c8DmYhHQUX — J.Hackworth (@jphackworth42) July 28, 2023\n\nHowever, only 4.5-7 million of Ethereum (ETH) addresses authorize at least one transaction every month. Over 70% of wallets are dropped after 30 days of activity, analyst says.\n\nThree out of five Ethereum (ETH) addresses on the network only completed one transaction. On the other hand, 400,000 wallets show notable activity as they authorized over 100 transactions in the last 12 months.\n\nThis domination of wallets with low activity (66% of active transacting addresses were only active for one day, while 95.5% were active for less than 10 distinct days within the last year) should likely be attributed to euphoria around retroactive airdrops.\n\nAs covered by U.Today previously, top \"airdrop hunters\" managed to have their accounts qualified for 12 NFT and token airdrops.\n\nOnly 1.9 million wallets show sustainable activity\n\nHowever, in order to optimize their strategies, \"airdrop hunters\" create hundreds of Ethereum (ETH) accounts with minimum activity. Sophisticated software is leveraged by the \"abusers\" of retroactive airdrops.\n\nDuring the ARB airdrop, the most overhyped campaign of the last year, thousands of accounts were controlled by manipulators; over 2,400 wallets were hacked.\n\nWhen the dust settles, activity on Ethereum (ETH) remains low. The total number of wallets that were active for over 10 days in the last year is around 1.9 million, the report says."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hbGliYWJhLXNpbHZlci1nb2xkLWJpdGNvaW4tZXRoZXJldW0tbWlrZS1ub3ZvZ3JhdHotaWRlYWwtcG9ydGZvbGlv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Alibaba, silver, gold, Bitcoin, Ethereum: Mike Novogratz's ideal portfolio - Cointelegraph",
        "content": "Galaxy Digital founder Mike Novogratz shared what an ideal investment portfolio would look like for a young and high-risk tolerance investor during an interview with Bloomberg Wealth, saying that he’d invest in the Chinese giant Alibaba, silver, gold, Bitcoin (BTC) and Ethe(ETH).\n\n“If they were young and had a high-risk tolerance, I’d be buying Alibaba stock. I’d be buying silver, gold, Bitcoin and Ethereum. That’d be my portfolio,” he said in allusion to someone investing $100,000. For those with lower risk tolerance, he recommended allocating only 30% of a portfolio in the example, with the remaining 70% in bonds and perhaps index funds.\n\nNovogratz’s bullish stance on Bitcoin received a boost from BlackRock's application for a spot Bitcoin exchange-traded fund (ETF) in June. In his opinion, the application was the biggest Bitcoin development of 2023.\n\n“The most important thing that happened this year in Bitcoin is Larry Fink.”\n\nRelated: Grayscale urges SEC to approve all Bitcoin ETFs simultaneously\n\nFink, the billionaire CEO of BlackRock, was initially a “nonbeliever,” Novogratz said.\n\n“Now he says, ‘Hey, this is going to be a global currency. People around the world all trust it.’ He got ‘orange-pilled,’ as we say. Orange pill is when you take a nonbeliever, and you make them a believer in Bitcoin.”\n\nBlackRock's push into Bitcoin is part of an adoption cycle, according to Novogratz, which could lead the price of Bitcoin to reach new highs, especially if the Federal Reserve starts cutting interest rates.\n\nAlso commenting on the recent decision in Ripple's case vs. the Securities and Exchange Commission, in which Ripple’s XRP (XRP) token has been partially classified as a security, Novogratz stated that the decision was a victory for the crypto industry as it proves that “the rules are nothing close to clear.”\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8xNTA2NDcvYmFsZC1jb2luLWJhc2VkLWV0aGVyZXVtLWJhc2UtbGF5ZXItMi1jb2luYmFzZdIBTmh0dHBzOi8vZGVjcnlwdC5jby8xNTA2NDcvYmFsZC1jb2luLWJhc2VkLWV0aGVyZXVtLWJhc2UtbGF5ZXItMi1jb2luYmFzZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Meme Coin Mania Drives Degens to Base, the Ethereum Level-2 Chain from Coinbase - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\n“If you build it, they will come,” a mysterious voice whispered to Kevin Costner in Field of Dreams—yet the phrase seems to ring equally true for degens in search of lucrative gains on Coinbase’s Ethereum layer-2 network Base.\n\nThe network, which Coinbase launched for developers on July 13, has seen an influx of recent activity related to meme coins. Traders are snapping up obscure tokens like BALD, COIN, and BASED on the network using the decentralized exchange LeetSwap.\n\nLeetSwap has recorded nearly $200 million in trading volume over the past day across 377,000 transactions, according to DEX Screener. Aside from RocketSwap, LeetSwap is the only other decentralized exchange on Base where tokens can trade without reliance on financial intermediaries.\n\nAD\n\nAD\n\nMore than half of LeetSwap’s daily trading volume was comprised of BALD transactions. The token, possibly a reference to Coinbase CEO Brian Armstrong’s shaved head, has surged close to 3,100% over the past day to $0.06718.\n\nBASED had bounced more than 1,000,000% over the same period, and it currently trades hands at $0.02916. The token, despite being around for less than a day, has already notched a market capitalization of $291 million.\n\nOther nascent tokens have notched dizzying gains. Not to be confused with Coinbase’s stock ticker name on the Nasdaq, COIN eclipsed $0.17 on around $1.1 million in daily trading volume, posting gains of 15,400% over the past 24 hours.\n\nBase’s public launch is slated for August. And at the moment, there’s no official way for traders to bridge Ethereum from its mainnet over to Base. However, a so-called Portal Proxy Contract allows developers to do just that.\n\nOn Sunday alone, $54 million of Ethereum had been bridged to Base, according to a Dune Analytics dashboard. The day before, less than $750,000 worth of Ethereum was ported over to Base.\n\nAD\n\nAD\n\nHowever, withdrawing tokens from Base before its public launch is less straightforward than sending Ethereum to a smart contract. Coinbase provides a link to a GitHub repository for developers with details on how to achieve that.\n\nCoinbase built Base in collaboration with Optimism, the Ethereum scaling solution that uses Optimistic Rollups to process transactions in batches and reduce fees.\n\nDecentralized exchanges are a common venue for meme coin mania to take hold. Anyone can create a token, and without strict parameters for which ones get listed, decentralized exchanges are perhaps about as Wild West as crypto gets.\n\nNoted crypto influencer Lady of Crypto said on Twitter that degens were effectively gambling with their hard-earned Ethereum. While she said she’d bridged over some funds to partake in the mania, she also warned followers to be vigilant against scammers and rug pulls.\n\n“I fully expect to lose it all,” she said. “If you are going to gamble on BASE, make sure it's money you can afford to lose.”\n\nYou hear some people made 40,000% or whatever buying $BALD. You google how to bridge your ETH to $BASE and you move it over. You are going to be so rich. You know it. You are going to turn $100 into $1 million, retire, buy that Lambo and finally get a gf. It's all so easy... 👇… — Lady of Crypto (@LadyofCrypto1) July 30, 2023"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvdGlja2VyLmlvL2VuL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtY3J5cHRvcy1jb25zb2xpZGF0ZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction as Cryptos Consolidates...ETH at $2,500 in sight? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The Ethereum price has moved almost exclusively sideways in the last few days and has seen little movement. The Ethereum course follows the development of the Bitcoin course. In the coming month of August, however, there could be a major breakout in the ETH price. What is the Ethereum price prediction for the coming month?\n\nEthereum Price Analysis for end of July 2023\n\nThe Ethereum price recently fell back below the $1,900 mark in response to the Bitcoin price drop to $29,000. However, the price has risen slightly again in the last few days from below $1,850.\n\nFrom $1,840, the Ethereum price rose slightly towards $1,880. Nevertheless, the trend continues to point sideways over the last 1 to 2 weeks. The Ethereum forecast for August is therefore not easy to make.\n\nWill Ethereum Price go up in August?\n\nThe Ethereum forecast for the coming weeks is not easy to make due to the price movement of the last few days and weeks. However, given the external factors, we can make informed assumptions.\n\nThe Ethereum price has mostly moved within a range between 1,850 and 1,950 dollars in the last few weeks. This sideways movement appears to be a “time bomb” that could soon burst with a massive rise or fall. We could see a sharp rise or fall in price soon.\n\nThe Blackrock Bitcoin ETF approval process has many investors holding their breath right now. If the application is approved soon or the first rumors of a successful application appear, not only could the Bitcoin price rise, but also the Ethereum price.\n\nEthereum Price Prediction: How high will Ethereum Price reach?\n\nThe Ethereum price could rise significantly in the coming weeks if the market breaks out to the upside. The resistance at $2,000 would have to be broken. If this happens, the Ethereum price could rise towards the $2,500 level in the forecast.\n\nWe anticipate that there should be a major increase in Ethereum price in August and the price will move towards this mark. We therefore assume an Ethereum forecast of $2,150 to $2,350 for the end of August.\n\n\n\n\n\nYou might also like\n\nMore from Altcoin"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3Lnplbmdlci5uZXdzLzIwMjMvMDcvMjkvYml0bWV4LWNvLWZvdW5kZXItYXJ0aHVyLWhheWVzLXByZWRpY3RzLWV0aGVyZXVtLWNvdWxkLXN1cmdlLTE1NTYtdG8tMzEwNjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "BitMEX Co-Founder Arthur Hayes Predicts Ethereum Could Surge 1,556% To $31,063 - Zenger.News",
        "content": "Arthur Hayes, co-founder and former CEO of crypto derivatives trading platform BitMEX, is forecasting a massive rally for Ethereum (CRYPTO: ETH), asserting that it could run up 1,556% from its current price of $1,875 and hit $31,063.\n\nIn a blog post on Thursday, Hayes wrote that the price of Ethereum stands to benefit immensely from artificial intelligence (AI) technology.\n\nHayes said he envisions AI applications establishing decentralized autonomous organizations (DAOs) to carry out smart contracts. He added that Ethereum is the most suitable foundation for this scenario, given its extensive adoption as a decentralized virtual machine.\n\nAccording to Hayes, tokens issued by the AI DAOs will trade on decentralized exchanges (DEXs) primarily built on top of Ethereum.\n\n“A DEX is naturally suited to support trading any type of equity, debt, utility, participation, etc. token issued by an AI-powered DAO. DAOs will fundraise and issue tokens on-chain. A plethora of new DAO tokens will trade on DEXs,” he wrote.\n\nArthur Hayes speaks on stage during Bitcoin Conference 2023 at Miami Beach Convention Center on May 19, 2023 in Miami Beach, Florida. Arthur Hayes, co-founder and former CEO of crypto derivatives trading platform BitMEX, is forecasting a massive rally for Ethereum (CRYPTO: ETH), asserting that it could run up 1,556% from its current price of $1,875 and hit $31,063. PHOTO BY JASON KOERNER/GETTY IMAGES\n\n“As DAOs capture more economic value than companies, DEXs will trade more than traditional CEXs. I believe the largest driver of on-chain activity will be an explosion of trading volume on DEXs hosted on Ethereum,” Hayes said, adding that Ethereum could reach a five-figure price about half a decade from now.\n\n“Given the market is forward-looking, I want to guestimate the percentage that will be reached 5 years into the future. I am not concerned about getting this number exactly right. I want to be directionally correct and profit as the narrative shifts from ‘won’t happen’ to ‘might happen,’” he explained.\n\nAt the time of writing, ETH was trading at $1,874.33, down by 1% in the last week.\n\nProduced in association with Benzinga"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9jbWVzLWxhdGVzdC1iaXRjb2luLWFuZC1ldGhlci1iYXNlZC1wcm9kdWN0LXNldC10by1nby1saXZlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "CME's latest crypto product set to go live as traders flock to Bitcoin, Ethereum derivatives - DLNews",
        "content": "The derivatives exchange will now offer Ether/Bitcoin ratio futures.\n\nVolumes and open interest in crypto derivatives on the CME reached all-time highs this year.\n\nThe recent bullishness of the crypto market has whet investors’ appetites to bet on it, and the CME Group is giving them another opportunity by adding Ether/Bitcoin ratio futures to its suite of crypto products.\n\nThe Chicago-based exchange is one of the world’s leading derivatives exchanges by contracts traded. It recently reported revenue of $1.4 billion and an operating income of $839 million for the second quarter.\n\nFrom Sunday, local time, the new product will allow traders exposure to both Bitcoin and Ethereum in a single and less volatile trade, according to Giovanni Vicioso, head of cryptocurrency products at the CME.\n\nThe new contract is cash-settled to the value of the Ethereum futures price at the settlement date, divided by the corresponding Bitcoin futures price at settlement.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nHistorically, the ratio has had lower volatility than trading just Bitcoin or Ethereum, Vicioso told DL News. Both assets can now be traded without the need for directional views.\n\nTraders could create a similar trade themselves, but at an added risk. The spread could be done with several legs, the individual components or transactions that make up a trading strategy, but this creates more risk.\n\nEach individual leg has its own risk, and price slippage would become an issue. Pre-packaging the product for traders makes it more effective, Vicioso said.\n\nDerivatives pop on regulatory woes\n\nTraders have increasingly turned to derivatives amid growing regulatory uncertainty and to limit the risk of exposure to unregulated counterparties, especially after the collapse of FTX in November.\n\nJoin the community to get our latest stories and updates\n\nBitcoin and Ethereum have reclaimed lost ground since the beginning of the year after a rough ride in 2022 — though both are still way off record highs. Bitcoin is up more than 70%, while Ethereum has risen 51%.\n\n“The resiliency of the leading two cryptocurrencies by market capitalisation has attracted additional institutional interest for our suite of trusted cryptocurrency products leading to record volume and open interest across our futures and options,” the CME’s second-quarter insights report noted.\n\nOpen interest refers to the total number of outstanding derivative contracts for an asset that haven’t settled.\n\nBitcoin futures volume on the CME just clocked its busiest month of the year. Volumes are approaching $55 billion for July, according to Coinglass data. The average daily volume of cryptocurrency futures and options has risen to record highs this year.\n\nBitcoin and Ethereum derivatives open interest (CME Group)\n\nVicioso told DL News the uptick in activity is a function of the “maturity” of the space.\n\nThe number of large open interest holders has also increased, Vicioso said. LOIHs averaged a record 107 in the second quarter. These are entities that hold at least 25 contracts.\n\n“Traders of all kinds are using our cryptocurrency products to manage risk/exposure around-the-clock and protect and benefit from price movements in Bitcoin and Ether,” the CME’s second quarter crypto insights report noted.\n\nFutures open interest for Bitcoin has been stable in July, David Duong, head of institutional research at Coinbase, wrote on Friday. Almost 472,000 Bitcoin ($13.8 billion) in volume has been done this month, after picking up at the end of June, with “institutional players increasing their participation on CME,” he noted.\n\nCBOE, another derivatives exchange based in the Midwest, received regulatory approval to launch leveraged crypto derivatives products in June.\n\nWith more regulated derivatives venues, institutional investors have typically favoured exposure through options and futures. This also eliminates any need for custody of crypto assets."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LnRyYWRpbmd2aWV3LmNvbS9uZXdzL2NvaW50ZWxlZ3JhcGg6NTczYmRiMmEyMDk0YjowLWV0aGVyZXVtLWlzLWFib3V0LXRvLWdldC1jcnVzaGVkLWJ5LWxpcXVpZC1zdGFraW5nLXRva2Vucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Ethereum is about to get crushed by liquid staking tokens - TradingView",
        "content": "Before we know it, liquid staking tokens (LSTs) are going to replace Ethereum’s native cryptocurrency, Ether ETHUSD. The LST market is already worth approximately $17 billion, and it has grown continuously since Ethereum’s Merge.\n\nWhile LSTs are just beginning to hit their stride, their advantages over traditional ETH will soon become clear to liquidity providers (LPs), toppling ETH from its throne and ushering in a new era of LST domination.\n\nSince the Merge, ETH can now be staked to produce a roughly 4% annual yield, depending on factors of network activity, total ETH staked, number of validators and the value captured by maximum extractable value. This development is significant because of the nature of ETH as a generally stable asset. Many cryptocurrencies are more volatile, so owners have to consider both yield and whether the price of that asset will appreciate or depreciate. Alternatively, ETH now offers yields from both staking and gradual price stability and appreciation.\n\nThe new capacity to stake ETH and earn yield means that those who hold ETH today must decide: Should they provide liquidity with their ETH and hope to earn fees, or would they be better off staking that ETH and earning a surefire yield?\n\nLSTs solve this dilemma for LPs. Unlike regular staked ETH, which is illiquid in the Ethereum staking contract, LSTs unlock the inherent value of staked tokens, giving LPs a liquid “receipt” token that can be freely traded and utilized as collateral within decentralized finance (DeFi) protocols. Because LSTs make staked assets liquid, they offer flexibility for tokenholders to engage in other activities across different networks while still earning ETH staking rewards.\n\nThis means that LPs can now earn the yield from staked ETH while simultaneously using LSTs to provide liquidity in automated market makers (AMMs). Critically, LSTs also offer a much lower cost to entry than regular ETH staking, which is appealing for reaching new audiences and smaller dollar investors.\n\nThe argument that LSTs will replace ETH in DeFi is evident: Any LP who chooses to supply ETH to an AMM instead of an LST is sacrificing roughly 4% APR. What kind of sense would that make for folks looking to maximize their yield?\n\nThere are undoubtedly some in this space who would argue that ETH is ETH — that it’s the second biggest token in the cryptocurrency landscape and that it’s not going anywhere. But crypto is quick to evolve. This community is always looking for the next technical development that makes earning yield easier and more efficient, and when it comes down to it, LSTs offer a more effective way to earn yield.\n\nThe transition to LSTs will come swiftly, but right now, it’s still very early days. Ethereum’s Shanghai upgrade, which enabled ETH to be unstaked for the first time, only happened in April. But LSTs have a much larger market potential than their current market share represents. As people become more comfortable with staking ETH now that it can be easily unstaked, I believe that we will see a rapidly growing adoption of liquid staking platforms.\n\nThe beginning of this transition can already be seen in staking trends in the post-Shanghai world. In 2023 alone, the ETH deposited with the Lido protocol has increased from 4.9 million to 8 million, representing more than 30% of all staked ETH. The Swell Network, which launched in mid-April, already has more than 43,000 ETH staked on its platform. Cointelegraph\n\nThis shift could mean LSTs will take over as the dominant asset in decentralized exchanges and eventually replace ETH entirely as the go-to token in crypto. The sweeping growth of “LSTFi” could usher in an age in which all ETH will be staked through liquid staking protocols and users will do all trading and other activities using LSTs.\n\nYes, ETH is the more familiar asset. But familiar doesn’t necessarily mean “best.” Before settling into purchasing ETH and then having to make decisions about what financial opportunity to forfeit via providing liquidity vs. staking, folks in DeFi should take a spin through the up-and-coming LST ecosystem. Right now may be the last real chance to get in on the ground floor and maximize the impact of their investments.\n\nUltimately, an LST takeover would be a positive thing for the industry. Many crypto users left during our “crypto winter,” and there’s been a noticeable slowdown in garnering interest from new users. LSTs are a more accessible option to attract new users and could be the new breath of life this industry needs.\n\nis a core builder for the Maverick Protocol. He worked previously for Apple as a senior manager of design and product management and as a director of design for Yahoo. He holds an undergraduate degree from the University of Texas at Austin and a master’s degree from Stanford University.\n\nThe opinions expressed are the author’s alone and do not necessarily reflect the views of Cointelegraph. This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NoaWJhLWludS1wcmljZS1hbG9uZy13aXRoLWJvbmUtcmFsbHktYXMtc2hpYmFyaXVtLWV0aGVyZXVtLWJyaWRnZS10ZXN0bmV0LWtpY2tzLW9mZi0yMDIzMDcyOTAxMTfSAZQBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3Mvc2hpYmEtaW51LXByaWNlLWFsb25nLXdpdGgtYm9uZS1yYWxseS1hcy1zaGliYXJpdW0tZXRoZXJldW0tYnJpZGdlLXRlc3RuZXQta2lja3Mtb2ZmLTIwMjMwNzI5MDExNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Shiba Inu price along with BONE rally as Shibarium-Ethereum bridge testnet kicks off - FXStreet",
        "content": "Share:\n\nShiba Inu price as well as Bone ShibaSwap price shot up by 5% and 8%, respectively, in the last 24 hours.\n\nThe Testnet bridge will allow the transfer of tokens between Ethereum and SHIB-based layer-2 chain Shibarium.\n\nThis bullish move may revive the receding interest from new investors, which has resulted in the network growth declining by 44%.\n\nShiba Inu price made some gains as the week came to an end on the back of its ecosystem development. The SHIB world seems to be changing become more serious with the development of Shibarium, an Ethereum based layer-2 solution. This brought gains to key tokens associated with the project, including BONE.\n\nShiba Inu price rise could attract investors again\n\nShiba Inu price noted a 4.7% increase over the past day but more than the meme coin rose another cryptocurrency within its ecosystem. Bone ShibaSwap, which is more famously known by its ticker BONE, shot up by more than 8% to trade at $1.42.\n\nBONE/USDT 1-day chart\n\nThe rally, interestingly, was limited only to these two cryptocurrencies and was not reflected in the rest of the meme coins. The reason behind this was the recent launch of the Shibarium-Ethereum bridge testnet, which led to a surge in the use of SHIB and BONE. Since the bridge is still in the testnet phase, no significant implications on price were observed.\n\nHowever, the investors’ bullishness was enough to still trigger a rise in the cryptocurrencies despite the transactions being conducted on the bridge holding no real-world value. It does suggest a potential increase in the use case of BONE and SHIB going forward when the bridge mainnet launches. The transfer of assets would consequently boost the Shiba Inu price as well.\n\nBut more than the price, the network needs a recovery of investors, which have been disappearing after the disappointing run of Shiba Inu price posted these last couple of weeks. While the Relative Strength Index (RSI) on BONE suggests that the coin is on the verge of being overbought, SHIB barely managed to close above the December 2022 lows of $0.00000791, trading at $0.00000826.\n\nSHIB/USD 1-day chart\n\nA quicker recovery is necessary to revive the arrival of new users, which has been declining rapidly this past week. The network strength, which measures the rate at which new addresses are formed, dipped by more than 44% in just five days, suggesting investors are pulling back.\n\nShiba Inu network strength\n\nThus their return would help not only boost the uptrend in Shiba Inu price but also prevent any significant drawdown."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9vcGVuc2VhLXNhbGVzLW9mLWV0aGVyZXVtLXBvbHlnb24tbmZ0cy1wbHVtbWV0LXRvLW5ldy1sb3dzL9IBhgFodHRwczovL2FtYmNyeXB0by5jb20vb3BlbnNlYS1zYWxlcy1vZi1ldGhlcmV1bS1wb2x5Z29uLW5mdHMtcGx1bW1ldC10by1uZXctbG93cy8_dXRtX3NvdXJjZT1mbGlwYm9hcmQmdXRtX2NvbnRlbnQ9dG9waWMlMkZicml0cG9wJmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "OpenSea: Sales of Ethereum, Polygon NFTs plummet to new lows - AMBCrypto News",
        "content": "The sales of Ethereum and Polygon-minted NFTs on OpenSea have fallen to their lowest level this year.\n\nBlur continues to overshadow OpenSea in terms of monthly trading volume.\n\nThe monthly sales volume of Ethereum and Polygon-based non-fungible tokens (NFTs) on the leading marketplace OpenSea has plummeted to its lowest point this year as July draws to a close, data from Dune Analytics revealed.\n\nInformation from the on-chain data provider revealed that the monthly sales of Ethereum-minted NFTs on the marketplace reached an impressive peak of $659.02 million in February before experiencing a subsequent downturn.\n\nWith one day left in July, the total sales volume at press time was $120.79 million. This represented an 82% drop in monthly sales volume on OpenSea since the February high.\n\nSimilarly, following a record-breaking NFT sales volume of $109.12 million in February, Polygon-based NFTs on OpenSea have received decreased patronage from OpenSea’s users. In fact, following the February high, the NFTs in this category proceeded to close the first quarter of the year with a whopping 98% decline in sales volume.\n\nIn the last 30 days, the sales volume of Polygon-minted NFTs on the marketplace totaled $8.35 million, a 92% decline in under six months.\n\nNaturally, the fall in NFTs sales count in July culminated in the decline in sales volume. According to data from Dune Analytics, only 258,798 Ethereum-minted NFTs have been sold on OpenSea this month. This was a 43% drop from the 450,325 total NFTs sold by the end of June.\n\nThe marketplace recorded its highest monthly count of Ethereum NFTs sold in January. Per data from Dune Analytics, OpenSea ended the 31-day trading period with an NFT sales count of 1.14 million. This has since trended downward.\n\nInterestingly, despite the shortfall in sales volume, the count of Polygon NFTs sold on OpenSea this month has surpassed the total count from June. In the past 30 days, 296,343 Polygon-minted NFTs have been traded on OpenSea. This was a 29% jump from the 228,859 total NFTs sold in June.\n\nBlur leaves OpenSea in a daze\n\nBlur continues to dominate OpenSea regarding monthly NFT trading volume, data from DappRadar revealed. According to the data provider, NFTs trading volume on Blur totaled $378.41 million. OpenSea trailed behind it with a trading volume of $126 million, registering a 25% drop during that period.\n\nHowever, during the period under review, OpenSea recorded an influx of traders than Blur did. According to DappRadar, traders that completed NFTs transactions on OpenSea in the last month totaled 305,295. Blur saw a mere 35,304 traders."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC91bmxvY2stMzAwLWRheS1wYXNzaXZlLWluY29tZS1vcHBvcnR1bml0eS13aXRoLXN0YWtpbmctcmV3YXJkcy1hbHRjb2lucy1jaGFpbmxpbmstbGluay1kaWdpdG9hZHMtdG9hZHMtZXRoZXJldW0tZXRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Unlock $300/Day Passive Income Opportunity with staking rewards altcoins: Chainlink (LINK), DigiToads (TOADS ... - Analytics Insight",
        "content": "DeFi has been overwhelmingly successful due to the removal of intermediaries. This allows for more value to be retained between the transacting parties. For example, instead of a centralized institution providing liquidity to markets, ordinary investors become market makers by creating LP (Liquidity Provider) tokens.\n\n\n\nIn financial terms, the decentralization in the crypto market has opened up multiple opportunities to investors in the form of residual income. And anybody can unlock $300 a day passive income opportunities with staking rewards from altcoins. This article dives into the top three picks to begin earning passively today: Chainlink (LINK), DigiToads (TOADS) , and Ethereum (ETH).\n\n\n\nDigiToads (TOADS) Introduces NFT Staking\n\n\n\nDigiToads is one of the best altcoins when it comes to the provision of passive income. And this is all thanks to the self-propagating ecosystem (The Swamp) that does the heavy lifting on the investor’s behalf.\n\n\n\nThe Swamp opens up a new staking opportunity with its NFT Staking program that turns all 3,500 DigiToads NFTs into revenue-creating assets. These stakers earn consistent payouts funded by the protocol’s taxation system. This link between taxes and payouts causes the funds received by stakers to increase in tandem with ecosystem activity.\n\n\n\nAnalysts have forecast the floor price of these NFTs rocketing on the secondary market when payouts materialize on August 21st. This means as well as receiving dividend payments in line with ecosystem activity, stakers will also hold an appreciating asset.\n\n\n\nThe taxation system, Toad Tax, which funds the staking payout pool, directs 2% of every transaction to these holders. Additionally, it burns 2% meaning that users receive rewards in $TOADS, a hyper deflationary token.\n\n\n\nThe protocol’s treasury fund will also periodically top up the NFT Staking payout pool, and the active treasury management strategy employed by DigiToads, known as the Platinum Toads initiative, grants the best on-chain raiders remote control of the treasury.\n\n\n\nIn practical terms, it means stakers will earn rewards from taxes and rewards from trading activity in DeFi, hence analysts’ classification of DigiToads as a pioneering project and one of the best passive income plays of 2023.\n\nChainlink (LINK) Staking & CCIP\n\nChainlink (LINK) has seen a rush of economic activity due to the release of its CCIP (Cross-Chain Interoperability Protocol), which seeks to make an internet of smart contracts. This new tech stack will allow cryptos to travel freely across chains, enable developers to create cross-chain applications, and connect private and public blockchains. The final application of CCIP could see direct on-ramps between TradFi banks and DeFi.\n\n\n\n$LINK staking has caught the eye of many investors. Users can lock up their $LINK and earn staking rewards by providing economic security guarantees for Chainlink’s (LINK) oracle services. The staking program sees 7% APR rewards for node operators and nearly 5% for ordinary stakers. Analysts’ price predictions estimate $LINK trading between $13.62 and $15.62 in 2024, meaning stakers can currently stack up undervalued Chainlink (LINK) through the staking program.\n\nEthereum (ETH) Eclipses 20% Staked\n\n\n\nEthereum (ETH) has always been one of the best altcoins to buy, and recently the total volume of $ETH staked crossed 20%. Ethereum (ETH) staking has become the de facto risk-free rate within DeFi, with investors earning nearly 4% APR on a blue chip asset.\n\n\n\nThousands of new DeFi projects have launched, integrating liquid staking derivatives, sparking what analysts have called LSDFi Summer. The enabling of Ethereum (ETH) withdrawals acted as an enormous derisking event, and institutional inflows into the $ETH staking have been steadily increasing since.\n\n\n\nPrice forecasts predict a range between $3,051.80 and $3,754.46 for Ethereum (ETH) in 2024, meaning all investors accruing stakers rewards have a great upside on their dividends.\n\nClosing Thoughts: Staking and the Power of Passive Income\n\n\n\nThe top altcoins to hold in the run-up to the bull market and throughout the bear market have always been altcoins with staking rewards. Investors steadily build their stack and enjoy all the upside when the market starts rallying.\n\n\n\nComparing $TOADS, $ETH, and $LINK, although all three provide excellent passive income opportunities, the winner has to be TOADS because of the link between economic activity and staking rewards. Join the DigiToads presale, mint an NFT, and start earning deflationary rewards today!\n\n\n\nVisit DigiToads Presale\n\nMint DigiToads NFTs Here\n\nBuy DigiToads NFTs on OpenSea\n\nJoin the community\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5uZXdzMTguY29tL2J1c2luZXNzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi1ldGhlcmV1bS1tYXRpYy1jaGVjay1wcmljZXMtb2YtbWFqb3ItY3J5cHRvY3VycmVuY2llcy1vbi1qdWx5LTI4LTg0NDU1ODkuaHRtbNIBnAFodHRwczovL3d3dy5uZXdzMTguY29tL2FtcC9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWJpdGNvaW4tZXRoZXJldW0tbWF0aWMtY2hlY2stcHJpY2VzLW9mLW1ham9yLWNyeXB0b2N1cnJlbmNpZXMtb24tanVseS0yOC04NDQ1NTg5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin, Ethereum, MATIC, Check Prices of Major Cryptocurrencies On July 28 - News18",
        "content": "Crypto Prices Today, July 28: Cryptocurrencies on Friday were trading lower on weakening in buying strength. Experts said the US Federal Reserve’s interest rate hike, followed by a higher-than-expected US GDP, raises concerns about prolonged high rates.\n\nBitcoin was trading lower by 0.98 per cent to Rs 25,48,052 as on 10 am on Friday, July 28. Polygon (MATIC), Dogecoin, Litecoin, Cardano and Binance Coin were down by up 2.43 per cent. However, Ethereum and Ripple were trading higher by 0.13 per cent and 0.29 per cent, respectively.\n\nThe crypto market has traded in a tight range in the last 24 hours. The global crypto market capitalisation continues to remain at $1.23 trillion. The fear and greed index, up by a point from yesterday, continues to remain in the neutral zone with a score of 52/100.\n\nParth Chaturvedi, investments lead at CoinSwitch Ventures, said, “BTC (-0.6%) is holding steady at around $29.2k and traded within a tight range of $29k-29.5k in the last 24 hours. The top 10 cryptos by market capitalization seem to be trading in the red, except for Solana. SOL (+0.9%) has been trading below a strong resistance level due to the weakening in its buying strength.”\n\nHe added that simultaneously, the Federal Reserve’s interest rate hike, followed by a higher-than-expected U.S. GDP, raises concerns about prolonged high rates. This may impact the market’s future price action, as investors may begin to move towards “risk-off” asset classes.\n\nMeanwhile, he also said the House Agriculture Committee has advanced the Financial Innovation Technology for the 21st Century Act, which would create a federal regulatory framework for crypto in the US. The bill would give the Commodity Futures Trading Commission (CFTC) primary regulatory authority over crypto exchanges and other trading platforms. After being approved by a voice vote, it will now go to the full House of Representatives for a vote.\n\nCrypto prices on CoinSwitch as of 10 am, July 28\n\nBitcoin (BTC): INR 25,48,052.00 (-0.98%)\n\nEthereum (ETH): INR 1,61,580.00 (+0.13%)\n\nPolygon (MATIC): INR 62.50 (-3.07%)\n\nDogecoin (DOGE): INR 6.71 (-1.91%)\n\nTether (USDT): INR 86.80 (-0.28%)\n\nRipple (XRP): INR 62.88 (+0.29%)\n\nCardano (ADA): INR 26.85 (-2.43%)\n\nSolana (SOL): INR 2,170.71 (-1.52%)\n\nLitecoin (LTC): INR 7,865.00 (-1.37%)\n\nBinance Coin (BNB): INR 20,869.55 (-1.49%)."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xNTA1MjEvdGhpcy13ZWVrLWluLWNvaW5zLXdlYWstd2Vlay1iaXRjb2luLWV0aGVyZXVtLXdvcmxkY29pbi14cnDSAVtodHRwczovL2RlY3J5cHQuY28vMTUwNTIxL3RoaXMtd2Vlay1pbi1jb2lucy13ZWFrLXdlZWstYml0Y29pbi1ldGhlcmV1bS13b3JsZGNvaW4teHJwP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "This Week in Coins: Weak Week for Bitcoin and Ethereum—and Worldcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nThe beginning of the week saw the underwhelming launch of Worldcoin Protocol, along with its native cryptocurrency, WLD.\n\nWorldcoin is co-founded by Open AI CEO Sam Altman and the premise is at once utopian and dystopian: anyone wanting some WLD has to visit an ”Orb”—these can currently be found in Berlin, Dubai, London, Mexico City, Miami, New York City, San Francisco, Seoul, and Tokyo— and get a snapshot of their eyeballs taken.\n\nAD\n\nAD\n\nThis biometric data is used alongside verification of their government-issued ID to confirm someone’s personhood before distributing a set number of coins to them.\n\nWorldcoin believes it’s building the infrastructure to bank the world’s unbanked, enabling everyone “to broadly share the coming technological prosperity ” says its website. but many are skeptical, including Ethereum creator Vitalik Buterin who listed “major issues” of privacy, accessibility, centralization and security and said it could take years for the protocol to work.\n\nBritish privacy watchdog the Information Commissioner's Office (ICO) agrees, at least on privacy and security concerns and told Decrypt that it \"[the organization notes] the launch of Worldcoin in the U.K. and will be making enquiries.\"\n\nWLD currently trades for $2.30, about 30% down from its high on launch day of $3.30, according to crypto data aggregator CoinGecko.\n\nThe market leaders\n\nIt was the fifth consecutive week of underwhelming price performance for market leaders Bitcoin and Ethereum.\n\nBitcoin (BTC) lost 1.7% and now starts the weekend at $29,291, while Ethereum (ETH) lost 0.9% and changes hands at $1,872.\n\nAD\n\nAD\n\nThe market leaders had a pretty static week overall and their prices haven’t moved much since Monday. This week’s news that the Fed was hiking interest rates yet again did not immediately move the leading coins.\n\nLast year, the U.S. central bank hiked interest rates by 75 basis points four times and finished the year with a 50 basis point hike. This year there have so far been two hikes—including Wednesday’s—of only 25 basis points each, but interest rates are now the highest they’ve been for 22 years.\n\nXRP’s recent growth spurt, which was prompted by a small but significant courtroom victory against the SEC a fortnight ago, appears to have settled. Ripple’s cryptocurrency—which is definitely not a security—is down 7.7% for the week and currently trades at $0.70786.\n\nThe only other notable price movement this week came from Toncoin (TON), which fell almost 15% this week to trade at $1.24 at the time of writing.\n\nCrypto politics in Russia, Korea and the U.S.\n\nOn Monday, Russian President Vladimir Putin signed into law a bill granting legal tender to a digital ruble, the issuance of which will be overseen by the country’s central bank—although officials say it could take years before the central bank digital currency (CBDC) is widely adopted.\n\nOn Wednesday, South Korea rolled out a new interagency investigation unit to tackle crypto crime and take a leading role in investor protection before regulations are implemented.\n\nOperating from the Seoul Southern District Prosecutors’ Office, The Joint Investigation Centre for Crypto Crimes will consist of 30 investigators drawn from several government agencies and bodies, including the prosecutor's office, the Financial Supervisory Service, the National Tax Service, and the Korea Customs Service.\n\nThat day, over in the states, Democrats and Republicans locked horns over the Financial Innovation and Technology (FIT) for the 21st Century Act. Rep. Maxine Waters (D-CA), the ranking Democrat on the House Financial Services committee, assailed the bill as a “wish list” for the crypto industry, and said it undermined the role of the SEC and existing legislation.\n\nAD\n\nAD\n\nDemocrats also accused the bill of having weak consumer protections, though this point was parried by Republicans like Committee chairman Patrick McHenry (R-NC), who argued that, while not perfect, the bill is “better at worst case” than the current regulatory regime.\n\nThe Committee members also debated a stablecoin bill called the “Clarity for Payment Stablecoins Act of 2023.” Democrats accuse Republicans of rushing to pass the bill, and Waters said the proposed legislation lacks clarity over the reserves underpinning stablecoins that are pegged to the U.S. dollar."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMizgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bHktMzAtY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYxOTMzMdIB0gFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWp1bHktMzAtY2hlY2stbWFya2V0LWNhcC1iaXRjb2luLWV0aGVyZXVtLW1lcmdlLWRvZ2Vjb2luLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWJpbmFuY2UtdG9rZW4tcW50LXByaWNlcy1nYWluZXItbG9zZXItMTYxOTMzMS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Remains Above 29,000 Mark As Shiba Inu Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — managed to rise above the $29,000 and $18,000 marks, respectively, on early Sunday morning. However, in terms of percentage-wise performance, BTC saw some losses. Other popular altcoins — including the likes of Litecoin (LTC), Dogecoin (DOGE) — landed in the positive as overall prices saw minor gains across the board. Shiba Inu (SHIB) emerged to be the biggest gainer, seeing a 24-hour jump of over 5.38 per cent. Toncoin (TON), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.19 trillion, registering a 24-hour gain of 0.09 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $29,317.48 seeing a 24-hour loss of 0.18 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 25 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,878.69, marking a 24-hour gain of 0.25 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.62 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour gain of 3.00 percent as per CoinMarketCap data, currently priced at $0.08018. As per WazirX, Dogecoin price in India stood at Rs 6.9639.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour gain of 3.80 percent. At the time of writing, it was trading at $94.67. LTC price in India stood at Rs 8,060.10.\n\nRipple (XRP) price today\n\nXRP price stood at $0.7106, seeing a 24-hour loss of 0.14 percent. As per WazirX, Ripple price stood at Rs 61.9800.\n\nSolana (SOL) price today\n\nSolana price stood at $25.05, marking a 24-hour loss of 0.35 percent. As per WazirX, SOL price in India stood at Rs 2,190.00.\n\nTop crypto gainers today (July 30)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nShiba Inu (SHIB)\n\nPrice: $0.000008659\n\n24-hour gain: 5.38 percent\n\nUniswap (UNI)\n\nPrice: $6.36\n\n24-hour gain: 5.27 percent\n\nMaker (MKR)\n\nPrice: $1,271.06\n\n24-hour gain: 4.29 percent\n\nQuant (QNT)\n\nPrice: $113.43\n\n24-hour gain: 4.13 percent\n\nImmutable (IMX)\n\nPrice: $0.7756\n\n24-hour gain: 4.11 percent\n\nTop crypto losers today (July 30)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nToncoin (TON)\n\nPrice: $1.20\n\n24-hour loss: 6.60 percent\n\nCasper (CSPR)\n\nPrice: $0.03931\n\n24-hour loss: 2.61 percent\n\nGate Token (GT)\n\nPrice: $4.14\n\n24-hour loss: 2.38 percent\n\nStellar (XLM)\n\nPrice: $0.1573\n\n24-hour loss: 2.01 percent\n\nUNUS SED LEO (LEO)\n\nPrice: $3.94\n\n24-hour loss: 1.98 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3BvcHVsYXItZXRoZXJldW0tYmFzZWQtbmZ0LWNvbGxlY3Rpb25zLWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Popular Ethereum-Based NFT Collections in 2023 - Analytics Insight",
        "content": "Here is the ultimate guide to the popular Ethereum-based NFT collections in 2023\n\nNFTs, or non-fungible tokens, are one of the hottest trends in the crypto space. NFTs are unique digital assets representing anything from art, music, and games to sports. NFTs are powered by blockchain technology, which ensures their authenticity, scarcity, and ownership.\n\nEthereum is the leading blockchain platform for NFTs, hosting thousands of NFT collections and projects. Ethereum-based NFTs benefit from the network’s security, interoperability, and innovation. However, Ethereum also faces high gas fees, scalability issues, and environmental concerns. This article will explore some of the most popular and promising Ethereum-based NFT collections to invest in in 2023. These collections are based on various criteria such as market cap, trading volume, community size, rarity, utility, and future potential.\n\nBored Ape Yacht Club (BAYC)\n\nBored Ape Yacht Club is one of the most successful and influential NFT collections ever created. Launched in April 2021 by Yuga Labs, BAYC comprises 10,000 unique pixel art apes with various traits and accessories. Each ape also grants its owner access to the exclusive Bored Ape Yacht Club community and perks.\n\nBAYC is the most valuable NFT collection on Ethereum by market cap, reaching over US$3 billion as of January 2023. The floor price for a BAYC ape is around 100 ETH (US$300k), while the highest sale was 740 ETH (US$2.2 million) for a gold fur trippy ape. BAYC also has a high monthly trading volume of over US$200 million.\n\nCryptoPunks\n\nCryptoPunks are the OGs of the NFT space. Created in 2017 by Larva Labs, CryptoPunks are 10,000-pixel art characters with different attributes and rarities. CryptoPunks were given away for free to anyone with an Ethereum wallet but have since become highly sought-after collectibles. CryptoPunks are widely regarded as the first NFT project on Ethereum and have inspired many other NFT collections and projects.\n\nCryptoPunks are the second most valuable NFT collection on Ethereum by market cap, reaching over US$1.4 billion as of January 2023. The floor price for a CryptoPunk is around 50 ETH (US$150k), while the highest sale was 4,200 ETH (US$12.6 million) for an alien punk with a headband. CryptoPunks also have a high monthly trading volume of over US$100 million.\n\nArtBlocks Curated\n\nArtBlocks Curated is a unique and innovative NFT collection showcasing generative blockchain art. Launched in 2020 by Erick Calderon (aka Snowfro), ArtBlocks Curated features artworks created by algorithmic code that are minted on demand by collectors. Each artwork is one-of-a-kind and immutable.\n\nArtBlocks Curated is the third most valuable NFT collection on Ethereum by market cap, reaching over US$1 billion as of January 2023. The floor price for an ArtBlocks Curated artwork varies depending on the project but ranges from 5 ETH (US$15k) to over 100 ETH (US$300k). The highest sale was 1,000 ETH (US$3 million) for a Fidenza #313. ArtBlocks Curated also has a monthly trading volume of over US$50 million.\n\nDoodles\n\nDoodles are a cute and colorful NFT collection that celebrates creativity and fun. Launched in September 2021 by a team of anonymous artists and developers, Doodles consists of 10,000 randomly generated cartoon characters with various traits and personalities. Each Doodle also has a backstory and a name that reflects its character.\n\nDoodles are the fourth most valuable NFT collection on Ethereum by market cap, reaching over US$500 million as of January 2023. The floor price for a Doodle is around 15 ETH (US$45k), while the highest sale was 250 ETH (US$750k) for a Doodle named Boba. Doodles also have a high monthly trading volume of over US$20 million.\n\nAxie Infinity\n\nAxie Infinity is a popular and profitable NFT game that combines blockchain, gaming, and social elements. Launched in 2018 by Sky Mavis, Axie Infinity is a game where players can collect, breed, battle, and trade cute digital creatures called Axies. Each Axie is an NFT with unique genes and abilities that affect its performance in the game.\n\nAxie Infinity is the fifth most valuable NFT collection on Ethereum by market cap, reaching over US$400 million as of January 2023. The floor price for an Axie is around 0.2 ETH (US$600), while the highest sale was 300 ETH (US$900k) for an Axie named Angel. Axie Infinity also has a high monthly trading volume of over US$10 million.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tbWV2LWJvdHMtcHJvZml0YWJsZS1kYXlzL9IBPWh0dHBzOi8vYml0Y29pbmlzdC5jb20vZXRoZXJldW0tbWV2LWJvdHMtcHJvZml0YWJsZS1kYXlzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jul 2023 07:00:00 GMT",
        "title": "Ethereum MEV Bots See One Of The Most Profitable Days Due To Exploit | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum MEV Bots have recorded one of their most profitable days due to the Curve Finance exploit. Ethereum’s core developer Eric Connor made this revelation in a couple of tweets on the X platform.\n\nToday has produced some of the largest MEV reward blocks in Ethereum’s history. Slot 6,992,273: 584 ETH\n\nSlot 6,993,342: 345 ETH\n\nSlot 6,992,050: 247 ETH\n\nSlot 6,993,346: 51 ETH — eric.eth (@econoar) July 30, 2023\n\nHow These MEV Bots Work\n\nAs revealed by Connor, one Maximable Extractable Value (MEV) bot received over $1 million in ETH from reproducing and front-running an incoming hack in the Curve stablepools. Three other MEV bots earned 345 ETH ($641,000), 247 ETH ($459,000), and 51 ETH ($94,600) respectively from the transactions.\n\nIn total, MEV bots earned $11.1 million in the 24-hour period, making it the most profitable day for MEV bot deployers since Ethereum completed the move to Proof of Stake (PoS).\n\nFor more insight as to how these works; MEV bots help traders discover large transactions and exploit the opportunity to generate extra revenue through arbitrage. In order to be successful, these traders have to front-run these incoming transactions, and to do this, they pay block producers a significant amount of ETH so their transactions can gain priority, helping them to be validated first.\n\nETH price still trailing at $1,860 | Source: ETHUSD on Tradingview.com\n\nMorality Of Validators Called Into Question\n\nIn this case, the same strategy was applied, and after these MEV bots had discovered the incoming exploit on Curve’s stablepools, ETH validators were paid to give these MEV transactions priority. This event has led many to question the morality of these validators into question with many noting that the money paid to these validators is the proceeds of hacked funds.\n\n“And this is where the morality of MEV rewards going to miners gets pretty shady. These are effectively hacked funds,” A user (@apedev) tweeted.\n\nSeeing the outrage from different users, Connor went as far as conducting a poll to get people’s thoughts on block producers receiving MEV rewards that came as a result of a hack. At the time of writing, 44.9% of respondents believe that these bot deployers should keep the rewards against those calling for these deployers to return the rewards.\n\nConnor noted this situation as “probably a legal grey area,” likely in reference to what the liability of deployers will be if they were to make money from the proceeds of a crime (hack). He also stated that deployers returning these funds is not as straightforward as it appears.\n\nOne MEV bot deployer has, however, acted in good faith and in the spirit of ethical hacking by returning revenue generated from frontrunning the hacker’s transaction.\n\nAccording to on-chain data, a wallet “c0ffeebabe.eth” returned 2,879 ETH ($5.3 million) to Curve’s contract address.\n\nFeatured image from CoinMarketCap, chart from Tradingview.com"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wNy8yOS9ldGhlcmV1bS1jbGFzc2ljLXByaWNlLXByZWRpY3Rpb24td2lsbC1ldGMtcHJpY2UtcmVhY2gtMjUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Classic Price Prediction: Will ETC Price Reach $25? - The Coin Republic",
        "content": "Ethereum Classic price prediction suggests a rise in the long run and that the bulls seem to be active at the lower levels.\n\nETC price faced rejection from the 200 day EMA which means the positional trend downward facing. However, the short term trend is bullish and buyers are buyers trying their best to defend the 50 day EMA.\n\nEthereum Classic price recovered 23% from the recent swing low and showed signs of bullish trend reversal. However, the momentum halted near the $22.00 level witnessing minor profit booking.\n\nPresently, ETC price is stuck in the narrow range between $17.00 to $22.00. If the buyers succeed in defending the lower range, a short term bounce is possible.\n\nIn mid June, ETC crypto witnessed sharp buying from the $14.00 support showing that strong buyers are active at the lower levels. Therefore, the possibility of the downside is low.\n\nEthereum Classic price is trading at $18.43 with an intraday decline of -0.22%. The 24 hour volume to market cap is 3.20%. The pair of ETC/BTC is trading at $0.000630 with an intraday decline of -0.16%.\n\nWill Ethereum Classic Price Regain the $20.00 Mark?\n\nETC/USDT daily chart by TradingView\n\nEthereum Classic price prediction favors the bulls and suggests rise in coming months. ETC prices performed well in June but due to the strong presence of sellers prices lacked the momentum near the supply zone.\n\nAs long as ETC crypto price sustains above $17.00, the possibility of the bounce back remains high. However, prices will gain momentum when buyers succeed to break out of the $20.00 hurdle.\n\nOn the other hand, if the price drops below $17.00, then bears may try to drag it down to the yearly lows. The technical analysis suggests ETC price is near a crucial support and the possibility of a bounce is high.\n\nETC Price Formed a Bullish Hammer Candle\n\nETC price formed a bullish hammer candle on the weekly time frame. It shows that the correction is over and the bulls are returning back on track. The crypto leader, BTC, is also recovering, which might positively impact ETC.\n\nThe MACD curve took support near the zero line and is reversing upward indicating mild bullishness. The RSI at 48 sloping sideways denotes neutral territory and a tight tug of war between the buyers and sellers.\n\nConclusion\n\nEthereum Classic price prediction suggests significant increase in the value is possible. ETC price is near a crucial support level. Therefore, the possibility of bouncing back is high. If buyers succeed in breaking out of the $20.00 level, then it will begin the journey to reach $25.00.\n\nTechnical levels\n\nResistance levels: $21.00 and $24.00\n\nSupport levels: $17.00 and $15.00\n\nDisclaimer\n\nThe views and opinions stated by the author, or any people named in this article, are for informational purposes only. They do not establish financial, investment, or other advice. Investing in or trading crypto assets comes with a risk of financial loss."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbmNoYXB0ZXIuY29tL21vcmUtaW52ZXN0b3JzLWJhY2tpbmctZXRoZXJldW0td2lsbC1xdWJlLWFuZC1lcmMtMjAtdG9rZW5zLXJpcC1oaWdoZXIv0gFjaHR0cHM6Ly9jb2luY2hhcHRlci5jb20vbW9yZS1pbnZlc3RvcnMtYmFja2luZy1ldGhlcmV1bS13aWxsLXF1YmUtYW5kLWVyYy0yMC10b2tlbnMtcmlwLWhpZ2hlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jul 2023 07:00:00 GMT",
        "title": "More Investors Backing Ethereum, Will QUBE and ERC-20 Tokens Rip Higher? - CoinChapter",
        "content": "The InQubeta (QUBE) presale has now generated more than $1.8 million in tokens early on and investors still stand to grow their investments by up to 300% if they join in now. Ethereum has also enjoyed a substantial increase in investor backing in 2023 with prices rising by up to 70%. Ethereum-based projects like InQubeta, Polygon (MATIC), and Chainlink (LINK) have all played a role in the increase in investor interest in Ethereum as its functionality gives it the potential to someday take Bitcoin’s spot as the cryptocurrency with the highest market capitalization.\n\nInQubeta focuses on making investment opportunities in artificial intelligence (AI) easier to access while funneling more funds to startups that need them. It skirts the barriers that prevent countless people from using traditional investing avenues, opening up prospects to anyone with a cryptocurrency wallet.\n\nInQubeta (QUBE) and other ERC-20 tokens boosting Ethereum trading volume\n\nThe InQubeta project hosts an Ethereum-based blockchain that utilizes the power of ERC-20 tokens to create an alternative way to invest in AI startups. These companies can raise funds on the InQubeta ecosystem by making non-fungible tokens (NFTs) that represent equity in their operations. These tokens are posted on the InQubeta marketplace where investors can learn more about the companies behind them or purchase NFTs with $QUBE tokens.\n\nThe NFTs are transferred to buyers once sales are finalized, giving them full ownership of the tokens, which they can hold on to long-term or sell whenever they choose. Think of these NFTs as the blockchain version of stocks. Some tokens come with additional bonuses like a piece of profits and smart contracts ensure investors get all bonuses promised to them.\n\nThe InQubeta ecosystem solves two real-world problems simultaneously: it opens up investment opportunities in artificial intelligence while directing more capital to AI firms that need cash to advance their projects.\n\nAI investments 10x as world braces for next tech revolution\n\nAI is no longer just some cool idea entertained in sci-fi media. Major milestones have been made in the past decade and the technology is now expected to transform the world in the next several years. Vehicles with self-driving features are now mass-produced, while search engines use AI to improve search results.\n\nTechnological breakthroughs always create opportunities for investors to earn exponential profits and the same will be the case for the AI revolution. Those who back AI startups that end up reshaping industries set themselves up to earn unprecedented returns on their investment. The InQubeta project makes such investment opportunities more accessible than they’ve ever been.\n\nEthereum (ETH) continues to generate investor interest\n\nEthereum has been viewed by many as Bitcoin’s inevitable replacement because of its improved functionality by allowing for the creation and deployment of decentralized applications and smart contracts.\n\nEthereum has enjoyed a little more growth than Bitcoin in 2023 and some cryptocurrency experts credit the success of some of the cryptocurrency projects launched on its blockchain like InQubeta, Chainlink, and Polygon for its price movement. All three have generated lots of investor interest recently, helping to push Ethereum prices upward as they showcase how much of an impact Ethereum will have in the cryptocurrency space in the future.\n\nIt’s quite possible that many of the top cryptocurrencies in the future will be Ethereum-based projects like the InQubeta network which is projected to enjoy up to 100x growth after its launch.\n\nSummary\n\nThe InQubeta presale is currently one of the hottest events in the cryptocurrency space with over $1.8 million in tokens sold early on in the event. The InQubeta project harnesses the functionality of the Ethereum network to create a more accessible way to invest in AI startups than traditional options. InQubeta will play a major role in helping to direct the $1.5 trillion expected to pour into artificial intelligence in the next seven years to startups that need funding.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nDisclaimer: The statements, views and opinions expressed in this press release are solely those of the content provider and do not necessarily represent those of CoinChapter. CoinChapter will not be responsible in any way for the content of the same. Do your research and invest at your own risk."
    }
]