[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWJsb2Nrc3BhY2UtcHJvZml0YWJpbGl0eS1uZWdhdGl2ZS1tZXJnZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Ethereum blockspace on track for first unprofitable month since the Merge - Blockworks",
        "content": "As on-chain activity plummets, Ethereum’s blockspace is on track to turn a financial loss for the first time since the Merge, according to Blockworks data.\n\nData from Blockworks Research’s newly-launched Analytics product shows that Ethereum blockspace has consistently turned a profit since the network’s switch to proof-of-stake consensus in September 2022.\n\nThe blockspace profitability metric is calculated by subtracting the total protocol fees paid to validators as well as ether (ETH) reward issuance from total transaction fees.\n\nSource: Blockworks Analytics\n\nFrom October 2022 to present, only in December 2022 did blockspace narrowly turn a loss, generating $3.5 million in losses — a fraction of the $414 million in gains the protocol has seen so far in 2023.\n\nHowever, as activity on Ethereum falls, September is shaping up to be the protocol’s first month posting significant losses since proof-of-stake was introduced. Throughout September, Ethereum blockspace has posted only a single profitable day, and as of Monday, has accumulated $15.9 million in losses.\n\nThe shift in blockspace profitability coincides with an expansion in ETH’s circulating supply, which is up roughly 8,900 ETH on the month, per data from ultrasound.money.\n\nThe declining profitability for blockspace is attributable to declining user activity and falling volumes across multiple on-chain subsectors. Swaps and transfers of popular stablecoins such as USDT and USDC are down as much as 90% from March 2023 highs, and NFT trading volumes in particular are continuing to dwindle.\n\nSource: Blockworks Analytics\n\nWhile activity on the base layer is shrinking with no clear catalyst to alter the trajectory, a number of Ethereum layer-2 networks are maintaining healthy activity.\n\nArbitrum and Optimism both maintain sequencer profitability, and while each has seen pullbacks in the number of active addresses on the networks, they remain close to yearly highs.\n\nSource: Blockworks Analytics\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wOS8xOS9ldmVudHVhbGx5LXdlLWFyZS1hbGwtZXRoZXJldW0v0gFaaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA5LzE5L2V2ZW50dWFsbHktd2UtYXJlLWFsbC1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Eventually, We Are All Ethereum - CoinDesk",
        "content": "One downside of Ethereum eating the entire world is that similar to the networking industry today, there will be much less variability in some of the network functions that are available. To be interoperable, tokens and smart contracts will basically have to be the same everywhere. Every chain has to be an EVM chain. And while you can have cross-chain development systems that work on a diverse ecosystem, it is not very useful because your tokens and smart contracts become stranded and useless, and the unique and special functions of particular networks never actually get used."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy93aGF0LWlzLWV0aC1nYXRlLWV0aGVyZXVtLXByZWZlcmVudGlhbC10cmVhdG1lbnQtcmVndWxhdG9ycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "What is ETH Gate and Did Ethereum get Preferential Treatment from U.S. Regulators? - CCN.com",
        "content": "Key Takeaways\n\nThe SEC contended that it should classify all cryptocurrencies except Bitcoin and Ether as Securities.\n\nHowever, some individuals have raised questions regarding how ETH became recognized as a unique case.\n\nBold claims from a former Ethereum advisor reignited allegations of preferential treatment by the SEC toward Ethereum.\n\nThe US Securities and Exchange Commission (SEC) has spent years pursuing its lawsuit against Ripple Labs for allegedly selling unregistered securities in the form of XRP.\n\nHowever, the commission has made no such attempt to crack down on Ethereum, leading to allegations it received preferential treatment.\n\nIn the latest twist in the “ETH Gate” saga, Steven Nerayoff, an early adviser to the Ethereum network, has revisited how the SEC responded to Ethereum’s Initial Coin Offering (ICO), and the lasting implications of that response.\n\nNerayoff Adds Fuel to the ETH Gate Fire\n\nSteven Nerayoff, an early Ethereum advisor, has questioned the SEC’s cryptocurrency approach, highlighting the agency’s focus on XRP and similar tokens as securities while leaving bitcoin and ether untouched.\n\nSpecifically, Neyaroff casts doubt on how the SEC came to the conclusion that Ethereum is “sufficiently decentralized” to avoid scrutiny, a classification from former SEC director William Hinman.\n\nLowell Ness has been @a16zcrypto ’s attorney from the first day. Clayton tells Hinman to reach out to Lubin who is represented by Clayton’s firm. December 13, 2017 Lubin meets Hinman. The next month Clayton tells Chris Dixon to ✍️ a memo 📝 of what they want SEC to do. Ness writes… — John E Deaton (@JohnEDeaton1) September 16, 2023\n\n“How exactly did @ethereum even satisfy this magical agency pixie dust?” he asked, speculating that Hinman and his SEC colleagues may have even intentionally misconstrued the network’s decentralized nature.\n\nIn response to Nerayoff’s remarks, John Deaton, a crypto lawyer known for advocating XRP, hinted at close interactions between senior SEC staff and Ethereum’s founders, suggesting a potentially questionable working relationship.\n\nIn a video shared to X (formerly Twitter), comments attributed to Ethereum co-founder Joseph Lubin could even imply some kind of back-room deal with the SEC.\n\n“We are big friends and fans of the SEC,” Lubin purportedly stated. He would go on to state that the SEC wouldn’t find any other tokens except Bitcoin and Ether sufficiently decentralized, even dropping Hinman’s name as his source, the video alleges.\n\nETHGATE: We were right\n\nAttorney @JohnEDeaton1 Crypto Law Website, 81 Factual Event TIMELINE 2013-2023 curated by #XRP Sleuth Research. {Decentralized Justice}🙏\n\n👉https://t.co/imdoLomjDk\n\nOG @XRPArmyNews1 brought that TIMELINE \"alive\" narrated by 18. 🙏Listen to the Complete… pic.twitter.com/iTQeH4IcVH — 🌸Crypto Eri 🪝Carpe Diem (@sentosumosaba) September 18, 2023\n\nIn another tweet on Sunday, September 17, Deaton added, “I’ve always said that one day we will get the full truth. Today is one day closer.”\n\nI’m getting a lot of messages asking what this means. Im speculating a bit, but, as a lawyer, I suspect that @StevenNerayoff ’s desire to tell what he knows after what he’s been through may have gotten ahead of the legal advice he was likely receiving. His lawyer, @mascotto89 , who… https://t.co/u9BQiG0jAh — John E Deaton (@JohnEDeaton1) September 17, 2023\n\nThe Ethereum Decentralization Debate\n\nCentral to ETH Gate allegations is the charge that, contrary to Hinman’s classification, the Ethereum ICO actually displayed far less evidence of decentralization than other ICOs.\n\nFor example, an analysis of ETH transactions at the time of its ICO concludes that a significant proportion of the earliest ETH went to a small number of investors.\n\n“Most of the Ether sold in the 2014 token pre-sale in exchange for Bitcoin may have been paid out to one person or, more likely, a handful of close associates working in concert,” the report observes.\n\nTo this day, the identity of Ethereum whales that hold a significant volume of ICO funds remains shrouded in mystery.\n\nWith ETH Gate casting doubt on the network’s decentralization, allegations of Chinese control continue to circulate.\n\nA complete guess, 66.6%. I found 12 Genesis Block Wallets today, alone where they ended up with the majority of the ETH from. Its so hard to know. They were invested in over 500 projects by EOY 2021, and in many cases got the pre-ICO tokens prior to both ETH/altcoin price waves. — TruthLabs 🫡 (@BoringSleuth) June 28, 2023\n\nSpecifically, critics have speculated that through Ethereum ICO investors such as Wanxiang Blockchain Labs, the Chinese Communist Party is Ethereum’s biggest whale, secretly controlling as much as a third of the ETH supply."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1yZWplY3Rpb24tMTY3MC_SAUdodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tcHJpY2UtcmVqZWN0aW9uLTE2NzAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Faces Another Rejection – Can Bulls Save The Day? - NewsBTC",
        "content": "Ethereum price climbed above $1,650 but failed to surpass $1,670 against the US Dollar. ETH trimmed gains and now consolidating near the $1,630 zone.\n\nEthereum struggled to clear the $1,670 resistance.\n\nThe price is trading above $1,630 and the 100-hourly Simple Moving Average.\n\nThere was a break above a key bearish trend line with resistance near $1,628 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair must stay above the $1,620 support zone to start a fresh increase in the short term.\n\nEthereum Price Revisits Support\n\nEthereum’s price started a decent increase above the $1,620 resistance. ETH even climbed above the $1,650 resistance before the bears appeared, like Bitcoin.\n\nDuring the increase, there was a break above a key bearish trend line with resistance near $1,628 on the hourly chart of ETH/USD. However, the bears defended the $1,670 resistance. A high was formed near $1,669 and the price started a downside correction.\n\nThere was a move below the $1,650 level. The price declined below the 50% Fib retracement level of the upward move from the $1,613 swing low to the $1,669 high.\n\nEther is now trading above $1,630 and the 100-hourly Simple Moving Average. It is also trading near the 61.8% Fib retracement level of the upward move from the $1,613 swing low to the $1,669 high. On the upside, the price might face resistance near the $1,650 level.\n\nSource: ETHUSD on TradingView.com\n\nThe next resistance is near the $1,670 level. A close above the $1,670 resistance might send the price toward the $1,720 resistance. The next major hurdle is near the $1,750 level. A close above the $1,750 level might send Ethereum further higher toward $1,880 in the coming days.\n\nMore Losses in ETH?\n\nIf Ethereum fails to clear the $1,650 resistance, it could start another decline. Initial support on the downside is near the $1,630 level and the 100-hourly Simple Moving Average.\n\nThe first key support is close to $1,620. The next key support is $1,600. A downside break below $1,600 might start another bearish wave. In the stated case, the price could even decline toward the $1,540 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,620\n\nMajor Resistance Level – $1,670\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ncmF5c2NhbGUtaW52ZXN0bWVudHMtYW5ub3VuY2VzLWFiYW5kb25tZW50LXJpZ2h0cy0xMjMwMDAwNDIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Grayscale Investments® Announces Abandonment of Rights to Ethereum Proof of Work Tokens - Yahoo Finance",
        "content": "Grayscale Investments\n\nSTAMFORD, Conn., Sept. 18, 2023 (GLOBE NEWSWIRE) -- Grayscale Investments® , the world’s largest digital currency asset manager and the sponsor of Grayscale Ethereum Trust ( OTCQX: ETHE ) and manager of Grayscale Digital Large Cap Fund ( OTCQX: GDLC ) (each a “Product” and collectively, the “Products”), announced today that on behalf of the record date shareholders of each Product as of the close of business on September 26, 2022 (the \"Record Date Shareholders\"), it has irrevocably abandoned all of the rights to Ethereum Proof of Work tokens (“ETHPoW”) distributed to such Record Date Shareholders.\n\nEach Product previously announced that Grayscale Investments, LLC (“Grayscale”) would be appointed as agent on behalf of each Product’s Record Date Shareholders. After thorough review, Grayscale has, in consultation with the Products’ service providers, determined that the Products’ custodian does not support the ETHPoW tokens, nor have trading venues with meaningful liquidity developed for the ETHPoW tokens. As such, it is not possible to exercise the rights to acquire and sell the ETHPoW tokens, and on behalf of the Record Date Shareholders, Grayscale is abandoning the rights to these assets.\n\nFor the avoidance of doubt, Grayscale is acting only in its capacity as agent of the Record Date Shareholders with respect to the foregoing, and not in its capacity as sponsor or manager of the Products.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of regulated, and future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest digital currency asset manager. Investors, advisors, and allocators turn to Grayscale for single asset, diversified, and thematic exposure. Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC). For more information, please follow @Grayscale or visit grayscale.com .\n\nStory continues\n\nPress Contact\n\nJennifer Rosenthal\n\npress@grayscale.com\n\n\n\n"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8venljcnlwdG8uY29tL25ldy1yZXBvcnQtc3VnZ2VzdHMtZXRoZXJldW0taXMtdHJhZGluZy13ZWxsLWJlbG93LWl0cy1tYXJrZXQtdmFsdWUtY2l0aW5nLWEtdmFsdWF0aW9uLW9mLTI3NS1iaWxsaW9uL9IBf2h0dHBzOi8venljcnlwdG8uY29tL25ldy1yZXBvcnQtc3VnZ2VzdHMtZXRoZXJldW0taXMtdHJhZGluZy13ZWxsLWJlbG93LWl0cy1tYXJrZXQtdmFsdWUtY2l0aW5nLWEtdmFsdWF0aW9uLW9mLTI3NS1iaWxsaW9uLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "New Report Suggests Ethereum Is Trading Well Below Its Market Value, Citing A Valuation Of $275 Billion - ZyCrypto",
        "content": "Advertisement\n\nAccording to new on-chain research, Ether (ETH) is trading below its worth by a staggering 27%.\n\nThe report hinges its analysis on user adoption levels of Ethereum’s layer 2 networks.\n\nLayer 2 networks have ballooned in popularity with Optimism and Arbitrum probing new functionalities.\n\nA new report has placed Ethereum’s network valuation north of $275 billion, relying on a modification of Metcalfe’s Law.\n\nRxR, a joint venture between Re7 Capital and Republic Crypto, has pegged ETH’s fair valuation at $275 billion in its latest analysis. According to the report, the network is currently trading below fair value by 27% if certain key factors are considered holistically.\n\nThe report made use of a modified Metcalfe-centric model to arrive at its conclusion, noting that existing models do not take the scaling dynamics into account. Traditional models place a premium on the number of active users on the network’s mainnet, but RxR’s models rely on data from Ethereum’s layer 2 networks.\n\nMetcalfe’s law states that the financial value of a network is directly proportional to the square of the number of connected users, but extending the model to layer 2 activities yields new results.\n\n“Ethereum’s network valuation tracks the updated ML index better when the active user base of Ethereum’s scaling networks is factored into the model than when omitted,” said Lewis Harland, an RxR analyst.\n\nAdvertisement\n\nIn the report, the research analyst noted that including the L2 activity proved more reliable for long-term forecasts. The analysts pointed out that ignoring off-chain and L2 activities may paint a grim picture that the Ethereum network may be overvalued.\n\nAt the moment, ETH trades at $1,655 with a total market capitalization of $199 billion, showing glimpses of a rally on the horizon. RxR’s blended model suggests that contrary to popular opinion, the market is yet to “price in” Ethereum’s network adoption levels.\n\n“User growth on Ethereum as an application platform is set to outpace simple value-transfer networks over time implying higher relative valuations based on Metcalfe’s law,” said Harland.\n\nEthereum’s thriving L2 ecosystem\n\nEthereum’s L2 space has been a beehive of activity, with several projects experimenting with novel ways around the network’s scaling issues. Arbitrum and Optimism are pushing the frontiers of Ethereum’s scaling with their novel offerings, with Coinbase’s BASE recording sky-high adoption levels.\n\nWith over 30 L2 networks in play, aggregate total value locked (TVL) has surged to $10 billion given the reliance on rollups and other novel scaling solutions. Experts have hailed the spike in L2 activity as preventing single points of failure and playing a key role in reducing congestion."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jYW50by1hbmQtYXN0YXItYmxvY2tjaGFpbnMtcGxhbi1taWdyYXRpb24tdG8tZXRoZXJldW0tZWNveXN0ZW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Canto, Astar blockchains plan expansion to Ethereum ecosystem as layer 2s - Cointelegraph",
        "content": "Updated to clarify that Astar Network is expanding to Ethereum, not leaving the Polkadot ecosystem\n\nCosmos-native layer-1 blockchain Canto has become the latest chain to migrate to Ethereum as a layer 2 zero-knowledge rollup after another layer-1 blockchain, Astar, announced similar plans to expand beyond the Polkadot ecosystem to Ethereum.\n\nCanto is a permissionless general-purpose blockchain, Ethereum Virtual Machine (EVM)-compatible with aims to onboard the traditional financial sector to decentralized finance applications.\n\nUpon an official agreement reached by Canto Commons — a framework where contributors coordinate ideas and solutions to the protocol — its core developers will build a ZK-rollup on Ethereum’s second layer, Polygon Labs explained on Sept. 18:\n\n“By leveraging a shared ZK bridge, Canto will eventually tap the liquidity of a unified Polygon ecosystem with easy access to Ethereum.”\n\nPolygon Labs said Canto will “inherit” Ethereum’s security, enabling more decentralization and trustless guarantees when bridging assets over:\n\n“User security comes by way of a best-in-class and in-production ZK prover, meaning community security is ensured by cryptography and inherited from Ethereum, rather than the social-economic incentives of fraud proofs.”\n\nNeofinance at scale - Canto is migrating to a ZK-powered Ethereum L2, built with @0xPolygon CDK.\n\n\n\nThe @CantoPublic community will tap Ethereum’s deep liquidity via a shared ZK bridge without sacrificing user security – a big stride toward neofinance.https://t.co/8uDhLYk1G9 — Polygon (Labs) (@0xPolygonLabs) September 18, 2023\n\nThere will be no changes to Canto’s validators or staking system, Polygon Labs added.\n\nCanto follows moves from Astar\n\nCanto joins the likes of Astar, Gnosis Pay, Palm and IDEX to have announced plans to build ZK layer 2s using Polygon’s Chain Development Kit in recent months, according to Polygon Labs co-founder Sandeep Nailwal.\n\nOn Sept. 13, the Astar team announced it will soon begin building its own Ethereum layer-2 scaling solution, named Astar ZK-Ethereum Virtual Machine (EVM), also using Polygon’s CDK.\n\n“We are building a trustless bridge to Ethereum with high EVM equivalency right out-of-the-box, so dApp developers can use existing tools to build solutions across our entire ecosystem,” the Astar team explained in a Sept. 14 statement.\n\nI’m excited to welcome @AstarNetwork, the leading @Polkadot chain to Ethereum. They are going to launch a zkEVM chain using @0xPolygon CDK, an Ethereum L2 secured by ZK!@AstarNetwork is the leading blockchain of Japan. After launch, it quickly became among the most notable… pic.twitter.com/0SgYE6ENet — Sandeep Nailwal | sandeep. polygon (@sandeepnailwal) September 13, 2023\n\nPolygon Labs hopes the ZK-powered chain will enable businesses to implement Web3 solutions with increased speed, scalability and security in Japan — where Astar is based — and around the world.\n\nRyan Sean Adams, co-host of Ethereum show Bankless, said the two most recent migrations to Ethereum could be the start of a rollup avalanche.\n\nThe largest chain from polkadot just moved to Ethereum. (Astar)\n\n\n\nThe largest public commons chain from Cosmos just became a Polygon Validium. (Canto)\n\n\n\nAnd...I hear the world's first Solana Virtual Machine (SVM) L2 is dropping tomorrow.\n\n\n\nEthereum rollups are eating the world. — RYAN SΞAN ADAMS - rsa.eth (@RyanSAdams) September 18, 2023\n\nHowever, in a Sept. 19 post on X (formerly Twitter) Astar Network said it was not leaving Polkadot, but expanding to Ethereum. The post stressed that the network's core is based on Polkadot, and reiterated its commitment to the ecosystem. Astar said:\n\n\"We are expanding, not leaving Polkadot. Our core is based on it, and we just extended our Parachain slot, proving our commitment to the ecosystem. We enhance our Tech stack to enable a multichain future.\"\n\nNot every protocol is sticking around on Ethereum\n\nMeanwhile, some protocols appear to moving the other way.\n\nDecentralized exchange dYdX announced its intention to build a “purely decentralized” order book exchange on Cosmos as part of a plan to migrate away from Ethereum in early September.\n\nAnother Ethereum-native protocol, Maker, signaled plans in September to move to cut ties with Ethereum and build a new, more “efficient” chain with Solana’s codebase.\n\nRelated: Idealistic Ethereum community-built zkEVM Scroll launching in weeks\n\nMaker’s co-founder Rune Christensen added Solana currently stands as the “most promising” ecosystem to explore, as it proved its resilience during the FTX debacle and has a high-quality pool of talent developers building on Solana.\n\nThe last phase of Endgame is the launch of a native blockchain for Maker with the codename NewChain\n\n\n\nIt will make the ecosystem more secure and efficient\n\n\n\nAfter some research, I believe the Solana codebase should be considered as the basis for NewChainhttps://t.co/KyGxBBGlVH — Rune (@RuneKek) September 1, 2023\n\nNonfungible token collection OnChainMonkey is also shifting its entire collection of 10,000 NFTs from Ethereum to Bitcoin. The team behind the protocol cited a more secure base layer and a thriving Bitcoin Ordinals ecosystem as the main reason behind the migration plan.\n\nMagazine: DeFi Dad, Hall of Flame: Ethereum is ‘woefully undervalued’ but growing more powerful"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vdS50b2RheS9jYXJkYW5vLWZvdW5kZXItZW5kcy1zcGVjdWxhdGlvbi1vbi1ldGhlcmV1bS1hbmQtc2VjLWNvbnNwaXJhY3ktYWdhaW5zdC1yaXBwbGUtYW5kLXhycNIBamh0dHBzOi8vdS50b2RheS9jYXJkYW5vLWZvdW5kZXItZW5kcy1zcGVjdWxhdGlvbi1vbi1ldGhlcmV1bS1hbmQtc2VjLWNvbnNwaXJhY3ktYWdhaW5zdC1yaXBwbGUtYW5kLXhycD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Cardano Founder Ends Speculation on Ethereum and SEC Conspiracy Against Ripple and XRP - U.Today",
        "content": "In a recent X post, Charles Hoskinson, the notable blockchain entrepreneur and creator of Cardano, weighed in on the longstanding debate surrounding Ethereum's connection to the U.S. Securities and Exchange Commission and their alleged conspiracy against Ripple and XRP. Hoskinson's comments came as a response to renewed discussions sparked by Steven Nerayoff, an early adviser to the Ethereum network.\n\nAdvertisement\n\nHoskinson recalled Ethereum's early days, highlighting its humble beginnings as an $18 million initial coin offering (ICO). He suggested that during this nascent period, the SEC conveniently turned a blind eye to Ethereum, allowing it to thrive unchecked. However, according to Hoskinson, personal relationships and behind-the-scenes dealings may have played a pivotal role in this regulatory leniency.\n\nNevertheless, the Cardano founder dismissed the notion of Ethereum bribing the SEC to target Ripple and XRP, labeling it a baseless conspiracy theory. He pointed out that Ripple was not even operating in the same smart contract space and, therefore, could not be a competitor.\n\nWhat's going on?\n\nThe controversy was initially ignited by Steven Nerayoff, who claimed that a fabricated case had been built against him due to his knowledge about Ethereum's ICO. He asserted that individuals associated with the SEC, the Department of Justice, the FBI and even Ripple were involved in this alleged plot. Notably, Nerayoff emerged victorious in his legal battle.\n\nFormer SEC Chair was Joe Grundfest who has integrity which seems out of fashion. As to the number, I now realize one can’t tell the true # of ETH ICO buyers as it was explained by some how whales could disguise their large positions during the ICO. Violation of Terms of Service… https://t.co/TjSIsszGmG — Steven Nerayoff (@StevenNerayoff) September 17, 2023\n\nNerayoff's lawyer subsequently issued a statement, indicating that Nerayoff intended to reveal what he knew but would follow proper procedures to do so, serving the interests of justice and the public."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGgtcHJpY2UtYW5hbHlzaXMtaXMtZXRoZXJldW0tcHJpY2UtaGVhZGluZy10by0yMDAwL9IBXmh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGgtcHJpY2UtYW5hbHlzaXMtaXMtZXRoZXJldW0tcHJpY2UtaGVhZGluZy10by0yMDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "ETH Price Analysis: Is Ethereum Price Heading To $2000? - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nStory Highlights Ethereum recovery rally is ready to challenge the short-term downtrend.\n\nA bullish breakout of the resistance trendline can fuel the ETH price to $2000.\n\nA reversal from the trendline can plunge ETH to $1500.\n\nAmidst the volatile market, ETH price emerges resilient, clutching firmly to its pivotal $1,500 support zone. Even with sharp market moves, Ethereum’s unwavering posture above this key benchmark is commendable.\n\nTrading View\n\nLooking back at last week, the ETH price climbed its way back up to $1600. That’s a jump of 6.30% in just a week! But, just like Bitcoin, Ethereum had a slow weekend and saw a small drop of 1.5%. The ETH price is currently trading at $1635 as the market hints at a recovery.\n\nDigging deeper into the technical panorama, the conspicuous ‘death cross’ on the daily graph casts a shadow of bearishness over Ethereum’s trajectory. But, starting the week, Ethereum’s showing some promise with a 0.49% rise.\n\nPlus, with the ETH price not dipping much over the weekend, it looks like Ethereum might be gearing up for a comeback. Moreover, the lower price rejection observed in the recent daily candles implies a potential imminent bullish resurgence.\n\nTechnical indicators:\n\nRSI indicator: The daily RSI traces a potent bullish divergence, further fanning the flames of a prospective rally breakout.\n\nMACD indicator: Both the MACD and its counterpart, the signal line, dance deftly, evading a bearish entanglement.\n\nAlso Read: Ethereum Price Prediction 2023, 2024, 2025: Will ETH Price Cross The $2,000 Again This Year?\n\nWill Ethereum Prices Float To $2000?\n\nETH price rally seems set to collide with a potent barrier located at the intersection of the 50-day EMA and the short-term resistance trendline. A triumphant breach past these adversaries could set the stage for Ethereum’s glorious return to $2000. This will realign the 50 and 200-day EMA in a bullish manner.\n\nConversely, a descent beneath the $1600 mark may threaten to pull Ethereum back into the gravitational grip of the $1500 threshold."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xOC9leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS1sYXlzLW91dC1idWxsLWNhc2UtZm9yLWV0aGVyZXVtLXJpdmFsLXNvbGFuYS1zYXlzLXNvbC1iZXN0LXN0b3J5LW91dHNpZGUtb2YtZXRoL9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xOC9leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS1sYXlzLW91dC1idWxsLWNhc2UtZm9yLWV0aGVyZXVtLXJpdmFsLXNvbGFuYS1zYXlzLXNvbC1iZXN0LXN0b3J5LW91dHNpZGUtb2YtZXRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Ex-Goldman Sachs Executive Lays Out Bull Case for Ethereum Rival Solana, Says SOL Best Story Outside of ETH - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal says that Solana (SOL) is one of his top altcoin picks and is potentially the most promising project outside of Ethereum (ETH).\n\nIn a new interview with Altcoin Daily, the Real Vision founder says Solana co-founder Anatoly Yakovenko, commonly referred to as Toly, is becoming an important thought leader in the crypto space and represents the Solana ecosystem nicely.\n\n“Too many people get too involved with what they like because they like it and they’re a part of that thing. But I just observe Solana… I see Toly as a thought leader. He’s accepting of others around him, he builds bridges and doesn’t destroy them.\n\nI see a very engaged developer community. And people are really, really passionate about building their ecosystem and building their technology, and there’s a lot of people who use it, and there’s a lot of public awareness of the chain.”\n\nRecently, payments giant Visa announced it is building new stablecoin settlement capabilities on Solana. According to Pal, the chances are slim that Visa isn’t at least somewhat on the right track.\n\nIf digital assets are destined for another market expansion in the next couple of years, which Pal believes, he says that Solana could be one of the safest bets.\n\n“So, why is Visa using Solana? Because it’s fast. It’s fast, and it does a good job.\n\nIt’s not Ethereum. It’s different from Ethereum and even the way Toly has been talking about, ‘Could SOL be a layer-2 on ETH?,’ or ‘How do these worlds integrate?’ It just shows that for Visa to make a wrong decision is not that easy because things can be bridged, things can be interoperable…\n\nI’ve just been observing that and the Solana space has not put a foot wrong for a long time now, just when everybody had maximum fear and hate over the space…\n\nFor me, it’s a great story. It’s still probably the best major story in the space outside of Ethereum because Ethereum is the big daddy. But we’re looking at the next stage down, where’s the next altcoin that has relative security, and you’re not taking a wild guess…”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Rattanamanee Patpong"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzE5L2V0aGVyLWRyb3BzLXRvLTE0LW1vbnRoLWxvdy1hZ2FpbnN0LWJpdGNvaW4tYXMtdml0YWxpay1idXRlcmluLWV0aGVyZXVtLXdoYWxlcy1zZW5kLTYwbS1ldGgtdG8tZXhjaGFuZ2VzL9IBmQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzE5L2V0aGVyLWRyb3BzLXRvLTE0LW1vbnRoLWxvdy1hZ2FpbnN0LWJpdGNvaW4tYXMtdml0YWxpay1idXRlcmluLWV0aGVyZXVtLXdoYWxlcy1zZW5kLTYwbS1ldGgtdG8tZXhjaGFuZ2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Ether Drops to 14-Month Low Against Bitcoin as Vitalik Buterin, Whales Send $60M ETH to Exchanges - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1nYWlucy1ub3Qtb3Zlci0xNjUwL9IBTGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1nYWlucy1ub3Qtb3Zlci0xNjUwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Gains are Slowing but Not Likely Over – Here’s Why - NewsBTC",
        "content": "Ethereum price faced resistance near $1,650 against the US Dollar. ETH corrected gains but the $1,620 support might spark another upward movement.\n\nEthereum is eyeing a key upside break above the $1,650 resistance.\n\nThe price is trading above $1,625 and the 100-hourly Simple Moving Average.\n\nThere was a break above a connecting bearish trend line with resistance near $1,625 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bullish momentum if there is a close above $1,650 and $1,670.\n\nEthereum Price Aims Higher\n\nEthereum’s price was able to climb further above the $1,620 resistance. However, ETH struggled to gain strength for a move above the $1,650 resistance, like Bitcoin.\n\nThere was a downside correction below the $1,630 level. The price even spiked below $1,620 but the downsides were limited. A low was formed near $1,613 and the price is now moving higher. There was a break above the $1,620 level and the 23.6% Fib retracement level of the recent decline from the $1,652 swing high to the $1,613 low.\n\nBesides, there was a break above a connecting bearish trend line with resistance near $1,625 on the hourly chart of ETH/USD. Ether is now trading above $1,625 and the 100-hourly Simple Moving Average.\n\nOn the upside, the price might face resistance near the $1,635 level or the 76.4% Fib retracement level of the recent decline from the $1,652 swing high to the $1,613 low at $1,642. The next resistance is near the $1,650 level. A close above the $1,650 resistance might send the price toward the $1,670 resistance.\n\nSource: ETHUSD on TradingView.com\n\nIf there is a close above $1,670, the price might start a strong increase. The next major hurdle is near the $1,750 level. A close above the $1,750 level might send Ethereum further higher toward $1,880.\n\nAnother Drop in ETH?\n\nIf Ethereum fails to clear the $1,650 resistance, it could start another decline. Initial support on the downside is near the $1,620 level.\n\nThe first key support is close to $1,610. The next key support is $1,585. A downside break below $1,585 might start another bearish wave. In the stated case, the price could even decline toward the $1,520 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $1,610\n\nMajor Resistance Level – $1,650\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9vbmUtbWVyZ2UtZXRoLXN1cHBseS1zaHJpbmtzLTA0NTUzMTI4My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "One Year After The Merge: ETH Supply Shrinks But Challenges Remain - Yahoo Finance",
        "content": "The Merge was tipped to be the most significant upgrade in Ethereum’s history, promising to make ETH a deflationary asset while significantly reducing the carbon footprint of the network.\n\nWhile Ether has traded sideways over the past 12 months, much has changed for the network’s fundamentals. New Ether issuance is down more than 80%, staking participation is up 87%, and nearly 1M ETH has been permanently removed from supply.\n\nOne Year After The Merge: ETH Supply Shrinks But Challenges Remain\n\nBut while Ethereum is largely making good on its deflationary promise, new challenges to the network’s decentralization have emerged.\n\nDeflationary Ethereum\n\nThe Merge took place on Sept. 15, 2022, transitioning the network from Proof of Work to Proof of Stake consensus.\n\nThe shift overhauled Ethereum’s fundamental tokenomics, with new daily Ether issuance falling more than 80% from 13,500 ETH to currently around 2,300 ETH. Coupled with the introduction of Ethereum’s burn mechanism one year prior, analysts predicted Ethereum would become deflationary, meaning that more ETH is burned from base transaction fees than enters circulation as rewards for stakers.\n\nThere are now nearly 300,000 fewer ETH in existence than at the time of The Merge. For comparison, an additional 3.8M ETH ($6.2B) would have been issued under Proof of Work.\n\nChallenges Posed By Liquid Staking\n\nThe Merge also gave rise to the 2023 boom in liquid staking tokens (LSTs) — assets representing an underlying position of staked Ether which can be easily traded on exchanges or used in DeFi applications.\n\nEthereum’s Shanghai upgrade also activated staked ETH withdrawals in April, reducing the price spread between ETH and popular liquid staking tokens and bolstering the adoption of LSTs. Today, 10.8M ETH or 42.5% of all staked Ether is held by liquid staking protocols.\n\nETH locked in Lido, the top LST protocol, increased 82% from 4.6M to 8.6M since the year began, according to Dune Analytics. Coinbase’s LST token, cbETH, also boasts 1.17M Ether locked after launching last September, followed by Rocket Pool’s rETH with 450,000.\n\nStory continues\n\nHowever, with Lido now commanding one-third of staked Ether, many onlookers decry Lido as a centralizing threat to Ethereum, warning that a further increase in Lido dominance could facilitate governance attacks against the network if the protocol desired.\n\nIn May, Ethereum chief scientist, Vitalik Buterin, advocated that staking providers controlling more than 15% of staked ETH should actively raise user fees to deter adoption until their dominance falls.\n\n“If a stake pool controls > 15%, it should be accepted and even *expected* for the pool to keep increasing its fee rate until it goes back below 15%,” Buterin tweeted.\n\n\n\nRead the original post on The Defiant"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1jb21tdW5pdHktYnVpbHQtemtldm0tc2Nyb2xsLWxhdW5jaGluZy1pbi13ZWVrc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Idealistic Ethereum community-built zkEVM Scroll launching in weeks - Cointelegraph",
        "content": "After two years of development, a group of Ethereum idealists are close to launching their zero-knowledge EVM (Ethereum Virtual Machine) — Scroll — developed with Ethereum’s values in mind.\n\nWhile there are already several zero-knowledge EVMs in existence today, Scroll co-founder Ye Zhang told Cointelegraph at Token2049 that the project was “idealistic” as the team was sticking to the philosophy and the principles that Ethereum already cultivates.\n\nZhang said that they have been working on this mostly as a “labor of love,” driven by a shared vision to scale Ethereum while staying true to its decentralization principles.\n\nHe added that the project was more human interest than simply solving computational problems. “We started in an open source way, in a community-driven way,” he said.\n\n“We can grow this community very organically, and then grow our network effect, not in a very silly way, not in a very marketing-driven aggressive way.”\n\nThe new zkEVM is set to launch within weeks, having already undergone extensive testing and carried out audits on the code. Zhang said the Scroll will launch after some final testing and major projects like Uniswap and Aave are ready to deploy on Scroll at launch.\n\nScroll co-founder Ye Zhang. Source: Cointelegraph\n\nThe mathematician believes ZK-rollups are the “holy grail” or best-in-class of layer-2 scaling solutions, very cheap and secure.\n\nHowever, Scroll is entering a crowded ecosystem that already has zkEVM solutions from Polygon, Immutable, StarkWare, zkSync Era, and ConsenSys’ Linea, which launched in August.\n\nZhang claimed that some of the other systems such as Linea have some “unproven” parts in the circuit but believes Scroll provides a “complete proof” of all Ethereum “opcodes” and components of the transaction.\n\n“So it's not only compared to compatibility, but also a full proof for proving that everything we already have,” he said.\n\nRelated: Buterin weighs in on zk-EVMs’ impact on decentralization and security\n\nScroll is a layer-2 scaling project that has been in development for two years. It uses zero-knowledge proofs to compress data off-chain, meaning only proofs are submitted on-chain — enabling higher throughput.\n\nAs always, we published another ecosystem update, highlighting some of the latest projects to join the Scroll ecosystem\n\n\n\nThis week, we cover DeFi aggregators and permissionless lending protocols. https://t.co/1G4ErzAB00 — Scroll (@Scroll_ZKP) September 16, 2023\n\nThe EVM component enables full native compatibility with any existing Ethereum software and applications.\n\nThe initial setup will still involve some centralization such as sequencers, Zhang said, but the roadmap will decentralize this further over time.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Attack of the zkEVMs! Crypto’s 10x moment"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9jYXJkYW5vcy1jaGFybGVzLWhvc2tpbnNvbi1wb3Vycy1jb2xkLXdhdGVyLW9uLWV0aC1nYXRlLWNvbnNwaXJhY3kv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Cardano's Charles Hoskinson Pours Cold Water on ETH Gate Conspiracy - CCN.com",
        "content": "Key Takeaways\n\nEthereum and Cardano co-founder Charles Hoskinson has weighed in on “ETH Gate.”\n\nHoskinson denies charges of a secret deal between the Ethereum founders and the SEC.\n\nHis remarks did little to quench the anger of hostile XRP supporters, who argue that the SEC has received preferential treatment from the SEC.\n\nOver the weekend, comments by the crypto lawyer John Deaton triggered an “ETH Gate” Twitter storm, but is there any truth to crypto’s latest conspiracy theory?\n\nIn response to wild online allegations, Charles Hoskinson, one of Ethereum’s co-founders who later played a key role in launching Cardano, has dismissed Deaton’s more extreme claims.\n\nWhat is ETH Gate?\n\nETH Gate erupted over the weekend after the prominent crypto lawyer John Deaton implied that Ethereum’s founders may have engaged in shady backroom deals with the US Securities and Exchange Commission SEC.\n\nAccording to Deaton and other ETH Gate conspiracy theorists, the Ethereum co-founder Joseph Lubin secretly met SEC officials around the time of the ETH Initial Coin Offering ICO.\n\nBased on these supposed contacts, the SEC allegedly agreed to the classification it has stuck to in the years since. Namely, Bitcoin and Ethereum are decentralized enough to exempt them from US securities law.\n\nMeanwhile, the SEC seems to have designated Ripple’s XRP and similar tokens as fair game for enforcement.\n\nEthereum got Lucky, Says Hoskinson\n\nCommenting on the ETH Gate charges, Hoskinson dismissed the idea that Ethereum’s founders engaged in any kind of conspiracy with the SEC.\n\nHowever, he didn’t attempt to justify the apparent double standard that fuels speculation the SEC granted Ethereum preferential treatment.\n\nI've always believed that when Ethereum was an 18 million dollar ICO and very few people were doing them that the SEC decided to ignore it and crypto and they got lucky to be too old to consider after the eye of sauron moved over. Absolutely personal relationships and backroom… — Charles Hoskinson (@IOHK_Charles) September 17, 2023\n\nHoskinson suggests that Ethereum simply got lucky. Its ICO slipped under the regulatory radar, and by the time the SEC started its recent crypto crackdown, it was, in his view, “too old to be considered.\n\n“Personal Relations and Backroom Stuff Likely Played a Role”\n\nAlthough Hoskinson denies that the Ethereum founders inappropriately influenced SEC policy, he said that “personal relations and backroom stuff likely played a role.”\n\nIn a bid to justify such backroom lobbying, he added that “it happens every day,” comparing Ethereum’s efforts with tactics used by businesses across different industries.\n\n“It happens every day with blackrock, chase, Goldman Sachs, big pharma, the telcos, the defense industry, and many others.” In other words #Ethereum should also be ok to get the pass from the SEC without any justification for the rest.\n\nWhat a biase way to cope — XrpNurse🩺 (@XrpNurse) September 18, 2023\n\nDespite Hoskinson’s attempt to subdue the ETH Gate conspiracy theory, comments on his post point to a prevailing sense of injustice among XRP supporters.\n\n“This was always about control. You can feel for us all you want but this was a war on ripple and #XRPL being a threat to ETH,” one user argued .\n\nAnother accused Hoskinson of ridiculing and belittling the XRP community by not acknowledging their concerns."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0taWNvLXBhcnRpY2lwYW50LWV0aC1rcmFrZW4v0gFOaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS9ldGhlcmV1bS1pY28tcGFydGljaXBhbnQtZXRoLWtyYWtlbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Ethereum ICO Participant Moves $9.96 Million Of ETH To Kraken. Will He Sell? - NewsBTC",
        "content": "An Ethereum initial coin offering (ICO) participant and one of the earliest supporters of the smart contract platform has moved 6,000 ETH worth $9.96 million to Kraken, a cryptocurrency exchange, recent data from Lookonchain on September 18 reveals.\n\nThe unidentified whale received 254,908 ETH when each traded for 40.31 during the crowdfunding in 2014. This amount is currently worth over $466 million at spot rates.\n\nEthereum Whale Transfers Over $9.96 Million To Kraken\n\nThe anonymous nature of public blockchains, including Ethereum, makes it harder to decipher the owner’s identity. Determining whether an entity or an individual controls the address is also more complex.\n\nWhale transfers to a crypto exchange are usually considered bearish since the ramp provides an easier swapping option for token holders to cash out. Typically, crypto whales have the potential to impact the market due to the sheer size of their holdings.\n\nAccordingly, their trading decisions can influence prices, increasing volatility. Therefore, the recent deposit to Kraken may suggest that the whale plans to sell, taking a profit.\n\nOn the brighter side, the whale could be moving their coins via an intermediary, in this case, Kraken, before transferring them to other platforms like Rocket Pool or Lido Finance for staking.\n\nIn the current proof-of-stake consensus algorithm used by Ethereum, whales can earn annual staking rewards if they lock at least 32 ETH. While the whale can set up a node and stake, liquidity staking providers like Rocket Pool allow users to stake coins and earn staking rewards using their infrastructure.\n\nAs of September 18, there are over 804,000 validators, that is, users who have locked at least 32 ETH operating an Ethereum full node. Cumulatively, over 25.7 million ETH have been locked.\n\nETH Prices Recovering\n\nAs of this writing, the transfer on September 18 is amid the broader recovery in the crypto market. Of note, Ethereum (ETH) prices are up roughly 6% from September lows. Overall, supporters are bullish, expecting more growth in the days ahead.\n\nThe pump also means bulls have reversed some of the losses of September 11, and the current formation may anchor the next leg up that could propel the coin above $1,750, or August 29 highs, and later peel back sharp losses recorded on August 17.\n\nFrom the candlestick arrangement in the daily chart, ETH remains under pressure, dropping 23% from 2023 highs of around $2,140.\n\nHowever, since bears didn’t reverse losses of the June to July leg up, buyers have a chance following the rejection of lower lows from around the 78.6% Fibonacci retracement level of the Q3 2023 trade range. Presently, the September and August 2023 lows remain critical support levels for ETH, with the retest of August 17 lows on September 11 causing concern for optimistic traders.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc2VjLWluLWJlZC13aXRoLWV0aGVyZXVtLWV0aC1nYXRlLWV4cGxhaW5lZC_SAU1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL3NlYy1pbi1iZWQtd2l0aC1ldGhlcmV1bS1ldGgtZ2F0ZS1leHBsYWluZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Was The SEC In Bed With Ethereum? ETH Gate Explained - NewsBTC",
        "content": "Conspiracy theory or one of the biggest scandals in crypto? The term “ETH Gate” has been on the lips of every XRP supporter in recent months and, increasingly, the broader cryptocurrency community. At the heart of this issue is the US Securities and Exchange Commission’s (SEC) decision to classify Ethereum (ETH) as a non-security, contrasting sharply with its ongoing legal action against Ripple and the XRP token.\n\nWhat is ETH Gate\n\n“ETH Gate” refers to a theory alleging that the Ethereum Foundation and ConsenSys have fostered close relationships with key individuals within the US Securities and Exchange Commission (SEC) and other entities like JP Morgan, thereby ensuring a favorable regulatory environment for Ethereum.\n\nOne cornerstone of this theory are the Hinman emails which were released earlier this year. In these emails, Hinman, who made the landmark speech in 2018 declaring that Ethereum was not a security, interacted with Ethereum’s co-founder, Vitalik Buterin right before the speech. Hinman reportedly consulted Buterin to “understand the operational dynamics of Ethereum.”\n\nRemarkably, Bill Hinman rejoined the law firm Simpson Thacher in 2020 after leaving the SEC. The significance? Simpson Thacher is associated with the Ethereum Enterprise Alliance. Therefore, the XRP army believes that Hinman’s decision to deliver a speech giving Ethereum a regulatory “free pass” may not have been impartial.\n\nSpeculations By XRP Army\n\nJohn E Deaton, an outspoken figure in the XRP community and a keen observer of the SEC’s dealings, has painstakingly put forth allegations suggesting a deeper web of interlinked relationships that hint at possible conflicts of interest. (There are so many that it is not even possible to highlight them all in one article.) His assertions have become pivotal in the “ETH Gate” theory, and here we’ll delve deeper into these connections.\n\n1. Joseph Lubin’s Strategic Moves: Joseph Lubin, co-founder of Ethereum and founder of ConsenSys, is at the core of Deaton’s claims. According to Deaton, within just two months of Jay Clayton’s appointment as the SEC Chairman, Lubin made a potentially strategic hire, bringing on board Patrick Berarducci from the law firm Sullivan & Cromwell. This move is seen by Deaton and many in the XRP community as more than coincidental.\n\nDeaton has drawn attention to this connection in the past, positing that it might have provided Ethereum an inside track or at least a more favorable disposition from the SEC. Sullivan & Cromwell is also notable because Jay Clayton himself was a partner there before his stint as the SEC Chairman.\n\n2. The Hinman-Lubin Email Exchange: Deaton frequently refers to the now-infamous email exchange between Bill Hinman and Joseph Lubin. For Deaton, this correspondence underscores a problematic level of proximity between a regulatory figure and a significant player in the crypto sphere.\n\nThe fact that Hinman reportedly emailed Lubin directly is seen by Deaton as a potential sign of collaboration or at least a peculiar level of familiarity. More so, given Hinman’s subsequent public remarks about Ethereum being a non-security, despite warnings against such pronouncements from the SEC’s Office of General Counsel.\n\n3. Jay Clayton and One River Digital Asset Management: After his tenure at the SEC, Jay Clayton joined One River Digital Asset Management. Deaton emphasizes this move as a point of contention. One River is known for its large holdings of Bitcoin and Ethereum. Deaton hints at a potential conflict of interest, questioning if Clayton’s decisions during his time at the SEC may have been influenced by future career prospects or associations that favored Ethereum.\n\n4. Simpson Thacher, Ethereum Enterprise Alliance, and Hinman: One of the most significant points of contention brought forth by Deaton involves Bill Hinman’s associations with the law firm Simpson Thacher. This firm played a role in the Ethereum Enterprise Alliance.\n\nDeaton suggests that Hinman’s connection to Simpson Thacher and, by extension, the Ethereum Enterprise Alliance, could have influenced his decision to publicly declare Ethereum a non-security.\n\nSimilarly, an XRP community member known as Mr. Huber has been extremely vocal and is raising compelling questions: “ETH Gate is a conspiracy theory that the SEC tried to create a monopoly for Ethereum?” He goes on to argue that this is a concerted attempt by powerful Wall Street banks like JPMorgan to “control the global crypto market by bribing the SEC to gain a monopoly for Ethereum.”\n\nLatest News On ETH Gate\n\nYesterday, John E Deaton indicated that new, potentially damning, information about ETH Gate might soon be disclosed. “I’ve always said that one day we will get the full truth. Today is one day closer,” Deaton tweeted in response to Steven Nerayoff’s lawyer, Michael Scotto, who indicated that Nerayoff is prepared to make his facts known “at a time and manner that serves the interests of justice and the people.”\n\nSteven Nerayoff, an early adviser to Ethereum, had extortion charges against him dismissed in May this year. Deaton speculates that Nerayoff could be a significant source of insider information, possibly related to Ethereum’s regulatory free pass. “I have the map,” was Nerayoff unequivocal response to Deaton’s speculative tweets about the matter, as Bitcoinist reported today.\n\nThe “ETH Gate” controversy calls into question the impartiality of the SEC in its treatment of different cryptocurrencies. Although allegations remain unproven, the gathered evidence paints a picture of inconsistent regulatory approaches and potential conflicts of interest.\n\nWhether these allegations hold any water remains to be seen, but they have certainly fueled a sense of urgency and scrutiny around the SEC’s policies. If the hints dropped by Steven Nerayoff and John E Deaton materialize into something substantive, ETH Gate could become a pivotal chapter in the annals of cryptocurrency regulation.\n\nAt press time, ETH traded at $1,635.\n\nFeatured image from Blockchain Association & Commerce Society, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc29sYW5hLWVjbGlwc2luZy1ldGhlcmV1bS13YWxsLXN0cmVldC12ZXRlcmFucy10b3AtYWx0Y29pbi1waWNrLWVtZXJnZXMv0gFpaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9zb2xhbmEtZWNsaXBzaW5nLWV0aGVyZXVtLXdhbGwtc3RyZWV0LXZldGVyYW5zLXRvcC1hbHRjb2luLXBpY2stZW1lcmdlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Solana Eclipsing Ethereum? Wall Street Veteran’s Top Altcoin Pick Emerges - NewsBTC",
        "content": "Solana (SOL) has captured the attention of former Goldman Sachs executive Raoul Pal, who recently declared it one of his standout altcoin choices and a potential contender to Ethereum’s dominance.\n\nIn a new interview, Pal highlighted Solana’s unique strengths, emphasizing its unrivaled speed and performance, qualities that have even prompted payments giant Visa to choose it as their platform of choice.\n\nPal unveiled his enthusiasm for SOL, dubbing it one of his foremost altcoin choices and a contender for the most promising project outside of Ethereum. The crypto luminary also shed light on the growing influence of Solana’s co-founder, Anatoly Yakovenko, popularly known as Toly, in the cryptocurrency landscape.\n\nPal’s bullish stance on Solana stems from its speed and exceptional performance, characteristics that have garnered attention even from giants like Visa.\n\nPal said:\n\n“So, why is Visa using Solana? Because it’s fast. It’s fast, and it does a good job.”\n\nThis sentiment represents the distinctiveness of Solana in comparison to Ethereum and hints at the potential for interconnectivity between these blockchain ecosystems. Visa’s recent announcement of its foray into stablecoin settlement capabilities on Solana further bolsters its credibility in the industry.\n\nSolana: Recent Market Performance And Outlook\n\nDespite Pal’s optimistic outlook, the charts tell a different story for Solana. On August 5th, SOL experienced a bearish market structure as its price plummeted below the crucial $22.73 support level. Subsequently, in mid-August, the cryptocurrency endured a sharp decline, witnessing a staggering 23.8% drop from its recent peak.\n\nSOL market cap currently at $8 billion on the daily chart: TradingView.com\n\nPrevailing Bearish Momentum\n\nAs of now, Solana remains in the grip of this downtrend, with its market structure yet to show signs of a reversal. The Relative Strength Index (RSI) lingers below the critical 50-point mark, underscoring the prevailing bearish momentum. A pivotal line of defense for the bulls is the 78.6% retracement level at $16.94.\n\nAccording to analysts, a test of this support level could offer a viable buying opportunity, potentially targeting local highs at $25.5, $29, and an ambitious $32. However, a dip below the $15.5-mark would invalidate any hopes of a bullish reversal at the 78.6% retracement level.\n\nSOL price action in the last week. Source: Coingecko\n\nMarket Statistics\n\nAt the time of reporting, SOL was trading at $19.84 at CoinGecko, reflecting a 3.7% gain in the past 24 hours. Over the course of the previous seven days, SOL had exhibited a commendable rally of 12.5%.\n\nIn contrast, Ether (ETH) was priced at $1,637.25, marking a modest 0.3% increase within the past 24 hours. Over the same seven-day period, ETH had recorded gains of 5.5%.\n\n(This site’s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk).\n\nFeatured image from Britannica\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvYXN0YXItYW5ub3VuY2VzLWV0aGVyZXVtLWwyLWJ1dC1pcy1ub3QtZGl0Y2hpbmctcG9sa2Fkb3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Astar Announces Ethereum L2 but is “Not Ditching Polkadot” - BSC NEWS",
        "content": "Disclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: The content in the above article is a press release, provided by a third party. Readers should do their own research before interacting or engaging with the mentioned companies and/or any related services. BSC News is neither directly nor indirectly responsible for any damage or loss caused or alleged to be caused by or in connection with the use of any content, goods or services mentioned in the above article.\n\nDisclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: This is a paid Ask Me Anything (AMA), BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement AMA for $2000 Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the AMA.\n\nDisclaimer: This article is exclusive BSC News Premium Content. Premium content is viewable without a membership for a limited time. After the limited time period expires, readers will need to either subscribe or hold a BSC News NFT to view Premium Content. Visit the BSC News NFT website, Discord, and Twitter to learn more about becoming a Premium member.\n\nDisclaimer: The content of this piece is the opinion of the writer. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research.\n\nDisclaimer: Disclaimer: This article is written by a visiting author. Opinions herein are those of the visiting author. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY3J5cHRvLm5ld3MvZ29vZ2xlLWJhcmQtcHJldmlld3MtZXRoZXJldW0tYXJiaXRydW0ta2FuZ2Ftb29ucy1wb3RlbnRpYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Google Bard previews Ethereum, Arbitrum, Kangamoon's potential - crypto.news",
        "content": "Ethereum (ETH), Arbitrum (ARB), and Kangamoon (KANG) are three coins that Google Bard, the AI chatbot, has singled out. Often, traders track innovative projects with real-world utility and which have the potential to grow.\n\nEthereum: the king of smart contracts\n\nEthereum, often called the king of smart contracts, has been at the forefront of blockchain innovation for years. While it has faced scalability issues, the platform is making significant strides in overcoming them.\n\nYou might also like: BitBoy dismissed from FTX case as three celebrities settle\n\nGoogle Bard is now endorsing Ethereum. In early 2023, non-fungible token (NFT) trading volumes surged. The Blur token airdrop and rising ETH prices also fanned demand. Meanwhile, the meme coin frenzy increased Ethereum’s burn rate.\n\nExperts predict prices to surge to $2,335.71 by the end of the year.\n\nArbitrum scales Ethereum\n\nArbitrum is a layer-2 scaling solution for Ethereum, aiming to increase processing speeds and reduce transaction fees.\n\nYou might also like: Optimism overtakes Arbitrum in daily transactions after Worldcoin launch\n\nArbitrum’s fraud proofs have not been used since its mainnet launch in August 2021, indicating that the platform is secure. This makes Arbitrum popular in the layer-2 scene.\n\nAnalysts predict ARB prices to reach $1.46 by December 2023.\n\nKangamoon aims to disrupt blockchain gaming\n\nAs per a Business Research Insights report, the market for play-to-earn NFT games will grow 21.3% between 2022 and 2028 – and Kangamoon aims to dominate it.\n\nYou might also like: Blockchain Capital secures $580m funding for defi and crypto gaming ventures\n\nKangamoon represents the convergence of gaming and blockchain, offering a play-to-earn (P2E) experience where players can monetize their gaming skills. It is a blockchain game where you can be a boxing kangaroo, develop unique abilities, fight players worldwide, and earn rewards and digital assets.\n\nAt the heart of Kangamoon’s ecosystem is its native token, KANG. In stage 1 of the ongoing presale, it is available for $0.005.\n\nHowever, analysts expect KANG to grow faster than Arbitrum and Ethereum, considering its low market cap status.\n\nMore growth is expected once it launches on crypto exchanges.\n\nMore details about Kangamoon here:\n\nWebsite: https://Kangamoon.com/\n\nJoin via Telegram: https://t.me/Kangamoonofficial\n\nDisclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company.\n\nFollow Us on Google News"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb3Ntb3MtYmFzZWQtY2FudG8tbGVhZGluZy1wb2xrYWRvdC0wNDM0Mjc5NTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Cosmos-based Canto and Leading Polkadot Chain Astar Moves to Ethereum as Layer-2s - Yahoo Finance",
        "content": "Cosmos-based Canto and Leading Polkadot Chain Astar Moves to Ethereum as Layer-2s\n\nCanto And Astar Are Moving To Ethereum as Layer-2s\n\nCanto, a Cosmos-based blockchain, and Astar, a leading Polkadot chain, have both announced that they will be moving to Ethereum as Layer-2 solutions. The move is aimed at improving scalability and interoperability between different blockchain networks.\n\nCanto is a layer-1 permissionless general-purpose blockchain on Cosmos with the goal of bringing the traditional financial sector on board with decentralized finance applications via open public infrastructure. Canto Commons has agreed to construct an Ethereum ZK rollup utilizing the Polygon Chain Development Kit (CDK).\n\nCanto will gain access to the liquidity of Polygon's ecosystem through the use of a shared ZK bridge. Canto's validators and staking system will be unaffected by the migration.\n\nSeveral protocols have recently revealed plans of building ZK layer 2 solutions using Polygon's CDK. Notably, leading Polkadot chain Astar revealed that it will begin developing its own Ethereum layer-2 scaling solution, Astar ZK-Ethereum Virtual Machine (EVM), which will also use Polygon's CDK.\n\nCanto and Astar are both intended to facilitate cross-chain communication and interoperability among different blockchain networks. They will be able to harness the security and scalability of the Ethereum network while retaining their own unique features and functions by switching to Ethereum as Layer-2 solutions.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMDkvMTgvbDJzLW9uLXRoZS1yaXNlLWFzLWJhc2UtYW5kLXprc3luYy1lcmEtb3ZlcnRha2VzLWV0aGVyZXVtLWJ5LXRwcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "L2s on the Rise as Base and zkSync Era Overtakes Ethereum by TPS - The Crypto Basic",
        "content": "Ethereum-based layer-2 network Base and zkSync have seen their transaction capabilities overtake legacy Ethereum for the first time.\n\nEthereum’s long-term roadmap includes a future where layer-two solutions handle a significant portion of transactions that eventually settle on the Ethereum mainnet. In a related positive development, Ethereum-based networks Base and zkSync Era surpassed mainnet Ethereum in transactions per second (TPS) metric.\n\nLayer-2 analytics platform L2Beat shows that in the past 24 hours, Base and zkSync Era recorded a TPS metric of 12.93 and 12.62, respectively. On the other hand, the Ethereum network handled 10.18 transactions per second over the same period. Starknet and Arbitrum One complete the top 5 with 9.79 and 4.90 TPS, respectively.\n\n- Advertisement -\n\nIncubated by publicly traded crypto company Coinbase, Base is a layer-2 network built using a technology stack developed by blockchain scalability-focused startup Optimism. It is noteworthy that although Optimism offers its layer-2 network and token OP, the startup also empowers blockchain projects with a tech stack to deploy their networks.\n\nHowever, zkSync Era is a layer-2 network that primarily integrates zero-knowledge proof (ZKP) technology. Beyond scaling throughput, zkSync Era aims to offer advanced privacy and security features to users transacting on the network.\n\nBase, zkSync, and Shibarium are on the rise\n\nBase and zkSync Era reaching a higher transaction throughput than the native Ethereum mainnet underlines the potential layer-2s have to ease the workload on legacy networks like Ethereum. It also represents a remarkable feat, given both networks only launched earlier this year. While the zkSync Era mainnet launched in March, Coinbase’s Base network went live in August.\n\nSpeaking about L2s, Shibarium is another scalability solution that has recently gained traction. The Shiba-Inu-backed network has gained over two million wallets and aims to hit the three million transaction milestone within one month after launch.\n\n- Advertisement -\n\nAlthough these Ethereum-based layer-2s do not offer the same level of decentralization as the Ethereum mainnet, they deliver on two main components. They provide faster transactions and cheaper fees, even when fees on the mainnet are near yearly highs."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vYmxvY2tvbm9taS5jb20vZXRoZXJldW0tZ2FzLWNvbnN1bXB0aW9uLWlzLWRvd24tOTktOTktc2luY2UtdGhlLW1lcmdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Gas Consumption Is Down 99.99% Since The Merge - Blockonomi",
        "content": "Ethereum gas consumption has plummeted 99.99% since The Merge, transforming the network into a more environmentally friendly platform.\n\nOne year after the major upgrade, The Merge, which marked the transition from Proof-of-Work (PoW) to Proof-of-Stake (PoS) consensus, Ethereum has achieved certain improvements, including a record drop in gas consumption.\n\nAccording to data from Glassnode Alerts, Ethereum’s daily energy consumption has been down 99.9% post-Merge.\n\nAdditionally, gas fee pressure on the Ethereum network has eased despite the recent SocialFi hype. In the past, gas fees on the Ethereum network were inclined to explode due to increased network activities. This gas fee optimization could result from Layer-2 scaling solutions’ development, one of the remarkable progresses this year.\n\nHowever, most arguments point to the fact that the poor performance of NFT, and meme trend’s losing steam have decreased the demand for gas usage over the past few weeks. Ethereum consequently turned to deflationary due to the price plunge. With over 300,000 ETH burned, Ethereum has deflated annually at 0.25%.\n\nWhat to Expect on Dencun Upgrade?\n\nFollowing The Merge, the Ethereum community turned its eyes to Dencun, the next major upgrade anticipated by the end of 2023. During the All Core Devs on September 15, a monthly meeting of the Ethereum developers, the team reportedly discussed a number of core areas, including the Ethereum Improvement Proposals (EIPs) ahead of the Dencun upgrade.\n\nAccording to the meeting minutes, EIP-4844 is among the key points of the next upgrade. EIP-4844 is expected to improve the network’s security and scalability.\n\nCurrently, clients such as Prysm, Besu, and Geth are undergoing Devnet-8. EIP-4844 introduces “blob-transaction,” a new transaction format that facilitates gas fee optimization through the process of blob-carrying transactions between Layer-1 and Layer-2.\n\nWhile The Merge was expected to enable the withdrawal of staked ETH, post-event, in fact, has brought more participants to Ethereum staking. As of August 31, more than $20 billion worth of ETH has been staked, with Lido Finance accounting for 32.4% of all staked Ethereum.\n\nHowever, the dominance of Lido raises the centralization concern. That’s why the Ethereum team discussed the implementation of the EIP-7514. Tim Beiko, Ethereum Protocol Developer, said that the latest conversation was “about whether to add a constant cap to the validator activation queue. The proposal had since then been formalized as EIP-7514.”\n\nThe EIP-7514 is particularly important to prevent risks when Dencun is launched. This proposal is expected to address the centralization risk revolving around liquid staking by limiting the number of validators added to the network per epoch to 8 validators.\n\nThe Dencun upgrade will overall make Ethereum work more efficiently behind the scenes, getting ready for more improvements in the future, like a new way to organize data called SSZ, which will make Ethereum safer, more efficient, and run even better.\n\nThe FTX Hangover Continues\n\nBefore Dencun can be implemented, there is concern about the upcoming FTX token sale. Last week, Judge John Dorsey approved the bankrupt entity’s proposal to liquidate its crypto assets. FTX plans to sell billions worth of crypto assets without prior notice to the public.\n\nFTX still has loads of assets, and it looks like they are coming to the market.\n\nAs reported, FTX intends to sell billions of dollars in crypto that it owns in order to collect funds to repay creditors. The deadline for that plan to be approved was September 13, 2023. The company has $192 million worth of Ethereum in its holdings, in addition to other Category A cryptocurrencies such as Solana ($1,162 billion) and Bitcoin ($560 million).\n\nFTX also holds about $900 million in Category B tokens, defined as having low liquidity. These include prominent names such as Serum (SRM), Blur (BLUR), Polkastarter (POLS), Maps.me (MAPS), Oxygen (OXY), and Bonfida (FIDA)."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xOTc2ODcvaG93LXNwaWRlcmNoYWluLXBsYW5zLXRvLWJ1aWxkLWV0aGVyZXVtLW9uLWJpdGNvaW7SAVJodHRwczovL2RlY3J5cHQuY28vMTk3Njg3L2hvdy1zcGlkZXJjaGFpbi1wbGFucy10by1idWlsZC1ldGhlcmV1bS1vbi1iaXRjb2luP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "How ‘Spiderchain’ Plans to Build Ethereum on Bitcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFollowing weeks of debate about Bitcoin drivechains, a similar project to unlock the network’s programming potential is picking up steam.\n\nOn Monday, Jameson Lopp—co-founder and CTO of mobile self-custody firm Casa—published a blog post about “Spiderchain,” which he called “yet another proposal for building 2-way pegged sidechains.”\n\nA sidechain is a separate blockchain that is tied into the main Bitcoin network in some way. They typically use the same native currency—BTC—and may also leverage Bitcoin’s security guarantees. Sidechains let Bitcoiners access more features with their BTC that the main network can’t always provide, such as scalability, programmability, and privacy.\n\nAD\n\nAD\n\nA prevailing difficulty with sidechains, however, is building a “2-way peg” allowing BTC to be safely transferred to the sidechain and back without requiring a centralized middleman.\n\nThat’s where the Spiderchain, developed by Botanix Labs, comes into play.\n\n“The Spiderchain works as a Proof of Stake Layer 2 on Bitcoin,” Willem Schroé, founder of Botanix Labs, told Decrypt. “You stake Bitcoin on Bitcoin in decentralized multisigs.”\n\n\n\nEntities that manage decentralized multisigs are called “orchestrators,” who run both a Bitcoin node and a Spiderchain node. With every request to move BTC to the Spiderchain, a new multisig is created that’s controlled by a random subset of 100 participants within the staker set.\n\nIn many ways, the Spiderchain operates much like Ethereum: it is Ethereum Virtual Machine-compatible, has 12-second block times, and uses a proof of stake consensus mechanism to secure the network, whereby orchestrator nodes must stake BTC to participate.\n\nIts EVM is also “fully equivalent,” meaning existing Ethereum dapps can be easily transferred over to the network by developers. But unlike Ethereum, Schroé said that a malicious majority of orchestrators still cannot conspire to steal users’ BTC.\n\nAD\n\nAD\n\n“The design is possible on the current Bitcoin core, so no soft fork or upgrade is needed,” noted Schroé. This sets Spiderchain apart from Paul Sztorc’s drivechain proposal, which requires changing the Bitcoin code that users and miners are currently running.\n\n\n\nDrivechain was introduced as BIP 300 and BIP 301 back in 2015, and is still yet to be widely embraced for implementation by Bitcoiners.\n\nDrivechains effectively put control of pegged BTC into the hands of Bitcoin miners, but allow for any number of sidechains with any number of properties to be created. It also directly inherits Bitcoin’s security through merge mining, which piggybacks on the main network’s immense proof of work security.\n\nWhen asked about Spiderchains, Sztorc said they seem “very complex” compared to his proposal.\n\n“I also think that the whole \"needs a change to Bitcoin\" is pure superstition, unfortunately,” he added. “People think it means 'the network' must upgrade, but really it is like asking users to install an app on their phone.”\n\n\n\nIn Lopp’s Monday blog post, the CTO cited the nearly decade-old Rootstock proposal, and pointed out some technical vulnerabilities with Spiderchain. Among them is the risk that its BTC peg is “broken” if the main Bitcoin blockchain experiences a reorg of longer than five blocks, due to the system by which Spiderchain orchestrators are determined.\n\n\n\n“It would be unlikely to be catastrophic due to how the funds are dispersed across many multi-sig wallets,” he noted.\n\n\n\nSchroé also admitted that in the network’s early stages, Spiderchain will be centralized until more users can come in to stake their BTC. “We need to start off centralized in the sense that initially we will have to make the staking permissioned,” he said."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmRhaWx5ZnguY29tL25ld3MvaGF2ZS1iaXRjb2luLWV0aGVyZXVtLWNhcGl0dWxhdGVkLWJ0Yy11c2QtZXRoLXVzZC1wcmljZS1zZXR1cHMtMjAyMzA5MTguaHRtbNIBbWh0dHBzOi8vd3d3LmRhaWx5ZnguY29tL25ld3MvaGF2ZS1iaXRjb2luLWV0aGVyZXVtLWNhcGl0dWxhdGVkLWJ0Yy11c2QtZXRoLXVzZC1wcmljZS1zZXR1cHMtMjAyMzA5MTguaHRtbC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Have Bitcoin & Ethereum Capitulated? BTC/USD & ETH/USD Price Setups - DailyFX",
        "content": "Bitcoin, BTC/USD, Ethereum, ETH/USD - Outlook:\n\nBitcoin is attempting to rise above immediate resistance.\n\nETH / USD has been holding above a vital support.\n\nWhat is the outlook and what are the key levels to watch?\n\nRecommended by Manish Jaradi How to Trade the \"One Glance\" Indicator, Ichimoku Get My Guide\n\nBITCOIN: Holds above 25000\n\nOver the past few weeks, Bitcoin has been holding above strong horizontal trendline support since mid-August, roughly coinciding with the June low of 24750. Last week, BTC/USD attempted to rise above immediate resistance at the early-September high of 26500. While the price action is still unfolding – BTC/USD hasn’t broken above 26500 cleanly – the ongoing attempt to rise above 26500 raises the chances that the worst could be over.\n\nBTC/USD 240-Minute Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nThat’s because trends generally turn with capitulation. And the brief dip below 25000 last week coupled with the attempt to rise past 26500 suggests the tide could be turning temporarily in favour of BTC/USD. Still, a decisive rise above the resistance is needed for the imminent downside risks to fade. Such a break could open the upside toward the end-August high of 28150.\n\nBTC/USD Weekly Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nHaving said that, a fall below 24750-2500 would negate the above scenario, potentially triggering a double top (the April and July highs), pointing to a deeper retracement toward the March low of 19550. For more discussion on this, see “Bitcoin & Ethereum Influenced by Thick Cloud Cover; BTC/USD & ETH/USD Price Setups,” published September 5.\n\nETH/USD Daily Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nETHEREUM: Awaiting confirmation of a low\n\nIn contrast, while Ethereum has been holding above its August low of 1550, ETH/USD has yet to rise above a meaningful resistance. In line with BTC/USD, similar resistance for ETH/USD is at the early-September high of 1660. Until some sort of upward momentum develops, the balance of risks for ETH/USD remains toward the downside in the near term – not the 14-day Relative Strength Index has been capped at the 50-mark – indicating a corrective rally, rather than the start of a new uptrend.\n\nETH/USD 240-Minute Chart\n\nChart Created by Manish Jaradi Using TradingView\n\nBelow the August low of 1550, the next support is on the lower edge of a downtrend channel since April (now at about 1500). A break below the 1500-1550 region could pave the way toward the October low of 1370.\n\nAs noted earlier this month, ETH/USD has been under the influence of the bearish Ichimoku cloud cover on the weekly charts. Furthermore, in recent weeks, ETH/USD has been snowed under the Ichimoku cloud on the daily charts. At a minimum, Ethereum needs to surpass 1660. A stronger signal that an interim low was in place would be a crack above the end-August high of 1750.\n\nRecommended by Manish Jaradi Get Your Free Introduction To Cryptocurrency Trading Get My Guide\n\n--- Written by Manish Jaradi, Strategist for DailyFX.com\n\n--- Contact and follow Jaradi on Twitter: @JaradiManish"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3MvZXRoZXJldW0tcHJpY2UtcHJlZGljdGlvbi1hcy1ncmF5c2NhbGUtZmlsZXMtZm9yLW5ldy1ldGhlci1mdXR1cmVzLWV0Zi1oZXJlcy13aGVyZS1ldGgtaGVhZGVkLW5leHQuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction as Grayscale Files For New Ether Futures ETF – Here's Where ETH is Headed Next - Cryptonews",
        "content": "Ethereum Price Prediction as Grayscale Files For New Ether Futures ETF – Here’s Where ETH is Headed Next\n\nETH Chart / Source: Adobe\n\nCrypto asset management giant Grayscale just filed paperwork with the US Securities and Exchange Commission (SEC) to create a new Ether (ETH) Futures Exchange Traded Fund (ETF), as per a report by the Wall Street Journal.\n\nGrayscale filed for the ETF under the Securities Act of 1933, having also previously filed for an Ether Futures ETF under the Investment Company Act of 1940.\n\nWhile comparable Bitcoin Futures ETF have been approved by the SEC under both acts, most ETFs are filed under the 1940 act.\n\nReports in the crypto press back in late August suggested there is a strong possibility that the SEC will approve a number of Ether Futures ETFs as soon as October.\n\nThat news made the price of Ether surge at the time amid front-running from traders, because a wider availability of Ether Futures ETFs could indirectly increase demand for the cryptocurrency, assuming institutional investors start buying up Ether Futures ETFs once they go live.\n\nEther was last changing hands around $1,640, just to the north of its 21DMA.\n\nPrice Prediction – Where Next for Ether (ETH)?\n\nThe fact that Ether looks set to close above its 21DMA following a fairly convincing break above the level in the past two days is a positive for the cryptocurrency’s near-term price outlook.\n\nThe 21DMA had previously been acting as an area of strong resistance for the past more than two-months.\n\nA break above this level sets the stage for a potential rally to the 50DMA just above $1,700 and even the late August highs around $1,740.\n\nAssuming ETH can close above its 21DMA, near-term price predictions are likely to turn modestly more bullish.\n\nBut traders should keep an eye on upcoming macro risk events, such as Wednesday’s rate decision and monetary policy announcement from the US Federal Reserve.\n\nThe central bank isn’t expected to change interest rates, but is expected to signal that more rate hikes remain possible, as well as release a new summary interest rate projections from its policymakers plus new economic forecasts.\n\nThat could impact ETH, depending on how the US bond market and US dollar react – a dovish meeting (where expectations as to how high interest rates will go/remain fall) would weigh on the yields and US dollar, likely boosting ETH, and vice versa.\n\nEther traders may also remain reluctant to enter big positions in the cryptocurrency as they remain in wait-and-see mode ahead of October’s expected Futures ETF decisions from the SEC.\n\nEther (ETH) Alternative to Consider\n\nOne problem with an Ether Futures ETF is that its buyers won’t be set to benefit from the solid yield they can generate from Ether staking.\n\nTo benefit from Ether staking yields, which are normally in the region of 4%, investors would do better to buy the actual ETH token and set up a staking node, or buy a ETH liquid staking derivative such as stETH.\n\nInvestors interested in a riskier cryptocurrency with a much better staking yield should check out a newly launched token called Bitcoin BSC (BTCBSC).\n\nBitcoin BSC is a BEP-20 token issued on the Binance Smart Chain but with pretty much the exact same tokenomics of Bitcoin, although Bitcoin BSC winds the clock back to 2011, when Bitcoin traded at $1 per token.\n\nIndeed, Bitcoin BSC tokens are currently being sold in presale for $1 each, with over $2 million already raised.\n\nBitcoin BSC holds various advantages over Bitcoin – it is greener thanks to the Binance Smart Chain’s lower energy consumption and is more readily available for use in the Binance Smart Chain’s growing Decentralized Finance ecosystem.\n\nMoreover, Bitcoin BSC holders can stake their tokens to benefit from BTCBSC issuance according to the same schedule that Bitcoin was on back in 2011.\n\nThat means BTCBSC holders could be looking at double or even triple digit annual yields if they stake their tokens.\n\nA similar project BTC20 – the exact same concept but issued as an ERC-20 token on Ethereum – was able to quickly sell out a blockbuster $6 million presale and then post gains of as much as 6x, while BTC20 is still trading above its presale price of $1.\n\nBitcoin BSC is thus an opportunity for those who missed BTC20 to get in early.\n\nBitcoin BSC could do even better than BTC20 given the Binance Smart Chain’s faster transaction speeds and lower fees, making for a better trading and DeFi experience.\n\nInvestors need to move quickly, as the token’s hard cap raise target of just under $4 million will likely soon be reached.\n\nBuy Bitcoin BSC Here\n\nDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vdS50b2RheS92aXRhbGlrLWJ1dGVyaW4tdHJhbnNmZXJzLWhhbGYtbWlsbGlvbi1pbi1ldGgtdG8tbWFqb3ItZXhjaGFuZ2Utd2hpbGUtZXRoZXJldW0tcHJpY2Utc29hcnPSAW5odHRwczovL3UudG9kYXkvdml0YWxpay1idXRlcmluLXRyYW5zZmVycy1oYWxmLW1pbGxpb24taW4tZXRoLXRvLW1ham9yLWV4Y2hhbmdlLXdoaWxlLWV0aGVyZXVtLXByaWNlLXNvYXJzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Transfers Half Million in ETH to Major Exchange, While Ethereum Price Soars - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a significant move reported by PeckShieldAlert, Ethereum creator and blockchain entrepreneur Vitalik Buterin recently executed a substantial transfer of 300 ETH, valued at an impressive $490,000, to the major exchange Kraken. The transaction consisted of two tranches, with 100 ETH and 200 ETH transferred separately. Remarkably, even after this transfer, Buterin's wallet \"0x1Db\" still holds 2,451 ETH, amounting to a staggering $4.04 million.\n\nAdvertisement\n\nThis transfer stands out as one of the largest direct transfers from this particular Buterin wallet to an exchange in recent years. Typically, such transfers to exchanges are perceived as potential sell-off events, especially when involving insiders, including Ethereum's founder himself.\n\nWhat is worth noting is the timing of this transfer, which coincides with Ethereum's price demonstrating positive momentum and trading in the green zone. This has led some to wonder if Buterin's decision to move a substantial amount of ETH to an exchange may signal a local peak in Ethereum's price. Crypto enthusiasts have debated whether this move indicates Buterin's intent to cash in on his substantial Ethereum holdings.\n\nETH to USD by CoinMarketCap\n\nButerin's influence in the crypto space is undeniable, and his actions are closely watched by the community. As Ethereum continues to be the market-defining power, every move made by its founder becomes a subject of analysis and speculation. For now, all eyes remain on the Ethereum price chart to see if it reacts to this event."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RvcC0zLXByaWNlLXByZWRpY3Rpb24tYml0Y29pbi1ldGhlcmV1bS1yaXBwbGUtMjctNTAwLWluLXRoZS1jYXJkcy1mb3ItYnRjLWJlZm9yZS1hLWJpZy1tb3ZlLTIwMjMwOTE4MTcwMNIBnAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy90b3AtMy1wcmljZS1wcmVkaWN0aW9uLWJpdGNvaW4tZXRoZXJldW0tcmlwcGxlLTI3LTUwMC1pbi10aGUtY2FyZHMtZm9yLWJ0Yy1iZWZvcmUtYS1iaWctbW92ZS0yMDIzMDkxODE3MDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: $40 million in total liquidations as BTC yanks - FXStreet",
        "content": "Share:\n\nBitcoin price is up almost 5% in the last day, with momentum indicators bolstering the bullish case, but resistance lies ahead.\n\nEthereum price is likely to face a rejection from the $1,682 level before a 10% pullback below the $1,552 range.\n\nRipple price coils up for a run down to the $0.4600 support level unless bulls show resilience.\n\nBitcoin (BTC) price sprinted north then pulled back in an interesting turn of events that saw up to $40 million in total liquidations within a day. Specifically, $30.95 million shorts against $11.95 million longs were liquidated.\n\nBTC liquidations\n\nEthereum (ETH) price followed BTC in the fluctuations, just the only $10 million shorts were liquidated against $5 million longs. Meanwhile, Ripple (XRP) price is at an inflection point.\n\nAlso Read: Bitcoin open interest outperformed crypto markets amid BTC Spot ETF hype\n\nBitcoin price has a big move on the cards\n\nBitcoin (BTC) price is trading with a bullish bias, although much remains to be said as it confronts a critical barrier at $27,500. However, momentum indicators suggest rising momentum, and if sustained, the flagship cryptocurrency could shatter this level, with the potential to extend into the $28,000 range.\n\nFurther north, and in a highly bullish case, Bitcoin price could rise to the supply zone at $29,367, confirming the uptrend above this supplier congestion zone.\n\nThe Relative Strength Index (RSI) is moving north, suggesting rising momentum, just like the Awesome Oscillator (AO) is flashing green to show bulls are leading the market.\n\nBTC/USDT 1-day chart\n\nConversely, a rejection from the $27,500 level could catch longs off guard. This could send Bitcoin price south, with a forecasted target below the $26,640 range and into the foothold of the descending trendline.\n\nIn a dire case, the largest crypto by market capitalization could extend to the demand zone, confirming the downtrend below its mean threshold at $25,357, or worse, extrapolate lower in an attempted liquidity grab.\n\nAlso Read: Bitcoin punches above $27k, but analysts have bearish price predictions\n\nEthereum price is committed to BTC\n\nEthereum (ETH) price has mirrored Bitcoin’s price action for a long time now, with its strong correlation suggesting it will follow the king of crypto to its next move. As such, with the momentum RSI and AO indicators painting a bullish picture, ETH could breach the $1,682 level and extend north.\n\nETH/USDT 1-day chart\n\nHowever, a closer look suggests an impending slump in Ethereum price, just like in the case of BTC with a lot of uncollected liquidity resting underneath. With this, the largest altcoin by market capitalization is likely to correct below the $1,552 support level before a sustainable move north.\n\nAlso Read: Ethereum Layer 2 networks BASE, zkSync Era make history, ETH bites the dust"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS10cmFkZXJzLWluY3JlYXNpbmdseS1idWxsaXNoLWFzLXRha2VyLWJ1eS1zZWxsLXJhdGlvLWhpdHMtbmV3LWhpZ2gv0gFmaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLXRyYWRlcnMtaW5jcmVhc2luZ2x5LWJ1bGxpc2gtYXMtdGFrZXItYnV5LXNlbGwtcmF0aW8taGl0cy1uZXctaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Ethereum traders increasingly bullish as taker buy-sell ratio hits new high - AMBCrypto News",
        "content": "ETH’s taker buy-sell ratio has risen steadily since 10 September\n\nWith strong resistance at $2000, ETH investments have continued to return very low profits\n\nEthereum’s [ETH] taker buy-sell ratio assessed on a 30-day simple moving average (SMA) has climbed to its highest level since 23 June. This, according to data from CryptoQuant.\n\nThe taker buy-sell ratio is a metric that measures the ratio between the buy volume and sell volume in an asset’s Futures market. A value greater than 1 indicates more buy volume than sell volume, while a value less than 1 indicates more sell volume than buy volume.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nA steady decline in this metric suggests that the Futures market for the asset concerned has become plagued by more sell orders than buy orders.\n\nDue to the significant resistance faced by ETH around the $2000-price level, its taker buy-sell ratio has trended south since 29 May. In fact, by 28 August, it had fallen to its lowest level this year.\n\nAlthough still below 1, CryptoQuant analyst ‘Greatest_Trader’ has now claimed that the surge in ETH’s taker buy-sell ratio since 10 September represents a re-emergence of positive sentiment. This might help drive up the altcoin’s value.\n\n“This surge suggests a potential change in sentiment among market participants, indicating a shift towards a more bullish stance. Should this metric continue its upward trajectory and venture into positive territory, it could herald the onset of a new phase characterized by bullish price action. In such a scenario, Ethereum’s price might experience an upsurge, potentially targeting higher resistance levels.”\n\nETH promises little to no returns for now\n\nWhile positive sentiments might be returning to ETH’s Futures market, the general market appears rife with bearish activity. This, as gleaned from the consistent decline in the daily count of profitable transactions involving the alt.\n\nAccording to Santiment, the ratio of ETH’s daily on-chain transaction volume in profit to loss has fallen over the last month. With a figure of 0.85 at press time, it suggested that for every ETH transaction that resulted in a loss, only 0.85 returned profit.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAlso, after peaking at 23% on 29 July, the coin’s Market Value to Realized Value (MVRV) has dropped. This metric tracks when an asset becomes overvalued or undervalued in relation to its historical price movements and the price at which it was last moved.\n\nFinally, with a reading of 18% at press time, the count of ETH holders who would log profit on their investments if they sold the coins has plummeted since the end of July."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vZmluYm9sZC5jb20vdG9wLTMtZ2FtZS1jaGFuZ2luZy1jcnlwdG9jdXJyZW5jaWVzLWluLTIwMjMtZXRoZXJldW0tZXRoLXZlY2hhaW4tdmV0LWthbmdhbW9vbi1rYW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Top 3 Game-Changing Cryptocurrencies in 2023: Ethereum (ETH), VeChain (VET), Kangamoon (KANG) - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nIt’s crucial to identify the cryptocurrencies that have the potential to be game-changers in the industry. Analysts have weighed in, and three cryptocurrencies are generating considerable buzz: Ethereum (ETH), VeChain (VET), and the up-and-coming Kangamoon (KANG).\n\nSummary\n\nEthereum price prediction\n\nVeChain embarks on its smart city journey\n\nKangamoon projected to grow by 35x after major exchange listings\n\nDon’t Miss Out On The Kangamoon (KANG) Presale – Reserve Your Spot!\n\nEthereum (ETH): Great Growth Potential\n\nEthereum (ETH), often called the king of smart contracts, is not a new player in the crypto world. However, it continues to evolve and adapt, solidifying its position as a game-changing cryptocurrency.\n\nThe year started with a resurgence of on-chain activity, primarily driven by a significant spike in NFT trading volumes. The Blur token airdrop frenzy further fueled this resurgence. Concurrently, the Ethereum price experienced a notable uptick.\n\nMoreover, Ethereum’s burn rate, the reduction of its total supply through network fee burning, accelerated notably. This steady reduction in supply could drive demand up. Due to all these reasons, analysts foresee the Ethereum value soaring to $2,335.71 by the end of 2023.\n\nVeChain (VET): Revolutionizing Supply Chain Management\n\nVeChain (VET) has been making waves in supply chain management. With its unique blend of IoT integration and blockchain technology, VeChain enables transparent and secure tracking of products throughout the supply chain.\n\nIn recent VeChain news, it has embarked on a pioneering journey into smart city systems, marking a significant milestone in the blockchain industry. VeChain is positioning itself at the forefront of innovation by venturing into the realm of smart cities.\n\nAs smart cities continue to evolve and expand, VeChain’s involvement in these systems solidifies its status as a crypto project with a transformative vision for the future. Thus making it a compelling choice for investors looking for game-changing opportunities in 2023. Additionally, experts foresee a rise to $0.023 for the VeChain price within Q4 of 2023.\n\nKangamoon (KANG): The Meme Coin with a Twist\n\nWhile Ethereum and VeChain are established players, Kangamoon (KANG) represents the new wave of cryptocurrencies entering the scene. What sets Kangamoon apart is its playful approach to cryptocurrency, combining meme coin appeal with the emerging Play-2-Earn (P2E) gaming trend.\n\nKangamoon introduces players to a virtual universe where they can take on the role of Kangamoon, a boxing kangaroo. This all-immersive experience not only entertains but also provides the opportunity to monetize gaming time through in-game rewards and the trade of digital assets.\n\nIn addition to the core gameplay, Kangamoon offers collectibles and NFTs, adding an extra layer of excitement for players and collectors. These digital collectibles can become valuable assets within the game and even in the broader world of NFTs.\n\nAt the heart of this game will lie the KANG native token, now worth only $0.005 as it is in Stage 1 of its presale. However, analysts have also noticed that it has a low market cap. When compared to Ethereum and VeChain, KANG may see faster growth. In fact, they forecast that a 35x value increase is in store after it gets listed on significant exchanges.\n\nDiscover the Exciting Opportunities of the Kangamoon (KANG) Presale Today!\n\nWebsite: https://Kangamoon.com/\n\nJoin Our Telegram Community: https://t.me/Kangamoonofficial"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1uZWFycy0yNzAwMC1ldGhlcmV1bS1maXJtcy1hYm92ZS0xNjAwLXRvbmNvaW4tcmlzZXMtNS0zOTg4NTgtMjAyMy0wOS0xOdIBlgFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2FtcC9jcnlwdG8vdG9rZW4vc3RvcnkvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tbmVhcnMtMjcwMDAtZXRoZXJldW0tZmlybXMtYWJvdmUtMTYwMC10b25jb2luLXJpc2VzLTUtMzk4ODU4LTIwMjMtMDktMTk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin nears $27,000; Ethereum firms above $1,600; Toncoin rises 5% - Business Today",
        "content": "Bitcoin and other crypto tokens were trading higher on Tuesday ahead of the Federal Reserve's policy meeting outcome, where the US central bank is expected to maintain the status quo. The market dominance of Bitcoin in the crypto market has increased to about 50 per cent, which is the highest in the last 26 months.\n\n\n\nBitcoin posted mild gains as the largest crypto token rose about a per cent, nearing $27,000-levels after briefly touching it. Its largest peer, Ethereum, also inched up marginally, to firm its position above $1,600-mark. Price action in the altcoins remained on the positive side in the early hours.\n\n\n\nThe crypto market has traded sideways with an upward bias in the last 24 hours. It has been another positive day for Bitcoin as it touched $27,400 before pulling back slightly, In fact, the last 8 days have been pretty positive for the crypto market with Bitcoin rebounding about 10 per cent from its recent lows, said Shubham Hudda, Senior Manager, CoinSwitch Markets Desk.\n\n\n\n\"Other cryptos worth highlighting are Solana and Chainlink as they have been showing significant momentum ever since the market started to recover. With giants like financial service provider SWIFT using Chainlink’s infrastructure, we can see a significant upside if this momentum continues,\" he said.\n\n\n\nBarring a few exceptions, all top crypto tokens were trading higher on Tuesday. Toncoin surged about 5 per cent, while Solana gained about 4 per cent. Litecoin rose over 3 per cent, whereas XRP and Cardano were up 2 per cent each. Among the losers, BNB declined about a per cent, while Polkadot and Shiba Inu also retreated.\n\n\n\nThe global cryptocurrency market cap was trading slightly higher, rising to $1.07 trillion-mark, as it rose about a per cent in the last 24 hours. However, the total trading volumes surged more than 63 per cent to $30.13 billion.\n\n\n\nImage: Crypto-chart-price\n\n\n\nTech View by WazirX Trade Desk\n\nChainlink(LINK) serves as a blockchain abstraction layer, facilitating seamless connectivity for smart contracts across various platforms. By employing a decentralized oracle network, Chainlink ensures secure interactions between blockchains and external data feeds, events, and payment systems.\n\n\n\nImage: Chart-LINK\n\n\n\nIn the daily time-frame, the LINK/USDT trend has come out of its consolidation phase. The chart has broken out of the descending trendline with a good buildup of volume and we could expect an upward trajectory in the trend during the coming weeks. The next resistance is expected at 7.33 USDT and a strong support is expected at 5.01 USDT.\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5meGVtcGlyZS5jb20vZm9yZWNhc3RzL2FydGljbGUvYml0Y29pbi1ldGhlcmV1bS14cnAtZm9yZWNhc3QtYnRjLWdlbmVyYXRpbmctYS1nb2xkZW4tY3Jvc3Mtc2lnbmFsLTEzNzU0MzA_Zm9sbG93PXRydWXSAWZodHRwczovL2FtcC5meGVtcGlyZS5jb20vZW4vYml0Y29pbi1ldGhlcmV1bS14cnAtZm9yZWNhc3QtYnRjLWdlbmVyYXRpbmctYS1nb2xkZW4tY3Jvc3Mtc2lnbmFsLzEzNzU0MzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, XRP Forecast: BTC Generating a “Golden Cross” Signal - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMTgvY3J5cHRvLXdoYWxlLXRha2VzLTE1MG0tYnVsbGlzaC1iZXQtb24tZXRoZXItdHJhZGluZy1kYXRhLXRyYWNrZXItc2hvd3Mv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOS8xOC9jcnlwdG8td2hhbGUtdGFrZXMtMTUwbS1idWxsaXNoLWJldC1vbi1ldGhlci10cmFkaW5nLWRhdGEtdHJhY2tlci1zaG93cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Crypto Whale Trades $150M in ETH Call Options, Trading Data Tracker Shows - CoinDesk",
        "content": "Since then, ether has bounced to $1,634. Prices have risen 36% this year. According to research firm RxR, the cryptocurrency is trading at a discount of 27% to its fair value based on a Metcalf law model, incorporating active user adoption on both the mainnet and the layer 2 scaling solution."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9hcy1ldGhlcmV1bS1nYXMtdXNhZ2UtcGx1bW1ldHMtaG93LWhhcy10aGUtbmV0d29yay1mYXJlZC_SAVNodHRwczovL2FtYmNyeXB0by5jb20vYXMtZXRoZXJldW0tZ2FzLXVzYWdlLXBsdW1tZXRzLWhvdy1oYXMtdGhlLW5ldHdvcmstZmFyZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "As Ethereum gas usage plummets, how has the network fared - AMBCrypto News",
        "content": "Ethereum’s total gas usage declined to around 107.6 billion from 107.9 billion.\n\nFees have also decreased recently.\n\nRecent data indicates a significant decrease in Ethereum [ETH] gas usage. Has a decrease in network interactions accompanied this decline in gas usage?\n\nHow much are 1,10,100 ETHs worth today\n\nEthereum gas usage sees a sharp drop\n\nAs per a recent update from Glassnode Alerts, Ethereum has experienced a recent reduction in its daily gas consumption. According to their report, this decrease marked the lowest gas usage observed over the past month.\n\nThe provided chart illustrates that ETH gas usage has fallen to approximately 4.4 billion. As of this report, the total gas consumption was approximately 107.6 billion. Before this decline, the total gas usage had exceeded 107.9 billion.\n\nEthereum addresses see a slight impact\n\nAccording to Santiment’s 30-day active addresses chart, there has been a recent uptrend in the number of active addresses, suggesting an increase in the addresses engaging with the network. The chart illustrated a rise from approximately 5.7 million to over 6 million as of the latest data available.\n\nHowever, when examining the daily active addresses metric, it’s evident that there has been a decline in recent days. As of 14 September, there were more than 452,000 daily active addresses, but this number dropped to around 373,000 by 16 September.\n\nAt the time of this report, the number has further decreased to approximately 140,000.\n\nTransaction fees drop to second-lowest\n\nThe volume chart on Santiment revealed a recent decline in Ethereum’s trading volume. On 14 September, the volume was recorded at over $5 billion, but it subsequently dropped to approximately $3.7 billion on 16 September. As of this writing, the volume was around $2.7 billion.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nAdditionally, according to data from Crypto Fees, Ethereum has maintained its position at the top of the list in terms of transaction fees despite the drop in gas usage. However, upon closer examination, it’s evident that transaction fees have been decreasing over the past few days.\n\nAs of this report, the fee was slightly over $2.4 million, and this decline in fees appears to be a consistent trend. Notably, this fee was the lowest that the network has seen in over three months, with the previous lowest fee recorded at $2.2 million on 10 September."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY3J5cHRvLm5ld3MvYW5pbW9jYS1jZW8taW52aXRlcy1ldGhlcmV1bXMtY3JlYXRvci10by1ob25nLWtvbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Animoca CEO invites Ethereum's creator to Hong Kong - crypto.news",
        "content": "Yat Siu, founder of Animoca Brands, offered to fly Vitalik Buterin to Hong Kong and act as his tour guide to help navigate the city-state’s crypto regulatory landscape after Buterin shared doubts about long-lasting policies.\n\nAnimoca’s chief executive dispelled claims that the relationship with Beijing could hamper regulatory stability and disrupt crypto-friendly policies in the near future. Siu stressed that Hong Kong operates a free market and serves as a cornerstone in China’s approach to emerging technology like web3.\n\nDespite everything that one may be reading in the media, Hong Kong has actually been one of the most stable economies in the world, ranked by organizations that are unrelated to Hong Kong. Yat Siu, founder and ceo Animoca Brands, on CoinDesk TV.\n\nButerin had previously expressed his concerns about how concrete crypto-friendly laws in Hong Kong might last due to China’s ban on crypto. The Ethereum co-founder shared these remarks during the 2023 Web3 Transitions Summit in Singapore.\n\nSiu is the second individual to suggest that Buterin visit Hong Kong and get personally acquainted with the region’s efforts regarding digital assets. Johnny Ng, a local policymaker, also invited Buterin to Hong Kong and offered to introduce him to relevant agencies working on establishing the region as a global crypto hub.\n\nYou might also like: Hong Kong’s first licensed crypto exchange HashKey launches fund\n\nHong Kong’s crypto rally\n\nBoth invitations come amid Hong Kong’s push to attract crypto businesses and digital asset operators by implementing policies to incentivize web3 growth.\n\nIn addition to a licensing regime for both retail and institutional crypto service providers. Hong Kong also encouraged banks to onboard digital asset entities as customers.\n\nThe Special Administrative Region could publish a stablecoin regulatory framework by mid-2024, as reported by crypto.news\n\nWhile policies are installed to fairly regulate markets, authorities retain the hammer at hand for non-compliance actors. The Hong Kong Monetary Authority advised crypto companies against making misleading bank claims.\n\nFurthermore, Hong Kong’s Securities and Futures Commission warned users against trading on JPEX, an unregistered crypto exchange. Law enforcement later arrested six individuals tied to crypto fraud allegations on JPEX’s platform.\n\nRead more: Hong Kong arrests over JPEX crypto fraud increase to six people\n\nFollow Us on Google News"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aGFsZXMtaGF2ZS10aGVpci1leWVzLW9wZW4tYW5kLXdpdGgtZ29vZC1yZWFzb24tdG9vL9IBWGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS13aGFsZXMtaGF2ZS10aGVpci1leWVzLW9wZW4tYW5kLXdpdGgtZ29vZC1yZWFzb24tdG9vL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Ethereum whales have their eyes open, and with good reason too - AMBCrypto News",
        "content": "Ethereum’s $100k+ transactions hit their lowest level since 2023 began\n\nTraders are bearish on ETH’s short-term price action\n\nThe number of Ethereum [ETH] transactions worth over $100,000 has hit a new low in 2023, according to an update from Santiment. Whenever something of this magnitude occurs, it means that the cohort involved is not excited about the short-term prospect of the cryptocurrency in question.\n\nHow much are 1,10,100 ETHs worth today?\n\nWatching out for the right season\n\nOn the contrary, Santiment, in its 18 September tweet, opined that it is a different case as far as ETH is concerned. According to the on-chain analytics platform, the lack of large transactions does not necessarily imply disinterest. Instead, it suggests that whales are probably patient and on the lookout for a better accumulation entry.\n\n? #Bitcoin continues to trade between $26K-$27K, and #Ethereum at $1.6K to 1.65K. #Crypto's top market caps' $100K+ transaction levels are at their lowest levels of 2023 right now. This is a sign of whales likely waiting, and not necessarily disinterest. https://t.co/FKfhB5X3Yh pic.twitter.com/m9990wqlpM — Santiment (@santimentfeed) September 18, 2023\n\nThis development was further reinforced by the balance of addresses. At the time of writing, Ethereum addresses holding between 10,000 to 10 million coins have their balance shredded. The fall in the balance means that a lot of whales have cashed in on a part of their holdings.\n\nAlso, since the profit-taking, the whales have refrained from accumulating. It was a similar case with the number of whales within the same group. Based on Santiment’s data, the number of addresses holding 10,000 to 10 million ETH has either flatlined or decreased since June.\n\nNo relief in sight?\n\nInterestingly, traders also seem to be on the same page as whales as far as ETH’s next direction is concerned. This conclusion was made based on the funding rate at press time. Funding rates are periodic payments made between longs and shorts.\n\nWhen the funding rate is positive, it means that longs are paying a funding fee to shorts to keep their contracts open. In this case, the average trader sentiment is bullish. However, a negative funding rate means that sentiment is bearish and short positions are dominant in the market.\n\nAt the time of writing, ETH’s funding rate had fallen into the negative zone. This means that traders expect ETH to drop below $1,640 in the short term.\n\nMeanwhile, there’s a chance that the percentage of ETH holders in loss may increase if the altcoin’s value decreases. At press time, the daily on-chain\n\ntransaction volume\n\nin profit was 330,000. On the other hand, the daily on-chain transaction volume in loss was 511,000.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nThese two metrics show the aggregate amount of coins/tokens across all transactions on the network that moved in profit or loss for a given asset in an interval.\n\nAs it stands, short-term holders of ETH may have no other option than to wait for a relief period. And to those who can’t tolerate another decline, they could end up with a loss."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bXMtZXhjaGFuZ2UtZGVwb3NpdC1zdXJnZS11bmNvdmVyaW5nLXRyZW5kcy1vdXRmbG93cy1hbmQtcHJpY2UtdXB0aWNrcy_SAWhodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW1zLWV4Y2hhbmdlLWRlcG9zaXQtc3VyZ2UtdW5jb3ZlcmluZy10cmVuZHMtb3V0Zmxvd3MtYW5kLXByaWNlLXVwdGlja3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Ethereum’s exchange deposit surge: Uncovering trends, outflows, and price upticks - AMBCrypto News",
        "content": "Exchange deposits of Ethereum have spiked to a nine-month high\n\nETH saw a slight uptrend in price but was still stuck in a bear trend\n\nEthereum has seen a notable surge in exchange deposits, marking a level of activity not seen in months. However, amidst this surge, which exchange flow has consistently maintained the highest flow in recent days?\n\nRead Ethereum (ETH) Price prediction 2023-24\n\nEthereum deposits spike\n\nAccording to a tweet by Glassnode Alerts, there has been a significant upswing in ETH deposits. In fact, at the time of writing writing, exchange deposits had exceeded 161,000, marking the highest level observed in over nine months.\n\nPrior to this, the highest deposit level recorded on the chart was approximately 98,000, and this was in January.\n\nTo provide some context to the same, it is worth noting that Ethereum typically witnessed an average exchange deposit of around 30,000, excluding occasional spikes. This context emphasizes the significance of the recent spike and prompts questions about its impact on the flow of Ethereum.\n\nAnalyzing the Ethereum exchange flow\n\nDespite the notable increase in exchange deposits, as illustrated by Glassnode’s chart, it appears that more Ethereum has been exiting exchanges. According to the Netflow chart provided by CryptoQuant, over the past few days, Ethereum outflows have been surpassing inflows.\n\nThis is a sign that even though significant volumes of ETH were being deposited into exchanges, an even greater amount was being withdrawn.\n\nThe netflow chart revealed that the last instance of inflows surpassing outflows happened around 15 September. At press time, however, the netflow is -18,223. Here’s the caveat though – The netflow direction may change by the end of the day, but the dominance of outflows remains apparent.\n\nSpike in volume?\n\nExamining the volume metric via Santiment also revealed fluctuations in Ethereum’s recent trading activity. The chart indicated that Ethereum’s trading volume recorded a decline, dropping to approximately $2.7 billion on 17 September from over $4 billion the day before.\n\nHowever, at the time of writing, the volume had rebounded to surpass $3 billion, signalling a slight hike on the chart.\n\nIt remains uncertain whether the surge in exchange deposits played a role in this volume uptick, but it’s certainly a plausible factor to consider.\n\n– How much are 1,10,100 ETHs worth today\n\nETH’s uptrend not strong enough\n\nFollowing two consecutive days of a slight price decline, Ethereum has appreciated on its daily price chart. At press time, it was trading at approximately $1,633, reflecting a modest hike of less than 1%.\n\nNotably, the short-term Moving Average (yellow line) continued to act as resistance, particularly around the $1,700-price level. Additionally, Ethereum’s Relative Strength Index (RSI) remained below the neutral line, indicative of its ongoing bearish trend."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wOS8xOS8yNzQ1NzAwLzAvZW4vSW5qZWN0aXZlLVVudmVpbHMtaW5FVk0tQS1Hcm91bmRicmVha2luZy1FdGhlcmV1bS1Sb2xsdXAtZm9yLUh5cGVyc2NhbGluZy1NdWx0aS1WTS1EZXZlbG9wbWVudC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Injective Unveils inEVM, A Groundbreaking Ethereum Rollup for Hyperscaling Multi VM Development - GlobeNewswire",
        "content": "New York, NY, Sept. 19, 2023 (GLOBE NEWSWIRE) -- Injective , the blockchain built for finance, today announced the launch of inEVM, the first-ever Ethereum Virtual Machine capable of achieving true composability across Cosmos and Solana. The inEVM network was developed in collaboration with Caldera, a L2 rollup infrastructure platform backed by Sequoia.\n\n\n\nWith inEVM, Ethereum developers gain unprecedented access to Injective's global network and user base, offering a new realm of opportunities to expand the reach of their protocols.\n\n\n\ninEVM is part of Injective’s larger plan to introduce a network of Electro Chains. In essence, this consists of a series of rollups with dedicated VM environments that would cater to the needs of distinct builders while still providing the highest levels of scalability and security. Electro Chains inherit security from Injective while also extending block space available on any one chain which directly contributes to a far more scalable network than what exists in Web3 today.\n\ninEVM touts several major benefits for developers including ultra-fast speeds due to a parallelized structure, instant transaction finality, a modular toolkit, shared liquidity, and composability across the Cosmos IBC universe alongside Solana.\n\nThis latest development follows the recent release of Injective's inSVM (formerly known as \" Cascade \"), the first Solana Virtual Machine (SVM) rollup solution integrated into the larger Inter-Blockchain Communication (IBC) ecosystem. This innovation has empowered Solana developers to effortlessly migrate their applications to Injective, extending their reach to a broader audience without the need for significant code modifications.\n\ndApps launched on the inEVM layer would be able to compose directly with Cosmos and Solana applications due to Injective’s Electro Chain initiative. As a result, both inter and intra VM interoperability would be achieved by builders on the inEVM layer. This in turn results in a far more seamless development experience devoid of traditional complexities and barriers.\n\nInjective has long been pioneering groundbreaking technology in Web3, and its latest creation, inEVM, is poised to redefine the way Ethereum developers interact with the broader blockchain universe. With inEVM, Ethereum developers can harness the power of solidity to seamlessly deploy their applications into the Injective ecosystem.\n\n\n\nInjective's overarching mission is to democratize the financial future by fostering decentralization across the blockchain landscape. The rise of Layer 1 solutions requires different networks to work together smoothly, and Injective's Electro Chains serve as the conduit that dynamically connects these networks. By enabling developers to swiftly launch their applications on multiple VM environments and simplifying user interaction with Web3, Injective is forging a cohesive, user-centric Web3 environment, where collaboration prevails over competition.\n\n“inEVM will enable Ethereum developers to effortlessly deploy applications across Injective Electro Chains while also tapping into an expansive network of users and liquidity,” said Eric Chen, co-founder and CEO of Injective Labs. \"This marks a significant stride forward for Web3, as we work towards creating a fully integrated ecosystem, where developers and users can maximize the benefits of an optimized infrastructure stack without being hindered by barriers between networks.”\n\nInjective's launch of inEVM underscores its dedication to driving innovation and collaboration in the blockchain space. As the global financial landscape evolves, Injective continues to stand at the forefront, facilitating the growth and development of Web3 finance."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8xOC9jYXJkYW5vLXNvbGFuYS1hbmQteHJwLXNlZS1pbnN0aXR1dGlvbmFsLWluZmxvd3Mtd2hpbGUtYml0Y29pbi1hbmQtZXRoZXJldW0taW52ZXN0bWVudHMtc2xpZGUtY29pbnNoYXJlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Cardano, Solana and XRP See Institutional Inflows While Bitcoin and Ethereum Investments Slide: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares reports that Cardano (ADA), Solana (SOL) and XRP products are bucking the trend of an otherwise pessimistic institutional investment climate.\n\nIn its latest Digital Asset Fund Flows Weekly Report, CoinShares says investors are currently less optimistic as reflected in outflows over eight of the last nine weeks totaling over $450 million.\n\nCoinShares finds that digital assets saw outflows of $54 million last week, marking the fifth week of outflows in a row.\n\n“Digital asset investment products saw outflows totaling US$54m last week, marking the 5th consecutive week. There have been outflows for 8 out of the last 9 weeks that aggregate to US$455m, with year-to-date net inflows falling to just US$51m.”\n\nAccording to CoinShares, much of the outflow activity can regionally be traced back to the United States.\n\nPer usual, the leading crypto by market cap Bitcoin (BTC) suffered the heaviest outflows.\n\n“Bitcoin comprised 85% of the outflows, seeing US$45m last week. Short-bitcoin inflows the prior week proved to be short-lived, with outflows of US$3.8m last week, However, it remains the most loved investment product with month-to-date inflows at US$12m.”\n\nMeanwhile, Ethereum (ETH) products bled out to the tune of nearly $5 million last week, while Binance Coin (BNB) and Polygon (MATIC) lost $0.3 million each.\n\nNot all altcoins went down though. Solana (SOL), Cardano (ADA), and XRP products all saw inflows totaling $0.7 million, $0.4 million, and $0.1 million, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZG9nZWNvaW4vZG9nZWNvaW4tYml0Y29pbi1ldGhlcmV1bS_SAURodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2RvZ2Vjb2luL2RvZ2Vjb2luLWJpdGNvaW4tZXRoZXJldW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "How Much Will Dogecoin Trade At If It Attains The Market Cap Of Bitcoin Or Ethereum? - NewsBTC",
        "content": "Comparisons in the crypto market are not out of the norm, especially given the fierce rivalry that goes on between two or more tokens at a time. So this report will take a look at where the price of Dogecoin will realistically be if the meme coin’s market cap were to reach the current market cap of Bitcoin or Ethereum.\n\nDogecoin With The Market Cap Of Bitcoin\n\nBitcoin, the world’s largest cryptocurrency, has a market cap of $521 billion. This is over 2x the market cap of the second-largest cryptocurrency Ethereum, and makes up around half of the total crypto market cap. While this is interesting, a more interesting fact is where the price of Dogecoin would be if it were to reach the market cap of Bitcoin.\n\nCoinGecko’s Coin Comparison feature allows users to input two different cryptocurrencies and show how much one would trade for if they had the market cap of the others. Using this feature, NewsBTC has been able to determine how much a single DOGE token would be at a market cap of $521 billion.\n\nDOGE would trade at $3.70 with Bitcoin's market cap | Source: CoinGecko\n\nA single DOGE token at such a market cap comes out to $3.70 per token, an over 59x (5,900%) increase from its current price. Inversely, Bitcoin at the $8.8 billion market cap of Dogecoin would put each BTC at a price of $448.\n\nWhere Will DOGE Trade With Ethereum’s Market Cap\n\nEthereum is currently the second-largest cryptocurrency in the space with a market cap of $196 billion. With this market cap, the price of Ethereum’s nice ETH token is sitting at $1,635 with a circulating supply of 120,225,429 ETH.\n\nNow, using CoinGecko’s Coin Comparison feature and checking the price of where Dogecoin would be if it reaches the $196 billion market cap of Ethereum, it comes out to a $1.39 price point for the meme coin.\n\nDOGE would trade at $1.39 with Bitcoin's market cap | Source: CoinGecko\n\nFrom its current price of $0.06192, it comes out to a 22x or 2,200% move. On the flip side, Ethereum falling to the market cap of DOGE at $8.8 billion would see the digital asset’s price trade at just $72.53, a long way from its present value.\n\nThe price differences between the cryptocurrencies mentioned at the same market cap come down to their circulating supply. Dogecoin has a circulating supply of over 141 billion DOGE compared to 19.48 million BTC for Bitcoin and 120 million ETH for Ethereum.\n\nDOGE price at $0.06 with $8.8 billion market cap | Source: DOGEUSD on Tradingview.com\n\nFollow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from CoinMarketCap, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hcmUtZXRoZXJldW0tbmZ0cy1pbi10cm91YmxlLXdoYXQtdGhlLWRhdGEtc3VnZ2VzdHMv0gFOaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2FyZS1ldGhlcmV1bS1uZnRzLWluLXRyb3VibGUtd2hhdC10aGUtZGF0YS1zdWdnZXN0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Are Ethereum NFTs in trouble? What the data suggests - AMBCrypto News",
        "content": "Ethereum’s NFT market faced declining trading volumes, leading to concerns about its future vitality.\n\nPFP NFTs witnessed significant price drops, which reflected the changing market preferences.\n\nIn recent times, the NFT market has seen new players like friends.tech invigorate the space, but Ethereum [ETH]’s NFT ecosystem tells a different story.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nDeclining interest in Ethereum NFTs\n\nData from Messari painted a grim picture, with Ethereum NFT trading volumes hitting rock bottom. This decline indicated a significant drop in user engagement and transaction activity.\n\nThe consequences of this dip in interest are far-reaching. Ethereum’s once-thriving PFP (Profile Picture) NFTs, which gained immense popularity, were facing significant price drops.\n\nAdditionally, many of these collections witnessed their floor prices plummet by at least 30%, leaving collectors and investors concerned about the falling value of their holdings.\n\nEven blue-chip NFTs on the Ethereum network weren’t immune to this trend. Interest was waning, and this was mirrored in the falling fees on the network.\n\nThe decline in transaction fees indicates reduced activity and demand for Ethereum NFTs, suggesting that the once-booming market is losing its luster.\n\nWhat does the decline suggest?\n\nAs per Glassnode’s data, total fees paid plummeted to an 8-month low of 85.550 ETH. Reduced activity translates to reduced fees, pointing to a diminished appeal of Ethereum’s NFT offerings.\n\n? #Ethereum $ETH Total Fees Paid (7d MA) just reached a 8-month low of 85.550 ETH Previous 8-month low of 87.705 ETH was observed on 11 September 2023 View metric:https://t.co/wS0nd9YFUQ pic.twitter.com/ySzKH68ik4 — glassnode alerts (@glassnodealerts) September 18, 2023\n\nThis downturn wasn’t limited to NFTs alone; Ethereum’s price was on a decline over the past month. At present, it was trading at $1651, reflecting a notable drop. This price decrease affected the overall sentiment around Ethereum and its NFT market.\n\nAccompanying this price dip was a concerning trend in retail interest. Glassnode’s data revealed that the number of addresses holding 0.1+ Coins recently hit a 1-month low, signifying a falling retail presence in Ethereum.\n\nFewer retail investors may impact the broader adoption and popularity of the Ethereum network.\n\nRealistic or not, here’s ETH’s market cap in BTC’s terms\n\nTraders remain cautious\n\nTraders are navigating these uncertain waters, and the put-to-call ratio on most exchanges has experienced a decline. This ratio indicates the balance between options traders who are betting on a price increase (call options) and those betting on a price decrease (put options).\n\nConcurrently, Ethereum’s Implied Volatility (IV) was on the rise at press time. IV measures the market’s expectation of future volatility. An increase in IV suggests that market participants anticipate greater price fluctuations, which can be both an opportunity and a risk for traders."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vdS50b2RheS9idGMtZXRoLXdoYWxlcy1wbGF5aW5nLXdhaXRpbmctZ2FtZS1oZXJlcy1ob3fSAUFodHRwczovL3UudG9kYXkvYnRjLWV0aC13aGFsZXMtcGxheWluZy13YWl0aW5nLWdhbWUtaGVyZXMtaG93P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "BTC, ETH Whales Playing Waiting Game, Here's How - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAs lead cryptocurrencies Bitcoin and Ethereum continue to consolidate in a range, on-chain data offers a picture of what is likely going on with the group of large holders, or whales.\n\nAdvertisement\n\nOn-chain analytics firm Santiment paints a plausible picture of whales playing the waiting game in anticipation of higher prices in the days ahead.\n\n🐳 #Bitcoin continues to trade between $26K-$27K, and #Ethereum at $1.6K to 1.65K. #Crypto's top market caps' $100K+ transaction levels are at their lowest levels of 2023 right now. This is a sign of whales likely waiting, and not necessarily disinterest. https://t.co/FKfhB5X3Yh pic.twitter.com/m9990wqlpM — Santiment (@santimentfeed) September 18, 2023\n\nAccording to Santiment, large transactions, which refer to those greater than $100,000, are at their lowest levels so far in 2023. It was mentioned that this might be a sign of whales waiting for the best moment and not necessarily of disinterest, as some may think.\n\n\"Bitcoin continues to trade between $26K and $27K, and Ethereum is at $1.6K to 1.65K. Crypto's top market caps' $100K+ transaction levels are at their lowest levels of 2023 right now. This is a sign of whales likely waiting, and not necessarily disinterest,\" Santiment tweeted.\n\nAn albeit bullish scenario is playing out among long-term holders, whose numbers keep reaching new highs. Long-term Bitcoin hodlers, or those whose average purchase date is at least more than 155 days ago, now control 70% of the total supply of Bitcoin, or 14,787,265 BTC.\n\nAs the number of this category of Bitcoin holders continues to grow, top Bitcoin analyst Charles Edwards points out a trend of accumulation, saying, \"They are accumulating for the next bull run. \" Edwards also stated that over 57% of the Bitcoins on the network have not moved their capital in over two years.\n\nAt the time of writing, BTC was up 1.16% in the last 24 hours to $26,865. Recent analysis provided by crypto analyst Ali indicates that a boost in BTC buying pressure might target $28,000 or $31,000, whereas an invalidation of this bullish scenario might occur if BTC dips below $24,500.\n\nWhale places $150 million bullish bet on ETH\n\nAs reported by Wu Blockchain, the cumulative number of block calls traded for Ethereum has reached 92,600 ETH in the last 24 hours.\n\nIn just the past hour, over 40,000 ETH Block calls were traded, almost all buying 29DEC23-2200-C, and with the nearly 50,000 buying 27OCT23-2000-C last night, the cumulative number of block calls traded has reached 92,600 ETH. The whale actively bought $150 million worth of… — Wu Blockchain (@WuBlockchain) September 18, 2023\n\nAlso, a whale is trading a large number of call options. The said whale actively bought $150 million worth of notional ETH calls, and all of them were naked buys with clear long-term bullish expectations.\n\nAt the time of writing, ETH was trading in the green and was marginally up in the last 24 hours to $1,636."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1zdXJnZXMtYWJvdmUtMjY2MDAtZXRoZXJldW0taG9sZHMtMTYwMC1sZXZlbC9hcnRpY2xlc2hvdy8xMDM3NTEyNzMuY21z0gGYAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXN1cmdlcy1hYm92ZS0yNjYwMC1ldGhlcmV1bS1ob2xkcy0xNjAwLWxldmVsL2FtcF9hcnRpY2xlc2hvdy8xMDM3NTEyNzMuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin surges above $26,600; Ethereum holds $1,600 level - The Economic Times",
        "content": "ETMarkets.com\n\nThe crypto tokens were trading mixed in Monday's trade ahead of a key US Federal Reserve policy meeting later this week. Bitcoin, Ethereum, BNB , Solana and Litecoin were trading with gains, while XRP Dogecoin , Toncoin and Shiba Inu were trading with cuts.Bitcoin (BTC) rose 0.55% to $26,678, whereas Ethereum (ETH) was above the 1,600 level. Meanwhile, the global cryptocurrency market cap was trading higher, around $1.06 trillion, rising 0.29% in the last 24 hours.\"The weekend witnessed Bitcoin trading above the $26,000 level, possibly driven by a noteworthy collaboration between Deutsche Bank, Germany's leading bank, and Taurus, a Swiss cryptocurrency startup specializing in secure asset management and tokenization services,\" Edul Patel- CEO & Co-founder of Mudrex, said.\"Investors are awaiting the Federal Open Market Committee meeting scheduled for September 20, which may influence market dynamics. Bitcoin's next challenge is to surpass the $27,400 resistance level to maintain its upward momentum,\" Edul said.The total volume in DeFi is currently $2.14 billion, 11.27% of the total crypto market 24-hour volume. The volume of all stablecoins is now $16.79 billion, which is 88.6% of the total crypto market 24-hour volume.Bitcoin's dominance is currently 49.04%, according to CoinMarketCap. Meanwhile, BTC volume stood at approximately $7.6 billion, rising 14.17% in the last 24 hours.\"After three consecutive weeks of Doji candlestick patterns on the weekly Bitcoin chart, this week's positive close suggests a shift in favour of the bulls. However, the ongoing recovery remains in its early stages, and the Federal Open Market Committee meeting on September 20 could introduce volatility,\" said CoinDCX Research Team.Bitcoin is poised to conclude the week with gains, signalling a potential resolution of the ongoing uncertainty between buyers and sellers in favour of the bulls.On September 14th, Bitcoin managed to climb above the 20-day exponential moving average, currently situated at $26,303, which suggests a diminishing selling pressure. Since then, the bulls have successfully defended against multiple attempts by bears to drive the price below the 20-day EMA. While this recovery is still in its early stages, the upcoming Federal Open Market Committee meeting on September 20th could introduce additional volatility.BTC last week, again tested the critical support of $25,000 (Horizontal Trendline & 50% Fibonacci Retracement Level) as it made a low of $24,901. However, it failed to give a daily closing below the support and after that, the asset witnessed some recovery as it rallied up to $26,888 by forming four consecutive green candles.BTC has strong resistance at $28,500 and $32,500 and to catch a rally it needs to break, close and sustain above $32,500 whereas a break below the support of $25,000 will lead to further downfall.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tZXRoLWF0dGVtcHRzLXJlY292ZXJ5LWJ1dC10aGUtZG93bnNpZGUtcmVtYWlucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Attempts Recovery But the Downside Remains - Analytics Insight",
        "content": "Ethereum (ETH) is trading at $1,638, 0.3% over the last 24 hours and 5.6% on the week. The appearance of a Doji candlestick on the daily chart points to the ongoing battle for control between buyers and sellers. The intensity of this fight is reinforced by the increase in the daily trading volume which is up more than 56% on the day, according to data from CoinMarketCap.\n\nEthereum Faces Stiff Resistance at $1,700\n\nAfter establishing support at the $1,550 demand zone on Sept. 11, Ether began recovering, rising 7.7% to a high of $1,670 reached on Monday. The largest altcoin by market value has been consolidating below the $1,650 supplier zone over the past few days.\n\nThis consolidation is validated by the horizontal price action, the flattening of the moving averages, and the sideways movement of the Relative Strength Index (RSI). The price strength at 47 close to the middle line adds credence to the ongoing fight between the buyers and the sellers.\n\nEthereum’s ranging price action has traders frustrated, and whales are sitting on the sidelines biding their time. If the buyers win the ongoing fight, ETH could rise to confront resistance from the $1,700 resistance level, embraced by the SuperTrend indicator’s red line and the 50-day Simple Moving Average (SMA).\n\nETH/USD Daily Chart\n\nThe $1,700 supply zone appears to be a very tough barrier to overcome. The Ethereum price has been sealed below this level since mid-August. Support from the wider market would be needed to break this barrier.\n\nIf this happens, the 100-day SMA and the 200-day SMA at $1,783 and $1,802, respectively would be the next hurdles to overcome. Shattering these roadblocks would set ETH on a recovery path toward the coveted $2,000 psychological level.\n\nThe SuperTrend indicator was still negative since moving above the price on Aug. 17. Note that as long as this chart overlay indicator continues to close above the price, the overhead pressure will remain, pulling Ether lower and lower.\n\nAs such, a drop below the ascending trendline at $1,620 would suggest the inability of the buyers to sustain the higher levels. The resultant selling pressure could pull Etereum first toward the $1,550 support level and later to $1,500. This would represent an 8.5% drop from the current price.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9jcnlwdG8td2FsbGV0LXByb3ZpZGVyLWlzc3Vlcy1hbGVydC10by1ldGgtcG9seWdvbi1ob2xkZXJz0gFOaHR0cHM6Ly91LnRvZGF5L2NyeXB0by13YWxsZXQtcHJvdmlkZXItaXNzdWVzLWFsZXJ0LXRvLWV0aC1wb2x5Z29uLWhvbGRlcnM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Crypto Wallet Provider Issues Alert to ETH, Polygon Holders - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLedger, a cryptocurrency wallet provider, has issued an important alert to Ethereum, Polygon and Binance account holders.\n\nAdvertisement\n\nLedger warns this group of users to be on the lookout for scam \"voucher\" NFTs sent to their accounts. According to the cryptocurrency wallet provider, these contain malicious links designed to deceive users into disclosing their 24-word recovery phrase.\n\n🚨 Scam Alert 🚨\n\n\n\nWatch out for scam \"voucher \"NFTs sent to your #Ethereum, #Polygon, #BSC accounts. They carry malicious links designed to trick you into giving up your 24-word recovery phrase. NEVER share your phrase with anyone 🙅\n\n\n\nHow to stay safe:\n\n\n\n1- Do not try to send the… pic.twitter.com/4S3Ao7MDiO — Ledger Support (@Ledger_Support) September 19, 2023\n\nUsers may get unsolicited NFT airdrops that look to be vouchers, guaranteeing free money if redeemed on a third-party website, according to Ledger. It warns that these NFT vouchers are scams and frequently contain links to third-party websites.\n\nIn this scam, users are tricked into visiting third-party websites or apps where they will be asked to disclose their 24-word recovery phrase or sign a malicious transaction with their Ledger device, providing the scammer access to their accounts.\n\nWhat to do to stay safe\n\nLedger reminds users not to reveal their 24-word recovery phrase to anybody or type it onto any website or app. It also outlines steps for them to stay safe, such as not attempting to send or burn the NFT and instead simply right-clicking the NFT and selecting \"hidden.\"\n\nIn summary, users are to take the following steps when faced with an unwanted NFT voucher with links. The first step is to avoid any interaction with links or websites linked to the malicious NFT.\n\nSecond, the NFT should not be sent to another account or burner address. This necessitates contact with the underlying smart contract of the NFT, which could be malicious and compromise the user's account.\n\nLast but not least, conceal the NFT in Ledger Live by right-clicking on it and selecting \"Hide NFT Collection.\""
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vZGVjcnlwdC5jby9uZXdzLWV4cGxvcmVyP3Bpbm5lZD0zMTEyNDYmdGl0bGU9aG93LXNwaWRlcmNoYWluLXBsYW5zLXRvLWJ1aWxkLWV0aGVyZXVtLW9uLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 23:25:34 GMT",
        "title": "News Explorer — How ‘Spiderchain’ Plans to Build Ethereum on Bitcoin - Decrypt",
        "content": "Sep 18, 10:47 pm\n\nDecrypt\n\nHow ‘Spiderchain’ Plans to Build Ethereum on Bitcoin\n\nSpiderchain, a project developed by Botanix Labs, aims to unlock Bitcoin's programming potential by creating a 2-way pegged sidechain. The Spiderchain operates as a Proof of Stake Layer 2 on Bitcoin, allowing users to stake Bitcoin on Bitcoin in decentralized multisigs. It is Ethereum Virtual Machine-compatible and offers scalability, programmability, and privacy features similar to Ethereum."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDkvMTkvaW5qZWN0aXZlLWFuZC1jYWxkZXJhLXBhcnRuZXItZm9yLWluZXZtLWxheWVyLTItZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Injective and Caldera Partner for inEVM Layer 2 Ethereum - Crypto Times",
        "content": "A Cosmos-based Layer 1 blockchain, Injective, has partnered with Caldera to launch the inEVM Layer 2 Solution, which utilizes the Ethereum Virtual Machine (EVM). This initiative aims to enhance transaction speed and compatibility for Ethereum developers while also expanding opportunities within the Injective network.\n\n1/ Injective today is introducing the launch of inEVM, the first-ever Ethereum Virtual Machine capable of achieving true composability across @cosmos and @solana.https://t.co/WJcrW6REiT — Injective 🥷 (@Injective_) September 19, 2023\n\nThe main advantages of inEVM are speed, quick transaction confirmation, flexibility, shared liquidity, and compatibility with Cosmos and Solana. This release follows Injective’s launch of inSVM, a Solana Virtual Machine rollup solution, allowing Solana developers to expand their reach without major code changes.\n\nA spokesperson stated, “inEVM is part of Injective’s larger plan to introduce a network of Electro Chains. In essence, this consists of a series of rollups with dedicated VM environments that would cater to the needs of distinct builders while still providing the highest levels of scalability and security,”\n\nWith inEVM, decentralized applications (dApps) can seamlessly migrate on Cosmos and Solana apps, streamlining development and interoperability across various virtual machines.\n\nInjective’s goal is to make Web3 technology more user-friendly and collaborative, fostering decentralization in the blockchain realm. They also have plans to introduce innovative solutions like Altlayer and Espresso Systems to further decentralize their network."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3VudmVpbGluZy1iaXRjb2luLXNwYXJrLXRoZS1uZXh0LWJpZy1wbGF5ZXItYWZ0ZXItYml0Y29pbi1hbmQtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Unveiling Bitcoin Spark: The Next Big Player After Bitcoin and Ethereum - Analytics Insight",
        "content": "Cryptocurrencies have reshaped the entire DeFi ecosystem since Bitcoin rose to fame in 2013. The crypto platform is widely known for its lucrative uncontrolled perks, making it the ideal antithesis of modern-day banking systems. Although Bitcoin is the most prominent digital asset in popularity and market capitalization, the platform has a docile network with high transaction fees, low transaction speeds, and limited scalability. Other platforms, such as Ethereum and Bitcoin Spark, have emerged to bring further decentralization in finance and solve some of the significant Bitcoin shortcomings.\n\nWhat is Ethereum?\n\nEthereum is an old-generation blockchain pioneered after Bitcoin was invented to offer a suitable alternative to Bitcoin’s limited network. Ethereum started as a proof-of-work blockchain, mimicking Bitcoin’s network validation process. Proof of work is a heavyweight network verification process that consumes much energy and involves a high initial outlay. Ethereum successfully underwent a major hard fork upgrade in September 2022, transitioning to a proof of stake consensus, a network verification that is less complicated and eco-friendly.\n\nBitcoin Spark is the next Big crypto platform\n\nBitcoin and Ethereum paved the way for the growth of decentralized finance projects. Among the upcoming platforms is Bitcoin Spark, a major Bitcoin hard fork potentially bringing massive changes to the industry. Bitcoin Spark has a new consensus mechanism called proof of process that leverages proof of work and proof of stake consensus mechanisms to enhance network operations for Bitcoin Spark users. In other words, the network accommodates both mining and staking activities, and the network participants are rewarded in the platform’s native digital asset, BTCS.\n\nThe Bitcoin Spark network is still under development and is expected to go live on the mainnet soon after the ongoing ICO ends. The network’s “proof of work” aspect will be the primary validation process that will provide processing power to the network. Unlike Bitcoin, BTCS mining has a reduced mining power consumption rate required to confirm new Bitcoin Spark blocks.\n\nFor parties interested in beginning the mining process, the Bitcoin Spark devs will launch an online application tool that will allow them to calculate the estimated returns. The Bitcoin Spark network is divided into four layers. First is the execution layer, which is where the creation of a block takes place. This layer will operate on the Bitcoin Spark validator blueprint.\n\nThe second layer is the consensus layer, which mediates between all validator nodes to come up with an agreement concerning the validity of a block. The third layer is the mining layer. This layer runs independently from other layers. The mining layer’s output yields the platform processing power helpful in completing virtual complex tasks such as film rendering. The last layer is the rewards layer. This layer gets information from the mining layer’s computational data summaries but lacks access to encrypted data encoded on the Bitcoin Spark blocks.\n\nBitcoin Spark is a utility platform with an ongoing ICO event. The team is currently distributing BTCS tokens to early enterprising individuals who wish to participate in the project’s early development as well as get significant gains on their invested capital. BTCS is retailing for $2.50 each in the current 5th ICO stage.\n\nLearn more about Bitcoin Spark on:\n\nWebsite: https://bitcoinspark.org/\n\nBuy BTCS: https://network.bitcoinspark.org/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2RpZC15b3UtbWlzcy1vdXQtb24tdGhlLWNyeXB0by1ib29tLXRoZXNlLWNyeXB0b3Mtd2lsbC1oZWxwLWV0aGVyZXVtLXNoaWJhLWludS1ldmVybG9kZ2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Did You Miss Out on the Crypto Boom? These Cryptos Will Help: Ethereum, Shiba Inu, Everlodge - Analytics Insight",
        "content": "We all know stories of people that became millionaires thanks to buying Bitcoin or other altcoins in the past, but did you know that it’s not too late to make big profits? Read on to find out more about why Ethereum, Shiba Inu and Everlodge have the potential to skyrocket your portfolio.\n\nJoin the Everlodge presale and win a luxury holiday to the Maldives\n\nEthereum is the Key to Web3\n\nIf Bitcoin is digital gold, then Ethereum is the digital computer. But what does this mean?\n\nWell, as Ethereum has the ability to run smart contracts it means that it is more than just a currency, in fact its in a large part the basis for web3. And web3 is the future of the internet.\n\nWeb3 allows for decentralized applications, financial services, games, social networks, and more that don’t rely on centralized servers and providers.\n\nFor example, musicians could directly sell tickets and music to fans without middlemen taking cuts. And people can have access to financial services that aren’t offered by their banks due to red tape or geographical location.\n\nThe majority of projects either run on Ethereum, or use Ethereum as a base for their Layer 2 blockchain solutions, meaning that Ethereum is vital for web3.\n\nAs one of the biggest and most decentralized projects using blockchain technology, in the next bull run, Ethereum is set to make higher highs than ever before.\n\n🔥 Stage 3 Presale Alert!🔥\n\nHeads up, Lodgers!\n\nStage 3 Presale is LIVE and already over 22% filled! 🚀\n\nCurrent Price: $ELDG = $0.018.\n\nDon’t miss your chance to be part of our groundbreaking journey!💸\n\nJump in before it’s too late!\n\nJoin Now: https://t.co/SIYWBylwQD#Presale pic.twitter.com/Hb2yuEZkH1 — Everlodge (@EverlodgeHQ) September 18, 2023\n\nThe People’s Crypto Choice is Shiba Inu\n\nFor some, the meme coin Shiba Inu seems like a whimsical project. But for fans of the coin, known as the Shibarmy, Shiba Inu is the currency that we will all be using in the future.\n\nEven if you aren’t a Shiba Inu maxi, the fact is that this is one of the key coins that the general public turn to when crypto enters a bull market. By entering now, holders can seek to profit off the gains created by the new adopters in the next bull run cycle.\n\nAlso Shiba Inu does have real utility, having built a layer 2 blockchain that is based on Ethereum. This means that Ethereum secures the network whilst allowing for scalability and low transaction fees, as opposed to Ethereum’s very high gas fees.\n\nEverlodgewill change property investing for the better\n\nEverlodge is another project built on Ethereum, therefore also benefiting from the security of the network. Everlodge is new and in presale, which means that it has huge potential for growth, due to its newness and low market cap.\n\nEverlodge is part of web3’s financial inclusion. They want to give ordinary investors the opportunity to co-invest in luxury holiday properties around the world, such as a villa in the Caribbean or a hotel chain in upstate New York.\n\nThey will do this by creating a digital asset that represents the property, using NFT technology. They will then offer their community to buy shares or even the entire property, and each buyer will receive an NFT to legally represent their asset. The benefits of this are twofold, firstly, investors can benefit from capital appreciation of their properties, and secondly they can receive a share of rental income.\n\nEverlodge’s token is called ELDG and is currently in the 3rd phase of presale at $0.018. With several stages still to go, now is an excellent time to get into this token, especially since crypto analysts are predicting that it will rise over a dollar once it goes live on a CEX and DEX.\n\nFind out more about the Everlodge (ELDG) Presale\n\nWebsite: https://www.everlodge.io/\n\nTelegram: https://t.me/everlodge\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LnRla2VkaWEuY29tL2V0aGVyZXVtLWNvLWZvdW5kZXItYmFja3MtZXRoZXJldW0tc2NhbGluZy1uZXR3b3JrLWxheWVyLW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Ethereum Co-founder backs Ethereum scaling network Layer N - Tekedia",
        "content": "Layer N, a decentralized network that aims to improve the scalability and performance of Ethereum, has raised $20 million in a Series A funding round led by Founders Fund, the venture capital firm founded by Peter Thiel. The funding round also saw participation from other prominent investors, such as Polychain Capital, Coinbase Ventures, Pantera Capital, and Framework Ventures.\n\nLayer N is based on the concept of sharding, which divides the network into smaller and parallel shards that can process transactions faster and cheaper than the main chain. Layer N also supports cross-shard communication and cross-chain bridges, enabling seamless interaction between different shards and other blockchains.\n\nEthereum 2.0 is the upcoming upgrade of the Ethereum network, which also adopts sharding as a scalability solution. Ethereum 2.0 will consist of a main chain called the Beacon Chain, which coordinates the activity of 64 shards, and a set of execution layers, which run the smart contracts and state transitions. Ethereum 2.0 will also introduce proof-of-stake as a consensus mechanism, replacing the current proof-of-work system.\n\nHow does Layer N compare to Ethereum 2.0? we will explore some of the similarities and differences between the two platforms and discuss their advantages and disadvantages for developers and users.\n\nSimilarities:\n\nBoth Layer N and Ethereum 2.0 use sharding as a way to increase the throughput and scalability of the network. Sharding allows parallel processing of transactions, reducing congestion and fees on the main chain.\n\nBoth Layer N and Ethereum 2.0 support cross-shard and cross-chain communication, enabling interoperability between different shards and other blockchains. This allows for more complex and diverse applications that can leverage the strengths of different platforms.\n\nBoth Layer N and Ethereum 2.0 are compatible with the Ethereum Virtual Machine (EVM), which means that existing smart contracts and tools can be easily ported to either platform. This lowers the entry barrier for developers and users who want to migrate or experiment with new platforms.\n\nDifferences:\n\nLayer N uses a hybrid consensus model that combines proof-of-work and proof-of-stake, while Ethereum 2.0 uses pure proof-of-stake. Proof-of-work is a more secure but more energy-intensive way of validating transactions, while proof-of-stake is a more efficient but less decentralized way of reaching consensus. Layer N claims that its hybrid model offers the best of both worlds, balancing security and efficiency, while Ethereum 2.0 argues that proof-of-stake is sufficient for ensuring security and decentralization.\n\nLayer N has a fixed number of shards (128), while Ethereum 2.0 has a variable number of shards (64 initially but can change dynamically). Layer N claims that its fixed sharding scheme simplifies the design and implementation of the platform, while Ethereum 2.0 claims that its variable sharding scheme allows for more flexibility and adaptability to changing network conditions.\n\nLayer N has a native token called LYN, which is used for paying fees, staking and governance, while Ethereum 2.0 uses ETH as its native token for the same purposes. LYN is a new token that has to establish its value and utility in the market, while ETH is an established token that has a large and loyal user base.\n\nLayer N is one of the projects that leverages the concept of rollups, a layer 2 solution that bundles multiple transactions into a single one and executes them on a sidechain, before settling them on the main Ethereum chain. This reduces the congestion and fees on the Ethereum network, which has been struggling to cope with the high demand from various applications, especially decentralized finance (DeFi) and non-fungible tokens (NFTs).\n\nLayer N claims to offer a unique approach to rollups, by combining zero-knowledge proofs (ZKPs) and optimistic rollups. ZKPs are cryptographic techniques that allow users to prove the validity of their transactions without revealing any details, while optimistic rollups assume that transactions are valid unless someone challenges them. Layer N says that its hybrid solution can achieve higher throughput, lower latency, and better security than other rollup implementations.\n\nLayer N also boasts a strong team of developers and researchers, who have contributed to various projects in the Ethereum ecosystem, such as Optimism, StarkWare, and zkSync. The team says that it plans to use the new funding to expand its team, launch its mainnet, and onboard more partners and users.\n\nFounders Fund partner Brian Singerman said that he was impressed by Layer N’s vision and technology, and that he believes that layer 2 solutions are essential for the future of Ethereum.\n\n“We are excited to back Layer N as they build a scalable and secure layer 2 network for Ethereum. Layer N’s hybrid approach to rollups is innovative and promising, and we think it will enable more developers and users to benefit from the power of Ethereum,” Singerman said.\n\nLayer N co-founder and CEO Daniel Wang said that he was grateful for the support from Founders Fund and other investors, and that he hopes to make Ethereum more accessible and affordable for everyone.\n\n“We are thrilled to have Founders Fund as our lead investor, as they share our vision of creating a more open and decentralized web. Layer N is committed to solving the scalability and usability challenges of Ethereum, and to bring the benefits of blockchain technology to the masses,” Wang said.\n\nLayer N and Ethereum 2.0 are both ambitious projects that aim to bring blockchain technology to the next level. They share some common features, such as sharding and interoperability, but also have some distinct differences, such as consensus mechanism and sharding scheme. Depending on their preferences and needs, developers and users may choose one platform over the other, or use both platforms in conjunction. Ultimately, both platforms will contribute to the innovation and diversity of the blockchain ecosystem.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aC1idXJucy01bS14bG0tYWRhLWFuZC1yb2UtZ2F0aGVyLWJ1bGxpc2gtc3RlYW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "$ETH Burns $5M; $XLM, $ADA, and $ROE Gather Bullish Steam - Analytics Insight",
        "content": "The cryptocurrency market has recently witnessed a whirlwind of events, leaving investors on the edge of their seats. Ethereum ($ETH) made headlines as it burned a staggering $5 million worth of its native currency, while alternative cryptocurrencies like Stellar ($XLM), Cardano ($ADA), and the emerging star Borroe.Finance ($ROE) have been steadily gaining momentum. In the dynamic world of crypto, these developments are driving the search for the best altcoin to buy. Let’s explore these exciting trends!\n\n>>BUY $ROE TOKENS NOW<<\n\nEthereum’s Remarkable $5 Million Burn\n\nOn a notable Tuesday, Ethereum experienced an extraordinary event. A total of 3,292.33 Ether (ETH), equivalent to an impressive $5 million was deliberately burned as part of Ethereum transactions. Burning in the crypto realm refers to the process of sending a coin or token to an unusable wallet, effectively removing it from circulation.\n\nWhy Ethereum’s Burn Matters\n\nThis substantial Ethereum burn stems from Ethereum Improvement Proposal 1159 (EIP-1159), which was implemented on August 5th, 2021. This Ethereum upgrade drastically transformed the fee model.\n\nNow, each transaction includes a variable base fee that adjusts according to the current demand for block space. What sets this apart is that this base fee is permanently removed from circulation, reducing the overall supply of Ether. This mechanism has far-reaching implications for Ethereum’s scarcity, potentially affecting its long-term value.\n\nBorroe.Finance ($ROE): The Best Crypto Investment Opportunity\n\nAmid these significant developments, Borroe.Finance ($ROE) stands out as a promising crypto project, positioning itself as the best crypto investment in the evolving crypto landscape. Borroe.Finance is a unique initiative dedicated to transforming the Web3 space, built on Polygon, a layer-2 blockchain lauded for its robust privacy features.\n\nBorroe.Finance introduces a revolutionary marketplace where the Web3 community can convert their future recurring income into Non-Fungible Tokens (NFTs), which are available for sale at discounted rates to buyers seeking upfront cash with full repayment on a fixed date.\n\nThis innovative platform integrates AI-powered risk assessment, secure blockchain technology, and streamlined payment solutions, facilitating a secure and efficient fundraising process. By enabling buyers to effortlessly sell and trade future recurring revenue NFTs directly with each other on secondary markets, Borroe.Finance fosters a truly peer-to-peer ecosystem.\n\n>>BUY $ROE TOKENS NOW<<\n\nInnovative Fee Structure for Long-Term Growth\n\n$ROE, the native token of Borroe.Finance, features a distinctive fee structure designed to incentivize responsible investment. It includes a 3% buy tax, with allocations of 1% towards burning, 1% for rewarding stakeholders, and 1% dedicated to marketing efforts. Additionally, a 3% sell tax encourages long-term holding, ensuring the sustainability and growth of the $ROE ecosystem.\n\nThe Borroe.Finance team is led by industry experts, including Michael Price, a former VP at XE.com, and Maxim Prishchepo, a respected figure in the blockchain space with extensive experience in tier 1 projects.\n\nThis transparent and credible leadership sets Borroe.Finance apart from projects with anonymous teams, instilling confidence and trust among investors. Furthermore, Borroe.Finance’s code has undergone rigorous auditing by Block Audit, one of the leading smart contract auditing platforms, ensuring the safety of all users.\n\nDon’t Miss Out on Borroe.Finance Presale\n\nBorroe.Finance is currently in the first stage of its presale, generating immense excitement among investors. Priced at a competitive rate of just $0.0125 per token, $ROE has captured the attention of investors seeking the best crypto to buy today.\n\nWith over 70 million $ROE tokens already sold during the presale, the funds raised will be dedicated to building a robust ecosystem and delivering utility to $ROE holders. To foster inclusivity, Borroe.Finance has significantly lowered the entry barriers to the presale, enabling anyone to participate in this exceptional opportunity.\n\nMoreover, multiple payment methods, including Bitcoin (BTC), Ethereum (ETH), and Binance Coin (BNB), have been integrated to accommodate a diverse range of crypto communities.\n\nExploring Stellar Lumen (XLM)\n\nStellar Lumen (XLM) is another altcoin that has caught the attention of investors. This cryptocurrency has been gaining ground due to its unique features and robust technology. In the next section, we will delve deeper into why investors are bullish on Stellar and what sets it apart in the crypto market.\n\nThe Appeal of Cardano ($ADA)\n\nCardano ($ADA) is yet another cryptocurrency that has garnered considerable interest. Its innovative features and the potential to revolutionize various industries have made it a top contender in the crypto space. We will explore the reasons behind the bullish sentiment surrounding Cardano in the following section.\n\nAs the crypto market continues to evolve and present new opportunities, Ethereum’s burn, alongside the rising prominence of alternative cryptocurrencies like Stellar ($XLM), Cardano ($ADA), and Borroe.Finance ($ROE), showcases the dynamic nature of this financial landscape.\n\nInvestors keen on identifying the best crypto investments and top altcoins to buy are in for an exciting journey filled with potential rewards.\n\nLearn more about Borroe.Finance ($ROE) here:\n\nVisit Borroe Presale | Join The Telegram Group | Follow Borroe on Twitter\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzMtYWx0Y29pbnMtbm90LWFmZmVjdGVkLWJ5LWJpdGNvaW4tYW5kLWV0aGVyZXVtcy10dXJidWxlbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "3 Altcoins Not Affected By Bitcoin and Ethereum's Turbulence - Analytics Insight",
        "content": "The crypto market, synonymous with its volatile price swings, often sees the best cryptocurrencies like Bitcoin and Ethereum taking a fair share of attention. When they move, it’s typical for the rest of the market to follow suit. However, there are a few top altcoins that continue to march ahead, seemingly unaffected by the overall turbulence. Let’s figure out what they bring to the table.\n\nInQubeta (QUBE): Connecting Investors to AI Startups\n\nLeading the pack of these resilient altcoins is a new ICO: InQubeta. The visionary platform has successfully carved its niche in the world of AI technology, showcasing the vast potential for growth and innovation. By allowing fractional investment in budding AI start-ups using QUBE tokens, InQubeta is on a mission to make AI start-up investments accessible to all. Opportunities are minted into equity-based NFTs so that everyone can own a piece of action, regardless of their budget.\n\nThe deflationary ERC20 QUBE token isn’t just another crypto to buy. With a 2% buy and sell tax directed to a burn wallet and an additional 5% sell tax channeled to a reward pool, QUBE offers a lucrative investment opportunity. Stakers are well rewarded, making it a top crypto coin for those bullish on the future of AI start-ups. The ongoing presale has already crossed over $3 million and the hype level is high.\n\nInjective Protocol (INJ): A Decentralized Evolution\n\nNext on the list is Injective Protocol. As a DEX, it’s uniquely positioned in the market by offering a range of financial instruments, including margin trading, derivatives, and even forex futures trading. Instead of the popular automated market maker (AMM) formula, Injective employs the traditional order book model, seamlessly merging the efficiency of traditional finance with the inherent transparency of decentralized platforms.\n\nWhat’s more, the INJ coins, pivotal to the Injective ecosystem, ensure that users avoid the high network gas fees that plague other platforms. Serving not only as the medium for paying market maker and taker fees, INJ also underpin the platform’s governance structure. With staking mechanisms supporting Injective’s Proof of Stake blockchain, it’s evident why INJ remains undeterred by market storms.\n\nTon (TONCOIN): The Community-Driven Blockchain Marvel\n\nLast but certainly not least, we have Ton, or TONCOIN. Billed as a community-centric blockchain, Ton’s flexibility and consumer-focused approach set it apart. At its core, TONCOIN serves the role of settling payments and validating transactions. Users enjoy the luxury of swift, transparent, and reliable payment services, all while benefiting from minimal transaction fees.\n\nLeveraging the proof-of-stake (PoS) consensus model, Toncoin ensures its network remains scalable and dependable. By promoting transactions with minimal fees and supporting third-party applications, Toncoin exemplifies how a token can stay resilient amidst larger market volatility.\n\nConclusion\n\nWhile the likes of Bitcoin and Ethereum often dictate market sentiments, it’s essential not to overlook the altcoins that remain steadfast in their missions. InQubeta, with its innovative approach to democratizing AI start-up investments; Injective Protocol, marrying traditional finance with decentralized transparency; and Toncoin, a community-first blockchain solution, serve as shining examples of this resilience.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnByZW1pdW10aW1lc25nLmNvbS9wcm9tb3RlZC82MjY4Mjctd2hhdC1hcmUtdGhlLW1vc3QtZmFtb3VzLWNyeXB0b2N1cnJlbmNpZXMtYW5kLWJsb2NrY2hhaW5zLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "What are the most famous cryptocurrencies and blockchains? - Premium Times",
        "content": "As the crypto market continues to expand, an array of unique digital assets has emerged, each with its distinct features and applications. This exploration unravels the diverse universe of cryptocurrencies, from Bitcoin to Tether. There is a crypto asset for everyone!\n\nWhat are cryptocurrencies?\n\nAt their core, cryptocurrencies are digital or virtual currencies that use cryptography for security.\n\nUnlike traditional money, cryptocurrencies exist purely in digital form. They’re stored in online ledgers, known as blockchains. From Bitcoin to BNB, each cryptocurrency operates on its unique blockchain, a decentralised and immutable ledger that records all transactions made with that cryptocurrency.\n\nMost famous cryptocurrencies\n\nBitcoin (BTC)\n\nComprehending Bitcoin as a digital currency may seem straightforward. For instance, you can use your cryptocurrency wallet to make fractional payments with Bitcoin. Its underlying operational intricacies unveil a profound complexity when scrutinised.\n\nThis financial concept is unique. It allows transactions without a central authority. It removes the need for intermediaries in financial dealings. It rewards blockchain miners who validate transactions and are accessible through various exchange platforms.\n\nOne intriguing aspect of Bitcoin is its divisibility. The smallest unit, a “satoshi,” represents one hundred millionths of a single Bitcoin. Bitcoin could be divided into smaller units if needed and agreed upon by miners.\n\nA new kind of money called cryptocurrency started in 2009. An anonymous person has been given the name, Satoshi Nakamoto. Since then, it’s risen to unparalleled fame. Gaining recognition as the most renowned cryptocurrency globally, many other blockchain networks and financial technologies have been created to compete with it.\n\nEthereum (ETH)\n\nThe beauty of Ethereum lies in its accessibility. You can create an Ethereum account anytime and anywhere. The key innovation lies in the absence of reliance on a central authority that could alter the rules or limit your access.\n\nEthereum operates devoid of dominance by any singular entity. The Ethereum blockchain forms when computers follow the Ethereum protocol and run software together. Each of these machines assumes the role of a node, a task open to anyone, with a caveat. Participation in securing the network necessitates staking ETH, Ethereum’s native token. Anyone can achieve this by having 32 ETH without needing prior authorisation.\n\nEthereum is a vast global network comprising computers distributed worldwide. It’s adhering to a predefined rule set, known as the Ethereum protocol. This network is the foundation for communities, applications, entities, and digital assets that people can create and use.\n\nEven the Ethereum source code doesn’t originate from a solitary entity. It’s open to suggestions for protocol modifications and welcomes discussions on enhancements. Diverse implementations of the Ethereum protocol emerge from independent organisations, employing many programming languages. These implementations typically evolve transparently, fostering contributions from the wider community.\n\nTether (USDT)\n\nTether finds its niche within the burgeoning stablecoin category. Tether’s primary goal is stabilising its token’s value by tying it to traditional currencies like the U.S. dollar.\n\nTether extends its influence by issuing tokens linked to the euro, offshore Chinese yuan, the Mexican peso, and even precious gold. However, these alternate pegged tokens pale compared to the widespread market dominance of its USDT tokens, anchored to the U.S. dollar.\n\nLitecoin (LTC)\n\nIn blockchain technology, a block serves as a repository for transaction data. Verifying these blocks occurs via mining software, rendering them accessible to any network participant, termed a miner. The subsequent block in the chain is forged after successful verification, and Litecoin is granted as a reward.\n\nLitecoin started its journey to stop big mining companies from controlling the mining process. It did this by using a different encryption method. Yet, these enterprising miners swiftly adapted their specialised hardware, steadily expanding their mining capabilities.\n\nDespite being unable to stop miners from taking control of Litecoin mining, this digital currency has become a mineable asset. It also functions as a decentralised peer-to-peer payment system.\n\nLitecoin (LTC) emerged as a cryptocurrency from a Bitcoin blockchain fork in 2011. At first, it was made to address worries about Bitcoin being too centralised. It also aimed to prevent big mining companies from having too much power.\n\nRipple (XRP)\n\nXRP, a digital currency, operates atop the XRP Ledger. This’s a blockchain conceived by the minds of Arthur Britto, Jed McCaleb, and David Schwartz. McCaleb and Britto would later establish Ripple, harnessing XRP’s capabilities to streamline transactions within the network.\n\nXRP can serve various purposes:\n\n● An investment vehicle.\n\n● A cryptocurrency for exchange with others.\n\n● A means to facilitate transactions within the Ripple network.\n\nUnlike other networks, Ripple is somewhat centralised and uses a consensus protocol to function. Although anyone can use the validation software, it also offers exclusive node lists.\n\nUsers can pick these lists to verify transactions and choose participants who are least likely to commit fraud.\n\nDistinguishing itself from the conventional cryptocurrency landscape, XRP’s blockchain adopts a unique approach. XRP uses a security mechanism. Ledger holders must reach a consensus for transaction validation.\n\nValidators check their ledgers every three to five seconds to verify new transactions against each other. Any discrepancies trigger investigations to pinpoint the source of the issue. The careful process ensures secure and efficient transaction validation, making XRP different from Bitcoin.\n\nCardano (ADA)\n\nCardano, a prominent player in the cryptocurrency market, ranks among the largest by market capitalisation. The Ethereum concept has evolved into something visionary. It now has a blockchain that is flexible, sustainable, and scalable. The blockchain is perfect for smart contracts and opens new possibilities in finance, tokens, and games.\n\nLike Ethereum’s native cryptocurrency, ETH, Cardano’s blockchain features ADA as its native digital currency. ADA is available for purchase or sale through platforms like Coinbase. ADA serves multifaceted roles:\n\n● Value storage\n\n● Potential inclusion within investment portfolios\n\n● Making of payments\n\n● Participation in staking\n\n● Covering transaction fees within the Cardano network.\n\nEOS (EOS)\n\nEOS enables people and businesses to build blockchain apps, like web apps. EOS provides a range of features like secure access, authentication, permissions, data hosting, and communication channels. These features help the app’s interaction with the internet.\n\nThe EOS project gets help from a web toolkit repository. This helps make creating applications easier.\n\nAt the heart of the EOS ecosystem lie two pivotal components: EOS.IO software and EOS tokens:\n\n● EOS.IO assumes the role of an operating system analogous to a computer’s OS. The\n\nEOS blockchain network is managed and supervised by it. It uses blockchain\n\narchitecture to help apps scale vertically and horizontally.\n\n● The EOS token functions as the primary cryptocurrency within the EOS network.\n\nDevelopers can use network resources and create and run dApps with just EOS coins, saving\n\nmoney. Token holders who aren’t actively involved in app deployment can share their bandwidth\n\nwith others.\n\nBNB\n\nOriginally, Binance Coin (BNB) operated on the Ethereum blockchain. It adheres to the ERC-20 standard. Yet, it subsequently transformed into the primary cryptocurrency native to the Binance chain. Its genesis traces back to an initial coin offering (ICO) staged in July 2017, characterised by a fixed upper limit of 200 million BNB tokens.\n\nA substantial portion of the capital amassed through the ICO served multiple purposes. Nearly half was earmarked for fueling Binance’s branding and marketing initiatives, while roughly one-third was allocated to the development and enhancement of the Binance platform, instigating pivotal upgrades to the broader Binance ecosystem.\n\nInitially rooted in the Ethereum network, BNB has since transitioned into the principal currency native to Binance’s proprietary blockchain – the Binance chain.\n\nCrypto benefits\n\nCentral banks and governments control traditional currencies. Cryptocurrencies, on the other hand, are decentralised. This means that no single entity has complete control over them.\n\nTransactions are peer-to-peer. No intermediary, like a bank, is needed.\n\nCryptocurrencies use special codes to keep transactions safe and control making new units.\n\nThis makes fraud and hacking much more challenging. All transactions made with cryptocurrencies are recorded on a public ledger, making them transparent and verifiable.\n\nCryptocurrencies know no borders. They can be sent and received anywhere worldwide, making cross-border transactions faster and cheaper. When you own cryptocurrencies, you have complete control over your funds.\n\nYou’re not reliant on a bank to access your money.\n\nThe wider cryptocurrency landscape\n\nBeyond these popular cryptocurrencies, the crypto landscape is vast and diverse. Thousands of other cryptocurrencies exist, each with unique features and use cases. Some cryptocurrencies focus on privacy, while others emphasise scalability or environmental sustainability.\n\nInvesting in cryptocurrencies: A word of caution Before diving into the world of cryptocurrencies, it’s essential to approach it with caution:\n\nVolatility: Cryptocurrency prices can be highly volatile, leading to significant gains or losses.\n\nResearch: Thoroughly research any cryptocurrency you plan to invest in, including its technology, team, and use cases.\n\nSecurity: Use secure wallets and good security hygiene to protect your investments.\n\nCrypto’s impact on the future\n\nCryptocurrencies are not just a financial asset. They represent a technological and social shift that has the potential to disrupt traditional economic systems. Central Bank Digital Currencies (CBDCs) are emerging as a response to the crypto revolution. They blur the lines between traditional finance and the digital world.\n\nConclusion\n\nThe world of different cryptocurrencies is a fascinating and rapidly evolving ecosystem. Their innovations know no bounds. These digital assets, with their unique characteristics and applications, continue to reshape the landscape of finance and technology.\n\nShare this: Twitter\n\nFacebook\n\nWhatsApp\n\nTelegram\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDkvMTkvcG9zaXRpdmUtcHJlZGljdGlvbnMtcHJpY2UtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Positive predictions on the price of Ethereum - The Cryptonomist",
        "content": "Positive price predictions for Ethereum (ETH) are beginning to circulate.\n\nAlthough ETH, like the entire crypto market, is also affected by Bitcoin’s four-year cycle, historically it has often performed better in terms of price during bull runs.\n\nTypically, during bear-markets ETH suffers more than BTC, and during crypto winters it performs significantly worse than the world’s leading cryptocurrency. However, it then recovers during bull-runs.\n\nEthereum: past cycle performance and future price predictions\n\nFor example, during the previous cycle’s bear-market, i.e., that of 2018, Ethereum’s price performance had been close to -95%, compared to a -85% for Bitcoin. And during last year’s bear-market, compared to a -77% of BTC, ETH scored -82%.\n\nAll this despite the fact that in 2022 there was the Ethereum Merge, which is the replacement of Proof-of-Work with Proof-of-Stake that made ETH a deflationary currency.\n\nHowever, if we look at the bull run, in 2021 ETH made +4,000% from the lows of the previous cycle, compared to +1,500% for BTC.\n\nSo it certainly seems that greater declines during bear-markets also mean greater rises during bull runs.\n\n2023\n\nRight now, compared to the beginning of the year, the price of Ethereum is up only 37%, after -82% during the bear-market, while Bitcoin is already +63%.\n\nIn particular, if in January both ETH and BTC prices made a strong rebound, already in March the second rebound of the year was greater for Bitcoin than Ethereum.\n\nApart from the brief interlude in mid-April with the Shapella update, ETH’s 2023 has been underperforming compared to BTC, such that even the third rebound, in June, was much more pronounced for Bitcoin’s price than Ethereum’s.\n\nIn terms of declines, on the other hand, they more or less equaled each other, so if during the bear-market Ethereum’s price fell more, during the rest of the crypto winter it rose somewhat less.\n\nThe state of the Ethereum network and the outlook for its price\n\nOne thing that bodes well for the future, however, is the state of the Ethereum network.\n\nIndeed, as the latest Bitfinex Alpha report points out, Ethereum’s second layers are experiencing a substantial increase in activity, coming to process transactions overall at five times the rate of the main network.\n\nThis should increasingly lead to improvements in network scalability, and especially in the performance of Ethereum-based applications.\n\nThe Total Value Locked (TVL) of the Ethereum blockchain has remained stable at $21.45 billion, in recent times, but the total value of the second layers has more than doubled to $9.56 billion. These are still distant numbers, but getting closer.\n\nThe hypothesis that in the event of a bull run the price performance of ETH could once again outperform that of Bitcoin is based primarily on the increased use, and thus adoption, of Ethereum. To achieve this requires second layers to enable as many people as possible to transact faster and faster, and especially at lower costs.\n\nFor example right now the average cost of a transaction recorded on the Bitcoin blockchain is less than $2, while on the Ethereum blockchain it turns out to be over $3.5. In other words, currently on-chain transactions on the Ethereum network cost almost twice as much as those on the Bitcoin network, and this is despite Ethereum’s move to PoS.\n\nThe future of the network therefore runs precisely through second layers.\n\nThe comment\n\nBitfinex analysts commented on the report saying:\n\n“Over the last week, the Ethereum chain has gained $17.4 million alone. Ethereum has also been deflationary since the beginning of the year and is being perceived as a solid investment. August saw the burning of 72,117 ETH, which equates to a substantial $126.5M."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMDkvZm9ybWVyLWdvbGRtYW4tc2FjaHMtZXhlYy1tYWtlcy1idWxsaXNoLWNhc2UtZm9yLXNvbGFuYS1zb2wtaGlnaGxpZ2h0cy1pdHMtcG90ZW50aWFsLWFzLWFuLWV0aGVyZXVtLXJpdmFsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Raoul Pal's Bullish Outlook on Solana: A Strong Ethereum Competitor - CryptoGlobe",
        "content": "In a recent interview with Altcoin Daily, Raoul Pal, the founder of Real Vision and a former Goldman Sachs executive, expressed his bullish stance on Solana (SOL), describing it as one of the most promising projects outside of Ethereum (ETH).\n\nAccording to a report by The Daily Hodl, Pal praised Solana’s co-founder Anatoly Yakovenko and highlighted the blockchain’s growing developer community and public awareness. Pal says Anatoly Yakovenko — commonly known as Toly — is emerging as an important thought leader in the cryptocurrency space. Pal appreciates Yakovenko’s open-minded approach, stating that he builds bridges rather than destroying them. Yakovenko’s leadership style, Pal believes, positively represents the Solana ecosystem.\n\nPal is impressed by Solana’s engaged developer community and the passion they have for building the ecosystem and its technology. He also noted that Solana has gained significant public awareness, which is a crucial factor for its growth and adoption.\n\nOn September 5, Visa (NYSE: V) announced that it was “expanding its stablecoin settlement capabilities to the high-performing Solana blockchain.”\n\nCuy Sheffield, Head of Crypto at Visa, had this to say:\n\n“By leveraging stablecoins like USDC and global blockchain networks like Solana and Ethereum, we’re helping to improve the speed of cross-border settlement and providing a modern option for our clients to easily send or receive funds from Visa’s treasury. Visa is committed to being on the forefront of digital currency and blockchain innovation and leveraging these new technologies to help improve the way we move money.”\n\nPal said:\n\n“So, why is Visa using Solana? Because it’s fast. It’s fast, and it does a good job … It’s not Ethereum. It’s different from Ethereum and even the way Toly has been talking about, ‘Could SOL be a layer-2 on ETH?,’ or ‘How do these worlds integrate?’ It just shows that for Visa to make a wrong decision is not that easy because things can be bridged, things can be interoperable …”\n\nPal believes that if digital assets are set for another market expansion in the coming years, Solana could be one of the safest bets. He sees Solana as a blockchain that has not made any significant mistakes for a long time, especially when the crypto space was going through periods of “maximum fear and hate.”\n\nWhile acknowledging Ethereum’s position as the “big daddy” of the crypto space, Pal sees Solana as the next best major story. He suggests that when looking for an altcoin that offers relative security, Solana stands out as a strong contender, making it a less risky choice compared to other options."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9yZW1lbWJlci10aGUtbWFuLXdoby1tYWRlLW1pbGxpb25zLWZyb20tZXRoZXJldW0tZXRoLWhlcy1kaXNjb3ZlcmVkLWEtbmV3LWNyeXB0by1nZW0v0gF9aHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3JlbWVtYmVyLXRoZS1tYW4td2hvLW1hZGUtbWlsbGlvbnMtZnJvbS1ldGhlcmV1bS1ldGgtaGVzLWRpc2NvdmVyZWQtYS1uZXctY3J5cHRvLWdlbS8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Remember The Man Who Made Millions from Ethereum ($ETH)? He’s Discovered a New Crypto Gem - Crypto News Flash",
        "content": "According to savvy investors, the only way to become a crypto millionaire is by investing early in high-value tokens. Crypto investors like Cooper Turley, Glauber Contessoto, and Erik Finman became millionaires by getting in on Ethereum ($ETH) in the early days. Today, smart investors looking to capture the kind of high returns only available to insiders in presale projects are shifting to a hot new token called Domini.art ($DOMI).\n\nLet’s see what experienced investors have to say about $ETH and $DOMI in Q3 2023.\n\nVisit Domini.art Presale\n\nVitalik Buterin Says the Future will be Built on Ethereum\n\nIn a recent interview with David Hoffman, the CEO and co-founder of Ethereum, Vitalik Buterin told the audience of the Permissionless DeFI event in Austin, Texas, to “keep an eye on the frontier of what’s possible with crypto tech.” Buterin said the long-term goal is to create an independent open tech stack to compete with the likes of Google, Facebook, and X.\n\nIn other news, data from IntoTheBlock (one of the best cryptocurrency analytics platforms) recently revealed that Ethereum investors have started accumulating $ETH in preparation for a possible bull run in Q4 2023. According to IntoTheBlock, over 640,000 $ETH left Binance, Coinbase, and other top crypto exchanges in September 2023.\n\nOn September 7, $ETH traded at $1,637. A week later, $ETH lost 1.09% and is trading for $1,620 on September 14. According to analysts, $ETH will record a massive surge in Q4 2023 if investors keep accumulating the token and market conditions turn positive.\n\nSavvy Investors Pick $DOMI As Top Crypto Investment\n\nDomini.art is a creative blockchain-based art marketplace created to democratize and decentralize ownership of high-end blue-chip artworks.\n\nBefore now, art investors could only own prestigious artworks by going to art exhibitions or auctions and paying the total price of the asset. This expensive art purchase process naturally created traditional barriers in the art investment space, and Domini.art is here to change the status quo.\n\nWith Domini.art, art investors can own fractionalized shares in prestigious artworks and build a robust portfolio that generates at least 7.6% ROI per annum. In addition, the platform offers art investors expert guidance, helping them create the right investment plan based on their unique goals. To simplify the art investment process, authenticated artworks are tokenized as trending NFTs and sold on the marketplace.\n\nAside from these benefits, art investors on Domini.art also enjoy priority access to new artworks, personalized recommendations, enhanced customer support, special discounts on trading fees, and so much more. The platform also runs a tiered membership status program for these benefits. What you can enjoy as an art investor on the platform depends on the amount of $DOMI tokens you own.\n\nExperienced investors say the best crypto to buy now is $DOMI. The token is in its presale beta stage and is selling for $0.0021. When all presale stages conclude, $DOMI will list on major crypto exchanges and sell for $0.0154. Early investors will get a massive 633% ROI on their investments in the next few months.\n\nFor Info about $DOMI, visit Domini.art Presale or Join the Community"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDkvMTkvd2hhbGUtZGVwb3NpdHMtNjAwMC1ldGhlcmV1bS1rcmFrZW4tY3J5cHRvLWV4Y2hhbmdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Sep 2023 07:00:00 GMT",
        "title": "Ethereum: a whale deposits 6000 ETH on the Kraken crypto-exchange - The Cryptonomist",
        "content": "Yesterday it was highlighted that an Ethereum whale deposited 6,000 ETH, the equivalent of $9.96 million, on the Kraken crypto-exchange.\n\nThe crypto transfer by a whale to cryptocurrency exchanges often indicates bearish market sentiment. Will this be the case?\n\nEthereum: the deposit of 6,000 ETH on the Kraken crypto-exchange by a whale\n\nEarlier in the day yesterday, an Ethereum whale transferred 6,000 ETH to the Kraken crypto-exchange. Reporting this to the crypto-community was Lookonchain‘s onchain analyst.\n\nA whale deposited 6,000 $ETH ($9.96M) into #Kraken 50 minutes ago.\n\n\n\nThis whale is an Ethereum ICO participant, receiving 254,908 $ETH($422.6M currently), the ETH ICO price is ~$0.31.https://t.co/f0Ob9tqPqc pic.twitter.com/n3aj96tA31 — Lookonchain (@lookonchain) September 18, 2023\n\nBasically, the whale in question would have deposited the equivalent of $9.96 million in ETH on Kraken.\n\nNot only that, Lookonchain identified that this Whale was also a participant in the Ethereum ICO. Moreover, that wallet reportedly received 254,908 ETH (the equivalent of $422.6 million today), from the Ethereum Genesis blockchain, in July 2015.\n\nUsually, when a whale makes such transactions, namely moving its large funds to crypto-exchanges, it is a symptom of bearish market sentiment.\n\nIn this case, however, there is also the fact that the 6,000 ETH deposited on Kraken, is a not-so-high proportion compared to the Ethereum whale’s total funds.\n\nEthereum: the deposit on Kraken and the crypto’s price forecast\n\nHowever, despite the likely bearish market sentiment resulting from Ethereum’s whale move, it appears that there are those who are instead predicting that the crypto’s price may experience a bull run.\n\nAnd indeed, positive predictions have recently been reported regarding the price of ETH, this is partly because a possible bull run of Bitcoin is coming with the halving 2024.\n\nBasically, looking back, Ethereum has managed to perform consistently better in terms of price precisely during crypto bull runs. In contrast, however, even during BTC bear markets, ETH seems to suffer the most.\n\nFrom early 2023 to the present, Ethereum’s price has risen 37%, counting the previous bear market that saw it fall -82%. Bitcoin, on the other hand, is already +63%.\n\nPositive assumptions about ETH’s price performance for the upcoming bull run are also based on the continued increase in blockchain usage and thus ETH adoption.\n\nAt the time of writing, the quintessential crypto for smart contracts, DeFi and NFTs, Ethereum (ETH) is worth $1645.\n\nHong Kong’s response to Vitalik Buterin\n\nStaying on the Ethereum theme, it appears that its co-founder Vitalik Buterin has challenged Hong Kong in terms of crypto regulation.\n\nDuring the Web3 Transition Summit, Buterin reportedly warned crypto projects seeking to move their operations to Hong Kong, also claiming that he does not understand how the country’s laws work.\n\nIn response to these claims, a member of the Hong Kong Legislative Council, Johnny Ng, stepped in.\n\nIn a tweet, Ng reportedly described the pattern of law issuances in the country and explained the interaction between Hong Kong and Mainland China, concluding that crypto friendly regulatory policies in Hong Kong are “very stable.”"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vaW52ZXN0b3Jza2luZy5jb20vMjAyMy8wOS8xOC9yeHItYW5hbHlzaXMtcmV2ZWFscy1ldGhlcnMtdHJ1ZS13b3J0aC0yNy1oaWdoZXItdGhhbi1tYXJrZXQtcHJpY2Uv0gFsaHR0cHM6Ly9pbnZlc3RvcnNraW5nLmNvbS8yMDIzLzA5LzE4L3J4ci1hbmFseXNpcy1yZXZlYWxzLWV0aGVycy10cnVlLXdvcnRoLTI3LWhpZ2hlci10aGFuLW1hcmtldC1wcmljZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "RxR Analysis Reveals: Ether’s True Worth 27% Higher than Market Price - Investors King Ltd",
        "content": "The first ever cryptocurrency was launched in 2009, and fourteen years later, crypto has experienced massive growth and adoption worldwide.\n\nFrom being accepted as legal tender in countries like El Salvador to being accepted as a payment method by businesses worldwide, digital currencies have proved they are here to stay and thrive. We have witnessed the boom of crypto globally, and Nigeria has not been left off the group chat.\n\nDespite the limitations of the Central Bank of Nigeria, Nigerians have been at the front line of cryptocurrency adoption in Africa , with millions of users. We all know Nigeria does not have the most stable economy, but we Nigerians have looked to crypto to give us leverage. It has helped us in many ways, from protection from inflation, currency devaluation and much more. With crypto, we can transact with anyone, anywhere in the world, without the need for middlemen, and it’s great for startups and small businesses in need of funding. All in all, crypto has been a game-changer for Nigerians, and it will only get bigger!\n\nAre you ready to hop on the crypto wave and start making money from it? It is never too late. That’s why I am here to share with you all you need to know on how to trade Ethereum in Nigeria. Keep reading to discover the benefits of trading Ethereum and exactly how to trade the popular crypto coin in Nigeria and get the most out of your investment.\n\nOverview of Ethereum\n\nIn 2015, Ethereum was released to the market by Vitalik Buterin, a young Russian programmer who saw the potential for blockchain technology beyond only crypto.\n\nWith Ethereum , developers can create decentralised applications (dApps) and smart contracts. Ethereum has its own crypto, Ether (ETH), used to pay for transactions and encourage developers to build on the platform.\n\nA brief history of Ethereum\n\nAlthough Ethereum was launched in 2015, the idea started in 2013 when Buterin wrote a whitepaper describing the concept of a blockchain platform that could be used beyond financial transactions.\n\nBut it did not stop there. In 2014, the project became quite popular as Buterin started a crowdfunding campaign to raise funds for Ethereum’s development.\n\nThe campaign was a huge success and even raised over $18 million worth of Bitcoin in only 42 days. Amazing, indeed.\n\nCurrently, Ethereum is one of the most popular blockchain platforms. It gave rise to thousands of decentralised applications, ranging from financial applications like decentralised exchanges (DEXs), stablecoins, to non-financial applications such as supply chain management and even voting systems.\n\nBenefits of Trading Ethereum in Nigeria\n\n1. Potential to Make Quick Profits:\n\nYou cannot deny that the whole point of making investments is to make a profit, which makes Ethereum a good choice. Like other crypto coins, the price of Ethereum is volatile, which means that its price can fluctuate rapidly over short periods. This makes it possible for traders to buy when the price is low and sell ETH for quick profit when it is high.\n\n2. Ability To Access a Global Market:\n\nTraditional financial markets are geographically limited, but the cryptocurrency market is global. This means that traders in Nigeria can buy Ethereum in Nigeria and also sell with anyone in the world, giving you access to a much larger market. Is Naira crashing again? Don’t worry; Ethereum has your back.\n\n3. Allows Traders To Bypass Traditional Financial Institutions:\n\nTraditional financial institutions are either inaccessible or unreliable in many parts of the world. The same is the case in Nigeria, from screaming at ATMs today to fighting for your money in the bank tomorrow. It’s a never-ending struggle.\n\nCrypto provides an alternative to these institutions, allowing you to transact directly with each other without the need for intermediaries.\n\nHow To Sell Ethereum For Cash in Nigeria\n\nIf you’re looking to sell your Ethereum in Nigeria, several options are available. One popular option is to use a crypto trading mobile app, Breet. Breet is a Nigerian-based OTC crypto trading app that allows you to convert Ethereum to naira , convert it to fiat currency and withdraw straight to your local bank account free of charge. Let me walk you through the steps of using Breet to sell Ethereum for Naira.\n\nStep 1: Download and Install Breet\n\nTo use Breet, you must first download and install the app on your mobile device. The mobile app is available for Android and iOS devices, and you can download it from the respective app stores.\n\nStep 2: Register and Verify Your Account\n\nOnce you’ve installed the app, you must create an account with Breet. To register, you’ll need to provide your name, email address, phone number, and password. You’ll also need to complete the app’s KYC (Know Your Customer) process by submitting a government-issued ID and a selfie.\n\nStep 3: Generate an Ethereum Wallet Address\n\nOnce your account is verified, you need to generate an Ethereum wallet address to receive crypto. To do this, click on ETHEREUM from the app’s dashboard. This will then open up the Ethereum trade page. Click on ‘Generate Wallet Address’. You’ll then be provided with a unique Ethereum address that you can use to transfer your Ethereum from your external wallet.\n\nStep 4: Send Ethereum To Your Wallet Address:\n\nThe Ethereum wallet address acts just like a bank account number. All you need to do is send your address to the sender or your external wallet through the multiple options available.\n\nStep 5: Sell Ethereum for Cash\n\nSend the amount of Ethereum you want to sell and select “Naira” as the currency you wish to receive. Breet will automatically calculate the amount of Naira you will receive based on the current market rate.\n\nOnce your Ethereum is sent into your Breet Ethereum wallet, you need to wait for at least three confirmations from the blockchain network. Once confirmation is complete, your transaction is tagged as successful, and your funds will reflect in your Breet Naira wallet.\n\nStep 6: Withdraw Your Naira to Your Bank Account\n\nAfter selling your Ethereum for Naira, you can withdraw your funds directly to your Naira bank account. Breet offers free and instant withdrawals to any Nigerian bank account. To withdraw your funds, select the “Withdraw” option, enter the amount you want to withdraw, and select your bank account from the list of available options. Click on “Withdraw” to complete the transaction.\n\nIf your automatic settlement feature is turned on from settings, your funds are automatically withdrawn to your provided local bank account after completing the transaction.\n\nConclusion\n\nTrading Ethereum is profitable, but it is not without risks. Using a crypto trading app like Breet can be a convenient and hassle-free way to sell your Ethereum for cash in Nigeria. With Breet, you can convert your Ethereum to Naira and withdraw your funds straight to your Naira bank account within minutes and free of charge."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lm5hbWVjb2lubmV3cy5jb20vZXRoZXJldW1zLW5ldy10ZXN0bmV0LWhvbGVza3ktZmFpbHMtdG8tbGF1bmNoL9IBT2h0dHBzOi8vd3d3Lm5hbWVjb2lubmV3cy5jb20vZXRoZXJldW1zLW5ldy10ZXN0bmV0LWhvbGVza3ktZmFpbHMtdG8tbGF1bmNoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Sep 2023 07:00:00 GMT",
        "title": "Ethereum’s new testnet Holesky fails to launch - NameCoinNews",
        "content": "Ethereum recently faced a surprising failure after failing to launch its Holesky test network. The network was set to be the celebratory launch for the Merge from last year.\n\nSome of the validators managed to launch the test network manually. However, a misconfiguration in the network’s genesis files led to the failure. Ethereum core developers revealed this information shortly after the launch mishap.\n\nSoon after the development, Ethereum postponed the launch for two weeks. The network will use the time to regroup and retest the entire plan. A developer from Ethereum talked about the issue on Twitter/X.\n\nGiven the status Ethereum boasts, missteps of such nature are quite rare. The network even concluded its massive Merge update without a hitch. Similarly, Ethereum had previously integrated the Shapella network without such issues.\n\nThe entire industry is closely monitoring Ethereum, which is the second-largest blockchain. Thus, the recent failure reflects poorly on both Ethereum and the blockchain in general.\n\nThe Holesky update was planned to replace the current Goerli testnet. However, since the launch failed, the Goerli testnet is still live for developers. Developers can test apps on the network, which is expected to stay live until Q1 2024.\n\nWith Holesky, Ethereum plans on easing several scaling troubles. The update will help developers support twice as many validators entering the network compared to the mainnet.\n\nParithosh Jayanthi, a DevOps engineer at Ethereum, stated that resurrecting the network was a choice for the network. However, Ethereum decided to start with a clean slate to ensure the network stayed around for years.\n\nDencun, the next Ethereum hard fork, relies on Holesky, so the testnet must be executed perfectly. Ethereum has confirmed that this setback does not affect the expected launch date of Dencun.\n\nThe debut was scheduled to coincide with the first anniversary of the “Merge,” the momentous occasion at which Ethereum switched to a more efficient “proof-of-stake” blockchain model in place of its previous “proof-of-work” system."
    }
]